{"Dim Sum Garden": [], "Tasty Place": [["Aaron R.", "The most underrated restaurant in Philadelphia. The sweet and sour chicken is one of the best I've ever had. The management is very nice and have never given us any problems and I've been here a lot. Also the prices are crazy low for the amount of food that's given. Don't get intimidated by the hole in the wall location."], ["Lannae L.", "The entrance is on the middle of the block with a yellow awning above saying \"Chinese Market\". Go in the door, there is a nick-knack vendor, walk by him and go down stairs. The basement is a grocery store on the left and a small dining area to the right which is Tasty Place.   This is an authentic noodle and rice shop. I got the beef chow fun. It had the good wok charry flavor, nice wide noodles and terrific aroma. This dish tasted authentic to me. It was only $6 for a big plate of food and as much tea as I could drink. All the people eating lunch with me were Chinese speaking both Mandarin and Cantonese.  The place is NOT Fancy at all but it seemed clean enough for me. I can see where non-Chinese tourist would be put off, but that is their loss."], ["Carmen K.", "You would never know this restaurant existed if you never visit the supermarket next to it, which is in this store that's pretty much half empty and looks like its under construction with a Chinese woman selling random baubles out in the front corner.Like everyone said, you need to walk into the store where you'll hit some stairs. The supermarket down there is pretty big with lots of Chinese goodies, but the restaurant is on the right with a decent amount of seating.You can't go wrong with any of the choices on the menu. They are all authentic Chinese food, super great prices with huge portions. Based on this place's appearance, it might not be a place to take to impress someone unless they're adventurous and will be wooed by your knowledge of mysterious Chinese basement restaurants. But they'll be sure to overlook that once they have their face in an awesome bowl of noodles!"], ["Sam G.", "I do believe the other reviewers when they rate this place 5 or 4 stars. However, I unfortunately cannot do the same. I'm sure their dishes are great, but the one I had was pretty awful.I had the Beef with Vegetables Over Rice ($5.50)Portions, great. Rice, Gai Lan (Chinese Broccoli), and beef. What could go wrong? The vegetables were fine. The rice was fine. The beef, oh my goodness!So one of the ingredients used when cooking Chinese dishes that has meat, is Shaoxing Wine. In this case, too much! It was as if I was eating beef dipped in wine! No no no no, no can do, sorry. Maybe it was simply because it was the chef's lunch time. I'm sure. Regardless, it tasted pretty awful. Next time though!"], ["Joanne A.", "When you get to this address, walk into the Asia Supermarket. Then you walk DOWNSTAIRS and Tasty Place is directly on your right.I walked back and forth on this street 3 times trying to find this yummy place to order take out. Oh and while I was waiting for my food to be prepared, I walked around the little grocery store and got some yummy snacks for the next day.Salt baked fried chicken = AMAZING and the Pork fried rice = Good, basic, yum!They PACK in the food. Like seriously... I ordered this for myself and then ended up giving away more than half my food when I walked back to school. AND I still had leftovers. Yes, be ready to be blown away by chinatown food."], ["Tim P.", "A walk underground that's worth it... I would have never known about this place without reading one of the recent ROTD reviews... Mention salt & pepper wings, and I'll find the place. You'll have to find the address, which is easy enough, then head downstairs to where the market is located. Tasty Place is to the right as soon as you reach the bottom of the steps. I ordered beef with bean sauce, and salt baked wings... Let me just say that for the amount that you pay, they give you enough food for two meals. The beef was tender and served with steamed broccoli and pork fried rice. Surprisingly great tasting food considering the literal in-the-corner kitchen location. It just goes to show that you can place a good cook in any location or situation, and he/she will produce a great meal. Find the address, then follow the steps down... You won't be disappointed."], ["Diana K.", "For years, I have been shopping at the underground Asian supermarket for my noodles, dumplings, and stir fry sauces. When I read Craig LaBan's review of Tasty Place - I couldn't believe it. That little hole in the wall inside the grocery store? The one that kind of smells weird? But I had to try it - and I'm so glad I did.Everything is made to order, they do not joke around! The salt baked wings are the BEST wings I have ever had - EVER! They crush David's Mai Lai Wah's Salt and Pepper Chicken Wings! They seem to have some kind of rice cracker crust and a ginger marinade, and inside is the moistest chicken you have ever tried. I'm so glad this new world has been opened for me, because I never would have tried this place otherwise. Seriously, the whole \"don't judge a book by its cover\" phrase? They were talking about this place when they came up with that!"], ["April L.", "The food is great here, I ordered the ho fun with black bean sauce; it was definitely worth the $6 I paid for it. The portion was quite generous and it had a lot of flavor in the noodles. One star off for the sketchy location, other than that, this place is a gem! I would recommend this place for authentic Cantonese cuisine, but definitely not for a date."], ["bob t.", "This is a dive and it looks like a dive.  it tastes pretty good though.  the soup of the day I think is made of left overs (like most restaurants), and looks like a porridge.  at least the day I went.  it was cheap too, and probably authentic. not a 5 star because it is cold and looks like a dive, 4 stars because it tastes pretty good and the owner (?) seems both friendly, pleasent, competent, and kind. and saw some BYOB."], ["Gary L.", "This is a textbook case of \"don't judge a book by its cover\". The restaurant is in the basement of a janky Chinese supermarket. It's hard to find if you're not a regular, and passers-by probably wouldn't even know there was a restaurant, let alone think to eat there. That being said, I've been here no fewer than 6 times in the last 2 months. My boss at work LOVES eating here, so every time we have a team lunch, Tasty Place is where we go!I've only ever eaten 3 things here- the General Tso's chicken, the salted fish and chicken fried rice, and the fish with Okra. The General Tso's chicken is what makes this place the go-to for work lunches, my boss and coworkers can't get enough of it. It's sweet and salty, very deep flavor, a bit fatty but still delicious. Just a pro tip- the darker the color, the more flavorful it'll be!The salted fish and chicken fried rice is a personal choice, as I've been eating it since I was a kid and this place does it quite well! And the fish with okra is another request from my coworkers, the fish is cooked really well and is quite tasty. The problem with that dish is that nobody would want to eat the okra, so we've recently decided to have them put Chinese broccoli on the dish instead of the okra, and suddenly it's become as popular as the General Tso's!The food is very tasty but also quite heavy, so be prepared for a food coma if you come here for lunch. The bathroom (which I've never been to, thankfully) is apparently not for the weak-hearted, and the environment would completely throw me off if I came here by myself, which is why this place only gets 4 stars. But at the end of the day, the food is cheap and tasty, so I'll definitely be coming back in the future!"], ["Craig K.", "Wish I could eat their chicken wings every day!  So good!!!!   Get take out, as the restaurant itself is NOT for the faint of heart."], ["JJ L.", "Small joint, near grocery market in an underground floor. I've been here eversince I was a little kid with my aunties. I always came here for the beef or chicken sautéed hau fun flat noodles. They were and still are very delicious. Now the only thing is I used to feel hesitant around the owner to order because I'm Chinese and felt I should have to communicate in our language...or it looks shameful. But that's no big deal because no matter what the owner was always nice to me and the food was always delicious."], ["Steven B.", "Tasty Place is a perfect moniker.  It isn't elegant, it isn't easy to find, it isn't even really a defined restaurant.  But damn is it Tasty.  Located through some flea market style stalls down a staircase toward a downstairs Asian Grocery store, Tasty Place is more of a grouping of tables in an alcove.  It is one of those places where you see the only server and are seated amidst the papergood storage.  This makes this whole in the wall an epic find.  Beyond traditional American Chinese staples that are better than whatever your \"local\" Chinese takeout is peddling, this has a deep and VERY inexpensive menu from Salt Baked Whatever to Questionable Fish with Okra.  Whatever you choose is the most delicious item until your next dish arrives.  Does this not excite you?  Are you afraid of eating here because you are sitting between the supermarket elevator and to go boxes?  Poor choice because it some of the best food in Chinatown."], ["Stephanie S.", "I tried the salt baked chicken wings, which had excellent flavor and crispiness.  Unfortunately, I found that the meat was pink after a few bites :( I also tried their fried rice, which was decent.  I think you get a good bang for your buck and the flavors were good enough to try it again."], ["Jack N.", "The bathroom here is the closest thing to death. If you want to play a prank on your friend, tell them to use the bathroom... however, they might come out a changed person. On the other hand, I didn't come to this place to use the bathroom, I came here to eat. The food here is decent at such a low price. The ladies who work at this place for many years are always nice and quick. Nice low key spot in Chinatown to just chill and chat away."], ["Susan L.", "Purely based on the food, and not the atmosphere and the bathrooms (shudder), its 5 stars hands down. For a place like this, you should really only consider the food when you're reviewing because you are in a basement Chinese supermarket after all. But if you HAVE to go to the bathroom like I did, bring toilet paper. Anyway, the place isn't as dingy and shady looking as people make it out to be, but then again, maybe Tasty Place owners spruced it up a bit when they started getting more customers. Going off of the a Yelper's advice, we ordered a plate of the Salt Baked Chicken Wings (the waitress finished saying the order for me, nodding in that way of \"Oh yes, dahling, I know\") and an item that was off the menu \"Dai Pang Chow Mai\" (thanks to Paul L!), which was thin stir fried noodles with eggs, squid, shrimp, and bits of barbeque pork. The food came out fairly quickly and both dishes hit the spot. Its going to be hard for me to order anything else next time because these two dishes were so good. The wings were perfectly crispy and just salty enough. I couldn't stop eating them. The Dai Pang Chow Mai was light and flavorful, sweet and tangy. The bill came out to $16.50 no tax which is quite alright in my book. Despite this place's cheesy name, they are right on the mark."], ["Luke M.", "My Grandfather introduced me to this hidden treasure. Best chinese food I've had in my nearly 23 years on the planet. Every dish  is great but I recommend the pan fried and ho fun noodles. The prices and portions are incredible. $7 will buy food for 2. Disclaimer: atmosphere is authentic Chinese market- plenty of interesting sights and smells. The woman who runs the place is so helpful and friendly. Great service. Also the Chinese market the place is attached to has a huge selection of great asian foods."], ["Ryan S.", "This place is a little hidden. You have to walk down some steps to find it. But it has pretty good food not great. If you asked me if I would go back I would say yes. But I wouldn't make in my top 20 places to eat or get take out. But it was ok. Prices were pretty good. So if you feel up to it try this place out."], ["Max P.", "The name of this restaurant is accurate - it is tasty and it is a place. It's a weird place, but it's a good place. Go to it."], ["Mihiri w.", "I heard about tastyplace from a coworker. And I knew I had to go after hearing about these magical saltbaked wings. Let me be perfectly honest this is not exactly a nice place or even very appealing but I could care less. If you aren't interested in a food adventure this is not the place for you! We ordered the saltbaked wings - amazing, so juicy and tender and crispy exterior with yummy umami flavor. The beef chow fun which was so yummy! The thick noodles were perfectly cooked and the beef was tender and not too chewy. We also ordered the tai/ dai pang chow Mai . Thin rice noodles with BBQ pork, squid, and sour cabbage. It was light and filling. The combination of flavors was surprisingly good. You have to try this place. It's really good food for like $8 per person. I can't wait to go back for those wings!"], ["Chau K.", "They never disappoint and this is a go to place for cheap eats. I recommend their (dry) beef and broccoli ho fun and egg plant w/ garlic sauce!"], ["Carol C.", "Don't let the location (basement....) or the looks (pretty dang dirty) scare you away from this place! The first time I ever saw this restaurant I was inside the supermarket and thought to myself, \"Why would anyone risk their health to eat here?\" A few weeks later, my friend told me about an awesome cheap hole in the wall place, and behold, there I was sitting in the same place I thought I never would try. But good thing I went because the food was legit! We had roast duck and pork, singapore noodles, soup of the day, salt baked wings, and sweet and sour fish. Salt baked wings were WAY too salty for my taste, but the pork and duck plate was definitely worth the 6 bucks, and singapore noodles were on point. You definitely are getting more than what you're paying! Soup of the day was 75 cents! Yes you read that correctly - CENTS! So why the four stars instead of 5? No matter how cheap the food is, i'd prefer not to be eating it with the view of dead fish, frogs, and turtles from the supermarket within view of my plate of food."], ["Alice T.", "The food here taste amazing. I ordered the Singapore noodle for only $6.00 and it came in big portion"], ["Tony W.", "If you can't find it you are not alone. Find the address, walk past the man that doesn't even know it's in the basement and head down. It's a little restaurant in a scary basement Chinese grocery.This place, as good as it is should not be the highest rated Chinese place in Chinatown. If you walk down to the corner of Race and 11th the place there that I reviewed is much better and I haven't had a chance to investigate the rest. This shows the flaw with Yelp. That said if you want a great meal at a great price head down the basement.The good:Young Chow Fried RiceSalt Baked Chicken WingsThe Prices are VERY reasonableFriendly serviceNot so goodAtmosphere non existant. Not a date place unless shes really coolTried the Dai Pang Chow Mai and it's basically a pasta dish no sauce to speak of kind of boringThe dumplings were deep fried and didn't stay crispy very long. Meat inside underwhelming.I would not want to need to use the bathroom here.Edit: Some kids came in and sat beside me. They ordered the typical general chicken and chicken fried rice. The one kids said he had his masters degree he could not be more than 21 years old. No substitute for StreetSmarts."], ["Jason I.", "Hard to find little dive restaurant tucked in the corner of a dingy Asian supermarket in the basement. Don't let that description scare you away though... the food is very good. 3  of us split 4 dishes, and had some left over to take home, and it set us back only $28. The salt baked wings were good, but didn't blow me away like I expected them to based on other reviews. They were good though. The home run, in my opinion was the Beef Stir Fried Ho Fun. I had no idea what this was when I ordered it, but beef stir fry sounded good... I rolled the dice with the \"Ho Fun\" part, and won. This was awesome! Also had a couple other dishes that I can't recall the names of, but everything was excellent and portions were huge, plus you simply can't beat the price.One small tip... Go to the restroom somewhere else before you get here. If you go in their restrooms before you eat, you will lose your appetite. Otherwise, by all means try this place!"], ["Rich B.", "What can I say that hasn't already been said? This Tasty Place is indeed tasty. After many times perusing the menu when in the Asia Supermarket finally decided to try it. It was Father's Day & had some friends in from Australia. Wanted dim sum @ Joy Tsin Lau(next door) but line was too long. Went downstairs to market to buy Chinese soap and remembered there was a restaurant there.Sat down & immediately were bought a pot of tea & Styrofoam cups.Following Craig La Ban's advice we ordered Fish w/ chinese okra(a veg I never heard of before, but was delicious; actually is a loofa!) Seafood Fried rice, Sate Beef Ho Fun, and whilst deciding what soup our waitress suggested Seafood & Tofu soup.  We ordered that & she said \"that's enough\" which gave us a chuckle. Food came out amazingly fast; soup in like 5 minutes and entrees 5 minutes later. Soup was amazing in its deliciousness & simplicity.  I ate 3 bowls and we still couldn't finish it. Fish (flounder) was breaded and fried and went well with the chinese okra & delicate sauce. Fried rice was basic, but had that great flavor & texture you want. The Sate beef ho fun was great as well, got it dry as opposed to sauced and my only complaint was lack of heat(none at all) when it was noted as hot on the menu.Noodles were great consistency & the beef was tender.Service was good. Received wrong dish, squid instead of fish w/ okra and waitress corrected it after saying some unkind words in Chinese to other one who took the order.This is basic Cantonese fair, done extremely well, with a few Szechuan dishes. Tried the Chicken w/eggplant in Garlic sauce on a return visit which was incredible! If they do use msg, I don't think it's much because I am sensitive to it, but did not get a bad reaction.Do not let the surroundings fool you; the food is delicious, fast, abundant, and the prices are cheap. Three of us ate for under $30 and I took home enough for another meal. I plan on frequenting this place and trying the salt- baked chicken wings next. Tax is included in price. Cash only."], ["Tait N.", "Great food, not for the faint of heart. If you can ignore that it's in a basement grocery store, go for it, it's worth it. Service is pretty good, friendly and they speak decent English (don't expect to be understood perfectly, but they try hard). Noodles are very good, excellent texture and flavor - a must I'd you are a noodle fan. Salt baked wings are very good as everyone says.Plates are big, we got enough for 4, there were 2 of us, it was just over $20."], ["Tina N.", "It's a hole in the wall and this place is so hidden, but the food is so good and authentic! And every food item there is so cheap! What I would recommend: can't go wrong with any of the dumpling noodle soup (the soup is definitely for you if you dont like too much msg or salt); beef ho fun soup, Ginger and Scallion Stir Fried Soft Noodle, singapore noodles, chicken fried rice, stir fried ho fun, and my FAVORITE: filet fish with tofu with rice (make sure u tell them firm tofu, not soft tofu)"], ["Jamie S.", "Through a door, passed a jewelry counter, down the stairs, and to the right of the grocery store is Tasty Place- serving cheap Chinese food. If you require a white table cloth to accompany your dining experience, this is probably not the place for you.Their Beef Chow Fun is superior to others I have had. The noodles do that melt in your mouth thing that the average Chinese joint doesn't often get right. Chow fun has  a tendency to be greasy, but here they manage to make it full of flavor without the greasiness. On the menu this dish is listed as Beef Stir Fried Ho Fun, ho fun being the name of the wide noodles. $5 gets you a whole styrofoam container. I also went a dish that consisted of a few Chinese standard components- Roast Duck & Pork with Green Vegetables and rice. ($5.50) While the vegetables and duck good in a regular sort of way, the pork was rather exceptional.  The thick slices were a touch sweet and a tad salty, with no fat or tough pieces- in other words, perfection."], ["AJ A.", "Now that's authentic Chinese food!! Found another gem in philly with the help of my colleagues!!! Great stuff and staff! Great price for a huge meal! Make sure to try the Garlic chicken wings! It's to die for!"], ["Rebecca G.", "Cha Cha Tang!"], ["Stephanie S.", "This place is a gem. Although it may be a bit hard to find, it's worth it when you get there. The food is delicious and inexpensive, which is a pretty good combination. I recommend the salt-baked squids (calamari), they are crispy on the exterior but the inside is soft, not to mention it's garnished with salt and jalapeño. I also recommend the beef with kai-lan and sweet and sour fish. One thing to be wary of is the bathroom, which can be improved, but it still doesn't detract from the food."], ["Paul L.", "I think by reading the other reviews, you'd already get a sense on what this is. This is a good down-to-earth (pun happenstanced), authentic, Chinese street vendor-y restaurant. Located down in the basement market as an alcove of Asia Supermarket, it's a dingy place that most people would avoid dining at, but they would have missed out. Yeah, I was one of those people who looked down upon this Chinatown establishment, thinking I would probably have stomach cramps after eating here without closely examine the place. They actually keep this place relatively clean. There's no decor to speak of other than a Chinese calendar here and a picture there, but they did install a few giant fans just to make sure their customer can be comfortable in hot weathers. This place specialize is stir fried noodles. The beef chow fun is probably one of the most authentic thing you can find in the entire Chinatown. My favorite item is not even on their menu but you can ask by name is the \"Dai Pang Chow Mai\" or Stir-Fried Rice Vermicelli Dai Pang style. It's thin rice noodles, stir-fried with eggs, shrimps, barbecue pork, pickled vegetables. It has a wonderful balance between salty, tangy goodness with silky textures from the noodles. It's well worth the $8, especially the portion is in abundance.The dishes here are generally cheap and big portioned. My recommendation is to come here and order take out. They are real fast and then you can just enjoy these delicious food in the comfort of your own home."], ["Angelina K.", "I Love this place! Diamond in the rough   .. cHeap and delicious food.One of my fave place to eat ;) i have been coming here sine I was like 10 years Old .....Love it"], ["Jan K.", "After reading many reviews (including) the Craig LaBan year end recap, I decided to try this place. As everyone raved about the salt wings and dumplings, those were the chosen apps.  I went for duck and roast pork with green veggie (rice platter.)  19 &20 year old daughter and son who are adventuresome at Han Dynasty, but wary of other places went with Sweet and Sour and General Tso's chix respectively.Fried dumpling came out first, steaming hot.  A little oily, but hey .. they're fried..  Very tasty. Next came my dish, and quite a bit later, the wings.  Kid's entree's were timed pretty far off, but they were happy munching the slightly salty almost tempura (but not as crisp) wings, served so hot we had to slow down a little.Hot tea was provided along with styrofoam cups, as was water when requested. Service was quick (very), but polite and our English was easily understood.Sweet and Sour chicken, as indicated elsewhere was a stunning version of a tired classic \"Americanized\" dish.  Tender, moist breaded breast, drizzled but not drenched in a sweet and vinegary sauce.  The General Tso's on the other hand, was VERY garlicky and had a lot of sort of sour brown sauce.  The chicken was chewy thigh meat, and the breading soggy.   One dish to avoid.My duck and pork served with tender bok choy atop a huge mound of white rice was un-sauced.  The pork was delicious loin dusted with five spice.  The duck, what little was actaully consumable was quite good, but one the bones were removed, I suspect the actual skin and meat would have filled a tablespoon.  For five bucks and change, though, I'm not complaining.Son did not finish his General Tso's so I ordered another round of dumplings (six large to an order) for the ride home.  Bill came to $41 before tip (after being whacked 15 to park.) I suppose if you drove around long enough you could get street parking, but it IS Chinatown, right?I will definitely go back, but thinkI would stick with the wok-noodle dishes next time.  That could raise this rating to a four.  Atmosphere ,,, Let's get real.  I came here to eat, not pee.  I don;t care if they HAVE  a restroom,  In in a basement supermarket in Chinatown.  Anyone expecting the Four Seasons restroom attendant to meet them has unrealistically high expectations.  Worth a shot, but avoid the \"Americanized classics.\"  Save those for Pei Wei or something."], ["Zachary H.", "I could go on about the authenticity of this place, the justice it does to \"Cantonese wokery\" as Craig LaBan (rightfully) did. But enough people have slept in that bed. I will put my food credentials in jeopardy and go the opposite route: This is in defense of the sweet and sour chicken ($8.50), if only at Tasty Place.Yes, the Chinese mock us for our very 'Muricization spin on it. And our own cultural elites deride us and fumigate us with a dizzying heap of scorn: \"You know they don't eat this in China, right?\" they'll ask us, which inevitably leads to \"You don't know how to use chop sitcks?\" and \"Can you stop saying 'me so horny' every time we come here, Zac?\" Smug PC police, I tell you.This is not your hours-old, mall food court variety of sweet and sour chicken that's carelessly ladled into an equally lifeless styrofoam container. Not here. Here is a sanctuary for judgment-free bites of golden nuggets fried to a smokey blister. Here, a flaky shell of awesome envelopes the chicken and breading. The sauce is served on the side (when ordering to go) so you can adequately drizzle the sauce over the dish in way that covers it with more of a morning dew than flash flood of high fructose corn syrup. And they say there's no delicacy in this dish... It also takes 15 minutes to prepare from scratch, which is plenty of time for you to get over any preconceived notions.The rest of the menu borders on good to amazing, especially for a place that allows cigarette smoking and MSG in its kitchen. Salt baked chicken wings ($8.50), any of the ho fun dishes (heh! Also: $5.50 - $6.50), and positively anything with char siu (Chinese BBQ pork, basically) are worth some of your first considerations. And yeah, they really do smoke in the kitchen. Try it anyway."], ["Enid C.", "This place is literally a hole in a wall. Walk downstairs to the underground Asia Supermarket, past the display of pig heads on ice, past the freshly gutted fish, past the mountains of Asian snack foods, and you will find a delicious smell. Follow it. As soon as you sit down, order the salt baked chicken wings (they can take a while, and they burst at the seams with MSG, but it is so freakin' worth it). You can order the rest later. You're probably safe ordering just about anything else off the menu. The rice dishes and noodle soups are all solid, and it's hard to find food of this caliber for dirt cheap.I typically have a rule of thumb for Chinese restaurants like these. The quality and authenticity of the food is directly proportional to how dirty the bathroom is. In this case, that property still holds."], ["Linh Q.", "This is one of my favorite Place in Chinatown when it comes to beef stir fried noodles and seafood pan fried noodles. I've been coming to this place for like 23 + yrs. although the portion is a bit smaller than it used to be but still very reasonable priced. Most of their dishes range from $5 - $7. This is one of those hole in the wall place. It's so hidden because it's located downstairs in the basement next to a supermarket. I normally order to go coz I don't enjoy eating underground where I can't see natural sunlight during the daytime."], ["Brian K.", "I don't generally review anything, but Tasty Place is too damn good not to review. Good sized portions, tastes great, friendly service and for me, it's damn close to my office. Three of us split 4 dishes until we were stuffed and it only cost $22! We had a pork dish, a shrimp dish, a chicken dish and a beef dish.If you like chinese you need to go here. If you don't like chinese, but like to save money, then you should still go here. Basically go here."], ["Will P.", "Found it, checked out the place and the market, it was just too iky to stay...sorry."], ["Dan F.", "Unlike your ordinary neighborhood Chinese restaurant, this place offers any Chinese food you can think of, even if it's not available on the menu.The chicken wings that they have is not like American chicken wings, they make it  crispy and tasty.My favorite dish that's not available in the menu is the steamed whole fish with ginger sauce. The server lady will guide you to the fish market to select which fish do you like.I know the restroom is really smelly and nasty, but what can you expect for a public restroom."], ["Greg S.", "The atmosphere isn't great, but it's fine.  I've been to the Chinese market before, so i knew what to expect. I ordered wonton soup and general tsos chicken.  The soup was great, but the chicken was not so good.  The general tsos sauce was different with huge chunks of jalapeño and garlic, I didn't care for it."], ["Steve M.", "Must order the salt baked wings! Been eating here since my high school days (early 1990s).  One of best hole in the wall restaurants in philadelphia.  check out the most recent article about it by food critic craig labanphilly.com/philly/column…"], ["Jackson P.", "When trust fund babies, hipsters, and other knuckleheads in Manhattan pay 150 a head for Korean fried chicken, this is what they think they're getting.  Be warned, this is not a spectator sport.   You need to mix your own sauce.  Take a little soy and a little of the fermented red wine vinegar, stir in the Sriracha, and voile, the best Asian fry  this side of the Little Red Book."], ["love n.", "Ho Fun was my dinner tonight.  Yummy food.  Not the best in Chinatown but good for the price.  Many items are $7-8, a solid value."], ["Vernon D.", "I always wondered what the food would be like from a restaurant adjacent ( Immediately Adjacent) to a chinese grocer would be like. So 2 years ago, i gave it a try, this place wasn't even on the yelp map yet, and i was sitting enjoying my customary Beef with Bitter Melon over rice, or shredded pork ho fun, or just about anything on this delightfully simple and well delivered menu. With most entrees weighing in on a circa 6 dollar hit to the wallet, why not try it. The service is always friendly, in fact the lovely mistress of tummy delight knows im certain to order something with bitter melon. Be armed with cash, and when she asks for an extra dollar its just to hand you back a fiver instead of a handful of ones."], ["Sal W.", "Good noodle dish. Had the shrimp fun ho noodle dish (fat noodles) and this is what Chinese food should taste like. There was a little grittiness in the meal, so that was a little concern for cleanliness, but overall tasty indeed. Good portion size for $6.50 tax included. CASH ONLY. The restaurant itself is a complete dive and was quite warm, so I decided to go the takeout route.Food Quality/Taste = 4 StarsPortion Size Given Price = 4 StarsPrice = 4 StarsService = N/AExperience with Staff = 4 StarsDecor = 0 Star"], ["Kira B.", "The BEST chinese food I've ever had. The salt and pepper wings are the best thing on the menu. I also had the chicken eggplant with garlic sauce and it's my new go to. I think having chinese food and not having it here is just a waste of money because not only is this place great it is also very cheap."], ["Jim H.", "I am angry at myself for not having eaten here before, even though I've known about this place for years.  Finally went today and had the shredded pork and picked cabbage soup.  Lots of big pieces of fatty roast pork, very nice pickles, fresh gai lan, and an unexpected bonus:  sliced black mushrooms!  Really good.I don't understand why people feel the need to say it's lacking in atmosphere and grungy.  It didn't seem dirty to me, and it was an extremely pleasant place to eat lunch on a Saturday afternoon.  The people shopping at the grocery store and coming in and out and hanging around give it a very lively atmosphere.The woman who waited on me (who must be the same woman mentioned in other reviews) was very good at her job.  The perfect combination of efficient and friendly.  Brusque and pleasant.  She told me to take my time when she brought me the check.  I am so happy to come across staff in restaurants who are obviously in the right job.And I've seen MUCH worse bathrooms.  Sure, they're a little dirty.  But the toilet worked and there was soap and a hand dryer.  I can't ask for much more than that.I can't wait to go back to this place and try some other things."], ["Yohann S.", "One of few best Chinese restaurant in Chinatown. Super friendly, super fast, super tasty, and super cheap! It is located next to Joy Tsin Lau. You will see underground path to Chinese supermarket.. go straight ahead and you will find this place.Not too much seat available. Extremely dirty bathroom. I entered the bathroom like years ago.. never wanted to go back ever since. Not easy to find parking spot.Other than those down sides, you'll have a blast!Here are some suggestions for you to try: Salt Pepper Squid, Black Pepper Beef, Egg fuyong, General Tso Tofu, Fillet with tofu (forgot what's the official name for it), Chicken/Beef with sweet and sour sauce (again forgot the official name for it), Seafood Lo Mein.Me and family went there last Saturday. Ordered about 4 dishes and the bill came out for $32 include tax. I believe the white rice and tea are free! They didn't charge us for it.One last thing, the place close at 8pm. So get there early, since you need time to find parking spot and the Chinatown traffic jam."], ["Danny S.", "This place is located in an underground small market, so it may be hard to find and the place is dingy/dirty looking. So don't expect a great atmosphere.But the food? DELICIOUSNESS! It's very cheap and you get a huge amount of food. It can be a little too oily, but that seems to vary based on the chef or dish.I don't think I've ever spent more than $10 here and I have always left full and satisfied with my meal."], ["Young Y.", "Great food, cheap, and a must-try for Philly locals. So the environment isn't the best. It's in the backend of a supermarket. The bathroom is horrible, and the sitting area isn't the best. BUT, the food makes up for it.It has a lot of different Chinese dishes for a good price-point. Most of the times I spend around $5-8 here for a whole bunch of food. The only food that I don't like here is the pan fried dumplings. Their salty fried chicken wings are pretty amazing. It's full of favor and the meat is really tender (although I don't think it's healthy for you). I usually eat the beef chow fun, but their rice dishes are good as well. The service is decent for a place like this. The lady is nice and always on her toes. Food takes some time to come compared to other places, but it's not too bad of a wait. A lot of people do take-out here, but just know that if you do take-out, you might wait longer than you want to. Great place for locals. If you have visitors in Philly, I'd...stay away from here until they've tried out other places and they're ready to check out local secrets!"], ["Jennie H.", "If you're looking for a quick, cheap, and good-tasting food... you'll probably have to look harder because you won't find it on the surface of Chinatown.  Actually, you'll have to look below it since it's located in a dingy underground next to a so-called \"supermarket.\"This place does live up to its name... and it is quite \"tasty.\" My usual order is Beef Chow Fun. For $5, they offer generous portions. The only downside is that it can be a bit too oily.  It's probably one of very few places in Chinatown where the service is friendly... and that's RARE!"], ["C K.", "In a downstairs grocery store - the ambiance is nothing to speak of, but they get your food out quickly. All of the dishes were quite good, but the standout was the baked salt wings. Great place to grab a bite to eat after work (lots of people seem to do this) or for takeout. Not really a dining experience, though."], ["Neka T.", "Well add me to the list as a fan. The salt baked wings were great along with the shrimp fried rice. Very good food, good portions and flavors. It definitely is a dumpy, hole in the wall that you would never knew existed. But now that I know they are there I wont be getting Chinese from anywhere else."], ["j h.", "I really miss eating there. But last Saturday when I walked into the grocery store, I saw a man smoking a cigarette IN the kitchen while he was chopping fresh meat and the whole place reeked of smoke. This is not the first time I have seen this! Cigarette smoke makes me ill and I certainly don't want to eat anywhere where people are smoking cigarettes over the food! They have \"No Smoking\" signs posted but they are meaningless. Although I also used to enjoy shopping in this basement market for certain items, I hate coming here now because I have to run out really fast because of the bad smell of smoke. Extremely disappointed. By the way it's actually a health code violation to smoke cigarettes in the kitchen, period, one of the reasons being that the smoker must continually touch their mouth to adjust the cigarette while they are preparing the food. DISGUSTING."], ["Bruce B.", "3 Stars overall, 5 stars for the low, low prices. I went to Tasty Place today for lunch after not eating here for a few years. My funds were low after the holidays got finished with me, so I was thinking \"where do you go when you're hungry and short on dough?\" I know, that little hole in the wall spot underneath the parking lot on 11th and Race. I was at The Reading Terminal which was too crowded for me and walked a block down and descended into the underground Chinese Mall. It was cold today so i started with some Egg Drop Soup. It wasn't anything special, just hot and flavorful and hit the spot. Next I had some stir-fryed String Beans with Garlic and Powdered Shrimp in a dry saute. They were crunchy and tangy and believe it or not-not too greasy. I top it off with an order of Chicken and Vegetable Lo Mein. That was a little greasy, but the noodles slid down nice and easy. I had a nice, filling meal there. The price?: $7.65 How I felt?: priceless!"], ["Tano S.", "salt baked wings! THAT IS ALL"], ["Wing M.", "Okay, first of all, this place is in a basement between a supermarket and its restroom and elevators. It's dingy, it's kind of stuffy, and dim. You do not want to come here during the summer.Once you get beyond that it is simply one of the amazing places I've ever been to.The most important thing in Cantonese cooking is \"wok hee\", or breath of the wok. It basically means that the wok is heated to an extremely high temperature and the food is cooked quickly and deftly over it and the flavor of the wok itself is transferred into the food---kind of a Chinese equivalent of an experienced Southern grandma cooking with a flavorful, family heirloom cast iron pan. This is really the only place I've found in Philly (possibly along the Philly/NYC stretch) that captures that cooking method/skill. The skill of the chef at Tasty Place almost matches the classic, outdoors cooking of the bygone era of 70s and 80s Hong Kong cuisine. Basically, everything that comes out of his wok tastes great. It's greasy, because that's how it's supposed to be, and it's wonderful.The service here is awesome. The lady who runs the place is very, very nice and usually manages to deal with multiple take out orders, five to seven tables during lunch hour and her two kids at the same time without breaking a sweat---impressive considering that there is a very, very hot flame or two just a few yards behind the cash register. I really recommend this place since it is definitely my favorite Chinese place in Philly and I usually try to go here every time I visit the city."], ["Darlene S.", "It's a small little restaurant attached to an underground supermarket.The food tastes good to me, despite the fact that its so greasy.. I love their ho fun, roast pork fried rice & pan fried dumplings.What I don't like is their attitude/service.Once, my friend and I were eating there and we got up to leave, the bill was $13 ? We paid and left, and the lady called us back, and said we were short by a dollar, and I remember correctly that I paid exactly $13, but whatever so I gave her another dollar. Then we started to walk away again, but this time she stuck out her hand and said \"Tip.\" and I was thinking \"wtf\" in my mind, I could have just walked away but i just grabbed some pocket change and left it in her hand and walked away."]], "Han Dynasty": [], "Ting Wong Restaurant": [["Isabel C.", "Could give no star if I could. Congee was way overcooked and tasted watered down. Ordered a small dish of vegetables and charged us 15 dollars. Unfriendly hostile environment with constant pressure to order more."], ["Rich B.", "Love this place! First time we went (On a Monday an hour before closing + they are closed on Tuesday) they were out of a few things; like duck. We wanted a Fish Filet Hot Pot and waiter had to check. He walked out the door (to see if he could get another fish I presume) and came back and said we don't have enough fish for a whole dish, but could add some tofu. It was great; as was the Roast Pork app (not a real pork fan, but  have come to the conclusion I prefer Asian roast pork over regular pulled pork), and steamed veg  w/ oyster sauce. Simple, but delicious. The Pan fried noodles w/ Seafood was good. And was the wonton soup is excellent!Not crazy about the egg noodles they use. I would recommend  ordering the flat noodles in your soup( you get a choice of egg, flat, or rice vermicelli) Their wonton soup topped with roast duck (which I tried on 2nd visit) w/ the flat rice noodles is fantastic!They have ducks, pigs, chickens and stuff hanging up as you walk in. You can watch them assemble soups and congee and such in the front; stir frys and such are made in the back. The dude who runs the counter is fast & efficient. This place is no frills. food is cheap and plentiful and comes out quick. My last visit ( Saturday around 1 p.m found the place extremely busy) only had me waiting about 15 minutes for my to go order.Highly recommended."], ["Jo L.", "Still the favorite place in Chinatown & to eat in general. The food comes out quickly & steaming hot. And the service is also fast, friendly & efficient.We had the tofu & swai fish pot that I mentioned last time pronounced: \"ban lam bow\". Came out so hot & real crunchy.My brother had the 1000 year old egg congee that came out in a medium size looking bowl but he said it is actually never ending when you're eating it.We also had the thick pan fried beef noodles that we just perfect. Not too salty or hard.This place is also good for take out & big orders for parties which is what we've been doing. The prices are great too."], ["Your M.", "On a suggestion from a coworker we came here. The  recommended Roasted Pork Noodle Soup with thin egg noodle was fantastic. Highly recommend getting it!"], ["T Y.", "Just reopened after renovations. Looks nicer but ambience is not what this is about. Food is as great as ever as are prices. Chinese comfort food. Fish slices in congee was so delicious, not fishy smell, just fresh slices of meaty fish fillets in flavored rice porridge and hint of ginger and green onions. I also ordered shrimp cheun fun, steamed cannelloni but rice flour pasta so delicate that it's like a veil. Stuffed with whole shrimp and served with a aromatic soy sauce topping. Hit the spot on a rainy day"], ["Jarred B.", "Was recommended to this place by a friend and was not disappointed!  Out of all the noodle soup restaurants in China Town this is by far my favorite.  The roast pork is probably the best I have ever had.  For the price you get a ton of food and the people were friendly and very attentive.  Definitely will be my regular spot when I am in Philly"], ["Xin W.", "Poor service. The waiter would not even answer you when there were only 3 customers in the restaurant. waited 20 minutes for the check."], ["Michael M.", "Congee is the best and only under $5.  Only one thing I don't like is dirty floor, and chairs .That all add up to uncomfortable to order more to eat."], ["David L.", "Good locationGood foodService is ok Only parking ( parking in the lot is $15 on weekend )"], ["Yen-Yen G.", "Ting Wong is a hole in the wall kinda place that serves delicious, simple Chinese food at a dirt cheap price. Is this the kind of place you would have a business meeting? No. This is the kind of place you go to skeky to enjoy food and escape the pretentiousness and deceiving flair of pricier, less yummy restaurants."], ["Mary M.", "Not too far from the Welcome Archway on 10th Street is this small restaurant that serves delicious and satisfying noodle soups. They are reasonably priced and you get a good portion of toppings. The place is bright and clean. I will definitely make this place my go to for a hot and satisfying bowl of noodle soup in Chinatown. They only take CASH!"], ["Chloe Z.", "This is a must-come place in Philly, with very traditional Cantonese food served. They've been recently refurbished with everything inside and everywhere looks clean and nice. Loved it!"], ["Mandy L.", "Prices are very good. The food is good also. 3 people can eat there for under $30! Good place for casual family dinner. I would recommend getting anything with duck. One plate of food will definitely fill you up."], ["mike v.", "Some Ting Wong.  Not a fan of this place.  Sang Kee is a way better.  The first time I tried Sang Kee, I couldn't stop thinking about it for weeks.  Here, I didn't even finish half of my dish and I wanted to leave.  We tried 3 platters here and none of them wowed me at all.  The meat was VERY bony and the food was very bland.  If you like your food with eyeballs and octopus suction cups you will like this place...Contrary to many reviews, the staff was very friendly."], ["Lemon L.", "the soup is spoiled and the tomato beef rice has no flavor at all.also last time i ordered wonton noodle soup, the noodle had too strong chemical smell!!!!cant bear this!not customer concerned place!!!差评！"], ["Jacob T.", "After reading LaBan's Chinatown restaurant run-down, Ting Wong struck me a the first establishment I needed to visit. A simple, inexpensive, low-décor, duck house--how could this not be first on the list?My girlfriend and I visited on a Monday evening and left smiling. Upon entering we were greeted by our server and seated in one of the restaurant's small pick of tables. We shared the Duck Wonton Soup, Roast Pig, and Beef Chow Fun with Black Bean Sauce. All classic and delicious.The Roast Pig, in particular, was the pick of the lot. Succulent, boneless pork surrounded by a skin crispier and more flavorful than a plate of cracklins. Their menu is expansive but Ting Wong seems to do soup, duck, and pork the best. A simple glance at their front-of-house kitchen (lined with roast ducks, pork belly, vats of meat broth, ribs, and more) quickly confirms this hypothesis. One interesting note from the LaBan article--the Chicken Wonton Soup is supposed to be excellent. Apparently Ting Wong, everyday, gets fresh, live chickens from the local poultry shop to make their soup. And while the Duck Soup was great, the prospect of FRESH chicken (as in living that same day) is too good to pass up. It will be the first thing I order on my next visit.All that said, at Ting Wong, if you stick to the basics I don't think you can go wrong. Highly recommended for the unpretentious."], ["Sam G.", "If you see my photo, the portions can be very large. I got the chicken lo mein. Service was very quick, although that can be attributed to a relaxed day - there were about 6 other customers with me in the restaurant. It's really nice to see that they have tables of all difference sizes, for 2, for 4, for 8. I didn't feel bad about eating alone (although it was a bit sad, to be honest).The layout of the restaurant is exactly that of M Kee. As in, the location of the kitchen, seating, etc. Quite eerie, but I think it works well. There is enough walking room so that the waiters don't have to play tetris to reach their respective tables.The meal was fine. I was served with water as soon as I came in. As mentioned, the portion was large. Was not expecting that, especially for $6. A bit salty, and I'm sure more than enough sodium for a day's worth. Regardless, good bang-for-my-buck. Came out satisfied.They also don't charge tax, and their payment system wasn't conducive for smooth tipping (when you're done with the meal they give you a receipt and you go to the front near the entrance to pay.P.S. very cheap congee!"], ["Susan P.", "Ting Wong used to be my go to restaurant in Chinatown.  I would go there at least twice a week and they always knew my order before the words came out of my mouth.  They always got my order correct and I was in and out in a  very timely fashion.  The food tasted wonderful and the portion sizes were plenty.  When Ting Wong reopened, after a much needed renovation, I was beyond excited.  Unfortunately, my experience was very disappointing.  The service was slow, unfriendly and they got my order wrong even after I repeated myself several times.  The person taking orders was very unorganized and seemed not able to handle the stress of the lunch hour. Once getting back to my office, I was hoping for the comforting food that I have had time and time again from Ting Wong.  The portion sizes were smaller and the food lacked the robust flavor from previous visits.  Even the roast pork was dry.With a heavy heart, I have not been back to Ting Wong.  I have spoken with many coworkers who used to frequent Ting Wong as much as myself.  We have all concluded that the stellar customer service that was once there is significantly lacking and that the quality of food that once was served, has greatly diminished.  I miss my lunches from Ting Wong.  What used to be a wonderful gem in Chinatown is now just another restaurant amongst many."], ["Claire G.", "REOPENED!! philly.com/philly/blogs/…"], ["Rachel S.", "I was among the only \"White People\" in the joint which is an automatic win.  Our party of 4 tried the duck and green veggies in oyster sauce as starters - both were fantastic!  I also got the soup w/ dumplings and roast pork which was not only presented beautifully, but tasted amazing.  The service was quick, the decor is not impressive, but that's ok.  Also, I wished they had dumplings on the menu as appetizers - they only are offered in soups."], ["Alex s.", "One of my favorite restaurants to go to. It is definitely a better place for lunch where the roast meats are fresh and constantly coming out of the kitchen.  The roast pork is extremely tender and delicious and the roast duck is one of the best in the city.  For the money the roast meats on rice are some of the best values around.  Depending on when you go, later in the evening for dinner the meats may not be as fresh.  The atmosphere is nothing special, but the food is definitely worth it."], ["Jennifer B.", "It's your typical Chinese hole in the wall restaurant. It was the only thing open on thanksgiving so we didn't have much choices. I ordered the wonton noodle soup which was super cheap ($4). The soup was okay. Not a lot of flavor but I was too hungry to care It was a little disturbing watching the workers walking back and forth from the back to front get meat (roasted ducks hanging on a hook)  Warning, it's cash only!"], ["Tony R.", "This is hands down the best Hongkong style roast duck/chicken/ pork place in Chinatown, if you are ordering anything else here, your're wasting your money.(with the exception of their jook/congee/rice porridge) Cash only, awesome service, and amazing food. A must try if youre in phillys chinatown"], ["Corinne L.", "Outside certain core areas in the US, good Chinese food is slim pickings. And let's face it, Philadelphia is not exactly known for its Chinese food. Truth be told, I didn't even realize there was a Chinatown there until I started visiting the city. So, I was pleasantly surprised when I found myself having a satisfying meal at Ting Wong!Ting Wong serves legit Chinese food - Hong Kong style to be precise. I had a nice variety of dishes: roast duck, soy sauce chicken, won ton noodle soup, seafood congee, and pork and thousand year old egg congee. Good flavors; while it wasn't the best I've ever had, it was decently on point and if I lived in Philly, Ting Wong would be a go to place for me. The decor is nothing to write home about, but the food's cheap, comes out quick and with good portions. Great for take out too.The verdict: 3 stars + 1 star for being a diamond in the rough = 4 stars overall."], ["Shereen C.", "This review is ONLY for the roast duck.  I haven't tried anything else.Ting Wong's roast duck is okay.  It tastes like duck, but is not as flavourful or tender as I'd want.  Roast duck should be tender and succulent when properly prepared.  The duck is served with a sweet soy sauce, which is a little disappointing (I'd prefer gravy).  It's not bad, but I think there's better to be had in Philly.2.5 stars"], ["Stephen C.", "Well this place is closing on 10-15-2014,  the old guard is being replace with new faces.  Ting Wong will stand and be opened up in the same spot but will the food be the same?  Time will tell.  As for my last meal at this place, wonton soup with roast pig was freaking awesome!  Hope the old guard will reopen somewhere else in Chinatown."], ["AJ A.", "Okay.. So my colleague told me to try this place.. And I'm glad I did!!!! Place is a gem. I got the Pork with peking sauce with Rice and it was delicious!!! Amazing! Will be coming back again. 4 stars because my food took a while :( but I'll try again nextime"], ["HELEN A.", "This is my favorite Chinese restaurant in Chinatown, where I now live, but I have been coming there way before that... It is no frills, but the food is great, as are the prices! The duck and the soy chicken are my favorites (I order the appetizers without the rice). Their won tons are nice and thin and very good. Great fried rice too. They are also very efficient. Highly recommended."], ["Lilli M.", "I can't compare this to other Chinatown restaurants bc this is one of the few I've been to, being an out-of-towner. However, my parents and I do know Cantonese cuisine and we thoroughly enjoyed the food here.All prices on the menu were around $4-6.50, depending on what you order. An absolute steal. My dad got the wontons with fishballs in wonton soup, my mom the roast pork in wonton soup, and I the pickled vegetables with beef.  Portion size was fabulous.  Even with my mom and my combined efforts, we could not could finish the pickled vegetable with beef dish.  My dad got 4-5 full size fishballs (as opposed to when they slice the fishballs in half, probably so as to give you less) along with a good number of wontons. My pickled vegetable and beef dish was piping hot with just the right amount of salt, and flavorful.As we ate, we saw an employee bringing out 8 roast ducks to hang up.  Chinese people would never prepare so many ducks if they didn't think they'd sell that same day bc no smart Chinese shopper wants to buy day-old duck.  We took this to mean that the turnover for food is high and that the roast meat is pretty fresh as a result.This is a no-frills kind of place - once you get your food, no one's going to keep checking up on you - and the decorations are spartan.  However, rest assured that you'll leave with your belly full of piping hot and authentically cooked food and your wallet unscathed.  4.5 stars if Yelp would allow half stars."], ["Michael G.", "Came here based on Craig Laban's review and got one of the noodle soups.  Although tasty, it was not so superior to others I have had in the area.  The restaurant had many others for lunch so a lot of people do think it's good.I also got some dumplings which I have the same opinion about; nice, but not so superior to make this a go-to place each time I'm in Chinatown.I'll be eating around to find something I like all the time."], ["C K.", "Still the best place in town for congee and sweet bread to dip in it! My husband and I went there every Saturday for brunch! Now that we've moved away, we make sure to have it on our 'must visit' list every time we're in town."], ["Kun C.", "Great place for a delicious and inexpensive meal. Place has no decor but fast service and good food. Wonton soup is great here."], ["Sarah B.", "Some friends and I went to Ting Wong for a quick bite to eat. I was a little hesitant at first, but now I'm glad we went. I ordered beef with string beans, which is also served with white rice. For the price ($5), it was certainly a lot of food! The meat was flavorful and the string beans were crisp. The sauce was yummy. I'll be back to try more dishes!"], ["Grace C.", "I haven't been back to Philly Chinatown in a while and it seems like there are a lot of new eateries popping up all over town. My local friend told me the streets are being renovated and cleaned up too so I was happy to hear that. The restaurant is fairly small but efficient. The roasted meats hanging from front end of the restaurant beckoned us to enter. My friend recommended this place when we needed a good and quick lunch before I headed off to the airport.It was fairly packed on a weekday lunch. I saw business men there as well as families so it was a good mix of people.One of the staff pointed at an empty table in the back for us to go to. We sat down and a server promptly brought us three hot teas in clear glasses (be careful, it's hot!) The menu was extremely reasonably priced ranging from $5-9 depending on what you order. Most of the menu was between $6-7 and the portions are huge!I ordered the Roast Pork and Wonton Noodle Soup. It came out fairly quickly My friend found the broth a little oilier than other establishments but did think the prices were lower than competitors nearby.The roast pork, noodles and soup were great to me. I thought the wontons were a little tougher than I'm accustomed to but they had a generous amount of filling in each one.The restroom in the back was clean which is always a good sign to me.Our total bill came out to $19 for three of us so I thought that was fair. Service was efficient. Our tea cups were never empty for long."], ["D L.", "Old school Cantonese where wait staff has ion a white shirt and a black or red vest. Food is swift along with the service and the food is good. They make a few dim sum staples like cheurn fun if you are willing to wait. If not order congee or any thing from the front incl their barbecue items. For those of you are reading this that are from NY. This is a version of Dai Wong"], ["Susanna L.", "Came here the first time for some duck on rice. The duck was reallly moist and quite flavorful. The second time we went for some congee with fried bread. My friend got the fish congee while I got the beef congee. The fried bread was bigger than we thought, so maybe sharing one would be ideal. The congee was flavorful, the service was just fine. A good place for a little snack after school."], ["Anita S.", "Food itself probably earns 3 stars, but the food you get at the price you get it for? I'll bump you to 4 stars, Ting Wong. Everything was simple but not greasy. We got the roast pork because it sounded delicious, and while it was fine, it was the least impressive dish, which is saying something. The star of the show for me was the chicken congee. Jam packed with flavor, the chicken was cooked just right, fantastic. We also got a wonton soup, the wantons were more like shumai, tasty but I'll be returning for the congee."], ["David B.", "There was nothing redeeming about this restaurant experience. My friend and I got the roasted pork appetizer. It was dry and flavorless and was the highlight of our meal.I ordered the pork dumpling noodle soup. The broth and noodles were ok but the dumplings were really, really bad. They had a weird taste and chewy texture.My friend ordered the Hong Kong duck noodles. The noodles smelled/tasted fishy. The noodles were topped with slices of duck which were mostly bone, skin, and fat."], ["Rick K.", "Quick and convenient regardless of whether you're getting take-out or dining in. They have a variety of dishes that they make in the kitchen that I think are all mediocre or better. The prices are also very attractive and cheap compared to some other Chinese restaurants. I have a dilemma though. I like to come to these restaurants to enjoy the roast meats like duck and pork. Right across the street from Ting Wong is a  place called Siu Kee Duck House, which I feel has far superior tasting meats, but the issue is that Siu Kee is take-out only and there are no tables to sit in. I find it difficult to go to Ting Wong, when I know there is a superior product across the street, but that has to be consumed in my home, which is both a convenience and inconvenience. This is why I am giving it 3 stars."], ["Jayson W.", "Amazing authentic Chinese noodles and other dishes. If you're looking for \"classics\" like Chicken and Broccoli, General Tso Chicken, or anything else from Panda Express, this is not the place for you.Stick to the noodle and soup dishes and you cannot go wrong. While the servers were by no means fluent (maybe not even comfortable) with English, it was easily overlooked with their kindness and caring hospitality.Great for a quick authentic bite in Chinatown."]], "Xi'an Sizzling Woks": [], "China House": [["Linh Q.", "This is one of south Philly best Chinese take out. After searching all over south Philly for a good Chinese take out the search is finally over as I have found my favorite Chinese take out. Everything I've had from here so far are tasty. I've had the general tso chicken, sesame chicken, wonton soup, egg drop soup, best hot and sour soup from chinese take out and their shrimp roll. I must say I'm a bit disappointed at the shrimp roll as I am expecting whole shrimp which are not found in it but its still tasty. The combination platter are well priced. You get a lot of food for your money. Although it comes with egg roll we always request to switch it to shrimp roll and never been an issue. Only one issue I had during my recent order was that I ordered a large wonton egg drop soup only to find that when I got home they did not give me any wonton. So since they don't deliver we had to take a trip back and when we got home found out they gave me a pint (small) wonton soup on the side so I felt like I've been rip off when indeed I paid for large.  So when you pick up your food make sure you check to make sure all your food is there to prevent any issue like me. I normally check my food when I get to my car but this recent visit I placed the order and my fiends went to pick up the food otherwise we probably wouldn't have that problem."], ["H I.", "Simply the best chinese takeout I've been to. You can tell the food is really good here by the amount of customers coming in and out. Considering the location is not that good. So call ahead of time to avoid waiting. The thing I really like about this restaurant is none of their food is pre-cooked and its made from scratch. Unlike many of the chinese take outs I've been to, premade.All the food they sell here is incredibly delicious. From chicken and brocolli, chicken wing, lo mein, to singapore noodles. So if your ever in South Philly and want an excellent chinese takeout, go here.Happy Eating!!"], ["Don R.", "Ahh the beautiful and bustling Oregon Ave...hosting a jewel of fine Chinese Cuisine.  Bottomline is this, if you want great Chinese takeout, consistently, great priced, and very well prepared....You want this place.. Full menu, staff hustles and gives you exactly what you want....Sure there are others out there that might provide better ambiance and indoor ponds, but if it's simply \"Take out\" Chinese in South Philly...here ya go..fyi..it's takeout not deliveryHighlights:Steamed Dumplings (prepared fresh, not the industry standard looking ones)"], ["Brandon S.", "The food is great, but they are extremely slow and disorganized. Call to place your order, wait at least 30 minutes before going to pick it up, and double check before you leave. Avoid the busy times, like Saturday nights, too. Judging the food and portions, though, China House ranks very high for me."], ["Lucky K.", "Probably the best take out restaurant I have been too. I've owned a Chinese take out so I know. Always fresh, consistent, and plentiful. I will not get take out anywhere else period in south Philly!"], ["John V.", "Always Good .Take out only but very quick .Just call ahead and it will be ready when you get there."], ["Dana C.", "This place is great! Very busy call ahead so you do not have to wait ."], ["Keeda H.", "Best take out EVER!  We used to live in the area and would go weekly.  We now moved about 1/2 an hour away but still make a trip down to South Philly to pick up Chinese Food from here every few months.  We get the Lo Mein and egg fu yung pretty consistently.  Also my husband loves the pizza rolls.  Enjoy!"]], "Shiao Lan Kung": [["Kathy K.", "The best Chinese food in Phila small place but check it out you will be happy you did."], ["Christine B.", "Having recently moved into the Chinatown area temporarily, I was looking for a solid Chinese restaurant suggestion.  Rebecca S. came to the rescue and suggested this spot.  I went with my mom for a Friday night dinner.  I started with wonton soup.  It was okay, nothing special.  My mom loved her hot and sour soup.  We shared an order of steamed dumplings.  They were fantastic, especially after I added some chili oil.  For my main dish I went with veggie moo shu since I had two pork dishes.  They added tofu for me.  It was really good.  I used to order it from my local Chinese take-out place and this was a million times better.  I'll definitely be back."], ["Jordan S.", "Goods and bads and I'll break down both. Keep in mind this is my first negative Yelp post yet. I try to keep it positive but felt the need to share my experience. We walk into the smallish venue and the host/waiter is sitting at a table and \"points\" us to our seats without getting up. Interesting. We order our food and then subsequently two other parties walk in and order. Their food comes and they leave before we even get our entree. We inquire to the manager and she quickly yells \"it coming, it coming.\" Meanwhile, the one party that arrived 20 minutes after us has now opened their fortune cookies, paid, and left. The kicker is that they appeared to have ordered the same or similar dish (sesame chicken or general tsos - same dish, different sauce) as us. Perhaps they're ability to communicate in Chinese allowed for quicker/better service (?!?!) Again, interesting. Moving on. The sesame chicken finally came out. Sesame chicken often comes with broccoli, however my dish looked as if I ordered broccoli with a side of sesame chicken. It's chunks of dark meat chicken, not filet mignon. Pile it on! Sesame chicken:Quantity: FQuality: B+ (it was pretty good) My guest got the \"Chinese delight\" which was a mixture of chicken, scallops and shrimp with a spicy garlic sauce. Quantity: AQuality: A-The food was overall pretty good, which is the SOLE reason I even gave it two stars (there was no option for 1.5 stars) but the service was dismal. Any request we made seemed to be met with hostility and a sense that we were bothering the staff. Our party felt very unwelcome. Native speaking guests, however, were getting hugs and smiles upon entrance. For some, I would recommend it and believe the service would be great. For others, such as myself, I would not recommend this place to anyone. I will certainly be avoiding this restaurant and the awkward and uncomfortable experience that went along with it."], ["Derek C.", "Came here for some late night eats inebriated so I may be off.Ordered watercress, fried flounder, crab and fish maw soup and the braised pork in peking sauce. Every thing tasted great and if i recall, the bill was only around 90. I think this place is better than the NY equivalent Wohop if you are ordering family style late night."], ["Chris R.", "Awesome place to eat. I randomly chose this place because I wanted to get away from the tourist traps on my trip. The prices are great, it's quiet, and the services is quick."], ["Tania K.", "Decent little after-hours spot. I had ordered the 4 Seasons and watercress, but they always seems to run dry out of watercress both times I visited! I wasn't too happy with their fish maw soup either, but I do like their food better than the other Chinese restaurants around Chinatown that's open late."], ["Elizabeth K.", "While I was visiting Philadelphia for a conference, a local friend highly suggested this place and brought us here. Now, I'm from North Carolina & we don't have many restaurants that serve authentic Chinese food. Having said that, we have ONE that I've been to and thought it was sooo good. How naive was I?! Don't expect any sense of order or cleanliness. It is a very small and probably family-owned restaurant. Oh! And don't be afraid to ask for recommendations since the food titles are not very descriptive. I did, and I loved what our server/owner recommended for me. Shiao Lan Kung is not only authentic, but it's DELICIOUS. It was sooooooo good that even when my stomach was full and hurting, I was a happy, full lady. I wish there was one here in NC.  /:"], ["ML V.", "I'm by no means a food expert, but I have had my share of Chinese/Asian food. I was not impressed by the quality of this food. My favorite of the dishes we ordered was the tofu hot pot. If anything, get that. It's jam packed with flavor, and is very filling. We also ordered lo mein and a seafood dish. I didn't even try the lo mein, because I was told it was pretty much drenched in oil. Another turn off was the lack of cleanliness of this place. The white table cloths were very disheveled, with old food stain markings. I also noticed a mouse trap in the women's bathroom. The older reviews seemed to be very pleased that this place was open until very late. I guess I would've enjoyed this place a whole lot more after a night of drinking."], ["Donald P.", "Great food! Used to come here all the time when I lived in Philly. Now we stop by when we visit from out of town. Usually get the salt baked squid and beef chow fun. They've been here for a while so I can only imagine the owners of this place are killing it.I seriously wish they would fix up the place though, ESPECIALLY the bathroom. Perhaps they are too afraid to mess with success?"], ["The Caribou A.", "With so many restaurants in China town in Philly, we were hoping we made a good choice when we picked this restaurant. Glad to say that this turned out to be a winner. It's a small restaurant and always quite packed, which goes to show how good their food is, and clearly there are many regulars at this place. We ordered the mashed chicken with sweet corn soup, and it was delicious! In addition we ordered some egg rolls, a seafood and a chicken dish. All the dishes were great. The staff are friendly and will always welcome you promptly and with a smile. So the next time you  are wondering which of the many gray restaurants to try in Chinatown, go for this place!"], ["Julia L.", "This is a Chinatown staple for Philly. They hold weird hours, I think they're open for dinner most nights and Friday lunches (but I could be wrong). Anywho, Joe and I ordered to go from here since we didn't feel like the hassle of looking for parking in Chinatown. We split two dishes. And staying true to the spirit of take out, we didn't use any of our own dishes or utensils to save the trouble of doing dishes later on.This dish was amazing but tiny! for the price, I would've thought the box would've been more than 1/3 full. come on! the pieces of white meat were dredged in a flour batter and deep fried and then cooked in a black bean based sauce. I liked that the black bean flavor didn't overwhelm the other elements going on here (dried red peppers? garlic?)the salt baked shrimp and scallop is my favorite in all of Chinatown (that's right, I'm putting my 2 cents down). I'm not a fan of squid but luckily Joe eats everything so this worked out for us both. Usually when you eat it at a restaurant, the batter is crispy but since we had gotten it to go, the batter had a chance to become a bit soggy. whoops! fortunately, this is a testament to this dish, when I ate it, it was still delicious!"], ["Mary M.", "They happily seated us at 2:30 am (they close at 3am). The porkchop was tender, tasty and delicious. While the Tofu was prepared just right. We also had the chicken fried noodles. The entire meal was satisfying, and cooked fresh. I didn't feel bloated afterwards. I will definitely return back again."], ["Fred W.", "This was our second visit to SLK. The place was very busy on a early Sunday evening, so the service was on the slow side. The food, however, is excellent. I had Hot and Sour soup, and it was great. That was followed by Szechuan shrimp, also excellent. I added some extra chile paste for a little extra heat. My wife had chicken with Chinese broccoli, which she loves.The chicken fried rice and fried pork dumplings are also very good here.We will be returning to SLK.They also accept credit cards-except AMEX- which is a plus for Chinatown as some are cash only."], ["Mandy C.", "Came here with coworkers on a early Tuesday evening, and this place was super empty and quiet. As the night goes, it got more filled and mainly non-Chinese diners. Usually you know a Chinese restaurant is good if it's filled with Chinese people, but this is not the case for Shiao Lan Kung. Even though there were rarely any Asian eating there that night, he food here is pretty good.I had:Salted Baked Trio, which consisted of lightly battered squid, scallop and shrimps. I really the light batter, just wish there was a little more seasoning. Dragon & Phoenix's Nest: I really like this dish because you get both veggies and seafood.Homemade Style Rice Noodle: Super flavorful and interesting since they use fermented veggies in this dish. It's also filled with that \"wok\" flavor. Spinach with Garlic: Quite oily and bland, but garlicky at the same time. Pa-Chien Tofu In Hot Pot: Taste typical and flavorful. I just wish the tofu is deep fried a little more.All in all, a decently clean, small but spacious Chinese restaurant to eat at with pretty good service and food."], ["Abbie D.", "We stumbled upon this gem at 2:15am after consuming copious amounts of cocktails at Hop Sing Laundromat..... This was our saving grace to not having such an excruciating hangover.We started with snow pea leaves, pan fried dumplings, and salt and pepper seafood -  All of which were fantastic.  We proceeded to have some other delicious things that I honestly cannot remember but know that there wasn't anything that we didn't enjoy!  Good Food - BYOB - Open late :) :) :)"], ["Sarah P.", "My absolute favorite Chinese restaurant in Chinatown!Alllllll attributed to one amazing lip-smacking tastebud-melting heavenly perfect dish.THE EGGPLANT HOTPOT.Nono, it's not the typical let's-stick-anything-n-everything-into-a-boiling-pot-of-water kinda hotpot. It comes in it's magical dish full of flavorful TENDER pieces of eggplant that instantaneously melt in your mouth with an explosion of garlic brown sauce.You HAVE to order it. Trust me, I've had friends that first looked at me apprehensively when I ordered it but they too became believers once they experienced this magical hotpot.Oh, and their other dishes are tasty and inexpensive too. I'm down with that."], ["M G.", "This is the place for late night food, especially after a night out.Shrimp ballsHuge OystersMany many other great dishes!!!!"], ["C C.", "My boyfriend and I stopped in for some late night food around midnight on a Friday. It's a nice, cozy little restaurant, and the staff were friendly. There was a table of two when we went in, but later, it got really loud with a group of five or six right next to us. The menu is pretty large. I ordered the roast duck noodle soup and he got pan fried noodles. We also shared an order of dumplings. The dumplings were good and my boyfriend enjoyed his noodles. I really liked my noodle soup especially because it was a cold night. The duck was flavorful and good. I was surprised that the noodles were like the pan fried noodles, yellow and squiggly, but they were good and cooked just right. The soup also had bok choy, which I enjoyed. Overall, good food and one of the few places in Chinatown open so late."], ["Fiona T.", "If you want real authentic traditional Chinese food, this is the real place to be. There's a lot of places in Chinatown that offers Chinese food but what they don't tell is that some cater to her American audience and some still to their roots. This place stays with their origins and it's delicious. A huge thumbs up."], ["debbie a.", "Best rinky-dink chinese restaurant ever!This place is a virtual hole in the wall... but I have been loving it and coming for over 10 years now.The best thing about this place is that it is still small (only downside is waiting for a table in the restaurant.. - probably only has 8-10 tables)!I've tried just about everything on the menu aside from the more exotic items..My favorites are:Dragon and Phoenix Nest chicken and shirmp tossed around in a wine sauce with veggies in a fried taro nest.NEVER too greasy.. nice flavorSalt Baked Squidgreat texture - not overcooked so its not super chewy.I would love to see it served with jalapeno spiked, vinegary soy sauce on the side thoughBeef Chow Fun with Black Been Sauceok.. this dish is ridiculous good and great for those who are used to the Americanized Chinese cuisineGiant Clam -MmM so good, just try this tender, briney seafood dishChoy Sum/Water Spinach with Garlic.Just a good garlicky veggie dish.They have added a few menu items over the past few years, but I swear I will get around to trying them soon!GO.. wait in line.. try everything =)"]], "Nan Zhou Hand Drawn Noodle House": [["Julie W.", "The beef brisket noodle soup is a favorite! I personally think the noodle to everything else ratio is a bit off (too much noodles..), but it's great for someone super hungry [for carbs]. We also order side dishes to go along with the noodle soup: I recommend their cold apps e.g. pig ears (yuuuuum), sliced beef, etc. Friend also LOVES the lamb kebabs from here. They're a bit pricey at $2 each with stingy portions, but they are def delicious. CASH ONLY!"], ["Kris L.", "Came here with a group of 4 to try the reputable noodles.  Ordered the beef noodle soup and though the noodle texture was perfect, I honestly found the dish just a bit bland. Was not super impressed and let my husband finish my bowl (which he happily did!)The ambience is clean and simple and prices are cheap.Would return to try a noodle dish with a little more kick!"], ["Nataly N.", "Chinatown was PACKED on Christmas Day! After spending 30 mins looking for parking, we were fortunate enough to find 2 seats in this establishment. I've already been here many times, but I NEVER get tired of it. I usually try new places on a regular basis, but this is my default destination for a reliably satisfying bowl of piping hot noodle soup. I always go with the beef brisket hand drawn noodle soup. Everything in it is amazing and there is a nice balance of taste and texture. The broth is rich in flavor, yet much less heavy than ramen broth. The beef brisket is tender and flavorful. The noodles are fresh, and there is a very generous amount of greens to balance out the carbs and proteins. As appetizers, today we had the scallion pancakes (nicely crispy and flakey) and the pork and chives dumplings (delicious filling in thin wrap). Despite the large crowds, the servers were efficient and friendly. This place  seriously never disappoints."], ["Tiffany P.", "Best spicy pig ear! It's a bit pricey but worth it. The pig ear is cut so thinly and coated in delicious spicy sauce. The serving is generous as well and is served on top a small bed of pickled carrots and daikon. I'd rather pay more for the really good stuff. I usually always get one to bring home for my family. The hand pulled pork soy noodles are also a favorite. Homemade noodles beat store bought any day!"], ["Laurie W.", "Get the dan dan mein....(noodles with pork soy sauce)you won't regret it!A nice balance and not too saltyits not the niceest looking thing but your tummy will be happy with you"], ["Jaclyn G.", "Came here for lunch just yesterday and our bill was just about $22 for two noodle soups and order of dumplings. We ordered the pork & chive dumplings to share. My boyfriend ordered the lamb hand-drawn noodle soup. I opted for the recommended beef brisket hand-drawn noodle soup. For noodle soups between $6-$8, it's a good value. They give you a whole lot of noodles. I couldn't even finish it. The noodles were definitely good..thick and just the right chewiness. The beef brisket meat was a little too tough imho though. For people complaining about it being bland, I thought the broth was just right. If needed, just add a little soy sauce and chili oil, and it'll be perfect. They do have an ATM machine just right at the entrance but don't forget that they're CASH ONLY. Luckily, we just had enough money for our bill + tip haha."], ["Jonny N.", "This place is amazing! You can actually see the noodles being made in the back through a window and it truly is an art form to make these noodles! I always get the house special because I am a meat lover and they pack the meat in too! Overall a great place for a quick bite to eat with your date and inexpensive as well. Definitely recommend it to anyone looking to get something authentic yet filling at the same time."], ["Stone Z.", "I am from LanZhou. Well I was born there. My Grandma would go downstairs in the morning and buy niu rou mian from a street vendor. (beef noodle soup) I gotta say this place gives me a faint reminder of LanZhou. However, the noodles were not the same and the broth was not as strong. However, I'm not about to be critical about a place because it's not the same as in China. The food was really good. The service is kinda off but honestly I don't really expect great service at an authentic Chinese food place in the States.I would tots go again. There is an ATM for cash as this is a cash only establishment."], ["Susie K.", "A group of 4 went here for dinner yesterday. We ordered the chicken wings for an appetizer, it was nicely fried and pretty greasy.I ordered the veg stir fried noodle, the flavor was good but it was overly sticky... kind of like it could have done better with a sauce.also ordered the oxtail noodles soup, brisket noodle soup, and the fresh shrimp noodle soup. WOW the portions are huge. We couldn't finish any of our dishes. I like the broth of the oxtail, a deeper flavor than a typical pho dish. It's a louder atmosphere and I would come back but would order less food"], ["Michael N.", "One of my favorite spots in Chinatown.  Excellent hand drawn noodles, huge portions, and rock bottom prices.  The place is clean (which is important) and the service is as attentive as any other spot in Chinatown.  This is a great cheap dinner spot or a quick lunch option."], ["John K.", "On a recent jaunt through Chinatown, the GF and I decided to get some takeout. From Dim Sum Garden, we had to get some XLB aka Soup Dumplings to go. I also wanted to try some of the offerings from nearby Nan Zhou, where the hand-pulled noodles are on point.Steamed Chicken Dumpling [$4.75]Coconut, CurryThe GF was craving more than soup dumplings, so we got some cococnut curry chicken dumplings. They had a nicely delicate flavor that didn't hit you over the head and the accompanying vinegar-based soy sauce was a nice complement.Shredded Pork Stir Fried Fresh Noodles [$8.95]In comparison to their broth-based dishes, which showcase a more substantial hand-pulled noodle, these noodles were thinner, but still retained much of the accompanying sauce. In addition to a melange onions, garlic, carrots, and greens, there was shredded pork, which had good flavor. Brittle Turnip [$4.25]I also wanted to get some of the turnips, which were really interesting. An interplay between sweet and sour notes, these were spicy thanks to the peppers. Incredibly addictive.So while Dim Sum Garden may be king for most, do try the noodle dishes at Nan Zhou. It's cash only but for an affordable price, you can leave stuffed and satiated."], ["Abby W.", "Do it. Eat all the noodles!I had the hand-drawn pork soy sauce noodles. I wasn't even that hungry but I ate them all. They were freaking amazing. Added a bit of the chili oil from the table and it brought the whole thing up another level. Also got the chicken curry dumplings, which had good flavour but the filling was a bit dense and dry. Pricing is super reasonable for the noodle and soup dishes, but apps tend to be just as much if not more. Service is terse but acceptable."], ["Paolo B.", "It's a very popular place in Philly's Chinatown. Very basic, fast turnover and a focused menu. If you're after quality noodles, really good taste, fast service and really low prices, this is the place for you. If you plan to spend a long time in here sitting comfortably or for a romantic dinner that's not it. I really liked the stir fry pork noodles and the steamed dumplings were fabulous.The staff were not particularly courteous, but kind enough. Really really cheap.It was very busy and a bit too loud and the most were in and out within 30-45min. In summary this is the place for really good noodles and a quick, cheap quality meal in a semi-fast-food experience."], ["Christian M.", "I got the Noodle soup and it was good. Also ordered the pig ears which were very enjoyable. Fried dumplings were better than steamed. Did not really care for the coconut curry dumplings. The scallion pancake was also good."], ["Jessie H.", "Best hand drawn noodle in philly! This place is my favorite..CASH ONLY.I usually get the Sliced Beef Noodle Soup or Beef Tendon Noodle Soup. Broth is good and decent amount of noodles/meat. Legit place for authentic hand drawn noodles. You probably won't spend more than 10 bucks for your meal."], ["Joanne V.", "My boyfriend and I came here to try out their famous hand drawn noodles. The space of this place is decent and it is clean.We ordered the diced cucumber salad and the roast duck noodle soup.The diced cucumber salad was alright, nothing special. As for the roast duck noodle soup, it tasted kind of bland to me and the noodle texture was also okay. Kind of disappointed with the food. Maybe we just didn't know what to order. Good thing the prices were on the cheaper side. If I am back in town, I would give this place another try.FYI- This is a CASH only establishment."], ["Nivedita B.", "There's nothing more comforting than digging into a giant plate of fresh homemade noodles after a long morning of traveling. Nothing! Yes, it's cash only but food is cheap and you can leave the place satisfied for under ten bucks. After much deliberation and turning down the server's recommendation to try the stir fried noodles, I settled on the dry noodles with pork soy sauce. The noodles were beautiful. The ground pork was cooked well and in a nice savory sauce that wasn't too salty. I slurped up all my noodles (and it was a huge portion) within minutes, needless to say. My partner in crime got the beef brisket noodle soup. The noodles in his soup were, well, delicious (shocking), and the beef was tender. The broth was so-so -  I've had better. Service was lacking slightly - I had to bother ours a couple times to get hot tea. Overall, a solid place for some delicious handmade noodles! I would be here all the time if I lived here. Try the dry noodles with pork soy sauce!"], ["Jon L.", "Came in 6:45pm on Saturday and place was already packed. Had to wait about 5 min so not bad at all. Super popular and smelled so good. I had the beef noodle hand shaved with an egg and a Shanghai spring roll. The noodle soup was warm and had a good amount of beef. The noodles were tender and had a great texture that I liked about hand shaved noodles. Total came to $9.95 and I wasn't able to finish my noodles."], ["Michael S.", "Excellent shaved noodle dry.  Or take it in a soup scallion pancake tasty.  Mango smoothly nice.  Cash only .......atm in store entrance cold noodle sesame killer take it as a shaved noodle"], ["Tiffany T.", "It's about high time I review them again, it's been almost 3 years since I first tasted their glorious beef noodle soup. I had it about a month or two ago, still the same beef broth.. inflation might have increased the price to about $6.95/bowl of soup. But same is good here -- no better no worse.. just consistent.I recently stopped eating beef and was immensely sad on how many delicious foods I will be missing out on now. I decided to go in and try their chicken noodle soup to see if it was just as good. And I can't say it's just as good. It's good, not great.. but good. The broth is still stellar, flavorful, pickled veggies and that's all still the same. The chicken however is so insanely bland. I'm surprised they don't marinate it in salt/pepper or hot sauce.. or something! they literally just cooked that chicken and threw it in the soup.But glad to see there are other options. I may opt to try the seafood next time which is $7.95 ad is the shrimp noodle soup!"]], "Sang Kee Peking Duck House": [], "Heung Fa Chun Sweet House": [], "Su Xing House": [["Asma K.", "Best Chinese Vegetarian place I have ever been to!  I am a vegetarian and have been to many Chinese vegetarian restaurants in DC and none come even close to this one.  Whenever I am in Philly I go there to eat.  My favorites are the garlic eggplant and tofu and the sesame seitan.  I even took my meat lover father and cousins there and they loved it.  I wish they would expand and open up more restaurants.As for the service, I've never had bad service they have always been nice and no issues. However it is just the standard they have never done anything amazing to stand out."], ["Laura L.", "Food is awesome! Price is unbelievably low! Best vegetarian restaurant that I have ever been!Good to learn that they even have lunch specials on Saturday. Recommend: Pepper veggie steak - taste like real steak!!Hope they could deliver to University City too..."], ["Emily H.", "Love their lotus root soup.. unlimited tea! classy dining setup doesn't hurt either."], ["Sam G.", "As good as vegetarian food gets. 1. Vegetarian2. Chinese foodI'm not even vegetarian! I don't care for that tbh. But this place was good. It was good. There was such creativity in the foods (for an omnivore such as myself).Mapo Tofu, some fake oyster dish, and some rice dish. I forget. Look at the photos. The prices are pretty cheap for the area. It's a steal, actually."], ["Eve B.", "We ate here this evening. The food was really good and the wait staff attentive.  I am a vegetarian so was delighted to find this restaurant.  It's very reasonably priced."], ["Cassie Z.", "Delicious food! And I have meat with every meal. Tastes like authentic Chinese cooking that my mom makes. No wait, and really fast food service. Tea was awesome as well."], ["Ernesto Hideyokidz C.", "We came here recently as a party of seven eating family style. The appeal of this place is that it was vegetarian, kosher, BYOB, and local. Sometimes when you order vegetarian dishes from non-veg Chinese places, they come out sort of lackluster, tasteless, or ugly. I liked that they made an effort to make the dishes look like meat dishes. Service was good, food came out steadily, and everything ended up being around $130 not including tip. I would recommend this place if you're having a large party (they have a separate room and you can save money with BYOB). Their menu caters to all types of eating habits. Even those who weren't huge fans of eating vegetarian or tofu meals were really impressed by the food here. Here is a breakdown of some of what we got. Appetizers:A few different soupsPan fried dumplings - have little cubes of tofu insidePotato croquettes - look like a chicken nuggets, prefect with a little salt and ketchup 2 Plates of Vegetable Stick with BBQ sauce - corn, mushroom, peppers, etc., with some kind of protein (looked like veggie sausage)Fried vegetable balls - similar to the croquettes but not breaded. I loved theseEdamame - came out salted to perfectionEntrees:Vegetable Lo Mein - plate is huge, don't get this for just one personGeneral Tso Tofu - loved the sauce, got it on the side for other dishesSesame Tofu - came with broccoli, also large enough for sharingVeg Heaven - maybe one of the less popular dishes we orderedGolden Rings - spicy and crispy, deceptively shaped like shrimp but veg obviously2 Plates Sesame Seitan - similar to the general tso tofu, crispy and flavorfulVeggie Steak - well loved at our tableI obviously would recommend this place. Just a note to the management about the potato paste based dishes. Of the dishes that had this (croquettes, golden rings, etc.) the paste was a little heavy/gummy/sticky which made it difficult to chew and swallow. If it could be a little fluffier and easier going down, those dishes would have been my favorite"], ["Kenneth G.", "We are from Reading, PA and it seems we must travel to get really great vegan food.  iCreate in Pottstown, SuXing House in Philly.  This little restaurant is, hands down, the best Asian food we have experienced in a long time.  We were able to bring our own wine (no charge for doing so) and shared 4 entrees and 3 appetizers with friends.  Every one was out of this world.  Their spring rolls were nice but we especially loved the miso soup with tofu.  Utterly divine.  The sesame seitan with broccoli was my favorite, probably all  of ours, but the other 3 entrees were also excellent.  We relaxed with good friends and good food and a wine of our choosing.  Perfect!  The final wonderful surprise was their bill for the wonderful food, service and atmosphere!  We couldn't believe the price for all this was sooo low.  We just can't wait to come back!!"], ["Becca D.", "Standard Chinese cuisine, but with a vegetarian focus. The food wasn't amazing, but it definitely was good! And really, the price can't be beat. Wasn't super busy on a weekday lunch so service was quick. Definitely will be back!"], ["Judy C.", "I had dinner here and I made the mistake of ordering an appetizer AND an entree. BY the time I was done with the scallion pancakes, I was pretty much full. I ordered the Taro potato knishes as an entree. For vegetarian food, it was really cheap and they gave me a huge portion I couldn't finish. BY the time I was done, I felt like a starchy knish myself. The flavor was ok. It was like any other fast food Chinese place - laden with orange sauce. I didn't really taste any taro since everything was deeply fried. The scallion pancakes were a bit stale and hard and the sauce was boring.  I would go here again if I was craving vegetarian Chinese food, but Philly has so many kinds of food I want to try, that it might take me a while to come back to Su Xing."], ["Ama C.", "I went here with a friend for a last minute, casual dinner.  I had eaten earlier, so I opted for the scallion pancake and spring roll from the appetizer menu.  I don't recall what my friend ordered.  The spring rolls were hot and fresh, my friend's entrée was delicious but the pancake tasted like... it was perhaps not as fresh as possible.  It wasn't terrible, but not as good as  I was hoping.  Service was polite, quick and fairly attentive, though a bit brusque (the server kept the tea coming though) and the prices were amazing.  I would definitely try again, though perhaps a different item."], ["Amalia Y.", "didn't miss the meat at all... scallion pancake was super-fried and a little harder than I enjoy. flavorful but a but greasy. general tso's tofu wasn't as spicy as I expected, but overall not bad. the texture of the tofu was nice, and didn't leave me wishing I'd had chicken instead. the sauce had a lot of whole peppers in it, so pay attention when you eat to avoid a mouthful of fire! vegetable my shu was flavorful and has a good mix of veg. I've typically had mu shu served with the pancakes on the side so I could assemble myself.... here they do it table-side for you. one order = 4 chinese burritos. noms. the price point is super reasonable, and this place is a nice alternative for vegetarians and those who keep kosher... and the meat-eaters won't have anything to complain about."], ["Michelle S.", "The Pros:  The food was really good, and it was way cheap.  You can seriously get stuffed here for around 15 dollars.  The vegetarian prawn and vegetables was phenomenal. The Cons: The other two dishes that my friends got were just ok.  Our waitress was kind of stern.  Every time she came over I felt like she was going to yell at us.  Maybe she was just having a bad day?I would return, the menu is so large that I want to try more things before I make up my mind completely about Su Xing House.  Plus, it's so cheap, even if you don't like what you got, you don't feel like you wasted a lot of money."], ["Sylvia O.", "I didn't even know this place was vegetarian until I got a few bites in. The food is delicious! Great for lunch and huge portions. Of all of the places in Philly, their menu is the most unique and will satisfy both carnivores and vegetarians alike."], ["Nabi A.", "I probably come to this place once a week. I have brought my vegan friends and my carnivore friends and they all love it! It is so cheap that we usually have leftovers. One meal can perfectly feed both me and my fiancée  and there are leftovers. My favorite is the soy nuggets with sweet and sour sauce and the fried rice. YUM!!!!"], ["Joyce T.", "Spring rolls are fried to order! The sesame tofu is fantastic.The atmosphere and the lighting of the restaurant are on the weird side."], ["Dhara M.", "The food here is just delicious! It is an authentic Chinese restaurant, AND it's vegetarian! Which is a very surprising and pleasant deal. I eat here every time I'm in Philly. Love this restaurant!"], ["Lei Y.", "Very good veg!!! So yummy. I believe the tofu here is a must-have. Also love the glass noodle in hot pot. I'll try more for next time going!"], ["Cat N.", "Ate here tonight with a good friend -  neither of us are vegetarians, but nothing was lacking!  We ordered spring rolls, the sesame seitan with broccoli, and the As-You-Wish dish. Spring rolls were delicious, but the sesame seitan was the star!  SO good!  The As-You-Wish was very good, as well.  Very attentive with the tea and water.  All in all, a solid 4 - EXCEPT... the portions (HUGE, we had lots of leftovers), the price (TOTALLY reasonable!), and the fact that there were at least 5 other dishes that I want to try! Bumped it up to a 5, and I will be BACK!"], ["Colleen M.", "I can typically find something on any menu to meet my needs. This talent comes from necessity and the overwhelming disdain for those preachy-type vegetarians. As the only non-meat eater in a group of meat loving foodies, I have adapted.So, when one of those friends decided to pick this place because I am always \"so good about going with to any meat-fest in town\" I was extremely excited (and a little nervous that she wouldn't be happy with the selection). Let me tell you, this place didn't disappoint. I had never heard of Su Xing House but I could not have been happier with the service, the menu selection or the food. The General Tso was amazing. The scallion pancakes were to die for. My friend was equally happy with the food and even took her left overs home for another taste. I can't wait to go back to try more of the menu options. So many were mouth watering I had trouble narrowing down my options."]], "Empress Garden": [["Huamei Y.", "Came here last night for some delicious chinese food. Since we were short on cash we were looking for options and Empress garden came into mind.We were seated immediately as soon as we walked in. They gave us water and came back to take our order. My friend got the pork belly and tofu on rice which also came with boy choy. I go the string beans with minced pork, extra spicy. Everything was hot and fresh. The pork belly was perfectly melt-in-your-mouth good and the string beans were crispy just the way I like them. The service was on point and everyone was kind to us.Thanks again for another great experience!"], ["Jay L.", "In some other city or in some other location, I would be impressed with the food. It is good. But in the middle of Chinatown, with so may other restaurants, it is hard for this place to stand out.The congee is okay, nothing special, pretty standard rice porridge. The fried dough goes nicely with it though. The noodle soups are good as well. The beef noodle soup is standard. If you've never had it before and you're feeling adventrous, the pork pickled turnip is tasty. I though it was a bit heavy on the pickled turnip, but take a few out, and its just right.Solid restaurant, in a area with a variety of lots of great chinese food options."], ["Jina M.", "One of my favorite Chinese restaurants in Chinatown.Don't expect awesome service or the cleanest decor but don't forget you are in Chinatown.I don't usually like going back to the same restaurant multiple times because I like trying new spots but this is one of my go-to places. Some of my favorite dishes: Salt and Pepper Pork Chops, Indonesian Spicy Fried Rice, Jiajiamyung, and Eggplant dish."], ["Ityng H.", "Go Philly! Making excellent Taiwanese dishes. Family and I took a day trip to Philly to check out their Chinatown. We found this restaurant through yelp and was not disappointed. Their scallion pancakes were great and their beef noodle soup is worth getting. Would not recommend their Xiao long nap because I think it's from Wei Cheng (stuff you buy at the supermarket that is pretty good for frozen soup dumplings). Also their veggie dish is well seasoned. Definitely a comfortable neighborhood sit down restaurant with no frills and good food."], ["Yannis W.", "We came last night and order three cup chicken and tofu hot pot and beef noodle and oyster pancake and scallion pancake . The foods was excellent. We will come back again."], ["Victoria R.", "Beside Sang Kee Duck, this is my new favorite, go-to, Chinese/Taiwanese place in Philly! So not kidding, it's a at least once a week, will walk over half and hour through rain or snow, kind of place for me. Best dishes here that I stuff my face till I get food-coma are as follows: -chicken chow fun (no gravy. why is that even an option?) Lace it with Sriracha like you're supposed to. -Three Cup Chicken-string beans or watercress -fried pork chops-eggplant -egg drop soupOther pros: -clean-fast and friendly service-the prices are killer good-the fortune cookies there actually make sense-the portions are plentiful-the teapot of tea is fresh and good-they don't judge you when you keep coming back to eat alone because you can't stay away from their addictive food."], ["Ali C.", "Yummm! Some simple, tasty, Chinese food!  We had such great service here! The waitress kept telling us to let her know if we needed anything.We ordered the wonton soup, house lo mein, spring rolls, and the steamed dumplings.  There won ton soup was very good. I love when the won ton soup has a dark broth. The spring rolls were very fresh.  The house lo mein and dumplings were very good.A nice teapot of jasmine tea is always a plus :)"], ["Lilli M.", "I've passed Empress Garden more than a dozen times. It's fairly nondescript from the outside but when I finally went in, I really enjoyed the meal I had here. This is one of the few Taiwanese restaurants in Chinatown.  It has a very clean feel and one of the walls is a huge glass window that looks out onto 10th street, so there's plenty of natural light and sunshine.I tried the Taiwanese beef noodle soup.  Just under 7 bucks, steaming hot, a very generous amount of beef, and very flavorful.  (Maybe a little too flavorful actually, I found the broth a teeny bit on the salty side)  I wouldn't have minded a little more of the veggies but still a great portion size for the price; I had leftovers for later.  My friend tried the Indonesian curry and really enjoyed it.  The curry itself was a little on the watery side, but we weren't sure if that's the nature of Indonesian curry itself or how it was prepared here.  Best to avoid ordering from the lunch special menu even though those items, like General Tsao's, may sound more familiar to those who don't know a whole lot about Taiwanese cuisine, b/c those are distinctly Americanized dishes. In fact, my friend was originally going to order the Hunan chicken lunch special and the waitress actually asked if she was sure, adding that those are Americanized dishes.  Obviously if you know Chinese, now's the time to bust it out with the waitresses but they speak English really well too, at least from the exchange I heard between the waitress and an English-speaking patron.  I already have my eye on the pork chops with rice (sounds fatty but heavenly) for my next trip here, and sometime I'll try the oyster pancake appetizer too.The only drawback, which is a minor one, is that there's only a single restroom and it looks like a broom closet converted to a bathroom b/c it's so narrow. Really, I don't know how people with a slightly larger body habitus would squeeze into this, and the sink is tiny. But hey, you'll be spending most of your visit here chowing down, not in the bathroom, so all's well."], ["Liz D.", "After reading others' reviews, we selected Empress Garden. Clean, fast service, good food, reasonable prices. Our favorites were the pork and duck dishes. The vegetables were all fresh. Good choice."], ["Daniel M.", "This restaurant in simple terms is nothing out of the ordinary, it's similar to other Chinese style restaurants in the area. The staff that work there are average and the food is average. The portions are a good size both times I've been here.  We ordered the sweet and sour chicken and as an appetizer the scallion pancakes.The scallion pancakes came out first so that was good, it comes with a sauce which compliments the dish. The sweet and sour chicken was average, nothing to rave out. They deep fry the chicken and the sauce is a little bit to thick for my own choosing but to each it's own.  They give you free tea and water which is cool. The staff could've been a bit more attentive. They also seem disorganized a little bit. We had three different people come to our table to give us food or clean up our dishes. The gentlemen that works there I feel was the most professional out of the three. The prices for food is ok and I would come back here again in the future.The dining area is a bit small but it works so not a deal breaker. There's only one bathroom I believe so that could be an issue for some. They greeted us upon walking in and we were seated immediately. Overall I gave it 3.0 stars out of 5.0. I think the service needs to improve for sure."], ["Nakanaela M.", "Excellent meal as usual, I had the chicken fried rice w/Mai Fun noodles. Meal was hot, chopsticks were clean, restaurant was nice and quiet even though it was full. Definitely a great place to eat."], ["Judy L.", "I always get the Indonesian Fried Rice and General Tso's Chicken both extra spicy. That's comfort food for me. Even when I get the food to go, it's still delicious. My Indonesian friends all claim the Indo fried rice here is the best in the city. Their Taiwanese food is decent too and they have good lunch specials."], ["Justin Z.", "Not bad, but not great. The place is small so expect to be close to other guests. The food was just ok. Nothing really impressed me."], ["Zia S.", "I had not done any previous research about this place, but rather found myself in Chinatown with a hungry friend and wanting dinner. We poked our head in and it wasn't too crowded, which was nice because 15 minutes later it was packed out. It's a small place, so I'm not surprised that it filled up quickly, but it doesn't feel cramped, and it is quite clean and well-lit, with cute and up-to-date furnishings and dishes. Small details, but some places in Chinatown can be a dodgy about these things. The service was quick, pleasant and helpful, the waitress serving us gave me her recommendation on which smoothie was the best. The mango smoothie definitely was a highlight of the meal, the lo mein I ordered was satisfactory but I was most impressed with the smoothie and frozen watermelon ice. $3 each, which I think was quite reasonable. The smoothie was served in a cute glass, and it was really quite good, and I'm a bit picky about smoothies. (It wasn't one of those depressing smoothies filled with ice and disappointments)Yes, there are places in Chinatown you could get food a bit cheaper (but really, not by much, it's quite reasonable), but I was quite pleased with the meal and the feel of the place. It's the kind of place you can take people to enjoy a more non-chain-restaurant feel of Philly without sacrificing cleanliness or nice/comfortable ambiance. I'll definitely be going to Empress Garden again."], ["Helen Z.", "I came here with my parents during lunch hours on a weekday. It wasn't too busy, so we were seated right away. Wait time for the food wasn't long either, about 10 minutes. I ordered the tomatoes and beef over rice. I thought it would just be tomatoes and beef with rice, but it's actually eggs and tomatoes plus beef over rice. It was delicious! The portions are pretty generous, definitely enough to fill a person up. And it's pretty cheap too, only around $7. For the amount and quality of the food I got, I'd say it's definitely worth it. Would come back again and try some of the other dishes."], ["Tim B.", "Just simple Chicken Chow Mein, fried rice and won ton soup.Among the best I have ever had!Service was super friendly , fast and the restaurant is cleanI will be back"], ["Denise T.", "Mind you, I haven't eaten Chinese food in years. I was in Philly and, on the spur of the moment, decided to pick some up; bad idea. I checked my cell for the best restaurants for egg too young; my favorite. By a process of elimination, I ended up here. I knew I'd made a big mistake as soon as I tried to spoon the sauce. It looked like plastic, flowed in globs, and tasted like something out of a rusty can. I really thought twice before giving it to my dog."], ["Coco R.", "This is very genuine Taiwanese cuisine. Coming from the west coast and growing up with a lot of Taiwanese friends, I haven't seen many good Taiwanese restaurant in the east coast but this is one of the best ones in the east coast. It feels like going home."], ["Jeff G.", "Really solid place. Pretty good value, but not quite as good a value as Ting Wong, M Kee, Nan Zhou. Salt and pepper chicken wings- Very good, not quite as fried/crispy as other places' salt baked wings, but still good.Scallion pancake- Very good. Fluffier than most places I usually have it. They serve it with a sweeter sauce. I think it tastes better with soy based sauces.Taiwanese beef noodle soup- Delicious. Very flavorful broth. Noodles are really good. My only complaint is that they should cut up the beef into smaller pieces. The beef portion in the soup is generous, but I'm trying to eat soup, not a steak.Beef chow fun- Pretty good, a little glutinous for my taste. I like the noodles a bit wetter in sauce. Beef portion is solid.Service is fine and friendly. Their English isn't great, but it's fine. I did have to explain several times that I wanted the rest of my food wrapped up to go. This was a bit icky, but when they put my leftovers in, they included my chicken wing bones. I shouldn't have to specify that I dont want chewed chicken bones to go."], ["Tabitha A.", "This has been my frequent weekly lunch spot for about year. They have a great lunch special that comes with enough entree to have leftovers, choice of small soup, and rice. There is always plenty of ice water and complementary tea.Getting to know the staff is part of the charm--a friendly host welcomes you inside, and a smiling waitress with a ponytail is always very sweet and remembers my friends' faces and orders. The waitress with a short pixie haircut is more of a moody character. Another memorable feature is their amusing and cheerful music selection.Since going vegetarian, the lunch options for me are scant. The service is also slow and forgetful at times. However, the food is high quality and served in a clean, quiet atmosphere. I would encourage newcomers to Chinatown Philly to stop at this place, relax and \"take-o tiiiime!\"."], ["Adrian G.", "Met a friend here for lunch today. It wasn't the restaurant she had in mind but it was crazy cold outside and we both were hungry. Serendipity. The food was delicious and the staff was friendly. Prices were very reasonable and I'd definitely go back."], ["Andrew C.", "I gotta say...i'm a huge fan of this place and will probably make a stop over every time i'm in philly.1) Clean spot, friendly waiters/waitresses2) I don't remember the name they give the dish here...but the \"zha jiang mian\"...which is essentially the meat sauce noodles. A bit of a kick, lots of flavor, huge portions. $6?3) Three cup chicken: Still solid, large portions. Lots of flavor. win as wellSimple, flavorful, full of value. All traits of a winner in my book.."], ["James W.", "Excellent experience! We came with a group of 10 at 9pm and they set the table for us in advance. It was our first time there and all of their food was good. Especially the salt and pepper pork, Mapo tofu, pork chop over rice, string bean. Everything was quite good!"], ["Jay Y.", "Look, I'm a Taiwanese and I don't think the entrees were very Taiwanese, but the food was still excellent!Unfortunately my family did not order any Taiwanese snacks and instead ordered two entree dishes: three cup chicken and Hakka-style tofu pot. While these were certainly Taiwanese dishes, the tastes were more like Chinese cuisine. That doesn't mean the food was bad though, but the three cup chicken was absolutely delicious!The moment the large clay pot of three cup chicken arrived, our table was engulfed with its luring aroma. I could not stop myself from continuously taking pieces after pieces after the dish arrived! This mildly spicy entree was addictingly flavorful. So glad I had leftovers to relive the moment again later that night!Great food, cheap options, large portions, friendly service, clean interior...If you are in the Philly Chinatown, Empress Garden should be your top choice!"], ["Cathy S.", "BEST FOOD EVER!!!!OMG, I wish I lived above this place so I could have it everyday. I had the pot stickers, noodles, sweet and sour pork and everything was soooooooo good. The location is very small, but when your food comes out nothing will matter. We got great service, and our food came out quickly. This is by far my favorite Chinese restaurant ever."], ["Marie S.", "The last time I had Taiwanese food was in Taipei a little over a year go. The weather was muggy when I was there, so I devoted my entire visit to experiencing the food culture. As expected, the dishes at Empress Garden are nowhere close to as good as the best spots in Taipei, but they at least have the right flavor profile.Oyster pancakeOut of all the dishes, this one was the best. The flavors, textures, and colors were on point. My one complaint is a big one: there weren't any whole oysters in the pancake.Beef noodle soupAlthough better than your standard Chinese beef noodle soup, the broth lacked depth. The beef was so tough I couldn't bring myself to eat it. The pickles were excellent. There were no tendons.Wonton soupThe plump wontons were filled with pork, shrimp, and mushrooms. The wontons were served in a clear broth with seaweed and Chinese vegetables. Overall the dish was good, but the cook was a little heavy handed with the sesame oil. Special tofu and meatballsThis was on the Chinese side of the posted recommendations. The dish consists of tofu stuffed with meatballs and stewed. It looked and tasted very homemade in a bad way. The tofu had broken apart and the dish was overall bland.Although none of the dishes I had were perfect, I still have high hopes for my next visit. I plan on trying the pork chop rice and stewed trotters next!"], ["Laura M.", "Food is consistently good! I love the scallion pancakes, eggplant with minced meat, and shanghai style rice cakes. I sometimes even will order takeout of the rice cakes because they are SO good. The scallion pancakes are crispy on the outside and fluffy on the inside. The restaurant is always clean, quiet, and the staff are nice."], ["Rebecca G.", "My friend and I came here last night for an early dinner, and I'm definitely a fan!We started out with shares of the fishball soup and the oyster pancake. The fishball soup was simple yet tasty, and consisted broth, fishballs, and bok choy. We could have done without the oyster pancake, though. It didn't taste at all of oyster, and instead of the thick, slightly sweet, sauce that topped it, itself a gooey mix of rice, egg, and whatever else was in it. But certainly not of oyster.We then continued with a share of the three cup chicken as our main dish, which was delicious! It actually reminded me of a chicken dish that my mother made while I was growing up."], ["Samantha Y.", "I was really excited to try this place because it's apparently the only Taiwanese restaurant here in Philly. I was a little skeptical at first because I wasn't sure how authentic it would taste and I'm especially picky about Taiwanese food since that's where I'm from. And they play really good Taiwanese music in there!Anywayyys, it's a small place but very clean and very welcoming. Definitely not something you experience everywhere in Chinatown. The customer service was exceptional as well! I couldn't decide how much food I wanted so the waitress took a really long time explaining to me the sizes and which order would be more worth it. I ordered zha jian mien, pig feet over rice, and sze chuan shrimp.The zha jian mien was DELICIOUS. Exactly like how my grandma makes it back at home. And the portion size was pretty good, got me at a good full.My boyfriend absolutely loved the pig feet over rice. Sounds a bit gross at first but it really isn't! The skin was cooked to a good tender chewiness... so yum.The shrimp wasn't that special in my opinion. It was edible, it was good, but wouldn't get it again. Last but not least, donated my fortune cookie up on the wall haha."], ["Jialiang H.", "This place the food very good. I like they salt Balt pork chops and house noodles"], ["Nala W.", "This place is great for authentic Taiwanese food. Order from the Chinese menu, if you can read Chinese because it's cheaper for the same items on their English menu. The bawan and o a chian is really good and the prices are reasonable."], ["Victoria C.", "Empress Garden really hit home with it's authentic dishes. We ordered a beef noodle soup (Taiwanese specialty), Zha Jiang mien, and Indonesian chicken curry. All three dishes tasted very well done. The beef noodle soup had a lot of meat and the perfect amount of tendon, too. It was also cooked well so that the pieces weren't chewy at all. Broth was fragrant, not oily at all. Zha Jiang mien was good - although the pork seemed a bit salty (kind of the point, I know, but a bit too salty). The Indonesian Curry chicken was really, really good. Lots of chicken chunks, curry was nice and spicy, and took home the other half for dinner! Will definitely come again to try more of their other ethnic dishes!Also, great service - did not mind that we brought in some bubble tea drinks."], ["Sharron And Andrew T.", "If you're too lazy to read the rest of the review just know:This place has great food and decent prices! Try it out!For those who like/don't mind reading my Yelp rant, here it goes!This is the only Taiwanese restaurant in Philly, but its pretty good so I don't mind at all! The dishes here are a little salty for my own preference, but still very yummy.Tip #1: price = portion size. I thought I might have need an extra appetizer, turns out I took half my meal home with me. I ordered the peking noodle with meat sauce for $6.75. It tastes a lot than it sounds. The portion size was bigger than my face. Tip #2: Their Taiwanese meatball isn't the type of meatball you're use to. It's actually a very tradition taiwanese dish, I was surprised to find it on the menu, I haven't been to many restaurants that sell it. Its sort of like a Chinese pork bun, except the outer layer is made up of tapioca flour and starch. It has interesting texture if you want to try it out. I for one thought it was pretty good.The prices are actually a lot lower than I expected for a family style restaurant. Each large entree is around $10, at most $15. Noodles and rice dishes don't exceed $10. To the point: I will definitely come here again!"], ["Melissa H.", "Not the best Chinese I've ever had, but very good.  Glad we stumbled upon this place."], ["Ashley R.", "The waitress was so welcoming, i felt like she was genuinely excited that we were there. I feel like I'm kind of annoying at restaurants, yet she always seemed OK to fulfill my requests. When the food came, it all came at the same time, so we all didn't have to wait too long for others to receive their food. They served A LOT of food on our individual plates, too! I had the ideal restaurant experience here, and everyone should go! The place is small though, so hopefully you won't go while it's crowded."], ["Jamie S.", "Empress Garden is one of my favorite spots in Chinatown. The pork chops in particular are a dish I always recommend to people looking for suggestions in that area of the city. As is the Taiwanese meatball. This is really unusual, and unlike any other meatball or  dumpling. For $3.50 you get a ball made with a rice flour outer layer stuffed with mushrooms and pork. This is definitely one of the least attractive plates ever. Also, try their Zha jiang mian. The dish is listed as Peking Noodles with Meat Sauce under the \"Northern China Style Noodle\" section of the menu. I found the Chinese version to be less salty and lighter, the Korean versions I have tried have more of a dark, hoisin  flavor. I was pleasantly surprised that the squishy noodles were home-made. They don't cheap out on the meat sauce, there is tons of the good stuff, but it manages to never overpower those noodles."], ["Sarah S.", "I've been wanting to eat here for awhile and so glad I finally got a chance.  The restaurant is small but clean with good service.We ordered the following:salt and pepper wings - pretty averageTaiwanese meatballs - interesting. It's like a mochi type covering beef mix. Not a fan of the sauce.  scallion pancakes - really liked these. Nice and chewy and good dipping sauceoyster pancakes - I enjoyed these but same sauce as the meatballs.  Will ask for the sauce on the side next time.Peking noodle (ja jian mien) - really liked this dish.  The noodles were cooked well and the sauce was really goodMinced pork and eggplant dish was flavorful and delicious3 cup chicken - I wasn't expecting much but chicken was really tender and sauce was good - I didn't have a huge issue with bones as mentioned in other reviewsSalt and pepper pork chops - one of the faves of the bunch.  This was so good. Next time, I'd like to try the Indonesian fried rice and mapotofu"], ["Jared H.", "Delicious!  Very good price and the food was delicious.  I would definitely get the shrimp walnut specialty dish and the Indonesian fried rice.  I didn't find the pork belly and tofu dish to be that good, but others at my table enjoyed it.  Also the eggplant was AMAZING.  Really, everything was great.  Would definitely come back here."], ["Mary A.", "My absolute go-to spot in China town for years! Honestly, the woman who works here used to know mine and my freinds' orders for a while. I don't think you can go wrong whether you're looking for some Americanized Chinese or something more adventurous. Scallion pancake and zha Jian mien are my FAVORITE. They also happen to make what I believe to be the best sweet and sour chicken ever. The tempura batter is always crispy and never gross/ soggy/ greasy like at a lot of places."], ["Simas U.", "Good food! The service is pretty slow, but the food is more than enough to make up for it. It's a tight fit so don't bring too many people."]], "E Mei Restaurant": [], "Spice 28": [], "Jane G's": [], "Dan Dan": [["Lauren C.", "Welcome to the neighborhood Dan Dan!!!  I've been here a few times now, always for lunch, and I have nothing bad to say.  The first time I dined, I sat right down.  The 2nd time, i had to wait all of 5-7 minutes.  The most annoying part was the sheer volume of people, but they have Dan Dan down to a well (chili) oiled machine!  See what I did there? The first time, i split dan dan noodles with a friend... and they were delicious!  The sauce was just hypnotizing.  SO yummy.  For my entree, I had the tofu dry pot.  It was pretty tasty.  It had a lot of rogue chili peppers just kind of putzing around though.  That was their way of making it spicy... but unless you actually ate the whole chili pepper, it wasn't very spicy.  Chili peppers don't have a lot of inherent flavor... more just heat... so... it didn't pay off to eat all of them as they weren't 'good'... they were just hot... Bottom line- I was intrigued... and I came back for more.My second Dan Dan dining experience was more strategic.  Again, we split the Dan Dan noodles.... because well... they're delicious... and the name of the place.... then for my lunch I had the twice cooked fish... which was absolutely a dream come true on a plate.  It was spicy, and tender, and saucy and ricey and tasty and had great heat, and has left me craving my return trip!The place is small, but the service is efficient.  It's also really cute, and they take reservations, so figure out how to get here.  The prices are also very reasonable which is worth mentioning too!"], ["Luis R.", "Every dish on the mark!  Food was served quickly, waiters were friendly and lively.  We ordered around 6 dishes and all were great with lots of heat as we expected.  Portions are for sharing so order 3-4 dishes to sample as a coupleOh, the prices are great too!"], ["Linh L.", "Came here for a random Friday night dinner. Didn't have RSVP, so the wait was about 30 minutes. The place is small. I wasn't expecting to go out for dinner, so I ate before coming here. Therefore, dinner was light. Only ordered two dishes: dan dan noodle and the dry pepper chicken.The dan dan noodle was good, but it was not what I expected to dish to be like. I would describe it as a cold noodle dish with spicy peanut butter sauce instead of the spicy minced pork noodle dish. The dry pepper was really good. Very spicy and crispy. Wish it could have more chicken than the breading. I would definitely come back here again for lunch or perhaps order take out."], ["Huamei Y.", "My, oh my, Philly you are doing it right these days. I'm so happy to see more Asian restaurants open up with trendy decor, about time they get on that bus!Although you can walk 0.5 miles east for food that is half the price of Dan Dan, you cannot deny the great service and ambience Dan Dan has to offer.I came here on a tuesday evening around 5:30pm and there were only a few people here. The restaurant has an open loft concept, so noise levels can be tricky. The bar is in the middle of the room with a few small tables against the window. We had a reservation and we were led upstairs where there was additional seating.Being a huge spice and noodle fanatic, I had to get the dan dan noodles. My friend and I also ordered the twice cooked fish. Fish is amazing if it's cooked right with the szechuan flavors, so I had my expectations up.The service was on point - the waiters were very friendly and honest about their opinions when I asked about their recommendations. They were not too pushy and they definitely paced the meal well. The noodles were peanut(y), which had a kick! I was pleasantly surprised. The fish was tasty, as for the sauce, it reminded me of black bean sauce. Nonetheless, paired with rice and the noodles, we were pretty full at the end of the day. The portions were just right!I'd still prefer going to chinatown, but I'd recommend this place to anyone who just needs their szechuan fix in Rittenhouse!"], ["Allison B.", "Had a tasty meal here. Some of the best scallion pancakes I've had. Eggplant, garlic chicken, dan dan noodles and dumplings all flavorful and yes of course, spicy. The menu is very similar to Han Dynasty's (the owners are related). One thing I can't get on board with: $6 Tsingtao's. It just. ain't. right."], ["Michelle C.", "I, much like I'm sure everyone else, was incapable of eating here without comparing everything directly to Han Dynasty. And you know what? I was still hugely impressed. Let's break it down.The dan dan noodles: Fantastic. Seriously. I think they may be on Han Dynasty's level, and may even be slightly spicier.Pork belly burger: This is basically a pork bun, and it's *really* good. And at $4 each it makes for a really great appetizer.Double cooked fish: This is where Han Dynasty wins, but barely. The fish at Dan Dan isn't deep fried like at Han, which I would imagine makes it healthier. If you care about that sort of thing, get your DCF--a soon to be well known acronym I just made up now--here, otherwise get it at Han.I'll need to sample more of the menu before I can know for sure how Dan Dan truly measures up to Han Dynasty, but if you're in Center City and seeking Schezwan, they're a safe bet."], ["Stone Z.", "I was surprised by this place in CC. I would argue that taste wise, this place is better than Han Dynasty. The authenticity of the dishes are excellent.The spice of their spiciest dish was a very pleasant numb for me. If you like spicy food I highly recommend trying their beef and tripe starter. IMO that is one of their best dishes. I have eaten a lot of this traditional Chinese dish called \"fuqi fei pian\".Their Dan Dan noodles tasted very authentic as well. Traditionally Dan Dan noodles are a poor mans food but they have made it into a classy dish.I don't really like the plates they gave us for the food because I felt like it was too small but it is very classy."], ["Dennis L.", "This was a fancy and kind of pricey Taiwan/Asian fusion joint  in Rittenhouse. The fact that they had a Taiwanese menu was what pulled me in. I sat at the bar and ordered a few of the smaller dishes for myself. I started with the Scallion Pancakes, Taiwanese Hamburger, and some Taiwanese minced pork rice.The food was really good. The reason for the stars was the cost for so little. Value wise, meh....The scallion pancakes for $3.75 were okay, but I don't think they were really anything special.The taiwanese hamburger was 4.75 i think and it wasn't really that filling. Don't get me wrong, the meat was delicious and it had a great flavor, but again the price...The best value may have been the small bowl of minced pork rice, which was actually chunks of pork cut up and thrown on the rice, so that was better than just minced/ground pork. The flavor was good, but could've used a bit more sauce to let it soak into the rice."], ["Alice J.", "The scallion pancake was really good. The dan Dan noodles came out within two minutes after we ordered it and it felt like the noodles were just sitting pre made back in the kitchen....the noodles itself felt soggy. The beef tripe soup was flavorless and bland. The dumplings in hot oil was good but the dumpling was lacking meat.... It was the saddest dumpling I ever had. I rather go to Han dynasty."], ["Jeff H.", "There's a buzz def hanging in the air around Dan Dan in the heart of Center City Philly and everyone I know who has been there just likes it. The Philadelphia Inquirer restaurant critic recently rated their signature Dan Dan noodles as only average.  Say what??  They're not average!....they have an excellent consistency and are very tasty with a spicy kick.  I love the Dan Dan noodles at Han Dynasty and I like these as well.  The ground floor bar area is cool and the popular dining room is upstairs.  Service was very friendly.  So with its prime location near 16th and Walnut Streets, Dan Dan Noodles is a good bet wherever you're eventually heading to in Center City."], ["Carrie B.", "We went on a Sunday night after a movie, and were surprised at how busy it was at 8:30pm. Overall it was A-OK. Dan dan noodles were great, crispy cucumbers, excellent tofu dishes, as well as chicken. But, and I don't really want to say it, my husband and I most likely will go to Han Dynasty next time. The ambiance at Dan Dan isn't great- it's bright, chairs are hard, tables are tight, and the food is so similar to Han Dynasty. Why not just go to a place with a little more personality and comfort? That being said, maybe it's better during the day for lunch when expectations are different."], ["Enid C.", "The smartest thing this place did was call itself Dan Dan. This city is in love with that dish thanks to a certain Mr. Han Chiang, so that was a pretty clever move.The food is decent, though they sometimes lean on the side of salt rather than flavor. The prices are also rather high for the amount of food you actually get. It also legitimately bothers me when a Chinese restaurant claiming to serve authentic Chinese food is primarily staffed with servers who do not know the Chinese names of the dishes they offer. (some things I just don't know in English!)It's probably the best Chinese food you are going to find in Center City, but I'd rather hike the extra few blocks and hit up Handy Nasty (see: City, Old) or cross the Schuylkill and visit Chili Szechuan (see: City, University)."], ["Hoang T.", "Heard about this place through the Philly food grapevine. I'm not the biggest szechuan fan but i do enjoy trying new Asian restaurants. My expectations are always lower when ethnic restaurants establish locations in \"higher-end\" areas of the city (any city). My friend and I work near here so we decided to try it out during lunch...we were scared the wait would be long but fortunately, we were a party of 2! Ordered the Dan Dan, bao (hamburger), and ginger scallion fish (white sauce). I haven't had Dan Dan noodles in a long time, but i thought the noodles were overcooked, a weirdly large portion which messed up the meat ratio, and lacked scallions/onions on top which provides additional crunch texture. The sauce wasn't what i remember a \"good\" dandan is suppose to be. Between two people, we couldn't finish it (it also has something to do with the large portion). I will say, i'm on a low carb diet, so i get full off of carbs easily.  The bao was pretty expensive--$5 for one. I guess that's KINDA comparable to NYC's ippudo's baos (2 for $9). But Dandan's bao wasn't that good. The only part i liked was the bao itself, nice fluffy, hint of sweetness. The filling just didn't do it for me. THe pork belly was good, but the garnish and sauces just didn't go well together (in my opinion). The ginger scallion dish with the fish was the least szechuan dish. It actually tasted more cantonese which isn't a bad thing. It was actually the best dish out of the three. I wish there was more fish. There was a bed of bokchoy (my favorite) and the sauce was very nice and not too overwhelming. misses-served lukewarm/cool tea-basic white rice was not good and lukewarm. -service was good then kinda fell off at the end (10+ minutes for check). this should be addressed during lunch hours since workers have limited lunch time."], ["John K.", "Regular readers know of my love for all things Han Chiang and his empire of Han Dynasty restaurants. So when I heard former managers Kevin and Catherina Huang opened up a spin-off in Rittenhouse, I had to check it out. The connection? Catherina Huang is Han's sister! Sure the Sichuan dishes are all there, but how does DanDan set itself apart from Han Dynasty? In a nutshell, the spice level seems tempered for the Rittenhouse crowd.And to be frank, the GF was all about that because unlike me, she can't handle the heat! I kid, I kid, but let's go on it with it shall we?Dan Dan Noodles [$7.95]Han Chiang has \"famously\" (jokingly?) stated that he didn't trust Westerners with mixing their own noodles. So in similar fashion, DanDan mixes the noodles tableside for you as well! Toothsome with great texture, the dish had sweetness from the peanut dressing, with some light spice that hits you in the back of your throat. Could have used a bit more of the crisp pork bits and I'd personally opt for more spice, but this was perfect for the GF. And for less than $8, it's quite the portion. Ask for a bowl of rice and this could easily be lunch with leftovers to boot.Fried Vegetable Potstickers [$6.95]The potstickers were great, with a nicely crisp exterior despite a wonderfully gluttonous wrapper and a good melange of veggies within. The dipping sauce was sweet with a lightly spicy kick.Pork Belly [$9.95]Sweet garlic chili oil Obviously, I had to try DanDan's take on the pork belly app I love. These were spot on with a huge portion of thinly sliced roast pork belly. The chili oil was more sweet than hot and provided the necessary seasoning for the pork. With a bowl of rice, I was pretty much set. Cumin Pork [$12.95]Stir fried, bell peppers, dried peppers, onions, cilantroWe also decided to try the cumin pork, which featured lusciously porcine strips crusted with cumin. This was mixed with onions and bell peppers with bite, with the spice coming through from the dried Sichuan peppers. The cilantro provided a nicely herbaceous element to the dishDanDan's a great addition to the Rittenhouse area and is certainly tailored towards the neighborhood's tastes. That's not to say that they can't bump up the spice level to meet your Sichuan-spice needs! And the service? Wonderful! Our server Cati was extremely knowledgeable and friendly. DanDan should be getting their liquor license soon and their first floor is centered around the bar. It'll likely be a hot spot for happy hour, with a side of their eponymous noodles!"], ["Komal D.", "I love Han Dynasty, and now there's a spin off from it? Yesssss. This place has a modern feel, its super clean, and has an extremely friendly staff. There was a couple next to us that wanted a few dishes explained to them because of their strict diet and the chef came out to help them figure it out.. talk about awesome service. Looking at the menu, its very similar to Han Dynasty. But its basically the same cuisine, so I guess its expected? The only major difference I noticed in the menu is that the food isn't as spicy as Han Dynasty [which I personally appreciate]. They also give a nice hot tea, which isn't super sweet so it helps cleanse the palate so you don't have a lingering spice taste all day. Okay so onto the dishes... Dan Dan Noodles [I had to]Similar to Han Dynasty and oh so delicious. They bring a decent size bowl out of noodles and mix it up for you tableside so each and every piece is covered in an amazing combo of a slighty sweet peanut sauce and a spicy sauce. Each bite has a sweet peanut taste that ends with a nice spicy kick. Veggie PotstickersAbout 5 green potstickers, fried, and stuffed with a light yet tasty filling. The sauce was amazing... I could taste the fresh ginger and garlic with every dip! The only downside to these was the oil... like superr oily. I almost wanted to ask for a napkin to blot these [like i do with all my pizza! ha]Chicken in Garlic SauceWe just ordered this blindly because I wanted to try everything on the menu and couldn't decide... and I'm so glad we randomly chose this. This dish is packed with flavor but it isn't super spicy. I don't know how they did it, but it won me over. A little bit of rice mixed in with this saucy dish made for a perfect lunch.Wonderful service, food, and ambiance. These guys are doing it right. If they keep it up, I can see this place being very successful. Can't wait to come back and try everything else on the menu."], ["Mary M.", "I want to give this place a few more goes before giving it 5 stars but it is well on its way to becoming my favorite Szechuan place in Philly...even more than Handy Nasty!Wonton soup dumplings were so ON POINT. Absolutely delicious and some airy and light along with the rich broth.Dan Dan Noodles are combined tableside and are some of the best I've had.Dumplings in chili oil provide less heat and a huge amount of flavor. When we visited they were still BYOB but have since gotten their liquor license. So another visit will soon be in order!"], ["Stephanie S.", "Went to Dan Dan Friday night for a friend's birthday dinner.  Besides waiting an hour for a table (they quoted us 20 mins), all the staff were very friendly and accommodating. The food came out SUPER fast, I'm taking speedy Gonzales.  We started with Dan Dan noodles (best dish of the night), dumplings, and chive pancakes.  The noodles were amazing, although very spicy I couldn't finish them.  The dumplings were great also, but too spicy for me again. My friend loved the dumpling sauce so much, he kept it as a topping for all other dishes of the night.  All the appetizers were delivered before some of our bar drinks arrived! Bravo chef! Shame on you, bartender LOL!  Lastly, we all ordered the buns, which they call burger buns, delicious pork belly with mango sauce and slow cooked in wine. These were damn good!  For dinner, we ordered the ginger Duck, and chicken bok choy entree with light ginger sauce. Even though the dishes sounded similar, the waiter assured us they were very different, so we'd  be fine ordering both. He was right!  The duck was good, but the chicken bok Choy was amazing. So tender and fabulous sauces. Also delivered in record timing. The service was top notch. The server was great, and helpful with the menu. The manager checked on us multiple times. The food was so fast, and they even cleared our plates and silverware from one course to the next.  Great little addition to 16th street!"], ["Mickey L.", "Probably one of the best Taiwanese/Chinese restaurant I've had in AMERICA!! The food is extremely authentic and tasty!!!! The owner is super helpful and friendly!! I will definitely go back again!!"], ["Anna Marie C.", "My family is Taiwanese--so any time I see something labeled Taiwanese, I have to try it and compare it to home... Plus, clearly everyone enjoys sichuan food--lookit the success of Han here.In any case, I was super excited to see this place open. We arrived on a Wednesday evening--the front desk seemed a bit overwhelmed... I overheard them talking to the group in front of me, apologizing profusely for the wait. They also told us the wait for a table would be around 30 minutes... But as I saw 4 or 5 2-top tables leave, I decided to stick around--and sure enough we were seated in under 10.My friend and I shared the 3 cup chicken, cumin pork, salt and pepper soft shell crab. Plus it was opening week so we got some free dan dan. Unfortunately they were already out of gua bao, which I had really really wanted.The cumin pork was perfectly spiced with nicely cooked tender pork with pieces of still crunchy bell pepper. a bit on the oily side--but I would definitely get it again. The 3 cup chicken reminded me of home--it definitely veered a bit on the sweeter side but was a nice balance to the cumin pork. The soft shell crab was a bit of a disappointment--unevenly battered and missing that msg/pepper/umami flavor.Oh? And the dan dan? I'm sure because they were churning out large quantities of it--the noodles were a bit soggy and I wish there were more little pork bits. Good. Not great-yet. I think from service to food execution, there could be some work done--but a nice solid foundation."], ["Herbie H.", "I'm giving Dan Dan a solid 3 stars, with the confidence that they will work their way up in the 4 or 5 star range. Given that it's their first week, I think there's room for improvement, but overall I had a nice dinner.I went by myself and sat at the \"bar\", which currently is pretty useless, as they are still working on their liquor license. The interior is nice and sleek, very airy and open with a nice loft/second floor for seating.As part of their opening promotion, I got to try the Dan Dan noodles, which were great. Better than Han Dynasty? Probably not. Maybe as they keep tweaking and developing their dish, the two dishes will begin to diverge into their own separate entities. For my entree, I tried the Cumin Tofu, which I loved. The tofu was extra crispy and packed with delicious and smoky cumin flavor. It was a very large portion, so I brought half of that and half of the Dan Dan noodles home with me. Looking forward to leftovers!Service was slow, but good-natured. The wait staff was a little all over the place - trying to manage the host stand, trying to take orders, as well as learning their new computer & reservation system (is the dinner rush the best time?) From what I could see, everyone was trying their best but everything was a little frantic and misguided - and it was only about 5:30pm, I can't imagine how they currently handle a packed restaurant.So, i have good feelings about Dan Dan. Everything from the flow of the restaurant to the service could use some more work, but I really enjoyed my meal and would love to see them do well!"], ["Mallory S.", "the food at Dan Dan was good but not as good as Han Dynasty. I'm also a big fan of spice but the spice was overwhelming and bitter on most of the dishes."], ["Kecheng F.", "Food was good (very similar to Han Dynasty), but the portions are very small. Definitely smaller than Han Dynasty.Seats are very narrow. Difficult to get in and out.TERRIBLE SERVICE. The waitress of our table was halfhearted, not responsive at all. We waited and looked for her for at least 10 minutes before we could get her (with the help of another waitress) to take our order. She didn't serve our tea until another waitress noticed there was no tea on our table - that was way too late, we had already got most of our food on the table at that time! Ridiculously, we then got 2 pots of tea and 1 pot of hot water, which no one asked for... Since we are a group of 6, an 18% tip was automatically added. The terrible service deserved 1% tip at most."], ["Alyssa R.", "Went here for the first time last night. It's a great new addition to the neighborhood. There is a bar and a few tables downstairs and then more tables upstairs. It was pretty packed for a Thursday. I would recommend reservations. Although I didn't make it for it they have good happy hour options. I tried the vegetarian version of the dandan noodles. They were delicious. Quite spicer than I anticipated since it was described as a 3 on the spice scale. Although I like spicy so I enjoyed them. I also had the chicken in garlic sauce. Also delicious. My friend had the green bean dish. Decent size portions for the price. I will def go back. Only complaint is the acoustics. It's very loud in there and hard to have an intimate conversation."], ["Alison L.", "This review is specifically for happy hour.  I think it's a little bizarre that they have a one-per-customer limit on happy hour drinks...this just caused us to go somewhere else first and then come here for our last drink of the evening. For food, we tried the spicy cucumber salad, which was simple but solid.  We also got the baby size of their signature dan dan noodles, which were a huge disappointment.  The noodles themselves were overcooked and mushy, and were way too heavy on the peanut oil--it's the only flavor we got.  To be fair, the service was very good, and I would happily try this place again for a full sit-down meal in order to sample some of the other menu items."], ["Natalie K.", "I liked Dan Dan a lot! I thought that the food quantity and prices were in sync for sure! We ordered 3 appetizers and 2 entrees for sharing and both ended up spending $30 with tip and still had plenty of left overs to take home. I imagine it will be a little more expensive once they get the liquor license, but I kind of like it as a BYO! The location is really convenient too.I liked the feel of the restaurant. The loft setup gives the feel of a larger restaurant even though it's a small space. I especially thought that the bar seating was really great and there was so much of it! I didn't like that the tables in front of the bar seating were so close to each other. It made it pretty difficult to get in and out of our seats. But our server mentioned that they were already working to get smaller tables for the space.My friend and I ordered cold Dan Dan noodles, which were great. It was a really healthy serving size. I think my favorite thing though was the Spicy Cucumber dish. What ever the sauce is that they put on the cucumbers is, it's great. It's garlic-y and not too spicy. I could have eaten an entire order myself. The restaurant just opened so they are a little overwhelmed in terms of dining in BUT a great option is take out - I personally have been back to order take out and everything was still really good! If you can't get a table in the upcoming weeks, I would recommend take out as an option!"], ["Shennai Y.", "Ambience It's chic and tastefully decorated, could be a cool place if you want to impress people! That's what I'm giving two stars for.FoodI had Dan Dan noodle and bok choy with garlic.Bok Choy with garlic was too greasy and too expensive. It's $7.95 and served in a fairly small plate. If you're charged $7.95 for a plate of bok choy you'd expect something special not a dish you can have in China town for half the price in bigger portion and not so greasy!Dan Dan noodle was too greasy too, I added photos to show how greasy both dishes were. The noodles were cooked too much and sticked together. It was nicely spicy though.ServiceAlthough I was there around 2:30 pm and one of the few people in the restaurant, the service was slow. I had to look for the waiter to order my second dish and to ask for the check. And the waiter served my Dan Dan noodle to the lady at the next table and moved it to my table when the lady said it was not her order.As a summery I don't think that I would eat there again."], ["Sarah A.", "I was super excited for Dan Dan to open, particularly with all the marketing re: the Dan Dan noodles being better than Han Dynasty's. Unfortunately, I feel we were misled.The Dan Dan noodles were tasty, don't get me wrong, but they weren't better than Han Dynasty's and they weren't spicy. And, even more disappointing, when paired with the rest of the food we ordered, the entire experience was just kind of, a let down.Yes, the space is super cool looking (love the tables in particular!), and the service is stellar (super polite, speedy tea refills, and unobtrusive), but other than the gyoza (chicken), which were (honestly) awesome and the Spicy Pickled Cucumbers (great texture and flavor, though difficult to navigate with chopsticks), the rest of the dishes were pricier and less flavorful than what can be found a few blocks away in Philadelphia's Chinatown. E.g., the Spicy and Sour Ribeye Pot was honestly bland. And not spicy, even though it was marked with four (spicy) dots. The Garlic Sauce Dish (with beef) was the best of the entrees, but don't you think it's strange when the bamboo has the most flavor of all the components of a dish. The Scallion Pancakes were slightly dough-y and just not up to Sakura standards (my new favorite spot for scallion pancakes!). Even the rice (jasmine) was a little dried out (though I liked that they had a rice pot up on the second level, so they could serve from there--they said they could give us more if we wanted it).Probably won't go back unless some fellow Yelpers follow and tell me it's improved. Ah well, the prices are cheap by NYC-standards--so said a (happily) surprised dining mate in town for the weekend."], ["Andrew T.", "Review of the soft opening:Atmosphere: Asian minimalist, clean, city, welcoming. Service: hey it's the first night! Waitress was very informative and knowledgeable for vegetarians (all the way down to the oyster sauce). Food: Dan Dan Noodles are delicious and on point. Perfect combo of peanut and pepper oil. Mapo Tofu featured a silky tofu with a delicious flavor that had a spicy kick. Fiery Ribeye Brew Pot is enough for 2-3 people and features spice spice spice!We will be back to explore the menu and see this place when it's running on all cylinders. Don't worry the spice can be adjusted on all dishes!"], ["Todd S.", "Well, I do not often say Incredible, but DAN DAN delivered tonight. This is a great new place in Rittenhouse that has a modern decor with A second level.. The view is over the bar which is awesome. The menu is well thought out and sure to please. Everything was well prepared an fresh.. The place was clean.. Everyone was engaged in great conversation as I watched plate after plate of pure perfection arrive at tables surrounding me.. The spicy cucumbers: Perfect The Won Ton in chili Sauce: Perfect The Spring Rolls: Perfect The Twice Cooked Chicken: perfect The drinks: Perfect!! I loved it!!! I had the opportunity to meet the Owner and she has an incredible personality... You realize why DAN DAN is so successful after a conversation. This is a great addition to Center City!"], ["Ari S.", "Came here opening week (I believe it's 5th day open) for lunch.  The place was PACKED (I'm guessing everyone heard about the free dan dan noodles).  Our service was good for the most part.  The original food we ordered came out fairly quickly, but I think at some point after that, the kitchen got backed up.  One guy next to us didn't get his food until way after his eating partner, and our dan dan noodles (which we ordered when our food came out) took a long time to come out (we just tried a taste and got it packed up to go.  However, these are all things that I'm sure will get figured out. On to the food... the dry pot (spiciest item on the menu) was INCREDIBLE!  Had the perfect amount of heat to go along with lots of flavor that was not covered up by the spice.  This was the first time the Chinese numbing cooking actually made my lips tingle, but I swear it wasn't as spicy as I thought it was going to be.  It was a perfectly prepared dish.  The Dan Dan noodles were a tad disappointing BUT NOTE that I ordered them vegetarian (without pork).  I'm slightly disappointed they don't have a vegetarian version where they use mushrooms instead of pork.  Seems kind of silly not to have that in downtown. The noodles they brought out were just plain noodles with the dan dan sauce.  I would imagine whatever the pork is cooked in adds another dimension of flavor; maybe they'll come up with a non-pork version soon so I don't lose that other dimension??I will definitely go back here.  It was great and I'm sure it will get even better as they wrinkle out any issues."], ["Catherine H.", "I came to Dan Dan on a whim after seeing its grand opening in Center City, and I am happy to report that it was a good experience!The atmosphere was definitely open and bright and leaned towards the modern side. The lunch rush was pretty big and the tables and bar were pretty full, with a bit of a wait. While the restaurant was a bit disorganized (due to it being brand new and their bar area wasn't a bar just yet--they had not yet obtained their liquor license), the staff was incredibly nice and welcoming, and made some fantastic recommendations despite the chaos.I sampled the Twice Cooked Pork Belly and the classic Dan Dan noodles. The pork belly, which was served with a bean sauce, leeks, hot peppers, and fermented black beans, was crispy and well done. However, I felt like the portion size was a little bit small, and while I didn't finish my dish (leftovers galore!), it definitely would have been small to share and didn't have enough meat to make it feel like a substantial dish. The noodles were well-cooked, and were a nice balance of savory and spicy blended with their peanut sauce. My food wasn't super oily when I ate it at the restaurant, but the leftovers I took home were pretty greasy, which was a bit unpleasant.While I couldn't stop thinking about Han Dynasty when I ate here, Dan Dan is certainly a comparable equivalent that I certainly wouldn't mind revisiting."], ["Lauren D.", "I like this place... I sat at the bar and had a Manhattan, which was made perfectly. For nom noms I ordered wonton in chili oil and Taiwanese sausage. The wontons were homemade and the chili oil they were suspended in was mouth numbing and addictive. The sausage was mass produced stuff, tasted like the sausage you can find at any Boba joint. I had it with the fresh garlic. I layout of the restaurant is weird and tight. Other than that I liked it overall. PS- The Dan Dan noodles tasted bland and the noodles were overcooked."], ["Ellen W.", "This is just a regular Chinese chain, like pf changs or pei Wei. The food is always consistent, but nothing to write home about. I'd definitely recommend here for a quick lunch spot or takeout. I liked the garlic sauce chicken or scallion pork."], ["Juliana K.", "While the location and decor is great, I'm surprised by the lack of spice.The menu isn't that different from Han Dynasty, though there are some differences.The spicy cucumber here use english cucumbers, which are a bit bigger and more difficult to eat. Still a delicious and garlicky sauce though.Dan dan noodles were great. I am used to a higher level of spice though for he cucumbers and noodles though. A bit disappointed by the mild head.The triple flash fried chicken was just as good. Crispy and spicy.Service was decent, though spotty sometimes like forgetting our rice or slow when getting the check."], ["Kirby J.", "Honestly, the cramped layout of the restaurant makes it difficult to enjoy. 90 percent of the first floor is occupied by a massive square bar. All of the seating on the first floor is by the front door, and the hostess stand is towards the back of the room (huh?). There is absolutely no waiting space, and only room for one person across to move or stand between the bar and the hostess stand. So while you're waiting to speak with the hostess on a busy night, servers are constantly asking you to move aside so they can access the front tables. But there is no room to move without backing up the line of people waiting behind you! I got up close and personal with no less than five servers in my under 3 minute wait to speak with the hostess. You are \"welcome\" to hang out at the bar while you wait for your table, but there is absolutely no room to do so. The bar seats are reserved for diners, and there is literally no room to stand with a drink. Every single space downstairs not occupied by bar or table is filled with server foot traffic. With only two of us, we were easily seated upstairs. But I watched a group of six with a reservation get squeezed into a table for four with three chairs squeezed in each side. Food was good enough. A lot of things I assumed were vegetarian contained hidden animal products, so be sure to ask. They're good about making adjustments. I'll probably be back, but with a reservation and with little time to wait."], ["Andrew K.", "Have been four times now...this food is so authentic and SO good.  I'm addicted to the spicy cucumbers.Dan Dan noodles always cooked to perfection so 1st time (or 2nd or 3rd...) was no fluke.  Think the dry pot is my favorite but need to sample more of the menu to be sure.Keep it up Dan Dan!"], ["May S.", "First time dining there after reading so many great reviews, and it's an absolute Yes!  Owners, Cat and husband, Kevin were onsite and were graciously greeting and speaking with guests ~ which is a great gesture of warmth & hospitality.  Cat gave personal food suggestions with our appetizer selection and entree. She was so personable to talk with, funny and very helpful too!  The decor offers a clean and modern esthetic and suits to maximize the small dining room.  We sat upstairs which gave a nice openness even with a small dining area.  The ambient music and lighting are in theme with the entire feel of DanDan.Now the food... 5 stars with exceptional service from hostess to servers.  Our appetizer a spicy and flavorful combination of the wonton in chili aioli and cucumber salad was a great pairing. Twice cooked chicken perfectly sautéed with leeks and peppers the perfect portion to complete our Suichan experience. Looking forward to another visit and trying more of Taiwanese entrées."], ["Bingy H.", "It's very similar with Han dynasty but offer authentic Sichuan and Taiwan dishes that Han dynasty doesn't. The $1.75 minced pork over rice is a must-have, and for people who wants to go authentically authentic Sichuan, try the spicy and sour glass noodles - it's legit."], ["Pradeep J.", "Good food. No doubt there. But they always mess up the order. Three times, this has happened. I had asked for the food to be spicy with extra sauce on the side, but not once it was done. Screwed up a friend's order by making a shrimp dish when asked for a chicken dish."], ["Ming S.", "I enjoy the Taiwanese salt and pepper chicken! Very authentic Taiwanese dishes, especially since I'm from Taiwan. The hot, spicy Szechuan beef noodles is good too."]], "Sampan": [["Richard R.", "Our party of 5 went to Sampan on a Sunday night; it was everyone in our groups first time. The restaurant is funky and impressive. I really liked the vibe and the industrial Asian décor. They were doing a brisk business on this particular Sunday night.Sampan has a voluminous amount reviews from fellow Yelpers so I won't go into great detail. Like most of the other restaurants on trendy 13th street, Sampan serves small plates to be shared. The menu is not updated on the web page but the dishes we had were as follows. My apologies for not knowing the complete names....Lamb Satay - This was my favorite dish of the night. The lamb was tender and moist and had a nice grilled taste. It was more Mid Eastern then Asian, but delicious all the same!Chicken Bao Bun  - We really liked this dish, the chicken was crispy.Duck Fried Rice - This was excellent, lot of great flavors.Miso Mahi Mahi - This had some delicate favors and was very good.Korean Fried Chicken - Not bad but we have had better. This was lacking something for me.Crab Tacos - These were just OK, no one really loved this.Muscles in Coconut Pineapple Sauce - The broth for us was better then the muscles but the whole dish didn't really work for us. The serving size in terms of the amount of muscles was good.Pad Thai - Miss on this. I understand it is Sampan's take on Pad Thai but this dish didn't come together for us. It was a tad too spicy alsoChicken Dumpling- This was very good, I think General Tao chicken, but not sure. Our server was great by the way, very helpful and attentive. If we only ordered the stellar dishes, Sampan would get 4 or 5 stars but based on our mixed bag of testing, a solid 3.5 stars. Sampan is a bit pricey also. Our check was about $180.00 for 5 people and only one dessert, a sake and a beer."], ["Alyssa R.", "The best happy hour food!! Seriously the prices and quality of food at happy hour is amazing. No wonder it's always so packed to try to get a place to eat then. Not sure where to begin. The Brussels sprouts are out of this world. Usually need my own order. The Kim Chee fried rice is also absolutely amazing. Generally everything is great here it's just such a great deal at happy hour definitely worth going to if you can make the time. Graffiti bar in the back in a nice option, although music is always so loud hard to have a conversation. The front tables outside are also on happy hour. Which is great now that it's nice out. I've also been for regular dinner and did the chefs tasting, which I also recommend for your first time. A lot of food! But it's great to sample so much of it!"], ["Dave C.", "I was in Philadelphia celebrating my birthday and a friend took me here. There was a small misunderstanding soon after we arrived but Amber, the hostess, immediately moved us to the kitchen bar and then personally took care of us the entire time we were there. She was beyond wonderful. The manager, Jared, also made sure that we were taken care of perfectly. We ordered the Shrimp and Lobster dumplings as well as the Korean BBQ Beef. The BBQ Beef was so amazing that we took an additional order to go so that we could enjoy some more when we returned to our hotel. In addition, Amber brought us an order of the Edamame Dumplings, compliments of the house, which were incredibly delicious.We also enjoyed a couple of rounds of the Citrus Dream cocktails. They were exquisite.The decor and atmosphere are very soothing. The place is beautiful!Amber and Jared are a huge asset to this restaurant. They turned what could have been an unpleasant situation into an absolutely wonderful experience. If I'm ever fortunate enough to visit Philadelphia again, Sampan will be at the top of my list of restaurants I must return enjoy again."], ["Laura G.", "I finally came here for happy hour and it wasn't for the drinks. Their food prices during happy hour are unreal. Sitting at the graffiti bar on a nice day is also an awesome perk. Kim chee rice $4?! I love almost everything on their menu. I tried the brussel sprouts for the first time and they were awesome. Tasted like they were marinated in some sort of Italian dressing. Happy hour here is great but if you plan on splitting plates I would suggest two people to one plate, no more than that. If you haven't been here yet, you're doing it wrong."], ["bill m.", "I really loved this place. The food was creative and delicious. The edamame dumplings (which I would never have ordered except the people next to us were raving about them) were phenomenal. The crab tacos were also great. Loved the kimchi fried rice. The general tso's dumplings were really good also. I have nothing bad to say. Great experience."], ["Shaina F.", "Mmm Sampan, how can I put into words how much I love you? I used to live across the street and was definitely a frequent flier at this fantastic place. Not one bad meal to date, although it's kind of crazy during sips Wednesdays in the summer so maybe that's not the best night to check it out.The chefs tasting is definitely the way to go, and only gets better with more people in your party! So many options for dishes and you get to try so much! Some personal faves: kobe beef fried rice, edemame dumplings, pork or chicken bao buns, crispy spicy shrimp, soy glazed sea bass, and the beef short ribs. Plus they have the most adorable baby ice cream cones with homemade soft serve in two unique flavors each night....obsessed with these obviously and you will be too once you try them. Also check out the kitchen bar if you're going in a party of 2, lots of fun to see the food being cooked (serious talent back there)!!Ahh writing this made me hungry...I need to go back! The only thing I've had here that's less than amazing is the Korean fried chicken satay...but I'd try it again and double check. Overall, the menu is a little scary to look at but just trust you are in good hands, everything is incredible!"], ["Isabelle L.", "I went to Sampan one evening while we were in Philly to visit.The food was delicious and I really like the decoration and \"vibe\" of this place. We had 3 small plates and a salad and all of them were good. The service was efficient and pleasant too. The only issue was the noise (but it was a normal level for a Friday night before July 4th) Definitely recommend it."], ["Jo B.", "As other reviewers mentioned, the food was really hit or miss - which would have given it 3 stars for me, but what knocked it down to 2 stars was the ridiculously high price for sub par food. The most expensive meat dish (the steak) was the length and width of two fingers. It was over cooked, despite me ordering medium rare, and barely had a taste. It was tough, tasteless, and way too small to garner the $24 price tag. The vegetables were hard, cold, tasteless. The other most expensive meat dish (the pork - $21) was okay, had more flavor, still a bit over cooked, and a small dish, but at least had a bunch of noodles so you could fill up. They tasted like they were doused in salt  The shrimp pad Thai was tasty, but had literally 5 pieces of small baby shrimp on the entire bowl. For a $16 dish, I expect more than that. The crab tacos were good but didn't taste like crab. They tasted more like mayonnaise, hardly any crab. And there's only 3 for $11. The Edamame dumpling was good, but again, a very small portion.The chicken bao bun was okay, again very small portion. The koren BBQ steak skewer was okay, again very small portion. $95 plus tip for a meal that left us barely satisfied and most of which was poorly cooked or just OK doesn't leave a good impression for me! We won't be back."], ["Sabra R.", "I am literally eating with one hand and typing this review with the other, so I'll make this brief. What you've read is true!  The edamame dumplings are so creamy and delicious!  The General Tso's soup dumplings--good LORD!  The chicken bao buns were the only miss.  After I ordered, I noticed that a woman at the other end of the bar had eaten everything but her buns.  I now know why. The thick bun PLUS the breading on the chicken just makes it kind of a clunky and rather bland single note---the complete opposite of the delicate and crazily flavorful dumplings.The crab wonton tacos were not as magical as the dumplings, but there were tasty and had a spicy kick (and I'm generally not a spicy fan). And the more i ate, the more I liked them. You may feel a need to over-order bc the portions are so small.  I did and shouldn't have. The two orders of dumplings along with the tacos were more than enough!If the stars align in my favor, I'll be back tomorrow!"], ["Jacqueline O.", "General tso hot soup dumplings are one of the best apps I have had in this city. Add edamame dumplings, seared tuna and Kim Chee fried rice and you have a meal for for a king. Desert we followed up with the ice cream sushi and s'mores tart making this dining experience truly incredible.  The service was quick and informative. The waitron was great with suggestions and fast to fill the water. No surprise I loved this place considering I cannot be in Atlantic city without going to their sister restaurant Izakaya."], ["Uma R.", "If I could give this place 0 stars I would!!!!!!!! The food was absolutely TERRIBLE, the service was EVEN WORSE!!! Our waiter was so rude and made me feel stupid when I was asking questions about the menu. I personally get sick from seafood so it was hard for me to find something on the menu that did not contain seafood..the waiter made it seem as if it were my fault for coming to a seafood restraint and expecting food with no seafood.  I was left very hungry after my mushroom dumplings which tasted like crap with no taste at all. My cocktail tasted like fruit punch which I was able to drink in less than 10 seconds. My waiter didn't even get a chance to turn around and walk away before I finished my drink and immediately asked if I wanted a second overpriced $12 drink that contained no liquor. He then proceeded to not split our checks correctly (there were only three of us.) If you want good Asian food that is not insanely overpriced go to china town. Our  waiter was insanely condescending and made us feel like we were annoying him and an inconvenience to him. We did sake bombs and stated \"well could you have made a bigger mess?\" STAY CLEAR OF THIS PLACE."], ["Dana S.", "I really would like to give it 3.5 starts but went with for because I was leaning on the up side.  The food was really delicious and the decor was great.  They order in small plates that are good for sharing with the table.  We enjoyed everything we ordered but also probably could've gone with one or two less dishes. I would recommend discussing with the staff before you commit.  No big deal really, I love having left overs.  The cons...it's very crowded which means very loud and tight tables.  We sat at a table that had one side to a bench that spanned a whole wall and the other with a chair and I consistently collided with the bordering parties when I entered and exited.  I would prefer a little more room, even if they had somewhere to take coats in the winter that would free up space.  Overall, a good experience and would recommend."], ["Cara C.", "Wow. Just wow. I came here for date night on a Friday night and first of all, let me say that it is a VERY good idea to make a reservation. This place gets packed. When we walked in for our reservation, the bar area was packed, as was the restaurant, and the hostess was telling walk ins that it would be around 3-4 hours before they were accepting walk ins for dinner. We waited about 15 minutes for the table and got a dink while we waited. Once we were seated, the waiter promptly came up to us and explained how everything works, since this was our first time. He was friendly and knowledgeable but wasn't too pushy or sales-y, which I appreciated. The menu was very simple but everything sounded amazing. We decided to try the chef's tasting, which was $45 a person, but it was well worth it. We were able to pick 1 thing from each section on the menu and it was the perfect spread. The courses came out perfectly timed and I can't remember the last time I had food this good.I'm really picky and judgmental, especially for higher end restaurants and this did not disappoint. The food was phenomenal, the portions were perfect for 2 people and the drinks were creative and tasty. The service was perfect and I honestly cannot say enough good things about Sampan. We will certainly be back."], ["Rob L.", "The atmosphere is good and the staff is friendly.  I have eaten there four times in the last year.  I find the food just \"OK\" and on the expensive side.  For two people and only one drink (just one), the bill was $85 including tip."], ["Dee M.", "Starting off with a suggestion: Try the $45 tasting menu. I had 2 mega skinny 21 year old college students with me  so I didn't consider it. But, their eyes lit up when they saw the incredible variety and my bill wound up being perhaps only $10 less than had we done the $45 per person.  We all  went home with doggie bags without the prix fixe so it would have been an incredible value in that you get if I recall- 7 items. You should have seen the smiles on their faces when they returned back to Temple U with 2 more meals of real food :-)Originally, being the cool mom I am,  I planned dinner at their attached, heavily recommended  GRAFFITI BAR but it was way smaller than I had imagined. Both 21 years olds nixed the idea of eating there when they saw it. So much for Mom finding something hip n cool.  It does however look good for their age group to do a happy hour. Mom too with her friends. We had fried calamari, a chicken dish, shortribs, a la carte veggies. All done to perfection and tasty. Service was top notch.I will be back."], ["Pira T.", "Always love this place.  I think I've been here more than 100 times.  Awesome happy hour drinks and food. I think I come here at least twice a week.  Sometimes the service is great sometimes it's not sometimes the waiter (only this one waiter) will raised his voice at you or tried to correct you.  Nothing is perfect and that's ok. Lol.  It can get crowded so get there early.   They do happy hour everywhere except in the dining area."], ["Eunni C.", "Oh yeah, the best deal for the bucks..... Their happy hour is steal. So good and so cheap. Foods are basically same as their regular menu. Really enjoyed their brussel sprout, Vietnamese sandwich, Korean fried chicken, kimchi friend rice, edamame dumpling in broth and skewers. So so so good. I love to sit at the bar and grab yummy bar snacks. I've been there multiple times and they were always good. Went there for regular dinner and basically got same food and payed more than double so.. Go to their happy hours. It is just amazing deal."], ["Doina N.", "While Asian food is not my preference, I definitely enjoy eating at this restaurant. I haven't been here two or three times but many, many times. Sampan is a very sophisticated restaurant with a delicious menu. The decor inside it's really beautiful which has the Asian vibe. In the back, there's graffiti bar who gets crowded easily but people do not mind standing and enjoying their drinks. They have amazing deals not only on the happy hour menu but also on their dinner menu. Chef's tasting it's $45 per person. On the happy hour menu, I usually love to order the pork and edamame dumplings, kimchi fried rice and a glass of wine for $4 bucks. I can guarantee that anything on the menu is exquisite. Not to mention that service is extremely fast. It is a perfect place for a girl's night out, happy hour, intimate dinner with the loved one or with whomever you feel like. :)"], ["Sneha K.", "I came here for restaurant week with a group of 14. They offer the chef's tasting menu at a discounted price during restaurant week. However, they made us order collectively such that we could only order 7 dishes of appropriate portions for the table instead of being able to pick whatever we wanted or even 14 different dishes. I absolutely loved the Brussel Sprouts, the Chicken Bao Buns and the Korean Fried Chicken. I also enjoyed (for most part) the Peking Duck which comes with delicious Scallion Buns but I found some pieces of the duck to be too rare for my liking. If I were to come back here, I would skip out on the Pad Thai, which was kind of bland. The meal ended with some very unique soft serve mini-cones that were so fun!Overall Sampan is a great experience with a variety of dishes for everyone. Their vegetarian and gluten-free menus have some amazing options for all your dietarily-restricted friends."], ["Amanda C.", "Best Happy Hour in the city especially if you want to eat good food for cheap. It's a good place to come with a date or a friend to share plates and have some wine or beer. You can order about $20-$25 of happy hour food and it serves as dinner. I like to order the kimchi fried rice, it comes with shrimp and a fried egg. You can get skewers of shrimp, beef, or pork. I like the lobster and shrimp dumplings, the edamame dumplings, the crispy Brussels, and pork belly sliders. Really you can order almost everything and it is very good. I came here for the $45 tasting menu and I feel like we ate the whole menu. I think the tasting is an excellent deal. I really liked everything we ordered except for the pad thai and the dan dan noodles(nothing compares to handy nasty!). I would go back and do the tasting again right this second if I could. The little ice cream cones at the end of the meal are adorable. Staff is great, knowledgeable and non-obtrusive. Graffiti Bar is fun in warmer months, but it can get extremely loud and crowded at times. I would definitely make this a priority restaurant, and I would recommend the happy hour for everyone."]], "Original Dim Sum Garden": [["C C.", "I returned here with my boyfriend because he was craving some dim sum. As I tried some new dishes, I realized that most of what I had was more of a three-star than a four-star rating.We had the steamed pork soup dumplings and scallion pancakes again, and they didn't disappoint. This time, we also ordered a dish of seaweed, which was really salty--it made the tea taste sweet. The seaweed and egg soup was also on the saltier side, but not as extreme. Although it's called an egg drop soup, it looks like the cut the egg into strips after it was cooked to resemble the seaweed more. Although it was more visually appealing, the egg tasted a little hard. One thing I do enjoy about the soups I've tried is that they aren't thickened. We also tried the sweet potato cakes, which were fried and crispy on the outside, chewy on the inside, and filled with red bean. While I did like them, they were too greasy for my taste.Overall, the dishes here tend to be too salty or too greasy for me. However, the staff here are always super-friendly, prices are reasonable (this meal was $20 including tax), and complementary tea is always a plus. This isn't my favorite place in Chinatown, but I don't mind going with my boyfriend when he's in the mood for some dim sum."], ["Ilikeboa C.", "Read all the reviews about how awesome their soup dumplings was and got all excited. We ended our trip in Philly with a taste of China and left a bit discontented.The experience and the service was overall \"ok\" but I guess the overhype of the food killed it especially when a long tiring day did not meet its reward.We ordered soup dumpling and YangZhou(Yueng Chow) Fried Rice.The dumplings had too much dough and it was a bit hard to chew off the top. I am not sure if their vinegar sauce was specially made like most other Shanghainese cuisines, this place gives you a bottled vinegar. Usually Shanghainese cuisine serve the vinegar sauce in a cup with ginger and they tasted so darn good with the soup dumplings. Obviously it was not the case here.The soup part of the soup dumpling was so plain I thought I was tasting water.YangZhou Fried Rice came with a big portion and I was so full that I couldn't stand straight. I was full but felt empty. The dish tasted plain and nothing like what I had before. I appreciate the fact that no MSG was added but at least pour some salt or something.This review might be a bit biase since I am never tried  their dim sum. For those who didn't know, dim sum is part of the Cantonese cuisine. Soup dumpling is part of the Shanghainese cuisine. One just can't be good at both.For those who are visiting NYC, try Joe's Shanghai. Their soup dumplings are genuine."], ["Alex L.", "Dim Sum Garden is definitely a hidden gem.The Good: Not your typical dim sum! The food tastes incredibly fresh and most items are handmade in the kitchen, not shipped in frozen bulk packs from dumpling sweatshops in Mexico or whatever. Try the Xiao Long Bao and other dim sum dishes, you'll taste the difference. DSG's service is exceptional as well -- the servers are attentive and staff members are friendly and accommodating! (They only speak Chinese.) If you're looking for the authentic Chinese experience, look no further.The Bad: They don't have the cute little carts. Boo.Apparently they are unrelated to the new Dim Sum Garden which just opened on 10th and Race? Regardless, completely worth going!"], ["Alyssa R.", "My mom and I went late in the evening and was expecting food to be somewhat \"old\" and just reheated but we were WRONG! As soon as we walked in, we were greeted with a smile and a menu. I told the owner(?) that I wanted food to go and he smiled and said that's fine (small language barrier but not bad). The food, we just got chicken and friend rice to be on the safe side but now I wish we got more food!!! Clean restaurant, clean kitchen and food tastes and is freshly made. Wonderful service and great tasting food. Definitely a hidden gem!"], ["Robert P.", "Don't eat here it's not the original. They moved around the corner. You couldn't pay me money to eat here again. The real Originals should sue"], ["Sophia L.", "Accidentally came here instead of dim sum garden but pleasantly surprised. They're best item, soup dumplings!! Other stuff is only ok"], ["Jonathan T.", "Okay, I've seen a lot of straight one star \"not original DSG, goto 10th and Race\" by people, half of them have just one review so I'm going to ignore that.  I've heard another side of the story, where the woman who runs the 10th and Race operation had half the stake in the company and decided to spin off and do her own restaurant.  To be honest it doesn't make a different to me; if you serve me good food I'm happy, restaurant politics aren't factored in my review!Unfortunately I might still come off as biased when I say I think the \"original\" Dim Sum Garden makes better xiaolongbaos (soup dumplings) than the new restaurant, at least of late.  The preparation is of higher quality with the skin being nice and thin, the meat tender, and the liquid plentiful.  Scallion pancakes were solid, just the right amount of greasiness and fried doneness.  I also got a cold duck appetizer which was pretty delicious as well.I also appreciate the effort to spruce up the interior of the restaurant.  Yes, it's still underneath an overpass that is part of the convention center, but they've replaced the cheap, plastic IKEA tables and chairs with less cheap, wooden but probably still IKEA tables and chairs.  They take credit cards whereas the 10th and Race location does not (at least as of a month ago).Don't count out this location.  I personally don't care if it's old, new, original or a ripoff ... if somebody were to come up to me and ask for the best soup dumplings in Philadelphia I'd say this restaurant takes the cake [for now].  The only downside is I have to eat more soup dumplings to keep the pulse on both restaurants, poor me :)"], ["Alex P.", "It was ok.  Its right next to the Wawa and Greyhound bus station.  They had a variety of juicy buns and they had bubble tea.  It actually wasn't cheap.  Each dish was $5-7 for the dim sum.  And they didn't have shumai or beef noodles.  They noted that they were Shanghai style only, no Cantonese."], ["Pingyi L.", "Don't let the location fools you. How can anything good located right by the bus station. But Dim Sum garden is super authentic!  The soup dumplings were juicy and well seasoned.  Don't forget to also try the beef noodles. The noodles were freshly home made with perfect texture. The beef noodles were tasty and reminded me of home!"], ["Julie C.", "This place has amazing dumplings. You can not go wrong with their steamed soup pork dumplings. They are so juicy and delicious. The food comes out quick and it is always great. Also, the scallion pancakes are my favorite amongst all others that I have had in University City. I know what you're thinking...alright, what's so great about scallion pancakes? The ones at Dim Sum Garden are layered and are not thin, yet still deliver the flaky texture that is a necessity for scallion pancakes. The ambience in there isn't the best and its in desperate need of a revamp, but it doesn't seem to matter too much to me because the food is great."], ["Grace S.", "So the owner of the truly original DSG contacted me and it appears this storefront was sold to a new owner last year who renamed the place \"Original Dim Sum Garden\" (which I admit is misleading).  I'm migrating my review to the new storefront which is apparently located at 1020 Race Street."], ["Justin D.", "First impressions were a little unnerving: the seating area consists of about 7-8 tables with an unusual fro-yo section in front of the counter. I ordered a bubble tea to start off and I have to say, not good. While I got a traditional milk bubble tea with pearls, I saw the man behind the counter putting the powdered base into the plastic container. The taste was similar: chalky and unappealing. So sad because milk bubble tea is one of my most favorite beverages and it is so easy to make.I ordered the sesame seed chicken for dinner. My friends gushed on the soup but the chicks was quite sweet. The rice tasted like minute rice, right out of the microwave. Not a bad experience. I was filled up and took respite from the cold. But it could be better."], ["Nick C.", "I am so happy to see this place reviewed well!  I have eaten the Soup Dumplings on so many occasions, but recently sat down for the full monty.  I LOVE THIS PLACE EVEN MORE!  Super friendly atmosphere, food comes out as it is cooked, incredibly reasonably priced, and absolutely delicious.  Five Stars."], ["Caliope S.", "Delicious fried pork rice. Didn't try enough varieties of dim sum to rate that. Place looks bare bones, but service was quick and friendly, and prices seemed fair. I would return if I found myself in the area again on business."], ["Luna A.", "being from nyc, i had high expectations for this place... and they exceeded them! i almost wish i could move this place to the city! super quick great service and amazing dim sum.... really not much else to say. make sure you tip these guys they really deserve it."], ["David S.", "Placed an order maybe 15 minutes after they opened, and the delivery took over an hour to arrive.  When I tried to call to see about the status of my delivery, I was met with confusion and a lack of any real help or clarification.  This all seems especially inexcusable when I only live a few blocks away."], ["Neal C.", "I really wanted to love this place-- authentic Shanghainese food, really friendly owners, and very reasonable prices, but unfortunately I was not very impressed with the flavor of the pan-fried pork buns (sheng jian bao) or steamed pork buns (bao zi). The bao zi were actually frozen, which was very disappointing that they don't make it fresh, but the pan fried buns were made fresh (it took roughly fifteen minutes, which was fine with me). That being said, there wasn't too much pork or soup within to really stand out, so I ended up tasting more dough than anything else. The bottoms of the buns were very crisp like you'd want, but it was very oily as well. Maybe I should have just gone with the XLB, but it's so hard to find anyone who sells pan fried pork buns with soup, so I couldn't resist. It's worth the visit to chat with the owners and enjoy authentic shanghai cuisine, but I suppose you should try the XLB or other dim sum items."], ["Lisa B.", "Went here for a late meal on Labor Day holiday. In summary: good was great, service was deplorable. The food was flavorful, quick to arrive and generous for the price paid. Between two hungry people we ordered the pork soup dumplings (large and plump, good but not outstanding broth), stewed chicken over rice (deliciously tender and juicy, served with baby bok choy), ma po tofu noodles in soup (very good) and Chinese broccoli cooked with garlic (standard, but good and fresh). However. The service. Rude and belligerent to the point where I actually thought the server was joking. Unfortunately not. We had difficulties asking about the types of noodles they had (apparently the fact that we didn't know the Chinese names for a flat rice noodles vs vermicelli rice noodles was something we had to decipher for ourselves instead of him just indicating which one we could get, this took maybe five minutes to negotiate with him). At the end of our meal we asked for the rest to take home, which they gladly complied with, however when we requested a second plastic fork they refused. I mean, what does a plastic fork cost you, a penny!?! I couldn't believe it. Anyway. All up our bill was around $32 including a tip the server didn't really deserve. This was for a huge meal with leftovers. Amazing value, shocking service. If you want a quick snack on the go then it's a good location. Just be prepared for service that's ambivalent at best, straight up rude at worst."], ["Tammi T.", "My colleague who's a local brought us here for the awesome xiao long bao. It's not a fancy place but really good and juicy xiao long bao  at a reasonable price. Will definitely come here again the next time I'm in town."], ["Gina P.", "My favorite Dim Sum place in Philly. Always recommend the soup pork dumplings! And you really can't beat the price!!!"], ["Brandon D.", "Saw the LINE COOK ACTIVELY VOMIT while working on the line. She didn't miss a beat: spat on the floor to clear her mouth, then got right back to cooking- no hand washing, sanitizer, bathroom breaks; nothing. I've lived and traveled in Southeast Asia for three years, ate peasant food in Nepal, and pride myself in eating at places run by cooks who practice questionable hygiene. This was entirely different. Pros: Price is okay; probably don't have to tip. Cons: Vomiting cook, flavor wasn't anything to write home a bout.."], ["Matt E.", "Hands down the best place to go for dim sum in the city (don't confuse this one with the one on Race Street). Definitely order the soup dumplings when you go here....they are made perfectly and do not break apart when you pick them up. I also recommend their duck noodles and bok choy. The service here is extremely friendly and you cannot beat the prices. All in all one of the best meals you can get in Philly."], ["BJ M.", "Fried pork soup dumpling is the best, and the pork pocket is also delicious. Good rendition of mapo tofu and pork with sauce noodles. Bok choy is also really good. Not as refined as some other dim sum gardens but really who cares. The taste is what counts."], ["Christine E.", "It's cheap, and it's decent food for a cold, hungover-laden Saturday afternoon. Nothing was amazing, yet nothing was bad. If I could personally give 5 stars to the steamed beef dumplings, I would. I recommend checking this place out if you want an inexpensive, fast, and un-fussy Dim Sum experience."], ["Pete M.", "What great dumplings and noodles! Shanghai soup dumplings and handmade noodle with pork are best I have had!Very affordable pricing and good service will definitely be coming back"], ["Jon E.", "Soup dumplings (pork), scallion pancake, brisket noodle, and a side of bak choy. Fantastic meal, quick service, cheap ass hell, and consistent quality. I never deviate from this lineup but wouldn't be surprised if everything on their menu is delicious. Much respect to Dim Sum Garden."], ["Kermit T.", "So I don't give away  stars easily, but this place earns a 4.5. I feel like I've never eaten good dim sum before. Every dish we ordered  (and there were 7 of us sharing all kinds) was excellent. Soup dumplings are a must, steamed and pan fried dumplings are sensational alike. Also try the sweet potato"], ["Thomas G.", "Original in name only.  After many satisfying visits to this restaurant three of us agreed last night's meal was the worst we'd had, not only here but in a Chinese restaurant generally.  The signature shanghai soup dumplings were tepid and lacked flavor.  An order of steamed dumplings with pork and chives was inedibly gummy.  None of us had ever had worse dumplings...anywhere!!  The chicken on a stick was overcooked to the point of turning into wearable moccasins.  We will never go back."], ["Kristin H.", "I've been hitting the really yummy food jackpot lately! And it's about time since I've walked by Dim Sum garden, like, a million zillion times.So, a zillion years ago, I tried Dim Sum while living in Chicago and I hated it. It just wasn't that good, leaving a friend and I sitting there asking ourselves \"Is this what non-Americanized Chinese food tastes like or does this just suck?\". I remember the best thing from that meal being a turnip cake, otherwise, I felt like this vegetarian was mostly left hung out to dry. The cool little cart didn't even make it better, either.Although I still don't have the answers to these questions, I am so happy to tell you that everything I tried tonight at the Dim Sum Garden was delicious! I found myself here after a friend suggested that we and three other ladies meet here for dumplings before a show at the Union Transfer. For around $15 each (with tip), all of us gals shared the bok choy, scallion pancake, and a whole lot of dumplings! We all left feeling pretty full and pleased with our food. I'm going to go ahead and say that the scallion pancake was the most tasty for the price ($2.50), but the bok choy was something I could eat an entire plate of (theory almost tested: I shared, but it was mostly all for me). The dumplings definitely held their own. Between the shrimp and the veggie, I couldn't declare a winner because they were so equally good. I might have liked the veggie quite a bit because someone ordered theirs pan fried, which made them a little special. I recommend trying both steamed and fried: each method of preparation gives each variety of dumpling a new taste. Definitely try the different sauces at each table, too, which were soy sauce blends of deliciousness.Our service, the food, and the prices are all great. Dim Sum Garden may be my new favorite place in Chinatown! Yeah! Keep it growin', guys."], ["Sara S.", "DIM SUM GARDEN!!! GO! EAT DELICIOUS DUMPlINGS!!!! Ok- back to using my indoor voice.My love/dining companion and I have been coming here for years and I can't believe I haven't submitted a review. Each visit makes me excited to return.Items that you must order to fully fall madly in dumpling love:-steamed pork dumplings (soupy goodness awaits!)-pan fried veggie dumplings. They're big time tasty.-Shanghai SiuMai, a lovely combination of sweet sticky rice, pork and mushrooms. -daikon cake (turnip cake as said by the waiter)Something that has really made me love coming here is that when its quiet sometimes you catch somebody hand making the dumplings.And the value is hard to beat.I took one star away because when its busy it can be utter chaos and there is little organization for moments like that."], ["S L.", "Small family place...   Great Dim sum and friendly staff.  Gotta try Number 1 and Number 9.   My wife and I wanted to try dim sum for V- Day!!  So glad we did....   Green Tea was awsome.  If you want good Dim sum this is a must place.  Fast service with a great price!!"], ["David G.", "The food was great. It was so cold in the place that we had to eat with heavy coats on"], ["Jojo Y.", "小笼包不错，汁多皮薄，肉一般。但是锅贴, 上海馄饨，生煎不行。生煎皮太后，而且没有汁。感觉碗筷不是很干净。还不知道和race st. 上的dim sum garden比哪个。。"], ["Cindy C.", "Love their soup dumplings and beef/pork packets. Simply delicious, and everything tastes really fresh. It's cheap too!"], ["Ng T.", "Came here after work with some colleagues for dinner.  I was concerned that we were going to a place for dim sum during dinner time since dim sum is generally brunch/lunch.  After one look at the menu, I realized that this was not a dim sum joint, but a Shanghainese dumpling/noodle place.  Nevertheless, we ordered primarily what we could find of classic dim sum dishes (soup dumplings, shao mai, shrimp dumplings, scallion pancakes), a fish appetizer (a co-worker's favorite) and a beef brisket noodle to fill us up.  Soup dumplings were quite good and the best thing we ordered.  This should probably be more obviously celebrated on the menu because it was the best thing we ordered.  Unfortunately, it went downhill from there.  The shao mai were strangely filled with glutinous rice, which are very startling when you expect a meat filled dumpling.  The shrimp dumplings were a disappointment; the skin was completely opaque (the should be translucent), fell apart when we picked it up, and did not taste particularly fresh.  The scallion pancake was very thick and as a result tasted a little doughy.  The fish tasted like it was canned once and then seasoned (pretty good for a canned job).  The noodles were OK, but too oily for me and sadly did not come with much beef.  The food is not bad if you are not familiar with real Chinese food (certainly better than most take-out joints), but it falls short if you know what you're ordering.  Pros: It's cheap!  Also the service was very friendly.  Apparently the new one is better."], ["Carol C.", "I know sometimes we can get in the mood for just some down and dirty Chinese food, especially if it involves soup dumplings, and even if it means dropping by a shady looking joint under the bridge complete with Ikea furniture. I've been here multiple times, and have willingly sacrified cleanliness and service for some bomb soup dumplings. HOWEVER. There is still a LIMIT to the disgustingness and horrible service one can handle. First of all, we arrived with a party of 6 - maybe a bit large for this tiny joint, because things seemed to have fallen apart after we arrived.1) They left used napkins on our chairs. Not wanting to touch them, I tried to ask a server for a napkin so I could get rid of it, but nope, expecting them to merely hand me a spare napkin was too much to ask. I eventually had to walk over to another table to get a napkin. 2) ONE person ordered out of the six, which apparently terrified the server because she ran away and never returned. After the ONE person ordered, ALL HIS FOOD CAME OUT within 3 minutes, which would've been pretty awesome...IF ALL OF US HAD ALREADY ORDERED. Basically, he began eating his food before our second person even ordered.3) When we got a different server (yes, our server had disappeared off the face of the earth), she decided to take our menus before we even ordered. I had to remind her that only ONE of the 6 of us had ordered and took the menus back.4) After ordering our soup dumplings, she brought out one plate at a time, which is fine. HOWEVER! While we were eating out of one of the plates, she came by with the second batch, and placed them ON TOP of the one we were eating out of. ARE YOU SERIOUS?! 5) While we were searching for any server to get our check at the end, I witnessed the main worker work the register, then wipe her greasy forehead, walk over to the kitchen, and pick up the food with her BARE HANDS and place them on plates before serving it to the table next to us. Honestly, Sakura's dimsum might be a little more pricey, and a little too clean for when you're in the mood for cheap Chinese food, but it is definitely worth it if you're avoiding the risk of getting hepatitis/food poisoning/frustrations from the filthiness and stupidity of Dim Sum Garden."], ["Isaac N.", "Loved it!  We visited Phili last week and went for dinner.  The service, hospitality, food, flavors and price everything was Awesome.  I highly recommend them.  Don't forget to try the dumplings."], ["Cort M.", "Service was excellent.  Dumplings with soup inside?  Try them...you will love them.  We also had shrimp dim sum and scallion pancakes.  We each had a bowl of soup, one beef and one chicken.  We were stuffed and couldn't finish all the soup.  The broth was just right.  Didn't need to add a thing.  Added the ginger sauce to the scallion pancakes and then went from excellent to brilliant.   We will definitely eat here again if we return to Philly."], ["Seema F.", "This place is very overrated, which is strange since it's a dingy little place under the overpass by the convention center bus station. It's not really a a dim sum restaurant like the name suggests. The actual menu has standard Chinese fare and the dim sum menu has about 18 items, many of which are not even dim sum (scallion pancake, french fries, and a fried chicken and fries combo?!) We ordered scallion pancake, panfried chives and pork bun, Shanghai crab and pork juicy bun (xiao long bao), shrimp dumpling, and shanghai siumai.The pan-fried chive buns were decent, but a bit small.  The scallion pancake was crispy, but fairly standard.  The shrimp dumpling was the most basic dumpling you can get. It was just a piece of shrimp in a steamed wrapper. Not very good. The shanghai siumai was very interesting--it was a purse shaped dumpling, rather than the standard siumai shape, filled with what appeared to be rice and meat.  The juicy bun was about the best thing there, but with the tiny plates and spoons, it was difficult to eat without spilling everywhere.  My only other complaint is that the tables have chili sauce, ginger sauce, and dumpling sauce, but no soy like all the other dim sum restaurants seem to have.  I like all those sauces, but I really need soy for certain dumplings.Overall, it's a ok place to grab a dumpling while waiting for the bus.  The juicy dumpling was good, but it is nothing I would go out of my way for."], ["A R.", "Just wanted to update, I am told that the business receiving the good reviews closed in 2013 and another place opened with the same name in the same location.  The review I left is for the new business"]], "Buddakan": [["Peter N.", "Good take on Asian Fusion.  Buddakan keeps the food somewhat traditional, and adds flair to the dish as opposed to a full on twist. Crab fried rice (served inside a crab shell!), steamed dumplings, spring rolls with a wasabi mustard... Simple, yet elegant.  Service is well (as expected from a place like this), portions are generous as they encourage sharing, and decor is swanky. So whether it's date night with a spouse or spouse prospect, or friends just catching up - Buddakan works.  Well played, Stephen Starr."], ["Abby B.", "While we had to wait quite a bit for our table despite making reservations, we enjoyed some drinks at the downstairs bar while biding our time.Service was impeccable from the start. My favorite food items were the edamame dumplings and the sea bass. Oh, the sea bass - so delicious, and this coming from a person who is not a huge fan of fish.You owe it to yourself to come here at least once in your life."], ["Rose M R.", "Okay so let's start w the atmosphere:It's beautiful, elegant! I mean you walk in & have a waterfall through glass as soon as you come in through the 2nd set of doors! Let's talk service: WOWWWW! I mean I had set reservations for today & they were so KIND & HELPFUL! I mean did I say helpful? LOL!! They ask for your coats to be able to store them away while you dine! Which is a PLUS in my book! Let's talk FOOD: Okay soooo here is where my downfall comes & I did say MY DOWNFALL just because don't get me wrong I loved the taste! The seasoning on THEYRE food is exquisite & very tasteful , fresh, JUST how it should be! I think I'm just so picky on having dishes cooked a certain way that no matter how much I try, I just will refuse to accept another way lol!!! Once again the food is great (IM JUST PICKY)Our waiter:Was amazing!! Extremely helpful! When he noticed that we weren't pleased with the first plate he absolutely offered to bring us something different! I mean he went FAR & BEYOND to make sure we left satisfied & happy ! As he should! So AMAZING 5 STARS from me on this restaurant & EMPLOYEES!!"], ["Jennifer R.", "My favorite restaurant hands down. Bad none. Been several times. Always impeccable service. Food is great. The wasabi encrusted filet is my absolute favorite. The little donuts for dessert is great too. Can't get enough of time place. Beautiful ambience. Great service. Amazing food. What's not to love?!"], ["Mike Z.", "Hands down one of the nicest restaurants in the city. I have been coming here for 15 years and have never had a bad meal.  It does not matter what the occasion is, whether its a bday, valentines day or just a happy hour, you cant go wrong.  Really cool ambiance with a huge boodah on the wall with candles over looking the main dining room.   They also have an upstairs with its own bar.  The service is it outstanding, they go above and beyond for their guests to give them a true fine dining experience.  Some of my favorite dishes include: edamame dumplings, tuna sashimi, calamari salad, cauliflower, cashews and wasabi mash potatoes to start. Entrees include: aged beef, sea bass and angry lobster.  They make really good strong drinks as well.  If you are from out of town, or dont live in the city and have never been here, I highly recommend this place."], ["Des R.", "I've never been disappointed with Buddakhan. The food was excellent & the ambiance is always enjoyable. The surrounding guests were even a pleasure. It's the first time I'd been with a group & everyone enjoyed their food & we were happy to have enough to share & sample."], ["Jessica S.", "I have been coming here every year on my anniversary for the last 5 years but something was just different this year. We always leave feeling completely stuffed and in food heaven but this time we were mildly underwhelmed and bummed that we hadn't switched it up and gone somewhere else. Maybe our expectations were too high.. or maybe the place has just lost its flair. Either way, 3.5 stars seems appropriate.We had a reservation on a saturday night and were seated a few minutes after arriving. I wish they wouldn't seat people who make dinner reservations in the lower bar area.. I would much rather prefer being in the dining room atmosphere than feeling like I'm at a lounge but oh well, not the end of the world. After ordering drinks, we started perusing the menu-- we were so excited, like kids in a candy store! Too bad this was short lived. We started with 2 appetizers, the tuna pizza ($16) and the rock shrimp bao buns ($18 with one extra). We have gotten the bao buns before and they are really good. The shrimp are crispy and spicy and the bao buns are fluffy. We opted to get 4 instead of the 3 it comes with (really, an appetizer with 3 pieces when most parties are 2 or 4 is just another way to make money!) which tacks on an extra 3 bucks to the price. It's worth it though to each enjoy 2 of them. We usually get the edamame dumplings as a second appetizer but we decided to try something else, so we got the tuna pizza. BIG. MISTAKE. This was completely bland, uninspired, and so disappointing to eat that we *almost* said something to the waiter (but I hate complaining, so we didn't). Ugh it was so boring that I'm having trouble remembering it to write about. Now to the main courses..We got the sea bass ($36) and the sizzling short rib ($26) with a side of wasabi mashed potatoes ($9) for our main course. The sea bass was delicious, tender and flaky.. melts in your mouth. The short rib entree was subpar. The ribs were extra fatty and pretty unappetizing. We have gotten the short rib dish there before and it has definitely changed over the years.. it used to be amazing but it has definitely changed for the worse. I'll give them that the noodles that it came with were very flavorful.. I would have rather had a whole plate of those than any of the short rib! The wasabi mashed are usually one of my favorite parts of the whole meal, but even those didn't seem as creamy and spicy as usual. We did get dessert because I needed a pick-me-up after the underwhelming meal we had. We got the trio of sorbet which included coconut (yum), butternut squash (gross), and chocolate (good). Butternut squash should stay in the vegetable category.. not sweet enough for a dessert. Overall, a bummer of a night. We will not be back for our next anniversary, sorry Mr. Starr!"], ["Paul G.", "Was in Philly this weekend and we went to Buddhakan to eat, first off if you are allergic to shellfish don't eat here literally everything they have has an oyster sauce on it. We ordered the Cashew Chicken which was extremely bland and i got the black pepper steak and it was so peppered i basically couldn't eat it. The pork dumplings were good and so were the drinks but the entrees were very disappointing. Finally we ordered the Chocolate Box for dessert which also was disappointing, we ended up eating only the banana chocolate mouse and Mango cheesecake the rest were horrible. So i left Buddhakan paying $150 and still hungry. The worst feeling is leaving a place and saying wow that was a complete waste of my money."], ["Cammy W.", "Amazingly good! This restaurant is excellent. The food was spectacular. Can't go wrong with any of the plates they offer!"], ["Nikki C.", "Very nice ambiance and service! I had the shrimp lo mein. It was pretty tasty, but not what I was expecting. I would go back, but no time soon for sure."], ["Christine H.", "The atmosphere in here is beautiful. When you enter you are greeted by a water fall and friendly hostesses. The decor and the long table leading up to the giant Buddha statue are understated yet gorgeous. Now onto the food :)The Rock Shrimp Bao: This was delicious. The rock shrimp had a light crispy outer shell. And the sauce was rich but the pickled slaw topped with the jalapeño cut the richness perfectly. The flavors were layered well and the shrimp was succulent and fresh. The Miso Black Cod: There's an over powering taste of unagi sauce and not enough of the salty miso that I was anticipating. Overall the fish was on the sweeter side as it was covered in the sauce but paired with the bok choy, shiitake, and the smokey tasting daikon in one bite, it was delicious. I also wished they served the fish skin side up so that I could have the seared crispy skin!Overall, it was a very enjoyable experience!"], ["Sunny W.", "Amazing restaurant! I've been here twice with a friend, and we enjoyed it both times. Overall it is a fantastic choice for a date or a night out. Pros:- Awesome food- Well decorated restaurant with great, trendy ambience - Great serviceCons:- A bit pricey (just means this can't be your regular dinner place)- Did not like the infamous Edamame DumplingsRecommends:- Sea Bass (omg....)- Dessert Bento Box - great value for just $15. I think there were 6 desserts in it, each of them very \"fancy\" (i.e. pricey by themselves). Tastes amazing. Great for sharing with a date or friend."], ["Sari A.", "Went there few times, once we were seated in front of the huge Buddha statue. It was COOL! The restaurant is spacious and lovely ambiance, good for a date as well ;) Food was delicious with family size portions if you wish to share. You will not be disappointed. it's worth the price.Four Yelps!"], ["Georgiana W.", "My friends and I came here for a girls night last night and we were quite pleased! The food was absolutely delicious! I had the cashew chicken which was tender and cooked to perfection, and not overly saucy. They say the entrées are meant to be shared but we thought them to be on the smaller side of that spectrum (certainly a one person thing if you're hungry). Definitely will be back!"], ["Michael B.", "I went with a group of six and did the chefs tasting. The food amounts are unreal so the value is definitely there!  The food was delicious but the appetizers and small plates, specifically the edamame dumplings, were the best. The main entrees and desserts were ok but nothing amazing. Good place for a group and certainly a good classic Philly restaurant."], ["Nikitha C.", "Great service and great food! $$$ but it's worth it for that special occasion or a date night! We ordered the dumpling sampler as appetizer. Edamame dumpling was delicious! I ordered sea bass which truly does melt in your mouth and husband ordered the lamb chops which was finger licking good as well. I ordered \"Joy\" to drink. Girly yet gave me the buzz. Husband order see rickshaw which was Meh. Dessert we shared crimping chocolate dome. Overall great experience. Very nice ambiance!"], ["Eunni C.", "Excited to try original Buddakan! I've been the one in NYC many times back in the day but haven't been budakkan for awhile and was excited to check out original one. The deco and music were somewhat similar the ones NYC but smaller and more opened space. We were seated in 10min at the second floor and restaurant was packed. Two of us shared spring roll, sea bass and duck. Yum yum yum! I actually though this location has way better food than the one in NYC. I used to go there pretty often long time ago but not for their food. Never impressed with their food except dessert but I did enjoy every dishes at this location. The portion was generous and I actually liked the light at the restaurant wasn't too dark. I like to see my food and appreciated! Very impressed ;-)"], ["John C.", "Would I come back - no.Would I recommend - yes.Food - 3.5Service - 4.0Value - 3.0Ambiance - 4.0First dinner experience while in Philadelphia.  Walked in and decided to grab a bite at the upstairs bar.After deciding on some small bites the condiments were not doing it for me as I was looking for some spice.  Shannon (the bartender and great Gal) was nice enough to ask the kitchen for a spicier sauce.  The sauce that she brought back was Amazing!  It took ALL the food to another level.Unfortunately the sauce is not on the menu but if you don't line this up, you are really missing out.Keep in mind I decided to eat here vs. Morimoto.  The proprietor owns 10+ restaurants in Philadelphia and would love to try others hence, no on the return.  Actually, would go back for a drink and say Hello to Shannon."], ["Benjamin C.", "Awesome food, great atmosphere, nice beer selection. Had the \"dip sum\" donuts. They're a must try!"], ["Esther T.", "My husband took me here for a birthday dinner. We live in NYC, and we have one at home (we don't love that one). Buddakan is my fave restaurant, and people say Philly is the best. We had a reservation, so we were seated right away. We ordered a lychee martini and Buddha's Cup. Lychee martini was not good. Tasted like straight vodka. Not much of a lychee flavor at all. A far cry from the lychee martini of AC which is the best I ever had. Buddha's cup was better, but needed something like more citrus to give it some life. We also ordered a Zen-gria later on, and it was the best drink, but still lacked a little something. Was definitely pretty though. For appetizers, we ordered crispy calamari salad, edamame dumplings, and peking duck buns. Crispy calamari salad was great, and edamame dumplings never fail. Peking duck buns I thought was a waste of stomach space, calories, and money. The point of peking duck is to get a piece of that crispy duck skin which didn't exist in these buns, nor much of any duck. I could've bought literally 12 of these buns in NY that would've tasted 100 times better. But hubby wanted it.For entrees, I ordered the dungeness crab sticky fried rice, and hubby ordered the char grilled aged beef. They were definitely both great, but hubby's dish was orgasmic. The szechuan fries and all the flavors were amazing. He always orders the better entree on my bday dinners.We were stuffed, but we had to have dessert. We ordered the dip sum donuts because I saw it on \"Best Thing I ever Ate\" on Food Network. They put a sparking candle on it for my bday which was nice. It came with 3 dipping sauces. They were pretty good. I wouldn't say the best thing I ever ate. So overall, a good experience. As for the service, the waiter was attentive, but at the same time it wasn't like he cared. Kinda like ask you something, and is gone before you can answer. But he gave me complimentary chocolate truffles to take home for my bday which was nice. I've tried all 3 Buddakan restaurants, AC is #1, and Philly makes #2."]]}