{"Zesty's": [["Michael H.", "Came to this restaurant after peeking at the menu online while looking for good dining in Manayunk. First off, the name Zesty's reminds me of some cheap wing bar. When you walk into this place, it's a mess. The decor is cheesy, unwelcoming. The restaurant seemed confused. However, the food was decent. My girlfriend is Greek, growing up in a family who owned a critically successful restaurant in Greek town of Baltimore. My expectations are somewhat lofty. We have both had a lot of great Greek food. Zesty's was good. The octopus was cooked and seasoned well. The hummus was great. My girlfriend ordered the crab cakes, which were solid but not spectacular. I enjoyed th Arni Souvlaki. Rice was just what I expected and the lamb was juicy and flavorful. Our server came off as pretentious and rude when my girlfriend tried to relate by telling him she was Greek. The food also took forever, and we were one of three tables in the entire restaurant. Not sure if I'll be back. Even though the food was decent."], ["Laura B.", "$5 sangria Saturday (huge, delicious sangia), and the best calamari I've ever eaten.  Cute church pews for booths.  Definitely good."], ["Dave H.", "Zesty's[1] is bigger than a breadbox.A bar dominates the left dining area, which is surrounded by booths and light tables. On the right dining area (towards the kitchen), there are more tables and booths. The place is well-lit (a plus, for me), and windows provide an expansive view of Main Street Manayunk, perfect for staring out in an angsty manner.Last I was here, I co-hosted a happy hour, and didn't run into any issues. Bartender Sophia served our crew with a smile, getting us appetizers (try the mussels), shots (Jameson, of course), and drinks (heard their vodka and Red Bull was potent). Runners moved food from the kitchen to customers with nary a delay.Thanks to owner Tom for his hospitality![1] Supposedly Munk & Nunn now - half the place is church-themed in a non-kitschy way - but Zesty's web site still exists, as does their signage from the street. SO VERY CONFUSING"], ["Denise H.", "I gave 2 stars because I thought the service and the atmosphere were good.  It's a cute little place.  I did not enjoy the food.  I got the Greek sampler but ended up picking at it because I simply didn't like it.  If you enjoy Greek food, this could be your place.  Hey, maybe it is the best food in the area for Mediterranean dishes but I just don't think it's my thing."], ["Moira H.", "I am obsessed with their balsamic vinaigrette that they use on their Greek salads. Besides the Greek salad that I always get, the rest of the menu is great.  A few good vegetarian options and a ton of fish.  The decor is horrible.  It's like they can't decide what they want to be. My one complaint is that last time there wasn't a bartender who knew how to make drinks.  At times they have a cocktail list and others not.  They should ALWAYS have a list."], ["Vaughn B.", "I love that Zesty's menu has a \"traditional greek\" section.  Usually I have to ask the waiter to point out their most popular traditional foods.  The food and service was great"], ["Marissa D.", "This was my second time there and I will never go back. They are very disorganized. Our waitress was nice but very slow and could not multitask well, which is important as a server. They were out of several bottles of wine we were interested in and didn't actually get drinks until being there for 45 minutes!! Then the food took forever even though the place was empty. When we did get our food it was only mediocre and I love Greek so it was really disappointing. We spent a frustrating 2 hours there so if you plan to eat there make sure you clear your schedule!"], ["Randall B.", "The Gnocci with the Gorgonzola Cream Sauce was amazing! Almost wanna be vegetarian coming to this Greek Restaurant !"], ["Chris M.", "This place is OVER-looked.Go in for dinner. The bartender CANNOT be friendlier if he tried.. truly, probably the friendliest bartender we've ever had in Philly.Decor is cool, runway lights on the ceiling.. and a classy bar. You're thinking typical Greek Sandwiches. No, this food is Authentic. I highly recommend sticking to the Greek, and order many plates.. you won't regret. The quality is A+. We ordered the Keftedes, Iman, Patzaria, Aginares a la Polita, Hummus and Greek Pizza, so good. Go for lunch, think dinner menu might be a little higher in $ (my only negative). But the Greek Food Quality cannot be beat."], ["Gavin S.", "The place was packed on a Saturday night. We had to sit by the door, but even the draft couldn't ruin the fine meal I had here. We began with the hummus, which was as good as others have stated. For the main course I went with the Chicken Lefkadas, which is chicken breast stuffed with fresh spinach & feta cheese, served on top of mashed potatoes and green beans, with mushroom cream sauce. Amazingly tasty. My guest had the Liga Apo Olla, which while filling was a bit less inspiring.For dessert we tried the baklava cheesecake, which was good, but I would have preferred straight baklava, as cheesecake to me is a bit tired.The atmosphere/decor was quite inviting, with inventive use of lighting, including colored lights of the ceiling. Our server Sophie returned often to refill our glasses. I don't understand all the losers here complaining about it being overpriced - one joked about going to Burger King instead - maybe that tells you something. (FYI the nearest Burger King is on Chelten Avenue in Germantown.)Final note - there are two bars here, making it a fine place to imbibe your favorite libation in style. I had not seen it since the renovation but I am sure I will return soon."], ["Lia L.", "We eat out very frequently and this was by far one of the worst experiences We have EVER had. I ordered a special grilled shrimp salad and when it came out it was completely rancid. Nice, serve a pregnant girl bad shrimp. When the waitress sent it back to the kitchen, she said the kitchen agreed it was bad and that it was \"the dressing\". Since when do you use dressing that smells like bad shrimp? So I ordered an appetizer instead. It took 45 minutes for my appetizer to come out. Obviously everybody was long done with their meal. The worst part was when we got the bill, they overcharged us for the app! We asked to speak to the owner who came to the table to introduce himself at the beginning of the meal, but he refused to come out!!! Can you even?!?Also our waitress never refilled our water a single time. Why I don't like to say all bad things, everybody else enjoyed their entree once the smell of bad shrimp dissipated from the table. Also after we complained about the overcharge for the app, the waitress removed the item from our bill altogether (why was this not done immediately or at least a dessert sent out after the terrible meal/experience??)Overall, weird decor, weird smell, bad service, very very very overpriced too. Not sure how this place survives with all the competition and the way they do business. I would never recommend anybody go here!"], ["Tabitha S.", "The level of service at this restaurant makes it abundantly clear why there were only 3 tables of diners on a Friday night. Actually, using the word \"service\" for what we experienced is a stretch. This restaurant doesn't have a wine list. They have a clunky plastic clad iPad that you have to pass around. The waitress had zero knowledge of said clunky wine list. When one of my dining companions asked for a dry Greek red, she had to go ask the bartender. When she brought the wine however, she didn't even bother to inform us what wine she brought. In addition, she shattered a wine glass across our table. I had glass on my plate and on my lap. No apology. She even tried to minimize the situation by saying, 'oh well, you only have one piece of glass in your lap'. For future reference - the only acceptable number of glass shards in my lap is ZERO. The entrees came out extremely staggered. Three came out, then about 4 minutes later, three more. Mine came out about 15 minutes later after all of the other people had finished their meals. I would have canceled my entree at that point, if I could have found our waitress. No apologies for the appalling service were made. No manager ever came to our table. Nothing was comped. The decor is hideous. They have massive fish in these tiny little tanks. It is sad. The place looks cheap, but the food is so expensive. The real shame is that the food was actually good. The char grilled octopus was amazing. The hummus was great - smooth, creamy, flavorful. No one at our table had any complaints about the food. But after that horrid service, I will never eat there again. And you shouldn't either."], ["Nadia B.", "I went to the restaurant on a Saturday night and now I know why they were only 3 tables in the whole place. The service sucks more than a vacuum!! SLOW. After waiting an hour and asking for the check to pay for the apps and leave, my food finally came out. I told the waiter I could have gotten faster food if I took a flight to Greece and flew back to pa"], ["Lu M.", "Love it here !Always a good meal!Greek salad,mussels and bread can make the meal but everything here is great!Hummus,crab cake and fresh fish all good.Wish the menu was bigger though because I've had everything!Ive been going for years.They remodel and its nice but I like the old decor.Even if you just want to sit at the bar Joe is a pleasure!I actually like eating at the bar because of him!He makes  a mad sangria!Its not Greek but who cares!"], ["Chris M.", "The exceptional experience I had last night at Zesty's actually resulted in a touch of regret, regret for not having tried Zesty's before in the years I've been living in the area and walking by it. Therefore, I would like to express my sincerest apologies to my palate for this unnecessary deprivation of deliciousness. We decided to stop into Zesty's at around 7pm on a Friday night, after visiting a few neighboring establishments for pre-dinner drinks. In fact, the plan was for Zesty's to be but another of our one-drink stops on the way to have dinner someplace else. It was the warm, inviting environment that caused us to stay and finish our night here with dinner. The space is actually pretty beautiful, and boasts a kind of religious theme. There are large posters of interior shots from St. John's (the huge cathedral-esque church in Manayunk), and the booths actually look like real wooden church pews. This accompanied a rustic aesthetic, with hints of modernity, all in a dim lighting. It's really the sort of place where you want to hang out for a long time. The beer selection was pretty good, and most of the beers on tap were decent imports, along with a couple of local crafts brews and the requisite Miller Lite. I had a Franziskaner (properly served in a hefe weizen glass) and a Palm, which I believe is a Belgian ale. My wife had a simple mixed drink, which was made well. The high point of the experience was actually the food. The menu is fairly extensive, with the highlights being Greek specialties and seafood. I made an uncharacteristic decision and went with the seafood special. The special, which was a little pricey at $32 (but was intended for two people, to be fair), was a whole Dorado fish that weighed about 2lbs. It was spectacular. The fish was charcoal grilled, fileted, and had most of the bones removed. It was in a very subtle buttery sauce that just served to accentuate the flavors of the fish. It was finished with capers and a little too much fresh flat-leaf parsley. I generally don't go this crazy with my orders, in fact spending that much on a dish is kind of anathema to me, but I would totally order this again. Finally, I should note that the staff was exceptionally pleasant, and I really liked everyone we encountered there. You should definitely check this place out."], ["Rick M.", "You have to order the mussels, I think they might be the best I've ever had.  Also, if you get the chance, since I believe it might have been a special, get the asparagus soup with crab meat.  It's incredible.The bartenders are awesome, and extremely friendly as well.  Definitely worth a try on Main Street."], ["Natalie B.", "So, I'm not sure whether to review this place as Zesty's or Munk and Nunn, because the menus, business cards, and discount cards refer to it as both. The website is Munk and Nunn. The signs outside are Zesty's, which really confused my friend and me when we were trying to find Munk and Nunn.The inside is very pretty. The tables look like they have marble tops and the seats are pews. There are pictures of beautiful churches, and fish tanks divide the first room and second room.  There's a big bar in the middle of the first room, and the ceiling is decorated with small Christmas lights. The bathrooms were clean and had cool faucets.Their beer selection isn't great and our soco and lime shots tasted pretty watered down, but the bartender was really friendly. My friend and I shared some delicious grilled calamari covered in balsamic vinegar.I had an overall good experience and will definitely come back again, but I can't give it four stars. I only tried one thing, and it bothers me that they won't decide on a name. It's unprofessional and confusing to be both. We spoke briefly with the owner, and he said that he won't change the signs outside because \"people want Zesty's\"? I vote for Munk and Nunn."], ["Liza K.", "We ended up coming to Zesty's when a lot of other Main Street restaurants had a long wait on a busy weekend night.  There was a reason it was pretty empty.  Zesty's menu was very overpriced and a bit confused.  For a Greek place, they had a lot of Italian American food like pasta and pizza.  They would have done better to focus on perfecting their Greek appetizers and entrees, and having more combinations or sampler.  Instead, their food was pretty mediocre, and even on a night when they had almost no customers, they rushed us at every step of the way.  All we wanted was a sampler of different Greek appetizers like Spanakopita, Tiramosalata, Moussaka, etc.  However, each of those dishes was pretty expensive individually and we were not looking to pay $16 for each one.  We settled on a couple of dishes, but felt that we overpaid for such Greek staples.  The portions were pretty small and the quality mediocre.  The tiramosalata was very good - but they made us pay for extra pita when we ran out.  It was also very dark - so we could barely see our food, and there was some sort of karaoke event setting up in the back.    Overall, nothing too exciting and it was overpriced compared to the portions and quality."], ["Kristin W.", "Came by on a Saturday night and squeezed into one of the pew-benches that only gets harder to get out of the more you eat and drink.We started with the Tzatziki and my dinner partners who had recently been to Greece pronounced it authentic and the best they'd found stateside.  Soft pita wedges and flavorful dip - wonderful!My entree was the Arni Kapama - the lamb meat fell off the bone and had a good flavor.  I would definitely advise against the baby lamb chops dish which had a strongly bitter and smoky flavor."], ["Nicole V.", "They have a beautiful dinning room inside so it really sets a nice ambiance for the place. The huge windows allows for entertainment because you get to people watch which is always amusing. The food is pretty expensive. However, it's really high quality. The mussels are cooked perfectly. They were so tender. The sauce they were cooked in was different from the usually tomatoes type broth I am used too. But, it was nice. The greek salad was made with great quality vegetables and a decent sized portion. The hummus plate was also delicious. I do question how one can charge 10 dollars for some hummus and warm pita. The only negative to the meal was the calamari and the bread basket. It's insanely tough. It was pretty disgusting. Most restaurants that give you the olive oil garlic dipping sauce have warm bread. This wasn't warm at all and was extremely tough hard beard. It wasn't appetizing. We finished the meal off with a baklava cheesecake. The cheesecake itself isn't bad. I had high expectations for a nice combination of baklava with the cheesecake. However, I was disappointed. The phyllo dough wasn't even cooked right so it lacked the flaxy texture of a real baklava. Overall, it was a nice meal with enthusiastic waitress who knew the menu  fairly well. I also appreciate the fact they market vegetarian dishes on the menu. Thank you for supporting the vegetarians of the world!"]], "Aya's Cafe": [["SS S.", "Visiting Philly on work and flew in from Chicago. The team at work wanted to go for lunch at aya's as all of us like Mediterranean. 6 of us ended up going. 3 of us ordered grilled salmon, 1 ordered falafel sandwich and 1 crab sandwich and 1 ordered chicken kebab. Were waiting for more than 45 mins and the restaurant was not even fully occupied yet. By the time we got our food, we just wanted to eat, as we were starving. Guess what NONE of the items ordered had any flavor or spices and was not at all good. The salmon was dry and over cooked and the side couscous an vegetables had no flavor. That was the same case for all 3 salmon orders. The falafel sandwich and the crab and the chicken all had the same problem.I have eaten in many Mediterranean places and this is the worst I have ever tasted. Everyone was disappointed and decided not to go back ever again. I have a basic rule - if a restaurant can not grill salmon that proves something !!! All the high ratings here - either those customers ordered something else or they had a better chef. I would go to some other place next time when I am town.Giving 1 star as I cannot pick anything less than that unfortunately. Too bad !!"], ["Farrah A.", "I came here with my parents because I wanted for them to try Arabic/Mediterranean food in Philadelphia. Having travelled almost 2 hours from New Jersey, I was hoping to have a good dinner with them and enjoy our time together before they would have to leave. Usually, before I take them to a restaurant, I like to try it out first. This time, I didn't and I really regret it. First, the appetizer was good. We ordered the Aya's Taster, which included falafel, hummus, baba ganoosh, bruschetta, kalamata olive hummus, and stuffed grape leaves. For the entree, my mother ordered a medium-well cooked kofta meat dish. After waiting almost 30 minutes, she received it burned. When she addressed it to the waitress, she looked at her and said \"sorry, I told them to make it medium well, but they didn't.\" That's it- no \"we are sorry, we'll take it right back.\" The waitress just went around the other tables and completely ignored our table. My mother was forced to eat the burned dish and my father and I ate mediocre salmon dishes. You would think things couldn't get any worse. Wrong. When the check came, the waitress wouldn't honor the coupon I had because we had ordered a special although she said initially that she would. At this point, I'm arguing with her. My mother is upset. The waitress is going back and forth between us and the omnipresent manager. Finally, the manager comes out and apologizes for the bad service and honors the coupon with complimentary entrees we ordered. In short, the restaurant management needs to train their employees in customer service because this experience was unacceptable."], ["Dori M.", "Food - very goodAtmosphere - pleasant and comfortableService - very attentiveUnfortunately, I left with a bad taste in my mouth because while the restaurant advertises with Restaurant.com, they would not accept my coupon saying that because my guest and I had ordered a combination plate (salad-dinner-dessert), there was already a discount given. There was on mention of this on the menu and no visible sign at the restaurant. I see that another customer had a similar experience and wrote that in their review. Don't restaurant owners know that they lose business this way?  They might have had a regular customer."], ["Chris M.", "Decoration is nice. Food is nice. Turkish coffee : very good. Must tryPlatter: good. Recommended Koba and kofta: love the slightly sweet rice. Meat is juicy. Nice!Khudarr mashwi: delicious"], ["Angela G.", "Had dinner with my wife here for our anniversary. Couldn't have picked a better place. Romantic atmosphere and excellent food. We were served by the owner, TK, and he was very attentive and helpful on making our selection. Wife had the lamb and I had salmon. I don't usually like the gamines of lamb, but this was delicious,  and failing off the bone, it was so tender. My salmon was grilled simply and though I would have appreciated a marinade for a bit more flavor, I still found it delicious. The Egyptian rice pudding was to die for. That's all I'll say. Try it! Wife had Turkish coffee and said it was the best she'd ever had. A very satisfying dining experience. Highly recommend it!"], ["Amy G.", "Great dinner - and its BYOB. We were there on a Friday night around 6:30, and they seated us at a quiet table in the back - perfect for our two girls, 4 years old and 10 months old. The waiter was extra attentive to our needs, getting food for the kids first. The pita pizza for kids was GREAT - I stole a piece, both girls loved it. I had the kebab/kofta combo and could've eaten a whole plate of either. Flavorful, tender, well seasoned. Waiter recommended rice pudding - heavenly. So glad this gem is around the corner."], ["Srishti K.", "Went here for a friend's birthday BYO. I had never hear of the place before, and I was a little skeptical, but the place turned out to be great! We were a pretty big group 25 people and pretty loud, but the servers were extremely accommodating. We had a fixed menu that was around $20-25 including an entree and dessert. I got the Chicken Kebab platter, and it was some of the best chicken I've ever had. I literally wanted to go back the next night. I also tried bites of the Grilled Eggplant. Even though the servers said it was 'spicy', I thought it was a little too sweet. Not bad, just not as good as the Chicken Kebabs! My friends also raved about the Vegetarian Musakaa."], ["Sarah B.", "I hadn't heard of Aya's Cafe until a girlfriend picked it for her birthday dinner. She wanted a BYO, and I'm so happy she went with Aya's. The prices are ridiculous, in a good way, considering the portions. I wasn't especially hungry so I went with what sounded like a really tasty appetizer - calamari salad. At $12, this salad is quite a deal. It's ginormous and could easily feed two or three people. The calamari is fried to perfection, and Aya's did not skimp on the amount of calamari. The veggies were all fresh, and the sesame vinaigrette was light but delicious."], ["Justin S.", "Visited Philadelphia last weekend and got caught up in the wonderment of the stunning architecture which comprises the city. Lost track of time and the fact that we hadn't eaten in close to eight hours. It was around 4:30 PM, we were hungry but picky and refused to settle and let our appetites get the best of us. We ventured past several eateries on our ten-minute trek to Aya's Café, which opened at 5 PM. When we arrived there was one other couple waiting for them to open. When they did finally open we were a party of five and second in a line of four parties total awaiting dinner. Everyone was seated and we were the last to be acknowledged despite the fact that we were the second party to be seated. Our order was as follows:Calamari SaladCaesar Salad with ChickenGreek SaladChicken Kabob DinnerCheeseburger and FriesHungry but patient we basked in the disappointment as plate after plate emerged from the kitchen and was set on every table but our own. The waitress returned to refill our drinks at around the thirty-minute mark but said nothing in regards to the status of our food. It grew increasingly disheartening as two of the other parties had finished dining and the third had already received their bill and was preparing to leave. We remained hungry and patient when at around the fourty-five minute mark the waitress approached our table to ask if we wanted the pita to come out ahead or with the salads. It was at this point that we politely asked if there was a reason for the delay to which the waitress replied curtly, \"We were preparing food for the other tables, we are preparing yours now.\" Not an inkling of compassion or any gesture resembling an apology for the obvious delay. It was at least another ten minutes before our dinner arrived. As much as I would like to believe that good things come to those who wait, in this particular scenario it was more like mediocrity comes to those who wait. The food was average at best and nothing to write home about. I guess I just expected more considering the wait. The entire dinner was anticlimactic. Salad is Salad and hard to ruin given the amount of time they had to prepare it. The chicken Kabobs were not awful but they were a little dry and the Tahina sauce was bland and tasteless. I will forever be left wondering why it took close to an hour to prepare food for a table of five when three of the dishes were salads. I'm also left with the unanswered question as to why we were so blatantly neglected when compared to the other patrons. Could they tell that we were from out of town? Was it due to our large party? Despite the wait and the neglect we remained polite knowing that our discontent would be reflected in our gratuity. Overall I would rate the food as mediocre at best and I would say the service at Aya's Café is sub par."], ["Shanon M.", "I really like Aya's and it's my go-to as they are right down the street from work. Their kabob salad is delicious. Their falafel was good but I always have to order everything without cilantro as they overdo it a bit. I'd love to go there for dinner one night as it is BYOB and the ambiance is very warm and inviting."], ["Grace S.", "I really, really, really wanted to like this place.  I've lived less than two blocks away for 3 years.  I order Pete's all the time, even if it's not my favorite pizza.  I went to Logan (Goat Bar) 6 times before they closed.  I even go to Arch Gourmet despite knowing it's not worth $10 for a lime.  (Kidding. Sort of.)  This area doesn't get the foot traffic of Rittenhouse, which is part of the reason I love living here, so I really want to support local businesses.That being said, I have only been here once.  My husband and I first came when we moved to the neighborhood, and had a pretty mediocre experience.  Service was ok, food was unimpressive, but the prices were a bit on the high end -- I mean, it's Philly! We could walk 10 minutes and have a ton of cheaper, better options. So, that's what we've done since then.Then they had a livingsocial deal: $25 for $50.  That looked like a great reason to go back there again and give it another shot!  Unfortunately, we walked by today and there was a sign posted on the door, saying there was some sort of \"miscommunication\" with livingsocial, and that the deal really is $25 for $50 off a $100+ bill (food only, since it's BYO).Seriously?  That is a HUGE difference.  I highly doubt we will go and spend $100+ on dinner, and I'm not willing to spend that kind of money just to support their business.  And, judging from the other review about the livingsocial deal, they apparently are willing to treat customers like crap over this \"miscommunication.\" I wouldn't even have bothered writing a Yelp review until trying it again since my last experience was so utterly forgettable, but I don't want that other review to be the lone report on their livingsocial shenanigans.  There are much better ways to deal with this situation, and I'm disappointed with the way they are handling it.I've asked livingsocial for my money back, and I'm writing off Aya's for good."], ["Michele S.", "This was my fourth visit to this cafe, and it just gets better and better. Had the Baba Ganoush and Vegetarian Moussaka, both were fantastic.  With the restaurant.com coupon, it's a great deal. On a sunday there was lots of free street parking. Lovely waiter and reasonable prices."], ["JC J.", "Love this place! The food is delicious (good veggie options) and the service is extremely friendly and accommodating. Only downside is that the restaurant is a little dark, so I wouldn't come here for lunch if it's nice outside."], ["Vivian T.", "Great service , the young man that works here was very attentive and made good recommendations. Good food and the cilantro lamb stew was to die for ! Also I love there cinnamon rice w raisins accompanies by chicken kabobs. The hummus app was good but I wished I ordered the sampler instead. Greek salad was good but would have liked more feta. $68 for 2 apps and 2 entrees and tip ... Average prices not to bad."], ["N H.", "Great meal and huge portions. You must try the lamb shank if you like a mild curry dish"], ["Tamara K.", "I came here this afternoon for a falafel sandwich which was just ok. There were only two falafel balls in the sandwich. The balls weren't crispy enough on the outside. A bit mushy!  They did, however, have sesame seeds on the outside which added a nice twist!  The tahini was decent...I detected a slight sweetness to it that I did not appreciate. The pita was too doughey. A big turnoff was that they did not have hot sauce. The sandwich did come with a tiny salad that had lettuce, cucumbers and two kalamata olives which was nice, but the $8 price tag was a bit steep for a falafel sandwich!  Mamas veg is definitely better and more filling. The interior here I s very dark. Too dark. I thought the place was closed. They had a cute tiny area where u can eat outside. Although I wasn't crazy about the falafel I do want to come back to try the schwarma."], ["Laura R.", "Ayas cafe has the best chicken kabobs I have ever had. The tahina sauce is just perfection. The hummus is also fantastic. I highly recommend this neighborhood restaurant"], ["Yair L.", "Disgrace.I have bought the living social 25 for 50, just a couple of hours before coming.When I came to the restaurant, the owner refused to accept it. Not only that, but he was vulgar, and despite not cursing, he was very close to do so. He came up with this weird explanation of why he's not accepting it (My plan was that you pay $25, then get a gift card value of 50, but you can't use it unless paying more than $100). Clearly- this is a scam, try to lure people to this god forsaken place. While people are there- they won't cause a scene so will already dine in. He did not try to work with our party, offer alternative solutions, nothing.Rude, disgusting behavior and dishonest. I didn't try the food, so I can not comment on it. But even if it's the best place in Philly, I would not step in his place. A real scum bag of a person- that is my honest opinion after 5-10 minutes interaction with him."], ["Barbara S.", "I ordered mixed meze trays for a reception following my dance studio's annual performance.  The food was outstanding, plentiful and delivered on time. I can recommend their catering service heartily. HabibaHabiba Studio"], ["Alex L.", "We went to celebrate a friend's birthday at Aya's. The restaurant's ambiance is great, the lights are dimmed and perfect for a date or BYOB.I ordered mixed vegetables and grilled eggplant with Israeli couscous and tzatziki sauce. Everything was delicious! The dudes in the kitchen can forget about dishwashing, because I just about licked my plate clean. I also sampled my friends' salmon and grilled eggplant linguini. The pasta was perfectly tender and tomato sauce tasted flawless. The salmon was a tad dry but still flavorful. Next time, I'll try their appetizers and lunch specials.Service was excellent throughout the meal, our server was both accommodating and friendly from beginning to end. Aya's is definitely worth the trip. I can't wait to go back!"], ["D B.", "Very unreasonable management that doesn't care about their customers. We bought a livingsocial worth $50; however the management would not honor it. They decided they would \"not be making enough money\" off of us since we only spent $55 total. Nowhere on the livingsocial stated a minimum purchase requirement and the management was hostile when we asked for an explanation.The service was also very slow with only one waiter for about 12 tables."], ["Anima A.", "This is definitely a belated review, but I went to Aya's in October 2013 to celebrate my birthday with about 12 of my family and friends. We were a lively (see: kinda really loud) group, and Aya's still gave great service! The atmosphere is small and romantic, and it's a BYO - which is definitely a plus! The large portion sizes definitely justify the menu prices, and the food is great. I had the Grilled Salmon with couscous and it was delicious. In addition to sitting at dinner that night, my leftovers took me through lunch and dinner the following day. Everyone else at my table also enjoyed their food and it was the general opinion that the dinner was great.I would definitely recommend Aya's Cafe for a date night or an intimate evening with friends. The food and the service were great and I will definitely be returning!"], ["Holly T.", "Aya's is our favorite place for a Middle Eastern lunch. It's a little off the beaten path, but it's very close to the 22nd St trolley station.So far, we've really enjoyed the Aya's sampler platter (bruschetta, hummus, kalamata hummus, falafel, grape leaves, tatziki sauce and baba ghanough), hummus trio (house, kalamata, red pepper & garlic), kofta sandwich, Egyptian gyro, and grilled eggplant entree. I was especially impressed with the tenderness and juiciness of the lamb meat in the gyro. As a bonus, it's always nice to be able to finish our meal with a Turkish coffee. The interior is dark and cozy, and the service has been good in our experience. Aya's is BYOB but we have yet to take advantage of that; we hope to come back for dinner with a bottle sometime. Recommended!"], ["Kara S.", "I was recently here with a group of my coworkers, about 8 of us. The food and service was great. I had the salmon meal which was REALLY good. Some of my coworkers had the basmati rice with their meals- which sounds plain, but the seasoning and extra stuff they add was really good- I was wishing I asked for that with my meal instead of the somewhat plain cous cous. Gotta love that it's a byob too!"], ["Helene A.", "Yum, yum, yum.... I had the prefix dinner special w/ salmon and it was delicious. I think the portion sizes in Philly are much bigger than NYC because I left this place insanely full... My friend and I probably could have shared one meal and an appetizer. Our waitress was super sweet and attentive. Aya's cafe really has great ambiance and it would be a lovely and romantic place to take a date. ps... it's byob so pickup a bottle en route"], ["Joyce C.", "Our compliments to the chef.  Nice ambience, love the BYO, and excellent food cooked to order.  The menu was exoctic enough for those of us who are adventurous and contained plenty of standards too.  The place smelled delicious also from the time we walked in."], ["Kristine K.", "Came in midweek midafternoon with hungry kids. The waitress was very helpful. The chicken kabob salad and falafel sandwich were good. They even have hamburgers in pita for the kids!"], ["Mary M.", "Aya's Cafe is located in the Logan Square area of Center City Philadelphia. It is metered street parking only, with very little availability of spots because residents of the area also park in the streets. It is not wheelchair accessible. Forget about having a private conversation here because tables are arranged so close to each other that you can clearly hear what the occupants of the next table are talking about. The server who also functions as the hostess greeted us warmly and sat us immediately. The Trio Hummus that we started out with tasted fresh and seasoned just right. It is initially served with only a handful of pita bread, but they will give you more at no additional cost to you if you ask. The Chicken and Beef Dinner Kebobs where tender and juicy. They were not overdone at all.  All in all, it was a satisfying meal. The only thing I want to bring up is they automatically add on 20% gratuity to your bill.  I will understand if they do this to a party of 5 or more. But for a party of 2, I feel that is not necessary. It was ok in our case because we had no problem with the service. But if we had a different experience, I would not be giving a 20% tip. This is a BYOB establishment."], ["Cristina L.", "Walk into this cozy, romantic restaurant with a bottle of wine for a very good Mediterranean-style meal at a fairly good price. I've seen all types in here, from romantic couples to large groups to parents with children; Aya's clearly attracts crowds of all sorts. The food here has been mostly very good. The khudaar mashwi, a mixture of vegetables with pearled cous cous and tzatziki, is really good. I've gotten it several times. The vegetarian moussaka is alright, but I wasn't blown away. What I REALLY enjoyed was the appetizer- Aya's taster. I was absolutely blown away by the quality of the baba ganoush, kalamata hummus, grape leaves, and falafel. I have NEVER had falafel so good as I did here! I will certainly be back, to get the taster if not anything else. I'd say its a must if you're here. Service is \"no frills\" for sure. I've actually had the same waitress every time I've been here, and my guess is that this is more if a family-run place. All together, I am very satisfied and will be back, probably many times!"], ["Kristin W.", "We were in the neighborhood and decided it was a good time to try Aya's. The portions were large enough for two people to share the Mediterranean salad (fresh) and Musakaa (very tasty with a hint of sweetness). This seems to be a fairly quiet spot, so definitely think about just dropping in when you're in the neighborhood."], ["Andrew W.", "Great food for reasonable price. I had the diner menu, with the Moroccan tomato soup to start, mousaka for my main, and baklava. All was excellent, especially the mousaka. Total was $27 (tip not included). Great atmosphere and service."], ["Bonnie J.", "Great little date night BYOB spot. The service was a little slow, but I only noticed one woman in the front of the house who was both the hostess and waitress. She was very pleasant and helpful despite being very busy.My BF and I split the hummus as an appetizer, which was pretty good. However, we didn't get enough pita to go along with it. We are on an ongoing mission to find the best hummus in the city and Aya's ranks pretty high. For my entree I had the lamb stew which was awesome and a huge portion. The lamb was very tender and full of flavor. There was also a perfect ratio of rice to stew. I hate getting too little rice! For my BF's entree he got the parmesan chicken, which he loved! There was a hefty portion of chicken on top of a bed of rice. The rice was covered in what was almost a rose sauce. Whatever it was, it was delicious. Just a day later, he is already itching to go back and try it again."], ["Michael W.", "My wife and I just moved to Philly.  We went to Aya's for dinner with friends and everything we ordered was very good.  We went on a Monday night and it was empty.  The lack of people almost scared us away, but we are glad we still decided to go there.  The monday night emptiness is not a reflection of the food or service...which were both very good.Sampler is a good appetizer.  The lobster ravioli was also very good...smothered in cheese."], ["Anthony R.", "First time tonight but no doubt I'll be back. Food was great, not too busy, BYOB and did I mention great food? This is a great spot"], ["Alie A.", "NOM. The hummus with warm flat bread is amazing.  There's a number of awesome middle eastern food options at this BYOB.  Healthy plates like the salmon and couscous are fantastic and they have a number of great salads. Most recently had the calamari salad that came in a sweet vinaigrette.  Great prefix specials as well that keep things interesting.Fast service and a really homey feel.  Great spot and affordable for the portion sizes!"], ["Suzanne S.", "I come to Aya's for their delicious $6.99 lunch specials.  On Monday's, they have a chicken shawarma sandwich served in grilled pita bread which is to DYE for.  It kinda tastes like a middle-eastern chicken cheese-steak with tahini but so much better. I promise its great and I am thinking about getting one for lunch as I write this article.The chicken/kofta kabob pita or chicken/kofta kabob salad are also great choices as well.  The service here can be spotty, but the food is well worth it."], ["Schuyler L.", "My finacee and I went in on a Valentine's Day trip to Philadelphia, which we had alway wanted to visit. The reviews were good, so we went out of our way to try it.When we arrived, the waitress gave us a short menu which was a special valentine's day menu. It was a four course meal (one of the courses was lentil soup, which we routinely make a huge pot of at home for ~$5), altogether $35 per person, tax and tip not included. We mentioned we weren't all THAT hungry and asked if the regular menu was available. She said she would have to go ask the manager, though didn't, and simply just got regular menus. The table next to us did the same thing and the waiter simply gave them menus with no reluctance...all of which suggests they were trying to get us to think it was our only option. Related: when we paid, an 18% gratuity was automatically included, but it was a form receipt, and so there was also a blank tip line below that; if you weren't paying attention, you might end up tipping twice. I've heard of automatically including a gratuity, but usually in groups of six or something; we were only two people.I got the (I think) Mediterranean salad, which wasn't all that bad ($8), it was a reasonable size and had some good ingredients. However, my lady got a kabob chicken plate ($16), which was mainly brown rice. There was a small yogurt sauce, which was actually not bad, but there were eight small pieces of chicken (about 1 breast's worth). Also, once they cooled off, it was easy to tell that the chicken was frozen, not fresh, and it was hard. There were two pieces of onion which had been burned literally to a char at the ends - she said it tasted like ash. There were also four pieces of bell pepper, which amounted to about 1/8 of a whole pepper you might find in the store. These were also burned on the sides. The portions were only average as well. We've both had grilled veggies and chicken, and this isn't how it tastes. We hate complaining about the food, but ended up doing so. To be fair, the waitress brought a small bowl of veggies that had been sauteed, and didn't charge us, which was nice. But if that's not an issue, why not just add them in the first place? It was something like three times what had been included originally. So the one star will be for that.The two of us are genuinely confounded as to the other reviews - the portions are average, the atmosphere didn't seem terribly romantic, and the prices seemed high. This is really going to have to be one of my few negative reviews, but really, pick somewhere else."], ["Liz J.", "This was my first time experiencing Aya's. I ordered take-out and got the chicken kebab salad. They forgot the \"zesty Greek dressing\" they promised (I only noticed when I get back to my office unfortunately), and then upon cutting into the chicken pieces I noticed that they were mushy and pink in the middle. After a minute in the microwave the chicken was good - but the lack of dressing plus under-cooked chicken means I probably will not be getting their food again."], ["Mohammad Ali K.", "Aya's Cafe has always served the best meat I have tasted in the country.  I usually can't stand lamb, but their lamb is PHENOMENAL and has made a believer of me.  Aya has inspired the recipes and the herbs for all the meats are great.  Our friend ordered the baba ghanoosh and loved it.  I have gone here for lunch during the work day, and at nights on the weekend.  Great Lunch specials and Sandwiches (which are not available for Dinner).  Try the mixed meat platter...phenom!"], ["Gail D.", "This is a very belated, but well earned review.  We went to Aya's for lunch, and the following day for dinner on our last visit to Philly.  What a gem.  Somewhat off the beaten track, but definitely worth it.  Amazing sampler platter with the best flat bread I've had in a long time.  For lunch we both had soup - wonderful flavors.  We came for a large group dinner the next evening, and everyone's food was excellent.  Lots of choices for the vegetarians - although I loved the lamb!  FYI - it is BYOB."]], "Zorba's Taverna": [["Glen R.", "I thought the food was decent. The server I had was terrible from the door.  I asked for two $10s for the lot across the street.  He immediately said no.  I had a reservation for three people and they were slow at the time.  After fifteen minutes of getting change and my guest were curious where I had gone.  I found out after that he was rude to my guests before seating them.  I will not be returning to this place and his tip was especially light because I didn't have change. Oops"], ["Cindene P.", "This joint does not disappoint.   Try all your Greek favorites.   You will not find them lacking."], ["Donna M.", "Ate here for the first time recently. Quaint atmosphere, somewhat dark inside. They do have a few outside tables. The octopus was fabulous!! Very tender and great flavor.However, they need to update the menus. They have pasta with grated cheese as an option with the meatballs. When we asked for it they said, \"no pasta\" I pointed out that it was on the menu. The server simply said \"Oh those are old menus\". Also,  lunch and dinner are on the same menu. We arrived at  4:30pm and were told it was time for the dinner menu. The lunch menu offered the octopus and the \"spread\" sampler at one price and the dinner menu offered the same items at $2 & $3 higher. I would definitely go back for the octopus!!"], ["Jessica S.", "I only had the appetizers here, so I can't speak to the rest of the food. The complimentary bread here was delicious (light and fluffy) and we ordered the mussels + the plate of different hummus/dips with a generous side of pita bread. I found the sauce for the mussels a little too tomatoey, but the dips + pita bread were delicious! I would love to try their dish that they set on fire - the flames were at least 4 feet high and are quite startling! Will definitely stop by again sometime when I have more room in my stomach.Don't forget it's BYOB! Would've made sure to bring a bottle of wine if I'd read the Yelp reviews ahead of time :)"], ["Brian T.", "Wow, was not expecting THAT! I've been wanting to come here for quite some time, and finally found the right occasion. it's BYO, which is awesome! Wife and I brougth the kids and each a bottle of wine (we just drink different wines, didn't drink a whole bottle each haha). We started with the saganaki and two orders of calimari. The saganaki was standard, very good. the calamari was also good, not overbreaded and cooked just right. We split this large grll plate \"for two\", which fed the 4 of us with the appetizers. It came with 2 lamb chops, some greek sausage, chicken, another roasted lamb item, potaties, rice and veggies. a KILLER meal, I just wish it came with Pita. Great service and fantastic food. I'll for sure be going back."], ["Hrudaya S.", "I really liked this place. We happened to pass by it after a tour of the penitentiary and decided to stop in for an early dinner. It is a small and quaint little place. The staff was very nice, attentive and knowledgeable. The prices are good as well. We got the pita and hummus, and i fell in love with it. The pita was so fresh. The artichokes constantinople was just delectable. The gyro were so delicious and juicy. Nothing was overdone or dry or undercooked for that matter. I definitely loved it!"], ["Anubhav K.", "Good food but I did not get a genuine mediterranean food. The place was also a bit cramped.Overall the food was good but nothing stood out."], ["Lilli C.", "This place is great!  On NYE they were able to take a reservation for 18 people last minute!  The staff is extremely friendly and accommodating and even were okay with 4 people in our party getting their own separate tab.The grilled octopus was amazing.  It was super tender and not rubbery or chewy like most places.  The stuffed eggplant with feta and a red sauce was also delicious and super cheap at only 10 bucks!  The service was also really fast.  I will definitely be back here!"], ["Gideon R.", "I am from NYC and grew up eating at Greek restaurants in Astoria, Queens.  I've had about as good as you get in the United States.  If you've had authentic Greek food, skip this place, it'll make you angry.  Angry like I am. Some meals I have and they are bad and then there's the rare one which I find insulting.  Zorba's was garbage.  I had the Zeus platter - their hot and cold dip platter.  They charge $22 for this.  There were three dishes brought out - the very small dish had a mix of 5 or 6 different dips, the large dish had mussels, octopus and fried calamari and the third was a small dish of pita - not enough to use to finish the small amount of dips provided meaning that you have to order more pita for extra money.  The calamari was low end pub grade, the tzatziki was brought in, the octopus was drowned in oil and tough, the four tiny mussels were in a very sweet tomato sauce and the dips were just garbage.  Taramosalata is not supposed to taste like salty yogurt - there is supposed to be fish roe in that.  The other dips, forgettable.My wife ordered a shrimp dish, again, drowned in oil, greasy and cooked till they were like rubber.  The rice and potato with her dish, greasy oily again, soggy mush.  The serving portion was that of a half plate, tiny.  That was $20.  The service couldn't have given less of a $hit that we were there.  They even told us that they would need the table in two hours so make sure we were finished by then.  That's how we were greeted.  Like I opened with, some meals are bad and some are just insulting.  Zorba's is officially the worst meal I've had in seven years living in Philadelphia.   Better off going to a diner."], ["Omnom N.", "The flaming saganaki sold us! Loved the food and ambience. Good place to go to if visiting the eastern state penitentiary. It's a good enough place for vegetarians. Not overloaded with options but not too few either. I had the grape leaves dolmade, which tasted good!Only minus was the price range. As a student is complain!"], ["Shannon C.", "Zorba's is probably my favorite place to eat in all of Fairmount, possibly all of Philadelphia.  It took me a while to actually try them out - the prices seemed steep when I reviewed the menu we had laying around.  That was so unnecessary! Every time we get our check we can't believe the amount vs the quantity/quality of food & service we received!  The place is family owned & operated, which I love.  The food is absolutely delicious and served in generous portions.  Even the dipping oil that comes with the standard bread basket is the most flavorful I've ever had!  If you want to go on a weekend, make a reservation because this place fills quickly!  So far my favorite dish is the lamb shank with the red sauce, but trying everything on the menu is definitely on my bucket list!  Do yourself a favor - buy a bottle of wine and bring it with you to Zorba's ASAP!"], ["Jess S.", "Love love love Zorbas! It's my favorite restaurant in Philly. Love the cold sampler app, the grilled octopus, leg of lamb, pita galore and baklava with greek coffee (semi-sweet). Yum! Friendly, family owned gem!"], ["B K.", "Best Greek restaurant in Philly! My husband and I frequently go here with our daughters and every time the food is amazing, service is amazing and the price is right. Just writing this is making me crave their potatoes and saganaki!"], ["Thomas J.", "We had lunch here and it was amazing.  Great spot, cozy atmosphere and friendly staff.  The pita was fresh and delicious.  Need to return for dinner."], ["Marie M.", "We ordered the hot appetizer sampler, the gyro platter and the pasta Athena. Everything was delicious but I was a little uninterested in the gyro, it had a weird taste that I wasn't used to compared to other Greek places I've eaten. But my boyfriend loved it. The service was really great and our server was very professional but friendly and personable. For our two platters and an appetizer it came to about 60. It was a cute place and a good date night place."], ["Joanna P.", "We stopped in here after visiting Eastern State Penitentiary and boy, did it hit the spot! Here's what we ordered: - spicy feta cheese app with an extra pita- a gyro (which, contrary to another review I saw, did come on a pita)- a meatball sandwich (soutzoukaki??)- roasted lamb sandwich- baklava All food was excellent. Service was good. Nice cozy interior. Highly recommend and will return if we are ever in the neighborhood."], ["Katrina C.", "I have had a couple of different experiences with this place, and I have always been super happy.I used to have monthly meetings that were sometimes catered by Zorbas. They would provide tray after tray of delicious pitas filled with hummus, eggplant, chicken, etc. Some of them even had french fries. I was always super excited to see my french fry and hummus filled friends.Last week, I came here for dinner. I had been here once before, but it had been at least 5 years. First, they give you like a loaf of bread for the table with delicious olive oil dip. After I ate a loaf of bread, we started with the cold appetizer platter, and it was so delicious. I was beyond happy. The hummus was delicious, but the eggplant dip was my favorite. Most of my party got meat. If you like grilled meats, this will be heaven for you. However, I am not a huge fan of massive portions of meat, so I got the greek seafood pasta (I can't think of the actual name). It was not a massive portion, which I appreciated - since I had just eaten a loaf of bread and a gallon of dips - but it was certainly still a generous portion. Tomato based cream sauce, didn't skip on the seafood. Great taste. I was more than happy.BYOB. Take reservations. Reasonable prices."], ["Colleen M.", "Fantastic! I love everything about Zorba's. I'm a huge fan of Greek food and also of affordable Greek food, and Zorba's satisfies both great food at a great price. The food here is so flavorful and fresh... The spicy feta?? Omg. But what I really love about this place is the service! Recently, I threw a birthday dinner here for my boyfriend. I was a little nervous calling to book a 15 person Saturday night reservation but the manager (owner?), Steve, was incredibly helpful from start to finish! He allowed me to drop cake off early and bring decorations, etc. but he also made the night extra special with a few tricks he had up his sleeve to make the surprise dinner a hit!Aside from Steve's wonderful help, our server, Maria, was incredible. She had two very large parties to tend to and had a great demeanor and attitude throughout the night, even though we were a little demanding :) It's hard to find great service these days but its no wonder Zorba's is doing so well--it's truly a Philly  gem!"], ["Gretchen E.", "I'd been itching to go here for about a year, as it was recommended highly by friends and colleagues.  Coming in with high expectations and anticipating portions similar to those of Dmitri's and Audrey Claire, I was suprised how tiny the portions were for the price. The Zeus Plate read like a feast on the menu, but on the table each appetizer sample was 1/3 the size of my fist (except for 1/2 plate full of fried calamari, which neither of us wanted).Still, the food is flavor-packed.  Delicious octopus (but not as good as Dmitri's or Audrey Claire) and juicy charred chicken.  The baba and hummus were also scrumptious.  The BYOB restaurant has many rooms with nooks and crannies for tables large and small, for communal or intimate gatherings.  Our server was awesome and amiable.  I'd go back if someone else was paying, but my dine-out dollars will keep going to Dmitris."], ["D. Y.", "Happened to stop at Zorba's on our way back from the Eastern Penitentiary.  Great Greek food. You have lots of choices. Few outside tables & very nice & elegant looking inside. Ordered a tilapia gyro & it was scrumptious. You must try this place."]], "Nick The Greek": [], "Kostas Bar Restaurant": [], "New York Gyro Place": [], "South Street Souvlaki": [], "Cafe Olé": [["Jared J.", "People love Cafe Ole and so should you. A welcoming environment perfect for meeting with friends, for business, or just to get some school work done. Cafe Ole offers an extensive menu, plenty of sweets, and just the right amount of coffee. The interior is decorated finely, and pricing for food items is appropriate. Their specialty Shakshuka was being devoured by many during the morning rush, and I appreciated how the girls behind the counter remembered all the drinks of their regulars. Cafe Ole for the win."], ["Hoang T.", "In search for some afternoon coffee! And yelp pointed me here. 3.5 starsPS, i love this part of OC now! I haven't been in a few years, but now that i work here, i love exploring the streets. It was a super hot day out... an iced coffee was needed. The place was a bit understaffed for a late lunch crowd. However, the one worker was not phased and hustled well and didn't break a sweat. The place felt and looked more of a neighborhood'ish spot where people would meetup to eat, drink, chat. I don't think it was wise having the front door open on a hot day, with no central air (only a window unit from what i saw). So it wasn't super cool inside, but not uncomfortably hot. I got my iced coffee and first sip smacked me in my face! The flavor was super bold and jarring. I've been getting cold brews most of the summer, so switching to an iced coffee was a shock to my palette. It took a little bit getting use to the acidity and deep coffee flavor, but overall, i did feel it had a burnt finish to it. I'll update my review when i come back to try food and their hot coffee.***Update***Stopped by for a cup of coffee earlier this week. The place was really busy despite being 1:40pm (after lunch rush?) but there were still many people ordering food and drinks. There were two workers that day, one was somewhat new i guess as she asked how to do some things. Everything went smoothly and again, i feel this establishment has a neighborhood vibe and following....all good things. My small black coffee was on the pricier side ($2 and change), but i assume its because of location/rent, not a deal breaker. I usually get coffee in my mug so it stays hot (or cold) for a few hours. I poured the coffee into my mug and saw there was a lot of grinds. I can only believe it was later in the day and they never made a new batch of coffee because they were closing early  (2pm). It was a bit of a turn off BUT, the coffee did taste pretty good. Hence, the bump to a solid 4. I had lunch already, so i didn't order anything but i feel like iwant to the both times i've come in."], ["Sean F.", "This is a nice coffee place, good and friendly service. Crepes are fine, standard, tasty. The standard shaksuka is different - more Italian than north african, really marinara sauce with eggs.Clearly well loved little place with care taken on the interior, very good use of space with several tables that can accommodate a group of 4-6.Overall good - try it!"], ["John G.", "Cafe Ole is a great place for good food. Simple, tasty, Mediterranean food, by very pleasant people, at a good price. My daughter and I really liked their Mediterranean plate, my wife liked the chicken wrap, and my son in law said that the chicken quesadilla was the best that he's ever had. Go there and eat well."], ["Holly Q.", "Solid spot in Old City. Refillable iced coffee. Crazy delicious menu, featuring their homemade Shakshuka, the likes of which I've never had anywhere else & I don't need to. Cafe Ole is the spot to unwind & get some work done."], ["Jeff H.", "Café Ole is the latest incarnation for a café at this cool location in Old City.  Fortunately it's a good one.  The atmosphere  in the café is as warm as it has always been.  And the food and drinks are good.  What is special here?  Glad you asked .... it's the Shakshouka.  This is the best Shakshouka, I've had in Philadelphia ... and it is served with fresh bread to scoop up every last drop. One note to keep in mind is that the kitchen closes at 3PM (strictly breakfast & lunch) and the whole café closes around 7PM."], ["Cara O.", "I just ate at Cafe ole for breakfast. I read the reviews and wanted to try the Vegetable Shakshuka and their  iced coffee. This is one of the best decisions I've made in a long time. Fresh and tasty ingredients. The coffee was probably the best I've had in a while.i would highly recommend coming here."], ["James B.", "Hi energy, a barista with an accent, and fast service make this place a win for anyone on a walk about of old city. New artwork is common around here. Open doors and windows let the air in and keep things fresh. This is a great place for a fast coffee, breakfast or lunch and can very easily support a slow morning."], ["Christian S.", "It was one of those when my friends and I just couldn't make up our minds on lunch. I didn't want anything heavy because I was scheduled to join my fellow Elites in AC Friday night, and everyone else was just being indecisive. Looking for something different we ended up at Café Ole. After reading the review form Sophia I, I decided to go along. I am  one of the few people on earth against anything pre-made; including sandwiches. I hate how everything is cold including the bread. So I was a little apprehensive at first. When she asked me if I wanted it grilled (pressed) of course I said yes. You need to wake up those flavors.  I ordered the Chicken Wrap w/ pesto mayo, lettuce, black olives, tomato, feta, and onions. I may not have loved the wrap but it made me a believer in this place thus far."], ["Dave D.", "The staff made it THAT good.Cute little spunky blonde (self proclaimed) \"gangster\" has great sense of humor and is very personable.The drip/house coffee left a little to the palate's  imagination but fear not, they have cocoa powder!Omelette was a bit expensive but so is their rent so I understand. Small coffee and swiss cheese omelette mugged my wallet for nearly $10 but the free refills, location, WiFi and ability to chill in a fun environment makes up for it!Parking is scarier than a 3rd term Obama but the HIT & RUN illegal space directly in front suits the need if you can enlist the help of the outdoor diners or window watchers to alert you of the \"meter demon\".If they had a \" cozy corner \" with old leather couch or comfy flop furniture I'd bump it up half a * to 4.5.Hellavalot better than a S-bucks visit. The staff has personality here and its magnetic."], ["Kerri O.", "You know its good coffee when you don't need to use four packets of splenda to cover up the taste/bitterness.  Cafe Ole proves that strong coffee doesn't have to come from beans that are burnt or over-roasted (unlike a major coffee chain found on most streets).  The sweet crepe was pretty good but the egg and cheese croissant sandwich flattened in a panini press was a bit dry and overall lacking....Still, I'll be back for the coffee!"], ["Winnie R.", "Had an amazing brunch here on a weekend trip to Philly. The girls at the front counter were super friendly and cleared our plates at the end of the meal. The ice coffee was strong and delicious. My friend had the lox platter with everything bagel and I had an egg white omelette with spinach feta pepper and onions. My platter came with Israeli salad, guacamole, and a yummy side of fresh Greek yogurt, s&p and olive oil. Generous proportions and fresh ingredients, highly recommended."], ["Dan D.", "I'd highly recommend this establishment. I was surprised by how crowded it was when I first walked in, but now I understand. Every table was taken and the line was almost out the door for a good reason- they know what the f*ck they are doing. In a city with a cafe on every goddamn corner, Cafe Ole is flexing with their coffee and orgasmic breakfast sandwiches. I literally told the attractive woman behind the counter to surprise me with whatever sandwich she felt like making, and made probably one of the best sandwiches I've had in some time. Well played. Only downside was the woman breastfeeding who casually flashed me while making eye contact and smiled. She was not attractive. Despite this I am returning."], ["Vanessa D.", "Pretty good neighborhood cafe, they have great salads and sandwiches, the goat with brie is a classic but they do it well.  Good seating space ( outside as well) noise level for doing work, and doesn't get too crowded. I don't drink coffee, so can't comment on that, but have gone with friends and don't remember any complaints.  It's also in a nice street, charming and great for boutique and vintage shopping."], ["Robert H.", "Breakfast of omelette and crêpe! Tried a mocha too. All were fantastic. Too much to finish. Mocha far better than Starbucks. Omelette came with a salad and guac.Would return! If feeling like a fatty I'd just order the crêpe and a mocha."], ["Emily C.", "This food is phenomenal.  Nothing like cafe ole on the weekends!  The salads are all SO good- my favorites are the spinach and the Mediterranean platter.  Other favorites include the brie and apple sandwich and pretty much any dessert.  But the winner is always the Shakshuka for me - wow.  I've tried two of their versions now - traditional and Moroccan.  Nothing better!"], ["Eunni C.", "It's more like quick lunch spot. Should be affordable and provide fast service. Checked and checked. Your lunch will be ready in 3min in front of you. I went to this place when I did yoga teacher's training at Old city. Most of my class mates include teachers grabbed lunch there. They were pretty picky (mostly health conscious vegetarian) eaters so I thought that place must be good. I tagged them along one day and it turned out pretty nice time. Nice sunny weather in summer, we were seated outside and grabbed various salads. They had pre made salads displayed and they were all freshly made. Got myself Greek salad and strawberry/ banana smoothie. Smoothie was gigantic so probably most girls would be for their lunch itself. I am not so I had salad as well. Salad was huge too. I actually had left over. Everything was affordable there. Nothing over $10. They are not overly nice to offer any service since its self service kind of place but cheap, fast and fresh. What can you ask more."], ["Brett M.", "I wandered into this place by accident. An unassuming corner window, which I thought Mexican, was my choice while trekking towards the river. As I entered, the decor was indicative of any sidewalk eatery in this area. The display case of prepared food inhibited my curiosity, but I made my way towards the waitress who suggested that I try the shakshouka. Divine! It's almost like a tomatoey-broth of many different types of vegetables surrounds the poached egg yolks. The creamy egg works in harmony with the broth, as undertones of garlic and aromatic green herbs complement the dish. I haven't had too much Mediterranean food before; nor have I ever heard of shakshouka, but I will have to give in to my now budding appetite for this type of food."], ["Andrea A.", "You all know of those restaurants that just bring you back to a certain time you've always wanted to relive. I've just transcended back to one  of my favorite times with Cafe Ole. I came here for coffee only, as I planned to bring with some friends later. I'm a good window shopper, so I looked at the menu just for fun. I was stopped dead in my tracks when I saw 'the' item. SHAKSHUKA. What is it? You ask. Let me explain. This is a middle eastern dish where a few eggs are cracked into boiling hot tomato sauce amazingness. The eggs cook in the sauce, you sprinkle with herbs and then it's a Moroccan festival in your mouth. If you haven't had it, you must. The only time I've had it was on a trip to Israel, which was one of those life-changing events that Shakshuka brings me back to. Cafe Ole brought me back and in grateful.Enough about me... This place is adorable. There is upbeat middle eastern music playing low, but high enough to make you get a sway in your hips. The place is decorated with uplifting colors and they serve on yellow interesting plates--- just reminds you that ambiance is everything. The employees are super nice and the place is usually full. Cafe Ole is a small establishment with character- something lacking in the huge corporate monster coffee joints. Support local business, embrace a cultural awakening and broaden your horizons to the Far East."], ["Michael O.", "Great coffee. Energetic, friendly service! I had the French Toast! It was awesome. Lauren had the Pesto Omelet. Really nice unassuming atmosphere. Free wifi.Lots on the menu for breakfast, lunch and dinner.We will be back!"], ["Tina D.", "Was not impressed when I popped in this past weekend for a quick breakfast sandwich and coffee. As I waited in line, I couldn't help but comment to myself as I observed the way the staff talked to its patrons. Not very pleasant people, and quite disorganized. My breakfast sandwich wasn't bad, but was a little dry, and I wasn't offered anything else to go on or along with it. I wasn't familiar with where the cream and sugar was since it was my first time here, so I had to find my way around and through the thick line that had formed to get to the cream and sugar, before returning to my seat in the back to eat my breakfast sandwich. Overall, just a not-so-great experience. I was most affected, though, by the attitudes of the staff. Probably won't return."], ["Kate D.", "I have been here a few times now, and have been really happy with the drink selection. I have ordered coffee, iced green tea, and an iced chia; all were awesome. My favorite of the three I have had was the iced green tea, and I recommend that anyone stops in this place to try it! Though I loved the drinks, I was not super impressed by the food. Ordered a chicken and mozzarella sandwich. They heated it up on a panini press, and served it with a salad (cucumbers, tomato, oil and vinegar). The salad wasn't fresh, and I didn't care for it much.  I thought the sandwich was decently tasty, and would definitely try it again."], ["Jakarta N.", "So as I'm sitting here enjoying my soy spiced chai latte and shakshuka on this fine morning, I can name a few things better or that I would want to enjoy at this very moment. It may be my love for all things Israeli but something about this place just sticks with me. The Israeli music playing in the background, the sweetness of the spices in the chai, the soul warming goodness of the shakshuka are all reasons to come back. They're so good I don't even consider ordering anything else. Jk, I lied. In the summer I'll order be croissant French toast and iced tea when it's nice out. I've taken several friends here and all can agree that this place is a GEM."], ["Cheryl N.", "The ambiance at Cafe Ole us charming, the coffee is good, and the food is amazing.  I love the shakshuka - eggs cooked in a spicy tomato sauce.  You may need the coffee, but you'll want the breakfast!"], ["Adam L.", "So I went here early on a Saturday morning waiting for a work related event to start. Cafe Ole is a nice small little cafe located just south of 3rd and race. I was greeted by some friendly employees who quickly offered me some coffee. I also got some eggs with an Israeli salad (diced tomato and cucumbers with dill and lemon), with some Greek yogurt with olive oil and zhatar. Everything was really fresh and really good. The cappuccino I ordered was actually one of the better ones I have had in the city which is always a nice surprise. I forgot to ask where they get their coffee from though. On top of a great overall experience, the manager gave me some complimentary chocolate chip muffins!! To be honest, I think they were from the day before, but they were still super good!!I can't wait to go back here!"], ["Amit F.", "What a great place, i tryed every thing on the menu, the shakshuka is the best in philly, you must tred it.Great costemer service."], ["Linda M.", "This is what makes Old City such a great place to live.  Small neighborhood coffee shop with great food, great people and coffee in a real cup with free refills.  Grab a book or meet some friends - either way Cafe Ole is the spot to hang."], ["Burgle K.", "What a gem of a coffee shop.  We ordered the Shakshuka and the salmon plate and both were so good and very reasonably priced, both around 8-9.    I am a savory before sweet person when it comes to breakfast and both of these items were just great.  You'd never suspect this place could turn out such great stuff.  YOkou must get the shakshuka!!"], ["Evelyn J.", "I live right next to this place and I absolutely love it. Obviously, just seeing the other reviews, you must try the shakshouka, but it is fantastic even if you just want to stop in for a quick coffee or small bite to eat. The Mediterranean platter and Greek salad are amazing as well as the iced teas, each flavor served with fresh mint and lemon. The atmosphere is relaxing and low key (even have outside seating) - A great place to go if you need to get some work done on a weekend... Definitely a hidden gem in old city!"], ["Mike Z.", "Been here many times. Smallcozy atmosphere.  Today we decided to go here for brunch. We had Shakshuka, a traditional Israeli breakfast and a white fish salad meal.  Both were delicious. They have great coffee, humus and desserts as well.  Staff are very warm, friendly and welcoming. I highly recommend for anyone to check the place out."], ["Francis U.", "A place for old Bohemians. I wound up at Cafe Ole one morning because the Wedge & Fig was, annoyingly, not open yet. Since I suffer from an affliction known as 'hanger' (anger resulting from hunger), Lady Mary suggested the nearest geographical place to our location, Cafe Ole. We walked into bright room, full of hippies, and free spirits from the continent. Joy. Apparently there is no table service. We arrived at that conclusion after sitting at our table for 10 minutes with no greeting. The sign directing orders to be taken at the counter was either backpacking across eastern Europe, or was never conceived. We waited in line to place food orders as elderly couples caressed each other, and looked longly into each other's eyes. Nothing to whet the old appetite like a long haired Spaniard snogging his 4th wife. Hanger was rapidly setting in, but I couldn't see my way clear to order any food from this establishment, and opted only for a coffee. Lady Mary, being much more gentile, granted Ole the benefit of the doubt, and ordered the lox plate. Tangential Point: Where does the food come from??? I can't see a kitchen, or any room in the building for a kitchen. Perhaps it is prepared in the basement? This tangent doesn't much matter, as there didn't seem to be much cooking going on anyway. Lady Mary's dish was a crudely assembled miss-mash of lettuce, old vegetables, and a spot of salmon. 'Worth every bit of twelve quid.' I remarked sarcastically. Even my good lady was unable to pretend that this plate, and indeed place, was anything other than bollux. Hanger got the better of me that day, but I shall live to fight again...just not here.  Perhaps Cafe Ole is the scandal in bohemia to which Conan Doyle referred??"], ["Paul V.", "Initially I wasnt happy with this place but now its my favourite. Great coffee, friendly barristas, awesome food and just generally a pleasant place to be. Love it."], ["Beverly B.", "Excellent!  Great service.  Excellent atmosphere, wonderful food!  Highly recommended!"], ["Alyssa T.", "The food is always excellent: the best French toast for the kiddos and amazing shakshuka for the adults! Also terrific tuna salad and then get bourekas to go for window or real shopping on 3rd Street."], ["El B.", "This is my favorite cafè in the entire city. The employees are genuinely friendly, they make great coffee, and with open doors, a wall mural and outdoor seating, this place exudes a most welcoming vibe. I recommend getting their raisin bread & brie sandwich, it's the bomb:)"], ["Gregory H.", "Good food and polite staff. Perfectly fine for an afternoon lunch.I very much enjoyed their chicken and mozzarella. Coffee was also good. Nothing incredible, but still good! I was a little disappointed by the number of dirty tables, but the place seemed quite busy and I counted only 3 employees. So I'm willing to give them the benefit of the doubt - I'm talking dirty as in unbussed, not filthy. I would definitely grab lunch here again."], ["Sophia S.", "Eating at Cafe Ole was great. I had gone with a pretty large group, and the people working there were very nice and accommodating. The place is very quaint and cozy, and the food was delicious. I read the other reviews and decided to try the classic shakshuka. The portion size is quite large-- I couldn't finish it even though I wanted to, since it was so good. Also! They have free refills for the coffee which I thought was awesome."], ["Peter S.", "Funky music, good service, darn good French toast and chai tea: I recommend this place.My friends and I ended up here for brunch after having just arrived in Philly. I wasn't expecting much, but was pleasantly surprised. I was hungry so ordered two dishes: a pesto omelette and French toast. The pesto omelette was serviceable, but the French toast was spectacular, so much so that I lost a good portion to my so-called friends.I liked the chai tea, of which they have several varieties. Mine was dusted with cinnamon. Mmmm.The funky indie music soundtrack, decent service and nice part of town rounded off the experience very nicely. Overall definitely recommended and somewhere I'd return to when next in the city."], ["Sophia I.", "The dishes are still dirty and the laundry is piling up... all in the  service of Yelp!  So it was a hot sunny day, and I needed to escape my cube.  I thought to myself, where can I find good, quick eats within walking distance?  And Cafe Ole sprung to mind.  It's in the old Quarry St Cafe storefront.  Anyone remember that place?  An old favorite haunt of mine, back when a certain club owner wasn't such a tool... or maybe he was, but this place was cool.Anyway, I digress yet again.  Cafe Ole, right.  It's a bustling little cafe, more cafe than coffeeshop due to a large and Israeli-oriented menu.  The woman who owns it is all business & that's a good thing.   Despite the crowds, I was in & out of there in 5 minutes with a delicious baguette style panini sandwich with tomato, fresh mozz, kalamatas & pesto.  It was $9 with tax but on the large side.  Figure about this price for a hearty lunch, or a few bucks more with a drink.  Not the cheapest, but quick & tasty.  A definite plus when it comes to lunchtime eats."], ["Brian E.", "This is a good spot to grab a quick, non-pizza lunch in Old City. Food is good, lines can be a bit slow and there's rarely a good spot to sit. Fortunately, we lived nearby and could take it with us. Overall, I'd recommend but I don't rush to head back."]], "Greek Lady": [["Debanshu S.", "I recommend trying the Greek Lady Salad. For just $10, you will get a yummy & very generous portion of chicken & feta. I've been here many times and the salads & wraps are always great."], ["Kimberly Y.", "I would probably give Greek Lady four stars, if not for the slow service and inconsistent food.I used to stop by Greek Lady decently often, but I stopped coming back after a few mediocre gyros--especially one time when I brought my visiting parents here. I recently tried it again, and the food seemed much better than before. The salads are humongous and consistent, but I'm not really a salad person, so I usually go for the chicken gyros. Sometimes the chicken is hot and succulent, and sometimes the chicken is cold and dry. The fries and vegetables stuffed inside the gyro make it pretty delicious (and this is coming from a picky person!). Furthermore, I've had nice lemon roasted potatoes and then overly salty ones. Overall, the portions are pretty large, and the prices are decent.Beyond that, my biggest complaint is with the snail-paced service at Greek Lady. The cashier lines are generally reasonable. But when it comes to food preparation, I often wait at least 10-15 minutes for takeout here, and even longer when I eat in. They usually have a lot of customers (it's much nicer when they have outdoor seating, but otherwise it's pretty packed), but they also have a lot of kitchen help, so I don't understand why it takes so long... especially when the food sometimes comes out cold! Definitely set aside more time than you would expect when eating here. It'll be a hit or miss experience, but when it's good--it's great!"], ["Quenisha W.", "This place is delicious! The food tastes homemade even though it's in a \"fast food\" mass production setting.  Love this place and will definitely be back for more!"], ["Cynthia X.", "I like this place. Mostly it's an inviting site to see instead of the usual pizza catering during lunch time info sessions / meetings at school. I came here myself one day when I stayed late on campus while reviewing for finals. I looked up the menu online, called in, walked over to pick up my order, and it was all seamless. I got a chicken gyro (which I prefer over the lamb). The wrap comes in a pita bread shell as well as fries wrapped in (my favorite part).I was so surprised to see fries in there my first time eating it that I thought it was accidentally mixed in, but I'm glad it's a deliberate addition. This place is great for catering to large groups if you want to mix it up a bit! (Though the meets can become a bit dry when sitting out for too long).It was my friends birthday that day, so I also got a chocolate cake for her (and of course she shared with me!) pretty good. I'm glad they have a dessert selection there!"], ["Lauren M.", "Terrible service,found a hair in my food and they refused to refund me. I work at a near by hospital and my floor frequently ordered from them, we stopped because of all the order mix ups and rude attitudes."], ["Jonathan G.", "This is a great fast food Greek spot. We routinely get chicken gyro platters to go here. They come with a Greek salad that's decent, and lemon roasted potatoes and green Beans. The one thing I would say is you should ask for extra tzatziki sauce cuz they don't seem to give enough."], ["Sam K.", "Order chicken souvlaki got a kids meal. 2 tiny skewers of chicken. Way too much money for the portion. Even the chicken taste like average pizza shop chicken. No first and last time."], ["Jana P.", "Convenient location with relatively quick (but sometimes inconsistent) service. It's spacious and comfortable, except for the fact that it's unpredictably either way too cold or too warm inside. The food is alright, a bit too greasy for my liking, but overall not bad."], ["Lavada L.", "Everyone at work raves about this place. I had a lamb gyro and it was pretty good. The service was super fast which was surprising since it is usually packed during lunch time."], ["Monica S.", "MMM..i love gyros & fast service!I came here when I visited my friend in Philadelphia! Not amazing or \"anything special\" gyros, but it will do! A pretty basic gyro and yummy yogurt sauce! The atmosphere was very upbeat and I knew It was a place that all the college kids went because it was inexpensive and good quality food! Definitely a place I recommend visiting if you are in the area!"], ["Larry F.", "A stable go-to place on campus!I usually get four different things here:Lamb gyro platter - absolutely delicious. It also comes with two sides or a small salad I believe. Greek lady salad - definitely not the girly salad one gets across the block at Sweetgreen; this salad weighs several pounds and has a decent mix of meat and cheese! Milk shake - flat out delicious; definitely on the pricier side but who cares when you're feeling like crap after a midterm and this is the first thing on your mind! Mint lemonade tea - a recent discovery; after eating all that greasy food, you might as well fill the rest of the pockets of air in your stomach with this refreshing beverage, and it's pre-made so grab it on the go!On another note, I'm a bit sad that they don't offer fresh Greek yogurt!!! Maybe one day they will, and I'll add another star to this review then!Service and ambiance are great too. Food is served on a single platter so not much service is required here. The restaurant itself feels like a typical diner, so it's a good place for a casual dinner with friends"], ["Dimitrios J. A.", "This place is an excellent authentic Greek cafe style restaurant with both fast food and traditional home style Greek sandwiches and dishes. The decor inside it very nice with a vintage taverna feel with modern accents.I usually go for the chicken gyro sandwich and greek salads. I also like the home made Greek style dishes made daily on display right at the entrance.There are also very delicious desserts, I'd you like good baklava and other Greek delicacies of the sort."], ["Mike L.", "Greek Lady is a real hit or miss for me. It's slightly pricier than other potential options, but usually gives you what you expect. The hits: The Salads- Huge portions of lettuce and meat. It'll definitely fill you up. I generally prefer ordering the plain Caeser salad and adding the meats/other vegetables on top of it, I find it cheaper than ordering the Greek Lady Salad outright. Gyros- Hefty gyros filled with fries and great tzatziki sauce. Fairly standard. Great if you're graving their delicious lamb. However, you'll get a bit more food at Chipotle for the same price. The misses:Brunch- Nope nope nope. I keep ending up at Greek Lady for brunch on behalf of others, but each time I find myself wishing I had just made my own. First off, the individual entrees came out at different intervals. Next, portions are fairly small and of low quality. The sausages and pancakes remind me of what I'd get from frozen packets. Also, last time I went my friend ordered a sausage egg and cheese. What he got was a foot long hoagie, egg, cheese and four tiny (think frozen) sausage links. The Sides- The platter is admittingly a hefty amount of food for a cheap price. The gyro can be expected to be good, but most everything else is tasteless. They almost always fail to include gravy with their bland mashed potatoes. Any sort of vegetables you order on the side come out tasting like they were just boiled for a couple minutes. Desserts- Overpriced and stale. TLDR: Go to Greek Lady if you have a craving for a lamb gyro or a salad. Don't go for anything else."], ["Chuhan S.", "Never been the the store but had their sandwich at a lot of club events haha. I guess all I have to say is I like it but I don't know if I would personally buy it from the store ahha since I just eat it at events"], ["Jim P.", "I usually come to Greek lady once a week since am from NJ. My wife loves the grilled chicken with the baked veggies, I get the Gyro platter with baked vegies and a small Greek salad. I wished they dint chop up the chicken in the Chicken platter but I guess that's the way they do it. The pita bread should be grilled a bit more to make it crisper. And they should have a small house salad like a Greek salad that comes with the Gyro plate that you can get ala carte. All and all the place Rocks. its clean and the service is quick"], ["Mike F.", "Mass and fast produced Greek food sums up this restaurant fairly well.  Imagine your favorite gyro-serving lunch truck/wagon but in a permanent location and you'll have Greek Lady.  Always a good choice for lunch, but be warned if you dine in, it is -busy- and may not have seating for you.  Safe bets are to order out or avoid the 12pm hour as much as possible."], ["Nina M.", "Ordering delivery from here guarantees a lunch that is completely botched.  They can't accommodate modifications, even the simplest ones like \"make it a hot sandwich.\""], ["Bedir S.", "Probably one of the worst places to order food from. I have eaten in the restaurant and had delivery (which never arrived). A few things to note:1. The food is mediocre at best - and to top it off leaves you with an upset stomach.2. They mixed up my order through grubhub and I did not receive my food despite being charged.3. The staff are extremely rude - the manager hung up on me when I asked for my money backDont eat at this place, there are far better (and healthier) places in Philly. I would give it zero if I could"], ["Reva S.", "Good, but not fabulous. Giant salads and gyros are tasty, but quality is the same as some food trucks in the area and costs about twice as much."], ["James S.", "Hands down some of the cheapest and best value for Greek food. Also put french fries on their gyros.I usually get their salmon or grilled chicken salad. Easily holds me over for 2 meals, well balanced and incredibly tasty. Easy for simple delivery, or a quick bite on the undergrad campus."]], "Smiley's Cafe": [], "Kanella South": [], "Agno Grill": [["Julia E.", "I gotta give up the 5 star rating to Agno, it keeps me going at my job nearby and tastes homemade. It also does not break the bank and generally I am in and out in 5 minutes. If it was not here I am not sure what I would do truthfully, in an effort to eat generally healthy there aren't a ton of affordable fast options in this area. Basically Agno keeps me from surrendering and getting Chipotle every time I have to work late.The menu is incredibly simple, which makes it really easy to decide how to craft your bowl, everything generally consists of whole foods, isn't terribly salty or oily, and leaves me feeling like I ate a dinner I would make for myself at home. I haven't mixed up my order very much so I have limited feedback on what to get to eat, but I have tried the chicken, cabbage, rice, and cauliflower. Everything is super good and well-spiced.Generally my only bad feedback is the sort of small portions, this is just enough for me to eat for dinner, but I don't really eat large portions. Someone who is bigger or hungrier than me will definitely need to order extra sides and meat....so something to consider."], ["Tiffany T.", "Stopped by to try today and wasn't too impressed. Prices will range between $9-12ish depending on what you order. My falafel bowl came to $9+ with no extra fixins -- the chicken is $1 more. This place is gluten free, so it's probably got a bit of that \"health-conscious price tag.\" This is similar to a place in Maryland called Cava Mezze, but not as good, more expensive and smaller portions. I enjoyed the black rice, good texture and flavor. The falafel had a chalky type texture to it, I suppose due to being gluten-free the texture was off and I didn't enjoy this much. You can add 3 toppings, I opted for cauliflower, tomatoes and cucumber salad, and feta -- all of which were okay, but not that flavorful and nothing to write home about. I know I've got quite the appetite -- but I think it's worth mentioning that I finished my whole bowl and I'm still hungry.."], ["Erik M.", "I feel the need to double back just to say that someone must have read my post as the portion sizes have grown and have become consistent. The food quality, which has never been in question, has continued to live up to a higher standard, and the service/ staff is impeccable. Heck, there are days where their cheery demeanor and glowing countenance act as just the kick that the remainder of my day needs after the typical lunchtime low...Kudos Agno!! Cheers to you and your staff for the quality food and amazing atmosphere!!"], ["Dee M.", "I agree with a previous reviewer regarding the falafel. It was dry and a dough like ball and I won't get that next time.However all the rest was special and fresh. We both had rice, a protein and 3 veggies. We both enjoyed our meal. Just be forewarned anything extra is fairly pricey considering it lacks wait service and its cafeteria like seating( communal) . And everyone seemed to be ordering extras so it adds up. Lunch for 2 people with water and iced tea was over $30. Their beverages are home made. This was our second time driving in and parking and we enjoyed it enough to return."], ["Brian H.", "So what's a poor guy like me to do when he is all alone in a strange city with a lack of gluten-free options?  Turn to YELP to save the day!!!!!!!This place was pretty much the bomb; everything in it is gluten-free (hooray!).  Their menu/ordering system was a breeze with not a ton of individual options but loads of combinations.  Here was my order: black rice base with baked felafel + chicken (my extra protein) followed by chickpeas + spinach, quinoa mix thing, and roasted cauliflower all topped with a lemon/tahini sauce!  I was enough deliciousness for me head back up to the counter to try some cookies.  They did not disappoint!  The cherry walnut was so very moist and doughy--perfect.  The tahini sesame seed cookie was an interesting combination, but they pulled it off.Other critiques: both the black rice and baked felafel were a bit bland and dried out.Otherwise, really delicious!!!  If I am ever back in the area, I will be sure to stop in a fill up my tummy with gluten-free goodness."], ["Shelby A.", "Agno Grill is AMAZING!  I like to come here as often as I can for a delicious, fresh, healthy, and filling meal.My go-to is the salad base.  I usually get either chicken or steak as my protein.  However, ever so often I will get any of the other choices to mix things up.  The steak is probably my favorite!  Super flavorful and tender!  The chicken is right up there with the steak, fresh, flavorful and never dry.  Absolutely delicious!!  My toppings vary, I love the minted carrots, roasted cauliflower, and pickled beets.  I will usually get one of those three as my big topping and then get feta cheese and olives to go with it.Finally the sauces.  I really enjoy the spicy harissa and lemon tahini or the tzatziki.  The harisa has a kick and the tahini or tzatziki cools everything down.  They compliment each other perfectly! I like to switch between the tahini and the tzatziki to change up flavor.  Every so often I will also go for the hummus or the balsamic, both are also awesome.  I have yet to try the others, but I am sure I will soon, this place is certainly becoming a staple in my life!I have personally found that I get  a lot of food for my money and I almost always end up saving some of my salad for my next meal.  I find that I get more than enough.  Plus the ingredients are so fresh and high quality, I do not mind the cost. I hope to try a wrap or bowl soon, I just cant get enough of the salads!"], ["Christina V.", "Yummy! I love mediterranean food and this place is like the chipolte for mediterranean style bowls/wraps.  I got a bowl with lamb meatballs, roasted cauliflower, black rice, beets, and chickpeas with spicy harissa and lemon tahini. I also tried a sample of the carrots (with fresh mint) which were flavorful and intersting but not really my speed for lunch.  The sauces were delish.My bowl was fresh and wonderful.  However, for the price of the lamb meatballs- I felt the portion size was a bit small (only three small balls per order). I'd go back but this place didnt leave me begging for more."], ["Ingrid P.", "Agno Grill is the healthier version of Chipotle with better customer experience. Just like Chipotle, you can pick your base, protein, and 3 toppings with a wide variety of sauces. The amount of food you receive with an order is enough for two meals and provides you with your daily intake of protein, vegetable, and carbs. I definitely will be coming back when I'm in Philly!"], ["Andrew B.", "A decently priced, decently tasty, and decently healthy option. Chipotle of Greek/Mediterranean food. Most things were dry, which is why it gets 3 instead of 4."], ["Anupma S.", "I was never a super duper fan of Mediterranean food, but I must say, this place is amaze! Totally delicious!The setup reminds me of Chipotle because you can get a bowl, wrap, platter, or salad. Once you decide that you choose your protein, sides, and sauce. I ordered chicken with feta cheese, chickpeas, artichoke, and lemon tahini sauce in a black rice bowl (see pics)... SO GOOD! I was somewhat like, \"Will this combo even go well together?\" But credit should go to Agno for their menu item selection, because the bowl was delicious! As was my friend's who had a completely different combo. Seems like any combo will make for a great meal.Also what works is that every item tastes good individually. The chicken was perfect. The chickpeas were not too crunchy and added a great texture to the bowl. The artichoke was very tasty and the tahini sauce tied everything together magically. The black rice is really good and kinda calms down the bold flavors of all the other ingredients. Ohh and it was less than $9.00!Unfortunately, I ordered in so I didn't get to check out the place, BUT I did a driveby the other day (in a non-creepy way!) and the place looks super chic. Can't wait to try it again!!!!"], ["Aria S.", "After celeb reviewer Michelle C. and bestie Anupma S. gave this place 5 stars, I knew I had to come try Agno.Comments: 1. The ingredients all looked incredibly well flavored and fresh. Unique variety of med veg eats like beats, mint carrots, quinoa, etc. EXCEPT the Falafal, When she put it in my bowl, I thought she was going to fry it later or something. It was a dough ball, not a falafal. It was unappetizing to the point that it was left in my bowl afterwards which I rarely do.  2. Portions are very small, I was still hungry later. 3. Rice, 1 protein, 3 veggies, 1 sauce is actually not a lot of variety. I  wanted to try more than one sauce (tzaki and spicy harissa for example) but it's all extra. It came to $9.50 which is pretty pricey for non-waitress service, and an unfilling meal. I def have other Mediterranean places on my list."], ["JUSTINE M.", "Good variety for gluten free eating! Everything here is gluten free from wraps, salads, bowls and desserts. Reminds me of a Mediterranean chipotle.The staff are very friendly and helpful with the variety of healthy options to make your meal.Decor is well laid out, modern, clean and inviting.A good lunch spot."], ["Heather K.", "This place is delicious with a great concept. It's a Mediterranean version of Chipotle. They're on Caviar so I order from here all the time, too!"], ["Victoria Z.", "This place was disappointing. The place itself is nice and clean but the food lacks flavor. Basically, its boring. Very boring.  Also the pita chips and hummus is a ripoff. You get the tiniest bag of pita chips for $4! It probably only had 5 chips in it. And the hummus wasn't that good.  Personally I like my healthy meals to have some flavor and this place doesn't. Sorry Agno...."], ["Emily W.", "This one is a tough place to review because they do certain things so right and certain things so wrong. But when all is said and done, I still love getting food from here- sometimes even crave it- and I forgive many of their shortcomings. Agno serves the sort of food that I like to make for myself at home- wholesome, nutritious, veggie-heavy, and environmentally-conscious. That said, it's not going to win any flavor awards or convince any carnivores to introduce some more greenery into their diet. It caters to the already health-nut granola types who want something that jives with their food philosophy when they can't cook at home.My go-to is the wrap with falafel, carrots, spicy cauliflower, greens, and lemon tahini sauce. The wrap is a little spongy- a little reminiscent of the Ethiopian injera- which is a texture that I happen to really like. And their falafel should really not be called falafel because it's a far cry from the crispy-on-the-outside and soft-on-the-inside fried balls you can get down the street. With a name like that, they're just setting people up for disappointment. They should be called spiced garbanzo herb balls because it would really make everyone's expectations a little more realistic. Name not-withstanding, I actually kind of like the little bean balls, especially when crumbled in the wrap and doused with lemon tahini sauce.The things that would normally irk me if I wasn't so keen on their food offerings are that they are often out of a food item or two that I want and I have to wait for it, their wraps are sometimes a little stale around the edges which makes them a bit chewy, their chicken is a little dry, and they sometimes skimp on the veggies. I come here for the veggies, so don't skimp on them!"], ["Jarrod G.", "I'll give the owners the benefit of the doubt that they haven't updated their website rather than assume they were being deceptive, but the website for this restaurant claims that \"All poultry, meat and produce is certified organic,\" and it's not.I went to this place specifically to choose from a menu featuring organic meats.  The menu stated that the meats were local and hormone and antibiotic free.  A sign displayed the farms where the meats were sourced.  However, a quick check of the poultry supplier confirmed that they are not certified organic.  Yes, it's great to be locally-sourced, hormone and antibiotic free, but genetically-modified soy and corn can be and is used in conventional poultry farming.I opted for a vegetarian dish, and the food was tasty enough, but if you are looking for an organic restaurant, keep looking."], ["Yikai F.", "Love the food so much. My favorite recently! People are super nice. Glad I found this cute place."], ["Elissa W.", "I have a lot of mixed feelings about Agno, and I really wish I could give it 3.5 stars.  I've been here tons of times, and I'll certainly keep going back, but there are definitely places where Agno misses the mark.As others have said, the great things about Agno are that it's fast, convenient, healthy, and has a wide variety of options.  It's a Chipotle-style restaurant where you select a base (bowl, wrap, salad), a protein, a couple add-ons, and a sauce.  I always get the falafel, and my favorite add-ons are the mint carrots, roasted cauliflower, and garlic kale.  The falafel is baked, so it's healthier than normal falafel but not as tasty.  It's crumbly and a little mushy rather than crispy, but it's not bad.  Overall it's a really nice, balanced meal that you feel good about eating.  It's quick and easy to get to go, but also a pretty nice space to stay and eat in.Now for the bad.  First, and most important, is the taste:  basically, it's just okay.  All of the add-on options are pretty good, but no single thing is stellar.  It's all a bit bland.  As a couple other reviewers have noted, I think the portion sizes have recently shrunk significantly (or perhaps they're just inconsistent).  Finally, a couple times I've tried to go only to find that they were closed, despite their online hours saying they're open.  I wish I remembered the details so I could correct it, but I think the hours listed on Yelp are incorrect.  I love Agno as a concept, but wish it was a bit better executed!"], ["Jeff H.", "Agno Grill in Center City Philadelphia is my favorite new concept of any eating place that has opened in the last year. This is the best fast food I've ever eaten.  It shares the same owners as the wonderful Pure Fare around the corner .... and indeed Agno means pure in Greek.  Everything here is fresh and only from local farms in the Philadelphia area.  For those who are sensitive to gluten, it is 100% gluten free.Okay here is how it works - You order your base (bowl of black rice, salad, or wrap) .... then you order your protein (chicken, steak, lamb, salmon, veggies, falafel) ....then you order 3 toppings (my favorites are quinoa tabouli, cabbage, and chickpeas w/spinach) ... and then you get two sauces (the harissa is a must and the lemon tahini is not far behind.)   And there's your meal!It's fast, it tastes awesome, service is friendly, the place is really attractive on the inside, and it is conveniently located in Center City Philadelphia.  I would take Agno Grill with me wherever I go (I wish Vienna had one!). Go there once and I have a feeling you'll also become a fan!"], ["Sara S.", "Wow.What a phenomenal lunch.I went into Agno with a little doubt. I've seen similar concepts executed poorly leaving me 'hangry'.Agno was an enjoyable experience from the moment I walked in up to right this second as I contemplate going back for another rice pudding.It's a basic concept, make your own salad/rice bowl/wrap. Like a non-chain Mediterranean Chipotle. Their ingredients are healthy, fresh and unique. I got the steak (which was the consistency of brisket- just a heads up). The best way to describe the flavor of every thing is thoughtful. Each component to the salad tasted like it was prepared as a small batch. I'm really impressed. I will be back to try more. Soon!"], ["Sam H.", "YO! Yo! I need to propose that the Cherry Walnut cookies from Agno be accepted as legal tender along with bitcoin.We ordered from here for lunch. I went with the rice bowl. Upon popping the top of the container, I was skeptical of the portion. I looked skimpy, however, it was just enough to satiate my hunger. The food is fresh and nutritious with vibrant colors in the vegetables, not overcooked and limp.The tomato cumin sauce was a nice complement to my meal. I will be a repeat customer for sure."], ["I G.", "Very fresh healthy options. Tasty veggies and sauces. Have some meat selections and some Vegan. Good quick meal not too pricey. Had the lamb and tzatzki wrap. Will return."], ["Melissa P.", "Me (have no groceries and wanted to go out for lunch with my gluten free friend):Want to go to Agno for lunch? I ate too much this weekend/last night and need to feel healthy. Friend: What's that? Me: Basically healthy, Mediterranean Chipotle. Well, now we can only ever go here now for lunch because she's basically obsessed with it. Sidenote: I still don't know how to pronounce the name of this place: Ag-no, or An-yo?I've been here a bunch of times for lunch and although it's a little on the pricey side, I've decided there's really nowhere I will feel satisfied for under $9 in a 4 block radius from my office, so I may as well eat something healthy and delicious.Every time I come here I have a mini panic attack because I want everything, so here's your guide to my favorites:BASE: Spinach, black rice, the wrap. I usually go for the spinach.PROTEIN: I like the baked falafel, I had the lamb meatballs and thought they were a bit dry, the meat is not the standout for me.TOPPINGS: Big fan of the beets, the quinoa tabbouli, cucumber tomato salad, and the artichokes, which they often have as a special. These for me are the best part.SAUCE: I usually go for the tzatziki or lemon tahini, sometimes switch it up with the hummus. Second best part.The pita chips are really great too if you feel like cheating a little!They have limited drink offerings but you can ask for water, which they'll give you in a tiny cup. They take credit card (via ipad thingy) and I usually get my receipt emailed. Seating is casual, some large tables, some spots by the window, and some outdoor seating. It can get pretty crowded around lunch time.RECAP: Overall a solid 3.5 lunch spot, and I know I'll be coming more in the summer. Just wish it was a touch cheaper. I do like that they have the nutrition facts on their website."], ["Cee W.", "I was expecting much better. The food literally has no taste. Such a great concept but the execution is poor at best."], ["Jihye T.", "Love this place! They have all sorts of well seasoned veggies and protein options to create your own bowl or wrap of deliciousness. I love their braised beef an Harissa sauce, which is actually spicy. My favorite lunch spot near work! Great interior too if you want to stay, and their cookies are also yummy. One thing - why is there no knife offered at this place?"], ["Janelle R.", "Delicious, fresh & healthy food! Everything in their store is gluten-free, which includes the pita chips, wraps & cookies! It's pretty self explanatory, choose a base (black rice, spinach salad or wrap), choose a 'protein' (grilled veggies, chicken, steak, falafel or tuna),  choose up to three toppings & two sauces. I actually had four toppings, which was $.75 additional (no biggie). I chose black rice, falafel, beets, cauliflower, feta & cucumber/tomato salad, with tzatziki & lemon tahini sauces (plus a side of hummus & pita chips). I'm not one to usually go for healthy & gluten-free, but I'm really glad I came here. Everything I ate was delicious!My only 'negative' comment is I'm disappointed in their lack of a drink selection. They have a variety of unsweetened iced teas & lemonade, and the menu says they sell homemade sodas, however I didn't see any in the drink cooler behind the counter, nor was I offered any when asking about drinks. Not sure if they just were sold out of their sodas, or were trying to sell their iced teas. Although they did have a water cooler with small cups (for free water) on the window counter by the entrance.Overall, a great place for lunch & I will definitely be back (just maybe with my own beverage to drink)!"], ["Bre D.", "Basically a Mediterranean Chipotle, but no complaints there! It was sooo delicious! The staff was friendly and helped me out being it was my first time and wasn't exactly sure how to order. I cleared my bowl, I can't wait to return."], ["Lili W.", "Great addition to the restaurant scene in this area. I usually get the black rice with chicken and/or felafel, cucumber tomato salad, quinoa, chick peas, lemon pesto sauce and spicy harissa sauce. Fresh ingredients and very tasty. Agno should consider increasing portion sizes, I'm alway still hungry after a meal."], ["Ellie P.", "So disappointed. After all the reviews here, I decided to give it a try while in town for a business trip. I ordered a salad with grilled chicken---the chicken was dry and overgrilled, completely inedible. The tzatzki sauce was so overpowering with mint it was disgusting---will not return."], ["Amy Z.", "Thank you Agno Grill, for labeling the menu items as dairy-containing or not. I'm lactose-intolerant but not vegan, and love how I can choose from an array of veggies, meats, and dressings and not worry about a thing. Think of Agno as the Chipotle for all the vegan, gluten-intolerant, and lactose-intolerant foodies! Even if you don't have dietary restrictions, you won't even miss gluten or dairy after a bite of their lamb meatballs or quinoa tabouli. :)"], ["Zoe P.", "Agno is awesome! Their fresh, healthy meals are great to pick up for lunch, or dinner if I'm feeling lazy and don't want to cook. Even my husband is a fan, which surprised me since he's usually against paying for something that I could make at home. But the quality of ingredients speaks for itself, and their prices aren't that bad all things considered. You start with a base (be it grains or greens), add the veggies and protein you want, a sauce for some flavor, and boom! Instant, healthy, yummy meal. Can't go wrong with that!Even better - they've partnered with Unite Fitness to offer weekly meal services! Now I can order in advance, have them delivered to Unite for me to pick up at the beginning of each week, and then I'm on track to keeping healthy!"], ["Alyssa R.", "My absolute favorite for grabbing a quick healthy meal!! It never disappoints! (except maybe when the employees are skimpy on the amazing sauces). I always get the salad bowl and rotate between the felafel or the chicken.  I have tried about every one of the toppings, but the roasted cauliflower is the best! I also like that you get 2 sauces instead of just one (well because I like sauces!). I always get the hummus and the tzatziki   sauce. Although I have heard from friends the others are great. Basically I can promise that you will not be disappointed in enjoying a cheap, substantial, yummy and healthy (if you want to be) meal at agno! everyone should try it."], ["Pam S.", "Agno is a great addition to the Rittenhouse lunch options (although, they've been around about a year now, so the secret should be out!). It's so fast, so it's worth the walk from my building, because I'd rather spend my time outside and eating than waiting in line.This is fast-casual eatery, meaning it's a build-a-x (bowl, wrap, or salad) place. It's completely gluten-free, but it doesn't beat you over the head with it, and I think everything is tasty, and the vegan options are well marked.My go-to is generally a rice bowl with falafel (it tastes a little healthy, but otherwise pretty good) and the toppings are great -- love the carrots, beets, cabbage ... well, all of the vegan ones for sure.There's also plenty of seating, so it's fine to bring a couple of friends along for lunch, no competition over just a couple tables like other Rittenhouse lunch spots!"], ["Michael C.", "It's so good! I really enjoyed the fact that everything was vegan and gluten-free. It's very refreshing, because you don't have to ask about it; you just know right off the bat. Extensive choice of veggies, which is great because I'm picky.The only thing that was a bit off was the rice pudding. I expected something a tad creamier, but after the large portion of falafel and veggies, it was too heavy for me.That being said, I'd eat the rice pudding alone, so I'm not complaining."], ["Steve S.", "Hip vibe, spacious and clean.  Simple, tasty, modern, healthy Greek food, prepared and served at counter. Very well conceived and executed concept, great place for a quick lunch."], ["Stephanie S.", "I've been here once and I'm already obsessed!  I tried Ango Grill for lunch yesterday, and I see myself coming back all the time.  There's plenty of seating when  you walk inside.  The space is clean, trendy, eco friendly, and just looks healthy.  Now on to the food... Walk up to the counter and the menu is simple to follow.  Pick a base, pick a protein, pick 4 toppings, then pick 2 sauces.  Many choices, but not at all overwhelming.  I went with spinach base, baked falafel, and got 5 toppings for an extra 0.75 cents.  Everything looked so good I needed more!  The cauliflower was fantastic, I loved the quinoa with cilantro & tomato mix, the beets were sweet and yummy, and the chickpeas were also delicious with a parmesan coating.  I also got hummus on top, which wasn't as creamy as I'd wish, so I will order the taztzki next time.  The artichokes also looked amazing, but I exhausted all my topping options so I will get those next time too!   I got lemon tahini sauce, which was creamy and delicious.  I didn't know what sauce to choose, so the lady gave me samples on a small spoon to try the different sauces!  That is great service!  I tried the lemon oregano also, which I loved, but it was more tangy and not as creamy, so I went with the lemon tahini. Can't wait to go back and try a million more combinations.  For under $10 bucks, I got a delicious, healthy meal, and my belly was stuffed.  I'm in love with this place!"], ["Danan R.", "Very solid make-your-own bowl cafe with a good selection of toppings as well a a black rice base option.  I really liked the roasted beets, roasted cauliflower, and sauteed greens toppings, which is a nice change from the typical raw vegetables.  The chickpea salad and chicken are great as well.  You definitely get bigger toppings portions here than at sweetgreens, and I personally think that they are more flavorful here.  You get 3 toppings and a protein, as well as a sauce.  Try the lemon tahini sauce!  Most entrees will be about $10, depending on your protein selection and if you get additional toppings (each will cost you $.75).  Service is great and I actually like the wooden bench seating, which gives it a semi-hipster vibe."], ["Allison G.", "YUM! I love the 'build your own' style. I had a rice bowl with falafel, cauliflower, quinoa, tomato cucumber salad, and tzatziki. The falafel was a little dry, but otherwise it was amazing. It was the perfect fresh lunch, and I felt good about eating it. I took out, but the décor and seating area was impressive for a quick lunch spot. It was about $10 for the lunch. I'm curious to try a sweet treat next time!"], ["N S.", "A little pricey to hit up as a daily lunch option, but otherwise great. One of the few healthy AND tasty lunch options in the area - fresh ingredients, and good variety (except for the times they don't have a seasonal item). I wish they had some type of loyalty program, because I'd definitely go more often if every 10th meal were free or something."], ["Tiffany F.", "So I had just had my first Agno Grill experience for lunch today and it certainly did not disappoint! My boss had walked into the office earlier today with a visually pleasing, fresh strawberry lemonade. I was intrigued and had asked where he had gotten it from and it was from Agno. Once I had mentioned that I didn't even know what that was, he was appalled and claimed it was \"right up my alley\", so I decided to give it a try! Upon entering, I was blown away by the interior decor and overall ambiance. How did I not know this was here!? I took some time to look over the menu and everything looked great to me. The super polite gentleman behind the counter had asked if I had been here before and suggested that I try the special which was a lamb meatball Greek wrap. The thought of the wrap scared me for a second because I had noticed that it was gluten free. I am not gluten intolerant by any means and honestly feel my experiences with gluten free products have been pretty disappointing, but I decided to go with the wrap regardless. The guy helping me did mention that because it's more fragile than most other wraps, to make sure I eat it wrapped up and peel back the paper as needed. Thank goodness he warned me! Once I got back to the office, I dove right in and it was incredibly delicious. The ingredients were SO fresh and everything was so flavorful. The wrap itself was even great! I had also gotten a fresh strawberry lemonade and it was awesome. I wish I could've gotten a larger size! I will definitely be working Agno into my lunchtime weekly rotation."]], "Opa": [["Pete S.", "The food was excellent , waitress was never all there. It took her the whole night to warm up and was still dry. A little on the expensive side for the portion size. Once again food is very good."], ["Suzanne G.", "With so many great options for excellent Greek food in the city now, this was deeply disappointing.  Super small portions, even if they are small plates designed to share.  The Spanakopita was burnt black on the top.  Hard to imagine any kitchen feeling good about sending that out to the table.  There was more dough filling than spinach and feta, which I assume was phyllo, but it was so thick and chewy, hard to tell.  Roasted eggplant dip was tasty, but so poorly pureed that it remained chunky and stringy, thus difficult to spread on the 1/2 piece of pita provided.  Have never been to a Greek restaurant that is not generous with a stack of pita to soak up every bit of dip and sauce...until now.Service was friendly and attentive, but then we were the only table in for lunch.  Would not go back"], ["Renea R.", "Let me preface this review by saying that I have only been to Opa's outdoor beer garden so I'm not sure what it is like inside.  My friends and I had been at Happy Hour at Bru but we decided we wanted to grab some drinks before we went out dancing and Opa's happened to be right across the street and we were happy to be able to sit outside.  My experience is mostly summed up by my friend leaning over to me numerous times and saying, \"isn't everyone here kind of a...d**chebag?\"  Perhaps those words were a little strong due to the alcohol in her system, but I had to agree that it just wasn't my scene.  A lot of preppy guys in khaki shorts and checkered shirts and girls in barely-there dresses.  I don't like to judge, but it just sort of carried a bad vibe.  Add to this the fact that drinks were way too expensive.  The only redeeming quality is the fact that you can sit outside and there isn't a cover.  They also have games like Jenga and Connect Four for you to play which is kind of cool.  Other than that I just wasn't feeling it."], ["Jenny S.", "a review JUST for cocktails at the bar!!! we decided the modern bar at this restaurant was the perfect destination as we waited for at table at Barbuzzo around the corner---Xinouli: a Greek style margarita, YUM.. so refreshing.. i love all drinks similar to margaritas---Mouro: again the boyfriend loves that bourbon but i am not a fanpeople across the bar were ordering tapas which looked like they'd pair nicely with some more cocktails, but sadly we could not stay!"], ["Sean E.", "Came here for Greek Independence Day for the tasting menu and it was delicious.Nice atmosphere and some really great wines."], ["Leann F.", "They changed their menu yesterday and got rid of all of their good food. I don't know why they changed everything as their menu before was okay. I used to get an appetizer sampler plate with olives, feta, hummus and pita but they don't offer that anymore. When I asked if they could whip something comparable up, considering they still had the same ingredients, they told me it was not possible. They simply refused to make me a plate of feta, olives, and pita. After having to ask 3 times they then gave me a side of feta that tasted like goat cheese (which I hate). Apparently they are changing to a more \"tapas style\" cuisine and recommend 3-5 dishes per person at around $7 a piece. It's insane. The portions are so small and so bland and tasteless. Plus, there are hardly any options for vegetarians. In all honesty, I will not come here again. If you're reading this, Opa, please go back to the old menu. Your restaurant will surely close down soon if you do not."], ["Tiya B.", "The waitstaff need to seriously get it together. When I walked in the restaurant, no one greeted me. I stood there for a good five minutes getting completely ignored, and there was hardly any customers. I had to ask whether I needed to seat myself before anyone even acknowledged my presence. The hostess/waitress acted like she was super annoyed. The food wasn't even anything to rave about. Definitely will not be back here."], ["Perry H.", "Decided to stop by for a couple drinks...the drinks were going great until I saw the mouse running around the restaurant. I alerted the bartender who shrugged and commented \"well, you're always going to have one running around.\" Really?! Cuz I go to a lot of bars and restaurants and I've never seen a mouse running around....done with this place."], ["Lauren C.", "The boyfriend took me out to Opa on Friday night for our 'date night'.  As soon as I walked in and saw how swanky and cool the decor was, I thought we were doomed!  Typically the dingy greek places are the best... but boy was I in for a treat!They were out of my preferred beer- the Saison, so that was a bummer, but I landed on a nice brew that was pretty tasty.Rather than commit to entrees, we opted to split lots of appetizers so we could taste lots of different things.  I'm the token PITA vegetarian, and he very much likes meat so there was a bit of compromise (on his behalf) that happened.  We ended up with the mussles, the spinach coquettes, the Spread Pikilia, and the Beet Salad.The Spread Pikilia came out first, and it was tough to decide, of the 4 dips, which one was the best.  I loved that they brought out veggies and olives and pickles in addition to the pita bread.  We dug in big time.  The pickles were really vinegary, but they were tasty!  The babaganoush was a bit sweet which made it my least favorite of the 4 dips after lots of sampling.  We ran out of Pita and the server was happy to bring us more.Next came the mussles, which I don't eat... but my boyfriend was blown away.  He enjoyed every single one of those bad boys... and the sauce and the bread it came with.  The smell of the sauce was heavenly.  I almost ate one.  Next came the beet salad.  This was good, but similar to the pickle, it was really pickled... REALLY pickled.  It almost hurt my mouth to eat.  We both agreed that this was the dish that we could have done without.  It wasn't bad in any facet, but of the stuff we had, this wasn't the high point.Finally, the Spinach Coquettes came out.  I have been dreaming of these since.  They were chock full of spinach, with cheezy undertones, lightly fried, in this amazing smokey creamy sauce that was just a total game changer.  I gave one to my boyfriend, and tried to save him a 2nd one... but only managed to save him 1/2 of a 2nd one... because... well... i ate it...All in all, Opa was reasonably priced, the decor was awesome, the service was quick, thorough, and gracious, the food was delicious etc.  I also have heard rave reviews about the courtyard out back.  We had planned to check it out, but we were full and sleepy after dinner.  The good news is now we have a reason to come back (and get those Spinach Coquettes!)."], ["Selma C.", "Cute place for a nice casual dinner. I came here with friends from out of country. The pork ribs were delicious and the service was really nice with Jessie. Good to have a conversation without the really loud noise."], ["Charlotte E.", "The service (we had Richard) and the meal were fantastic. The mixed meat plate is an absolute must and can definitely be shared among 2-3 people. We also had the stuffed grape leaves, which were out of this world. GET HERE."], ["Ellis S.", "Thoroughly enjoyable dinner.  Everything was tasteful, well-seasoned and artfully presented.  Waitstaff patiently reviewed menu, answered questions cheerfully.  Precisel what I expect when dining-out."], ["Grace C.", "A trendy, candlelit place that's great for a Friday night out, either with a date or with friends. We got the mussels appetizer after the server recommended it to us--which was loaded with flavor. My only complaint was that there was not enough pita bread for dipping in the broth after the mussels were done. My friend and I split the special of the evening, the beef tenderloin, which came with greens and roasted potatoes. The potatoes were our favorite part of the dish, as they were lightly crisped and seasoned well. Dessert was the loukoumades, which were greek beignets with honey cinnamon drizzle, walnuts, and spiced banana. A tad on the sweet side, but good nonetheless. It went well with our cocktails, which were on the strong side. I tried the koukla, which was pineapple vodka, lemon, and lavender. Our server said it was the most popular drink on the menu, and it certainly did not disappoint.This place is yuppie central, perhaps due to the outdoor beer garden in the back of the restaurant. It's great for post-dinner drinks, and is rife with cool games, chairs, and lights strung across the yard. Music is loud and trendy--perfect mix for a good night out."], ["Julio A.", "Nicole and John are the dynamic duo of the outside bar. They attend to all the needs of the patrons. They put the \"happy\" in happy hour for me and my group. Can't wait to come back next Friday. I hope they are there."], ["James V.", "This is a great place to grab dinner and even better for happy hour.  The addition of outdoor space behind the restaurant has really made it a go to spot for summer drinks.  They offer Jenga and Connect4 to entertain patrons drinking in the back.  A ping pong table is also available and frequently the spit has a roast cooking.  A large beer menu and some creative mixed drinks ensure a good time for all."], ["Julia H.", "Don't go for dinner after 9:00, otherwise you are paying top dollar to hear extremely loud music (DJ) that is impossible to talk over AND to have someone'a back or coat in your food. You have been warned!"], ["Grace K.", "GREAT SERVICE!opa is great for groups or individuals. I went to the outside bar for a work happy hour and went to the indoor bar with a small group to enjoy the happy hour. The bartender was fabulous and very attentive considering how busy she was... no complaints here!"], ["Jackie W.", "The food and drink is nothing outstanding. It's a solid bar and restaurant but there are better places around the city.The mussels appetizer was good, but the service is absolutely terrible so I'm downgrading it from 4 stars to 3."], ["Noor S.", "Cocktails were spectacular! We waited for about 15mins before anyone came to our table. Chicken was dry and don't even think about desserts! We had the creme brulee (or that's what they called it on the menu), the custard was more of a pudding and the carmelized sugar was hard and too thick. In addition, the fig ice cream was basically vanilla ice cream. If I ordered vanilla, I would've been satisfied but it was fig, so I expected for it to taste like figs! Overall, the service was good but the food could've been executed much better!"], ["Jennifer M.", "I had the beet salad and I had them add grilled chicken. It was real good. The service was excellent!!! I would definitely try this place again!"]], "Sandy's": [], "Al Zaytouna": [["Meghan D.", "I went here for lunch with my sister in law and it was perfect. We sat outside since it was beautiful out. The waiter quickly came out to clean the table and took out drink order. We both decided on an entree dish, I got the grilled veggie. The entree came with a salad lightly dressed, hummus rice and the veggies. The vegetables were perfectly grilled, not over cooked and the hummus and pita was great. My sister in law enjoyed her grape leaves. We both enjoyed our meals and it was served very quickly. I would go back."], ["Sara P.", "I am so glad that we finally had a chance to eat at AZ.  It's walking distance to our house and to most of Center City. The food is spectacular. My husband had a deluxe falafel sandwich that one friend mentioned could be used as a missile (if it didn't taste good) because it was so large.  Fortunately for my hubby, it tasted good and he ate the missile filled with deep fried eggplant, french fries and falafel. I had the warm grape leaves and a delicious salad.  We bought enjoyed the Egyptian iced tea with gallons of water brought frequently to our table.The server was really special. He paid a lot of attention to us, gave me suggestions for food based on my worry about too much spicy, and told us about the take out and delivery services.  I always try to mention downsides when I write reviews. So, here goes (but only out of obligation).  The inside of the restaurant could use a softer touch. Maybe paint the one ceiling bump out with a bright orange or blue, and get another poster like the one of doors of Tunisia.  Finally, a plant or two?  (Owners, if you want some free help, I'll come and give you some ideas). Second, parking is a little difficult in the area (not the AZ's fault, of course) so think about walking or biking or having delivery.  But  if I were you, I'd run not walk, ride my bike at full speed ahead, and call AZ quickly. You can't go wrong with the food."], ["Julie A.", "I was looking for fresh, healthy mediterranean food in Philly and found Al Zaytouna through Groupon. They had a $35 for $21 special so I decided to try it out. We had the hummus and baba ganoush to start - both delicious. The baba ganoush was probably the best I've had. Then I had the greek salad topped with chicken shwarma, which was so fresh and tasty. The chicken was prepared wonderfully. My boyfriend had the mixed kebob, which came with rice, a salad, and hummus for only $15. He loved his dinner as well. Even the pita came to us fresh and hot.The owner, who served us, was polite and friendly. The restaurant is clean and spacious. Overall, I would definitely come back and I can't wait to order takeout as well!"], ["Nina S.", "They serve the best hummus in Philly! I love this place so much. It is great for take out or eating in. The setting is very quite so it's perfect to go and catch up with friends. Don't forget your wine because it is BYOB! Eating in is a relaxing experience because the service is friendly and the food is fresh out of the oven. My favorite dishes: Hummus! (of course!) Grape Leaves appetizerLamb Kabab platterGreek Salad Falafel Sandwich"], ["Alea G.", "The is my absolute favorite place to order from in the neighborhood, even surpassing all the Italian places in Italian Market. The chicken shawarma platter is amazing and gives you a taste of everything. The chicken is expertly seasoned and the rice a perfect compliment. It also comes with hummus (the best on this side of Broad St.) and a small salad. Other favorites are the grape leaves and the falafel. I would 100% recommend this to anyone in the area for eat-in, take out or delivery."], ["Aidan C.", "Came here for lunch on a Saturday and surprisingly no one was there at the time. We ordered the falafal appetizer, chicken kabob entree, and a large greek salad all to share amongst three of us. It was all super delicious and I can't wait to go back! I think the kabob entree was probably the best deal because it came with the chicken, vegetables, rice, side salad, and a generous portion of hummus and pita. The service was also good, which you would expect since we were the only ones in the restaurant at that time, but the staff was so friendly so it made everything even more pleasant."], ["Shannon G.", "I'm not sure if the other Yelpers ate at the same place. My girlfriend almost choked on the lamb. It was either so overlooked you could barely chew it or a cheap price of meat. Falafels and hummus tasted straight out of a box. Ambiance and presentation of the food was horrible. I would never go back."], ["Loren Y.", "I've ordered here a couple times and haven't been disappointed yet! I love their grilled chicken kabob platter that comes with a salad and hummus. I've also had their large garden salad and their homemade, simple dressing is phenomenal. Definitely will order from here again."], ["Eric B.", "Reasonably good food. Prefer the Falafel sandwich from the south street Greek restaurant. The hummus and pita was also tasty. Prices were good and the delivery was on time. I Will certainly go back in the future."], ["Sook K.", "Food was so good and delish!!! Fresh and the service was awesome. We went with a groupon but will def be going back again!"], ["Anthony C.", "Great Mediterranean food.  The falafel sandwiches are fantastic.  The lamb dishes are good. I've not had a bad meal here"], ["Tiya B.", "I've ordered from this restaurant a few times on grub hub. I haven't been disappointed as of yet. Great hummus, falafel, and kabob. Very fast delivery."], ["Michelle C.", "I ordered delivery from Al Zaytouna based on the many reviews by friends who had also ordered, and enjoyed, delivery. My experience was no different. My order arrived fairly quickly and everything was intact and kept separate by a divided container. The pita was a bit on the tough side but I didn't really mind. I liked the thinness of it; perfect for wrapping everything up into rolled sandwiches. The chicken from my kebabs was a little bit dry, but with some hummus and veggies, it still tasted good. There was so much food that I actually had some leftovers, which I promptly tore up after a night on the town later that evening. I'll definitely hit up Al Zaytouna again for future delivery."], ["Alex R.", "Delicious falafel and baba ghannouj. The shrimp served with the \"shrimp salad\" taste fantastic but are hardly \"large\" in size. The falafel deluxe sandwich is tasty too, served with eggplant and french fries inside!"], ["Arianna K.", "Just moved to the neighborhood and we ordered takeout from here-delish! I will definitely order from here again!"], ["James S.", "One of my favorite neighborhood Mediterraneans places. Always prefer ordering here for delivery when I'm in the city. Recommend to anyone looking for a decent bite. I'm vegetarian though, so take my words with a grain of salt."], ["S P.", "Needs more flavor!!!  Tabouli was just tomato salad.  Tahini or garlic sauce would have been great"], ["Michelle M.", "The owner of this place is really a great guy; after a mishap regarding an order, he made the effort to apologize to me in person.  The food is super good here, and the people are honest.A great place to order when you work late a lot like me; healthy, delicious and fast.If you experience a glitch when ordering from here, ask to speak to the owner.  He seems to really care about his customers..."], ["Rissa V.", "Have always had a great and consistent experience here, whether dine-in or carry out.  Everything is delicious, with no complaints.  Love how smooth and tasty the hummus is.   Always love various sides and end up getting full before my entree comes, which is no problem because i do love leftovers for the next day.  I usually end up with the chicken schwarma entree.    Wish they would carry lamb, but the guy claimed it would bring the price too high for that schwarma, and then people don't order it.  oh well.  When dining in, don't forget to BYO!  It is a cozy and clean dining experience in the back"], ["Jimmi S.", "Last time I ate there, the falaffal chipped my tooth.  It was way too hard.  Belch."], ["A L.", "I went there with my mom/step-dad and fiancee'. The food is great. I think it's 4 star but gave it a 5 star because my mom/step-dad love it so much they bring all their friends and are willing to go a couple times a week (this coming from a couple that dislike most restaurants, and prefer to eat at home).The food is fresh tasting and cooked right (I am mediterranian so know what is good and what is not when it comes to this).  They are friendly, and BYOB never hurts!"], ["Jaclyn B.", "Chicken kabob platter was so delicious, as was the berry juice.  The platter was perfectly portioned, containing:  tender grilled chicken, delicious veggies (red pepper, onion, and zucchini), and that tasty bed of rice was abundant.  The platter also came with a tiny fresh salad (cucumber, mixed greens, tomatoes, and red onions), thin pita, and nice helping of perfectly spiced hummus.  The meal as a whole was very cohesive in terms of spice and was absolutely satisfying.  My one problem with the meal was the soup.  I ordered my meal via grub hub, and Al Zaytouna does state \"call for soup of the day\".  I figured it would probably be lentil soup of some kind, and decided not to call.  I got some kind of broth.  So, my bad for winging it, but I was still disappointed.Overall my meal was really solid, so I highly recommend!  Thanks, for the 411 on this spot fellow yelpers."], ["Renee Marie J.", "Great spot for a holiday get together w friends !!"], ["Leigh M.", "Truly disappointing.  I'm not exaggerating when I say this was the worst salmon I've ever had.  And I wasn't expecting much, but it was incredibly tough and chewy.  They also failed to bring us one of the items we ordered."], ["Steve S.", "Just moved into the neighborhood and glad I found this gem. Staff is super friendly and the food is delicious. Nothing fancy, just good food. Chicken shawarma sandwich is great and a great value. It's not the fake, greasy stuff. i have found all of my orders to be consistent too. They also have outdoor seating , which is nice. Definitely stop by and give it a try."], ["Tahira M.", "GREAT food that is always consistently fantastic. Five stars for the service, restaurant, and the food.Try the hummus, the entrees, the juice, the salad..."], ["Izabella J.", "The place is rather simple in its decor. The staff is rather average, but actually appropriate to the kind of place this is. The food tasted good, but then afterwards me and my friend didn't feel very good. I donno, it might have been a coincidence or maybe they fried the falafel in lard or other animal oil... We are both vegetarians and gluten free therefore we're definitely more sensitive to the quality of food."], ["Dave P.", "Awesome wraps.  Lunch is great.  Get the Chicken Shawerma \"Sandwich\", you won't be disappointed."], ["Mikey I.", "Thus far I can only rate this placed based on one delivery experience.My roommate and I both ordered mixed kabob platters. They arrived in reasonable time and were delicious. The lamb kofta was my favorite, but the chicken, steak, rice and veggies were all delicious.It beats a similar middle eastern place right on my very block in terms of pricing and value. I can't wait to order again and I'll definitely make it a point to dine in at the restaurant at some point."], ["Luke L.", "Food is always fresh and well cooked. I've only eaten at the location twice both times I sat outside so I can't speak to the \"ambiance\". Delivery is typically 40 min and the food travels well. I get the mixed kabob platter it always brings a smile to my face."], ["Laura S.", "I happened to read Vinny P's review of Al Zaytouna while I was hungry and contemplating diner. Delicious hummus and kebabs delivered to my door? Yes please. They're a very solid option for delivery. Online ordering was easy, estimated delivery time was 30-45 minutes (I'm a bit far from them and it was in the middle of dinnertime, so totally reasonable) and my food was delivered on the early side of the estimate. Thumbs up to reusable takeout containers.The food was solid. The hummus is delicious and the portions are generous. I didn't realize the chicken kebabs came with hummus so I also ordered an appetizer portion - I've had hummus and pita for going on 3 meals now (the pitas are excellent - I love Sanna's, but if they have a flaw it is that the pitas are often dry). Mmm. The labneh is excellent and also a generous portion for the price. The chicken kebabs were juicy and came with delish grilled vegetables. I wish the portion of chicken had been a little bigger, and the rice needed a little bit more seasoning (I ate it with the hummus and labneh, problem solved)."], ["Marla M.", "I've eaten here a few  times and have been utterly delighted with everything I have ever ordered. The salads (with their tasty lemon vinaigrette) are worth going for alone.It's definitely my new favorite spot for Greek food in the city."], ["Abby W.", "I ordered delivery here last night even though I only live about 2 blocks away, but in my defense it's because I was ordering a whole lot.  Some guests unexpectedly came for an evening of entertainment I was entirely unprepared for, so I decided to make my life easier by ordering a bunch of Middle Eastern items to lay out for noshing.  I got hummus, baba ganoush, mishwia salad, an app order of falafel, a falafel platter, and three sandwiches: kofta, shawarma, and lamb. Total was about $60 and took about 45 minutes via Grubhub.The best thing for me is this isn't Greek, so there isn't yogurt in everything.  They use hummus as their sauce of choice which is great for lactards like myself. The falafel was fantastic- super crunchy outside and nicely seasoned.  Hummus was good and baba ganoush was amazing.  The mishwia salad, a wildcard choice of roasted chopped peppers that I had never heard of, was also excellent and added a nice zing to our self-made falafel pitas.  The sandwiches were a little more uneven.  Lamb and shawarma were all delicious by consensus but the kofta violated some fundamental aspects of sandwich-craft.  I had to remove almost half of the pita and most of the lettuce/tomato topping, and then once rolled back up had the perfectly balanced pita sandwich.  The issue is that the kofta is a long thin tube of seasoned ground meat which didn't hold up against the volume of all the other ingredients.  However, I found the seasoning of the kofta to be quite nice- plenty of mint and cumin, and there were some tasty grilled veggies hiding in there.I sliced the sandwiches in half and served everything on platters.  The whole spread fed 4 (admittedly not huge-eating) adults with tons of leftovers.  I would definitely order again but will steer clear of the platter/entree options as getting sandwiches with apps is a much better deal.  The size of the falafel entree was pretty skimpy for the price."], ["Michael N.", "The two times that I have come here for lunch, this place has been totally empty.  I can see why: hard to see from the street, totally obscured by the mob waiting to get into Sabrina's, and the frontage is very narrow.Once you get  inside, it is very deep and seats plenty.  This last time we ordered a selection appetizers and just picked at stuff.  The prices are very fair, but nothing we tried was truly remarkable.  The grape leaves were ok, as was the falafel.  The hummus was kind of bland and the tabouli seemed like it had been sitting around for a while, while the tomatoes were a bit under-ripe.  The fries (for the kids, relax) were a bit droopy but they tasted ok.The Turkish coffee was a bit thin for my taste and the baklava seemed like it was not very fresh and it was ice cold.This place does in a pinch if you are on a budget and want something that is not greasy Italian market pizza or you don't feel like waiting forever for a table at Sabrina's, but better fare is available elsewhere."], ["Katherine S.", "I was just reminded while reviewing another middle eastern place in town that I was thinking about Al Z as the gold standard.  I've come here and ordered delivery several times since it opened.  Everything I have eaten here has been superb - I've had cravings for the smoky baba ganoush which is to die for, I could eat a big bowl of it with just a spoon.  One time I was taking a large group through a \"tour of the world in the Italian market\" for a charity auction and we went into Al Z for a rest and a snack.  The staff could not have been more accommodating of our large unexpected table, bringing plate after plate of goodies - salads, tabbouleh, hummus, baba, foul (as in the bean dish), stuffed grape leaves, pita, falafel.  We had foodies in the group as well as those who had never tried any of this - everyone was delighted, and the check was ridiculously little.   Excellent vegetarian choices.  Deliveries to my home about 2 miles away in center city have always been timely, accurate  and devoured.  This is a great place to take a break from your grocery shopping or if the late brunch line next door at Sabrina's is intolerable - you can sit at a sidewalk table and make the line standers drool.  I've had middle eastern food (low key type place) this good in Paris and London but I think this is best I've had in the US."], ["Melissa W.", "Based on the reviews thusfar, I was expecting this place to be amazing. Unfortunately, Yelp has led me astray. The people here were extremely friendly, but the service was a bit slow. Regardless, the food was just okay. it was pretty average and generic Middle Eastern. I think there was a vague Tunisian theme going on, which would have been great had they offered anything specifically Tunisian. The Greek salad was overwhelmingly lemony; and if I'm not mistaken, real Greek salad does not generally contain so much lettuce, and is not so stingy with the cucumber. Also, their pita bread is the thin papery kind, and is quite obviously store-bought. Fine, a lot of places don't make their own pita, but they could serve something better than that. I'm not sure why everyone on Yelp so far has said something like, \"OMG the food here is SOOOO cheap!\" It's not really that cheap. I expected the $18 combo platter to be huge, and while it looked pretty huge, there actually wasn't all that much meat on it. Certainly not $18 worth, and the quality of the food didn't make up the difference. The smallish piece of salmon was dry and flavorless, the minuscule kofta link was oddly spiced, too chewy, and strangely gamey, the 4 bite-sized chunks of kabob were average. The singular tiny lamb chop was pretty good, though. Also, the hummus was quite good as well. For better and more cost-effective Middle Eastern, I'll stick to Kabobeesh or Saad's, which are both closer to home, or Divan for nicer ambiance. Heck, I'll even take S&H Kabob House or any of the other places on South Street (South Street Souvlaki, or the one with the Disney's Aladdin window painting) over this place. I was going to give it 3 stars, but 2 is \"Meh. I've experienced better.\" And I have. Plus, the two stars might balance out all the overwhelmingly positive reviews."], ["Scott F.", "I'm so glad this place has opened up in the neighborhood, sorely in need of tasty fresh middle eastern style food.  It's inexpensive, the food is delicious, and the service is friendly.  The baba ghanouj is the best I've had in a long time.  The finely chopped vegetable salad is delicious.  The foul is better than anything I had in Egypt.  The felafel and grape leaves were also excellent. It's curious that there were not more patrons, though I suppose it's a competitive neighborhood with a lot of very well established restaurants.Give it a try."], ["Sarah L.", "Fairly new joint that is already getting great reviews. My boyfriend and I set out on a Sunday night quest for falafel and decided on here based on other Yelp reviews. Convenient location in little Italy and warm welcome upon entry from the host/server and the cook. Simple carrout counter and grill station behind it followed by a narrow but clean, simple and warm dining area. Our eager host was quick to feature the whole barramundi special of the night but we stuck to our original craving of falafel pita sandwiches...and they didn't disappoint! Fresh pita rolled tightly around perfectly fried falafel, lettuce,tomato, onion and hummus. Pretty large sandwich and very reasonable price! The grape leaves we started with were awesome too. I've been searching for good falafel since I moved back from NYC and this place is it.Can't wait to come back to try some other dishes. They are eager to showcase their food and I love that! BYOB on top...sold!!P.S. Order the iced tea...very good. And let them talk you into the special fresh fruit pureed drink they offer. Vitamin C berry boost and so freaking good."], ["Adrian F.", "Got a flier for Al Zaytouna in my door one day and just decided to try it - it has been my love for Mediterranean delivery since (other than Mazza). Things to notice: 1. If you're ordering through Grub Hub, expect an hour and 10 minute wait. Why is this? Is it grub hub? If you order by phone, it's around 45 minutes. 2. Go ahead and go there to eat too, it's quiet, really nice and the owner is just as nice. 3. I've had most of the menu (so far) and it is all really fantastic. I really like the hummus, baba, chicken kabob salad (with a delicious lemon/olive oil dressing, so light) and grape leaves, for point of reference. The price isn't too bad either. If you're looking for something other than your usual, try this place out!"], ["Alexa R.", "One thing is for sure: the falafel may give Mama's a run for her money. We decided to check out Al Zaytouna after receiving an entincing menu in our mailbox. We opted for the falafel app (we got the sandwich instead), the hummus (which was absolutely heavenly - very heavy on the tahini, no garlic to be tasted at all), the chicken gyro sandwich and the chicken kebab salad. The dressing on the salad was refreshing and lemon-y, which I loved. We used GrubHub to order and walked a block to pick it up to check out the space. The restaurant was pretty full, both inside and outside and the owners were so nice! I can't wait to go back."]], "Effie's": [], "Dmitri's": [], "Bitar's": [], "Estia": [["Tarini S.", "This place is really outstanding. You really know a restaurant has great food when you can be extremely satisfied despite only eating a meal of side orders! I got the spinach rice (tastes much better than it sounds - trust me) and grilled vegetables (standard, but good). My mom got the roasted chicken entree and it came on a delicious bed of yogurt orzo with caramelized onion and a thyme jus. That one bite of chicken was possibly the best I've had in a long 'thyme' (haha)!The ambience is a little more sophisticated than I'm used to for my age group - but it was great to bring my mom here for dinner. The only negative part of my experience is that we kept getting interrupted with people asking whether we're done. 4 different guys came to ask us within the span of 30 mins!! Before you think it, NO the place wasn't full. There were plenty of open tables and no guests waiting to be seated. (This is why I had to knock off one of the stars from my rating.)"], ["Doina N.", "Many thanks to Estia and the manager last Saturday night for pulling out to serve us dinner 10 minutes before the kitchen would close. I made a reservation to Estia for 10 PM thinking that the show at the Academy of Music was going to be over by then. Well, I was wrong! I called to postpone 30 minutes and the hostess said that kitchen closes at 11PM. Show didn't finish until 10:45 and we were starving. My boyfriend would not go anywhere else because he was craving hummus and pita bread. Ugh! Most likely, we were one of the first few people to go down the steps from the amphitheater. We were quick. Made it at the restaurant at 10:48. Obviously, the hostess notified us again that the kitchen would close in a few but we were able to sit. God knows how many servers were mad at us when saw that we grabbed a table. However, one of the managers made sure that we got served, left happy and satisfied. Immediately, they brought the fresh pita bread and hummus. We devoured on both of them and ordered our main dishes as fast as we could. They brought us a second round of very warm pita with hummus. We felt a little inappropriate since it's not like we wanted to have them work extra on a Saturday night which is the busiest day of the week. But as I mentioned above, our food cravings were too strong. My boyfriend ordered a fresh Louvraki (This fish made it's way from the Mediterranean all the way to Philly! Yay!). He liked his dish very much. I ordered a moussaka since I haven't had this dish in a very long time.  I couldn't finish it for three reasons: I ate too much hummus and pita bread, portion was a little too big, and it's a heavy dish from all the ingredients stuffed on top of each other. Certainly, it was delicious. There's an option of a three course dinned for whoever saw a show at the Kimmel Center or the Academy of Music. It's well worth it for $30 per person. The restaurant inside is very spacious, decorated in details to give the Greek vibe. I would recommend asking them to sit at the booths - they're pretty comfortable and more private. I'm sure that I'll be back here very soon after another show or maybe for brunch. It's a lovely spot. Whoever, thinks that's not top notch may be right - but gotta be a fan of the food they serve to really appreciate them."], ["Pete L.", "Great location, delicious food, and awesome service. Loved it and will be back. Did make a reservation and still had to wait 30 minutes, but other than that we had a great experience."], ["Natalie K.", "This place was great! I took my parents here for lunch when they decided to visit randomly one weekday. It wasn't too crowded for lunch time, so it was nice to get to try the restaurant with the full attention of the wait staff. They sat us by the big windows overlooking Locust St. There was a ton of sunlight coming in and it really made for a pleasant dining experience. We had the Estia chips to start - crispy zucchini and eggplant served with a tzatziki sauce. I thought they were really good! I would recommend that for an appetizer for the table. For my main course, I had the crab cake burger. I thought it was pretty good and it was a nice, lighter option for lunch time. My dad had the beef souvlaki and he thought it was OK, but not the best. My mom had the Arugula salad, which was fine. The bathrooms are the floor below the main dining room and so you got to check out the private dining room that they have for large parties downstairs. I thought that was a really nice option and my parents made a mental note for the next time they were in town with a few of their friends."], ["Amanda N.", "I am torn between 2 vs 3 stars. I really don't like giving bad reviews. The restaurant week menu felt uninspired for our large group this past Sunday. I was excited to order the soup as it was a cold rainy day. It reminded me of a play on congee rice porridge which was ok tasting overall but I wouldn't order it again. BF's salad was very simple and plain: greens and balsamic vinaigrette. The winning appetizer would be the crunchy fresh delicately coated calamari. The tile fish entree was bland to our group as well as the lamb pita. The dessert was our least favorite as it was a very simple slice of almond cake with a teeny butter-sized scoop of ice cream that honestly overall felt like an afterthought but I grew up in a bakery so my standards are a bit pickier for dessert. With some extra sauce or salt the entrees would've been more satisfying. We ordered off the restaurant week menu an appetizer which our waiter forgot to put it. That was the only dish that seemed up to par quality-wise with our expectations however it arrived way after we finished our entree's and by then it only added to the downhill experience here. Service was fair despite our forgotten appetizer, being splashed a bit of water during a refill, and once when the waiter dropped the butter knife next to my foot (luckily I was in rainboots and he had \"poor aim\"). I am sad that we had such a lackluster experience here despite the good yelp reviews."], ["Rome S.", "There food and service is amazing.  Unbelievable Mediterranean food that brought me back to my vacation up Greece last year."], ["Steve D.", "I can only go with 4 stars at this time as I only grabbed a bunch of starters at the bar after the orchestra. the restaurant was packed and the vibe was well managed. They clearly know what they're doing as far as crowd control in this place. The Octopus was quite possibly the best I have ever had, and the mussels were great too. Also had fried eggplant, spanicopetta (?) fried calamari, and a bunch of drinks. They have a 30$ pre theater menu that's unbeatable, and after seeing the fish offerings, I know i'll be back for another round at Estia."], ["Sari A.", "Not my favorite, Expensive for the quality of food. its not bad but not top notch, either. I went there once and i don't think i will go again. Service was not excellent on weekend lunch- they were not super busy, only three other tables besides us. Overall, I was not impressed.Two Yelps!"], ["Aditi M.", "One star for ambience and one for the server .. Food sucks !! I went there for valentines day dinner and I ordered lamb chops - medium done and they came rate cooked !! It just tasted burnt with no flavor .. Sorry can't forgive a Greek place on messing up the classic Greek lamb chops"], ["Dave B.", "My friend and I decided to try this place out during Restaurant Week on a Thursday evening. It was particularly busy in there considering the light snow fall that evening but we were greeted warmly and seated fairly quick. Our server was pleasant, she introduced herself and provided water, immediately. She was able to provide a great cocktail recommendation that we thoroughly enjoyed. We informed her that we were doing the restaurant week menu and she suggested that we order different items to share, which was a great idea. We started with Spanakopita and Octopodi. The Spanakopita was ok, not the best I've had and definitely lacked some taste. I loved the grilled octopus, perfectly seasoned and cooked. For our entree, we had the Kotopoulo, an organic roasted chicken over orzo and Lavraki, a whole grille Mediterranean Sea bass. These two were great, seasoned well, deboned and great portion. Both of these items were perfectly cooked and moist. For dessert, we had the Yogurt Mousse and Ekmek, a Kataifi phyllo topped with custard, pistachios, whipped cream and more pistachios. I wish we would have ordered two Yogurt Mousse because that was worth the entire dining experience, alone. We did not care much for the Ekmek. I think I would come back again but in this city there are a lot of competitions for amazing Greek food. It wasn't the most amazing Greek food but at the same time, we had a great time, the server was wonderful and the meal was decent."], ["Jenna H.", "Octopodi and the pan-fried cheese dish (don't remember greek name) were incredible. The lavraki was so flavorful. The baklava was unforgettable - not too sweet and syrupy like it is sometimes. A little pricey but perfect for restaurant week!"], ["Shirl C.", "Very clean restaurant with GREAT food!! I have probably been here almost 15 times or more, and I am rarely disappointed. The price is just right for the quality of meal...Great variety and superb service."], ["Flavia C.", "Another rest meal at Estia. I am on a cleanse and can eat so few things. I was trying to figure out if there was anyplace I could go. It was the perfect place! Ordered Bronzino, when you order the whole fish it's so delicious you don't miss that there is no marinade the lemon and olive oil are perfect! Grilled veggies & lots of water. Healthy great meal. Jessica was a delightful server, so friendly & helpful and didn't even look sideways when I listed all the things I couldn't have:). Definitely returning soon."], ["Susan M.", "Presentation is everything at Estia! The decor, the waitstaff, and the plating - the entire experience is meant to impress! It's an excellent choice for a pre Kimmel Center or Academy show! They have a broad menu, as well as two Prix Fixe options including a $30 business lunch, and a Sunday Brunch. We opted for the Sunday brunch. I highly recommend the poached eggs with spinach and bacon. It was beautifully plated and savory! The breakfast potatoes were crispy and well seasoned and the filo cup made for such a beautiful plate I almost didn't want to eat it!Seating is plentiful, but different levels and rooms help keep the noise to a minimum. Sometimes it's packed, and others not so a reservation is definitely recommended! The bathrooms are stunning and well worth a visit even if not necessary! The service is friendly, and handsome to boot!"], ["Chris S.", "Everything on the menu is great, but try our faves: The grilled octopus and beet salad for starters. The roast chicken and the salmon for the main. The staff is friendly and quick -- I wish they knew a bit more about the culture and food, but they were very courteous and the food remarkable."], ["Christine F.", "We dined at this restaurant to celebrate our daughter's college graduation.  It was especially meaningful because she had studied abroad in Greece.  It was a gorgeous May evening and we  were seated at a fantastic table in the front with the window panels open to the street.  Our daughter was thrilled to sample so many of the foods she had enjoyed in Greece....especially the fried cheese, the spread pikilia and the grilled pita bread.  Never tasted pita like that before.....delicious.   The a la carte menu is pricey but they also have a $30 price fixe menu which had a good selection.  The service was excellent!  This is the perfect place for a special celebration!"], ["Giuliano P.", "Estia is top notch! Fresh amazing seafood where you know you pay for quality. Took my father here Monday for Father's Day since we all work on Sunday. Staff is friendly and accommodating and we we're very comfortable. My father is a stickler for food and it's hard for him to go out to eat, but estia delivered.Started with the octopus salad which was so good we had to order 2. Flavorful and cooked perfectly. Also had the fried zucchini chips which were so light and fresh and not filled with oil. We also had lagostinos which are probably my favorite thing in the world. My mother had the lamb which is incredible; nice size portion tender and juicy and the greatest part not overally gamy which most lamb is. I have the lavarki which was a massive whole fish but it was perfectly cooked and not dry. My father had the black seA bass and my brother had the halibut. They seemed to enjoy it very much. Dessert was balaclava and a chocolate suflee. Although they can't make an espresso (most places can't) it was a great evening and I'm so glad that I finally got to try the place.I recommend 100%"], ["Marthy S.", "Center City Restaurant Week brought my date and me here for dinner.Upon walking up to the restaurant I noticed they have outdoor seating which is always a nice option for diners.  The restaurant architecture on the outside is brightly lit up like a classy broadway theater.Inside however the restaurant decor takes on Greek charm that I perhaps would expect to see if I was actually in Greece.  I loved the blackened steel gate that opens up to the restaurant.Had to wait about 10 minutes for them to clear our table even though we had a reservation and we were the only ones waiting for a table. Oh well no worries. Just an observation to point out.As we walked to our table we noticed their fresh seafood on top of ice, on display for all to see. (Nice detail Estia!)The restaurant itself is romantically dimly lit. (Hopefully I didn't distract too many patrons with my camera flash....SORRY! I was doing it for the love of Yelp!)Service was spot on.  Server was attentive and friendly, offering up suggestions and keeping an eye on us, making sure we were good on drinks.FOOD TIME!  Really loved their selection of dishes for their RW menu.FIRST COURSE:Date ordered Soup of the day - a spin on Italian wedding but \"Greek style\".  The meat balls consisting of beef, lamb and rice and were in a chicken broth. Waaaay too salty for either of us.I ordered the Octopodi which is grilled octopus served over red and sweet onions.  After eating this I realized the only way I like octopus is sushi/sashimi style.  The flavor was lost in the grilling but the texture of the octopus was there.  SECOND COURSE:Date and I split the Lavraki (whole grilled Mediterranean Sea Bass topped with ladolemeno and capers - this dish does not come with sides and the server let us know that which we appreciated) and the Arni Paidakia (lamb chops servied with roasted potatoes and tzatziki sauce)Both were very good.  The Lavraki comes de-boned, and is very light and fresh. (I think most people might be used to a fattier Chilean sea bass.  The Lavraki is lighter almost like tilapia)  Definitely needed the lemon to add that acidity and the capers also helped to add more of that flavor.  The lamb chops were a bit too fatty and I wouldn't order this again if this is the case, off the menu.  They were also more overcooked than we'd like them to be and we did ask for them to be cooked medium rare. I'm guessing they rested too long. The potatoes were nothing special and the tzatziki was really good...more creamy than what I'm used to but flavorful. THIRD COURSE: DESSERT!!!!!We each shared one of each: Yogurt Mousse (Greek yogurt whipped with fresh cream served with figs baked in samos wine) and the Baklava (layered phyllo with almonds in a honey syrup).  BOTH WERE SOOOOO GOOD!  One of the best Baklava's I've had..nice and simple.  The Yogurt Mousse presentation was a bit wonky but the flavors were all there.  Good combo to have both desserts.Overall I don't think I would come back here but it was a nice dining experience since my date and I both love Greek food.  I would recommend this restaurant to people who love Greek food and want to take someone on a classy date."], ["Heather V.", "Yum! Very high-end Mediterranean place! It was a nice change of pace from the mom and pop restaurants. Although I do like the family touch to meals! Great service and awesome audience! Oh and the food was amazing! Yum yum!"], ["Sarah T.", "The atmosphere very romantic! Feels like you were whisked away to the Greek islands. The food is okay, I wasn't blown away. We went as a big group and got a good table. The drinks were very good but service was a little slow. Its a nice spot and would maybe give it another try."], ["Neen J.", "Delish and delightful! The food is always great quality and each morsel even yummier than the one before. It is GF friendly with several options and the staff are so helpful and obviously enjoy their roles. The greek salad is one of my favorite dishes and the tomatos were divine. I also loved the roast chicken that was served with grilled vegies for me (to make it a GF option). The servers at the bar have a generous pour and they have fun educating their diners on wines. Totally recommend it."], ["Kelly A.", "Recently visited with some friends for restaurant week. We had the octopus and pan-fried cheese apps along with the lamp chops and whole fish for our meals. The meal was lovely and our server was pleasant (although not very attentive which we attributed to restaurant week). The lamb chops normally would have been $42 and their entrees are all $30+ without sides generally. It's not unreasonable for the area but it does seem a little pricey  for a meal we thought was not very special. Cocktails are standard for the area $10-$14. We probably won't be back but I wouldn't discourage someone from trying it at least once."], ["Angela A.", "My husband and I ate here, for the first time, last night, before going to the Ballet. We had a reservation for 5:30, and we were seated right away. My husband and I ordered the Greek salad, and the Lamb Chops. The salad was very fresh, and seasoned perfectly. The lamb chops were very tender, almost melt in your mouth, and had a great seasoning on them as well. My husband, who doesn't even like lamb, enjoyed his dish and said it was the best he'd ever had. The service, however, left much to be desired. We didn't order alcohol or dessert, and we felt like our server was not interested in waiting on us and we felt rushed. He didn't communicate with us, and every time we needed something, we would have to hunt him down much to his sour look on his face. I agree with a former yelper when they said that the wait staff just seemed very unhappy to be there so I deducted a star for the poor service.All in all, we will be back. The food is delicious, but the service has a lot of improvements to work on."], ["Jennifer C.", "This restaurant is absolutely stunning. There are a lot of components to the design and layout and I wish I had more time just to look around and appreciate the decor. We came here after my college graduation and were seated at a beautiful table by a window. It was very intimate and allowed for privacy without having us feel like we were forgotten by the staff. Our waiter was very very attentive and friendly but bordered on being a little bit too attentive. The food was great but I think I was expecting it to be a little bit better. I had the business lunch - Octopodi was fresh tasting a beautifully played. The whole fish, Bronzino, was perfectly cooked. The best part of my meal was the dessert - baklava. Overall I would absolutely recommend this restaurant to anyone who loves Greek food or is looking for a really lovely dining experience."], ["Anne K.", "Came here for Restaurant Week last month with a girlfriend. We were shooting for variety and ordered the following:Spanakopita (spinach pie with feta, leeks baked in homemade phyllo)Octopodi (grilled octopus served over red and sweet onions)Arni Paidakia (lamb chops served with roasted potatoes and tzatziki)Galactobourico (Semolina custard wrapped in phyllo with orange, lemon zest syrup)Baklava (layered phyllo with almonds in a honey syrup)I don't have that much experience with Greek food and it's not one of my usual go-to cuisines, but I had a really enjoyable dinner at Estia. The octopodi was my favorite dish of the night - it was perfection! I could have easily eaten another plateful. The spinach pie was good, but if you need to choose between one or the other - I'd recommend the octopodi. The lamb chops were excellent as well - the creamy tzatziki sauce really mellows out the stronger flavors of the lamb. Our only complaint was that the roasted potatoes were over-salted.The other dessert was okay, but I LOVED their baklava. I've never had good baklava before (it's always been too soggy for some reason...) and I was really pleased with Estia's rendition. Just the right amount of nutty and sweet, and the flaky phyllo really held up against the syrup."], ["Aniece M.", "Okay.. so I recently got into Greek food and let me just say, I'M HOOKED! Estia was my first real taste of it and it's honestly where I always compare other places to. My first time was around Christmas 2013 after watching a show right across the street. We picked food from the theater menu cuz it seemed like the best deal. The food was amazing. I can not stop thinking about the delicious fresh hot pita bread and hummus they serve you as you sit down. Ugh! I've been back a couple times since December and it's been a hit each and every time. I've tried different things from their lunch menu and those are also very good. I honestly think that the best burger I've ever had was from Estia. Yes, even their burger is amazing! Their prices can be pretty steep.. but honestly, I'd pay it for some really good food. The atmosphere and ambiance is very soothing and just so beautiful inside. If you are ever in that area and want to try something new, check this place out."], ["Therese M.", "Greek was my boyfriend's cuisine of choice for his birthday dinner this year. His bday also happens to fall during restaurant week and I knew Estia would be the perfect place to take him.  We took advantage of the RW menu and really enjoyed what we ordered. This was the grilled octopus and sea bass for me, salad and lamb chops for him. Grilled octopus on a menu is a no-brainer for me and they do a great job preparing it here. The sea bass was delicious.. it was light and pretty much just melted in your mouth. Judging by his reaction to the lamb chops, he was more than happy with his meal. As far as RW goes, Estia is definitely somewhere you get your money's worth and then some. So worth it. Another successful bday / restaurant week dinner for the books!"], ["Michael M.", "Went in for luncheon with co-workers.  Slow. Slow. Slow.  We must have had the new servers because they were running around like it was their first day.  A simple lunch for 4 people took almost two hours.  I had the lunch express: soup and chicken souvlaki (skewers).  The meal and tip was $23.  Food was expensive and unexceptional.  I will be passing on this one in the future.  C-"], ["Renee B.", "Beautiful restaurant!  I dined here during restaurant week and enjoyed it. Chose the vegetarian options that were offered on the tailored menu, which were delicious. Would like to go back when I can choose from the full menu."], ["L S.", "I FINALLY got to try this place. I've been wanting to try Estia for MONTHS! On Sunday my fiance asked me what I  wanted for dinner and I said \"Estia!\" We got there around 8:30 PM, it wasn't very many people which was fine to me it made the experience that more initmate. I ordered from the Theater Menu ( Appetizer-the spankopita, lamb meatball, spring salad. Main Course- Chicken. Dessert - Fresh Fruit). My fiance got the steak. He devoured his steak. My meal was very enjoyable. The Service was really great too. As a side note this may be one of the few places where I didn't really want to leave the ladies room it's so unique and kinda welcoming lol."], ["Jordan H.", "Food good. Service sloooow and they forget a ton of stuff. Boo. Still waiting for my 2nd course"], ["Reem C.", "I've always loved Greek food and looked forward to dining at Estia for the first time. I decided it would be a great place to take my wife for her birthday. We began with Spanakopita, which was excellent. It was large enough to share between two people. My wife ordered Plaki, which is sea bass in a sweet and savory tomato sauce, with onions, tomatoes, green peppers, carrots, potatoes, capers and thyme. It was very delicious.I ordered Arni Piadakia, which is lamb chops that have been marinated for three days in olive oil, lemon and fresh herbs. In my opinion, Estia has the best lamb chops I have ever tasted. If you like lamb chops, I highly recommend this selection. You won't be disappointed. My only suggestion is different potatoes. The potato tiganites is basically French fries. For dessert, we shared Karidopita, which is a traditional honey walnut cake. It's very sweet and tastes like it was soaked in honey. We both loved it. It was accompanied with a scoop of vanilla gelato. I would be remiss if I didn't mention the great service our server, Mark, provided. He took the time to explain a lot, made recommendations and much more. It made our great dining experience even greater. I definitely plan to return again. Next time, I'll take advantage of the theatre menu."], ["Shauna G.", "Despite what its somewhat cheesy looking sign and kind of awkward location might lead you to believe, Estia is quite fantastic.  I've now had two phenomenal experiences here (one during restaurant week and one on Valentine's Day) and I have to say... yum.So what's delicious?  Well, everything I've had is great, but a few things rise to the top...Appetizers - Saganaki (this is a no brainer... fried cheese? Duh), Estia Chips, SpanokopitaMain Dish - LAMB CHOPS, all the wayDessert - Chocolate SouffléDrink - Who knew Greeks made wine??? There was a Greek white that tasted very much like a Sauvignon Blanc that I enjoyed. Also, the bourbon cocktail on the list is a winner.The moral of this story?  Don't judge a book by it's cover... or a restaurant by its signage."], ["De C.", "Beautiful dinning space, but just so disappointed with the food.  The meat in the mixed grill plate was either too dry or over cooked, then French Fries were dumped on top of the plate.  No appeal, no quality, the Chef has no respect for their food.  Also slow service."], ["John B.", "Great service. Excellently prepared. Interesting ambiance. It's great to go to before the ballet. We've come here a lot and are never let down. Opa!"], ["Frank H.", "Preshow dinner at six.  The room was spectacular. Was not expecting anything like it.So we were seated at six. Took the waiter 10 minutes before his first visit to our table. We ordered a bottle of wine and waited another 10 minutes before it was placed on our table but un  opened for another 10 minutes. So a half hour has gone by and all we have done is opened a bottle of wine. Our waiter Kevin had three tables. One of the tables was a six top, and did seem to be high maintenance. Service did not get any more attentive as the night went on.We had the grilled octopus. Fantastic! And the three humus spreads. Very good. For dinner we had a whole grilled fish. Very good. The  salads and the sides are Alacarte. We split the romaine salad and the roasted potatoes. Both were decent.So now it is 20 minutes before showtime and we have no time for coffee or dessert.This does seem to be a common theme for preshow dinners at Estia. That is why I thought I was giving us plenty of time by making my reservation at six. Wrong!  They are very busy. But when you are dropping $250 on dinner I expect really good service. Not excuses. With all that said, I would go back."], ["Kate F.", "The complimentary bread and hummus is the perfect way to start the meal. I am used to eating store-brand hummus, so their homemade hummus was definitely a treat. The spanakopita tastes like the spinach pie that I tried in Greece, and the country salad ranks as my favorite offering on the menu. The highlights of the salad were the imported tomatoes, which were bright red, juicy, and sweet, and the feta cheese. The grilled salmon, served with wilted greens, was great as well, but I prefer to order an appetizer and salad. I am absolutely in love with the decor - stone ceilings with chandeliers, wood floors, and booths with pillows. I recommend making a reservation, as they get quite busy around dinner time, especially after shows at the Academy of Music. They also serve brunch, which I look forward to trying."], ["Ann V.", "Estia is beautiful and has the perfect ambiance.They makes me best octopus appetizer I've ever tasted. It was tender and juicy! I could seriously have 10 plates of it. Yum yum yum. Octopus...."], ["Maurice S.", "To begin with, the service was great from the time we walked in the door until the time that we left.  The food was excellent.  We all ordered from the restaurant week menu and every course was great.  I had the Octopodi, Arni Paidakia (lamb chops), and Baklava.Everyone that had the fish said that it was amazing.  I will be trying that next time."], ["B K.", "I have been here twice, first time was okay nothing that great. Second time we went with our seven year old and I was very pregnant and we were told that it would be hours before they could seat us. I felt something wasn't right I assumed it was because our entire wasn't the typical fancy restaurant(keep in mind I was huge pregnant and nothing fits right). We left and I decided I'd call just to see what their wait time was and was informed they would be able to seat us right away. Never going back. Didn't even taste like authentic Greek food and for that price it better taste like yiayia's!"]]}