{"Mood Indian Restaurant": [["Andrea M.", "AMAZING!!! I will be craving Indian food for the next month! Great menu selection and good place to go with a gluten allergy. There were so many delicious options, I didn't know what to choose!! We got a few items on the menu and shared. The spice level was accurate, I asked for about a 6 on a scale of 1-10 and it came out just how I like it!! The service was excellent, we weren't in a rush and he was very patient. He was very understanding of my line of questioning when asking about gluten free items. After our meal we stayed a while longer to finish our bottle of wine. I am very pleased with this restaurant and will have very high expectations for Indian cuisine in the future!"], ["Nicole M.", "This was our go to spot for Indian food. We order at least once a month. I was extremely disappointed in our delivery order this time.  We ordered through eat 24 and I marked my order as not spicy and added special instructions of not spicy. I know it's Indian food, but they have giving me this request many times in the past. My dish was extremely spicy. We called to explain the situation asking for a new dish that was not spicy. They argued with us that we said medium spicy. I have the ordered receipt indicating that I did in fact order not spicy. They were extremely rude to us. We asked for a refund on just my dish and they hung up on us.We called Eat 24 and they told us that our order went through as I asked. They tried to call the restaurant to discuss it with them, but Eat 24 said the restaurant is not even answering the phone.It's a shame that a restaurant with good food is losing regular customers due to horrendous service."], ["Ariel W.", "Holy moly is their delivery FAST. I placed my order around 6:09 and the driver texted me at 6:13 saying my food had arrived AND this text came after I missed his call. I'm not exaggerating, these are the literal time stamps on my phone!All the food was piping hot and the garlic naan smelled amazing before I even opened the foil. When I did I saw that it was SMOTHERED in heavenly garlic (just the way I like it) and also bigger than my face. I also got chicken tikka which came with a good sized portion of basmati rice. Though it was on the pricier side, it definitely hit the spot and will now be my go-to for those once in a while Indian comfort food cravings."], ["Aria S.", "After reading the glowing reviews, I have been wanting to try either of their spots for a while so when I saw a groupon, I snagged that baby.  I ended up going alone for dinner last night (lol) and here are some comments...The shahi paneer & bhaigan bartha were decently spicy and fresh and not oily. If you can handle it, I'd suggest going for the extra spicy instead of spicy.The paneer wasn't that gross frozen stuff and actually tasted like paneer (cheese). Yaass! Bhaigan (eggplant) is one of their house specials and I'm glad I got it. It is generally really hard to make any eggplant dish without putting a ton of oil it in, but they did it well. Raita was also good and not sweet. Garlic naan perfff. Highly suggest getting some in addition to the rice provided. All in all...I'm really excited to eat my leftovers for lunch. FYI street parking even on Sundays. they kindly gave me change but its quarters so bring some! Vegetarian entrees were $12.Mood, please come to center city and show those other places how Indian food should actually taste!!"], ["Sarah T.", "Normally I would've given the five stars, I order from this place all the time and being sick I just wanted the paleek paneer like normal creamy spinach goodness.  instead I received something that looks brown and OLD.  The spinach does not look fresh it looks frozen and it's hard and not creamy.  Mood people please get it together!!!! I want consistency as I'm sure other customers do! this meal that just cost me $12 is of no use to me :("], ["Ari S.", "Really good service, decent food, terrible location.  We had a lot of various items, all pretty good, but nothing spectacular.  The spice level was not what I expected.  If I ask for something spicy, don't assume that because I'm white, I can't handle spice (if that's what they assumed; if not, then their \"spicy\" is more like mild).  The food came out fairly quickly, as expected with not many people in the restaurant.  I really doubt this place will stay open much longer as their location is terrible.  It's hidden away in a gated lot in no man's land south of Spring Garden.  I might go there again, but that's only because it's the closest Indian Restaurant to me."], ["Mike Z.", "Located on the south side of Spring Garden kind of in the middle of nowhere.  It sits on the first floor of an apartment building and you have to look for parking on the street so make sure you bring quarters. The good news is that there is no issue with finding parking.  We came here on a Monday night and there was only one couple dining.  It seemed like the owner was our waiter, the host and the cashier and he was very friendly. The place is very clean, does not have a crazy spice smell and is very casual.  My friend ordered the tomato soup which he said was good along with a rice and lamb dish which looked really good.  I ordered chicken tikka masala and it was delicious along with some pita bread.  I would definitely come back here on a week day night or during lunch for some good quality indian food."], ["Matt D.", "It's not trendy, it's not conveniently located, the service isn't polished, but the food is consistently excellent.  Not only that, but the quiet locale in the bottom of an apartment complex is nice for a laid back meal.The lamb achari, chicken tikka masala, saag paneer, and malabar dishes are all excellent.  The chaat and paneer naan are also winners.  I like Indian restaurants that are able to manage the spiciness level of the food, and Mood does a really good job with this.The service is friendly and relatively fast, but don't come looking for white glove service.  Being a byob and offering Groupons here and there push this one to five star status."], ["Eunni C.", "So I saw this place had pretty good review on yelp and just purchased the deal online. As a Philly newbie I did not aware this restaurant was far from Rittenhouse square. We had to drive to Northern liberty to eat since I already got the coupon. Food better be good.... Two of us got samosa chaat and chicken tikka masala with garlic naan and mango lassi. Apparently yelp review www pretty accurate. This was 4 star restaurant for me. Samosa chaat was huge as appetizer. Probably most girls would be ok for their main dish itself. Chicken tikka masala was creamy, buttery and meat was tender. Delicious. We ended up having whole bowl of rice with it. Lassi was thick and amazing. I hate watery lassi and this place wasn't one of them. We were only customer when we were there and service was not bad or extra nice. They did minimum service for you haha. But I loved the food there and wish they were close to me. I would go often."], ["Lindsey R.", "I've never been in the restaurant, and have only ordered take out. My history with Mood started when I lived in the apartments above it, and when I recently moved back to Old City I was excited to eat it! I get all different things on the menu, and I've never had a bad meal. I love the naan bread and could eat it all day with the Chicken Mahkani. I definitely recommend!"], ["Julie N.", "Passed this place a few times, but have rarely seen anyone eating in. We decided to try some take out from Mood: chicken tikka masala, bainban bharta, lamb vindaloo, and the naan and garlic naan.The portion sizes were similar to other Indian restaurants. Unfortunately, the flavor was not as great. I found the dishes to be a little on the blander side. Wasn't very impressed but it was worth a shot."], ["Felicia C.", "Mood came to our office for Fooda today, and they had a \"buffet special\" for the introductory price of $6! It included lamb rogan josh, chicken tikka masala, palak paneer, mutter paneer, rice, and naan! They even had three different delicious sauces: yogurt, tamarind, and mint. It was wonderful! The lamb was very tender, and everything was just spicy enough, somewhere between mild and medium. I am very happy!"], ["Vinayak B.", "We decided to meet up with a friend of ours for dinner at Mood Indian Restaurant. It is tucked away inside a residential complex on 4th St in the Northern Liberties  neighborhood. Got Samosa chaat and a chicken Malabari for appetizers. The Samosa chaat was nice and fresh and the chicken Malabari was pretty good too. For the main course we got a Tandoori Salmon, a Baingan Bharta and a Chicken Makhani. All three dishes were slightly on the sweeter side (read a little more creamy) but nice nevertheless. The only bit of a let down was the salmon which turned out over done.The bread basket was adequate for three people. We went with the laccha paratha, onion kulcha and garlic naan and all three turned out pretty good. Portions are fairly large and filling. We would give this place 3.5 stars (rounded to 4). Worth checking out if you want to get some Indian/Pakistani grub without having to wait for too long on a weekend.They permit BYOB if you do plan on getting something."], ["M L.", "Dear sir,     I am just now seeing your response to my review, shamefully almost two years later. I was thinking of visiting your great city soon and came across your reply.  Since quite some time has past, this may no longer be the case.  However, your complete dismissal and denial of my experience from there warrants a response,  no matter how much time has passed. I beseech you to check out your late night delivery orders before you flag legitimate reviews. I found your restaurant from yelp. There wasn't  any mistaking it for some other. Your excellent reviews are the reason I chose Mood Indian. Every establishment  can have a bad day/evening.  For you to say you didn't see any record of my transaction is absurd. I'm sure you will continue your 4 star reviews if you continue to flag the ones you don't agree with.  If you truly care about the service of your  patrons, locals as well as the one just passing through your city, I would implore you to spot check your Sunday late night deliveries to see what they send out. As a suggestion, just order something and have it sent to any nearby hotel, have it delivered to the front lobby and meet them. I was staying at the Wyndham,  400 Arch street. If that is not in your delivery area, please reply back and I will retract my review and give my most sincere and humble apology. I wrote this review due to an epic fail of my experience,  far from excellence like I had read from other Yelpers. I thought you should know in order to preserve your 4star rating, no matter what hour your patrons order."], ["Pooja T.", "Mood cafe? Talk about MOODY cafe! The second my family and I ordered, the waiter was very rude and told us to \"sit down until we can finalize it\". Talk about moody! I heard great things about this place from my bro and so we all came in excited for some great chaats and lassi only to be put in a bad mood bc of a rude server. Not cool!The food was alright. Wasn't mouthwatering but also wasn't horrible. Just ok. I also think our experience wasn't the greatest bc of the awful service. Its really surprising how your service can affect your whole experience.  Restaurants need to keep in mind.. 60% service and 40%. Service really does overpower everything.  You wont see my family or I go back. I'm extremely surprised it has 5 stars. They must've paid for it. Like I said, food was alright, but the crap service really shot me down. Good luck!"], ["Shelly B.", "Went here with my boyfriend on a Friday night and was surprised when we were the only ones in the restaurant. Seemed kind of strange, but it is in a pretty odd location. Food tasted good- we got the shrimp vindaloo and chicken curry. The only thing was that it was at a lukewarm temperature which makes me think it was just reheated. It tasted fresh, just not warmed up. Service could have been better, especially since we were the only ones there. I had a groupon which made it not a bad deal, but I most likely won't be back."], ["Blue G.", "This is the only indian place I have tried in Philadelphia.We came as group of 6, for late lunch time and shared all order so we could enjoy different flavor of curries.Living in east coast I feel there isn't easy access to good inexpensive indian cuisine. This isn't the best indian place I have tried in my life. I think I should go to  japan to get good indian curry and naan. Mood Indian Restaurant still serves good foods.  It is not super cheap place compared to indian restaurant I have tried in other countries but for Philadelphia this is a pretty nice spot."], ["Annie N.", "I got a groupon for this restaurant and that's how I found it. It looks family owned. It's located below a condominium. They have a parking lot but I think you can only park there during the day. There's plenty of metered street parking. Bring quarters!Food is good. Good portions. I had the chicken tikka masala, shrimp, and chatt. I've been here for lunch and dinner. The lunch special are definitely worth it. The nan was a little heavy-- thick bread. I like the thinner nan that I've had at Karma."], ["Xand G.", "Holy crap. This food is so good.We had chicken tikka masala, panak paneer, naan, samosas. So good. The white raita was delicious. Made everything better tasting.Delivery was super fast too, within half an hour.Not too expensive.We're sitting among the remains of my feast and I'm super happy. There's a kind of bliss descended over all. All is well."], ["Gerald S.", "You have to really want to get to Mood Indian Restaurant because the approach is a challenge. When 95 South was jammed south of Girard, I was able to jump off, zigzag my way to Spring Garden, make a left on N.4th, and start looking for my destination.  There it was, but at first view it seemed to be behind bars.  Fences and security everywhere.  Reminded of prison gates.  Quickly realized all that parking was for residents, and the street meters were the only nearby option.  At 12 minutes for .25 on a Saturday night, I fished out all my quarters and fed the hungry metal mouth. Then located the narrow opening in the fence and the walkway leading to the resto.  I hoped I had all the necessary credentials to get through customs. The boss was squeegeeing his front windows as I walked up to the door.  I was impressed that he had not delegated the work, but took pride in his shop's appearance, knowing that first impressions are so important.  Stepping inside after confirming I had arrived with Ali, I was taken by the crispness of the white linen tablecloths and red napkins.  The space had high industrial ceilings, giving an open sensation.  I was shown to the table and sat down to await the arrival of my friends.  I was alone there at 6 pm; thinking that Indians/Pakistanis prefer late dinners.  I liked the vibe as I perused the menu and took in the details.  After V & M arrived, we ordered several dishes to get a cross section of the kitchen fare.  Samosa Chaat, Chicken Malabar for apps; Salmon Tandoori, Chicken Makhani, Baingan Bharta(Eggplant), a Bread Basket mix, and Basmati Rice as entrees.   Mango Lassi for me, and Sweet Lassi for M.   All were good to excellent. Most memorable were the Chicken Malabar which was grilled and breaded with Coconut, the Samosa Chaat, which had all the ingredients of a Samosa, but reformulated into an open dish full of Potato, Peas, various crunchy chips and spices. Additionally, the Baingan Bharta was very well done with a complementary heat/sweet texture, and the Makhani was tender in a Tomato base curry that was requested hot spiced and delivered fully.  The Salmon Tandoori was the most colorful dish (see photo), but the fish was a tad dry and the veggies and spices so overpoweringly good, that the mild taste of the Salmon was somewhat hidden by its pushy roommates. All in all, a very good meal in a pleasant environment.  By the time we left around 8, the room was full, along with our stomachs.  We ended up taking a large portion home with us.  I will definitely return once they let me out on parole."], ["Chris W.", "These Folks are genuinely very nice, but the space is really tough to make work. The food is middle of the road - several notches below Ekta and the other pacesetters in the city. Very friendly staff and ownership. I wish them well.The Chat Papri (spelling?) appetizer was a real high point, and a nice surprise - interesting take on the crispy dipping strips and tamarind sauces. Would be great eaten like a salad on a hot summer day.Lamb Chops were unfortunately a single note dish - lacked depth and layering of flavor that separates really good Indian.I am mixed on whether I would go back."], ["Rebecca F.", "Good food. Not as good as Ekta, I will say that, but it's solid Indian food that is on part with Tiffin. Okay, enough comparisons. Let's talk about what we ordered.The chat papri was VERY satisfying. The palak paneer and vegeterian kofta were also very tasty as well. I was happy with the level of spice - I think I got a 4 out of 5 and my nose ran appropriately. The naan was fresh and they had interesting varieties, including one with dried fruit and nuts. The atmosphere is very casual, with the restaurant situated inside a condo complex and facing a parking lot. The service was very friendly and helpful, the restaurant large and clean. I would return, but maybe not on a Saturday night date."], ["Elizabeth M.", "Amazing, cheap Indian. Love it, and order from here all the time."], ["Izabella J.", "I ordered delivery. Came very fast. The good was good but not unique like I've never had before. I always order from Ekta but wanted to try something different."], ["Ben G.", "Went in with my girlfriend Friday afternoon with the 15 for 30 groupon...only to find a buffet with a delicious assortment from the menu, something for all tastes.  And it was only like 9 bucks a person.  Sweetest lunch deal in the City.  Coming back here once a week.  Food was awesome and served with rice and naan."], ["Megan D.", "I have dined in and ordered takeout from Mood on several occasions.  I will start by saying that the quality of their food and service has steadily increased since their opening.  The amount of patrons, though, has not.  This place is always completely dead.  It's a shame because I'd really like to keep a decent Indian restaurant in the neighborhood. Don't be deterred by the weird location in the ground floor of a loft condo building. Their service is obviously pretty good considering there's never anyone in the place.  I've always received delivery orders in a timely fashion and my take-out is always ready to be picked up when promised. The owner is super friendly if you start a conversation with him and the last time I was in he thanked me for my patronage and gave me all sorts of coupons.  Now for the food.  I've eaten at almost every Indian restaurant in the city.  While I've certainly had better Indian food in other cities, Mood is pretty darn good for Philly. I've tried all of the vegetarian appetizers and they are all pretty tasty. The mint chutney is crave-worthy.  The vegetarian entrees are all flavorful and the portions are a good size. My favorites are the dal makhani, malai kofta, mutter paneer, and shahi paneer.  Don't be afraid to ask for it medium or spicy if you like some heat. The raita is fresh and a good addition to your meal to cool things down. Also, I was in during lunch hours recently and their buffet was a little disappointing, only because it only had two vegetarian entrees and I'm used to Indian buffets being pretty vegetarian-heavy.  It is a flat price for take-out instead of weighted, though, so you could definitely stuff your little styrofoam container to the max. The highlight of the lunch hour at Mood is their \"vegetable wrap.\"  It has been listed as a lunch special every time I've ever been there.  It's basically a piece of naan lined with raita and some chutney and stuffed with strips of seasoned paneer and vegetables. Brilliant! And just as crave-worthy as the mint chutney. Check this place out and keep it in business!"], ["Julia K.", "The food is delicious and the servers were very nice.  The first few times I ordered delivery the food was great and it came fairly quickly, but the most recent time the salmon in the tandoori was dry, and the Chat Papri was a little soggy.  I had to take away a star, too, because of the decor in the restaurant.  The ambiance would be improved a lot by covering up the windows so diners don't have to see the parking lot and the lobby of the adjacent hotel while eating."], ["Georgia S.", "On a whim we ordered from here, online, which I have never done before. We were told estimated delivery time was 30 min. It came within the estimated time! Order was perfect and we ordered a lot. Food was awesome! It met all of our expectations of what we were expecting to get, as far as Indian delivery goes.In sum: easy online ordering, fast delivery and good food!"], ["Alex G.", "A nice addition to the No Libs byob scene. The menu offers a variety of traditional Indian options at very reasonable prices. We ordered the garlic naan as a starter and the chicken tikka masala and chicken jalfrezi. Both were very good. The waiter was super nice and also brought out an appetizer (sorry forgot the name) and curry pudding for dessert, both on the house. Will be back next time we are in the mood for Indian food."], ["Justin K.", "It's a BYO which is always a plus, had a Groupon so figured I'd check it out with my girlfriend.  Wasn't sure what to expect to be honest, I really enjoy Ekta and Lovash so was hoping for something of similar caliber and I was not disappointed.  Started with the Vege Samosa and they were crunchy and flaky and not too greasy while the filling was flavorful and perfectly spiced.  For our main course we included an order of the plain Naan which was warm and soft unlike some places where it feels like it's been sitting around for a few hours.  I had the Baigan Bhartha at a spice level of 7/10 and it was excellent, never had eggplant in a paste/mashed form before and I was pleasantly surprised.  My girlfriend had the Bhindi Masala since she is an okra nut, also at spice level 7/10 and it too was excellent with an insane amount of fresh okra chunks.  We had plenty to eat at this point and each took enough food home for lunch the next day thus didn't order dessert but the owner insisted we try the Lahori Kheer on the house so after much arm twisting we relented and it was excellent, topped with a few golden raisins and slivered almonds, it was a nice light way to end the meal.I've been in this space numerous times when it was Cafe Estelle so I knew the layout of the space would probably not be as warm and welcoming as other Indian restaurants in town but again I already knew this before I walked in the door so that was not an issue for me.   We were the only patrons of the restaurant for about an hour and a half on a Tuesday night which was kind of depressing for the restaurant but we got our food quickly and it was piping hot.  I would say the location is the biggest problem given it is set back on first floor of a gated parking lot of a condo building but navigating through the gated area is well worth the trouble.  These would be the only negatives I experienced at this restaurant, if I could give a 4.5 I would but I gave them the 5 because the staff/ownership was extremely friendly and the food was excellent.  Will definitely return here for seconds...."], ["Alli H.", "Incredibly friendly service!  My boyfriend and I were the only patrons in the restaurant on Friday night, which was surprising because the food was really delicious.  If we lived in those condos above Mood, we'd be eating there all the time.  The space/decor wasn't stellar, but we really loved our appetizer, naan, and two entrees.  They are running a Groupon deal right now, so grab one and go enjoy some spicy Indian food!"], ["Jasmine J.", "absolutely delicious! Ordered for delivery and my food arrived within 30mins. I purchase the lamb saag with garlic naan - i enjoyed every bite."], ["Stephanie S.", "Some of the best Indian food I've had. I've tried a lot of places and only 1  other has come close to comparable. Chicken is actually moist here! Food is fresh and spices are aromatic.  I've dined in and ordered out and it has been consistently good.  I hope they continue to maintain their standards as time marches on, and I especially hope the local NoLibers hit this place up instead of Tiffin so they stay in business."], ["Kimberly S.", "Hidden place but so good.  Prices are great and food is delicious."], ["I M.", "I used a Seamless coupon to give Mood Cafe a second try.  My first meal wasn't bad, but frankly, didn't knock my socks off.  This second experience was so much better (although wish the favors were a bit bolder). The food reminded me of dinners at my childhood neighbor's house (who were Bengali and very good cooks)--simple good clean Indian food.Delivery was quick and within the estimate Seamless provided. And best of all, the delivery guy actually took the elevator to my apartment (I hate having to meet them downstairs when I live in a doorman building\"Chicken Karahi was the highlight of the meal, but even the \"Indian spicy\" level i asked for was a bit mild. The chicken was cut well (no tendons or fat), which is a huge pet peeve of mine at some of the other Indian restaurants in Philly. Overall I had a very decent meal, although I wish Mood Cafe would \"turn up the volume\" as Ina would say."], ["Kevin R.", "Redemption! The manager at Mood Cafe left me a voicemail message and asked if I could call him back to discuss my recent experience with his restaurant. Ali, the friendly manager generously offered to have a meal brought over to our home the following evening. The food arrived early just as our two guests arrived. Our guests are local business owners from the neighborhood who haven't tried Mood Cafe yet. We started off with the appetizers of Samosa and Pakora , both were perfectly delicious. The main course consisted of Chicken Tikka Masala, Chicken Bhartha, and Palak Paneer. These were accompanied by rice and garlic and plain Naan. Raita was provided to cool the nicely spiced mains. Mood's Raita is one of my favorites. This simple condiment is made of yogurt, onions, and carrots...Mood Cafe's is one of the richest and creamiest I've had. We finished our meal with my favorite Indian dessert Kheer...an Indian variation of rice pudding. All guests were very happy and content. Thank you Mood Cafe for the generous and very tasty meal!"], ["Gerard Z.", "Great indian food.  The Chats are a must - they live up to the hype.  All the standards (tikka masala, lamb rogan josh, lamb vindaloo) are all good.  Price is right and the portions are large.Chats dont travel well, so I'd try to dine in if that's what you want.  The interior does leave a lot to be desired.  It was a little on the warm side and the ambience is a little lacking.  But, I can look past that because the food is great."], ["Amy V.", "I would have been really happy, but my chicken was undercooked on the inside. I'd definitely try Mood Cafe, it is worth it, but just beware of undercooked meat. Everything else we ordered came out well done."], ["Meghan W.", "I've eaten here a couple of times with a Groupon. Some things are really tasty, others miss the mark just a little. Samosas are really good, but the Dal dish I had was just lacking something I couldn't quite put my finger on. Chicken curry was great. Service is very friendly and attentive. Given the out of the way locale (for me), not sure I'd venture back without a Groupon, since Tiffin is much closer. Also, the space is a little weird, if you're big on ambiance. It's separated from the lobby of a condo by a glass wall and It has a very 'industrial' feel to it. Not quite what you'd expect."], ["Rebecca M.", "My husband and I have been to Mood Cafe a few times since we moved to Philly, in part because it's conveniently located on the first floor of our building, but mostly because the food is really good and the staff is really nice. We've not had a bad experience. I love the Chicken Tikka Marsala, the samosas are great and I LOVE the naan. I love the stuff out of naan anyway; I could eat my way out of a room full of naan if I had to. But they have really good naan here. Come here! It's good, and everyone is so friendly."]], "Laxmi's Indian Grille-East Falls": [], "Spice End": [["Suyash B.", "my GOTO place. you can never go wrong with Spice End."], ["Daniel Jr. D.", "Great restaurant. Loved it! Great place for a quick stop or even a nice dinner."], ["Yiwen S.", "was craving chicken and rice, so i decided to get some takeout from here. alas, after you've had halal guys in nyc, there just is nothing that comes close. but meals are decently sized and will definitely fill you up for the price. i'm pretty disappointed that the white sauce isn't spicy a la aforementioned halal guys, but the combo of red and white sauces works to hit the spot. a little sweet, a little spicy.i also ordered a chicken biryani that i wasn't impressed with. the basmati rice tasted... tangy? the marinade on the chicken also could've been slathered on a bit more. overall it left a pretty sour taste in my mouth.food comes out super fast here though, i'll give them that. great when you're starving and absolutely cannot wait any longer to eat something."], ["Legion P.", "I usually hit up New Delhi when in the mood for Indian but I saw the reviews of this place and headed up to try it out. I got the lamb and beef rolls and a falafel platter.The red sauce is good but the white sauce is amazing! The lamb was nice and spicy and the beef was delicious. The falafel was quite good as well. Even my friend who doesn't normally like falafel had seconds."], ["Kathleen D.", "I don't want you to get the wrong idea that I somehow hate onions, or that I'm overly concerned about having onion breath. I'll exhale over-enunciated words starting with the letter, \"H,\" in peoples' faces all day with my rank hot onion breath. I don't care! That being said, I think that Spice End could stand to calm down with the mass amount of red onions in their kati rolls. That's me only slight gripe. So I ask for mine wit out. Do that if you actually do have an aversion.I'm all about Kati roll delivery in the night. I like the Aloo paneer roll and the kinda pickle-y Achari Paneer . Sometimes I go with the kinda pickle-y Achari Chicken. Whatever roll you pick with be a nice warm crispy-while-still-soft-and-chewy paratha filled with your choice of vegetables, fresh cheese, and meat, which is then wrapped up like a little baby burrito. If you order your rolls extra spicy, you will be hooked up with extra little plastic containers of red chile sauce. It's not super hot, but I like extree.Spice End is open late. More love for that. They're open til Midnight Sunday through Thursday and open til 3 AM Friday and Saturday. That's wonderful, I tell you. Buy any two rolls and get $1 off coupon on Grubhub.Works for me as, \"A bird never flew with one wing,\" like my classy father always likes to say."], ["Soonwook H.", "Hey guys, I tried the white sauce and I have to totally backtrack. Although I didn't like the kati rolls here, the chicken platters are AMAZING if you do it right. You know why? Cause it's almost exactly like what you'd get at the halal carts in New York. Best of all, they deliver. Halal food-cart style chicken delivered to your doorstep? How the hell can you say no to that??IMPORTANT NOTE THOUGH. Everything is dry, and doesn't come with enough white sauce. So please please please get at least 3-4 more containers of white sauce, and 1 container of hot sauce. Then put the sauces in the chicken and rice, adjusting to taste. Did you do that? Awesome. Now sit back and enjoy your feast!Plus, the guys here are super nice. Bonus points for service!"], ["Jeff E.", "Great lunch spot. Reasonable prices and good portions. The Chicken & Egg Kati Roll lunch platter with chicken biryani rice is perfect meal. Try the hot sauce too...hot but not painful hot. The Spice End Platter is also a good one. Service is always pretty quick too."], ["Vis V.", "Love love love their chicken and rice platter!!!! So flavorful and delicious!! I always visit this place every time I am in Philly. I've also had their paneer Kati rolls which are delicious!"], ["Rati P.", "Paneer tikka kathi rolls was awesome!! It reminded me of my Delhi - days!! The roti was so soft and paneer was moist juicy and flavorful!!! Loved it!! Though I thought chicken tikka roll was average. The chicken was dry and had no flavors!! Go for paneer tikka roll!! The service is quick since options are limited.chicken biryani was good but had no salt in it!!!"], ["Har D.", "Ahhh my craving for Indian food brought me here and we ordered several rolls. namely Chicken Tikka Roll, Paneer roll and Lamb Kabab roll. The spices were undercooked and the base mixture tasted stale on the lamb Roll. Suffice to say we told the cashier but he said \" it is fresh and thats how it is a made\".  Ish knows his lamb and refuse to take another bite and packed it in. For the price the portion is small but I probably understand it being in center city.The Paneer was rubbery and we were told it is not made but brought from indian supermarket. The veg biryani was more like a slam of turmeric and some garam masala nary a taste of biryani.Same disappoint and we will not be back."], ["Sam W.", "Surprised that this place got such good reviews here.My food was well below average and I wouldn't order again."], ["S D.", "The chicken and egg roll is so so good!! Add the yoghurt and hot sauce to it and make it perfect.The veg biryani is surprisingly delicious - one of the best in Philly!!Their mango lassi is over priced and barely average. All in all, a must go...especially after a few drinks at 2am (it's open till 3 am!!)"], ["Jay L.", "Pretty good, pretty good food.I have only have chicken and rice from those carts in New York and those samples are the benchmark to which I am comparing the food to.The restaurant is pretty casual, reminds me almost of a fast food place.I got the chicken and rice which was good. The sauces (I agree with all the other reviews), have a different flavor than what I was expecting. The white sauce was tasty, I could probably smoother my food in it, if I knew it was good for me. The red sauce was just hot, not flavorful, just added some heat to everything. I also got the mixed vegetable kati roll which was also pretty good. The filling consistency was that of retried beans, but tasty. I could probably eat 2-3 of these for a meal of I ordered it on its own. Lastly, there's a loyalty program that gets you free food. The food is a little pricey, but the thought of potential free food rounds my 3.5 up to a solid 4."], ["Vash B.", "I was looking for Indian take out spots that was open late and I came across SpiceEnd and decided to give it a try. I got the Chicken Biryinai platter it was pretty good but very spicy. The curried chicken was my favorite part, but the rice alone seemed a little dry to me. I should have read more reviews because I completely missed the hint about the white sauce and it was needed. Next time I go i'll make sure I get sauce for the rice."], ["Ann L.", "Did the spices get burned in an epic fire here? I ordered the lamb platter and for $10 I expected something decent at the least. The lamb was dry and tasteless as was the rice. The white sauce just seemed like a glob of thick mayo. The pita was barely palatable. So. Utterly. Underwhelmed. I would not recommend this to anyone. I could get a $5 lamb platter off a halal truck that tasted better AND comes with a drink. It gets two stars for being edible. And clean."], ["Raghav C.", "Being an Indian from India, my expectations for kathi rolls is rather high and I can't say this place met my expectations, but I will say it came close. It tasted a bit Americanized and lacked the true flavor of a kathi roll. Tried the chicken tikka kathi which was decent sized but one may not fill you up if you are looking to have a full meal. Would have given it 3 stars, but +1 for being open late making it a good after bar food option. ~$5-6 for a kathi roll, $11 for 2."], ["Kathy P.", "The food here was delish! It brought back memories of platters in NYC! The chicken over rice were really good and comforting. Serving size was large enough to last me two days! I came back for the chicken biryani another time- by far my favorite dish! It was rather spicy though so for those who don't like spicy food, it may not be a good fit. There's a small station where you can get the \"white sauce\"- which you'll need an abundance of if spicy food isn't for you. Nonetheless, the kick was worth it!"], ["Jessica S.", "Paneer lovers rejoice!  Spice End's aloo paneer kati roll packed some serious flavor.  Generous amounts of cheese and seasoned potatoes were spread evenly over the warm, chewy paratha & rolled up neatly into a dense little package.  The cooked onions and green sauce (chutney?) also added nice flavor. If you're like me and sriracha tastes like ketchup, then you'll have to try the big bottles of Spice End's hot red sauce.  This is what all hot sauces should be like - where heat takes precedence over salt.  I cooled things down with a deliciously thick and rich mango lassi. With half a lassi & half a roll left over this $11 meal covered both lunch and dinner. *Special thanks to yelp & Spice End for a 10% off check in offer!"], ["Charles E.", "We never had Indian Food Before Me and my wife where in Center City And needed to eat lunch we wanted something fast so are appointment was across the street from spiced end. I was surprised I tried there lunch Box special it came with a Kati Roll and rice with lettuce and tomato it was delicious and very affordable.... I give these guys a 5 star will definitely be back again"], ["Sid W.", "Decent place but we've had better lamb and rice elsewhere. Meat was a bit dry and flavorless. Plus point was it was one of the few places open on a rainy night."]], "Mumbai Bistro": [["Peter C.", "Indian \"Fast-Food\" style.... yes please!  You can order an individual entree if you want, but I recommend just serving yourself at the buffet.  I got some chicken curry and tikka masala, in addition to daal and some sort of spicy vegetable dish.  All tasted great, and I was pleasantly surprised with the consistency of the basmati rice.  The staff were really nice and the place is small but meticulously kept.  I would give this place 5 stars if they included naan in the buffet."], ["Vineet S.", "This place was a good surprise, I am really picky when it comes of Indian food. This place cooks and serves in a healthier version.The concept of buffet here is little different here. The buffet includes here 4-5 curries like chicken tikka, dal, malai kofta, chicken vindaloo, Chana masala, rice. They do the buffet items for each day. One can buy the buffet style food and it is paid for each pound. Even if one fills up the entire plate it is still really inexpensive food. The only thing is that everything else like naan, roti, any appetizers are not included in the buffet and have to be ordered separately.I had the buffet with three curries-*Chicken Tikka*Malai kofta*Paneer masala*RiceI ordered naan, aloo paratha and tandoori chicken appetizer separately. Everything together was less $12 bucks and it was a lot of food.Coming to the taste I really liked the paneer masala and chicken tikka. My naan and aloo paratha were really fresh too. The tandoori chicken was delish, really liked the sprinkling of chaat masala on top of my chicken . Overall a good place to dine in and enjoy healthy food!"], ["Stephanie H.", "Love this place! I've never dined in or gotten the lunch buffet which sounds like a great deal but this is my favorite place to get take out from. The lamb korma is amazing and the veggie samosas are honestly the best samosas I have ever had. Plus it's dinner for two for under $20 every time, can't beat that!"], ["Anuj A.", "Good tasting food and nice buffet.  Lots of vegetarian options and friendly manager.  Parking is a little weird but that's what u get for Philly.  Beware of the coconut water - zico brand is plastic tasting."], ["Nadia W.", "I am new to Philly and was looking for a good, solid, Indian place to be my go-to. Unfortunately Mumbai Bistro will not be it. The prices were good but the portions small.   My Saag Paneer was very oily and the Chicken Tikka Masala was bland. We also had Garlic Naan which seemed to have been made looong before it ever made its way to us. Indian food is nothing if not flavorful, and I was disappointed. The search continues."], ["Mecca B.", "Pleasantly surprised was really good. Officially my go to spot for affordable Indian food."], ["Arshi K.", "This was a fun stop in downtown Philly for a quick lunch. The food was surprisingly oil-free and very fresh. The Vegetable Samosas, Mumbai Dal (black lentils), Channa Masala and  Gobi Masala were all excellent and tasted like home cooked food - only better. The Paneer Masala was a bit of a downer and didn't taste fresh. So was the chai - a very watery version of the original Bombay tea. Portions were decent - not the typical huge portions served in Indian restaurants, but didn't mind it, as the quality was great. Suggest you opt for the ala carte selection, as it's a better value than the buffet by weight."], ["Chris L.", "Awesome food - this is our go to takeout place.  Ordering online is super quick and the food is consistently great.  We make a lot of our own Indian fare and have had trouble duplicating the quality of the dishes on the menu."], ["Madhu R.", "Great little quick Indian food joint with meals comparable to proper waiter service restaurants (that cost alot more).  I had the chicken curry, which was properly spiced and was really pretty delicious.  Also, they have whole wheat roti if you are watching your belly.  The chai was awesome and alot like homemade.  The only complaint is the wasteful use of plastic for dine in customers.  The food comes out in a plastic container and you get plastic plates and utencils, all of which could be avoided for dine in customers.  Otherwise, awesome experience, great location, good people watching, and friendly staff."], ["Todd S.", "Great little place to feed your Indian food craving. Buffet was not so spicy and that translates to my kids loving it too. Menu items came out fast and over all the place was clean, well kept and the staff was friendly!"], ["Ed W.", "Really tasty Indian food. The prices for take out are amazing, but be aware that portions of things can be small, and thus the price. For instance, if you are ordering naan, you will get one piece of naan, so make sure and order enough for each person based on this.Delivery guy was absurdly polite and friendly. Definitely a big plus for this business. Will definitely make this place my go to Indian place."], ["Mitch N.", "Mumbai BistroOrdered On Dec 8 2013 at 1:05 PM1  Saag Paneer  $ 6.201  Chicken Tikka Masala  $ 5.253  Tandoori Naan  $ 3.751  Paneer Masala  $ 4.25The curries were watery and didn't have an even consistency.  I don't think I've had a Saag that has literally been served with a layer of liquid on top. The Masalas were like indian soups. The flavor was pretty good, but the chicken was dry and the paneer wasn't very soft. Delivery was speedy. You get a lot of Curry for the price. So if you are new to Indian food you probably won't mind the lack of quality. However, if you are quite experienced with the cuisine as I am then I suggest trying another restaurant in the city. I give the taste 1 star, but because it was very very affordable. I gave them another star. I don't ever award stars for service (but the delivery was fast and the driver was pleasant), so the rating stays at 2 stars."], ["Saini R.", "Walked over half mile and stumbled upon this restaurant. Being Indian, I got excited looking at their menu. Due to the fact its janamastmi hubby n I were vegetarian for the weekend.  Came into the restaurant n there was a talk Punjabi man who was cleaning the buffet area. He didnt greet us til we sat down. I asked for paneer tikka masala just instead of paneer masala. He instantly said no. Hubby and i ordered navratan masala and paneer masal and two whole wheat rotis. I saw that he was Punjabi, I had no doubt in my mind the food would be chat pata (spicy). The food was brought out in 10 ounce plastic containers, rotis were in individual foil paper and they were reallll thick rotis. My mom would've kicked the @$$ of the persi n who made rtve rotis. Anyway the entrees tasted exactly rhe same and it was sweeter than most Gujarati food I've tried. I askes for a green chilli they gave me achar. A white man walks in n he was greeted instantly.  Really Punjabi man? Anytime we asked him for something, he had the ched type of guy cone out n give it to us...how dare he move. Not worth the walk. I should've went to Minar instead"], ["Erika B.", "Great Indian - especially for delivery when you're in the mood for a really satisfying meal. I've really enjoyed everything on the delivery menu that I've tried.  The paneer dishes are great - so flavorful.  The chicken tika masala is solid. The prices are incredibly affordable  but don't forget to order the rice separately for each dish. The rice and naan do not come with the dishes.   I also like that you can order delivery online. This is becoming a go-to delivery place for me. They're also very punctual!"], ["Britta F.", "The food was extremely tasty for it's price point. I am the happiest woman when I can get chicken tikka under $10 and actually enjoy it. I will definitely return again. I only wish that they delivered past Washington Avenue!!"], ["Juliana K.", "3.5!Good place for a fast, inexpensive meal.Saag paneer was okay, but I have definitely had better. It didn't seem like a lot of spinach was mixed in..sauce was thin.Chicken tiki masala was good. Still sauce was very thin.Lamb Vindaloo was spicy like they said it wood be.Basmati rice is shiny with some oil or butter. I prefer it plain.Everything taste good. All the sauces were thin.They have a buffet and prices are inexpensive.I've definitely had better indian food, but this is good for a quick stop."], ["Chris G.", "I never write a review. Chicken biryani is excellent!"], ["Kasey S.", "Always delicious food, very convenient. They are quite friendly, but not in a pushy way. Affordable. I wish they have a more eco-friendly approach (even eat-in is served on disposable plates), but I can understand how that might not be affordable."], ["Raeesa W.", "My office recently ordered samosas and tandoori chicken for an event from Mumbai Bistro.  The food was great and everyone loved it! The staff was also very accommodating for our need to pick-up the order prior to their opening time.  Great food, great prices and service."], ["Kate D.", "The food is inexpensive, and the service is quick, so I really appreciate that.  Though the convenience factor is here for sure (for a quick meal or delivery), I was not wowed with the food.  The sag paneer was sub-par at best, and the chicken tikka was not very good."]], "King of Tandoor": [["Jenny P.", "Like them..don't love them...But an Indian food craving and not having much of an option around I occasionally order from them..Love their dal makhani..Their paneer subject was a bit on sweet side rather than spicy..And I love my food spicy..So that's where I cut my stars..Always have ordered home so I can't say anything about their ambience or staff but delivery is good."], ["Kia D.", "I ride past King of Tandoor (KOT) constantly on my way to Whole Foods.  Tonight I decided to stop and I am glad I did.  The samosas are good but I had no idea they would be that big and eating two of them almost ruined my appetite for dinner.  I ordered the Lamb Garlic Curry with a side of Achar and my husband ordered the Lamb Biryani.  I wanted to order dessert but I was super full, maybe next time."], ["Eric S.", "I had lunch at King of Tandoor today and enjoyed it: the food was good, it was quiet, and the service was attentive. My chicken achari lunch special came with a generous portion of  papadam, a nicely toasted naan cut into four pieces, and more fluffy rice than I could eat. The chicken achari was not dumbed down either, it was spicy, with Indian pickle flavors, and the chicken plentiful. I have enough left over for lunch tomorrow. I'll definitely be back."], ["Cyara P.", "This place has nice decor, but food Ws on par with most Indian cuisine. What made me rate them a 1 which should be a 0 is the fact that I had a roach in my dessert. The owner claimed the desserts are premade at a different location and only reheated by staff. He tried to give me another batch!!! And then discounted the bill only for the one dessert. To me a full discount suffices when your establishment serves warm gooey roach desserts!!! Gross !!!"], ["Christian L.", "Finally a place where moving past tiki masala doesn't disappoint. I've returned to King of Tandoor several times over the past four years and it's been consistently great food in a nice atmosphere, well attended by the staff."], ["Free The Penguins K.", "We went at lunch and had papadam, naan, channa masala, chicken tikka, and chicken tikka masala. All the dishes were very good. Great lunch spot."], ["Alex X.", "Randomly came in here once and  had a window seat which I liked. Customer service was okay. But I couldn't eat the watered down Indian food- was it just me?  I guess I just have a spicier tastebud threshold nowadays. Maybe the person I let order ordered some bland things. I so not know. Because I am usually a 100% Indian Foodie."], ["Chris W.", "A solid first lunch experience here for me. A nice option in the Fairmount area also close to my work conveniently on grubhub too. For a first pass I went with the cliche Tandoori box lunch special. For ten bucks I could have used more than 3 pieces of chicken and the rice was a little dry for my liking. On the other hand, the naan was fantastic and giving 3 different accompanying sauces is right up my alley. Watch out for the Achar which has hot and spicy Indian pickles and will set your lips on fire. Luckily the yogurt sauce can help put out the fire and the chutney is also a winner.I don't know the area well enough to know how this place stacks up versus local Indian joints but I would come back here without hesitation. There was a good amount of people dining in on a rainy weekday at lunch so that has to be a positive sign too. I'll be seeing the King again soon."], ["Kim A.", "The food was great. The server was attentive BUT the restaurant does not honor Yelp's 10% coupon.  :-( which in my opinion is false advertisement.   Not too happy about that because the coupon was part of the reason for my dining choice."], ["Sarath P.", "I am sorry to say people who have posted positive reviews have very low standards for Indian food. Worst Indian restaurant ever in US in terms of taste and service. The Mulligatoaway soup or whatever the only veggie soup in their menu is nothing but sambar. And the tandoori platter that we ordered had a blank taste nothing exciting about this place."], ["Lan H.", "For anyone who enjoys Center City during the summer months, and who is always looking for new places to go: King of Tandoor is in a nice part of the city, nearby Whole Foods :-) I had never seen the other side of the Ben Franklin Parkway, just the other side, University City (Rittenhouse, etc)...but a dinner date called my name and off we went to eat our favorite Indian food :-)I  have tried Mumbai Bistro, Palace at (the?) Ben, and San Samosa, mainly because I work nearby ;-) Also Saffron near City Ave. All hard to beat, though the restaurants in and around 19002 do compare well (thank goodness!). So how does King of Tandoor do? Haha, put it on my list of \"seconds, please! i wanna go baaaack!\" :-) honestly don't venture out of my comfort zone of samosas and chicken biryani, but why should i when it's my first time? yay!"], ["Rizwan A.", "Authenticity of food gets 5 stars alone. The cooks are definitely Pakistani or Indian because there's no way they could be making this stuff SO dead on without really knowing the ins and outs of this cuisine. When I'm craving the real deal legit Paki food, this is my new favorite go to.Service, delivery and prices however are somewhat shoddy, as are most Indian/Pakistani restaurants. I ordered a few dishes, a couple sides, and ended up at about 80 bucks. Delivery is pretty fast, but giving your order over the phone is somewhat difficult when the workers don't speak the best English. Their online ordering option worked once and didn't work another time. No information as to why. I'll get food from here again, but since it's expensive I'll probably stick to cart food to satisfy my cravings."], ["Brad P.", "After spending 10 minutes googling \"mediocre actors\" so that I could find someone to compare with King of Tandoor, I've given up. Google has helped me find many things but today it failed when I tried to find the thing that I needed most...inspiration.Ah well...King of Tandoor is an OK Indian restaurant. The veggie samosas are OK. The mulligatawny is OK. The mango lassi is OK. The garlic naan is OK.The chicken tikka masala has no kick to it at all. If I am in an Indian restaurant, I want the spice. King of Tandoor did not provide this.The vegetable korma was good.On the action-movie-parallel-satisfaction-scale, this place is Congo."], ["Jordan S.", "Since getting used to New Delhi's excellent $8 lunch buffet in U. City, my cheap ass is struggling to find another Indian joint to expose my wallet to. King of Tandoor:Too expensive for meager portions. The environment is pretty sterile.If your date is boring, then King of Tandoor is perfect. If not, try New Delhi in U. City, or Tiffin near No Libs. I ordered pretty standard fare, Chicken Tikka Masala, and for over $12 sans tip, I got maybe 4 pieces of chicken in a tiny bowl with a small plate of rice. Very disappointing.So again, take yourself to New Delhi, or avoid Indian together and walk next door to Sabrina's for a meal worth your money."], ["S L.", "Let's be honest, I eat Indian food like 5 times a week. I can't help it. It's SO delicious and satisfying and VEGETABLE SAMOSAS are like the best invention ever. For real. And since I just moved far away from go-to Indian restaurant, I decided to give King of Tandoor a try. This place definitely exceeded my expectations. The naan was light and fluffy like delicious air. The vegetable samosas were like WHOA and the Chana Masala did NOT disappoint. Quick delivery too in the worst downpour we've had in a while. The only thing that would make this place better is if they offered a buffet, which I don't think they do."], ["mike v.", "I find this place a tad lame.  It has a mild and plain type of taste and their naan is not great."], ["Jasmine H.", "I've been here twice and I am definitely going back. The food is great, when eating it you just get the sense whoever made the food actually cared. I've gotten the saag paneer and another veggie curry I forget the name. The naan is sooo good. The ice cream has pistachio and saffron and is so tasty it brought me back to the persian ice cream I ate growing up. Only complaint: last time I went here the service was great until we finished our dessert the waiter took forever (at least 20+ mins) to bring us our bill!!! we were only 1 of 3 groups in the restaurant, there was no reason for that! In the end a different waiter brought the bill.  All in all you should just get past the creepy mannequin in the doorway, and the fact the restaurant may be near empty and go here, the food is good."], ["Sam I.", "We were happy to come across this restaurant during our short stay in Philadelphia. We were very pleased with the service, quality and quantity of the appetizers and main dishes. The eggplant entree, Baingan Bhurta, was deliciously blended with spices and peas. The Chicken Tikka was good but did not taste charcoal cooked as advertised. The Aloo Naan was very good and not oily. Prices were quite reasonable and they allow you to bring in your own beer."], ["Tiya B.", "I have definitely had better Indian food.  However, lately this has been my go-to spot for takeout.  The chicken tikka masala is the best thing that I have tried so far.  I wasn't that impressed with the vegetable korma.  The shrimp tandoori masala was okay, but came with very few shrimp (maybe 3-4).   I definitely think it is overpriced for the quality of food.  Clearly, I keep coming back so it is not too bad.  It beats having to order pizza and Chinese food all the time."], ["Aaron O.", "White 20 somethings shouldn't be allowed to review ethnic restaurants. King of Tandor hits on all counts...the lamb is tender and delicious, the sauces are intensely flavorful and the service is consistently terrific. Is it authentic? I have no idea, nor do I care, but King of Tandor and Indian Restaurant both serve food with flavors that I really enjoy. The tikka marsala is probably the best I've had."]], "IndeBlue": [["Kartik Z.", "Great restaurant. Great food. This place is always packed so make reservations. And it's not cheap either. You can easily spend $60 to $100 and come out hungry (just like pretty much every other restaurant in the area). The quantities per entree are tiny. I recommend you stick to the happy hour. The drinks are good and the appetizers are not bad. I give it 3 stars for good food and service. I am taking away 2 stars for very less quantity and being too pricey."], ["Jennifer R.", "Of course my meal and service here was damn spectacular and I was very happy with it. I'm a bit bitter about how expensive everything is and that it didn't have the same great options as the Collingswood location I had tried, but it was absolutely delicious. This is some high quality indian and the restaurant itself was gorgeous, so I was thrilled to be here, I just don't think a rice dish with a cheap cut of lamb needs to be over $20. It was Lamb Biryani which was spiced so well with whole coriander and saffron and everything great about indian, so really no complaints on food at all. We also got a crisped spinach app and a tikka masala pita pizza which was straight awesome with the amount and type of spice used. We sprung for some fancy cocktails and all of them were delicious and strong. Go for them if you're celebrating or are ok with paying $14 for a drink. I'd sooner go to the Collingswood location over this for everything but atmosphere. If they added the $20 thali sampler to the Philly location, my butt would be at the door immediately. If you're going on a nice date and both can appreciate some spice, I would definitely recommend this place."], ["Brit A.", "I love this place especially for happy hour!! Amazing food and great vegetarian options. This is one of fav spots in the city !"], ["Nancy X.", "One of the BEST lunch spots out there! High quality, delicious Indian fusion. But they still do the traditional stuff really really well.Their express lunch for $15 is basically a steal. It comes with an appetizer and an entree. For appetizers, you can choose a chaat, salad, soup, or one of their super yummy fusion plates. Appetizers I like:-The drums of heaven (battered chicken wings with blue cheese crumble, garlic, tomato, chili and scallions) are so perfectly flavored. Crispy on the outside, juicy and tender on the inside. And you get 4 of these amazing things-Naan pizza! They have different flavors all the time. The one I tried had paneer, red peppers, red onions, herbs, and mozzarella-Barbeque pork spare rib samosa rolls, you get 2 rolls cut into 4 pieces in total. It comes with a super yummy dipping sauce of tamarind barbeque and blue cheese wine.-Stuffed long hot peppers. You get 2 big ol' smoked green peppers, stuffed with house-made paneer, mozzarella, deghi chili, spring onions, with a fresh tomato sauce on the bottom.-Aloo makkai tikki are these 2 yummy spiced potato cakes with corn and apple chutney. ALL SUPER TASTY!Entrees:-The best one is chicken tikka makhani (butter chicken). The chicken is apparently free range, and obviously delicious. the sauce is beautifully spiced, and tastes right. Not like the nasty overly creamy ones I have to eat in New Jersey :( It's served with fenugreek, black pepper, saffron rice, which is so delicious, but still needs to be drowned in the beautiful makhani sauce.- Lamb rogan josh is also really good! It's a less interesting tasting sauce in my opinion, but still delicious. Kinda like a lamb stew but spiced with an Indian flair. The lamb had a great, tender texture, and the sauce was so hearty and yummy. This also came with the awesome herb rice.Overall, an awesome date place!! The ambiance is really nice, roomy, clean, and dimly-lit. The $15 express lunch is just unreal."], ["Liz F.", "This place has a great brunch! To start there is a live sitar player... Come on, that is pretty unique touch! When we first came in we thought it was just music played through speakers. After we walked through the restaurant, we realized it was live and it was beautiful and relaxing. It was just the extra touch needed to seal the experience. First and foremost, order the rose mimosa! It was delicate and delicious and four dollars... I'm now regretting that I didn't get several. It isn't as sugary as orange juice and the flavor beautifully complimented the champagne. We ordered the samosas for our appetizer and those were extremely tasty. They were piping hot and perfectly plated.I ordered the non-vegetarian thali for my main dish and it was delectable! It is a lot of food, but I can honestly say I did not leave a single morsel behind. Each sample had a great flavor. I wish it was a bit spicier, but that is certainly a personal preference. This is an excellent choice to try several options without committing to just one. It's an indecisive persons dream come true! More seal the deal five star characteristics included: how attentive and available the wait staff was. Our waitress was quick to answer any questions and to ensure our food was enjoyable. Not to mention, when the check came not much damage was done considering the quality and quantity we had received.I highly recommend this restaurant and I hope to be back soon for dinner!!"], ["James I.", "This was my first time at an Indian restaurant and it blew me away. Everything was exceptional. The flavor in every single dish was so complex and decadent. The tasting for $37 per person is a great deal. We had the following, all of which I highly recommend:Crispy Spinach Chaat (an absolute must, better then you can imagine)Drums of Heaven (reminded me a little of an Indian version of general tsao's chicken)Lollipop Lamb Chopsmalai kofta bukhara, basically a vegetarian meatball in an amazing saucelamb rogan josh      Also the Nan bread was very good, especially when dipped in the amazing sauces. I can not wait to come back and try other dishes. Our waiter was very knowledgeable so his recommendations were spot on."], ["Courtney J.", "I've been in love with the IndeBlue in Collingswood for a few years now, so I was excited to hear they were getting a location in Philly.A couple of friends and I went to Happy Hour here last week, and we were impressed with the food deals.  The happy hour is from 5:00-7:00 Monday-Friday at the bar.  The food prices range from $3-$5.  The veggie samosas were only $3 and came with two large ones in a chickpea sauce.  They were stuffed full of potatoes and chickpeas.  I also ordered the nan pizza ($5), which is just what it sounds like, a large piece of nan with pizza toppings.  This particular one came topped with paneer, mozzarella cheese, spinach, and peppers.  The type of pizza changes daily though, so ask before ordering.  I was stuffed after having only those two appetizers.The drink I had was less impressive, but at only $5 it was alright.  It was the Chikini Shandar.  This is basically sangria with an Indian twist as chai and cardamom are added.  However, I didn't taste any of these wonderful flavors.  It was sweet and just tasted like regular sangria.  Since the appetizers were good, I'll be back.  I'll try a different drink next time, and hopefully it'll be better."], ["Emma M.", "This is one of my favorite restaurants in Philadelphia! The food is superb. The service is attentive and seamless. The venue is elegant and beautiful, and the prices are uber-reasonable. Moreover, it caters not just to carnivorous diners, but to vegans and gluten-free acolytes alike. Yay!I like to sample as much of a restaurant's offerings as I can. Indeblue's menu certainly encourages that. I'll typically get the smaller versions of two entrees, throw in an appetizer and naan bread, and order one of their homemade desserts. They also offer a tasting menu, which I highly recommend.Since it's conveniently located near the Kimmel Center and other performance venues I like to frequent, I'll often come here for dinner. If I order before 7 pm, I've asked for my drink at Happy Hour prices even though my meal came from the dinner menu. Bear in mind that Happy Hour restarts at 9 pm! So indulge in a sumptuous meal, walk a few blocks to your performance, and return to Indeblue afterwards for a post-show drink.It's a great place to bring a date, enjoy a pleasant business dinner, or have a nice evening out with friends."], ["Vidushi B.", "This review update is for the brunch - dinner is still a solid 5 stars for me! I also enjoyed my brunch, but I still think dinner here is better. The ambiance obviously does not change from dinner to brunch -- but they do have live sitar and tabla at noon, which is a nice touch. To start, I ordered chai, and obviously loved it. I don't mean a chai tea latte, I mean real, milky, overly sweet chai, which is just the way I like it. We got the spinach chaat as an appetizer, which you'll know from all the other reviews, is the best dish at this restaurant. I am getting hungry just thinking about it.For my entree, I decided to have the paneer bhurjee, which is one of the more traditional items on the menu. It came with a small chili cheese naan. It was very flavorful, and I really liked it. The awkward thing was that they naan was pretty small, and I had so much bhurjee left over at the end. I took it home, and tonight, I ordered take-out naan to finish it with...My friends got the dosa and the french toast, and both were impressed. However, I think that getting the more fusion dishes is the move here, because that's what IndeBlue is good at - putting a new spin on more traditional dishes!"], ["Farha A.", "This was by far one of the best Indian restaurants I have ever encountered - and I am an Indian. What I appreciated most is the uniqueness of the dishes while still maintaining an authentic taste and reverence to South Asian cuisine. I went during happy hour to eat and the happy hour foods were served in generous portions for only $3, $4, or $5 max. My favorite dish was the Spinach Chaat. It was composed of crunchy Spinach flash fried in chick pea powder with other various spices and sauces typical to a chaana or samosa chaat. It was a very light yet satisfying dish and it took a lot of restraint not to order more as I still had plenty more coming.The drums of heaven, hot long peppers, veggie samosas, and shrimp with chilli aoili were also things I tried and loved each and every single one. The bartender serving my food was very kind and informative, offering explanations and recommendations and the food arrived promptly.Best part is all of this came out to be only around ~$20 so if you are a student like me wanting some delicious, gourmet food with a unique flair, I HIGHLY recommend Indeblue. One of my top 3 favorite restaurants in Philly!"], ["Mandy D.", "IndeBlue is one of my go-to happy hour spots. The location is great for me and they have wonderful food and drink specials. Their drinks are different and interesting and tend to include cardamom, which sounded a little weird to me at first, but I really enjoyed the indebluetini, which has mango, cardamom, citron vodka, and lemon juice. It just works. They also have a delicious spinach chaat. I don't know how they keep the spinach as crispy as they do, but it is so crunchy and perfect with a mix of salty and sweet spices. Definitely try it! The naan pizzas are always a safe bet and the drums of heaven are the perfect cure for hankering for buffalo wings. At $4-$5 a piece during Happy Hour, its not a bad deal at all. I will be back!"], ["Adrienne D.", "I love this place! All is great....from the happy hour to the customer service! My current favs - the rib samosas and the drumsticks. Want to try out small plates and good drinks at a reduced price? The happy hour is a sure bet. Get here on a Monday or at 5pm sharp to get a good space. Reservations recommended. Overall, been here four times. Between me and my friends - all the dishes have been great. You won't be disappointed."], ["Julia W.", "The Spinach Chaat is amazing, this has got to be the best new flavor I have tried in years!  I still can't stop thinking about it!  The Avocado Chaat was absolutely incredible too, it was an explosion of wonderful flavors in the mouth!  We finished the night with a Karma Chai Sutra drink and the Pistachio/Coconut/Raisin stuffed Naan, a beautiful blend of favors.  Less than 12 hours later and I've already recommended this restaurant to everyone I know.  You've got to give it a try!"], ["Suresh V.", "Great ambience, music and food.  Pricey though, considering the small portions.  Good food and drink options, combined with great customer service is a winning combination in the food business ;)"], ["Lan H.", "IndeBlue is, by far, my favorite Indian restaurant in Philadelphia :-) 5 stars, woop woop!I would go back for happy hour and order the chikni shandar that really tated more like the yummy sangria with just a touch of chai and cardamom. Innovative, to say the least! Then,  I would sit in the dining room for a lamb biryani dinner that was more like dinner plus lunch for two more days! The atmosphere was on-point with great service and even live music to put you more in the mood for Indian food! I feel like I have only touched the surface of what IndeBlue has to offer - I mean, Sunday brunch? Tons of other happy hour goodies and dinner goodies? Yes, please! IndeBlue, you've made me excited for another Indian food adventure!"], ["Monica H.", "It was a first for me to try Indian food. I would not be able to say whether it's authentic or not. So I'm just giving my opinion on what I've encountered..Our waiter wasn't as helpful as I had hoped. I told him it was my first time trying Indian food, and he didn't offer any type of suggestions. We went with the chefs tasting menu. I wasn't wow'd.  If it's a \"Chefs Tasting Menu\"... shouldn't the \"chef\" put it together? Why am I selecting all the options.. I wasn't getting a \"pre fixe'd\" meal.. Anyways.. after what it seemed like pulling teeth out of our waiter, \"MONICAs TASTING MENU included: spinach - i enjoyed. it was crunchy and delicious. something i've never had.  scallop - nothing special. ONE medium size scallop in a puddle of sauce.lamb chop - too salty.chicken - chewy and a bit on the dry side. goat - very tender and moist. ....dessert (which the chef finally decided to put together cuz their was no option). it consist of homemade ice cream, something like a fried banana dough, which i didn't taste any banana. rice pudding which was very waterdown...MAYBE i would come back for their lunch since there were items there that i did want to try which is not offered during dinner."], ["Marcie K.", "This place just blew my freaking mind. Everything we ate,  and I do mean everything, was PERFECT.  The service excellent, and the atmosphere really pleasant.  The spinach chaat - I'd push my mother in front of a train if I had to choose between her and the chaat. The seafood moille was superb. I would have liked a bit more variety in the seafood (90% shrimp) though. Just go there.  Eat everything on the menu. Be happy."], ["Jonathan S.", "I came here a year ago and had a good experience, so I took a friend here tonight. The food was okay-- nothing to write home about but not bad. However, the service was atrocious. The server wasn't rude exactly, but he clearly didn't want to be there and showed absolutely no enthusiasm. More importantly, I basically had to beg to place my order. When the food came, one of our two breads was missing-- as was the rice. The bread that did come was cold and overcooked. After we had clearly finished eating (they had cleared our plates and packed up the leftovers), we waited for at least fifteen minutes for the check. The only reason we got it was that we finally got the attention of the server. There must have been a computer problem or something because it then took him ten minutes to bring back my credit card. I can't recommend this place after having such horrible service."], ["Kal P.", "SPINACH CHAAT! That is all. Ya'll NEED to try this. I've come here multiple times for Happy Hour and once for dinner. The drinks are unique (one was super spicy which I wasn't a fan of) and the food is tasty. I was raised in an Indian household so I am a snob when it comes to Indian food - I highly recommend this place! Note: Not all the Naan Pizzas are yummy - they change them daily. Choose wisely."], ["Joel R.", "I love indeblue! Great Indian food, but on the expensive side. You can't go wrong with most of the menu. I believe they have live music on Thursday nights which is really well done, at least the night I was there."]], "New Delhi Indian Restaurant": [["Sophia H.", "Buffet. What more can you say? :) Good food and good atmosphere. I've talked with some people, and they all say New Delhi is the best of all Indian buffets around here. Also, 10% off for students with college IDs."], ["Sarah T.", "This is a solid Indian buffet with fresh and delicious food. They have a salad bar and small dessert area but the main pull is the hot foods bar. Veggie pakora and naan are included in the buffet. Biryani rice (not that flavorful and not the best I've had) and basmati rice (average) serve as the bases for the delicious entrees. The selection on the day that I went included tandoori chicken, chicken tikka masala, paneer masala, dal makhni (very bland), chicken curry, lamb saag wala, and mixed vegetables (in mild thick sauce- my 2nd favorite). I sampled the vegetarian items and my coworker sampled the meat items (we make a great team!), and we enjoyed all of them. My favorite was the paneer masala- the sauce was on point. The staff was constantly putting out fresh food and stirring the hot foods to ensure fresh taste. My only complaint is that it costs $9.95 plus tax for the lunch buffet, which I do think is a little bit high. They do offer delivery as well as vegan and gluten free items."], ["Kate G.", "I am a fan. If you want a buffet full of an array of choices, this is the place. Plus, as a person with gluten sensitivities, I really appreciate their marking the dishes with a GF on the buffet signage. Thank you for that. Indian food is one of those cuisines where it is hard to tell sometimes. Any time I  encounter delicious sauces, I take a chance. And their sauces are oh-so-good. Their chicken is tender, not overcooked. The buffet is continuously refreshed, stirred, and replenished by the friendly staff. And the hallway to the bathroom feels like you're headed on a space mission. New Delhi can get pretty loud, which creates a college cafeteria sort of ambience. I'd give them 5 stars but there is one Indian Restaurant in Philly that's my truer favorite."], ["Will C.", "Great Indian buffet for lunch. They have everything- samosas, chicken, lamb, rice, naan, salad, condiments, chai tea, and dessert. For 10 bucks! Not exactly the fanciest place, but nevertheless this is going to be my main Indian spot in Philly."], ["Brian F.", "This review is not too long because this is simply a solid Indian food buffet.  Have had both better and worse Indian Food.  You won't find anything that wows, but it's good quantity and selection for the price.  Meh samosa, meh tikka, meh naan.  Zero ambiance. If you are craving a buffet, Minar Palace in Center City is higher quality for about the same price."], ["Weena D.", "When I use to live in University City with my housemates, New Delhi was our GrubHub go to restaurant for all our lazy, don't-feel-like-cooking occasions. Personally for me, I love their spiciest Saag dishes (either chicken or paneer) with garlic naan. If you're not too big on curry dishes, I would recommend my second favorite option - Chicken Tikka Biryani. Their chicken is very moist and delicate - similar to what you would expect from pulled chicken. Regardless of eating in or taking-out, their helpings are generous and the food is served at a perfectly warm temperature. Their buffet option is also very solid - multiple variants of curries with either meats or vegetables, samosas, plentiful naan, fruit for dessert, etc. If you're financially constraint, but still looking to get a good, hearty meal, I would recommend the buffet. Service is average... however, they are very attentive at ensuring you always have water available.  Sometimes they'll even leave the pitcher at the table for your convenience. Ambiance wise, the place is dimly lit so be prepared to get a bit more intimate with your dining partner(s). If the restaurant becomes a full house, be prepared to bump elbows/shoulders with people. When taking into consideration food quality and prices, this is the best Indian restaurant I've been to in Philadelphia. They have always been consistent in their food delivery and have failed to disappoint any of my friends or I yet."], ["Lizi C.", "Okay buffet although the food tasted very rich and heavy with cream. Lamb was super game. On the plus side the nan was good and everything  on the buffet  lone seemed pretty fresh. Prices are reasonable  for the amount  of food. Seems like a good place for starving college students."], ["Richa P.", "Wow..I'm really surprised at the good reviews regards buffet. We went to a dinner buffet yesterday and it was a joke. The naans were rubbery and so very chewy. The chicken Biriyani tasted sweet . The chicken pakora seemed uncooked. All in all, came with high hopes and left with none .Sorry New Delhi , but I'm not dining with you again ."], ["Kimberly Y.", "I thought I didn't like Indian food until I tried New Delhi, but now it's my favorite Indian restaurant on campus! I first noticed New Delhi on my way to next-door Pattaya, and I assumed it was on the pricey side since the decorations were so nice and the lights were dim! But no, you get a spacious and swanky atmosphere, plus an all-you-can-eat buffet experience for only $11 and even less with a 10% student discount (EDIT: apparently they upped the price to $13 for dinner buffet and reduced their hours... boo). Service is attentive enough for a buffet, and they're pretty polite. Now hear me out, Sitar fans, I think New Delhi has many more options and less spicy food (aka more options for me) than Sitar for the same price. And I don't drink mango lassi anyway. Plus, the food is really great at New Delhi -- and possibly very Americanized, but I dig that! The fried chicken is surprisingly yummy, and the naan is usually just the right amount of cooked/burnt. I'll pass on the tandoori chicken... but I cannot get enough of the chicken tikka masala! Half my meal is usually just rice drenched in the stuff. They also have an extensive salad and chaat bar with great samosas to boot. When you get take-out, they charge it per pound and it ends up being much more expensive than dining in. We tried to fill up our take-out trays all the way and then ended up paying $16/person instead of $11 (at the time). Rookie mistake."], ["KJ S.", "Consistently good for years now! Hands down my favorite Indian buffet in the city. Every time my dad comes into town to visit, he insists on going here for lunch. I love their tikka masala."], ["Thaddeus L.", "The Indian restaurant scene in Philly and surrounding suburbs is difficult. I say this as an expert on South Asian (Indian/Pakistani) food. You tend to get either good food and poor service or vice versa with sometimes both poor service and poor food. This place however, is the exception.Friendly staff and a long narrowish dining area with bar at the back.The variety and quality of the food is good. I've eaten at the \"curry buffets\" around the US from NYC to Bay Area and frankly speaking this is probably 3rd place in my mind (btw number 1 = Rasoi in Iselin). That's really quite amazing for a city which overall disappoints for Indian.You get the standard tandoori chicken and tikka masala etc but additionally theres great vegetarian, lamb and paneer saag options too. Variety is significant factor it really is just right level for a buffet. Just enough to give you a wide variety of veg and non-veg options. There's even samosa's which is, surprisingly, not that common in the \"curry buffets\".The one thing that upsets me more than anything at buffets is skimping on the naan or trying to make it too fancy. Naan isn't the main event, its only meant to be the foundation. Just keep the damn tray full and hot and do not make me order naan selectively (yep, this is why I never went back to Ginger in Freehold). Not an issue at this place though - the naan options are good too with continual refills. No one will leave this place disappointed and it also has cheap beer!!!!Value of money is what really gets it to the 5 star though. For the price you pay this is simply outstanding. I'd consider 6 if it was available."], ["Sondra H.", "Food is decent.  What's great is that mixed drinks are $6, bottled beer is $4, and buffet is open until 9."], ["Marthy S.", "Fave Indian restaurant in University City.  I've picked-up and had delivery more than I can count, and they are consistently quick with delivery and better than average on food quality.A few of my faves: - Vegetable Samosas - these are super stuffed.  The ratio of filling to fried outer layer is superior to any samosas I've had from any other Indian joint in the area.  - Palak Paneer - spinach and cheese.  My most favorite Indian dish.  This dish got better since the first time I've had it from New Delhi.  I've noticed it to be less oily even at it's most spicy level (which is how I get it).  I thought that the oil contributed to the level of spice, but when I ordered this a couple of weeks ago it seemed to be spicy as hell but not to oily.  YUM! - Channa Saag - If you want the above but can't do the dairy, get this!  It's the same spinach as the above except they use chickpeas instead of cheese. - Chicken Curry - This is the bf's Indian food choice. ALWAYS. They don't skimp on the chicken and the sauce is awesome. - Plain or Garlic Naan - always need either of these to supplement the above. **Entrees come with their basmati rice which I LOOOOOVE!! They lose a star for the following reasons:Their lamb can be a hit or miss. I've noticed some pieces to be more tender than others when ordering the Lamb Jal FareziHad the Chicken Vindaloo recently and the chicken was straight up dry.Buffet - I don't find the food to be as fresh as when we get it to-go/delivered.Prices are beyond reasonable for the amount of food you get.They also have weekend discounts if you sign up for their email.  Deals are usually for 15% off for delivery or dine-in.Ordering online is incredibly organized and convenient.  You can pick delivery for asap or for a later time, and pick your spice level for each dish."], ["Greg K.", "The food here is seriously delicious, and only made better by the price. I usually avoid buffets because the food is typically low quality, but I didn't get that impression here. The buffet was extremely clean and everything looked and tasted very fresh.  If you're getting takeout from the buffet they'll give you a container to fill up, when you're done they'll charge you by its weight. This ends up being slightly more expensive than the $12.95 advertised for the dinner buffet.  My total came out to a little over $14, but I was able to get enough for two meals in that one container, so I'd say it's still a great deal.In terms of the atmosphere, I wasn't sure what to expect, but the inside was very nice.  It was dimly lit for dinner time and everything seemed very clean.  For the price they charge to eat here, I think they're doing an excellent job."], ["Casey L.", "SUMMARYBest Indian food on campus, great value and portion sizes, slow service. Still my favourite Indian place near Penn - just be prepared to wait up to 30 minutes for food during busy times.FOODPlethora of choices. Fresh and flavourful - the waiters will ask you for spice level, but YMMV so you'll have to figure this one out yourself. Higher quality than Sitar and the other Indian places on campus. Everything here is delicious that I've tried so far.OVERALL VALUE (for those of us who are poor college students)Buffet would not be good value for vegetarians since the big ticket items are mostly meat, but the à la carte menu has many veggie choices for amazing value. Can spend $12 here on a dish with naan and rice and have leftovers for a whole second meal.SERVICEWaiters are friendly but a little slow, and you have to struggle to get their attention sometimes during the dinner rush. I've never found their accents to be a problem but some people find it hard to understand. Biggest complaint is the wait time for food - they will wait until every item is ready and bring the food out all at once, which is terrible when you are starving. An empty plate will be placed in front of you about 10-15 minutes after your order, and food will follow another 15 minutes later. Waiting half an hour is not fun if you are hungry - they should bring the naan and other small appetizer items out first.Cheque also takes forever to come and process for some reason. Usually have to pester the waiter a few times. Don't come here if you need to get in and out in a rush."], ["Suhee Y.", "a year later and the food is still yummy. i ordered the chicken tikka masala, naan, vegetable samosas and some pickled vegetables. the food also came with basmati rice and wasn't as oily as the first time i ordered from them. everything's still delicious, flavorful, affordable and the driver/delivery guy is nice and friendly."], ["Cindy C.", "Website says open till 10pm, arrived at 9:15pm. Greeted at door with message I could only order to-go food, the buffet closes at 9pm. The buffet was open and fully stocked with food. I explained I took $15 cab, manager didn't care, sent me away. I recommend staying away from this restaurant."], ["Ting W.", "Had been looking for a good shindig for some Indian buffet and alas, finally found it.  It's got delicious vegetarian and meat friendly options.  Their rice pudding is on point (but I've always had a soft spot for rice pudding).  The sauce for the chicken tikka is perfection but last I went, the chicken was a little dry.  For what you pay for though, what a phenomenal deal!  Wish I could have packed some more on my plate and in my tummy before I left.  When you're living on a student budget, definitely a great place to dine."], ["Carla F.", "I have only been here for the lunch buffet and its amazing.  Highly recommend if you like Indian and want decent quality."], ["Lexi C.", "Great buffet for all times of the day. To die for samosas and chicken tikka masala. Staff is always friendly and attentive plus atmosphere is inviting. This place is always crowded for a reason!"], ["Robyn H.", "Two people can eat at this buffet for $21.95....that's a HUGE difference compared to the $40 my fiance' and I normally spend when we eat at Indian restaurants.The food is VERY good! I pile my plate high with chicken tikka masala, chicken tandoori, chicken vindaloo, biryani, bhindi masala, basmati rice and naan. Delicious! I have also ordered Tandoori shrimp from their a la carte menu, but the buffet is definitely the way to go."], ["Steve S.", "They did it.  I know my previous reviews are attached to this one, so I won't go into too much detail.  I've been coming here for years.  Lately, the wife and I have been coming here a little more often in our Indian food rotation.  I said before that they had to do a few things better to get the 4th star from me.  Well, they've done it.  One example... I've tasted their chicken tikka masala many times over the years.  Many times neither I nor my wife liked it.  They were killing it with the spice for a good while.  I mean, spicy Indian food is good, but something was off on this dish.  The last few times, they've gotten it right.  I think my wife is even beginning to crave it now.  So they've got that going for them  Their Tandoori Chicken has improved over the years.  I remember when every piece used to be dry.  Now, they're figuring it out it seems.  Plus, we brought my wife's parents who are in town from Mumbai this past Friday.  If you can please them, that's a big win. They were pleased.  Seconds were had happily by everyone.   We also highly enjoyed the malai kofta they served on Friday.  Excellent flavor!I've noticed the reviews getting better here.  I've noticed the crowds improving here.  I'm ready to join in the chorus now.  This place is worthy again."], ["Debbie A.", "This place is excellent both in food and service.The food is delicious and they have perhaps some of the best Channa Masala I've had. With a huge range of spiciness levels, you can easily have them make something to your taste. Some of the other dishes that were excellent were the lamb vindaloo, tikka masala, and naan selections. The buffet is decent, though I prefer the menu items.I frequently order delivery and they are usually quite fast (30-60 minutes during a busy dinner rush). Dining in, the staff is always friendly."], ["Fan L.", "Pretty hard to complain about this place if you know why you're here. Solid Indian food, lots of variety, and cheap. Especially after a long day and not feeling like cooking, this place is **** awesome.They've recently updated their buffet selections to include goat curry, chicken biryani, and a vindaloo (at least among what I eat). Not really sure how the menu rotation works, but let's just say it's hard to walk away disappointed. Also it's hard to walk away sometimes."], ["Liza K.", "We went here for dinner because they have good prices and a nice selection for their buffet.  The service was good - they didn't miss a beat when someone was finished with a plate.  The buffet also came with dessert - so that was nice.  I would return if I'm looking for a cheap but good quality indian meal."], ["Janki C.", "Just ordered here from grubhub. Last time I ordered, it was great! This time it sucked. I ordered at 6:36 pm and it didn't show up until 8:20pm. I called and they said there was an order mix up. When I got my food, it tasted like shit. My paneer was way too sweet than normal- and way too liquidy- and my bhartha tasted like cardboard mixed with spices. I won't be ordering here again. Ever."], ["Danielle H.", "I came here for lunch and had the buffet. I was really pleased with the options. I am a vegetarian, so I adore Indian food. The samosas were particularly delicious and the Naan was okay. The only Paleek-Paneer the day that I went had lamb in it, so that was sad.It was a great place to eat - we could hear each other with no problem."], ["Richard K.", "last time i will order from this resturant, horrible delivery people rude and disrespectful. called the resturant they didnt really care and actually thought it was funny that i would call to say the driver was very rude. no matter how good the food is if you provide poor service people should not continue to eat here,i will not be going back. folks do not accept horrible service from these resturants, plenty of places to choose from so why dont we allwork together to make sure resturants earn our business."], ["Robert G.", "Not the best Indian buffet that I've been to, but still a really great one, and my first."], ["Justine J.", "I'm not an expert in Indian cuisine but this place is delights tasty to me.  I can't wait to go back. It's also the best buffet device I have ever had.  The entire staff was friendly and really attentive.  I love the chicken tika.  I've rarely see thus in white meat.  I put fresh lime  on it (from their salad bar) to give it a zest.  It also goes great with their chicken curry.  The lamb saag was also awesome!And a dessert comes with buffet.  I wish their honey balls (not too sure of the official name) in buffet, since many bother Indian buffets do.  I do like their mango ice cream.  They ran out if pistachio when I went. :(I can't wait to go back!"], ["Amanda C.", "I am grateful to my friend Callan for introducing me to the gem that is New Delhi. We went one night after work when I suggested Indian, and nothing on the Main Line seemed to be just right for us. She foretold of the endless samosas, the chicken tikka masala, the chickpeas galore, the naan that goes on forever. But I was unprepared for the fact that I could eat four plates of food that I absolutely loved and still feel ready to go back for more. Only common decency made me put down my fork and stop eating, but I could have gone on for an hour. I wish I could call out dishes by name, but it seems like, since I've been there a couple times now, they have a revolving list of things they make and serve. I should write them down next time. Just let it be known I was highly impressed with the digs there at New Delhi, and I've already brought my boyfriend back and suggested he bring his mom! Not to mention, I've been talking it up to my brother and his girlfriend for their trip here this summer. Another good note for New Delhi is the attentive staff who is there is refill your water (pitcher! They bring you a pitcher!) and clear your plate as quick as can be. And for $12 or so, you get the dinner buffet, which is more than enough for that price, as well as a small dessert! What could be better? If you're in, near or around University City, get your butt to New Delhi for some amazing eats. I believe they're open for lunch and dinner, so don't despair, daytime tummy-grumblers."], ["Saeed A.", "I am a cook for indian and Pakistani food. I lived whole life in sub continent, food quality is highly compromised in buffet system, goat curry has bad smell , chicken wings were not clean, quality of food is 2/10. So if you really want to go for indian food, then don't go to this place. NOT RECOMMENDED."], ["Raghari P.", "The veggie food was so bad in the buffet.the rice was not basmathi but it was labelled as basmathi. The service was so bad, that he didn't remove the plates from the table.. Will not visit again.:("], ["R C.", "Love it!  Been eating here for years--probably 10 or more--since way back before the major remodeling.  This modern restaurant is clean, light-filled, and full of nice staff.My wife and I are vegetarians and definitely appreciate that the buffet always has 4 entrees that are cruelty-free--and tasty as heck.  There is also a salad bar and deserts (love me some chocolate pudding), but the main event is undoubtedly the indian food.The price is right ($14) for the unlimited amount of food one can eat here, too."], ["Roopa S.", "I have (mostly) nothing but good things to say about this Indian restaurant in University City. I always find myself craving the same dish from New Delhi: Paneer Masala. It is perfectly orange and spicy, and the flavors are on point. Even though it is a little pricey for the amount you get, I still think it's worth it for when I'm craving a little taste of home while at school.The buffet is also great for dinner. Though the selection of vegetarian items isn't as extensive as the meat-based options, there still are some gems (though the paneer based dishes are always my favorite). The naan is usually really soft and tasty as well, and I definitely find myself eating tons and tons of naan during the buffet (so watch out carb-avoiders!) The only negative I'd say is the delivery service can sometimes be a bit slow. My friends and I order from New Delhi about once every two months or so, and usually it takes at LEAST an hour for the food to arrive (even though the distance between New Delhi and where we order from is so, SO small). Another warning-- the food tends to be a bit on the spicy side. Though I can handle a fair amount of spice, I order the medium Paneer Masala dish and I'm still pretty much in tears by the end of my meal. Thus, I'd probably order one spice level BELOW what I typically order (which is medium, pretty much every where I dine). Thus, when I order Paneer Masala next time, I'll definitely say MILD with my order instead of MEDIUM.That being said, it's not uncommon for me or a friend to text one another and ask \"New Delhi delivery tonight?\" It's been the source of a lot of happiness over the past year or so, and I'm glad to have this establishment with me for the next two years!"], ["Hab G.", "Hands down the best Indian restaurant in Philly. Their food is delicious,  the customer service is on point, the prices are reasonable. Finish off with mango ice cream, it's perfect."], ["Crystine W.", "New Delhi's weekend lunch buffet really hits the spot.  For about $12pp (includes taxes and 20% tip), it is unlimited heaps of chicken tikka masala, malai kofta, biryani, okra, saag paneer and loads more.  My faves were their malai kofta and the okra, but I only liked the sauce the malai kofta sat in and not so much the fried vegetables.  It went so well with both naan and the basmati rice.  The buffet price includes dessert of your choice (there are about 6 or 7 options on the menu).  I highly recommend the mango ice cream.  I also tried the kulfi and it tasted a whole lot like semi-frozen condensed milk.   I did not taste much of the pistachio flavor that was supposed to be in there.A return trip is definite if I'm back in this area :)."], ["Sheila D.", "A great Indian buffet! The food is very delicious and vegetarian- & vegan-friendly. Compared to the other Indian buffet restaurants nearby, New Delhi has fewer options, but there is something to cater to everyone. The servers are all really nice, and they give you a free dessert with every buffet purchase (the ice cream dessert was just delightful and unexpected the first time that I went!)"], ["Jeannine K.", "Really solid buffet. Inexpensive and the staff was friendly.  The restaurant was very clean.  I would definitely go here again."], ["Caitlin M.", "I have been here only a couple of times, but I am already planning on going back and recommending it to others.  I always stick to the buffet because you can not really beat either their lunch or dinner price.  The food on the buffet is amazing, and they give you plenty of options.  They also have a salad/fruit buffet with rice pudding, and chocolate pudding.  If you get the buffet you are also entitled to a small dessert.  Service was great both times I went, and are constantly clearing old plates.  Just be careful to make sure they do not take a plate you still want when you go up for your third round of food!  Go hungry, and you will definitely get way more than you moneys worth!"]], "Indian Restaurant": [["Michael H.", "The first time I tried this place it would have gotten a 4. You can't just give out 5's, so that would be a high ranking for me. We then ordered again and were disappointed.  The second time would have got a 2, so this place gets an average of 3. Good restaurants require consistency. So, when you order the same meal twice, and get different results, it is ashame. The nan is consistent, but the curries and some other dishes, like the eggplant vary a bit. Also, when people ask for spicy food you should get it, not a comment that they didn't think you could handle it. The 10% off if you pay for case though is redeeming and the prices are good."], ["Timothy K.", "The indian food is ok. My wife and I have dined there and have ordered delivery several times. It's nice to have a local spot to order from...or so we thought...So recently we ordered our usual: chicken tikka masala, saag paneer, naan, samosa. After waiting an hour for delivery, we called the restaurant b/c we had ordered online. We were told that it's on the way and it arrived another 30 minutes later. Then we open up the bag and we have a mystery dish instead of the chicken tikka masala. I called the restaurant back and told them that there was a mistake and the waiter asks me if I'm sure that it's a mistake and starts to describe what chicken tikka masala looks like. I KNOW WHAT CHICKEN TIKKA MASALA IS AND THE CHICKENLESS VEGETARIAN CURRY DISH WAS NOT WHAT WE ORDERED. Then he tells me that they will send it out again but did not hear back from there again. They will NOT be getting our business!"], ["Megan K.", "Food is delicious but last two times we ordered on their website, it took 2 hours for the delivery, which is pretty bad for proximity to our apt. I understand that things happen, but no courtesy heads up and they didn't really seem to care when we called to check on the order."], ["John F.", "Unsure of how I've lived here for so long and didn't know this existed. Randomly ended up there after checking out the pop-up beer garden down the street.  All the food we had was fantastic... northern Indian, southern Indian, garlic naan, etc. The staff was EXREMELY attentive and friendly... and the place was absolutely packed. The prices were also completely reasonable. Portions were very fair and most items were $10-15 each. I was most excited to see that they did take-out. I hadn't really found an ideal Indian take-out spot yet. While not frequently at 16th and South, it will definitely be on the top of my list when I am."], ["Cameron P.", "This is usually my go to for Indian delivery. The food is good. The delivery comes quickly. The garlic and onion naan is really good. Tikka masala very good but needs some heat. Shrimp biryani is tasty and you get a lot if it. I don't like the curry dishes but the Acari is really good but, again, could use more heat (it should be noted that I like a lot of heat). The chicken vindaloo is also good but....wait for it...could be spicier. The food is a little pricey for the size of the portions but u have never been disappointed by their food."], ["Elizabeth L.", "Clean, great service, food was pretty good too, and it's byob - it's was a pleasant dinner, going back for sure!"], ["Allison D.", "I am so torn in this place. Food is delicious and BYOB. However, if your eating in be prepared to wait for a long time. One time we drank our entire bottle of wine before we received our appetizer. Delivery also takes a while. Again- food is amazing though, and if you have the time wait for it!"], ["Kandis R.", "I've eaten here twice, the first time was dine-in, the second time it was carry-out. I got the same thing both times, my favorite, Chicken Saag and Garlic Naan. Both times it arrived piping hot and it was delicious! There is a nice selection of naan breads that I wanna try. The staff was pretty nice. They even gave me hot Bengali-spice tea to drink while I waited for my carry-out order. Considering that it's just up the street from me, I will definitely be back."], ["Jay L.", "Good, sit down Indian food. It was slightly pricier, but in a more formal setting than most other Indian restaurants I have been to. It was the first time I have had Indian food with table cloth and candlelights. The food is worthy of the $$ rating, but the atmosphere and attentive service live up to the rating. We got the Chicken Tiki Marsala and the Lamb Vindaloo. Both were very tasty, but the portions were slightly on the smaller side. The naan was perfectly done.Key tip, bring cash. 10% off with cash.Overall great experience, great food, if it was a little cheaper, it would be worthy of a a 5. Even so, I will be back whenever I get a craving for Indian food."], ["Shivas N.", "Kids need to have mild food and we mentioned while ordering but came out very spicy. However manager was very kind to change it with a mild one.  I ordered  Dal makhni  spicy.  It was nice and tasty except missing a Punjabi flavor.  Chicken Tikka masala was average comparing to NYC restaurants  and lamb biriyani was alright.  Service was good..Notes for the management:  whenever next time print the menu, some slight changes to be made in the food names, motor paneer will be mutter paneer and pillow rice to be pulao  rice."], ["Jeremy M.", "I went with a group of 7 and we all ordered different items. Everything was delicious, authentic, and the wait staff was very friendly and attentive, bringing out additional rice, naan, etc, whenever we needed. The menu is affordable. Definitely check it out!"], ["Susan F.", "We are just home after a delightful \"date night\" dinner at \"Indian Restaurant.\" There are several reasons we will always be glad to return. It means a lot to me to be welcomed so warmly by everyone who helps  us through our meal. After we admired a steaming dish being delivered to another diner, a member of the staff cam over to show us a video of the flaming oven it had been prepared in!Prices are so reasonable we could order up everything we wanted to try. Delicious! With a gracious surplus of rice and the remains of my main dish to enjoy the next day.We both enjoyed the soft lighting and the classical Indian background music. Look out! I'll bring my tabla next time!Thanks for a \"Let's do that again\" evening:-)"], ["John C.", "So, I'm getting my wig trimmed, and the barber suggests a BYOB called Indian Restaurant.  I love me a good BYOB.A couple days later, Cabernet in hand, I walk with a lovely lady, in the midst of a snow storm, to embark on a fine Indian adventure.  I enter and am greeted by a tall, slender manikin dressed in clothing you might find in India.  She was friendly, however, I was a bit confused.  Given the name of the place, I was expecting feathers, leather garb, long braids and a buffet of beef jerky, wild corn, pemmican, smoking tobacco, peyote and other famous Native American delights.After getting my bearings and realizing that the restaurant served Indian food (like that found in India), although a bit caught off guard, I remained very excited about the meal to come.  Overall, the food was great, but I think the owners could do a bit to enhance the clarity of the restaurant name.  The place is a sit down spot, but pretty casual.Here's what we got:Lamb Saag -- love Saag.  The sauce is made from pureed spinach.  Looks gross, tastes awesome.  I dig it because it's a meat dish with a solid serving of veg built into the sauce.Chicken Tikka -- Can't go wrong here.Mixed Veg Platter -- can't remember exactly which one.  I asked the waiter for a recommendation.  He hooked it up.It came with rice.Everything was great!!Due to the snow, the place was pretty empty.  Although, there was a table of four sitting next to us and we were able to eavesdrop on a interesting conversation about pharmaceuticals, drug abuse, withdrawal, etc.  I'm pretty sure one of the girls was a  medical professional.  Did you know that alcohol and xanax are some of the most dangerous substances to withdrawal from!?!Service was totally adequate.  They tended to our needs, but didn't bother us.  We enjoyed a long dinner with flowing conversation punctuated only by bouts of hysterical laughter.  A night to remember.Oh and if you are a crazy paleo weirdo (like me) or gluten free, Indian food is pretty accommodating.   ENJOY!"], ["Kristin H.", "It's high time I give a shout out to Indian Restaurant. I went in tonight to pick up my usual saag paneer and naan aloo, and in the 20 minutes it took for them to prepare my order, I began thinking about how happy I am to have them in my neighborhood: this is super good authentic Indian food.I've had saag paneer at a lot of different places and Indian Restaurant does it just right. There is something really special about the texture of the cheeses that always keeps me coming back -- thank goodness the portion size is enough for two meals! The naan aloo is amazing and packed with so many good spices. I once ordered this and brought it to a potluck and it was gone in 15 minutes (probably because the smell is intoxicating).What compelled me to write my review today is the nice host who brought me a cup of complimentary spiced tea while I waited for my food, which got me thinking that the service has always been really nice every time I've stopped by. There is also something about the music and low lighting that makes me feel a little more relaxed by the time I leave. Not a bad place to grab dinner if you're having a bad day! What you need to know: 1. Come hungry. 2. The mannequin in the doorway can easily be mistaken for a live Indian woman. 3. She seems like she'd be a nice Indian woman."], ["Ashley S.", "3.5 stars. I have had delivery from here a couple times now--it's consistently good but not amazing. I've tried both the saag paneer and the saag with shrimp, and my boyfriend gets the chicken vindaloo which was too mild when he asked for medium spicy and too spicy when he just went with the normal level of spice. The portions are good sized, and it usually lasts me 2 meals. A big plus for this place is their speedy delivery. Both times I have ordered they have quoted me 45 or so minutes for delivery, and they are usually at my door before 30 minutes has passed. I definitely want to dine in sometime soon because it's BYO!"], ["Neil G.", "Fantastic lamb chops, wonderful mulligatawny, lamb samosas, and lamb pasanda!The restaurant may have an uninspired if accurate name; a couple bad reviews might make you second guess this choice. Don't be discouraged. This place has well-prepared, flavorful, fresh food. Small areas for improvement?The naan is not wonderful, and the rice pudding was disappointing. Small prices to pay for otherwise excellent food at great prices."], ["Teri M.", "I've been back twice since I wrote my original review and I still stand by it.My favorite dish thus far is definitely the Chicken Korma. Just...it's so delicious, I can't even talk about it because it's dinner time and I don't live in the city.Service is still top notch, water always filled, etc.It is one of the places I would take a visitor to the city if they were looking for good food. I even took my mother there after the Flower Show and she liked it!If you're kids are well-behaved, I see no reason why they can't join the meal."], ["Wesam M.", "Very tasty food! This place rocks"], ["Raghari P.", "Food was ok .ambience was ok.food was too oily.parking was too difficult. Samosa was not too great,they was bland."], ["Jeppy J.", "One of us got actual food poisoning (cramps, sweats, the whole nine yards). The other just felt woozy the next day. The men on the phone were very rude and dismissive, and they replaced one of our dishes with another (they were out of what we wanted) without calling to ask about it. On top of all that, the food was gross. I tried dousing it with chili powder and then just threw most of it out. Nothing redeeming here."]], "Kabobeesh": [["Lauren B.", "I'm almost hesitant to write this review...because this is my secret spot. With 142 reviews, I know it's not so secret but let me dream. lol.When you come here BE HUNGRY. You get a TON of food and it's all amazing. I took my husband for the first time last week and he loved it. We both ordered platters. You get a protein- which we picked chicken kabob- two veggie sides, a salad, and a GIANT piece of naan...all for about $14. It's a steal. So we place the order and my husband is pumped about the value but then takes his first bite of the chicken- WOW. They marinate the chicken in yogurt so it's so tender you can cut it with the side of your plastic fork. I got chana masala as one of my sides and it was incredible. Had a kick to it but also very flavorful. This place isn't fancy so if you don't want to eat there (they have parking if you do) they do have delivery and take out. Either way, GO. EAT. BE HAPPY."], ["Talal H.", "Good chicken kabab(it's spelled kabab not kabob; if its Pakistani, as the menu says, then It's spelled with an 'a' not an 'o') and nice channa to go with it. Rice wasn't good at all. Naan was ok, they should have more variety, as in roghni etc Now to the rest of the stuff:Confusing decor, what is it supposed to be? An amalgam of an American diner with Pakistani channel on the tv? If you wanna create an authentic atmosphere, at least go the full mile. The cleaners came on whilst we were eating. We were treated to looking at the trash as it was getting cleaned up. Yum, really nice for building up appetite. There was one poor guy who was doing three jobs: cooking, cashier, manager type. I felt sorry for him as he was doing the best he could. Maybe it was just our timing, but the place was a bit understaffed."], ["Vichet O.", "\"I can't believe I've never reviewed this place\" has been a running theme for me, lately.I like pretty much every sandwich and grilled meat that this place has to offer, and they have a lot. The only thing I wish they did a little better was their sides, and in some cases their cooking times. The samosas have usually been sitting in the warmer for a while, so they're no longer crispy, and the rice and curried lentils and other things are all just aight. Again, the grill is where this place shines.I've eaten in, and I've taken out, and I've learned that when I want some Kabobeesh, I call 30-45 minutes ahead to make sure whatever I'm getting is ready.It's totally worth the wait, and it's damn cheap for what you get, but yeah - if you're hungry, you might want to get something in your stomach before coming here."], ["Halima G.", "Kabobeesh is probably the best Pakistani food I have tried. Their lamb chops are delicious and their naan/bread is baked great.. Their tandoori is good  and the samosas used to be in a heat box but now they fry them which makes it better The employees are nice  . The food is cooked great and if you see something wrong with it then they always do something to say like sorry Overall I don't think I have any complaints Hope it's helpful"], ["Anish R.", "The kabobs  were great. Lamb was very tender and grilled  to perfection. The lamb kabobs  are probably  the best items on the menu. If you're  looking  for catering I'm sure the owner would give you a good deal since the kabobs were relatively  inexpensive. The ambiance  and atmosphere  is not the most inviting  though. Good food for takeout and share with friends in front  of a TV  screen."], ["Jinsol L.", "In my opinion, portion sizes were good, but everything else was mediocre. The ambiance/bathroom offered no ostentation, and I wouldn't say they have the friendliest service either. We ordered the chicken curry meal and beef tikka for lunch, with meat and veggie samosas. It all took some time to come out so plan accordingly! Overall, I would say the food was decent, even though the samosas tasted somewhat stale."], ["Megan T.", "People may wonder why my yelp ratings distributions are so wonkily distributed, but it's because I tend to only review places I either really like or really hate..That being said, Kabobeesh is one of my husband and my default places to eat. I recommend:-chana (chickpeas) - a humble yet tasty preparation of chickpeas. I get this as a side every time, without fail. -lamb kabob-Chicken karahi (order 20 minutes ahead)- full order for 3-4 people. I would love to try the lamb karahi some day (have had the chicken karahi thrice)-lamb curry-fish curry (quite spicy)The bathroom and ambiance are divey, but food outweighs ambiance on all accounts, as far as I'm concerned. Tips: -Try to go when it's not as busy- the owner will be in a better mood!-For a second vegetable side on your platter, ask to get a side in place of the salad-Not all of the \"daily meals\" are served daily; your best bet is to see what is out front for the stews and curries. -Students get a free can of soda"], ["Nasir M.", "The best Pakistani food ever there. Kabobs are the best in Philadelphia try there chicken khrahee. U will love it."], ["Jay J.", "Nasty place with terrible food. Mix that with a bunch of desis who bring their crazy kids every where. I would never go back there again. I am a desi myself but this was one of the worst experience of my life."], ["Andrea P.", "I really love this place. It has a homey feel and great food. The people who own and run the place are super welcoming, want to please their customers, and are very thankful for the business. It is family friendly so bring your kids. There were at least four other families, some even with very small children when I went last. But my favorite part is really the food! The chicken kabob and the ground beef kabob are my favorite. The ground beef kabob has some extra green spice in it that makes it really unique and flavorful. Get these as a meal and they will come with two veggie sides, rice, and naan. It is likely you will have leftovers.Oh yeah, I love that there is a parking lot and I gret a free drink (mango juice or soda) when I show my student ID."], ["Jae R.", "I don't know what's the big deal with this place. I have heard many praises.The place is probably rehabbed from an old diner truck, but moderately clean and decent parking space (not easy to get in). I had chicken curry and some other meat curry. I must say the complexicity of spcies was definitely present. But it was filled with bones after bones. Also it was too salty for my taste. The aroma of curry was delightful, but there wasn't much to eat. I probably will try kebab and see if the place is stingy."], ["Michael F.", "Tasty, reasonably prices, slightly long wait... Honestly, I don't have much more to say about Kabobeesh.  The portions were fair.  The place is kept clean.  They also take credit which is a nice bonus for the area. As long as you don't go confusing it for a five-star restaurant, you'll probably be satisfied.  If you come relatively hungry, you should be able to leave without much left on your plate. If you aren't in a major rush to eat and leave, you should be able to handle the service. I've tried the Lamb and the Chicken Kabobs, and a few of the sides (thinking the spicy cauliflower dish was my favorite), all solid choices.  I'm not in a rush to go back again, but do have it on my list to make a return trip..."], ["Joel S.", "This is a great place.  The food is delicious and plentiful.  The people there are very nice.  Plus they have their own parking lot."], ["Izzat A.", "Came here for lunch and thought it was okay. Got a chicken roll and it was decent. Certainly not the best, but not bad. Mango lassi was average. Wanted to be wowed by this place but wasn't."], ["Suman B.", "The veggie roll/wrap that I ordered was just delicious. Its bang for the bucks.....very flavorful and filling. Good choices and decently prices. They also threw in a couple of other dishes for free with my order. Will definitely be a regular here."], ["Percy N.", "Executive Summary:Food - 4.5 starsWait  - 2 starsService - 2 starsSo you want some tasty kebabs and Lahori cuisine while in the Univ City area? Your answer is clear - Kabobeesh.Now some Dos and Don'ts:- Don't waste time looking at the menu as they won't have half the stuff listed on it. - Do instead look at the steam table by the register where you order and pick an item.- Do order a few kebabs you see in the glass front refrigerated case.- Don't let a half empty restaurant  fool you into thinking you will get your food in short order - it will take 20-30min.- Don't expect good customer focused serviceThe wait is quite long and your tummy will growl from the aroma of the kebabs but once the food arrives you will be in bliss.Recommend the Reshami beef kebab and chicken tandoori kebab along with a tandoori naan.The kebabs and paya (goat trotter stew) was as authentic as I have enjoyed in India and Dubai. Best way to order it is to call ahead but I heard him giving a hard time to someone who was trying to place a take out order.Samosas are over priced."], ["Liza I.", "My favorite thing in the world is eating Lahore Chargha from Kabobeesh. It's heaven. The halal chicken is served freshly cooked on a tray with fresh naan, a mint chutney with it, and a sprinkling of salad. You eat with your hands -- pull off a piece of naan, grab a piece of the chicken with the bread, maybe grab a little lettuce, and dip in the chutney. It's a little crunchy on the outside and juicy inside. This is not overdone -- it's supposed to be that way and it's addictive. We always order a few extra pieces of naan.My husband is from a small village in Pakistan and said he thought the owner might be Bangladeshi but he said they make it just like in Pakistan. I could tell -- there's nothing like this anywhere in the whole area. About what people said about the samosas being dry.... I didn't find this to be the case at all but Kabobeesh makes homemade samosas while most of the places I've been to, just heat up commercial, packaged samosas and then add sauces on top... and I work in food. So if commercially-made samosas are what you're used to, you might not appreciate them when they're homemade.I usually want to eat the vegetable side dishes but they've all been way, way too spicy for me so I really wish they could at least have a way to control the spiciness for those. They do tend to be oily but my husband said that's how they make it over there. The one I find we can eat (not too too spicy) is the peas and potatoes and it's very good. You can ask for more salad with the barbecue chicken if you can't eat the spicy vegetable side dishes.I also always get a sweet lassi which is made like an authentic traditional lassi -- slightly sour and sweet. The first few times it was so good we ordered another one right away. The third time it was too sour, but these things happen when you're making homemade food in an authentic way. I don't mind if something isn't exactly perfect here and there.Try the frozen kulfi for dessert! They also have other authentic Pakistani desserts.I'm not usually one to care what a place looks like if the food is great but it could really use some brightening up. It's a little too dark, I dislike hearing television while eating, and a few times we've been there parents don't seem to do anything about their loud kids... and some of the patrons are super noisy too so I wish the people working there would tell them to be a little quieter so others could enjoy their meal... so expect to eat out-of-this-world chicken at a divey place... and you have to sort of compete for your place in line with taxi drivers who sometimes try to get in front of you... but the food is divine."], ["Syed A.", "The best pakistani food in philly there best kabobs and delicious food I love it all the time this service is pretty good and quick I love to come here all the time free parking in Philly"], ["Julie F.", "I feel blessed to live within walking distance of this amazing foodery. Every time I go there, I'm like a kid in a candy store and start hopping up and down clapping my hands - probably to the annoyance of my friends.I always go with the platter (what do they put in that rice? crack?) and by know have an idea of what I want. I've found that though the chicken curry is meh, dark meat curries are where the party is. To order: I inquire what curries they have that day since they may have goat which isn't on the menu.If I can't get goat, I go with a beef (not ground, but tender, shredded beef is best) or lamb curry platter.The side salad is a joke, so here's a secret: you can request a double serving of chickpeas instead of the salad and they will do it for free! The chickpeas are totally awesome, although they don't seem to be as good as they used to.The naan is great without falling into the floppy trap a lot of other naan seems to. They make it fresh for you, so it comes out warm and delicious.The platter is huge and well worth the $11+tax you pay. Make sure to take advantage of the free soda if you are a student."], ["Kathleen D.", "Kabobeesh, when'd you get ya face lift? I'm not around for a couple of months and gone is the silver diner car, replaced with a beige stucco kinda deally. Well, your outside has changed but it's what's inside that counts and you're still full of some great kebobs, Pakistani cookin, and tandoori deliciousness. Ahhh Kabobeesh is the beesht. This spot is a true favorite of ours, especially when we're driving back home from a Westerly ways in the middle of the night. There's paking, and there's a lot of eatin for around $11 up until 11 at night. By, \"a lot of eatin,\" I mean that I always leave with leftovers, and I'm generally highly regarded as a lifelong member of the Clean Plate Club.(Random Kabobeesh side-note factoid: The first time we ate a Kabobeesh they surprisingly had Sunday night football playing on the giant flat screen TV and we happened to be dining at the same time as a Cricket league all dressed in their whites. My husband had one conversation with one of these cricketers which rekindled his latent fascination with this sport and now we have Willow, the Cricket cable channel and a beach Cricket set for down the shore. Random Kabobeesh side-note factoid over.)I really enjoy the flavorful grill-fired tender lamb and tasty chicken kabobs, but I think that their tandoori chicken is my favorite favorite. This bird is stained bright red on the outside and kissed with char, while inside is bright white, juicy and delicious chicken on the bone. It's served with the most excellent naan- really the greatest. You also get to choose your side vegetables. Now, sometimes you choose one side and have a salad bag salad as your other option, but other times we've been able to pick two of their sides- Not sure what the rules are bout this, but two veg sides always beats the bag.And let is never be said that I am not one to appreciate a perfectly cooked chickpea. Kabobeesh's chana has never been mushy murk, in my experience. Instead the legumes are all incredibly in tact; firm plump fellas and all creamy inside, and swimming in well-spiced sauciness. I appreciate this!This feast is the beesht."], ["Naveed M.", "Absolutely no doubt the best kebab in Philadelphia. I have been eating at kabobeesh for a while friend of mine introduces me to yelp I believe it is a best  way to let people know that they can get the best of what they spending. Beef Resham its my favorite . If u like spicy and along w/ friends try there CHICKEN KARAHI you would love it definitely worth it . Highly recommended if u like middle eastern n desi taste"], ["David L.", "This is great authentic Indian food!We went there at the suggestion of our (Indian) friend in search of good kabobs. Man did we find what we were looking for!  The food was amazing and so cheap!  Great portions, and the naan!!  All of it was amazing. We will definitely be going back. I would recommend the boneless chicken kabobs and you have to try the chickpeas!"], ["Aemen L.", "Good authentic food. Do try. They have their own parking which is a big plus. Food is a bit oily by modern standards but otherwise it's very good."], ["Gideon R.", "Ordering is a little chaotic but the food is absolutely worth a visit.  Their lamb kebabs are my favorite.  Never dry."], ["Zak J.", "Unbelievable food. We had the lamb and chicken kabobs with the kulfi ice cream in the end. With the meal, you get bread, rice and option of veg or non veg curry. The portion sizes are enormous.  To top it all off the cost per meal is extremely economical. A meal will cost you around 12 dollars. The food is 5 stars and one of the best pakistani/indian food in town. The ambience is not so great. It looks like it was a former diner. The food is amazing and thats all I care about. If you want great Pakistani food in the Phili area, then this is the place to go. Highly recommended."], ["Thuy N.", "Been coming here for a few years. My favorite place ever! Hands down the BEST paki food in philly! I live in the NE too bad they dont deliver that far... I would eat here everyday! Trust me you will love this place!"], ["Ray L.", "I came here and ordered the chicken kabob platter, which costs about $11 and comes with chicken kabob (you guessed it), rice, naan, side of your choice (I had mixed vegetables in curry), and a side of house salad. While $11 may not be cheap depending on your budget, it is certainly reasonably priced given the enormous portions. I thought everything was well flavored. This was my first time here and I would definitely come back. The atmosphere isn't the best but it's the food you come here for."], ["Joseph R.", "Worst customer service ever. The cashier will see you waiting in line and carry on conversations with other customers. He also forgets orders, gives attitude over the phone, and screws up orders when he gets hthem through. The food is good enough but if you're not looking to have an awful night, don't come here. I hope Ansir gets fired."], ["Farukh N.", "Excellent Indian food.."], ["Ashley S.", "I came here for lunch one day with my boss, and it was delicious! I eat mostly vegetarian food, and they surprisingly had several options for me. I ordered a mixed veggie platter which came with a chickpea dish, an eggplant dish, and a mixed vegetable dish with a side of naan. The flavors were great, and I found it all delicious! It was so much food that I had to pack up half for lunch the next day. It definitely deserves its place on the \"best eats for the buck list\" from Forbes Magazine! forbes.com/sites/seaneic…"], ["M D.", "Went here again today and can't stress how amazing this place is. The warmth of the people who work there (owners?) just adds to the amazing-ness. I keep bringing friends/colleagues here when I can because I am in love. Such a unique space and delicious, warm food. LOVE"], ["Fei S.", "You can get a small mango drink if you are a student. I mean it's close to Upenn, students live around this area, you can try it.They over cooked the meat, it was nice at the first few bites especially I was hungry at that time, but you'll feel the hardness after a few more bites. Nang or the bread comes with the order, good trade for the rice if you are sick of the rice for one day.The price's bit too expensive."], ["Adam F.", "No frills Indian - Pakistani restaurant. This is the original location --- its a converted diner... not much of an ambiance but the food is good and you get lots of it. Check out the Lamb Kebab, Resham Beef, and Tandoori Chicken.Open late when you need you curry fix. Better to eat there rather than take out or delivery."], ["Rizwan A.", "I have so many mixed feelings on this place, but in the end, they still earn a solid 3 stars.Yes, they are difficult to deal with, yes they like to yell at you over the phone, yes they will occasionally be upset if you're using a credit card, and yes, sometimes some of their food isn't as fresh as it could be, but with the low prices they are charging, the paucity of the clientele they serve, and the difficulty of finding a good Pakistani restaurant anywhere (not just in Philly) they have been around long enough and dished out more than enough hot bbq and kabobs to make up for their short comings.Keep in mind this isn't your average run of the mill lunch or dinner place. It's more of a shack type spot and while it's usually pretty clean, it may not be the right joint for you if you aren't down to eat at picnic tables and listen to Pakistani/Indian cable TV. They have great sides, great bbq, and just, well, pretty much great everything down to the sauces, samosas and drinks, as long as it's hot and fresh.  I recommend pretty much anything off of the grill and the prices are all pretty even so if you come back more than once, try a few different things on the menu and you'll always still get the right quantity. And, if you don't finish your food, I will. This is our version of Tony Luke's. Enjoy."], ["Nirmal U.", "I have had dinner here quite a few times and they serve the most delicious Non vegetarian food in university city. My favorite is the Chicken Kadai, takes around 25-30 mins but the wait is all worth it. The dish is good enough for 2-3 people"], ["Kate W.", "The lamb kabob was alright and the naan was fine, but the rest of the meal at Kabobeesh was so oily that it was almost inedible. Our order of haleem came with a thick pool of yellowish grease floating on top that stubbornly resisted being stirred in. The two sides that came with the kabob meal-- an off-tasting spinach dish and slimy stewed chickpeas-- were also drowning in grease. On the inside the samosas were dry, and on the outside they were lacquered with stale fryer oil.  Kabobeesh is not cheap. All of the plates are around 11 or 12 bucks.  $12 will buy you two better meals at any halal cart or grocery in University City or West Philly."], ["Sara N.", "After another positive review from a friend, I had to give Kabobeesh another shot.  This time I ordered the popular chicken kabob roll.  An above average wait time is due to the meats and breads prepared on the fired up grill and clay oven, which provides a higher quality meal than the old Indian buffett dishes left for hours under a heat lamp.  Similar to the previous dining experience, I was impressed with the grilled chicken, but not with the ordinary bread and sauces.  Adding greens, carrots, and onions to the roll is a refreshing choice, but I felt cheated (and a bit disgusted) when I discovered the secret sauce is a dash of house seasoning with gobs of store-bought ranch dressing.  Also, the owner is not so much as charming as a harmless bigot, who insisted all Asians \"look the same\"."], ["Amy A.", "For $11, you can get quite a lot of food. I got the chicken kabob meal, which comes with a large piece of naan, salad (cucumber, carrots, onions), rice, and a side of your choice. The naan was very yummy - crispy on the outside and fluffy on the inside. The chicken kabob was also good - they cook it after you order. The salad isn't very fresh and the rice is a bit greasy. Other than that, I think it's standard for what you're paying for."], ["Shushmita M.", "So gooood! the kabobs are delicoius. My favorite is beef resham platter on a typical day. When we would go with a big group, we ordered a chicken karaihi which is soo good. Try their kashimi tea. It's delicious. Probably the best south asian/pakistani/indian restaurant in Philadelphia as most are gross."], ["Anusha S.", "Just to be clear the poor rating is not for the food; I have had the kabobs here few times and they are pretty good and the naan is excellent. Now the bad part; boyfriend and I walk in there and it's packed. Obviously I wasn't expecting good service cause this place is like a diner and most people just go here for take outs. So my boyfriend orders the food and the cashier lady literally just looks through him and asks me what we want. I speak Hindi which helped matters and my boyfriend is white; so read between the lines. The worst part isn't over; we waited for 40 mins and we did not get our food. So I walked up to one of the guys who was calling out the order numbers and asked about my order. He said he doesn't see it; I showed him the receipt. He said he ll have it ready in 15. I go back after 15 mins and they give me the WRONG order. I pointed that out and the guy just gets pissed and rolls his eyes at me. He says if you want to eat just take this order and it's on us. I was starving by then and we had movie tickets for a movie at Rave that was starting soon. The food was decent; I will not deny that and he did give our money back. But the people who work in this place have a terrible attitude. I must mention that the cook who works here has been around for a while and he is actually super nice. But he doesn't deal with customers any more; it's just these rude pissed off people who don't know the first thing about customer service."], ["Carly B.", "Given 3 stars because the naan is good and prices are reasonable but  please heed my advice- NEVER order the lamb curry.  Over 1/2 of my portion was composed of sharp bones, fat and connective tissue- the rest was incredibly greasy, salty and by the time I had gone through it with my fingers to make sure I wouldn't die by lamb bone, I was completely turned off. Mango lassi was totally delicious however."], ["Steph L.", "High notes:  the naan is rad, and the baklava was delish. Also, the customer service was great.Low notes:  the chicken kabob was tasty but salty, and the sides were just swimming in oil.  Bottom line: I could be convinced to try it again, though with so many other fine establishments in University City, I would probably go elsewhere."], ["Basil M.", "Pretty good - depending on what you order.I liked the tandoori chicken and what a call the beef Sikh kabob but they call the beef resham kabob.On the weekends they have specials - and we tried the nihari and the Haleem. The nihari was good... It was interesting, because most places you go skimp on the meat and give you a huge bowl of sauce. Kabobeesh was the exact opposite. Tons of the nihari meat and very little sauce (which is how I prefer it, and how my wife hates it).The Haleem was not very good, I've had much better. Lastly, we ordered chicken biryani for our son. It could have been good - but it tasted like it had been sitting out for a while. Maybe if it were fresh it would have been ok."], ["Prasath S.", "One of my fav restaurants ever...best kebabs out there...so fresh tooo...Try the Lamb Chops, Quail or the Beef Kebab. They pick up the fresh skewer from the fridge and throw it on the grill...can't beat that....Also for a spicy kick, try the Chicken or Goat Karahi. It takes 30minutes notice to prepare this dish and is a great share dish..."], ["Wesley C.", "I don't know why it's taken a year to come and try this place that is a block away from where we live.We've tried the local indian buffets (which have been pretty good), but I've missed fresh, good nan. Little did I know that it would be found so close.We had their tandoori chicken, lamb kabob, potato, lentil and cauliflower veggies. All of it was really quite exceptional, especially the lamb kabob. If you can be patient and wait - ugh - sometimes a LONG time for your food, you will be very pleased with what you receive. Really really really good food for reasonable prices. Will be trying many other things here in the near future."], ["Whiterock R.", "my favorite pakistani place these days. The fresh cooked items are the best especially the kababs, karahi, charga etc. The ready to go items are ok if you are in a hurry but usually made of 1/3rd oil."], ["Christina W.", "I would give this place 3.5 stars. I came here with a friend and was pretty pleased with my experience. I ordered the lamb curry platter and he ordered the special, the chicken tikka masala platter. The food was ready almost instantly, and while at first I was surprised by the price ($11-13), it came with an enormous amount of food. A bowl of curry, a standard dinner-plate-sized tandoori nan, a side salad, a side dish, rice, and a free drink if you're a student (either mango juice or a soda--the mango juice seems small but it's pretty thick and absolutely delicious). Still thought it was overpriced though, given everything except the curry could not have cost that much.Both curries were very good and eating them sent me back to my summer in India. The meat were fall-off-the-bone tender and juicy and very spicy! I thought the dal was just okay, and preferred my friend's eggplant side. The service was very helpful, and the environment was casual, comfortable, and very clean. I walked back home and was involuntarily sent into a very satisfying, two-hour-long food coma. Next time I'll have to try the kabobs!"], ["Shereen C.", "I haven't figured this place out yet.  I've had some stuff that's great, and other stuff that's okay.  Resham Chicken & Beef were tasty.  Will get again.Chicken kabob was tasty.Lamb kabob was also tasty, but tougher.Spinach & Eggplant dishes were both tasty.Vegetable and Chicken Samosas are solid.Chicken curry was just okay.  Wouldn't get it again -- they have better stuff here.Chana (chickpeas) was okay.Lahori Chargha (a whole grilled chicken) was okay. Not as flavourful as I was expecting given the Chicken kabob I'd had, and seemed overcooked.I feel like I need to try more stuff here.  Once I was there, and the next table had a Karahi -- it looked pretty good."], ["German S.", "Wow...love this place . Great food , prices , local.  Could eat here every day."], ["Divya N.", "We visited kabobesh to try the authentic chicken Biriyani but we were truly disappointed. The taste was aweful."], ["Arnold P.", "My mouth is watering just thinking about the chicken kebab plate and crispy fresh naan. Everything  I've ordered here has been delicious."], ["Vega X.", "Order ahead on the phone if you're picking up your order. Kebabs can take a bit of time to cook in the tandoor."], ["Rosalyn S.", "A tiny restaurant that remained busy and packed the entire time I was there. It took awhile for the food to arrive but it was well worth it.I started by asking if the chicken was spicy, and the manager at front gave me a free sample. It was absolutely delicious so I ordered a chicken kebab sandwich roll. This was one out of 1000 times ordering that I forget to mention my severe dairy allergy. When the sandwich came it was very clear that I could not eat it. I apologized profusely and explained my error and they were really polite and immediately offered to remake the sandwich at no charge. It was absolutely delicious, I'd never had anything like it.SERIOUSLY, teensy, good businesses like this deserve your patronage!"], ["Nofil B.", "Love it. I go to Kabobessh atleast once a week and sometimes more than once. Best Pakistani food I've ever had. I lived in Houston for a while and none of the restaurants their compares to the taste and the quality of the food at Kabobeesh. Try the Chicken Karahi and you will fall in love. Everything I've ordered from Kabobeesh has been great."], ["Neha K.", "I am vegetarian and I love coming to Kabobeesh!!!!! Can you believe it? It's just that good. It is spicy and flavorful and I always get the same thing: veggie platter. The naan is also huge, buttery, and delicious (fresh out of the oven). They are packed on Friday & Saturday nights but thank goodness they are open until 11pm."], ["Irfan K.", "It's better than some other desi places in Philly.If you're going for ambiance look elsewhere.Kebab rolls are always a fav of mine. They have a student discount with a free soda."], ["Peter D.", "I was pretty excited to try this place out after reading all the positive reviews, and ended up coming here on a weekday night with a friend. The decor is nothing special of course--the restaurant is basically a classic metal-clad diner with booths and a few tables inside. I got a meal of lamb chops, naan, salad and chickpeas, and also a soda--although the cashier was pretty confusing in terms of telling me which choices I was limited to, so I took something that looked small and inexpensive. The food took some time to be ready--the restaurant was hardly full, yet I waited probably 20 minutes or so. Everything is served in styrofoam containers, and all utensils/napkins/water is self-serve.Of course none of this matters when you're at a divey place like Kabobeesh, so I was excited to finally try out the food. The lamb chops were just OK--a little bit too salty and greasy for my tastes, and just not enough meat. The beans weren't too bad, and the naan was good, very fresh and crispy. $12 is pretty reasonable for lamb chops IMO, but I was definitely expecting larger portion sizes as I finished my meal pretty quickly. Would be willing to try again sometime in the future and get something else on the menu, however."], ["Salem A.", "This place is just epic. It is by far one of the best Indian BBQ I have had in the US and that's saying something! Portions are fair and sides are really good (all of them). Can't wait to try their biryani which is only there for one day I guess. I ordered the whole menu and so far my least favorite is the Salmon but everything else is just amazing. Highly recommended for BBQ lovers and fast Indo/Pak food! Also very fairly priced I think in comparison to other Indian places.On a side note their delivery guy is an idiot, always gets lost and is late. Also whats the point of the tip if he doesn't come to your door?"], ["Kunal P.", "I just simply love this place.Have been here over a dozen times.  Most of the times, I just get the resham beef platter.  On rare occasions, I've ordered the chapli kabob.Best time to visit is late night - after a long day of studying in the library.Here's a secret, and i'm not sure if we get this treatment cause we are repeat customers; but, going there late, you can usually ask them to replace the salad in the platter with any other veg dish AND ask for some extra gravy on your rice (free of charge).Their salad is probably the worst part of their food.Their Naan is simply the best I've ever had.Students get a free can of soda with their platter.  Can't beat that deal.If you are looking for a healthy or 'great' tasting meal, I doubt this is the place to go.But, it does the job for late night desi food cravings on a budget."], ["Joe C.", "After killing it on an interview this past Friday afternoon the first place I saw was Kabobeesh. I heard good things and, as is the norm, I was hungry so I decided to stop in and see what's up.  I ordered the resham beef platter which came with two unidentified sides, one green and bland and the other brown which had chickpeas and was pretty OK.  Also came with a small salad and a frisbee sized piece of naan, biggest I've ever seen, and a massive pile of basmati-style rice, pleasing to the eye but basically void of taste.  The mint dressing that accompanied the salad and my samosa app was one of the more heat-filled versions I've had which was a nice surprise.I really dug the resham beef although I wish the portion was larger.  It had a clear depth of flavors which was predictable due to their display case which shows the raw resham in all its glory crusted in a kaleidoscope of spices.  Before ordering I inquired to the owner (more on him later) as to the what the spices consisted of and the helpful gent simply confided to me \"Pakistani spices\".  Apparently that was all the info he felt necessary to share.Overall I was satisfied with my meal.  But they also provided entertainment.  Two belligerent Pakistani gentlemen entered the diner shouting  resulting in the owner pointing to them and shouting back.  But later it was determined that the three were apparently all friends and the verbal spar was actually friendly banter.  And then a drunk and/or drugged kitchen worker appeared, stumbling around the diner, getting into it with the two Pakistanis when they asked him \"why you always so effed up?\" Rather than addressing that reasonable question, said kitchen worker instead asked for marijuana.  BTW, the owner is a very nice guy.  He said he hoped I get the job so I can return again and again!And, regardless, I probably will, with or without the floor show."]], "Cafe Spice Express": [], "Desi Chaat House": [], "Cafe India": [], "Ekta Indian Cuisine": [], "Karma": [], "Philadelphia Chutney Company": [["Venkata T.", "Good cheap food that is not completely Indian in style. But should try their variety of choices in Dosa (Indian crepes).Good service and friendly management."], ["Konstantin N.", "The food here is somewhere between OK and good. On my last visit my fiance had the Chicken Tikka Koti roll, and that was good: high-quality chicken, good flavor, and a wrap that held together well (much thinner than traditional Koti rolls, but still very tasty). I had a Mysore Masala Dosa, and it missed the mark. There was little-to-no spice (which is par for the course with a Mysore dosa), and the dosa itself was too thin and crumbly to be eaten by hand.However, the worst thing about this place is the wait to get your food. 15 - 20 minutes between ordering at the counter and the plates coming out. That's the kind of wait I expect at a sit-down restaurant, not a quasi-fast-casual attempt."], ["Andrea C.", "First and foremost this is a wheelchair and mobility scooter accessible business, thank you.I love this place because it is simple to order with the just the right amount of variety. Wednesday my team from work and I popped in for lunch. I like watching people's reactions when they first see the Dosa. They kind of freak out at how enormous the Dosa is and start talking about how crazy the size is. What no one realizes until they start eating the Dosa is just how light of a lunch it is. In other words you don't get back to the office and do a face plant on your keyboard.The flavors are always just right, seasoned not spiced, in other words not too spicy. There are always 6 chutneys to choose from at varying levels of spice. What I really like is this is the perfect restaurant to bring basically anyone to, gluten free, vegetarian options and not a single person I have brought there has ever found a reason to utter anything negative. Oh, and the prices are very reasonable too. Lastly, the service is great, so friendly and accommodating. Fast, you can easily walk over from the office, order, eat and make it back within an hour. Give it a try if you haven't, yum!"], ["Kirsten B.", "I ate here with my fiance while we were staying in Philly not too long ago. I found them on HappyCow looking for vegan friendly places. We've had our share of dosas back home in Queens and were excited to try these. I got a masala dosa and my fiance got a mysore masala dosa. The size of the dosas was nice, they were tasty and filling like dosas should be. The sambar was pretty good, the chutneys were ok. However we both noticed that there wasn't really a difference in spiciness between the masala and mysore masala, and noticed they didn't have pondicherry dosas on the menu. It was also odd seeing so much meat on the menu, most of the authentic/traditional dosa places I've been to in NY are lacto-vegetarian. I know that comment might sound weird but imagine walking into a McDonalds only to find out half of the menu was vegetarian, it wouldn't be good or bad, it'd just feel weird and unexpected. That's how I felt seeing chicken and lamb on the menu. I guess they're trying to appeal to more tourists or non-Indians.  I'd definitely go back if I'm ever in Philly again!"], ["Naresh A.", "Heard a lot about this place.Been here along with my colleagues. I've tried South Indian. But looks like this is famous place for North Indian dishes. I've ordered Masala Dosa and plain dosa. Both are not really impressive. There is no oil at all. If you don't like oil then it's a good place to eat dosa. For me I need a little oil in dosa and so I was not satisfied. Ambience is okay and prices are also cheap relatively in Philly down town . Would come back and try North Indian dishes."], ["Jhon P.", "Oh found this place right next , i ordered for a classic masala dosa with cilantro, curry and coconut chutney . dosa was fresh and potato stuffing was spicy and enough.i like the flavours they added in the dosa masala ,i think is curry pata. my friend ordered chole poori and he said is good. but this place is very crowded in lunch time ,if u dont have enogh time ,make sure get food for to go.overall good experience and spacialy how just came from india and want to try something near by home taste ."], ["D H.", "Their samosas are excellent and they offer a spice level option with their entrees, overall very delicious!"], ["Julia C.", "Still very good and busy place for lunch. They also now have Indian dishes dishes/platter ie saag paneer (spinach and cheese in sauce with basmati rice), chicken korma platter, etc.. They give plentiful portions. I ordered a platter and brought home and ate the remaining food in two meals. Prices are reasonable. Very nice people who run it. My advice: go early to get table and food quicker! the Samosas are very good as well!"], ["Asad F.", "It was my first time trying a dosa, and my friend said that it is as good as it gets. The serving size was huge, and I was very full by the end of the meal. Had the mango lassi and curry chutney with the Mysore Masala Dosa, which complimented the food very well.The ambience is casual, with plastic seating and wooden tables, but it's great if you're grabbing a quick bite before heading into the city."], ["Tarini S.", "This is one of the rare Indian places that serves south Indian food in Philly.  Try it out for some excellent authentic dosa (the plain,  masala or mysore) and be hungry for it because these are huge!  Pro tip: ask the cashier for a side of gunpowder ( its just a spicy powder to dip the dosa into - not actual gunpowder). None of the other chipotle style dosas are traditional so I would not recommend those."], ["Rin C.", "I used to like this place although food quality did go down each time (went there probably 5-6 times over the year) but it all changed on my recent visit. I found COOKED PLASTIC in my food, vegetable biryani. I honestly mistook it for a tomato peel initially but as i pulled it out it became obvious that its a really long plastic turned reddish due to the curry/spices.  What was most annoying was the apathetic attitude of the manager/cashier/whatever-he-is when i went over to report it,  he simply said \"what can i do for you, a mistake happened\" and repeated it twice. No apologies there, or shock or any assurance to inform the kitchen staff on this negligence. I questioned how a plastic ended up in the food and he says casually \"it's probably the  wrapping from vegetables\", OK great, couldn't believe how this incident was taken so lightly and shrugged off. I asked for a replacement to-go, and as i was about to leave, he finally offered an apology and a 50% discount the next time i visit. Yeah sure, like I'm ever coming here again! The whole experience was cheap/weird, wish i had taken a picture of the food but it didn't strike me. Whatever-he-is needs to be a little more concerned for the customers, I wonder how the food is really being made behind the counters and how many complaints have been shrugged off like this before. I couldn't bring myself to eat the replacement food, just didn't feel right."], ["Farha A.", "This place was okay because I was starving and the food came quickly, but not one of the best Dosa's I've had. The sambar was also not flavorful or authentic and tasted as if it had been made from a powdered mix.I did appreciate the creativity of some of the fillings - though they were not the traditional things I would get in my Dosa but allows people various options and variety.The price is reasonable and I would come back if I were super hungry for a quick, cheap Dosa or in the area."], ["Elliot P.", "A perfect spot for someone wanting to try Indian, but not go too deep. This Indian place is not a traditional Inidian restaurant, more like an Indian-America fusion type of place. This is as Indian as Tex-Mex in Mexican. A bit. just a bit.So, if you're looking for something super authentico, you may not find it here. I mean, they have traditional Indian dishes here, but I couldn't tell you how they are. I've only been once and I had one of the \"new age\" dosas.The dosa was very tasty - and large! i wasn't quite sure how to eat it, so I just dug in. I ordered ine with chicken and avocado and some other indian stuff. As I'm not well versed in Indian cuisine, I shan't be more specific. Anyway, i liked it. You can choose a chutney with it. They have several standard chutneys and a special limited time chutney. I had the special, which was a delicious sweet tamarind. Highly recommend the tamarind. Hopefully it will become a staple.The service was ok, although there was only one guy in the front and his English was super choppy. I couldn't understand half of what he said. Good thing he wasn't giving me a haircut or a waxing. There could definitely be some improvement to the whole establishment with some clear English speakers, but it does not ruin the experience.They also included a house soup which was spicy and for soup, not bad. As some of you know, I am not a big fan of soup in general. Would return for lunch when in the area. They had these wrap thingies that looked terrific that i'd like to try."], ["Richard R.", "First time trying  PCC and it was a good experience. I tried the Chicken Tika Masala which was really flavorful and not too spicy with good amounts  of chicken. The rice was very good with the sauce. I would have liked a little more salad. My Mango Lasi was good alsoMy daughter got a Kati Roll which she liked. The fries were surprisingly good. The inside was really pleasant and clean and hip. Sort of a fast food, good quality Indian restaurant. Not a bad choice for lunch or a quick meal plus Federal Doughnuts is right next door!"], ["Yash M.", "This place has the potential to be one of the hottest casual eateries in center city, but it does not live up to that potential. South Indian food is quite uncommon in the city, and this place could definitely have been the best dosa place around. However, I would have to say the dosa at some other Indian restaurants is significantly more fresh and tasty. The food at Chutney Co is innovative, but it seems like the kitchen is not executing these ideas too well. Dosas are too sour, and leathery. An order with goat cheese ended up having a few specks of goat cheese. I will continue to eat here since it is one of the few places serving dosas in the city, but if something new and better came up, I wouldn't end up going to the chutney co too much."], ["Veronica K.", "While the decor is dark and the music choices are a bit odd (Indian dubstep?) I can't complain too much about the food. For ten bucks you get a hefty meal, and this is a great place for a quick lunch. It's somewhere between a real restaurant and a take out place, so just be warned its not overly fancy or a good place for a formal date.I got the Mysore masala dosa and it was decent and very large, though I feel it could've used a bit more heat to it. The cilantro chutney was fabulous and my only gripe is that there wasn't a larger portion of it. However I did not care for their sambar, it was a bit too thick for my taste and also lacked the heat I was looking for. As far as I can tell, you don't get to pick your level of spiciness either. (I'm not sure if this is something you can even choose for a dosa, so pardon my ignorance if it's really only found with one certain taste.)The old school type of dosa was decent, but  I get the feeling the true stars are the build your own kind. Hopefully I'll get to try that soon. Not the best South Indian food I've ever had, but not bad."], ["Rahul M.", "The place is not that expensive but as far as the food goes, it has been disappointing each of the 4 times I've been here."], ["Kevin P.", "Meh. The dosas are below average. I think that if a place specializes in dosas, they should be better than this. My dosa was not crispy and the filling (potato) was too dry.  The chutneys were pretty bland as well. With all of the other good restaurants in that area, I don't see a reason to go back here when I'm in Center City."], ["Himanshu S.", "I am giving this place five star reviews for three reasons - value for money, good customer service and creative menu. Where on the earth do you get a good combination of veg chicken (soy) and dosa! The collection of chutneys is impressive, with my favorite being mango and curry chutney. They also stock the great Indian cola - thumbs up which is a must have!!! Their Besan Ladoos (which they should make more often) are the best! I like their Masala chai. They have recently expanded their menu to include value meals like Dal tadka, chicken etc.. They are in the process of adding newer stuff. I wish the young energetic staff all the best, and I hope yelp customers have an awesome time here."], ["Aria S.", "I would give them a 3.5 (Yelp! When are you going to let us give half stars??)As a South Indian, I was raised eating dosas on the reg so naturally, I'm going to be more critical of PCC. -Innovative creations! Choose from fillings like avocado & arugula.-Can also choose traditional fillings like potato masala (potatoes/onions with spices)-$10 to fill you right up and comes with sambar (a soup to dip your dosa in) and a chutney (a dipping sauce)Tips for the chef---The sambar needs more salt, and I think they should offer to make it more spicy if you want-The chutneys need some work. I love coconut chutney but this one wasn't strong enough. The tomato one was too tomato-y. And the mango one was like a lassi! I would recommend trying this place since there are no South Indian places in Philly & it's something new for the adventurous eater! KEEP IT FOLK AND EAT WITH YOUR HANDS WHILE YOU'RE AT IT :D"], ["Sara S.", "So there are some pretty good reviews. And there are also some pretty awful reviews. Going in today, I wasn't sure what to expect but I wanted a dosa and a mango lassi.I ordered ahead, and within a moment or two of walking in- my food was ready. I was greeted kindly when I walked in, and the gentleman behind the counter seemed perfectly happy to be there.The food: Really tasty. I've had dosas many times before, and these stand up to them all. A perfectly crispy lentil crepe, filled with perfectly spiced potatoes and that madras spice. Mmmm...really quite excellent.A few times my mango lassi has been forgotten in my order, so that's a bummer. Though I'll inform you that they are delicious, and a stellar accompaniment to the spicy dosa. I'm planning many more visits here!"], ["Suzanne C.", "I'm giving this place another star because after a rather bad visit last week, the management immediately remedied the situation by offering me my correct meal for free. So overall I'd say the food is good here, however it's still seems understaffed  and a little slower than I'd hope for on my lunch break. I'd recommend stopping by only if you're not in a rush or during non-peak hours"], ["Jason C.", "I came here with my friends after a long day. The service was fairly quick, and they had a wide range of options on their menu. I had the achari paneer kati roll. The kati roll was very fresh and had a great level of spice. My friend had gotten chicken tikka masala at medium spice, and it was already too much for her to handle. I found the heat level to be just right, and the tikka masala to have all of the right spices that I would expect. Keep in mind you get lots of food, so the entrees are pretty easy to share."], ["Libby B.", "It's not fine dining, but it hits the spot. I've been twice now and both times I ordered the chicken tikka kati roll. I'm not Indian and am not convinced I've ever had particularly authentic Indian food. After eating here, I still haven't. But it's still really tasty and actually not a scary huge portion size like most fast food, so that's always a bonus. Try the mango chutney - I could eat it with a spoon!"], ["Ammara K.", "Best papdi chaat around.. The much talked about dosas were not that good though. The outer crust of the dosa was not crisp which I expected it to be, although I am not a regular dosa eating person so I don't know if it is like that for every dosa."], ["Katie K.", "I take this place as it is- a chipotle style South Indian place. Meaning it's not the most authentic, but it's quick, cheap, and good. The dosa are very filling. It's a win-lose on the chutneys. The coconut one is weak in flavor, but the cilantro one is very good though. The sambar they are served with is very salty on its own, but it good to dip the dosa itself into. Overall it's somewhere I like to come to when I need a quick filling meal."], ["Mohana B.", "This place is a disgrace for chutney. All the chutneys are frozen and it's definitely not fresh. If you are trying Indian food for the first time  - please don't start here. South Indian food tastes nothing like that they serve. It's their own version and it was very disappointing. We ordered masala Dosa - Potato was uncooked, Idly - it was like brick and Kati Roll - Chicken was cold. Dessert -was old. The only thing edible was  madras coffee."], ["Luba P.", "First time trying Indian food and pretty good! I tried the Chicken masala which was really flavorful and not too spicy with huge pieces of chicken, I just wish there was less rice but maybe more salad instead. Everyone else got the crepe wraps with different combo of chicken w/avo or the veg w/portabello. Both were OK, but I'm confused why the crepes are so huge and all of the stuffing is in the center so the edges are just dry and empty. Maybe you have to fold it or break off the edges to dip in the sauces? Not sure. The free soup was super bleh. The service was pretty fast and not too packed for lunch. Overall OK experience!"], ["Rachel A.", "I am a vegan and this is my fav dish in philly: veggie chicken dosa with avocado tomato arugula and I substitute mushrooms instead of cheese. It's so delicious! And it actually makes me feel like I ate healthy. Also the service here is super kind!"], ["Khusbu P.", "I wouldn't recommended going here if you are someone who LOVES dosa because you will be pretty  disappointed. 1) It was cold2) Tasted extremely bland3) Wasn't crunchyI'm only saying this because my mom makes the best dosas ever and I've also been to numerous restaurants that make amazing dosas."], ["Virginia C.", "Rule one: Share or be prepared for a take out box. This crepe like goodness is filled with your choice of curries and proteins. I also ask for the extra mango sauce on the side. Things to do:1) Mango Lassi2) Crepe like wrap with the cilantro and mango saucesThings I would avoid:1) Steamed Lentil Cake. It wasn't anything appetizing.2) Cauliflower Mongolian special. Ehhh- it was like a vegetarian version of General Tao's. I thought I was eating Indian food?"], ["Jacqueline O.", "I came here for dinner and got the #8 dosa with cilantro chutney on the side. The dosa itself was very good however not good enough for he price. 10$ for what I got was not enough."], ["Smrithi D.", "As a South Indian I'd like to think I know my dosas and this place was pretty good. The fusion ones were definitely innovative and something my mom would even do at home when I got bored of just the plain ones. The mango lassi was amazing and be sure to try the achari paneer Kati roll!"], ["Mr. M.", "Food is okie. I just visited once here, so could not comment more. However, the place could have been much better & cleaner. It could be more attractive considering the location of the shop."], ["Todd L.", "I come here all the time when im in philly.They serve indian dosas which is a really large thin crepe filled with your choice of chicken,potato, etc and you also includes all types of veges, such as advocado,tomatos spinach,roasted peppers etc.Its delicious,filling and only $10!"], ["Erich S.", "Good food. Counter service. Ok sized portions. Not the best Indian but not the worst either. I'd go back."], ["Vishala N.", "The name, the menu, the reviews and the look of the place promised something different from the regular \"Indian food\".What a disappointment!Ordered \"Aloo Masala Roll\"(spicy mashed potato with tomatoes and green pepper). What a disappointment! Except for the mashed potatoes rest of the ingredients were missing.Got a  greasy roll with potato filling that is actually served with a Dosa. The chutney served with the roll had no taste. To top it all, it was not even hot!"], ["Cynthia X.", "Came w/ my Indian friend, and she liked it.. So.. I'm going to say this place is good! She introduced me to my first Indian meal back home in Houston many many many years ago, and I'm glad we got to do it again here in Philly (though I have since had many many many Indian meals)There are a variety of dosas (traditional and Americana). Then, you get your choice of chutney w/ some seasonal varieties! I think I tried the strawberry one, which was too sweet and not flavorful / powerful enough for my dosas. I remember the mango one tasting really good.The first time I went, I had the real chicken dosa, but I tasted a friend's and quickly realized that the mock chicken is so much more flavorful! So, I got that the second time and will continue to get it in the future! Yum!This place is veg friendly! (Also, come w/ a pretty Indian girl on an Indian holiday, and you may just get a special sweet from their kitchen!) yay, perks!"], ["Laura F.", "I was visiting Philly, looking for something different and not too pricey. I came across this place with all the good reviews and had to give it a try. I decide to go traditional and ordered a Dosa with spicy potato filling. I would say a dosa is an Indian version of a crepe. The filling was pretty spicy, and sort of like mashed potatoes. It was pretty good, but not really as amazing as I hoped.My friend got a dosa with chicken and jack cheese. His looked better than mine. I assumed the more traditional dosa would be better, but maybe not. We both got the cilantro chutney, which was very good.Seating here was limited, but it was not crowded (about 4pm on a Saturday). The only weird thing was there was a homeless guy sort of peering in most of the time we were there.I would maybe go back here if I worked in the area for a filling and reasonably priced lunch. Otherwise, I do not think I would go out of my way to come back."], ["Evan T.", "Great local spot for Indian. The best fast casual Indian for the price in Philadelphia. The dosas, Kati rolls, and curries are all good."]], "Sitar India": [["Jim B.", "Delicious and fun.  I enjoyed this, my first trip, immensely, including the variety and value.  I'm glad nearby students have a great place to go for quality, diverse food choices."], ["Laura Jill S.", "We went here for lunch on a Friday and it was packed. There was a wait, but the wait wasn't too long, so we were pleasantly surprised.Definitely worth the trek into West Philly. Best channa masala I've had in a very long time--perfect texture & perfect amount of spiciness. I like that they keep a pitcher of water on the table--such a great strategy in a restaurant full of spicy food.There were 3-4 vegan options at the buffet, I enjoyed them all. I'd definitely go to Sitar again."], ["Cassandra K.", "Dropped into this local spot on a day trip to visit UofPenn. It was exactly what I wanted! A great and fresh Indian buffet, with attentive service to boot!"], ["James B.", "Made a reservation for 10 at this place on New Year's Eve 2014. Did it over the phone. Called AGAIN another day to make ABSOLUTELY SURE they would be open.Then we all showed up and they were closed.Not much more to say than that. We went to their main competitor, New Delhi, instead."], ["Andrew G.", "Great, inexpensive buffet, and all beer is $1.95 on Wednesdays.Nice servers, solid food."], ["Rachel Minhua W.", "I like this place a bit better than New Delhi because this place has a bit of variety in the entrees they serve. They serve curry dishes that have different textures so it is really nice (and i dont mean the texture of the protein but the actual sauce if that makes sense) because after a while I quickly get tired of eating/tasting and my palate just gets confused with flavors.And they also give a discount for students with valid id and they serve chai tea which is always a good thing. They also have a spring mix in their salad which is really nice if you dont like lettuce and such."], ["Kim A.", "The best! So many choices. Complimentary chai for lunch and mango juice for dinner. Reasonably priced. Great go to spot!"], ["Haytham A.", "The prices is very suitable and the food was Awesome, Also I like tekka masala chicken or lamb and Bryani rise !"], ["Manish N.", "buffet is below average. Neither the Non-veg nor the veg dishes tasted fresh. The tandoori was dry. The samosas were stale. Chole butare and mango beverage was ok. I won't recommend anyone patronizing it!"], ["Julia N.", "Come hungry, and stuff yourself silly such that you roll out the door, satisfied and selling like Indian food. Swear you'll never eat so much again, and then come back 2 weeks later and repeat the cycle.That's usually what happens when I go to Sitar. This Indian buffet restaurant has a good variety of foods, from the typical curries and paneer, to the tandoor chicken and naan (and salads too, if you are looking for something light or trying to make yourself feel better after eating all the other rich foods). You can't really go wrong with any of the dishes there, they are all rich and satisfying and you will want to go back for seconds, thirds and even fourths. The best part, in my opinion, is the mango juice! It's sweet and complements the savory Indian dishes. What's more, Sitar is a BYO, and the mango juice is a perfect mixer to whatever you decide to bring! Since it is a buffet, the service isn't that great - basically self service and sometimes you have to wave the server over so that they will bring your plates away and clear room for your next round of food.Tip: students get 10% discount! This makes the ~$11 dinner deal even better and worth your money."], ["Sheila D.", "In my opinion, the best Indian buffet in University City - and there are quite a few. The food choices are very wide ranging, and I love that they are all labeled as Gluten Free or Vegan. The free mango juice is extremely satisfying! The servers are also very nice. The last time I ate there, I accidentally left my gym bag on the back of my chair, and one server ran down the block in a t-shirt to deliver it to me! Nothing but good experiences here!"], ["Joe D.", "I'd only go back for the mango juice not the food. The food is extremely bland and lacking in flavor."], ["Nhat N.", "I was thoroughly impressed with this spot. When I first heard Indian buffet, I had reservations as I had never been to one. But this place was amazing. They offer many different options while maintaining high quality food. It does get busy, so I would call ahead for large crowds. Also in Wednesday's they have 1.95 beers. I would go out of my way to come back here."], ["Laura F.", "My favourite Indian food in Philly- the food tastes better and better everytime. if there's ever a wait, it's worth it. $12.05 dinner buffet after student discount/if you pay with cash. CAN'T BEAT IT!"], ["Ed C.", "Love Sitar! There are always several vegan options on the buffet and their channa masala is AMAZING! Highly recommended if you're in the mood for an Indian buffet!"], ["Sundarram R.", "One of the Best Indian restaurant in philly... Buffet rate is economical...  Don't miss the lamb curry.."], ["H C.", "Been here 2 times in the last month for the delicious lunch buffet and can't wait to go back!! Food is always fresh and hot. Plenty of vegetarian options. It's always busy in this place for a reason!! Great food at a great price - can't beat that!"], ["Love R.", "The food is okay. It's not a wide selection of buffet. I like the restaurant atmosphere. The dessert was really good. I ordered for catering here once and they gave us a lot of food for very reasonable price!"], ["Laasya A.", "The samosas are delicious.............. Lots of options in the buffet........ Mildly spicy......... The dessert is delicious (kheer , custard are usually the options)...... Fairly priced..."], ["LaTanya I.", "Very good lunch buffet.  Lots of vegetarian options.  Dinner buffet is also good with mango juice as an added option."], ["Raj Y.", "Naan was like rubber.  Typical indian buffet.  Nothing great about this place, but the place was packed on Saturday afternoon at 1pm."], ["Srujana Y.", "Best Indian buffet in University city! The biggest plus for Sitar is its CONSISTENCY. Sitar's buffet has a pretty wide selection for both vegetarians and non-vegetarians with tasty curries, rice and snack items that are reproducibly great in taste, and very affordable.As I mentioned in my tip previously - I make my own yummy samosa chat using the samosa, chutneys, chole (chick pea) masala and raita (yogurt sauce). :) Among the sides/curries, my favorites are the palak paneer, baingan (egg plant), aloo matar (potatoes n peas) and the mild yet flavorful dal. The chai (at lunch) or juice (at dinner) is an added bonus, love them both although I do wish their tea were less sugary. I like their fruit custard and rice pudding for desserts, surprisingly they do not contain artificial coloring/flavoring agents added in many other places.The service is good, the staff doesn't come across as friendly but do their job efficiently cleaning up empty dishes off the tables, given the tables are tiny and you need more space to fit every round of buffet items ;)"], ["Omnom N.", "I'm Indian and a student.And therefore, this place's lunch buffet is the best in terms of how much you pay (with student discount of course!) and what you get.Granted their buffet items remain the same - and you might get bored of it. But it's good 'almost-home-like' food.They serve really good chai also - you don't find it that often around Penn! Their idlis are a hit and miss. The first time, I went, they were hard and cold. Some other times, they were fresh and perefectly just soft to sink you teeth into.Always a good place to go when you're super hungry and want to hog!"], ["Raghari P.", "Great indian restaurant. Good service and and ambience. Buffet is excellent. Roti and mixed lentil dal is the best combination and it tastes awesome. My wife also liked orange chicken very much. Appears little crowded. Will come back again."], ["Jordan S.", "Indian buffet enthusiast at your disposal.I hold New Delhi's buffet on the pedestal so my review is really in comparison to that.Sitar was packed at lunch time but we did get a seat. I had decent hopes, assuming that only a quality place would translate to so many patrons.The Chicken Tikka Masala was the best I've had in a while. Perfect flavor. Not too creamy, not too watery. Just right! Worth the $8-9 fare alone.Saag Paneer was great as well. I can eat that stuff for days. The Samosas were perfect!They also had something I've never seen before. I can't remember what it was called but it looked like a Samosa except it was not stuffed with anything. Tasted like a zeppoli. Just fried, sweet dough. Very good desert. Definitely a worthy alternative to New Delhi. I would just go to whichever is closer but I definitely am a bit more loyal to New Delhi still.Enjoy!"], ["Steve S.", "This place is back in my good graces.  I've been coming here off and on for about 8 years now.  I like the fact that they saw the local competition stepping up their game, and they followed suit.  First of all, I love the remodeling they did.  I was coming here when it was far more cramped.  Much nicer layout now, especially in the buffet area where items are more organized than before.  I've come here a few times since my last review and noticed the food quality is back up to where I like it.  I had a full on meal last night and didn't feel like my insides were inundated with oil.  In fact, the Chicken Makhani and Chicken Tikka I had may actually taste better than when I had it before.  And my wife was really happy to see Idli and Sambhar on the buffet yesterday.  In University City, they are hands down the best of the Indian buffets in the general area.  I'm happy to recommend them."], ["Muslimcupcake J.", "Sitar consistently delivers! This was the first place I ever had Indian food when I transplanted from Texas and I've been continuously going back. Its hard for me to go in a straight line around the buffet because I'm fleeting from one thing to the next. Everything is so damn good. The customer service is phenomenal. Even when it's packed everyone is waited upon in a timely manner, dishes are cleared and water glasses are full. The servers are very good at check backs. I can't think of one negative thing to say about this place. Sitar is my measuring stick for Indian food."], ["Renea R.", "I have nothing but excellent things to say about Sitar India.  My friend tipped me off to the magic that is getting takeout at Sitar.  They give you a standard takeout carton with one large section and two smaller sections and rather than charging you by weight they charge you a flat rate (around $11 for dinner buffet and $9 for lunch buffet) for the carton.  I fill that sucker to the brim!  I just went there today and was able to fit numerous types of entrees, 7 samosas, and 4 slices of non in my carton and with a student discount it came down with taxes (and I added a small tip) to only $10.  I then go home and make a side of rice or couscous and have lunch for the week.  Today I was able to get lunch for today and 6 servings of lunch that I freeze to be eaten at work.  The food is always excellent.  I have never had anything I that didn't taste great there, and it even tastes good reheated after being frozen.In short-GO THERE!"], ["Ashley T.", "Typical buffet food. I've had better. What do you expect when food is made in large quantities and only replenished every hr pr so??? Next time I will stick with the menu."], ["BB C.", "The buffet here is an amazing bang for your buck. Come with an empty stomach, for sure! It's not the freshest tasting food around and I've definitely had Indian that was more spicy. That being said, you're getting an incredible deal. The atmosphere is nice and the service has always been very polite."], ["Fei S.", "I've been there before with my buddy at dinner time. He was so thrilled about that, so he dragged me over, but I couldn't remember anything.Then I went there this Monday lunch time with my wife. I was planning to have a fasting to clean up my system starting from Sunday, I was so hungary. First sight, I felt that is too small, much smailer than New Dehli on Chestnut st. But the truth is it is not that small, it's just concentrated in that corner. They have white rice, goat, lamb, tofu, chicken. AND the best is they have the CHAI. Pretty much like milk tea, but definitely different. I had three plates then I just can't have more. It was so nice."], ["Chris M.", "Wow, Sitar must have just gotten a renovation. I was walking by and noticed that their front wall on 38th Street was not a nice glass wall with their name etched into it. I usually go to New Dehli on the rare occasion when I want a huge lunch in the middle of the day, but we decided to drop into Sitar, and I'm happy we did. The place was packed when were got there--that's a good sign, I think. With 3 good Indian buffets in close proximity, being busy is generally predictive of good things to come. We were seated at the last available table and headed up to the buffet, which had a nice array of options, including vegetarian and meat options. My favorite is the chicken tikka masala over jasmine rice with nan. I also love the saag paneer here. Unlike New Dehli where they serve a dessert, the desserts here are on the buffet. The good part about that is that you can fill every remaining free square inch of stomach real estate with awesome rice pudding (made with raisins and cardamom pods). The servers are pleasant enough and efficient at clearing plates. The one thing they could do better is to keep water glasses full, but that is minor. I also like that you can go up to the front to pay and everyone can pay individually for their food. At about $9, it's a real bargain."], ["Nirmal U.", "I was disappointed with this place after eating their buffet the first few times, but the place is better if you order off the A la carte menu. They have student discounts as well."], ["Kevin Y.", "One of the more well-known Indian buffets on Penn's campus, Sitar is extremely popular with students, and you can expect this place to be incredibly packed during their peak hours.Sitar's buffet is small and tucks away perfectly into a tiny corner of the restaurant, but it still manages to offer a pretty decent selection of traditional Indian dishes. The quality of the food is nothing phenomenal, but from a non-Indian's perspective, it's still pretty good. During lunch hours, they usually have chai tea on tap, which I love. I usually sit for an extra 10 minutes after finishing my meal just to drink more chai.The best part about Sitar is the price. Students get a discount, so the lunch buffet only costs around $8.  For poor college students, that's a great price for an all-you-can-eat meal!I've never ordered anything off of the menu here, but I don't really see why you would when the buffet is such a great deal.Overall, decent food. Fantastic price. I would definitely recommend Sitar to everyone in University City."], ["Zan C.", "Ordered 4 times. Some dishes are good and some bad. Flavoured nans are not worth it. Delivered cold and with missing food."], ["Matt L.", "The best Indian food in University city! Buffet is always fresh and hot, I don't eat Indian food anywhere else in Philly! Highly recommended"], ["j h.", "Affordable, fresh food with a dinner buffet which included goat- not an easy find. Tip: They don't take reservations for under 8 people."], ["Christian S.", "I have dined at Indian buffets for lunch at Palace at the Ben, Mumbai Bistro, and more recently, Sitar India Restaurant. I have to agree with one of the Yelpers when they say Sitar has the best buffet in the city of Philadelphia. Well in my case in my case, thus far. I am glad my coworkers and I arrived early because this place became crowded and people were patrons were lining up outside. It would have been a travesty if we had to wait forever, or didn't have access to that goat curry, chili chicken, and the other appetizing items at the buffet. I need to get back here when I don't have to get back to work or have plans in the city so that I could eat myself into a stupor."], ["Jignesh P.", "Pretty bad customer service. Food was mediocre at the best. Not the Indian food that I've gotten used to in Philly.We ordered few dishes to go. upon pick up we realized that they were not freshly made, instead it was just kicked up from the buffet collection. We had some pieces of rice and other dishes that we didn't order in my saag!! I'd definitely stay away from them."], ["Dres D.", "Its hard to find better Indian food at this price. If you are a fan of this kind of cuisine, then you'd realize its quite a steal. And one would imagine that affects the food quality, but it does not. The food is in fact, very good.  Great vegetarian options as well.I only wish the food was spicier like the more finer Indian restaurants. But I guess that makes it a great place to take first timers.Not very big, so I'd recommend going for a weekday lunch when it's not as crowded. Also the design is cafeteria style, it's not meant for people who like to be uber comfy while they eat. Ambiently, it lacks. There is, however, a really great and eerie painting of floating abaya that I couldnt stop staring at."]], "Tandoor Authentic Indian Restaurant": [], "Minar Palace": [], "Indian Cuisine": [], "Imli Indian Kitchen": []}