{"Giorgio On Pine": [], "Trios fresh italian": [], "Gran Caffe L'Aquila": [["Tiffany T.", "Every time I get out of work late around 9 or 10pm and have a club or lounge to go out to near midnight.. I have to stop by here.. it's such a good excuse!After a long day at work, what's better than a rich plate of mushroom gnocchi + beer / wine / cocktail or all three..I returned for the gnocchi and good service, I love Luciano he always makes you laugh. He's so light hearted, always smiling, and always so funny to all the guests. He makes you feel like family.The gnocchi was just as good. This time, I saw him mixing some drinks for other customers and I decided to give one a go. Don't know what to get? Just ask him -- I told him I like whiskey, I like bourbon, nothing too sweet and he mixed up my very own concoction. His cocktails are great -- we had 2 of them. No need to go to Franklin Mortgage, great drinks here!Only reason we're not at 5 star yet is because our gelato was forgotten for quite some time -- but he did apologize perfusely and give it to us on the house, so plus .5 yelps. The alcoholic one was pretty good, it was coconut flavored. Would love to try another next time 4.5 yelps y'all. You'll feel like you're in Italy :)"], ["Stephanie C.", "Everything I've tried here so far has been delicious!  The arancini are adorable and look like little pears.  I'm a sucker for fresh squeezed juice and they make all of their juices to order!The servers were nice and attentive.  When we had to rush out today, they were quick to have our pasta packed to go.  Basil gelato is a must to add on to your pasta!"], ["Abby B.", "Had dinner here with some girlfriends last night and we could not have chosen a better place to fill our Italian cravings.First of all, this place is never-ending.  Don't be fooled, this place is HUGE!  The downstairs is a cafe/coffee bar and there are a few booths and high-tops for patrons who are dining.  Upstairs, there's a bar, and an insane amount of seating.  The ambiance and decor made me feel like I wasn't in Philly anymore.They serve tapas-style food and our table enjoyed everything we got, from the prosciutto di parma to the caprese salad.  The mozzarella was out of this world - I had never tasted anything so delicious when it comes to cheese.  Each week, they feature a different city from Italy and serve dishes that pertain to that city - what a cool concept!Service was very attentive and a few of the owners came over and shook our hands.  As this is a rather new establishment, there are still a few kinks to be worked out.  For instance, we were a party of 4 and somehow, my friend and I were seated downstairs, wondering why our other friends were late when in fact, they were seated upstairs waiting on us!  Better communication between the hostess and service staff is needed so that mix-ups like this don't happen, especially on busy nights.  Also, the wine was a bit warm (we had both red and white).  Overall, I am super excited to go back and try their other items and some espresso and gelato.  Great new addition to Philly!"], ["Any V.", "Love this place!! The gelatos are amazing, food is great and service is great! I would def recommend this place just make sure you make reservations"], ["Meridith E.", "Their gelato is the best we've found in the city.  It's not cheap, but we keep going back! The coffee, cherry, and cannoli are my favorites. The food looks delicious and very authentic too- we will be back to try that!"], ["Daniel E.", "this was a real nice place to go eat. I was there for a business meeting it was kind of loud to talk. I am rating my experience on the service and food. I had: Octopus (Polipo) appetizer = 5 out of 5 - I have never had such a soft octopus with a nice crisp outside. Definitely will have it againDuck on sweet sour sauce with side pasta = 4 out of 5 - Over all wonderful just was not all that into the pasta. Service = 4 out of 5 - the only thing they tripped on was that the food was not available so they substitute wild rabbit with Duck. Still the food was incredible. Am I coming back and recommend to others = For sure."], ["Carmen T.", "I stopped by this morning to \"take\" an espresso and I am excited to say that there is finally a coffee that matches if not surpasses La Colombe.  I travel to Abruzzo at least twice a year and I can tell you that this place is 100% authentic and is made from true Italian passion. If you want to go to Italy without taking a nine hour flight just walk through the door. To the owners I say grazie for bringing this amazing café to Philadelphia! I can't wait to come back for dinner!Update: I visited Gran Caffee a second time for dinner and it exceeded my expectations. They have arrosticinni.  If your born in Italy you may not know what this is because it is only from the region of Abruzzo. It was amazing and to date except for one restaurant in New York I have never found arrosticinni anywhere."], ["Brian M.", "The master gelato artist in residence is not to be underemphasized.You should make sure to include gelato as part of your meal, as I did -- twice!For dinner I had one of their seasonal specials, a wide noodle that included a savory gelato on top.  For dessert I had a scoop of pistachio and a scoop of their stracciatella gelato.  So worth it.Also I think every staff member in the restaurant stopped by to ask if we were enjoying our dinner."], ["Wonsuk C.", "Cute/fancy spot.  I usually go here just for the gelato, but they also have beer, pastries, sandwiches, salads, etc!  I honestly stay away from the pastries because they're left exposed to the flies... Mango gelato is really good... though it's hard to finish a small size on my own since it's really sweet/rich.  The rum flavored gelato was really good too!"], ["Bri J.", "Compared to any other gelato/ice cream spot in town, this takes the prize! They have even won 2015 best gelato from Best of Philly to prove it. The second you look into the resturant from the open front dining area, you can see Italy from Chestnut street. I'd say eat gelato first and then have dinner. I ordered an afogato (espresso with gelato) with zucaa (pumpkin spice) gelato which was mind blowing. They make both the gelato and coffee on premise upstairs in their labs, which the guest could watch while they enjoy dinner. By far the best espresso I have had. You know it is rich when the sugar sits at the top and needs to be mixed in, instead of just sinking to the bottom like most other places. If you are a wino, there is not a doubt that you could find a spectacular italian wine on their list of 200+ vino. Even though only about 30 of them are by the glass, each week they have a rotating menu where they visit a different city in Italy each week and gives you a chance to try some of the wines not usually sold by the glass. Now on to the food, if someone can bring me to another resturant that puts gelato on their food I would be shocked. Stefano Biasini, the gelato maker and head chef, has created something I was never aware of, gastronomic gelato! He takes a savory ingredient and turns it into a gelato to pair with a dish. Most are over pasta dishes, so it creates an extra sauce though out the dish. If you are a Carbonara lover, don't miss the Carbonara with bacon gelato! They even cook the pasta al dente like you would have in italy. I have also tried the Veal and Pork Ravioli that is served in a butter sage sauce with a black and white truffle gelato. Serve that with a glass of Cannonau and you will forever make this your regular dinner spot in the city."], ["Aditi M.", "This is a hidden gem in Center City Philadelphia. The most collection of gelato and the cute and chic ambience here makes me smile everytime I think of this place. My husband and I went their on a date night. Since, we made prior reservation, they gave a really nice table upstairs around the loft kind of area from where we could also see the cafe downstairs. The waitress was very sweet and the food was yummmm...We ordered appetizers (can't remember what) - goodMushroom Gnocchi - greatCrab pasta - barely had any crab in it.Affogato - just rightTiramisu - finger licking goodtook out one star coz of the grab pasta lacking crab"], ["Heather H.", "Love this place. Gelato is Fantastic! Especially when paired with your meal. Service is wonderful."], ["Sumita R.", "You have to try the gelato!  They hire a someone specially from Italy that creates their gelato for them. I tried several but settled on the coffee flavored and it was fantastic ! Perfectly flavored and not too heavy despite being gelato. We came here for dinner but honestly once I saw the gelato and desserts I really just saved my appetite for dessert! This place is definitely a classy place. I walked by the kitchen and heard some chefs joking around with each other in italian so it's authentic ! Their coffee bar looked fantastic as well but I did not get to try it. Definitely a place I will be back! They also have a very cute \"Romeo and Juliet\" table that I hope to bring my boyfriend one day to try!"], ["Sean C.", "The server was very short with us for showing up near close and the hot coco was more like a soup of a melted Hershey bar.. neither a beverage nor delicious.. I also had to put alot of sugar in my coffee to make it bearable.. not the evening European cafe vibe I was hoping for."], ["Yla A.", "This place is a hidden gem! Right off Rittenhouse but very down to earth. We went here on the recommendation of an Italian friend who said this was the only place in the city he will eat Italian food because it tastes like home. This restaurant imports a lot of its ingredients from Italy to give it that genuine taste. Even the pistachios for their gelato! They have large and small plates on their menu but some of the large plates are huge and very share-able. We got 3 small dishes, two desserts and two drinks for a very filling meal for only $60! Def try the lamb skewers with pancetta, the mozzarella is out of control, grilled octopus, peach sorbet, nutella gelato, and the egg custard gelato (tastes like flan)"], ["JAMEZ Z.", "Found it on google search for italian coffee philadelphia.   It does not disappoint! Great find! Full bar, food&wine choices great. Tons of coffee, tea, fresh pastries and desserts- you cannot go wrong here.  It pretty much rules."], ["Julie G.", "We went here with a group of what I thought was six without a reservation on a busy Friday night. We actually ended up being eight and two children. I was impressed with the way that the hostess and the manager found a table for us all the while apologizing that it would be a tight fit. So many restaurants would've just turned us away and insulted us for not having a reservation. The manager actually checked in on us several times throughout the meal, and I really appreciated his thoughtfulness. This place has a sizable wine menu, a great gelato selection, and a decent food menu. Most of us ordered pasta. The portions were small but filling. Plus they left room for dessert. I ordered a crab pasta which was just ok. My husbands ragu was delicious, as were the gnocchi. The highlight was definitely the gelato. We ordered a large to share with three scoops. At 8 bucks for an ice cream it's not cheap, but no decent gelato in the city is. My favorite flavor was the kinder one that had chocolate and waffle pieces. The Nutella was a little under flavored. My husband was very happy with the wide variety of European flavors. I would definitely consider coming back for the gelato, as I consider this place comparable to cappogiros in that regard. I would also come back for some dinner but would skip the crab pasta and maybe try a panini next time. Had I loved my main course for dinner, this would've been a five-star place. But kudos to the service team on handling our group so well."], ["Lily H.", "We went back a second time, and everything was delicious and wonderful and lovely. Our server was fabulous, and I'd absolutely recommend it to anyone and everyone."], ["Rebecca F.", "Beautiful indoor decorations and yummy desserts. What more can you really ask for?I got the hazelnut cappuccino, which ended up being FAR more sweet and less coffee-y tasting than I was hoping for, but it was quite delicious nonetheless. I paired that with a tiramisu, which was not the best I've ever had, but I loved that it was deliciously moist and drenched in more heavenly flavors and espresso.My friends got the caramel brulee and creme brulee, both were creamy and delectable. The creme brulee had a lemon base, which was unexpected, but still quite good.L'Aquila offers 4 different blends of espresso, depending on how much of a caffeine kick you're seeking. I got the medium blend, and I don't normally have too much of an issue sleeping at night with coffee, but dang, that is some powerful espresso. I could literally feel the caffeine and sugar coursing through my veins after we finished up around 5:30 PM, and laid awake in bed many hours later that night for far longer than I was anticipating... haha, but I wouldn't take back anything I consumed. It was all quite satisfying.Overall, a little pricey for my poor graduate student budget, but it's good for a nice splurge. I'm looking forward to going back and trying the famous gelato!"], ["Cesar S.", "The sweets are amazing! The ambience is really casual and inviting, it has this cozy and authentic feel to it, it's a most like walking into a coffee bar in Milano but with a touch of American service style. The espresso wasn't as good though. So only four star for me."]], "Dante & Luigi's": [], "Melograno": [["Robin C.", "I would recommend this for a date night. I have been here with a larger party and with smaller ones and it can get pretty noisy in here so I would suggest a smaller party. Although the prices are not incredibly cheap, they are completely reasonable when taking into account that you will not be paying for alcohol. They are BYOB and have no cork fee. I have had quite a few things on their menu but I would definitely recommend the rustico appetizer which has some delicious cured meats, cheeses, and grilled vegetables. The wild boar pasta is also incredibly delicious! I have come here on a date and ordered an appetizer and two pastas and we were both very satiated. Will definitely return!I would definitely recommend a reservation on a weekend night."], ["Tymbre A.", "I absolutely love this place. I went with a few of my co-workers for our holiday dinner and I was very satisfied. I am a huge fan of Italian food! And I've heard about this place a few times & coulddn't wait to try. It's nice, yet pretty casual. So you can be comfortable of dress up .... which ever you prefer. Also, if you're out dating or if you already have a special someone this is the perfect date spot! The food was prepared very nice, and the waitress was very friendly and gave us alot of details regarding the menu. I'd definitely go back, again and again."], ["Larry F.", "Our top BYOB place was booked for the night for our double date, so instead I we gave this place a try. Definitely exceeded my expectations!FOOD: 4/5The food was great in terms of choices and taste. I had meatballs for appetizer and the wild boar ragu for the main course. I also tried the filet and mussels. The meatball was very average and somewhat disappointing, but the wild boar ragu made up for that. The mussels didn't disappoint, and the filet was also pretty good. However, the prices were a bit on the high end for Italian food, and the portions were somewhat small. SERVICE: 4/5We were seated very quickly and overall everyone was very attentive. It was a bit difficult to get the waiter's attention when we wanted to get a photo, but it might just be that it was too loud. AMBIANCE: 5/5Not a bad place for group dinners or a 1 on 1 date. The restaurant is pretty small, but it was small enough where it felt cozy and comfortable."], ["Abby B.", "Every time I go back to Melograno, I remember why I like the place so much.  The service is always out of this world and they don't care if your large party stays for 4 hours, imbibing copious amounts of wine (if it's any consolation, the table next to us perched 2 large boxes of wine on their table - we weren't alone!)The food is always great and in all the years I've been coming here, their menu has pretty much remained the same.  I like this because I can recommend dishes to friends and I also know what to expect.  However, some variation wouldn't be a bad thing.  They do have nightly specials, so if I don't feel like having an old favorite, I'll generally opt for the special.  I'm all for trying new restaurants, but there's something to be said for Melograno, because I keep going back."], ["Laura G.", "So I'll start by saying that I am probably the most indecisive person when it comes to eating. For my 22nd birthday I wanted to go somewhere fun for a group, preferably at a BYOB. Normally BYOBs are super crammed and noisy but it was a Tuesday night so I wasn't worried. I also do not like Italian food but when I looked at the menu it looked wonderful. I called Monday to make a reservation for Tuesday but they are closed on Mondays, so I left a message. They called me back Tuesday afternoon with a spot open for 9 people at 8pm. I was a little upset because their online menu is a little different, so what I thought I would order was not available. To start, I ordered the mussels and they were definitely the best I have had in the city (and my favorite food is seafood). For my main dish I ordered the Filetto Al Pepe Verde. I ordered my filet mignon medium rare and it was just that. It was perfectly cooked and for 9 orders, we received our food very quickly. After we were done eating we still wanted to hang out and drink (we brought 7 bottles of wine). We stayed over an hour after we were already finished our meals. The service was great even long after we were finished with our meals. I would recommend going on a week night, you'll definitely get your moneys worth."], ["Katelyn M.", "I had my birthday dinner here, a group of 8 of us. The restaurant was accommodating even though they had a packed house of reservations full of large parties that evening. I have a tomato allergy, so it's incredibly difficult for me to enjoy an Italian restaurant, as I want everything on the menu, but there are only about 5 things on a normal menu I can now eat. I was able to get a full three course meal without even a thought of having to worry about my allergy. I got the Insalata Melograno, and of course just asked them to hold the tomatoes, followed that up with my entree which was the Filetto al Pepe Verde, and something chocolate for dessert. I was so impressed with my meal, the service, the accommodations, everything. My favorite part though, BYOB. Who doesn't love an incredible meal with your own alcohol?"], ["Thomas P.", "This place is so good - lived in Italy for a couple of years and have been looking for a good Italian restaurant in the city - this is definitely THE best - authentic Italian food, every single dish was absolutely amazing"], ["Tina C.", "Went there on a snowy/icy Sunday night so it was pretty quiet. My husband and I split a calamari appetizer which was delicious and copious. I think the most tasty dish was the pappardelle tarafuse with wild mushrooms. The service was impeccable and the price was right too."], ["Cynthia X.", "Came here for a quick bite and it was great! It's generally more for groups pre- night out since it's close to several of the theaters on Sansom, and have large tables in the back.I split the antipasti platter and the pappardelle Tartufate with my bf, and it was the perfect amount of food for a light meal. I actually enjoyed the antipasti platter the most - had a great variety of cold cuts, grilled veggies, mozzarella and crostini. I could eat it as a meal by myself! I ordered the pappardelle Tartufate based off yelp reviews and was slightly disappointed. The dish felt too rich / thick, but not in a creamy way. I also felt that the pasta to sauce ratio was slightly high, and the pasta was stuck together in a large clump. Liked the place, but will need to try a different pasta dish next time!"], ["Kelly M.", "Went for restaurant week on a Friday. We were seated immediately and the waitress, Kristen,  was friendly and extremely competent. I had the meatballs for my app. They were good with the sauce but a little dry without. My boyfriend had prosciutto with arugula and cheese which was also good.The wild boar ragout was amazing! Loved it! My boyfriend's steak was just ok. He said it didn't have a lot of flavor besides the sauce.Dessert was the chocolate cake. Tasted like a yummy brownie. Overall it was ok but not too special."], ["Hang T.", "This place was recommended by a friend and boy was it a great recommendation!  Food was delicious.  My absolute favorite is the mussels!  Oh dear god...my 2 girlfriends and I ate 3 servings of the complimentary bread - using the mussel sauce as a dipping sauce (I usually try to avoid the bread because I don't like to ruin my appetite, but it was absolutely IRRESISTIBLE).  Soo worth it!  Their pasta dishes are yummy.  I will definitely be back.  It is also BYOB, people.  My kind of place.  :)"], ["Brett W.", "Great BYOB date place.Nice ambiance, good food, great service.Before we even ordered, we were brought delicious focaccia that we immediately gobbled up. We ended up ordering the mussels appetizer (great to share), and then ordering the lamb entree and the truffled pappardelle, both of which were tasty! I would definitely recommend for a nice date night."], ["Jenn K.", "The ambiance was nice, the lighting was great, but the tables were narrow and wasn't great for a big-group BYO"], ["Amalia Y.", "the food alone deserves a very solid 3 stars. service seriously killed it on this one- such a disappointment. enough to bring it down a star :(had an almost solid experience at melograno over the weekend. 8 girls, 5 bottles of wine (yay for BYOB), an assortment of apps, pasta dishes, entrees, and desserts... overall very decent. staff was impersonal but okay throughout the meal(though we had to ask multiple times for bread, and our water glasses weren't really attended to... and we weren't told the specials until after we placed part of the order so we missed out on the eggplant app, which sounded like it would've been yummy) until the end, when they asked us to leave before we were through with dessert. ugh. i understand the food service industry and the push to flip a table, but kicking out paying patrons and leaving a bad impression at the end of the meal is just not worth it. definitely took off a star for that :(our group ordered a bunch of food and split everything family-style, even though the food is not served that way. we made our way through just about the entire menu, which was a plus. the majority of melograno's options are standard italian fare- meatballs, pastas, etc. with some creative twists here and there. specific food notes:- calamari appetizer. it's not the typical large rings fried calamari with marinara. Instead, tiny calamari rings and tentacles very lightly sautéed and tossed with white beans, tomatoes, and wilted baby spinach. the sauce was light and lemony with a little kick. very yummy.- mussels appetizer. they were yummy, with a lovely light white wine broth. giant chunks of garlic swam in the broth, and was great for dipping when we finally got some bread (only had to ask our waiter about 4 or 5 times).- pasta special with duck. this isn't descriptive enough to be helpful, but if they have the special of ripped pasta noodles with duck- get it. - pass on the risotto. it was undercooked and underseasoned. highly doubt it was made-to-order as risotto should be. the shrimp were tasty, but the overall dish was a let-down- salmon got great reviews from the table. we even ordered a second one to split. it was cooked perfectly, though the accompanying tomato salad was s bit blah.- the chicken. the one that's a half-chicken. get it. the cook on the chicken was perfect, the sauce was full of flavor, and the accompanying kale, potato, and pancetta hash was soooo good.- don't bother with the filet. It was a decent medium cook but was still tough and the sauce was bland and was a non-appealing shade of light pink. - tiramisu. this was yummy. light and airy, not dense like some variations. definitely a good pick, and i'm not typically a tiramisu fan.- skip the chocolate hazelnut crème brulee. yes, really. unless you just want a few spoonfulls of nutella. i mean, nothing wrong with that... but the burnt sugar top that lends a lot of depth to a typical standard crème brulee gets lost on this dish- it's textuarally pleasing, but that's about it. the best part was the small cluster of candied hazelnuts on top.overall not the best, but could've been worse. the food is decent, BYOB is great, and the location is convenient (especially if you're heading to helium comedy club for a show after dinner). service could really use improvement."], ["Alanna P.", "Really good antipasto and food in general - the lamb was cooked perfectly and we had a ricotta ravioli that was delicious. However, the service seemed to lag a little but they did let us sit and talk for a long time after paying the bill. Overall a great neighborhood gem but it would be great if the bread was warm!!!"], ["Hagana K.", "Had a great time here.The Sunday night $35 menu is a really awesome deal. The snail crostini was the highlight of the night, but the calamari salad was awesome as well. The meatball appetizer was just alright.The entrees... are surprisingly enormous for a nice italian place. The pork chop is delicious and absolutely enormous, and the papardelle was great too. I had the steak which was pretty good, but I would probably order something else next time."], ["Megan S.", "Went on a Saturday. Placed was jammed with good energy. Service was great. My dining partner loved is dish and lick the plate clean. My special was bland but had been there previously and loved my dinner. The appetizer of meatballs was very good along with the gelato dessert. Would recommend."], ["Andrea P.", "Melograno is one of my favorite BYOBs in Philly. The food is always top notch. I love the pappardelle al ragu and my vegetarian bf always orders the pappardelle tartufate. Both dishes are amazing. The hostess is lovely and always greets me with a hug. I also love the fact that they are now on opentable so it is easy to make a reservation. Only negative is the restaurant can be a bit noisy. But if you are looking for great authentic Italian, I highly recommend."], ["Robert C.", "One of my Philly faves. Order the tartufate or cacio e pepe for the pasta course. The fegatini and rusticito are great as well. Great byob that's very reasonably priced."], ["Daniel M.", "great dark atmosphere, food was great and not pricey, though farily modest proportions, nice to have a restaurant like this that's also byob"]], "Talluto's Authentic Italian Food": [], "L'Angolo Ristorante": [["Peg A.", "Fantabulous/magnifico food and service and what a todo they have for a celebration .  And it is also a BYOB"], ["Christine M.", "Since I am a HUGE yelper, I took everyones high recommendations of this quiant BYOB.  Little did I know it was the poorest reflection of what we actually experienced when we dined here on a relatively slow Valentine's day evening.  When you have to ask for napkins, you know you're in for bad service.... I had no idea how bad.  After we ordered our meals, we never saw our server again.  Our appetizers and entrees were nicely spaced out, but we had to ask for bread... that is one of my biggest pet peves.  Our water nor iced tea were refilled all night.  The couple who sat next to us arriving some time after us, were done and gone with dessert before we even were asked to wrap up our unfinished meals.  May I add, the same couple was highly demanding throughout the entire evening, even altering their appetizers and entrees... they chopped up the croutons finer because he thought they were too large??  HAHA  I didn't realize they custom served here.  I was so disappointed in my selection in L'Angolo, it wasn't just Valentine's day, but our anniversary.  What a huge disappointment.  I was tempted to get dessert, because unlike their pasta, it is supposedly homemade.  We had to pass because we felt purposefully ignored all night long.  While the douchbag next to us was getting special treatment, we were the layed back couple getting the worst service I have ever received...  There was a woman walking around, obviously not a server, doing absolutely nothing.  Our bus boy gave us more attention than the server, and while he was polite our server was busy tasting wine with what appeared to be regulars on the opposite side of the dining room.  What a joke.  We had to ask the bus boy and the only other server for our check 4 times.  I actually started putting on my coat, as a signal... like we'll leave if you don't want to get paid for this mediocre meal, at best.  Needless to say, we won't be returning, and neither should you if you're looking for good service. I hope the server reads this frank review, as he should know why he didn't get 20% tip... and I am typically a very generous tipper.  Thanks for the wine, as we had forgot ours... it was the only bit of service we received all night."], ["Bridget L.", "Excellent food and service.  We tried a number of appetizers, entrees and desserts and they were all winners.  It's BYOB, but they do have limoncello.  It was better than limoncello I had when I lived in Italy.  It's a small space so be sure to make a reservation.  We will definitely be back!"], ["Alexander T.", "Fantastic! You couldn't ask for for better service.  As if they welcomed you into their home."], ["Rachel P.", "Wow! This was Italian food at its best! My coworker and I happened to find this place on Yelp and we were not disappointed! I had the spaghetti bolognese, which was fantastic. We were from out of town and did not realize this was byob. So be sure to remember that! We plan on coming back here! Also, I would recommend making reservations."], ["Mika N.", "Excellent food and service. Friendly and highly competent staff. Food is a clever combination of Northern and Southern Italian cuisine. The artichoke appetizer is out of this world, and so is the orecchiette with duck. I'm looking forward to going back and try other menu choices.I hope the owners will soon install a proper (quiet) air conditioning unit since they are currently using old window units that are a bit too loud and old."], ["Jessica W.", "Yelpers--what did you see that I missed??  I really didn't see anything special in L'Angolo.I started off with the veal ravioli special, which was good.  But my entree, the duck orcchiette (which everyone seems to love) was really sub-par.  I thought the duck was unusually game-y and the sauce tasted like Campbell's chicken broth.  My husband's Spaghetti allo Scoglio wasn't much better.  Maybe we went on an off-night, but with so many wonderful (and consistent) Italian restaurants in the area, I'm not planning on giving them a second chance."], ["Eric M.", "This place is off the hook good. A coworker and I were in Philly for a couple of days for training, and after my first disastrous adventure with Italian on the first night, the third night decided to give it another go. Boy am I glad we did. The Artichokes were just spectacular-- some of the best I've had across the country. Grilled with Olive Oil and lemon, perfectly seasoned. Just order them if they are offering them the night you go in.Not a huge fan of the calamari, but it's wasn't bad, just not on the same level as the rest of the food I had the fish special, which was a perfectly cooked Branzino (European Sea Bass), served with sauteed green beans and a crispy polenta. Totally unbelievable. So good. Just the right amount of seasoning and garlic, and the fish was flaky and not overcooked. Their deserts all sounded good, but we decided on the cheesecake- with honey and crusted with sliced almonds. WOW. That's all I can say.The service was awesome, the cozy feel made for a perfect evening- the only downside is that it's BYOB, but other than that there's not a single negative thing to say about the place. And frankly, if we'd have realized it ahead of time it wouldn't have mattered as there's a liquor store less than a mile away and we would have stopped there first."], ["David A.", "Great South Philly Italian with a gourmet touch. Small and cozy with top shelf service.  Better yet it is a BYO so I took some nice Brunello and paired it with the daily special veal ravioli and the gnocchi in a creamy sage sauce. Rich but worth it.  My daughter had the Chicken with Balsamic Sauce which was ultra moist with great flavor.Will be back. Right off Broad and Porter."], ["Helen D.", "Absolutely delish!!!! Dinner with friends was amazing. Our waiter was fabulous. The salmon special was perfect"], ["Jenna S.", "I can't believe it took me so long to visit this gem in South Philly! Now - it's only place I want to go when I am craving Italian food. Service is impeccable. Food is authentic, very reasonably priced, generous portions, and amazing flavors. I have not experienced one mediocre dish yet. I highly recommended everything (but from experience: the gnocchi, daily fish, tiramisu, duck pasta, caprese salad or any salad for that matter, ricotta cheesecake is divine!"], ["Jaymie A.", "Absolutely wonderful dinner! The food, the staff and the ambience were all top notch. First time and will definitely be going back. Parking  was difficult, but the $10 valet was worth every penny. Great wine list and extensive menu."], ["Jen M.", "Beautiful BYOB. Start by walking through the kitchen, being greeted by the cooks and waiters. It makes you feel like you're entering a Tuscan villa!Inside, the tables are cramped so get use to hobnobbing with fellow diners. Get the artichoke hearts to start. You can't go wrong with the gnocchi. I very much doubt you'll have room for dessert. I never have!Space is limited and you'll need a reservation. There are usually only two sittings on a week night."], ["Josh B.", "Excellent food here and a very friendly staff. I took my girlfriend here right before I left for job training in Chicago for a month and this was very memorable. I got the seafood pasta dish which was delicious and a very generous plate. The seating was the only difficult element of the evening, we took an undesirable table right next to the kitchen in order to minimize our wait time even though we had made a reservation in advance, this was supposed to be a temporary arrangement. However, they more than made up for it when they were unable to relocate us to a better table by giving us a delicious dessert on the house. This place is definitely among the top BYOB's in the city."], ["Abigail L.", "I really loved this place. The fact that you have to walk through the kitchen to get to the dining area certainly adds a bit of charm and movie style ambience.  I went with some girlfriends and a few bottles of wine. We had intended to go somewhere else, but discovered they were closed for a vacation so we scrambled for a second choice and realized fate was on our side that night. We called L'Angolo and made a last minute reservation, I think we may have snagged the last table. We shared a few apps, including an artichoke special. I am such a sucker for an artichoke special. It did not disappoint.  For my entree I opted for the gnocchi and omitted the shrimp to make it veggie. It was delicious.  Everyone else loved their entrees too. Next time I'm going with other veggies so I can try more stuff! The bill was so cheap since it's BYO and service was spot on with frequently filled waters. Go!"], ["Melissa V.", "This place is awesome old school Italian!  It's kind of off the beaten path but worth it!  Ordered from the daily featured menu, and bring YOB.  Servers are super attentive and you'll leave happy that you came to this restaurant institution in So Philly!"], ["Sandy T.", "Excellent food. Excellent service. Everything we ordered was really good! Reasonably priced too. Can't say enough good things about this place!"], ["Brian S.", "L'Angolo really came through in the clutch. My wife and I ended up taking my mom out for dinner on a whim one Saturday night. Without reservations, we tried one Italian restaurant. They had no openings, but suggested L'Angolo's, which we didn't really know about. The staff promptly sat us after a brief wait, and we ate one of the best Italian seafood dinners ever. I had the mixed grill, which was not only incredibly delicious, but also so fresh. All of the food we tried that night was amazing. In addition, the staff was super friendly and efficient. We can't wait to go back"], ["Mark E.", "We were warmly greeted by the chef and entire wait staff as though we were \"famiglia\".... The atmosphere was cozy, freshly painted and felt like an Italian grotto. Our grilled romaine, Gorgonzola and balsamic reduction salad was savory and well balanced. Our veal ravioli in a cream sauce appetizer was exquisite. My wife loved her chicken breast with golden raisins and onions with a side of their spaghetti bolognese. I enjoyed my mahi mahi, mussels, clams, shrimp and calamari, however I would have preferred the fish to be less smothered in the broth. The marscapone cheesecake was amazing. We felt the service, food and atmosphere were outstanding and we will recommend it to our friends."], ["Lindsay G.", "my favorite byob in the city and I have been to them all! grilled calamari and the intimate atmosphere can't wait to get back"]], "In Riva": [], "Mercato": [["Therese M.", "As much as I enjoyed it my first few times here, my latest visit to Mercato took it from 4 to 5 stars in my book. I'm giving credit to the four course testing menu since I got to try more this time around. The tasting menu is such a good deal. You get an appetizer, pasta, entree, and dessert. Come hungry because it's a lot of food. Highlights of the meal were:- Mussels & Clams - the broth is tasty and great for dipping your bread - Beef Carpaccio - my first time having carpaccio.. I'm officially a fan.- Short rib ragu - my usual go-to, it never disappoints - Spicy crab bucatini - squid ink pasta was another first for me.. it had a nice kick to it and they definitely did not skimp on the crab. I loved everything about this dish!"], ["John K.", "When she first moved to Philly, the GF lived across the street from Varga. And while we heard great things about sister restaurant, Mercato, for some reason we never popped in, though we have been to Varga's other sister restaurant, Valanni. But with our good friends living nearby, we decided to finally stop by to celebrate my boy J's bday. And being that Mercato's BYO, we brought a few wines to start the night off. Dining inside is close quarters and homey. But we decided to gp al fresco and enjoy the late July breeze. We had plans to go out after, so apologies in advance for the camera pics (Samsung S6 Edge). Bread ServiceDinner started off with some Italian bread, along with whipped ricotta and olive oil with pepper sprinkled on top. Trio of Bruschetta [$12]We ordered two of the bruschetta to share among two couples. The 2nd came a bit late though because our server may not have heard or understand that we wanted two orders. That being said, the 2nd order did come out fairly quickly thereafter. The whipped ricotta and pickled watermelon was definitely my favorite, with the acid providing some balance amidst the rich, creamy ricotta. The chicken rillette with peas was nice, though the pears and figs ate somewhat sweet for my carnivorous tastes. Pan Seared Jersey Scallops [$30]Roasted eggplant puree, golden raisins, tomato agrodolce, arugulaWith the exception of the belly of this pig, the rest of the diners had the scallops. They were sweet, seared well, and nicely seasoned. The roasted eggplant puree provided some \"meaty\" undertones, but was balanced by the sweet and sour from the golden raisins and the agrodolce. Short Rib Ragu [$23.50]Ricotta gnocchi, broccoli rabe, shaved locatelli, truffle oilThe truffle oil was the faintest of faint and I was completely fine with that. I wasn't fine with the fact that the short rib was incredibly chewy and lacked any salt. The bed of broccoli rabe was a nice counterpoint to the heft of the beef, but again, there was a general lack of seasoning. The ricotta gnocchi were also a bit tough. Generally a disappointing dish. Despite the misstep with the bruschetta, service was good overall. Dinner was very relaxed and timing was great. However, I'll admit that I went away from this cash-only meal a bit disappointed. Perhaps my expectations were a bit high going in? I'll need to stop by again to give Mercato a fair chance, but in a city with plenty of BYO options, consistent execution is always appreciated."], ["Danielle B.", "A true delight!  Terrific space, attentive service, BYOB and excellent food.I suppose the only negatives are that the space is tiny, the tables are tightly packed and that it is cash-only."], ["Nat M.", "A good Italian restaurant that is intimate but not too small. It is CASH only and a BYOB.Nice menu with a good range of items. I went for restaurant week and they still offered specials you could substitute without any additional charge. Fantastic feature and it is not commonly done during restaurant week. I had the grilled artichoke, shared the meatballs stuffed with mozzarella, the lamb bucatini (special), tasted the short rib ragu (yummy), and had the tiramisu (really good)."], ["Lea T.", "Mercato is one of my favorite BYO Italian restaurants in Center City, but I've had to knock off a star after my recent visits. The atmosphere is cozy, intimate, and similar to a NY style restaurant. The earthy wooden tables are close together and I wouldn't recommend coming here with a party larger than 6. It is CASH ONLY and you can make reservations online at their website mercatobyob.com. They have a nice selection to choose from for restaurant week and daily specials are always appetizing. The pasta is fresh and the portion size is good, but I usually don't have leftovers. Unfortunately on my most recent visit my pasta was undercooked, the fish special was dry, and my meatballs were overcooked. I will come back, but this might not be my number one spot anymore. You'll start with sliced baguette and olive oil with ricotta. My favorite appetizers are the Smoked Mozzarella Stuffed Meatballs and Bruschetta Trio (which changes daily). The Whole Grilled Artichoke and Beef Carpaccio also seem to be big hits. The Short Rib Ragu is my favorite pasta, but the Pyramid Pasta is a nice option if you want something cheesy and indulgent. For meat dishes I would suggest the Chicken Alla Romana and Veal Milanese. Also a four course tasting menu is available for $48 per person."], ["Jess T.", "Had reservations for 8.30 pm on a Saturday night. When we walked in, there were plenty of tables open inside even though I didn't have options for an early reservation. We started with the mussels and clams. It was okay. We thought it was odd that the restaurant didn't offer any complimentary bread but later realized that they had forgotten. The squid ink buccatini with spicy crab sauce didn't disappoint however. It was really good with a good amount of crab for $24. They ran out of the duck ragu which we were interested in trying. The backup Lancaster chicken dish was solid but we probably won't be wanting seconds. The pistachio and almond cake which sounded intriguing was also nothing to shout about.I'm not sure whether it was because I'd been a little biased by previous reviews about lackluster service but we noticed the same. Our waiter was really nice but things were a little bit slow and we almost got charged for an extra entree. We were also seated nearly elbow to elbow with another couple because of how tight the space is so don't expect too much privacy of you're on a date. This place is BYOB and cash only."], ["Mallory S.", "Delicious and unique Italian BYOB in the Gayborhood. My favorite was the trio of bruschettas. They change them up all the time and use local specialities- my favorite was the pickled watermelon. The stuffed meatballs are a must!"], ["Eleni C.", "I cannot believe it took me living 7 years in Philly before I tried Mercato! It was absolutely delicious and it's a BYOB! We shared everything and we started with the stuffed meatballs (A-M-A-Z-I-N-G), then we ordered the squid ink pasta with crab and the short rib ragu gnocchi. I loved both dishes, but I thought the gnocchi dish was heavier than the squid ink pasta, so I'll probably opt for the latter next time.It's a tiny spot, and it is pretty tight in there, but it's cozy and cute!"], ["Doina N.", "Always wanted to go to this place but somehow it was difficult to get a reservation. I remember one day over the summer, there was a long line outside. However, I was able to get a table for two this past Wednesday. Service was courteous and on top of everything. No fancy customer service that are going to explain all the details of the menu and at the end you remember, basically, nothing. Menu was really good - just that the quality of it was not the greatest. The main i chose to get was the Spanish octopus which was tasty but way to salty. I'd like to blame this on the fact that I visited during restaurants week. The restaurant got extremely busy within 15 minutes. I'm not sure if I'll visit again. We'll see."], ["Shauna G.", "Okay the Pyramid Pasta might be the best pasta dish I have ever had in my life. IN. MY. LIFE. And this girl knows her carbs on carbs on carbs. When I finished it, I felt like I won at dinner. Not that the Chicken Marsala and the Veal Saltimbocca chosen by my dining companions weren't worthy competitors, but come on... lobster, shrimp, ricotta, pine nuts, asparagus, etc. etc. etc... they didn't stand a chance.Pro tip: Save some of that deeelicious bread for the leftover browned butter sauce. You're not gonna want to let any of that go back to the kitchen. Trust me."], ["Anu P.", "Why don't BYOs like this exist in SF? If they do, someone please point the way. This was one of my favorite BYOs I have ever been to. Is it possible to have a BYO dining experience that is actually classy and not trashy, delicious, AND has vinegar/olive oil tasting type appetizers? Apparently so. I can't remember exactly the food I ate (BYOs do that to you...jk it was 6+ months ago) but I do remember a few very special qualities: +Olive oil/vinegar appetizers. We chose a sampler of various vinegars and oil and it came with bread/crackers. Delishhh esp if you like vinegar tasting as much as the boyfriend and I do.+Lots of space, so getting a little tipsy and funny wasn't the least bit embarrassing (different story if I was inches away from the next table)+Adorable outdoor seating for a night when it's not too cold+Very, very reasonable prices+Fantastic, quick service even on a busy night+Did I mention BYO? I will definitely be back!"], ["Vanessa T.", "I came here on a friday night without reservations.  We waited for about 45 minutes to an hour for the table.  However, it could've been a shorter wait if they set people up in ways where you can move tables around.  There were a lot of tables open for 2 people but most people who were there came in groups of 3 or more.  You can choose to ask them for glasses to drink your BYOB wine/liquor while you wait.  This one group finished all their wine before they even got seated.  The service was pretty good, nothing extraordinary.The inside is pretty small and cozy with outside seatings available.  We sat outside on a fall night.  There were heat lamps above us so it wasn't all that bad, pretty pleasant.  The noise level can get pretty loud since it is a byob and when people come in groups and drink, it tends to get loud.As far as the food goes, the appetizers were amazing.  We ordered the antipasta and meatballs.  The antipasti was very refreshing served with some bread.  I ordered the risotto which I only took about a bite of because I was so full from the wine and appetizers.  I wish I had room for dessert because I normally like to end the night with sweets.One down side to this place is it's CASH ONLY.  It really is an inconvenience because most people don't carry too much cash on them anymore."], ["Elizabeth M.", "We went for Tasting Tuesdays...a $33 prix-fixe 3 course meal. It was phenomenal. Incorporated apples in every dish. I can't wait to go again!! Important things to know: BYOB and cash only."], ["Kelly R.", "This restaurant is amazing!  The staff is very friendly and knowledgable.  I love the atmosphere, exactly my style.  The food was so good!  We started with the cheese and meat platter and it was huge.  The waiter went over exactly what everything was and it was delicious.  Both our meals were great also!  I will definitely be returning."], ["Roxanne W.", "So it's restaurant week here in Philly so I have to partake as I do every year. This is my first stop, this BYOB. First tip U.S. Cash only but they do give you a reminder call when you make a reservation and let you know so that's a plus. We made our reservations early and were only the one of two tables in this intimate joint. I like small and intimate places so I don't mind. It got packed to capacity fast and the noise did not get too out of order so that also was a plus.The herbed butter served with the bread was tasty. Nothing exciting but it was butter...so it was great all the same lol.We both started off the first course with the Fontina Stuffed Meatballs. Excellent. Seasoned just right. Not overstuffed with cheese. Not too much or too little sauce. Just spot on!For the second courses I got the Pyramid Pasta. My BF got the Short Rib Ragu. My Pyramid Pasta was ok. I could taste the shrimp and lobster inside but it was overpowered by way too much Ricotta cheese in the stuffing. The brown butter sauce and pine nuts with asparagus helps cut the sharpness of the filling a little but it was still way too much cheese and way too little meat on the inside of the pasta. My date was satisfied with the taste of his Short Rib Ragu but thought the amount of short ribs in the entree lacked. Especially compared to the meatballs we just had as an appetizer. For Dessert I had the cannoli and he had the chocolate soufflé. Both excellent. Another plus for the restaurant week diner they had an additional menu they presented with items they included to go along with the restaurant week menu as well. Jury still out if we would or would not go back to try something else. Also, I have been going to the sushi spot up the street for YEARS and have walked by this place too many times to count and never noticed it. the sign I just saw is not on 12th...it on the small side street. Weird."], ["Adrian T.", "Always a fan of the BYO concept. The waitstaff was friendly and hospitable. Ordered the chicken which was cooked very well though wished the portion was a little bigger. The antipasti was definitely the highlight of the meal. Cute for date night especially with the outdoor seating. Only con was the Affogato. Not enough ice cream in ratio to the espresso."], ["Derek W.", "I have walked past Mercato dozens of times and it is always bursting at the seams with people - loud, happy, boisterous people.  The scene is inviting and intriguing but I've been hesitant to sign up for a long wait on the cramped sidewalk.  But then I scored a reservation on a recent Saturday night and the game was on.Sardines.  That's the inevitable feeling in the dining room, every inch packed with tables (average distance between, about an inch), tables full of people, servers snaking in and out and around.  There's something energizing about proximity to others and the lively din of the BYOBers, especially if you aren't trying for intimate conversation.     We visited during Restaurant Week, during which you are given a surprising range of choices (almost everything on the regular menu plus specials) at a real bargain price:  three courses, $35.  A boon for sharers, too.The roasted garlic and olive butter is a nice complement to the fresh slices of French bread that kicks off the meal.  Our roasted artichoke was exquisite, done just right, bathed in olive oil, sprinkled with pepper, and atop a flaky mound of sea salt that brings out even more flavor.  There's a tangy citrus aioli that adds to the fun - almost too much fun.  I could have subsisted on this dish alone.   Served alongside the artichoke, the market salad was the only mediocre entry of the evening.  It scored high on visual appeal due to the orange, red, green, and yellow tangle of shredded vegetables (frisee, beets, watermelon radish, carrots), but even with toasted hazelnuts and a smear of whipped ricotta the overall taste was subdued and boring.For entrees we auspiciously chose the two specials of the evening.  The papparadelle with pork cheeks, pancetta, pecorino, and sage was a hearty, rustic Italian masterpiece that would pair perfectly with a good cab (alas, we didn't get the BYOB memo).  The arctic char was especially well prepared, a tender fillet with crisp, must-eat-now skin.   Beneath the fish, delicious garlic spinach and long halves of roasted fingerling potatoes.  The chef drew a whimsical pattern across the plate with the tasty saffron aioli, and four mussels were scattered about for good measure.  The mussels were disappointingly small and tough and stuck to the shell, but that didn't detract too much.For dessert we chose two diametrically opposite treats, a creamy Nutella gelato and a dense apple bread pudding with vanilla gelato and caramel.   The gelato was pretty perfect, as gelato often is.  The bread pudding was solid, but a shade too dry and had a slightly overpowering anise flavor.All in all, Mercato delivered a top-notch feast, served by a pleasant and unassuming waiter, in cramped quarters that offered little breathing room but a nice opportunity to get to know our neighbors."], ["Carl B.", "Atmosphere:  Very tight, very close to other tables, loud inside, but we sat out on the sidewalk which was nice.Beverages:  The best kind, your own!Cuisine: My Fiance and I have heard such great things about Mercato, so we tried to love it, we really did, but it just wasn't that great.  She had the red pepper soup, which was pretty good but a little too spicy we both thought (and we both love very spicy food).  The mozzarella stuffed meatballs were OK, the marinara they were resting in wasn't very good, there was not much cheese stuffed in them, and the cheese wasn't very flavorful. For entrees we tried the spicy crab bucatini which was pretty tasty and the ink noodles it sat on are certainly something different, but I don't think I would ever come back and pay full price for them.  I had the Pyramid pasta which sounded really delicious, but was really lacking in the flavor department, it all tasted very bland, needed more seasoning, and the chunks of lobster were chopped in pretty large chunks so some bites would have a huge chunk, and others wouldn't have any.  I thought it could've been done a lot better.Desert was definitely what saved this place, at least for my fiance.  The goat cheese sorbet with balsamic reduction was fantastic, definitely the best desert either of us have had in a while both from a taste and creativity standpoint.  The Tiramisu I had was good, but like the meal as a whole, nothing to write home about.Service:The wait staff was fine, polite and professional, our only comment was that it took a long time by US standards (2.5 hours for the whole meal) which isn't a big deal to us, but it is something to be noted.I think with a little more aggressive seasoning and flavors, this place could be top notch, but until then, it's just another pretty-good and slightly over-priced BYOB in Philly."], ["Arin S.", "I love Mercato! So delicious. Definitely get the tasting menu-- it's under $50 and you get to try everything! And you can even bring your favorite cheap bottle of wine (I have no shame) and actually, then not too expensive of a night. But it is cash only!(Also, they ARE taking reservations now.)The food is amazing, and I posted some pics-- but you have to try that for yourself. I just wanted to vouch for sitting outside on Spruce Street because it's an adorable street and the people-watching is fantastic. I'm not even sure I'd want to sit inside-- the tables are crammed in both inside and out, but at least outside there's fresh air. I thought it was very intimate and romantic. I totally went for the atmosphere, but the food won me over in the end. It's one of my favorites in Philadelphia.Four stars because our server was struggling-- I think maybe she was new though, and she was nice, so no big deal."], ["Joe And Karen G.", "Great service.  New menu items this time.  The brisket was good but a little tough.  The appy meatballs were tough also.  Short rib ragu is reliably good.  Excellent flavors and love the mascarpone cheesecake."]], "Osteria - Philadelphia": [], "Davios": [], "Sotto": [], "Modo Mio": [["Douglas W.", "I had an excellent experience here with a friend.  We had heard good things and were not disappointed. Upscale Italian dining with a $35 four-course, prix fixe menu. When the first course arrived I was worried I would be leaving hungry but by the end of the meal I can truly say I was completely satisfied.  I had seared scallops, ravioli, rabbit confit, and panna cotta. The first two courses were small but when I tasted them I got that feeling inside that there was something special about it... a rare, savory flavor that you only get when it's been prepared perfectly.  Service was fantastic. The food was amazing. The atmosphere was well decorated and comfortable.  And you can never go wrong with BYOB.  It's nice to see yet another great restaurant open in Fishtown. I'd recommend this to anyone."], ["Rachael M.", "Have been to this establishment a number of times and if I was just rating food I would give it 4 stars.  However, the service is unacceptable.Had a reservation for 2 on Valentines, thinking that we had been previously and the food was always amazing.  We were aware of the inflated prices, but the service was atrocious.  We have never been treated so poorly.Noted that every other table was offered an amuse-bouche and sambuca.  Waitress was at our table a total of 2 times and both times was extremely obnoxious and neglectful.Manager- would recommend firing staff and starting over.  Take your chances if you will, the food is good, but don't expect any service."], ["Samantha C.", "Great little place, excellent service and value - $37 for 4 large courses and BYOB. Appetizers were amazing, particularly the muscles with spicy red sauce, but food did go down in quality a little after that. However, all in all very nice and recommended."], ["David W.", "Went there on a Sunday which means a fixe prix menu served \"family style\".  Which at this place means that for your $35 you get to fight with your dinning companions over who gets to eat what, as the portions are extremely small.  The food was very good but not worth the tiny portions and sloooow service."], ["Matt R.", "This is still the best Italian byo in the city and you can't beat the tasting menu. The mussels are always fresh and prepared perfectly. If you've never gotten the lasagna with fried egg on top it is a must try. However, all of the pastas are incredible. Service is phenomenal.  Here's a tip. They can do most dishes gluten free and will even bring gluten free bread."], ["David L.", "Food: 3Decor: 3Service: 5Came here for dinner after touching down in PHL. They only offer Sugo Sunday on Sundays, which is a $35 prix fixe.1. Ricotta with olive oil and sourdough bread~Really good. This simple dish is starting to become one of my favorite starters, although Barbuzzo's is better.2. Mixed plate of duck rillettes on toast, brussel sprouts, and 3-4 other veggie sides yelp.com/biz_photos/modo…~Okay. Only the duck rillettes stood out, and those were amazing. I could have had another 4-5 bite-sized pieces.3. Cozze yelp.com/biz_photos/modo…Mussels, your way, red or white, spicy or not~Okay. The mussels got cold too fast, and I wasn't a huge fan of the broth.4. Assorted pasta, including lasagne, gnocchi, and spaghetti~Okay. I was already getting full at this point, so I only tasted a couple bites of each.5. Salad~Pretty good. A nice refreshing break to the pace of the meal, and I requested a smaller portion so I could actually finish it.6. Dessert~Okay. I don't remember what the dessert was.Service was great, and they even gave me a half glass of white wine. The Sunday supper is way too much food for 1 person though (or even 2), so be prepared to be completely stuffed by the end of it."], ["marilyn l.", "My favorite italian byob in Philly! For $35 you get 4 courses. It is a great deal! Make sure to make a reservation since the place is small. But the food is delicious. The scallop appetizer that i orders was the best bite ever."], ["Michael N.", "Oh my Modo Mio.  This is place is fantastic.  With a revolving menu (or so it seems), I've always had a different meal at this place and I haven't been disappointed yet.    I always go with the $35 4 course meal to ensure that I'm very full and I've tried a little bit of everything.  I wish I could remember the names of the dishes I had, but I assure you pretty much everything is great.  The bread is a little hard though, so beware.As for the location, it's sorta on the fringe of Fishtown, NoLibs, and Kensington, so I'd be careful not too park too far north and west.  Generally I find a spot right out front so it's not a big deal, just be aware.The ambiance is simple.  It's a small place and the tables are close to each other, so if that's not your thing, beware.  Also, make sure you make reservations, even on week nights it tends to really fill up.  And did I mention BYO?"], ["Matthew H.", "I have been meaning to go to Modo Mio for a while because it is consistently rated one of the most underrated restaurants in the city and it is also a really good deal. It is a stellar deal, 4 courses for $35 and they are real courses like one that really fill you up. We arrived on a Friday night around 9 pm for our reservation and the place was hopping, almost every table was full and everyone seemed to be having a great time. We settled in and our server came over and told us about the menu and the specials. For 1st course we did the lamb belly special, the caprese, and the calamari. Everything was great and the lab belly was awesome it was cooked well and had a nice intense lamb taste. For 2nd course we did the rigatoni with zucchini, the seafood lasagna, and the tagliatelle pasta that came with chicken livers. Again everything was great and we really enjoyed it, the pasta was al dente just so you know and we all had to stop eating part way through the course to save room for the mains. For entrees we went with the whole fish (which has a $5 surcharge but I mean come on it's a steal), the skate wing, and one other thing that is escaping me. Our server was kind enough to let us sample some of her favorite sides including the broccoli rabe (spicy) and tomatoes in a vinegar and olive oil sauce which were really tasty and good since tomatoes are in season. For dessert our server brought out a sampler of the desserts and everything was very good but I have to say my 2 favorites were the cheesecake and the chocolate cake. We brought a bottle of wine since it's a BYO and it is cash only, there is an ATM in the back of the restaurant near the bathrooms. Total for this dinner for 3 people was $112 which is a deal. Definitely recommend Modo Mio and will be returning soon."], ["Kelsi J.", "My boyfriend and I came here last night at the suggestion of a friend who said it was \"amaze balls.\" She couldn't have been more right. The food, we both got the Turista prix fixe (what a great deal for $35!!), was great. We tried a little bit of everything, but the gnocchi that I ordered as my pasta dish was the gem of the evening. I also enjoyed that it was BYO. What made this place stand out to me was the service. Ian, our waiter, was amazing. He took the time to go over the menu with us and answer any questions that we had all while making us feel like we were in no rush to order (which was good because there were so many delicious options to choose from!). As someone who works in the service industry it's hard to find a restaurant that I feel has outstanding service. With that said, Ian surpassed both my boyfriends and my expectations and we would return here again just to have him as our server."], ["Megan G.", "I went to Modo Mio for the first time a few weeks ago, and absolutely loved it! We were able to get a last minute reservation the day before, which was great, and the restaurant was packed when we got there. We both did the prix fixe menu, and the price was pretty inexpensive, especially given that the place is BYOB.My first course was a seared scallop, and the scallop was cooked perfectly. I also had the pasta special with Tiger Shrimp, and the sauce was delicious. It came with about 4 pieces of shrimp too, which I thought was decent. The star of my meal was the fried steak. It was cooked to the perfect temperature, fried, and sitting in butter, and I ate every single piece. Also, the dishes seem small at first, but I was completely full by the end of the meal, so very deceiving. The only thing I did not love was that the restaurant was extremely small and loud, so it was more difficult to carry on a conversation. However, I would go back in a minute!"], ["Amanda G.", "I came here for New Years Eve dinner and was more than satisfied with the entire experience. We were taken for our reservation on-time, our courses came out quickly, our waitress (Marie) was outstanding (as was the rest of the staff that bussed our table, filled our water, brought our bread, etc.), and the food was spectacular. I really have no complaints about this - except to say that I was glad we were not seated in front of the door because it got stuck open every time someone new came into the restaurant. Not to mention that the price is definitely right here... a four-course meal for two people only cost $113.00. Here's a breakdown of what I ate in order from my favorite to my least favorite dish:1. Spinach and ricotta dumplings with a nutmeg brown butter. This was my favorite dish by far. The dumplings were essentially little gnocchis (the texture and heavyness was the same), but the butter sauce was SO GOOD. Guuuuhhhh I just want another plate of these right now.2. The mussels in a white wine sauce were my second favorite dish because they were the biggest mussels I've ever eaten in my life. Seriously. 3. Crispy pork tenderloin with beet and horseradish salad. This was essentially a pork cutlet (breaded) with beets on top. I didn't get much horseradish in this dish, but I liked it and was surprised how nicely the beets paired with the pork (I'm not a beet person).4. Butternut squash ravioli with pancetta and sage. These were definitely good, but they were sweeter than I was expecting, so it's primarily for that reason that they come in a little lower in my ranking.5. Veal with a mushroom cream sauce. This was good - it reminded me of a cross between beef stroganoff and veal Marsala. 6. Italian festival sausage with lentils and a balsamic poached egg. This dish was basically a crispy piece of sausage on a bed of lentils with an egg on top. I don't really like poached eggs or lentils, so that's why this is last (and also why my husband was the one to order this for himself!)For dessert we got a flourless chocolate cake and something else that I can't remember the name of. It was basically a white cake soaked in sambuca stuffed with ricotta cheese and some chunky bits that I can't decide were dried grapes or walnuts and then covered in a hard shell chocolate ganache. I liked both desserts a lot and was stuffed by the time we left. I would absolutely go back here!"], ["Kevin R.", "The same guys who brought you Monsu and Paesanos operate Modo Mio. This cash only BYO is a perfect fit for Northern Liberties. I highly recommend the tasting menu, not only for its great value, but for the diversity as well. We always get the same friendly waitress who makes you feel as welcome as family. The oversized bread loaf you see when you walk through the front door is not just an appropriate decoration; they serve this amazing carb monster along with a little soft cheese and olive oil to start. The four course tasting menu changes seasonally and on Sunday's they abandon the menu and serve up great Italian family style...come hungry and with a few friends to help you through this onslaught of yummy!"], ["Zach V.", "The four course menu is the way to go.  The portion sizes are small and I don't think ordering just one would be enough food.  That being said the four course menu for $35 is well worth it.  Our reservation was for 7:30 on a Saturday night.  We were seated immediately at a table just outside the kitchen.  The dining area is plain and has high ceilings.   The tables are close together and it wasn't too comfortable for someone my size (6'2).  The outside temp was about 92 and it wasn't much cooler inside.  If I was rating the restaurant just on the food it would totally be 4 stars.  My girlfriend and I shared the mussels with a spicy red sauce.  They were very large, cooked perfect and the sauce was FANTASTIC!  I had to ask for more of their house made bread to soak up all of the goodness left in the bowl after we devoured the mussels.  I forgot to mention the complementary oil / cheese.  I love dipping bread in oil but the added cheese just took it to a new level.For my pasta course I had the Bucatini Amatriciana.  It was thick hollow spaghetti, pancetta, spicy plum tomato & pecorino romano.  The pasta was a bit under cooked but I still enjoyed it.  I do love my pasta al dente but this was a bit too tough.  I really did enjoy the flavor and salty pancetta.  After finishing the pasta my breaded pork loin with blueberry reduction arrived.  It was topped with fresh arugula.  This dish reminded me of a German Schnitzel.  The sweet and bitter flavors worked well together.Since the portions are geared for multiple courses I had room for a piece of cheesecake.  The portion was the perfect size to finish off the meal with out making my pants feel too tight.I will return again."], ["Matt C.", "Hmmm.....alright....Modo Mio. Modo Mio did so many things right, but did so many other things very, very wrong. Strap in folks; this is going to get interesting.Lets start with the positives. If we were judging on food alone, Modo Mio is a 4 1/2 - 5 star experience. Everything was DELICIOUS, and with the Turista menu, the servings (although small) filled you up without making you feel stuffed. I started with the Saltimbocca, which for the time being, comes with crispy sweetbreads instead of egg dipped zucchini. It was delicious; the sweetbreads were perfect, and the crab and proscuitto made for a well complimented complete bite. Next course was the lasagna verde. The flavors were really good, but the lasagna was mostly ricotta cheese, and it kind of took over the dish. Still very tasty. The main course was Bistecca Siciliana, which is the breaded grilled ribeye, fried egg, lemon caper butter, sopressata and provolone, which was again, delicious. Dessert was just a mix of the current samplings, but I didn't really partake. There were 9 of us, so bites were being shared and almost everything I tasted was really, really good. At $35 for the 4 courses, its also a pretty sweet deal. Food wise, I have no complaints, and can whole-heartedly recommend Modo Mio.....On the other hand, there were some big knocks on Modo Mio as well. First, IT IS LOUD! I'm talking, headache inducing, yell to be heard loud. The restaurant itself is very small, which amplifies the cacophony of noise going on around you. Our waitress had to employ this high pitched, dolphin like voice to TRY and rise above the din of the restaurant, that only added to the problem. Someone at the other end of our table told me to literally text her what I was trying to say to her because she just couldn't hear. Insanely loud. As mentioned, it is also very small. I had to apologize to the table next to us, as I had to make the difficult \"ass or crotch\" choice, as I scooted past to get to my seat. The tables are unfortunately at PERFECT ass height, so my butt was hanging over this poor mans pasta. Third, Modo Mio FORCES you to order the Turista option for tables of more than 6. (I actually talked to the owner about this; more on THIS important tidbit to follow.) It doesn't matter if you aren't really hungry, or if you are allergic to something, or don't want to spend $35 because you just want some gnocchi, EVERYONE at the table MUST get the Turista. It wasn't a BIG problem for us, as 7 out of our 9 wanted the Turista anyway, but I'm not sure its a great business decision to TELL your patrons what they will be ordering. Our 2 holdouts were emphatically just not going to be forced (they had a wicked perfect storm of restrictive diet  and crazy allergies) and were finally allowed to basically split a Turista, after a talk with the owner......About THAT; as our 9:30 reservation quickly turned into a 10 o'clock seating, we were pretty much the last group in the restaurant at the end of the night. As such, the owner Pete came out to talk to us. He came out with a huge glass of red wine and thanked us for coming out before asking how everything was. Pretty par for the course for an owner, but there were a few comments that he made that maybe I wouldn't have made if I was the owner of a customer service driven industry. Maybe the wine had something to do with that, but being somewhat of a shoot from the hip kinda guy myself, I brushed off the.....lets say familiarity of the comments......Then we went outside, where Pete came back out to join us and continue the convo. Without getting into too much detail, because I really do think he is a nice enough guy, Pete continued to make comments and jokes to a bunch of people that he LITERALLY just met 5 minutes ago. Perhaps the second huge glass of wine had loosened ol' Pete up a little further, but he was just firing off comments without really taking the temperature of his audience. It wasn't anything on a Donald Sterling level, but he was getting close, if I'm being honest. It all came off as a \"hey, see, I'm cool...I'm like you guys\" kind of vibe, but the things he said elicited a couple of \"wow\"'s and awkward, \"OOOOOOOOOOOOkay\"'s.The fact that despite the missteps, Modo Mio is a 4 star experience, speaks to how well they do the good things right. The food really is excellent, and if you can get in and out before having to deal with any extracurricular activities, I think you'll enjoy your dinner.PS, BYOB."], ["B. C.", "Really terrific.  Great service.  We went for the Sunday dinner meal.  The appetizers have such distinct flavors -- pickled vegetables, roast vegetables, beans, cheese, and so on.  Pasta and meats are great too.  This is a \"hidden gem\" in Northern Liberties that everyone should visit."], ["Loy G.", "authentic northern italian byob.  i'm pretty picky about italian and this place exceeds expectations. bring a date, bring some wine, opt for the tourista menu and get the bucatini amatriciana for your pasta course.  you're welcome.  the charming little spot however is REALLY LOUD.  I'd opt for an outside seat if the weather permits."], ["John Q.", "Modo Mio is Italian for my way and this quaint establishment lives up to its name and reputation of having the best Northern Italian dishes in the city. For the best value, I recommend the tasting menu which includes 4 courses but we wary of your choices because some of the dishes are similar. Also, hit up the ATM before coming because it's cash only. Stop at the liquor store across the street too since it's a BYOB (although you do get a complimentary shot of Sambuca before dessert).I can't do Modo Mio justice with words, it's simply something you have to experience for yourself. If you like authentic Italian, you won't be disappointed."], ["Thomas G.", "This would be a great place to dine alone because no matter how much larger your party is you are not going to hear each other.  It may be unreasonable to begin a review of an eatery with a comment on the atmosphere (did I also mention it is cramped?) but why separate the two?  Are you going out with your partner, friends, date, etc. in order to cup your hands over your ears and shout?As for the food, it is inventive but very over-salted in general.  When four of us (yes, I know, I went with three other people...but never again) all complained the food was too salty the wait person's response was \"Well, that is the style of cooking.  Maybe you aren't familiar with these kinds of ingredients.\"  As a matter of fact, capers, anchovies and other ingredients containing large amounts of salt are not only familiar to us, we use them regularly.  When four people think the food is over-salted, it's over-salted.The prices are very reasonable here though the whole shtick of small and smaller plates has, frankly, run its course for me.  It hasn't for restaurateurs, however, because it is so profitable.The bread here is superb.  I'd almost come back for it alone...but I won't."], ["Celic M.", "The menu and meal was only sub-par to the amount of reviews/stars that I have seen from other reviewers. The price for the food is more expensive than what is presented."]], "Little Nonna's": [], "Spasso Italian Grill": [["Steven C.", "Looking for a meal while enjoying a beautiful Sunday out in the city. This was arguably one of the worst meals I've eaten in a long time. The food was generic at best. Olive garden had better Italian. The service was almost non existent. We were only able to get one glass of wine through dinner because the waiter never came to order another. The only redeeming part was that the wine was terrible and tasted like it was opened for days. Perhaps we didn't need a second glass.I am clueless how this had for stars with almost 200 reviews. Everything was heavy, one note, and not enjoyable. I would honestly rather go to Olive garden any day over this restaurant."], ["Andi S.", "I ordered the calamari, which was fresh and crispy. I also ordered the Linguine Puttanesca which was fabulous.  My friend however, ordered the Eggplant Parmigiana,, and when she asked me to try it,  had a couple of bites, and I realized that it had no flavor whatsoever. It was cooked to perfection, but it was missing something.  So, this is more of a 4.5 star review.The Pinot Grigio was refreshing and the serve was attentive without being overbearing."], ["Stephanie D.", "I am so disappointed in Spasso! The food is ok, but I  visit times per year with a party of 18+ or more and the service was always good. This year, despite loyal patronage, Spasso split my 20 person party for a  25 top(which they could have split) and served my split party dinner 20 minute a part and made my party feel very unwelcome and uncomfortable: I will never return."], ["Kat A.", "Lunch was fabulous.  Everything was delicious.  I can't wait to go again!!"], ["Linda M.", "Certified Yelp find... and overall the food was excellent with some lackluster dishes thrown in.  First... we ordered a ton of apps (escargot, calamari, sepia, caprese salad and raviolis).  I really enjoyed the sepia which is a white fish.  It was something new to me and the flavors in this dish really complemented one another.  For my entree, I enjoyed the pollo agro dolce. The chicken was tasty but the side items were overcooked (dry potatoes and burnt veggies). Large portions, good wine selection, decent service.  This restaurant was also hosting two events on location.  It seemed to be a local favorite."], ["Judy L.", "Everything was delicious! I highly recommend everything we got:grilled calamari - grilled to perfection! crab raviolizuppa di pesce - lots of seafood. Our favorite of the night.  paparadelle procini - the pasta was a bit too hard for my taste, but the flavor was great."], ["John M.", "The food here is oaky our meal was bland and not fresh.  The service was very good. There is much much better Italian in Philly."], ["Matt S.", "My wife and I went here for valentine's day.  We were promptly seated and ordered drinks.  We heard the pasta was homemade, so we wanted to make sure one of our meals included the pasta.  A few of the entrees we wanted didn't come with pasta, but we found some great dishes.  I got the Veal Saltimbocca and my wife ordered some seafood pasta dish.  We also heard the calamari was very good, so there was some of that in her dish.  We wanted dessert, so no appetizers for us.  Our food arrived quickly and looked really good.  I thoroughly enjoyed my veal and it was cooked very nicely.  The linguine was delicious from my wife's plate as was the calamari.  The only thing my wife didn't enjoy, was the shrimp.  It seemed overcooked.  After another round of drinks, we ordered a creme brulee cheese cake.  That dessert was so good.  It was more cheesecake, with a creme brulee top, but we loved it.   A lot of the other wait staff seemed better than our waitress, but everyone was friendly.  They gave us a carafe of water for the table, which allowed us to refill as needed."], ["Thuy H.", "Been here twice already (once for restuarant week and another for just a regular night). Both times were pretty good. I do have to say that they are a bit on the pricier side of italian food, but I can't blame them bc they are located in a great location (tourist, neighborhood, etc)Restaurant week menu was large. I believe they have a 4 course meal instead of the usual 3 (but not 100% sure). I went in a large group so I had a taste of basically everything on the menu. I don't really recall anything bad and nothing really stood out either. I went here a few years ago, so this review is more based on my recent experience.Recently, I ordered a crab and shrimp pasta and my husband ordered the pasta with all different seafoods. I loooved my pasta. The sauce was light and it was filled with shrimp and lumps of crab meat. I wasn't too fond of my husbands dish though. It was a lil too fishy like for me (but he loved it). It might be bc I'm not a huge fan of mussles and I could really taste it in the sauce. If you love mussles, you will probably really enjoy this dish."], ["Samantha T.", "Food was fantastic.  Service was AMAZING.  Great atmosphere! ! We had gone for restaurant week, but looking at the menu, their food was afordable any day!! BYO is always a bonus!"], ["Jake M.", "Dined here on mother's day for the first time in probably a year plus...not as impressed as I was the first couple times...probably because I have increased the number of Italian restaurants I tried in south Philly and now Spasso doesn't seem as great...Mother's day: the service is okay...nothing to complain or rave about...much like the food...Fried Calamari was average...my entrée Chicken Rollatini Rosmarino had good flavor but the chicken was a bit over cooked...the mixed vegetables lacked flavor...overall pretty average spot...wouldn't be my first choice of restaurant to take my mom back to but also not a bad place. I'm giving 3 stars but more like a 3.5 star establishment. My current favorite Italian restaurant is in Bella Vista neighborhood... Dante & Luigi's"], ["Aggie V.", "We went in there today for my friend's birthday celebrations and had amazing food. I had a reservation through Open Table and had left instructions to bring out a dessert - with a candle - at the end of the meal, which never happened. The waiter kept being MIA half the night. Therefore, I took away 1 star. ALWAYS get the crab ravioli..."], ["Natalie B.", "We were looking for a BYOB for dinner, this place came up on Yelp. It is NOT a BYO. Our waitress told us that she could not open our bottle for us or give us wine glasses because they have a full bar. However, the food was very good.We started with complementary vegetable dip and bread. The dip was zucchini, onions, and other vegetables covered in olive oil. It was light and delicious. We ordered the mussels with red sauce as an appetizer, and out came a HUGE bowl. I've never seen such a big portion served at a restaurant. For the entree, I had the papardelle porcini. I never had that kind of flat, thick pasta before, but it was divine. The sauce was savory and really complemented the mushrooms. I would have licked my plate clean if I thought no one would see. They have outdoor seating and our servers were attentive and friendly. After living in Rome for a semester, I'm pretty picky about Italian food. Spasso definitely passed the test."], ["kiara B.", "My husband and I were in Philly for our honeymoon recently and we stumbled upon this place. Food was delicious and the service was great! Do not hesitate to enjoy a meal here! The roasted veggies they serve with their bread are amazing. I will be copying that at home for sure!"], ["David D.", "The best meal we had in Philly.  This place is awesome!  Even the kids cleaned their plate.  The combination desert platter is a good way to try a little bit of everything."], ["Joe A.", "We had a small party here for 30 people.  We were placed in a small room off the bar that was set up with a hors de'ouvres table.  We had an open bar and wine on the table.  We had three entrée choices, salad, pasta course and an array of desserts.  The food, service, and ambience were outstanding.   They handled the affair beautifully. All our guests comments how nice the dinner was.  Spasso's is a real winner.  The restaurant is great and their catering superb."], ["Nicole M.", "I have been here so many times, it is a nice Italian go to in Philly. It's nothing crazy, but the food is well above average, the portions are good and the prices are very fair.  I have had great service every time I have come here, even on a busy day such as Valentines Day. Which, btw, even though it was super crowded, it was still enough room for my bf and I to have a romantic and quiet dinning experience.I would definitely recommend this place!"], ["Bill G.", "Great food and service!   The mussels in red sauce were fantastic and the sauce was perfect for dipping the fresh bread.  Calamari was fresh and crispy.   Highly recommend the Bronzino or veal with jumbo lump crab meat.  Great quality food in a rustic atmosphere.   Strongly recommended!"], ["Debrhea V.", "First off I would like to say that I am Italian and I am highly critical of most Italian restaurants. The food here is very good! Reminds me of having a home cooked meal. They know their way with the spices and I have never been disappointed with a meal here. The staff is great, even went out of their way to make something the little one would like!I recommend the Fusilli Lunghi. This has been my favorite dish so far."], ["Michael K.", "Out of 4 or 5 choices we made, the waitress managed to get 3 of them wrong. As in, the wrong kind of pasta for the kiddo and the wrong sides for both of us. Unfortunately for us, she got the steak order right. Note: don't order the steak.Despite being listed on OpenTable as 'good for kids' - don't be fooled, they have no kids menu, and your only real option is small pasta plates.The staff was friendly enough, one of the veal dishes was good, and the house cabernet wasn't bad at all. But honestly, the best feature of the restaurant is its proximity to the Hyatt. Hopefully you'll look for more than that."]], "Zavino": [], "Eatalia": [["Chris E.", "I will first start by saying that the service here is some of the best I've ever had. Friendly, knowledgable and there for anything you ask for immediately without being over bearing.Now to the food, we started off with the antipasto, a weekend special, and it was amazing. Prosciutto, mortadella, sharp provolone, stuffed peppers and many other things, marinated in a delicious oil, it was perfect. I got the porterhouse steak special next topped with Gorgonzola and an amazing steak sauce. Cooked veggies and mashed potatoes on the side, it was perfectly cooked and everything went perfect with the next thing. My girlfriend got the lasagna which had the best mozzarella cheese I've had, and the sauce was also amazing. We got the Tierra massou finally and that was perfect as well. Between the perfect food and the great service I would highly recommend this place to anyone."], ["Michelle C.", "From ambiance to decor, the smells tastes and desserts, I've been blown away.  What a delectable little eatery in a prospering neighborhood. If you've failed to visit, fret not. EaTalia is here to stay!!!!!"], ["C K.", "Called to make a reservation, and they were very helpful with my reservation and very friendly!"], ["William P.", "Great food and the manager is a great guy coming back again...pumped for the outside eating during the summer and great Italian food with the hassle of going to the city"], ["Risa D.", "Definitely satisfied my craving for pasta. The artichokes were perfectly tart, the garlic chunks so soft, and the sundried tomatoes had flavor. The linguine was al-dente, which I love. The chicken was a perfect breast, not overly cooked, and paired well with the rest of the meal. I will be getting food from here again as they are take out as well! Score!"], ["Jamie K.", "We ate here last night to celebrate my boyfriend's 32nd birthday.  We spent a week in Rome about 6 months ago, and wanted to eat somewhere to relive that experience as best as possible - so we went with Eatalia.  Let me start off by saying everything we had was exceptional.  We wanted to go all out (as we did when dining out in Rome,) so we ordered the arugula salad, the peperoni (cheese plate with roasted red peppers and olives,) the chicken marsala entree, and one of the entree specials of the evening, gnocchi in a gorgonzola cream sauce.  Everything tasted so real, fresh, and authentic.  It brought us right back to Rome.  We capped the evening off right with the strawberry/banana crepe and some espresso.  Do NOT skip coffee and dessert here!  I know you will probably be stuffed but you will be so glad you did.Portions were perfect and the service was some of the best I've had in a while.  Our server was very knowledgeable of the menu and was able to make great suggestions.  This place is a BYOB - and we decided the occasion was worthy of breaking out our last bottle of Brunello that we brought home from Italy.  I'm so glad we did!  This place is a jem.  I can't wait to come back with friends and family!"], ["Zach R.", "Excellent food, excellent service. When a 9 year old clears their plate faster than everyone else because the food was so good, you know the food is awesome. I got chicken rigatoni, gf got salmon rigatoni, both were awesome as well. I'll def be back again! Q"], ["Kyle W.", "Fantastic food with phenomenal service, had an amazing experience here. Only wish we'd known it was BYOB."], ["Chloe J.", "Finally had the chance to grab a bite to eat here. I was so excited to see another Italian spot pop up here. The quality of the food was great as well as the service. I look forward to dining here again with friends.Although it is unfortunate that it is located off the beaten path. It can actually be hard to spot since it blends in with the facade of other homes on the block."], ["Craig N.", "Finally made it here last night.  I used to love the former restaurant at this site,  Bistro Juliana,  and was shocked when they closed.   It seems that Eatalia is picking up where they left off, but there may still be a few tweaks that need to be worked out.  It's been pissing me off that there is no online info for this place, anywhere!  Cmon Eatalia, you can do better than that.We had the eggplant rollatini and antipasti for apps.  The eggplant was great, came out piping hot and was stuffed w/ fontina cheese and spinach.  The antipasti came w/ brushetta and potatoes?  I was confused.  I'd stay away from it.We had the salmon and veal saltimbucca for entrees.  The salmon was cooked perfectly medium and came on a bed of dijon sauce that was spectacular.  The veal was 3 decent pieces and full of flavor.  Both came w/ sides of sauteed spinach and roasted potatoes.  The potatoes were bland and boring and not too good.For dessert we had tiramisu, it was really really good, one of the best I've ever had.Overall, the service was great, it was BYOB, it was an excellent meal and wasn't too hard on the wallet.  I'd recommend anyone living in the area to give this place a try  I know I'll be back soon!"], ["Paul M.", "The first couple nights they offered a fixed menu.  The sesame bread (yum) was hot right out of the oven.  Next was probably the best antipasto I've ever had. The penne alla vodka was delicious and by the time our main dishes came out, we were too full!!  We got them to go but saved a little bit of room for the excellent tiramisu. Can't wait to go back and try the rest of the normal menu.Service was extremely friendly and prompt. You could tell it is a family run business and they take a lot of pride in what they serve."], ["christina j.", "This was the spot for friends birthday celebration.  We were large group of 18 and Eatalia had no issue accommodating us.  The menu had plenty of choices and offered generous amount of specials.  The table shared clams in red sauce & white wine, bruschetta and roasted peppers and cheese.  I ordered the house salad and tuna special over broccoli rabe with clams, mussels and calamari.  I asked to have tuna prepared rare and to have the shellfish on the side. Tuna was medium rare more towards well & shellfish was on another plate with red sauce.  My meal was good. Others had pasta, filet and chicken entrees.  The desserts, tiramisu, lemon marscarpone cake looked good too.  It was hard not trying the bread with what looked liked pesto dipping sauce or order pasta. I would go back and definitely try a pasta."], ["Mackie E.", "Unbelievable little BYOB that just opened up. So tiny and quaint. The service was excellent and the food was fantastic. I would HIGHLY recommend the antipasto, it was HUGE and delicious. The vodka sauce was also great! The pancetta in it was so flavorful. Not to mention, the prices were beyond reasonable. I think the most expensive entree was $19. I will definitely be back."], ["Bridget C.", "I went to Eatalia on January 17 with a group of 8. I loved this place when it was Bistro Juliana but I must say like it even better under the new owners.  We started off with 5 apps: Eggplant Rollentini, Clams (vongole) in white, bruschetta, grilled calamari (a special), and stuffed peppers (a special).  There wasn't a scrap left!  Everything was delicious with the Rollentini and bruschetta being my 2 favorites of the 5.  Also, the bread they serve is very fresh, warn and tasty.  For dinner, I was debating between the chicken carciofo and the lasagna (a special last night).  The owner pointed out that I could have the chicken any night so why not go with the special. I am so glad I did! It was probably the best lasagna I have ever had.  My 7 companions were all more than satisfied with their meals as well.For dessert, 1 friend ordered Tiramisu, which I tried.  It was very good.  The only downside to the entire meal were the cream puffs.  4 of my friends ordered them and not 1 of them enjoyed them as they seemed overly stale (as opposed to the slight staleness they normally have). But I would never judge the place based on the cream puffs as they are not a dessert I normally enjoy anyway.Finally, the bill came and it was so reasonable that at first I thought they had somehow made a mistake.  Obviously, Eatalia being a BYO helps to keep the price down.  And an extra bonus is that they even though they are a small establishment (seats up to 32 by my count), they take reservations.  It's so great to have a restaurant like Eatalia in the Port Richmond/Fishtown area."], ["Bob W.", "Went on a Saturday night in March. Hard to find in the dark and the windows were so dirty you could not see in or out. Seated us at a table near the door. The door's automatic closer was broke so every time someone came in the door stayed open. A staff member or diner had to get up to close it but not after several frigid blasts of air came in. It is a small place but the decibel level was like riding on top of the Frankford el. Our waitress came over and literally screamed out the specials which were at least 7 items. Ya think they  would have them on a chalkboard or print them out  so you could really think about them. There are like 10 tables in there, how much would ten copies of specials attached to the regular menu cost??? They immediately served us a vegetable hummus which turned out to be the best thing we ate all evening. Unfortunately it was served with several slices of Amoroso's air bread. I ordered the ravioli which were ordinary and nothing special but the waitress talked me into a homemade meatball which came in as a golf ball sized meatball tasty but so overcooked when I cut into it in crumbled into dry pieces. My wife had the ricotta gnocchi with pancetta and alfredo sauce.The pancetta was not crisped but limp and rubbery and there was not enough sauce. The worst were the gnocchi which were bland and tasted like raw flour. Salads and appetizers were expensive so we passed. Did not stay for dessert, had enough by then. Two entrees and the bill was $45 plus tip...won't be going back!"], ["Julie D.", "I had dinner here for the first time last night and was very impressed. I made a mental note to post a review on here ASAP, because I wouldn't have even known Eatalia existed, were it not for Yelp! I live in Fishtown and, though I have some local favorites, I'd grown a little tired of the same old, same old. So I turned to Yelp for some fresh ideas, and saw several glowing reviews for Eatalia. I went in with a friend around 7:00 on a Thursday, without a reservation. We were greeted right away by the owner, who was very friendly and seated us right away. It's a BYOB, which I love (and there aren't many in the Fishtown area). While perusing the menu, we were brought a basket of warm bread and a small bowl of something they called vegetable presto. It's similar to a pesto, but made with zucchini, carrots, and several other vegetables. Absolutely delicious! I would have asked for seconds, if our appetizer hadn't arrived so promptly. The menu is extensive, and everything on it sounds delicious, but we decided to order from the specials. We started with a baked portobello mushroom appetizer. The mushroom was marinated in delicious (clearly high quality) balsamic vinegar, and baked with some sort of greens, sundried tomatoes, and provolone cheese. It was very light, in spite of the cheese, and was absolutely delicious. For my entree, I had lobster ravioli, which was served in a rose sauce with shrimp and lump crab meat on top. I'm ordinarily not a big shrimp fan, but these were cooked to perfection and I ate all five of them. The ravioli was fantastic, and the sauce was rich but not overly heavy. My friend had another of the entree specials, which was spinach gnocchi with a gorgonzola cream sauce. I tasted hers, and it was every bit as delicious as my ravioli. Portions are large, but not overwhelmingly so. We both brought home leftovers, and I'm looking forward to enjoying mine tonight. The restaurant itself is relatively small and unassuming. Like I said, I had no idea it was there until I stumbled upon the Yelp reviews. It's on Cumberland Street, east of Aramingo Avenue, and is so close to 95 that outdoor seating (which they do have) might not be the most enjoyable experience (though there was a couple seated out there who seemed to be enjoying themselves just fine).  The interior of the restaurant is very comfortable and unpretentious. I appreciate this even more now that I know how excellent the food is, because it definitely rivals the best/most popular Italian eateries in the city, and yet isn't at all showy about it. We were waited on intermittently by the owner and a very friendly server, whose name I didn't catch. They were attentive without being overbearing, and took great care in making sure we were satisfied with our meal. For the first 40 or so minutes we were there, it was just us and another party of two, so it was relatively quiet/intimate. About halfway through our meal, a large party of 15-20 people came in and were seated next to us. It got considerably louder at that point, but not in an obnoxious way. I think that Eatalia is going to be my new favorite Italian BYOB, and I'm thrilled that it's within walking distance of my house. I'm looking forward to taking my parents the next time they visit, and am sure it will soon become one of my staples."], ["Amy B.", "Eat here every few weeks, food is always excellent. Get the lobster ravioli, also had meat sauce with gnocchi on New Years and it was amazing! The veggie spread for the bread, I crave it. Really like the waitstaff, friendly and attentive. They now recognize us, which I really love about a place. The owner is super nice and always checks in. It's a small place but they really do the best with what they have. Really hope they do well!"], ["Jason S.", "Service excellent!Food outstanding I had the bolognese special it was delicious.  I also had the meatball app which was also very good.  Def will return!"], ["m m.", "We ate here last night with friends... food was authentic, fresh & simply outstanding. Frank is very personable, wait staff great! Loved it! We'll be back!!"], ["Laura K.", "I have been meaning to submit a review for Eatalia and feel bad I haven't done this sooner! I went to dinner with a few friends to Eatalia and consider myself an EXTREMELY picky eater.  I was a little skeptical because I had yet to hear about the place and it's a little off the beaten path.  However, if I would recommend any Italian restaurant in the city, this would be one of them.  I have been to La Viola, Gnocchi, Porcini, Modo Mio, and all of the top Italian restaurants and I can honestly say the food here definitely competes with all of them.  We started with the antipasta and I assure you it was extremely good and had an excellent variety.  Next was the crabcake.  I am extremely picky about crabcakes but this was EXCELLENT! Nice crisp outside and juicy lump crabmeat inside.  Definitely one of the best I have ever had.  From there, I had the Filet Mignon in a Fra Diavalo sauce.  I am sitting here today writing the review while craving their Fra Diavalo sauce.  EXCELLENT!We finished off with the Tiramasu and loved it.  They also definitely get points for the presentation!I think the difference between Eatalia and all of the other Philadelphia Italian BYOBs is that it really conveys that small, intimate setting that you crave when you go to an Italian restaurant.  The owner is waiting on tables, meeting with customers and makes you feel at home.   You feel welcome and are not just \"another\" customer!  You can definitely tell that they are passionate about what they do!  This is definitely the type of place I see myself going to weekly to have dinner with family & friends.  If you are looking for a diamond in the rough, this is your place!! I'm just upset I didn't know of this place sooner!"]], "Vetri": [["John K.", "... Review continued ...Almond Tortellini with Truffle SauceDomaine Gerard Thomas, Bourgogne 2011Easily the GF's favorite dish - the almond tortellini were cooked perfectly al dente, redolent with almonds and crushed amaretti cookies, which added a nice textural sweetness to each bite. The truffle sauce helped to add an additional depth of flavor that was not overpowering. It was paired with the Burgogne, an aromatic and intensely fruity chardonnay. Spinach Gnocchi with Brown ButterPoggerino, Chianti Classico 2009My favorite Vetri dish is easily the spinach gnocchi with brown butter. The initial attack is all nutty cheese - Grana Padano and salty ricotta salata with hints of nutmeg. But then as the pillowy gnocchi envelops your tongue, spinach is readily apparent. The brown butter adds to the richness of each bite and it is at this point, I realize that the bite of spinach gnocchi alone is worth the price of admission. Truly a revelation of flavors. A perfect pairing with Chianti, the acidity and tannin in the wine helped to balance the heft of the gnocchi. Perhaps it was the Chianti that pushed it over the top, but it was at this point when I realized I was feeling the 'joy' involved with wine tasting.Pappardelle with Cockles and TardivoVie di Romans, Sauvignon 2009 \"Vieris\"At the halfway point, the pappardelle was presented to the GF. The GF was in love with the perfectly crafted and cooked pasta. And despite her wariness of bi-valves, she enjoyed the flavor the cockles lent. The raddichio helped to balance the dish and the pasta was paired with a sauvignon blanc that was intensely fruity, with a long full-bodied finish.Lasagna alla GiudiaVie di Romans, Sauvignon 2009 \"Vieris\"I received a decadent lasagna that contained baby artichoke and bechamel within baked pasta sheets. Parsley and mint helped to add an herbaceousness freshness to each bite. The crispiness of the pasta sheets helped to add texture.As with the GF's pappardelle, the lasagna was also paired with the Vieris sauvignon blanc. Ricotta Ravioli with Wild PecanYves Cuilleron a Chavanay, Roussanne 2012We were also simultaneously presented with ricotta ravioli with shaved wild pecans. The gossamer thin pasta was filled with clean flavors and orange zest helped to add a unique brightness that simply enthralled the GF. The ravioli was paired with Roussanne, which was redolent with honey and fruit.Milk Braised Lamb with Mint Anima Libera, Vino Nobile di Montepulciano 2007For our final savory dish of the night, we both received the milk-braised lamb, with the GF receiving the bone-in lamb. As expected, though not as tender as slow-braised lamb shank, the grassiness of this lamb perfumed each bite in an intoxicating manner. The milk braise helped to temper each bite along with the meaty cannellini beans, which the GF appreciated. The classic mint pairing offered a refreshing note as well.The lamb was paired with the Anima Libera, which was intense with spice, plum, and blackberry. Quite complex in its intensity, it was seemingly a nice choice for the lamb.At this point, we were offered the option of a standard dessert or the cheese plate. Despite our mutual love of cheese, we opted to go with a standard dessert in deference to the GF's sweet tooth.Blood Orange Sorbetto Honey, pistachioAs a palate cleanser, we were offered a blood orange sorbetto, which was heightened by the honey atop. For something so simple, the honey really added to each bite, with the pistachios offering texture.Piccolo PasticceriaWe were also brought a plate of piccolo pasticceria or mignardises. Clockwise, we were offered torrone with pistachio and almond, an apple button cookie, biscotti with chocolate, pistachio, and almond, chocolate-covered balsamic-vinegar chocolate, orange tuile with lemon curd, quince cookie, ricotta hazelnut cheesecake, and in the middle was a peppermint marshmallow with chocolate. A melange of various bites, the balsamic vinegar chocolate and the marshmallow were clear favorites.Elio Perrone, Bigaro 2012We were also served Bigaro, our favorite rose and a great way to end any night. We first had the tipple at Amis, so it was capricious that this sparkler made its way here. It was a refreshing and effervescent way to cap off the night, but in addition to a bonus pour from the staff, there was more to come!GM/Sommelier Bobby Domenick presented us with the entirety of panettone. As huge slices of panettone were served, Chef Adam Leonti himself came out to serve a heaping spoonful of sabayone made from prosecco - certainly a nice touch. And as expected, at the end of the meal we were presented with a take-home bag, replete with hand-painted menus and some almond coffee cake bites for the next day. Certainly come to Vetri Ristorante for the amazing tasting menu, but you'll find yourself returning for the unparalleled service. Kudos to the entire staff!"], ["Samuel M.", "Fine Fine. The art of the culinary. An Italian tasting menu. The location is beautiful, the neighborhood is a star. A very old charming house. We were seated at an alluring corner. Vetri is a special place, flawless, a dream. The most sophisticated Italian restaurant. Haute cuisine. Ten plates. A culinary immersive experience. It was a performance, we never lived that before."], ["Anthony N.", "***Marc Vetri's Vetri serves rustic and good Italian cuisine utilizing high quality ingredients, but it lacks the finesse and truly delicious cuisine of fine dining Italian restaurants like Quince (San Francisco) and Spiaggia (Chicago)***Vetri is one of the most renowned Italian restaurants across the country.  The restaurant has a small, rustic and neighborhood feel, but it features the tasting menu-esque approach and amuses of a fine dining restaurant.  I had several courses at Vetri and while I liked a good number of them, I left not enjoying Vetri as much as other upscale Italian fine dining spots I have been to like San Francisco's contemporary Quince and the traditional but still delicious Spiaggia in Chicago.My dinner at Vetri started with a series of amuses including crudite with a strong balsamic dip.  There was also a plate of assorted bites including sheep's milk cheese, a vegetable tart, cured pork, and foie gras with brioche and fruit paste.  The bread offerings included a standard sourdough and a very good and unique semolina focaccia, which had a texture and flavor similar to Yorkshire pudding.The first course was a very rich sweet onion filled crepe with truffle fondue.  The fondue was creamy and aromatic and the kitchen did a great job reducing down the onions so that it almost became like a marmalade.The fish course was Mediterranean sea bass with a crispy skin (as well as flaky and moist fish) paired with a lemon and fava bean risotto.  It was a simple but good dish.Two of the pasta courses I had were signature courses at Vetri.  There was soft and pillowy spinach gnocchi in a brown butter sauce.  The nicely cooked gnocchi was topped with a good Parmesan to contrast the sweetness of the sauce.I also had almond tortellini filled with rice.  The pasta was good and I liked the truffle sauce, but having pasta filled with rice was kind of odd because of the starch.  The consistency of the rice grains was also a little unusual for a pasta filling though maybe this is common in traditional Italian cuisine.The third pasta course was not a signature Vetri item, but it was an exceptional dish and my favorite of the night.  It was a dry pasta (durum pasta shells) sauteed with porcini mushrooms and escargot.  It was interesting having the escargot and mushrooms together because they had similar textures.  With the pasta being a mushroom pasta too, there was a great mushroom flavor throughout the dish and the flavor of the mushroom went really well with the escargot.My main course was a young goat over polenta.  Like a lot of the courses at Vetri, this course was very simple and only featuring 3 or 4 flavors but impactful flavors (though definitely not the elaborate courses you get at some of the more modern fine dining restaurants).  Like the fish course, Vetri handles proteins well here.  The goat was juicy and had a great crispy outside.  With the crispy outside and juicy, and easy-to-shred meat, this goat was a lot like crispy duck confit.  And like a lot of duck confit dishes, the goat here was overly salty.The cheese course featured a good variety of cheeses including goat cheese and a good blue cheese as well as garnishes like buttery milk toast, local honey and strawberry jam.The palate cleanser was a cool and refreshing raspberry sorbet topped with honey and a fresh raspberry.The main dessert was a molten cake-esque chocolate polenta cake with good vanilla gelato.  It was a simple but still satisfying dessert.  In addition, really exceptional to-go biscotti was provided at the end of the meal.Service was great--very, very nice staff and the food came out at a good pace.The dining room had a small and intimate feel (it felt very much like a neighborhood restaurant and not a stuffy and/or luxurious fine dining restaurant).Prices were high.  Though a lot of the food is rustic, Vetri is charging fine dining prices.  The menu approach is a tasting menu, but they show you a menu of the dishes available that night so that you can urge the inclusion of some dishes while also picking items you would like to avoid.While I enjoyed a lot of the food at Vetri (especially the excellent pasta with escargot and porcini), I left a little disappointed.  A lot of it had to do with expectations.  I was expecting Vetri to deliver the creative Italian cuisine of Quince or the simple but distinct, delicious and make-you-want-to-keep-digging-into-what-you-are-eating flavors of Angelini Osteria, but Vetri was a noticeable notch below both of these restaurants.  Vetri is definitely a good Italian restaurant though I am not sure I would say it is one of the country's best Italian restaurants based on this one visit.I am not sure what the parking situation is in this neighborhood."], ["Shefali V.", "So we spent $600.. No big deal. We just moved to Philly from Manhattan... We were expecting the best of the best... Oh boy were we surprised.... If you love salt this is your jam... 4 out of the 12 dishes served were so salty we had a problem swallowing them. If you love bones and love the excuse from the waiter when telling them we found a bone that \"well it's a very boney dish\" if you can let that fly then great for you... The service was great though and the wine was flowing ... But the food not so much.. Wish it was a better experience and maybe we will try it again when we leave Philly.."], ["Jay M.", "The best service of any restaurant I've ever been to, and every dish was off the charts wonderful, creative, complex, and well...yummy! Wine list was also very good, with a limited selection of really excellent wines. We had an Amarone that was to die for.  The wait staff was friendly and welcoming. Don't miss a real Philly gem - this place is outstanding."], ["Tess S.", "What a wonderful experience. My bf and I went to Vetri during their anniversary celebration, which happened to coincide with our our own anniversary week. Definitely now my favorite restaurant in Philly. We were impressed from the minute we stepped into the restaurant until  we left. Started with cocktails that were created for us and were totally on par with our tastes. Then we received bite size starters from the chef, including fois gras. This was followed by our four course tasting menu - my favorite item was the gnocchi ravioli, it melted in my mouth. Every item was perfectly prepared, I ended up liking goat, and we were provided with clear explanations of each course including how each one was prepared. Great service, attentive without being overbearing. Would love to come here again in the future, and will openly recommend to others. YUM!"], ["Samantha B.", "This place is great! I took my clients there on a weekday in the evening without hesitation. when you have a crowd that truly needs impressing, this place is top notch. Since moving from NYC, I'm curating a list of must go to. Add this to yours it won't disappoint."], ["Roland R.", "First of all, the small dining room exudes charm, and the service is extremely friendly and gracious.  If those things are all that count, this is a great restaurant.  On the other hand, there were a lot of things I didn't like.  I never like it when the restaurant decides what I have to eat (although, to be fair, they were pretty flexible about accommodating our requests).  They even took back a glass of wine my wife didn't like, which is always appreciated.  Our table location was noisy (near a work area) and busy (all the servers walked within a foot of me when coming from the kitchen, the entire meal).  Most of all, though, the food just wasn't special.  At this price point, one expects real sophistication, and this food seemed greasy and plain, and the presentation was nonexistent.  The taste was nothing special.  I would call the level of cooking amateurish, even.  I hate to write such negative things, given how pleasant and accommodating everyone was."], ["Emily C.", "AMAZING!!!  Went with a group of colleagues, and we all loved it. At the beginning they ask you if there's anything you really want or really don't want. Otherwise they choose for you. We didn't know what to say, but some tips from us:Our favorites: Hawaiian Hamachi Crudo (with the grand wine pairing which was so good), Lobster fusilli (very lobstery), almond tortellini and ricotta ravioiCould be skipped (still were good but not our favorites) : Sween onion crepe, the goatService was also outstanding. Very impressed by this restaurant"], ["Jessica P R.", "My review will likely include a lot of the same info from other reviews here on yelp.Was the meal fabulous?AbsolutelyWas it over $700 fabulous?Not reallyWhen you go to Vetri, you're prepared to drop a pretty penny.  The service is amazing, and so is the food.  It is an experience that everyone should try if they're ok with the pricepoint.  With that being said, I have had meals of similar quality for much less."], ["Eunni C.", "Excited to try this place. Heard good things about it. I was very impressed and enjoyed every dishes except one. Sadly that was my main dish. Ambiance wasn't fancy. Reminds small restaurant in Italy. Our waiter was excellent and very knowledgable. Definitely going back."], ["Vanessa S.", "this place is very FANCY! omg the food its just incredible the only downside of this place  is the price , but it worth it :) ..the staff are very professional and very informative"], ["Jessica S.", "Ooooooh god. OH god, omgomgomgomg.Yeah, it was a special night. And yes, I most certainly waited for the special moment to draft this review. My obnoxiously attractive, smart, and awesome boyfriend (ahem) took me here to celebrate the momentous occasion of my medical school graduation and uh yeah he's a keeper. But enough about him. This meal was everything I hoped/dreamed/planned/anticipated it would be.Let's preface this by saying that I, probably like most people who dine at this restaurant who aren't oblivious and or obnoxious, was anticipating the event for all of the days approaching it. Also, being the self proclaimed Philadelphia/generalized food snob/poor person that I am, have been coveting a meal here for some time. It was worth the wait and anticipation in every way.I honestly didn't want to read too many yelp reviews beforehand because I wanted it to be kind of a special surprise in a way that many of my preplanned and exceedingly researched meals are not.We walk in at reservation time, waited about 15-20 minutes for our table to be ready, and meanwhile offered (a couple glasses) of complementary sparkling wine. I didn't mind the wait, lets put it that way. Our table right next to the front windows was set far apart from the others-there are not too many seats in this restaurant. Crusty bread, appetizers, vegetables with an amazing balsamic cream sauce, house cured olives-this is just the \"before the actual courses come out\" offering. After that, we were both treated to 5-6 different plates each (aka, I ate maybe 11 different dishes that night). Highlights were most definitely some of Vetri classics. They are classics for a reason. Sweet onion crepe is unreal, as is the spinach gnocchi. I appreciated the sweetbreads dish and all of the pasta courses I ended up getting. What a lucky girl I was that night.The dessert before the dessert as well as the actual dessert were just perfect. And by that point I was way over indulged to even pay attention to what I was eating. Just kidding, that would never happen. If you dine here, you are obviously either treating and or being treated by a very important person/business partner/client/special event etc etc etc. Make the splurge and get the fancy wine pairing. Yes, the fancy one. Whatever they're calling that these days. Or, make it even more exciting for you and your date and do one of each wine pairing. Either way. Drink fancy wine, eat ridiculous food, and make sure you have over 3 hours to do-because you don't want to be rushing this one."], ["Joel L.", "Hard to fault this emporium of fine  dining  Feel that I don't have to say much as Sarah A in her review of 10/11/15 nailed it and with more detail than I feel the need.  One thing she didn't mention is their careful concern for dietary  restrictions and culinary preferences..The service staff really knows the food and methods of preparation which my spouse really appreciated:  \"No this,no that, no problem\".  I have to agree with the saltiness issue which has also been mentioned by others.  Don't know if Chef relies  on pork broth for reductions and sauces but that could do it.  Also wouldn't mind seeing a few dishes lifted with some herbs or lemon.  Otherwise great refined dishes up there with my other favorite Italian oriented American chefs: Michael White (Marea); Scott Conant  (L'Impero; Alto) and Matthew Accarrino (SPQR).   You get the idea of the league Vetri is in if you go.  Definitely a' 'celebration' type place (translation: very expensive).  By the way, the wine list has some reasonable options which  many places in the Batali/Bastianich venues  such as Del Posto in NY for example, don't have.  Any way, not to be missed: the spinach gnocchi and the veal tartare,  choices on the tasting menu.  Go and enjoy the experience when in Philly."], ["Michael U.", "Second visit; dishes tasted as below:ProsecoCanapes - Balsamic Soaked apples, Herbed vegetable torte, House made chorizo, Black pepper salumi, Foie gras pastrami with coriander and black pepper fennel moustarda over briocheCrudites - Fennel, Zucchini, Carrot, Radish, Balsamic CremaHouse Bread - Focaccia and Filone Italian yeast bread with Gaeta Olives and ButterMonkfish in Carpione - Dredged in rice flour, Fried in olive oil, served with pickled carrots, fennel, celeryLamb Chorizo with Favas and Mint, chili oilBandera Quail with Rosemary Potatoes and Grapes under a Sauce of cognac, cipollini onions, chicken liver, sage, and creamSweet Onion Crepe with Truffle FondueAlmond Tortellini with Truffle Sauce, Toasted Almond, ParmesanSweet Pea Agnolotti with Prosciutto, Robiola Cheese, Ricotta SalataSpinach Gnocchi with Brown ButterFettucine with Morels and ParmesanDuck Confit Ravioli with Pinot Noir, Thyme, and CurrantsRabbit Papardelle with Cacio Al Tartufo, Carrots, Pecorino, and Black TruffleRoasted Capretto with Stone Milled PolentaLine Caught Alaskan King Salmon with Strawberries and AsparagusMaialino with Fiddlehead Ferns and Mostarda, crispy skin, sage, pancetta, and Vidalia onionsCheese Board - Honey from Abruzzese, Red Wine Applesauce, Toasted Milk Bread, Bagoss, Verde Capra, Testun al Barolo, Casatica, Pecorino Foglie di NoceCoconut Sorbet with Chocolate and AlmondsPistachio Flan with White Chocolate GelatoChocolate Polenta SouffléOatmeal and Blueberry Trifle - Served in a Mouth-Blown Kosta Boda GlassPetit Fours - Chocolate Apricot Macarons, Strawberry Gelee, Cocoa FudgeBrulee Marshmallow Meringue...I'd been to Vetri before as a solo and this time I went back with friends who'd been as well but having e-mailed the restaurant to inquire about an extended tasting what we received was more-or-less every single dish on the Vetri menu that evening, each diner receiving a different dish for each course and each dish exquisitely prepared and presented - some identical to our prior visits and some entirely new.Simply stated, when I walked into Vetri on 5/26/12 it was my second visit - the other visit, nearly 21 months prior, my favorite Italian meal of all time by a small margin. When I walked out of Vetri on 5/26/12 the prior meal was my second favorite Italian meal of all time - the Maialino, Monk Fish, and Sweet Pea Agnolotti all amongst the best new dishes I ate during my trip through DC, Baltimore, and Philadelphia in May of 2012...and that isn't even mentioning the repeat dishes such as the gnocchi which rank amongst the best ever."], ["Brett F.", "I have to chime in and ecco what it seems many a-Yelper has already said below. Inconsistent food, not worthy of the price tag.With a $155/person tasting menu being the sole option here, you expect to be really blown away. Like gale force blown. Unfortunately, I barely encountered a stiff breeze. You pick dishes from categories here (fish, vegetable, earth and so on...) as opposed to a chef's menu that is just preselected for you. While scanning through the menu to see what struck my fancy, however, nothing inspired me. Nary an item, by description alone, made me hungry. I didn't want to order anything but the almond tortellini with white truffle, and, if I'm being honest, was also better in theory than execution. When I don't want to order everything on the menu IMMEDIATELY, I know something is amiss. Wanna see what I mean? Allow me:// mare caldo// gli sciatt with pear salad// celeriac soup with umbrian lentil// bunet with kiwiThe last one there especially turns me off. But really, did any of that make you salivate and want to run to Vetri? If the answer is yes, then go! Maybe this is for you. Maybe you love it long time. For me, it was a no.  I've eaten at plenty of fancy, schmany, expensive, inventive, creative and beyond restaurants. This just isn't one of them."], ["Jennifer C.", "My husband and I have had Vetri on our \"must try list\" for a bit. We made a reservation for this past Saturday to celebrate our wedding anniversary. This could be one of the most memorable meals I've ever had ... to name a few items, the onion tart and almond tortellini. We also chose to do the grand wine pairing. The choices were spot on! Definitely a nice enhancement to the meal. The service was excellent. Everyone who touched our table was very knowledgeable and able to answer any question we had. Lastly, the space itself is amazing. It is an old home and hence, the feeling you receive when you arrive is comfortable and homey. I would highly recommend checking out Vetri."], ["Mimi W.", "My best friend brought me here for my birthday. It was a really nice experience and the customer service was excellent. They were attentive to details and very friendly. The food was also delicious. I have to say though, I was already full after the complimentary snacks so I was probably not the best to bring here (haha). BUT I kept eating and enjoyed the different tastes and presentations. We were here for 3-4 hours. I am not sure if I would pay that much for this experience since I can't eat a lot in one sitting, but my friend said she would do it again."], ["Revital Y.", "My husband and I were treated to dinner here by dear family that spare no expenses. We received a glass of champagne upon being seated, not sure if this was complimentary or not. However, I am sure that it was a great start. The waiter came over, gave us water, bread, and explained how things work, asked for any food restrictions (which annoyingly we had plenty of; kosher style, pescatarian, no pork or shellfish, and the lucky one among us- my husband- who has none and gets to eat EVERYTHING). Like I said, annoying and slightly complicated but our waiter got it. The food started coming out slowly, steadily, and pretty generously. I have to say, I don't remember the exact combinations of our dishes, but I do remember that the homemade pasta was incredibly tasty and cooked to perfection, every vegetable we had was incredibly fresh, meat was incredibly tender, wine was delicious, and dessert was brought out double, because we got it like that. Not really, because I asked ever so nicely for more macaroons. The service was one of the best parts and the ambiance very nice and homey. Our waiter was hysterical and very personable, the chef came by our table too which is always a nice touch. This is more of a \"we're here celebrating something\" or \"tonight is a special evening\" restaurant. A real treat."], ["Cynthia X.", "My BF took me here for my birthday, and I had such a great (and filling) time! I had been suffering from a lot of arm issues at the time, and the meal made it go away for a few hours! I love how if you go with a group, each person gets a different dish on the item each time. My BF and I shared everything so we got to taste more dishes! and the dishes wouldn't stop coming! I was already so full after the gnocchi / ravioli course. Then, it was followed by more pasta! and meats! (At one point, I was secretly hoping the food was stop because my stomach would literally bust.) I took the petit fours home, and had a delicious snack the next day. 1 star off for the price / plating. Call me a snob, but I just wasn't a fan of the plates / cups they used. Reminds me more of a family style casual Italian restaurant rather than the \"fancier\" experience that I was here for and paid for."]], "Amis": [], "Fiorino": [["Ryan B.", "Fantastic service, incredibly nice staff, and delicious menu! Minestrone soup is hearty and big, and the cheesecake was fantastic. Waiter Brought us out some limoncello which was a nice touch, and was very fairly priced overall. Quaint tiny restaurant though, definitely make reservations - intimate seating right next to your neighbors, lucky we had a friendly couple who were talkative but respected our space/conversation."], ["Jon S.", "Friend and I decided to have dinner here and I called at start of week and made reservation. On Wednesday my friend asked if we could push it back an hour. So I called the place and the gentleman said sure and made it 6:30. On the night of we were running a bit late and called ahead to inform the restaurant and the woman answering could not find our reservation. Seems the gentleman deleted my reservation without adding new time. The woman told us to come anyway and that they should be able to accommodate us. They were able. I ordered the clams with spaghetti my partner ordered one of the specials. Our food came incredibly quickly. We didn't even have time to touch the bread. The spaghetti and clams was alright, but I wouldn't go back for it. The special, my friend ordered, was amazing. It was a stuffed pasta that was packed with flavor. For desert I ordered the tiramisu, after having a delicious one in new York recently I was worried this one would not live up to par, but it did. The flavors were balanced and it was the highlight of my meal! The environment was cozy and quaint and filled with a more elderly crowd. When the dining room filled with patrons it became hard to hear my friend. I would recommend going earlier for a more intimate feel if the idea of a crowd is off putting."], ["Su W.", "This place is officially the best Italian restaurant I have been too. This place is a good for date nights, celebrations or just casual dining. You can easily get dressed up here or come in wearing jeans, both are acceptable and fitting. On to the food...You get complementary bread with marinara sauce. The sauce was literally the best sauce I've had with bread. It was so good that my friend and I finished it all!I started off dinner with the caprese special. To be honest I only came to this place because I saw the picture of the caprese and it looked so good! The tomatoes are fresh and grown in a garden near by. You can really taste the difference between an organic garden tomato and one that has been treated with chemicals. This is a must try dish. For the entree I decided to go with the season scolgio and my friend went with the veal special. The veal dish was creamy and cheesy! I thought it was a little too salty but my friend thought it was perfect. Definitely give this place a try if you're in the area. There's a reason why this place is rated 4.5 stars"], ["Maria-Elena T.", "This is a true neighborhood gem. I am putting it in my permanent rotation!It is BYOB and they immediately helped open the bottle of wine we brought. The evening started with a complimentary bruschetta with diced tomatoes. Very yummy! Then they served a delicious Italian bread  with matainata sauce for dippingI got the grilled calamari for an appetizer. I enjoyed the arugula salad on the side better. My friend got the eggplant rotini, the special that evening. They were amazing and deserve to be on the regular menu.  I only got one bite and it was difficult to hold my fork back. I wanted to get the Branzino special but I was craving pasta.  For my main course I requested a trio of pastas: the gnocchi in gorgonzola sauce, the tagliatelle Bolognese, and the cheese ravioli. Wow and yummy! The gnocchi were like eating clouds. They melted in my mouth. I never met a cheese ravioli I didn't love. The service is personal. The chef visited our table and chatted far longer than an obligatory stop. We liked that and enjoyed his conversation. When it came to them calling us a taxi, they went beyond caring and stood outside to wait for it and hold it until we came outside. The place is small and on a Saturday night, and as expected, packed. I had made a reservation ahead if time on OpenTable so we were good. ."], ["Chris S.", "So, so authentic! Our new favorite place, next to  Modo mio!Seafood salad incredible! Tortellini pasta was unbelievable...can't wait to go back!"], ["Bryson V.", "I have a rule- No Eating Italian Out!   Simply put, nobody can cook it better than I can.  We've been here twice now, both times for date night- and it doesn't get better than this, Frank kills it! The first time we went we sat outside, and enjoyed the beet salad (which was crispy, crunchy, bitter, and sweet).  Beets aren't normally something I'd try, but based on the other reviews I felt like I had to.  I was not steered wrong.  The caprice salad is delicious too.  The mozzarella was fresh + salty, and the tomatoes were dense, and crunchy.  It was perfect. The Main courses were perfection too, and reminded me of everything my nona made growing up.  While I could write an essay on them- I'm hesitant to do so.  All I can say is eat at Fiorino- seriously!"], ["Danita R.", "Gosh I love a hidden wonder, and this li'l nook is harboring some mighty fine food in a super sublime atmosphere. I (luckily) work nearby and finally had the pleasure of popping in for lunch. Everything was delicious. I have to admit that I felt some kind of way about being the only diner in the place who disregarded the BYOB (I mean, it is Monday and I was on my lunch break. Le yada.), but otherwise, the service was exceptionally pleasant despite the sudden rush.There aren't a lot of tables, so it gets pretty cozy inside, but everyone was jovial, and when they're serving food that's so deliciously fresh, how could they not be? I had the soup of the day which was a lobster bisque. I've been on a bisque kick lately and this bowl kept the streak a-flowin'. Rich, creamy and flavorful. I also got the eggplant rollatini, and that. was. scrumdiddlyumptious! Clean and happy plates abounded. I'm tickled to have a new go-to lunch spot in my midst. If you're in East Falls, head on down Indian Queen and stop on in!"], ["D A.", "My only reluctance in giving this review is that more people will learn about this culinary gem located in East Falls. I would prefer it be mine! and mine alone! There is not a thing wrong with this place: the food, the service, the intimacy of a true Italian restaurant - all excellent. AND, It's a BYOB! Franco, the owner and chef de cuisine, makes occasional appearances in the dining room to make sure his offerings are being well-received. Enjoy."], ["Peter N.", "Amazing. Italian. Restaurant.The food here is fresh, prices are reasonable, and it is BYOB!Upon seating, we're presented with bruschetta followed by complimentary bread accompanied with a flavorful tomato based spread.Went here for the first time and I might've gotten carried away with the seafood. But it was well worth it.We ordered the grilled calamari as a starter and it was grilled to perfection. I could not get enough of it.  I will definitely get it again next time I return.For an entree, I had the spaghetti scoglio and it was a plethora of seafood over spaghetti. Personally not a fan of spaghetti pasta, but the seafood was extremely fresh and wine sauce very flavorful. I even found myself dipping the bread into the sauce.... repeatedly.My friend had the Adriatic Salad, which was also very good and carb watcher friendly.  Again, tons of seafood and even lump crab on top, perfectly tossed over a bed of greens.  See the pics attached  - Words can't describe how good it is!For dessert we opted for the lemon cake, which was a special not on the menu.  Moist and paired well with the raspberry drizzle.When we received our check, we were also offered complimentary limoncello!  What a way to end a fantastic meal!The restaurant is located in a somewhat residential area, so parking might be tight.  And seating is very limited (see pic), so I'd suggest reservations."], ["Scott L.", "While everything here was thoroughly enjoyable, I can't say that it was particularly exciting. The highly recommended bolognese fell flat. The eggplant, however, had much more vibrant flavors. The complimentary bruschetta and refilled bread baskets were a nice touch. I particularly enjoyed the tomato tapenade. However, I felt that these, as well as the caprese, would have benefitted from some olive oil of a higher quality.Finally, I was perplexed about the whole limoncello situation. The table next to us received \"the best limoncello they've ever tasted\", yet every other table didn't, despite ordering dessert. What is the deal? Who do you have to screw to get some limoncello??? The whole experience left a bad taste in my mouth."], ["Dan L.", "Howdy Folks!Another impressive showing Friday night from Fiorino. My last visit to this discreet East Falls gem has propelled it to the top of my exclusive Philadelphia Italian restaurant list.First, we made reservations on Wednesday and were rewarded with a great corner table by the window. Next, we didn't see the appetizer we had during our last visit on the menu (prosciutto with mozzarella and tomatoes), so we asked. They knew just what we were talking about and provided it for us. I don't know where they're getting these tomatoes but they will knock your socks off. My GF had the tagliatelle bolognese for her main. It was a very thick and meaty bolognese that paired wonderfully with the thick noodle. I had the veal bocconcini with spinach and mozzarella rolled inside. It was served with some great veggies and shockingly tasty potatoes. Capped the night off with a great homemade tiramisu.Will certainly be back."], ["Trish L.", "This was an incredibly charming neighborhood eatery. Had a delicious lunch here on a Friday. It was empty when we arrived at 1 but others who seemed to be regulars came in later. The salads and pastas we all had were good and the owner was very nice. It did take the food quite a while to come out."], ["Erin H.", "Cute little romantic byob tucked back on a little side street in East Falls. We had several apps, entrees and desserts and all were wonderful!  Some favs are the seafood salad, eggplant rollatini, Branzino and mango gelato. Each dish is made to order so bring an extra bottle with you, it's totally worth the wait!"], ["Matt K.", "I was in town on business and looking for a place to eat relatively close to my hotel, which was not so wonderfully located.   What a find in Fiorino!  I called first, just to be sure they could accommodate one at 8pm on a Monday evening.  The gentleman with whom I spoke told me to come on by.   The restaurant is in a fairly residential neighborhood with narrow streets and lots of parked cars.  At first I worried that I wouldn't find a spot, but there were several just down the block.  When I arrived, I was greeted by a woman who asked if I had just called.   I really appreciated that she knew that, that the man who answered the phone  had communicated about it.  They had a table ready and waiting for me, which I also appreciated.  What a fabulous, quaint restaurant.  From start to finish everything was just great.   The space is small, so the suggestion in other reviews to make a reservation is a very good idea (and precisely what prompted me to call first, even though it was 8pm on a Monday...).  I started with the mussels marinara, which were very good, and I used the fabulous fresh bread to mop up the extra sauce.  Delicious.  There were many wonderful sounding options for dinner and I settled on the branzino, which was cooked very well, and accompanied by potatoes and mixed vegetables.  For dessert I had the zuppa inglese (rum cake), which is one of the desserts they make at the restaurant, and it was fantastic.  I was fortunate to strike up a conversation with Kathy, my server, as she was not only great at her job, but also lovely.   Whenever I'm in Phila I will make a point of eating at Fiorino.  It was truly a fantastic experience."], ["ted z.", "Good local Italian restaurant with Mediterranean flair.Byob makes it even betterGrilled portobello with smoked mozzarella was excellent starter. Wife had caprese salad which was perfect. Entrees were Bronzino with crab meet and the other dish of shrimp and beans were very goodReasonable and CC accepted."], ["Jon I.", "This is my absolute favorite BYOB Italian joint.  Best to call ahead and make some reservations but occasionally can be fit in."], ["Leah H.", "My boyfriend and I went here last night for dinner. My boyfriend is a big Yelp person and had this place bookmarked for a while, so I checked out the reviews before we went and was prepared for a pretty awesome dinner. However, that's not really what I experienced.We were running a little late because of traffic and I called to let them know (which they said was fine). We get there and let the waiter know we had a reservation and then he disappears into the back for a few minutes. He comes back out with a place setting or two and walks past us and I followed thinking he was seating us. But he walked outside to another table full of guests...so I awkwardly went back inside to wait. We were left standing at the front of the restaurant for 5 minutes or more just waiting to be seated. Keep in mind this place is small and there isn't a good place for you to wait so we were just awkwardly standing in the way. We weren't really greeted or told it would be a few minutes...I was feeling uncomfortable from the start.We finally got seated at a nice table, but then sat there for another 5-10 minutes without anyone coming by. We finally got menus and were ready to order but had to wait a while for someone to come by. Once they did, we ordered but then I had to ask for something to drink because they never asked me if I wanted anything. We didn't bring wine since we were heading to the movies afterward, and that seemed to surprise the owner. Once we ordered, our food came out very quickly. It was delicious, I will give them that. But the whole experience was so awkward and uncomfortable. I felt unwelcome and couldn't wait to leave.Not sure what happened during our dining experience since there were so many good reviews on Yelp, but I was not impressed and will not be returning."], ["John H.", "Haven't been here yet but I plan on going."], ["Doris V.", "Had an amazing dinner experience.  Food was excellent. Service was great. Felt like we were dining in someone's home in Italy.  Cannot wait to come back!"], ["Anh H.", "Homey BYOB in East Falls. The food is superb and consistently good. Everything on the menu is fantastic. However, if you're looking for a place to have a conversation, expect to raise your voice. It does get busy and loud. If it's a nice night, just sit outside and enjoy your company. It's definitely quieter."]]}