{"Aya's Cafe": [], "Manakeesh Cafe Bakery": [["Bettina W.", "Excellent food both veggie and chicken.  Plenty of room and nice atmosphere.  Pleased two 50 somes and three vegetarian young adults."], ["Jessica K.", "We went here on a Sunday for a girls lunch and ordered a bunch of different flatbreads, as well as the hummus. The food was amazing! Well seasoned and so delicious. And all for extremely reasonable prices. It's a neat place with high ceilings and colorful decor. I'm looking forward to returning to try more items on the menu."], ["Anthony W.", "Over a year later than expected, I finally got back to Manakeesh. It's a bit different than I remember. There's a juice shop add-on where the soda fountains were. I actually tried to come back sooner but they were closed for Ramadan. So after looking over the menu, I was set on trying some different things that caught my eye. This is what I had... chicken shwarma, chai tea hot, basboosa, and a napolean to go. I had a yelp deal and that stuff came to $20... just over it with tax.Here's why I'm giving 3 stars again. I learned my lesson from the last time, but they didn't. The service was awkward. I said that I wanted a shwarma and just like before I wasn't asked what I wanted on it. I also said that I wanted some desserts so I walked over to the other side. The woman just stayed at the register. I had to flag her down and wave for her to come over. After I chose what I wanted and paid up. I watched the guy making the food (he was stellar) and again I noticed all of the vegetables. So I asked him what comes on the shwarma. He told me and I told him what I wanted... instead. Done deal. I went outside to grab a table. My shwarma came out, but my tea didn't. I had to go back in and ask for my tea. She flat out forgot.The shwarma itself was pretty good. It was my first time trying it. It looked a bit different than what I had seen elsewhere, but it's not a big deal. I definitely want to try some other varieties. The basboosa (semolina cake?) was good... thick and syrupy. It had an interesting texture... a lot like cornmeal. The tea was alright, but I thought it was a bit over priced for the small cup. But I do know chai costs a bit more. Now for the napolean... I waited maybe an hour and half to eat it. And the top layer was so hard it bent up my plastic fork. I had to really let it sit in my hot kitchen for a couple of hours for it to soften up. When it finally did I really liked it, but it was mushed up from earlier. Did they give it to me frozen? What if I wanted to eat it right away?Also, there were indeed paper towels in the bathroom this time. Other than that, a couple brought their dogs to the outdoor patio. I didn't appreciate that at all. Period. Not to mention some woman parked her double baby stroller in front of the patio doors and walked away. On the plus side, there was a shift change while I was eating so when I returned my dishes the new cashier was MUCH friendlier and much less awkward."], ["Nacer M.", "Was there last week the waiter and cashier were cool ..all by a sudden some asshole shows up staring at us and said we close at 9.30..guess what he was the owner of the store ..it would've been better if he said get the fuck outta here...left everything on the table and left ....noooooo more"], ["Rob Y.", "For the past two years, I've always made a visit to Manakeesh whenever I was in town.Food (8.5/10) = I've been quite habitual with Manakeesh, ordering the the Tawook (marinated chicken) flat bread + iced coffee every visit.  If a killer combo works, why change it? I love the flavors of the Tawook.  The real story with Manakeesh are the baklavas.  They make many kinds, but my favorite ones have the pistachios.  Manakeesh probably has the best baklavas in town.  Tried a date filled cookie on my most recent visit to this neighborhood establishment, and it was really good.  Will probably get a batch of baklavas and these date-filled cookies to take with me before I  leave town.  Bottom line, the pastries at Manakeesh are fantastic.Ambiance (8.5/10) = cool decorations from floor to ceiling.  The beautiful display for their pastries makes it hard not to get something.  Service (8.5/10) = great service, and always with a smile.  The first time I visited Manakeesh, I had no clue what to order.  The folks took the time to give me recommendations, and also informed me about the different baklavas they make.  Everything sounded good, and I ended up buying 2 of each type of baklava.Overall opinion = West Philly is certainly lucky to have this special neighborhood restaurant.  It's a sure thing that I will continue to visit Manakeesh every time I'm in town.  If for some reason you want to deprive yourself by only getting one thing from this place, get the Baklava."], ["Ashley G.", "We are a group of 22 collegiate ultimate frisbee players and the staff at Manakeesh were extremely polite and helpful while working to accommodate our large group. The food is incredible with very generous portion sizes. There is something on the menu for everyone and for every meal! We definitely recommend this restaurant and would be dedicated regulars if we did not live so far away (we ate there twice in one day while visiting Philly)."], ["Omnom N.", "I'm not used to these flavours but it was quite delicious!I think the drinks are overpriced though."], ["Farukh N.", "Great food, tried there version of Philly cheese steak sandwich.. It was great"], ["Jerzy G.", "I've been here twice for take out. Both times they messed up my order. The first time I let it slide. The second time I asked for a refund. They refused. So, I did a chargeback. Caveat emptor: if you order food here, and they mess it up, they do not want to accept responsibility."], ["Harold B.", "Other than the pastries and the (admittedly outstanding) fresh-baked pita, the food is trash. Worse, the cashier person is a crook. I was a regular at this place and know it well. One day I was served a plate of old hummus that had obviously been prepared for a takeout order (possibly the day before) which no one had picked up.  I'll be damned if I ever return to this place.Here's the full story of my disenchantment. I was very excited about Manakeesh when it first opened, and I was truly thrilled about the pastries. I tried other food as well bit the greasy flatbread sandwiches gave me indigestion. So I stuck with the pastries and hummus + pita.Receipts at Manakeesh are not itemized and I always felt slightly confused how I ended up dropping $15 on cookies. But I gave the cashier (usually the same guy) the benefit of the doubt... until it became all too clear he has no qualms about lying.The last time I was at Manakeesh, I ordered my usual small hummus, and the guy who's usually at the counter asked if I wanted a large portion at no extra cost. Regular customer appreciation, I thought! So I took it. It came in a takeout plate even though I was eating in. The olive oil on top had congealed and the hummus had a stale crust. That meal was long past the hour when it was due to turn into a pumpkin.--------Added in edit: I appreciate the owner's reply. It may be comforting to some that they would have gladly replaced the hummus. However, being \"kindly offered\" a large portion for the price of a small only to discover that the establishment was using you as a vehicle to get rid of its leftovers is just too much of a slap on the face. I had no interest in amends at this point."], ["Reem S.", "customer service could improve"], ["Antonia G.", "The food is amazing but NEVER order delivery. I keep making the mistake and every time the food is an hour late. I am currently waiting for a delivery, and we have called them twice, both times with the reply that \"it's five minutes away\". The food is great, but you have to go there yourself to get it. Really unhelpful customer service and I'm so hungry."], ["Alex X.", "44th & Walnut, West Philly, PALebanese food.I can see myself moving in here, lounging around in their comfy setting with my laptop. Middle eastern style cafe. Very appealing. I never get the chance to stay long. I found out because of their Bliss counterpart grand opening a couple years ago. A lot of their tastings were free and tasted great at Bliss. Then came back today to just pick up a juice thing for mom. Blueberry pineapple kale and milk combo was my choice for her; she liked it. ;-)  Now I'm reading how they don't wash their fruit, next time Id ask them to please wash the fruits with salt, pretty please, 3 rinses at least. Solves that problems. Im a juicer person so I know the seriousness of washing before making drinks. Lemonade. Too sour for me. But thanks for tempting me. I will only try the lemonade once. Never again. I would have eaten here today but I preordered my Ethiopian food down the block. Didn't realize this place was nearby. I am getting bored of Indian food in Philly, and looking for something new to try. So since  I am not familiar with Lebanese food at all this seems like it's gonna be my new experience. I will eventually come eat here whenever I can parking when nearby and this will be my new hangout. Only thing is, I usually have a place to stay already nearby and my own key. hehe. Well I will visit you anyways Manakeesh! I want to learn about Lebanese food that everyone is yelping about. And because you are so Preetttty on the inside! I like a cafe atmosphere that reminds me of Arabia a little bit."], ["Kathryn L.", "Great food, great service, great decor.I don't even know where to begin in recommendations.  All of their sweets, especially the baklava, are fantastic.  Hummus is great too-- some of the best hummus I've had in Philly."], ["Emily T.", "So much flavor! Manakeesh and baklava are musts. Pick-up time was long and longer than the estimate, but well worth it"], ["A B.", "I have been coming here for a couple of years now. It is my absolute favorite cafe in all of the city. It is inexpensive. You can come here just for the freshest dessert and a sharing pot of traditional mint tea (GOOD crepes, waffles and fruit, mamoul, baklava, smoothies) or for a complete meal (rice, meat, pita, salad, the most delicious hummus ever, and more)There also make espresso drinks. One of the rare places that do a lot and still do it well.The ambiance is relaxing and cozy. It is well decorated, tasteful, but casual. No matter when I go, it is always bustling with mixed clientele from all backgrounds.  It dies down for a moment during prayer time at the mosque down the road. There is also outdoor seating for when Winter finally gives up on harassing us. It's a great place to hang out for hours and no one will judge you if you break out a deck of cards (n case anyone was wondering). There is also free wifi.It is a very successful business, and I hope it stays around for good!"], ["Katie D.", "I like Manakeesh- I've eaten there a couple of times as it is open later than some other restaurants in the area. Today I checked out the market area. I purchased some pita and some candies. While everything there looked delicious (definitely want to try the smoothies) the selection of items seemed very random and slightly sold out. I would come back again but not necessarily just to do my shopping. Plus side, they do have HUGE containers of Nutella."], ["Rachel C.", "Affordable, delicious, vegetarian-friendly. Something for dinner, something for dessert. Coffee, or tea. It's just perfect.A total hidden gem of West Philly, and a must-try for anyone who likes to try cuisines from all over!"], ["Adrienne W.", "This spot is me and my best friend's go-to place to meet up for lunch.  She usually gets the Kafta platter which has lamb, rice, hummus and a few other goodies. I get the salmon flatbread which is really amazing. We also get lattes, usually raspberry and smoothies. There's so many yummy items to choose from that we order way too much and take home the leftovers! The only things I am not crazy about are the spinach and feta omelet which was crazy salty and sometimes the cakes are frozen solid. Still, I go often and leave happy."], ["Rizwan A.", "Well first off this place is conveniently located right next to Saads, and that probably earns them 4 stars alone, but Manakeesh has a number of its own strong points that earn it a great rating. First off-- selection and variety. I'm jumping straight to this because of how much stuff they really have. You walk in and think you're in a middle eastern joint, but they also have a fully stocked smoothie bar. They have teas, desserts, food, hummus, who knows what else, either way, you are pretty much guaranteed to find something you like, especially when despite a menu that's all over the place, the food is consistently great.I had a couple of small dessert items (more like 10 probably) and some sort of special tea, I forget what it was called, but everything was super sweet and fresh, but didn't taste like just pure sugar. I loved it.My friends and I hung out here for quite a while and weren't hassled by the staff at all even after we started being obnoxious (the minute we walked in the door). This is an excellent out of the way place for food, drinks, and desserts with a great atmosphere of laid back people trying to get away from the city hustle and bustle. I will definitely be back."]], "Dmitri's": [["Jen P.", "BYOB! Trendy neighborhood. It gets packed quickly. Food is so fresh, simple and well-done.We had incredible amount of family style dishes.It gets busy fast, so come early."], ["Kylie A.", "This is our all-time favorite BYOB Date Night. We stumbled upon it when another restaurant had double-booked our reservation, and though we couldn't eat at Dmitri's that night, by the crowded tables and the pure smell of the restaurant, we knew we'd be back! Dmitri's hosts a wonderful menu, and lots of off-menu specials that are authentic, simple, and delicious. We usually order everything family style, and share, because it's hard to pick just one thing! The Avocado Citrus salad is delicious; light, sweet with a crunch of almonds, it's a hit for both of us. The \"dips,\" for lack of a better word (hummus, baba, tzatziki), are an excellent addition to the pita on the table. I love the steamed clams, my boyfriend loved the grilled fish. Last time we were there, we indulged in the Branzino, which was quite the treat, and should have been ordered to share between us. Hands down, our favorite. Affordable enough to over-indulge and delicious enough to want to."], ["Shirlana D.", "I have no idea what all the hype is about this place. The restaurant was small and nondescript. The food was only ok. The staff was knowledgeable about the menu but couldn't give much insight to how some of the dishes were prepared. The meatballs were horrific. The waitress actually warned us of such (which should have been a sign) but we proceeded to try them and see. I think this restaurant is also getting hyped because it is in Northern Liberties. Dmitri's is definitely one and done on my list. My pallet can not stomach this place again."], ["Hong L.", "If there were sixth stars, we would give to this restaurant for the foods! We order three dishes every single time: grilled lamb, pan fried scallop and seafood combo. Amazingly well done! Have been travel to many countries, try so many different kind of foods! However, this is the best place with fresh sea foods; not to mention the awesome grilled pita bread to start the meal. Must give them a try to see, my words couldn't describe much. Eating is believing! We live so far away, but always travel the distance when we have a chance."], ["Erin M.", "Dinner was awesome. My only complaint is being rushed out of there after the server got her tip. I'm a server myself and yes it's annoying having to wait for one last table..... BUT when you are being stared at, having chairs put up around you, lights turned on, music turned off and it 9:50 and the restaurant closed at 10, that's a problem. It was rude and unprofessional. So be prepared to be rushed out after she gets her money...."], ["Brittany R.", "I love Dmitri's so much. However, this is not my favorite location. It convenient for me to get takeout from here but for some reason when eating in I prefer the Queen Village location. I always seem to have to wait longer here even though it's the bigger location out of the 2 which is confusing. *Tip- don't go with large parties- or go right when they open at 5PM."], ["Ranita C.", "LOVE! This is the Greek place we've been looking for! The Med plate is a dream and I could polish this off with a bottle of red and be fine. BUT then I'd miss out on the sizzling cheese and octopus. The star of the show? Shrimp Pil Pil (aka shrimp in crack sauce) is legit delish. Forget the dessert (it's a bit meh) and get two rounds of Pil Pil."], ["Lulu Z.", "My number 1 go to spot for Greek food.The shrimp pil pil is to die for!!! When I used live in the area, I had dinner there at least once a week. The restaurant is casual, small and yet romantic and fun.. a great place for dates and any small get togethers."], ["Kate F.", "Really cosy feel, great food. The Mediterranean plate is so tasty and the pitta is unbelievably good. It has a great charred flavour and arrived at our table still warm. I would recommend it for a really nice meal with friends and family."], ["Joe D.", "Excellent overall experience everytime.  The hummus is fantastic and the spicy shrimp are my go too, but they rarely miss."], ["Ryan O.", "Awesome Mediterranean/ Greek place in northern liberties!! It's also a BYOB and the service never disappoints. The menu can be used a family style or just order your own entree and order sides. My favorites are the Shrimp pil pil and the scallops. Their grilled veges and Mediterranean plate is also a great app especially if your have 3 or more people. Just go there and you won't regret it."], ["Rob C.", "We ate here last night-- a warm bright Saturday evening. Four of us. The food was as good as any we've had out recently.  We arrived at 630 and waited about an hour to be seated inside. It was just too hot to dine on the street. We ordered hummus and salad to start-- warm amazing unlimited pita bread. We enjoyed fried smelt, grilled squid (the best we ever had) perfectly char-grilled, lamb perfectly cooked, pil pil shrimp ( a consistent favorite) and a slightly over cooked salmon.  It was undeniably one of the best tasting best values we have enjoyed in a while.One issue-- the restaurant is so noisy that is is impossible to hear conversation at the table and so loud that is is a bit unpleasant. The bare hard surfaces need a bit of sound suppression. As everyone leans in and yells to be heard it only gets worse.  It was the only negative in an otherwise flawless night out. Service was great as well."], ["Amy G.", "I've never left a Yelp review, but I felt compelled to write one and say that although the food is edible, the service is abysmal. I've also never left a restaurant because the service was so disappointing, tonight I did. Came here with a friend to have a meal and enjoy the company and from the second we arrived we were met with low quality service from the staff, with no fault of ours. Very disappointed."], ["Randy T.", "Just moving to Northern Liberties and trying different restaurants. Had a really delicious dinner last night at Dimitri's. Ordered the Mediterranean Platter for the table (4 of us) and it's a great appetizer and more than enough for 4. It came with a generous basket of warm pita triangles and was really yummy. (In fact, it by itself would be a great light dinner for 2...). Everyone enjoyed their main course...fresh ingredients, deft preparation, promptly served. My sautéed shrimp in tomatoes and olives with feta was a little \"taste party\" in my mouth! My husband really likes bluefish and is picky about how fish is cooked - can't stand it to be over done. He said his bluefish special with tomatoes, peppers and onions was just wonderful.We arrived at 5:45 and were seated right away but the place filled up quickly. It is a little noisy but not unpleasantly so. The staff were all helpful and pleasant. We'll certainly be back!"], ["Mike Z.", "I love this place! I live 2 blocks away and have been here 10 times. Ive been here on dates , with friends and with families and have had all good experiences. I always like the service and I always enjoy the chill atmosphere.  Today we ordered sizzling cheese, which is amazing, potatoes which are ok, grilled squid amazing, grilles sea scallops were awesome and I really enjoyed the complimentary warm pita with olive oil.   Also had chicken kabobs they were seasoned and marinated well but very salty. The place is a byob and priced very reasonable. I really enjoy coming here with a bottle of wine especially when its warm outside and we get out door seating."], ["Ade B.", "Nice seafood restaurant. You can order a bunch of small entrees and share them. Unfortunately, one of the entrees I tried was the meatballs, which were awful. At least the waitress was kind enough to take it off the bill. If you stick to the seafood you will have a better experience than I did. The shrimp  pil pill was the standout dish."], ["Larissa G.", "Some friends of mine swear by this place. They literally come every weekend. However, they also live super close, and are kind of those type of habitual people who never try anything new. So, when we made plans to have dinner in their neighborhood last weekend, I knew they would suggest Dmitris. Considering I have never been, I was down to try it. First off, its BYO, which is awesome. (Plus, the proximity to the Foodery is perfect). We brought both beer and wine, and they provide glasses. We arrived about 9pm on a Friday and had to wait maybe 20 minutes, which is not bad considering how small the place is. It was much smaller than I anticipated, and also had more of a dim lit romantic feel than I thought it would have. The hostess and waitress with both very friendly and accommodating. My biggest problem with this place was the menu. It is overly sparse, with just a name for each item (typed in Comic Sans font) and no description at all. I imagine we could have asked the waitress for details, but I didn't want to make her describe every item, so we just picked a couple. My favorite thing about this restaurant was the pita and bread basket that came out with some homemade pesto before the meal. Between the four of us, we split the sampler plate, the lamb plate, the scallops, and shrimp scampi. The baba on the sampler plate was probably my favorite part of the meal, and the hummus was good too, though the lentils were a bit bland. The beets and olives were both okay, but those aren't my favorite anyways. The lamb plate came with some grilled onions and peppers, and it was quite good, but not worth the $17 price tag. The seafood was all just alright to me, but I am not a seafood connoisseur by any stretch of the imagination. Overall, the meal was good and I am glad I experienced it. However, I won't be rushing to come back."], ["Dan S.", "I've been going to Dmitris for 15 years and tonight was the worst experience yet. The Octopus was chopped up into tiny pieces and portion was half the normal size. The waitress brought an additional order, however, it was exactly the same, tiny pieces, over cooked, hard, oil drenched. We didn't complain but only because the waitress didn't approach our table throughout the meal. After paying including a 15% tip ($10) she approached and asked if everything was o.k.. She stated we had been \"given\" an additional FREE Octopus and felt as though her tip was inadequate, that somehow she was  being \"penalized\". My friend promptly offered her additional money and out of shear embarrassment, I handed her an additional $5 cash *which she happily took. Dmitris use to be great but things seem to have changed. Prices are up, everything a la carte and now rude staff."], ["Mike C.", "Table ordered about 8 different items off the menu and they were all outstanding. Service was fantastic and very knowledgeable with recommendations."], ["EricaLynn J.", "I have to hand it to Dmitri's.  We came as a party of 7 during a busy Friday night in the summer and we must have ordered one of almost everything on the menu.  Our waitress was so good-natured and helpful, even when we changed our minds or asked for extras.  A few tips:  a lot of the appetizers come with olives, so you probably do not need to order an olive plate if you have already ordered some appetizers.   The seafood dishes taste wonderful.  Extremely fresh and really just perfect.And it's BYOB!"]], "Marrakesh": [["Carmen M.", "Wow! What an experience! From the start you don't know what your in for which is part of the charm. The building has no windows just a large door with door bell. As soon as u open it your in a dream. Amazing authentic decor... This place has been around and family owned for 40 years. You feel your in someone's home as an honored guest. The service is amazing. 7 courses meal - lucky we were hungry! 1- salads amazing! Loved the eggplant salad the best2- fill wrapped egg with icing sugar AMAZING! So incredible - taste like cake! 3 - spicy chicken falling off the bone 4 - lamb was authentic soft and full of natural flavor 5 - couscous 6/7 - balaclava and fruit By that time your done, I couldn't resist but to dance with the belly dancer... How else can you work off all the food?! Bringing everyone I know here from NY. Worth the train ride just to have this as the destination."], ["Jazmin B.", "This is definitely a hidden gem! Such an authentic experience. It was a group of 4 of us and we made reservations the day before. I was very excited because I had never eaten Moroccan food and always up for something new. When we arrived at this very unique door we had to knock on the door as if we were visiting someone in Morocco. Loved having to do that!!! The man at the door knew exactly who I was.. Not sure how but he did..lol.. We were seated on the third floor which I never expected because from the outside you would never think there is so much space inside. OK.. So as for menus.. There are no menus.. They offer a Prix fixe menu which is a 7 course meal. The food is so delicious and flavorful. Something that anyone who may be somewhat of a germaphobe you eat with your hands however the waiter washes your hands with rose water. It definitely was a great experience and would definitely go back !"], ["Lisa J.", "Wow, this place is so cool. Yelp led us here on a quick trip to Phili and I'm so thankful! This semi-hidden restaurant is a diamond in the rough.Protocol: Make a reservation and bring cash (cash only). When you arrive ring the doorbell and you'll get checked-in. We didn't know about the doorbell and started walking away because the door was locked. Luckily a sweet man let us in and ushered us up several flights of questionable stairs into a Morrocan fantasy.Food: It's a set menu. I liked the first two courses the best, so I recommend eating a lot at the beginning of the meal even though there are many more courses to come.Atmosphere/experience: 5 starsFood: 3 stars"], ["Mariella S.", "This is really an experience, one not to be rushed or be in a hurry to get out of. Let's begin with the fact it is a BYOB with that in mind please pace yourself, not coming from my own experience or anything. The meal starts with a rose water hand wash and towels. You are given a large towel which i chose to just lay across my lap 1. I am clumsy 2. i was drinking 3. you use your hands to eat. Knowing this ahead of time I was a little scared being repulsed by double dipping (as I'm sure most people are) and finger licking but overall its not hard to use your pita in a hygenic way. By the time the fruit bowl came out we were all about to burst but made some room for feeding grapes off the vine. I really had a great time.I love herbs but was a little nervous that everything would be entirely over seasoned, I was pleasantly surprised because each plate was deliccious and I even find myself craving it here and there. This was my first experience with Moroccan food so I had no idea what to expect. My favorite was the baked chicken with the spicy sauce which we ordered on the side just to be safe. Also, the baklava was what dreams are made of. Overall, the food, service, and experience were amazing and super fun. I think this would make an amazing first date. The belly dancer was so fun and friendly. I suggest ringing the door bell versus knocking because I kept knocking and knocking and no one could hear me, i rang the door bell once and they opened the door immediately. It is CASH ONLY so plan accordingly."], ["Michael W.", "This place was one of the most random place I encountered in Philly. I did not expect this at all. It was introduced to me  by a friend. You have to knock the door to put your name on the waiting list and you have wait outside. This place gets packed so either go early or go late if you are not willing to wait more than  40 minutes. This is an experience that you have to check out.  Food:  (4/5)   they have a fixed me $25 menu  and it is 7 course meal.  The quality of the food was very good. Everything seemed to be homemade and it was a pretty decent size portion for two people. App: eggplant cucumber salad and carrots, chicken stuffed wit some pastryEntree:  quinoa , chicken ,beef tenders. dessert: a bowls of fruit and baklava.Overall , i have no complain about the food except that I wish they had more exotic type of desserts and be a bigger portion.  atmosphere:  (5/5)  it is a cozy two place and you can literally sit and see everyone surrounding you.   It is very turkish like.  The decoration is very middle eastern. It flows really well with the food that they are serving. Service:  (4/5)  I have no complain about the service. He was very attentive and explained every item and how the service works in terms of the 7 course meal. His professionalism and representation of the restaurant image was impeccable."], ["Dana O.", "Soooo in the past I have loved this restaurant! Great food and fun atmosphere. Tonight, however, our experience couldn't have been more disappointing. We made reservations for a party of 6 and even called to confirm night of. We approached to find ourselves in the middle of a mob. The party next to us was a group of 9. The party on the other side was a group of 16. A group of 4 pushed passed us, also with a reservation. The overwhelmed owner just let in whoever had the strongest push potential. Talk about survival of the fittest! Love the food but not in exchange for my life. Like Seinfeld says- it's one thing to TAKE a reservation, but you don't know how to \"hold\" the reservation, and that's really the most important part!Off to find another restaurant for a party of 6, 9pm on a Saturday night..."], ["Michelle P.", "Marrakesh is a total package dining experience. Not only do you get to eat authentic Moroccan cuisine, you get to enjoy a cultural experience as well. You may have walked past Marrakesh or the surrounding streets many times without even realizing it was there, like I had prior to this visit. It's nestled on Leithgow Street just a notch off of South Street. Forget South Street or even the rest of Philadelphia for that matter. You are about to step into a different world. To enter you must ring the doorbell on the side door. I felt more like I was going to a house, than a restaurant; especially with the shower located in the restroom on the second floor. During my entire visit, I never felt like I was at a restaurant. I felt comfortable and relaxed. Maybe eating with your hands with a towel on your lap has that effect. I found my group of fellow Yelpers in a cozy private room.  The room had four tables with booth seating along the outskirts of the room. Ottoman like chairs took up the rest of the space for the rest of us. With such a large group in not the largest of spaces, it got loud.Our meal started with customary hand-washing and we were even entertained twice with a belly dancer. After placing our order, the food kept flowing. The service was probably the most unobtrusive service I've ever had. As one dish was placed in front of us, another was seamlessly removed. I felt like royalty or at least someone enjoying a nice meal at someone's dinner party. The regular dining formalities I'm used to were thrown out the window, and it was fantastic! As I'm sure you're aware, this $25 prix fixe menu has seven courses and you are welcome to BYOB. While it was a ton of food, I walked in the door absolutely starving and walked out not overly stuffed. I believe most people left absolutely full, so maybe the tip is to come in extremely hungry. Here's a little rundown of dining experience:Course 1: Three-Salad Platter- The eggplant is phenomenal (and messy). Luckily you have some assistance from the pita to eat it. The cucumbers and bell peppers and carrots and cucumber were good, but the eggplant stole the show. Course 2: The B'stella- As someone who doesn't normally love sweets but loves cinnamon, carbs and meat, this dish was a winner. This dish was dough filled with chicken, nuts, almonds, egg, peppers and onions. It was really hot at first, but once you cracked open the shell and let it cool down, it was easier to eat. I had some pita saved from the first course, so I found it easy to break off a piece and rest it on the pita while it cooled down. Truly a sweet-savory delight. Course 3: Chicken- So here's where the choices began. You can either get chicken with lemon or spicy chicken. My group opted to get the spicy chicken with the cumin sauce on the side. The chicken was melt in your hands and then melt in your mouth good. The spicy sauce had a nice kick without being overly spicy to me. I still had some pita leftover so I did a little dipping with the sauce. Course 4: Beef or Lamb- My table got a little creative here and asked for half portions of both the beef and lamb. The beef was served shish kebab style, and to be honest, not my favorite. It was a little well done, and I struggled a little to get it off the stick resulting in a pepper flying into my husband's wine glass. Sauvignon blanc tastes best with a little pepper anyways, right? The lamb was perfect. Even the non-lamb eaters thought it was delicious. It was tender and took on the flavor of the chick peas and onions without having an overwhelming lamb flavor. Course 5: Couscous with veggies, chick peas and raisins- This was probably my least favorite dish from the main meal. It was a little blander than other couscous dishes I've tried in the past. I would have been disappointed if this was the only thing I ordered, but everything was a hit thus far in the evening. They did give us spoons at this point, so don't worry about eating the little grains with your hands.Courses 6 & 7: Dessert- I'm assuming the tea, fruit and pastries count as the sixth and seventh courses. At this point in the evening, my bottle of wine had been consumed and I wasn't counting the dishes, and am making this assumption while referencing the menu. I'm not a tea fan so I passed. The pastries were little crisp triangles that reminded me of baklava. The fruit came out frozen was a little hard to eat. I nibbled on a strawberry and took a banana for the road since the majority of the group passed on the fruit. Perhaps the fruit was customary, but I thought a little unnecessary. If it's part of the traditional meal then no harm, no foul.  To sum it up, I had delicious food and hours of fun. It's an experience not to be missed in Philadelphia, especially if you go with an adventurous group of friends. While I couldn't imagine going to Marrakesh every Friday night, I can definitely pick a handful of occasions that would be a perfect fit."], ["Kathleen D.", "The whole idea of this place slightly terrified me ahead of Sari's UYE last weekend. For the most part, I'm incredibly picky and also have the tendency to eat veeeeery slowly. Sharing a plate with a bunch of people? Would I get my money's worth?Well, yeah. And more. This was an amazing meal! I even liked the eggplant...for the first time!By the end of the night (shout-out to the lemon chicken and beef skewers and BYO wine and umm everything else), I was beyond stuffed and happy.Thanks, Sari, for putting this Yelpy night together, and thanks to the Marrakesh team for being so hospitable to our group! I'll definitely make it back to this great spot at some point in the future."], ["Gerald S.", "I am normally not a fan of prix-fix menus, as they tend to be too limiting of choice, and suggests a kitchen unable to handle more options.  But, when that standard menu comes in 7 courses with additional vegetarian alternatives, and is packed into a Bedouin's tent of a restaurant, complete with belly dancing, baklava and honey tea, I can make an exception.  This is multiplied many fold when your 40 closest friends are packed into a carpet clad room with barely enough room to sit down, and an ambient noise level loud enough to make talking to anyone but those right next to you impossible. Yet, with enough wine and North African music to alter consciousness, this becomes an all-consuming environment that transports you out of South Street and into the dark, mystic souk casbah of one of the ancient cities of Morocco. Marrakesh takes finger food to the ultimate.  From cool salads, to roast chicken, cumin lamb and grilled beef, cous-cous with veggies, the only thing between your fingers and the searing meal is the thin pita used to pinch, lift and stuff in your face.  Failing that, be prepared for first degree burns.  The large metal serving trays kept coming with more food.  We all appreciated the concession to the use of towels to cover laps and wipe hands. Some of the braver souls accompanied our graceful dancer as she gyrated her hips, abdomen, shoulders and arms with cymbals ringing. Some of our folks really knew how to move.  Impressive.Stepping back out onto Leithgow Alley after 4 hours within this transporter, it took a few moments to reorient myself to being back in Philadelphia after our wild ride.Marrakesh is not just a restaurant, it is a magic carpet."], ["Dana S.", "Food: The food was amazing. I went with a party of 5 which seemed to be a great size for this dining experience and everyone of us loved the food. We were all first timers at Marrakesh and we also had never tried Moroccan food and we were all pleasantly surprised by how tasty the food was. Standout dishes: the salad (omg so good). The chicken. You can order the chicken mild or spicy or get the spicy sauce on the side. It was amazing and tender. The kabob. We tried lamb and beef which were both very flavorful. The lamb was literally falling off the bone. I highly recommend the lamb. Fresh fruit at the end. Who doesn't love fresh fruit?  You get a total of 7 courses so pace yourself.Ambience: The restaurant is very intimate. It feels very exclusive especially because of the location. It's technically a street but it feels like an alley way. I've literally walked by this street maybe 200 times and never thought anything of it. They have (I'm guessing Moroccan) music playing which is very ear friendly. The design of the place alone is enough to make you want to go back. It's beautiful. This place makes you feel like you're right in Morocco.Service: The people who worked there were so pleasant and hospitable. Great service.They are byob so take your choice of beverage and you will surely enjoy yourself. The price is $30-35 /person"], ["Komal D.", "This place has it all. Fantastic experience, food, atmosphere, and service... and its BYOB too! Located in an ally, you really have to know where you're going. You must knock on the door (i felt so VIP) and then they'll welcome you in. Once you're inside, the place opens up. It felt like I was in Marrakesh - low tables, couches, pillows, and beautiful decor. Someone [the owner maybe?] explained the courses to us and even adjusted the menu because we weren't eating red meat. You start with washing your hands, and then they give you a towel to use throughout the meal. FYI: you eat with your hands, don't ask for utensils. 1. Started with veggies and pita. There are three kinds [eggplant, cucumber, and carrot] and they all taste so good and so different. 2.Flaky pastry covered in powdered sugar and stuffed with chicken and egg. This plate came out piping hot, so it took a while for us to dig in. It was a nice mix of sweet and savory. 3. Spicy chicken.. dare i say it?? BEST CHICKEN IN THE CITY. Its fall off the bone, tender, packed with flavor and spices goodness. I could have jussst had the finger lickin good chicken for my meal. 4. Hummus - this was the replacement for the lamb/beef kabobs. It tasted like authentic hummus. None of sugar and random flavors. Simple and delicious. 5. Cous Cous - I'm not a fan of cous cous, so I can't really give an good review for this dish. sorry!6/7 Baklava, Fruit, and tea. - Baklava was a 5/5, i dont think there is any place in the city that has something that even taste close. The fruit was a little bruised, so we didn't go for that. And the tea was hot, sweet, and a perfect way to end the meal. Rose water: simple, sweet, delicious drink. Very Moroccan.  A nice way to clear the palate in between dishes. To sum it up.. try everything because its good. Pace yourself, relax... its A LOT of food. and most importantly, enjoy the experience!"], ["Bill M.", "Five stars for what was probably the best UYE ever (and I say that as a former host of many!)! But in a lot of ways I could also give five stars for Marrakesh being one of the most unique and sightly secretive dining experiences in all of Philly.I've long heard the legacy of what it had to offer, and was ecstatic the moment that I heard that Sari had it potentially lined up as a UYE Destination. And it didn't hurt and most assuredly confirmed that i'd be going when I heard that my friend Anastasia was to be the belly dancer for the evening.When I arrived I somehow discovered a new part of a Philly area that I've been familiar with for decades, and almost couldn't even figure out how to get through the front door. Yet when I did and shuffled my way up the stairs, not only did I come across a plentiful room filled to the brim with Yelpers, I came across the West Philadelphia Orchestra getting ready to play a party across the hall. Marrakesh is just one of those places!For $25 plus tax & tip we all had our hands washed in rose water, were handed sufficient towels per Hitchhikers right; and were served some five plus courses of succulent chicken served as both spicy whole and baked into filo dough, savory lamb, hummus, many salads, delicious injera that served as our forks, and then some. While I've had better in similar packages, it was delivered in a tasty and extravagant fare that made it something to be experienced. And they also made sure that the vegetarians and vegans of tour group were presented with an equal amount of courses.It could be the fact that we were a party of 25+, but the one slight flaw was that the room layout did feel like things would be cramped even if we weren't that large of a party. But it could have also just been the fact that my friend was delivering a tremendous dancing performance and calling for people to learn, and many people were calling my name to join in, I could hardly move because I was trapped in the lavish corner. If you plan on or expect to dance be prepared to sit toward the end of one of the tables, and get ready to savor what might be the best interactive dining experience that you can get in Philly."], ["Nick V.", "Gimmicky, not clean ... your feet stick to the floor. Over crowded ... Fire Hazard, where is the Board of Health/ Philly Food and Safety Inspectors to force this place to upgrade some things ? Food is mediocre.  Where are we in the US or a third world country."], ["Natalie K.", "I thought this place was a lot of fun! Another BYO gem in Philadelphia. I went with a large group to celebrate a friend's birthday and I will say what makes the meal is the experience that goes along with it. FOODThe meal is something like 9 courses (it's possible I lost count somewhere along the way) and they have vegetarian options to substitute for each course. I thought the food was pretty good, although I could have just eaten the first course of hummus and dips the entire night and been extremely happy! There was a great fruit platter right before dessert, which was baklava (YUM)! Truth be told, I preferred the vegetarian options! I thought the whole meal was really well priced - $40 for the meal+tip and we were stuffed at the end!EXPERIENCEThis place is well decorated to make you feel like you've been transported to a different place. The walls and ceilings are covered in fabrics that made me feel like I was at someone's home enjoying a delicious meal. The seating is kind of low to the ground, which is comfortable and find. The restaurant itself appears to be an old fire house converted into a restaurant as there was a pole on one floor and the dining area was broken up into separate rooms without doors. It was nice though because it made the experience a little more intimate. They have belly dancers that go throughout the restaurant and dance with each table - I thought that was a great touch!TIPSThere are two seating times and you will definitely need a reservation! Make sure you plan your visit here in advance, especially if you have a large party. Leithgow St can be difficult for cabs and ubers alike to find so have them drop you off at South and 4th and walk down South towards 5th - there's an alley on the right hand side of the street and that's Leithgow. Walk down it and the entrance is on your right."], ["Huamei Y.", "Came here for a friend's birthday celebration a few months ago. I felt like I stepped into a different world. Every room was decorated head to toe with beautiful rugs and fabrics. It was kind of dark but it set a mystical ambiance.The waiters came around with jugs of water for us to wash our hands with. There was an intricate 7-9 courses (couldn't keep track after a while). My favorites were the chicken, which was SO juicy and spicy, the lamb, slightly sweet and incredibly tender, and the pickled vegetables, can't get enough of it all!Did I mention the bread??We also had a belly dancer come in and dance for a segment. Overall an unforgettable experience that I couldn't believe I was in Philadelphia on south street. I hope to experience the real Morocco one day :)"], ["Elizabeth H.", "After frequenting various Moroccan food places for the past two decades, I've come to the conclusion that no place will ever be as good as the old Alkimah on Route 70 in Cherry Hill.  That fact aside (tearful emoji), Marrakesh is pretty on point!  The ambiance is appropriate, the meats are flavorful and fall off the bone, and salads are savory and delicious, and the baklava is dripping in honey.  The couscous course needs salt, especially after all the fully flavored previous courses, and the B'Stella is not the best I've had -- but its hard to hate on chicken, egg, and powdered sugar in phyllo in general.  The pita is usually veering towards stale.  The best part of this place besides the salad and meat courses is the experience factor.  If you haven't experienced floor pillow/rug sitting and eating somewhat exotic spice combinations with your hands, you should."], ["Charlene U.", "I've been to Marrakesh twice, and both times I left stuffed.  This place is a very social experience since you are sharing plates and eating everything with your hands.  The tables are also very close together.  It's fun to come here with a small group.  From knocking on the ornate door on one of South Street's side streets to the dark and cozy ambiance, the place has an air of mystery about it.  The servers were very friendly both times I was here.  If you are intimidated by having to eat seven courses, you can have your leftovers wrapped up.  My favorites were the eggplant salad on pita at the beginning, the spicy cumin chicken, and the tea at the end.While I do agree that cash only is a pain, the food and dining experience is worth making sure to hit up an ATM on your way.  Don't forget to pick up a bottle of wine as well, since it's BYOB.  If you have any friends coming from out of town, this is a nice place to take them on a weekend for dinner when the belly dancer is there."], ["Paul C.", "It was a cryptic and memorable Friday night (in early April).Walking down (dark and shady) Gaskill Street on my way to Marrakesh, I already felt as if I had been transported to sequestered residential alleyway in a Moroccan town. I kept looking back after we turned the corner because I literally thought that someone was following my friend and I. At last, we spotted the green Marrakesh awning and spotted some men chatting while grilling meats under the bright outdoor light. They instructed us to use the side entrance on Leithgow.We knocked on the door twice. A few seconds later, somebody opened the door asking if we had a reservation. \"No,\" I said. He let us in anyway.We were seated immediately (because this place is TINY). Then, we realized two things: 1) that this place was cash only (which is always a huge turn-off), 2) that the only dinner option was a 7-course menu. We deliberated for a few seconds, and decided that we would stay for the adventure. I'm glad we did. My friend ran to the nearest ATM to get some cash. Meanwhile, I had already started digging into the first course before he returned. We still joke that we think we were already 50% full after just the first course. There's unlimited pita bread (throughout your meal, not just the first course; they actually encourage you to take a handful each time) and massive servings of very filling eggplant, mint/carrot and cucumber side dishes. I think the second dish was the olive chicken dish, which was so amazingly tender and well-flavored. If I recall correctly, that's the only course where you had the option to choose between two dishes.A few minutes pass. Everything is kind of hazy in my mind after the second dish because we both gradually slipped into a massive and serious food coma. We literally just slouched there and thought \"OMG... how much more do we have to eat. My stomach is literally about to explode.\" It's not like we could take it to-go. There was even a belly dancing performance somewhere in between. Desserts came and we breathed a sigh of relief.Everything tasted really good. I've never had Moroccan food before this, but I get a feeling that everything tasted relatively authentic. Some of the textures and tastes are a little bizarre for the American palate (like the scrambled-egg like dessert). Nonetheless, it tasted good and that's all that really matters.Here's some things to know before you come:- It's cash-only. There's an ATM at the restaurant, but, of course, you never want to fall for that trap.- Come with more than one other person! I saw two other groups that were just two people, but trust me, you will start to feel uncomfortable by the third or fourth course and it's not a pleasant feeling. And definitely don't come here alone. I would say 3-5 people is a good party size.- Be prepared to eat with your hands. Utensils are not the norm here.- The ambiance is wonderful. It's like a little piece of Morocco that made its way to Philadelphia. With that said, it can get kind of boisterous. - Service is great.- Generally quite affordable. My friend and I ate like pigs and we still paid like $30 each. They also pre-calculate the gratuity for you, I think, so you just pay the amount that's on the check."], ["Jennifer M.", "I've done the Morroccan experience before, so I knew what to expect. Our group of 8 really enjoyed our time here, especially since we had some first-timers. We came well stocked with wines and beers to supplement a multiple course dinner!After covering ourselves in towels and washing our hands, it was time to get down to business. Towels were great since eating with your hands is not an easy feat, at least not for me. Course after course, we indulged and explored new and interesting tastes. We all raved about the first 3-salad course of eggplant, carrot, and cucumbers. Don't hold back on the pita. Grab 3 or 4 because you'll need them to help grab the veggies! The second course of B'stella was great! By looking at the towels around me, this was the messiest dish. The third course of spicy chicken literally fell off the bone, and was very flavorful. It came out super hot, so the pitas that came around helped. For our fourth course, we chose the lamb with almonds and honey over the beef. The lamb did not disappoint, and the honey definitely added just the right amount of sweetness. By this time, all of us were stuffed, yet we had two more courses! The couscous was probably our least favorite since it had to follow some strong dishes. Thankfully, the fruit and delicious mint tea helped slow things down. Baklava was also a nice treat, thought it wasn't anything to write home about.Overall, I'd recommend this place. For date nights, group dinners, and large celebrations. Since it was such a large feast, perhaps slowing down the pace will help! Service was friendly, and since we were there during the weekend, we did get to see a few belly dancers pass through. You'll know they are coming when the music gets louder."], ["Carrie L.", "S. Leithgow Street - you are REALLY shady!  My friends and I had to double check to make sure we are heading down the right street (really, an alley).  At the end of the block, you will find yourself in front of a locked door.  Ring or knock, someone will come get you.The interior is really awesome.  Carpets and fabrics covering almost every inch of the place.  As a courtesy and tradition, they bring over a basin to wash your hands.  You will be eating with your hands, no matter how hot the food is - so wash and burn away!The seven course meal started out with a great trio salad:  cucumber, carrots and eggplants.  With our unlimited pita bread, we did our best to pinch and scoop.  I would've preferred the pita bread to be warm/fresh.  At first, I wasn't very comfortable leaving my cold pita bread on the table with no plate - but as you keep digging in with your hands, you can't help but shrug it off.  My friends and I killed the salad, and regretted it almost instantly.  First course out of seven, and we didn't want to be too full for the meat!The second course was a chicken and egg pie with powdered sugar and cinnamon.  It was sweet and a little salty/meaty.  Not to mention hot!  It took a lot of burning fingers to get the first few bites.  This was a hit or miss - I just didn't know how to appreciate it.The third course was chicken (spicy or not spicy, your choice) and the fourth course was beef or lamb, your choice again.  My party got the spicy chicken and lamb with honey and almonds.  I was looking forward to the spicy chicken from the start.  It was tender and juicy, some spiciness but not much.  However, my surprise of the evening was the lamb.  Prior to its arrival, I told my friends how I can never tell if I would like a lamb dish.  I can't do the strong game-taste.  Boy, this lamb dish is as mild as you can get!  The honey and almonds (not overpowering) is actually great with the lamb.  I also love that it's the lamb on a bone, tendons and all the meat-fallen-off-the-bone goodness!After that, it's couscous with vegetables - almost tasted like vegetable soup.  Then fresh fruits and baklava - was told it tasted like diabetes so as a person with no sweet tooth, I declined.Marrakesh - we missed the belly dancing but the place was cozy and exotic.  I felt like I was far away from Philadelphia.  It was a great experience and excellent seven courses.  However, I don't think I would be returning unless the menu changes up often.  The only thing I would miss is the lamb course - and I didn't see that coming."]], "Barbuzzo": [], "Sahara Grill": [["Tyler R.", "Sahara Grill is unassuming in its decor, but it's a solid Middle Eastern/Mediterranean restaurant in Center City, Philadelphia. I've been here a half dozen times or so for sit down meals and another half dozen to pick up lunch orders.  First, they have the best, smoothest, rich hummus of all the restaurants I've visited.  It's $5 for the hummus and pita to go.  Try it, and you'll probably go back for more. As far as the food goes, I love their falafel sandwiches, baba ganouj, and kibbi (ground meat, pine nuts, and seasonings inside a crispy fried wheat shell.  The foul madames is like the hummus (atypical as the fava beans used to make it are typically whole in places like Egypt), and it's also tasty.  But, if you're looking for a full sized meal, you should try the chicken shish taouk or the shwarma.  Both are seasoned well and bring tons of flavor.  The bottom line: I'll be back for the hummus definitely, and hopefully for a sit down dinner in the near future."], ["Andrew H.", "4.6 stars. The hummus was very smooth and tasted fresh. It may have been the best I have ever had. The chicken shish kabob was well-seasoned and perfectly cooked. The spicy lentil soup was quite good. My friend's shwarma was dry and the baklava was small."], ["Sara A.", "Three stars only because I have yet to branch out beyond the delicious hummus. This place is around the corner from my job and when I need a quick snack, I go right to Sahara for some hummus and pita. You can tell that it's freshly made and they always drizzle it with some olive oil before packing it up so I can take it back to the office.  They're also very generous with giving me some extra pita slices."], ["Suzanne S.", "I have been to Sahara on several occasions and must say there are only a few stellar items on the menu. Everything else just isn't up to par. First of all lets talk about the warm and friendly attentive service-oh wait, that was at another place. The owners and staff need to be more welcoming and refining in greeting people, checking up on people and refilling drinks. On to the food. The best things Sahara has to offer are the Tabbouleh (Parsley Salad) and the Shish Taouk (marinated chicken breast). These two items are outstanding and the only reasons I come back to this place. Everything else is just MEH. The Hummus-I can make better The cucumber yogurt salad-horrible The rice-mushy The pita bread-could buy better in a grocery store. All in all, if you want Arabic food, this is the closest and sadly the best that you are going to get. If you know of other phenomenal Arabic restaurants in the area-please please let me know about them."], ["Steve H.", "I am in town for a conference and looked forward to being able to get whatever kind of ethnic food I wanted. Having lived in ATL, I got used to this, but Las Vegas is an entirely different city, food-wise.I had pizza from Giannfranco's (eh), Indian 2x at Minar's Palace (OMG YUM), and Dinics (overrated). Last dinner of the trip, looked like my best option was Sahara Grill. Next time, I will venture into Chinatown and the Italian Market parts of town. Anyway, I am Lebanese and grew up eating my grandmas and then my moms Lebanese cooking, which was fabulous. As an adult, I learned that Middle Eastern Restaurants wont quite match up, but thats fine they can still be great.I ordered 2 sides of kibbe, 1 hummus and some yogurt. The kibee was very good -- it is the fried football-shaped variety, not baked. I believe that it is made with a hint of cinnamon (like my aunt makes). I prefer baked non-cinnamon, but this was still really good. I slathered the (bagged) bread with yogurt, plopped on a couple pieces of kibbe, and went to town. The hummus was delicious too.Based on all that, I feel comfortable recommending this place. If I came back to Philly and stayed in the Market East area again, I would go back and eat in."], ["Steven C.", "The description says home-made and it definitely tasted homemade. For apps, my party shared the Tabbouleh which was super yummy and refreshing at the same time. There was a lot of parsley but it wasn't overpowering at all. The complimentary pita bread is able to be stuffed like a pocket which is handy for apps and main courses.My main course was the Kibbeh Platter, which I couldn't get enough of. It was like a meat version of falafal (with beef and lamb!). This platter came with hummus which is also very delicious, so I stuffed my pita bread with the Kibbeh, hummus,and the tabbouleh and I was in HEAVEN!Another in my party had the lamb-kebab. It wasn't all that great, a little dry and the rice wasn't all that great either. Also, when we got our check, the prices for the individual meals weren't listed... I didn't complain, just paid the bill... I was too happy with my meal."], ["Jack W.", "Mediocre food, bad service, ridiculously overpriced. I ordered the mixed grilled platter, which consisted of 6 tiny pieces of meat, along with a somewhat small amount of rice. The meal was $15, which is about $7 too much. In addition, they attempted to charge me $16 for this embarrassment of a meal. I would never fathom going back."], ["Raj Y.", "This is a good place near Philly City Hall. I was in Philly on business and stayed at the Residence Inn near City Hall and this place was a quick walk from the hotel. They offer Lebanese food and is Lebanese owned. We ordered hummus and foul madammas. They came with pita bread. Foul was alright, hummus was fresh. My wife ordered chicken shawarma and I went with Couscous with chicken. The food was delicious - 4/5. I am cutting a half star for the shabby restroom. They need to re-work their restroom. In Summary - Food was great, restoroom was bad"], ["Jamie D.", "Sahara Grill is a quaint little place right off the Walnut-Locust stop of the Broad Street Line.  We were seated immediately for lunch.  The menu isn't extensive, but there are definitely some tasty options.  I went for the Hommus and Feta Falafel Sandwich, which is actually a pita wrap.The Sahara Ice Tea is iced tea that has minty flavors too it.  Refreshing, but probably won't get again.The sandwich was really delicious and incredibly filling.  The falafel was perfectly crispy and bursting with flavor and had a lot of amazing textures with the hummus and feta.  This was definitely worth the price!My only complaint with the place was that the waitress didn't fill our waters once even though we had gone through it before our meal even got there...but she may have assumed I didn't need it with the tea?  I had to ask for a glass after our meal was finished and it took a really long time for her to bring that and the check.Will definitely be back!"], ["Nabeel A.", "Philadelphia is an amazing town. What makes it amazing is its culture, love for arts and amazing variety of foods available. On my recent trip to discover Philadelphia I came across Sahara. It was late and I decided to take the meal home to share with my family. I ordered Kibeh, Falafel, Hummus, Kafta Kabab and Beef Shawarma with rice and salads. The person who took my order was friendly and told me it will be about ten minutes.I waited outside the restaurant and took some pictures of the downtown area and a man playing his saxophone on a street corner. The weather was beautiful and the evening was just right. I picked up my food, stopped a cab and went back to the apartment I was renting in Chinatown. The ride took about 5 minutes.The food was hot and fresh. The Hummus was really good. Falafels were hot and fresh. (This won me over as most of the restaurants who sell falafel sell some reheated, refried version and that really sucks!).  Kafta kababs were tender and moist. The only thing I didnt like was probably Kibeh but everything else was made to the order and tasted very fresh. I would probably give them 5 stars if they had fresh bread as some mid-eastern restaurants do. My order came up with a bag of store-bought pita bread. Overall, great food, great location, great service."], ["Brad P.", "Traditionally, when asked to sit at a restaurant, one should expect that a waiter or similar entity should approach within a few minutes in order to get drink orders or answer questions.  This did not occur.  We were seated and then ignored until we approached the register to place our order.  Honestly, this isn't a big deal but I figure it is worth mentioning as an addendum to the other service complaints.Their mango juice is pretty darn good and their chicken sish taouk sandwich is large and satisfying.  It was a little light on the sauce but that is forgiveable.  Sahara Grill is a fine place to go for a relatively inexpensive, decent lunch in the area.  If you have someone visiting from out of town and they say, \"I want a lunch that's just like other mediterranean places I'm used to.  I don't like when people get too zany with their cooking\" then this is the place for them!On the action-movie-parallel-satisfaction scale, Sahara Grill would be Arnold Schwarzenegger's Collateral Damage."], ["Juliana K.", "Pretty good. I just got a Hummas Platter. Good Price ($9.95 plus tax).  The Hummas was delicious!!! Salad was pretty normal. Falafel was a bit disappointing as it was dry and cold."], ["Anannya T.", "Excellent, very reasonably-priced food and very nice waitstaff.My regular is the grape leaves platter (which comes with their AMAZING hummus as well as a salad).  Once, I'd gone with a group of friends and we'd ordered the two large appetizer samplers (whose names I cannot recall) as well as entrees.  It all vanished within minutes."], ["Raffi M.", "A perfectly serviceable middle eastern place for an affordable and casual meal.  There were real problems with some of the dishes (I didn't like the hummous very much, and the falafel was off somehow) but service was friendly and quick, and we more or less enjoyed what we had.  Order the Sahara combo mezze platter for a nice start to the meal."], ["Danan R.", "This is halfway between a cafeteria and a sit-down restaurant.  There is decent seating and your food is brought out to your table but you order and pay at the counter.  There should probably be a sign stipulating that all orders are taken at the register otherwise they might wonder why there are customers sitting at tables looking around with confused looks.Foodwise, this was just okay.  I got the chicken taouk platter, which came with salad, rice, pita, grilled vegetables, and 1 kebab for ~$13, including tax.  The chicken was adequately spiced but could have used a bit more sauce.  The rice was topped with some almonds, and was pretty good.  Salad was very bland and tasted like it had merely been spritzed with a tiny amount of lemon juice and olive oil and a scattering of spices - definitely could have used more of actual dressing.  The pita was...well, a pita, although I think that it would have gone nicely with some hummus.  The portion size is pretty small, and probably wouldn't have filled anyone besides me up.  Maybe if they added a kebab?The restaurant itself is very clean, with an open kitchen, and the overall experience was adequate for a quick, inexpensive lunch place.  It's good for those of you searching for a traditional, middle eastern lunch without any twists."], ["Calvin H.", "Yum-o. Came here with a friend who knows her food and has been here several times. Her judgment didn't fail me this time. I got a chicken shish taouk sandwich Lebanese style. The chicken was tender and flavorful and the fries were a nice touch. My friend was right that this place does not do \"American-style\" portions but the sandwich was more than enough. -1 star for very slow, hard to reach service, though they were nice enough to split our check in three."], ["Erine K.", "This is our go to place for fresh lebanese food. The best dish on the menu is actually several: the combination of appetizers and grilled meats. Its about $50 for 2 people  but so worth it.  The yogurt drinks are also very good."], ["Mariam Z.", "Overall our food was ok."], ["Andrew C.", "Good value, excellent food and reasonable service. It feels like some of the more negative comments below are coming from foodies looking to show off but if you're looking for tasty, honest food, you should check this place out. Me and my wife having been coming here for ages and we've never had a bad meal."], ["Sara A.", "I stopped by here after running a few errands to grab tabbouli salad and a kofta kabob sandwich to go. Both were delicious. The food here is very fresh and made to order. Also, the customer service is outstanding. The owner greeted me and offered me complimentary mint tea while I was waiting! Its great to find small business owners who place an emphasis on customer service. 5 starts for both customer service and the quality of the food! Hands down the best Middle Eastern food in Philadelphia."]], "Ariana": [["Rissa V.", "Not even having high expectations before sitting down to eat here I left very disappointed. I am not sure how this place has 4 stars alongside some of the top restaurants in the city that actually can stand up to a 4-5 star rating. This is your average plain afghani food. The dishes are overpriced and lacking a smack in your face seasoning. The \"traditional bread\" they served? Dried out focaccia. The lamb in both dishes were small overcooked chunks barely a servings worth with a heaping pile of unseasoned u aromatic rice. This just made me crave an experience from Tiffin or Ekta where at least their prices equaled the amazing flavor explosion in my mouth. Even with the nonspicy dishes. This restaurant is to Afghan what American Chinese food is to China. Oh and their \"traditional\" yogurt drink tasted exactly like Wallaby vanilla with some rose water mixed in. I should have just gotten a lamb gyro across the street And saved $75."], ["Dana S.", "Daughter and I liked the food. The place is small. Its also expensive compared to other places."], ["Sed J.", "Highly Recommended I visited here from California seeing family one night we planed to go and eat outside and we found out about this Ariana resturant  to be honest We really liked this place very nice people the owner I met Mr Sultani was very nice and very friendly guy with two other boys they served us the food it was so yammy   We liked the Qabili rice the Kobida grilled chicken everything was awesome 5 stars"], ["Nimmmy A.", "With high expectations I entered this restaurant  last week, only to find that it was just below basic Afghani food that's overpriced I was fairly disappointed in the service as well as the quality of the food. It did not match the price however the other customers that walked in later received food before we even got our appetizer. The service was awful we barely saw the waitress. I suppose they were more of the regulars so they were treated a lot better. The fastest time the waitress came to us was when we left the money. Don't bother coming here it's a total waste of time because you'll never be attended to"], ["Komal D.", "Came here with a group. Good food. Sambosa was delicious. Chicken kabobs were great and flavored nicely. Friendly staff. Good place to try out afghan food"], ["Michelle C.", "In one of the more random moves ever, some friends and I ended a weeknight out at Ariana. There were several tables filled with people who appeared to be regulars, and I got that fun feeling like I had stepped into a cool, secret spot. That doesn't happen often. I liked it!I had enjoyed a peach hookah once before at another establishment and no one seemed to protest at my suggestion, so that's what we ordered. It took a few rounds to really get going but once it did - hiyooo! Some felt the buzz more than others (that would be me, the lightweight), but it was pleasant and brief, without any weird side effects.We thought the place was open pretty late but the check was dropped at our table shortly after midnight and we got the vibe that it was time to go. Next time, I'll make sure we have enough of a time cushion to finish up before feeling like we have to split."], ["Frank L.", "It looks pretty sure, but don't look fools deceive you. We came here to eat dinner and it took about 45 minutes to receive our food.This restaurant was not worth the expensive price. 3 dishes for $65? Outrageous, the quantities were terrible, the service was terrible. Will never eat here again. The hostess was rude and tended to the only other customers in the room. She intentionally ignored us and our food came 45 minutes after the order. It was barely anything on the plate. he food was terrible and as apart of this culture, I could have cooked most of this food at home for under $10.The quickest she came was to pick up the check, did not tip more than $5. No good service, no good tip."], ["Sarah P.", "Love this place. It was the first time I've tried Afghan food, and it was amazing.The waitress was very nice and checked on us regularly. The inside is very intimate even when it's crowded. It's BYOB which adds to that feel.We came on a Saturday night, and we were ready to leave around 1am, and people were still coming in, so it's definitely an awesome late night dining place.The food was yummy and although you have to tell the server if you want your food spicy, I wish that mine was spicier.We got 2 hookahs and they were both clean and properly prepared (which is oftentimes an issue at restaurants).Overall this restaurant is great and consistent and I've been back several times since."], ["Vanessa W.", "Walking into Ariana feels like being invited into your extremely cool friend's living room. Beautifully ornate rugs, padded chairs, colorful wall hangings, sweet shisha smoke hanging in the air, delicious smells wafting from the kitchen, and a hip, diverse crowd in deep states of chillness and relaxation. It is an unpretentious, thoroughly warm and welcoming oasis from the madness of Old City.I had two great friends visiting me in Philly for a weekend. After a nice day of walking around the city and checking out the Mütter Museum, we decided to take a breather with a movie at the Ritz and then have a late dinner. Around 6:45, I called Ariana to ask if they took reservations. They did! And yes, they could seat the three of us at 9pm on a Saturday. Score!It was an easy walk from Ritz at the Bourse. We walked in and were welcomed by a lovely, smiling woman who, it turned out, would also be our waitress for the evening. Our table was spacious and comfortable (those padded, upholstered chairs!) and we could tell right away this would be a great place to while away the evening.One of my friends had the pulao with chicken, which turned out to be this intoxicating blend of sweet, acidic, proteiny and savory. It was excellent. My other friend had a chicken kabob and was very happy with that. I had a dish of split-pea daal topped with lamb stew. It was incredible, and the quality of the lamb was top-notch. Oh, I almost forget that we also split several appetizers, different varieties of dumplings, and those were extremely good, as well. My favorite was filled with fresh chives.Afterwards, we smoked a hookah. The hookah pipes are attractive and clean, and there was a ton of shisha in there. We ordered a second coal but we finally had to end up leaving unsmoked shisha because we were all starting to feel a little light-headed! The shisha was good-quality and delicious. I should also say that the air had the light smell of sweet smoke, just enough to be atmospheric and pleasant, but Ariana's must have a very good ventilation system because even with a hookah on practically every table, it was never oppressively smoky or remotely close.The crowd was great. It was diverse--mostly Black and Brown with a few White people--and very chill and friendly. Everyone was happy and having a good time. Ariana is BYOB, so some people brought wine. One table made the power move of bringing a bottle of Jameson along!When we finally left, our waitress smiled broadly and wished us a good night and told us to come back some time. The service was friendly and warm, from beginning to end.The next day, my friends were still raving about Ariana, so this is definitely a keeper for entertaining out-of-town guests. But for us Philly folks, there is no reason not to make Ariana a regular stop. It is an excellent alternative to some of the more pretentious/fratty places in Old City and more to the point, a fantastic establishment in its own right."], ["Gabby M.", "I tried this place for the first time and I am extremely glad I did! I got the Kabuli Palow was incredibly flavorful and filling. The chicken was cooked perfectly and the rice was nice and tender. They also delivered it very fast and the delivery man was quite nice. I am making this one of my usual places!"], ["Hari D.", "The food here is simply amazing. It is not spicy like Indian food, and they have several vegetarian specialties which is great."], ["Geraldine E.", "I've been here twice now. Comfy, decent service, and very yummy. Plus 20% off with a movie ticket! Good deal to me!"], ["Steve A.", "I have had unbelievable Middle Eastern food in places from holes in the wall to fine dining. This is average food at best. My friend and I were not hungry, so we ordered a handful of appetizers. I started with the Aash-e-dal (lentil stew/soup). It had a nice texture, but very little in the way of spice, and wasn't served nearly hot enough. I had to add salt, which is something I almost never do at restaurants, so that started off on a bad foot. I also had the Bulanee Gandana (scallion turnover). The menu says \"stuffed\" with ingredients, but a better description would be \"slightly including.\" I'm not big on scallions, but there was hardly any scallion taste - or any taste at all. I smothered my pastries in yogurt, which was thankfully hard to mess up.Finally, dessert. I ordered the firnee (Afghan pudding) on advice of the waiter. It was supposed to have \"ground pistachios, almonds, and rosewater.\" There were two slivers of almond and about half a pistachio of grindings on top, and that was it. There were a few lumps in the pudding, which had the consistency of very firm Jello. It was sweet, and tasty for that reason, but hardly something I imagine as authentic and definitely did not live up to the billing.It's not a horrible 1-star type of place, but definitely not worth revisiting. If I were eating Afghan in this area, I'd go over to Kabul next time."], ["Antoine D.", "We recently had a party at Ariana.Staff is really nice and accommodating, they gladly explain all the different food they have.Very very good food, more meet would not hurt!"], ["Sree C.", "Very good hookah and food!"], ["Kristina T.", "Hookahs and afghan cuisine!"], ["Adam G.", "I don't normally give five stars in any restaurant review, but this place is something special. I didn't think I liked Afghan food before eating here, and I've never had it nearly as good anywhere else. The aushak is light and in a deliciously tangy sauce. The mast o-khayr is cold and downright soothing. The tenderness of the pumpkin is hard for me to reconcile with my previous encounters with that rough, dense vegetable. And the firnee is a sweet ending to a savory meal. If you don't routinely go to Old City, this place is worth the trip."], ["Beth R.", "First impressions. Very cute and cozy inside. I wish we were in the front area with the pillows and floor seating - it looked fun.  I thought our service was fine. Our party staggered in, finally in full about 15 min late, and they didn't seem deterred (and let us be seated without our full party). It's hard to say how it compares to other Afghani food, since this was my first time.  I tried the Ariana kabob, which included chicken, lamb, and beef. The beef was my favorite of the three. The dish came with rice and a bread stick thing too. The dessert we shared was a pudding with crushed pistachios and some other flavors.  I didn't love the dessert but I think I just am not sure about the mix of flavors.  Overall, interesting."], ["I T.", "If I could figure out how to give zero stars I would. Slow, mediocre food, how does this place have 4 stars. Wish we had tried the Indian place down the street."], ["Rob S.", "Have been here twice.  I have friends that love the place but I am honestly underwhelmed.  We ordered the Sambosa appetizer ($4.50), which as it sounds, is just like a samosa.  We got 4 small samosas that were flaky on the outside but had almost no filling.  It did come with a delicious cilantro sauce.  I ordered the Lamb Kabob entree ($16.50).  The lamb was nicely charred but overdone.  Came with lots of onions but only a small amount of peppers and tomatoes.  The basmati rice is good and you get heaps of it.  But that's all you get heaps of.  My girlfriend got the vegetarian Chalow Gulpea ($13.00), cauliflower in a tomato sauce, but she thought the sauce was rather bland.  Overall the food is not awful, but I also find it to be way overpriced for what it is.  (Old City style.)  Personally I would not return."]], "Cafe Olé": [], "Isot": [["Remzi O.", "This is a nice authentic Turkish restaurant. The owner said they opened 5 months ago. Owner is very friendly. Food is really good. I tried Adana kebab and it was as good as the restaurants in Istanbul. 5 months 5 stars."], ["Alex S.", "GREAT meal. The BYOB is so nice, especially for us New York City-ers. We got the Meze appetizer and the mixed plate and split it between the 2 of us. Definitely enough food. And so tasty!  Our waitress wasn't great, but the atmosphere and the food more than made up for it. All-in-all a great spot just off the crazy South Street strip."], ["Jim L.", "Affordable and delicious.  Mixed meze, mixed plate, and cheese based desert were awesome!"], ["Samir N.", "We have now been here four times, and have thoroughly enjoyed ourselves every occasion. The appetizers are incredible. We have enjoyed the Ali Nazik, which is a combination of meat and eggplant in yogurt sauce, and the Manti, which is a must try dish featuring small dumplings (we had this before in Uzbekistan cuisine, but love the spin the chef places on this). The same can be said for the lamb chops, which are very tender and cooked well in demi-glaze. The Adana kebabs were also shared and enjoyed by everyone. This place is definitely worth checking out as it's a new restaurant in the area and deserves a taste from those both inside and outside of the neighborhood. We will keep coming back!"], ["Murat Y.", "Nice authentic Mediterranean food. My father owned two restaurants back in the day and I'm very picky about my kebab! Tasty food, fast and professional service. Will def come back when I'm in Phili"], ["Vedat A.", "Best lamb kabab I have ever eaten! I mean it. My simple test of any mediterennean restaurant is whether or not I like lamb kabab more than what I make on my charcoal grill. Isot blew my test. I cannot still believe how great it was. I hope I could go to Philly again soon."], ["Rebecca K.", "Completely wowed - food, service, decor were all outstanding. The food is flavorful, obviously made with care, perfectly seasoned, served by the friendly, attentive wait staff. It's the best Turkish food I've had, outside of Turkey! I can't pick any one item because everything we have had here is top notch. I would say that the grilled items, especially the Kofte, are my favorites. Prices are quite reasonable. The decor is charming and casual from the pretty bistro chairs of black and rattan, beautiful wooden ceiling panels, right down to the super clean bathrooms which feature attractive circular wall tiling and perfect lighting. I knew from our first visit that this place will now be my regular neighborhood brunch, lunch AND dinner go-to spot! I have never seen children running amok, like a review below noted. It's actually a perfect choice for families with well-behaved kids - many items are so-called kid friendly (chicken kebabs, wraps) and the owners are warm and welcoming to all. (I, and other nearby tables, were far more annoyed by the table of 3 bellowing bros and their yappy girlfriends than I would be by children. ;)"], ["Mike Z.", "Its a nice  mediterranean  byob off of South St with a good ambiance. Our server was friendly. Their description clearly said they are a Hookah Bar but they are not, which is annoying since most of us were in the mood for Hookah. The starters were all good... The hummus platter and the other salads that came out were tasty but they only give you 6 small triangle pita pieces and we had to keep asking for more.  (Table of six) For entree i ordered a Bronzino and my gf ordered lamb chops. Something got screwed up that everyone got their food and I had to wait another 20 minutes for mine.  It was a good Bronzino,  but the wait was not good. I ended up picking at other peoples meals and by the time my fish came out, I wasnt really hungry.  It seems like the place is fairly new and they are going thru growing pains, but I was not in the mood to be a test dummy. Good food, below average service which I hope improves."], ["Jay A.", "Great food with a unexpected kick.  Jalapeño peppers used on the kebabs.  Definitely get the Mixed Sampler cold appetizer to try everything.  We came during their soft opening so we are excited to see how they evolve"], ["Jonathan A.", "I'm so glad Philadelphia has a restaurant like this: excellent Turkish food, including some wonderful, cumin-y, urfa pepper-laden dishes from Southeast Turkey that you don't usually see on Turkish restaurant menus, all in a quiet and atmospheric BYO with friendly service. For me, highlights included abagannush, a refreshing cold eggplant dip with pomegranate sauce that's herbal, smoky, and a little spicy; hot hummus with walnut and hot pepper oil (which was some of the best hummus I've ever tried in a life filled with hummus), and cig kofte, which is vegetarian patties made from cracked wheat, hot pepper paste, and spices.  We also had dessert, and the baklava with pistachios was perfect. It was sweet and flaky and floral and nutty, but not gloopy - the texture was just right, which turns it into something light years better than what (already good) baklava is usually like. For what it's worth, I've lived and traveled a lot in the Middle East, including some time in Turkey, and even in the region it's hard to find baklava that's this good. Basically, these guys really know what they're doing, they add something new and excellent to the restaurant scene in Philly, and I'm glad they're here."], ["Lina S.", "Honestly, I'm a bit surprised about all the 5 star reviews. The atmosphere was great, our server was a sweetheart who checked on us frequently, but the food... Meh. We got a shrimp appetizer that was pretty good. The shrimp were cooked to perfection (thoroughly cooked, but still had that crunch) and the sauce was pretty tasty. No complaints about the dish, but it was like $12 for a little bowl of cooked shrimp in sauce. Also got chicken, lamb and beef kabobs, along with some grilled veggies. I was really looking forward to some kabobs and these were a bummer. They were all very overcooked. I can see the chicken being cooked well, but grilling beef and lamb until it is black, hard and dry is definitely not what I'd expect from a restaurant. We ate it, but it certainly wasn't enjoyable. Maybe I'm ordering the wrong thing here, I don't know. But kabobs are a Turkish staple and with a number of similar places close by that make it better and for less $$, I'm not in a rush to come back and try the rest of the menu. Overall, if you want Mediterranean/Middle Eastern style food and care more about ambiance than food, then I guess you'll be fine. Sorry, Isot. I really wanted to like you."], ["Rebecca F.", "Charming BYO. Ate there the other evening after I read a mention of it in the Philadelphia Inquirer food section. Was not disappointed! Very fresh, authentic Turkish cuisine with great spices, flavors, contrasts. Had the mixed meze to get a good sampling as well as the Ali Kind (sautéed marinated lamb with gilled eggplant, yogurt garlic sauce). Also tried the Karides Tava (jumbo shrimp -- and they WERE jumbo) in a butter garlic sauce with red pepper. Absolutely delicious. Although I was really full, the platters going to the table next to me smelled wonderful. Am returning this week. Casual, cool atmosphere, knowledgeable, friendly, accommodating staff."], ["Kareem Q.", "Great food, selection is limited but the quality is there. Also the place is very well decorated and clean (including the bathroom). Overall good experience, wait staff was extremely friendly."], ["HalalBite F.", "Tried the steak which is very good but not as great as the other excellent and consistently great tasting food.  Excellent service, ambiance, and staff.  Will come back for more!   Need to try other dishes next time but mix plate and Adana Kabab are just too good to pass up.  Can't wait for doner kabob and maybe an upgrade of the pita that comes with appetizer."], ["Keythor P.", "We walked by with our dogs, and got a menu from the hostess saying they have new special menu. We decided to give it a try since they have tables setter up outside. We ordered the vegetarian wrap and chicken wrap. Hey, It's a wrap, who would have thought they are so out of ordinary and so delicious. I'm surprised by the herb and seasoning that they put on the wrap. The best wrap I've ever had. They put onion, green peppers, eggplant, zucchini, broccoli, and cauliflower into the wrap, all these ingredients makes the wrap so juicy, plus the spicy power makes it more special. We also ordered a side of fried calamari. We later found out from the waitress that it was the first time the kitchen serve wrap since their grand opening one month ago. I hope they will keep this quality and standard. Overall it's an excellent experience. Will definitely come back and try the whole menu."], ["Emma S.", "Just tried this new somewhat hidden gem in our neighborhood (Bella Vista) last night. Upon walking in, I was pleasantly surprised by the beautiful decor. It is perfectly cozy with an upscale twist. We began with the warm hummus topped with walnuts, a mezze platter which included cold hummus, an eggplant and tomato mixture, a spicy tomato mixture, a yogurt sauce, Russian potato salad and another vegetable mixture that had a hot kick to them. We also tried the Pacagna Borek that was insanely delicious. We had the special Branzino that was literally to die for. It should be put on the menu. The fish was cooked perfectly and the lemony flavors were perfectly complimentary without being over powering. The side vegetables of broccoli and cauliflower were amazing, my only complaint was that I didn't want it to end! The side salad was also super tasty. The deserts were incredible- some of the best Turkish desserts I've tried. I am so glad that we came in to try Isot! It was such an awesome treat and was absolutely delicious. Very friendly staff. The owner has a lot of history to his story and his background shows in his food! I can't wait to go back :-)"], ["Jason M.", "Great food, great service in a nice location. Very nice staff too. It is BYOB, but there is a great wine store around the block."], ["Michelle K.", "The service was slow and uninformed about menu but The food was good. The mixed grill plate was cooked really well."], ["Lixin L.", "Nice restaurant! Nice service! Nice food! It was the first time I had Turkish food and it was awesome! Th atmosphere is wonderful and the food is great! Highly recommend to come here with friends!"], ["Ira S.", "Great food and excellent service. Not cheap, but the fish is fantastic and fresh."]], "Al Zaytouna": [], "Agno Grill": [["Meredith B.", "Pretty good lunch spot.  I liked their use of clean healthy ingredients. Today I had the lamb meatball special over spinach with roasted leeks, carrots and quinoa with harissa  (spicy) sauce and tzatziki sauce.  All ingredients were fresh and tasty. Place was clean and the employees were super friendly and helpful.  I struggle to give Agno four stars as I see it getting old or repetitive quick (not much variety).  It's good to check out but I don't see myself flocking back often."], ["Gina C.", "I met up with a girlfriend here for lunch. The concept is great and easily customizable - imagine a Chipotle style of ordering. The food was decent and the sauces are great. If you are unsure of a sauce, ask for a taste! I wish I got a little more sauce with my salad bowl. The quality of the food was lacking for me: the falafal balls were dry, roasted carrots tasted raw and salad was just a few leaves. If I am to go back, I would try a black rice bowl with chicken. My friend's bowl looked more appealing than mine. It's a guilt-free lunch for a reasonable price but I won't be going out of my way to make it there. I much prefer MAOZ vegetarian in Washington Square for my falafal needs."], ["Zane K.", "The food here is really fresh and of great quality, and the chipotle-style menu makes it very easy to mix different ingredients and try new things, but it lacks a flavorful punch. It also doesn't taste too much like authentic Mediterranean/Middle Eastern cuisine, and the portions are relatively small. It's not the most expensive place, but it's a little pricey considering how much food you get. One plus, though, is that they deliver."], ["Brinda P.", "This is one of the very good places for vegetarians. The falafel bowl with their special black rice and some salad greens on top make perfect lunch."], ["G M.", "What a find!  The quality and composition of the food, including lack of gluten and healthiness of the Mediterranean diet are the draw.The staff is friendly and helpful.The well located space is uniquely furnished in a rustic style."], ["A S.", "3 orders..each with chicken. ALL chicken hard as a rock, impossible to chew. Fear it was recycled chicken, ergo the overcooked rock-like chicken. Tasteless dishes, too. All sauces without depth of flavor. We had sauce left over from Molly Malloy at the Reading Terminal Market so we poured that on and it helped, but this place has lifeless food, folks. Sorry. The cooks need to season!! Chickpea thing not special, nothing special. I wonder if 5 star reviews are coming from relatives or friends of the establishment."], ["Andrea T.", "I felt the food was really good, but the portions were a little meager. So meager that we had space for half a federal donut and half a cronut at Potito's. I did enjoy the beets, black rice and all the yumminess, and I will be back. However, I just didn't feel satisfied having not eaten breakfast. I feel like I could have eaten another one. I will be back, just when I'm not so hungry.So I now go and get double rice!"], ["Brian M.", "Firmly in the Tampopo, Rotisseur, Honeygrow, Shake Shack rotation Agno Grill separates itself with a few unique ingredients and a wider range of combination options than others in my opinion.  The place has always been pretty dead in here other than one time a large group taking advantage of the BYO policy at the large central communal table.  Hopefully this doesn't spell a short lived lifespan since it's a decent option amongst the others previously mentioned in the \"slow food quick\" category.I can't say I love the place, but service is always nice enough and I have enjoyed the combinations I've come up with in my 3-4 times there so far.  The menu is daunting at first since it seems like an odd mix of options but sine everything is fresh and you can lube it up with two sauces in the end it typically comes out half decent."], ["Jordy C.", "The staff are extremely friendly and helpful.  I am a regular, and have yet to be disappointed by the quality or consistency of the food.  I typically get a salad with either falafel or veggies and varied toppings; everything is consistently fresh, with a solid set of healthy Mediterranean options and particularly fantastic sauces."], ["Erin M.", "I just inhaled my salad from Agno Grill. AG is a build-your-own salad, wrap or black rice bowl cafe, and I am impressed by the quality of ingredients, the price and the quick service.I had about 5 minutes before I had to catch my trolley back to work, and I decided to check out Agno. I was a little concerned because I heard there can be a lunch rush, but the line was very short and the staff was very fast at building my salad as I selected ingredients. I started with the base of the spinach salad with falafel for $8 which includes 3 toppings and 2 sauces. I opted for the roasted cauliflower (tasty and crisp), quinoa tabouli (same) and beets (which were delicious but incredibly messy). For my sauces, I chose the roasted eggplant, which I found to be very spicy but yummy, and the hummus which was excellent. The falafel was out of this world. All items on my salad had a lot of spice, a lot of pow. I think I'd like to have a piece of bread or something to go with this salad next time, to calm down my palate.I can't wait to return. This might be my favorite salad in the city! I'm also excited to try the black rice, especially with the cooler weather coming."], ["Jennifer M.", "When I'm out for lunch, I want food that comes out fast and delicious. If it's healthy, then that is a bonus! I like this place, and with the various options available, I can see myself ordering something different every time. For my first time, I ordered a spinach salad with chicken, cucumber tomato salad, quinoa tabouli, and some roasted cauliflower. I got the lemon tahini and hummus to dress up my colorful salad with flavor. This was so good, so fresh, and a much healthier option than other eateries nearby.With the popularity of this type of style restaurant (fast, choose-your-own-adventure-type meal), the place gets busy around lunch time. Plan accordingly!I'll be back again, mainly because it's awesome, and I want to try every combination! And they DELIVER. Can I get a hell yea?!"], ["Sharan J.", "After this place opened up nearby, I was really excited to try it out and upon hearing the reviews I just had to go there for lunch.  I started with the salad.  I picked the spinage (you can get spinage, black rice, or wrap).  Then you pick a protein, I added the falafel.  For my toppings I got the olives, white beans, and roasted cauliflower.  For the dressings I got balsamic and then lemon tahini on top of the falafel.Boy was I was pleasantly surprised on the quality of the food. It was excellent!  All the ingrediants tasted extremely fresh and all the flavors worked well together.  It was not spicy at all and I thought each topping on it's own were very appetizing.  I will definitely be going back! Pricing is average - I paid $8 for my salad."], ["Hagana K.", "Really good option in the area if you've been eating too many cheesesteaks at tonys or too many pizzas from dolce carini and you want some veggies. Got a chicken wrap with broccolini, feta and cucumber/tomato salad with the spicy harissa sauce and the tahini. It was kind of weird eating a cold wrap because the setup reminds you of chipotle and I was expecting a hot meal, but it was surprisingly good. Wife said the falafel was better than mamas.If it was a buck or two cheaper I'd probably eat here four times a week."], ["Amanda C.", "I tried Agno recently after hearing some big hype - or at least what I thought was hype...but it's all true. Their menu is all organic, locally sourced, gluten free and prepared on site. It's a build your own creation type place, starting with your choice of wrap, rice or spinach (I chose spinach - fresh and crisp). Next, you choose your main topping. I got grilled veggies, but I'm itching to try the falafel or steak next. Up after that is the 3 sides...so many delicious options to pick from here. I chose white beans with spinach and parmesan, a tabouli salad and the roasted cauliflower. My darling friend let me try her carrots (yum) and beet salad (omg). Last, you select a sauce (or two!) to top it all off (or for dipping on the side). I got the lemon tahini, and it was the perfect complement to my veggies and sides. My lunch at Agno rang in at just over $8 for a healthy, tasty, unique meal that I can feel great about eating - for my tastebuds, my body AND the world. I haven't tried their older sister restaurant, Pure Fare, yet, but I applaud what these folks are doing. Bonus: they deliver down to 4th and up to 24th (from Arch to South) all hours of operation, and into West Philly until 3PM. And they made sure to let me know if I wanted to order dinner earlier and have it delivered, the food may sit for up to 12 hours without a fridge and is still solid. GOOD TO KNOW. I will be back to Agno again. I'm already spreading the word at work. So worth the walk."], ["Michelle C.", "YUM! I loved my dinner at Agno Grill last night. My boyfriend has been bugging me to try this place and telling me that I would love it. I'm already a big fan of Pure Fare and, honestly, I might like the Agno Grill concept even more. There are so many choices for what you can put into your bowl or wrap that you could probably go twenty times and have something different each time. Last night I opted for a (step 1) black rice bowl with (step 2) veggies, (step 3) roasted cauliflower, olives, and white bean, spinach and parmesan spread plus (step 4) tzatziki and the special sauce of the day, green peppers and olive tapenade. And no, I didn't order a single thing extra - you really get that many different toppings in your bowl or wrap! Having so many things in a bowl was kind of crazy but it was fun trying different flavor combinations. I loved every bite and will definitely be hitting up Agno again soon. The more healthy-yet-interesting options in this city, the better."], ["Sarah A.", "The first time eating delivery by Agno Grill, I had: black rice (base), falafel (protein), and 3 toppings (braised radicchio, roasted cauliflower, white beans w/parm and spinach) with hummus (sauce). The black rice has a nice texture and I love the white beans w/parm and spinach, but I didn't love the rest of my choices. The radicchio and the roasted cauliflower were okay. Both the falafel and the hummus were heavy/dense and almost bitterly spicy.Since then I've kept the black rice (black), but swapped the \"protein\" for either grilled steak or the grilled vegetables, and choose 3 toppings (white beans w/parm and spinach, cucumber and tomato salad, and quinoa tabouli) with lemon tahini (sauce). The lemon tahini is great; tons of flavor! The grilled steak reminds me a bit of the braised barbacoa from Chipotle, but it's (sadly) drier with less flavor. The grilled vegetables are actually the best: the eggplant in particular is succulent."], ["Madhu R.", "Wonderful!  Incredibly fresh, local, flavorful ingredients including locally and ethically sourced meats and veggies.  I had a black rice bowl with minty carrots and lamb with a spicy harissa sauce.  Great portion size and a great value.  Also employees are super friendly and vibe of the place is very sunny and warm."], ["Callan W.", "Hellllllooooo new favorite salad place, welcome to my heart...and my tummy.I have a love/hate relationship with salad.  I love it, but most places consider iceburg, grape tomatoes, cucumbers, and red onion to be a salad and those are all things I hate.  Here, you don't have to worry about finding any of those.  They have fresh veggies, perfectly seasoned and you can get as many as you desire (over 3 and they charge you).  The grilled veggies were tasty and warm - I love warmed veggies on a cold salad.  The cauliflower had just the amount of spice and the carrots were great too.  Can beets ever be bad?  Taking a cue from Allison B, I went with the Lemon Tahini and was super happy.  The girl who helped me gave me a little smile as if to say \"You have chosen wisely\".  This isn't my first time at the salad rodeo.My lunch buddy got a side of the falafel just to give them a whirl.  I wasn't a fan since they were a bit dry, but everything else was great.  The 2 salads+drink+falafel came to $22, which is on par for these parts.  I also left full, so maybe they have gotten better with their portions.  As we go into fall and I try to undo all of the bad habits that come with summer (bbq's, beer, ice cream, etc.), I have a feeling that Agno is going to be part of my weekly routine.  As all others go East for their salads and such, you should go West."], ["Cristina L.", "Gosh, I love Agno. We were greeted by a very friendly and informative manager that took the time to explain the menu and the restaurant's philosophy. Everything is organic, very fresh, and SUPER tasty. The best part--the food is Mediterranean/Greek based, and so I can get a delicious variety of Greek yumminess for around 8 bucks, depending on what \"protein\" source I choose. To break is down, you first choose a base (black rice is awesome), then a protein, followed by 3 sides and 2 sauces. The Tzatziki is to DIE for! The hummus is made in-house and is also really good.I think of Agno as more of a \"fast food made slow\" kind of place, although I was told that it is a BYO, so one can certainly make it into an outing if on a budget. I'll stick to this place for the delicious food and plentiful options."], ["Nathan W.", "prices don't add up to the amount of food...also thought the falafel would be warm, not refrigerator temperature"]], "Aksum": [], "Saad's Halal Restaurant": [["Hieu H.", "Truly amazing, best sandwich I have ever had was the chicken maroosh.  I could eat here everyday, oh wait I did for a week.  I love the desserts as well.Also, how do they get their fries so crispy!Hummus is also a must as well as falafel!"], ["Ben Y.", "This place is amazing. Busy, unassuming little spot on 45/Walnut. Always filled to the brim during mealtimes with the W Philly mix - families, students, big groups, little groups. You know how with most sandwiches, despite best efforts, you get down to the end and it's usually just bread and sauce? The Chicken Maroush sandwich ain't like that. Filled chock-full to the brim with tender, juicy pieces of chicken, dotted with peppers and tomatoes and other veggies, covered with a delectable herb/garlic cream/mayo-y(?) sauce. All for 8 bucks. Other things good/great: Greek Salad pita, Lamb Schwerma wrap. But the Chicken Maroush trumps all."], ["Husnan C.", "If you want the best Halal and or just flat out Middle Eastern food, this is the place. And sorry Pats, Jims, and Genos, but this place has the best cheese steaks as well. No one can compete. No one. Been going here for the past 7 years, maybe longer, and the quality in food never goes down. The prices are very reasonable. If you want take out, then call before hand usually 20 minute wait depending on the rush. Usually you can find a place to eat inside, but its always busy."], ["Huamei Y.", "This was the best halal/middle eastern food I've ever had in my life. I came on a Friday evening around 9pm and I was amazed at how crowded the place was. I got the lamb platter with baba ghanouj and the spinach salad. The food took about 35 mins to come out. The portions were more than plentiful that I struggled to make a dent in it. The lamb was juicy, tender, and delicious. The baba ghanouj melts in your mouth. My friends and I also got a side of hummus which was creamy and amazing. I am a huge fan of hummus. I have paid so much money for hummus but this is hands down the best hummus I've had in the city !For the price, it's such a great value!"], ["Yahya S.", "Saads is known to be an institution for Halal Philly Cheesesteaks in the Tri-State, DMV area. I came here for the cheesesteak and I was satisfied by it. It's good. It's really good. It's not great. I've had better. I guess it's the only big halal restaurant that has stood the test of time when it comes to halal philly cheesesteak. The sandwich that wills this review a 5-star rating all on its own is their best selling dish at Saads:The Chicken Maroosh.What does the Chicken Maroosh consist of? Fresh grilled chicken, the freshest herbs and spices, pickles, tomatoes, and the BREAD. My GAWD, the bread is perfection. I would come back to this spot just for the bread. I mean it was crisp on the outside and so warm and fluffy on the inside even with all the piping hot grilled chicken and fresh mayo within the sandwich. And the sandwich is a footlong. I have to mention, the herbs come through really well in a sandwich that seems to be overflowing. This sandwich is perfectly balanced. I loved it. I can't wait to go back and order like 4 more Chicken Maroosh sandwiches lol.DOWNSIDE:-Very long wait-No room inside to move around"], ["Talha A.", "The only reason I'm giving this a five stars is because of the chicken maroosh sandwich, which was AMAZING!!!  Growing up in Queens I've had a lot of halal sandwiches in my life but this is one sandwich that I would make it a point to have any time I am in this area, it was that good. Maybe it was the garlic sauce or the seasonings or just that everything was made really fresh: I can't pinpoint it but whatever it was they are doing really well!The Philly cheesesteak was a 3-4 star rating, it needed a bit more seasoning, it came across a little bland, more cheese please!! It was average at best.The onion rings and French fries here were served warm and crunchy but still mediocre, frozen and fried, at a place like this Id expect hand cut fries.I def will be back, bc this is a halal establishment I will give this a five star rating. Great, friendly and fast service even when the house was packed."], ["Sadaf S.", "Amazing philly cheesesteak! I tried their chicken sandwich too but nothing to beat their cheesesteak. I even packed one to go to eat on my flight back home :)"], ["Farah B.", "Saads Halal is the go to place for zabiha and halalies to visit when in Philly to get the obligatory philly cheesesteak!  Street parking is tricky,  Saads does not have a parking lot, be patient and prepared to walk a bit. We came in on Friday night to a PACKED restaurant, only a few random seats were open.  Needless to say we had to wait for a table to open up so our large party of 10 could be seated.  We ordered at the counter(They only take cash, but may accept credit card for larger orders, and also have an ATM inside their restaurant) and slowly sat down as we were able to get tables together.  The food came out relatively quick.  The philly cheesesteak comes in two sizes, go for the small, no matter how hungry you are if you plan to eat it on your own.  The small can EASILY be shared between two people. The large would be great for a group of 3 big eaters.I didn't actually get a cheese steak and listened to the many reviewed who recommended the Chicken Maroosh. It was delicious!  It was large in size, so I was able to share it.  All the sandwiches seems to be greasy and heavy so don't expect to eat light! They do offer a Mediterranean style plate with rice, veggies, hummus and meat, which was the healthier option."], ["Mona E.", "The Chicken Maroosh is the best sandwich I've ever had!"], ["mark s.", "There cheese steak is over rated I got mayonnaise on mine ketchup pickles fried onions & sweet peppers that thing was so sloppy falling everywhere and really greasy. You will be better off going to the truck across the street from them diagonally across the street they have better cheese steaks and food. Their chicken Magoosh was okay its pretty much like a grilled chicken sandwich on a long roll"], ["Jarrad R.", "Heard about this place from an Uber driver.  Asked what his favorite place for a cheesesteak was in Philadelphia and expect to hear Pats, Genos, Jims, or D'elassandros.  To my surprise, his answer was \"Saad's.\"Their cheesesteaks are great, but since becoming a patron of Saad's I've become a fan of the Chicken Maroush.  Prices are reasonable, but service can take a while so calling ahead for pickup would be a wise choice.  Also -- bring cash!Really great place!"], ["Amy L.", "Great for vegetarians!!! They know their regular customers by name and are always cheerful!"], ["Derman O.", "Parking was street parking. The employees seemed to be like a family. The owner was there. We got chicken and cheesesteak. Both were good. Clean restaurant. Halal food. Will go back to try more options."], ["Freshta P.", "Amazing service. Always make a stop here on my way to VA just to have the philly cheese steak and the chicken mahroush. I cant explain how worth the drive is just to come here. The ladies at the counter are super nice. Oh and btw the man who cleans up after everyone.. even though its easy to clean up after yourself allow him to do it. He is such nice man...DONT forget to tip him a dollar or two, just leave it there even if he walks away. :)"], ["Herbie H.", "I'm ashamed to say that I have lived within 3 blocks of Saad's for the last few years and have only recently made my way to Saad's.I've heard nothing but fantastic things about the food, service, and people at Saad's, so I was eager to try it.I'll update my review once I've sampled some more of the menu, but for now i've had:-Falafel with Hummus Wrap-Chicken Maroush Sandwich-French FriesIn my opinion, the Falafel wraps are an insanely good deal. They are a) HUGE, b) cheap, and most importantly, c) delicious. The first time I ordered it, I thought it was missing something, so now I order it with hot sauce and extra pickles. Can't go wrong for $5. I've only had the Chicken Maroush once, but it was great. Tons of flavor, juicy chicken, delicious sauce, etc. And, again, huge portion. Fries are crispy and flaky and the perfect accompaniment to your delicious sandwich, wrap, or platter.They can get very busy around dinner time (and it's no surprise why), so if you're ordering to-go, I would suggest calling ahead. That way, you can avoid having to awkwardly stand out side or near the counter (where it can get very packed.)"], ["Gigi G.", "Chicken maroosh is a must try!!! It is really amazing! Prices are really reasonable. Pretty quick service."], ["Nadia B.", "Highly overrated. It's a great thing to have a halal place and they are all very friendly but going strictly on the food, it was surprisingly over-hyped and under-delivered. The cheesesteak sandwiches were decent.. 3/5, needed some salt/seasoning, something/anything. I felt the same way for the maroosh which is their most popular Arab dish. It was pretty bland. It had flavor but it was still on the bland side. I don't think it's worth the drive from where I am in Central Jersey (40 min) to get Saad's, but in Jersey I rather drive out to Paterson."], ["Ahmad Z.", "Best resturant in philly period. Amazing food. Clean place. Friendly staff. Safe neighborhood."], ["Scott J.", "These guys are so friendly and food is quite good. This is also one of the few places to get a shawarma in philly."], ["Ed B.", "If you love halal food go to this place, it is literally the best halal food I've ever had in Philadelphia. Only problem they take cash only but they have an ATM machine, and they have this strange thing about not having any cell phone usage in the restaurant, there are like 70 little signs everywhere it's kind of cute."], ["Talal H.", "One of the best uni city places to have middle eastern fare. The staff are very friendly and accommodating ;The menu choices are varied and you have a lot to choose from; we went for chicken maroush and chicken platter. The maroush was just brilliant, saucy enough but also the chicken was grilled well enough to give you a nice flavor. The only thing I'd say was a negative was the seating space and arrangement. They get big crowds, and their bar stool type seating arrangements are a little uncomfortable. The other tables had adequate seating though. Would definitely recommend for middle eastern food and would visit again for sure."], ["Chris M.", "Had a nice dinner here with my brother earlier this week. I've been on campus for a really long time, but had somehow never tried Saad's before. The thing that I liked most was the atmosphere. Saad's is a little corner eatery with a no-frills aesthetic, but welcoming at the same time. I enjoyed the diversity of the crowd, and the atmosphere was lively and vibrant.We ordered a couple of dishes to share so that I could try a few different things off the menu. We got an order of the falafel, which is very good here. We also got the famous chicken maroosh (maroush?) sandwich. I have to say that I was less crazy about it than most of the reviewers. The main problem for me was that there was too much white sauce, which tasted mayo-based. I liked the pickles in the sandwich and the texture created by the bread being pressed in a toasting device. We also got the fries, which are a sleeper order--often overlooked, but seriously good here. One improvement I would suggest would be making a homemade hot sauce to provide to people (like me) who like really hot food. Not much here to make your food spicy, just run-of-the-mill hot sauce. The staff was super nice during all of the interactions we had with them. Liked them very much.Overall, not a bad spot."], ["Hasham Y.", "They sell many things but only chicken manoosh sandwich brings me back again, and again. The secret is in the white sauce. If it ever becomes available for retail, I may stop going there."], ["Carol C.", "Quality middle-eastern food. I think their chicken is better than their lamb though - the chunks can be a little tough to chew. If you want to be safe, just order the chicken maroosh! Ordering is kind of a weird process though, because you order up front, take your food, sit at whatever empty table, finish, and THEN go up to pay. It got a little confusing at the end because the cashier tried to charge us twice for the same thing (giving you the benefit of the doubt guys and saying it was an accident...)"], ["Thea H.", "The best halal restaurant I can think of. Cheesteak and chicken Maroosh sandwich is the best I've ever had. Great place, great owner, simply the best place to eat!"], ["Priyanka R.", "Of all the scrumptious halal joints in the world, this may just be one of the best. I only have 2 words to say, Chicken Maroosh. That's all. Happy Eating!"], ["Daanyaal K.", "If you have a friend split a cheese steak and split the chicken manoush, the first is real heavy and the second is a taste from another world. I believe this place has a $20 minimum with credit cards, its not open on Sundays, they were also closed the entire month of Ramadan last year. Clearly their doing well financially if they can close for a month. If your lucky enough to be there when Saad is you'll have a ball listening to his accent, its the way he ends his sentences as if he was in chorus. Other than the Philly Cheesesteak, the Chicken Manoush is a must, the fries and wings are also great. I never had a reason to stop in between NY and DC until I found out about this place. I would have this any day over that 53rd and 6th gyro in Manhattan, this place uses real quality meat."], ["Bryant G.", "The fries are great, the steak sandwiches are good, but the chicken maroosh is excellent. In all honesty I've never had anything I could call bad or poorly done there."], ["Michael F.", "\"Have you ever tried shawarma? There's a shawarma joint about two blocks from here. I don't know what it is, but I wanna try it.\"Outside the above quote from The Avengers, I wasn't too sure what to expect from shawarma... reason enough to take a trip out to 45th and Walnut.  Bring cash, as Saad's doesn't take credit.  Check in before you enter, since cell phone use in store is a major no-no.  Then, get ready for top notch lamb shawarma.  Hopefully, you won't have to wait in line too long.  Don't worry if you do, as service is relatively quick for how fresh their offerings as prepared.  JJ & I each handled some shawarma and split a tabouly.  My only advice might be to get ask them to go light on the mayo sauce, as it can be a bit overpowering at times and I wasn't a big fan of it."], ["Allen I.", "It's only a matter time before I make my way back to saad. The chicken maroosh. In pictures just does not give you the full idea of how good it actually is. There's just something special about the way that everything goes together I was pleasantly surprised when my girlfriend suggested that we go there because she had had some fond memories of it from her days in Philadelphia I would love to try either cheesesteaks and there falafel."], ["Adam P.", "We've been back to Saad's a bunch of times since moving here and I wanted point out a couple menu items that have stood out OTHER than the chicken maroush:-- Baba Ganoush. Got this as part of their vegetarian sampler (which is well worth the $11 or whatever it is) and was blown away by how good it was. Normally I shun baba ganoush and go back to my old friend hummus, but this stuff is the truth. Smoky, bursting with flavor... so good.-- Lamb Shwarma. Blasphemous as it may sound, I have come to actually prefer this to the chicken maroush. The meat is SO SO SO SO SO tender. Pulls like a professionally smoked brisket and is incredibly juice. The sauce it comes with is chock full of garlic, as well as parsley and cuts through the richness of the lamb perfectly. Add a toasted pita to hold everything together and you've got a champion of a sandwich. GO GET THIS RIGHT NOW!!"], ["Nataly N.", "The lamb shawarma is still the best sandwich ever (see my previous review). And the falafel is flavorful and crispy on the outside. However, I found some surprises in my order last time I was here: 2 dark strands of hair and one pubic (!?) hair. Of course, if you ignore the hair strands and/or remove them before consumption, the food will still taste pretty good. However, I must knock off a few stars for the health implications of consuming food garnished with hair."], ["Miss B.", "Best cheesesteaks ever. Chicken Maroosh is amazing as well. Saad and his crew are wonderful- best halal place in philly."], ["Moneer A.", "I like the saad food. But what I like most is the Philly cheesesteak. Just tell him to fill it t.up with cheese for ya and enjoy the great taste. Once your done, look down and you will notice that you don't see your toes."], ["Catherine C.", "This is a great halal fast food joint. My favorite item on the menu is the chicken maroosh. It's a large enough sandwich to share of you're not too hungry and it has the best tasting sauce in it."], ["Imran G.", "Why are the fries so good? I'd venture to say that they are beer battered, but I trust the sign on the door that says \"halal\". Its right next to the Masjid Al-Jamia and in the midst of a vibrant Muslim population, part of what is called \"Little Beirut\". Its decorated with a plethora of Arabic/Islamic/Quranic scripture on the walls, and the music distinctly matches the environment. I've never actually been to Beirut, but I could probably see what its like.First, I'll echo the same thing another reviewer said about too much mayo. As soon as I opened up the aluminum foil a piece of chicken fell out from my chicken tawook sandwich and fell on the inside of my suit. Great, now there is mayo stains on the inside to remind me of Saad's.But if you can forget about plentiful mayo, the food is actually out of this world. My chicken tawook was piping hot, fresh, and had the typical, classical Mediterranean flavor profile you would expect from Beirut. When I got tired of eating the sandwich, I would switch to the fries for a bit, and cycle through until I could no longer finish either. My suggestion would be to share a boat of fries with someone, and work on half a sandwich and take the other half to go. Unless you're feeling distinctly American in Beirut and you want to throw away all your New Year's resolutions.Intriguingly there is a \"no cell phone rule\", is that while you order, or while you eat, or what? I could see how that's a problem after Friday prayers when this place is probably swamped. Hopefully I'll be around the area again and can try other delicacies from Saad's."], ["Di A.", "If you love middle eastern cuisine, this is a must. Cash only. The chicken Maroosh is honestly one of the best sandwiches I have ever had."], ["Cindy C.", "i love their chicken maroush! i don't typically like sandwiches, but i make their chicken maroush an exception. the chicken is tender, the sweet pepper and cilantro give it a fresh taste, the white sauce is not overpowering, and the crispy toasted bun without too much bread is just the perfect combo. i highly recommend it."], ["Joao Vitor G.", "Place is rather small and looks like a fast food joint. Well, it is kind of a fast food place, but don't let yourself be fooled by appearances: the food is amazing. The lamb shawarma is the best I've tried."], ["Fady R.", "Loooove this place, great food and awesome service! I always get the chicken marwoosh, you have to try it, their bread is amazing."]], "Audrey Claire": [["Sumita R.", "I have been wanting to try this place for so long but the line outside always scares me. Then we decided to come here on a Sunday night and didn't even have to wait! I thought I would get lucky again so I came back on a Fri and ended up waiting 45 mins. The weather was so beautiful, I can't even say it was that bad. And they were accurate on timing. They said the wait would be 45 mins and it was almost exactly that. This place is cash only and byob.  I don't remember seeing a corking fee on the bill either. And I would say decently priced. They do not let you call ahead or make reservations. But they will put your name in and take your number so you can leave and come back while you wait. I had the penne arrabbiata sauce with tiger shrimp. And their warm chocolate cake with whip cream and strawberries. Both were delicious. They also serve you bread with olive oil. I left being carb loaded and happy to walk home to work it off! My friends had the duck and ribeye special and both said their dishes were good.  I will definitely be back to this place!"], ["Grace L.", "My meal here was a few months ago, but I still remember exactly how mediocre it was. My boyfriend and I came here as a special occasion--the last day of summer vacation, the night before our summer jobs started. As we had already frequented most of the other byos in the city, this was the one was chose, based off familiarity as we almost went to audrey claire's restaurant week.We sat at a little table outside, worried that it would rain (it didn't). On this warm summer night, gnats were everywhere. I ordered a duck dish, which was decent but hard to chew, and my boyfriend couldn't find anything he liked on the menu. We finished with another uneventful dessert, to round out the meal. Our waiter was a little....strange.....didn't make me feel the most comfortable (didn't even want to ask him to take a photo of us to commemorate...and I usually have no qualms about asking people for photos). One of the best parts was the bookshelf in the bathroom. Otherwise, there are much better BYO spots in the wonderful foodie city of Philly."], ["Carissa L.", "This is a charming restaurant in Rittenhouse Square that, while good, looks cuter than it actually is. We arrived at 6pm on a Friday night (no reservations on Friday and Saturday). There was ample seating and our order was taken quickly. However, the wait staff, while polite, paid us no special attention and forgot several requests for more water, vinaigrette, etc. Additionally the dining room was relatively small and noisy. The food was good - I had the Zuppe de Pesce which was fine, though a tad salty. It is byob, which is nice but common in Philly. Overall I had a nice time here but probably would consider it to be a bit overpriced- not worth it to come here on a regular basis."], ["Juliana K.", "My recent visit to the loved Audrey Claire was a bit underwhelming.The pear and Gorgonzola flatbread was my friend'a favorite. It's a nice balance. Just remember that Gorgonzola can be quite strong.The octopus salad is the best. I could have this salad everyday. Great balance and mix of ingredients. Not overly dressed. Perfect.The bread you get for free just plain old sucks. Sorry, is rather you just got have given me that bread (or maybe my fault for eating it).The rack of lamb dish we order had some fantasticly thick mashed potatoes. I wasn't in love with the rack being breaded. It didn't really add anything. Rack of lamb was cool well though. Salty asparagus. Tons of yogurt for the lamb. It was more a side dish than a dipping sauce. Way too much yogurt.The molten lava cake was more like lukewarm lava cake with no lava in the middle. Very Mediocre.Overall, I knew the octopus salad would be the bomb because I've had it before. Everything else was ehhh.Service was friendly and okay."], ["Krystal H.", "This charming little open air spot is adorable. We had great service! We went for restaurant week and it was really nice. Huge bouquets of fresh sunflowers in the windowsills made for a warm welcome.I wasn't a fan of the caesar, but then, grilled lettuce...it's a big wedge that you have to use a steak knife to chop yourself. The haloumi was great, the sprouts were delicious. The blackberries used as garnish and in some of the salads were fresh and ripe, not too sour. The shrimp looked beautiful and everyone who tried them said they were cooked well. Same goes for the pork chop and salmon.For dessert (there were 5 of us) they just brought us a sampling. While we all tried everything, none of us wanted the rice pudding or the panna cotta. It would have been nice if they let you choose.I'd love to go back again when it's not restaurant week. Super cute date spot!note: BYO, cash only. (there's an ATM across the street inside the beer/grocery store; has a $1 fee)"], ["Aria S.", "This place is so good!! They unfortunately don't take reservations but fortunately Friday at 730ish i got a table for 2 immediately. Otherwise he said it's usually a 45min wait. My friend and I ordered 3 small plates and a side of the Brussels sprouts. The server said it would be on the lighter side but I was stuffed and we had food left on the table. The risotto was creamy and so simple but somehow so effing good. The haloumi was also tasty but salty (that's just the cheese though) but it was good. The pita was also amazing - get the tahini!!! It's creamy not liquidy like normal. Skip the avocado hummus it was whatevs. The Brussels sprouts didn't impress like cray or anything but good veggie to have. Can't wait to go back! Yum."], ["Andrea A.", "Incredibly disappointed with the behavior of your staff tonight. Excellent dinner but poor service. We chose your restaurant because the pre fix option (3 courses for $30- see photo for proof). When the bill arrived we received a $28 charge for desserts. upon notifying the waiter by saying \"we were charged for dessert when the website says 3 courses for $30\", he provided sass with the following comment \"well it clearly says on the chalkboard outside that it's 2 for $30\". Thank goodness we pulled up the website when the bill had arrived for confirmation. Because 5 minutes later the waiter came by and said \"just so you know *shows his phone* our website says 2 for $20\". So we proceeded to show our phone and clarify he had obviously spent the last few minutes editing the website to try prove us wrong. I do not appreciate liars. I come here often and I am appalled by the lack of class and shadiness of your employees. How dare you be so rude. Own up to your mistake. See the photos of you need proof."], ["Sophon P.", "Came here on a Saturday. We stood for almost 2HRS to be seated. However, the wait was worth it. We cleaned almost every plate and our host even invited us to come back next time and said he'll hook us up. I mean the dessert that he gave us on the house was already enough for us but wow, truly great service and amazing food!! Me and the girls were stuffed!"], ["Sylvia K.", "The menu for this place looked really good, so I picked this place to have dinner with a friend. We ordered the roasted brussels sprouts, the short rib flatbread, and the pappardelle. The bruseels sprouts were really good and cooked perfectly. The short rib flatbread came with braised short rib, portobello, and truffle oil. This one was all right. The pappardelle (which is my favorite pasta noodle) came with portobello mushrooms, arugula, sunflower seeds, and shaved locatelli cheese. This pasta dish was also good, but it was a tad bland - it could've used a little more flavor, though I'm not sure what. The service was really great - our attentive server came by a few times to check on us and to refill our waters. The interior is really simple - there's nothing on the walls, but there were beautiful bouquets of tulips. It kind of felt like we were in someone's home eating dinner (with many other guests) and you could also kind of see into the kitchen. The place is not huge, and the tables are set up really close to each other. This place is cash only, so make sure you bring some ahead of time. They also take check, which is kind of weird, but I guess if you carry a checkbook around, that's also an option for you. The place is also BYOB, which is awesome. I saw lots of parties bring in their own bottles of wine. My friend and I didn't partake, but I did notice when leaving the restaurant later, that there was a store selling alcohol across the street! Convenient!"], ["Amanda M.", "Thanks to Pope Francis' impending visit, restaurant week was moved from its standard September dates to August.  Anyone who's read my reviews knows I'm a big fan of RW, so I wasn't going to let the date change stand in my way.  A friend and I settled pretty quickly on Audrey Claire, as the menu looked amazing (lots of choices!) and we'd both heard good things. The night started off great - the restaurant was mostly empty when we arrived, and so we were able to pick a table by the window. The waiter was attentive, opening the wine we brought and bringing over ice right away (although he didn't offer to pour, which I thought was odd). We were served warm crusty bread with delicious dipping oil, and were given plenty of time to make our decisions about what to order. I went with the fried haloumi to start, followed by the pappardelle pasta with portobellos (how's that for a tongue twister?) Unfortunately, the starters stole the show - my haloumi was amazing, and my friend's brussel sprouts were delicious too.  The papardelle was mostly disappointing, heavily oiled and not particularly impressive at all.  Sometime during our meal they turned off the air conditioning (remember, this is August), and a couple very large groups filed into the restaurant.  Consequently, the place got VERY hot - so much so that I was pretty anxious to leave.  Of course, we had to stay for dessert, which ending up being not worth it.  We were served a tray of rice pudding and chocolate melting cake to share - neither really interested me, so we booked it out of there fairly shortly after. I don't think I'd come back for a full meal, though the starters are worth a trip if you're in the area. I'd rather pick a few of those to share than spend a lot of $$ on an unimpressive entree."], ["Katie L.", "We've been in a small plates mood lately, and since many of my fellow Yelpers complained about the blandess of entrees at Audrey Claire, we opted for the \"snack as many things as you can\" option. We started with the antipasti for two, per my fellow Yelper's recommendations since everything looked pretty good, although a \"little\" of everything was definitely true. Would have loved more of the artichokes and the mushrooms, for sure. The beets and the tomatoes were just kind of middle-of-the-road.For the smaller dishes we went with all of your great tips and tried the seared haloumi (pretty darn excellent), jumbo crab (too much apples, too little crab), grilled octopus (because yes, more please) and baby arugula salad with figs (tasty, but a little too simple.)So overall it was hit or miss. If someone wanted me to join them at Audrey Claire, I would definitely not say no (BYOB, hello), but I don't feel the need to go out of my way to go back."], ["Kimberly D.", "This place is seriously adorable. All the wait staff wear black pants and white t's which for some rest I found charming. The food is incredible. They are BYO which is always nice! I've gone twice and look forward to going again! Great place to eat outside and people watch"], ["Yuan H.", "I was cautious about going here at first because of the reviews on bad service, but maybe I went on a good day. Service was good, not spectacular. The hostess seemed overwhelmed and the restaurant clearly needs to hire more staff. But, the most important part if this place is the food. We went for restaurant week and pretty much everything was delicious. The Tiger Shrimp appetizer was kind of bland, but the Brussel sprouts with Parmesan was delicious. My favorite dishes were the lemon sole and pork ribs. The mashed potatoes with the pork ribs was devine and the sole was juicy and soft. Dessert was wonderful as well. My only complaint is that it was very loud in the restaurant. I had to shout and lean in to speak to my dining partner. Otherwise, I had a very pleasant experience and would go there again."], ["Jessica S.", "I've been to Audrey Claire before for small plates and flatbreads and thought it was delicious, so I was pretty pumped to dine here again for my friend's birthday. There was a group of 10 of us and we were able to score Sunday night reservations at 8pm. It was the first night of the August restaurant week.. Now I usually am a big fan of RW, but I tend to be cautious about where I go, since sometimes the menu is limited and the portions are smaller. The menu for Audrey Claire looked pretty good, since they offered lots of options for appetizers and dinner and an assortment of desserts for the table. The place is small and cute with some outdoor seating. It's BYOB (plus) and cash only (minus). We were seated after a few minutes and our wine was opened and placed in buckets. We were brought out crusty bread with olive oil to start the meal. I decided on the seared haloumi with sesame fig compote. The haloumi was a tad salty, but overall very flavorful and delicious. The candied dates provided a nice balance between sweet and savory and I was plotting how to avoid sharing with my husband since we decided we would split our appetizers! He got the arugula salad with goat cheese, lentils, berries, and figs. The salad was okay.. Nothing very special. The goat cheese was good but not very abundant. The rest of the salad was pretty lackluster and I didn't care for the texture of these particular figs. I also tried my friends Brussels sprouts, which I thought were pretty good but not the best I've ever had.Onto the main course: I was excited to try the pappardelle, as it's my favorite kind of pasta and it sounded so good with mushrooms, arugula, sunflower seeds, and shaved cheese. I got this and my husband got the ahi tuna which we planned to split. The pappardelle was pretty terrible. It had absolutely no flavor except for oil and the blandness of the dish made it pretty unappetizing. I'm confused why it's hard to put salt/pepper/any kind of seasoning at all on a pasta dish. I was pretty surprised at how bad it was and also very sad! The tuna was also not that great. Again, the crust on the tuna was bland and it was probably the first time in my life where I left pieces of ahi tuna on my plate. Main course fail!!!The desserts were a nice variety and they brought them out for everyone to share. I am not a huge dessert person but the molten lava cake was delicious. Service was decent throughout the night. Moral of the story: only come here for appetizers and dessert. Skip the main meal. Won't be back again for RW but would come back for small plates and a redemption.."], ["Caragh C.", "We came here on a Sat night and got a table right away (no reservations on the weekend). For the appetizer, I got the pear flatbread, which was amazing. For the entree I got the porkchop. The porkchop was well cooked and was delicious. The mashed potatoes that came with it, were like crack, they were that good. By the time the dessert came, we couldn't eat anymore, but the creme brûlée and chocolate lave cake were also good.The service was great, everyone was very friendly.The atmosphere is very quaint and intimate its good for date night or groups. It's BYOB and CASH ONLY. So be prepared, there was an ATM across the street. I will definitely becoming back here again."], ["Jessica B.", "This is a wonderful little BYOB that I always highly recommend.  Its great for a larger meal or a few bites if you're not too hungry.  Its on the expensive side for a go-to kind of place, but its easily on the top of my list every time I'm trying to figure out where to go.  I also think it would make any palate happy.  The atmosphere is warm and very open, its best in the summer when the windows are open and lots of people are dining outside.  I really like to sit at the chef's table too! The service is always friendly and the food is paced well, even though they are always super busy.  It is definitely a smaller restaurant so make sure to make reservations. As a big fan of tasting a lot of options when I dine out Audrey Claire really works for me.  I have not tried any of the larger dishes because every time I go my dining partner(s) and I opt to order lots of the smaller items so we can all share.  I love the simplicity of the food, while being just perfectly done and having some choices that are a little out there.   You really can't go wrong ordering anything.  Get the full antipasta for 2, it seems simple but its delicious. The flat breads are all delicious and pretty large, the braised short rib is the best. The grilled octopus is my favorite menu item, so perfectly done with so many levels of flavor, and some of the best feta ever. If you're looking for a nice night out, with great fresh food that will make everyone happy come here."], ["Karina A.", "Unbelievable food + service tonight! It was my friends 30th birthday dinner and they personalized the title of the menu for him. The Gorgonzola pear flatbread was so good, we ordered a second! The duck, tuna, lamb and pork entrees were amazing. Our waiter was outstanding and made it a memorable night for us by bringing out a dessert with a candle in it for our friend without me even trying to figure out how I was going to ask. Can't wait to come back here and try some other dishes. The fact that it's BYOB, reasonably priced and delicious makes this one of my new favorite city restaurants."], ["Alison L.", "I've now been to Audrey Claire three times, and on each visit the food has been more and more disappointing. It's always jam-packed, but I don't really get the appeal other than its cute ambiance.  On our last visit, we got the appetizer sampler, which was just fine. A bunch of under-seasoned vegetables and some olives should not cost $17.  I've also had fish two times here.  Once, it was so drenched in butter and oil I couldn't even taste it, and the second time it was so dry and overcooked that I didn't want to finish.  The risotto served alongside it was also undercooked to the point of being crunchy.  The only thing I loved and ordered all three times I went was the seared Haloumi.  It's possibly worth a visit on its own.  As others have mentioned, the service here is bizarre as well. You have to order all your dishes at once, and the servers are for the most part unfriendly.  There's no hostess so the last time we went, we waited at the door for almost 10 minutes before anyone approached us to put our name on a list.  All in all, I'd say this one is a pass."], ["Katie G.", "Service was good, outdoor seating nice. Inside smelled a little antiseptic but overall I would say it was a good experience. The food was good, I would recommend the starters, veggies were good."], ["Kate F.", "This cash-only BYOB not only has an extensive and delicious menu, but also has a charming atmosphere and amiable staff. The pear and gorgonzola flatbread was good, but nothing that I would willingly order again - I would probably steal one slice if someone else were to order it, though. I loved the antipasti, which included brussels sprouts, portobello mushrooms, baby artichokes, asparagus, olives, beets, pumpkin, and marinated mozzarella - the perfect HEALTHY spread. I eventually hope to try the salmon entrée or beet and pumpkin salad.I am absolutely obsessed with the restaurant's ambiance. I sat outside, so I was able to admire the lovely neighborhood, as well as the countless dog-walkers passing by. Our server was great too - we sat at our table for quite a while and he didn't try to rush us by any means, unlike the majority of restaurants I have been to."], ["Janet L.", "This restaurant is so adorable, however, the dishes just did not live up to my expectations. In addition, had I not checked Yelp, I would have never noticed that they only accept CASH. My company ordered the duck. It wasn't very well seasoned, cooked a little too tough. I ordered a special of the day (a grilled fish) and it was also lacking in seasoning/taste/flavor. However, the staff is friendly and it is a quaint little restaurant with nice interiors."], ["Christina G.", "We all really enjoyed our meals.  There were 4 of us and we arrived at 5:30 on a Saturday with no wait time.  However, by the time we left, it was a full house and they don't take reservations on weekends.  Keep that in mind!"], ["Paige B.", "Our party of two dropped by for dinner on a weekday night in August sans reservation. We were greeted by a friendly male server and promptly seated outside.Flatbread with Braised Short Rib, Portobello, Melted Fontina Cheese, & Truffle Oil - 3.5 out of 5Sort of like a small pizza, the flatbread dough was thin and shaped into a round. It was more like a thin cracker. The edges were completely cooked through and crispy. I liked the use of the Fontina cheese, it was more flavorful than a mozzarella but less intense than a Pecorino. It gave a nice salty twang to the dish and it helped highlight the soft sweetness of the short ribs. Still, this dish fell short somehow; it needed some acid or some drizzled reduction on top for it to taste complete.Bloody Beets and Sunkist Orange with Black Truffle Vinaigrette - 2 out of 5This dish, ordered as an appetizer, arrived in a small bowl. The beets, cut into small blocks, were paired with two equally chilled orange heart sections on top. Flavor-wise, we both did not taste the truffle at all. These beets tasted boiled, as opposed to roasted (or a combination of the two), and therefore they did not have the caramelized sugar and earthy taste that an oven imparts. Overall, this dish was bland as there was zero seasoning. Taste aside, the textures were nice.Seared Brussels Sprouts with Shaved Parmesan - 3 out of 5There were about three large halved Brussels Sprouts that were seared and a little crispy. They were tossed in olive oil and topped with shaved Parmagiano Reggiano. These were kind of undercooked and kind of bland. I liked the idea of Parmesan, but the slabs of cheese were too thick and large to really incorporate with the sprouts. In summary, the presentation was too rustic; everything had to be cut a lot and mixed together. Like the beets, these could have been exponentially better with salt and pepper.Marinated Mozzarella Salad with Heirloom Tomatoes, Israeli Basil, & Pancetta Lardons - 3 out of 5I appreciated the simplicity of the three 1/4-in. thick rounds of mozzarella, tossed in olive oil, and topped with large sections of a tomato. One of the most important things in a fresh tomato is the texture. [Gritty, foamy tomato meat results from refrigeration.] These tomatoes tasted refrigerated, and as a result the flavor dulled significantly. The mozzarella was average. Pancetta lardons, little salty brilliant bits, were sprinkled on the plate.Grilled Octopus with Feta, Extra Virgin Olive Oil, & Lemon, over Greens - 4 out of 5I'll preface this review by stating that I'm not a fan of octopus. However, I always retry food I don't like again and again to hopefully acquire a taste for it. That said, this was my favorite dish. The octopus was grilled to perfection. It was tender and lightly charred. I also loved the mild feta dressing on the salad.Service -Hit or miss. Our main server, a young woman with brown hair, seemed unenthusiastic. She didn't greet us and there weren't any pleasantries with her service. There was a food runner/server assistant, a super cool and friendly guy with short (or no?) hair who kept an eye on us. He really did end up taking care of us well and we tipped him commensurate to our appreciation."], ["Ari S.", "Perfection.  Service, Food, and the fact that I can see my food being made.  All amazing.  It was mine and my girlfriend's first anniversary.  I came in at 4:30 to drop off some flowers and a vase to have on the table when we arrived to surprise her.  I was ready to start adding in the flower food and ask the host to put water in, and he told me he would take care of everything.  Not only did they have them there, but the host arranged them beautifully.  Great start to the night.  The waiter brought out an ice bucket for our wine that we brought to keep it cool.  We ordered all plates to share.  First came out the Bosc Pear and Gorgonzola flatbread.   All the ingredients went so well together.  After removing the empty flatbread plate, the waiter brought the antipasti for 2.  What could be wrong with lightly grilled or sauteed veggies?  So many, so good.  After that, we were brought the best parts of the meal...  the hallumi and leek and portobella tart.  Lastly, we ordered dessert.  The waiter brought out the creme brule, which was awesome.  Then surprised us with a complimentary bread pudding with a candle in it for our anniversary.  All-in-all, this was a great dining experience and I will go back many times over."], ["Charlene L.", "Clean flavors and fair prices, this is what comes to mind when trying out Audrey Claire.  Came here while in town for business and heard about this place as it's fairly new.  I was impressed with the menu and decided to take a chance.Walked in with no reservations and was able to be seated.  However, it was a bit of squeeze and super busy (Sunday, 6pm).  First thing that I noticed was that it was super loud in there.. super hard to hear anything, and that's not just because I'm a granny... Things that were ordered:-Seared brussel sprouts with shaved parmesan: Really delicious,  but then again I'm an easy sell when it comes to brussel sprouts.  Not overly crispy, almost a pan roasted.. nice flavors, but nothing new that I haven't seen when it comes to this common preparation. -2lbs of Prince Edward Island mussels: Mussels are mussels! Super common typically done in a white wine and garlic.  But this was surprisingly different! More of a sun-dried tomato broth, but full flavor.  Would have been great if bread was served, as there was so much liquid in the bowl! Also, a huge serving! -Crispy shallot crusted lemon sole with crispy sage and caper butter: Loved the texture of this crispy shallow crust and the perfectly cooked sole.  However, I was really looking forward to more of a lemon/citrus flavor but didn't taste that.  Also, it was served with long green beans (perfectly cooked but tons of butter) and cous cous. Good components of this dish, but again, nothing note worthy.. Tasted a bit heavy, especially for a fish dish, due to the flavors of too much butter.I was super disappointed that they were out of the grilled octopus, as that was the first dish that really caught my eye.  Overall, a solid restaurant for fresh flavors without complicating the dish.  Would I be back? Well, for sure it's tasty, but nothing I would crave for as there is nothing that really stands out."], ["A B.", "Pros, it's an intimate setting to share with friends, as well as getting a peek into their open kitchen. Cons, it is rather noisy and the food, while all were presented well, not all were seasoned equally so."], ["Gretchen E.", "Divine.  This cash-only BYO has it all: elegant ambiance, courteous servers, plentiful servings. Even the green apples on each table are delicious.Perfect location in quaint Southwest Rittenhouse, across the street from Food & Friends which hosts an ample selection of bottled beer if that is your preferred libation.  For wine & spirits, there are stores on 19th/Chestnut and 25th/South. Recently, we brought a bottle of gin and mixed it with Pellegrino and lemon.  I'm dying to try the octopus salad - which I've seen on my walks through the alfresco diners - but they ran out of it upon my most recent visit.  My next go-to is the steamed mussels, which come in a very large bowl with a light and flavorful broth, and a large mesclun salad.  The zuppa de pesce is also a must.  My table mates enjoyed their feta-encrusted rack of lamb, and the roasted chicken breast.  Both well-seasoned and juicy. Optimal for a date, girls' night, or dinner with parents.  They take reservations - so call ahead because the wait to seat can be long."], ["Jenny L.", "Second time here. Called in for a reservation at the chef's bar and was seated instantly while others were standing for regular seating. There's a beer market across the street; nearest wine is btwn 20&21 on market. Ordered the shallot crusted lemon sole ($21) and the penne pasta with tiger shrimp ($22). The pasta was whatever, I prefer the pappardelle over it. But the shrimp in it wAs big. The lemon sole though was AMAZING. the crust was perfect and the fish was so tender and soft. The flavor was great too. Would highly recommend it. Also added a creme brûlée ($6$ at the end of dinner. It was bad. The top was freshly torched (saw the waiter do it since we sat at the chef bar) but the bottom of it was cold. Wouldn't recommend"], ["Minh C.", "I had high expectations for Audrey Claire - high enough that I was willing to try it even though it is a cash only joint (why when some of its other establishments take credit??).  Earlier in the day I had stuffed myself silly at Sabrina's and so we didn't end up ordering as much as we otherwise would.We started off with the antipasti for two, which had a bit of everything - seared brussel sprouts with shaved parm, grilled portabellow mushrooms, grilled baby artichokes, roasted asparagus with feta, olives, beets, and more.  This was a great dish, and the grilled baby artichokes were the stars for us.We also split the seared haloumi with candied dates and sesame fig compote, and the jumbo crab with granny smith apple terrine and avocado.  It may just be me, but the haloumi had an aftertaste that tasted very much like goat cheese.  As I'm not a fan of goat cheese, I was not a fan of the seared haloumi.  The jumbo crab, on the other hand, was very light and refreshing.  The apple mixed in it offered a nice sweet balance to the crab.  The star deductions are for less than stellar service and for the lack of credit card acceptance.  It took quite a bit of effort for us to get the attention of our waiter.  The place isn't large so even if it's packed, it should not be difficult for customers to get a hold of their waiters.  There was a strange moment when we asked the waiter for tap water in a cup (because their standard is lemon water in a cup).  Instead of bringing back tap water, our waiter brought back the same lemon water in a mug.  Wolfgang Tango Foxtrot?"], ["Atul G.", "We were easily able to get a reservation on a beautiful weekday night.  The interior is simple and elegant and very comfortable.  We ordered the antipasti sampler - delicious, fresh and really tasty.  The grilled caesar was really tasty, but we thought the OCTOPUS was just stunning- tender, flavorful over a crisp salad.   This alone would have been sufficient for a light meal with a glass of wine.  We shared the fish special of the night which was cooked perfectly (perfectly crispy skin and juicy on the inside).  Would absolutely come back and bring out-of-towners!"], ["Ivy C.", "My coworkers and I were so excited to try this place out because the reviews looked good and we were starving. 1. We were told it would be 5 minutes to get a table after being ignored for 10 minutes. There were 3 two-tops and 1 four-top tables open. Then, we waited for 40 minutes, not 5 to be re-acknowledged. After being re-acknowledged, we were seated after 10 minutes. 2. I swear we were skipped twice as they do not take names for a waiting list. This one group of 5 said they came 1 hour prior to us but didn't give a name and as soon as they arrived back, they were sat immediately. They were friends with the host. Where was the waiting list????3. After sitting, we were then told cash only. Why the hell wouldn't you disclaim that when greeting is for a table first? Or at least have a sign? We were so upset and disappointed in their service and attitude. 4. It's BYOB. I wish I could speak on their food but if their food is anything like their service and host, I bet it's awful. Unfortunately, I wanted to give this place no stars but you have to at least give one even though they are unworthy of one. Advice for the host working 8/13:Firstly, greet your customers and tell them you'll be right with them. Don't ignore people no matter how busy you are. Secondly, let your customers know it's cash only. Lastly, make and take a name for the waiting list."], ["Steve D.", "Sunday evening this place is mobbed. But the yelp reviews were good and all these customers can't be wrong. So we ventured in. We opted for 4 apps and no entrees. - flatbread w/ smoked salmon, spicy humus topped w field greens and drizzled w balsamic. This was nice, fresh and tasty, salmon could've been distributed a bit better or maybe a little more added, humus was flavorful but not at all spicy- Brussels sprouts w shaved Pecorino Romano, if u like them, u will really enjoy this dish, we did. - Grilled octopus chopped salad w feta. Great salad, octopus cooked just right, could've used a bit more octopus. - 2lbs of mussels in red broth. Mussels were a little small but this dish was so tasty, the waiter brought us extra bread for dipping. We really enjoyed them. For dessert we shared the banana bread pudding topped w whipped cream and drizzled w caramel. Dried cranberries,brown sugar and cinnamon filled this bowl of heaven. Overall this place was a bit loud and crowded, other than that 5 stars."], ["Kelly W.", "Yes, this restaurant is tiny.  No, they do not take reservations on the weekends and you can wait awhile.  Definitely don't go here with a group on Saturday unless you are waiting outside when they open at 5.  That being said- this is my favorite restaurant in Philadelphia at the moment and everything about it speaks to me.  I've been here for restaurant week twice and about 4 times besides that and I've never been disappointed.  My favorites:- Short Rib Flatbread: Cracker crust holds up to the richness of the short ribs- Grilled Baby Artichokes: Best artichokes I've ever had, I could eat these lucious bulbs from heaven every day of my life.- Antipasti for two is the perfect appetizer if you can't decide!- Mussels: Just enough spice and the broth is fantastic!  Huge amount of mussels too!- Ahi Tuna: Cooked perfectly and delicious! Cash only and BYOB :)"], ["Mandrita D.", "We went there to celebrate a friend's birthday, group of 7. We tried the $35 tasting menu. We  had brussel sprouts, the octopus salad, pita with different dips, artichoke and entrees.  Other than the brussel sprouts, which was great, everything was ok. The octopus while great had overwhelming amount of feta and onions. I had the salmon entree which was very low on seasoning, as was the papardelle. My friends who had the sole felt the same way. For dessert,  the molten chocolate cake was very good. The rice pudding was exceedingly sweet with a ton of cinnamon. Also, they are cash only,   which was an added inconvenience. I don't plan on going back"], ["Chrissy Z.", "Good food, hard to get in on weekends.  Good date spot but more than two people difficult to seat."], ["mike b.", "I'm rarely inclined to write reviews but this restaurant is total amateur hour. In a half full restaurant our food took literally 1.5 hours to come out. About an hour in I asked the waiter how we were doing. He responded \"with what?\". If I wasn't there for a birthday party I would have walked out. The restaurant is an open space so we could see the waiters all gathered in the back boozing. At first they were drinking wine, then I saw them go across the street and pick up a six pack. Food was OK."], ["Danielle B.", "After walking by Audrey Claire and jealously staring at the dishes it's diners were eatting, I finally decided to come here for dinner. The wait  can really be hit or miss as they do not take reservations. Being a byob, I naturally gravitate towards loving the atmosphere and fresh ingredients that they use. I wish they offered the use f traditional wine glasses as the smaller ones they used were not particularly good to swirl the wine and open it up I did not pack an Aerator with meWe started with the smoked salmon flatbread which was a disappointment. We had about 1 salmon piece on the whole flat bread and it was basically a salad. The dressing they used was nice and light but I cannot recommend this dish.Moving on to the entree round is where the restaurant received it's stars. My husband got the Australian Sea bass special. This was amazing the Sea bass was crisp yet still light and flaky. The risotto was perfectly creamy and cooked to perfection.I ordered the black truffle potato encrusted tuna which was served with the freshest and crispest free beans I have ever had!Though I did not prefer the glass choice and the flatbread the entrees were superb an fresh!"], ["Kacey B.", "Sooo I'm not really about \"yelping\", (I work in the industry so I've grown to despise all of the Craig LaBain wanna be's) but this place deserves a praise ten fold so GO HERE if you want great food and over the top service. I went here last year for my birthday and my waitress made the night so memorable for me that we decided not to come back until my birthday again this year to keep it special. Maxx is freaking awesome I'd say request him as your server, but really everyone is so friendly  there you can't really go wrong. Ugh that ribeye man, I can't even think about breakfast right now. And that short rib flatbread, that truffle, mmmm... This place won my heart last year and was nothing short of amazing this time around too. The combination of the food and service just makes it an easy 5 stars. Seriously just go."], ["Jussi L.", "Took my girlfriend here on a last-minute date. We both had the Penne Arrabbiata, one with shrimp and one without. The food was quite good, bonus points for making a dish that is supposed to be a bit spicy taste so. The ability to bring a bottle is also always nice. However, for a Sunday night it was quite noisy and the waiting staff was a little unfriendly at times. Overall, a slightly above mediocre experience, I would go again but only if someone else specifically wanted to eat there."], ["Alea G.", "Under normal circumstances I would give this restaurant a great review. We use to come here all the time and loved it for years.  Tonight, they ran out of mussels before 9 PM on a Saturday night. There's a small plate of mussels & an large dish, the Zuppa de Pesce which is a combination of clams, mussels and fish for $21. When I asked the waiter if they replaced the mussels he said that it was just more fish a and clams and for that price seems like a waste. It's a shame that a previous local favorite has lowered its standards on food and service."]], "Amalia's Cafe & Hookah Lounge": [], "Zahav": [["Dan W.", "Price:Good for what its worth! Just went here for restaurant week and thoroughly enjoyed it! Food quality/quantity:For restaurant week they offer you the 5 course meal which is also offered during regular business hours (called Tayim).  They start you off with Salatim (various dishes like tehina and masbacha) and hummus with laffa. Bread comes out hot and fresh and all the dishes were popping! I then got the fried fingerling potatoes and kibbe naya (raw lamb - they present it grounded in 3 balls, interesting grainy texture but tasted good for those feeling adventurous!). Got the sirloin shishlik which I highly recommend! Really tasty grilled sirloin cubes with some vegetables mixed in! On to dessert, I got the ice cream sandwich which was amazinggg! Not your typical ice cream sandwich - it is served cut into three pieces with really sweet and savory bits of fruit on the side. A must in my opinion if you're having a hard time to decide for dessert!Service:One of the best in my opinion! When walking in have option for you to hang your coats.  Hostess and servers were really friendly, informative, and professional in all aspects. Thank you for making my experience at Zahav a memorable one!"], ["Kevin K.", "Went on a whim without a res. WHOA!One of the best tasting menu deals out there. Two of us did the \"Tayim\" for $42ea, meaning we tried 10+ plates for $80ea after drinks and tip. No modernist techniques at Zahav but it still deserves 1* over several Chicago staples (Blackbird, Longman & Eagle). We're waiting, Michelin.Zahav's hidden residential location is a grassy, tranquil square; circle the building until it pops out. Inside fits thirty families; ages vary but it's all groups, few couples. Soft yellow pain and plenty of natural light maintain bright atmosphere despite cloudy skies, and the soundtrack keeps things lively despite the patron's age range.Ten minutes past opening on Sunday and half the bar seats were still available. We grabbed two, were greeted immediately, and soon enjoyed well balanced cocktails: the Desert Rose is done right, incredibly refreshing compared to the somewhat muted Smoked and Famous.. chartreuse should always be the highlight of any drink it's in. The New Year's Jerusalem was essentially rosé.. pass next time.The incredibly consistent food stretched across 10 plates and multiple forms of protein, veggies, breads.. masterful on all accounts from the starting salad to the stunning desserts. Favorites included the ethereal labenah ice cream sandwich, the bright carrots with aleppo pepper, the spicy merguez lamb sausage, and the incredibly smokey-yet-delicate grape leaves. The only dishes we'd skip on next visit was the tartare and regular hummus--go with the Turkish.We were gifted two more dishes on top of the ten from the tasting menu; one from the main menu and one an off-menu amuse. The generosity, service, and quality.. Zahav is more than a no-brainer, more like one of those happy accidents that you're still trying to figure out."], ["Megan K.", "It was okay! The portions are really tiny and the menu is quite limited. The atmosphere is nice and the pita bread is incredible though!"], ["Dan A.", "Zahav is one of my favorite restaurants in Philadelphia. Their modern Israeli cuisine is both memorable and very vegetarian friendly. And their Tayim tasting menu offers an incredible value while letting you explore many different dishes. The stand outs for me are the Salatim & Turkish Hummus. It a great way to start a meal. And for the Mezzes, the Golden Beets and Fried cauliflower are my two favorites. Their cocktails are also outstanding. My drinks are choice are: Lemonnana and the New year's Jerusalem cocktail.It's also hard to get a reservation for Zahav at a reasonable time unless made far in advance. But it is worth the effort."], ["Ivan S.", "Wow what a meal. This restaurant has everything going for it. Better than anyplace I have been to in Israel. Small plates make sharing many different experiences possible."], ["Jay W.", "Israeli cuisine. Not something that you see that often.  Worth it simply for that.  Soooooo much food.  I was stuffed long before the meal was over.  We ordered the Tayim (a tasting menu).  I am not sure that I would get the tasting menu again, only because we left so much food uneaten (I would have loved to have taken food home, but we had a long night of  being out afterwards without storage).SALADS AND HUMMUS:The selection of salads were terrific, very tasty.  I liked the beet salad and the eggplant ones best.  The hummus was well made.  The salads, hummus, and pita would make a good meal in their own right if you got a bit more pita.  For the amount of salads and hummus you get, there needs to be either more pita or less other stuff.We were sent out a complimentary dish of smoked salmon and some pickled vegetables.  The pickling on this was too strong for my taste, I did enjoy the smoked salmon though.  It seemed like every table was given a complimentary dish.SMALL PLATES:The haloumi and dates might have been my favorite of the small plates, very rich flavor.  The duck hearts were not too tough, were well seasoned and paired well with what was on the plate.  The asparagus was cooked well, well seasoned and flavorful.The last of the small plates was sort of a breaded chicken ball.  It had what might have been rice or couscous inside with some small vegetables.  This was a little dry.  GRILLED DISHES:The branzino was served with tzatziki, lemon, and a crispy skin.  My companion liked the fish more than I did, the citrus taste was a bit much for me.  I thought the lamb was delicious.  The peas worked perfectly with the earthy taste of the meat. For dessert, she had the pineapple sorbet, I had a carrot cake with apricot.  We both agreed that mine was the better of the two.  A moist cake with apricot baked into it.  DINNING ROOM AND SERVICE:I was surprised how loud it was in here.  Tall ceilings, tables close together.  There was a not-so-dull roar until it got pretty late into the night.  The music was interesting, surprising for what we were doing, but great music.  The service was impeccable.  However, I am not a big fan of the over the top service in places like this.  I don't need new silverware every minute and a half, and my water glass was refilled even when I didn't drink out of it.  I did like that we arrived early for our reservation and were seated as soon as we walked in, I was not expecting that.  We came for our anniversary, and they gave us a complimentary glass of champagne.  A very nice touch.  All in all, this place is a hype machine.  It was a very good meal, but there are some things that I would order differently at my next visit.  With two weeks notice, I was only able to reserve a table at 10:30 pm on a weekend (we were seated closer to 10 pm).  While I would not agree that it is the best restaurant in Philadelphia, it is very good, and I will be back, if I can get a table."], ["Nicolas N.", "Excellent ambiance, service and food = satisfying dining experience.  This is one of the quintessential Philadelphia restaurant - a must visit if you are in the area!"], ["Sophack S.", "Before Zahav, I don't think I ever had eaten legitimate Israeli food, but luckily I was able to sample the many delights of this particular cuisine here. Now admittingly I could not say I'm an expert in Mediterranean/Israli food, as it seemed quite similar to other renditions of this cuisine, but this place was so good, packed some really nice flavor and executed very well.Let's start with the service and decor. Greeted with smiles all around from hostesses to waiters/waitresses to kitchen staff, you feel welcomed. The atmosphere is very intimate and alluring in both the environment and the food. The waiter we had was excellent. I'm sadden that I don't recall his name because he did a great job in explaining the menu and read us well in determining if we really like our food and drinks. Drink wise we started with the lemonnana. Quite refreshing and might have been better later in the night, but never the less it was a solid starter. After this, I had order a marble rye, but I did not enjoy this as much. The celery soda really caught me off guard and was a bit too carbonated/fizzy for me. Our waiter noticed my displeasure with the drink and offered another drink. This time asked some of my preferences and I received the smoked and famous. I'm starting to get familiar with mezcal and this was a solid drink. The smoky-ness from (what I believe was) the charcoal infused spirit was upfront, but not overpowering and with the chartreuse bringing the sweetness to even the sour/tart flavor. Excellent drink.Food wise we did the Tayim: Taste of Zahav to sample several things. I think this is a good choice if you're not decided on anything in particular and it gives quite a sampling of the menu. The meal started with the pickled items and salads which were all delicious: carrots, beets, etc. Some of the notable items were of the apps and mains were the following:Crispy Grape LeavesHouse Smoked SableDuck KebabLamb MerguezThe sable was quite good. Add an egg (my weakness) and boom, winner. The grape leaves were also quite tasty. The ground beef had a nice flavor and was easily the best graphe leaves I've ever had. Honestly... every item was great. Nothing but great things to say about this place. Absolutely stuffed at the end of the night.There's no wonder why Chef Michael Solomonov received a James Beard Award in 2011 for this place. Excellent all around."], ["Linda ..", "The positives:We reserved a spot, and when we walked in, were brought straight to our table, so that was nice that we didn't have to wait for our reservation. Our water glasses were never empty, as I think they had waiters reserved specifically for making sure that the water glasses were never empty. I liked that they waited until both parties were finished eating to clear the plates. Overall, the services was almost perfect, except for the very end (see below).Negatives:The food was so so. The hummus was amazing, with the exception of the butter hummus. It was very flavorless because the butter seemed to almost overwhelm the flavor of the chickpeas and the tahini. Would not recommend it. The chicken is dark chicken only-so if you don't like dark meat, don't get the chicken. At the very end, we were finishing our drinks and we weren't being slow with payment, but the waiter kept looking over my fiancee's shoulder when he walked by to see if my fiance was finished paying. We were just about to leave when the waiter came by and actually snapped up the payment in front my fiance's face, like he was frustrated that we had taken so long to get up and leave. We were finishing our drinks, and it took us about 5 extra minutes! It was a very rude thing to do and it really left a bad taste in our mouths considering that the rest of the service had been so great."], ["Julia B.", "In this foodie town this amazing Israeli restaurant is my #1. The food here is fresh, prepared with love and always makes me incredibly happy. The staff is on top of their game, always attentive to beverages, plates, dropped silverware and anything else one might need. I have been here several times and have never been disappointed. The only thing that ever disappoints is the difficulty in getting a reservation. My husband and I have started going in the middle of the week so that we can get in easier. Make sure you enjoy the humus and salatim. If you are there when they have the roasted lamb you definitely shouldn't miss out on that."], ["Jeff F.", "Authentic, fresh and a solid value, went for the sampler and could have fed 2-3.Smoked Sable, fried cauliflower and coffee chocolate dessert were standouts, along with the service and the overall energy in this bustling winner."], ["Eunni C.", "This restaurant is beautiful. Very pretty deco and service is great too. I heart middle eastern food and I have my favorite middle eastern place in NYC but now I am eager to find one in Philly. This place is the closest I can find for now. We tried tasting menu once, tried multiple small plate on the list. They were all decent but not mind blowing, more than anything I wasn't impressed by their hummus and falafel... Bummer.. Lamb shoulder was ran out so couldn't get it either. Second time we ordered lamb shoulder for 4 ppl. Woot woot! Was a lot of food since we ordered other plates as well. Ended up wrapping up left over and ate it for days haha."], ["David M.", "A unique and celebratory quiet restaurant that you should go to.First, If you're visiting you should get the multi-course meal.  This meal has too much food for you to eat, but because you're visiting you won't have a chance to try things again soon -- to try a reasonable amount of food or become pickier about the menu -- so you should try it all right right now!  I wish I lived in Philadelphia so I wouldn't feel the need to gorge when I eat here.The tastes and flavors cover a wide spectrum.  You're never quite sure what the next dish will taste-like.  This is a positive to me, demonstrating the wide-breadth of the kitchen but may cause problems for more studied or pickier eaters.  This also means that 'wrong' choices are unlikely: all the dishes are executed so well if you dislike something it's likely your own taste rather than something done poorly by the kitchen.The interior reminds me of something in a pleasant Californian town.  Ample auburn wood and windows overlooking a very non-city view reinforce that you're 'somewhere else' when you're in the restaurant.  This rare quality reinforces the breadth of the food."], ["Victoria C.", "Since there are loads of wonderful reviews for Zahav, this review will be of the plates I found most appetizing (skipping the salatim, hummus and laffa).Mezze: house smoked sable was my favorite! It's smoked fish atop a large fluffy slice of challah bread sandwiching a fried egg. Once you dig your spoon into the fish (actually they do it for you), you see the yolk ooze out slowly... So good, and also a bit salty (but I guess what else can be expected from smoked fish?)The crispy haloumi is good if you're looking for something heavier and filling. The duck hearts and fried cauliflower were very good, and I can see why the latter is a crowd favorite. I'd skip the raw lamb though.Al ha'esh: my personal favorite was the lamb merguez. It was so well sliced and flavorful (I could definitely taste the dashes of cumin)! The lamb came paired with roasted pumpkin seeds, sautéed mushrooms and squash.The sirloin was a bit salty for me, as was the babaganoush on the side. I also tried the kofte (meatballs), and they also had flavor, but what blew me away was the lamb.Dessert: I can't speak for many on this, but after having had so many intense flavor parties in my mouth, I was ready to finish with something lighter - the pear sorbet. I was expecting flavored ice, but it was actually very creamy -- I don't know how they did it! This came with small orange slices, pomegranate seeds, and granola on the side, and they all sat atop a sort of cinnamon-tasting, clear jelly. The dessert was very complicated for my taste buds at the end of a 2 hour meal, but I'm pretty sure it's because my palate isn't refined enough (lol).The kataifi and honey cake bread pudding are great if you want a larger and slightly heavier dessert! I was more than happy at the end of the long meal, and my advice would be to pace yourselves!Zahav is definitely a 5/5."], ["Kimberly D.", "Holy cow their hummus is awesome. We also ate the duck hearts which were quite tasty! This place has a really fabulous portrayal of middle eastern food. The service was great as was the ambiance. Will definitely come here again!"], ["Zac M.", "This place is really good, but pretty pricey.  The service can be a bit slow, but I think that is by design, as there are generally many different courses with the small plates, and is part of the experience.  I would recommend Zahav for a special occasion, as the food really is very tasty and diverse."], ["Jennifer M.", "This was an absolutely delicious experience! Atmosphere is inviting and the food is a true experience in itself. Textures mingle with fresh flavored and uniquely blended ingredients! Simple ingredients such as cauliflower and turnips come to life with their cooking techniques and ethnic flavor profiles. I will be back!"], ["Raj D.", "UPDATE:Following my complaint to the restaurant, I got an unexpected communication from Zahav's manager who had read the review. He went through it 'point-by-point 'and promised to fix the discrepancies - for instance, raising the topic of delays with the staff at their daily meetings and even amending the verbiage in the menu. I wasn't expecting it, and it is not every day that a busy restaurant like this takes time out to address concerns of a patron with detail at a personal level. Additionally, what I liked about the response was that it was not 'defensive', but rather appreciative - he acknowledged the concerns raised and was willing to resolve the issues (rather than disputing or trying to rationalise them). In light of this, I'd like to clarify a couple of items --- We were waiting for the waitress for eternity and not the hostess as such; and- The food is not the usual atypical middle eastern, but characteristically Israeli which is very close to Middle Eastern with a different touchThe service and follow-up from the manager makes a meaningful difference (and is by itself worthy of a Michelin star ! :-) and to respect and show appropriate value towards this, I have updated my erstwhile ranking for the restaurant. Well done and keep it up !------Food is OK. If you are looking for Middle Eastern food this is not it. The ambience is good. Place was crowded even on a Wednesday evening, ... And the service can be a bit rushed as a result. We were waiting for eternity before the hostess managed to come by and the service was lacking.Everything is Tapas - Small plates. There isn't really an entree section but the menu is divided into mezze (small plates) and al hayesh (which seems like the traditional entree section) but is actually also small plates - I think this should be made clearer in the menu so people can get a sense of the portions. They advertise rice pilaf with al hayesh, but it is not per plate. We ordered 4 al hayesh and it cam with 1 rice pilaf. You have to ask if you want the complete set (not sure why this is the case, you should be delivering food as per the menu)?!Salatim: it's huge. When the waitress told me it was small, I wasn't exactly expecting six small plates of salads. But that aside it had a good variety including eggplants, carrots, beans etc.Hummus is Average but salty. The preparation (serving) with the garnish looks very nice.Smoked Sable was terrific.Al Hayesh - No complaints - all were cooked and prepared to satisfaction."], ["Sanoj P.", "First off, I'm a huge carnivore. So when my wife told me about this place that we needed to try with great vegetarian options, I rolled my eyes. Secondly, I heard a lot of people say this place was really great, but I've been let down by other people's opinion - so, I was skeptical. Let me tell you how unreal the food is!SERVICE: We had made reservations and we went for our anniversary. I think my wife mentioned it when making the reservation. We were congratulated four times: hostess, waiter, manager, and the guy sitting next to us because of the other three. The waiter kept our table clean, plates were removed quickly, and they had the perfect amount of being around when necessary and out of the way as necessary. FOOD: Holy cow - the lamb was great. But I'm keeping it real here: the vegetarian dishes were absolutely phenomenal. I told my wife that if she cooked vegetables like this, I'd convert my eating habits that night! We had the chef's choice option and it was worth it. Everything that came out of the kitchen was spot on. And so much food! So much variety, and everything came out so tasty! I hate beets, but that beet dish was the best thing I've ever eaten. And their choice of wines was great! Our waiter hooked us up with the perfect choice of wine for the foods we were eating.EVERYTHING ELSE: Not nearly as expensive as some of the other 'big name' restaurants. Ambience was perfect: not too loud, but energetic.WRAP UP: Looking for probably one of the top three best restaurants, in a space that's got the perfect volume, with a great wine list and enough food to make up a few days of leftovers so you can relieve the experience? Zahav"], ["Lori B.", "First time eating at Zahav.  It was a Saturday night, 8:00pm.  We made no reservation, just walked in.  We had about a 10 minute wait for 2 people.  They told us there weren't  any tables available for the rest of the night, only bar seating.  So we sat at the bar, which was fine.  Not much space for all the food, but it worked.  I suggest making a reservation.  We ordered the \"Tayim\" which is $45pp which you can select a few things off the menu to try.  For our starters we had the Salatim and hummus with the laffa bread.  The bread was really good.  I am middle eastern so I make my own hummus so it's hard to say that theirs was good.  It was good, but not that good.  The arrangements of 6 small bowls came out and each one had its own special flavor.  Not too bad.  Next you pick four mezze and two entres with two desserts.   It was a lot of food for a decent price.  I would recommend eating here, but it's good for a one time thing.  I prob wouldn't go back just because it wasn't that special.  The staff was really nice also."], ["Sari G.", "The food is phenomenal as everyone knows. It most certainly lives up their incredible reputation which is why it's remained a super hot reservation in town. It has been on my wish list for for years! I mean years and years. And it will most certainly be on my regularly restaurant rotation.  A culinary explosion for your mouth. The tasting menu is by far the way to go. $45 for vegetarian. Easily made vegan. The gorgeous array of salads to share as soon as you sit down are so special and flavorful. Eggplant and beet to name a few. The most delicious pipping hot pita and creamy hummus greet you as well. Umm can I just sit and eat this stuff all day?!! Complimentary sparkling water fills your glass and then order yourself specialty cocktail or in my case a nice flute of rosé' to get you started. Then choose your courses. I can only speak for the vegetarian made vegan especially for me plates which are as follow: I eliminated the goat cheese on the watermelon salad with mint which was so fresh and made truly unique with the addition of the fried black olives. Wow. What clean flavor! I absolutely loved and could down an entire plate of the fried Cauliflower in tahini sauce with chives, dill and mint. The crimini mushrooms taken right off of the skewers in front of you with porcini tahini and pickled Swiss chard were perfectly smoked and insanely delicious. This is all served with fresh daily pickles and choice of dessert. Not listed on the menu but most absolutely should be was a blueberry with coconut cream sorbet topped with fresh blackberries, strawberries and toasted nuts. I literally moaned when I first tasted it!  A definite must! Extra points for the Citizen Cope playing when I walked through the door. Yesss! Great soundtrack too! Cannot wait to come back.  *free 2hr street parking until 10pm on Dock Street *minimally priced parking in Society Hill Towers parking lot in St James Place *take in a movie at The Ritz afterwards *stroll over to Spruce Street Harbor Park afterwards if the seasons allow. *take a romantic walk by the river.."], ["Josh B.", "A real treat! yes, it's expensive (for us). Yes, it's worth it!"], ["Su-Yee L.", "The bf and I came in here last night as a walk-in and only had to wait about 10-15 minutes! We were sat at the bar and pretty much immediately ordered the Tayim which is the $42 tasting.First of all, Chris, our main server was awesome. So friendly and knowledgeable but not overbearing. He gave us some great recommendations (LOVED the cobia crudo!)Okay, food-wise, everything was incredibly flavorful. People are right about the hummus (we got the masbacha although I was very very tempted by the Turkish hummus)--it was the smoothest, most delicious hummus I've ever had. The laffa was freshly baked and perfect for the hummus. And I LOVED the salatim selection. I don't even like carrots but I liked their carrots! We got twice-cooked eggplant, pickled napa cabbage with onions, green beans, beets, carrots, and roasted red peppers&carrots. Everything was delicious.At that point, we were already pretty full but still had a bunch of courses left! The marinated asparagus was tangy and salty from the bulgarian feta and I really liked the toasted hazelnuts on top. As I said before, I loved the cobia crudo which is a very different preparation of raw fish than what I'd had before, mainly in sushi restaurants. This one came with some spicy Turkish sauce and fava beans. The grilled halloumi was also great although I would have liked more pickled onions to cut the richness but that's just being nitpicky :) And the bf really loved the chicken kibbe which smelled and tasted amazing with a whiff of cinnamon.For our grilled plates, we got the duck kebab and the sirloin. The duck was a bit spicy and had a lot of different spices going on--I felt that I needed to eat some of the pickles we were given or rice after every bite of duck just to calm down my tastebuds! I liked it but I didn't quite expect it to be ground duck (like a duck meatball) and I tend to prefer regular duck pieces. The sirloin was amazing though! Really tender with a great crust.By the time dessert came around, I was so full I could barely take a few more bites! We got the carrot basbousa to go and we shared the Chocolate Halva Mousse. Really unique. I really liked the mousse with its sesame undertones although I thought the chocolate was a tad dry and crumbly. Zahav is amazing and the $42 tasting is a steal for how much food you get! I wish there was one like this in New York but I think they've spoiled me for other tasting menus!"], ["Alex B.", "So many reviews already but hows abouts one more? Gots to give some lovin to my peoples.  Love Israeli food and Zahav is certainly top notch.  I feel like I wanna go all Emeril and Guy status when describing this place.  Pow! Bam! Welcome to Flavortown!$42 for the tasting menu is a steal in my eyes after the $100 or more menus I am used to seeing.    Beeeeeee VERY careful though. You don't want to end up like me on your dining experience...  You get laffa and like 6 side salads and hummus.  Want more laffa?  No problem.  You get more laffa free of charge... \"Cool!\"  Except that you will be full before the appetizers and forced to undo that belt one notch.... \"Damn, not again.\"  Then apps come and you drool a bit and eat all of the delicious eggplant, cauliflower, duck hearts, beef stew, and lamb tartare but are like... \"oh crap, there still two more courses\" so you have to just undo the belt all together in prep for the main course. Main course comes and you barely make it through your deliciously spiced lamb merguez and sirloin steak.  At this point you take a sip of H-TWO-OHHH, wipe the sweat from your forehead before unbuttoning the top button of your jeans knowing dessert is on the way. \"Crap\" (this is what is going on in your mind and not the bathroom yet ... unfortunately).    Finally, dessert comes, a delicious icecream sandwich and coffee custard but there were so many other delicious ones to choose from.  After you pay the bill, you perform a risk assessment of the current sitch and decide to undo one more button.  You don't want a lawsuit on your plate in addition to all that awesome food because your second button shoots off and takes out the eye of some poor patron.  You know what? No regrets.  This place is awesome.  I would repeat the above scenario every day if I could.  No question in my mind that this place deserves 5 stars.  Awesome food, service, and ambiance. Can't wait to return."], ["Suzy D.", "4.5 starsOur meal at Zahav was easily in my top three meals of 2014, beat out only by Rose's Luxury in DC and Ink in LA. The food was beyond excellent. I just spent six months living in the Middle East and ate more than my fair share hummus; Zahav's blows all other hummuses (hummi?) out of the water. I'd never had warm hummus until our meal at Zahav but I highly, highly recommend giving it a shot. It brings out flavors that would otherwise be overlooked by the palate. The timing of the meal was the one element that was lacking. I wouldn't have even minded having somewhat extended waits between courses except that the temperature felt like an arctic cold had swept in and, given it was August, I hadn't brought a down parka with me. Had we had the beverage we had ordered to distract ourselves from the cold it may not have been so bad but between the wait and just how painfully cold the restaurant was, I have to dock it half a star.After our initial and promptly served round of cocktails (I had the Desert Rose with gin, hibiscus, grapefruit, and cucumber), we went for a pitcher of the very summery Lemonnana (Jim Bean, muddled mint, fresh lemon, verbena) and waited for it to arrive. Our food courses came and went and still we waited. It doesn't take that long to mix four ingredients yet we waited some more. We were close to the end of the savory portion of the meal by the time it arrived and, since there were only two of us, we had to drink faster than preferred to remain on course with the meal.We began with the Masbacha - the warm chickpea hummus. Unknown to us, this came accompanied by six small veggie side dishes. Seeing the spread of food before us, we knew that we probably shouldn't have ordered that in addition to the \"taste of Zahav\" menu for each of us. Regardless, it was delightful and the veggies were a nice treat with everything tasting very fresh.Zahav allows you to create your own tasting menu (two mezzes, one grill, one dessert for $42) which was perfect since we were able to try a sizable portion of the menu. Our four mezzes were the crispy grape leaves, fried cauliflower, Yemenite beef stew and konafi (cheese cubes). The first three were fabulous but we both found the konafi to be unpalatable. Justin ate a couple bites but I was done after one and only reluctantly swallowed that down. The GM inquired about the nearly-full plate and we said that we were glad to have tried it - it was certainly unique - but neither one of us cared for it. He insisted that he would bring us another dish of our choosing. We politely declined, afterall we were the ones who chose it, but he insisted and brought us the watermelon, feta and black olive salad. This ended up being the best of the five mezzes we had and we were very thankful for the generosity of the GM. For the grills we had duck and kofte, the latter being my favorite. And for dessert Justin chose the black forest mousse and I had the white chocolate custard with watermelon and hazelnuts. I generally dislike fruit in dessert but this dish blew me away. This was the best dessert I had all year and it was beautifully plated. Some of the menu here is seasonable but there are staple items that remain all year around. Regardless of what is on the menu when you visit you're sure to find a bunch of winning items...just remember to bring a sweater despite the temperature outside."], ["Neeraj J.", "It is hard to get a reservation here.  And, when reviews are this high, I have doubts that a place will live up to it's reputation.  Well, Zahav lives up it and then some.  Absolutely delicious food and great drinks.  I could eat here every week if it was possible.  If I had to nitpick, I would say that my entree was kind of small - next time I will probably stick to ordering several more small plates.  Make your reservation and patiently wait for the day - this is a meal that's worth waiting for!"], ["Maris F.", "I'd be a regular at Zahav if I lived in Philly. I love their decor, their laid back music, relaxed but upbeat atmosphere and I especially loved their food! The restaurant has an old world feel with a new world twist with its arched doors with large red drapes and large colored photos above the dining tables. You can definitely tell that the menu was put together by a James Beard award winning chef. We sipped on some yummy rose in a small lounge area upfront while waiting for a table at the bar. Once seated we ordered an array of dishes. My favorite was the crispy haloumi cheese with onions and a sweet and savory jam. I really enjoyed the salmon filet with its crispy skin, and the hummus paired well with their warm, soft bread. I was impressed with their complimentary ricotta and heirloom salad with picked veggies, it was amazing! The servers were engaging and attentive and they made our entire dining experience a five star experience. I will be back soon!"], ["Jonathan D.", "Can I give them 6 stars? I'd been wanting to go here for a couple of years, but now that I don't live in Philly anymore, opportunities are a bit fewer. Still, I'm in town a number of times a year, and my parents and I finally made it this past Tuesday. Wow. Just wow. We got the Mesibah menu, which is basically their version of an omakase. It began with 6 small dishes of salatim, which are little salad/pickled/Israeli antipasto type dishes. Among them were beets, eggplant, cabbage, string beans and carrots (I think the 6th dish combined a few things). Each one was incredibly fresh and like a little flavor explosion in your mouth. Next came hummus with fresh made (and grilled) laffa. Both were addictive and probably were the downfall of my parents, who got rather full later.Next came a trio of mezze. Ours were the crispy fried haloumi (sensational, came with dates, pickled onion), the house-smoked sable with challah and a fried egg (yum!) and fried cauliflower (easily the best iteration of that dish I've had). The main course was a beautiful shoulder of lamb that was falling apart tender, accompanied by pomegranate glazed chickpeas (could have used a few more of those) and this fascinating crispy rice (almost like a giant crispy cake). Fantastic flavors all around, and enough food to bring home for another meal for my folks.Dessert was a trio of gorgeous desserts, including their ice cream sandwich (it's so much more than that!), a carrot basboosa (with beautiful apricot in it) and a lovely dessert that rocked a chocolate ganache filling but was surprisingly airy. Will post some pictures to help bridge the gaps in my reporting.Service was on it. Not only was our server very friendly and knowledgeable, but water glasses were always kept full, and my mother was tickled that our table kept getting wiped between courses. The restaurant was bustling (well, when you're one of the best restaurants in the US, this isn't a shock). We sat in a room off the main room; only tiny issue was that it was a touch dark where we were, so I pulled out my cell phone to help my dad see the menu. But that's nothing when compared to an amazing, authentic meal with great service and a comfortable environment. Can't wait to go back!"], ["Liza K.", "My Elite Yelper friends said that Zahav was the best restaurant in Philadelphia - and I was SO glad I finally tried it.  Book ahead as they fill up fast! This is a quality restaurant that is what it purports to be - authentic and flavorful items that are unique and exciting.The short of it: Try the Fried Cauliflower and the Duck Hearts (if you're not squeamish) - they were by far the best and most exciting items we tried! Dessert was underwhelming, and the Cremini Mushrooms were too salty for our taste.The service was very friendly and helpful without being overbearing.  We had a lot of questions about menu items, and our waitress answered all our questions with confidence and in detail.  We trusted her recommendations and were glad we did.  Go for the Tayim - Taste of Zahav for $42 if you get the chance - it's really worth trying a lot of items on their menu.  **You can only do the tasting menu if everyone in your group chooses to do it, so peer pressure your friends into it!** It's a great deal and gives you the chance to take some culinary risks!I started with the Desert Rose drink, which had just the right amount of sweetness and wasn't too strong.  It was very complimentary to my meal.We started with the Laffa and classic Hummus. You can tell it's a recipe they've perfected over many years. Then they brought out the Salatim (a medley of different cold salads).  We both LOVED the eggplant one, and really all of them were pretty amazing. Just as an FYI, if you're ordering off the tasting menu, don't worry about getting too many veggies later on as you'll start with a good amount of healthy veggies here.For the Mezze/Small Plates, we tried the Crispy Grape Leaves, which are stuffed with ground beef and tomato, and served in a mild harissa tehina sauce.  It was an unusual take on one of my favorite dishes, and I liked the unexpected crispy texture (compared to the way that stuffed grape leaves/dolmas are normally served).The Yemenite Beef Stew came out next and was very tasty as well.  It comes with several pieces of roasted short rib and two potatoes.  The short rib was tender and juicy, in just the right amount of sauce that didn't overpower the meat itself.  Only came with two potatoes :( Between the cauliflower and Brussels sprouts, our waitress didn't hesitate: \"Go for the Fried Cauliflower, it's been on our menu unchanged since we opened. It's a favorite.\"  I'm SO glad we listened to her as this turned out to be my favorite dish of the meal. The cauliflower was fried and came with a labaneh sauce with chive, dill, mint and garlic.  I could have just stopped there and eat more cauliflower.  So delicious!  I don't want to go on and on about it, but give it a try!  I don't think you'll be disappointed.I also wanted to try something a bit more daring, and I'd heard people raving about their Grilled Duck Hearts on Yelp.  So thank you for your advice, Yelpers!  I'm glad I took it. The Duck Hearts aren't for the faint of heart - if you're squeamish, avoid the dish as it is just what it says, they serve you actual hearts of a duck.  I love trying new food, and neither was my date, but it still took me a minute to get over the fact that I was staring at four perfect little hearts on a plate.  If you're adventurous, definitely definitely try this dish!  The hearts were very tender and I really liked the unique texture - They came with pickled green tomatoes, and soft onion rings. If you've never tried it, I enthusiastically suggest that you try it!The Al Ha'esh/Grilled Over Coals items were least exciting in my opinion.  Maybe because I was already really full by then, but by the time they came out, I was kind of over them.  The Duck Kebab (duck leg that comes on a kebab stick). The server takes it off the stick for you, so I didn't manage to snap a picture of what it looked like in its original form.  It's served over a pistachio pilaf with pickled onions and fig jam. Not as exciting as the duck hearts.The Crimini Mushrooms, which were served over israeli couscous was my least favorite item- they went overboard with the salt. I rarely am unable to finish a dish, but quite honestly it made me a bit sick to eat something this salty.  I had been reading about their chocolate mousse and their rhubarb dessert in recent reviews, and neither one was on their menu.  :(  I was looking for something lighter after the heaviness and saltiness of the Crimini Mushroom dish. We settled on the Vanilla Custard and the Almond Chocolate Cake.  They were both ok, but I wished they had lighter options to balance the heavier dishes at the end.Overall, this is an amazing restaurant that offers unique dishes and a bit of an adventure for culinary risk-takers!  Peer-pressure your friends to get their Tasting Menu so you can get a well-rounded experience, although don't get your hopes up for dessert."], ["Grace H.", "Hands down my favorite restaurant in Philadelphia. I first came here with a friend and her parents with zero expectations, not knowing anything about the place. I've since returned over 5 times. ALWAYS do the salatim. Always. Although I think you could opt for the small and be fine, even with a larger party. The hummus isn't particularly memorable, but definitely a solid choice. The roasted brussel sprouts and fried cauliflower are always a must for me. And I'm usually not a big lamb eater, but I make an exception for their pastilla - super flaky and tender.The sirloin steak is probably my favorite Al Ha'esh option, although the kofte and cremini mushrooms are both delicious as well.I would give Zahav 5 stars, but one time I brought my cousins from Korea and everything was overly salty. Apparently the head chef was out and I think I drank 4 glasses of water that day - needless to say I was a bit disappointed. But otherwise a really great restaurant with a sexy ambience and amazing food!"], ["Kathleen D.", "Oh, Zahav. What can I say about you that hasn't been said hundreds of times before? ...Likely nothing. This entrance-statement has probably even been said before.I *can* yak about your wonderful Restaurant Week deal. I can tell everyone that I had one of the best meals of my entire life here. I can even reiterate the fact that when I got home last night, I didn't move an inch for a good hour.Last night was like Yelp-night at Zahav, I tell you. There were several of us spread around the restaurant without actually planning it out that way. At our table, fellow Yelper Ashley S. and I were mind-blown by the amount of food given to us -- despite seeing the reviews ahead of time. This may have been the longest meal of my life, having clocked in at 2.5 hours.First there was the salatim and hummus and laffa bread. I loved the beets especially. Then came the cauliflower, chicken that tasted like Christmas, grape leaves, and haloumi. After that, I had the ribeye -- medium rare, as they suggested. Chocolate mousse for dessert.Oh, and also a Desert Rose (gin) cocktail. Always the gin.Servers were super professional and ready to swoop in with fresh plates and silverware (and also boxes...) when we were done each course. The manager was also very friendly. He asked me where I purchased my change purse since it was clearly Turkish. When he said, \"I hope to see you again,\" I awkwardly replied, \"You too,\" instead of \"Thank you,\" and I'm not even ashamed, because I must go back. They even gave a $10 off return coupon. So really. I will return. Who wants to go? I'm serious."], ["Yayi Z.", "My boyfriend and I went in February for their special \"Lamb Shack\" month where they served their signature dish pomegranate lamb shoulder with a pre-fixed menu for $36 per person. Overall, I have to say I wasn't blown away by this flagship dish. I have no doubt the preparation for this massive chunk of meat takes days, and it does come right off the bones and melts in your mouth. But at the same time, it is greasy and over salted. We couldn't finish the whole shoulder and the leftover that we took home was covered by a white layer of grease after sitting in the fridge overnight. Other than that, the ambiance was great, service was very professional, and we very much enjoyed the small dishes served in the beginning."], ["Jules L.", "**Neighborhood Gem**Zahav is a true gem. Food: Terrific- Superb middle-eastern food, well presented and carefully served.Service: Impeccable service. Knowledgeable wait staffAtmosphere: Fun, loud, and LivelyMake sure you book your reservations weeks or months ahead of time. Place is always booked! VALET: you can valet at Positano Coast which is literally across the street. Just let them know you are dining at Zahav"], ["Aditi M.", "A very fine restaurant with a unique simple elegant ambience and very proper service. I was somehow not so happy with the food and felt that most of the items that we ordered was high on salt. I went there on my birthday and we were 4 people. So, we did order a lot of food and atleast 3 items were high on salt. I loved the mushroom entree though.!"], ["Callie S.", "Definitely one of the best meals I've ever had. The salads were delicious - beet salad especially and I don't even like beets. Loved the hummus and the crispy haloumi. Both were perfect. Splurge and get the tasting menu. You won't regret it. GO."], ["Monica Q.", "So fantastic! But warning, the meal portions get smaller and smaller as the courses progress...That being said, get the taste of salads and the hummus. Every single one of the salads was roasted to perfection and so delicious. Even my meat eating male friends were digging the roasted veggies! For the mezze, get the haloumi. Even non cheese lovers will love this! We also got the crudo and the kibbe naya. Don't be put off by the raw lamb description because it is absolutely delicious. For the final course, we had the duck kebab, lamb kofte, eggplant, and sirloin. Duck was a little salty but the lamb kofte knocked it out of the park. Fantastic.This restaurant is everything that people say it is! Just be ready to order more food if need be!"], ["Mike C.", "My fiancé and I dined at Zahav last evening for the first time and had a truly memorable and delicious experience.  Though we did not have a reservation, we braved a walk-in at 5:30pm (the restaurant opens at 5pm) and tried to snag a seat at the bar.  Although the restaurant was nearly fully booked for the night, the manager, John, was able to help find us a great table by the bar - thus beginning our epic meal.  We started off the meal with a few cocktails, the Marble Rye and the Smoked and Famous.  The Marble Rye, a rye based cocktail, was truly unique with flavors of pumpernickel that shined through.  The Smoked and Famous, mescal based, was a nice start to the evening and a nice way to whet the pallet.  For the meal, we opted for Zahav's tasting menu, the Tayim \"Taste of Zahav\".  I would highly recommend the tasting as it allows you to try several different options on the menu.  Some of the highlights included:  Crispy grape leavesWatermelon saladTurkish hummusSalatim (a collection of Israeli salads - the eggplant and the beats were excellent)Grilled haloumiFor entrees, we had the Chicken Shislik and the Beef and Lamb Kofte, both from the grill.  Overall, the flavors were vibrant and full, yet the food was elegant and pure.  Each dish came together with robust flavors and  ingredients that worked well side by side. The tastes of herbs, olive oils and tahini really complimented the food well. We also loved the desert, semifreddo and coffee custard alongside Turkish coffees and (surprise from the waitress!) a warm custard baklava.Alina was an excellent waitress and really made our first experience a special one.  The entire staff was very professional, welcoming and courteous.  Chef Michael Solomonov was present and making rounds.  The staff seemed genuinely interested in making everyone's experience enjoyable.Great restaurant! A must visit!"], ["Susan K.", "I went to Zahav for their February special, Lamb Shack.  Despite the freezing cold Philadelphia weather,  Zahav staff managed to create a cozy, romantic, and classy atmosphere.  When I found out we were going to Philly, I already knew we had to make a reservation for Zahav.  At the time I called, they were booked solid.  I was totally bummed but proceeded  to make plan for the trip.  Fast forward to Thursday, Feb. 19th.  I was compelled to call and find out if there was any cancellations, risking the plans I already had. Fortunately, I managed to get a 5:30 pm reservation ( Thank you, to the person that cancelled). As I stated in the beginning, the ambiance was cozy, romantic and very classy!  The hostess was very personable and friendly, and I was impressed by the attentiveness of the servers.  Food was fantastic.  I really enjoyed to the hummus and the freshly baked pita bread.   First Course: The hummus and pita together is an experience for your palette.  If your palette can talk, it would say, \" Oh my goodness! What is that amazing sensation.\"  You'll have to close your eyes and eat more!  That came with the salatim.  The salatim consisted of the following: roasted eggplant, marinated carrots, tabbouleh, beets and tahini, and something that slipped my mind but it was a great contrast to the lamb shoulder.  Main Course: Colorado Lamb Shoulders with Pomegranate and Chickpeas.  I cannot help notice my companion pull the meat easily off.  The lamb was so tender.  I have to say it gave a good contrast to the first course, because of the sweetness of the dish.  I also had the server save the tangy salad so it will cut the fatty taste the lamb had.  Dessert:  Chocolate Konafi  with Passion Fruit.  I have to say Solomonov and staff sure know how to keep the guest' s pallette interested.  It like they were saying for the back house, \" So you liked the lamb... and wait! There is more...\"! Tip: Order the Mint Tea with the dessert! It's a great intimate setting so go and bring your Mr. Right or Mr. Right-Now. It works both ways,  Or bring a friend that you totally can have a intimate conversation with. Just we wary of people watchers like me who tend to wander their ears, because the seating was too close together.  Yes! Seating didn't really give privacy to the guest. I realized that by the end of the night, because I felt like I had a date with the two guys who sat next to us.  LOL Hey!  Sorry,  Two-guys who were on their second date.  I hope you guys go to Zahav again for your third date! LOL"], ["Eric J.", "Incredible.This was just one of those dining experiences you just don't forget. Came here for an early bird dinner at 5:30pm, mostly due to the lack of availability. This actually worked out well, because we enjoyed the abundance of natural light in the restaurant. Our waiter was very attentive, friendly and even comical at times. He challenged us to eat the entire lamb shoulder, which he claimed had never been done before. Hoookay.Ummm, also, how have I never had Turkish hummus before? The warmed hummus we got was so silky and buttery, I just had an incredulous look on my face as I was eating it. We ordered the lamb shoulder prix fixe, which is usually only for parties of 4, but you can get it for 2, at the expense of a couple mezze. So yeah, we definitely hit that one hard. The lamb was fall-off-the-bone delicious, and the fried cauliflower with mint and labneh was delicious. We also ordered the crispy haloumi, which we were assured came directly from Cyprus, because apparently that's a thing. We ate about half the lamb and got the rest to go. The lamb kept very well and we actually made pulled lamb tacos the next day. Holy moly. We also watched Michael Solomonov come out the kitchen, and shear some grilled foie gras tableside at one of our neighboring tables. While it looked delicious, we just couldn't imagine eating anymore.Dessert was very good. We got the konafi, and the almond chocolate cake. Chocolate cake was very good and the almond flavor was unreal.Yeahhh, you need to go here. I will be back, even for that early bird dinner."], ["Li S.", "This was my first time trying Israeli food and it was phenomenal! All of their food is small plates. I went with a large group and we ordered a bunch of items; loved all of them except the chicken. Here's what we got:-Tehnia Hummus - loved it! It comes with Laffa which is very good-Turkish hummus - what doesn't taste good with butter and garlic?!-Walnt kale tabbouleh - I've never tried kale tabbouleh and it was a very interesting combo. -Fried cauliflower - you will not be disappointed. -Grilled haloumi - I cannot explain the flavors of this dish but my far one my fav at Zahav. It's got a smoky, salty, sweet mix.Chicken shishlik - was not impressed at all. it was very bland.Eggplant - also amazing!Crimini mushrooms - loved this dish as well.Lamb Merguez - this was also one of my other favorite dishes!kibbe naya - i didn't try this dish but my friends raved about it as well!"]], "Giovani's Bar & Grill": [["John D.", "Great staff and good pizza. This is a great place for delivery pizza. One time the delivery guy couldn't make it to our house on time so the owner came to deliver it himself which earns the five stars alone. The pizza and food are pretty good. The ingredients are fresh. One thing I would say it is a little two loud when you sit in the restaurant part. Their was music that drowned out the conversation of the table but other than that it's great. I recommend trying the Hawaiian or the bbq pizzas. Yum."], ["Michael H.", "Tasty food at a really good price! Ordered the Greek falafel pita AND a stromboli cuz it had been a long day and trail mix was my only previous meal. Pita was awesome (maybe some more tzatziki sauce would have been nice) and I downed it quickly. Stromboli was the next to go, but I could only get thru half of it. I gave it a solid run though! Still the price was worth it even without the leftovers I know I've got. This place is worth a look if you're in the neighborhood."], ["Erica M.", "Today, I was craving a salad and \"Yelp\" came through for me with this one. It was not packed when I arrived a little after noon for pick-up. I ordered the Antipasto Salad. I will give the salad a 3 out of 5 because I have had better antipasto but the serving size is just right and the garlic bread they give you on the side is good (soft and warm). However, the pizzas look and smell amazing and I might return this week to try a slice...I am guessing this is what they are known for. The price was resemble for a salad-- $9--and the cashier was sweet."], ["Gil C.", "Looked down across the street from the apartment we were staying in and saw this place.  Ran down and ordered large pie.  Made fresh and done very quickly.  We took it back up to the apartment and tore it up. It was definitely as good as a NY pie."], ["Mary Kate R.", "We ordered Pesto Chicken pizza and veggie pizza delivery from Giovani's this weekend and we were really disappointed. Firstly, they claimed 45-60 minutes for delivery and it took closer to an hour and a half. I would have been okay with that had the pizza been good, but it was borderline terrible. The pesto pizza had no pesto on it and the flavor was very bland. The veggie was decent however the olives were extremely overwhelming and it contained mushrooms (which I hate and was not specified on the menu). There are definitely better places to order a cheap pie on a Friday night. I will not be ordering from here again."], ["Peter N.", "This place gets pretty bumping during the lunch hour.... and for good reason.  Formerly the Falafel Bar, I stuck with the former offerings and opted for the Greek Falafel pita.  Amazing!  Packed with deliciousness and tatziki sauce, this sandwich really got my stuffed. This will definitely be my go-to order from here. And it's only $6, which I think is a great bargain lunch that's NOT from a truck.I also got the French fries, but found it to be a little too soggy.  This caused the fries to taste like oil. I only got it because I thought the pita wasn't enough food.  But alas, I was wrong. Next time, I'll skip the fries.Their pizzas look very good and seem to be hot sellers. But the real hit for me was the pita. It took awhile for my order, but there are high top tables and TVs to keep one entertained while waiting.There's also a bar in the back, so an afterwork visit here is due. Expect an additional update come happy hour season!"], ["Justin B.", "Never disappoints. Without a doubt the cities best slice and the closest I have come to getting a slice of new york/jersey. These guys have been around for years and know how to do it right. The bar is nice addition too!"], ["Stephanie S.", "I've previously reviewed the Falafel Bar at 3 stars, and haven't reviewed Giovani pizza, but merging them together, and adding a bar, huge TVs, and cheap Happy Hour beer prices deserves 4 stars to me!  What a great idea... Merge both pizza and Falafel, dine-in or carry out, and add beer!?  Genius.  The pizza is similar to other quick easy pizza places around, lots of choices for carry out during lunch break.  The Falafel is good, I usually get the Falafel pita with hummus and tomato/cucumber salad.  Now that they have a bar, $3 happy hour beer specials is awesome, and they are open late night now, 2am on Saturday nights to draw the drinking crowd. The staff were friendly, pretty awesome explaining the merger and new business.  I hope they do well, ill be back soon!! Can't wait to drink some cheap HH beers :)"], ["Lindsay C.", "Just visited the new location today and was pleasantly surprised! I had been missing my favorite falafel place all winter and was happy to see it opened and joined with a great pizza place! Today we ordered falafel pita sandwiches and a falafel salad! The falafel was great and the the pita sandwich was overflowing :) Both were made to order and the freshness was much appreciated! The salad was gorgeous and tasty! We did not have room for pizza but will be back for sure as the pizzas looked great - lots of variety in pie toppings and all were artfully crafted. The new location has potential with a modern layout, great food and drinks. We will definitely be back for some more!"], ["Jenny K.", "I came here for a stop during the mojito march and i was impressed! This place doesn't look like a bar from the outside at all, seeing all the slices and pizza laid out in the front. I was impressed with the bartenders here actually taking the time to make the mojitos flavored and finding lime juice etc. I got to have a sicilian slice here and it was realllllllllllllllly good."], ["Julia C.", "This is a great lunch time option. They newly renovated the space and it looks very nice. They have Brick Oven and Sicilian Pizza, Sandwiches, Calzones, Stromboli, Pasta, Salads and then they have Vegetarian Mediteranean Menu! Falafel, Veggie Burgers, Paninis, Platters and Salads. So, on the day I came in, I ordered from this menu: I had a Greek Panini, side salad. It was tasty, filling and a healthy option. I will come back to try my italian side. Pizza, etc.Staff is friendly, and they give you quick,courteous service on a busy lunch hour.They also do catering.  I shall return with my friends."], ["Brandon A.", "Great place for lunch an a place to grab a beer after work... Great cheesesteak pizza. So many TV'S."], ["Irene C.", "I was visiting Philly from DC and I needed a break after shopping so I sat down at the bar at the back of the restaurant. The front is the pizza counter and kitchen, the back is a proper bar. I had a cider with a slice of pizza while watching all the college football games and post-season baseball. The bar had an outlet right near my knees which was awesome because I could charge my phone. Great bartender service. I'll be back if I'm ever in Philly."], ["JOSE R.", "Pretty  good food... pizzia is on point... and the drinks are great... good prices and great staff"], ["Shamshiri C.", "Very good cheese steak sandwich ! Much better than those big names out there in Philly"], ["Thomas S.", "Cool bar in the back, pizza in the front. The pizza was very good and they had reasonably priced drinks and a few big screen TVs for watching sports. Yum"], ["David S.", "Stopped in for a quick piece of pizza.  Lots of choices, friendly, clean!  Did not disappoint."], ["Alyssa R.", "Recently ordered delivery from here. Food came quick and was hot. Great pizza! I've also stopped in for random slices in a Sunday night. Great pizza place in the neighborhood. I recommend checking it out."], ["Laura W.", "For takeout pizza, couldn't be beat. Fast and delish, plenty of mozzerella, sauce and toppings and a slightly chewy crust. These are big pies with a specialty pizza flair. Fast delivery and made it right to my front door, which isn't easy because there's a security system."], ["Davis C.", "Looks like pizza place in front but has nice bar with multiple flat screen TV in back bar area. Staff was super nice and pizza and wrap were really good and reasonably priced."]], "Hummus Grill": [["Sari A.", "When it comes to lunch, half of the battle is solving \"what should I get for lunch?\" With the colder months approaching, looking for a lunch spot will always be daunting. Hummus Grill is just around-the-corner from where I work, and a meal from there, will hit the spot every bite. And, it's easy on the wallet too.I've picked this two dishes for you to try:- Shawarma sandwich: Tasty and spicy shaved grilled chicken sandwich. I prefer my sandwich in a wrap, with everything on it: hummus, lettuce, tomato, cucumber, cabbage, onion, hot sauce, and tahini.- Combination platter is the perfect choice for the indecisive people. This platter will give you a taste of the Middle East. It's pretty solid with the falafel & your choice of meat ( I always go with shawarma.) Also, it come with your choice of three sides ( tomatoes & cucumbers, cabbage, eggplant, beets, carrots, potato salad, hummus, and tabouli, or baba ganoush. And whichever you choose, I guarantee you will enjoy it.Four Yelps."], ["Lauren C.", "Swung by here for lunch the other day.  I got the salmon platter, and for $12 I received a piece of salmon that lasted 2 lunches over an equally as impressive bed of rice, a fresh piece of pita bread, hummus, tabouli and eggplant (my choice of an array of sides), a clinatro-lime creamy sauce and a more spicy salsa-like sauce.  It's a pretty healthy sized lunch... and also a pretty healthy lunch which i felt good about.  The salmon was fresh, cooked very well, and kept me full all day.  The rice was very aromatic and delicious.  The eggplant was fried and warm, and the hummus and tabouli were pretty much a dream.  I took pieces of the pita and made little sandwiches.  Overall, i really enjoyed my lunch.  I'd come back here in a heartbeat!"], ["Jane P.", "After reading the reviews a places an order for delivery for the chicken kabob platter and a chicken sharwma pita.  I also got a side of hummus and baklava.  The chicken dishes were good but just a bit dry.  Their white sauce was a greenish sauce and it was good but not the same.  The hummus was totally bland though.  However the pita that came with it was amazing. It w"], ["Tasneema A.", "The kabobs were delicious - the flavor was there and the kabobs were not dry. The customer service was super nice also, definitely will go back again!"], ["Lolly G.", "So I have to admit I've seen this location in University City numerous times, and it always gave me the \"college fast food vibe.\"  With so many great spots like this (mamas etc) that are good, I never gave this place a chance.  While sick, I didn't want to venture too far away to get a good sandwich.  This place came up on my app, and I walked the couple of blocks to grab lunch.  Speaking of apps, if you check in here you get $1 off a dinner sandwich.  I saved that one to use later.  I ordered a falafel sandwhich.  He asked if I wanted \"everything\" which is cucumbers, cabbage, hummus, hot sauce, lettuce, tomato, and onions.  I was the only one in here and lunch which made me pretty nervous.  In a couple of minutes I was served, and I was pretty surprised.  This really hit the spot.  I'm not going to say that every ingredient was the freshest, but it was good and for $5.50 you won't hear me complain.  The only part I didn't like was the fact that at the end the pita was soggy.  It was from the hot sauce which when applied once you get the sandwich is pretty watered down.  This place is fast, cheap, healthy, and leaves you full without feeling grossed out.  I will be back."], ["Matt M.", "Mediocre at best.  Kibbeh on the appetizer list was mushy and tasted nothing like kibbeh.  The filling inside It was sweat.  Use beef!!  The tabbouleh salad had NO lemon or oil in it which left it tasting like a bitter kale salad. As I took a look into the kitchen it ALL made sense. There is a Mexican guy cooking Mediterranean food.  Folks this never ever works out.  MediMexican food = fail!!!!Take a look at my other reviews. Enjoy eating."], ["Brittnie K.", "I've been \"meh\" about this place since I moved to philly but the rice bowl deal has just won me over. Good price, comes with a drink and delicious! Only missing some hummus to top it off"], ["Tara G.", "I ordered lunch from Hummus the other day with a friend at work. We used Grub Hub and it made it to our office in Olde City only 20 minutes after we ordered it. I had the falafel platter, and it was really delicious. The falafel was crispy on the outside with plenty of texture on the inside- just how I like it. I had the hummus on the side,  which was perfectly creamy and balanced. You also get to choose two little side salads, so I went with the cucumber & tomatoes and the tabouleh. Both were really bright and fresh tasting, and the perfect contrast to the richness of the falafel and hummus. My only gripe was that the little cup of tahini I received was definitely watered down. It had no flavor at all and literally pored like water. Come on, guys, you can do better than that. I'll definitely order again, but stop doing that!"], ["Jacob A.", "I got the falafel wrap (my go-to at Mediterranean restaurants), and was not disappointed.  I did not do any substitutions.  The pita was good quality, and the falafel itself was well seasoned.  They add a little bit of heat to the sandwich, and it was calibrated perfectly.  It did seem a bit dry some bites, but it wasn't a huge detractor.  Overall my biggest complaint was that I wanted more when I was finished!  Don't get me wrong, they gave a good portion, it was really just that good!"], ["Brandon F.", "Food was fast, cheap & delicious! I had the combo platter, with rice, beef carrots, eggplant and hummus. GET THE EGGPLANT!! Very clean and pleasant environment. Will definitely be back for more!"], ["Zoe P.", "There are many really fantastic Mediterranean places in Philly, but they're generally further afield of Center City. Hummus Grill is located pretty much smack dab in the middle, and it's easy accessibility makes it pretty popular with the general population - not to mention the reasonable prices. Staff here at this casual eatery are friendly. The food is solid too - nothing spectacular to write home about, but you won't be disappointed with the cost/quality. We typically get their platters, which is a fair amount of food: pita (solid), we go with the rice instead of fries, and your choice of three sides. My favorites are the beets, carrots, eggplant, and cabbage - hummus is fine, as is the baba ghanoush, but not as good as other places. The falafel is tasty and satisfying, although we prefer the chicken shawarma above all else (salmon is good but occasionally overcooked, and the kebabs can sometimes be a little dry). I've also enjoyed their salads, especially the salad plate. Great lunch spot right by the hospitals."], ["Jo L.", "I went the first time and had the Lamb Kabob sandwich $8.95 that I really enjoyed. They stuff the pita so much you'd have to eat it with a folk first. The Baklava for $1.95 was pretty good too. I was so excited to see they had it because I haven't had one in a long time!However, the 2nd time I came back & brought my friends, it was a disappointment. I had the Chicken Kabob $7.95 sandwich this time. It was dry & just not as good as last time..Probably won't be back.. Sadly because I was very excited about a hummus place!"], ["Lori S.", "The food was delicious and reasonably priced.  I had the salmon (overcooked but still yummy) platter on brown rice with (3 sides): tabouli, cucumber-tomato, and OF COURSE hummus with a whole wheat pita.  The hummus was creamy and not garlicky-yay!  I think it was about $9.95 and I will be back."], ["Gemma B.", "The Hummus Grill is affordable and I don't feel terrible about myself after eating here!You can get a lot of food for under $15.00. If you want your quick hummus fix I suggest this place."], ["N W.", "Average food for the price.  Good for a quick lunch and their takeout is great.  They have a loyalty card and once you visit a certain number of times you can then get so much worth of free food.  Friendly service.  Just nothing spectacular."], ["Tiya B.", "This food was really  really bad. I was really hungry but I couldn't even force myself to eat this horrible  food. The chicken shawarma and baba ganoush had a weird kick to it. I thought I was imagining it but my friend made the same comment. We concluded that the food had to be old. The tomato and cucumber salad had no seasoning. I mean not even basic salt and pepper.  I couldn't even mess with that greasy hummus. How do you mess up hummus? I really hope we don't get sick.  Delivery took an hour. I only ordered from here because of high reviews on grub hub.  This was a complete fail."], ["Juliana K.", "3.5 stars!  delicious place to grab a bite. Clean place (just opened) and very friendly service. Shawarma is okay- a bit dry and not as flavorful as I would have hoped. Salad is very large and full of veggies. I like the lemony dressing. The falafel is pretty good. The beef kabob was delicious! Platters come with two sides and rice. Hummas and cabbage sides were really good!They have a nice Shwarma bowl deal with rice, beets, and cucumber salad that is $7. great deal.Prices are very good for the amount of food you get."], ["Justin L.", "Stopped by for lunch and ordered the falafel plate with rice, carrots, tomatoes, hummus and pita.The food and service were good, dont get me wrong, but did not sway my allegiance away from  Allyans in Queens Village and a couple falafel carts near Independence Mall."], ["Lan H.", "Oh yes, I love Hummus Grill as it fulfills my workday lunch fix :-)It actually took me three tries to realize which platter style I actually liked.  This isn't due to its inability to make good food - oh, it's GOOD - but it's due to the variety of dishes and side dishes that Hummus Grill offers!  Ok, here's my ultimate combo: the lamb kabob with a wheat pita - which is soooo fluffy! - and three sides: tabouli, beets (!!!), and french fries.  Ok, so, the french fries should actually change into something healthier, but sometimes work is stressful ;-)  Ok ok, enough of me taking your diet to the dark side...I haven't tried any non-platters, but I'm sure that they make them with love.  Thanks, Hummus Grill, for bringing us more non-falafel (though they do have them), Mediterranean food!"], ["Sylvian F.", "service was great.  Place looks nice.  Platters are massive and everything was fresh and tasty.  Yummy whole wheat naan bread.  Fries got a little soggy - but that was take out - I'm sure they are quite good in house.  Fried eggplant was very good - a bit rich (so thin they are basically deep fried potatoe chips, but tasty nonetheless).  I do wish you could get falaffel as a platter side.  Also, the beef kababs are kind of sausage-esque. They were not what I was expecting, but middle eastern food can be quite diverse - perhaps this type of beef sausage is traditional / regional."], ["Anna M.", "The lamb was probably the best meat I've ever put in my mouth. The baklava was phenomenal. The staff was so incredibly friendly. Great food and great experience."], ["Stephanie D.", "been here several times and the people working  here are always friendly, warm and helpful.loved the shwarma, but disappointed that the dark meat chicken (the best part) is layered with lamb fat...so be aware if you choose not to eat red meat, especially lamb, choose something else!s.d."], ["charles g.", "A center city branch of the west Philly place.   Awesome chicken shawarma!!!!   Everything is delicious.  Really glad it's here.  I expect that I will coming over often.  It's a long hike from my office, but it is some of the best middle eastern in town."], ["Dave A.", "best falafel in the city. the falafel patties are nice and soft. not too expensive."]], "Bitar's": [], "Estia": []}