{"Loco Pez": [["Chelsea A.", "The food is so good. I'm a huge Mexican food fan, and I've been coming here for years.The service is always so nice and useful. This time my man and I got the nachos to start with, which are absolutely huge, and amazing. We got a ton of tacos after that, my favorite is the al pastor! The octopus taco was a special for the night too, really good. You can't go wrong with trying one of each.Flan could be better :( but hey, you shouldn't even have room for dessert after all the tacos you eat!The building itself has some character, feels so cozy and fun."], ["Khumo S.", "I mean what is there not to like about this place??? Food is amazing, drinks are great and every time I have ordered out the order is ready within 10mins!"], ["Ravi A.", "Quite a hike for us - since we are closer to old city - but was definitely worth the cab ride.  Mixed drinks were excellent - i especially liked the monte carlo.  Shot of tequila given with a chaser of bloody mary mix (something like that).  Food was awesome - we tried every kind of taco there as well as the burrito.  Its a very chilled out place - good for groups as well as families.definitely going to try and go back"], ["Essence F.", "Rarely do you find quality fare with lost cost- this place however sets the standard! Not only do the tacos range from $1.85-$3.00 each, the taste is superb! Do yourself a favor and visit this place! It is a quaint space and the decor makes you feel like you stepped into a friend's cozy basement. I had the grapefruit soda and it paired well with my selection of tacos (fish and seitain/mushroom). Service was good, no complaints. I will DEFINITELY be returning in the near future, maybe I'll get a burrito next time!"], ["Amy S.", "Enjoyed my beef stew special & the margs were top notch. Kiss pinball machine added the 5th star"], ["Mike W.", "Stopped here on Saturday while I was on a bike ride called the tour de taco. 20 miles, 10 taco stops. This was stop 10. I took the strategy of one at each stop which was pretty ambitious. Here I wound up ordering the al pastor taco. It is one of my favorite styles of taco, and I hadnt tried it yet that day, so I gave it a shot. I also ordered a classic margarita, because my friend had told me they were his favorites in town.While I cant say it was my favorite, (see my review on Sancho Pistolas), it was a very well done margarita. Again rocks all the way, and always salt on the rim. I sucked down another two of these bad boys quickly. I also scarfed down the taco. Thank god it was small because I had 9 others inside me already. The flavor was really good though. It had really nice sweet a spice to it. The little tortillas were packed full of al pastor goodness. The decoration was really weird and not at all what I was expecting, but I am glad I the name makes more sense now...Pez dispensers everywhere. Its a really fun atmosphere.I would definitely come back again."], ["Kaysey W.", "I absolutely love this place, great atmosphere, staff, food and drinks! What else is there? A plus, happy hour specials are legit and they have $1 tacos once a week. My favorite taco place in the city, I never leave disappointed."], ["Elizabeth D.", "Great little hidden place. My boyfriend and I stumbled upon this place tonight. We got the beef nachos, a chicken quesdilla, a beef burrito and a shrimp taco.the food was very good. The staff is very attentive and nice. The reason why I gave this place a four star is because I was kid of disappointed with my shrimp taco. I was expecting a hot crispy shrimp on a delicious taco but the shrimp I got was cold and soggy. It wasn't bad but it wasn't the best. Other than that this place is a hidden gem."], ["Valentino G.", "Me and my girlfriend came here one night to get some margaritas and some food and I have to say I was really impressed, the food was awesome, we were sat right away. I ended up getting a Carne Asada Burrito and it was huge! Enough to share between two people, but I wasn't sharing that night! My girlfriend ended up getting the Pez Tacos and she loved them! I love that we get fresh salsa and chips to munch on while we sit and wait and the service was very good. Our waitress made sure we had drinks and checked on us constantly. It was a nice night out for some good food and some strong drinks after a long week. They're cash only so don't forget to tap mac! We will be back !"], ["Martin M.", "They love tips $100"], ["Josie L.", "We had just walked in - put our names on the wait list- meandered to the bar and asked for a cheap beer. Before even glancing at us or noting that we were committed for the night ( and live in the neighborhood) the bartender har-har-har-d at us and told us to go across the street. So we did! And with minimal regrets after I've written this review, I'm happy to say that we- and the people I've told about this unfortunate experience- will not return because faux Mexican in fish town is not worth the popularity contest!"], ["Leslie W.", "$1 tacos (seems to usually be tues or weds,  check their Facebook!) that are delicious! My favorite tacos in Philly but they are pretty far from me so I don't get out there often.  Their drinks are decent and they have some cheaper beers,  but I would go here mainly for their tacos,  full or at the discounted price because they are just as delicious either way.  The Camerones tacos are my favorite!"], ["Mallory D.", "I must have missed the Loco Pez Kool Aid, because i just don't get it. I will say the Kenzo nachos are pretty fabulous, but that's where it begins and ends for me.Nothing has ever been outright bad, but nothing blows me away either. The quesadillas are the saddest looking things anyone has ever seen.  I'd actually prefer a Taco Bell quesadilla over the one served at Loco Pez. It was basically a tortilla with a little smattering of melted cheese and shrimp so tiny they could be mistaken for sea monkeys. The lettuce, tomato, and sour cream are on the side, so you essentially have to make your own quesadilla.I ordered a shrimp burrito which was aight...but I have had better burritos at chipotle.Drinks are pretty good, if a little on the expensive side. I quite like the Fairlane. I'm thinking that Loco Pez is probably five stars in dollar taco night.  But every other night of the week, it's just ok."], ["Emmett M.", "Tacos for cheap, and a tasty margaritaDon't take the four star rating too literally, just know that I truly like this spot but can't just give it five stars because of my infatuation; it's not that kind of place... think of your general corner bar layout and you'll know what Loco looks like.Located in a pleasant little section of fishtown, the bar has a warm and saucy vibe: they were professional and friendly, but I got the feeling if I started popping off at the mouth they wouldn't be afraid to pop me in the mouth. Basically got one of every taco, and my favorites were no surprise for me since I am such a meat fan, but I'd bet chorizo was my top. I was filled when I finished eating, but honestly I could eat those little Mexican salads on a shell all day if  had the time (and it wouldn't have hurt my wallet too much to boot). I would definetly come back for a quick lunch or a long night with no second thoughts."], ["Tom H.", "I live in Fishtown and even though everyone that visits me wants to go here, I cannot recommend Loco Pez at all. Navigating the baffling seating procedure is the first hurdle - there's no hostess, but tables are always reserved. Good luck finding how to get on the secret waiting list; there's no one to help you and your best bet is to be yelled at by other patrons when you skip the line. The yelling will at least tell you who to talk to.Ok, you say, I'll sit at the bar. Well, unfortunately, there's usually only one bartender and she/he is constantly overwhelmed. No barback to help, and frankly, it's a big bar. So it's completely hit or miss whether you will get served in anything approaching a timely manner, and if you do, don't expect anything more than a gruff, passing \"you doing ok?\".I can't say much about the food - never had the stamina to actually stay there long enough to order anything. But what I've seen looks pretty basic: anglicized tex-mex, heavy on the squeeze bottle sour cream.Drinks are watered down, and not particularly flavorful. Avoid the michelada especially.Finally, don't forget that Loco Pez is cash-only. Which would be fine if it was a regular taqueria. But people tell me it's tough getting out of there without spending $40 per person, especially if you have drinks.If you still insist on going to Loco Pez, good luck."], ["Gina M.", "I went here on a date a few weeks ago.  Even though he turned out to be terrible, the food was amazing!  This place is tiny and really easy to miss.  When you go inside, you'll realize it's like a rowhome just with a bar and a lot more people in it. They definitely cram you in there but hey. It's worth it. I'm not a fan of spicy food so i was worried about going here and hating it and looking like an ass on a first date, but he ordered me the chicken quesadillas that were absolutely incredible. There was definitely a little kick to them but it was doable. The service kinda sucked and we had to sit at the bar and the bartender just didn't care about us whatsoever but we had each other's company which worked...for that night. I would definitely go back.Sometimes when the food is so good, you can overlook bad service! And maybe if we were sitting at a table it would have been different!  I'll be back though! :)"], ["Sarah P.", "I'm a fan of this place. Other than the import, the service is generally sub par. I've had better Mexican food, however I'm into cheap tacos, the 70's living room dive bar atmosphere, and it's a short walk from my apartment. Dollar taco night is always fun to stumble upon. Tune into their twitter account for what night they decide to have it. If you want authentic Mexican food you've come to the wrong place. Their garbacho taco is the classic hard shell taco you had at your friend's place after school. Ground beef, lettuce, pico, and cheese - I'm a sucker for it. The rest of their tacos are served the more traditional style on a small soft tortilla.I'm a big fan of their happy hour: $4 for a huge plate of nachos, $4 house margaritas, and $3 drafts. Good for a cheap dinner alone or with a friend and some cheap drinks to drown your sorrows from the day."], ["Cheryl K.", "I went here for the second time last night, and it's definitely becoming one of my favorite Mexican restaurants in the city.Yesterday's special was a scallop taco that was absolutely to die for. I had two and a whiskey ginger which definitely satisfied me. Honestly the only thing wrong with the place is the abundance of pseudo-hipsters and ex-sorority girls on their phones, but that's only to be expected in Fishtown.Do yourself a favor and stop in for some giant nachos and reasonable priced Mexican grub. And if you can nab a seat at the bar? The bartenders are great and will give you all the suggestions in the world."], ["Jesse T.", "Best.I have nothing bad to say about these guys, they're doing Mexican Jesus' work and showering Fishtown with tacos as God intended.I've tried most of their dishes and enjoyed the living fuck out of each one.Drunken midnight nachos and Margaritas is a guilty pleasure.Viva la flatulence!!"], ["Kathleen D.", "I love that Loco Pez. Here's what I'm screamin: Tequila! Margaritas! Nice array of beers for ya! Magnificent Nachos! Delicious little tacos! Great salsas! Great bar! Juke box!I screamed these things, like I told you, and so now I have a nice bit of breathing room on the bus. Informative right? Yes... and convenient for me, this some-kinda- Mexicali-foodstuffs-and-drinks-yellin' tick.So yeah, Loco Pez supplies tequilas a-plenty and some lovely margaritas, from the classic style Impala, to the blood orangey Coupe De Ville. There are abouts six or so beers on tap, and many cans and bottles, including your Mexican favorites along with the crafty. The nachos are grande and come highly recommended by me, as they are loaded, well-layered, and not skimpy in the least, even if you order the o.g. non-meatsy ones...but try those Nachos de Kenzo some time if you do dig on chorizo and carne asada, cause that's likely all you'll need outta life.I love that the tacos here at Loco Pez are lil fellas on smaller sized corn tortillas, cause that makes em ripe for the makings of a personal taco combo fiesta for yourself. I'm sayin, a la carte and mix n match that mutha.My favorite tacos of theirs include the super flavorful shredded pollo- if I've said it once, I've said it a thousand times; I love a tasty Tinga! I found the mash up of chorizo and potato to be delicious, tambien. The cochinita pibil of roasty, juicy pork with pickled red onions are straight up lip smackin. I'm tellin you... Love the mushroom tacos too. For a place called Crazy Fish, I've still yet to try a fish taco here. Strange. Hmm. I should get on that.Make sure to try every salsa in the bucket. To these salsas I do the international hand gesture of chef kissy fingers. Good stuff. I'm a fan of lotsas salsas, ya know.I enjoy. This Loco Pez is a fine, fine example of the kinda neighborhood bar I'd like to have in me own. They have a goood jukebox too- always appreciate that. We've always gotten good service here t'boot. We keep on comin back.More aspects to yell at ya face piece:Happy hour deals! Dope, dope brunch cures your every hangover! Shrugs: Cash only."], ["Sara O.", "Our favorite food in fishtown and we're likely enough to live right around the corner!  The service and staff are awesome and it's generally busy with a very friendly neighborhood crowd. I've never had a bad meal here and their veggie choices are delicious!"], ["Jennifer D.", "I cannot stress just how great of a place this is if you want good Mexican food and a drink.  I love their $1 taco days (check their facebook and twitter to see when they are, it changes every week), but their prices are more than reasonable on regular days.  The staff is pretty friendly and attentive too, and the music they play is always on point.  Overall, this place is a must visit for anybody in Fishtown."], ["stephanie b.", "While the Nachos Pez were outstanding the tacos left little to be desired. The al pastor taco was overly sweet and dry and I've had a better hard shell taco with ground beef (Gabacho Taco) from Taco Bell. Slightly disappointed. Would go back for the nachos and a cocktail, but nothing else."], ["Michael S.", "Tonight was it for me, I've eaten at loco pez one too many times besides the mediocre food which is flavorless, uninspired and pedestrian but what puts the icing on the cake for me was tonight's bartender Lauren her attitude was shity and the service sucked. This is s hipsters wet dream so anybody with tastebuds should stay away."], ["Callan W.", "In search of good fish tacos, I was directed to Loco Pez by a talk thread.  I ended up bringing along the brother and his wifey to help me on my journey.There were a few things that caught my eye on the menu, but I was here for tacos and so tacos are what I got.  I ordered 2 fish, 1 pork, and 1 steak.  The pork and steak were both ok.  The flavors were there, but both needed some sauce to help make them better.  He felt the same way about the tacos. The sauces were fun to mix and match. The fish tacos were good, but the piece of fish was so tiny, it was more cabbage than anything else.  Surprisingly, the waffle fries my brother ordered were really good.  I don't even like waffle fries.Service was awesome.  Cash only...good thing we had that dinero."], ["Rebekah P.", "Awesome tacos with awesome prices! The drinks were great. The staff is friendly and took the time to check in and even sparked some general conversation and made suggestions. Nice place to go with you friends to just hang out and not worry about dance floors and large crowds."], ["Marekait S.", "One of my favorite taco spots. Their homemade sauces are wonderful. Nachos are also delicious. $1 taco night gets crowded but is always worth it."], ["Jpgirth K.", "Nachos are one of the best aroundEverything is so freshPlace has a lot of characterBartender spotted us a drink for moving at the barTable turnover is quick Look for parking within a couple of blocksJukebox is 50songs deep, and that's awesome"], ["Jaide P.", "Stopped in here for some tacos and margaritas. It was my first and will not be my last. Tacos were great, server was quick and polite. Drinks were tasty and strong, nothing worse than paying $9 for a juice. I would recommend at least 3 to 4 tacos if your are not doing an appitizer or side as they are not very filling. Make sure to bring cash as they do not take cards.  I also would not recommend the house margarita as it was not very tasty, it might have been the tequila though as I do not like rail."], ["L L.", "Okay yelpers we get it, Loco Pez has superb food! Now, can we talk about what really irritates me? Thanks....Start accepting credit cards. It really irritates me when I have to walk through your very small and always crowded establishment to the back and bother those poor four people at those two uncomfortably small looking baby tables they are sitting at.  I can hear them breathing that's how close they are sitting to each other.  That's how close I am standing to them as I withdraw money out of the ATM.  Just saying.....No, I will not start carrying cash.  I never have and I never will. That is all."], ["Fatima M.", "Tacos are amazing my new favorite taco joint. The order to go guy is really nice and service is super fast I recommend this spot to anyone."], ["Ruth M.", "The service was good but the food was mediocre.  I love chicken tortilla soup and had high hopes. My Dad loves posole. Sadly, these two soups were almost identical and neither tasted good - they were both very spicy with a burnt flavor. My stepmom's chorizo burrito was not tasty either. She is convinced the meat was actually ground beef. Tacos or nachos seem to be a better bet here.  Also, the music is super loud and it's definitely a festive bar vibe which is cool but not what we were expecting. Again, the service was good and the place was packed. Most of the happy people had margaritas and nachos. It's more of that kind of place."], ["Lauren S.", "As 2013 winds down my mission to hit all the Top 50 Bars from 2012 in 2013 has hit a fast track.  Which had me at Loco Pez early on a Monday night but the place got packed fast.  Probably because they have a great happy hour, $3 draft beer, $4 margaritas and half off nachos easy to see why.I had some friends rave about the taco and other say they were so-so so I just got one, randomly selected the mushroom and I loved it.  The bartender ask if I like spice and recommended a few drops of El Yucateca Chili Habenero sauce to match my taco selection.  I took the recommendation, it was great for those who want a small kick but the mushroom taco would of been excellent without it.Nacho were large, but despite my plans to only each half take the rest home I ended up eating 3/4 and left the last 1/4, cause lets face it nachos aren't great leftovers.  I thought they had a good balance of cheese, salsa, jalapenos, and refried beans and it was hard not to find a chip without something on it.  I hate when you eat the top layer and it just chips underneath these were layered nicely.The place had more of a dive bar feel to it rather than a Mexican restaurant.  Well a dive bar with flat screen TVs, it would of been nice if they had the close captioning on the TVs since they had music playing."], ["Kaitlyn G.", "Definitely one of my favorites. Their happy hour is amazing! Dollar  tacos, yes please! Its like a little hole in the wall bar with amazing food. All the locals know it and sometimes its hard to get a table. I suggest going during the week because a friday night, forget about it!"], ["Vicky H.", "Awesome place! It can get VERY crowded and I don't like that it only opens at 5. The take out counter in the back (accessible through side door) is convenient. I like all the bartenders and wait staff. The nachos are great, and are big enough to share, yet good enough to eat by yourself. The tacos are really small, which is good because they are cheap and you can build yourself a mix of like, four different tacos, instead of having to get all the same like at other places. This place is good to eat little by little. Instead of committing to a big entree, it's cool that you can order a drink, maybe some tacos, and then drink and get even more tacos as the dinner goes on.I've only had mixed drinks, not beer, and the Fairlane is good. It uses guava juice, and was recommended to me and I've gotten it repeatedly.This place is cash only, so make sure to keep that in mind. ATM on site is convenient if you need it!"], ["Pierre T.", "One of the best perks about just signing a new lease in fishtown, is that loco Pez is a 30 second walk away...everything I've had so far has been nothing short of exceptional..if this place wasn't cash only I would probably eat here everyday..cheap and strong margaritas!!!! Also try the el dorado drink if you like spicy...Minus 1 star for atm being broken at a cash only place, ran around for 20 minutes drunk trying to find one.."], ["Paul V.", "Loco Pez makes some of the best nachos I've ever had.  Also, really great Margaritas.  Visit this place during happy hour and you can get both of those items for $4 each.The tacos were okay.  Not awesome.  Maybe I was spoiled with great Mexican food living in Arizona for 6 years.  I've tried the Pez, al pastor, and carne asada.  Next time I'll try different tacos. Still, the chefs here should win the Nobel Prizes for nachos.  Follow Loco Pez on Twitter to find out when their $1 taco day is that week."], ["Brandon W.", "It doesn't get much better than this place. Nothing like an awesome divey taco joint. Great $1 taco nights...best tacos in area fo sho."], ["Jennifer P.", "Two words...DOLLAR TACOS!!!This place is always busy the times I've gone but the service is quick and people are in and out! It can definitely get a little close for comfort though.Great food and fun environment!"], ["Cara S.", "Kenzo nachos are to die for!  Great little hide away absolutely one of my favorite places!"]], "Cantina Dos Segundos": [], "Honest Tom's Taco Shop": [], "Cantina Los Caballitos": [], "Las Bugambilias": [], "Tortilleria San Roman": [], "Los Catrines Tequilas": [["Jelissa B.", "My husband made reservations online it was quick and easy. It was my birthday surprise dinner . When we arrived they walked us right to our table. The waiter came to our table introduced him self and gave us the menu. About one min another gentleman came to asked what type of water we wanted and had water 2mind later. The Waiter was very attentive and up beat. Ordered the rose margarita it was good and my husband had the lime margarita. For appetizer the fresh guacamole with pesto and prosciutto. That was a 5 star, we devoured it . My husband ordered a special cowboy steak it was perfectly cooked and the sauce was perfect. It was accompanied with rice and guacamole. I ordered a pork dish it was okay the sauce was a BBQ like sauce I'm not crazy about BBQ sauce so the dish was okay. My girl friend had caesar salad she said it was amazing. For desert we ordered the impossible yes the impossible its chocolate cake with a top of Flan  and tres leche cake. They came with a shot in hand and candles sang me mariachi style mañanitas which is Spanish style Happy Birthday . That's was beautiful . The impossible was possible but would of loved for the chocolate cake to be a bit more moist, the tres leche was decent. Desert was like a 3, appetizer 5, dinner 4, price 3 (some what pricy at $12 per cocktails) Decoration 4 our waiter and staff was 4. Over rated the location a 4."], ["Valli V.", "# of people - 5Appetizers - Chips and Salsa - 5/5--The salsa was THE BEST! we used it as a garnish for everything we ate!1. Oysters (1) - 4/5 - tasted awesome but had some sand left in it.....[:(]2. Empanadas (2) - 5/5 - BEST thing ever! it was made with squash flower and tasted so gooDDDDD!!!Main Courses - 1. Chicken with Cheese and Rice - (3/5)2. Chicken with Gravy - (3/5)3. Vegetarian Platter - (5/5)The food overall was really good....but the the 1rst course was pretty bland! had a tough time eating as it was tasteless....perfect for someone who likes just chicken. The gravy from the 2nd dish was used to eat with the chicken with cheese...My husband and I shared the vegetarian platter and we loved it! the platter came with enchiladas and the chilli relleno (sp?), was spicy rather than being bland. Dessert -1. Impossible Cake - (2.5/5)Everybody that were at the table seemed to enjoy this cake....but i wasn't really impressed. it was basically a chocolate cake...with flan on the top...without the icing....but with a caramel drizzle...Drinks 1. Margarita Pitcher - (5/5)Taquila. Salt. yUMMY"], ["Syvan T.", "We came here for a girls night. Let me start of by saying we all adored out waiter. He was so nice and accommodating, he brought drinks on his head, he gave us plenty of time to decide, made suggestions and was just all around great.The drinks were excellent. I have been here once before and got the Mojito Verde and it was delicious. This time I got a CocoLoca which tasted like a pina colada made love to a margarita and had a baby. There were five of us so we ordered one regular guacamole for the table. We were all very hungry and ate it right up and ordered a second, this time with crab meat and melon which was interesting.I ordered one of the specials; salmon in butternut squash sauce with *broosel sprouts* (we loved the way he said it)  topped with a scallop. I usually try to stay away from salmon because I feel it's one of the fishier tasting fishes but this piece wasn't fishy at all and the scallop wasn't either. It was delicious and I had to stop myself from licking the butternut squash sauce off the plate. I've had the carne asada a la tampiqueña before which is also highly recommended. We ordered dessert. I LOVE churros so naturally I ordered them. They were a bit too soft to my liking but still very good. It came out to a reasonable price per person and we all went home full and happy."], ["Noops K.", "Food was okay. Drinks were great. I went for restaurant week and the place was packed!"], ["Shannon W.", "THANK YOU for making my gurl's bday incredible! we had an obnoxiously large party to deal with that may or may not have been slightly inebriated and let me tell ya, this place took care of us and then some. they offered a set menu option that included unlimited dranks for our large fiesta. the food was ridic. my friend legit laughed when she took the first bite of her filet mignon because it was that good. she couldn't even handle it yo! gracias y besos!"], ["Siv M.", "Came here for dinner after seeing a show in Philly with my hubby and in-laws. Ambience and decor were great. Service was excellent as well.Their margaritas were fantastic! I had two and the rest of the dinner was a bit of a blur, but definitely a fun time. I had the carne asada a la tampiquena, which was super yummy and a very generous portion size. I was a bit too stuffed by the end of dinner. In terms of price, my husband and I didn't foot the bill, but I remember the prices being reasonable for the quality and quantity of food we had.Would definitely come back!"], ["Christopher M.", "They have the most excellent range and variety of margaritas. Delicious food. Friendly bar staff."], ["Mauricio C.", "Good: The house is nice, and looks like old time Mexico. Beautiful architecture. Bad: a) moody hostess , we had a reservation for two and were only seated 45 min later but other people (3 people groups) without reservation were given priorityb) waiters took forever to see us. we waited 15 minutes to get our check c) tequila was awesome. guacamole was awesome. The rest of the food was not even good. d) expensive , very expensive for the food you get. If you want real flavor, and a experience flavors go elsewere. I was so excited aboutt this place .. now I would not go back."], ["Lea T.", "Ever since a high school Spanish trip to this restaurant (7 years ago) I've been hooked! Los Catrinas Tequilas is a wonderful upscale Mexican restaurant with specialties beyond nachos and fajitas. Ask your server about the many special drinks and food not shown on the menu. The skinny margarita and homemade guacamole (served in a lava bowl) are 2 of my favorites. Empanadas are offered with varied fillings, always including an option for vegetarians. Ceviche also varies daily. Every table is also served with homemade tortilla chips, pico de gallo, a smoky chipotle salsa, and pickled jalapeños and carrots. For your main course I would recommend the enchiladas de playas- filled with shrimp, crabmeat, and lobster, or molejacte de pollo- grilled chicken served in a smoky sauce in a heated lava bowl!!Then flan for dessert of course :)"], ["Dan A.", "I'm a fan of Mexican food. And Los Catrines Tequilas has some solid options even for vegetarians. And I would say the Chiles Rellenos  are the great vegetarian entree option.  They also have a great drink list that pairs well with the food.But when I compare Los Catrines Tequilas to other Mexican options in the city, I enjoyed meals on both sides of 13th Street more. I'm also not keen on the dark ambiance."], ["Shakira O.", "I have been here on several dates with my husband, and a few friend dates throughout the years. I must say, I am NEVER disappointed. The service is always on point, as the employees are very attentive (and I am super judgey because I was a server in 4 and 5 star restaurants for years). I can never get enough of the guacamole and chips, both homemade, and so addictively AMAZING!During my last visit a week ago, I ordered a steak and shrimp entree, my steak was perfectly medium, and my large plump shrimp didn't stand a chance against my fork. On top of all the amazing food, the Tequila bar is truly something special. This place is an overall winner, and will forever be one of my favorite Philly staples."], ["Monique B.", "Great happy hour drink specials.  I came for a work dinner, but one of my colleagues had his wife and two kids in tow.  They made an adjustment for our table easily and although they don't have a kids menu they do make kid-type meals (chicken or plain cheese quesadillas, grilled chicken and veggies, etc.)  Service was impeccable and the food was good.  I had the The Molcajete De Carne, which was massive, and should probably be shared.  I had a great time, and the service was great, but there was nothing in particular that made me want to go back."], ["Charlene U.", "My cousin decided to have a group of friends at Tequilas for dinner for his 31st birthday before heading out to a few Center City bars.  Truthfully, I've probably walked past this place dozens of times in Rittenhouse without noticing it.  We had to park a few blocks away because it is Rittenhouse afterall.  When we entered there were two young women at the hostess stand who looked bored and not exactly welcoming,  but we let them know that we were waiting for my cousin, and we were led inside to a decent bar area.The style is straight out of Colonial Mexico with nice accents like woodcarvings on the entryways.  We were seated in the back of the restaurant.  Our seats were half-booth and half-chairs.  It was kind of a pain for those of us who were seated eight-across on the booth side.  We ordered specialty guacamole for some of our appetizers.  The bacon guacamole and a crabmeat guacamole were delicious.    I thought my dinner entrée, Shrimp Wrapped Bacon Stuffed with Cheese, was too much on the salty side.  I was glad that I had ordered a sweet drink called the Coco Loco (coconut infused siembra azul tequila blanco, canton ginger liquor, pineapple juice, sugar cane syrup and fresh lime juice) to balance out my salty dinner.  I also got to try the Short Rib (siembra azul blanco infused with jalapeño, fresh lime juice, and pomegranate molasses).  This drink is really good if you like a spicy cocktail!The servers were very friendly and attentive even with our large party.  I think the best things about this place were the decor and the servers.  When I come back it will be for the guacamole and the Short Rib cocktail."], ["Let V.", "I went this restaurant on 5 de Mayo for dinner and drinks.  I found it here on Yelp and was looking for \"Los Catrines Tequilas\"  and only found \"Tequilas\" at this address.  They should consider changing the name to just TEQUILAS so people are not looking for the LOS CATRINES. It could be confusing.  I sat outside since it was a beautiful day!  The Signal for WIFI is really week.  I think they need a new router bc the symbol on the phone showed all of the bars but it was SOOOO slow.  I waited a while before my waiter Ray to acknowledged me, or took my order. He wasn't the best at his job, he had little sense of urgency and  had very little follow up too.They have great tasting and really unique cocktail menu which is a HUGE plus!  I tried the Rose Margarita which is made with rose infused tequila and garnished with real rose petals it was delicious.  I also tried the Short Rib Margarita and it was amazing as well!  The cocktails are a little pricey but well worth it!  It only takes 1 to feel the affects of the tequila and two leaves you really happy!  I ordered the fish with veggies and the presentation was beautiful!!!! I will add a picture of my plate. My rice was garnished with cilantro sprouts, there was chayote in my veggies and the there was a little bunch of steamed veggie sticks tied together with a little corn husk leaf.  This meal is not served with tortilla so I had to ask for those. The torillas are home made :D are brought in a little basket without a lid or wrapping so they got cold quick; I had one hot tortilla and by the time I got the secondit was cold :(  They should  wrap them. Also they should consider making an additional Salsa, the one served with the over toasted chips is too mild and the other is a habanero sauce that is TOO hot. Ray took my drink menu so I guess he figured I wouldn't be ordering any more cocktails. There were more I would have loved to try but felt good anyway so no big deal.  I asked him for the bill. I waited a while and he came back and asked the table next to me if they would like their bill (I was still waiting for mine) he brought their bill, (where's mine?) he walked away  came back -they paid (where's mine?), they left and as I sat there growing annoyed because I could have left before them or had another margarita he finally brought my bill!  Later he returned for my card and cashed me out.... I was there longer than I needed to be for sure! If you get Ray as your waiter you may want to request another one... I would have given a 5 had the serve been better."], ["Casey S.", "Went here to tonight with a group of girls for Center City SIPS and we were all BEYOND disappointed.  I am also flabbergasted by the numerous high ratings here.First off, upon entering the restaurant and waiting for a table, we already got bad vibes about the place.  A young girl who was presumably the hostess was standing by the door but not letting anyone in or out.  When we gave our name and the number in our party we were told that she could not help us but it would just be a second.  A group came in shortly after use and she told them the same.  Soon a guy, looking like a manager or owner came over and the girl reported to him how many people were in each group.  He asked for our IDs and then left again.  The girl again said it would just be a second.  Then the man returned with our IDs and told the girl to seat us.  It was just bizarre, I don't know how to explain it.  In any case, we were seated outside and it was a nice evening.A waiter quickly came over and took our drink orders.  4 of us got a margarita and 1 got a sangria.  The drinks come in especially small glasses and are extremely watered down.  There was very little salt and no lime.  After bringing the drinks he said \"What are you having from the kitchen?\"  I asked for menus, which none of us had yet and this was the first time at the restaurant for all of us.  He responded \"SIPS specials are chicken taquitos, beef empanadas, or guacamole.\"  When I mentioned perhaps wanting something off of the normal menu he became noticeably irritated and said he would return with menus for us.  He came back about 5 minutes later asking if we were ready to order food yet and I pointed out that we still had no menus.  He then came back another 5 minutes later with 2 menus for the 5 of us to share.Once we ordered food, it did come out promptly.  We had:---Chicken Taquitos - $5, literally one taquito cut into 4 pieces, fairly flavorless---Beef Empanada - $5, also very small and bland ---Guacamole and chips - the one positive of the evening.  Also $5 and in an extremely small dish with ONE small plate of chips for 5 people to share.  However, the guac tasted incredibly fresh with large pieces of tomato, cilantro, and chunks of avocado.  It was very good but once the chips were gone and there was still guacamole left, we had to hunt down a waiter to ask for more chips since our waiter was nowhere to be seen.  The waiter brought them 15 minutes later and seemed angry about it.  Side note: chips were delicious and notably homemade - super crispy and served still warm with just the right amount of salt.  This appetizer also comes with 2 salsas.  The pico de gallo type salsa was chopped tomatoes and onions - fresh but bland.  I enjoyed the other salsa which was supposedly \"hot.\"  It was not hot at all but more had a smoky chipotle flavor.  It was yummy.---Sopa de tortilla with chicken - $8, came out in a very tiny \"Cup size\" portion which you would see at other restaurants.  Was just two small slices of chicken breast and perhaps a quarter of a chopped avocado in a bowl alone.  Also served with a plate of chopped white onion and cilantro.  The waiter then poured the \"broth\" over the chicken and avocado and dumped the cilantro and onions in it.  The broth was incredibly greasy with little flavor.  The oil and fat immediately separated from the broth and came to the top of the bowl.  So appetizing!The waiter never came to check on us to see how our food was, to ask if we wanted a second margarita or even to refill our tiny water glasses.  Finally, to make matters worse, after paying the overpriced $70 bill and leaving a (very undeserved 20% tip), we sat to chat and finish up our margaritas.  No more than 5 minutes after collecting the check, the waiter came over and removed all of our silverware and (still somewhat full) water and margarita glasses.  A few seconds later he returned and asked if everything was ok because \"he had lots of people waiting and would like to serve other tables.\"  I have never been treated so rude by a server in my life.  Certainly will not return.  Wish I could give it no stars..."], ["Andrew B.", "Ima say 3.5 because nothing blew me away. It was nice to go to for sips. Very dark. Good margaritas, sangria. The apps were good too, but nothing had the wow factor. Nice people working there too."], ["Eunni C.", "Got guacamole and enchilada and steak dish. Food was ok, ambiance was ok too. But price was way higher than what should be.. Not impressed at all."], ["Megan C.", "Drink was good, but service at the bar wasn't so great . Was ignored for a while before getting served."], ["Christopher K.", "Top notch place. Kim took me here for restaurant week on a co-worker's recommendation, and my second time a Tequilas was excellent. The service was top notch, and they've perfected some \"party tricks\", such as handing you a glass on their three middle fingers, or walking around with trays on their heads!The food was good too. Authentic chips come out right away, giving you something to munch over until dinner arrives. And who doesn't like up-scale Mexican? A solid value for the food and the experience. Enjoy!"], ["Thuy H.", "Ooolyy moooly!! Place is amazing! Everything from the decor to the service to the food was perfect.Our servers were awesome. He kept us entertained and was on top of everything! Kept up on our drink orders, recommended things (all of which was great), refilled chips, knew the menu extremely well, etc etc etc. I can keep going on about the amazing service but u all probably would be bored. Moving onto food and drinks...Crab guacamole... good. Nice sweet flavor to it.Prosciutto guacamole... amazing! Had a nice kick to it with the saltiness of the prosciutto.Brazilian punch... mmm. Not too strong and not too sweet.Short rib drink... spicy!! Def gotta get this if u come.Branzino special... omg!!!! I want more. The sauce was perfect and the fish was so soft and flaky. Surf n turf special... steak was melt in your mouth cooked perfectly. The large shrimp was also to die for! Taste just like lobster. Yum!Pork chops... so good and moist. The sweet potatoes it comes with was also quite deliciousEnchilada playa... we made fun of my bro in law for it bc it looked like a kids meal compared to all of ours but it had a great flavor! Didn't feel heavy eitherShrimp wrapped w/bacon... also delicious!Caramel crepes... so good! Not too sweet and I loved the nuts on it.Chocolate jalapeno icecream... crud, that is spicy but so good! The spice comes near the end when u swallow, so def be prepared for it. A must try!Chorizo.. eh nothing special about it. Pretty simple.We had so many more items (I went in a large group). Can't wait to go back again."], ["Lisa S.", "While I'm sure there are many great things on the menu here, let me save you the trouble and get straight to the things that will knock your socks off. Order the Molcajete bowl. Served with chicken or beef, this steaming lava bowl with vegetables, garlic, onions, topped with rice, cheese, guac, and beans. You create your own miniature tortillas and this is more than enough food to split, especially if you indulge in some chips and salsa beforehand. Next, while their margaritas and tequila selection are divine, get the champagne margarita and thank me later."], ["Gautam T.", "I really have a soft place in my heart for Tequilas even though the prices are quite high. No need to delve into my love affair with Tequilas. Lets focus on the tangibles, this is a disclaimer I am only rating on the tangibles, I would give this place a 5/5 based on sentimentality. Food is very good but nothing really stands out, its typical mexican food (enchiladas, ceviche, guac etc) but priced way higher than mexican food should be priced at. Mexican food is awesome but I don't think it should be super expensive. For example I paid 20.00 for enchiladas at Tequilas, the same enchiladas (way more authentic) at one of those south philly mexican restaurants costs $12.00. I really believe the atmosphere is what drives the cost and the additional $8.00 you pay for enchiladas you get a classy atmosphere with really friendly service. I'm ok with that on a Friday-Saturday night. You get the point right? Good food over-priced. Great dining atmosphere, great service, a little too expensive though."], ["Kelly P.", "Delicious food but truly hurts the wallet. Our server was wonderful, helped me make the decision to get the pork and told us a little story about pico de gallo. My date and I decided against cocktails but they did look good as they moved past on our server's head."], ["Gabie L.", "Wonderful atmosphere, great food, and service was just awesome! I love Mexican food and have been in Mexican restaurant in many states including New York, Florida, and Texas but food here is really unique. Of course they serve many kinds of Mexican food but those are very creative and delicious (usually it doesn't come creativeness with being delicious). Little bit pricey but I want to visit here again."], ["Steven P.", "Food and service were outstanding.  The Margaritas were delicious too.  We ate on the sidewalk, but I went in to use the restroom and the dining and bar areas were beautiful."], ["Christine D.", "We decided to come in on a whim for restaurant week. I judge restaurant week menus on their creativity and tequila's was definitely par for the course. We started off with the chips and two different types of salsa, both fresh and delicious. I had the tilapia/shrimp ceviche, the surf and turf, and flan for dessert. My boyfriend had the empanadas, seafood enchilada, and chocolate mousse cake. I was amazed at the flavor profile of each dish. Not too heavy or bursting with sodium. This was probably the best mexican food I've ever had. Their margarita choices were also creative and delicious! Would return outside of restaurant week."], ["Joe W.", "So far, not so good. Had a party if for we were meeting. Place was half empty so not like they were crunched for space. Even with that, the owner made us wait in they lobby for several minutes till the last member of our party arrived. Very rude for a supposedly nice restaurant. Let's hope food and service are better.Food ok, but service slow. Wrong drink orders delivered. Best quote of the evening... instead of asking if everything was great the waiter asked if there were any complaints."], ["JB Y.", "Cheese stuffed in shrimp wrapped in bacon and deep fried. Are you f*cking kidding me? Best food ever made by man. Service was awesome, drinks are probably best in the city, food was impeccable. Will go back a million more times or my life is a failure."], ["Tim T.", "We had dinner and drinks at Tequila's on Friday night with no expectations because most places that serve so-called fine-dining Mexican cuisine in the northeast are usually a bit lackluster and over-priced. We still gave it try since it was cinco de mayo weekend and because it got decent reviews.I hope my review is helpful. After we walked through the bar area which had a tangible excitement about it, the server brought us into the main dining area which was low-lit, but seemed to have a full room with the staff busily moving about between tables.The server was helpful and pleasant, but the service was a bit slow. There was a bit of a mix-up to start (probably because it was starting to get loud in the place and they couldn't hear what we ordered). The timing of the dishes was a bit off as it seemed that dinner took them a little while to bring out, but it was expected since it's probably the busiest time of year for Mexican restaurants. The variety of cocktails was delightful - and they do have some real top shelf tequilas and mescals.  The fresh guacamole and chips were a plus (our party added the crab and mango - which I recommend, but they do have other options). The pickled peepers, salsa, and rojo sauce that were served with the chips could've been left in the kitchen. They lacked flavor and actually, there wasn't anything special about those items at all. The main entrees were good and were presented nicely. Even the rice and re-fried beans had good flavor and texture to them. Usually, I find that the side items are overlooked, over-cooked, and unpleasant.  I had shredded-roasted pork with fresh tortillas and fried plantains which was tasty for the most part (with the exception to the plantains, which were over-cooked). Some of the other dishes looked pretty good too. The dessert got the highest marks. We had a delicious chocolate-flan layer cake. The tres leches cake looked delicious.  I recommend the coffee as well (you'll need it after the drinks). If you're looking for a casual night with good drinks and appetizers or if plan on having a fun dessert and coffee, try this place. The main entrees are just ok and not that impressive. Also, forget decent dinner conversation in the main dining room unless you plan to yell all night. This place is good for casual dinner conversation for sure. If you want some intimacy, try taking a table outside."], ["Matt D.", "I'm ambivalent about this place. They have great margaritas. The guacamole is delicious. However, overall the food is good--not great, but good. I've had the pork tacos, and they are extremely sweet--beware. I've had the steak that comes with a sampling of other dishes--a tamale, a chicken taco, etc., and that was good--just not particularly memorable. It's a relatively upscale-feeling restaurant with relatively high prices for what you get, and admittedly--it's just not my style. Mexican food can be so delicious...and the food here just isn't as good as it can be."], ["Arielle H.", "I was just there for Valentine's Day. Our seats sucked (by the door and the curtain really didn't help with the cold) but the service was very friendly and never left us waiting. I got the empanadas (forget the name but it had cheese inside) which were decent but I wouldn't get them again. My beef entree (it doesn't seem to be a part of the regular menu) was seasoned well and perfectly cooked. I asked for medium and got medium rare (yay!) so if you like your meat more done (why?) be sure to be specific. The desserts were all right (a weird cheesecakey ice cream, churros, and tres leches cake). I would recommend getting a regular margarita with dinner, theirs are fantastic."], ["Alyssa R.", "I had heard such great things about this place. I was so excited to go, however I was sadly disappointing. The drinks are good and the waiters carrying them like on their head or in interesting ways. The sangria is really good. But the food leaves something to be desired. I even went back a second time to give it another try but it is just so/so. With places like el vez in the area, and this being expensive, I would always chose to go there first. I forget what I had but once time a fish and a second time a chicken dish."], ["Cathy H.", "My friend and I went here for restaurant week last week. The service was fast and great. For appetizers, we tried their cream soup, which I was a bit disappointed by. However, the salsa that came with their chips were delicious! For entrees, I tried their beef empanadas which were very tasty. For dessert, my friend got the flan while I got the tres leches. The tres leches is way better by far. Each portion was decent sized so I left feeling very full and satisfied."], ["Anand R.", "I love food... love Mexican food... and love Tequila's particular brand of Mexican food the best...We used to live in the Philly area and used to frequent Tequilas back then. They have since changed locations, but have preserved all that was great about their menu, the ambience and especially the super friendly and professional staff.The habanero salsa - our staple diet from back when we had less dietary restrictions - is still as exquisitely spicy as ever. Glad we sampled it, but had to cut ourselves off after just a few dips.The Chile Rellenos - arguably the best on the planet.. and enough for two as our waiter pointed out.The enchiladas - our traditional favorites, as splendid as we remembered it to be.The only downside - adding it just so it is an objective review - we were seated in a corner to the side off the bar where there was too much traffic, and with a strong draft of the cold outside air... and we noticed that there were better seating options...Overall, it still rates in our top 5 dining experiences of all time. 5 stars only - because yelp does not have a 6 star option..."], ["Nina S.", "This is hands down my favorite upscale Mexican restaurant in Philly! I had dinner here a total of three times and I think each time is always better than the last. The atmosphere is very warm and inviting and service is always friendly and not overbearing. It is a large restaurant for the city so it's perfect for large groups. The first two times I was here was for Center City Restaurant Week and I ordered off of their pre-fixed menu for $35 for a three course meal. The third time I went was just yesterday and I was pleasantly surprised they were offering a deal for three course meal for $35 also! I don't know if that is offered every Tuesday but I was happy with it. You could order any appetizer, entrée and dessert. It was my birthday so I went for it! Drinks- We started with a round (or two) of drinks. I had the Roses margarita and enjoyed every sip. It's a bit on the sweet side though so for my second drink I had the Skinny Margarita which was just tequila mixed with lime juice and a little bit of agave so it's not as sweet. Both were served on the rocks with salt. Course 1- For the appetizer I ordered Ceviche and it was so good. The portion was really large and could have seriously been my entire meal. It was perfectly seasoned with cilantro, lime and tomatoes. Course 2- The main entrée that I ordered was something I can't pronounce in Spanish so I just referred to it as the 'Hot Lava Chicken Bowl'! It is chunks of chicken swimming in a hot sauce topped with cheese and served with tortillas and a side of refried beans, guacamole and salsa. You are supposed to make tacos with everything and I did that for the first one but then  I just put the check on a plate and ate it alone because it was so flavorful. Course 3- There were so many dessert choices but I went with a classic Mexican cake- tres laches. It was creamy and moist just how it should be. The wait staff also surprised me with a 'cocaracha shot' made of tequila, Kahlua and sprit. It was tasty but I was very startled with the waiter came outo f now where and started slamming the glass on the table to make it fizz! Haha it was quite a production and I think they sung the most beautiful rendition of happy birthday/felize cumplianous I have ever heard even though I didn't understand most of it."], ["Tom K.", "The service was great, food even better, and the margaritas to die for.  A little on the pricey side but worth the money spent."], ["Shawn S.", "Tequilas has been one of my favorite restaurants in Philly for awhile. I will admit, I prefer the old menu to the new one, but the meal I had was delicious as always."], ["Food. R.", "Not great. The space is very impressive, and worth going for a drink and if not just to enjoy the  crownmolding and cheerful staff...the food was very meh. My Chiles Rellenos was served with rice, and what I swear was just stewed tomatoes from a can. My friend ordered the fish which was served with a sweet potato mash that made it's way to the plate by way of a piping bag. It reminded me a of banquet hall wedding meal, mass produced and out of style. The food is not modern, interesting or inventive at all. Lots of melted cheese, which is always a great diversion from mediocre food when traveling with anyone from middle America. Excellent Mexican for the person who does not like Mexican!"], ["Abhishek Y.", "One of my most fantastic Restaurant Week experiences in Philadelphia happened courtesy of Los Catrines Tequilas, better known as just Tequilas, in Center City. I have to admit, the veggie options are sparse, but at the same time, they taste phenomenal.For the special, they started me off with a wonderful cheese, spinach and corn empanada, which was perfectly fried and had the perfect amount of filling to dough. Spot on. Paired with the sweet lime habanero chutney, it was divine.Moving on, the main course was one of my all time favorites, a chile relleno. Massive in size, the pepper was stuffed with different cheeses, spinach, and onions, then batter dipped and fried to a perfect crisp. It was absolutely sublime - never had a better relleno in my life!They finished it off with a fantastic choice of desserts, including my all time favorite, flan. Made here with orange rind and a served with a bit of toffeed caramel on the side, you couldn't ask for anything better.All in all, it was a great evening, the service was fantastic as well, and we'll definitely be back! During Restaurant week, it's a real steal!TLDR: Great food, good ambiance, go!"], ["Di P.", "4/50 things on this menu is vegetarian. Yah. You're welcome, veggie lovers for the inside tip. I feel like vegetarians think Italian places and Mexican places are usually a safe call, but this place is NOT so great with that. Wish they would step that up because you can make a lot of nice and flavorful mexican dishes that are vegetarian.Lucky for my non-existent diet, I'm not a vegetarian (today). So I left the fancy Tequilas stuffed from the BEST enchiladas EVER. Enchiladas Playas. Crabmeat and shrimp in enchiladas?! Genius. Biggest EW was the veggie fundido. It was literally a block of barely melted cheese and half a jalapeño cut up in it. If you're gonna say that an app can be made into a vegetarian option then add some mushrooms or somethin' to give it some actual substance. Sad. It was soooo hard to eat and not tasty. It's never a good sign when you say \"Chile's does this better.\" Quick Tip I didn't get to do on my phone: If you enjoy cocktails that are sweet with a little bite (spice) try the Short Rib. It's on point people."]], "Lucha Cartel": [["Sara H.", "Sugar skulls, Mexican wrestlers on the walls, Silver Patròn margaritas? I really really wanted to love this place. Unfortunately, my mum and I did not have a good experience here but props to our waiter, Alejandro who worked so hard to make sure our orders were coming out. I came here after reading some of the reviews about it, and had high expectations. It started with us wanting to order Empanadas, but, they were out so we ordered shrimp ceviche which was delicious. We wanted to get the $9 silver patròn margaritas, but that tequila was out too. We just felt bummed because it was the reason we went there. I had the red snapper with honey-vanilla sauce and olives which was really good. When we were starting to eat our meal, we didn't even have drinks that we ordered before that and that was due to a smaller amount of staff. Alejandro kindly had the manager come over so we could speak to him. The manager did say \"you guys didn't come at a good time\".... Well when are we supposed to come, if we do come back? The manager did take off a large percentage off our check which was nice. But I will not be returning. I think the managing of the restaurant that night was definitely a chaotic mess."], ["Sara E.", "Stopped by last weekend for drinks and dinner. We ordered margaritas and nachos to start and also an entree. I wish I would have known how huge the nachos were, there was only 2 of us so we definitely could have made a meal out of just drinks and nachos. When our entrees came we were already pretty full. We ended up taking most of them home but everything was so delicious! Definitely recommend if you're in Penn's Landing and want Mexican food!"], ["R M.", "I'm not sure how this place has such good reviews, but we had a pretty terrible time when we went.  1. We showed up at 3:30 but were told we had to wait outside until 4 when the restaurant switched over to dinner service.  2. When we were finally allowed in it took about 15 minutes before we could get a waiter to acknowledge us and take our order.  3. After finally taking our order, the waitress disappears for the next 30 minutes. We tried looking for her but could not find her so I suspect she was in the back having a siesta.  4. Drinks and appetizer finally shows up but to no surprise it was wrong. Seriously, just 3 drink orders and nachos, but they couldn't get that correct. The waitress immediately left after dropping off our order so we could not complain or ask for a check.  5. Again I think the staff was all taking siestas in the back as we were not able to get a check from ANY of the staff so we could leave. We waited another 30 minutes before our sleepy waitress appeared again to give us a check so we could leave.  Total wait time for 2 mixed drinks, a beer and nachos - 105 Minutes I'd definitely avoid this place, unless for some reason you really wanna eat at a kitschy mexican restaurant with terrible service."], ["Don H.", "I have had great Mexican food before but this place doesn't measure up in my opinion."], ["Lauren R.", "I came here with some of my girlfriends for lunch on a Friday afternoon. The food was good, the drinks were alright. Nothing to write home about. Our biggest issue was with our sever, Sheena. She was absolutely awful. She was extremely inattentive and not very friendly. She came to our table maybe 3 times and it took her a good 15 minutes to come back for our check. It was 3 in the afternoon and there was no one else in the restaurant. Needless to say, we won't be back anytime soon"], ["Julia C.", "My cousins were in town and decided to try this restaurant for lunch. The food we all thought was good. One cousin had Beef Burrito, another had Chicken Burrito and another cousin and myself had Portobello mushroom (vegetarian) Quesadillas. We shared the nachos which came fully loaded where you did not need add ons for extra cost. The decor was cute, bathrooms clean. Withstand friendly but not so attentive, as we had to flag down for refills of water and diet coke. I will come back with others who like Mexican. They have Vegan and Gluten free options ad well as Vegetarian."], ["Chris H.", "I just finished a tue night dinner here and after reading the reviews I conclude this is a great place to eat and drink as long as it's not Friday at 8pm. The service was great, food awesome, with a decent assortment of good beers. I like this place. And I live in coastal California where Mexican is ubiquitous - and I would TOTALLY come back."], ["Su Q.", "The food was good I had the chicken sandwich n my parents had the cartel burger and they were all good!!! Nice place to come across the street when your getting passport . The service was good ."], ["Harvey P.", "Food is very good, we enjoyed it. Drinks are average. We came because they had Salsa Social on Tuesdays and free salsa lessons. We are Puerto Ricans from The Bronx visiting the Philly historic area for a few days and were very excited about coming across Lucha and their salsa social. We had lots of fun watching people learning how to salsa. The instructor was pretty good and made sure the participants were having fun. Once the lessons were over, the dance floor was open to all. The first song was one of salsa's classic hits but then after that, they played too much bachata (salsa social ?) and played none of the classic or current salsa hits. We were there until closing and only heard one merengue, and not even one reggaeton. I have better salsa on my iPhone. Go and enjoy, buy be prepared to hear as much bachata as salsa."], ["Stephen D.", "Love the drinks especially the tequila and margaritas but it can get very loud. Only had the food once but was very tasty."], ["Meghan S.", "I went back to lucha this past weekend. In fact, each time I've been previously had been during happy hour, so maybe I was too harsh in my first review. This place is really popular on a Friday night. I got there late, but my friends had to wait a half hour to be seated. I had their enchilada dish and a few house margaritas....yum! Much better experience than the meal I ordered previously, the steak salad. So, my impression of this place has gone up; I'll probably be giving it a few more chances."], ["Brianna K.", "Disappointing. I really wanted to get the cactus burger when I went here, but it turns out that even their bread is non-vegan so I got mushroom tacos instead. They were very good but still had to be modified in order to be vegan. Cute place and a great location but I don't see myself coming back."], ["Briana C.", "Like a lot of other reviewers, I really wanted to love this place.  Old City needs some solid Mexican food and if this place were good, I would be a regular.  But I've been here about three times now for dinner and its been disappointing every time.This most recent time we went the service was terrible.  We considered walking out after waiting at 10 minutes to get two beers (the place was not crowded).  The beers arrived just in time to keep us around and we put in our order for dinner.  We decided to start with the roasted corn on the cob - which was delicious but most certainly did not seem roasted and was served cold.We ordered the carnitas tacos - specifically with hard corn shells not soft corn tortillas because I don't like them.  We also ordered the chicken enchiladas and rice based off of the recommendation of our waitress.  After we put in our order, we didn't see our waitress until it was time to get our bill.When our food came out, the tacos were on soft corn tortillas and I let the food runner know we wanted the hard shells.  He said the kitchen had just run out.  I wasn't going to cause a stink but shouldn't the waitress have informed me of this before blatantly just bringing me out something I said I didn't want?  The chicken enchiladas came out without the side of rice it was supposed to have.  The food runner said he would be right back with the rice.  That was the last we saw him.The enchiladas were really tasty and the tacos were bland.  The carnitas was bland and fatty.  We would have really loved to have a few beers with diinner but we only saw our waitress enough to get one round.  Someone random came over to check on us at one point and we had to ask him to bring our waitress around for our check.  The drinks and margaritas are nothing special, but the times I've been here just for drinks and snacks its been completely adequate.  Maybe I'll be back for drinks and chips but definitely not for dinner.  Jose's Tacos at 10th and Spring Garden is a hole in the wall but their food is way better than this place and worth the drive if you want a real dinner."], ["Christina W.", "Lucha cartel is truly a gem hidden amongst the crowded landscape of bars bars and more bars that makes up Olde City. However, Lucha manages to stand out in a number of ways. First, it's the combination of Dias de los Muertos and Luchador themes that makes for a truly unique atmosphere. Then there are the perfectly crafted margiaritas that you can have prepared a variety of ways and with a variety of liquors. This is all topped off with excellent food that provides options for both meat eaters and non-meat-eaters alike and an always on-point craft beer draught list. Hit up Lucha for the Luchador decor and stay for the good food and drinks."], ["Jill B.", "Great nachos and black bean tacos. The service is amazing, our waiter was very attentive and helped with great suggestions. Reasonably priced too!"], ["Danielle D.", "Great location, terrible service. Walked in and asked the hostess if we could eat outside, and she looked at me like I was crazy and yelled NO. Ok, calm down, valid question on a May Saturday afternoon. After waiting ten minutes for our server to even greet us, she gave me the wrong margarita. When I brought it up to her she insisted that it was correct. Nope, sorry, I know what OJ tastes like (I'm from Florida). The margarita tasted exactly the same as my boyfriends. So either all the Margs are identical and the menu is BS, or she screwed up and couldn't admit it. I wasn't even able to order a new drink because she was MIA the entire meal.I really wanted to like this place but the service was atrocious and completely ruined the vibe for a pleasant Saturday."], ["Jennifer H.", "Very cool decor in this place. It's different and edgy, and gives you plenty to look at while you wait for your food. The bathroom was spotless, and also had fun design on the paper towel holders and walls. Even the stairs were painted with colorful skulls. Skulls, you say? Yes. The entire theme of the decorations seemed to be Dia de los Muertos (Day of the Dead). en.m.wikipedia.org/wiki/…They have $5.00 drinks during their 4-7 happy hour. I was still hurting from a particularly wild night, so I just drank water. We started with guacamole with chips. The guacamole was medium spicy, so you might want to skip it of you're not a fan of a little zing. It honestly wasn't great. We didn't eat much of it.I got the cactus burger, which allegedly had real cactus in it. That's kind of fun and funky, so I thought I'd try it. It was very salty. The vegetables were cut into think strips and then scooped into the bin, but the stings were too long (IMHO). This made it incredibly difficult to eat  without making a huge mess. It also could have used some sauce, as it was pretty dry.My friend wasn't a big fan of her pulled chicken wrap, either. Everything was just too salty. It's a very vegetarian/vegan-friendly place, though. They always offer a vegan soup (hard to find, sometimes).I liked that the servers didn't wear any particular uniforms. It gave the place a trendy and relaxed feel to it.I'd go in for drinks, but skip the food."], ["Stephanie H.", "Went with a gf for happy hour. The lights and decorations are pretty awesome. And the patio into walnut is awesome for outdoor seating. But please don't get fooledThere is nothing special about the food. Its very generic and is probably mass producedFor example the guac and chips was literally the overly green guac you can buy from the grocery store with the regular corn chips you can get from the store. LiterallyThe cactus burger is an interesting concept but not well executed I wouldn't recommend it. My friend did say she thoroughly enjoy the wine sangria though!Happy hour has drinks for 5 dollars including sangria and mojito among others. Also there were 5 dollar app size apps that were also pretty generic. Quesadillas, guac and chips, tacos...In sum: Would not go there again"], ["Pam S.", "Um, what can I say, I'm a sucker for casual Mexican. Brought to you by the peeps at National Mechanics (which I'm actually not a fan of), Lucha Cartel brings $10/plate Mexican food to Old City (so don't bring your West Philly friends, or expect them to whine).The food has been nice, I dug the cactus burger and the burrito (both part of their vegan options), however, be warned that they skivved us out of our guac in the veg burrito -- had to ask for it, and even though it's on the menu, there was a little noise.The drinks were a little sub par too -- I love me a margarita, and I don't know what they gave me, but it was a wee weird. However, considering it still contained tequila .. shrug.Hey, I might be too forgiving, but ... meh. I'd probably do tacos next time, since they look so friendly for take-away (eat 2 out of 3 tacos and you're set!), but I also hope they step up their game a bit to stay in the neighborhood. 4 stars anyway, cause what can I say, I'm a fan.Oh, also, if you order the large guacamole ... it's ridonkulously huge. Also good. Oh, and major, MAJOR points for offering separate checks when I went with a (small) group. Will restos in Philly please get on this?"], ["Rob B.", "Good ambiance, prompt and attentive staff and brunch was fresh and delicious. A very nice spot, which probably gets hopping at night."]], "Los Gallos Mexican Taqueria": [["Julio C.", "My car got hit and take out is worse than the dishes you normally get when you sit down and eat I wasn't too impressed I'll stick to my usual spot up the street , el jarocho !!!"], ["Rusty C.", "Meh, is a great word to use in describing this place.  Service was good. Salsa was good.Prices were good.Food was disappointing.  No flavor. (I had the beef/chicken enchiladas)TV's were great to watch the footbal game!!!"], ["Chloe R.", "This place is infested with bugs!!!I have no idea why this place has so many good reviews. First of all, we got there around 8pm and nobody came to the door to seat us, so we had to walk all the way to the back just to get a table. When I went to use the bathroom it was infested with flies all over the ceiling. I ordered the cheese enchiladas with mole sauce. I also ordered a drink that never came that they tried to charge me for at the end. My meal to say the least was gross. The tortillas were hard and difficult to cut, it had barely any beans inside it and the entire dish was DROWNING in mole sauce. So much sauce that I couldn't taste my dish. My boyfriend ordered tacos which he said were tasteless. The sauces they use for the chips and salsa are sauces to add flavor to main dishes, not your traditional dipping salsa. I don't think they really know how to make mexican food, even though they advertise that it is 'traditional.' I'm from Chicago and have lived in California (home of the cali burrito) and we saw that this was the best place to get mexican food in phili, I am in shock. After picking up our plates we waited 10+ minutes for our check and had to go up to the back to pay our bill. Save your money and go somewhere that isn't bug infested, drowning in sauce, and more for your money. I would never come back here."], ["Zahra A.", "I love the food everytime I eat it. It's consistent every SINGLE time. I always get the Vegetarian Sante fe burrito and it's amazing. The vegetables are so fresh and the flavor is sooo rich. I love the chips and salsa as well!"], ["John H.", "Even though I didn't need to, I made a reservation over a week in advance for a friend's birthday at this hole in the wall known for good Mexican but they closed with no warning whatsoever. I guess if it was open I'd get to enjoy the affordable options like tacos a la plancha but can't now because they closed with no warning and never contacting me!"], ["Allison B.", "Not sure what all the fuss is about.I went here last night with a small group of friends. No one was blown away by their meal (tacos, enchiladas, burritos). The salsa was what you'd expect. The service was painfully slow. It took about 10 minutes to get the check after we asked...twice.I saw an order of guac go by and it looked great. And I keep reading things about the chicken tacos. So if I find myself in the area, I'll for sure stop by again. But nothing about my veggie enchiladas (served lukewarm) made me want to rush back."], ["Sari G.", "Little corner spot in South Philly. They give you chicklets with your order. Cute! Their guac is great!! 3 tacos for $5.50. Can't beat that. I love the veggie ones without cheese. When we are there they gave me sliced avocado and these amazing roasted baby spring onions. When we got takeout, no avocado and only one onion. Strange. Super delish nevertheless. The onions are amazing! I have to ask then their secret. The hibiscus water is yummy and pretty colored. Colorful flags decorate the place. They barely speak English but haven't misunderstood me yet. Love having this close by!"], ["Lori Z.", "Disappointed. Just moved back to Center City and so excited to try Los Gallos after reviews. We eat A LOT of Mexican food, and have been spoiled of late with El Limon in Conshohocken. At Los Gallos, sauces and chips were good and chicken tamale with salsa verde was ok. But pork (carnitas) burrito was almost all gristle and fat. The chicken tacos were OK but bits of bone or gristle in them also. It seems they make everything to order, so expected more. Maybe it was an \"off\" day."], ["Zachary C.", "Showed up with a group of 10 and we were seated immediately.  The nachos were excellent and the chorizo tacos were great"], ["Annmarie W.", "I saw this restaurant on Yelp, took my lunch time to go there. Placed an order for my coworker and myself.Returned to work,they gave me one order. I called to let them know the person who answered the phone in a nonchalant manner identified me from my visit there and told me that's what i ordered. I called back after I hung up and explained again what happened asked for a mgr they said he was not there and took a message.I asked them if I could get delivery as my lunch time would be up. She said I had to order at least $10 to get delivery for an order they messed up. Still waiting, hungry on a call from the Mgr. Bummer. Pretty sad as the picture tell a positive customer experience. NO!"], ["Sandy C.", "Love this place....food is wonderful and fresh!  I don't love the Oxaco cheese (or however you spell it).  It is like leather....very strange cheese.  But other than that, love this place!  I will say that they seem to need more help on the wait stuff during lunches though, because the poor woman is running ragged trying to keep up with everything.  But she does a great job even though she is the only one there.  Because of that and the weird cheese was the only reason this didn't get the 5 stars.  Great place though."], ["Audie M.", "this place is legit. The steak was thin but still juicy without being too fatty."], ["Vanessa J.", "I went twice the week I found them and I am not someone always going out to eat.Found this place randomly when my go to for fish tacos Veracruzana (9th and Washington) was unexpectedly closed. I  take my quest for fish tacos pretty seriously, and I was soooo lucky to find out about this place! The fish tacos from here are incredible. They include fresh guac at no additional charge and are so pretty and yummy! Size of plate is great for the value- I eat 1 taco, a side of beans and rice leaving  the other 2 tacos to take home. The guacamole with chips is also amazing. Service was FAST.If you love fish, get these tacos and you'll have found the love of your life. Or at least the love of Philadelphia Mexican restaurants. Gotta start somewhere."], ["Ant B.", "Bad service. Went to pick up food. Order it 20 min before arrives. They told me 10 min it would be ready. Got there and told me to wait another 5 min then 5 min again then they didn't even put the order in. The lady and guy didn't care. Worst service ever."], ["S D.", "I just moved around the corner from this place and I feel like I won the lottery. I was gonna try and be vegetarian this summer but this discovery just shot that to hell.  Excellent super fresh Mexican that is authentic and perfectly priced. It's one of those places that eating there once you start mapping out what you are going to order the next 5 times you go. Had the corn fungus (Huitlacoche) tacos one night and 2 nights later got the mixed grill of ribeye steak and grilled prawns. It came in a lovely set with a few different things including pico de gallo, a big scoop of guacamole, little mini cheese quesadillas, rice and grilled cactus. It's big enough for 2 meals and I am a big eater. Chips & salsa (with refills) at the beginning of the meal for free. Also, 1 liter mexican cokes that are like in a 2 foot bottle. HEAVEN They have menudo here (every day) and fish tacos that aren't fried. Tamales on saturdays & sundays. Capri suns and quarter waters in the drink fridge. Little cups of rice pudding for dessert. It's going to take actual effort not to eat here everyday."], ["Hill R.", "This is the spot for good Mexican food, been here 3 or four times and was never disappointed"], ["Helen Z.", "Came here on a Tuesday night and the restaurant was packed! The one waitress who waited on all of the tables was seriously amazing. Running around non-stop all the while remaining friendly with a genuine smile on her face. Complimentary chips and salsa was served right away and we ordered the tacos al pastor, grilled chicken burrito, guacamole, and horchata. The guac was good but everything else was amazing! We got there starving and left stuffed! Great spot for Mexican food. I will definitely be back!"], ["Justin B.", "I can't stop coming back to this place! Authentic Mexican food for a good price. Definitely try their burritos, tacos & tortas! Tacos rancheros are probably my favorite."], ["Madelyn F.", "It doesn't get any better than this for Mexican food in South Philly. If you haven't tried it, you should!"], ["Aaron G.", "Best Mexican in the city. Also happens to be a bargain. A value at twice the price. It's a little off the beaten path, but it's worth the walk. Delightful waitstaff and great service."], ["Timothy K.", "My wife and I were craving some Mexican food and from reading the raving reviews, decided to check this place out. I have to say that they were the best tacos that I've ever tasted! Definitely have to go back!"], ["Sarah P.", "Favorite Mexican place I've tried so far in South Philly, and I've made it my mission to try as many as possible. Los Gallos was everything I hoped it would be:BYOB: checkInexpensive: checkEnormous portions: check (I had leftovers, which is RARE for me)Plenty of vegetarian options: checkAwesome Mole sauce: check"], ["Kendrah R.", "It is so nice to find a restaurant that is no BS.  The waitstaff gets you what you need and they have good food.  I should eat here more often.  The food is very fresh tasting.  I had an huge burrito with sauteed veggies that had such great flavor, it was as satisfying as eating meat.  This menu is large for a taqueria, with plenty of entrees.  My man had shrimp fajitas.  More food than he could finish.  It is a rare occasion that he brings home a doggie bag.  Even their guacamole came in a big bowl, an item that so many other restaurants skimp on. To top it all off, they had an extremely long TV show on with the volume down.  Two contestants were in a race to make a penis and balls out of clay.  It was pretty entertaining observing a restaurant full of people pretending not to watch what was happening on the screen.  Kids, older folks, couples, families some noticing and others trying hard not too.  It was hilarious."], ["Hayley T.", "I'm terrible at writing reviews so I'll be brief. This place is incredible. The Los Gallos quesadilla is the only thing I ever order and it's perfect every time. Definitely go here."], ["Kate R.", "WISH I lived closer to this place!!Atmosphere: Casual.  Bustling.Food: Fabulous and fresh.  What to order: Anything, really, it's all good, but if you go on a weekend, go for the tamales!  I'm also a huge fan of horchata, so I'd suggest that too.  Service: Laid back.  Perhaps a tiny bit slow, but making food this fresh and tasty does take a little time."], ["Elliott K.", "Their al pastor burrito is probably the best I've had in Philadelphia."], ["Kenny L.", "Food was amazing at a reasonable price. Service took longer than expected but overall, I will definitely come back."], ["Susan M.", "Amazing flavor, perfect blend of spices. When I went I didn't have to wait at all and the staff was nice.I recommend the chicken."], ["Lou D.", "Exceptional, fresh authentic food very reasonable prices. Went for lunch service is attentive and friendly. Plenty of choices and blackboard specials. Most likely the best Taqueria in South Philly."], ["Travis R.", "Huge and cheap portions of tasty, authentic Mexican food! What's not to like? The waitstaff is fast and attentive. This is my favorite place in Philly so far."], ["Christin K.", "Best Mexican food I've had in the area.  The tacos rancheros were fresh, full of meat and fillings.  The place was tidy, and the service was friendly.  Very casual vibe.  Will definitely be back."], ["April L.", "This place is delicious, I rarely eat Mexican cuisine but this stuff really hits the spot. Our server was extremely friendly and prompt, I could tell she was busy, but she took the time to get our chips and rice water, by the way... The rice water was so good! Try it next time. I'll be returning for more in the near future."], ["Jamie K.", "Hands down, my favorite Mexican food place in the city.  The fajitas are probably my favorite, followed by the carne asada burrito.  Their chips and green salsa is out of this world, and good service too.  We go at least once every two weeks with a work crew for lunch, and our gang keeps getting bigger and bigger."], ["Steve S.", "Thank you fellow Yelpers for pointing me here.  Wound up in South Philly last night after an Ikea run.  The Ikea cafeteria was closed, so I needed a bite around 9pm.  Took a quick spin of the Yelp app, and saw this place sitting in the 4.5 star range after 125 reviews.  That was enough to convince me.  Based on previous reviews, I went for the guacamole and chips, and for the Al Pastor tacos.  Now, I have to count one strike against them on one thing.  One restaurant pet peeve is when they won't accommodate a relatively simple request.  I like to try different kinds of tacos at these places.  Most Mexican places will happily do a plate of tacos where each one has different meat, for instance one chicken, one steak, and one pork.  This place does not offer that option, and when I asked if they could do it, despite all of them being on the same part of the menu at the same price point, I was told no.  BUZZZZ.... sorry, wrong answer.  Strike one.   It's not an unreasonable request.  Honor it.  Now, I'm happy to report that will be the only strike against them.  Because, in the end, the three Al Pastor tacos I was forced to choose were quite excellent.  Good flavor to them all around.  I suppose there are worse things than being forced to eat all of the same kind of taco.  I enjoyed the guacamole too.  Though I found the recipe to be more simple than other guacamole I've had.  I like a little more flavor to it.  But I can't argue with the freshness.  I'd eat it again.  I suppose I'll just have to come back two more times and try the chicken tacos one time, then the steak the next time."], ["Abby W.", "Just... wow. So many unexpected, and pleasant surprises! We live very close to this place so we decided to do pick-up and try their offerings in the comfort of our own home.It's bigger inside than it looks from the outside, and nicer than I expected in terms of eat-in ambiance. It was also extremely well-air conditioned. I would bring a sweater. I'm that girl that's always cold in the air conditioning, so take that as you will. They have a very nice pastry case and the tres leches and other items all looked delicious and homemade. We will be trying those next time.I got tacos especiales de carne asada, and E got the beef milanese cemita. We also snagged an order of chips, salsa, and guac. The salsa is mad stingy, but tasty enough, and the guac was quite good. Chips are freshly fried.My tacos were insane! The platter weighed like two pounds and it contained 3 double-layer soft corn tortilla shells smothered in chopped grilled steak, fresh onion and cilantro, and sauteed nopales (cactus, so good) and onions. I asked for no cheese and they delivered. It was incredible and so much food. More than enough for two meals. E inhaled his sandwich and I managed to steal a bite before he finished it. Delish.Did I mention this was all like just under $30 or something? Crazy good food. We will be back soon."], ["Cynthia A.", "Best Fish Tacos. Go there you will be glad you did. Very attentive service staff and very diverse customer base."], ["Vern H.", "Exceptional meal. Lamb special was melt in your mouth good! My daughter could not stop raving about it..."], ["Xindy W.", "My favorite place to go for Mexican food. Great portion size. Delicious authentic Mexican food. Ive tried a good amount of dishes on their menu and the only thing I didnt like so far is the tripe soup. Sometimes their meat is overcooked but their flavoring makes up for it!"], ["Joseph C.", "LOVED this place. The food wasn't too spicy, the service was great and it's BYOB. I'll be back and look forward to trying out their breakfast options.And for what it's worth, this place is an active participant of the Lower Moyamensing Civic Association. That means something to me because it shows that they care about their neighborhood. One bummer that you might encounter is that this place only seats 25-ish people. My suggestion would be to get there before 7pm, especially if you're rolling with a group of 4+."], ["Zack H.", "This place is awesome!Kind of a diamond in the rough, you wouldn't expect a place this place to be where it is, but it's in the heart of South Philly and is authentic Mexican at its finest.When you arrive you are offered complimentary chips with not just traditional salsa, but also a green chile/avocado type green salsa that is incredible.  And to make that even better, its bottomless, so they continue to refill it as you wait for your food.We ordered three burritos, one carne asada, one chorizo and one spicy pork.  I had the spicy pork it was outstanding, great reviews from the other two burritos as well.  This came as a recommendation from a friend of mine who has had other things there and says that everything is great.  It was reasonably priced, tasty and good service.  Food took a little longer to come out, but everything was made to order and it was incredibly tasty.If I had to compare this to Taco Riendo, which might be the top 2 places for authentic Mexican in the city, I give this a leg up, it's close, but I think this gets a leg up.  Place is awesome, check it out."]], "Cucina Zapata": [], "La Calaca Feliz": [], "Tacos Don Memo": [], "Cafe Y Chocolate": [["Emelina P.", "Just finished eating the vegetarian omelette. This place is great! The omelette was perfectly seasoned, and I love that they have a fresh salad on the side. The coffee was delicious as well. The atmosphere is wonderful- love the homey-feel and the music. I highly recommend this place for anyone who's looking for Mexican breakfast food."], ["Jane M.", "Fabulous food!  We have been to Cafe y Chocolat 3x for brunch and 2x for dinner and it has been amazing every time!!!  Great huevos rancheros, enchiladas verde, fish tacos, Mexican coffee.    Never had a dish that wasn't fantastic.  Owner very friendly and he makes the experience wonderful.  Highly highly recommend!!!"], ["Samantha N.", "Awesome food. We had a Groupon so I was able to try quite a few of their dishes. The mole sauce and the verde sauce were both delicious. I wish that they had some more vegan options - I'm a vegetarian who tries to eat vegan often and can't tolerate too much lactose. I'd definitely recommend the food to all of my veggie and non-veggie friends."], ["Ramon F.", "Have the tamal, it is awesome! I make tamales at home and they are so much work, that I only make them a couple times a year. Their tamales are almost as good as mine ;-) ok... just as good. The beans and rice were also great! The service is always good."], ["Khanh V.", "Hidden gem? Yea I think so. It is definitely a place in the neighborhood that you walked by, drove by and not go in. But you should go in. The food and service is good here. That's all I have to say. Gotta stop going to those franchise and support your local businesses."], ["Larissa G.", "Aha! I have found the brunch that I have been searching for, buried deep in South Philly amongst the crust punks. This is a perfect, independent brunch destination with authentic Mexican dishes. My boyfriend and I came in last Sunday and sat down immediately. There are only a couple employees here, so it took longer than usual for menus and iced coffees (La Colombe). Just relax and realize that no one is in a huge hurry and you will be fine! They even forgot that I ordered orange juice, and I don't care. If I really wanted it, I am sure I could have reminded them. We split the huevos and the breakfast burrito, both of which were really good. The huevos were stacked in layers of fried eggs on tortillas and the yolks burst when you cut into it, which was so satisfying. The salsa verde was also top notch. My only complaint was that the breakfast burrito was made with a wheat tortilla, which isn't my favorite. The flavorful chorizo is definitely a good choice for this dish, although I wish we would have gotten more salsa. We ended the meal with a chocolate chip cookie, because we had to try the chocolate if its in the name!"], ["Roopa S.", "This has become one of my new favorite brunch spots in Philadelphia. First of all, the place looks ADORABLE from the outside. A cute little neighborhood cafe and gem, the art surrounding the building is stunning and vibrant. Prices are extremely affordable. You can eat well here-- and even splurge a little with multiple plates to share plus one of their amazing hot chocolates, and not break the bank. Service is nothing to complain about. Seating is limited because of the \"neighborhood cafe\" feel. It's quaint, charming, and cozy.In terms of what to eat/drink...:+Huevos Motuleños Especiales... Apparently one of their best sellers. It tasted AMAZING but I am personally not as huge of a fan of green sauce as I am of mole sauce. +Chicken Torta... still stands as one of the best sandwiches I've had to date. It's MASSIVE and so incredibly tasty. I split it with a friend and we were stuffed after each having just 1/2 the sandwich.+Molletes with Pico De Gallo... delicious. A popular item again, and it was a fabulous way for us to start the meal. The cheese is melty, and topped with the pico... drooling now thinking about it.+The churros are tasty for people who haven't had that many churros in their lifetime, and they come with some fun dipping sauces-- but if you are a HARDCORE churro lover and have had some amazing (i.e. more authentic ones) in the past, I'd skip them. There are other menu items that are better!+The hot chocolate is absolutely amazing. Please don't leave without trying it. I've tried the Cafe con Chocolate drink, the Oaxaca, and the frozen hot chocolate drink. All were amazing.I'd definitely try to make a trip down here. The menu is flooded with dishes that sound amazing, and I can speak to the fact that they are executed wonderfully as well. I really am looking forward to trying more of their drinks, desserts, and dishes (namely the burritos!)"], ["John R.", "Really Tasty. I can't remember what I had as this is kind of a late review, but it is a really good place for latin style brunch food. Almost every dish comes with beans and there are spicy and mild options on the menu. Whatever I had I remember it being quite good and my girlfriend had the Horchata and I remember it tasting delicious. The one thing I do recall was getting the signature cafe con chocolat which was huge and delicious. I'd go again for sure."], ["Dustin K.", "The cafe con chocolate is extremely smooth and balanced. Perfect amount of sweetness to bitterness. Also it's humongous and great to share but light enough for one person to finish if necessary. Food was outstanding as well. Do not let the pictures fool you. I don't think the yelp photos give the food justice. Tried the porta and huevo rancheros  with my girlfriend. They perfectly complement each other. Def a great place to go on a Sunday morning. Only gave it four because my belly be rumbling while I write this. Ugh."], ["Finney A.", "Came here on a cold day and was welcomed immediately by staff. Food was filling and tasty. Would definitely try out the specials they have."], ["Karen B.", "this place is named appropriately -- the actual \"cafe con chocolate\" menu item is one of my top 5 most delicious sweets in the city of philadelphia. i don't even usually like espresso, but this drink is crave-worthy and consistently made with love.the food here is solid, but it's the CCC that keeps me coming back."], ["ben c.", "WOW!  How come I didn't know about this place sooner?!  Came here with my gf, sister and brother in law!  To start off....we had the biggest smiles on our face from when we sat down until we left....!  The hostess/waitress is really nice and gladly seated us and explained the menu to us as there were so many things on there we had no idea what to order.  Everything looked so good!  We had nachitos,  tortas, and burrito.  My brother in law who grew up in L.A. eating Mexican food approved so that's good enough for me!  My tummy agreed.  Even their cafe con chocolate, and horchata were amazing (no powdered mix taste).  Their portion are pretty generous and the prices are very reasonable.  Please note the churros are not as good.  They were dry and did not compliment the quality, taste and freshness of the rest of our meal.  It tastes like warmed up frozen churros.  None of us enjoyed it and for that I would have to give this place 4 stars.  How can you have a yummy Mexican place with yucky churros?! :T  We will most certainly be back and keep craving to find a time to come back!"], ["Carol C.", "I've heard so many wonderful things about this place, but I was so severely disappointed.We came in as a party of 4, and got seated immediately. However, even though we got seated immediately, we had to wait about 15 minutes JUST to get menus. We decided to get the brunch items, but another 20 minutes passed before anyone came to take our order. Once the order was in, we were STARVING, so of course, anything that came out would've been delicious, BUT, after waiting an additional FORTY minutes, all I had was a bitter taste in my mouth. We asked about our food, and the employee kindly told us it was coming up right now (lies), but TEN more minutes passed before we got our food. I would say the food was pretty good for the price, but it's definitely not worth the wait or poor service. Also, since this place is called \"café con chocolate,\" I assumed their churros with hot chocolate would've been iconic, but the churros were bland and the hot chocolate actually tasted like lukewarm watered-down chocolate milk."], ["Ricardo F.", "Place is cozy and small. Large portions and fair prices. I had the blue huarache with steak and my Wife had the Tamal Azteca both were delicious. For dessert the cafe con chocolate and churros are a must. They let you BYOB, we didn't know but next time we will go prepared"], ["Maame A.", "Excellent Food! Authentic food! Best tacos I have ever eaten! Nice small family restaurant!"], ["Cassandra C.", "I have been in this restaurant many times. I have never been served. I live so close to Cafe Con Choco Not that I could come in slippers and pajamas. (I am fully dressed when I enter...)       I imagine after reading all of the other reviews that it's probably good for my figure that I am ignored when I walk into their restaurant. I've lived in this neighborhood for 9 years and have been ignored when I have walked in every time. Including when they first opened...I keep trying to give them the benefit of the doubt ... I keep trying...     The last time I went in the restaurant was when they had up a sign that said they had tres leches cake... I won't eat it anywhere except a Mexican bakery in LA or if someone's Mexican grandmother makes it!!! IT IS My absolute second favorite desert in the whole world. I walked in and stood there about two minutes... There was a man who looked up and walked in the back and a woman who looked at me and turned her back  to me as I stood there.      I guess the super power I've always wanted (to be invisible) has come true... Cause they don't see ME in cafe con Choco NOT!"], ["Corinne G.", "This cozy little gem is good for breakfast, lunch and dinner and of course, oaxacan hot chocolate.My boyfriend arrived in town, so I looked up a couple of well-reviewed breakfast places, and I thought this one would be the best for us. We stepped inside and immediately felt warm and cozy. This place doesn't have too many tables and there was a large group, but the server sat us right away. The menu has tons of options--including vegetarian and vegan, which was great for my boyfriend. He ordered the huevos rancheros and a cup of coffee while I ordered the huevos motuleños especial and the chocolate oaxaca. The chocolate oaxaca (hot chocolate with cinnamon) was rich and delicious, although I would have preferred it a little less sweet. The huevos motuleños were very tasty and the poblano rajas were a nice touch. The service may be a little slow if there's a large crowd, but you won't be waiting too long and the prices are really good.The servers were a little lax here and there with attentiveness, but they were doing like 5 different things each and were very nice, cheerful and helpful--it happens sometimes in small restaurants and it all turned out perfectly fine.Cafe Con Chocolate also sells baked goods near the entrance, which I was too full to try. I definitely want to come back and have the churros, which come with chocolate dip, and the plantains with cream.Give this place a try! It's a must if you're in Philly."], ["Sari G.", "I just love it here. Small. Cute. Quaint. Veg friendly. Delicious coffees. Easy. Very easy to miss except for the beautiful mural painted on the outside. We came here for the first time on a lovely summer Saturday morning and sat at the one little table outside. We ordered a fresh squeezed juice which was beautiful and delish. Hubs got a chocolatey, sugary coffee (cafe chocolate) he loved and I finished with a gorgeous espresso in a fab blue and white printed cup and saucer. I ordered the tofu scramble and dare I say it gave Sabrina's a run for their money. Served with black beans and oh so incredible Delish. My husband guy huevos rancheros and liked his a lot too. The second time we returned we came with the kiddos and splurged. Ordered a ton of goodies. They got fruit smoothies which they downed in seconds. Hubs got a meat burrito he loved, I stuck with my tofu scramble, kiddos split a veggie breakfast burrito and we all got chips and guac. This time I got a Mexican coffee and was so happy they had soy as an option. Love how veg friendly they are. Tiny place which I understand is now cash only. Perfect little brunch spot. Never had to wait. Super random location. Nothing but a positive experience all around, every time. Service was pretty quick and nothing to complain about. We will have to come back for dinner or lunch but brunch has always been great. Fab way to start the day. Lively, colorful, filling and caffeine enchanted."], ["Elle D.", "This is one of my favorite (and most surprising) brunch places in Philadelphia. It's a little ways of the beaten path, but absolutely worth the trip. With the name of the cafe, it is no surprise that there cafe con chocolate is AMAZING! That by itself would make this cafe worthwhile for me! However, their Mexican brunch menu is delicious! As an added bonus, everything is reasonably priced with their brunch items running between $7.50 and $9.50. The restaurant is fairly small, but I have never had trouble getting a seat. I highly recommend making the trip for this restaurant!"], ["Frances S.", "This place is such an absolute sweet find around my neighborhood! Delicious hot choco/lattes, mouthwatering Mexican food, and friendly staff in such a cozy, quiet ambience. However, the wait time to receive your order may take around 25-40 mins. Not even the nachos appetizer came in early. Food was good but it's really slow getting your order in that a couple of times, my family was thisclose to just storming out and getting Chinese fast food. They need to hire more cooks on the weekend."]], "Quetzally": [["Judy L.", "I am mixed about Quetzally.  The positives: vegetable quesadilla was amazing, the guacamole was really fresh and tasty, and the chips and salsa are fantastic.  The negatives: vegetarian burrito was flavorless and the chicken tinga tacos were very average.  I am willing to go back and try again because there were some positives.  However, for the price, the next time this food needs to wow me."], ["Phil E.", "DO NOT GO HERE. I placed an order on Saturday night, and waited about thirty minutes for delivery. The delivery guy then called me, telling me that he went to Pine Street with my food. I told him I'm on VINE street, and he said he does not travel that far to deliver. (In that case, why did they take my order?) I called the restaurant and told them that the delivery guy was refusing to deliver and the owner got on the phone to say that he doesn't travel that far. I told him I had been waiting for my food and they shouldn't have taken my order, and made my food, if they didn't deliver that far. His answer? \"Well, what do you want me to do about it? There's nothing I can do for you.\"And then he hung up the phone. As I was speaking.In summary: the restaurant made a mistake, forced me to wait, didn't find a solution, and then was rude and discourteous. Do yourself a favor and go to Plaza Garibaldi instead. It's great food and they are actually nice."], ["Juliana K.", "What a Mexican gem! This restaurant is like a piñata full of badass tacos.Complementary fresh tortilla chips with salsa verde a great spicy sauce.Chipotle chicken (tinga) tacos were delicious! Tender chicken. Great flavor.The spicy pork tacos with pineapple was amazing! Get these! Burst of flavor!This place is inexpensive, friendly, no frills, and great food.Will definitely be back for the large dish of nachos I saw!"], ["Kathleen L.", "This place was amazing! Very quaint place with authentic Mexican food. The tostadas were so deliciously crunchy and my fish tacos were so fresh! My boyfriend doesn't even eat Mexican food but I begged him to go with me and he even loved it! Definitely will be back!"], ["Rob S.", "Highly highly recommended. Little hole-in-the-wall restaurant. BYOB. Fantastic, authentic Mexican food. If you don't feel like waiting forever for a table at El Vez, and want cheap, high quality Mexican. This has got to be the best place around. Oh, and definitely order the nachos as an appetizer."], ["Elizabeth D.", "AMAZING! Love this place. The food is excellent and the delivery is pretty fast."], ["David V.", "Very good hole in the wall Mexican restaurant. They have a handful of tables, and aren't usually crowded, so chances are you can sit, if you want, but the place is small. I love their quesadillas, and the dollar lemonade is a nice departure from the custom of overcharging for drinks at restaurants. I've also had the horchata to drink, and burritos to eat, and liked both."], ["Sam W.", "I've had much better tacos in Philly. Just okay. They do have really good horchata though."], ["Ashley T.", "Best tacos in south philly for sure! My friend and i wanted to try a new place so we went walking and spotted this gem. Its hidden between 13th n 12th and its not much to look at from the outside but the food is amazing! I order chicken nachos and my friend ordered chicken quesadilla with rice and beans. The portions are HUGE and filling. This is authentic Mexican food and its delicious. They give you homemade chips with both red and green salsa when you first sit down. The red salsa is SO HOT AND AMAZING! overall service is good too. But the food is on point!! Def will be back."], ["Andrea A.", "I struggled on whether to give three or four stars. The spicy pork quesadilla was soooo good. Pulled pork, cheese and pineapple were meant to be eaten together in between warm tortillas. Only problem? It wasn't spicy. I didn't even care but for the sake of someone else expecting that kick- it never came. The brisket tacos were delicious and not lacking in filling. Their phone just rang and rang without answer but they were pretty friendly when I walked over to place my order. We ordered salsa and received guac but when approached with the error, we got the salsa and kept the guac. Decent customer service recovery. Overall opinion: order from here and you'll be fat & happy- just make sure you check your order before leaving if it's takeout."], ["Carla F.", "This is high quality Mexican food.  They have a great variety.  I always order delivery and the chips are delicious, not soggy.  Its definitely not a 5 star restaurant but the shit is good so they deserve 5 Yelp stars!!"], ["Steven N.", "Really solid Mexican place in a neighborhood that needs more of it."], ["Andrew W.", "I had no idea how badly I needed Mexican delivery in my life until I found Quetzally.  Their pork and pineapple burrito is great, the service is excellent, and the food is pretty reasonably priced... its not as cheap as some of the places off 9th street, but its a great option."], ["Joe W.", "JORGE! JORGE, JORGE, JORGE!This place popped up while I was overseas for two years, and I couldn't be more delighted to have returned to my place of employment a mere 2 blocks away with this as a viable lunch option. The reviews that are already here pretty much say it all. Great food, cozy little spot, and super friendly staff. Jorge, the owner, is an incredibly awesome guy, and a hustling hard-worker. He has put in his time in the restaurant industry and has definitely absorbed all kinds of good from his experience. He refuses to compromise quality or service, and has big visions for expanding his concept and reach down the road. Get in to Quetzally and chat it up with Jorge so you can one day say, \"I ate there when...\""], ["Indigo V.", "Quetzally is a block and a half away from my house, and I just ordered takeout for the first time. Delicious!!!"], ["Hagana K.", "God bless you Quetzally.We were living in Center City stuck with atrocious excuses for Mexican food like El Rey or Jose Pistolas (decent nachos) after four years in glorious California. Now we've finally found our Philly burrito spot.Jorge (the owner or the chef? not sure) had al pastor as his may special and I got a huge burrito the other day. I prefer dry burritos I can eat with my hands, but this monster had this avocado sauce with pico de gallo on top and it was delicious.The green salsa that comes with the chips is spicy and awesome with bits of guacamole.Can't WAIT to try everything on the menu, and whatever specials Jorge has going each month. This is real, authentic Mexican."], ["Girish K.", "Great food, small n clean restaurant so eat in on weekends can be difficult but definitely worth the wait...chorizk is by far the best i had in usa till date, treat for foodies."], ["Susan R.", "Can't believe I've been living three blocks from this gem and not knowing!! Making up for lost time and getting Quetz at least once a week. :)"], ["Lin Z.", "Delicious food! It's the kind of small family style place where you can just relax and enjoy great food."], ["Richard C.", "All I can say is wow!  So being a block away, I decided to finally try Quetzally!  Hands down, this place trumps all Mexican food I have had in Philadelphia!  I have had very authentic Mexican food and Quetzally is just that.  You can taste the freshness in the tortilla, meat, and ingredients!  Like prior reviews have said,  this is a hidden gem.  The place inside is very nice as well if you eat in, I chose takeout, but would be more than happy to eat there next time.  This restaurant choose a good time to come into the neighborhood with all of the renovated and new properties being built around it.  I didn't even get to mention this place is AFFORDABLE!!   If I'm looking for authentic Mexican then this is where I'm coming!!"], ["Gary G.", "Mmm... Got the shrimp tostadas and the spicy pork burrito. Waay better than ordering my mexicano off the grubhub. I shall be back"], ["Stephen W.", "This is great Mexican food. First off, its BYOB, so if you want a Corona with your tacos, bring it with you. The tacos are really good. We had the spicy pork tacos and chorizo tacos. Both were great, but the chorizo tacos were some of the best ive ever had. Also, I recommend the Guac."], ["Doug P.", "The nachos are a clear 5 star -- it comes with chorizo and then asks what meat you want! Solid addition to the neighborhood and our go to for Mexican delivery."], ["Lou B.", "This is the best Mexican in the city!  I've tried them all & love their soups, lamb enchiladas, tacos, burritos.  Great spot for authentic Mexican (but it is small & they do get backed up from time to time-/but it's worth the wait from Grub Hub delivery."], ["Alison K.", "I have now been twice and it is officially at the top of my list. As a nacho enthusiast, i couldn't be happier with the campechanos because chorizo should be on everything. The specials look great but I'm also just happy with the tacos on the menu. The staff is friendly and nice and always accommodating. Have not tried delivery yet but will very soon."], ["Regina S.", "Oh my goodness!After reading all of the great reviews for this place I had to check it out myself, and boy am I glad that I did!I walk by this restaurant everyday on my way home from work, but it never looks like there is anyone in there. Let me tell you, everyone is missing out.It is a small place, but that is not so important. I went there today for lunch and I was the only customer in the place. No one was rushing me or hovering. I placed my order and it did take about twenty minutes to come out, which surprised me because, again, I was the only customer, but it was sooo worth it!!!I ordered the carnitas tostada, which is described on the menu as three tostadas with black beans, queso fresco, lettuce, avocado, sour cream and cheese. Delicious and so filling!! I could only eat two! They also bring you chips and a salsa (red or green) of your choice.The service was pretty awesome as well! I didn't want for anything at all. It only cost $10.80. Inexpensive and authentic, a rarity!!"], ["Andrew H.", "High quality food. No frills atmosphere. Had chorizo fried rice which was amazing. Also the guacamole was very good. And the tacos also good."], ["Hunter M.", "This place is simply the best. Fresh, legit Mexican food with excellent service, and you can bring your own great beer to accompany the whole situation. I went last Saturday and have to go back tonight."], ["Rita P.", "great Mexican food, especially for philly where that's somewhat difficult to come by. We had late hungover cure lunch here, and shrimp quesadilla (pictured above in all its glory) along with a poblano soup (reminiscent of sopa de tortilla just with extra veggie) did the trick. Unfortunately they don't serve coffee though and I guess since the space is tiny, the smells from the kitchen linger on your sweater for a while after."], ["Shelley R.", "I'm writing this review as I'm sat finishing my huge burrito from yesterday's lunch at Quetzally. This place is awesome! Seeing as I only work about four blocks away from here, we've been more than a dozen times, for lunch and dinner. Anything you'll order from Quetzally is going to be absolutely delicious. Super fresh and homemade. They don't cater so much to the overly cheesy, sour cream ladened idea that Americans have of Mexican food. Everything here seems very authentic and is dressed perfectly with just the right amount of cheese or avocado crema(beyond delicious). I usually have the grilled tilapia tacos($7) or tilapia burrito($9). The tacos, two per order, are very light and wrapped in delicious, light corn tortillas with a bit of crema on top. The burrito, the larger of the two is plenty big enough for two meals! It's drizzled with the avocado crema( mix of avocado and cream) and stuffed full of whatever meat or veg you choose and loads of beans, rice and cheese. The best thing I've had on the menu , so far, are definitely the tortas; fried corn tortillas topped with choice of meat and loads of lettuce and crema and a bit of cheese. There is even a bit of their marinated cactus salad in there. To die for! And it is HUGE, with three tortas per order.Also, get the guacamole. You will NOT regret it.Yesterday we had a taste of the horchada they've just added to the menu, and I so wish I could have taken a gallon home with me! It's a rice milk based drink, full of milk and cinnamony goodness! The guy that owns the place, (Jorge I think is his name) is so so nice. He says it's been his dream to own a little Mexican restaurant. He comes from Mexico City and the place is actually named after his daughter, Quetzally. He's a gem of a man.I really hope this place is in it for the long haul. The menu is constantly being updated with new, absolutely delicious items. Go for dinner and bring your own beer! And, the prices don't even go up for dinner time. What a bargain! Check it out, it's totally worth it. Probably see you there!"], ["Cuong D.", "This is one of my favorite restaurants around the area. I always order the nachos campechanos and it is amazing every time. The flavor is just amazing! The owner is also very nice and remembers me every time I go there. Great place and great food."], ["Monica Q.", "The food had potential to be pretty good but it had massive chunks of raw onion in our burritos which was too much and too spicy. We ordered chalupas and got Sopes. Won't be returning."], ["Brian M.", "Straightforward, sparse, and friendly.  Certainly nothing wrong with this place and if they get some initial business I can see it being a popular spot.I was jonesin' for some tacos after getting back from San Diego so gave this place a shot.  While no Tacos El Gordo what we got here certainly was nice, cheap, and simple.  Seasoned meats, fresh toppings, etc.As mentioned they are likely still decorating a bit in here to cover up from the past owners so I anticipate this improving over time.  The guy who served us, who I figure is the owner, was very nice so I hope this place does well.  Was dead the night we were there though, only saw one other person in the 40 minutes or so we sat there."], ["Stacy T.", "The steak enchiladas were wonderful. The churros were great too. Buttttt the Tres Leche was just terrible. It was basically birthday cake from ShopRite that they charged $6 a slice.  That was such a disappointment. It wasn't even a good birthday cake."], ["Jakub D.", "It is really good food that you would probably find in Mexico. Delicious nachos! Good homemade salsa and picante sauce."], ["Emily D.", "This was my second time ordering from Quetzally and each experience was incredibly delicious! The first time I ordered the veggie enchiladas which were a bit spicy but definitely not too intense. The second time I ordered the veggie tex mex tacos which came LOADED with guacamole. It was my dream come true! We also ordered a veggie burrito which had a ton of fresh, flavorful vegetables inside. Topped it off with some guacamole - it was the perfect dinner. This is definitely my newest go to place. Can't wait to try the churros!"], ["Jeniffer L.", "Amazing!!! I love mexican food and was in the mood for cheese and sour cream and found this little secret. I had the steak burrito. It was huge!! Simply amazing. EVen the chips and salsa were amazing! Def want to come back next time I visit philly."], ["Yla A.", "I am so happy we found this place!! Ever since I moved to Philly I have been searching for a Mexican spot. Yes distrito and xochilit are good but expensive. This is a delicious authentic neighborhood spot. The tilapia burrito was huge and filling. I made it 3/4 of the way before feeling stuffed. Guac and chips were legit too. We will def come back and try the other dishes."], ["Dan S.", "Got the guacamole (corn, onion, lime, rabanito, cilantro, jalapeño, EVO) and spicy chips, as well as the Antojito Special - 1 taco, 1 chalupa, 1 tosta da barbacoa - everything was delicious! Tried the brisket and shrimp versions of the same special and they were both tops too. Would come again and recommend."], ["Alex U.", "Truly fantastic and authentic Mexican food, the best I've found in walking distance to my office (1315 Walnut St.). It may seem like it's slightly off the beaten path, but it's just 2 blocks from South St and is worth the walk!"]], "Blue Corn": [], "Buena Onda": [["Gary G.", "So Ive been on a mission... a fish taco mission.  the objective: find the best fish taco in the city..and enjoy some damn good food along the way.  We recently hit up Buena Onda... and while not THE best, they're pretty damn good.  I have had the pork, mahi, shrimp, tuna, and one other fish taco special they were doing.. i have thoroughly enjoy all except the tuna.. just not for me.  The mahi are my favs, grilled of course, bc in my head i like to pretend thats healthy.  Check this place out.  Good food, good prices, and good vibes."], ["Kristen M.", "Really, this place deserves 4.5 stars. We came here for dinner around 6:45 on a Thursday. There was a line, but I was told that was the norm. So much the norm, that there is free beer offered to those waiting in said line. When we finally got to the counter, we placed our order then staked out our seats and waited for the grub. I had the chicken taco and the glazed shrimp taco. Both were really good. Dining Partner had the beef quesadilla which was THE BOMB and we split an order of guacamole and chips. Overall a very fresh meal in a very cool beachy-atmosphere. I'm knocking off a star for the long line, we waited about 15 minutes to place our order. I'd rather get my food faster and nix the dixie cup sized beer."], ["Brian M.", "I almost wanted to not like this place.  Do you really need to sanitize tacos, Garces?  The best tacos I've had were always slightly grimy, simple, and cheap.  Maybe from a truck or a dingy shack or a place where they had to send out the kid who speaks English to take your order.But Buena Onda did sanitize this experience...in a good way.  While the grime is absent the prices and simplicity remained.  $3 for a regular taco, $3.50 for seafood guys.  And they're really good.  Not great, but really good.  And they have cheap beers - all under $5.  Margaritas under $10.  Wines $7.  Friendly service.  A small, appropriately stocked bar.  Right next to a froyo place.  I mean...what's not to like?"], ["Brandon K.", "Buena Onda is a delicious, although a little pricey, treat to Philadelphia.  After eating here a half dozen times, I can say that the fish and shrimp are consistently fresh and cooked just right - tender, flakey fish and shrimp bursting with flavor and texture.  I've also grown fond of the pork quesadillas filled with rice and tons of ooey gooey cheese.  You made need a napkin to soak up some of the excess grease on the bottom so that you have a perfectly crispy shell to bite into.   And of course, that red sauce - put that stuff on everything!"], ["Jennifer R.", "Got to try Buena Onda for a work lunch and we had a fantastic time. A lot of us are decent foodies, and were carefully planning out our taco and drink selections. The place is very well designed and has a great lunch spot feel. I was surprised this place wasn't overpriced. I think their price point for the quality taco is spot on. Yes they're small but who wouldn't pay $3 per taco when they're this pretty and tasty?I got the shrimp, fried mahi, and carnitas tacos. Shrimp was absolutely my favorite. I think the fried ones fell short, so stick to that tasty glaze they have going. The pork one also had a lot of great flavors. They didn't skimp on the meat either. There is a high level of detail that goes into these from the tiny chopped chives on top to the thin cabbage or pickled radish that gives these tacos some style. We had guac and salsa to start and those needed a little work. Guac had pretty big chunks of everything. The kitchen staff also needs a little work in not staring at you and winking while you eat. Still think they have a wonderful ambiance and are taco-tastic so it didn't break the 5 star deal.They have a yards tap you can pour beer while waiting in line (yeah, you heard me, free beer) Margaritas seemed pricey but they were delicious and strong so it was worth it...like inappropriate to have at a work meeting strong."], ["Gina R.", "I made the mistake of trying to come during opening week, and I really don't think they was properly prepared with how to handle the crowds.  We were asked to wait outside without any real explanation (it looked like there was room to stand in line inside), so we stood there awkwardly with a few other groups until we were allowed inside.  I did not envy that hostess' job.Once inside, we were offered free samples of Yard's K38 Pale Ale brewed specially for Buena Onda.  Free beer is definitely a smart way to briefly distract the hungry masses.  After about 20 minutes, we made it to the counter.One especially strange thing happened when we tried to order the guac and chips that surprised and, somewhat, annoyed me.  We were told they were out of guac, but they then clarified that they were actually just out of chips.  Instead, they suggested that we order the nachos. WAIT... don't nachos involve chips? Yeah, that was my question.  I was told the chips for the guac and the chips for the nachos are stored in different parts of the kitchen, so I could still order nachos if I wanted. WAIT... can't you just grab some chips from the nacho station and put them with my order of guac?  No, they're stored in separate places for efficiency of the kitchen.After a bit of back and forth that really made NO SENSE at all on their part, we ended up ordering nachos and a side of guac.  Truthfully, I still don't get it...We also ordered the mahi mahi, shrimp, carne, carnitas, and pollo tacos.  Everything was really delicious, but the fish tacos were defintely better than the meat.  The mahi mahi was my favorite!I probably would have given a 3.5 for the awkward handling of the wait and the strange guac explanation, but I'll give them the benefit of the doubt during opening week.  Overall, I'm pleased to see that little strip on Callowhill coming along."], ["Larissa G.", "This fish taco joint is a super welcome addition to the Callowhill corridor! One perk of having an empire like Garces must be that you can open things quickly and have extra money to spend on decor. I feel like I just heard about this place, and the next thing I knew it was already open for business! The outside is beachy and welcoming, and the theme continues inside. It was busier than expected for a Sunday evening, but we were given free beer samples while we looked at the menu, so I have no complaints.I ended up with a fried Mahi Mahi taco (you can have the option of not-fried as well) and split an order of nachos. The taco was on point, and I'm not even a huge fish lover. Although, slather pickled veggies on anything and I won't complain... The nachos had a perfect amount of toppings too. They aren't piled high and are more spread in a single layer, but I would rather have that than a bunch of naked chips any day. For three tacos and nachos, it was $20, which was definitely fair. I will definitely be back with a bigger appetite to try the non-seafood tacos and the supposedly delicious prickly pear margarita."], ["H D.", "Spent a day in Philly and stumbled upon this place while leaving the $1 $2 $3 dollar book store around the corner. Got the Mahi Mahi fried taco and jumbo shrimp. Both so good! They have green/red sauce at each table, yummy. Beautiful outside seating. Tacos were $3 (pretty standard). All of this was great but I decided to write this review about the service!! Blown away at how accommodating and great the staff was. Overall an amazing experience and would definitely recommend. Which I got the nachos after seeing all of these amazing pictures. Will definitely come back and enjoy a drank"], ["Sara B.", "We stopped in here on a Wednesday night after hitting up the Art Museum. At first, I was apprehensive because there was quite a line BUT the free beer samples and streamlined system made the \"wait\" non-existent. The staff here is accommodating, friendly and  fast. They answered all of our questions and were very helpful.The food is amazing. We had the marlin mini tacos and the salsa & chips as appetizers and the frozen prickly pear margaritas. Delicious!! For the tacos we had the house special Mahi Mahi, the fish of the day (which was perch), a pollo and a carne. All four of them were incredible. The carne taco was one of the best tacos I've ever had, but all of them were amzing. Not a loser in the bunch.We will definitely be back to Buena Onda!"], ["Kieran M.", "BUENA ONDA is my go-to place. I absolutely love everything.. from the tacos to the quesadillas to the margaritas and the beer on tap. I love how fresh everything is when I walk in. I actually love it so much that I tell all my friends about it.I've probably gone and eaten here 4 times or so. However, I did order pickup last week and I was not as impressed this time around. I was told it would be 20 minutes for the food to be ready. I arrived 5 minutes early. I got back to my place (I live 5 minutes from B.O) and the tacos were cold and the quesadillas werent the same fantastic quesadillas I've gotten prior. They didnt have rice and other veggies that they had before and lacked chicken. I'll keep ordering for sure, maybe not pickup though.. I hope they didnt change what goes into the quesadillas because that would be a huge bummer for me. That was just one bad experience, the rest have been great."], ["Jourdan W.", "This is easily one of my new favorite taco places. The laid back, chill vibe of the resturaunt brings you to the beach even in the middle of the city and the menu has just enough delicious options even including beer, margharitas and wine.The prices are extremely reasonable, I got 3 tacos for about 10 dollars and a free cup for water (I actually used it for water too!). I chose the shrimp (glazed), Mahi Mahi (fried) and the Carne tacos. The glazed was much better then the fried option, which you can do either with the fish, and the Carne was so moist and deliciously seasoned!!! The sauce in the shrimp taco was hands down the best. It was my favorite taco, and I could probably down 3 of them alone. It took maybe 5 minutes for our food to be delivered to the table after we ordered and they had them in these handy taco holders to keep everything inside. If your in Fairmount area it a needed stop by location for lunch."], ["Jenn W.", "I'm a fan, Only thing let me down is the wait at register to order for little longer then anticipated, but the menu was great, We were at the Manayunk Arts & Crafts festival , so we were hungry & decided to get something , spotted this place & we went in.If it wasn't for the wait, probable be 5-stars..but Lets see how they are next time.!!!.We ordered 2 -Mahi Mahi & 2 Carnitas, Guacamole & chips..So YUMMY!!!! They are pretty decent variety & Loved the jicama& pickled cabbage on top for the acidity & texture!! The sauces at the tables were fabulous. Very well made , taste the smokiness from the pork & mahi-mahi was cooked to perfection!!! Go back!!Return factor:Yes, & btw ..liquor license, from beer to Margaritas. The place is small but its really good!!tDefinitely!!!"], ["Kelly K.", "The tacos were good - mahi mahi delicious (we got fried) and the fish special, swordfish taco was so good! Guac okay and I would skip on the kids tacos, cold cubes of chicken on a tortilla with a teaspoon of cheese - they did fix this but still super boring/bland kids item. Guess that works for some - other than that everything was great!"], ["Georgianna J.", "These are not your average Taco Bell, Moe's, Qdoba, and dare I say it Chipotle (sheesh I really love Chipotle) tacos. Took a suggestion from a respected fellow Yelper, Christian S., and tried this place. Well let's just say I only got 3 tacos and boy did I want more. I already knew what I wanted before I got there. Online menus serve a purpose people, if nothing else it helps you narrow down your choices and if you're like me, it pretty much helps you walk into a new place looking like a pro. Back to the matter at hand, I ordered 3 shrimp tacos, fish of the day was perch, no thank you. And Mahi Mahi, is a little too strong for my subtle fish palate. So 2 glazed shrimp tacos and 1 fried shrimp taco it was for me. Took it to go. First I definitely appreciate the care they place in their to go containers. They serve their tacos on these taco triangle thingamajigs in the restaurant which help the tacos to stand up. Well lo and behold they have a cardboard version of it for the take out tacos. Major points for that, they seriously take tacos serious... So I ordered my tacos and a drink and I waited. A girl at the bar who was eating told me to place my number in the holder. That's how they identify you. It was appreciated but probably not needed only because the restaurant wasn't busy and when the lady bought my tacos out she called me by name. But the hospitality was gracious. Got to my car cause I had somewhere to be, opened the box of tacos and one side of the cardboard taco holder had flattened and my fried shrimp taco was all over the place. No biggie I just put the taco together. First bite, the glazed tequila lime, or whatever shrimp taco. It was good, two nice sized juicy, sweet, perfectly cooked shrimp in the taco. I was in love. I had been searching for a great shrimp taco and I think I found it. I had one at El Camino a few weeks ago and it was abysmal, lacked flavor and totally disappointed my taste buds. Not this taco at Buena, was fabulous! The chipotle crema was really tasty and had a nice zing. Now I love hot sauce and was about to put some on mine but I'm glad I didn't because the crema provides just enough bite. Now onto the fried shrimp taco. Batter beware, really good breading and batter on these shrimp. Kind of tempura style so the shrimp aren't buried in the breading. It was a smidge salty but I am really averse to any salt at this point in my life so don't take that as a cautionary measure from me. I forgot to mention that they have Boylan's soda on fountain tap. Umm yesss because this is my favorite soda ever, well that and Frank's and Dr. Browns, but these sodas are so yummy it was nice to see it somewhere as a fountain drink as opposed to the big box soda dealers...My side notes and suggestions: They should increase the size of the soda cup. It's small for the $3 they charge, even if it's Boylan's. If you're hungry order more than 3. If it's your first time order 3, then order more if you like them because you will be hungry. I forgot to order the corn with mine so that may have helped stave off my lingering hunger after I ate my tacos. Finally, they have a rewards program. Really nice to have for a non chain establishment. Finally, I expected these tacos to be good. I mean come on, it's from Jose Garces who had like the best taco truck, Guapos Tacos, in the city for a while. Plus pretty much everything he, Stephen Starr, and Michael Solomonov seem to touch or open in this city you can pretty much guarantee a good meal. Went on a Wednesday night and it wasn't crowded. Municipal parking lot right across from the restaurant if you struggle finding street parking.Very good uptake on fast, casual dining."], ["Gary L.", "We come here at least 3 times per week for tacos and guac. Delicious mahi, shrimp, pork, and beef. The managers are super friendly and accomodating. This place is very consistent and tasty."], ["Wellington C.", "Mis tacos preferidos en Philadelphia. The grilled shrimp and carne are the best. Great friendly staff. And they have all you can eat soft serve ice cream!!!!!"], ["Mary Z.", "I live close by and wish it was better but really just a step above fast food.The tacos are small and quesadilla's are good but this is not a destination restaurant."], ["Sarah A.", "Buena Onda delivered to my expectations! Great tacos, especially the fried Atlantic Mahi Mahi (add a hit of hot sauce!) and Carnitas (adore Garces's pineapple and jícama slaw) and nachos (baked to the point at which some of the chips were very brown/crisped and the cheese crunchy, which some dinner mates adored). Loved the casual ambience and, as many have said, the free beer while in line made the wait bearable. Will definitely return when the craving for tacos hits!"], ["Matt G.", "Not bad, clean, restaurant. Food wasn't as great for me as some of these other reviews suggest. Quite expensive when all said and done...two people was $50 for us...salad was solid and tacos just OK. Will not go back but good to know in an emergency"], ["Tricia P.", "Upon hearing that Jose Garces had a new restaurant in Philly, my friend and I immediately added this to our food list. Buena Onda had a great beachy vibe, which felt like an escape from (at that time) the cold Philly weather. Buena Onda is definitely fast-casual, unlike the other Jose Garces restaurants. The servings were very generous here, which my friend and i definitely appreciated. Everything was also quite reasonably priced. When we went, my friend and i ordered the Nachos, Veggie Quesadilla, Jumbo Pacific Shrimp Tacos and the Esquites. Everything was delicious but for me, the winner of the night was the last one. The corn was extremely tasty, creamy with just a hint of spice. The nachos were extremely cheesy and tasty, but to me, it wouldn't be what I'd consider the best nachos ever. All-in-all, I didn't think the restaurant was life-changing though it is a solid option for fast-casual Mexican food."]], "Nora's Taqueria and Grill": [], "El Vez": [], "Distrito": [["Sara M.", "Came here for dinner on Saturday night and it did not disappoint. Great staff, great margaritas, really awesome atmosphere overall. The way the place is decorated is authentic yet classy. I'm only giving it 4/5 stars because the food is really good and well priced but it didn't floor me in its goodness. I had carnitas (pork tacos) which were so good! The Guac was great as well. Others at our table had chicken tacos, queso fundido, and nachos. No one was disappointed with their meal. It is tapas style so the servings are smaller but it was perfect for us. We also ordered margaritas by the pitcher which were strong but not overpowering. Distrito is also very reasonably priced. There were 8 of us, we ordered four margarita pitchers and the price was less than $40/person. I would definitely recommend this place!"], ["Karina R.", "I don't understand what the hype is about? My friend and I arrive around 8pm on Sat and the girl at the front desk quickly told us that there was no availability on second level and we can only eat at their taqueria. We were seated promptly and our server was attentive. I went back and asked what the wait time was to be seated on the second level (not offered initially) and the girl stated about an hour, so I put my name down. Chips were cold, guacamole and salsa were bland, and my taco was dry. I did get the pozole and it was VERY GOOD. My friend got the carnitas tacos and stated they were good. The veggie quesadilla was pretty tasty as well. About an hour and 15 min later and my name was never called. Front desk service needs work. The girls did their best to do the bare minimum with guests. Maybe because I'm Mexican and have high standards for \"Mexican\"  food, I was disappointed. The decor is nice and the food was maybe a 6 at best. Service always brings restaurants down."], ["Eva W.", "They've changed the layout since the last time I was here! Snag a seat in the two-top car in the back if that's your cup of tea.Came here for lunch with a professor and got the choose 2 for $15 lunch special. Started off with chips and guac/salsa. The chips were light and crispy, and the salsa had a nice spicy kick. The chilango chop salad was meh, and there were too many tortilla strips! I was picking them out by the end. The tacos were decent, though the tortillas were sad and kind of limp. The al pastor taco was the good - the pork was flavorful. The mahi mahi taco was disappointing - it was overcooked and rather dry.The music is a bit loud downstairs, and it can be hard to hear at times."], ["Casey S.", "Nice atmosphere and decor but I don't really see what all the hype is. Ordered the guacamole which was a small bland portion with almost no flavor. It was covered with equally flavorless cheese. Chips were crisp and well salted though. Prices were way too high considering the portion sizes. I got the chicken enchilada which was literally one enchilada. It had good flavor and I loved the sauce. My boyfriend got the tacos suerdo with beef which he loved but he remarked \"is this the starter portion?\"  Service overall was good. Food was yummy but definitely not worth the price. Neither of us left full or satisfied but refused to order a second entree! I decided just to snack on the complimentary spicy peanuts even though they didn't do much for me either. Drinks were overpriced and watered down - tried roja sangria and the house margarita. Won't return."], ["Mimi L.", "I love food when it comes down to it. I work hard and like to eat well. My friend recommended this place. Mexican inspired fusions food. I was so excited to try it. Even went ahead and picked a few menu items before I got home from work.We had a late reservation on a Saturday night. As we got there it was not packed. We were seated right away. The ambience is retro with touches of Mexican wrestlers mask. Cool. We were taken up some steps and into the main dinning room. Very cool decor.As we were seat our server came and introduced herself. I didn't hear her name. She took our drink order. And then our food order after. Here's our break down.3 Frida Kahlo $552 Jefe Margrhitas $151 Roja Sangria $8Totaled $203Not a problem. I never send food back or complain. But let me break down, down what we received.Salsa Mexicana $7Guacamole $10 (crab meat was thrown in)Chilango Chop $12 (very small portion)Ceviche De Atun $14 (6 tiny slice of tuna)3 Taco De Carnitas 3.5 ea. (Pulled pork, black bean spread, pineapple salsa - super dried with no flavor)Platano Y Crema $4Huarache De Hongos $12 (Flat bread with mushroom and black truffles)Esquites $5 (served smaller then the actual large cup)Entomatado De Pollo $17Refried Beans $3Small citrus salad (not on the menu)Pulp Al Carbon $15Churros $72 Jefe Margrhitas $151 Roja Sangria $8Grand Total $161.50All of this on the regular menu would have costed us just $161.50 so that small salad that was not on the menu would have costed us $41.50 that only was 1 serving size.I would not recommend the Frida Kahlo because this tasting did not elevate my experience of Mexican inspired dishes. Some dishes were tasty and others were rather blah. All the dishes were really serving size for 1 or 2 people. It rather elevated our pockets of $218 and some change. We tipped $45 to the server for her services.After this meal, my friend mentioned to Caitlin (our server), who brought the manager over. She took off our drinks. Which brought our bill down to $178 and some change. Changed our dessert to the Torte de Queso (coffee cheese cake). It was a nice gesture but did not fulfill our dinner disappointment. Was still hungry after I left. Food is my thing and I don't discriminate. This had to be one of those moments where I would rethink my food options of a famous eatery vs a local fav. I am picking local vs chains. Jose Garcias chains is a no go for me in the future.  Money is not an issue when it comes to food."], ["Christian C.", "3.5 starsCame here from Cali with a bunch of people from Cali (I know, recipe for disaster), but was overall pleased with everything.Margaritas 4/5 - very, very good.  Ordered the house margaritas.  Nothing super special but, I love margaritas, so they fulfilled my need for cocktails.Pulpo 4/5 - octopus was well cooked.  Sauces were good but not transcendent.  Overall, it felt a tad one note to me.....but still good.Kobe tacos 5/5 - this was definitely thinking outside the box.  The beef were perfect.  The little teeny tiny truffle fries on top were excellent.  Some at the table thought that the truffle was overwhelming, but I thought it was totally delicious and perfectly complimentary to the beef.Huarache de camaron 3/5 - ok, let me just say, this was NOT a huarache!  This was more of a flat bread that was mexican-inspired.  The flavors were good, but everything just kind of melded together was not very distinct.  There were no succulent pieces of shrimp to bite into.....I was a little disappointed by that.Service 4/5 - perfectly good, but nothing to write home aboutatmosphere 5/5 - loved the decor as well all the giant oversized booth-chairs.  The lucha libre masks were awesome.  It was fun and hip.Overall, another successful Garces dining adventure.  I get why this place is popular especially considering it is a city on the east coast.  Here in the bay area, it wouldn't be at the top of the heap, but it could definitely compete."], ["Cristin S.", "It's no secret that I'm one of Distrito's biggest fans, but I recently visited with my friends shortly after they opened their \"Taqueria\" section (they remodeled the bar area downstairs), and felt compelled to write again.First of all - YAY!  The downstairs looks great!!  I love that it's seat-yourself, and service was prompt.Second of all - not that I ever thought they would, but the quality of the food and drinks have not suffered due to the remodel.  YAY!  Strong margaritas, new cocktails, and - wait - what is this - my favorite nachos - Nachos Iglesias - on what looked like a friggin deep-dish pizza pan or garbage can lid?!  Like you could NOT have made this girl any happier.  You just took one of my favoritest dishes ever and made it BIGGER.  Like this is reason enough for me to skip dinner upstairs and eat only at the taqueria.  :)  JK JK JK I will be back for dinner soon I promise, my daughter has been asking if we can \"go back to the pink place\".Only complaint - very small - is that just be forewarned that the taqueria menu is limited and not as extensive as the dinner menu.  This is fine with me because they still have my favorite nachos :) but my friend was disappointed that she couldn't get the full restaurant menu.  She changed her mind quickly after biting into her burrito though, which she said was amazing.We went around 3pm on a Saturday and there was no wait at all.  That's nice if you want your Distrito fix and it's the middle of the afternoon.  I'm not sure what it's like later in the day or evening though.  I'd still go for a reservation at that time.Also PS please bring back arroz con crema??  Pretty please?  Please."], ["Tyneisha M.", "I made reservations here on 6-19-15 for lunch with a gf. It was our first time and we really enjoyed the décor and our meals. They were very bright and refreshing !  Our server was very helpful when explaining the lunch special they typically run which includes two courses and a soft drink for $15. It was such a steal! For my first course I ordered Nachos Ignacio, (black beans, tomato, queso mixto, jalapeno) The portion was huge ! For my second course I ordered queso fundido duck barbacoa, poblano rajas, queso mixto. It was tasty but I was a bit overwhelmed by the queso. It was literally a bowl of melted queso with very little duck and accompanied by warm mini tortillas. Overall I do recommend this place and I'd definitely come here again. Just watch out for the queso!"], ["Ramon F.", "Mr. Garces,I brought a couple of friends with me tonight. I told them that my first experience here was amazing! We were all disappointed when we left and I felt a little embarrassed. We all ordered the Frida Khalo. The description says, \"elevate your experience with a selection of inspired Mexican plates & original off-menu, interpretations crafted by our Chef.\" But everything we experienced was straight from the menu, almost all appetizers, with only 1 actual entrée, the chicken. There were 3 of us and we had to share 1 small chicken entrée? Where's the beef, duck or lamb? We were given crab guacamole, pico de gallo, tuna app (not the yellow fin), a small frisee salad, mushroom flat bread, octopus app, a cup of corn with mayo and lime, a cup of refried beans, fried plantain with black bean mousse, pork tacos (3) and the 1 chicken entrée in a container not much bigger than a cup. I understand the concept of tapas and of sharing, but there wasn't enough to share. This was a meal for 2, but we ordered for 3! I was going to let it go, but then the dessert came out. Can you guess what that was? If you guessed Churros, then you are right! So I ask you, where was the creativity? Where was the rest of my food? I let the server know that I was underwhelmed by the chefs selections, especially the dessert. She brought out a much nicer dessert, a cheese cake with a nice ice cream and some kind of flaky pie crust on the side. That was the best part of the meal, but she only brought 1, so we each took a bite and asked for a check. Just as we were about to pay the check, the manager came over, explained that selections change daily and took the drinks off the check. I thanked her for her concern, I thanked the server for her good service and we left. I'll get to my point. I didn't want to complain, I didn't want a discount, I just wanted the creative menu promised! And I wanted enough to feed 3, not 2 or 1 dessert. Churros? Really? Creative? You're better than this José. I'll have to stick to your other places..."], ["Krystal H.", "3rd time not a charm. My boyfriend hadn't been and the other two times I went were just meh. I kept hearing good things, I'm generally a fan of Garces and we wanted Mexican so I suggested it. I wish I had not. I made a reservation and we showed up early for our reservation, she said we couldn't be seated yet. No sweat, we left & came back a bit later. When we got back she said, \"I can seat you in 4 minutes\". There was not a single other customer there. So we stood there and waited 4 minutes. Right before the 4 minute mark was up, a family of 4 came in and were seated right away. What's the point of making a reservation if we can't be seated 1 minute early on the slowest day of all time but anyone can walk in and be seated right away? While we were waiting for our 1 minute to pass we got to listen to one of the male servers discuss \"butt selfies\" and talk about how \"they're all the rage\". mmmm, appetizing. We're finally seated and someone comes over immediately. He asks if we know what tapas are. We say yes. He then explains tapas, and the ENTIRE MENU in great detail. Why ask us? He then asks us if we know what ceviche is. We again said yes, and luckily didn't get a definition. I'm all for a helpful server, but not only did I mention that I had been there before, it really doesn't serve you well to treat your customers like they're stupid. Other than that, he was great. Additionally we had lots of different people bringing out our food/clearing our plates/refilling our water; all were friendly. I asked about happy hour and was told there was not a happy hour. We were there within their advertized happy hour time frame but learned that you can't order off of the \"real food\" menu and also get happy hour specials, despite being there at the correct time. If you want happy hour items you have to sit in the bar area and eat from a limited menu. Pretty dumb.I ordered the mahi tacos and a watermelon margarita. Tequila is my favorite spirit but whatever they added to it didn't do it any favors. I didn't like the cocktail at all. The mahi tacos were good, but not only did he not mention that they were fried, neither did the menu. Authentic Mexican fish tacos are generally not fried and so I didn't think to ask, but I wish I had; I'd have gotten something else. Also the torillas were like tiny micro tortillas. They were smaller than the tortillas on other tacos we ordered and I couldn't close them around the food so it fell out all over and got on my hands. The yellowfin ceviche was good but totally NOT worth $14. The salad was meh. The carnitas tacos were good but nothing to write home about. We did enjoy the guac, though. We love the design but were really not impressed with the meal. I don't think either of us will return; we both had wished we had just gone to chipotle or El Rey instead, and saved $50."], ["Kathleen D.", "What a great happy hour spot!I really enjoyed my two chicken tacos and margarita here. And so cheap! Did the bill even break $10? I can't remember. Nonetheless, Distrito was a super affordable yet delicious, classy option for a quick bite and drink. This place was great and I can't believe it took me so darn long try it out.Oh! Also tried some of Ashley S.'s chips and guac and they were really good, too!Plus, the servers working the bar area were so friendly. The whole experience made me want to head back sometime soon for dinner."], ["Bryan F.", "Distrito was an amazing dinner experience! I highly recommend and would return as soon as I can.Came here on a Friday with my wife and another couple. Had a very comfortable \"booth\" in the back. We were seated promptly at our rez time. Our server was affable, knowledgeable and flexible. The ambiance was comfortable and temp was just right (a little on the cool side, which is preferred).The 4 of us enjoyed the chef's tasting menu and it did not disappoint...had a sampling of: guac, chips, spring rolls, pork, chicken, crab, corn souffle...We also sampled 3 different tequilas and the signature margarita throughout the meal - Deelish!Loved the luchador mask wall going up the stairs - very cool! Also had a M. Night Shayamalan sighting! Was a fun night.Not cheap though - ran about $100 a person all in."], ["Grace L.", "I'm probably only going to come here for happy hour from now on, so I'm going to rate the happy hour. I can't really remember my experiences from when I came for a normal dinner. I come here often for \"taco tuesdays\", but realized that they have the same exact deal every weekday from 5-7 PM...so I'm probably going to go whenever I can on other days from now on! I absolutely love their frozen margarita (for $5)--they're perfectly tart, cold, and alcoholic for such a low price! I've tried their happy hour wines and normal margarita too, and didn't enjoy them as much, so that might just be me. Distrito's chips are the best I've ever tasted; perfectly crispy and salted, the $2 salsa complements them perfectly and the bowl they give you seems unlimited! I also love the chicken tacos and fish tacos (maybe 2 for $5 is a bit pricey, but they're definitely a tiny bite of culinary goodness!). Steer away from the carnitas tacos though, as the grease drips through the tortillas. Finally, I love the bartenders here, especially on a not-so-busy weekday; super smiley and helpful in ordering even when I have no idea what to get, they definitely make my happy hour experience enjoyable and not awkward even in an empty restaurant."], ["Michael N.", "Solid Mexican food in West Philly where food options are fairly mediocre.  While this isn't the most authentic, this is a Garces restaurant so you can expect quality... at a price.  The room has a cool layout and it has a younger crowd which is always fun.  Being on the fringe of the university, parking can be a little tough at peak times, but if you're adventurous you shouldn't have an issue a few blocks west or north."], ["John D.", "Food is great but boy is it expensive. I know you are supposed to order several small plates but shouldn't the prices be a little smaller to per plate since they are so small. Other than that the food was on point. Every bite was so packed with flavor. We got the Queso Fundito which is duck barbaca which is just mouthwatering. We also got the grilled octopus which was just to die for. They recommended we each get two to three dishes but that would have been quite a expensive meal since the plates are about 15 bucks each so to order 6 would be 90 with no drinks or anything."], ["Marthy S.", "Review on drinks and bar service only.Uber slow.  Started writing this review while waiting for service. Finally got some attention, asked for a menu.  Bartender #1 hands me the happy hour/limited bar menu and walks away.  Wish she could've at least acknowledged that they don't serve the full menu at the bar.Bartender #2 asks me if I've decided on a drink.  I asked her if there's a drink menu.  She hands me a full food/drink menu and this is where they tell me they don't serve the full menu at the bar.  Fine.The bar layout is flawed.  If you end up on the other (right) side of the column further from the entrance and closest to the wall, you get ignored because there's no way for the bartenders to see you or vice versa.Went with the El Grande Diablo cocktail on the rocks.  Love the kick from  chile infused tequila.  Wasn't too sweet (and I don't like sweet drinks).   The one thing that grossed me out was that I went to take a sip from the glass and there was a strand of hair on the side of it.  Thankfully it wasn't IN the glass at all so I just sipped quickly from the stir straws.Had a beer (3$ Negra Modelo on tap) before deciding to relocate.  Would've stayed for some guacamole or the Churros, but wasn't feeling the vibe.Reading the positive reviews and due to proximity, I'm willing to come here again for a sit down dinner experience and will edit my review accordingly.  Since I was by myself this time, I chatted with a couple next to me who recommended the pulled pork or fish tacos (fried mahi mahi), and not the chicken tacos.  Noted.Tequila is pricey if you're looking to upgrade the happy hour special $4 Margarita.  You end up paying for whatever the tequila you want costs (shot of patron silver is 11$) plus the 4$ for the 'rita."], ["JOrdan S.", "Food was okay. Service was terrible. This restaurant used to be good, but has seriously gone down hill. No pre bussing, rude unknowledgeable server. No drinks after the first. No desert choice as our check was literally thrown at my mother in law. This experience made me question if I ever want to eat at a Garces restaurant again."], ["Alesandra L.", "My fiance and I are obsessed with this place.  We started our evening off downstairs in their Taqueria with a Cucumber Marg.  It was to die for!  Our reservation was for upstairs.   The server was very attentive as well as the other staff.  I have a gluten allergy but the server was super knowledgeable and gave us plenty of GF options.  Everything from the food to drinks were great. Can't go wrong with the El Jefe. We can't wait to go back. :) :)"], ["Lindsey G.", "Came in for lunch on the day before Thanksgiving.  Food and service were great! Get the al pastor burrito yum."], ["Tiffany T.", "Happy hour review: Monday thru Friday from 5 to 7 pm bar area onlyDuring these times you can snag 2 for $5 tacos (chicken, fish, or carnitas) , $5 Sangria/ Wine/ Margaritas $4 Dos Equis Amber and $3 Modelo or Tecante cans , $2 chips and salsa and $5 for guacamoleKeep in mind the $5 guacamole is a \"happy hour\" size, so if you have come for dinner before don't expec that portion, it's much smallerBartender was good -- let us know when a spot open up (it was two of us hovering over 1 seat during HH), came over to check on how we were doing on drinks and food at appropriate times and everything was timely and professional.The quality of drinks and food are no different during happy hour. The margaritas were just as strong as I remember, so it's good that they don't skimp during happy hour.. not that I'd expect that from a fine iron chef establishment (but unfortunately I've been to other places that have had different experiences during dinner vs happy hour!) Solid happy hour joint in University CityPS don't forget they have $2 tacos on Tuesday.. to save you that 50 cents haha"]], "Lolita": []}