{"Don Quixote Tapas & Things": [["Jamie S.", "I just don't think this place is going to make it. With no marketing, the BYO policy, free sangria, giant plates of prosciutto at an insanely cheap price during an extended happy hour- this is a consumers dream but there is no place to make money!  Fried calamari and lamb empanadas were nice. Meatballs were just ok. Was hesitant to try the paella, so I just stuck with tapas."], ["Elaine M.", "I was excited when I saw that a new tapas restaurant had opened a few blocks away from my apartment!  Unfortunately that excitement came to a screeching halt when my friends and I went there for dinner a few weekends ago.We called them around 6:30 PM to see how long the wait was and we asked if we could put our name in to get there around 8.  They said we should probably come closer to 9 because they were really busy.  We obliged and had some drinks at home before heading over with our two bottles of wine in tow (they are BYOB).  When we walked into the small restaurant the staff looked surprised to see us.  There were a few two-tops finishing up and one larger party sitting near the back of the restaurant.  We waited a few minutes and then they tried to seat us at the first table by the front door.  The table was a window bench seat on one side and two chairs on the other side.  It was a cold night, so we were not too keen on sitting in a glass box next to the door.  We asked if we could have one of the booths further back, and the server said yes, if we could wait while they cleaned it off from the last party.  We happily obliged, and finally sat down.We were given our menus and served water but had to wait about 20 minutes for our server to return with our wine glasses and open our wine!  It seemed that she was the only server working, so it took about a half hour before we placed our order.  We asked her some questions about the menu but she gave us some pretty vague answers and suggestions.  By this point, some of the other tables were gone, so I am not sure why they were acting so flustered.Since it was late, we decided to go light and share a bunch of tapas.  The tapas came out a few at a time, which was good, except near the end of our meal the server had to come back and ask us which things we had not received yet... The hummus and calamari were fine, nothing bad but nothing special.  Berenjana Ahumada (smoked eggplant) was my least favorite, it was entirely too smokey.  Albondigas (Spanish meat balls) was the one thing that our server recommended; I would give that 3-4 stars.  The Paella Valenciana was actually my favorite, and the only thing I would consider ordering again though it was rather expensive for the tapas portion size.By the time we finished eating, we were the only people left in the restaurant but we still had to wait for the check and then she was confused by how we asked to pay (2 credit cards and some cash).There are a lot of restaurants in Queen Village and on South Street; I don't see this place lasting very long unless they make some serious improvements.  I don't intend on returning any time soon."], ["Robert K.", "Horrible.  The menu advertises manchego cheese and Iberian ham.  They brought us cubed cheddar and ham that was clearly store-bought, then told us they were \"out of manchego.\"  They insisted that low-quality cubed cheddar was a Spanish cheese, even though it clearly was cheddar.  Usually when I order something from a menu, I expect to be told if I am being served something else.  The chicken was decent, but served over what seemed like microwaved boxed rice.  The calamari was mediocre at best. The food was edible, but we did not appreciate false advertising on the menu and having the staff lie about what they served us."], ["Nina S.", "Decent food, terrible service, reasonable prices. Overall they need to improve! Sorry but simple things will make it a much more enjoyable experience. On a Saturday night it took 2 hours for 4 people to have dinner (well, tapas). Wayyy too long considering we got there at 9p.m. We originally wanted to go at 8 but when we called earlier in the evening they said 9 p.m would be a better time to get a table for four. Well.... it appeared they were surprised to see us when we arrived.  The tapas are small and good for sharing but only a few of them had a lot of flavor. The chicken and rice dish and meatballs were my favorite. ( I do not recommend the shrimp, calamari, or cold eggplant tapas) I had a very awkward dinner experience with a few friends. I like to go to BYOBs so that you can drink what you'd like without having to wait at the bar for a drink. Well, it took us well over  20 minutes to get served glasses for our wine and glasses of water. There was only one waiter at first than someone else was chipping in later on who appeared to be one of the owners. I was even about to get my own glass of water but I couldn't even see a pitcher of water so I just continued to wait. I then ordered the $18 Paella to go for my roommate. It was a very small portion and so not worth it."], ["Gary C.", "Excellent food and great service. Everything is delicious and service was great! Very friendly and attentive."], ["Bonnie F.", "I thought the poor reviews  I just read on this site  were inaccurate or at least not what we experienced tonight.  We went there for the first time and were pleasantly surprised.  #1 loved the atmosphere- good acoustics and felt very relaxed  #2 great music(ok part of the atmosphere) at perfect volume in the background  #3 food was very good, interesting, fun and filling.  They even offer  a free glass of homemade sangria  #4  service was excellent with a very upbeat waitress.  A great new  restaurant that we very much hope succeeds and becomes a gem to others."], ["Gregg S.", "Very sub-par....food & service!! Honestly looked like something I could make at home."], ["Angela W.", "Cannot beat the price! I went here for a birthday dinner and it was amazing! The server was very nice and accommodating. I went to Spain years ago and take every chance I can at getting a Spanish meal! Everything was delicious, and we paid a fraction of the price of Amada (one of my favorites). Even my non-adventurous in-laws enjoyed the food. The only thing is I wish the flavored were a little more bold.As a note this is a BYOB (also helps keep the price down). My suggestion is get the Sampler - it's enough to feed 2 and you get a good taste of things. We had 5 people and we ordered 3 tapas and 1 sampler and we were full (just to give you an idea). I will definitely be back!"], ["Rebecca J.", "The prices were good - we got two tapas and a main dish for $30 - please be aware that the portions are not huge; there are about 4 pieces of fried cod per order.  But not bad considering it was $9.  Server forgot to send over free sangria (which was okay, did not expect that coming in) but the food arrived promptly and was nice and hot."], ["Bob Q.", "Great little BYOB tapas place just off of South Street. Our server was very friendly and attentive throughout the meal. The food came out relatively quickly and was a decent portion size, for tapas. Our party of five tried the paella, albondigas, Sabor de España and a few other dishes - all excellent choices. Their churros were a great way to finish off the meal. They even included a small glass of complimentary sangria for everyone. Overall, it was a great experience - we'll be back!"], ["Yen T.", "From the sabor board to the octopus/white bean salad to The Gambas al aijillo almost everything was great and tasty. The staff was very friendly and eager to please. The calimari was the one dish which wasn't as great as the others--not as crispy as I'd like and no tentacles! Otherwise we enjoyed it here and will be back to try the paella!"], ["Hans P.", "Delicious cuisine! My sister and I visited this place on $4 tapas night and ordered the calamari, empanadas, chicken, and garlic shrimp with a cheese plate for dessert. The staff was amicable and the environment was warmly lit, vibrant yet relaxed. Would definitely recommend this place."], ["Brett C.", "Excellent prices and delicious food.  Quaint atmosphere and attentive staff.  This is a great place to pop in off of South St on any night of the week (except Mondays).  Free sangria is an unexpected delight.  Can't go wrong here.  Tell your friends!"]], "The Farm and Fisherman": [["Giselle W.", "I'm not gonna lie, I was expecting this place to be so much better than it was.  Saw so many reviews of the beet steak and while it was ok, would have been much better if it was served cold instead of hot.  The pork ragu gnocchi was delicious but that was the only thing I really liked. The trout skin was insanely salty but if you ate it without the skin there was no flavor at all.  The venison was good but I wouldn't go back to this place. Was just disappointed."], ["Lon M.", "Been through 3 menu changes and have loved everything ive orders. Good deal for the ammount of food youre served, paired with the excellent front of house staff truely creates a wonderful experience. Been 10+ times and always excited to return. Nothing beats the quiet rustic feel of the dining room."], ["Vinny P.", "This meal was positively lovely.We arrived on a Friday evening a bit early for our reservation.  The table wasn't ready yet so we sat outside on their small bench and the server who greeted us brought us some water.Finally at our seat we perused the menu and settled on the heirloom tomato salad (feta on the side) and the bloody beet steak (yogurt on the side)  Both dishes were as excellent to taste as they were to look at. If there is something they know here, it's wow factor with food.  They have great presentation.  The beets were perfectly cooked and I love the play on meat even though it didn't contain any.  Each dish stood on its own and was rich but not overpowering.For my entree, I went with the short ribs.  I expected tender short ribs but I was blown away by the sauce and the sides.  This dish was a symphony of flavor and even though I don't eat much meat these days, this dish was easily up there with some of the best I've had.Service was excellent and they kept both our water and our beer glasses full (we split a bottle of Pumking)  This restaurant was an excellent way to begin my labor day weekend and my plan now is to come back for the squid ink pasta.F & F, you've got a new fan."], ["David D.", "Lovely meal at a quaint restaurant, but I can't give this restaurant a full 5 stars.First off, the menu is a little limited, but that's because you're really leaving it up to the chef and whatever ingredients are freshest.  That's the concept, and the chef is very talented.The space itself is a little small, so you can hear other people's conversations quite readily which became awkward for me near the beginning of our meal.I harmlessly asked if I could do another vegetable instead of potatoes with my striped bass, this confused my waiter (the look on his face was priceless), but then he went back to the kitchen asked about it, and I could hear everything they were saying.  This literally took about 8-10 minutes, and I was like I don't care.  They said not a problem, but then when I received my dish it had the potatoes anyway.  If I were an internet dude I'd use the SMH acronym here.  I just did.I don't want the newbie waiter's service to take away from the food, since that was outstanding.Here's what we did:Wine -- BYOB!Bread (3/5) -- I'm not a big bread guy, but this was more like a muffin and lacked sophistication.Leek Soup (4/5) -- Very good for a rainy evening.  A touch buttery, but not in a bad way.  There was a pea shoot garnish which I asked about to make conversation with the waiter; this turned into another \"everyone-in-the-restaurant-hears\" debate between the servers and the chef.  It was very good nonethelessKampachi (5/5) -- Easily the highlight for me.  It's seared (grilled?) on one side and raw on the other.  Sashimi-grade quality, and a good portion with just the right amount of sweet garnish with the dishStriped Bass (4/5) -- These guys know how to cook a fish.  Tender on the inside, just a touch of crispness on the outside.  Served with purple cauliflower, regular cauliflower, and...potatoes!  Light on the sauce, so I did not feel like a blob after eating.  A goodish 7-ounce portion of fish, I'd guesstimateI passed on dessert and did a coffee, which happened to be very good since they brewed it up fresh.Crowd seemed local and very pleasant.  The restaurant veered from warm to a touch chilly, so I'm not sure if they were having some heating issues.i'd definitely go again, but not banging down doors to get there.  Gut feeling is that this would be 5 stars with a more experienced waiter and during the warmer, summer months when the fruit of the earth is in full bloom."], ["Vivian T.", "I came here with my beloved friends and colleagues at work for a work dinner and it was truly wonderful.  The setting was small and intimate with only 30 tables. Our table was nicely set and reserved for 6.  The 3 courses were impeccably paired with wine by one of my attendings (have to LOVE the BYOB option). We were started off with warm, fresh popovers.  It was hard to resist these  tasty, glutinous, soft buttery rolls and I could not help but eat more than one.  I loved my first course- the Bloody Beet Steak. The delicious tart \"meaty\" beets were perfectly marinated with beet drippings and creamy velvety yogurt. My second course was shared with someone and I got to taste the sturgeon as well as the creamy lamb ragu paired with Hand Made Fettuccine.  Who doesn't love fresh pasta?  My main course was the Great Lakes Walleye fish and it was cooked perfectly.  I thoroughly enjoyed the seared crispy skin on top.  The creamed lettuce, peekytoe crab, asparagus whole grain mustard really complemented well with the delicate, flaky fish and not overpowering the subtle flavors.  This restaurant constantly changes their menu and I can see that they make a point to use farm fresh/ in-season ingredients like fiddleheads and ramps.  The dessert provided a great sweet ending and we all really enjoyed the ricotta doughnuts!   The service was superb. Our server was attentive and had a good sense of humor.  We had a great time and I really have to give the company I was with 10 stars!!  I guess we were having WAY too much fun with talking/laughing since we were harshly admonished at the end of our meal by a much older white haired gentleman saying that we ruined his meal with our decibel level.  We did not know that our small 6 people party could be so loud, but then again we were also surrounded by a geriatric crowd this particular Wednesday night. All in all, we all enjoyed ourselves!  The food, the service, the company were all wonderful! Would definitely recommend this for a special date night, or any special occasion."], ["Sal W.", "Pros:Food was excellentWaiter handled getting his balls busted by dining mate quite wellService was goodThe Mackarel was unique. It has a charred top, with a raw underside. Cons:Sat under a heating vent which was very uncomfortable. Switched with my GF who \"loves heat\" and she started complaining about the heat. Very expensive, expect to spend $60 a head with zero alcohol since this is a BYOBVery cramped, you are right up on other people's tables (there appears to be like 10 tables total in this small space)The coats were taken through the kitchen and touched surfaces in there.The scallop dish contains ONE scallop. Christ, at least throw in two to make it outnumber the other fillers on the plate. Should instead rename it to a \"Sweet potato bar with a scallop\"The portion sizes were slightly larger than other restaurants of this price range, but really, you aren't going to leave stuffed. Food Quality/Taste = 5 StarsPortion Size Given Price = 3 StarsPrice = 2 StarsExperience with Staff = 4 StarsDecor = 2 Star"], ["Marie W.", "My family brought me here for my birthday and it was one of the best meals I've had in recent memory. The wait staff went out of their way to be friendly and they were extremely knowledgable about items on the menu.When we walked in with my 7 year old daughter I could see by the looks on some diner's faces that they were apprehensive. But the waitstaff treated her like any other diner. We were surprised & pleased to see our favorite server from Vedge there (he'd recently changed restaurants) and he was as warm and welcoming as if we were old friends.The meal was superb. Between the three of us we had just about everything on the menu. My salmon was a work of art, dressed with tiny blossoms and fresh herbs. The sweetbreads and hand torn pasta were delicate and delicious. My favorite dish though was the squab with polenta and blueberries. It was reminiscent of a savory cheesecake.The staff caught wind that it was my birthday and brought my desert out topped with a candle. Afterwards one of the owners came out to chat with my daughter, impressed that she'd eaten such grown-up food & stayed chill through a pretty epic meal. It was the best combination of familiar and friendly combined with seasonal and local fine dining that I've probably ever had. Well done, Farm & Fisherman & thanks."], ["Jessica S.", "This was long awaited for and a very special surprise. I've been having this new thing lately for trying out all of the upscale, foodie locales that are BYO in this city. What is better than amazing food paired with your very own choice of wine (that costs less than half the price of the restaurants bottles)? This is a very cozy little spot on Pine. Something about Pine St (OK, maybe a few things) makes me really happy, so finding this spot tucked away on a quite spot at 11th and Pine was special. Very minimal decor, but cozy enough to feel like you're dining at your family holiday dinner. I think it would be a great spot for a small group to celebrate a special event. I'm currently eating pescetarian with my man, and they did not at all disappoint if you are looking for seafood or vegetables. We shared 2 1st courses, 2 2nd courses, and 1 main course which ended up being perfect to share between two hungry people. Starters were seared tuna and quinoa salad and chilled sweet corn soup with crab cake. The corn soup was FANTASTIC and one of best of the evening. Really sweet and thick, without being too heavy. The bloody beet steak is absolutely to die for as recorded by roughly every previous reviewer. SPOILER ALERT: Maybe I'm not first on this, but if so I need to share that the waitresses outed this to me while I was here - starchefs.com/cook/recip…Anyway, I must continue. The baked egg/cheese/eggplant was not my favorite, but made up for by the sea bass over polenta. Fish-perfectly cooked, paired really nicely with the polenta. The chocolate mouse napoleon with fried phyllo dough was a little naughty. Perfect to close it all out. Our waitress was sweet and helpful-knowledgeable enough to switch up the order of the courses to pair better together. This detail, and the ever changing menu featuring seasonal deliciousness, would encourage me to come back. Next time with more wine."], ["Patrick B.", "Really superior dining experience. The BYOB restaurant is small, seating for maybe 30. Service is attentive, knowledgeable and personal. Menu has a lot of fresh seafood and fish prepared wonderfully in imaginative styles and pairings. Cold corn soup was extraordinary, as were the sweetbreads and the \"Bloody Beet Steak.\" The wahoo was perfectly prepared. Even their rolls are excellent.The menu here changes daily, a tribute to the freshness of the ingredients, so go with an open mind. Try something different!"], ["B M.", "This is one of the best BYOs in Philadelphia. The ever-changing menu always features fresh seasonal vegetables and well-prepared and flavorful proteins.  Every seafood dish I have tried here has been excellent.  The chef avoids doctoring up the food with sauces or reductions for the sake of including such things.  I welcome any plate where the several ingredients comprising the dish are complementary and inventive flavor combinations.  This is a definite must-try for your next date night, however, just remember there are limited seats so you should make reservations in advance."], ["Pedro H.", "Although the term is often overused, \"farm fresh\" truly applies here. Inventive, flavorful dishes and just-right portions amaze. A cozy dining room, friendly atmosphere and attentive service make it the perfect setting to catch up with friends and loved ones (BYO, so grab a good bottle). Try the Bloody Beet Steak!"], ["Marissa C.", "This was definitely one of the best meals I've had in Philly. Everything we ate was fresh and delicious, service was flawless and the experience was all around pleasant. We had the bloody beet steak, makarel with ramps, and fried sweetbreads to start. The sweetbreads were the clear star of the show but everything else was amazing as well. My husband had the lamb entree and I had the scallops, we devoured both. You would think after a meal like that we wouldn't have room for dessert, but alas, we did. The waitress told us they had this amazing salted caramel pretzel ice cream type thing that ended up being out of this world!  And it's BYO? Are you kidding me?! I can't wait to get back to Farm and Fisherman. The decor is simple but elegant and if you get a window seat you are pretty lucky!"], ["Julia L.", "We celebrated with dinner here shortly after Joe proposed to me on a rooftop in Philly (after re-enacting a famous proposal from our favorite tv show HIMYM: here is the video of our proposal: youtube.com/watch?v=G1TF… ). To be honest, Joe had totally tricked me! I thought he was going to propose at a restaurant and then when he asked me to select a restaurant, I picked The Farm and Fisherman since it had great reviews online and sounds like they use the freshest ingredients. Our waittress was very kind and asked us if we were celebrating and I said we were celebrating Joe proposing to me and the waittress was so excited for us.We started off with a beet salad which came highly recommended. It was delicious! and refreshing! a great way to cleanse the palate and start our meal.The other appetizer we split was a braised beef short rib with gnocchi. This was delicious! A bit more savory and filling than our other appetizer, but I love hot appetizers and braised beef short rib so this was the perfect choice for us.Joe got the cod fish dish with a sweet pea puree. He really enjoyed his dish, and I'm not a huge fan of fishy-fish dishes but this one was a great dish! The fish was cooked to a nice crisp exterior and juicy flaky interior.I had the steak dish with a corn mash and roasted veggies. The steak dish was terrific but I really enjoyed the corn on the side.Our waittress brought out this dessert trifle on the house in honor of our proposal. This was a really nice dessert but I was super happy that we had ordered this other dessert dish:This apple tart was amazing! My favorite part was the crust, Joe and I were practically fighting over it. Overall, this was the perfect meal to celebrate our proposal."], ["Brian C.", "After a long drive home we were looking for a nice quiet dinner so decided to try this place. I called to reserve a tbl and was told not to worry about it because after 8:30 all guests would have been seated. To be sure, I asked the young lady if she'd like my name to hold a table but was assured we were fine and to just come in. Kitchen is open to 10pm. My date and I arrived at 9:42 and asked to be seated. There were three tables at the time and we were starving. The server reluctantly said hello, I asked for a table and she made a face followed by the infamous \"let me check with chef on that\". Needless to say, chef said no and we were turned away! I've been in the hospitality business for the better part of 20 years and this is my #1 pet peeve. It's a luxury to have guests coming in the door and the last thing you do is turn them away, especially like this. The girl even had the nerve to tell me I didn't have a reservation! I'll stop my rant here. Needless to say, I'll never go back and I'll make sure I tell all my coworkers/friends to stay away. It's a shame because I'm sure the place is great (3 bells) but they have a loser chef with a poor attitude and that's just bush league. Nice work cheffrey."], ["Alexandra R.", "I cannot recommend The Farm and the Fisherman enough. The wait staff is friendly and knowledgable and their food is fresh & delicious. Probably one of the best meals I've had in Philadelphia.My boyfriend took me here for my birthday last year and I keep making up reasons for us to go back.Whatever you do, you must get the bloody beet steak. It would be a serious mistake not to, it's so incredible."], ["Lindsay H.", "I had been looking forward to trying the Farm and Fisherman for some time now.  I became even more excited after hearing how Joshua Lawler used to be the chef de cuisine at Blue Hill in Pocantico Hills, NY which was easily one of my top dining experiences ever. I went last friday night and entered with the excitement of a kid in a candy store. The place was super tiny but lovely. Our servers were amazing from start to finish.What we ordered:Apps:The Bloody Beet Steak- Absolutely delicious and loved the idea. I will always eat beat with balsamic from now on. Cured tuna- this was light and refreshing though the tuna didn't have a different taste than a tuna carpaccio. Poached Wyebrook Farm Egg- this was sinful and presented in a cast iron dish filled with warm flavors of egg, cheese, toast, pickled ramps, baby spinach and fiddleheads. YumEntrees:Chicken in Haye- Perfectly cooked and well put together. Very approachable. Rabbit saddle- all the awful of rabbit wrapped up in meat and wrapped in bacon served with new potatoes and a red pepper puree. This was delicious and very well executed. All in all I loved my experience from start to finish. Will I be back, yes. Will it be very soon, likely not. The meal was wonderful, well thought out and executed but I'm more of a fan of bolder favors and a little more rustic cuisine. That being said, I'm thrilled to have this restaurant in Philly and would absolutely recommend it to others!"], ["Janice K.", "Absolute terrific food, from starters like the beet salad and burrata to main courses, where the mahi mahi was exceptionally well prepared, with lovely local vegetables like ramps and fiddleheads. A deconstructed chocolate napoleon was a perfect dessert. Prices are reasonable for the quality, and the bring-your-own-wine makes it a real price saver."], ["Alex B.", "The food was tasty and the ambience romantic. My girlfriend and I appreciated the white tablecloths and cozy interior.In fact, the service here seemed to be the only downfall. The restaurant's intimacy begs for discrete, efficient and friendly service. (\"Friendly service\" should a redundant term.) However, at the F&F, our waitress gave the impression that - having scored a reservation - us patrons should be made to tolerate her condescending demeanor. (Perhaps it was the mediocre wine we brought? I'm sorry if its screw top offended your sophisticated taste!) Maybe she was trying to act \"refined,\" but it came off as, in a word, unfriendly. In stark contrast, the other waitress's doting attitude to the neighboring table was pretty annoying. (\"I don't think I've ever seen a couple so in loooove,\" is something she actually exclaimed at one point.) Service halfway between these two extremes would've been perfect!"], ["Michelle C.", "Our recent date night at The Farm and Fisherman was pretty flawless. From the food to the service to the restaurant itself, it was a great evening. Judy was our server and she was awesome. She knew the menu inside and out and had a real appreciation for food. Obviously, I like that in a server! We started out with delicious parker rolls - it was all I could do to not wolf the entire thing but I was trying to save my cals for the rest of the meal. Josh Lawler does some really incredible things with seasonal ingredients. This was showcased especially in the first course: grilled eggplant with burrata, and a slow roasted squash. Both plates were filled with vibrant colors from the ingredients and accompanying sauces. The flavors were wonderful, and every bite was different. Next I had scallops, which were served with pastrami and sweet corn. On point. Now that it's a couple weeks later, I don't remember what my dining partner had for his second course, but I do know he enjoyed whatever it was (helpful, I know). My main course was a grilled tri tip steak, which was very lean and very tender. It was served with lima beans, which I really liked as an alternate to the usual potato. My boyfriend enjoyed his bacon-wrapped quail. Who wouldn't love a teeny bird wrapped in bacon? For dessert we shared a lemon tart which was perfection. I'm literally shaking my head at the memory. Get the tart.This was our second visit to this restaurant. The first was nearly a year ago, after they first opened. I have to admit, I enjoyed this second visit so much more, and I think it had a lot to do with the seasonal fruits and veggies of late summer. Regardless, I am really looking forward to my next meal at The Farm & Fisherman. This is the kind of place that just gets better and better."], ["Christopher D.", "I had high expectations for this restaurant, and feel that it has so much potential. I hope in time they will be able to deliver.The menu is essentially set up as a three course tasting menu, with dessert as an optional. Changing daily, based on what they are able to source, it is clearly a surprise what is on the menu.As it was a blustery fall night, I opted for two dishes that felt like they were fall to me.. a delicous butternut squash soup, that also had sunflower seeds and a bit of speck in the bottom. Great,,, a taste of the season. I followed that with acorn squash ravioli, served with hazlenuts, and gala apples in a brown butter sage sauce. Good but not as flavorful as I was expecting. This course they also messed up my DC's order, forgeting to put his lobster in. That threw off the whole pace of the dinner.The third course we both opted for lamb shoulder, served on a bed of spinach, and turnips. Felt like the dish was a bit salty, and not sure if this was a result of over salting, or whether the sauce reduced while cooking extra long while the lobster dish was fired.We passed on dessert as the choices were uninspiring (creme brulle and an apple struedel,,, ). We also had a hiccup with the final bill as they under charged us, and wanting to be honest, we brought that to their attention, which then resulted in an additional ten minutes to leave the restaurant.I love the place, the staff, and the concept. I hope it becomes more consistent over time."]], "Pura Vida": [], "Valanni": [["Carlos R.", "Best bartender at Valani is Giana love her cocktails are amazing mixologist her own signature drinks are the best"], ["Corey C.", "I just got back from this restaurant with my roommate for restaurant week and we cannot be happier about our decision to come here.We started off with two cocktails which were decent but nothing particularly special besides the delicious mango purée in one of them. For our appetizers we had the spread sample with pita and calamari. The calamari was crisp and not too heavy with a great tomato based sauce on top that caused me to scrape every last bit off of the bottom of the plate! The spreads were a nice sampler of different Mediterranean dips, but the garlic hummus definitely beat the other two. This was absolutely the best hummus I have ever tasted.I had meat paella for my entree. The other reviews on here are correct. It is absolutely DELICIOUS with heaps of meat including some amazing scallops and hearty chorizo. There was so much that it took me a while to eat it all, but it was a marathon of pure bliss. We finished with the Oreo beignet and chocolate mousse, both of which were succinct in size but immense in flavor. Savoring them slowly was the prefect way to end our meal.Our waiter was knowledgeable, helped to explain several dishes, and provided me guidance in selecting my appetizer. No complaints.The atmosphere is nice if very slightly cramped, and the center bar was very active and attractive. Reading the other reviews on here, I cannot wait to come back for the half-priced cocktails and tapas! If you're looking for a restaurant week spot or some authentic paella, look no further!"], ["Leigh S.", "My husband, son and I came to Valanni after the no-resi restaurant we had planned on going to had a tremendous wait. We're definitely glad we came here, even though I wasn't sure how tapas would fare with the little one. From the start, Jessica at the hostess desk was lovely, making conversation with my three year-old before the table was ready. Once seated, in the back room under the skylight, the three of us settled in. Our server, Reese, was just wonderful. He was charming, engaging and didn't seem put out that there was a preschooler in a restaurant that clearly had no children's menu. We started with the house-made chips and guacamole and the crispy Brussels sprouts. The guac was good, but not the best. I personally thought it could use more spice but it definitely didn't disappoint. The sprouts were AMAZING and I'm planning on trying to replicate them sometime this week. For dinner I had the Mahi Mahi special with creamy polenta. Sooooo goooooood. The fish was tender and juicy and the polenta was so very delicious. My husband had the burger and annihilated it completely, which I'll take as a good sign. My son had the lobster and crab Mac and cheese and ate a decent portion, which tells me he liked it. For drinks, husband went with the Manhattan but made with rye. Reese made this drink himself and my husband was impressed. I went with the rum julep and happily sipped on a few of them. Delicious! Overall, a great experience and we'd definitely come back."], ["C T.", "Basic comfort food with high quality ingredients. Big menu everything tasted good not sure if its worth the price. I find the decor tacky. I can make lobster mac and cheese at home.Waiters are nice."], ["Liza K.", "We went for dinner on a weeknight and were pleasantly surprised by the interesting selection of smaller plates.  We knew that we definitely wanted their Crispy Brussels Sprouts (my friend usually hates them but tried them here once before and was stunned that she loved them).  The combination of granny smith apples and marcona almonds was great! And I really enjoyed the sauce that complimented - it was aged balsamic when I inquired.  Highly recommend it!The Porkbelly Slider Cubans were pretty good too.  Simple but excellent execution and great proportions - you got just enough pickle to the Canadian bacon and cheese.  Don't skip the Fried Goat Cheese!! By far the best menu item we tried.  (See posted picture- we couldn't even resist eating one each before taking a picture of the last one on the plate). The honey just goes so well with the tangy yet creamy goat cheese, but the bell pepper marmalade adds another exciting layer for your taste buds.  Heavenly!Service was good, although we were literally the only customers sitting outside on a nice summery night.  And don't forget to check in on yelp for a complimentary wine/sangria (if they still have that offer)!"], ["Gena N.", "Myself and a few gfs weren't impressed with our visit here recently. We came on a nice evening and got seated right away. If you check in on yelp, get a free sangria. Cool, but make sure your server actually takes it off your bill. We got the appetizer sampler which honestly 75% was very good! However, the entrees seized to impress us. Chicken was dry and bland, scallops were nothing special & pasta was just ok. Overpriced average food, even worse all of us experienced gas and stomach issues for 24 hours after dining here. I'm giving 3 stars only because 1. Sever was nice, 2. atmosphere was nice & 3. Appetizer was good, but I honestly won't be back again."], ["Eliza P.", "This place is great. We came for a friend's birthday dinner and we absolutely loved our whole meal!! 4 of us split dishes and 3 others got their own plates. I split: seafood paella, bacon wrapped scallops (so good!!!), baked brie (unreal!!), calamari, cheesesteak sliders, and the Medi-Latin platter with pita/hummus/tzatziki/feta/olives/epanadas/beef kabobs/spanakopita and bacon wrapped figs. It was so much food but we ate it all because it was so incredible!!For dessert 7 of us split the delicious warm Oreo beignet covered in ice cream and caramel (actually heaven on earth, no joke), a strawberry tres leches cake, and a chocolate coffee mousse. I personally highly recommend the bacon wrapped scallops, the baked brie, the calamari and the Oreo beignet. My friends said their chicken saltimbocca, and the lamb burger were also really delicious! The drinks were strong and delicious. The service was great. The waitress perfectly explained the varying portions to us so we knew what to expect. She even took our photograph after dinner and was so sweet about dealing with a large party! Only thing is they can't split the check, so be ready to venmo a friend or carry cash. I really recommend this place and I will be going back!!"], ["Jennie F.", "This place is incredible! Not only was the food absolutely delicious, the staff really made the experience a night to remember. Ask for Cody or Reece and they will be sure to take care of you. Food wise, I was there with five others so we tried a variety of items. I had the figs in a blanket and was blown away! I'm not one for blue cheese, but in combination with the figs and bacon...seriously one of the best items I've eaten in a very long time. I also tried the truffle fries and kobe burger and both were very good. A couple people got the brussel sprouts as well as the bacon wrapped scallops, the butternut squash salad, and the scallop dinner. Everyone in our party really enjoyed it. But really..go for the figs! Also, ask Josh to make your drink. Incredible bartender. Next time I'm in Philly, this will definitely be one of my first stops!"], ["Adrienne G.", "The drinks are awesome! Staff is very friendly! And the food is so delicious! Cant wait to go back!"], ["Saloni G.", "I had my birthday dinner at Valanni this year with a large group of people and my experience was quite enjoyable. We had the Level One dinner package (valanni.com/menus/recept…) since we were more than 10 people. Jenny organizes all the large reservations and was great to work with. She was kind enough to add the Bleu Salad to our set of options as well since many of us are vegetarian. The atmosphere is very young and trendy so it was well suited for the occasion. I am a sucker for good Vegetarian Paella and I can confidently say Valanni's is great. While it is not the best paella I have had, Valanni's saffron rice was definitely flavorful. The Trio of Spreads was fairly standard - nothing special but not a downer by any means. I got the Oreo Beignet which was delicious! Almost our entire party ordered it and it certainly did not disappoint. The red sangria was also quite enjoyable and went very well with the paella.I docked off one star because the service was a bit slow and they accidentally billed me for a much more expensive dinner package than I had arranged (but they quickly corrected it after I pointed it out). That said, I have heard amazing things about their brunch so I will definitely be back to try that soon!"], ["Jason C.", "Went to Valanni Monday night on a recommendation from a friend who had recently dined there. What a surprise ! I cannot believe it was my first time there having lived in Phila most of my life. Everything from the pleasant greeting at the door to the impeccable service from our waiter Reece down to  the very last bite of the oreo beignet for dessert was incredible. The atmosphere had such a cool, loungy, chill vibe yet still an upscale dining experience.  We had the chicken empanadas which were highly recommended,  the roasted butternut squash and arugula salad and we shared the meat and seafood paella. It all was fantastic and the Paella was such a generous portion. Did i mention the oreo beignet? Outstanding ! The cocktail list was extensive and everything looked delicious. We went with the the X-Boyfriend (which is listed as a house favorite and i can see why) and i had the Rye me a River which was a nice play on a traditional Manhattan. Great experience, we already made reservations to go back !"], ["Lanha T.", "Arrived around 8:35pm for a 9:00pm rsvp. Wasn't able to be sat even though plenty of empty tables available. Service was fine but food was lack luster. The duck & foie flatbread was soft no crisp to the crust at all and really greasy. The lamb burger was decent but only ordered it because we were still hungry after eating the flatbread, brussel sprouts, chicken empanadas, calamari, and shrimp fideos. Do not order the shrimp fideos. The noodles tasted boxed with an oddly vinegary taste and spicy after note. Best thing were the calamari."], ["Sophie C.", "Seafood paella looked so good but was not as tasty as I thought. I was thinking maybe stronger flavor would make it better. Empanadas were average, personally I don't like deep fried food.Price is a little high for the amount of food in each dish."], ["Zack P.", "Great Lounge to hang with your friends in.the evening.Very nice very sheik ...very clean . Great tapas menu and drink selection . Definitely a cool place to take a date aswell . Check it out ."], ["Frank Luigi M.", "Came here with a big group on a Friday night. The place was completely empty, other than our table (WEIRD? maybe it was because it was halloween?). Anyways the server was a bit odd, but we ignored it and ordered our food and drinks. I thought the food was ok, but nothing out of this world. Ordered the Kobe burger, but by the time I was done with appetizers I was already full.Bill came out to about $70 per person - lots of drinks and food."], ["Chuck M.", "Rude staff and incredibly loud music.It says restaurant, right? Okay, because this ain't no disco-tech or club.The biggest problem is some of the staff is SUPER rude; to the point where you get one drink, pay, leave, and go somewhere else for dinner.I think my last waiter was surprised I tipped him at all; he was terrible.The drink was good, though. The bartenders know what they are doing.Also, the music... it's at a 10 when it needs to be at a 5. It is so loud in this restaurant (from the music, not the patrons or staff) that you cannot - CANNOT - have a conversation with a person sitting 2-3 feet from you.I do not recommend for a date night; unless to get 1 drink... or to get completely shitfaced and scream as loud as you want; ain't nobody gonna hear ya'."], ["Farha A.", "My experience here was mixed. I read some Yelp reviews and reserved a table here since my friend was in town, but upon arrival we ended up having to wait over a half an hour despite the reservation. We kept asking when we would be seated and the staff seemed confused and were not able to communicate with each other or us to give us an approximate wait time.It was a Saturday night so I understand that the restaurant was crowded, but in my opinion it was a little too loud and crowded initially. I was looking to have a yummy, fun dinner not be overwhelmed in a night-club atmosphere.After waiting a half hour when we were finally seated, from here on out the experience improved. The server was helpful, kind, and prompt and the music was no longer drum-blasting in the area where we were seated (others closer to the front weren't so fortunate and I could hear them screaming at each other in an attempt to converse over the loud music)The food was really good, especially the Kobe burger which was cooked and seasoned just right. The fries were also very well crisped and flavored just the way I like it with plenty of dipping sauces - something I desperately love.So, great food but not so great ambiance if you're looking to converse over dinner. Also don't expect to be seated on time."], ["Sheila D.", "Absolutely LOVE this place. Came here for restaurant week, and it has got to be one of the best restaurants in Philadelphia that I've tried so far in terms of its food, ambiance, and service. Let's start with the food. Even though restaurant week venues usually have extremely limited menus, Valanni had a very extensive list of options that made us spend quite a long time finalizing our orders since all of the descriptions sounded so mouth-watering. I ordered the Crispy Shiitake Polenta, which looked almost as good as it tasted. I was actually pretty surprised how much I enjoyed the dish because it had a lot of feta, and I'm not usually a huge fan of cheese, but in this dish, it just worked. I was also able to try the Quesadilla (very rich, cheesy, and inexplicably classier than your typical quesadilla), the Baked Brie (deliciously creamy), the Crispy Brussels Sprouts (very unique dish that reminded me a little bit of kale chips - light & refreshing with a slight crunch), and last but not least, the Black Truffle Arancini, my ALL TIME favorite of the night. The Arancini itself had quite a lot of flavor, but when dipped into the rich cream sauce, it became a piece of heaven that melted in your mouth. If I had to recommend one tapas dish, it would be the Arancini - I promise it won't disappoint.For my entrée, I had the Sesame & Pepita-Crusted Yellow Fin Tuna, which I thoroughly enjoyed. There was a circle of wasabi around the dish, and I'm not a huge fan of wasabi, so I kind of just avoided it. Next time, I'll remember to just ask for the dish without the wasabi. I was able to try a bit of the Crusted Porcini Day Boat Scallops, which were just scrumptious! Again, the sauce 100% delivers and makes the dish.Finally, the dessert. Not much to say except for the fact that there could not have been a better way to end the night. Milk Chocolate Mousse was so silky and not too sweet, so it was a very refreshing treat. The Oreo Beignet took me back to all of those state fairs with delicious fried Oreos, and the Bread Pudding was to DIE for - crispy on the outside, and when you smother ice cream all over, it makes an undeniably tasty end to the meal.The atmosphere had a very modern vibe and had some elements of a club including neon-ish lights. I thought it was a very cool environment to dine in. Service was just impeccable - we loved our waiter and all of his lovely food suggestions. He was very nice and personable and made sure that our trip to Valanni was amazing. I could not have imagined a better restaurant week experience - will be coming back (and raving about this place) for sure!"], ["Caroline S.", "3.5 stars... I came with 3 others during Restaurant Week to celebrate a coworker's birthday. We made reservations via OpenTable without issue however it seems they overbooked for that random Tuesday evening and we ended up waiting about 25 minutes on top of our reservation to be seated... We dined outside where we could hear each other and enjoy the crisp fall air. It was nice. We started with drinks... I ordered the lavender margarita - awful. I mean it got worse with each sip. However others ordered different cocktails and loved them (ie: coconut mojito.. I had a sip of this. It's amazing!). I ended up ordering the sangarita and enjoyed that.The RW menu had some great picks.. I started with the baked brie (grand marnier-soaked cranberries, pears, hazelnuts, toasted baguette). It was so so good, I highly recommend. For my entree, I opted for the scallops.. These were a bit of a disappointment as only two scallops  (& relatively small in size) were on my plate. It was one of those moments where you take a look around the plate to see if your eyes are deceiving you... Nope just 2! However my dessert - the rum bananas & ice cream -made up for it and my friends all seemed to enjoy their entrees and desserts. All in all.. It was a nice experience and I'd go back for drinks and appetizers just maybe not during RW."], ["Sophia L.", "The food is decent but I've had better for cheaper prices. However, I'm giving so few stars because of the service. I just wanted to order take out. I go to the bar, the bartender says \"I'm actually a bartender so you'll have to go to a server for that,\" which is definitely not the case in most restaurants. I try to find a server but they're all rushing around so I instead try the hostess. The hostess says \"you'll have to go to the bartender.\" \"The bartender told me to find a server.\" Hostess says \"well, I'm a hostess.\" \"No way\", I left. Last time I step foot here."]], "South Street Deli": [["Jamie S.", "The deli, located next to Lazaro's Pizza close to 18th Street, looks completely #basic. Head past the chips towards the back counter where they make breakfast and sandwiches. One small sign taped to the Plexiglas explains that Dominican platters are cooked daily. Since most Dominican food in Philly is north of Center City, this is an excitingly convenient find.          I had the option of chicken, pork chops, or what they called pulled pork. \"Is it pernil?\" I asked. \"Yes\". Yessssss. Mine.  Small platters are only $6 and large platters are $8. The $6 tin container came packed with more pork, rice, and beans, than most people could finish in one sitting. The beans and rice were well-seasoned and I liked the single olive addition (can you see it?) Theirs was a solid version of pernil; while I missed some skin cracklings that some of those North Philly spots nail, it held its own with good flavor and moistness."], ["Julie Z.", "This place is awesome.  Serving up hot breakfast sandwiches and bagels. Big kid lunch options like chicken fingers and fries.  Home made Puerto Rican comfort food like roasted pork, rice,  and beans with ample portions for a great price.  Almost all the girls from my work grab lunch here.  Truly a hidden gem of South street! !"], ["Gabrielle W.", "I have lived near this place for 3 years and never knew it existed.  I want my fellow yelpers to learn my my catastrophic mistake.  This place rocks.  I got a huge turkey club (one of the best I have had in my life) for $6.00.  I got an everything bagel..for $1.  They also have a ton of specialty sandwiches I have yet to try because I'm so obsessed with that damn club.  I believe it is family owned and the family works there every day which is cool.  I'd rather go to a place like this than Subway.  The only negatives is they don't have a take out menu and the yelp number I called to place my order was directly sent to voicemail.  That kind of blows but if you live in the area, I would get my pizza at Lazaro's and my hoagies/sandwiches at this place!"], ["Jim M.", "On the surface, South Street Deli looks like any neighborhood deli, which makes the food coming out of here that much more unexpected.  The deli is owned by an incredibly friendly family; mom and dad work the kitchen while the daughter handles upfront.  Everything I've ordered is unbelievably delicious.  Some standouts: breakfast sandwiches, Italian hoagies, and their beef with rice & beans platter.  Very affordable and quick service."], ["Eric H.", "This place is a Gem and hands down one of the better places to eat between 13th and 24th on South. Where do I start! There are a couple things that I think they do amazzzzinnggg here.  1. Turkey club!   HOLY CRAP!  Delicious. 2. Italian hoagie.  FANTASTIC!!  3. Their beans, chicken and rice platter is AWESOME!!  I'm going to have to post  pictures.  The meat falls right off of the bone.  The girls who work there are super friendly, great to talk to when you are waiting for your food; it's a family owned business and they make you feel apart of it.  Just a few notes:  I'm a huge fan of eating lol... I am also a huge fan of Italian hoagies.  This place beats out PREMOS!  THAT'S RIGHT!! I SAID IT!!  You can get sarcons bread and it is so good.  This place is not that hard to find because its right next to Lazaro's.  So if you are looking for inexpensive, great tasting food with tons of options, definitely stop by there. You will thank me later."], ["John R.", "Awesome food that is inexpensive and quick. They also serve breakfast platters in the morning and great coffee."]], "Freddy's Restaurant": [], "Amada": [], "Mixto": [["Neeraj J.", "I have spent many a Sunday afternoons here with my friends drinking pitcher after pitcher of sangria and mojitos.  The drinks are amazing and the staff is super-friendly.  The place just exudes good vibes and you will walk out saying \"That was fun!\".  The food is good but not spectacular - still, I can't say that I have had a bad meal here.  Make sure  you ask for an order of bread - there is something great about these warm slices of buttered bread to wash down with your beverage.  And ask for the accompanying salsa - it is spicy!"], ["Jacki O.", "This was our second time here in four days. Tonight we had the paella. It was so delicious. The ambiance is very relaxing after a long day of walking around. We are from South Florida and can get Latin food, but we have to say this was very good. Oops let's not forget about the Flan they serve. Don't leave without having Flan! If you are visiting Philadelphia, don't miss this restaurant!"], ["Tracy H.", "Great location... Great antique Spanish environment they got going on. I'm not a fan of outdoor eating personally but I love how the doors open and you can sit slightly behind the wide open windows to get an out door experience indoors. The food it's good. I like the Sunday brunch. Although last time I was there the steak and eggs where a lot smaller portions compared to 2013...drinks are to die for... I stopped drinking this year but if your trying to get a little saucy order the mojitos"], ["Jazmin B.", "It had been awhile since I have been to Mixto and I am so glad my husband made reservations. Our reservations was at 6:15pm on a Sunday and we were immediately seated. We went with our young daughters which was ok because they are accustomed to go to all sorts of restaurants. For a cocktail, I ordered a Pomegranate mojito which was absolutely amazing! It was not too sweet or too sour..just perfection. For the appetizer, my husband ordered tostones brushetta.. So good.My husband ordered the Tilapia Mango entree and he loved it. He added Moro which is rice and beans. Let me just add we are Dominican so Mixto's menu is very familiar to us and we do know what these entrees are supposed to taste like. Any way, my girls shared Pollo empanizado(breaded chicken) the portion was large enough for two to three children. I ordered/shared Plato Mixto which is a VERY large appetizer..I highly recommend it.. It has a little bit of everything.For dessert, I ordered the flan de leche and my girls had a chocolate cheesecake... Both were decedent...Cannot forget service was great, like always! I will be back soon!!"], ["Shane J.", "I have been to Mixto a few times and each time I felt it was \"just ok\".  On other visits I had dinner and it was sufficient enough, but nothing memorable.  My last visit, I went for happy hour.  I had the appetizers and cocktails and they were tasty.   I felt the staff weren't friendly at all and the service was just average.  Would I go back...maybe, but it wouldn't be my first choice."], ["Shelby A.", "I wish I could put an extra half star and make this 3.5.I had an Okay meal here.  I went with a group of 11 for a friend's birthday.As one of the first to arrive, I was told I had to go wait at the bar (they can't seat you unless more than half of the party is there), and there wasn't space to wait inside by the hostess stand.  It was pretty cold out, so I wasn't going back outside and had no choice but to buy a drink for my seat at the bar. Once everyone arrived and we were seated, the waiter encouraged us to order several pitchers of margaritas and Sangria.  The drinks were pretty watered down, and had tons of ice in the pitchers so there wasn't enough to drink and we had to continuously order more pitchers.The appetizers were decent.  I liked the empanadas, but they weren't ideal for ordering with a large group.  We had to get 10 orders to feed us all.  The server also just put them on one side of the table, so it was difficult to get appetizers to everyone.  We had also ordered all of the kinds of empanadas, and we could not tell which kind was which without cutting them all in half.The server also talked me out of what I originally wanted to get and told me to try Arroz con Camarones.  I wasn't a huge fan and was quite annoyed I didn't go with my gut and get what I originally wanted.Once we finished, the server pretty much disappeared for about 45 minutes and while we waited for the check. The service was very slow.   Also, the restaurant was really loud, so I could only really talk to those next to or across from me.  I could not speak to anyone else without getting up and walking over to them.Al in all, the food was not bad, not great, but not bad.  I would definitely try it again with a smaller group of people.The service put a damper on the evening."], ["Saloni G.", "I have been on the hunt for some good paella in Philadelphia so some friends and I decided to give Mixto a try. While I have generally been disappointed by the paella options in Philly, Mixto was also a meh on that list. I wish I liked it more but unfortunately can't say otherwise.I ordered the Paella Vegetariano while my friends ordered the large non-vegetarian paella. We all felt pretty indifferent about what we ordered. The bomba rice wasn't flavorful or even well-prepared. There was a lack of spices and general freshness. The vegetables and meat weren't fresh and kind of soft in general. We ordered the guacamole as a starter which was decent but I've definitely had better in Philadelphia. Our service was pretty slow and the price is pretty steep for the quality of food we got.Again, wish I could say that I loved this place more! The hunt for the best paella continues..."], ["Joel R.", "Mixto is great, be forewarned; their margaritas are huge! The food is excellent especially many of the pork dishes. The empanadas are delicious and they have a mixed appetizer option that comes with a lot of options, all delicious."], ["Tina m.", "Coming from Vegas we have Spanish food everywhere so my standard is pretty high when I'mLooking for Spanish places to eat else where. In Philly for the weekend and came to this place and I'm hating that I won't be able to eat here againBefore we go!! :( I had the tostada rancheras awesome from chorizo to the plantains. My BF has the Colombian breakfast that he loved. Will def be hitting this spot back up next time we're in philly! Oh and if your a sangria fan that too was yummy"], ["M C.", "To be honest, I wasn't that hungry when I visited. That being said, overall I had a pretty decent dining experience. It was my last night in Philadelphia before my vacation came to an end. Made reservations via OpenTable for 8:00 pm on a Saturday night. Got there an hour early but there were several open tables on the ground floor. At first the hostess hesitated a bit and said I may have to sit outside. I certainly did not want to dine outside so then she showed two open tables on the second floor, which was more to my liking.There was a group of about 10 about two tables away from me and they were VERY loud. Any way I placed my order... Had the tropical mojito and the Arroz con Camarones which were both pretty good. Great, at tentative server (forgot his name).Overall good experience... I'd go again."], ["Linds C.", "Excellent customer service and the food was sooo delicious. Hubby and I really enjoyed it and looking forward to go back. Everything was on point. We didn't have to wait for a table. We had a reservation and by the time we got there our table was ready waiting for us."], ["Dan S.", "I'm a huge huge fan of Central American cuisine.  I miss it dearly since I haven't been there in a few years, so I like to frequent Mixto to get my fix.  They have some dishes that are inspired from various countries, including Cuba, Columbia. and Costa Rica.  I was so happy to try their gallo pinto con huevos, as it's one of my favorite breakfast dishes.  They also have salsa lizano! I like that most of their plates come with delicious maduros as well.The service has always been great, keeping us all satisfied so we can focus on our delicious eats."], ["Elizabeth S.", "First of all I am Cuban...the food was not Awful but it also was not Amazing. The service was great! It is a place I wouldn't mind coming to again but I wouldn't recommend. Things that I liked were the plantains, the white rice with black beans, and the batidos. That's about it. Everything else was so so. If you aren't Hispanic you probably wouldn't know the difference if this was one of your first experiences with Latin food."], ["Jaime ..", "I arrived at this restaurant and requested a table for three, which they told me the minimum waiting time was 2 hours (even though I saw empty tables everywhere). The manager was extremely rude, when I said my name he said \"so, you finally showed up?\", I told him it was ONLY 5min walking time when he pointed the table and said \"there is your table\", without walking me to it like the other clients.  I tried to ignore this casualty since I still wanted to have a good time.Now for the food, I ordered a \"mofongo\" WITH beef, and when it came I only saw the mofongo with a tiny bit of beef, and a tiny bit of cheese?   I ordered a chicken breast as an extra because I still wanted to eat some protein, but they forgot about it.  Also, as a puerto rican, I have ate a lot of mofongo and I can say this one was one of the greasiest."], ["Richard R.", "We went to Mixto on a beautiful late Summer evening. We were seated near the window and it was a great night for dining. Mixto has a nice tropical Colonial Spanish vibe going on. I had the Arroz con Pollo. The rice was moist and tasty with a bit of Chorizo. The portion was huge and could easily be shared. We had pitcher of Red Sangria that was refreshing and not overly sweet on a warm summer night. For dessert we split probably my favorite dessert, Tres Leches and their really good Cafe con Leche.Mixto will run about $30-$35 per person if you have a drink and dessert with coffee. Nice place."], ["Davis M.", "Potato chips. Golf. Making love. These are the three elements of my life force. Take them away and I start to slowly die. Try the arepas."], ["Christina S.", "My husband and I came here over 4th of July weekend for breakfast. What a great selection, and choices. Everything was delicious and filling. We were able to nab a table by the window and enjoy the world passing by.With a full bar, the Bloody Mary was perfect. We will definitely be back."], ["Leila L.", "Every time I come to Philly, I want to make a trip to this restaurant.  Though it's a little pricey, it's not outrageous like a high end steakhouse or anything like that.  This time we went was on a date night.  There are two dinning floors, and on the weekends, the first floor turns into a dancing floor.  We haven't been here for that so we can't say how good it is, but we've heard great things.The ambience here can be very romantic and very festive, really depending on the night.  The service is always good and the food always filling and amazing.  We had the empandas and the vaca frita and one other dish (can't remember).  But we do remember how good everything tasted.  Between the two of us, we couldn't really finish the food, it was just too filling.  Definitely worth a visit if you can reserve a table ahead of time, otherwise there'll be a wait."], ["Rexi V.", "Food was good but not plentiful, ambience was great, the staff was super great, drinks are good, but food is   commercial not  authentic. I had the Columbiana steak ehhh $26 didn't even come with rice and beans which was so disappointing, came with prissy veggies and potatoes mehhh. I give it a 4 for the spacious and pretty ambiance also for the group of 14 that was with staff was always attentive to our needs."], ["Michael H.", "Living in Spanish Harlem in NYC.  The bar that I set for most types of Latin food is quite high.  Mixto did not fail in impressing me. It was later in the evening so I opted for a few small appetizers rather than a heavy meal.  The presentation on the guacamole and plantain chips was impressive as well as delicious.  The empanadas among some of the best I've had (watch out for the sauce they serve with them, it was spicy) and the calamari amazing.  It can be very easy to over cook calamari and you end up with a rubbery texture.  This was spot on! Not chewy at all.  Job well done!"]], "Tierra Colombiana": [["Camay C.", "Let me just say, I am born and raised in the Hunting Park section of Philadelphia. I've walked past,  driven past and even shopped at the Rite Aid across the street.. Yet, I've never stepped foot into this place until recently. There are so many good things here,  I can't even type fast enough to get it all down! I arrived with my Date a little before Happy Hour. Our bartender, Sebastian was a sight for sore eyes and even better with the drinks. Jack on the rocks please! Generous pour that I'm sure was a double. Awesome! Huge bar. Spanish music playing that makes you wanna dance all night. This place easily seats 100 people comfortably. Onto the food. We ordered chicken and shrimp skewers. Fresh steamed veggies.. Everything was great. Seriously, my first time having authentic Spanish cuisine. Not sure if I want to go somewhere else. There's this cilantro hot sauce they serve with bread... This sauce is crack sauce and needs to be bottled and sold. Yum!!!  Five stars!"], ["Alonna T.", "This is my go-to latin spot. I love the food, atmosphere, drinks and all. I mean they are an agreeable price and they don't short you on anything. It's hard to say you get your monies worth in any capacity at any place. Yet here they have served up consistent service an quality product for years I have been coming here for years  just to be sure. I always  repeat several times to ensure there is no misstep and they be \"doin it\" - in my wendy  voice. Dont be a punk about the neighborhood, that's some racist stereotypical madness. Just be aware of your surroundings, park at the Rite Aide and mind your business. You will be OK, and after you leave here you will be fabulous! Have yourself an big Latina meal, a solid mixed drink then go upstairs and get your salsa on. Go ahead I know you want  to.Sincerely,The WiseWino"], ["R R.", "A staple for excellent Spanish food, period. You won't be disappointed with anything on the menu. The flavor and freshness of all your favorite traditional meals can be found here. Literally, something for everyone, including the rookies. Great portions accompanied by great prices make it more than worth it. Their desserts are also delicious so leave room if you can. The popularity of the restaurant is a double edged sword of sorts. Obviously, it's a good sign because the food is excellent. But it also means that the restaurant is usually pretty full and a bit noisy. However, it typically doesn't take long at all for the friendly staff to find you a table. Come here for a vibrant atmosphere full of delicious bites and good conversation. Always difficult to find street parking, so just head right across the street to the Rite Aid, which accommodates the restaurant clientele, no worries."], ["Rome S.", "This place is amazing.  Had to find a place close because I was getting my car worked on and found this gem. This Columbian Cuban fusion restaurant has unbelievably tasty food. Everything down to the bread they serve and just black beans were amazing.  Their empanadas are like none I've ever had and I've had empanadas in Mexico Spain and the Dominican Republic.  Their queso frito was just as good of not better as anywhere else I've ever had. Our main entrees were very good as well. I had the Cuban Roja vieja, which was a shredded beef with vegetables aping with sweet plantains and black beans. My fiance had the Columbian Arroz con Pollo, which was full of flavor for just using chicken as the meat. Great place with grest service and great prices.  Definitely will be back here on another evening so I can have a good cocktail to go along with my next meal."], ["Lisa M.", "Good food! Great prices but slow service!!! And usually jammed packed.They also bring you warm bread and water before every order."], ["Jessie H.", "Awesome authentic columbian food!!!We shared the calamari to share between 4 people- would recommend getting! Most calamari is just average but this was crispier so I would recommend it. They give a basket of buttered bread for you to snack on!I ordered the BANDEJA TÍPICATop round steak, corn meal patty, fried pork, Colombian sausage, avocado, one egg, white rice ($16.50)-If you are a meat lover GET THIS!!!! It is a lot of food though so it was perfect considering I am pretty greedy. The meat is kinda lean so not much fat. I got yellow rice and no beans inside of the white beans and beans. Def get this!!!The total came out to 22 a person..not bad at all for the amount of food you get. Most of my friends had leftovers to take home. This place is kind of deep from center city- 20-25min drive."], ["Mariella S.", "I have been here countless times and have never had anything short of amazing. The waiters are attentive, efficient, and super polite. The food is amazing.  Some of the thing I've eaten: ropa vieja,  seafood paella, calentado, mofongo. They are all just as they should be and large serving sizes therefore pricing is not bad at all. The complementary bread is one of a kind. Also the fresh squeezed juices are exactly that fresh squeezed and all fruit not diluted. The best part is they're always willing and able to accommodate our large party of atleast 11. Great food is best when shared with great people."], ["Danita R.", "Delicioso. Like, that really is all you need to know.I've ordered takeout from here that was the kind of takeout that inspires you to show up at the place because you just have to eat in there. Service is outstanding--you're greeted, seated and served nibbles almost immediately by polite and gracious staff. Bump the tortilla chips. I forgot what their li'l bread/Texas-toast-like morsels were called but they were a welcome changeup. Hot, buttery and mahvelous. Oh, and that salsa is the TRUTH. It is also hot. I warned you. You're welcome.The menu is extensive--deliciously overwhelming if you come hungry ... which you should because the portions are generous and did I mention delicious? More on that in a bit!The atmosphere is vibrant--colorful, a bit more rustic than the kitschy, common Mexican themed places so many of us are beyond used to these days. It's quite a large restaurant with even more banquet/dining space upstairs, which I presume they reserve for parties and the like. From the outside, you can't miss it. I've never been to Colombia or any other South or Latin American country, but I have been in and around North Philly. This place pops out and says \"Hola!\" to your eyes as you ride down N. 5th in the midst of all the other typical storefronts and corner stores.Y'all. Get all the sangrias. Scrumptious. Yes, I tried them all--the blanco, the riojo and the durazno (laden with plump peaches). A pitcher of one of them is a must. They also make a mean apple martini. And yes, I appreciate my beverages.I got the Happy Hour empanada special and the buffalo wings. The empanadas were crisp and delectable. The special consists of the cheese, chicken, shrimp and ground beef with potato empanadas. For my main course I ordered the Churrasco Argentino and it was grilled to perfection. I hardly needed my knife! I complimented this slab of deliciousness with yellow rice, red beans and incredibly fresh avocado. There was enough for me to take home for lunch the following day and I enjoyed it just as much as I had the night before.Our server, Anthony, was absolutely darlin' to our party of 4. They happily accommodated our request for a larger table and gave the type of service that ensured we were never thirsty or hungry. This is the sort of place that's just enough out of some folks' way that I can safely put it in my regular go-to spot and count on a bellyfull good time errytime."], ["Richard R.", "It had been a while since we last visited Tierra Columbiana, a couple of years probably.  My daughter was craving some Arroz Con Pollo and we always have fond memories of Tierra, so we made the drive up to North Philly.The neighborhood can be a little daunting for a lily-white, suburban boy like me but every time I have been to Tierra Columbiana the people on the street and the staff of the restaurant have always been remarkably polite and friendly. Happily my car has always been there when I leave the restaurant with all windows in tact. Tierra Columbiana also tolerates my rudimentary Spanish.Tierra Columbiana is surprisingly large inside and it always feels to me like I have been transported to Latin America upon entering. The place has this cool Spanish-Colonial vibe and most of the customers are from the Latin community. The menu is also massive with a great choice of Columbian, Cuban, Puerto Rican and Caribbean dishes. Everything we have had over several visits has been delicious. As I mentioned earlier, my daughter loves the Arroz Con Pollo Cubano style.  This is a tasty dish with flavorful Chicken and Rice. The portion is pretty big also; you may be bringing some home. There is something on the menu for everyone. They also have a full bar and a great selection of fruit drinks, with or without alcohol. Tierra Columbiana also has an excellent Tres Leches for dessert and their Café con Leche is fantastic. The prices are reasonable.Absence really does makes the heart grow fonder and Tierra Columbiana did not disappoint. still charming and still delicious. Looking forward to our next trip back. The table next to us had the Argentinian skirt steak and that looked and smelled fantastic.P.S. Beware of the complementary bread garlic butter bread. It is SO good it is easy to fill up on."], ["Rosita Q.", "Grate place Romantic low key ,waiters where very nice and for birthday my friend they sing with maracas and a flashing candle with the best flan ever for a birthday cake . The food was grate with the best home fried potatoes with onion , green peppers and red pepper..... Delicious"], ["Jenny C.", "Great food and good service with a nice atmosphere. I choose this restaurant whenever I'm in the mood for Spanish food which is often. I've been here about 3 times and I will definitely return."], ["Kenisha E.", "I VERY rarely give a place 5 stars. This restaurant absolutely deserves it. I think my only complaint is that my ass is too much for this bar chair. Everything about this place is amazing. I've read others complain about the area; I don't think that's a problem at all. Rite Aid allows you to park in their parking lot so no worries there. I'm pretty sure you're not allowed to be fugly & work here. EVERYONE that works here is extremely attractive. I wouldn't suggest coming here on a \"I'm feeling fat; sweatpants, hair tied, chillin' with no make up\" kinda day. I opted to sit at the spacious bar. It wraps around into a \"U\" shape. They have a gorgeous display of wines that they offer. Happy hour is 5-7. I ordered a passion fruit margarita along with chicken, steak, & shrimp pinchos. The bartender/my waitress was AMAZING. Why are you reading this instead of joining me?"], ["Natasha S.", "Cuban is the best!! The pork our so tender and the bread is toasted to perfection. They give you this hot sauce on the side that is the bomb.  I'll definitely be back to dine in since I took my food to go for the ambiance I observed while I waited for my order."], ["Dinah L.", "I hadn't been here in a few yrs. but it was a most unpleasant experience this go around. The waiter got my order incorrect & then told me what he gave me is what I ordered. I couldn't explain it in Spanish, so I had to have him give me the menu again, so I could show him. Meanwhile my date is eating I had to wait 15 minutes more to get a hot plate of food. The Sangria was so weak. Never again!"], ["Fran S.", "Have been a fan for years.  So much to love here from the arepas to the carna asada.  If you are in the mood for good, really good Latin food you can not go wrong with Tierra Colombiana.  It is even worth the parking dilemma one encounters with on street options.  Well worth the trip."], ["Ralph P.", "I really enjoyed everything from the atmosphere,  to the drinks, & food was slamming.  My server was very friendly,  one of them couldn't speak English.  But we managed... I definitely would visit again,  and reccomend to anyone on the curious side.  I know I was."], ["Eileen G.", "Wait! We were charged a tip before we were given the bill. What the hell! Who said we wanted to pay this tip and or how much for two people. What a racket. Inspect ur bill! When I questioned the manager he asked why didn't we look at the bill? We did man after u gave it to us with the gratuities already on it. I was so mad especially since the chicken with shrimp and  mozzarella  was dry as a bone! One star for decor minus one for check and waitress."], ["Jennifer J.", "Review is for our takeout order. I ordered the arroz con pollo colombiano. Very good but salty. Portion size was a little on the small side."], ["P L.", "My wife and I had one of the best meals in a long time here last night. The place was great. Nice atmosphere, friendly and attentive staff and marvelous food. We had maduro frito con queso, paella marinera and limonada, peach Sangria, bread pudding and cappuccino. Outstanding from start to finish! We will be back."], ["Steve S.", "This place has been recommended by a few people in my life for quite some time. So much so that it achieved \"bucket list\" restaurant status in my life. This past Thursday, my bucket list of restaurants got one restaurant thinner. The wife and I left the baby with a sitter and came here for lunch. I'm just going to go right into what we had. We split some empanadas, cheese, chicken, beef, and shrimp. I've had great empanadas at other Columbian restaurants in the area. These had a special taste to them. My wife and I already decided that next time we could make a meal of these alone. My Bandeja Tipica was a smorgasbord on a plate, and it defeated me. It's rare that I don't finish a plate, but believe me I gave this my best shot. Defeat never tasted so good. If you want the perfect sampling of Columbian cuisine, that's the plate for you. A sampling of my wife's Cuban Arroz con Pollo was equally satisfying. And the Tres Leches cake... Do I even need to tell you it was heaven? One of the best overall meals I've had in the city by far."]], "El Cantinflas": [["Luke D.", "Yelp directed me to this low key Puerto Rican restaurant/dive bar in my quest to find spanish food one night after 8pm. Let it be known: this is a dive bar that serves Puerto Rican food - most folks in this place are there because it's close to the el and serves cheap drinks. However, dive is almost a bit harsh of a description, as the place has clearly been renovated recently, sporting nice floors, crisp drywall, and tasteful lighting accents. Anyway, the food itself. I obviously got the mofonogo (with chicken), and found myself quite impressed - they've got it down. The plantain itself was perfectly subtle but loaded with flavor, while the chicken was moist and perfectly fried. Portions were generous, and the presentation was far above par for a bar.El Cantinflas is certainly an adventure - but unquestionably a worthwhile one.Side note: they apparently have $7 PBR buckets on the weekend."], ["Samantha F.", "Ok so I recently purchased the Groupon for two orders of tacos, two beers and an order of fried plantains.  I had never been to or heard of this place before but when I looked up the location I noticed it was less than a mile from my boyfriend's house so thought it was worth the try.  We get to the place and while it was in a not so nice looking area we were excited to try the food.  Once we entered we noticed this place was more of a bar with only about 3 or 4 small tables against the wall that were occupied.  Welp there went our dinner plans....so we asked if we could take out our food and the bartender was extremely nice and had no problem with this.  We drank our beer while we waited, and had another as the food took a little longer than we would have expected.I got the chicken and the pork taco and my BF got the steak and the shrimp.  I enjoyed my tacos with the hot sauce they included with our order but did feel that they were lacking as they only had meat, some potato (I think) and that's it.  No lettuce, tomato, etc.  The BF wasn't a fan of his tacos, the shrimp taco had those really small baby shrimps!  The plantains were delish served with this mayo ketchup sauce (that's what I believe it was).All in all we were full and spent less than $20 including tip but we wont be going back.  I bumped them from 2 stars to 3 stars because the staff (bartender) was super pleasant and helpful."], ["Mikey I.", "Walked into this corner bar with an unassuming facade down by the El in Kensington? Regardless of my ambiguous grasp on which North Philly neighborhood Cantinflas actually resides in, there's one thing I'm confident of -- delicious food. Frankly, my knowledge of Puerto Rican food is completely blank. So while I'm no expert, I can profess that the sampler I had (which contained some fried pork, chicken and quesadilla) was quite good.The owner tells me that they're looking to revamp their drink selection and continue pushing the food as a reason to visit, which I'm looking forward to. Not sure if they do takeout but that'd also be good reason to stop in."], ["Ed R.", "Good lil dive bar, food is excellent and beer is priced right.."]], "Volvér": [["Gabrielle W.", "This place is top notch.  There is nothing to be said that has not already been said.  The food was amazing and the service was impeccable.  The courses came out one right after the other..seamlessly.  I referred one of my friends here and she said the exact same thing..it wasn't a fluke accident.  They don't play at Volver!  We also found out that they have a guest bartender every so often in the bar area and they attract some serious talent.  One of guest bartenders was the owner of Hop Sing Laundromat...I wonder if he yelled at people for taking pictures?!"], ["Christine N.", "I am between 3.5 and 4 stars. The experience was great - our server explained each plate and its origins perfectly, and it was wonderful to hear how each of the plates evolved from places Garces has lived or visited. I gave it 3.5-4 stars because I felt like the majority of the plates were oversalted - particularly the pea soup. I wish it wasn't since I love pea soup, so this was a let down. The standouts for me throughout the meal: - Milk and Cereal- Snapper with apple gelee (amazing!) - Kobe beef (I was a bit full at this point, but the one slice I had melted in your mouth)Again, I thought the experience was great, but wished it was less salty overall."], ["Roy G.", "This is really the most amazing dining experience I've had.The tasting menu is constructed around experiences in Iron Chef Jose Garces's life.  We had Monterey squid with a caviar tapioca to highlight his time in Singapore; we had \"milk and cookies\" with almond milk, truffles, and chicken oysters as a reminder of his childhood, etc.  The 14 courses (!) were universally incredible and the wine pairings were both unusual and perfectly matched.  The service was the best I have experienced at a high-end restaurant.We had a drink at the bar afterwards.  While the liquor selection could be more diverse, the service was again fantastic.The meal here is comparable (and probably superior) to Manresa or the French Laundry on the west coast.  I hope the Philadelphia can support it."], ["lauren d.", "-The cocktail lounge bartender, Caitlin was very friendly and gave great recommendations for my cocktail and beer selections. Dave pushed my chair in for me and offered a personalized volver purse hook-What a great touch! -Fun and sophisticated bar atmosphere. -Prices of drinks average to other Philly lounges but the difference IS YOU WILL ALWAYS RECEIVE GREAT SERVICE! Coming back !"], ["Ryan W.", "Surprised my wife with two friends of ours for her 30th birthday. We had eaten at Vetri previously, and we were convinced that nothing could top that meal. I have to say that this might be the only restaurant that is able to do it. We did the full 12 course tasting menu with the wine pairing. From the start, the staff makes you feel like royalty. With a lead waiter, they take a team approach when bringing plates so that all guests' dishes are placed in front of you within seconds. The explanations of each dish are elegant and detailed. Ask for more details and you will get answers. As you would expect from this type of restaurant, most of the dishes have food you may have never tried (or even heard of), so I always try and ask questions. With each course we were more impressed than the last. A true experience. The wine pairing was excellent. Our Sommelier Gordana was amazing. She hand picked the selection, and was passionate and engaging when discussing the pairs.Our server was Michael. He was very impressive and engaging, developing a great rapport with our table, and listening to my corny jokes. One of the most impressive parts of the night was when we left and I received a text message from Michael telling me that I had over-tipped. Apparently the gratuity was included in the bill, and I had overlooked detail (the wine pairing had me a little tipsy). I decided to split the difference with him because i was impressed with their honesty.For anyone that loves food, and more importantly the experience of food, this is the place for you."], ["Hana C.", "Had the pre-theater tasting menu.The ticket concept for dining (where you pay online, gratuity included, and can show up at the restaurant with no wallet, simply your tickets) is not new, but I am thrilled that an amazing chef, Jose Garces, has brought this to Philadelphia, and I hope Philadelphians learn to appreciate and support this restaurant.  Not just for its ticket concept but for what Chef Garces is bringing to us: a mini expedition of his life influences (even as a child) in the culinary world in the fanciest and most fanciful way possible.The service was excellent.  The wine pairings were phenomenal.  The food was superb.  There was not a single dish that \"ehh, could have used more of this\" or was \"too much this\" or was \"not flavorful enough.\"  Every single dish was interesting, beautifully plated, flavorful, and a pure enjoyment to eat.  My only regret was not getting the performance tasting.  We had a quartet show to attend soon after dinner that did not make this possible.  I will be back.  I must be back.  And next time I am getting the performance tasting.  Get your tickets while you can."], ["L H.", "Reasonable. Some very tasty dishes, some very average dishes, fairly good service.Went here as a four top for the six-course prix fixe with my fiancee to celebrate our engagement as well as my wonderful parents, to celebrate their 40th anniversary. The restaurant called me a few days prior to our reservation to inquire about special requests or dietary restrictions. When informed of the celebrations, they made sure to take note and upon our arrival that evening we were surprised with customized menus congratulating all of us. This was a welcome, personalized touch. Our captain was polite and friendly, however despite his seemingly attentive nature we weren't offered any cocktail refreshers after our first beverage (aside from those of us who opted for the wine pairings). I particularly enjoyed two courses - the salad course featuring delicious curried raisins, duck skin, and goat cheese 'dirt' all of which together created very interesting notes and textures, followed by the live sea scallop dish with a tasty croquette in a ham broth. I thought the first course (caviar, a selection of hams including iberico, and a play on a deviled egg) was nicely plated but nothing stood out to me. Likewise, the fried squab course was extremely average - no interesting flavors or highlights to this dish, and the breading was very loose on the meat. The waygu beef was also lackluster. If the entire meal could measure up to the complexity and combination of flavors of the garden salad and scallop, I would've been far more impressed. I do think this restaurant has something unique and special to offer to the Philly dining scene. Worth trying out."], ["Russ K.", "Disappointing is my first reaction. In short, it was \"nice\", but not what you'd expect from Chef Jose Garces.  You have two options for dinner:  1) a six course tasting menu, or 2) a 12 course tasting menu.  We had the 6-course tasting menu.  CREATIVITY, PRESENTATION & ATTENTION TO DETAIL | **EXCELLENTTop notch on the creativity, presentation, and the attention to detail.  The open kitchen gives you insight into the teamwork and precision of this brigade, and they are top notch.  Plates are meticulously assembled with chop sticks, tweezers, and precision placement of various drops of sauces, micro-greens, etc.  Each plate was a work of art, and the creative combinations of sauces, foams, mouses, accent spices, dressings, etc. were well done - each meticulously placed on the plate.FOOD TASTE | **GOODI would place this in the \"good\" category.  Some items were just OK, meaning I was not overwhelmed with a \"wow\", but out of the 6-course item, I'd say 2 were like that.  The rest were nice, good to pretty good, but not \"wow\".  The flavor profiles of the dishes were very good in and of themselves, in the sense that there was a great mix of textures, good use of fresh ingredients, and creative seasonings when items were pre-combined on the plate.  There were several plates where there were droplets of various sauces or accent items.  Overall, I expected more pop, more \"holy crap this was the best thing I ever tasted\" type of experience, and I unfortunately didn't have that at all.FOOD PORTIONS | **POORI don't mean to be harsh or seem ill informed on the notion that this is a tasting menu, however the portions were incredibly small - too small.  No one was looking to \"fill up\" on any single dish, but there was just not enough on each plate to satisfy your palette or your hunger.  For example, we were served a sashimi course with 2 slices of sashimi placed in a mouse-like horseradish sauce.  The amount of fish was a normal slice of sashimi that you would get at a sushi restaurant but cut in half - that's it.  Another example was a piece of filet mignon that was grilled, but the piece was a little over 1\" by 1\" in size, sliced from a larger piece - in essence, one filet was split amongst our entire table of 6 diners.  Lastly, we had deep fried squab, two small nugget sized pieces about the size of a large marble.  What is missing here are two items, 1) in order for the diner to appreciate the flavors and textures of the food, it's difficult to get that in two bites.  So while the squab or sashimi was good, it was hard to experience the food because after two bites it was gone.  2) I was actually hungry still and when dessert began to be served, I was still hoping for another couple of dishes.  One more \"bite\" per plate would have gone a long way I believe in not only enhancing the food taste rating, but the satisfaction of the guests.SERVICE | **EXCELLENTThe service and staff are top notch.  Very attentive but not disruptive, they keep pace with the pace of your party, they are considerate of various dietary restrictions (we had a couple of vegetarians in our group of 6), and the know the menu very well.DRINKS | **EXCELLENTIf you are into wines, cocktails, etc. they have an excellent selection for both.  Top notch wines and a wine pairing option with your dinner.  Cocktails are unique and very well done.  ------------------------------------SUMMARY - OK------------------------------------A well executed \"downtown experience\" with an up-scale, european ambiance, excellent service, and well presented and creative dishes.  Where Volver misses the mark is in the execution of the food itself, from the portion sizes being one to two bites shy of expectations and the flavors, although well done, don't overwhelm the guest with wanting more."], ["Daniel W.", "Jose Garces set out to make every course \"experiential\" and in that sense I will use broad strokes, so as to not reveal elements that one should experience for themselves. My thought is that other yelpers should include spoiler alerts, like any critic would do for a film, book, or \"theater\" show ;) We did the 8-course pre-theater tasting menu on a Wednesday. You can tell that the price was a considered decision when you start to research other tasting menu price points throughout the city. The 12 course is another story and another review.The design of the dining room lends itself to excellent service. Expo could have practically turned around and placed the amuse-bouche on our table to start off the evening. You wouldn't even know the kitchen was there. Silent artists. Your every action is being considered by the FOH.*Spolier Alert* Volver is truly an exceptional experience and meeting Jose Garces didn't hurt either, mind you it was a 5:30 reservation on a Wednesday; not prime time dining, yet he was there. Even if he wasn't there, it wouldn't have detracted from the experience, it only added to it."], ["Mandy D.", "I came here on what I thought was just a fabulous night out in our neighborhood with my then boyfriend a couple of weeks ago. It turns out it was more than just your average night out for many reasons. We bought tickets a couple of weeks in advance for the pre-theatre seating, which includes 7 courses of meals, and we also opted for the wine pairings. I won't give away all of the amazing, inventive plates that chef Jose Garces has put together for this experience, but I will agree with some of the other reviewers who have said that the milk and cereal was so surprisingly incredible. It was definitely my favorite dish. The food was like art. Every placement on the dish was precise and calculated and was there for a reason. It was incredible. The service was superb as well. Our captain and our server worked seamlessly with bringing and removing plates and the sommelier was extremely helpful with explaining all of the choices that went with every course. I will admit that I was a little skeptical of this new fine dining \"experience\", but for a fancy night out, Volvér is a great place to take someone you want to impress. I found out later that night, after my boyfriend proposed nearby in Rittenhouse park, that the restaurant was extremely helpful in keeping things moving along as he had a specific timeframe to get out of there, packaging up our petit fours to go while I was in the bathroom because it was 7:00 on the dot, even though he didn't propose at the restaurant. I thought that was a nice extra touch too."], ["Amanda Q.", "Sure, I'll write the first review of the tasting menu. :PFiancé and I booked tickets to Volvér for the Sunday after its opening. This happened to be Easter Sunday, and that fact in conjunction with the adolescence of the restaurant contributed to us being one of three tables dining there that evening. We opted for the Performance Tasting: $175 per person, plus tax and gratuity paid prior to our arrival in our ticket price (I believe it was ~$450 total for the two of us). Drinks were surveyed and purchased at dinner and paid for at the end of the meal.First thing you'll notice is the space is quite beautiful. No stuffy white on white on white - the design and color palette you see on the website translates to the space inside Volvér; calming shades of dark blue/grey and silver with hints of white. The space is dark in that sense but not unwell lit. You'll first walk past the bar/lounge area, then enter the dining space. The open kitchen amounts to almost half of the space: it's a rectangular setup with an inner island. Here you can watch the staff as they prepare, cook, and plate your meal. The kitchen is quiet, portraying a discipline expected of a restaurant serving food of this caliber (read: price). The rest of the space displays a spacious 34-seat floor plan, with full floor-to-ceiling window panels spanning the length of the room opposite the kitchen. We were seated at a two-top next to the glass windows, where I could people-watch on my left and kitchen-watch on my right. My coat was hung, and when I was about to put my purse on the floor, our waiter, Geoffrey, came by with a Volvér branded purse hook to hang off of our table. How cute.Drink list was offered via iPad. Waiter had great suggestions on cocktails dependent on our base liquor of choice, and drinks were offered at weaker/stronger mixes if we felt they hadn't come out to our liking. I had the Sugar Snap (it tasted like the BluePrint pineapple mint juice with a hint of vodka, which I suppose is neither a good nor bad thing), and my fiancé had the Basil Chile Smash (he approved) and the Bancock Gibson (a little strong for me, but he enjoyed). I opted to have a single glass of wine to be served during the heavier portion of my meal, and requested the waiter simply recommend and serve as he found appropriate (we went for a medium-bodied French Pinot Noir). Cocktails were $12 each and my glass of wine was $20. Weren't incredibly impressed with the drinks, but weren't unhappy with them either. However, I do expect something with more wow-factor at that price.The Performance tasting menu, originally publicized as 12 courses, was presented to us as 14. My shellfish allergy was taken care of with no problem (ok I lied, my throat itched just a bit during/after the squid dish which originally had some kind of shellfish foam, but it was so minor I didn't need to say anything). Plates were set down in synchronization and our waiter told Garces' story and concept behind each dish. Standouts include the Milk and Cereal (very well thought out and wonderfully executed. My favorite of the night), the KFS (a play on KFC, my fiancé's favorite), and the deconstructed carrot cake, with a presentation eerily similar to Grant Achatz's end dessert at Alinea (instead of the plastic table cloth with the ball of white chocolate and goodies dropped and shattered into a million delectable pieces, the carrot cake components came on a wooden board encompassing the entire table, with a coconut mousse in the middle, smashed open by our waiter. Similar effect, similar share-able presentation). Did not find myself disappointed in any one dish, though was incredibly full (it started with the Petit Pois, which while deliciously smothered in butter, was too large a portion of something that tastes the same in each bite). Couldn't even finish the end of the savory courses (fish and beef), despite both being very good.At the end of our meal we received a printed copy of the tasting menu signed by Chef de Cuisine Natalie Maronski. We left full and tipsy, walked up 15th street back to our condo, and found out we were fortunate to have mentioned to our waiter where we lived since it was so close to the restaurant: 3 blocks into our walk home, Geoffrey tapped my fiancé on the shoulder, having run after us in his full suit and tie in the cold weather, my fiancé's forgotten credit card in hand. Service was at its best, during and after the meal.Overall, we're pleased that Garces has ventured into such a high level of dining for the Philadelphia scene. Not entirely sure the target market in the greater area is large enough to sustain the restaurant and its business model, but time will tell. If I had friends visiting from NYC and I wanted to impress them, I'd happily take them to Volvér (though the lack of flexibility in changing tickets would make it a bit stressful). Great ambiance, acceptable drinks, pretty good to amazing food, and fantastic service. 4/5 would recommend."], ["Steve W.", "Went to the bar at Volver last night and was blown away by the experience. The sophisticated atmosphere could only by topped by the superb drinks that Scott had artfully prepared. The truffle rush, basil chili smash and the sugar snap were all unique and complexion in their flavors. The wagyu tartine made me want to come back and try the dinner menu. Bravo!"], ["Blair E.", "Off the charts good. Service was incredibly polished and attentive without being overbearing. Every dish was executed perfectly and the fact that the pairing incorporated champagne, sake, wine (then champagne again), was outstanding. Higlights Included:-Tsukiji Market Fish (hiramasa in our case). Delicate fish, cold green apple \"snow\", horseradish cream. Spectacular-Milk & Cereal Dish-Beef On Embers-Elderflower Panna Cotta (wife said it was the best dessert she ever had)Will return. Incredible experience."], ["Ronnie J.", "I was just at Volver for their Wednesday drinks and snacks and will never return. The service was unacceptable. Our server did not return to our table for an hour. We tried to order snacks from another server but they never arrived."], ["L K.", "This is a review of the bar only. Beautiful space...large bar with lots of different types of seating. Drink menu is extensive, with a large selection of wines, champagnes, beers and specialty cocktails. Got some snacks, the triple cream cheese and the iberico ham. The cheese slice was surprisingly large for such a high end place, which was much appreciated! The ham came thinly sliced on 4 pieces of focaccia. Both delicious. At the end they rolled over a desert cart (!!!) covered with amazing pieces of chocolates and other small house baked goods. Garces was in house, walking around and greeting everyone. Service was outstanding, can't wait to come back for dinner (which my parents had just had and said was amazing)- well done Garces !!!"]], "Freddy & Tony's Restaurant": [], "El Coqui Panaderia": [], "Paloma": [["Sharon J.", "We were a party of six, and everyone loved it.  The corn chowder is superb as is the paiche.  If you like duck, don't miss it.  It is perfectly cooked and so delicious.  The service was as good as it gets.  We were there for a long time and we never felt like they wanted us to leave.  We will definitely be back!  Thanks, Paloma, for a great meal."], ["Mark G.", "I attended a celebratory dinner last night at Paloma with my wife and 3 other couples. I read the menus before going and thought it looked interesting and was encouraged by the many positive reviews I read beforehand. What I found was a one of the best dining experiences I've had in a long time. Starting with Pablano with caviar soup it offered the perfect combination of spice , heat and creaminess. My entree was a veal chop with red wine reduction that was fantastic. My wife had fillet of brazen with a habanero Chardonnay sauce that was as good as it sounds unique. The entire menu just as interesting and the service was as good as the food.  We will absolutely return and if you are looking to break out from your normal dining routine this is a great way to do it."], ["Ky T.", "The food here is great.  Didn't understand why it was so empty.  The crab ceviche was excellent.  The crab cake was also very good, huge lumps of crab.  Sorbets were wonderful too.I thought the best item on the menu here was the orange chocolate ganache cake.  Would definitely come back just for the cake.Service was a little slow.  It looked like there were just 2 employees running the whole restaurant."], ["Alex V.", "I'm really shocked that Paloma doesn't have more reviews. The place had a decent amount of press when it opened, and I believe the chef is nominated for a James Beard award. The dinner we had Paloma was excellent. All the dishes we had were extremely fresh and the presentation was amazing. Every dish looked like a piece of art when it came out of the kitchen. Unfortunately, the dim lighting prevented me from taking pictures. I highly recommend saving room for desert. The cheesecake and sorbet were both great."], ["Jenn V.", "I wish I could say this place blew me away... and I really wanted to be impressed by it- but it just wasn't there. Maybe we went on an off night...but we probably won't be back to figure that out. We arrived to a relatively empty restaurant on a Friday night at 7pm- unusual but not too odd for Philadelphia during the summer. Our first server was really soft spoken- made him difficult to understand and made us feel kind of awkward straining to hear him and asking him to repeat himself. A new waiter came over a few minutes later and was a big improvement. I normally don't rave about the bread and butter places give you- but wow. They start you with a bread basket with this amazing sour cream \"butter\" (although no butter in it) - slight kick to it but soo good. Next we the crab avocado appetizer and the Tortilla Soup- the soup was probably one of two highlights of the night. It was absolutely delicious and we soaked up the remainder with the bread. The crab and avocado appetizer was okay- i think the presentation of it was better than the flavors of it. We both found it to be somewhat bland. For entrees I got the crab cake wrapped in phyllo dough and don't get me wrong- it was really good. But I also think that crab cakes aren't too difficult to mess up (especially when paying $25 for it)- and I tend to like anything that is wrapped in Phyllo dough. The carrott-curry sauce definitely added to this good dish- it was a unique flavor that I never would have thought it went so well with crab. My boyfriend got the duck. It was incredibly dry and if they didn't serve enough of the red wine reduction with it- it would've been difficult to choke down. Have definitely had better for a similar price at other Philly establishments. We finished the meal with the trio of sorbets and the cheesecake. We both thought the cheesecake was amazing - actually crave-able. Very dense with great flavor. The sorbet was different - we got the strawberry-habernero, the mole, and a third flavor that i can't remember. The strawberry-habernero had some real heat to it- which was an odd surprise for a cold dish. I didn't find the prices to be as bad as other reviewers had mentioned (total bill for 2 appetizers, 2 entrees, and 2 desserts was about $90) and was on par with some Top Quality BYO's in Philly- except for the fact we didn't think the quality of the food was on par with those Top Quality BYOs..."], ["Craig D.", "(4.5) ~ This is a Hidden Gem!OUR MENU:* Corn Chowder w. Shrimp ~ (4.5) Very Good ~ Ask for a side of their Homemade Hot Sauce for an added kick!;-)* Filet Mignon ~ Wow ~ (5) Excellent! ~ Perfect Flavor & Texture!* Layered Cake w. Buttercream ~ (5) Excellent!* \"Mexican\" Chocolate Mousse ~ (5) Excellent!* Coffee ~ (3.5) goodPARKING ~ About a block away ~ Ralph's Italian Restaurant (on 760 S. 9th St.) allows Paloma's customers to use their Valet Parking ($8) for Friday & Saturday.  You need to go to Ralph's to use it. -OR-  If you can get there (15-20 min.) before your reservation you could try and find a spot on a nearby street., but it's like sardines;-)lol"], ["Decoda H.", "Absolutely a wonderful experience ...wonderful infusion of flavors...wonderful owners....it is a must go to restaurant ."], ["Rob S.", "Cuisine. Seriously, they don't serve food at Paloma. They serve cuisine. Every fiber of every dish placed in front of me was a gift. The soup du jour was a squash soup with shrimp. Loaded with shrimp. Incredible. BYOB, BTW. Oh yeah, the waiter, who I would prefer to call a gentleman rather than waiter, gently pressed me to order a salad that sounded particularly boring read from the menu. However, I was astonished by the flavor of salad dressing at the ingredients chosen for the salad. I mean it was a really good salad. I had a pork loin as my main course, and my wife had crab meat baked in phyllo dough. TV food critics are always talking about \"presentation\". If you want to eat somewhere where you can talk about presentation, and go to Paloma. To quote the gentleman mentioned above, \"parking can be a challenge\". It's worth the challenge.I do agree with the other reviewers, it's a surprise to spend this much in a BYOB, but worth it.I'm not sure, but I think they actually bake their own bread for the table. What we asked for more bread, I was surprised it took so long, but when it arrived, it was obvious."], ["Shannon G.", "Menu sounds incredible.  I was pretty psyched to go here.  I hadn't eaten good Mexican in a long time.  Atmosphere is pretty typical of a small upscale restaurant, not bad.  Service was extremely attentive and they did a good job conveying the menu.I got the mushroom flan everybody is raving about.  I love mushrooms, and it was interesting to see it presented differently.  There wasn't really much depth to the flavor though, just kind of seemed like pureed mushrooms and cream mix shaped to resemble flan.  It was good but begged for a little something else to be added.  Wife had the Poblano-Smoked Salmon Terrine, which she thought didn't have enough poblano in the layering.  They brought habanero sauce out for her which she said made the dish much better. Entrees were inexplicably mild / boring.  My sole, as a fish, was well cooked and good.  The serrano-vanilla sauce was about as hot as Anna Verna.  Wife had the same comment about her fish dish.  What gives?  Both dishes were pretty bland.  A friend had the rabbit tenderloin, which after trying a bite was easily the best dish at the table.  Surprisingly not gamey (this was my first encounter with food rabbits) and good flavor on the sauce.Dessert was good, we ordered two of the layer cakes and they did not disappoint.  I had the chocolate-orange and it was rich and delicious.Overall pretty seriously disappointed.  Good presentation, good dessert, and being a BYOB helped them out a bit."], ["Barrett L.", "The BF and I came here last night using a gift card from Rue La La.  I didn't do too much research ahead of time except that I knew that Paloma is BYO and that you can bring your own tequila for Margaritas.  I expected it to be kind of fun, hip, younger, etc.., but instead I felt like I was eating dinner at an older relative's house.  On the whole, the food is very good, but there was nothing that truly made me want to return for a second visit.First, I'll agree with the other reviewer here who mentioned that the decor needs a serious upgrade: it's dated and stodgy.  The service was also a bit slow in the beginning (at least to take our order), but after that, the food came out at the perfect pace: not too fast, and not too slow either.  To start, we split the crab ceviche and the mushroom flan.  The former was our favorite of the two: you actually get a decent amount of jumbo lump crab meat on top of thick tomato and avocado slices.  The mushroom flan was interesting, but wasn't really something we would want to eat again.For dinner, I ordered the filet mignon while he ordered the duck.  I thought my filet was actually pretty good and cooked really well, especially with the red wine reduction and mushrooms.  Plus, the sides were pretty tasty (very buttery mashed potatoes, crispy potato slices, and sauteed spinach).  The duck, on the other hand, while aided by the addition of smoky bacon, didn't really stand up as well.  The BF lamented how the duck could have been more tender.Finally, the desserts were terrific.  I had the kaluha cheesecake which was served with a mexican dark chocolate crust (excellent, especially since the crust contained hints of cinnamon that elevated the cake to a whole new level).  As for the trio of sorbets and gelatos, I wasn't as impressed.  Much to the BF's disappointment, I couldn't get into the concept of a spicy sorbet (the strawberry-habanero sorbet, to be exact), and found the heat to be too overpowering for dessert.So while the food was actually really good, my main problems are with the concept, decor, and pricing.  It's a little too expensive for food that's just good and nothing that is going to want me coming back for more.  Aside from the cheesecake (which is apparently made in house), you could easily get any of the other dishes at any other restaurant in Philly, and probably at the same if not better quality.  Also, I don't understand why the restaurant advertises itself as \"haute mexican\".  It's really more of a European fusion concept, and aside from some nods to Mexican/Latin American cuisine (ceviche, horchata ice cream, blue corn gelato), there is little evidence that you're actually at a Mexican restaurant.  And finally, if not for the gift card, this definitely would have been much more of a splurge than a simple dinner out.  Overall, good food, but the atmosphere, menu, and concept need to be improved to match the quality of the cuisine."], ["Candice E.", "This is a review of the new Paloma location on south 8th Street.  I was excited to try this new restaurant in my neighborhood, but I doubt I will return.  The food was overwrought, not very tasty and wildly overpriced.Entrees range from about $28 to $35.  Appetizers are $9 to $15 or so.  We had two appetizers, two entrees, and our bill was $85.Our first appetizer was the mushroom flan, which was the best item we had.  It was interesting and flavorful.  Unfortunately, it was all downhill from there.  Next came the Caesar salad, which was presented as a bunch of romaine lettuce stalks arranged vertically on a plate with a crouton shaped like a napkin ring holding them together.  It needed to be knocked over before it could be eaten.  It tasted ok, but the presentation was just bizarre.My entree was the crabcake, which was $30.  It was totally overpriced and unexceptional.  It was also presented vertically -- crabcake on top of mashed potatoes on top of spinach in one odd pile.  My husband had a bronzino, which was $28 and slightly overcooked.Overall, it felt like the restaurant was trying very hard to be a formal, fancy restaurant.  For instance, our server scraped our table for crumbs.  But, in reality, it is a BYOB in Bella Vista.  If this place wants to make it, I think it should reimagine itself as a casual neighborhood restaurant with lower prices and more straightforward food and presentation.  I doubt it is going to survive serving mediocre $30 entrees."], ["Herb L.", "All really good food.  Service top notch."], ["Newport L.", "Being your own tequila! Fantastic food and service! Atmosphere appears to have been spruced recently... lOVE the chilled soups."], ["Leslie M.", "I've had the pleasure of dining at Paloma twice now.  Both times, I came with a group and we were lucky enough to have the Chef agree to do a tasting menu with us.  We were served 5 courses and dessert. The cold soups were creamy with a nice heat from an array of peppers.  I love the Chef's use of smoked salmon in the soups.  The appetizers are always a nice portion, but not filling enough to spoil the rest of the meal.  Both times, we were given a seafood course and two meat courses ranging from boar and duck to beef and veal. The meals are all cooked to perfection, but the sauces are the highlight.  The chef is truly talented and makes such a beautiful and delicious plate of food.  By the end of the menu, we were stuffed, but thankfully we saved room for dessert.  The Chef's wife makes gelato and sorbet to die for.  Unique flavors such as Horchata and Dragonfruit.  You MUST try the Strawberry Habanero.  It is such an odd experience to taste the cold, sweetness of strawberry and have it followed so quickly with the heat of the habanero.  All of this food (and it is A LOT) for only $65 a person.  The experience is made complete by the service.  The servers are professional and attentive.  Being a veteran of the service industry myself, I can safely say, these guys are pro's.  The chef has come out both times to personally thank us for our patronage, and his wife is usually managing the FOH.  She's a delightful woman who has a clear love for what she does.  Ask her about her desserts and you will definitely learn a lot.  The restaurant is also BYOB, so bring your friends and your wine for a great night out with great food.  I can not wait to return."], ["Steve P.", "Very interesting and ambitious menu. Kind of French/Mexican fusion. Forget tacos, etc., this is very sophisticated, well seasoned food. The desserts are homemade. All excellent, ranging from several delicious cakes to flavorful sorbets, one of which (habenero included) can take your head off."], ["Amy G.", "Food was amazing, service was excellent.  The chef came around and shook hands with all the diners and our checked coats were brought to our table when we stood to leave without having to ask.  The only negative was the parking situation.  You pretty much have to valet or get lucky finding a spot on the street and we waited on valet for some time before he showed up to park us.  Still would definitely go back!"], ["Tamara B.", "Great neighborhood locale, parking is an issue if you are driving in to Philadelphia.  Nothing in the decor suggests high end Mexican, and only small clues in the menu.  Group meet for an early dinner, the appetizers ordered were the standard salads and some soup.  Salad was tasty, not overly dressed and enough to share.  Another diner had the Mexican tortilla soup with crab and said it was delicious.  The warm bread with sour cream \"butter\" was marvelous and the hot sauce they brought out to taste was super spicy in a good way.  The service seemed spliced together - our waitress explained the menu and took our orders then food brought out by different people that offered pepper and filled water glasses and we never saw her again.  My branzino special was interesting - more like a gefilte fish - deboned and in a an excellent curry coconut sauce, with vegetables and rice.  Husband's crab cake in pastry was moist and flavorful, the pastry was gummy on the bottom because it was on top of the rice.  Wish we could have stayed for dessert - the items sounded wonderful!  BYOB - would good again, with more time."], ["Leah G.", "Is it a little more than I want to spend at a BYO . . . yes.  Was my crab avocado appetizer delectable . . . yes.  Was my server the nicest server in the world . . . also yes.We enjoyed a lovely diner at Paloma . . . it was quiet on a Wednesday night and the space felt a little big to me (i prefer cozy) but we will definitely go again."], ["Floss L.", "Floss L. 7/5/2013   love this place. three of us had corn soup and crab ceviche (to die for) as appetizers. Two in family had fish which they said was excellent and I had the poached shrimp in pastry shell which was done to perfection. It was my husband's birthday and the two owners came out to give congratulations.  Our waiter Daniel couldn't have been more helpful and pleasant. Desserts for two were the homemade sorbets including the hot ones. I chose a delicious pound cake with blueberries. There is not one thing you can find wrong with Paloma. I just wish it wasn't so far from where I live (it's in south Philly and I live in the far northeast) or I would go more often. It's really a special place. They make you feel really welcome and the food is superb.Do yourself  a favor - next time you have a special occasion - celebrate at Paloma."], ["K Z.", "Went for my birthday and was not disappointed. First, it's byo. Doing a quick search of byos in Philly this restaurant does not appear. I read on another review it was byo, and I called to make sure.  The entire dining experience was incredible.  Pleasant friendly staff who were very attentive and even made us margaritas with the tequila we brought. The food was exceptional - brazino, crabcake, corn chowder, asparagus ceasar salad, and the Mexican brownie... Delish!  We will be back!"]], "Iztaccihuatl": [["Kristina C.", "Review for my GRUBHUB order.. which is AWESOME! So based on other GrubHub reviews, I waiting until my 2nd order to write this. Each order was FAST and still WARM and being a rather experienced Grubber....Warm is GREAT (keep in mind they have to cook it and deliver it).I always get the steak taco's and you get 3 GIGANTIC and totally filled with steak taco's. They are so amazing. We also get the chips and guac which comes with a couple yummp hot sauces, and they give you a REALLY LARGE portion of guac too! My husband gets the steak platter with shrimp, jalapenos, and cactus and he devours it! His words are, EXCELLENT to describe it. So if you are looking for mexican, this is the only place that I will order from...good grubbing!! And I can't wait to go in person and try this place out...YUMMY!"], ["Phil H.", "Nachos. Nachos. Nachos. Good lord the nachos.I can't say enough great things about this place (and the nachos). Both times I've been have been during restaurant week in Center City so the place was pretty empty. Apparently it gets pretty busy during the week and it's not rare that the place will be filled with merriment and cheer when 90% of it is reserved for a big party. The waiter was attentive and twice has suggested some spot on delicious meals. He even let us choose the Pandora station to listen to!The food is incredible and it is very inexpensive. Second time I went everyone raved about their meal and their drinks (we brought tequila and they had the margarita mix ready for us). I had a the seafood soup and went for the optional pasta instead of the soup. The plate was bigger than my head and was brimming with deliciousness. I took it home and it fed me for 2 more meals! For 6 people the bill was just over $100 and this was after the nachos (remember me raving about that?), guac, and meals that could feed twice as many of us. Be warned it's a BYOB but they are more than happy to pour it for you. Believe me...*more* than happy. This is definitely a date night restaurant. Don't worry if neither of you speak Spanish -- the waiter is Italian and speaks English (ask him to tell you the story of how he got the job!) so that's not a problem. He does speak some Spanish from working there for a while so that isn't lost.All around a really great place to have a delicious meal and a laugh."], ["Nina S.", "This is a great authentic Mexican restaurant! It is BYOB so don't forget to bring a bottle  to enjoy with your meal. The food is so delicious and very affordable! I had the Pastor Pork Tacos and I think they are my favorite pork tacos I have ever had. The order comes with 3 full sized tacos served on corn tortillas topped with cilantro and onions. They only cost $5.95! That is a steal!"], ["Christina G.", "I was here on Saturday night with Nina S and Sarah F. I can't believe I haven't been here sooner. Service was excellent. Food was delicious. I split the chicken fajitas and pastor pork tacos with my friend. Both portions were very big and we had left overs. Food is authentic. The pork tacos came with 3 tacos with a generous amount of pork in each taco topped with cilantro and onions for only $6. The fajitas were a nice size portion of chicken, bell peppers and onions with tortillas on the side. They also give complimentary chips and salsa. One of the salsas was very spicy. I hear you can get an even spicier salsa from the back upon request but I don't know if I dare. Our waiter was awesome.BYOB. They were fine with us bringing in both wine and vodka for our table. I don't think you can find better Mexican for the price.It is a nice size restaurant and there were plenty of tables on a Saturday night since most of their orders are delivery so this would be a good spot for a group."], ["Retset Y.", "I order from Iztaccihuatl at least once a week. I'm not exaggerating. I love this place. The Hongo Relleno is so delicious and their Carne Asada + Cesina platter can easily feed a family of four. Try everything. A++++"], ["Jeff F.", "I don't always eat burritos, but when I do, It's Iztaccihuati. This place is fantastic! Authentic cuisine and even spanish soda all of it delicious. I ordered the burrito al pastor (marinated pork with a pineapple, mmmmmmm) and let me tell you, this was the best burrito I've ever had in my life! great wrapping and balance of ingredients with the perfect amount of spice (not too much! JUST RIGHT). Too cap it all off, the service was great right down to the speedy delivery. I will be returning."], ["Jaron O.", "Here are my bullet points I think might be helpful:1) If you go on a weekend, it's likely to be crazy loud, because apparently they have a good deal for private parties, sort of a Chuck e Cheese vibe. Regardless of noise though, it's a big open space that's completely fluorescent lit, with seemingly little to no effort in decor, and tables set with red plastic cups advertising a methadone clinic. Maybe that stuff doesn't bother you, just saying it's not exactly a great date spot.2) Our food didn't taste good- overall was pretty bland."], ["Andrea V.", "This place offers sizable portions of very fresh Mexican cuisine.  It's open late and offers quick, no frills delivery at reasonable prices.  There are plenty of places hoping to compete in South Philadelphia, but only one or two are really in the same league, I've found.  My only complaint is that the guac is not as flavorful as I'd like.  I prefer a potent guac and theirs is more about the mild flavor of the aguacate.  However, their pico de gallo and salsas definitely make up for that.  Long story short, if I'm jonesing for tacos, this is probably where you'll find me."], ["Alex R.", "I've ordered from this spot a handful of times over the past couple years. I love how they pack the food, everything is tied up tight and secured, and there's never any spillage or unnecessary food mixing. They always include plenty of house made salsa, which is fresh and delicious. There's the orangey-red hot salsa, and the milder thick/green tomatillo salsa. I've tried a variety of flavors, usually from the Taco and Burrito sections of the menu. I unfortunately cannot offer much advice to vegetarians, as most of my menu choices involve meat. However, I can tell vegetarians that the guacamole is super fresh, well portioned, and the house made corn tortilla chips are fresh and usually arrive to my SW CC home warm.As a repeat Mexican food offender, I can offer a few of my favorite dishes from this taqueria. The Mexican sausage/beef tacos are delicious, as are the Al Pastor tacos. The taco platters come fresh with sliced radish, slices of lime, and two corn tortillas per taco (3 tacos per order). I also have enjoyed burritos of the same variety. I can say as a man who enjoys marinated meat and Mexican food in particular, those two flavors are delicious and sure to give you your money's worth. The burritos are large, and absolutely enough for a satisfying meal (unless you're like me in which case you'd prefer a burrito and an order of tacos). The burrito comes with pintos, rice, shredded lettuce, sour cream and pico de gallo packed in with your choice of meat/vegetable. The tortilla used for the burrito is fresh and chewier than it is crunchy (when I sampled burritos along the Mission in San Francisco tortillas were sometimes fried or made crispy before wrapping). Also, try a Jarritos Mexican soda alongside the food. A beer would work just as well."], ["Ari N.", "Just received a bistec (steak) burrito and tinga de pollo quesadilla from Iztaccihuatl, which I ordered via seamless tonight. First thoughts: it's just about midnight so I'm managing expectations.The steak burrito isn't \"bad\" but there wasn't an easy way to customize the ingredients. Not a fan of onions. Aside from that, it's a basic burrito, nothing special.The quesadilla tortilla on all three pieces was so stale and hard, it was arguably no longer edible. They used some type of cheese that resembles an abbazabba with shredded chicken. Essentially this choice sucked, I wouldn't order from this place ever again based on the lack of a quality control I witnessed tonight.I'm writing this review at approximately 12:18am the same night, in case I die of food poisoning in the night. Shame on you, Iztaccihuatl. God have mercy on my bowels."], ["Jeanne P.", "Very good! My bf from AZ swears this is closest thing to true Mexican he can find. Delivery takes a while, but worth it."], ["Brad P.", "Iztaccihuatl delivers.The food is fine."], ["Tess Y.", "I just ordered the fajitas mixtas with extra shrimp from them and it was really disappointing. It wasn't very flavorful, the meat was dry, and \"extra shrimp\" ($3) got me one extra shrimp. I can't speak to the tortillas or the rice and beans since I can't eat 'em, but I wish I had spent my $16 elsewhere."], ["Elliott C.", "Had dinner there with 2 friends on 4/1. Service and food were outstanding. We started with tacos and beef - best tacos that we've ever had!  The list of entrees is amazing - we couldn't decide. I had one of the specials: large corn taco covered with refried beans, pastor pork, cactus, lettuce, cheese, etc.  Awesome dish and too much to finish!  We shared their home made tiramisu which was also outstanding. The restaurant is a BYO which we like as well. Total cost per person including tip was $20.  Definitely going back."], ["Maria C.", "I didn't like the chips, they were stale, and the shrimp coctel wasn't tasty at all, because they used frozen cooked small shrimp with no flavor in them at all. I was expecting much more from them, because the menu sounds great."], ["Paige C.", "I have never been so happy to find good Mexican food in this city. What makes this place all the better is that they deliver...YAY!  Used GrubHub to get some delicious dinner and it was here within 45 minutes. If you know Philadelphia you know delivery under an hour, on a weekend, during dinner time, is almost unheard of. Plus the delivery guy called me senorita when I greeted him at the door...Bonus Points! The chicken enchiladas with red sauce were the perfect amount of heat and the corn tortillas just soaked up all the deliciousness. The hubs had the burrito pastor and it was a MEGA sized burrito filled with yummy yummy goodness. The only star they lose is for the guacamole. While the serving size is huge and it's served with a healthy amount of fresh made tortilla chips, I thought it was just slightly lacking in flavor. I like a more complex tasting guac, this was a little creamy and flat. I added some fresh sea salt and that seemed to help. All in all this was some great mexican, and it makes it all the more better that I can enjoy it from my couch!"], ["Danny B.", "I have been on a Mexican food pilgrimage as of late, and I learned about Iztaccihuatl from Philadelphia Midtown Lunch (which, by the way, you should bookmark if you truly love good food).Now, because I had just eaten at this place, my stomach is getting in the way of my ability to type and think coherently, so let me summarize my thoughts:1.) Bistec Fiesta Ozolco Platter: If you need to have variety in your life, I recommend this meal wholeheartedly. You get a parade of grilled beef, chicken, and pork in addition to a chile relleno (fried pepper with stuffed cheese), extra cheese, rice, guacamole, beans, and salsa.  Price? $13 dollars. Not bad at all, and arguably you can eat this with someone else. But really, why do that? Eat the whole thing yourself. 2.) Tacos de Carne Enchilada: I have not seen tacos stuffed to the brim like ones here at Iztaccihuatl. Sort of reminded me of Korean marinated spicy pork, but you get to add salsas, cilantro, onions, and lime on top. Price? $6. Okay, now that is a deal. Seriously, the pictures don't lie-- they are hefty.Overall, I had to give this place 5 stars. Very nice people, and the food hit the spot."], ["Sarah F.", "As Christina G and Nina S have yelped, we were all here Saturday night. I didn't partake in the pork tacos or chicken fajitas, but I had my shrimp fajitas and loved them. So much, in fact, that I took the boyfriend back tonight and ordered the same thing.Unlike Christina, he was brave enough to try the super spicy sauce from the back. He was sweaty from it. We took tequila with us this time, and tried two different margarita mixes. The first: cherry, orange, and lime blend tasted like fresh squeezed juices and was just sweet enough. The latter, pomegranate, was great initially, but a bit too sweet after a glass or so.Because my boyfriend is obsessed with tres leches, he order that for dessert, and it was the best I've ever tried, I think. He also ordered a Mexican Coffee and enjoyed it.This isn't a fancy joint, but the food is yummy and it can fit you and all your friends at once."], ["Panharee T.", "I love this place so much! It is byob AND they don't charge anything to make margaritas for you. Food is BANGIN' and the server is very friendly. I don't have a single negative thing to say about this place :)"], ["Liz F.", "I am a regular takeout customer of this place. The food is always fresh, filling, and delivered on time. As a vegetarian, I usually get the vegetarian enchiladas with green or red sauce (both good) or the sopes. Both are great. It's also a lot of food for a good price. My favorite part is probably the side of red spicy sauce that comes with every meal!"]], "Bar Ferdinand": [["Ben H.", "Have been to this place multiple times now and never once been disappointed. It's a little more expensive than some other places in the area but worth it (at least in my opinion). I'm a big fan of pork belly and the way that do it here is outstanding. My roommate goes nuts for the baked goats cheese. But really there's nothing bad on the menu. Only once have I had cause for complaint here - I ordered churros for dessert and they came out way underdone (I'm talking liquid in the center). Sent them back. Twice. And subsequently lost interest. On the upside I wasn't asked to pay for them and was offered a drink on the house as compensation. Safe to say they handled it excellently. And I'll be back. Many times."], ["Zerina G.", "First time I went to Bar Ferdinand, it was with a group of friends from work. It was in October and still surprisingly warm for Philadelphia. It was great because we ate outside and sipped on a pitcher of white wine sangria. Went again last night but my friends and I sat inside. All outside seating was already taken..,bummer. But it was still very nice. Decor is lovely. Reminded us of some of the restaurants we went to in Barcelona. But our eyes were on the prize (we arrived famished!), so we proceeded to order a bunch of different tapas and raciones. I love tapas restaurants and how things come out as soon as they are ready. Timing between the dishes was spaced appropriately. The croquettes were wonderful and we had to order another round of that dish as it wasn't enough to satiate our appetite for them. The patatas bravas was nothing special. It was basically home fries with two kinda of dip. I was a bit disappointed in that.    I tried the Spanish flatbread with mushrooms and goat cheese and it tasted really good but a bit oily. I think the best dish was the chorizo. It arrived at our table in a flaming ceramic pig holder. WHAT?!?! It was remarkable. The chorizo itself was quite tasty, very juicy, but I still can't get over the presentation of the dish. Very nice, Bar Ferdinand."], ["Nikki C.", "Great vibe. Loved the tile artwork on the walls...very cool bullfight scenes. For a Saturday night I was a bit surprised at the small crowd, but we did get there around 8 for dinner so maybe it was busier earlier. In typical tapas fashion...the food came out sporadically, hot (when supposed to be), and quick. Which was just what I needed with a grumbling stomach!As for the food itself, nothing was bad, just not traditional like the waiter claimed. The tortilla was potato heavy with little egg unlike the many I had when in Spain. The goat cheese spread was very oily and tasted more like the rind than the cheese. The best menu item was the jamón croquettas - so good I ordered two helpings!!!Some of the larger plate portions were much smaller than expected for the price...a chicken leg for about $14...no thanks! And the chorizo was one link for a similar price (although I do recommend ordering it for the unique presentation!)I'm not from the Philly area so I don't know if there are other tapas options in the city, but if you're ever in CT hit up any of the Barcelona restaurants."], ["Tony W.", "Consistently consistent, This review comes after a minimum of 5 times dining here.The most recent was just 01/17/15 for a brunch. We went with a large group of people (Around 20) and were given a set tasting menu for brunch.As I have dined here several times, I was pretty sure that I would have had most of the items they were going to serve us, I was wrong. Brunch was great! They put together a great menu of truly brunch-based tapas. Also, the staff did a great job of keeping our glasses filled with sangria, bloody mary's and mimosa's.If you come for dinner, you will pretty much find all of the same characteristics. One of my favorite dishes is the manchego frito with apple foam. But you can't go wrong with anything"], ["Shavon D.", "Overall, probably 4.5.. Food was amazing.. I had the garlic shrimp and steak and potatoes- All cooked to perfection. Wait staff was courteous; Although we did wait kinda long for our entrees. As a result, we were comped free desserts without even complaining - again great customer service. Churros could use some imagination, just not sweet enough, but edible."], ["Zak D.", "Don't go here if there are large tables. They will forget you. We ordered a bottle of wine and 4 dishes including cheese. After 1.5 hours, empty bottle of wine and 1 dish, we asked for the check. Now we are at Sancho Pistolas and appetizer is here before I finished my review. $8 ceviche here is better tha. $14 single scallop at Bar Ferdinand."], ["Dawn W.", "This is my go-to for dates with my lady friends! The menu is always changing and the drinks are always creative and tasty. Since its tapas, you can try so many things on the menu without feeling like a glutton!"], ["Jessica D.", "Went here forSunday Brunch Started off with the Mimosa \"Sangrade\" which were delicious.Had the Sauteed Spinach and Piquillo Pepper Omelet with Crab which was an extra $3 dollars which is expected.  It was delicious and I enjoyed every bite. (make sure to ask for some Sriracha sauce).Mainly giving this place 5 stars for the Date and Bacon Empanada, Honey, Almonds. OMG! This dish was so good.  Only two came because it is an appetizer but I had it with my meal.  But I wish 4 came with it they were so good! The service was also very good.  I guess our waiter lost one of our tickets in the back and so the rest of our food came out way before my friends meal.  So the waitress gave us complementary mimosas and the meal that was late was on the house.  Will definitely be back to try more."], ["Lindsay H.", "4 stars for food- we tried 7 different dishes-all completely delicious. Spanish menu with unexpected twists. Service was OK but not spectacular. As expected in this area/type of rest."], ["Angela V.", "I really enjoy this place, especially for brunch or happy hour. The wine selection is good and even though it's tapas, there are plenty of vegetarian/pescatarian friendly options. I prefer to sit at the bar, and there are usually seats available."], ["Jan L.", "I came here with a party of about 10. We sat inside even though it was a beautiful day out (we chose to sit inside because of a baby) anywho, the drinks weren't bad, although my brother didn't like his bloody mary, at all. This is a tapas place so yes everything is small portioned. The food took foreverrrrrr to come out and it wasn't really that busy. Here is a run down for everything we had.Open face grilled chorizo sandwich was bleh, veryyyy salty. My mouth was getting thirsty.N.Y strip steak was pretty good.The date and bacon empanada was amazingPatatas braves was my favoriteJamon croquetas was pretty good as well, better than Amada in olde city."], ["Shauna G.", "Dare I say it?  I think I prefer Bar Ferdinand to Amada.  GASP.  They lured me in during a late night half-price bottle of wine night, where I was romanced by a bar filled with dried flowers and a delicious order of manchego frito (Yes. You read that correctly. I was romanced by cheese).  I had no other choice but to come back for a full on, proper meal.And when I did, it was a meal to end all meals (not even joking, I woke up 4 pounds heavier the next day).  Highly recommend the date and bacon empanada, the marcona almonds and the pancetta/baked egg flatbread.  And wine.  Lots and lots of Spanish wine."], ["Richie R.", "After reading all the excellent reviews, I was really hoping for more. Certain items were excellently cooked, such as the octopus. Most other things on the menu that we tried were either too salty, or too bland. And all items on the menu are overpriced.I grew up in Spain, so my views may be a little biased, but in our party of 3, no one was taken aback by the food.Perhaps we had a bad experience? Not sure. But unfortunately, will not be returning for more."], ["Matty G.", "Yum, yum, yum, yum, yum, YUM!A perfect Tapas Restaurant to visit while in Philadelphia.  A bit far from center city, but worth the trip to Northern Liberties.Can't go wrong with anything on the menu.  Sangria is always a treat as well."], ["Meredith B.", "Such a great spot.  Yes it is in Northern Liberties.  Great food, great cocktails and great atmosphere. There's no reason not to come here. Octopus with salt roasted potatoes and salsa verde - This is a great preparation of octopus.  A decent portion of octopus with fingerling potatoes.  Many restaurants have gotten into the octopus trend over the years but not all are able to prepare it correctly... Bar Ferdinand does.Pixin Con Pancetta - monkfish, porkbelly and rosemary Really good.  I know porkbelly is on the list of items people rave about... not always for me. So the porkbelly in this item wasn't the reason I thought to order it.  My friend ordered it - I was pleasantly surprised. The porkbelly was slightly seared on one side to add a bit of crisp texture to it while still preserving the soft nature of the ingredient. Monkfish was a good compliment to the porkbelly.  What I really enjoyed was the rosemary flavor that tied the dish of two skewers together.Datiles Rellenos - Fried dates stuffed with marcona almonds, jamon serrand, cabrales yogurt Absolutely amazing. I will admit that I didn't know it was an almond in the middle and mistook it for a pit (therefore not eating it).  I've come to find that you can rarely go wrong with ordering bacon/jamon wrapped dates. Get this.  Although small (four dates) it is the correct amount (unless you have a larger party size)Tosta De Yema - Truffled eggs, toast, asparagus, tetilla cheese (picture uploaded)  I love a good asparagus dish with egg and truffles.  This was awesome and completely different than what I had expected.  Think extremely fluffy large box toast (quasi biscuit but not really).  The egg is not noticeable until you slice into the yolk.  Cheese is also minimal. Pimentos Del Piquillos Rellenos - Stuffed piquillo peppers with zucchini, squash, eggplant, red onion, goat cheese puree A nice dish for the vegetarian at the table (depending on the type of vegetarian at the table (note goat cheese).  Wasn't a standout in my mind. Mejillones Con Chorizo - PEI mussels, white wine, chorizo, garlic We were looking for another dish that would not be heavy.  Excellent mussels in a delicious broth.  I suggest ordering extra bread to snag the broth with. Scallop from the tasting menu - we were able to order this one dish off the tasting menu. Not going to comment on it much as it may not be on the menu for when you are there. El Sol del Membrillo - Plymouth Dry gin, Absolut vodka, St. Germain liquer, quince syrup, fresh thyme Awesome.  Thyme is a great herb with gin. I fully suggest this be your first cocktail of the night.Palomino - Sauza Hornitos Tequila, fresh grapefruit juice, muddled cucumber, honey A very good cocktail but I happened to like the above drink better.  Ansill - you're doing a phenomenal job and the city loves you. Rock that beard proudly - there's no need for a beard guard."], ["Abby W.", "Came here for a paella demonstration class back at the end of July. For $35 per person you get to watch Chef Ansill prepare the house special seafood paella in a giant pan out in the courtyard, plus eat said paella and bring home a goody bag filled with calasparra rice, seafood stock, chorizo, and a recipe. I felt it was a good value for what you got.The experience itself was... interesting. The chef is, as most chefs are, a fairly egotistical man. He was mostly just interested in hearing himself talk while one of his sous chefs did the cooking, and enjoying his wine of course. I think he had a little too much wine by the end of the session. The other interesting part of our own experience was having the dubious pleasure of being seated next to two older suburban yuppie couples who are Ansill groupies and they thought that made them about the coolest thing to happen to Philly since the Piazza. They've been going to \"David's\" restaurants since his Ansill days, blah blah blah. You could cut the pretension with a knife. The paella itself was tasty but honestly, mine is better. It didn't get awesomely crusty on the bottom like it should, just a bit burnt instead, but the house-made seafood stock they use really does make a huge difference. I'd say that's the only one-up they've got on my paella. He uses way too much garlic, in my opinion. The seafood got a bit overcooked because \"David\" kept yammering when he should have been serving the paella. At least we got to go back for seconds!I'd come back here for some drinks and tapas, but probably not a traditional entree-based meal."], ["Tamara P.", "Came here for dinner on a Friday night. I must say if it wasn't for the horrible service this place would of gotten a full 5 stars for the delicious food  drinks and ambience. The Flamenco Dancers were amazing as well. Ordered the mushroom and goat cheese flat bread and ended up waiting for it for over an hour...Now, I don't care how \"exquisite\" and \"delicate\" the process is to make a flat bread with some mushrooms and Goat cheese it doesn't take an hour and a half, and if it does we should have been warned when ordering it... The waitress did express some sort of concern after the hour passed but where was she before?!!! VERY inattentive and inconsiderate...Come here if you have all day..."], ["Kati S.", "Really amazing tapas. Can't remember ever having a bad meal--or a bad drink--there. Try the Churros con Chocolate, if you're in the mood to share!"], ["Rich B.", "Overall the food was very nice; but not really worth the price tag. That and the slow as hell service(on a quiet night) will prevent me from returning . We came on a Monday eve after 9 p.m. Impressed by the decor dimly lit, nice booths, great looking bar w/ nice racks (wine). Initially we were seated at a booth with no over head working lamp which made it difficult for us to see the menu. We moved. Nice menu broken down into tostas tapas, flatbreads, raciones, paellas, etc. The house marinated olives were great; as were the 3 tostas (especially the house cured salmon and the mojama) You only get one slice of each; which I though was kind of skimpy for10 $(for 3 0r $4 each).Also hard to split 4 ways. I ordered the organic. chicken which was quite tasty. It was a leg/ thigh which was kind of small; served with crispy potatoes thinly sliced which also were great. Only complaint was there were only about 6 slices of them.The mushroom flabread was delicious, even though I am not a huge fan of goat cheese.The potatas bravas were ok. Too many items had saffron in them, not one of my favorite flavors.We initially wanted to get the paella, which the waitress said takes 40 minutes to prepare. What she didn't tell us was that everything else we ordered would come out in 30 minute intervals. There is no excuse for this food to take so long. I complained when a server asked how everything was that my chicken I ordered over a half- hour ago hadn't arrived. 5 minutes later it came. Service was staggered at best and one person received her rabbit racione before our tostas?"], ["Frank C.", "The service was excellent. I called ahead for my girlfriend's birthday and they gave us a complimentary dessert as a surprise to her"], ["Shashank M.", "Definitely stepped up its game from the last time I went. The charcuterie plates were delicious. Service was great. All the tapas that came out were made perfectly and we topped off the evening with the flan and sherry flight. Overall impressed, think Amada has some competition."], ["Joseph C.", "Bar Ferdinand is a great place to grab some drinks and have some snacks.  It's got a cool atmosphere and is right in the middle of all that NoLibs has to offer, but the food itself is just OK.  There are far better Tapas joints in Philly, and far better restaurants within a stone's throw.Not bad, but not great either.  In a city full of exceptional food, Bar Ferdinand is average."], ["Becky H.", "Authentic Spanish tapas restaurant. We ordered one-two tapas dishes at a time and they all came out quickly and hot as they were prepared. It was perfect! For five of us, we enjoyed probably a combination of ten mixed dishes and then followed with dessert. The staff was very nice and gave information for each dish as we ordered them. For example, which were so small that two would be better for our group...and they were spot on each time! One person in our group is currently on chemo and she wasn't quite feeling well. The restaurant only had one soup prepared in advance that she wouldn't be able to enjoy and the chef actually came out (not knowing about the chemo) to ask her what kind of soup she would like. She gave him a couple ingredients that would be good, that brothy was better than creamy, and he made her an amazing custom soup that was delicious! We will definitely go back!!!"], ["Lindsay H.", "Happy hour review: I continue to love Bar Ferdinand more and more with every visit. I'm even more excited to keep coming with the addition of David Ansill. After Sandy kept me locked inside for 4 days, I was desperate to get out. My boyfriend and I decided to indulge in happy hour at Bar Ferdinand having no idea that they changed it. Wow, were the changes great. Buck a shuck oysters?! $4 dollar massive glasses of spanish wine? Done and done. The oysters were fantastic and super fresh. We watched them shuck them right in front of us. It was perfect. Wine and oysters aside, they had many other tapas, beer and sangria available for $4 from 5-7pm! I definitely reccomend Bar Ferdinand at any time but definitely check out the happy hour specifically if you can!"], ["Patty K.", "Great for a Monday date night. The place is quiet, romantic, and bottles are half off."], ["Colleen M.", "We went to this restaurant for our anniversary. It was easy to find. Parking was hard to find though. We arrived earlier than our reservation but were seated right away. The bottle of water for the table was a nice touch. We ordered sangria (one of each) and I enjoyed it thoroughly (I had the blanco). Having an appetite for Spanish tapas we began our order. We started with the olives and cheese, always a favorite of ours. The cheeses were presented nicely and the accompaniments enhanced the flavors. The manchego frito is a MUST HAVE when visiting Bar Ferdinand. The combination of the warm fried cheese with the chilled apple foam was amazing! The patatas bravas were plentiful and savory. There was a special dish on the menu that evening of steak tartare with foie gras, a purple mustard and garnished with a quail egg. It was amazing! We were planning on ordering dessert but want to try the datiles con tocino empanada. It was so flaky and light we no longer needed dessert. Would definitely try this place again!"], ["Vinny P.", "Claro que si!I finally finally made it to Bar Ferdinand and I am happy I did.  I had a wonderful meal here on what would have been an otherwise uneventful stormy evening.We began with the tortilla a la espanola.  It was served cold with a dollop of garlic mayo (made in house) on top.  It was a great way to start the meal and paired wonderfully with my glass of rioja.Next we ordered the pixin con panceta and a plate of charcuterie that I cannot remember the name of.  The pixin con panceta was a revelation to me.  Monkfish and porkbelly together at last!  The flavors were like silk and each skewer was seasoned and cooked perfectly.  The plate of charcuterie besides being a healthy portion had wonderful variety and flavor.  Jamon serrano, lomba and two others which I can't remember were neatly stacked on the wooden board.  It was served with some croquettes.  That's all it required.I can't wait to come back to this place.  It was awesome."], ["N Y.", "Ambiance is great, but the night we went the service was pretty horrible. I overheard they were short staffed but everything took for.ev.er. I like a slow paced dinner but it was a bit much. Also the drinks were way watered down, food was good though."], ["Sir F.", "I absolutely love Bar Ferdinand. The wait staff is really cute, knowledgable and kind. I've been here a few times now, and all of my experiences have been memorable. My friends have a running joke, \"what does tapas translate to in English? Answer - Expensive\". The prices aside, the food is excellent, the wine is delicious, and the atmosphere is perfect."], ["Carla G.", "Four of us went here this past Sunday and I must say it was a very pleasurable experience... We ordered so many plates and pitchers of the white and red sangria the cheese platter(amazing) olives crab stuffed peppers...crab croquettes...a date bacon honey and cream cheese thingy yumm... shrimp  in  a oil( yumter) tomatoes on a bread... some we ordered more the once..Loved it!"], ["Michelle C.", "Bar Ferdinand had long been on my \"to try\" list. Our party of four plus a dog arrived on a Sunday evening and we were fortunate enough to get a table outside right away. We took some time discussing the menu and came up with a pretty extensive list. Highlights for me were the surtido de carnes (charcuterie board consisting of four delicious cured meats), patatas bravas (fried potatoes in a tasty aioli), datiles rellenos (stuffed dates), queso de cabra cocinado (baked goat cheese with pine nuts) and the almejas (steamed clams). These items would all make my list on a return visit. Items that left me less impressed were the empanadas, which had so much potential but ended up tasting kind of bland. Same with the stuffed peppers, which had little flavor other than the peppers themselves. The hits were far greater than the misses, and I'm looking forward to seeing how the menu changes with Ansill's reign."], ["Cara F.", "Watch out for the incredibly rude hostess. She's Asian and tatooed. We were a couple of minutes late and she she says- \"You're late- I was just about to cancel you in 5 seconds\". This was said with an incredibly bitchy, punitive tone. I went up to her later and told her I didn't appreciate her comments and her response was \"I've been working since noon\". It was 7 pm btw. I told her that wasn't my problem. Beyond that, the service was meh. We had to ask for clean plates between the courses. The waiter was fidgety and unable to look in our direction while he was reciting the specials. While the meal was fine, the experience with the hostess was so jarring that I will never go back."], ["Krista C.", "One of the few places in Northern Liberties that has servers who are attentive and actually care! The food has been great both times we visited. We always get the red sangria... It's delicious! Some memorable dishes:Patatas Bravas - Excellent! The potatoes are cooked perfectly and the sauce and peppers add a great kickAlmond-crusted Eggplant - I was happy with this dish. The eggplant was firm but not undercooked and the honey/almond combo was very tastyRoasted Mussels - You can't mess muscles up, these were deliciousWe've also gotten the NY strip, salmon and tuna (when it was on the menu), and also a short-rib dish on special... I feel like the special dishes are made with magic because they are SO GOOD!Bar Ferdinand is a little pricey, so we usually come in once a month."], ["Jade V.", "My experience with eggs at a restaurant tends to be a greasy, overdone mess--omelette, sunny side up, benedict, whatever--way too oily and bland. Definitely NOT so at Bar Ferdinand. We came here for a Sunday brunch and were not disappointed at all. The scrambled eggs were probably the BEST we've ever had at a a restaurant. Not to mention, the pulpo (octopus), olives and sardines (part of the cold tapas), and the shrimp sandwich we got were just perfect. The octopus is a bit steeper, but you WON'T regret it; the texture, temperature, and flavor was among the best I've ever had.Considering that the house wine was the cheapest drink on the menu, it was extremely delicious, and I'll definitely stock up on it at home. Terrum pinot noir, for those who are taking notes.Oh god, their Bloody Mary and carajillo (espresso with anise liqueur. THIS is what I recommend for caffeine addicts) gave us just the kickstart we needed to run errands on a dreary Sunday afternoon. Yup, nothing beats cocktails and wine on a Sunday afternoon.Slightly slow service, but quite friendly, and the quality of food more than made up for it. I'd come back for happy hour."], ["Lise L.", "I've been here twice for Brunch so I decided to give them a raving review. Their brunch is amazing! Those spicy potatoes are crack! Service is always prompt and friendly from beginning to end. I'd love to try their dinner menu and happy hour someday so I'll be making room on the calendar. Overall my group loved the omelets, french toast, and those darn spicy potatoes."], ["Dee J.", "After experiencing amazing Spanish Tapas at Amada several times, I thought to give this place a try, considering it is very close to my house. I had heard mixed reviews, but was still itching to give it a try. I found it mediocre at best. The dishes weren't bursting with flavor, and were quite basic. Additionally, the drinks were watered down and our waiter was just OK. If I had to visit this place again, I would go again, but reluctantly, it wasn't terrible, but it wasn't great either."], ["Adam W.", "This is our favorite wine bar.  The wine list will satisfy EVERY taste and the mixologists greeting you pour the classics with a knowledge and expertise that you would find a \"trendy\" speak-easy.  While tapas is the faire of the day, EVERY visitor should try the paella.  It is a dish that has no equal in the local area.  When my wife and I go there, we start off by saying that we are going to try something new, but we cannot resist that paella.  Cannot wait to go back!!"], ["Michelle S.", "The atmosphere is great.  The server and host were very attentive and friendly.I recommend getting the red sangria, it was delicious!  I liked everything I got here, specifically the Mushroom Croquettas.  They were amazing.  The seasonal vegetable coca was really good and I had leftovers!  It is tapas, so keep that in mind when ordering.  I did one smaller plate and one larger and was really full by the end of the meal.  My only downside is that the churros weren't that great.  They tasted more like funnel cake than a churro.  But it wasn't terrible either.  Overall, I would definitely come back.  Great for a low key dinner with friends."], ["Ji Eun L.", "Came here with 10 girls for a bachelorette party and really liked it. They were very accommodating when I called for the reservation and the food was fantastic. We especially enjoyed the paella, date and bacon empanada, branzino and sangria. We ordered a bunch of dishes to share and I was afraid we had spent too much money, but it came out to be around 50$ per person, which I think is pretty reasonable for the amount of food we ordered. Recommend for large groups."], ["Lauren D.", "Went here for dinner with my boyfriend on Saturday night and were very pleased! 4 starts goes purely to service and ambiance. I know we were there on a Saturday night at 8, so I expect the restaurant to be crowded, but the acoustics in the room were terrible (so much so that my boyfriend and I could barely hear each other talk as we shouted). It did not help matters that our server was very soft spoken and we had to ask her to repeat everything at least twice. The service was also a bit slow and ill-timed, though I assume this is because the kitchen was backed up. We had ordered a variety of tapas plates, yet we sat without food for approximately 30 minutes, and then four of our tapas showed up within a two minute window. The sporadic service continued throughout the meal with our waitress disappearing frequently. Not that we minded terribly though, as we were enjoying our night out. The food was terrific! We ordered the bacon and date empanada, the manchego frito, and the croquettes as our starter plates. All were delicious! The manchego frito may be been my favorite; the apple puree on top of the fried cheese was mouth watering. I only wish the plate provided more than 3 skewers! My boyfriend was a huge fan of the croquettes and raved about their stuffing. For the larger plates, we split the frito misto (that day included shrimp, clams, calamari) as well as the octopus. The octopus was definitely the most visually pleasing plate of the dinner, but both were quite tasty. We will definitely be returning, but next time I would suggest sitting outside if you want to be able to have a conversation. All in all, we had a few cocktails with higher end alcohol (Hendrick's and Ketel One) and 6 plates and our total bill came to under $100."]], "Jamonera": [["Ainsley A.", "I was really looking forward to trying Jamonera based solely on the fact that Marcie and Valerie are culinary geniuses and incredible business women.We decided to dine here because my roommate and I were looking just to go out to eat and get appetizers. Tapas (small plates to share), what a great idea instead of the standard crappy apps you can find at other restaurants!Our overall dining experience was great from start to finish. Our waiter was attentive and was constantly circling around to see if we wanted to order more tapas. Olives to start were a nice touch- very fresh and salty, just the way they should be.We ordered the tortilla espanola, the mushroom coca and the crab/manchego croquettes. Everything was wonderful- the mushroom flatbread stole the show with its salty cheese and sweet honey. If it wasn't for the price, I would go back to this restaurant. My roommate and I SHARED these tapas and my bill with tip still came to about $20- I didn't even have any wine (maybe I should have to ease myself when the bill came). For the amount I spent on food, I shouldn't have walked away from the restaurant still hungry. You can go to other high end restaurants around 13th street and walk away $20 poorer and have something to show for it."], ["Michael T.", "came here on busy Thursday for late night. Food was cheap and not too bad. Charcuterie was just alright, none of the meat was really special. Sangria was good."], ["Katie L.", "*Restaurant Week Review*My friend picked this out of the list because unlike their regular menu (in her estimation) their Restaurant Week Menu was more vegetarian-friendly, so why not! She'd been dying to go, and I never say no to products of the pig. We had a small wait for our reserved table, so the staff generously started us out with a meat and cheese plate in addition to the shared plates for the restaurant week menu. Even without, it was a whole heck of a lot of food, and I love leaving restaurant week feeling like I've gotten my money's worth.One of the highlights that appears on their regular menu were the bacon-wrapped dates. The sangria was just \"meh.\" Otherwise, I was left feeling satisfied but underwhelmed. I'm looking forward to returning and sampling from their regular menu which looks fantastic."], ["Majlinda K.", "Great place to go if you enjoy a nice tapas dinner in the city (or for a cute date night) ! They were able to sit us right away on a Saturday night for a table for two (but i would recommend reservations before you go). The place was very small and you are very close to the tables next to you. The menu had a huge variety of options. My favorite thing that i ordered there was the mushroom coca (mushroom flatbread) it was absolutely fresh and delicious. My second favorite was the shaved salad, which was light and filling so definitely order them both if you can. This place suggest 4-6 tapas for a table of two and the portions are small but you will leave feeling really full! The waitress was really nice and friendly. Also i loved that they give you a full glass bottle of water per table and you can refill it as you wish. I really think more restaurants should move to this method of serving water."], ["Jennifer M.", "My boyfriend and I tried Jamonera last Friday on an overnight trip to Philly.  It's not your traditional tapas establishment in flavor, but still very well executed and pleasant to your taste buds. If you're a lover of cheese, oddly, there seems to be a lot of it on many of the tapa dishes. I think their PAPA FRITA, HUEVOS SUCIOS, and BRANZINO are all excellent. The entire dessert menu was on a whole different bracket. I would have bought EVERYTHING, except we were so full from the savory tapas, I didn't have the room for desserts. But did that stop the inner fatty in me?! NO. The CHURROS were fresh and more pillowy than crunchy. And their PEAR SORBET!?!? Best thing I've eaten in a long time.Do your best to get a booth seat by the window at night, because the place tends to be really dark after sundown. And definitely make reservations. Walk-ins even at 9pm still have to wait a while for open tables."], ["Michael B.", "YUM!Am a HUGE fan of Marci and Valerie's restaurants - but I really love this place - the atmosphere is great - the waitstaff are friendly, helpful, and sensitive to where you are in your meal - they don't interrupt you - appreciate that!Make sure to definitely try the the Breakfast Bite & the Deviled Eggs - even if you stop in for a beverage/cocktail and a nosh - those two things are great for a quick snack!"], ["Aria S.", "Restaurant Week review! ~~~~~~~~~~~~~~~~~~Overall: Well cooked, fresh ingrediants. Spanish food with a flare. Extremely vegetarian friendly/filling for tapas.All four of the courses used different vegetables & spices making them all unique. Rosada sangria really good also and complimented food. I will be returning to try their regular menu!"], ["Julia N.", "I made a reservation for Jamonera at 6.30pm on a Friday - there weren't any free reservations between then and 9pm. It was pretty crowded when I got there, especially since it was quite a small (but cosy place).My friend and I got two small plates and two large ones to share:- Papa frita: the potatoes came piping hot, which is always a plus! I especially enjoyed the house made sherry vinegar hot sauce, which was more sweet than spicy. It complemented the saltiness of the potatoes perfectly.- Warm Medjool dates: the best dish of the night! It was stuffed with valdeon (a strong blue cheese, but not too overpowering) and wrapped in smoked bacon. The dates were sweet and plump, and the bacon is, well, bacon. Always delicious, and grilled with crisp edges. I would go back just for this!- Grilled octopus: two big tentacles of pulpo, yum! It was chewy - just the right texture. However, the sauteed peppers and onions that accompanied the dish was a little plain- Skirt steak: the steak came medium, which is what we requested for. Props to Jamonera for that, because usually, if we ask for medium rare, it would be closer to medium well. Other than that, the steak wasn't anything extraordinary. The fingerling potatoes were well done, with the skin coming off easily with a bite.The service was a tad bit slow, as my friend and I waited about 15 minutes in between the small and large plates. We didn't mind much though, since we were catching up.Overall, it was a pleasant experience at Jamonera! The dates were amazing and I would come back for it, but everything else didn't blow me away."], ["Konstantin N.", "My fiance and I came here for restaurant week, and every course was perfect. The standouts: the eggplant puree (basically an improved/spicy/vegetable hummus), the fried-goat-cheese salad, the gambas (spicy shrimp), and the branzino. And service was prompt and attentive. I couldn't have asked for a better meal."], ["Catherina D.", "La comida deliciosa! I went here during restaurant week earlier this year. I was so excited to taste the delicious tapas menu for the event. I was in heaven and it made me miss living in Spain. The papas brought me back to a tapas bar I went to all the time while living in the beautiful city of Seville. The albondigas were on POINT, the skirt steak was dreamy, and the bread pudding was phenomenal. I would absolutely come again to taste and reminisce in the authentic flavors of España. The ambiance was intimate, cozy, and very much like a real spanish tapas bar. Olé!"], ["Evan P.", "Overall, a good experience. The staff was attentive and provided solid recommendations (namely, everything on the menu). We went with the Warm Medjool dates (4 bacon wrapped dates) which provided a great mix of sweetness and salt. The Vegetable Tapas Board also provided a tasty mix of greens. The Pan Seared Bronzino was delicious and provided the most bang for your buck by portion. The Albondigas (meatballs) were huge and very flavorful. All in all, a good quiet spot for groups or dates with candlelight inside and a patio outside, good selection of food, and good service in a great location in the city."], ["Anishee U.", "That time you go out for Spanish tapas with a group, and after every bite look at each other with eyes that say \"oh my god!\"  Loved all the small, relatively authentic Spanish dishes.  The pain con tomate is just perfection."], ["Susan B.", "Read most of the reviews so we decided to try this place for dinner before our show at Walnut Street Theatre. We had a GREAT time!!! Sat at the bar for some happy hour drinks and app's. Drinks were good and we had the papa frita was & the short rib app both were very good. For dinner we ordered the stuffed meatballs, seared scallops, the shrimp dish (forget the name) and the short rib dinner. They were all very good, my favorite was the short rib, the flavor was out of this world!!! For dessert we ordered the churro's, which were as good as everyone said & the salted caramel sauce it came with was the best part! We also had the Jamonera sundae which was lick the bowl good!! Service was good, everyone was very nice."], ["Alexandra F.", "My boyfriend and I were in the neighborhood last week and I had been wanting to try out Jamonera.  We luckily stopped in during restaurant week (a pleasant surprise!) and it was seriously amazing.  Restaurant Week allowed us to sample 9 dishes between the two of us and they were incredible.  I'm not sure I would feel the same way if we hadn't been lucky enough for restaurant week. We will definitely be coming back again.  The service was pretty good as well - the hostess was a little rude when we walked in and asked for a table (gave us some sass and said they were booked for the next two hours...how would we know since there were open tables?) but other than that the rest of the service was great."], ["Lynda Z.", "My wifey and I were big fans of Lolita when it first opened a long time ago so we knew that this place has the same owners so we expected it to be tasty. We decided to have date night the other night and Jamonera was her choice for tapas and dessert. We ordered the Papa Fritas, Warm Medjool Dates and Fava Croquetas to pick on as we canoodled and enjoyed each others company. The Fitas were really good, they had a light garlic aioli which was very tasty. The dates were outstanding. They were full flavored little nuggets of love. The little apple chuntey they're served with is refreshing and a great little palette cleaser. Can't speak on the Crab, Im not a fan of seafood. I know, I know...it's just something I don't want to eat, sorry! And no, I really DON'T know what I'm missing :) Now, let's move on to dessert. We ordered the Churros. These badboys were served with a chocolate/salted caramel sauce for dipping. They were....Smack your momma, delicious! There appeared to be a light sauce in the middle of the churros also, or maybe our batch was just slightly undercooked. Doesn't matter either way though cause it completely added to the deliciousness. Yeah, you NEED to get them if you go there. Just saying! An added nice touch was that they gave mostly all women a free light drink since it was Mother's Day."], ["Vinny P.", "What's in a name?You would think that with the moniker of this establishment that it would not be suitable for vegetarians or vegans.  I am here to tell you that you would be making an incorrect assumption and if you're a veg*, you should put Jamonera on your short list.Our table had a couple of vegetarians and a couple of people with food allergies.  Our stellar waitress handled the dietary restrictions of our party with ease.  Most of the items that are vegetarian to start with can be easily made vegan and since some of the dishes needed to have diary/mustard/eggs omitted, this was no issue for the staff whatsoever.Highlights of the evening were the paps fritas, vegetable board, grilled octopus, jamon iberico and the vegetable paella.  Rather than go into detail about each dish I can just say that they didn't miss a beat on any of these items and in some cases, we got two orders of them.As the restaurant filled in, the pace of service did slow a bit.  I'm not sure if this is a norm but it certainly extended our dinner time significantly.Wine and alcohol prices are competitive with the area and their particular wine selection by the bottle caters to the adventurous or those who like their wine to punch them in the face, not just tap them on the shoulder.The staff was courteous and professional and the food was delicious.  There isn't much more you can ask of a restaurant these days and Jamonera certainly shines in this space."], ["A B.", "Had the benefit of great company, a funny waiter, and a damn good sangria, but otherwise a so-so meal. The white bean dip, yummy. The papas fritas, too. IMHO, not as good as its sister restaurants nearby."], ["Ryan O.", "The service was awesome, and the food was even better. Highly suggest Jamonera.Papa fritAs, Brussell Sprouts, garlic shrimp, and the mushroom flatbread were all extremely delish. This was my first trip to Jamonera, it definitely will not be my last. A top philly dining experience"], ["Rose D.", "Vegetarians: don't be scared off by the name of the restaurant, because the menu is super vegetarian friendly! There are lots of options on the regular menu as well as the Restaurant Week menu. I was here for Restaurant Week though, and the menu was (to quote our waitress) \"generous.\" More than worth the $35. You get three appetizers for the table to share, plus three courses after that. We also ordered a pitcher of the red sangria, which was a great decision because it was too good to have just one. Every dish was delicious - the white bean dip, papas fritas, manchego with almonds, and the crispy calasparra rice - but the standout for me was the pumpkin croquetas. We were stuffed by dessert, but I made room for the bread pudding.This is a small space, but it doesn't feel cramped, just cozy. Based on the size, though, it's probably smart to make a reservation.This meal was perfect and transported me back to Spain. I'm coming back here ASAP!"], ["Brian W.", "Went to Jamonera for restaurant week and it was delicious. The appetizers to share for the table were so good. The atmosphere was nice and the service was excellent. I had the seared Dorade and it was incredible. My friend got the shrimp and his dish wad much better than mine. I am so happy to have gone outside my comfort zone to eat here and I can't wait to go back again."], ["L T.", "I thought this restaurant was very overpriced for the food quality. I had the papa fritas, chef's meat and cheese board, eggplant fries and scallops. Nothing was particularly bad but I thought their choice of flavors didn't mix well together. I love tapas but I would not come back here. If you want to get tapas, I would recommend trying Jose Garces tapas restaurants in the city."], ["Min Y.", "I've found very quickly that tapas-style (small plates, not necessarily spanish food) restaurants are plentiful in Philly.  I've had my eye on this one and tried it on a Sunday night.Overall, I really enjoyed the food and drinks here and I would love to start off a weekend night here.  This would be a fantastic atmosphere for meeting up with friends.For drinks, I had red and white sangria, and an Estrella beer.  The sangria was very tasty, a little on the sweet side but nothing too obscene.  It had a good level of strength to it.  The beer was an import from Barcelona, and I quickly found out, one of their cheaper ones.  Tasted like crap, but I don't really blame Jamonera for that.For food, we had Octopus, meatballs, mushroom coca, and branzino.  All of these were absolutely delicious and filling.  I can't even pick out which one is the best, they were all so good.I would say 2 tapas per person would be sufficient.  3 per person might be a little too much, so I'd optimally say 5 tapas for 2 people, or 7 tapas for 3 people for the perfect size.Again, I simply cannot give 5 stars to a place that can hurt my wallet so quickly.  But this was money well spent!"], ["Brian H.", "I wanted to try Jamonera because Michele C. and Luba P. recommended it, it's on 13th Street where I never had anything below 4 stars, it's close to the Academy of Music for a pre-show dinner, and I am a big fan of Marcie Turney.We tried the tasting menu which had more than enough food.  I was stuffed and thus no room for dessert. :-(  The fried artichokes with a lemon creme fraiche, so beautiful, fried perfectly on the outside while retaining the solid artichoke flavor was a highlight of the starters.  The roasted beets salad, the shrimp, the tuna tartare, all memorable small plates.  Everything else of the 10 small plate courses was very good also.  The flavors of all of the dishes were distinct and complimentary, ingredients fresh and flavorful.  I was pleasantly pleased with everything but the service, which was a little spotty, having to chase down the server for drink refills, to remove some of the completed dishes from the table, the check...It's definitely a place I will return, cozy in this tight space, a nice relaxed bar, an appetizing drink menu, and excellent presentation and preparation of eats from the kitchen."], ["Michelle C.", "Finally made it to Jamonera and really enjoyed my experience. I was with a group of four and we went specifically for the Spanish fish fry for Wine Week. That was $25 per person and included fried cod, patatas bravas and a glass of Mallorcan white. More on that later. We were seated shortly after our reservation time, which was good, because there isn't much room for standing in this tiny establishment (though the restaurant is still substantially more comfortable than Barbuzzo, in my opinion). We started with a pitcher of sangria and a trio of tapas - the veggie board, mushroom coca and a crisp and tasty salad with asparagus, pickled chorizo, croutons and a light vinaigrette. All three were great but we especially loved the mushroom coca, and ordered another round...Which turned out to be completely unnecessary, once we saw the gargantuan plates containing the fried cod and patatas bravas. Wow. I don't know how we did it but we managed to put a hurting on this course, though there were still some leftover potatoes that we just couldn't finish. Total Wine Week win for us. If Jamonera ever features this dinner again, I'll be making my reservations immediately. The fish was perfect, the potatoes were crispy on the outside and tender on the inside, and the dry wine cut right through all the heaviness of the food. We enjoyed the wine so much we ordered another bottle to share, in lieu of dessert. Our server (whose name I forget - she is blonde and very friendly!) was fantastic. She appeared at all the right times and had great suggestions. Really looking forward to my next meal there, which is already in the books for April!"], ["rissa q.", "Great food, great service.   Fabulous service.The place is small, it's a little cramped.  But that doesn't bother me.Cocktails were original and well made.Oops, just found this unfinished review - how did that happen??  I was there back in May.LOVED the place.I'm a celiac and the chef circled all of the items on the menu that would be safe for me to eat. The food was fab, drinks were great, and we had awesome service.  Can't wait to go back."], ["Dean C.", "I had been researching Spanish places for when coming into Philly. Jamonera got ranked the best, we made a reservation and were happy to go! We got in 5 minutes late for our reservation because we were coming from the airport, wasn't an issue. Our reso was for 9:30, and we knew Happy hour starts at 10, hmmmm how to stall for 25 minutes. Turns out it was hard, so we ordered the papas frittas, I wouldn't say they were much like anything we had in Spain, I mean, they were fried potatoes, but not a bravas. They were kinda a miss for me, $7 for legit a potato, cut into pieces, fried with some mayo. Meh! Next up we got the eggplant fries, this was a 5 star dish, plus they had a version of romesco, which is quite hard to make perfect. THE fries were crispy on the outside and creamy on the inside, perfect! I ordered the pig egg($7), I'm not a fan of deviled eggs, but these were great, nice thick slice of pork belly and a creamy deviled egg! We also got the vegetarian tapas platter, fried artichokes, roasted beets, some type of squash, roasted fennel with goat cheese spread,  and shaved turips they were all amazing and this seemed worth the $16 price. So the happy hour starts, and I see the pig egg, now only $2 per order, damn... I know it was partly our fault for coming so close to happy hour, but I feel a bit cheated that I spent an extra $5 for 1 extra piece of pork belly. Their sangria was great, tastes like some of the best in Spain. We ended up spending a bit more than we wanted, but the food and services was great. If you're not a cheap-o like me and want to drop $200 on tapas this is a great place."], ["C L.", "Low-key, 10th Anniversary date night with my husband. The restaurant has indoor and outdoor seating. I recommend a reservation as space is limited, yet cozy. The staff was friendly and the food was good. We shared the following dishes... mushroom coca, chistorra chorizo, and paella mixta. Delicious. Even though the portions are not over-sized, which is nice, it was enough to fill us up. We had to pass on dessert... which was a bummer.  Oh, and our drinks from the bar were well made. We'll be back..."], ["Belle S.", "My boyfriend and I came here after walking past it so many times. We sat outdoors since it was so nice out. This place is tapas style so we were encouraged to order about four dishes. We got the Mushroom Coca (sauteed mushroom on flatbread), Wedding of Anchoas (anchovies, tomato and roast pepper on grilled country bread), Albondigas (meatballs), and mussels. Everything was really delicious and our server Sergei was great. We will definitely be coming back. :)"], ["Rob S.", "One of the more enjoyable dinners I've recently had in Philly.The space is small but trendy.My girlfriend and I started with two deliciously balanced cocktails (approx. $12) and later continued with two extremely reasonably priced beers ($5-$6 for good craft beer at a fancy tapas restaurant in Center City!?)We shared 5 plates which was plenty for the two of us.  I loved that their \"small\" plates weren't overly small which is something I'm usually critical of with tapas.  (Trying to remember all that we had but their website's menu is a bit out of date.)  We ordered the papa fritas, the cheese-stuffed/bacon-wrapped dates, the grilled octopus, the seared tuna and the albondigas stuffed meatballs.  The dates were the smallest plate by far - only 4 dates - but well worth the combination of flavors.  The octopus and tuna were both perfectly cooked.  I enjoyed the slightly spicy red sauce that came with the octopus though the white sauce that came with the tuna left a little to be desired.  The meatballs (only 2) were hearty and delicious.  The meat and and cheese plates and paellas were extremely tempting but we didn't have room!Our server was friendly, on point and knowledgable about the dishes and how they might complement each other.  Also, though the restaurant was not full when we sat for dinner, all of the plates came out very quickly.  Five plates and four drinks for two and we spent just over $100 with tax and tip.We probably enjoyed this restaurant as much as Barbuzzo and with it being easier to get a reservation I would definitely recommend it."], ["Mandrita D.", "We went here on a girl's night out/ friends' reunion in a group of 4. The place was pricey but very good overall. We ordered the vegetable board, manchego meatballs , bronzino, eggplant fritters, and the paella mixta. Everything but the paella was great, especially the tapas /small plate items. The paella was very mediocre, did not have all the fresh flavors that a good Spanish paella does."], ["Kilgore T.", "The food was delicious and they had great wines by the glass.  Even though they were crowded and we had just walked in the host was super friendly and tried to accommodate us.   The entire experience was stellar.   I do recommend."], ["R E.", "Went here for a 2 year anniversary date. The place is very small but we had a reservation so we were seated immediately. We were going to start off with some wine. I'm mostly a fan of sweet wines, which the waitress said they had absolutely no options for. She was nice enough to bring over some samples of other wines for me to try but I wish they had had more variety. To start, we had the papas fritas which were just ok, nothing special. There was lots of potato and not very much aioli. We wound up eating a few bites and taking the rest home. Everything after the papas fritas was awesome. The warm mejdool dates were amazing, as was the huevos sucios de lucio. The seafood paella didn't come out until about 20 minutes after everything else was finished but it was pretty good.The only thing I really didn't like was our waitress' attitude. She was kind of a b."], ["Janette L.", "My experience at Jamonera was so-so - I was hoping for the same service and delicious food as its sister restaurants. The bartender was too busy to turn around to offer drinks to us while waiting a few minutes for a table. Service was extremely slow and the food was not necessarily hot. I had to ask to waiter to explain the menu since it was my first time at the restaurant. The grilled vegetable salad special was good but the scallops left me not satisfied."], ["Bowerbird E.", "Bartender was very unfriendly, and could've improved the mediocre experience. If you're from Spain, you'll be disappointed."], ["Christina S.", "Awesome tapas! I went this weekend and shared 4 plates among 4 people. The vegetarian tapas platter is AWESOME. there are so many flavors and textures, all of them done beautifully. The fried artichoke was my favorite. the braised beef dish was also amazing, plenty of flavor. the waitress told us that it was Spanish \"comfort food\" Reservations are REQUIRED; I saw them turn away people for not having reservations. I made a reservation for 7 and was seated by 7:10."], ["Rich D.", "Visited for the first time and was very impressed! Ordered a bunch of menu items; all of which were really good. I especially liked the charcuterie board, chorizo with figs, and the churros. The only thing that didn't overly thrill me was the albondigas...I expected the more traditional type in a picada, but these tasted more similar to Italian meatballs...totally not a problem though. They make a very good paella. The cocktails were especially good also!"], ["Linh N.", "Jamonera wasn't exactly what I expected. With great reviews on Yelp and a great menu, the actual food did not come to par with what was said.My friends and I were seated outside because the tables inside were already reserved. We ordered 3 plates to share since we already pre-gamed somewhere else. I had the Bizet which was a citrus-y cocktail, tasted like grapefruit juice. Service was quick which makes me question the dishes that were served.The Crispy Cana de Cabra, which was fried goat cheese salad was pretty good, very nice dressing and tasted really summer-y. The next two dishes were quite disappointing. The Charcuteria and Pulp a la Parilla was very lacking. The meat board tasted \"dead,\" the meats didn't stand out and the pate felt like it was sitting there for a really really really long time. The octopus were overcooked and the dish was cold (was it suppose to be cold?). Service was nice, even the atmosphere was ok but the food just didn't cut it for me. Maybe you can convince me otherwise next time Jamonera..."], ["Leighkaren L.", "Unbelievably delicious! My boyfriend took me here for my bday this Sunday that just passed. It's a cozy, lovely, intimate place. We had looked at the menu the night before to get an idea of what we wanted, but when we got there they had a tapas sampler, which we decided on unanimously. It's 10 plates for $40/person and it's pretty much a great selection of what the restaraunt has to offer. We were not disappointed. Each plate was amazing and we were stuffed at the end. We saved room for desert and coffee. I had the bread pudding and I forgot what he had...but it was well-worth venturing out in the storm!"], ["Kelly G.", "Was happy to find jamon iberico bellota here -Yum! Good cocktails, decent wine, friendly bartender."], ["Liz U.", "I FINALLY tried Jamonera. It was a weeknight and we were just a table of two. The service was friendly and efficient. They were accomadating to our desire to order things one at a time. Some dishes were better than others. Some were inventive and some were very traditional. I especially liked their cheese plate and thought there patatas braves (goes by a different name here) were maybe the best I've ever had! I will definitely return"]], "Alma De Cuba": [["Grace H.", "Alma is one of the coolest places to dine in Philadelphia. Its ambience is dark and sexy and there's a really great bar/seating area downstairs below the restaurant if you're just looking for a chill place to grab drinks one weekend. 5 stars for aesthetics.In terms of the food, I wasn't a huge fan, myself, but that may just be subjective. The jalepeno corn bread for the table was actually surprisingly tasty. The ceviche flight we got as our appetizer all tasted somewhat fragrant (in a floral way), and the lechon my boyfriend ordered was like having a farm in my mouth - super pungent and really fatty. But I think some people like that, so I supposed to each his own. Just be prepared for a whole lot of flavor. The vaca frita skirt steak was much more familiar to my taste buds, but the texture seemed a little off. And my cocktail was  really strong, so much so that I had to ask the waitress to dilute it (twice).Overall, the ambience of this place is really awesome and its location right in the heart of rittenhouse makes it a great place to dine or go on a date!"], ["John K.", "I first dined at Alma de Cuba a year ago, after the weight of a Michigan Christmas' week of meals. The GF and I decided to do a sampling of some of the smaller tastes from Chef Rodriguez. It wasn't too packed when we stopped by before an 8PM showing of Elf at the Walnut Street Theater. We were on the 3rd floor, which was more of a private space.Bread ServiceChimichurriFresh pandebono was on offer, delightfully crisp and sweet on the outside with some yeasty cheesiness within. The classic South American bread was made of yucca flour, manchego, and queso blanco, resulting in a gluten-free fluffiness. Who knew gluten-free could actually test good? It came with a wonderfully garlicky chimichurri which tempered that initial attack of sweetness.CornIn ordering the ceviche tasting, we also received a duo of corn - salty, savory, fried corn kernels and buttered popcorn. Ceviche Tasting [3 for $28]Alma de Cuba offers several ceviche tastings - we went with the smaller on this particular night. You can also opt for 5 for $45 or all 7 for $59. Interestingly enough - they don't offer a tasting of all 8 that are on the menu. Tuna Tostone [$17]Tuna, crispy tostone, avocado puree, pickled shishito pepperThe first of our trio offered fresh slices of tuna ceviche that weren't overly marinated, on top of a puree of avocado. While the tostada was chewier than crisp, the pickled shishito offered some acidity and helped to meld a nice balance of flavor.Rainbow [$16]Tuna, salmon, black bass, jalapeno, lime, sweet potatoThe heat of the jalapeno and the pop of the line highlighted a nice mix of lean tuna, fatty salmon, and toothsome black bass. The fried sweet potatoes offered some additional texture to each bite.Sea Scallop [$16]Celeriac leche de tigre, pomegranate, elderflower, hazelnutsThe scallop was a clear favorite - clean, with the leche de tigre providing classic ceviche flavors. The weight of the hazelnut balanced the acidity of pomegranate nicely. Alma Sampler [$13 pp]Smoked albacore tacos, royal palm dates, empanada de verdeIn the trio spirit, the GF and I decided to try the Alma sampler, which comes priced per person.And with the arrival of a tower of appetizers, we were instructed to eat in the following order.Empanada de Verde [$14]Spinach, manchego, artichoke escabecheThe empanadas were perfectly fried, with a nice mix of spinach and salty manchego within. An artichoke escabeche was nicely pickled and offered some acidity to the savoriness of the empanadas.Smoked Albacore Tacos [$14]Iceberg, pickled jalapenos, malanga This was an interesting take on fish tacos, with the smoky tuna coated with a tangy, rich mayo. Pickled jalapenos brought the heat, with the malanga providing a nutty flavor.Royal Palm Dates [$13]Almond stuffed dates, bacon, Cabrales blue cheeseThe fattier than crisp bacon had heft, which balanced out the bitterness of the endive nicely. The funky, salty cheese was a nice counterpoint to the sweetness of the date.Gloria's Black Bean Soup [$9]Crema fresca, croquetta de arrozAnd if there's black bean soup on the menu, the GF will probably order it. And I'm glad she did! I don't know who Gloria is (Chef Rodriguez's mother?), but she might have the best black bean soup out there. Not overly salty, the soup was seasoned nicely and the texture was spot on. The rice croquettes offered some additional substance to each bite, with the crema providing some cool lightness. Oxtail Bone Marrow Croquettas [$16]Roasted bone marrow, pickled onion, natural jusI tried one of their newer additions to the menu. The marrow heightened the richness of the oxtail within the crisply fried croquettes. The pickled onions providing the countervailing acidity to balance out each bite. Nice.Chocolate Cigar [$9]Almond cake, chocolate mousse, dulce de leche ice creamAnd if you have dinner here, you almost have to order this award winning dessert. An ode to Miami and Cuba to be sure, moist almond cake is wrapped in chocolate mousse and dusted with even more chocolate. The matches are made of sugar cane doused in a bit of alcohol to light, with a cracker serving as the match box. A scoop of the dulce de leche ice cream provided sweet richness that complemented each bite of the cake nicely.So if you're looking for fresh ceviche and thoughtfully executed dishes, look no further than Alma de Cuba. It's clear why Iron Chef Jose Garces has become the force that he is, thanks to the mentorship under Chef Douglas Rodriguez. Texture, tastes, and balance are all there - in a Stephen Starr setting no less."], ["Sarah K.", "Such a great place for private dinners. I went with a group and tried all the food. My favorite is the chicken dish. The portions are filling and every dish was tasty. A steep in the wallet but it was a enjoyable experience."], ["Samy M.", "Went here Friday night with a group of 5 to celebrate a birthday. We had high expectations for this place because it came highly recommended and because the reviews were amazing. We were all SO disappointed with the food. I will say that their bartenders make amazing drinks, we got an off the menu mango mojito which was exceptional. Got the:Lechon AsadoVaca FritaChicken imperialArroz PegaoPineapple guacamole The guacamole and the drinks were about the only good things that came out of this. I personally ate the arroz pegao and it tasted like the rice was soaked in oil for about  30 mins before being served. I also tried some of the chicken and it was dry as a bone and tasted like 3 week old meat. This was probably one of the most disappointing meals i've had in Philly. The food is just sub-par and more for show than anything else."], ["Allison T.", "Beautiful restaurant with a cool vibe. We went at 8pm on Friday without a reservation and were sat right away. The service was great and everything was flavorful and delicious. I had the crispy pork with white rice. It was perfectly cooked-crispy on the outside and tender as could be, the sauce was unbelievable.  We went here based on a recommendation of a friend and were not disappointed! I wish we had enough room for dessert because it looked amazing!"], ["Jennifer K.", "Get the trio ceviche sampler...the al fuego one was spicy and delish. Sugar cane tuna was great. My husband had the vaca frita, which was well seasoned.Overall four and a half stars....not quite 5. May go back for their happy hour menu."], ["Jessica W.", "Alma de Cuba is consistently a great restaurant. It's one of the only Starr restaurant I can fully recommend without hesitation. The service is attentive. The food is fresh and filling. The interior decoration is upbeat. Although the bar on the first floor is very energetic, the noise doesn't transfer to the floors above. The stairs from the first floor to the second are very steep and dimly lit, so use caution. This is a great restaurant, and I look forward to many more visits."], ["Anwesha B.", "This is amazing Cuban food! The food portions are well balanced, although a little expensive. But its wonderful ambience and well cooked meals were completely worth it. We came for a conference to Philadelphia and the food and service was prompt."], ["Mike Z.", "Great ambiance and a beautiful restaurant. I regularly come here for happy hour and I must say its fantastic.  Mojito was never my drink of choice until I came here.  They have a happy hour during the week from 5-7 where mojitos and selected apps are only $5. The mojitos are the best ive ever had and all the apps are really good and you cant beat the deal.  The chocolate cigar cake is awesome! The service is top notch and the servers are very welcoming and helpful.  I have been here over the weekends for dinner in the past as well,  but I really like it here for happy hour.  I will continue to come here in the future."], ["Rome S.", "Their food USA amazing and very creative. From the outside it looks like a while on the wall, but once you walk in the red romantic ambiance pulls you in and every dish is just as good as the last"], ["Smrithi D.", "I couldn't find more than a couple of menu items that were vegetarian. That puzzled me as Yelp has their \"Veggies go crazy for this spot\" stamp on the page. The empanadas verde was a great starter and I ordered a beans dish as my entree. All yummy but just a little over priced. Seating here was difficult to get even though myDate and I waited at the bar with our handcrafted mojitos for nearly an hour. We ended up getting seated on the lower floor on what resembles a sofa chair which is good for drinks and anyone here to chat but not necessarily for a close dinner.  I would definitely recommend their mojitos:The black berry and the sugar cane."], ["Eric S.", "We had the lechon asado and the banzino. I live from miami so i know a lot about this type of food and have had very high quality latin food. The fish was good but perhaps not my fish of choice and as for the lechon asado, it lacked a bit of more innovation. I can have that plate at any corner in miami for 1/2 the priceBesides that, it was very nice environment and very good service. For someone who has not tried latin food before it is a very good option. Enjoy"], ["Sara S.", "Overrated. Just like all of Steven Starr's restaurants. I would have appreciated a lot more flavor, and authenticity- and less pretense. Everything on the menu was tasty- but nothing special. Nothing exciting. I feel as though a lot of the meal was heavy. Not enough brightness. Cuban food always has a splash of something bright or acidic to cut through the starches and fats that lovingly dance together...like the Cuban Sandwich. It's not a Cuban without the mustard and pickle to marry the fatty ham and cheese and buttery crust on that flawless bread...that my friends is magic. Sadly, Alma de Cuba possesses no magic. And no love.Though I would like to say that if I could I would give five stars for service. The staff is friendly from the moment you walk in until your step out the door. I had the sangria roja, it was good. The tiny rolls were interesting- the dipping sauce that accompanies it, well- it's got a nice flavor- but not something I would want as a condiment for a roll. We waited 8 minutes for butter.Next we had the empanada verde, which was tasty, but for 14 dollars I could buy the ingredients to make my own empanadas.We shared the Dorad and the Steak. Both were cooked well, but lacked that magic I was talking about before. The rice that accompanied both was tragically overcooked. I'd love to have had some specials. AND MAGIC. AND LOVE. Steven Starr why don't you want people to have love with their food? Where is the love in your food? Everything is so corporate, so one dimensional. Is it pre-made from Sysco and you guys just sou-vis it? Sad. I suppose if you have a hard on to go to a Steven Starr restaurant this will do- but just don't expect it to blow you away."], ["Clark A.", "After my recent visit here, I'm downgrading my review from 5 to 3 stars.  The appetizer (current special) was some sort of special flan topped with foi gras and served with toasted bread ... the net impression was of slimy tartness, with nothing to recommend it.  I ordered the duck again, as it had made a very favorable impression at my last visit, but found it chewy and flavorless.  Had two drinks, including a mojito, they were just okay and didn't seem to have much alcohol.  Didn't feel motivated to try the dessert.  Oddly, I walked out of here still feeling hungry.  Hopefully this occasion was an anomaly, as this had previously been my favorite restaurant in Philadelphia."], ["Diana H.", "Sigh, I really wanted to like you more, Alma de Cuba! I made last minute reservations, and we were happy to get a spot on a busy Saturday night. Upon arrival, I could see two types of crowd: a younger (30ish) urban crowd, and an older, pretentious crowd. We were seated upstairs, and I thought the chairs and tables were too low. I'm only 5'2\". The food was good enough, but I wasn't that impressed. The bonemarrow croquettes were pretty bland, as the bonemarrow wasn't seasoned enough. The duck main course had a weird ratio of too much duck and a lack of sides, in this case a mash. The scallops were overly seasoned and turned out incredibly salty. The almond stuffed dates were pretty tasty. Desserts were nice, but you can't really go wrong with chocolate and peanut butter. Service was good, though at some point someone asked us if we'd like more bread. We answered yes, and never saw bread again."], ["Julie W.", "I came here for a business dinner, so I feel a little spoiled as I tried a lot of different foods. Here's what we had:- Tuna/Watermelon ceviche special- Royal Palm Dates- Octopus Escalivada- Tostones- Sweet Plantainsand the entree that I had was special of seared tuna with a coffee rub, over a wilted greens with a creamy puree of something I can't remember (oops). There's not a dish we didn't love, and everyone was ooh-ing and ahh-ing over. Service was excellent. The wait staff and manager were amazing, handling our group of 12 with ease. Loved the atmosphere - music, decor.  Oh yeah, and it was so good we came back another night for cocktails and appetizers with a smaller group. When I'm in Philly again, it'll be at the top of my list."], ["Patrick J.", "You won't be disappointed by the menu.  Wonderful ceviche and seafood.  Try the tostones - fried plantian \"chips\" with fresh garlic.  So aromatic and delicious!  I've visited a few times and enjoyed the Hemingway daiquiri, sangria, and Dark and Stormy.  I had one of the best meals of my life there at the bar, so it's a great venue to try.  Their chef is outstanding. Service is professional and on top of things.Only complaint is that the seating on the main floor is lounge chairs, which can be a bit awkward if you want to eat, but great for hanging out and drinking."], ["Maria K.", "Went here for an anniversary celebration and was highly impressed. Service was great and food was delicious. Having traveled extensively through Latin America, it's a bit pricey, but you are paying for high quality preparation, ingredients, and service. Ambience is lovely as well. Recommend ending your meal with the chocolate cigar - it's amazing!"], ["Maisha R.", "During a recent trip to Philadelphia for a conference, a couple of friends and I were looking for a great place for dinner close to the convention center. Alma De Cuba kept appearing on the lists of excellent restaurants. Getting a dinner reservation around 7 or 8 proved to be difficult but an option that I was offered was to come in and sit in the bar/lounge area. We opted to do that. When we arrived, there was a wait for that seating as well but a table quickly opened up for us.We started with the ceviche tasting (5 for $45) - The presentation was beautiful with five small plates of ceviche displayed on a large platter filled with ice with a dish of mixed, seasoned nuts in the middle. While the ceviche plates were indeed \"tasting\" size, the dishes were very inventive and the flavors were complex. My favorites were probably the Thai Mixto which consisted of crab, shrimp, octopus and fluke with coconut-leche de tigre, mango and tomatillo, as well as the Rainbow which was comprised of tuna, salmon and black bass marinated in lime juice and jalapeno with roasted sweet potato slices.I ordered the ribeye with chimichurri and yucca. The steak was tender, juicy, nicely charred and very flavorful even without the chimichurri. My entree was perfectly complimented by the side order of plantains, which were sweet and delicious. I also tried the oxtail with bone marrow, the duck and the stuffed dates with blue cheese.  Everything was outstanding.While the food was of top notch quality, the service was subpar. We had difficulty getting our waitress' attention on multiple occasions and the wait for the food was unbelievable. Everything took forever to come out of the kitchen! Thank goodness for the highly addictive, complimentary cheese bread balls with a sweet dipping sauce. They were much appreciated as we waited an interminable amount of time for our food. If you're looking for outstanding food and a great, dimly lit restaurant with gorgeous pictures projected on the walls, definitely give Alma De Cuba a try. But, be prepared to wait. Of course if you get too impatient, you can just check out another place, given the prime location on Walnut Street's Restaurant Row."], ["Ed U.", "It does seem a shame that I only pass through a city as great as Philadelphia and always for work. Whenever I finish whatever business I have there, I usually bolt out to the 30th Street station and take the Acela Express to the glamour of Gotham. So I have to say it was quite a treat at last to have a fine dining experience in the heart of the city near Rittenhouse Square. Recommended by colleagues who know the town far better than I do, this is one sleek, hip and popular place but surprisingly, I didn't feel trapped due to the spaciousness of the multiple floor layout and the attentive service. Ricky Ricardo could have sung \"Babalu\" here though it still would have been a tight fit for his entire conga band.My colleague and I were fortunate to be there during Restaurant Week because hey were offering a $35 three-course Prix Fixe menu that looked awfully appetizing from the selections. But first things first, we needed cocktails, and this was clearly an excellent excuse for a mojito even with the below-freezing temperatures outside. I tried the $12 El Jefe Mojito which mixed 10 Cane rum, lime, mint, sugar and bitters into a tantalizing treat that was clearly muddled and shaken by an expert pair of hands (photo: bit.ly/1nCkPAi). The Cuban bread rolls were warm with a nice chew thanks to the cheese inside, quite addictive and they replenished our little plates with little provocation (photo: bit.ly/1kuBUZy).This gave us a good head start on the first course, the Sea Scallop Ceviche. It was the standout of the evening s there were quite a few grouped artistically together, marinated gently with celeriac leche de tigre and topped with pomegranate seeds, hazelnuts and elderflower (photo: bit.ly/1gOxkFO). There was a lovely freshness to the scallops which was enhanced by the rest of the ingredients. Denying myself the Pork Ropa Vieja Tacos,the other appetizer choice, I felt it was also light enough for me to get away with the second course, the Lechon Asado, which was a ridiculously huge portion of crispy roasted pork pieces mixed with congri rice and sour orange mojo (photo: bit.ly/1oFowoa).What should have been a sure thing turned out to be a near-miss as the inherent greasiness of the fatty pork somewhat overwhelmed the dish. It is rare when I cannot finish a pork dish. Really rare. For dessert, I bypassed the Alfajores and the lure of dulce de leche in favor the Coconut Tapioca, which ended the meal on a high note with a hearty serving mixed with brown sugar syrup, pineapple jelly and coconut espuma (photo: bit.ly/T0smev). It had just the right level of light sweetness to offset the pork I just had. Service throughout the evening was quite consistent and not too unctuous for such a popular spot. If I find myself in Philly again - and i will - I may just return to this stylish Cuban culinary find.FOOD - 4 stars...ceviche is superb but the fatty pork may be just too much of a \"good\" thingAMBIANCE - 3.5 stars...very hip and modern, spacious but also a bit dark and quite loudSERVICE - 4 stars...quite helpful without the attitude you would expect in a place like thisTOTAL - 4 stars...not too authentic but awfully tasty all things considered"], ["DJ D.", "The food and atmosphere was outstanding. Everything was cooked to perfection. The Lechon asado, by far my favorite dish.. Everything I had was amazing. I hope to come back or find them in another city. The perfect night for me and my friends"], ["Michael C.", "My fiancee' and I patronized this establishment Wednesday 8/12 as part of Philadelphia Restaurant Week.We walked in to a bar area just inside the front door to a half dozen business men in suits; in my \"post-work\" sneakers and shorts, I felt under-dressed but no one complained.  (My fiancee' was in business attire and had nothing to worry about.)We both chose the Ecuadorian Shrimp Ceviche.  Decent sized slices of avocado, large shrimp, and a simply fantastic roasted tomato \"sauce\" on it (more of a cold glaze?) with corn nuts.  Very very tasty.My fiancee' had the Shortrib Ropa Vieja.  Her only complaint was that the shortrib had very little texture - it was all mushed into a thin layer.  But she said it tasted wonderful.I had the Salmon, but due to cilantro intolerance the glaze, the lentil salad, and horseradish cream was substituted.  (Apparently cilantro is in almost all parts of the dish.)  I really must commend our server, Julia, for communicating for me with the kitchen and ensuring that we got a dish that was edible.  The salmon was roasted perfectly with a great crunch on the edges (I like that on my salmon), the rice was lightly salted and peppered, and the cool pickled onions atop were a nice counterpoint to the warmth of the rest of the dish.She had the Coconut Tapioca Pudding.  (I tried the lime foam, and it was foamy lime tasting goodness.)  She said it was very good (and she doesn't like tapioca.)I had the Pineapple Upside Down Cake.  It was very very dense, and very hard to cut through until I realized there were four very thin very tough slices of pineapple on top.  It was tasty though.Regarding portion sizes, we left on the \"high side\" of comfortable, but not crazy full.We didn't order any alcoholic drinks, instead choosing to stick to Sprite and ice water.  The ice water was thankfully not tap water but was quite good as well.Our server, Julia, was very attentive and pleasant (though we didn't learn her name until we got the bill), and the various bussers who visited us to clear plates were courteous and unobtrusive.  Several managers seemed to be circulating throughout the other diners and were also very happy to find we were enjoying ourselves."], ["Ryan M.", "Good food and large portions for the entrees.   The food is something you won't find anywhere else and I enjoyed it very much.  I like the ambience as was in the darker side so it was good for a date.  The waiting staff also really knew there stuff when it came to questions about the food."], ["Marc P.", "Alma De Cuba is our favorite restaurant in Philadelphia, and we eat here at least half a dozen times a year. I usually order the smoked albacore tacos and the crispy roasted pork but everything else I've tried has been amazing. We've never been disappointed and everyone we've ever brought has loved it. The ambiance is perfect and the service has always been excellent. I would put Alma De Cuba among the top five restaurants in Philadelphia."], ["Michael M.", "Met here for dinner and drinks...have to say I haven't had great Cuban food in a long time and this place had everything, great food, top notch service, amazing drinks and a sexy & modern feel.  It's not cheap but neither is the quality.  I had possibly the best tostones I've ever had with a garlic mojo over top and then we shared DUCK Ropa Vieja and of course had to try the staple Cuban dish, arroz con pollo.  Both were so orgasmic with every bite I thought I was gonna need to smoke a Cuban after every bite!!?!  I finished the evening with a glass of balvenie Caribbean cask.  Perfect glass of scotch to finish a perfect meal.When in Philly you have to try this place out, you'll be blown away!"], ["Max C.", "Phenomenal restaurant in Philadelphia serving Nuevo Cuban cuisine. The space is amazingly beautiful and very comfortable. My only drawback is the bathroom. The bathroom is located on the 3rd floor with no elevator. This can be a problem after a few drinks if you know what I mean.Back to the food, amazing. The presentation was A+ and the staff was exceptional. Stop in, you won't be disappointed."], ["Chaka H.", "One of the sexiest, swankiest, and most delicious spots in Philadelphia (probably my favorite restaurant!).  Everything from the appetizer sampler to the lechon asado.... deserves a round of applause!  Also, I don't actually like mojitos, but Alma de Cuba does it right! Can't wait to come again!"], ["Nicoleen R.", "When you enter you get lost in el latino. The ambience wonderful. Happy hour is the best the tacos are fantastic so are the cubqn sandwiches our bartender Amanda friendly graet smile and welcoming."], ["Chris H.", "Alma de Cuba has been one of my favorite Philly restaurants for years!  The atmosphere is fun and trendy, the service is friendly and helpful and the food is amazing!  It's fun to try different small plates and everything is reliably well-prepared and delicious -- you can't go wrong with whatever you order!  I definitely recommend the ceviche, the Royal Palm Dates (which I would never have thought to order if they hadn't been recommended to me) and the mojitos!  It's a great place for any occasion.  I highly recommend it!"], ["Lauren K.", "FABULOUS RESTAURANT!!! I went here for a birthday dinner with a party of 10 and the restaurant was very accommodating. Was seated upstairs and it was perfect - perfect amount of noise to make it a fun and vibrant place (in addition to the decorations!) but quiet enough we could hear everyone at our table. We had an incredible waiter, who we asked many questions to (such as portion sizes of ceviches, tastes of certain entrees, etc.), and he answered each question with great detail and respect. He also gave us a run-down of the top items in the menu from each category and was very attentive with our waters/drinks. Our actual food items were great!! Every person at my dinner said they had an excellent meal. I can speak to the scallops dish, which was superb. It's a great restaurant if you want to try something different, any pick you make will be excellent. They even brought out a GORGEOUS and DELICIOUS birthday dessert, a chocolate cigar - light with candles that were edible.. to make it look like the cigar was lit! Could not give a better review for how this dinner went. Excited to celebrate a special night here again."], ["Rizwan A.", "Unique but not amazing food, tiny portions, and prices that are too high for quality that has slowly but SURELY declined over the years, and clearly preferential treatment to higher paying or perhaps just douchey crowds, alma de cuba has lost the majority of their points with me.I brought my wife here for her birthday and had mentioned several times, through opentable and also over the phone that my wife and I are newly married and are coming here for a birthday dinner and would like to be treated well, something I would have happily shown my appreciation for. Instead, when I spoke to the manager over the phone who called me to confirm our reservation, she was very dismissive and trying to hang up the phone while I was still explaining our situation. She hastily assured me that it would not be an issue. I saw it as a bad sign and was worried, but brushed it off.Arriving to the restaurant last night, our hostess seated us upstairs right between the smallest tables in the front end of the section between two other tables. For a private evening dinner, something to celebrate, I really disagreed with her seating choice and had to ask for something more secluded. Thankfully she was kind enough to re-seat us. Our server was friendly but hardly around. Yes, we did not order any alcohol so maybe she didn't feel like waiting on us much, but she really took very long between coming by, didn't mention the specials to us, and waited very, very attentively to both tables on the left and right of us. It was a little beyond obvious. With the prolonged waits between her short visits, we probably spent an extra half hour here. It was a little irritating. To top things off, she wasn't exactly super informed about the menu either.Anyway, we ordered the alma sampler, plus a ceviche to start along with the yucca. The yucca was probably the best out of the bunch. Ceviche was tangy and sweet and had corn or pine nuts in it, which seemed extremely out of place. It doesn't go with the dish at all and just seems like a far reach to try and add something unique in a place where it just doesn't belong. The textures are completely different and so are the tastes. If you can put corn nuts on it why not a freakin cracker jack? Makes just as much sense.The empanadas are good, and contain exactly two bites. The tacos, very very powerful taste of tuna and cheese, just OK. Nothing great here. Yucca was probably the best appetizer, a sort of denser version of a garlic tater tot.We actually ordered a lot of virgin drinks btw, which are still pricey and tried at least 4-5 of them. They were inconsistent. Some were filled to the brim with ice, others were only half full. Not surprising. Our food was also just alright. The black lentil cake was made well and tasted good too but was the only highlight of the dinner. The Arroz con pollo was okay. Plantains seemed out of place too, but were cooked well. Fried egg on top was also sort of random. I wasn't having a hangover burger, and it wasn't a quail egg, so what was it doing there? You have guacamole in the rice already. Adding a egg will not really add any creaminess to the dish, but it will make it runnier. Rice was undercooked. Flavor was not really bold, just subdued guac + chicken taste.The bus boys and food servers were very polite and friendly. They've somehow managed to avoid the bougie air emanating from the establishment.  If you believe yourself to be a 5-star restaurant, then you need to treat your customers so that they think the same thing, not show them your superiority."], ["Jessica S.", "Came here a few weeks ago with a friend for some drinks and appetizers. I've been before for dinner 2 years ago and was excited to come back. We sat in the downstairs lounge area which has nice ambiance and comfy chairs, though just be aware that you can't make a reservation for this part of the restaurant. We started with drinks, I got the picante pina which had a good kick to it that kept me wanting more. We were then served the bread.. now I distinctly remember salivating over these cheesy morsels a few years ago and was looking forward to tasting them again. I am not sure if they changed the recipe (were they always gluten free?) or if my expectations were just too high, but I was mildly disappointed.. they just weren't as good as I remember! The sauce was still delicious though. Oh well, moving on..We ordered the empanadas, the sweet plantains, the marinated beets, and we each got a tasting of 3 ceviches. The empanadas were delicious, but I wish the portion had been a little larger for a 14 dollar appetizer. Both the plantain and beet sides were flavorful and a good size portion for the price. For my ceviches, I got the long island fluke, the lenguado \"el fuego\" and the yellowtail. All 3 were fresh, light, and tasty. The lenguado was super spicy and I couldn't get enough. The long island fluke was pleasantly salty and well balanced with the ginger and sesame. The yellowtail was my least favorite but had a nice texture with the puffed quinoa. The ceviches came with a little bowl of popcorn and corn nuts. Definitely recommend coming here, but be prepared to spend a pretty penny, even if you don't get an entree. I'm sure I'll be back for dinner soon enough."], ["Mamta P.", "Good food..Good service..Beautiful space..Their pre-served bread and cilantro-garlic sauce is too good :)I think they can be little more generous in their serving portions but I guess choose quality over quantity.  Overall a good place for a dinner date or a group friends/family dinner."], ["Michelle B.", "Stopped in on a whim and sat at the bar. Best bartender ever - David - it was my first time and I will definitely be back. Must have his spicy margarita or black cherry caipirinha. And ask about his wing span"], ["Juliana K.", "4.5 stars. Phenomenal place. Food was great and service was excellent. Shout out to Craig, our wonderful waiter who was attentive and knowledgable. He really went through the menu with us in detail, from drinks to apps to entrees. Drinks were good. Mojitos are well done. Bacon dates were very flavorful. I liked that it was on an endive lettuce leaf which gave a nice crunch. Well balanced.Sea scallops were perfectly cooked. Crab and corn quinoa was exceptional! Vaca frita skirt steak was amazing! Tender like brisket yet had a crisp crust. Well accompanied with rice, beans, avocados, and tomatoes.Golden beets with pumpkin seeds were wow!Cigar dessert is so whimsical! A must try.Vanilla flan was very good. I liked the cherries that came with it.Great portions, great ambiance, great service."], ["Karina R.", "I had been in Alma de Cuba many times and I always had great experiences here. The restaurant is always clean and well organize, they have diferent color candles for you to seat for dinner or for happy hour. About their food, they have the Best ceviche in the city; My favorites are the yellow tail tuna and rainbow ceviche. The acidity, citrusy, texture and quality of the fish are perfectly in balance. On my last visit, The costumer service by Liz was top nuch..."], ["Kat P.", "Super sexy! Loved the ambiance! Perfect lighting,Great music. Good was exceptionally tasty! Having grown up in the Bronx, I know what good Cuban food taste like and the food was pretty dead on. My drinks were amazing as well. It was a black cherry something. Lol I can't wait to go back!"], ["Kristy Y.", "Food and drinks here are awesome. The atmosphere is very sexy, dim lights, etc. The second floor is very vibrant with a huge bright picture of a farmer. Great place for date night."], ["Liza K.", "A friend and I have been on a quest to find the best happy hour in Philly and this might be it. $5 apps, $5 drinks (including mojitos, sangria and wine) and $1 ceviche.We got there a little after 5 on a Tuesday and the restaurant and bar area had only a handful of people.  It was a nice change from fighting for a seat at the bar.  Instead, we sat at a cozy table and still got to take advantage of the happy hour specials.  Our waitress was attentive and helpful (we couldn't decide between some things and she gave us a helpful and honest answer - recommending the empanadas over another item).We had their two mojitos - and found that they were virtually the same.  Both were garnished with raw sugar cane, which added a little special something to drinks.  The Mojito Suave was a tad sweeter than the Classico, and was served in a bigger glass so I'll have that again next time.  Sounds like a better deal to me!We tried their smoked albacore tacos, which were really light and flavorful.  The menu says they are rum-cured and served in malanga boats - which just meant the fish was really creamy and light.  While they were topped with jalapenos, the real kick came from a spicy sauce. We also tried their Empanada de Verde.  They were remeniscent of fried raviolli on the outside, with a spinach and manchego cheese filling and served with and artichoke escabeche.  Even though they were fried, they didn't feel super heavy, but were the right amount of richness and creaminess.  I also tried the hamachi and rainbow ceviche - each $1 only!  Totally worth it.  They came in a shotglass with a small fork to make it easy to eat.  The hamachi was spicy - and the rainbow ceviche was a bit milder.  Both were excellent - fresh fish and good flavors!  Definitely a steal.I want to go back for dinner to sample their plantains and other dishes.  Alma de Cuba was a great find!"], ["Justine J.", "Great place to just lounge around.The drinks here are amazing!  I tried the Suave Mojito, Black Cherry Caipirinha, Passionfruit Caipiroska, Dark and Stormy, and Havana Old Fashioned.  All were amazing.  The Suave Mojito was nice and sweet with Barcadi Limon, lime, simple syrup, and mint.  The Black Cherry was pretty tart.  It is garnished with cherry preserves.  The Passionfruit was also great - with vodka, passionfruit, lime, and sugar.  You can really taste the passionfruit nectar.  It was like  a delicious passionfruit limade.  Dark and Stormy  with Gosling's Black Seal, lime juice, and ginger beer was also really good.  The Old Fashioned was also pretty tasty - you can really taste the bitters.  Can't come here without getting a drink or few!  It's also fun to sit at the bar and watch Christian make drinks.  That man is literally his own machine-operated assembly line.Watch out when you sit on the booth at the ground floor - the seats are so soft you sink right in. They give you two pieces of bread per person with their homemade dipping sauce that tastes like awesome chimichurri.Thai Mixto Ceviche (crab, shrimp, octopus, and fluke with coconut leche de tigre and mango) was AMAZING.  It was so smooth and nice and coconutty.  This is definitely a must try.The Oxtail Bone Marrow Croquettas was a wowwer too.  There was a big chunk of bone slicein half with marrow, topped with three generous croquettas topped with pickled red onions.  This was so delicious.  They could have cut back on the sauce that came with it.  This goes really well with the bread the give you!   The Royal Palm Dates were OK.  It was probably my least favorite of the starters.  It's almond stuffed dates wrapped in bacon with cabrales bleu cheese.As for entrees, the ribeye was AMAZING.  It was not fatty and it was so tender it melts in your mouth.  It  was drizzled with green onion chimichurri and came with yukon potatoes. The Crispy Roast Pork was okay.  It was rather fatty, but if you avoid those parts, it was flavoful.  The skin was nice and crispy, but it doesn't beat the ribeye!The Shrimp and Grits I could have gone without.  It was served in a bowl, and the grits were topped with baby shrimp which I was not particularly fond of.  I was hoping it came with grown ass shrimps.  I understand their logic however - many baby shrimps = shrimp in every bite.  But I still rather have big ones and cut them into smaller pieces."]], "Cuba Libre Restaurant & Rum Bar": [], "Tinto": [["Sten S.", "Have to give this place 5 Stars due to the delicious food and the wine list.Please bear in mind that I sat at the bar and only had wine by the glass but still took advantage of the full menu.Jamon Serrano / Manchego / Veal short ribs (going out of season so get here quick) and the duck...!Had the White Grenache (Glass) and 2 glasses of the Tinto Fino (2012).Doesn't get much closer to actually being in Spain than this. Here's hoping for gazpacho on the menu sometime later this summer!"], ["Alex L.", "Contemporary, urban tapas-style bistro in the Rittenhouse district.A friend and I came in early on a Friday evening. The place was still pretty empty. Tinto's dimly-lit environment is enhanced by generous wood trim and candlelight, which lends the place an upscale vibe. If I had one complaint here, it would be that we were basically seated elbow-to-elbow with our neighbors. Definitely not the best setting for a private conversation. We quickly picked several random items off the menu. While we were waiting for the food, our waiter brought out a plate of fresh-baked bread. Each bite-sized bun was buttery and warm, reminiscent of a soft croissant. The accompanying dip was a smoky, creamy chipotle sauce that really shined! Needless to say, this really got our appetites going.Our first dish was boquerones, marinated sliced anchovies wrapped around a mixture of pickled vegetables and pine nuts. The fish was tender and didn't have a fishy smell. But the pickled vegetables overpowered any subtlety the dish might've had -- I couldn't taste the pine nuts at all, only feel them crunch in my mouth. The entire dish was only three small bites, but I didn't want to eat more of it anyways. Next up was a seared pork belly canapé, thick slabs of seasoned and pan-seared pork on crisp bread topped with sliced green apples. Yum! The dish's sweet-savory flavors and crisp-soft textures contrasted nicely, and each bite came together perfectly.For our third dish, we chose patatas riojanas, crispy fried potatoes dusted with savory chorizo powder and decorated with caramelized onions and smoked paprika aioli. Think of it like french fries' rich Spanish uncle -- exotic at first glance, but the secondary flavors were too mild. Potatoes are pretty bland on their own and these definitely needed to present some stronger flavors to really stand out. Next, we sampled the green beans topped with dates, almonds, and orange. Everything was delicious in both texture and flavor... except for the beans themselves! They were tough and undercooked. Paprika sherry vinaigrette might have been a nice finishing touch, but these beans were practically drowning in the stuff. My friend and I forced them down so we could move on to the next dish.For our main dishes, we selected the braised short rib sandwich and organic herb roasted chicken. The sandwich came topped with tender slices of beef, chopped bacon, asparagus, and celery root aioli. Each flavor was distinct and the rich steak came through flawlessly. Everything was wrapped up nicely in a fresh-baked baguette. The chicken was tender and flavorful, but nothing special -- I've had equally good chicken many other places and wouldn't justify ordering this tapas-style again. We opted to skip dessert since the menu options are rather limited -- but fortunately, both Capogiro and Yogorino can satisfy your sweet tooth just a block away.I usually love Garces, but Tinto fell just a bit short. Each dish was paced perfectly and presented beautifully. The waitstaff was friendly and attentive. But the food was hit-or-miss. In particular, the overwhelming use of pickled ingredients and vinegar tended to overpower some of the more subtle dishes. I won't be in any rush to go back to Tinto, but might be willing to give them a second chance."], ["Richie R.", "Disappointed. I had been waiting to dine here for a very long time. And when I did, I left dissatisfied and disappointed. Dishes are tiny, over-developed and overly-complex, especially for something that is usually delicious because of its simplicity. Decor and service were good, but the food was simply not very good, especially at the prices being charged for them. Will not be coming back."], ["Krystal H.", "Went back for a late night dinner with my guy.  There was a short wait so we grabbed a drink at the bar in the meantime.  The bartender was not at all friendly.  The hostess was.We were seated downstairs in this cute little romantical candle lit corner couch; felt like a speakeasy.  We got the following:1.Serrano Ham-Wrapped Figs2.Prawns: Shrimp, Chorizo, Grape Tomato, Espelette Chile 3.Diver Scallops: Quince, Uni Emulsion, Parsnip, Crispy Serrano4.Lamb Loin: Eggplant, Bacon, Sherry Jus5.Green Beans: Haricots Verts, Almonds, Dates, Orange Segments, Paprika Sherry Vinaigrette6.Brussel Sprouts: Crispy Guanciale, Black Truffle & Pine Nut Escabeche, Meyer Lemon, Idiazábal7.SOPA DE CASTAÑA: Truffled Chestnut Soup,Duck & Mushroom Hash, Fried Quail Egg, PistachioThe Brussel sprouts were good but not great.  Boyfriend doesn't eat cheese so those were out for him.  I wasn't a fan of the green beans.  The parsnip that came with the scallops had vanilla in it and tasted exactly like a fire toasted marshmallow.  Server was great and we had a really nice night here."], ["Tiffany X.", "Tinto is a real treat. I've dined here twice for Restaurant Week and happy hour, both experiences have been superb. From the service, to the ambience, to the tapas, it's 5 stars all around.This is a great setting for an intimate meal with a small group of friends. You can each order 2-3 small dishes to sample a hearty variety and enjoy a filling meal. If you enjoy charcuterie & cheeses, order the mixto. Of the main dishes, we ordered and loved the pulpo (a small plate of marinated octopus), the pork belly (two succulent slices on bread, absolutely divine), the brussel sprouts (crispy and flavorful), and the albondigas (spiced meatballs served with a runny poached egg on top). Everything was delicious and beautifully plated, and more importantly, our waiter had a good understanding of pacing out when he brought our dishes, so our two hour meal over conversation had a nice cadence. Overall: A+ culinary experience, romantic atmosphere, attentive and personal service"], ["Grace T.", "Great place! The food was really good. My friend and I shared tapas. We got the sopa de castana (truffled chestnut soup), octopus, lamb brochette, duck, and pork belly. Everything was really good. My favorite items were the soup and octopus! Would definitely recommend trying those two dishes. The lamb came wrapped with bacon in 3 shooter glasses. There were two pieces for the duck and pork belly dishes. We also got a pitcher of the white sangria. Our bill came out to ~$130. Pricey dinner, but very good."], ["Taylor G.", "We made reservations at Tinto so we could bring relatives from out of town somewhere nice, and it did not disappoint. The atmosphere was awesome, with wine bottles lining the walls and an exposed brick interior, and the food was incredible. I loved the duck confit and the pork belly in particular, but noted that all of the meat was tender and flavorful. Other favorites were the brussel sprouts, the patatas riojanas, and the marcona almonds. The charcuterie was a delight, too, and my parents seemed to enjoy the sangria greatly. I will definitely be coming back here--I love a good tapas restaurant, and Tinto's Basque influence really sets it apart from the rest."], ["Anton Y.", "Took my family here for a birthday celebration. Great food, every single thing we ordered was incredibly delicious. Staff was very friendly and attentive."], ["Vivian T.", "I love Tinto before tonight's dinner. I booked dinner for tonight bc it was the only day not on restaurant week, I want a la carte not pre fixed menu.  All of a sudden I found out there doing rest week tonight, uggh wat a disappointment. We went to dinner and had these super tiny tiny tiny mini apps as our app and main course:- Serrano ham wrapped figs/chorizo sausage: blah you can make this at home - French onion soup - which was deconstructed and was basically beef stock and BOOORING!- chicken skewers w grapes - smaller then their normal night size and not in the shooter glass... So disappointing-free range chicken: u usually get two Brest but they only gave us one for restaurang wk... Not cool- octopus was yummy but soooo tiny-pork belly crusti was super good but two tiny pieces -meatball w poached egg: B+ I'm disappointed and sad that I no longer love and rave abt this place bc they participated in rest wk and skimped on portions.I give the a A+ for service and a B- for food and D for portion size. After dinner, we went to get sticky rice bc we were still starving ! If u go to Tinto go full lol or better yet stay home bc you're not missing much."], ["Abby W.", "My sugar momma brought me here for a girl date night with a $100 gift certificate she had kicking around. We were both thoroughly pleased and satisfied with our meal, with only a few small gripes here and there.We opted for a la carte rather than the tasting menus, and I think that's the right choice for this place. Unless the high-end menu includes the jamon iberico, MP that night was $35 for 1.5 oz, then I really don't think either tasting is worthwhile. We ordered 5 plates to share and that was more than enough, with a little room to spare for a shared dessert at the end. The server provides a good guide for selecting dishes - the ones on the top half of the menu are smaller, while the bottom half are larger. We opted for 1 pinxto (pronounced peen-choh), 1 vegetable, 1 seafood, 1 soup, and the paella. You MUST order the sopa de castana if you like truffles. It is a very rich, creamy, satisfying chestnut soup with a lovely duck and mushroom hash and a pronounced truffle essence. One of the best things I've eaten in a long time. I just found a recipe and will be trying my hand at it over the holidays. Next came the dungeness crab croquettes, which are nothing like a true Spanish croqueta but were delicious nonetheless. I loved the tomato jam and avocado puree under each crispy little sphere, and they were packed with crab meat. This item is from the bottom half of the menu but is on the smaller side, which I expected. Definitely worth trying but not an item to chose if you're trying to add a lot of substance to your order.After the dungeness came the brussels sprouts, which I enjoyed because I pretty much always enjoy brussels sprouts, but it wasn't super special. The citrusy gremolata on top was a nice contrast to the richness of the cheese, and the sprouts were perfectly caramelized. I wished that it had come with some more substantial rendered chunks of guanciale rather than just the thin, crispy shaved pieces, but they did add a nice crunch and porky flavour.Next came the lamb loin pinxto and holy sh*tsnacks, Batman, that was the most delectable lamb loin I've ever eaten. It was served on skewers, standing up in a shot glass filled with parsnip puree and sherry jus. They were nice a crisp on the outside, tender and juicy inside, and the shot glass mixture was perfection. That sherry jus would make an old shoe taste good. Very rich, and a bit salty, but really really good.Our final course was the paella, and this is where they sorta lost me. I really should just stop ordering this at restaurants because I make phenomenal paella at home, and it's so much better when it's fresh. It was good, don't get me wrong, perhaps the best restaurant paella I've had in Philadelphia, but it was lacking on a few key points. While the cast iron dish does a good job of developing some of the soccarat that is the best part of any paella, the rice was a bit too mushy and it was obvious it had been made many hours earlier, which makes sense but takes away a bit from the flavour. It also only included two of the tiniest pieces of rabbit I've ever seen, albeit tasty, well-seasoned, and not dry and one big shrimp, served head-on which was nice but still a bit stingy. This is an $18 dish and contains primarily rice, which is fairly cheap, a miniscule portion of rabbit, and a single shrimp. It's good that it serves as a filler to round out your meal in a way that isn't super rich like the other dishes, but it was a bit of a let down.We saved a little room for dessert, which was a fine choice. We asked the server to pick for us from a narrowed-down selection and he suggested the chocolate tart. This was probably the best course of the meal, for me. It was a rich, thick dark chocolate ganache in a chocolate crumb crust, with a streusel crumble, smoked marcona almonds, and nutella ice cream. The ice cream was pure perfection, so smooth and creamy, and the salty crunch from the smoked almond crumble was the perfect contrast. It hit every note- sweet, salty, smooth, crunchy, cold, creamy. Next time I come here I may order just the soup and this dessert.Our subtotal for 5 dishes, a pitcher of sangria (get the red!), and a dessert was only $118. That's about $55/person but included drinks, so I feel like we definitely got a better value than with the tasting menus. I could not possibly have eaten more food. Service was excellent- we never had to pour our own refills, water was kept full, and the pacing was perfection. The entire meal was a little over 2 hours, which was just right for the number of courses and gave us a chance for a really nice catch-up session."], ["Ashley O.", "This is the best Spanish tapas I have ever had! This is by far my favorite restaurant in Philadelphia, and the food is absolutely to die for! It has a great romantic ambiance, and the food is relatively priced for the quality. I think Amada is higher regarded but I would recommend tinto over Amada. It's less expensive, better service, and better food!"], ["Dan C.", "Great spot for Restaurant Week.  Every one of the 10 plates I had a bite of was delicious.  Highlights included the ham wrapped duck, the gazpacho, and the creme brulee style dessert.  Service was quick and efficient.  Pricey no doubt, and the portions were small, but it is a tapas style place so that's to be expected.  Definitely worth a trip for some of the best food in the city."], ["Jada L.", "I keep thinking and going back and forth about which Garces restaurant is my favorite: Tinto or Amada? Tinto or Amada? I think Tinto is winning in my mind.My date and I came here on a Sunday night. We had the pleasure of having Michael as our server. He was very friendly and voluntarily explained the menu in great detail to us. The food came out in a timely manner; we never had too much food or not enough food on our table.I am not going to list everything we ordered and ate; everyone has already done that and I cannot add anything that has not been said! The musts to order are Figs, Albondigas and Lamb Brochetas. I would be willing to go back within a month of my first visit to try more off the menu!"], ["Cynthia X.", "Came here for restaurant week with a few friends and had a lovely time. While the restaurant weekend menu was small, it allowed us to sample several of the items on their full menu. 3 star food, 4 stars for a good environment and a good time. Verdosa salad: fresh, though nothing spectacular. Figs wrapped in serrano ham: though it sounds delicious in theory, it tasted strange when combined. I took mine apart and ate the pieces separately.Chicken brochettes: Juicy, tender, love the grilled grapes, but can't really taste much of the truffle jusChorizo Pamplona: Very thin cut, but very deliciousAlbondigas: flavorful with a delicious poached egg. The meatballs themselves were a bit tough.Pork Belly Montadito: My favorite of the night. Melt in your mouth pork belly. Yum!Pulpo: Also delicious and extremely flavorful, a close second to the pork belly. Cut into very small pieces, it has a great texture. Duck Montadito: This paled in comparison to the pork belly. The duck was tough, dry and way over-cooked. I did not enjoy this at all. Felt like such a waste of stomach space.Organic Chicken: My friend ordered this because she figured no place can mess up chicken. But, this was the worst dish of the night (though the largest). Actually, I can't decide which one I liked less, this or the duck. It was so dry, and the skin was burnt (not roasted or grilled, but beyond that). The only redeeming factor was the tiny side of brussel sprouts and potatoes. The desserts were fine - a good way to round out the meal especially since I still wasn't full yet."], ["Kyle C.", "I am thrilled to finally be able to write a stellar review of Tinto.  I live in LA now, but when I used to live in Center City Philly I would take my girlfriend at the time every few months.  It was and still is her favorite restaurant, so when I found out years ago that Tinto had a private dining room upstairs, I kept it to myself and decided that someday it might be a good place to propose.  Sure enough, last month I did just that during our visit to Philly, and the Garces Events staff spent the prior 6 months helping me to plan the perfect proposal and celebration there.  The food was delicious, the wine was wonderful, and it was truly a night to remember.  Special thanks to Stephanie at Garces Events and the whole Tinto staff for helping me pull it off as a complete surprise to my fiancee!  They even through in a free round of bubbly for all 22 of us in the room.  Tinto is unquestionably one of the best restaurants in Philadelphia, but most people don't know about their ability to host events/parties upstairs.  No matter the occasion, Tinto is the right place to go."], ["Laurice S.", "Good sangria and OK sized portion tapas for sharing for 2 people. It was good but wasn't memorable enough for me to say I want to return. However, I tend to be picky w/ tapas only bc I've been to Spain to experience real tapas and eaten a good amount at my Spanish friend's homes. There was something about these tapas that didn't feel authentic. Chef Garces' other tapas restaurant - Amada, is much better!"], ["bill m.", "Let me start by saying I am a huge fan of Jose Garces restaurants. Tinto really blew it for me. We happened to go during restaurant week and we were only able to choose from a very small menu. The normal menu was not offered for the week.The apps were embarrassing, the figs wrapped in prosciutto were lame, my 10 year old can make them. The chorizo was simply 8 slices of chorizo, it tasted like salami. The onion soup had good flavor but wasn't anything special. Chicken brochettes were terrible. Dried out tiny bits of chicken with a flavorless sauce. Entrees were better. Octopus was very good. Kale rice bomba was ok but boring. Duck and pork belly breads were good but again underwhelming. Skipped our already paid for desserts because we just wanted to get out! Will try again when it's not restaurant week just because it's a Garces restaurant and hope this was just a bad night!"], ["Joyce B.", "Went there with one of my favorite girls. Love this place. The waiter has a great sense of humor."], ["Rosa C.", "I took a girlfriend to Tinto for her birthday, and had a wonderful dinner.One confusing point: the brochettes are skewers and the canapes are like bruschettas. But our server was kind enough to explain that before we ordered. Before our orders arrived, we were provided with a complementary appetizer. I wish I could remember what it was because it was oh so delicious, but it was basically small cheese bread poufs. They were fresh out of the oven and the warm and soft cheese bread just melted in your mouth.  The kobe beef canapes were oh so tender and delicious. The duck canapes were cooked perfectly. We also ordered the green beans, which was good, but nothing too special. This is the second Jose Garces restaurant that I've been to (the first being Distrito), and I must say that Chef Garces really knows what he's doing! I will definitely be returning to try the rest of the menu!"], ["Irakli N.", "Very classy. Each and every tapa looks and tastes like a work of [culinary] art. Obviously portions are tiny and the place is on the expensive side, but very nice overall, especially for a date or a special occasion."]]}