{"Bleu Sushi": [], "Izumi": [["George R.", "Finally went here after eating everywhere else in the neighborhood several times.  My gut was always telling me that this place was nothing special, probably mostly because nobody ever talks about it in my foodie circles. So we went and it was pretty disappointing.  The portions were small, the flavors ok, and the prices too high.  In addition to some sushi selections and other special rolls we tried a ramen/pork belly special and it was so-so.  The pork belly was tender and delicious but the broth and noodles were not worth more than a couple bucks (the bowl was $16).  Good place for people stuck in South Philly with a bottle of wine craving sushi; mediocre place for someone with options outside of the neighborhood.  I'm surprised this place gets four stars average on yelp; could be because I was there on a bad night, and/or Philly has low standards for Japanese restaurants....."], ["Shirley Y.", "Disappointed. I love live uni and when I saw it on the menu I had to try it out. The uni did not taste fresh and for the price, I felt ripped off. I ate fresh uni many times and the taste was definitely off. I got some negiri as well. They were priced per piece, expensive and tiny. If it was good quality I'll happily pay it but definitely nothing spectacular. I felt like I can have the same quality elsewhere in philly for the same price. Will not go back."], ["David A.", "Fantastic! Went there Saturday night for the first time and was very impressed. Nice atmosphere and great on a nice fall evening with sliding window for total open air dining. The special appetizer of soft shell crab and shitake mushrooms was killer.The sushi and sashimi was ultra fresh and rolls were creative and delicious. Service was friendly and on target.We will be back."], ["Miles M.", "Delicious the gyoza and rock shrimp tempura apps were amazing and the small sushi & sashimi was a perfect portion for two make sure to bring your own booze and enjoy the freshness and great service"], ["Ling P.", "Fresh ordered sushi sitting on the counter for 15 minutes before it gets to the table makes it NOT so fresh. The server barely checked on my table as we're low on dopamine, our glasses are less than half filled, and our impatience level rose. We stared in torture at the sushi we ordered just sitting so deliciously on the counter. You would think that such a small restaurant such as this would be easy to maintain, but apparently it wasn't for these servers and they weren't even packed. Ha!Before our drool almost hit the table, we finally got our sushi...*hallelujah***drumroll**The sushi rolls were nothing spectacular. *womp*womp* If you ask me, they were bland. It tasted like spaghetti with no sauce. Incomplete. I had to soak it in soy sauce & wasabi to taste anything at all.Let's just say I wouldn't come back here again. It's pricey and not worth it."], ["Juliana K.", "One of my fav sushi places in the city. Cozy and intimate place. Service is great- waiters always know their sushi! They usually have some amazing specials- I had some special eel once that they marinated three days in three different sauce...it was worth it! The sushi is always fresh and delicious. Some are a bit pricey, but worth it. Love this place."], ["Moira I.", "I can't even. As far as sushi in Philly goes, if you love it and don't eat here immediately I fear for your sanity. Seriously. I have been hearing about this place for quite some time and finally got around to trying it out. I'll be back every chance I get and get the cured eel dish each of those times. Oh man, and the sashimi? To die. That caterpillar roll is like a texture tsunami that floods your taste buds with awesome. Did I skip the part about it also being hugely vegetarian friendly? Because our server (the service was great all around and our server was a gem) suggested some off menu options to my veg BF and darn it if those weren't some tasty rolls. Basically, go here. A lot. Try stuff, ask questions, relax because the staff will help you and it will be glorious."], ["Monica H.", "Incredible! I was in search of a good japanese restaurant in philly and my coworker recommended this place. The sushi is so fresh! The toro., omg, you have to get the toro! It just melts in your mouth. Amazing! The service was excellent. The waiter was very nice and smiled the whole time, from beginning to end. Made my visit there very comfortable. I didn't feel rushed and the waiter knew the answers to all my questions and even gave great details on their specials. I would definitely come back again.. and again.. and again."], ["Dennis N.", "I like going here because the food is pretty good and the prices aren't at bad. I don't usually have a bad time except for the one time a few weeks ago. My friend and I decided to go to Izumi for dinner. They seated us outside and it was nice to sit outside on a summer evening. Our waiter was named Andy and we felt as if the whole time he ignored us for a bunch of blondes next to us. He quickly rattled through the specials, not really giving us time to decide and would disappear for longer than necessary. But he was always at the other table's beck and all.  Probably because they were a bunch of nice blonde girls. He brought them out free samples and generally just chatted them up. There was even a few times that he sat down at their table to chat some more. When we asked for the check, Andy casually threw the check on our table and walked away. The food here is great but beware of some bad employees. But it's fine if you're a pretty young thing."], ["Vinny P.", "Thank you Izumi for being a wonderful restaurant in Philadlephia not that far from where I'm moving.I was also there for the Omakase on a Tuesday evening.  I agree with Hayley's review saying that it was a good portion of food for the price.I thought the duck they made was something spectacular.  It was cooked three ways!  I remember having a piece and thinking \"this is too complex of a flavor for only one cooking method.\"  They didn't tell us exactly how they made it other than it was (1) rendered, (2) seared, (3) roasted.  I would have gladly accepted just one of these.  To do all that to the duck and still have it medium rare and as tender as it tasted was so great.  I can't even rememeber the side.  I know it was great, but my mind keeps running back to that duck and the one fleeting piece I had of it.Super great service and a very nice decor.  Such a great little spot for sushi."], ["L B.", "I want to like this place since it's right around the corner from me, but it's just less than mediocre sushi and way overpriced. The rolls are undersized and the fish is not very fresh. Good location, bad sushi, worse prices."], ["Julia B.", "The food might be AMAZING, but I have no way of knowing.  We were seated and then promptly ignored.  We were seated in the square, so we expected that service might be a little slower, but it was ridiculous.  A VIP couple came and sat down after us.  Our server spent several minutes telling them about the menu, giving them all kinds of attention, and didn't even acknowledge us.  It looked like it might have been the owner/friend of the owner at the next table over and I get it, sometimes you give more attention to a friend of the restaurant, but after waiting for about 15 minutes with nothing but water and our menus in front of us, we decided that it was enough and decided to find somewhere else to eat."], ["Jade J.", "Omgggg I have been to almost every Japanese restaurant in Philly, Izumi is by far the best japanese restaurant in Philly! All their dishes are awesome. Although their location is quite remote from the city center making it a little inconvenient, but their quality of food makes up for this!!! Service: very professional and made great recommendations. Here are some of my favorite menu:1. Special monster rolls (my favorite. It is so good that we ordered the second one) 2. Tuna (in small platter section)3. Surf and turf ( this is a special menu and it was awesome!!! It consist of perfectly cooked medium rare wagyu beef and seared scallop) 4. Seared scallops (in small platter section)5. sunomono (good for light appetizer but some may think that it is not that great compared to other alternatives but I still like it) 6.uni sashimi is awesome. (But if u don't like sashimi then u might want to skip this. Their scent can be strong for those who are not used to uni) 7. Pan seared scallop (large plate section. I think this menu is good but not great as compared to other menu I just recommended but if u are a scallop fan like I am, you will like this menu too since the scallops are served with mashed taro blended with potato and some vegetable purée which is so good) However, there are some menu which I think is so so:1. Passyunk avenue roll2. Tuna wasabi salsaAs for dessert, their chocolate bread pudding served with coconut ice cream is superbbbb. Love it!! We also ordered lychee creme brûlée, which is also good but a little too sweet in my opinion. (But please note that I like not-too-sweet dessert so my standard of how sweet things is might not be accurate compared to most other people haha)"], ["Ac A.", "Excellent customer service!!!  Service was  great and the food was very good!  The sushi was good"], ["Naseem B.", "Spicy Tuna and Rainbow Roll = PERFECTIONService is perfect. I am in love with this place. BYOB. I can't wait to go back."], ["Rahrah R.", "Sad excuse for a sushi restaurant.I've never been to Japan.  But I've had pretty good sushi in Palo Alto, San Francisico, and Los Angeles.  I've even had some decent stuff in Austin, Atlanta and New York.  I usually order simple things like eel, tuna, and salmon.That was my first approach at Izumi, to order eel, tuna, and salmon.  But the flavors didn't stand out so I figured they were a roll place.  I picked a roll, and didn't like it, so asked the waiter to recommend something.  That didn't work out either.The staff was gracious and pleasant, but I couldn't imagine returning for more."], ["Carlo D.", "Fresh clean tasty"], ["Soneyet M.", "Place rocks! The tempura was amazing and the fresh fish was delicious. The server was highly educated in the world of sushi and my uncle remarked that he has only seen the fish offered at Izumi in Japan. PRETTY COOL Izumi is a staple for us and we continue to come back. The specials are amazing. I can't wait for the warmer months so we can take advantage of the outdoor seating!"], ["Angela A.", "One night my husband and I decided on a whim to go to Izumi.  Again, I am out of my comfort zone, but enjoying doing this more and more.  When we arrived, there were no tables available, but the young man that greeted us said he could seat us at the sushi bar, which was fine with both of us.  We were lucky enough to have the seats right near where the cooked dishes are done and able to talk to the chef.  Now I have not been eating sushi for very long and I have been less than adventurous with what I have chosen.  Tonight was a bit different.  Along with the selections I usually choose, Philly Roll, California rolls, we tried some other selections suggested by the server.  He was very helpful and able to explain the different dishes and how they are prepared very well.  We made our selections including dishes with eel sauce (eek) and kobe beef (which of course I ordered well).  The eel sauce was yummy, I was surprised.  All of the sushi selections were very delicious.  Getting to the kobe beef dish.  I did order it well, I don't like pink meat.  The chef asked if he could make a suggestion saying that this cut of beef doesn't fare well when cooked in this manner, but assured us if that was what I wanted he would do it.  I decided to throw caution to the wind and told him to cook it the way he thinks it should be done.  I don't think I have ever had a better tasting piece of beef.  It was a while ago, so I don't quite remember what the desserts were, but they were extremely yummy.  We had no leftovers of anything!  I'd like to go back to the service we received.  On this Thursday night the restaurant was full, as was the sushi bar.  There was one server who also served as busboy.  We received the most amazing service!  Not once was he neglectful, he did not fail to fill our water glasses at all times and food was served timely.  What a wonderful experience and I look forward to another visit to Izumi sometime soon!"], ["Melissa W.", "This is a nice sushi place. By 'nice' I mean classy decor/ambiance and fancy-looking food in minuscule portions. I understand this is sushi, and sushi comes at a price. But when you spend $60 for two people and still have to stop at Wendy's on the way to the movie theater afterward, the tiny amounts of food better be pretty amazing to be worth it. The $25 sashimi platter comes with precisely 15 small and pretty thin but artistically cut slices of 5 kinds of fish. Two were your standard salmon and tuna, and the other three were fluke, mackerel, and something like snapper or yellowtail, I don't quite remember. While the sushi here was marginally better than many less-expensive sushi restaurants, I'm not sure it was worth the price markup. For me, there's a threshold where, once sushi is reasonably good, I care more about being able to get full without breaking the bank over minute improvements in fish quality. That being said, the sushi here is pretty tasty (especially the spicy tuna maki and the mackerel sashimi). If you want to impress someone with a fancy sushi place and spend a lot of money in the process (I would guess ~$100 per couple to get full), then this is your place (or Morimoto, I guess). If you just want tasty sushi at a reasonable price, there are plenty of better options in Philly."]], "Kabuki Sushi": [], "Fuji Mountain Japanese Restaurant": [["Yingbo W.", "Awesome sushi! I was impressed with the sushi plate arrangements. I liked how they actually took time to arrange your sushi into a nice pattern on your plate and make it look fancy no matter what you got.I also liked how the specialty rolls here are actually worth your money and are twice the size of a regular roll with twice the fish and beautiful presentation as well. A lot of other sushi places scam you by covering a regular roll with a bunch of mayonnaise or cheap toppings and charge you extra by calling it a specialty roll. My only minor complaint about their sushi is that for the cucumber in my Alaska roll, they did not julienne the cucumbers to thin spaghetti-like slices. Instead, the cucumber was just one whole piece. It ruined the texture of the roll. Cucumber skin is tought when you have to chew through a whole piece.Service was okay during lunch, nothing spatacular. My table of 4 regrettably did not get our teapot refilled in our 1 hour lunch so the waitress did not seem very attentive.I would definitely come back here to try more dishes though!"], ["Shannon L.", "The karaoke rooms are great if you have a big enough party to meet the required tab. Although the selection is missing some classics. Ordered the yaki shrimp which was very tasty as well as my blackberry passion cocktail."], ["David A.", "I liked the environment and service......but the rolls are way overpriced. Beware, when selecting ala carte, you'll receive two small individual pieces of sushi.  Further, even with the specialty rolls, they do a very poor job rolling the sushi. I'd recommend Fat Salmon for better sushi, better prices, and a cool environment."], ["Linda Z.", "Great place! Only reason why Im giving one less star is because the booths were too small for the group of us. The waitress suggested us to take two separate booths, but the group wanted to remain together and hence two people were practically half sitting on their seats. I just wonder why they dont have bigger table for bigger groups. The sushi was fresh and tasty. We got the \"boat\", which was actually a tray. There is no complain for that, maybe a bit expensive but I guess the quality makes up for it. The waitress serving us was very nice too. The waitress was well informed, they definitely hired a person who knew what she was talking about and not just plainly serving the food."], ["Olivia N.", "Came here during Restaurant Week and both the staff and the food are speedy and spectacular. It was definitely crowded but the wait wasn't long and the food came out one after another. We were never left waiting! We will definitely be back."], ["Jo L.", "Disappointed =( This was one of my favorite sushi places for my boyfriend & I so we came here last night for dinner.We had the TASTY roll from the special's menu and the INFERNO roll. It wasn't that the fish was bad but the rice was way too thick. Too much rice! If you fix that then we're good! The fish were tasty though; essentially the Tasty roll. I liked the torched fish on top but I'm sure the torching has to be bad for you.The boyfriend had the CHICKEN KATSU which came out with 2 big pieces of chicken that were nicely fried. I normally don't like chicken katsu but this one was good.The women's bathroom floor was sticky.. Besides that and too much rice on the rolls, I like this place.We also had SALMON TARTAR but I can't judge this too much cause I don't really like tartar."], ["Rizwan A.", "Came here again and faced plain and simple discrimination. Never coming back. Hey manager, learn how to run a business. Peace!The host who greeted us at the door offered to seat us at the bar. This is an unusual request. Normally, couples aren't seated at the bar. We asked for a table and the host said that the entire restaurant is full. We could easily see over his shoulder and there were plenty of empty tables. We asked and he said those tables are reserved, and this was certainly a lie, as if these guys take reservations we would have been asked for ours, which we weren't. Nor have I ever been asked for a reservation before when I have been here. Then we asked if there are seats upstairs. We are lied to once again as the host says no sorry there are no seats upstairs, we are full. When my wife and I turned to leave, suddenly the host remembers that there are about six open tables upstairs and asks us to come upstairs but refuses to let us sit at one of the proper tables and instead offers us a table with one regular side and one half bench with no back on the other. No thanks. I left. And I won't be back. And I will ask others to avoid this business as well. Thanks anyway. PS The host or manager who tried to play us like fools should consider the fact that maybe other people have worked in the restaurant business and know a thing or two about that \"we're full\" or that \"table's reserved\" game."], ["Shintaro K.", "What I had: \"Super Fuji\" an assortment of 10 nigiris and a Cali roll with real crab.My benchmark: Sushi Yasuda and Sushi of Gari (Both in NYC - no use in applying my benchmarks in Japan)What I thought: Edible. 2 of the 10 were bay scallop - variety would be appreciated in a set deal like this. Fatty tuna - definitely not your top shelf tuna...or even if it was, the aging was applied incorrectly.To Fuji's defense, I arrived at 10pm on a week night."], ["Nicole M.", "I booked a private karaoke room for my birthday and had an amazing time. The staff were very friendly, helpful and attentive and we never had to wait long for our drinks. I can't speak to the food because we didn't order any, but the karaoke room was clean, comfortable and spacious and the song selection was a good mix of newer pop songs and some classic karaoke picks. I had the room booked for two hours but there was no one booked after us so we were able to extend it for another hour. Since our tab exceeded $500 the room rental fee was waived. It was kind of difficult to split the check among the 15 of us at the end because no one was paying attention to how many drinks they ordered or how much each one costed, so just be aware of that if you go with a big group. After our time was up we all talked about how much fun we had and that we can't wait to go back again soon!"], ["Matt G.", "Pretty authentic, almost there. They do a good job accommodating you and the fish is fresh...I only had the rolls so don't know about other foods but the rolls were quality. It's good that they're open late too."], ["Bill M.", "I came, I saw, I had a whole room doing gang vocals to \"Livin' on a Prayer\" by Bon Jovi!For a fun filled karaoke party with plenty of sushi and shochu it doesn't get much better than Fuji Mountain. The party room well accommodated our party of 20+ and came with comfortable red couches, good lighting, its own bathroom, and a nice sized video screen. Along with plenty of shochu and sake options the drink menu yielded a decent variety of wines, cocktails, and beers like Kirin Ichiban and Dogfish Head 60 Min IPA for decent prices. And the food menu touted the decent sized portions of the sushi, dumpling, and noodle dishes that you'd expect.The one issue I could give was that the karaoke book was listed by song title instead of artist, making them harder to navigate through. I was also sad to see some essential songs that you'd expect to see in such a book like \"White Wedding\" by Billy Idol and \"Psycho Killer\" by Talking Heads missing. And while it was completely weird and perfectly random, I did love the odd vignettes that played during the songs, and wondered what romantic yet tragically awkward situations we could lead the characters in them through. Whether you're someone who just likes singing along to the chorus with a bunch of people, or you prefer to belt out the high notes of \"Don't Stop Believing\" by Journey (guilty!), Fuji Mountain is a whole lot of fun."], ["Emin S.", "Been going to fuji mountain for 5 + years. Food consistency perfect. The restaraunt can have a little facelift. Other than that probably best sushi in town in $$$ range."], ["Elliott S.", "This place was everything I hoped it would be! Had a King Crab California Roll and Salmon. Washed it down with an Ichiban and some house Saki. Excellent all around!!"], ["Chris B.", "Phenomenal sushi.  Even my sushi friend met a few fish that he had never eaten- white tuna!  Awesome!  So fresh and delicious!"], ["Danielle D.", "First, Fuji Mountain participates in Sips, so going there on a Wednesday night was awesome.Second, THEIR SUSHI IS PHENOMENAL! My boyfriend and I shared 3 rolls: spicy tuna (his choice) and the Florida and Fire roll (my choices). The spicy tuna was to be expected and I have yet to find a spicy tuna roll that wasn't agreeable. But the Florida and the Fire rolls were just that- FIRE. I used to be of the opinion that all sushi is either good/fresh or bad. Fuji Mountain made me change my outlook on sushi. It didn't hurt that they served Hoegaarden and made a delicious and fresh seaweed salad.We were a little concerned because of the lack of diners, but we need to keep in mind that it was a Wednesday night. But the service was good, the food was great, and it was a quiet reprieve from bustling Center City."], ["Karina G.", "Authentically Japanese - from the food to the restaurants interiors. Food was delicious. Service time also good.Expect to pay more than what you would at a sushi train. Enjoyable night out!"], ["Becca D.", "Was craving a bento box and was impressed with the portion size. Sushi was pretty good, but nothing to write home for I guess. Service was less than stellar. Came during lunch and it was absolutely not busy, but our server kept disappearing for 10-15min at a time when we were trying to pay the bill. It was a weekday so we were trying to keep to our hour lunch break, but easily pushed into the 1.5 hour range. Overall, not an amazing place but not terrible either. I'd probably try out some other sushi places (geez there are so many right on that block) before hitting this place again."], ["Sylvia O.", "Very good sushi and excellent service. They have a very good menu and plenty of seating. Would be great for a group gathering."], ["Michael W.", "Fuji Mountain is a late-night sushi place mainly intended for those stumbling out of the pub at midnight (you know, the pansies such as myself.) well I was not drinking prior to my arrival here, but they may have earned another star or two if I had been. I ordered the shrimp tempura roll, custard roll and some other vegetarian roll I cannot pronounce. The staff was friendly, and the gentleman serving me seemed to be pretty new. They were quick to refill the water glass, but the food took an inordinate amount of time to arrive. When ordering, I informed the server that I am allergic to avocado which he repeated back to me and said okay. When the rolls arrived one of them still had avocado! I informed the lady of this and she promptly took the whole plate back to the \"sushi man\" and had it remade, supplying the food on a new plate for which my respiratory tract and I were thankful. The food was mediocre, nothing seemed to stand out. It was reminiscent of grabbing sushi to go from a manhattan deli or supermarket that has been pre-made hours before. I was very much disappointed but they were also the only sushi place I could find for a good distance that were open this late, so they are at least doing that right. I've read they also have karaoke, though I think that is in private rooms so call ahead. Note: no wifi"], ["Vivian T.", "I was invited here last Saturday night for a karaoke bday party and was a bit skeptical I would have fun. And I ended up having a blast! We were in the red room and the service was exceptional. You basically ring a door bell and someone shows up take ur drink order and delivers them correctly and fast.  The wait staff was patient and very polite, A+ for service. So I decided to try the food and once again , I was pleasantly surprised at how yummy it was.I didn't give this place 5 stars bc these are the 2 area they can improve in : 1. Please more current karaoke song selections and 2. Please personalize the bday celebration w maybe a comp desert w candle or birthday shot for bday boy.., something to mar the person feel Special.Otherwise. I recommend this spot for big group gatherings and fun! Side note, make sure u reserve a room in advance!"]], "Doma": [["Natalia P.", "I have only been here once but was over-the-moon impressed. We took a nice walk along the Schuylkill River Trail to find ourselves in Fairmount Park on a Sunday night. This restaurant came up as I scavenged through Yelp reviews. First off, the restaurant decor is modern-looking and festive. Just the right amount of hanging lamps and glass chairs. It's strange, but even the bathroom here is beautifully decorated and kept clean. I really like the waiters, not too pushy and full of recommendations. Our glasses were always refilled but I didn't feel like someone was hovering above us to clear the table.There is a wide selection of specialty sushi rolls on this menu. If you are looking for the $5-8 rolls or cheap deals, this isn't that sort of place. The specialty rolls run at $13-15 each but they are really worth the price, super filling with about 9 pieces. We got the ISLAND ROLL, MEDUSA ROLL, and DOUBLE SPICY TUNA plus SEAWEED SALAD and MISO SOUP appetizer for 2 ppl. We left just the right kind of full and in the best mood. I will definitely be coming back here with family and friends. Since the restaurant is small, I would recommend a reservation on Friday and Saturday evenings. Next time, I will bring my own wine as it is BYOB."], ["Neil S.", "So much delicious food! and not just sushi, theres so many appetizer and entree options available as well. The dining room is cute, kinda small but i think they take reservations. Server was very sweet and our food came up relatively quickly (we ordered a ton)Doma is closed on some week days which kind of stinks so make sure you check the hours before you head over"], ["Jesu P.", "DO NOT GO HERE!!!! A roach about 2\" long fell on the back of my friend's neck from the light fixture! The wait staff killed it and acted like everything was normal. I was way too disgusted to even eat there and walked out immediately! ROACH ATTACK!!!"], ["Tiffany L.", "I had heard from a couple friends that this place was the best sushi in Philly.....eh it was OK, not super amazing. Granted, I got sushi that wasn't crazy (like covered in mangoes/avocados and 5 different sauces). The sashimi was HUGE, like literally chunks of fish, it was more like a serving for 2 people rather than 1 piece per person. My boyfriend and I had also ordered their hot bibimbap -- which was probably our favorite thing we had to eat, surprisingly. The flavors in the beef bibimbap were great, and it was very filling. This place is also BYOB, just keep that in mind!"], ["Gary G.", "Ughhh...get it together yelp. This was the worst sushi ive had in a long time. I was so excited to eat here..various yelp threads ive read praise this place to end of the world and back. We ordered 5 rolls..so we sampled alot of different things...and when the california is the best, and by a wide margin, something is wrong. Service was fine..lol..but everything was fishy, sopped in sauces, with ridiculous amounts of rice. The novelty tuna club was a glorified rice sandwhich. Ill stick to almost anywhere else...im still just so disappointed w how bad it was."], ["Jessica B.", "Though I have to admit I'm not a sushi snob, and am usually satisfied with the standard spicy tuna roll, I am also a sucker for the fun specialty rolls places like Doma have perfected.  It is on the more expensive side for sushi, but nothing outrageous and believe me the sushi is worth it.  Its also BYOB so that always helps! The atmosphere is very pleasant, and bright, its fun but not overdone.  It is on the smaller side but I don't believe its too hard to get in/get a reservation.  The service was good, and attentive.  I have to mention that they do close relatively early and we felt very pushed out the door by the server and host the night we dined there.  The only problem with the menu is choosing from among all of the amazing looking options.  A must try is the tuna flatbread, its so different and tasty no one should come here without getting it! The rock shrimp tempura was also amazing, perfectly crispy with the best spicy sauce.  Out of the signature rolls the favorite was definitely the naked tuna, again it was different and fun and delicious.  The other rolls were also great.   All in all the sushi is fresh, and the portions are large.  I definitely left stuff."], ["Amanda N.", "finally some amaaazing japanese food! 4.5 stars for excellent efficient service and a quality meal. the hamachi appetizer is our usual go-to and it was very tasty! loved the fresh jalapeno and cilantro on top but we missed the grated daikon that it comes with at other places however the generous hamachi slices made up for everything. the side salad with my meal was perfectly refreshing with its ponzu dressing. my \"sashimi regular\" was the best part of the night! it had amazing quality slices of fish with our favorites being the albacore tuna and the salmon that just melted in your mouth. the striped bass was refreshing and a nice contrast to everything else. love their knife skills on the sashimi.. everything was perfect about this dish except i wish i had more! the wasabi had slices of green onion in it which was different but didn't add much for us and we ended up having to mput more wasabi than usual in our soy sauce to get the usual kick we desire.bf had a standard miso soup and kalbi entree. the quality and grill of the kalbi was on point but just a tad lacking in flavor from what our spoiled fatty tastebuds are used to from back home.  it's BYO, casual environment, and clean. the walls aren't buffered with sound absorbing textures so it can get very loud --not the ideal place for a quiet romantic dinner if that's what you're looking for. i can't wait to come back and try more sashimi and try out a bunch of rolls. prices are fair considering the quality of the fish for Philly having been disappointed by the small amount of Japanese offerings around here. this is officially our go-to spot for Japanese in Philly :D"], ["Alex G.", "So this is the sequence of events that happened this past week: We ordered delivery on a week night. An hour later we receive a phone call from the delivery man saying he is downstairs so I go down to pick up the food however he is nowhere to be found. When I call him he said he went to the wrong address accidentally and because of the all the time he spent driving he will not come to deliver the food since it wasted so much of his time. I get the sense this is a third party delivery service so I called Doma and explained what just happened. The response from the person who picked up the phone was \"Oh, I gave the delivery man the wrong address. Can you come and pick up the food?\". Really? Really?? Usually people order delivery because they CAN'T come pick up the food. So I said \"no unfortunately I can't pick up the food\" and the response I got was \"ok let me talk to my manager\". A minute later the lady gets back on the phone and says \"I am sorry we don't have anyone that can deliver the food but next time you order delivery we can give you 15% off.\"I am still trying to decipher what's more ridiculous, the fact that the restaurant would not go out of their way to deliver food to a loyal customer who waited for over an hour despite the restaurant's self-acknowledged mistake or the fact they think its appropriate to offer someone 15% off the next time you order from there after the restaurant made an egregious mistake.An intelligent restaurant manager that genuinely cares for his customer base would make every concerted effort to deliver the food (ie. make one of his employees drive 10 minutes to the customer's place) and deliver the food at a significantly discounted price (if not free). 15% is 3 dollars of the order. Thanks but no thanks.Fortunately, Philly is a haven for foodie's. Zero necessity to ever come back here."], ["Amy M.", "Doma is consistently delicious. The triple spicy tuna roll, sashimi sundae, and island roll are my go to favorites. Always a plus to BYO."], ["Akanksha G.", "This is my first time here! They have a passion for making sushi! All plates look exceptionally beautiful and mouth watering. Their service is excellent and they cater with love! I am amazed at the food! Hidden gem :)Try their ice cream trio yummmmm!"], ["Kayla R.", "THIS PLACE IS ALWAYS AMAZING. My boyfriend used to live down the street from Doma and we wanted sushi one night so we checked out Yelp. We found Doma and decided to go try it. We've been there 5 times since. The most recent experience was last night and it was phenomenal as usual. First off, we've sat at the same table every time we have eaten there and it is my favorite table (the first high top towards the back of the restaurant). We brought a bottle of wine which our server uncorked and put on ice for us (it's BYOB). We got the Yakuza, Medusa, Island, and Naked Tuna rolls along with a salmon skin hand roll and the octopus ceviche for a starter. The ceviche was excellent (better than I was even expecting) and the rolls were delicious as always. The service is friendly, warm, and attentive, the sushi makers are real artists in crafting both taste and presentation. This is my go-to sushi place when I'm down in Philly. Do yourself a favor and try it!"], ["Jack L.", "Food was ok. Service was decent."], ["Natalia J.", "Delish!!! When craving sushi,plan a girls night or date night at Doma! It's the best!! The tuna flatbread is so yummy! The 'tuna club' is a must try~ it really looks like a sandwich but it's rice with the sushi not bread ;) the chocolate lava cake is amazing!!! Oh & its BYOB!!! Definitely a must go to place!"], ["Jojo C.", "Friendly service and modern Japanese food with some Korean twist. Must try spicy Korean Taco. The only Item I didn't like was the crisp rice cake, it was too hard and dry."], ["Jim P.", "Naked Salmon roll ($12) was so money.  There is a bed of crispy brown rice at the bottom and a whole mess of salmon on top.  Spicy Garlic Edamame ($6) was amazing.  Edamame is edamame but the spicy garlic sauce that they added was off the chain.Bibimbap roll ($8) was so-so.  Better to get the dish than the roll."], ["Cindy K.", "Mediocre. Japanese sushi is pretty good. Korean food isn't really Korean but mediocre."], ["Adam K.", "I been here 4 times and it's always been 5 star for me. Food looks and tastes fresh. They're well presented. The atmosphere is young and lively. Place is small so call before bringing a lot of friends."], ["Mariam H.", "When you step in, you're greeted with low-key jazz music and friendly staff. The interior is chic, without seeming overdone, consisting of a white and beige décor accented by metallic details, as trendy IKEA-esque decorations adorn the ceiling and walls.Though advertised as a sushi place, the extensive menu, consisting of both Korean and Japanese dishes, provides plenty of alternatives for those in your group who are not up for eating raw fish. And even if you're a hardcore sushi fan, don't just stop at that. After all, where else can you have bibimbap and sushi in one sitting?  Oh, and if you're one of those super picky people who has to know exactly what they're eating -- they do this nifty thing where they have code letters; \"i\" for inside and \"o\" for outside, conveniently letting you know the ins and outs of each roll.Conventional sushi rolls pale in comparison to the signature rolls here. With quirky standouts like the Pachinko Roll ($15), which has shrimp tempura, avocado and cucumber on the inside and tuna, kiwi, mango, eel and wasabi mayo on the outside, and the Triple Spicy Double Tuna Roll ($13), which combines spicy sauce, sriracha and sichimi peppers for a real kick, Doma certainly isn't afraid to experiment with offbeat ingredients.Rolls aside, the rest of the menu stands well on its own. The entrees, also referred to as \"kitchen dishes,\" consist of a range of hot traditional Japanese and Korean fare. The bibimbap ($15) was excellent and certainly filling for one person, though is best if shared and enjoyed in accompaniment to other dishes on the menu.Overall, Doma is a great place to go if you're craving good Japanese/Korean food and either not down to drop big bucks for Morimoto or simply bored of Pod sushi after one too many lunches with parents.  Just make sure to make reservations in advance -- the place seats no more than 50 people at a time, so it may be harder for larger groups to find a place to sit."], ["Ben G.", "I first walked in and was greeted by the host and he walked my family to our seats, he was very polite and he listened to what we wanted to eat and explained perfectly what was what. He even came back to our table because one of our meals came with cucumber kimchi, which is spicy, and we don't like spicy, but regardless he asked us not having the knowledge of we like it or not which I greatly appreciated.The food came very fast and the price for the food is fair. My brother doesn't eat with chopsticks which is what they had, before my brother asked for a fork and knife the waiter asked, \"does anyone need utensils?\"AmazingThe food tastes wonderful, I don't usually have teriyaki sauce, because there is usually too much on my plate, my brother said, \"This is amazing and there is a perfect amount of teriyaki sauce!\" And I couldn't agree more.If there was a 6th star this place would/should get it!"], ["Vivian T.", "I'm giving this sushi spot 4 stars bc they have very reasonable prices for their rolls and very creative ones too with mango and other items. I had there specialty roll (the Yukuza) which was filled w soft shell crabs and topped off w even more. Very delicious ... And this is a byob venue! So remember to bring a bottle or two.I didn't give it 5 stars bc the food was yummy but mind blowing and the service was just ok since I had to ask for help often and he forgot my hot sauce I requested. I wish they just offered more.  Also food takes for ever here which I was surprised by."]], "Toyotomi Sushi Bar &  Asian Cuisine": [], "Zento Sushi Restaurant and Sake bar": [], "Uzu Sushi": [], "Fat Salmon": [], "Sumo Sushi": [["Erica E.", "Jason is an amazing sushi chef! My husband and I love to sit at the bar and watch him and the other guys work, delicately slicing fish.  The flavor combinations of their rolls are tasty and creative.  Also love the different specials they have on any given day."], ["Paige B.", "My friend and I ordered takeout from Sumo Sushi on a Saturday night in late June. The portion sizes were generous, the food was exceedingly delicious, delivery was fast, and it was a great value for the money spent.Tuna Pumpkin (Lobster Salad wrapped in Tuna, with Mosago): 4 out of 5This appetizer, served chilled, consisted of large chunk lobster salad rolled inside a raw tuna sashimi \"pumpkin,\" topped with mosago. There were two \"pumpkins\" per order, each slightly larger than a large egg. The lobster salad was cold, fresh, succulent, and moist. The Bluefin tuna on the outside was equally fresh and delicious.Seaweed Salad: 5 out of 5The seaweed salad had a nice balance of crisp, fresh-tasting seaweed, light dressing, a sparing amount of white sesame seeds; and sat atop a bed of skinless cucumber spears. It arrived very cold (even in 80 degree weather) and was refreshing to eat. In terms of portion-size, it filled the better part of your standard small square plastic salad container. Fresh, cold, sweet, tangy...It doesn't get any better than this!Volcano Roll (Spicy Tuna, Cucumber, Avocado and Tempura Crunch, served with \"chef's special sauce\" [spicy mayo, unagi sauce, and some other unidentifiable, yet tasty, sauce], wrapped in Soy Bean Wrapper): 5 out of 5The sweetness from the soy bean wrapper, white rice, and unagi sauce imparted a subtle contrast to the salty soy sauce-dipped spicy tuna and creamy avocado, with a satisfying crunch of the tempura flakes and the kick of pepper from the spicy mayo. I should add that this is an \"over-sized\" roll, so it is twice the size of your average spicy tuna roll.We couldn't have asked for a better takeout experience. I look forward to ordering from Sumo again soon!"], ["Rachel C.", "Very good sushi for Philly. Fish is fresh and the rolls are a nice size. They have traditional rolls and sashimi, and also some more creative, tasty rolls. I don't think they have a kitchen, so chicken-teriyaki people, keep that in mind! BYOB is great, fast delivery is even better. Only negative is the restaurant is pretty small, and also, you leave smelling like the restaurant, but sometimes that's not a deal-breaker!"], ["Abbie D.", "Decided to give this place shot after reading some reviews on Foobooz... I am happy to say that this place totally impressed.  We ordered delivery and was extremely happy with the food.  The edamame was perfectly salty and the pork dumplings were still crisp!  We got the Red Dragon and Sumo Special rolls both were great however the Sumo special was my husbands fav.  All in all I was shocked at the freshness and quality delivered to my door.  Will definitely go back!"], ["Raaar r.", "Consistently great sushi. Always fresh and reasonably priced. I love the seafood appetizer and the chefs special rolls, all swell as the a la cart sushi and sashimi. Good for eat in (byo) and for delivery."], ["Vinny P.", "The sushi craving, for me, is a funny sensation.  I turn from what I believe to be a normal, healthy, happy human being into a little kid jumping with excitement.  When I finally make my plans to eat sushi, I pretty much count the minutes until my reservation.  I also, undoubtedly end up eating a bit too much because I really love it.  This time, my destination was Sumo.This little restaurant is well decorated and laid out.  We were able to snag a table on the wall and I got to peer at the guys behind the counter skillfully crafting meals.  Our server, was incredibly nice and very attentive the whole evening.  He barely let our water glasses get below the halfway point.We started with the edamame which was perfectly cooked and salty.  I love eating that before a hefty amount of raw fish.  We got the sashimi platter, the Volcano roll and the yellowtail roll.  I thought the volcano roll was really tasty but be warned, it's massive and will fill you up.  The yellowtail roll was also really good but we hit fill-point quickly with that much food.  I ended up with some leftovers which is never a bad thing.This is a good little space and they treat you well.  I shall return."], ["Sopapilla P.", "Cute little place and a nice location on Broad St. Extremely friendly place and it wasn't so busy during lunch hours.Ok Sushi overall, but I was disappointed that they didn't serve any noodle dishes :( The tempura only came in shrimps and no vegetables :("], ["Jia T.", "It's my third-time here. The have the lunch special on Saturday. The 10.95 for 3 roll is worth trying. For the chief special roll, Fancy Salmon is amazing!  Vegetable Tempura is my favorite. The crunch is light and crispy!"], ["Phil A.", "The food here is okay. Not consistently good. I have been several times and sometimes it is very good and sometimes I see what I am served and left scratching my head."], ["Therese M.", "Since my last review, I've tried the wasabi shumai, Mango Tango roll, and Crystal roll. If you like wasabi and can handle the heat, I definitely recommend getting the shumai. It is sinus-clearing spicy, in a good way. The rolls were also delicious and worth adding to the rotation. My favorite is still the Julia roll.. we can't bring ourselves to go and not order that roll!"], ["Benjamin Q.", "Have had meals here every week since July 2013 and doesn't disappoint. Fresh sushi at a great price. Definitely try the happy lunch with the sweet potato roll, much better alternative than the typical California roll. Takeout is relatively fast if you within a couple miles of the location."], ["Sara G.", "The guys at the sushi bar are super talented. They make a mean specialty roll (the mango tango is a must try) and the ingredients are deliciously fresh. It seems like better quality for the same price as other neighborhood joints. The green tea ice cream is also delicious.This has become my go-to sushi place, considering I find the need to eat sushi about once per week. Take out is FAST & you can't beat their lunchbox special til 3pm -- 3 rolls (8 pieces each) and miso soup for $10.95. Yum!"], ["Paul L.", "I love sushi. No matter the time of the year, I would get cravings more that vinegared rice with that Omega-3 rich piece of raw fish on top. Sometimes, I'd get cravings for that perfectly plump tamago or the grainy sweetness of smelt roe or the perfect crunch of milky squid or that sweet, rich smoky eel sauce. So more often than not, when I pass by Sumo Sushi on my way home, especially on days that I've worked really hard and really late. I stop in and give myself a treat. I have been dining here since they first open and I have to say there's a obvious drop in quality of their sushi and their service. I mean, it's not like it's horrible now, but the skill of their owner/chef is obviously better than their sous chef who helps prepare sushi as well. I remember being wowed at the owner/chef's knife skills from a piece of Ika, but now the sous chef plop the Ika right on the rice without so much of a cut. Service is really a bit odd. The new hire speaks with a very strangely flirty voice while I was on my iPhone playing the almighty Candy Crush while waiting for my food, the waitress came over asking me how long I was playing and how far along I am, and while I reluctantly told her that I just started, she laughed and told me that her husband is already in the hundreds. She then left and told the other waitress about my game progress. It's not something I enjoy especially after a long hard day at work or any day actually.If you enjoy raw fish as much as I do, you'll do well ordering the sashimi appetizers first. It's 8 large piece of fish for $10, which round out to $1.25 per piece. A regular order of sashimi is about $4 for 2 pieces. The fish is mostly fresh and their selection is great. I'm a traditionalist when it comes to sushi and not a big fan of their Americanized rolls with the different spicy sauces or mayo and all those things but if you are and I don't know you, I won't judge.It's usually easy to find a table, I never really seen it being fully packed. The wait for food is not too long either, especially when you have a game on your hand."], ["Liz F.", "Sumo is pretty awesome.  The service was fast and the sushi was fresh.  My favorite is the red dragon roll.  The place looks tiny but I've never had a problem getting a table. Minus a star because it's kind of pricey and the waiter was pretty curt.They give you a stick of gum with your check, quite thoughtful of them."], ["Jillian C.", "I don't know about the rest of you sushi-eaters, but sushi grade fish should not be stringy. I grew up around seafood and at least I can say the fish is fresh, but the grade of sushi is C at best. I got a lunch special and I realize you get what you pay for, however, because of the maki mess I received, I'll never set foot in here for a nice sushi dinner. My sushi was all smashed together, stringy fish and my spicy rolls were not even the tiniest touch spicy. Thank goodness for wasabi. The dipping sauce with the shrimp shumai was horrendous. However, the ginger dressing was fantastic, but you don't go to a sushi place for their dressing. I won't be ordering from here again."], ["Juliana K.", "One of my favorite go-to sushi places. Always friendly service and always great tasting fresh sushi. Prices are great, even a little on the inexpensive side. And this place is BYO! I've had most of the rolls and they are all fantastic. Lunch special is a great deal as well."], ["Cuong P.", "My favorite sushi restaurant downtown Philly.I've been in this sweet sushi spot three times: two dinners and one lunch.The fish quality was really good. Try the white tuna nigiri (rice and sliced fish on top), that's my favorite. My colleague is a picky eater but he had to admit the white tuna was great. They served delicious rolls, my favorite was the Sumo Roll (don't miss it :). For lunch, you can get Sushi Lunch (6 pcs nigiri and California roll) or three maki rolls (both go with miso soup).I added couples of photos for you guys. Please let me know if my review helps. Cheers!"], ["John Q.", "The sushi is a bit overpriced and a bit underwhelming.  I've had better, but I've also had worse.  The delivery was fast, but the not the fastest...or the slowest.  I may go back, I may not.  I can't make up my mind as to whether this is something worth having again, so I'm going to give it 3 stars for now.  Good thing this isn't a six star rating system, I'd have a moral dilemma as to whether it deserves 3 or 4 stars."], ["Kristin W.", "Nice eat-in space, easy delivery, good sushi....what's not to like?My first Sumo Sushi experience was delivery of Happy Lunch (3 rolls for $10.95 although delivery requires a minimum of $15).  Although a little small, there is a reasonable amount of fish and I enjoyed the Alaska Roll, Spicy Tuna, and Yellowtail Crunch (with unexpectedly enjoyable apple).  4 days later, we came by to check out the restaurant.  I ordered the Chirashi and was very impressed by the fresh, generously sized fish - 18 pieces for $18 dollars!  You do the math and then go to Sumo Sushi."], ["Reem C.", "I'm glad I discovered this place. I had a few rolls on Sunday night (Sushi Sundays in my household) and I was very pleased. My wife and I ordered the Philadelphia, Shrimp Tempura, Fancy Salmon, Dancing Eel and Spider rolls. Very delicious and the price was very reasonable. Before I write reviews on a place, I try to go more than once. Today, I decided to try their lunch special. I went with the \"Happy Lunch\", which consists of three rolls of your choice and Miso soup, all for $11.83 after tax. I was more than happy.One day, I'll dine in. If my experience is great, then I think it will be worth 5 stars. Until then, I would give it a definitely 4.5 stars. Too bad Yelp doesn't provide the option for half stars."]], "Kai Japanese Cuisine": [["Cody Y.", "A beautiful modern space, cheerful service, and good food, Kai Japanese Cuisine is another hidden gem of a sushi place in east Philly.The first thing you'll notice walking into Kai Japanese Cuisine is how beautiful the space is - well lit, all new furnishing, with seats built into the floor so you can have that traditional sitting on the ground feel...while sitting in seats. Coupled with the fact that my girlfriend and I were taking advantage of a Groupon, we were very happy just walking inside.We started our meal with the steamed pork Gyoza. A simple dish, the pork was flavorful inside the perfectly cooked wonton wrappers. For Sushi, we ordered the Rainbow Roll (California roll topped with salmon, tuna, yellowtail, white tuna, striped bass and avocado) and the Tiger Roll (Spicy salmon, cucumber, masago topped with shrimp and avocado). I'm not sure which one I enjoyed more, as they were both solid sushi, well-prepared and flavorful. We ended our meal with the Tempura Ice Cream (Green Tea and Vanilla in a Tempura crust). How they get that crust around that ice cream I'll never know, but it was more than enough for two people and a good way to end the meal.Overall, we really enjoyed our meal and the overall atmosphere, and even without a Groupon it's definitely worth trying out."], ["Christine L.", "I came here for dinner because I bought a groupon a couple weeks ago, but it turned out that I was mistaken and I actually had a groupon to a different sushi restaurant. Even so, I think this might be my new favorite sushi place, and I will definitely be back again, groupon or no groupon. I've been looking for good sushi restaurant since I moved to Philadelphia last year and have so far been pretty unimpressed with most of the options in Center City. I think this place might be the first one that I've really liked. The fish is fresh, the rolls are made well, and the prices are fairly decent (about $50 for three specialty rolls and two orders of nigiri). We were here on a Tuesday night, and just about every table was occupied but it was quiet and comfortable. Plus the servers were really nice and attentive. Absolutely recommend, would eat again."], ["Rich R.", "Excellent sushi, friendly service. We found a parking spot right out front, and in Phila, parking is free in the evening on Wed. and some holidays."], ["Sari A.", "I was in the mood for a fast flavorful lunch to ease my busy work day. I went to this very cute little Japanese place to get a takeout express lunch box, and it was so damn good. A lunch bento chicken Katsu was just what i needed to boost my mood. My bento consists of steamed rice, crunchy and delicious Japanese-style fried chicken cutlet, 4 piece california roll: my favorite, steamed vegi dumpling and a side of green salad with ginger dressing.  Everything taste mmm-mmm good. Winner lunch!!Five Yelps!"], ["Brittany R.", "I got delivery from this Sushi restaurant to an apartment building that I was babysitting in on a Saturday night. The building is kind of confusing to navigate, so I assumed the delivery man would have some trouble and was expecting him to call when he arrived. He did but instead of letting me explain how to get to the apartment he was hysterical on the phone- screaming to the point where I could barely even hear what he was saying. After 10 mins he finally found the apartment and when he arrived he continued to scream at me when I had a baby sleeping in the next room. The sushi was okay nothing to write home about, but because of my experience I'll probably never order from here again."], ["Grace L.", "I almost gave this place 1 star because I'm a sushi snob....but the place was clean and decorated nicely enough. My friend and I ordered the tartare, which looked pretty enough but tasted mediocre. We also ordered 3 sushi rolls, including a philadelphia roll, all of which were subpar and had a strange taste to its rice. The good thing was that I had a groupon for the business, which was easy enough to use and made the meal cheap. Our service was also pretty nice; the restaurant was very empty though, so the atmosphere was a bit awkward--just seemed like 3 waiters staring at me and my friend in our corner the whole time!Looked like a BYO place though, so might be a intimate place to go with friends for some beer and cheap sushi."], ["Jennifer R.", "I was a big fan of this place! It's cheap for great rolls ($10 for most specialty rolls), it's byo, and the service was great. It's small but decorated in a calm welcoming manner. We were a party of 10 and they were so accomodating to our rowdy bunch. They even gave us free edamame to start and split all our checks without asking. They had pretty different types of rolls with lime or crunchy pearls, many types of wraps besides seaweed. Thought they had some really cool ones going that were much cheaper than other special places like this. Our rainbow roll came with a very generous amount of fish, we got a delicious pyramid shaped roll, their special of the day that had pulled crab, tempura, and eel on top was so tasty. Even their spicy tuna from the regular sushi menu got fancified with the crunchy pearls which ended up being our favorite.Will definitely be back here soon."], ["Monica H.", "Three stars for now cuz I have yet to try their sushi... So i would definitely be updating this again.Ordered their Chicken Teriyaki lunch. It comes with a side of soup or salad. The meal also has four pieces of california roll, 2dumplings, rice, and duh, chicken. I have to say it was quite delicious. The teriyaki sauce wasn't too sweet (thank god). The dumplings were good.. For $9 or so, it was a decent size lunch. The staff all seemed friendly. Wish i had my Jefferson ID with me then I would've received a discount! lol.. Gives me more of a reason to return i guess =)"], ["Nazee Z.", "Came here with a groupon and my boyfriend and we were pumped for some delicious sushi and Kai definitely delivered. It's BYOB for starters so we brought ourselves a couple beers (or you know, 10) to get things going. Ordered miso soup as an appetizer and it was probably the tastiest miso soup I've had in all of philadelphia. It was so flavorful, but not salty. And the seaweed was also really good. Slimy, yet satisfying. For sushi, we got the rainbow, pyramid and spicy tuna roll. All were really great with very fresh fish. I usually get sick of sushi after a while but here, it was easy for me to keep going. The spicy tuna roll was my favorite for sure!! Be warned, their crunchy is not your typical crumbled tempura batter, but it's more like small rice things. My boyfriend wasn't a fan, but I loved the texture of it. A nice break from the fish texture. Like eating Rice Krispies on sushi, but you know, it's not cereal. We also got ice cream for dessert which was vanilla, green tea, and red bean. I love green tea ice cream, but the red bean blew me away!! Sweet, but not too much. Really tasty meal and dessert!Our service was also excellent! Will return again and perhaps try those specials they had lined up :)"], ["Fam B.", "I enjoyed this new addition to the neighborhood. It's a small space, but they really did a great job with decorations and furniture. The tables are spacious and it's a nice feel overall--love the fish lamps! The service was also comforting, everyone was friendly and helpful with questions.The food was pretty decent. Started off with edamame, which you can't really do wrong. Then we tried the following rolls: TNT, Naruto, Caterpillar, and Spider. The TNT was absolutely delicious. It's like a better version of the Philly Roll. We enjoyed that very much. The Naruto roll had great fish--it tasted fresh. The ratio of cucumber to fish was a little high for my taste.I've had cucumber wrapped rolls before and here, the cucumber definitely masked the freshness of the fish, which was disappointing. The Caterpillar and the Spider rolls were also just \"okay\" to us too.Overall, this place has great potential and I'm looking forward to returning and trying different rolls and updating this review."], ["Bob C.", "Nice place. Small, clean, comfortable.   Food was fantastic.   Waitress was very pleasant.   Prices are very good.  I would definitely recommend this restaurant .  My wife and i had miso soup, ginger dressing salad. Dragon roll and spices mermaid roll .  Fantastic"], ["Bill M.", "When I was walking around Center City with a solid urge for sushi after realizing that its been a few months since I've had it, I decided to try a newer location that I've been hearing good things about like Fat Salmon or Roe, only to find out that both were closed for the afternoon. With my craving amped up to 11 I hit the trusty Yelp app which led me to Kai and a decent surprise.Kai is located in one of those locations that I've been unable to figure out throughout the years, That has taken on a hard to count number of Asian inspired restaurants despite being just a couple blocks away from Chinatown and the many similar and oftentimes better options that lie within. Its also a weird location for any restaurant in general given that its within close proximity to a McDonald's, parking garage, church, and all the random Market Street shops that don't exactly point you towards the direction of grabbing Japanese cuisine. But out of the many spots that I've seen come and go at this location, Kai could be the one with the most staying power due to its eclectic sushi menu and well rounded selection of other options.Since its been so long since I've had sushi at that point I was craving ALL THE FISH! So I was especially drawn to the Dragon Roll that combined spicy tune with shrimp tempura, eel sauce, jalepeno, and spicy mayo; and the Tiger Roll that touted spicy salmon and shrimp with masago, avocado, and cucumber. And while the Tiger did have a bit of a weird presentation, both packed some serious flavors that left me intrigued. Had I have known that that their was a Yelp Deal for a free edamame appetizer with a purchase sooner, I wouldn't have paid for mine (D'oh to bad timing!). But it still delivered the salty soy flavor that you'd expect to come with it.While you won't find better sushi options in Chinatown, you will still find them within a somewhat close proximity to Kai. But with the inventive special rolls, good lunch deals, and other not so fishy offerings; its still a good spot to dine or do take out at on a casual afternoon."], ["Allison B.", "Four stars? You've gotta be kidding.While the interior of Kai is bright and clean, and the service was swell, the sushi was, well, sad.My yellowtail roll was fishy (!), my seared tuna roll was smoky (?), Zack's pork belly app was not actually pork belly (it was just...pork?), the veggie dumplings were soft and wet with flecks of red bell pepper (?) and the worst part of all- too much mushy, unseasoned rice on all rolls.I would not recommend this spot to anyone who enjoys high quality Japanese food."], ["Liz H.", "Awesome place! As soon as I walked in, I started to like this place. It was my groupon purchase try, but I think Im def coming back more often. Sushi is fresh and delicious but my favorite part was their takoyaki and nabeyaki udon. The closest tasted to original Japanese food. The staff is extraordinarily polite, they use some kind of phone? To put in your order so it comes out super fast too! If youre a doubtful person, buy groupon and give it a try!"], ["Katiey C.", "Tried this place out with my boyfriend this evening and definitely felt like it needed to be reviewed.I give them an A-plus for their decor and for making you feel like you're really in a Japanese restaurant while even playing some J-pop. Kudos. Their food, however, needs some work.Given it was the Monday after the Papal visit and they were closed all weekend, I don't blame them for having their fish frozen in that duration. But, then again, shouldn't they have ordered fresh fish to have been delivered this morning? Just a thought. We started off with the agedashi tofu, one of our favorite dishes, and it was beyond despicable. The tofu was on a separate plate from the sauce.... what.... I don't understand? Why call it agedashi tofu if you're not even going to prepare it like agedashi tofu! It was just fried tofu with a side of dipping sauce! Ugh, still makes me angry just typing about it. After receiving the dish, we had to soak each individual tofu piece in the sauce for about 2 minutes each just to eat it without it being horribly dry!I got their sushi platter which comes with a roll of my choice and 8 pieces of chefs choice nigiri as well as complimentary salad and miso soup ($20, awesome deal). Their tuna was completely tasteless and was just all around awful. I've had terrible tuna in the city and this was by far the worst. Tuna is almost always a miss so I can't say I had high expectations for it. Not only was the tuna bad, the yellow tail and shrimp were just as tasteless and also rubbery. Their salmon, however, had been frozen for way too long which caused it to be dense and chewy. Disappointing! Also, this isn't really a big issue, but for the roll of my choice, I chose the spicy tuna maki and assumed it would just be spicy tuna. They, instead, gave me cucumber and spicy tuna? Could be worse, but unexpected and not what I wanted.My boyfriend got the chirashi, which is probably the best deal they have. The rice was properly seasoned and had a great variety of fish for him to eat. No complaints there. Besides the fish which I've already explained above.Overall, they could order better fish and focus on the freshness and maybe they'll have more customers coming in and out. [My boyfriend and I have walked by many times before to take a peek and it is ALWAYS and CONSISTENTLY dead] Sorry, but that's the harsh truth.To end on a good note and why I decided to give them 3 stars instead of 1 was because their presentation was exceedingly wonderful. The way they made the chirashi and their ability to make proper nigiri (so the fish isn't falling off the rice) made the experience a bit better.Probably won't be back again."], ["AJ A.", "Uhhhh.. okay so let me start that the place looks great and customer service was A+ but the sushi needs to have better quality fish.. I'll leave this as my initial review because I will give this restau another chance, looks like they have potential. Menu has a lot of offerings btw"], ["Jessica R.", "The place is clean with a pleasant decor, the staff is polite and attentive. We had the squid and the fried calamari for starters,  which was very good (my favorites). The volcano sushi rolls were very well prepared and had great flavor. We also had the yellow curry dish with rice and it was delicious as well. I would definitely go back amd eat here again."], ["Nadia T.", "This spot used to be Tea Talk 2, which was pretty dead (that could be an understatement). Now it's Kai Japanese Cuisine, a huge upgrade!I've been anticipating their opening for almost 2 months now, and Kai was well worth the wait. This place is small, not unexpected though for the location. But small as in there's a sushi bar and all the tables only seat 2 except for one that seats 4. I guess it's good for dates. We started off with the salmon tartare ($8). It was definitely worth more than the usual $5 for what, 2 pieces of sashimi? It was a pretty sizable pile of raw salmon on thinly sliced cucumbers topped with avocado pieces, scallions, and ponzu sauce. Definitely get it. There's also a tuna tartare option. We went with the White Tiger and Spider rolls. Each roll was 8 pieces, $10 each which I think is a good price for special rolls. The spider roll is pretty standard: soft shell crab, cucumber, etc. The White Tiger contained spicy tuna, cucumber, masago, and was topped with a generous amount of white tuna. Super tasty. I ordered a chicken katsu bowl ($12) for my little brother. When it came out, they didn't bring any miso soup or salad like the menu said it comes with. But it was whatever, I wouldn't have had room for it anyway (brother didn't even finish this dish so I gratefully ate it). The chicken was perfectly crispy and delicious!Surprisingly, only an appetizer, 2 rolls, and a chicken katsu was enough to fill us! Everything was extremely fresh and tasty! The menu isn't as extensive as most sushi places, but I don't mind that really.The service is good, although it's nothing particularly exceptional or memorable. This week they're doing a grand opening special: 25% off your entire meal! My friend and I only had to pay $20 each, including tips! I've been looking for a sushi spot in Philly and I think I've found it!"], ["Khanh V.", "I came here during the grand opening weekend and did take out. I ordered grilled squid and okonomiyaki. (I just love squid and seafood in general).. The food tasted fresh and was flavored well. The grilled squid was tender and juicy. Waiting for my order, I checked out the interior design felt in love. It is simple, clean with modern touch and a hint of Asia. Too bad the space is small or else it would be even better. This location used to be Tea Talk 2. I am glad something else opened up here. Overall, a good experience and would like to come back to dine and try other food on the menu."], ["Lisa Z.", "Considering that I was in Philadelphia for a few days, this was one of the spots I decided to have dinner at with people. The restaurant itself I hear is new and they even offered a \"grand opening discount\" to your check. I had no clue what I was in for, but I came here with four other members of my family preparing for what was ahead of us. Well boy oh boy, Kai Japanese Cuisine definitely left a positive impression on me. First of all, have you seen the furniture in this restaurant? Dang, the chair sure was heavy... but if you take notice of the design and its interior, it's fabulous! I looked passed the weight of it for its fine comfortable seat. Fasting forward to several months later, this is my second time here (considering that i am from New york). I love the concept of being able to see the sushi chefs make my sushi and how my fish is prepared. Their sashimi has yet to come out not fresh -- it's always fresh. I haven't received anything that isn't good. Here are some of the dishes that i would recommend for people to order, only because I can vouch for it : Unagi don, eel and cucumber roll, pork belly w/wasabi and soy sauce, and a salmon skin handroll. PS their salmon skin handroll is probably the most unique and strangest handroll i have ever tried. The wise one would always mention \"quality over quantity,\" and honestly, it's true about this restaurant. They not only have nice chairs, you should see the teapots they use to serve tea. On top of that, the chopsticks aren't the disposable ones. It may be a little pricey, but i'd suggest to give this place a try. Must I mention their B.Y.O.B. policy with no cork fee?"]], "Vic Sushi Bar": [["Jenny G.", "You cannot go wrong with this place when you're craving sushi..or not! The ambience is very intimate, and it's a wonderful experience to sit at the bar while your rolls are prepared by deft hands.They have a 3 basic roll deal that can't be beat. We've tried different specialty rolls each time and liked them all. Wouldn't recommend the miso soup though, the broth is flavorless, and it could definitely use some more nori and tofu.Don't forget to bring your wine along since this is a BYO!!"], ["Avelina A.", "I really like this place because it's extremely unassuming! The restaurant is a tad small and I believe that the majority of their orders are take-out lunch, but if you're looking for a cozy place for lunch, I would recommend coming here-early! They have a 3 roll special ($10.95) that is not only for lunch, but can be ordered at any time of the day, which is unique from other sushi joints. Their ingredients are fresh and delicious!My only complaint is the use of disposable dining ware. Call me a hippie, but I appreciate when businesses are conscientious of their carbon footprint. But to fair, I'm not sure if they have the dishing capacity in their tiny little spot! Anyways, with a try! Give it a go!"], ["Tara E.", "Two words- delicious sushi! The fish is fresh and there is a lot of fish in the specialty rolls!  Another steal- the party platters!! Lots and lots of fish , simple rolls, but a great bargain.  Per recommendation of all other yelpers out there- ordered the tuna dumplings which were as great as described..ordered for the rest of the party and hey were  quite happy with that choice.   Warning- seating inside is very, very limited- single 4 or 5 person table and some bar seating.  Take out is a great option.  Will allow you to drink your wine while you wait for a seat :) Delivery/take out is a good option to keep in mind for the future"], ["Grace H.", "I've never actually eaten at Vic's, but it is my go to for take out sushi! The 3 roll special for 10.95 comes with 24 pieces and is both filling and delicious. Last time I asked for fluke and avocado instead of the salmon for the alaska roll, and they were more than happy to accommodate.Two must try items on their menu: 1) the tuna dumplings (they can be pricey but worth trying at least once!) and 2) the sansom special roll."], ["Natalie K.", "YUM! Just finished take out from Vic Sushi. I've had the opportunity to dine in and take out and I recommend skipping dining in if you have the opportunity. The space is really tight with seating for 10 at most and you can't really see them making the sushi the way it's setup. Seating is first come, first serve, with a relatively quick turnaround of guests. The space is clean and they are pretty friendly with how busy they can get between take out and dining in (some times a little overwhelming to witness). The take out option is just as good quality and you can eat your (soon to be) favorite sushi roll in the comfort of your own home, free of judgment when you end up covered in sauce because you can't handle chopsticks (this may or may not have just happened to me). If you are here for the first time you HAVE to get the tuna dumplings. Promise me. I tell everyone I can about them. I make people go to dinner here with me just for them. I some times dream about them (OK, an exaggeration but you get the point). They are on the pricey side, but if you're eating with someone, it's worth splitting the cost (2 about the size of my palm to an order for $10). They make the dumpling \"skin\" (is there an actual term for this that I am unaware of?) out of sushi grade tuna and fill it with the most delicious of avocado salads. Then they drizzle it with Sriracha mayo and eel sauce (salty and tangy) to top it all off.  My favorite roll is the Sansom roll. It's a seemingly standard tempura shrimp roll on the inside, but on the outside it's topped with salmon, tuna, masago, scallions, and avocado and then drizzled with Sriracha mayo and eel sauce (I see you're picking up on a theme here). I've also tried the Holiday roll, which is a nice alternative if you don't like the typical seaweed roll. But I usually order the same roll every time I go here - it's that good.If you're craving sushi, I suggest this place! It's my favorite sushi place in Philly and any time anyone asks for a sushi recommendation I tell them to go here!"], ["Christine V.", "Three rolls for $11. That is all. Okay but really, you seriously cannot pass up a place that sells three rolls for $11. Granted there are a few other places that sell these special deals, but Vic delivers A+ quality and quantity for the prices they offer. The restaurant is very small, offering mostly only bar seating and one table that seats around four to six people. It's definitely more of a take-out/grab-n-go type of place. If you're considering dining in, it is a BYO! Their three roll specials is probably one of the best in the area. A lot of rolls to choose from that fits that special, and sushi chefs don't skimp out on the quantity. My favorites include the spicy salmon and the spicy tuna amongst these rolls. Their special rolls are also great - definitely filling and their menu will have something for everyone. This isn't a fancy sushi restaurant so don't expect the freshest fish. But for what you're paying and for the amount you're getting, Vic is a great place to come to. Note: tuna dumplings are apparently a must-try here. I came here with my boyfriend, and the people sitting next to us made us promise that we order that next time we come in! Looks yummy!"], ["Mallory S.", "Vic Sushi Bar is the perfect hole in the wall no fuss sushi restaurant. There's barely seating for 6 people, most people do take out. BYOB is always a plus. Most of the customers know the staff by name. The sushi is super fresh. When I go out to sushi, I always prefer an authentic divey place as opposed to an upscale Americanized sushi fusion place and this is definitely my go-to. I went twice in the first week! TIP: Get the tuna dumplings!"], ["Shereen C.", "Disappointed by my last visit to Vic Sushi, which was definitely not as good.The maki rolls were not well-formed. Special rolls were smaller. There was very little eel in the Yellow Dragon roll. The Black Dragon had a bit more eel, but he roll was malformed, perhaps because it wasn't filled properly (almost like it had been rolled with too much empty space inside, and then collapsed).Service was not good. It was difficult to get the attention of the staff the whole time we were there.  There were also problems with payment. First, it was difficult to get her to give me the itemized receipt. When I finally got it, there was a mistake on it -- they had overcharged. I can't say whether it was a genuine mistake, but when you overcharge customers and make it difficult for them to see the discrepancy, that's definitely a service problem (at least)."], ["Sarah S.", "I ordered 3 rolls for $11.  Great deal!  i don't know just from those 3 rolls I could tell how great this place is but its super convenient for me, a quick stopover on my home from work when I'm in the mood for sushi."], ["Gia M.", "Jared J and I had some time to kill before going to a comedy show and decided to have a platter. When we got there, the place was packed (all seven seats), but magically some space opened up and we got a couple of things.He got the three roll special ($11) and ordered three rolls of his choice. I got the tuna and salmon combo ($18), which came with miso soup, nigiri, and a roll each of salmon and tuna. About four minutes later, Jared and I were chewing down on some fresh sushi.They know what they're doing here--the entire operation is very spartan and old-school, but the rolls are great and it's an intimate space. Perfect location for a lightning speed stop if you are hungry and have some time to kill."], ["Grace L.", "I AM IN LOVE!!! Every single part of my experience here was wonderful, from the ambiance to the food to the entire establishment. Firstly, Vic's is a hole-in-the wall sushi joint with only 8-10 seats. I came here around 2 PM with a friend and brought a bottle of wine. We sat down, hassle-free,  at the (only) table, picked up a menu from the bar, and started searching for what sounded good. Meanwhile, we were sipping our wine and water, slowly working at the entire bottle. We ended up picking 3 specialty rolls and an order of tuna dumplings. The tuna dumplings came out quickly, and it was my first time having them but I'd heard so many great things--my expectations were not disappointed. Yes, it's very pricey ($5 per dumpling!), but the delicious combination of tempura flakes, avocado, and tuna wrapping is completely worth it.Our sushi order came out quickly, set in beautiful formation. I especially liked the spicy combo roll, as it had the most ratio of fish in the roll. The other two (Sansom Roll and Lucky Roll) were also delicious, but I think I was craving pure fish rather than avocado after those tuna dumplings!Overall, a perfect experience. Bring a date or a friend (just one!), a bottle of wine, and prepared to be transported to Japan."], ["Jared J.", "All good ol' uncle Vic.So I decided to host a sushi party and I hit up Vic Sushi Bar for a large order. Something along the lines of spicy salmon, spicy tuna, Alaska roll, California roll, futomaki, yellowtail role, and eel role with a couple of sides of seaweed salad.Kudos for them to getting the order together. However big the order, the sushi crafts were lack luster. Many rolls fell apart when my guests were eating them. Also, many roles that we had were misshaped, contained ingredients which they are not supposed to be made of, and utterly smashed in to go containers. Yes the sushi was tasty, no it was not supreme. Finally, they forgot to give me any chopsticks. We made due, yet that was still a fatal error of the sushi bar. PROTIP: They do not accept american express."], ["Marie S.", "I hate to be such a sushi stickler, but yet again I'm failing to understand why sushi restaurants serving overpriced, low quality fish can get such high ratings.Tuna dumplingsA tuna dumpling is essentially a flattened piece of tuna stuffed with a premixed avocado filling. My problem with this appetizer is when you flatten tuna, a usually firm fish, you end up with a mushy product. The avocado is very soft, leading to a dish that is mushy on mushy. This is not a good deal at $5/dumpling.White dragon rollThis is a basic roll topped with white tuna and drizzled with thick soy sauce. Having worked at a sushi restaurant before, I can assure you that dragon rolls should be topped with eel sauce. The white tuna did not have a firm bite nor the usual oily feel. The temperature was uneven - room temperature fish topping, but cold roll underneath.I am being really picky in my review because I left hungry despite paying $17 after tax and tip for lunch. For this price, I would expect Vic to deliver on either quantity or quality. I will not be coming back and I definitely would not recommend Vic to anyone."], ["Danita R.", "I FINALLY made it and oh was it well worth the wait. Woowee it's tiny in there, but if you're lucky enough to score a seat then you're ready to savor some great sushi, sashimi, etc. and really sweet service.I don't know how you can go wrong with that 3 roll for $10.95. You should just get that because you can and then add whatever else you want to it. Since it was my first time and I'd been waiting for months to make it in, I made the most of it with 2 friends and we ordered a li'l bit of this and a whole lotta that: seaweed salad, kani salad, tuna dumplings, spicy tuna tartar. My 3-roll special consisted of the yellowtail-scallion, spicy tuna and spicy salmon. We also got a spicy combo, fantastic and one of the dragon rolls. At some point I lost track of what we were ordering because I was delirious with all the deliciousness. So, so fresh. Like Outkast levels of fresh and clean tastiness.It's also a BYO, which probably starts to explain how I got lost in the chopsticks, but a nice Pinot will send this experience to another level of fine.I loved everything about it and have been back by for some to-go business. I'm kinda thankful that I don't live in the city because I'd be there all the dern time, but then maybe that's how you get your picture on the wall?"], ["Kira K.", "SUSHI: overall taste is pretty good, I would recommend the 3 roll special (24 pieces total for $10.95). However, the sushi is small pieces. Compared to other places, the sushi quality is pretty good thoughTUNA DUMPLINGS: not worth the hype. It's pretty small and I can easily make it at home lol. (Thin piece of sashimi with a mixture of avocado and tempura flakes on the inside)SERVICE: had better... While we were eating, one of the sushi chefs were pounding the tuna to prep the dumplings.. It was really loud and gave me a headache --- couldn't they have done it in the back instead of right in front of you? Lol I do give them credit for making the sushi efficiently though lol*note: it's really small and squished in here"], ["Rach K.", "Yum!This is a tiny little spot but I love it. The 3 roll deal is unbelievable. Because it was a busy night, we took our rolls to go and ate them at Rittenhouse Square.I had the sweet potato tempura roll, which was crispy and delicious, white tuna, and yellowtail & scallion. The fish was super fresh and delicious and the rolls were generously sized without being overly padded with rice."], ["Dan W.", "Vic's sushi is great for ordering out if you don't want to wait for seating (very limited, about 12-15 ppl). Overall fairly quick service (15 min to prep 2 specialty rolls and 3 roll special for take out in my case).I recommend the 3 roll special to get the bang for your buck as you get to choose any 3 off the rolls & hand rolls list (*these rolls are smaller than the specialty rolls). I personally got the Alaskan, spicy salmon, and spicy tuna roll being a salmon and tuna lover.For specialty rolls, I highly recommend the Sansom roll - it will not disappoint! It's popping with a fusion of sweet, savory, and refreshing all in one bite! I also recommend the Best Friends roll for all you salmon lovers like me with a fair slice of salmon on each piece as well as more inside the roll itself.Overall, if you and your friend are really hungry and craving sushi, I recommend getting two specialty rolls and the 3 roll special to fill up 2 people.Price is ok when comparing to other nearby sushi places in my opinion, otherwise great place to get fresh and fairly quick sushi!"], ["Anrenee R.", "-summer roll-inari roll-gyoza The summer roll was delicious, it came with mango slices perched stop the sushi. It was great and I would definitely get it again. The inari roll was also pretty good. I liked the tofu in it. But I wouldn't get the gyoza again. I didn't ask if it was vegetable. It was pork and I didn't finish them. Would definitely come back here."], ["Miss R.", "Very small place and the sushi was mediocre. Skimpy rolls but they have a great special of 3 rolls for $10. BYOB too."], ["Mimi L.", "Came with a group of 5 people. Barely any seating. It's a whole in a wall space. Reminds you of those old Japanese movie where only locals go for the best unique eats. This place has a table for five and then a wrap around bar that looks like it sits 8 people. BYOB is cool but drinks are self serve.We placed our order with the sushi chef. Miso soup is good. Salad is more of a take out style. No waitress. Sushi is pretty darn good. BFF roll is the best. Orders were put in and came out quick. We got ours handed over the counter. The rest of the rolls were good. Prices are decent. They also have delivery for nearby area. It's definitely a unique find in this area."], ["Stella L.", "This place was recommended by a friend. I was glad that I tried it out. The sushi specialty rolls were really good-especially the soy paper rolls were pretty unique and tasteful. We had happy roll, birthday roll, a new rainbow roll(which was not on the menu but on the white board) as well as their famous the tuna dumplings. They all tasted good and also came out nicely decorated. The cons of this place is the very tiny space. There is only one table and a bar that may fit less than 10 people. Luckily we didn't have to wait (came in a Saturday evening) but I can imagine the wait being unpredictable. That said the service is fast so the turnover is pretty fast too"], ["John R.", "Vic Sushi Bar2035 Sansom St, Philadelphia PA, 19103 (215) 564-4339Monday - Thursday 11:30 am to 9:30 pmFriday 11:30 am to 10:00 pmSaturday 12:30 pm to 10:00 pmBYOB.  Non-alcoholic drinks available in a small cooler (self serve).This literal hole-in-the-wall located between 20th and 21st on Samsom St had such fantastic sushi that it demanded critical acclaim in this blog. Put aside your pretenses and stop ruffling your feathers over the absence of valet parking faithful reader and feast your eyes on the scrumptious cuisine before you. For God's sake this is a food blog-- not an interior design blog.This BYOB features seating for 10-15 max.  As I said before-- hole-in-the-wall.  The walls are decorated with pictures of happy patrons consuming large quantities of raw fish. The requisite Buddha is featured prominently in the center of the above photo.We commandeered seating at the bar where the sushi was being made.  It is always fun watching your creation being crafted before you eat it.Here's what we ate:Tuna Dumplings. $10. The dumplings here are made with bigeye tuna, avocado, spicy mayo, tempura and imitation crab inside with green tobiko on top. They're garnished with daikon radish, eel sauce and spicy mayo.  They are made with a lot of avocado so the dumplings are very creamy in consistency.Edamame. $2. Edamame or edamame bean is a preparation of immature soybeans in the pod, found in the cuisine of Taiwan, China, Japan, Indonesia and Hawaii. The pods are boiled or steamed and served with salt.  The edamame here are served a bit too chewy for my taste- almost as if they have been steamed for too long.Shrimp Tempura Mango Coconut Roll.  Shrimp Tempura and coconut jam roll, topped with mango. $9.25.   Long Island: spicy crunch white tuna topped with eel and avocado. $13.95.  Protein Roll: spicy tuna, white tuna, crab stick, avocado and apple, wrapped in soy paper. $12.95. Shrimp Tempura and coconut jam roll, topped with mango.  Very tasty, sweet, summery roll goes well with a thin slice of ginger to add that extra pop to the finish.Long Island: spicy crunch white tuna topped with eel and avocado. This excellent specimen was delicious with rich, sweet terryaki sauce balanced by the creaminess of the avocado and the spice of the tuna. Protein Roll: spicy tuna, white tuna, crab stick, avocado and apple, wrapped in soy paper.  To be completely honest, I ordered it because of the name.  However, I was glad I did. The orange and red sauces were sweet and creamy and the mixed tuna and crab were a pleasing combination to the palate.Of course, now a word on the amenities.  No this is not Morimoto, Zama or one of the more posh sushi jaunts in Philadelphia. You basically have to walk through the dish room to get to the bathroom.  Once inside, this looks to me like an all purpose cleaning closet/bathroom.  The toilet was very clean however.On the flip side however, this was a fraction of the cost of Morimoto.  At $70 for dinner for two including tip, this is quite a steal and I'm surprised that the restaurant wasn't packed considering the quality of the food.On a closing note, as a BYOB, it really is a cheap option for dining since alcohol can be brought in for the cost of 1-2 cocktails at a fancier restaurant.All in all, I would definitely return without a doubt.  The food was excellent enough that I would overlook the less than stellar qualities in other areas--namely decor, bathrooms, and service. I only critique service however not because it wasn't fast, but because all of the workers spoke very poor English.I am hoping after a few more trips here, I can join the ranks of the hundreds of satisfied patrons featured on the wall of the restaurant."], ["Patrick C.", "The sushi is pretty decent and reasonably priced, but some of the staff are very rude. If you come at the wrong time, you'll find them sprawled out through their tiny dining room, watching loud TV shows on their huge android phones, no head phones, the sound blaring from the tinny speakers. I felt like I was visiting mainland PRC when I saw this ignorant behavior tolerated. They aren't the only decent cheap-sushi game in town, I've decided to take my business elsewhere."], ["G F.", "Not sure why this place has good reviews. Walked in, wasn't acknowledged at all. Sushi chef was whacking something on the counter for 15 minutes and it was so loud I couldn't get anyone's attention. They seemed annoyed every time a patron came in. When I finally did order, sushi was quickly served but taste was mediocre at best. Twenty bucks for a loud, cramped, blah meal."], ["Michael F.", "I had a selection of their standard rolls at a party my friend hosted.  He ordered and picked up.  The quantity seemed on point for the order. The quality was just average.  I mean, we didn't get an fancy rolls, but I judge a sushi joint on how it delivers on the basics as well - tuna roll, spicy tuna roll, california roll, etc.  Far from the best I've had in the city, but not quite in the bottom third either.Oh, and we all found it odd that on a large take out order of sushi, they didn't include any chopsticks."], ["Alisa R.", "Best sushi place in center city! It's a hole in the wall but great fresh food and it's a BYOB!3 roll special is always delicious and prepared quickly.The chef Jimmy is very nice and if you catch them at the end of the evening when there are no other people there you can request a surprise roll! The line is usually out the door but I never waited for more than 15-20 minutes. I just with they were open later at night and on Sundays."], ["Chris G.", "*Rude service*No public restroom*Eel smelled/tasted like wet dog*They only serve bottled water (Sorry, Enviornment)I couldn't imagine having to wait to eat here when there are so many sushi places nearby that aren't terrible."], ["Vanessa T.", "This is a very small sushi bar located right next to helium comedy club.  It's a good place to grab a quick bite before a show if you're running late.  The inside sits about no more than 15 people with about 10 seats at the bar and one table on the side that sits 4 people.  The sushi is not spectacular so don't expect your sushi to come out looking like those you would find at a fancy sushi restaurant in center city (such as Raw).  For the price, I feel the sushi is very good (the quality of raw fish did not disappoint).  They have a 3 roll special for 10.95 which I felt was the best deal.  I usually order their Kani salad, which I find very tasty and refreshing (it's crab sticks and cucumber with spicy mayo).As far as the service, don't expect much, it's basically eat and leave.  They get pretty busy during lunch hours and evening hours as the place is rather small. Overall, if you crave sushi and are on a time constraint, this place is perfect for the price and quality of food."], ["Shelby A.", "I really like Vic Sushi.  Even though they are a little pricey, the sushi is excellent quality! I love their Tuna Dumplings...I crave them on a weekly basis. Also, the Sansom Roll is one of my favorites. This place of fun to eat at...if you get there and can get a seat. They have 1 or 2 tables squeezed in and a sushi bar you can sit at with only a few seats. It is a very small restaurant. However, you can always opt for takeout! Their fish is super fresh and really high quality. As I said before, many of their rolls are a bit pricey, (the reason for 4 stars instead of 5 is pretty much due to prices) but they do have some deals for the simpler rolls if that's what you prefer.Great sushi isn't that easy to find, and Vic's has it.Absolutely check out Vic's if you can! I live their food and cannot wait to head back soon!"], ["Morgan B.", "My husband and I love love love Vic Sushi. We lived in Philly for two years and literally ate there twice a week most weeks. The staff was so nice and friendly, and even bought us a baby gift when our first baby was born since we were in there so often. Every roll we ever tried there was amazing. My favorites are the Lucky Roll and the Vic Sushi Roll...and of course the spicy tuna. Next time I am back in Philly it will be my first stop!"], ["Elaine M.", "I met my friend, Christina V. at Vic Sushi last week.  I was shocked when I walked in, the tiny store had 10 sushi bar seats and 1 table in front of the door!!  Most of the bar seats were taken, and there were several patrons and a delivery guy standing in the doorway collecting take-out orders.I sat in the only open seat at the end of the sushi bar while I waited for Christina V. to arrive.  Luckily just as she arrived 4 others were leaving so we were able to sit at the far end of the restaurant, away from the door (and the frigged February breeze).We were handed two wine glasses and pointed towards the wine bottle opener that was sitting on the bar.  Apparently it is BYOB and serve yourself.  There were two sushi chefs quickly banging out orders behind the bar and a woman working the cash register and a man cleaning up and working in the back kitchen.  We decided to order the 2-piece tuna dumplings, iRoll, White Dragon, Birthday Roll and the Princess Roll.  The tuna dumpling was like nothing I have had before.  The tuna was smashed thin, and wrapped around a large ball of chunky avocado.  I am not sure what else was mixed in with the avocado but it had a guacamole feel to it.  The iRoll (great mixture of sweet and spicy) and Birthday Roll were my favorite rolls.When Christina V. and I get sushi, we usually sit and chat for a few hours, slowly savoring each piece and sipping our wine.  We were surprised that the two seats next to us turned over twice during our meal.  I guess Vic Sushi is a place you go for a quick bite, in and out!  Hopefully we didn't hold up any other patrons with our slow meal.  Even if I don't eat-in at Vic again, I will definitely be ordering delivery from them in the future!"], ["Christina V.", "I came back here for lunch with a co-worker last week based on my suggestion from my recent dinner here a month ago.  Perfect once again.  Of course I got the tuna dumplings because they are heaven and my colleague agreed-- a must order.  We also got a few rolls to share and service was fast so we could eat and chat and get back to the hustle bustle of the office.  Since I wasn't drinking this time (I am the employee of the year) I asked for water and was directed to a self-serve station on the side wall.  Foam cups, tea-bags, hot water, and a faucet.  Yup.  This place is officially my dive bar sushi spot and I LOVE it."], ["Ancy T.", "Got a bite to eat with two friends. We ordered takeout and stopped in to pick it up. My friends weren't kidding when they said the place is small. It has a cool setup, but it's a squeeze in there!We each opted for the 3 roll deal for $10.95. Not a bad deal for lunch in the city - it's actually a great deal! I ordered the salmon and avocado roll, spicy tuna roll, and yellowtail - scallion roll. All were DELICIOUS and much better than I had actually anticipated. They also looked nice too! I wish I had taken a picture before scarfing those bad boys down.I'll definitely order from here again and I am looking forward to it."], ["T D.", "I love the food here and frequently order delivery as well as take out.  I recently ordered for delivery and realized they had saved my credit card information into their computer system!  An even bigger shocker was when I looked at my delivery receipt, my CC number AND expiration date was fully printed out on the receipt for the whole world to see.  I am beyond upset, this is a huge security violation.  Most people wouldn't even notice and most businesses with half a brain would know better than to do this.Bummer because I really like their food."], ["Eunni C.", "Enjoyed my meal here. Went with friend and we shared Samson roll, Naruto roll, spider roll, spicy salmon tartar ,tuna dumpling, edamame and sunomono. We were initially going to get sashimi platter but rolls looked amazing so went for it. Wasn't disappointing. Sauces weren't overpowering and sashimi were very fresh. We did not get the 3 roll special and order individual but if you order their special , price is really cheap. Very happy that found this place.P.s they freshly fried soft shell crab when you order spider roll. Soooo tender and soooo juicy. Loved it. Must get that item. Naruto roll is definitely better than any other places. Cucumber paper is thinner and fresher. And has so much flavor. I did not really like tartar dish. Didn't have much flavor compare to other dishes. I will just order rolls next time I visit which would be next wk."], ["Alicia B.", "This cozy little place may be the best sushi I've ever eaten. I was blown away with how delicious everything we ate was and wish we'd had our own wine or sake and stayed longer for a second round. Walking in to 3 employees, 10 bar seats and 2 tables made us feel like this was either going to be awesome or terrible -- a risk we were willing to take. I'm so happy that we did. I would recommend the special rolls of the day and the spicy rolls. Most people are in and out pretty quickly and don't linger, so if you come during a busy time, be patient."], ["Taylor D.", "There was a group of us that did takeout on the special -- hand rolls 3 rolls for $10. It was the perfect amount of food for a light dinner if you're not starving. We also forgot to put in one order and they quickly churned it out in less than 5minutes. The rolls were fresh and tasty enough -- nothing out of the ordinary but still very good! It's a great deal and I would definitely recommend it :)"], ["Claudia L.", "This is a VERY tiny place but great!  It's super casual but very good sushi.  It's not one of those places that Americanize rolls (too much rice, too much sauce, fried everything, etc).  I like the intimacy and it's a local's place to go."], ["Tiffany L.", "I've only every ordered delivery from this place, but it's still amazing! Delivery is pretty quick, the pricing is average for the city, and the sushi is really good! 2 thumbs up for Vic!"], ["Linds P.", "This might be the best sushi I've ever had. Vic is very small, but they are awesome at making sure everyone is accommodated and taken are of.Really great place, highly recommend!"]], "Cafe Square One": [], "Morimoto": [], "Zama": [], "Kisso Sushi": [], "Umai Umai": [], "Crazy Sushi": [["Josh P.", "Went here for a quick lunch with a friend. I liked the environment and the service was friendly and attentive. They even refilled my water glass without asking...the little things.The sushi itself was very good. It seemed fresh and there was a good portion. I enjoyed the 3 roll special which came with miso soup. Miso soup is great, and they did a good job. Ambience and atmosphere was good, but not great. That being said, I will definitely be returning!"], ["Jack J.", "Interesting experience here.Came here on a Saturday night around 7, and was seated right away for a table for 2.  Not much later did this place get PACKED.  I'm guessing this is a Chinese owned Japanese restaurant because all the waitresses were speaking Chinese.  They had a variety of rolls; they had the standard rolls and some house special ones.  We picked out four rolls to share and they were all pretty fresh.  Note: spicy tuna and spicy salmon rolls taste almost identical and we couldn't figure which was which...  The smoked salmon roll was rich in flavor and the eel avocado roll had some sauce on it.  Overall, a filling but light meal.I was accidentally charged a different table's check for $70 when our's was $30.  It took the waitress a while but she came back and gave me $70 in cash and made a joke about how I used the restaurant as an ATM...  haha.."], ["Jenny K.", "This is a great place for a girls night out or a big birthday dinner. BYOB so thats always a plus. i came here with about 11 girls and we all got about 2 rolls and ended up each paying 22 including tip which is amazing. The presentation of the sushi here is always beautifullllll. Each one is different and the sushi is always freshly made. I'm a huge fan of the yakitori and sashimi salad here, very fresh and delicious. I have no complaints except that they need to BLAST THE AC, it gets so hot so fast."], ["Tami F.", "Odessa roll was awesome! Fresh fish and I don't normally eat tempura but this has been the best. Presentation gives it that extra star. Coming here for the lunch special would make it 4.6 stars."], ["Vanessa T.", "On a saturday early evening, I stopped in for dinner with my friends along with 2 bottles of wine.  The number of sushi restaurants in Philadelphia seem to be endless so this was my first time here.  We were immediately seated since we came around 4pm.  This is a fairly small sushi restaurant with tables along the walls and a sushi bar.    The inside is pretty dim as seem to be a theme in most sushi restaurants.  We started with the Kani salad and rock shrimp as our appetizer.  The rock shrimp was lightly batter with tempura with a normal sized shrimp good enough.  We ordered four rolls (2 specialty rolls and 2 regular rolls).  One of the specialty roll was the france which is basically shrimp tempura roll to some extent.  The other roll I forgot the name but it was spicy salmon with shrimp wrapped on the outside (I enjoyed it).  The other 2 regular rolls were spicy tuna and some other I can't recall.Overall, I pretty much came here for the BYOB part and hoped that the sushi is good enough to eat.  Gladly, it satisfied my requirements but really nothing to brag about here."], ["Eunni C.", "My sushi place hunt hasn't finished yet. We tried bonsai roll, one night stand roll, volcano roll and sashimi platter. They did put a lot of effort decorating the dishes. We were very hungry so rather getting dishes as soon as we can lol Even though I appreciated their beautiful decoration, sushi wasn't that impressive. I did enjoy one night stand roll but bonsai roll had too much cucumber. I like thin slice of cucumber just round once or twice otherwise I can't really taste any sashimi because cucumber has pretty strong scent itself. I felt like I had big chunk of cucumber after all..the quality of sashimi was ok but nothing extra ordinary. And the bill ended up not that cheap. I think I could find this quality food with less price."], ["Ron H.", "Fishy tasting roles served on overly complicated plates. The individual pieces were cut with what looked like a rough knife giving the fish crooked edges and unclean cuts.  Their unique rolls and combinations are too complex and the ingredients aren't exactly \"fresh\".  The dining room is a super loud room with tables in front of a wall-long bench and chairs on the opposite site, almost too tight for comfort.  The service is fast, but the food is horrible.  Both my date and myself left with stomach pains and then spent the night in the bathroom.AVOID THIS PLACE AT ALL COSTS!!!"], ["Peter N.", "I really really like this place.  Went last night for the first time and found the experience to be great.Sushi: the fish was very fresh.  One of the freshest I've had.  The rolls are very creative.  They really know which ingredients work with each other.  I had the One Night Stand roll, which is a riceless roll.  Instead of wrapping the roll in rice, it's wrapped in fresh salmon!  Genius!  And then the inside was spicy salmon.  Loved the concept.Byob - self explanatory that this is awesome.  I actually brought sake and they were more than happy to heat it up!Ambience:  doesn't get too loud, but the place does get crowded. And this was a Wednesday.Price: Kickass for downtown prices.  $7 for regular rolls, around $14 for specialty rolls. But the lunch special is 3 rolls for $12.  That's a phenomenal deal for the area.  I went during dinner time, so I will definitely try the special next time for lunch.Presentation: not something I usually call out, but it is noteworthy here.  The display of sushi is creative and a very nice touch!Service was decent.  My water kept getting refilled without me asking.Looking to come back real soon!"], ["Samuel N.", "I was hesitant to try this place from the get-go because I'm somewhat of a sushi purist.  I just like solid fresh fish good sushi rice and maybe some well roasted seaweed to be happy, and MAYBE a well fried shrimp tempura too.  Hearing a name like CRAZY SUSHI, I kinda figured I was in for an eccentric experience.  And boy was my gut right!Walking in it feels like your average trying to be hip sushi place, however hearing the waiters speak mainland chinese, I knew the authenticity ended right about there.  We ordered our rolls (my friends going with their crazy special rolls) I opted for the sushi combo.  After that, the show started.  I've never seen such over the top presentation of sushi. Which is ironic because the main idea of sushi is simplicity and balance...THERE WAS NONE OF THAT ON THE PLATE.  I was a little frustrated too because there were more inedible presentation elements than edible pieces on my plate.  I had an ice sculpture, a wooden boat, 3 LED ice cubes and something that resembled Easter basket straw on the plate with my 12 small pieces of sushi.  Service was also sparse and quick, as this place seems to aim to turn over tables ASAP.  I can only assume the prices are so high because of the CC location, but you definitely don't get what you pay for.If you're looking for CRAZY presentation, and CRAZY expensive and CRAZY small portions at CRAZY high prices.  You've got it all here in a one stop shop."], ["Grace L.", "Came here for lunch with a friend on a snowy weekday , so the restaurant wasn't very crowded. The service was superb, as the lady at the door and our two waiters were very attentive and made conversation with us. We were in time for the lunch special, which meant $4 normal rolls; my friend and I both got two rolls each, and I ordered a specialty roll for $12 on top of that. For a place that is known for its decorations, I was disappointed that saving money on lunch specials meant no fancy plate decorations. I've been here for dinner before, and you definitely pay for the sushi plate to be pretty! All three of my rolls were subpar, and was especially not impressed with my specialty roll. This place has a nice atmosphere and is BYOB though, so is a nice place to relax and catch up with friends; if you're searching for good sushi, other places would be your better bet."], ["Robert S.", "Crazy Sushi is a really cool and trendy spot that serves some really \"crazy\" sushi. Aside from their great tasting sushi, their presentations are really awesome. Just check the pictures that other Yelpers have posted and you will see just how beautiful their plates come out. I came here with some friends and I ordered the spicy tuna roll and the Ichiban roll. Whenever I get sushi no matter where it is I typically will order a spicy salmon or tuna roll and I was very pleased with Crazy Sushi's version. The Ichiban roll was one of their  house specials and had a really cool presentation. Oh yeah, it was real good, too.Getting sushi with your friends and family is supposed to be a unique and fun experience and I definitely think that Crazy Sushi is doing it right. They also have great service. Our empty plates were cleared from our table (which some might not like) as soon as we were finished with them and our glasses of water were constantly being filled to the top. I hope to come back here soon."], ["Lilly T.", "Came on a weekend trip to Philly to visit my best friend. Stopped by here after visiting the museum nearby and craving sushi!We ordered shrimp tempura, veggie tempura, and some sushi rolls that I don't remember the names for. The tempura was okay, crispy and fresh by oily compared to NYC standards.I didn't like the salad that accompanied it because the finger dressing was too thick and chunky and desperately needed to be watered down and added with mayo. The sushi rice was well seasoned and fresh. The fish was questionable and atmosphere was unimpressive. It was Chinese owned and run, which I find to be a bore when it comes to authenticity, but our waiter was super kind and made small talk with us and made us laugh and smile. It was a pleasant experience overall with decent portions, but definitely not somewhere I'd come again while in Philly."], ["Tahira R.", "Crazy Sushi was great. The staff is very welcoming and attentive. The food was on point, from taste to appearance. The restaurant is clean and well kept. We got the tofu tempura, philly roll and avacado roll. The tempura was reallllly oily so Id stay away from it. But the rolls were really nicely cut and the plates were decorated so beautifully. The prices were decent for good sushi and pretty plates. The atmosphere was a little off for my personal taste - too quiet but still a great setting nonetheless. It's super tiny though, so big groups- stay away."], ["Mike K.", "Great sushi spot. Friendly staff, decent prices, delicious food. Went on a Sunday afternoon and it was a quiet and calm environment (not many customers at the time). For apps me and my girlfriend split some edamame, as well as the Sushi Pizza appetizer. The edamame was a large portion that could easily be shared and the Sushi Pizza was actually incredible - I was pleasantly surprised. We then tried a few of their specialty rolls - France Roll & Angel Roll - both very delicious. The presentation of the dishes here are top-notch. I will absolutely be stopping by here any time I come through the area with a craving for sushi."], ["Heather P.", "I have eaten here and also ordered takeout. Sushi is very good and they do have a lot of speciality rolls as well as lunch specials. They are friendly, offer fast service and when takeout is ordered they give you all wasabi, soy sauce packets and even a little plastic cup to dunk sushi in. That's a PLUS right there Inside is very clean as well. I'm not from the area but when I do come to visit I prefer here over other sushi bars that I've tried."], ["Neil S.", "Its always great to go to a sushi spot thats also BYO. This place is one of the best Ive found in the city. The plates are large and all the fish seemed very fresh. Service seemed a little awkward at times"], ["Evan M.", "Stopped here for lunch on the Friday of Pope weekend in Philly. I had a few sushi rolls which were all excellent. Wife had general tsaos chicken - said it was great but refused to share."], ["Nicolas N.", "Summary:I am fortunate to have relatives who own sushi restaurants and my brother is a very skilled sushi chef.  Sushi (and fish sauce) runs through my veins.  I always make an effort to sample different sushi across the country.  For sushi, there is no escape from quality. Unfortunately, the only quality from this place is the service, which cannot make up for poor, low grade sushi. One star for the service and another for location.Food:Poor quality sushi.  To all sushi lovers out there (e.g., those who appreciates fresh cuts of fish and doesn't over soy sauce their fish), please try better restaurants elsewhere.  I really wanted to like this place, considering the reviews, but I am skeptical now, since this place used lots of imitation crab and very thin cuts of fish - to save on cost. When you start seeing fish or seafood that has been mulched into tiny pieces or turned into goo, it cannot be called sushi.  I also got sick here. :-(Location and Ambiance:Location is great, but the ambiance is okay.  There is a staleness about the place that is seems more fresh than their sushi, sadly.Service:Great, attentive service."], ["Hiya R.", "Always the most innovative rolls, a must try for sushi fanatics. My favorite part is their unlimited creativity."], ["Rebecca P.", "Well, I've found my go to sushi delivery place in Center City.I placed an order via GrubHub and I received a call to come to the lobby 13 MINUTES LATER****caveat: I live three blocks away - but still: this is incredible!I ordered an Eel Avocado Roll and the Ebi Tempura Roll (shrimp tempura, cucumber, caviar and mayonnaise). Both were good (standard sushi takeout fare - nothing wild here).The delivery man was affable and efficient. I have no complaints."], ["Shay B.", "My first time trying the place out and the food was really good!!! Everything was really fresh and the plate set up complimented the delicious food."], ["Katie B.", "Staff was fantastic- we were seated in under 10 minutes without a reservation on a Saturday night at 8 pm. They immediately opened our bottles of wine, went through the menu, and were absolutely hysterical and entertaining. The sushi platters were beautifully done and delicious. I recommend the France and Sakura rolls. They let us finish our wine after the plates had been cleared, instead of hustling us out, which was nice. Only drawbacks were that one of us didn't get the miso soup he'd ordered, and it seems to be a haven for large groups of underage, overdressed, screaming girls. Everyone was having a great time, but a few parties were definitely over the top, which kind of took away from the ambience."], ["Rebecca H.", "My friend and I tried Crazy Sushi last night for the first time.The place was easy to find and conveniently located. We both took the train in and didn't have to walk far from Suburban. The decor is very nice, and the restaurant is actually fairly large. We decided to try the vegetable tempura, which was tasty. It wasn't greasy, which is a common complaint that I have about tempura- so this was a great surprise!The ONE bad thing is that the appetizer (tempura) came out about 5 minutes before the main meal, which is always awkward. I won't hold it against them though, because the sushi was great.The presentation was beautiful! There were the cutest little plastic trees on the plates! I had the white tuna roll (fine, nothing out of the ordinary, but it's just a plain roll), and the magic salmon roll. It was seriously the best sushi roll I have ever had in my life. I absolutely loved it. My friend had the spicy tuna roll, which she really liked, and the spider roll, which she loved! I will DEFINITELY go back- I loved it! The price was fine as well. Oh, and it's BYOB."], ["Abhishek Y.", "This is one of those places that I really want to love. I've lived down the block for a few weeks now, but visited Crazy Sushi even when I was living up in UC.To start off, the food is good. The rolls are priced fairly, and the veggie gyoza compares to the best of the same that I've had in Cali (full disclosure: I think Cali has the best Japanese food in the country). The plates are beautifully decorated, and I think the decor inside the place, bar the color changing effects, are absolutely beautiful (I'm a fan of contemporary design). In particular, the sweet potato roll and the cucumber+avocado roll are my favorites, although I'm looking forward to trying the mango one soon too.In any case, I really want to like the place, but the constant finding of hairs (not ours) in the food during our two visits and the subsequent 'not-caring' of the wait staff has been somewhat disappointing. Further, the lack of attention to detail - not bringing over new soy sauce containers when the other one is empty, not refilling water, etc. is disappointing as well, and in all, costs Crazy Sushi 2 stars.With that being said, the food is still good, but if they just wore hair nets or whatnot and kept things more hygienic, and improved service a tad bit, that would definitely go a long way!"], ["Ashley O.", "This is my favorite sushi place in Philadelphia. The staff is overly friendly and helpful, and the sushi is amazing. I ordered a speciality roll and an appetizer for $20. It's byo also so it's very affordable. Love this place! Check it out!"], ["Jacqueline O.", "BYOB. This place is a blast. I always drink a bottle of wine to myself and sometimes even bring a 6 pack for after. When I come here I only have intentions of having a great time. The sushi is literally crazy. Blinking lights. Mini trees stuck to your plate with wasabi. They know what's up! I would suggest making a reservation because it is small and can fill up quickly. I give it four stars because the people literally try to push you out the door. They know people are drinking and they try to get you in and out as soon as they can. It can be frustrating so I just wait a little to order and wait between apps and rolls. All in all great place. Just don't forget the booze"], ["Abby D.", "This place is amazing! The fish is so fresh and their rolls aren't full of rice like most places. AND they have my favorite thing, hamachi kama! So good!!"], ["Alisa A.", "They have great sushi and the presentations are one of a kind! I love taking people here and seeing their reactions when their food comes out. The displays and presentation are amazing."], ["Jezelle R.", "$8 for 2 different types of rolls and a salad? YES PLEASE!I got take out so I can't really comment on the service but when I was waiting for my food the hostess was very kind. The restaurant was very clean which is always a good sign since you are about to eat raw fishies. Inside is modern looking, plenty of spots to sit but I can see how it could get crowded on a Friday night.The rolls were good. Not as much rice nicely rolled on the outside as I would have liked BUT, nonetheless it was yummy. The spicy tuna rolls were really tasty and of course California rolls were good as well.Great price for good food!"], ["Abby B.", "Decided to go out on a limb and order sushi from a new place.  When it comes to sushi, I tend to be a creature of habit, so this branching out stuff takes some serious guts on my part.Being that they have, like 50 rolls to choose from (seriously), I had a difficult time making a decision.  They have everything from my go-to rolls (Philly, shrimp tempura) to some crazier concoctions (pumpkin, crabmeat apple).  My husband and I found the quality of the sushi to be above that of most of our usual take-out places, although it is a bit pricier.I'll definitely return and make sure that I come hungry!"], ["Cassandra C.", "This was our second time here. The first time we came here was Mother's Day 2015 and it was an amazing first time experience. Top notch customer service and the sushi is to die for! We came back today from Reading,PA because it has been all we talk about since Mother's Day! The Sakura roll is our favorite, it's simply delicious and we couldn't find a local sushi restaurant that had such amazingly fresh and delicious sushi! Our go to spot when we are in Philadelphia!"], ["Mike H.", "The sushi was just ok. Nothing tastes fresh have definitely had better sushi for the same price. Service was also horrible. They brought us another couples check before we got our meal. Was just ok"], ["Patrick S.", "I have ordered their lunch special numerous times.  It's a really great price - $7 or $8 for two rolls and a salad or soup. I typically get the standard Japanese salad with ginger dressing and then some sort of white fish roll and a tuna roll. The rolls are well sized for a cheap lunch menu option. The ones I've order have rice on the inside and outside of the seaweed - not sure what that's called, but it helps fill me up on a relatively light meal. The only downside, they get super busy.  They open at 11:45 and I find if I don't call and place my pickup order right then, I have trouble getting through. I have been put on hold for fifteen minutes only to then be hung up on. I've also called them multiple times over the course of thirty minutes, only to get a busy signal each and every time.  It's worth it if you get through, but I stop trying now if it doesn't happen on the first shot."], ["Cindy L.", "found this on yelp so i wasnt sure what to expect.  It surpassed my expectations.the house salad came with delicious ginger dressing and kani.the sushi was fresh and beautiful.  we had a bamboo garden theme delivered to the table.the salmon bento box came with lots of food and very good.the only issue was the floors were a little slippery so be careful."], ["Divya P.", "Had a hankering for sushi on my way home for work so stopped here for takeout. Ordered the negi hamachi (yellowtail and scallion) and spicy salmon roll and they did not disappoint! The seaweed salad was a bit pricey ($6) and nothing special compared to other places where you can get it for $3-4. Overall I was pleased with the speed of the service (waited less than ten minutes) and the quality of the maki rolls. The ambiance in the restaurant is nice and I'd love to come back and eat in - seems like it's BYO and they have a lunch special."], ["Lindsay M.", "From the street this place looks like an adult video store. Once inside it's surprisingly nice. Service was quick, but the server seemed to question us on every order, especially an appetizer that needed to be cooked. \"It takes forever.\" \"How long is forever?\" \"Ten minutes.\" \"I think we can handle that.\" I also ordered dumplings for an appetizer, which I never received, and I'm guessing the waiter didn't jot it down because it was something else that needed to be cooked.Otherwise the sushi was great. Loved the tornado roll and red snapper roll. Was surprised by the little wooden doll fences and glowing lights on the plate, but it did not interfere with my enjoyment. I guess maybe the plate art is what got them the \"Crazy Sushi\" name....?"], ["Samuel L.", "Good service,  lots of different rolls, and the presentation of the sushi rolls were really well done.  They had a good assortment of tempura roles and non tempura rolls.  The decor also was really nice and clean. Like all sushi it can get expensive, but why pay for something cheap."], ["Jennifer R.", "This place had some seriously bangin sushi and quite the wacky presentation style. The way they dress up their plates (and so uniquely for each) is a great touch to really set them apart from the other sushi places. It was very fresh too and gotta love a good byo. Only giving it 4 stars because the service was pretty sucky but I'd definitely go back anyway. They had a ton of affordable specialty ones I gotta go back for."], ["Ovsanna M.", "Great place for a small function! Super fresh and quality food. Very friendly staff and available on short notice. But the best thing I like about it is BYOB. Definitely a YES!"], ["N S.", "I'm crazy for Crazy Sushi! Sorry, I had to. They have a great lunch deal, where you get \"Any 2 Rolls and Soup or Salad\" for $8. The any 2 rolls doesn't include the special rolls, but there are still plenty to choose from.  I've tried most of them - not mind blowing, but they always use fresh ingredients, and they're consistently good! Added bonus: Pretty fast delivery. I was on crutches for a while and got delivery 1-2x a week during that time.  I only work a block or so away, but it would often only be 30 min from the time I place my order to delivery. Definitely worth checking out if you work or live nearby."]], "Sakura Japanese Cuisine": [["Amanda J.", "I order from this place all the time with my GrubHub app and it's always a great choice! Sushi orders can add up in price quickly but this place always delivers good food and in a pretty timely fashion-- last night it only took 30 minutes to get 3 rolls and a Bento box!! It was impressive. My favorite is the Dancing Lobster Roll and my bf gets the Teriyaki Chicken Box-- so much food in the Bento Boxes!!!"], ["K S.", "Love love love this place! You MUST try the spicy tuna tartar! $6.95 well spent!Dancing Lobster Roll is #1 favorite. Great creamy texture.King of Dragon is #2"], ["Stacey G.", "This is a hole in the wall sushi bar. The sushi was good and fresh but if you're looking for a fancy upscale sushi place this is not the place for you. I ordered the Wasabi pepper tuna - first time I've had tuna and it was good but not for me. Some people love this though so give it a shot if you like tuna. I had the garden salad with ginger dressing, everything I imagined it would be. I had a cucumber avocado roll.. good and fresh. I tried the spicy tuna roll, it had some crunch to it, I liked it."], ["Megan L.", "I ordered delivery from here and it was weird. I got the chirashi and it was really good but the miso soup tasted like feet and the soft shell crab appetizer was the worst thing ever. It had wayyyy too much batter, 3 times thicker than the batter on a corndog and the crab also tasted so old and bad and I had to spit it out. I couldn't even swallow it."], ["Morgan C.", "My go-to place for delivery sushi when I'm on campus. I have ordered from Sakura on Eat24 many times, and they never disappoint! Everything I've ordered is always delicious, and it comes very quick!"], ["Lauren C.", "Love it here! Tea is delicious and a variety of rolls are available at affordable prices. I've never had one I don't like.The eel avocado is my go to. Mexican roll was almost as good as a taco!!"], ["Brett R.", "After having just started working on Spring Garden Street, I had to go out to explore to find where I could get my favorite lunchtime indulgence: SUSHI. This place is directly across from one of the largest office complexes in the city and offers a great lunch special deal: 2 rolls, a salad and Miso soup for under $9.00! Wow! So far, I've had California rolls, Philadelphia rolls (duh), tuna avocado and spicy tuna. All have been great, and they haven't been wrapped in excessive amounts of rice. The fish is tender and flavorful, and I ALWAYS get more than enough ginger and wasabi, which is a must for me. The staff is pleasant and efficient and have delivered the lunch orders for the entire office across the street multiple times. Definitely plan on going back many more times. It's sushi, and it's good - what's not to like?!"], ["Megan R.", "The rolls were the highlight of my experience, but even those were subpar. Today I ordered three rolls for delivery, and one of the rolls wasn't what I ordered. I'm not one to complain, but I called the restaurant to ask them to deliver the correct one in their own time, and they told me that I would have to give the incorrect roll back to the driver... These rolls were all smushed together in a small box that I had already started eating out of, and I asked several times for clarification - How do I give it back? Is this sanitary? Are you going to sell this to someone else? And the driver replied that it was \"the manager's business\" and that she just needed it back. Having worked in the restaurant service industry for 4 years, especially working with resolving individual customer issues, I think this was completely inappropriate and unacceptable. Since they insisted multiple times, I put the roll in a plastic bag, because that was all I had. I really hope it wasn't rearranged and served to another customer."], ["Elise M.", "I have ordered delivery from Sakura a few times. It is not horrible, but is not that good.The most disappointing item I have ordered is the vegetable tempura. I don't think that their tempura could even be classified as tempura! Tempura batter is supposed to be light and flaky. But this tempura had a heavy, thick coat that was really gross. I did like the gyoza I ordered once though.I don't think I will be ordering delivery from Sakura much in the future. I may occasionally order though because I sometimes need to break out of my usual places to order-in from."], ["Toni M.", "DO NOT eat here if you don't want your debit card charged freely. They charged me twice and when I tried to dispute with my bank, they have receipts showing that I signed for both when I only signed for one receipt! I will never eat here again - it's not like their food is one of the best of Philly."], ["Collin B.", "Fresh and friendly. I get sunshine roll (sweet shrimp) and hamachi (yellowtail) consistently and its super fresh and flavorful."], ["Justin Z.", "We had a couple rolls, 1 bento box and chirashi plate. The rolls were fresh and very tasty. The teriyaki bento box was plain, there was no real flavor on the chicken. I may have received a grilled chicken bento box instead of what I ordered. The chicken still tasted pretty good though. The chirashi tasted fresh but I still suggest sticking with the rolls at this restaurant. The restaurant is small but had really good service."], ["Anthony S.", "I used to live at 12th and spring garden, which is right by this place. It's great if you're in the area and want some decent sushi, but it's not worth traveling across town for. As I said, the sushi is just decent. They have the standard rolls available anywhere and a couple specialty rolls. There was one time I ordered through grubhub, and they gave me sashimi instead of sushi, which was annoying because it's the same price but is actually like half the amount of food. It was like two pieces, as compared to a roll which usually has five or six. Now when I'm in that part of Philly and decide to stop in! I usually get the udon noodles, which is better than their sushi."], ["Joanna D.", "Paid 20 bucks for pretty lousy sushi. Didn't come with accompaniment I asked for and was pretty bland. Would have been better off ordering from Kansai."], ["Racheal C.", "I'm in love with the tempura here. Perfect fresh food is the definition of this place. Service was great. Prices were not to shabby. We will definitely be getting takeout from here one day."], ["Kimberly S.", "really really great sushi at really great prices. The place is a BYO and the takeout is quick. Try the sushi pizza - it's amazing!"], ["Hannah J.", "Had the eel and cucumber role and ikura sushi.  The food was made fresh and the hot green tea was delicious!"], ["Dan S.", "Sakura serves some typical Japanese fare, including a variety of sushi, noodle soups, and stir fried noodles.  They have a ton of sushi options, which are good.  None of them really wow me but if you're going out for a nicely priced lunch I'd say go for it.  I'd certainly recommend the udon noodles over their sushi, as their nicely stir fried and come in three options: vegetables, chicken, or shrimp."], ["Krissi S.", "Great for the price and convenience. It's nothing fantastic but my picky 7 year old and my boyfriend loved it. I got the avocado & cucumber rolls (once had better...but they were good) and my boyfriend enjoyed his California rolls. The seaweed salad wasn't bad either. I've finally found somewhere that would deliver to me in Port Richmond though! Lets hope they will still deliver after having discovered how \"far\" it is (supposedly NOT outside of their delivery zone though from other reviews I saw elsewhere)."], ["Susanna L.", "Not the best sushi I ever had, but i I was in the area I'd be ok to come a bite here. I had the christmas roll, spicy tuna roll, and shrimp tempura roll. The prices are a little more than what I usually see, but this is close to the city so the taxes must be high. I really liked the christmas roll, there was a good amount of fish wrapped on the outside and the avocado was pretty fresh. The fish however is just ok, I've had better. I didn't like the shrimp tempura roll though, it was drenched in I guess soysauce and isn't what I am used to eating. The pieces are big though i you are looking for something filling. The spicy tuna had nothing special. The fish is just ok quality. Overall meal was not bad, if you are around the area and want sushi, go or it."]], "Dasiwa": []}