{"Trio": [["Jillian N.", "My boyfriend and I went here on a whim on Sunday night. We live in the area, and thought we would give it a whirl!Boy were we glad we went! First of all, they have a lovely deck that sits along an ivy-covered brick wall. It's so pretty out there!Second, our server was just wonderful. So helpful with the menu, very honest. He really took care of us. Lastly, the food was impeccable. My boyfriend spent 3 months living in Thailand, and said this was the most authentic this food he had since his trip. It was that good!It's Byob, which rocks. They will mix you up a pitcher of sangria if you bring the wine. What more do you need?Needless to say, we will definitely be going back. Just lovely!"], ["Kristina V.", "If I were just rating their lemongrass meatballs, this would be a 10 out of 5 stars.Lemongrass meatballs Lemongrass meatballs Lemongrass meatballs Lemongrass meatballs Lemongrass meatballs Lemongrass meatballs Lemongrass meatballs Lemongrass meatballs They're delicioussssssssssss!!!Sorry to say, but the pad thai and drunken noodles leave MUCH to be desired.  Thai food is amazing because it is full of robust and rich flavors.  These dishes.... did not have that.  The lemongrass meatballs, however, are consistently good.  The prices are also very high for the quality...  :(  I'm really sad to say all of this, but this restaurant used to dish out food that was MUCH tastier back in 2010 than now.  The rooftop deck of Trio overlooking the Fairmount area is a beautiful and quaint place to have a romantic dinner... just don't get the noodle dishes.  Stick with the curries, they are much better at that than anything else.  And again... LEMONGRASS MEATBALLS!"], ["Edward M.", "Trio's a cute BYOB on a quiet corner not far from the Art Museum.  They have seating both downstairs and upstairs.  The clientele the evening we stopped by included couples out for a romantic dinner and families with young children.  The decor is on the upscale side of casual.  Or maybe the casual side of upscale.  The service that evening was kinda bumbling, though on the plus side, it provided for much entertainment.  Other servers seemed to know a bit more about what they were supposed to do, so maybe you'll get one of them.The drunken noodles with chicken dish was pretty tasty.  Not worth a trek for, but certainly satisfies a craving for some spicy wide noodles with Asian spices.  The tom-ka-gai-like soup one friend got seemed rather thin (or at least thinner than I've seen it elsewhere).  The others got different versions of the drunken noodles and their enjoyment varied.The dinner options were somewhat pricier than other Center City Thai restaurants, though not prohibitively so."], ["Ryan T.", "Overpriced. Food wasn't good... It was edible, but by no means \"good\". They even charged per can of soda... But did not make this clear at the start. Seriously, what restaurant charges for refills of soda?? Service was bad... And to top it all off, they have an iPad that they bring you to pay by card. That's fine... Except the tip starts at 18% and they stand there as you tip. It didn't stop me from pressing \"other\" to leave them a lower tip... But it made it very uncomfortable for them to watch me do it. Even if I paid cash... I feel like the tip is not supposed to be counted in front of me (good or bad).I will not go back. By the way... The menu wasn't even authentic Thai for the most part...."], ["Sari A.", "We ordered three Drunken Noodles and a soup. The food was was mediocre, lets proceed and focus on everything else for now, okay?!Our waiter, who I'm reluctance to give out his name, did not comprehend that one of us wanted a soup, and thats all what she wanted for dinner. He kept asking \" And for you, just the soup?\" like FOUR times. I'm not even kidding you! \"Only the soup\", \"just the soup\",\" just to make sure, you only ordered soup.\"It didn't take long time for us to got our Three Drunken Noodles ( With chicken, duck and jumbo shrimps.) She didn't get her soup yet. At that point I wasn't sure if he did it in purpose to be funny, or he really forgot. One of the people in my group has a really low tolerance for spicy foods. He asked the waiter about the heat level in his dish to make sure it was the right for him or to even lower it for him. His Duck Drunken Noodles was so spicy he couldn't eat it.  Our water glasses were not filled unless we asked for refill, which took forever.  We even asked for a water carafe to make our life easier. The waiter didn't know what a \"carafe \" was. So we asked for a \"pitcher\" which came after we asked him for the second time. Prior to ordering, we asked the waiter if we can get separate check, since we were carrying only cards. The waiter said of course, it won't be a problem. Well, it was. The waiter, brought us the bill before even asking if we need anything else, some dessert for example. Anyway the bill was NOT separated!!! He said he will figure it out. 10 minutes later, he came to pickup our payment. Another 10 minutes before he came again, and asked us to go to the cashier and tell him what we got and pay it over there. Convenient?!!I'm giving Trio two stars because my shrimps drunken noodles dish was okauish. Not delicious, nor horrible, just good. And I LOVE Thai food.Once overheard\" most supermodels are ....\" I prefer to use not very smart. Two Yelps."], ["Tiffany T.", "This is based on a my first and only delivery service from here.First off the delivery took 30 minutes more than the anticipated estimate. Placed order at 5:15pm, confirmation stated around 6:15pm, it was delivered at 6:30pm without a call to notify us. Second off, the noodles are just OK -- and priced at $13 ( with delivery comes to $17) it's not something I'd get again. It's not terribly authentic -- they use American broccoli and eggplant in the dish.. and as some of you may know it's traditionally made with Chinese broccoli but of course, never with eggplant that is kind of an odd addition. It's also listed as \" crispy tofu\" and let me tell you that was not crispy tofu.. it was soggy.. The food was pretty okay, but nothing that blew my socks off to make the money worth it. I hate to say it, but it tastes like your average corner store $5-6 Americanized stir fry  which I'm not a fan of. Was looking forward to  this place, but unfortunately will not be a repeat customer."], ["Michelle P.", "It's probably been years since our last visit to Trio.  After a long bike ride and storms in the future, delivery only made sense for last Saturday night. We ordered the Drunken Noodles with beef, fresh pineapple fried rice with duck and the vegetable samosas to start. Their website prompts you to order through Grubhub so the ordering process was easy and pretty prompt. Everything came to us warm and neat.  The vegetable samosas were probably our favorite part of the meal. They consisted of potato, edamame, veggies, spices and came with a Thai peanut sauce. There were two large samosas which were really easy to split between two people. I wasn't overly impressed with the rest of the meal. I thought the portions of the fried rice and Drunken Noodle to be fairly small. The rice was a little dry and we had to add our own hot sauce to help the consistency. The duck was sparse and a little fatty. The Drunken noodle was standard but nothing special. We've always been happy with our in-restaurant dining experiences, so I'd certainly be willing to give that another try, however we probably won't be ordering takeout from Trio again."], ["John K.", "In the mood for Thai takeout, the GF and I decided to check out Trio. Located in the Fairmount area, the praise-worthy reviews appear to be on point. Beggar's Pouches [$9]Crisp dumplings filled with minced crab, shrimp, sweet chili sauceWe decided to try the beggar's pouches, which were beautifully hand-wrapped. Despite this being takeout, the pouches retained their texture. Crunchy on the outside and filled with well-seasoned minced crab and shrimp, these were a great starter. Take it all in one bite though or you might have pieces all of your plate - or your shirt.  Drunken Noodles [$13]Crispy tofu, vegetables, wok-seared wide-cut rice noodles, broccoli, egg, onions, bell peppers, Thai basilThe drunken noodles had good chew and the bits of tofu, broccoli, carrots, peapods, peppers, onions, and egg helped to create a nice bite that wasn't too spicy. Salty, sweet, savory, and slightly sour - the Thai flavors were all there.Pineapple Fried Rice [$12] with Chicken [+ $1]Jasmine rice, cashews, pineapple chunks, Madras curry powder The GF was itching to try the pineapple fried rice, which had a nice creamy, gluttonous texture to each bite, which was studded with bits of fresh veggies, cashes, and tomatoes. Despite the creamy texture of each bite, you could still make out the bite of each grain and the bits of chicken were plentiful and juicy.Trio may be our new go-to Thai place and I'm looking forward to trying some of their more authentic dishes - as well as some pad thai, natch. Trio is also BYO - so head on over with a bottle of vino and you won't be disappointed!"], ["Khusbu P.", "Great restaurant just 2 blocks away from my apartment. Ordered vegetable spring rolls, drunken noodles, vegetable fried rice, and red curry chicken. Everything was spicy and had so much flavor...we loved it! The only negative things I have to say about Trio would be that our server was a little too slow and the food took longer than expected to come out. Besides that, my family really enjoyed everything."], ["Jennifer R.", "Love loved this place. very cute, clean BYO with some of the best thai I've had in Philly. Their green curry and lemongrass meatballs were absurdly good. Never thought I'd have meatballs at a thai place but put lemongrass in some meaty balls and you got yourself a good evening ;-)The drunken noodles were prettier than most thai dishes with massive noodles on them and had such great flavor. We also tried the beggars pouches and the seafood hot pot with glass noodles which were both good too. Our server was nice and didn't judge us 3 small ladies throwing down every kind of bottle alcohol comes in, so that was cool. Prices are fair for the quality of the food and being in a cute transformed rowhome that was well decorated felt right for a fairmount byo. Will be back time and time again! Esepcially in the summer since it looks like they had a patio you can eat out on too!"], ["Nazee Z.", "Cannot wait to live closer to this place! A couple of friends and I went for a lady date and were ready to eat a tonnnn of Thai food. There was an adorable outside patio that I'm really looking forward to sitting at during the summer too!We started off with the Beggar's pouches, which were kind of like crab rangoons, but no cream cheese filling. The sweet chili dipping sauce was absolutely amazing, and the pouches served perfectly to get us hungry for our meals.We all split the Green Curry, Seafood Hot Pot, and the Drunken Noodles.The green curry was absolutely my favorite. Perfectly spicy and came ladden with veggies, chicken and rice. So refreshing and such a delicious sauce. I ended up putting the sauce on every dish cause it was so perfectly coconuty and spicy.The seafood hot pot was really great! Tons of shrimp, scallops, and calamari. Veggies on the side with rice were carrots, zucchini and squash. I wish there was a sauce involved but the lightness of the noodles with the seafood was really delicious, plus, the green curry was seeping into everything :)The drunken noodles were also delicious! Very gingery and lemon-grassy. Perfect compliment to our carbo loaded meal.Definitely coming here again as it was moderately priced and a BYOB!!One and only one downside: no chopsticks :("], ["Beth D.", "Ordered the pad Thai and the drunken noodles. The drunken noodles were awesome, the perfect amount of spice. I would definitely order that again. The pad Thai on the other hand was a little disappointing. There just wasn't enough sauce to go around, I felt like they ran out of sauce or something. That is usually a safe go to when ordering Thai, I won't order that again from here. Overall I think the quality of their food was great and I would love to go again. Also this place is BYOB ;)"], ["Laura D.", "I've gotten take-out/delivery a few times from Trio and I'm just not that big of a fan.  Unfortunately there aren't many Thai places in Philly, and Trio is the only one near me that also delivers.I've gotten the seafood hotpot a few times which isn't bad - plenty of seafood (along with veggies and glass noodles) which I guess justifies the $19 price.  But it's not very 'hotpot' like to me... it has no broth, just a container with meat, veg and noodles like Chinese takeout.  It's tasty, but also slightly greasy and some of the seafood is little overcooked and chewy.  Maybe it's better when ordered at the table?Finally, if you're looking for quick delivery, this isn't the place.  It always takes a full hour (takeout is quicker).  And the Grubhub delivery minimum is $20 so you can't order just for yourself (unless of course you get the hotpot).  Sorry Trio, I'm just not overwhelmed.  More just whelmed."], ["Therese M.", "Had my birthday dinner here back in November and was extremely happy with how it turned out! We were seated at a long table on the first floor. It's the first time I've ever seen anyone dining downstairs, but worked out perfectly for our party of 13. I had called ahead of time and arranged to do the family style dinner package. For $25 per person, you get an assortment of appetizers, 4 different entrees, and dessert for everyone to share. They did a great job attending to our group and everything was delicious, as usual. I definitely recommend Trio for group dinners!"], ["Bhavika P.", "I would have given 5 stars if only the service was good. I visited with my family on Friday, August 14 and while it was not so crowded the service wasn't great at all. We kept waiting for the server and finally lost the patience and had to go walk towards server and ask him to take our order. Even after taking the order, it took forever for him to just come and say that they were out of ice tea. Food again took forever to come. Food came then plates dint, plates came then fork dint. So ya was very disappointed with  service. However Thai veg basil fried rice and drunken noodles were very delicious. Food was awesome no doubt but again Thai tea was awful. And the server also told not sure why the chef made it the way it was. I would debate if I should go or not again."], ["Gabby M.", "A nice, neighborhood place. The food was pretty good but the service was incredibly slow. To be fair, we had a party of 8. But, to be whiny, it took over 2 hrs for us to get out of there (ordering and eating at a normal pace)."], ["Jesse C.", "This restaurant used to be one of my few delivery places.  After my experience this evening I will never order from them again. I would give zero stars if I could.  The Tom yum soup was as far as I could tell luke warm coconut milk and mushrooms.  The Pad Thai noodles...supposedly their signature dish tasted rancid and as if it was cooked last week.  I ended up throwing out $30 of food and when I called about the horrible quality was abruptly hung up on with no offer of refund or replacement."], ["Larissa G.", "I have to say- Trio is literally a completely different restaurant when dining in as opposed to getting delivery. My party of 4 walked over last night and picked up beer on our way (yay for BYO!). There was a man standing outside the \"to-go entrance\" and we all thought he was just some guy waiting for his food... until he turned out to be the host and led us to our table. Maybe he was just standing outside because it was a nice night? We were seated upstairs at a private little table, which was really great. Our server was Victoria and she was extremely warm and very helpful- I would give the service 5 stars. After reading reviews, we got the beggars pouches appetizer. The main flaw with this meal was that it took over 30 minutes for these to come out. Our server apologized and said there had been a large party downstairs that had their order in right before us. We weren't too upset because there were a couple drunk girls in the restaurant that were hilarious. It was seriously like dinner and a show listening to their commentary, and they ended up giving us their half-full bottle of wine when they left. Score! I just hope they didn't drive home... After the appetizer, it took still a little longer for the entrees to come out. My boyfriend and I split the pad woonsen glass noodles with tofu and the fried rice with lemongrass meatballs. I was too worried to try the pad thai again after how lackluster it was the last time. The glass noodles had tons more fresh veggies than before and the flavors were really good in both dishes. It is a tad pricy still, and I will probably never order delivery from here again. But, for a dine-in neighborhood BYOB, I give it my seal of approval!"], ["Ron G.", "3 stars for BYO, decent vibe, solid thai staples.Lack of more stars for the specials menu writing checks the kitchen can't cash. The seafood medley thing we had was fairly awful. The lobster was truly inedible, the shrimp and scallops were overcooked, and the brown sauce was $5.00 take out brown sauce.The Drunken noodles, however, were quite tasty, as were the myriad of apps we had. The shrimp dumpling soup was nice as well, simple, hot, and tasted relatively fresh.Maybe I just had a bad batch, who knows. I'll definitely order from and come here again, but mainly when I gotsta have some Drunken noodles and Chicken satay."], ["Snehal M.", "Great little gem in fairmount. I have been in the greater Philadelphia area for a long time now and just discovered Trio a few months ago. I have already been back 5 times; this should indicate my infatuation with this place.The food has been consistently delicious. They are pretty serious about their spices so be careful if you go to the upper portions of the spice scale. I would recommend the pad Thai, drunken noodles and the Thai samosas. I haven't veered away from these items because of how delicious they are. But I hope to go back another time and try the curries. Also once in a while they have the deviled eggs as specials and they are unbelievable. The ambiance is actually very nice and the staff is very helpful. They have a deck which I look forward to trying out in the summer time.The only problem with this place is Parking. You may have to circle a few times and park a couple blocks away. So a lot of times, I just end up double parking and doing take out.The quality of the takeout is just as good as the dine-in.I gave it 4 stars for now as I haven't tried their curries and I really think that the curries will make that push to five star"]], "JJ Thai Cuisine": [], "Ratchada Thai & Laos Cuisine": [], "Pho Xe Lua Viet Thai Restaurant": [["Anna Y.", "By far the best pho I've had since I moved to Philadelphia. It's cheap, the broth is made fresh daily, service is always great, and the food always comes out so fast!. Always my to go place for pho."], ["Sammip P.", "While trying out all the different Pho places around Philly, I find that this was mediocre. The broth was watery and had almost no flavor to it. Perhaps because it was Saturday during lunch time and it was starting to get pretty busy. But still, the broth is everything and I was let down by it. The meat was tender and delicious and the staff was very friendly. All in all, I'm glad I went here once"], ["Shereen C.", "I've since tried other dishes at Pho Xe Lua so I'm updating my review.Filet Mignon with lemongrass is still tasty.Pho is good, comforting.Appetizer with raw beef slices is solid.Fish dish was not as good.Tofu with vegetables was uninspired -- I'd avoid ordering this in the future.For $5, the mixed drinks were solid. Quite good for the price."], ["Brianna D.", "Only been in philly for a week and have been here twice, the prices are good, restaurant is very clean and the staff are quick. All in all a great overall experience. I hate when people make pho complicated and this place keeps it simple and tasty!"], ["Marshall D.", "Average at best. Very salty. Asked for extra spicy and they brought dressing on side."], ["Juliana K.", "My parents always make us go here when they are in down. The pho here is great. Everything comes out quickly. Pretty typical Chinese/Thai restaurant, but the food quality is definitely a bit better than the other chinatown places."], ["Frank K.", "After over a week in Chinatown, we finally made it to Pho Xe Lua and it was worth it.  We had traditional Pad Thai along with a dish of mixed veggies, tofu and bean sprouts and it was more than filling. And tasty.  I have to say that even though Pad Thai may be the beginner's Thai dish, it was delicious here, one of the best I've had.  Shrimp were plentiful, plump, and perfectly cooked.Beers were incredibly inexpensive for a wide selection of bottles.  Service was efficient and friendly.  Also helpful.  We walked in early on a Saturday night when most of the other restaurants on the street were almost empty.  Pho Xe Lua was almost full on both floors--now I understand why."], ["Brian K.", "Stopped in for lunch today with a friend.  The service was fast and friendly enough and the ambiance purely noodle house, which I like.  We opened with a shrimp roll for an appetizer.  It came with the peanut sauce and it was refreshing and tasty.  My companion, ordered a clam soup, which she enjoyed thoroughly.  I ordered the Bun Bo Hue, which I was a little disappointed with. The broth was a little bland and lack that kick that a good bun bo hue broth should have.  The prices were very reasonable, and because of that alone, it would be worth a try. I am sure my companion would give it four stars, but because my main course was no better than average, I am resigned to give it 3.  Give it try.  It is solid noodle house that will more than take care of your lunch or dinner needs."], ["Chuck B.", "The noodle soup is great. The Tom yum gigantic. The price is very reasonable. Large portions."], ["Michele Q.", "I think I found my new go-to pho spot in Philly Chinatown!  I always tend to frequent Pho Cali when I'm in town because it was right around the corner from the Greyhound bus station.  But I've come to find that they're getting a bit expensive for the quantity and quality of their food.  This time around, I was determined to try out a new place.  Thumbs up, Pho Xe - a bit of a walk but totally worth it!  Ordered the banh cuon and pho for myself (clearly a fatty) but started to have second thoughts when the banh cuon (app) looked like a full meal!  Silly me, I should have known better.  But my momma taught me to never waste food and everything was fabulous.  The pho was delicious and plentiful.  I was also super glad my friend decided to join me because I needed to take a break from eating before I could finish the rest of my food.  She ended up ordering an app and a bowl of pho as well and we both ordered Coronas.  All in all, the bill only came to $30!  Gotta say that's a great deal!"], ["Andrew H.", "Delicious and affordable! I threw down a pho Xe Lua sac biet for only 7.fitty! The soup broth was nice and sweet without being... Sweet. Its not like many places I go to where an XL is just a medium in a huge bowl. They loaded it up with meat, tripe, tendons and all the good stuff. This will be my goto spot for the winter."], ["Vivian T.", "Lets start w/ very great price... appetizer, 2 main dishes, 2 beverages ll for $44 which includes tip ... tasty and well worth it for 2 peopleThe Pho you can skip on b/c the broth is weak... but try 212 - chicken lemon grass and white rice and the pad thai .... bangin'Also, please please please get the vietnamese coffee dripped (hot or cold), a must have here along w. the beef carpacio bathing in lime juice and friend onions and fish sauce.For a fast in and out (40 mins top sit down venue), it gets a 4.5 stars minus 0.5 for the lack of ambience"], ["Rebecca G.", "My friend and I came here for Pho yesterday.We started out our meals with a share of the spring rolls, which were accompanied by a tasty peanut sauce, and proved the perfect appetizer! We then continued with bowls of the seafood and special pho, respectively, and both hit the spot. From the broth to the noodles, they were among the best bowls of pho that we have had.Pho Xe Lua Viet Thai is definitely as good as it gets!"], ["Susannah M.", "Upon entering, this hole in the wall restaurant smelled so good. The guy behind the counter was the sweetest, talking to us and giving us recommendations as we waited for a table. It was packed and with good reason. I ordered the pork bun-301 and it was probably the best decision I made all day. The pork was a bit fattier then I am used to but still absolutely delicious. The egg roll was not as greasy as typical and was deliciously flaky. My coworker got the chicken pho and LOVED it. I have a feeling this is our new Thai spot. Plus it is super cheap. Go here if you eat food."], ["Hali R.", "My first time having Pho and I loved it! I had tequila sunrise, my boyfriend had a Thai Iced Tea. We both had #105 Pho and LOVED it. The service was fast, friendly, and we only paid $30 after tip :)"], ["Melissa J.", "Cheap, fast service, good food. What more could you ask for? I came in on a weekend night with two girlfriends and we were seated immediately. You receive complimentary hot tea for the table, and it's pretty delish. We ordered spring rolls and three bowls of pho. Everything came up super quick. You need only look in the direction of your server and he is at your table, reading your mind, and already doing what you are about to ask. I ordered a large bowl of chicken. The large is pretty big and that is the smallest size. I ate maybe 1/4 of my bowl. The 1/4 I ate was very flavorful and steaming hot! I am always a fan of the \"add your own\" sprouts, basil, and jalapeno plate that comes on the side. Our grand total for all of that was about $30 with tip! Will definitely be back."], ["Johnny L.", "I think the food there is pretty average but it is cheap so I don't mind. And it's pretty tight in there, barely any space to get up"], ["Shawn B.", "Fast seating, fast service, food was delectable!I stopped during the lunch rush, I was seated quickly , received GREAT SERVICE....Walked out full, and happy!Definitely worth a look!"], ["Saeed A.", "I am giving them 3 stars, as I have been to few better places for Thai food in nyc and even in philly . These folks are average !"], ["Nataly N.", "Eh, not sure if tonight was an off night for them, considering all the raving reviews... But I came in here starving (so things should automatically taste 10x better) and came out with a very disappointing experience. I would stick with the beef noodle soup (Pho Tai) which features very tender and nicely cooked slices of beef, instead of the one with beef and brisket - which I chose today. The brisket is cooked to the point where it is dry and flavorless, and the broth is a bit on the thinner side as far as Philly pho joints go. The noodles were also over-cooked. I also tried the minced shrimp on sugarcane appetizer, but really regretted this choice after seeing that there was barely any shrimp wrapped around a really big sugar cane stick. Not only have I had it better elsewhere, but for some reason, this appetizer also took a really long time to arrive. The worst was the service, even by Chinatown standards. Most places in this neighborhood have awkward service, but it seems like most of the servers here don't even try. I had barely sat down and set down my purse when someone asked me (twice) if I was ready to order. Once I ordered, the food took a while to arrive, and the service was completely nonexistent after that. I may or may not return. They do, however, offer alcoholic beverages, and they do take some credit/debit cards."]], "Vientiane Café": [["Renea R.", "I really don't know why I waited so long to try this place.  I really love Thai food and I normally go to Pattaya (which is also very tasty.)  My friends recently went there during University City Dining days and had a great experience so I was looking forward to trying it, too.  My opportunity came when my friend wanted to \"go out\" to celebrate her completion of the bar exam that day.  At first I thought she meant \"go out\" like to a crowded bar somewhere downtown but when her husband explained that we were going to Vientiane Cafe I was more than happy to tag along.  I think one of the reasons I had never gone there was that it doesn't look like anything special from the outside, so I was surprised to see just how large it was inside when we got there.  The ambiance was nice.  I felt like we could be ourselves, talking about the \"bag lady\" at the bar, and be boisterous without being awkward.  But it was still quiet enough to enjoy a more relaxing meal.  We had a group of 7 of us and they easily and quickly accommodated us.  Between the seven of us I think we all ordered either the Panang Curry or the Pad Thai.  Both were delicious but the panang curry was truly something special.  I really don't know how they made it so good but it was SO good.  It makes me mouth water just thinking about it now.  One thing I will say, though, is that the spice levels really don't matter at all.  The have a scale of 1 to 5 with 5 being the spiciest.  I got a 4 and most of the others got 2, however they all tasted the same, which was not so spicy.  Normally I would have been really upset that it wasn't very spicy but the flavor was so good I didn't even care.On the downside, prices were pretty high and the service was only so-so.  Also, they are cash only which I find really weird and inconvenient.  With that said, the deliciousness will definitely draw me back again!"], ["Amy A.", "Vientiane's food was good but it wasn't the best Thai food I'll ever had. I will say that it's appetizers are really good but the entree's were definitely just average.Plus points for it being a very charming and well-decorated place. I came here during lunch and had one of their lunch special. (3 courses for $10.95). Good Appetizers: Coconut Soup, Tom Yun Soup, and the Chicken AppetizerMediocre Appetizer: Steamed Pork Dumplings (this definitely came out of a bag you can buy at a Chinese Good Entree: Pad See Ew (drunk noodles). If you like spicy food, definitely get add a spice level to it. They add a lot of onions, broccoli, and other vegetables into their interpretation. Please avoid the Pad Thai. I'm not sure what everyone was raving about, but the Pad Thai was very dry and tasteless. It didn't blend well with the vegetables."], ["Monica L.", "PROS: Light, medium-portioned dishes that leave you satisfied (not bloated)CONS: Stuffy & simple dining space, mediocre serviceVientiane Cafe is cheap for the quality of food you receive! The steamed dumplings were more like veggie raviolis and the sweet and sour tilapia was a bit too sweet (albeit the fish itself was moist and cooked to crispy perfection). Overall, the dishes are not mind-blowingly good, but they won't break the bank either! Worth a visit. BYOB!"], ["Welton C.", "We went here on a weeknight and had the curry shrimp with sticky rice and chicken pho. The food was excellent, everything arrived in a timely manner and the portions were generous. If you're wondering the food keeps well for leftovers. I highly recommend the restaurant if you've got a hankering for Asian food and are in the area."], ["Sara N.", "Although their spicy drunken noodles passed the Thai test with flying colors, the entire menu is ridiculously overpriced. Also, it's 2013, why is this place \"cash only\"? The food is authentic, but I don't think it's worth the arm-and-a-leg prices. I'm now on a quest for a more humble hole-in-the-wall establishment for my chronic Thai food cravings."], ["Elizabeth D.", "They have a really nice selected of vegan options.  The Penang Curry is my new favorite food. I LOVE that it is byob. The service is hit or miss but the food is consistently good."], ["Anisha C.", "Cash only, delicious hot thai food, delicious Soft Tofu substitute in all the meals, haven't tried anything that I haven't liked! The renovations has made this place a delight with no wait time for a table, and still keeping to being BYO, amazing! Prices have gone up in the past few months for almost all of the entrees, but fret not! The amount of food is still quite substantial for one. You'll lick your plate clean and be left feeling quite full, with some room for dessert!On weekends, they have the $11.95 lunch special, a soup, appetizer, and entree all for $11.95. Spectacular!I've been notorious to only get the aw lao, a lemongrass and eggplant soup dish over sticky rice. So delicious. Friends have been known to get green curry, the pad-kee-mao, and sweet basil fried rice with rave reviews! Favorite desserts include the notorious mango with sticky rice, banana tempura, and my favorite the coconut ice cream, made from coconut milk and comes in coconut shells. Sold! Definitely a go to spot on the good old baltimore ave."], ["Dave H.", "This eatery isn't much larger than a walk-in closet, but bright walls, flowers and candles - and the fact that they're a BYOB - make this an affordable date spot. Due to its size, you'll never be ignored by the friendly staff, even when there's a crowd.The kitchen works fast, turning out piping hot Laotian and Thai dishes in record time. There's the usual assortment of curries, seafood, and rice plates. Fresh spring rolls ($3.95; vegetarian; cash only, last I checked) come with a side of sweet plum sauce and a pleasantly tart fish sauce. Try the pad kee mao ($10.95; with beef): While it could be spicier and the beef is almost dangerously dry, the sauteed rice noodles are moist, and the mix of onions, carrots, broccoli, chili peppers, bean sprouts, and basil give it flavor and color."], ["Wendy W.", "i love the renovations!  the restaurant is now more spacious and seats more people.  lots of hits and misses here.  love:  homemade sausage (well seasoned and great to share with a group); duck curry (this is the largest portion of duck that i have ever been served for a duck curry.  the meat is meaty and not overcooked), deep fried catfish (hit or miss, when done right it is crispy but not dried, when done wrong, it just tastes bad); the sticky rice that comes with your entree (served in a small bamboo container that keeps your rice warm and fresh).meh:  paneang curry (i love peanut butter, but not peanut butter curry); cornish hen (looked and tasted like chicken than cornish hen).the service is always spot on.  i love the family business feel and they are always accomodating to large parties.overall, a good place to go with the family."], ["Mickey A.", "This is my go to restaurant! Omnivore, vegan, gluten free... All are welcome. The beef jerky is so yummy. The Kings soup is also one of my favorites.  The Naam salad is the best thing on the menu. West Philly gem."], ["Barrett L.", "Vientiane Cafe is a terrific neighborhood gem gently nestled along a string of dive bars and fellow ethnic joints on Baltimore Ave.  We came here on the recommendation of a friend of mine while entertaining out of town guests in search of the classic Philadelphia BYO experience.  Armed with two bottles of wine, the six of us enjoyed a filling dinner of delicious and cheap Thai and Laotian food that satisfied our hunger and kept our wallet light.I enjoyed the Lad Na with Beef, which is sort of like a Pad See Ew except with a slightly thinner sauce and more vegetables.  The broccoli was crisp, the beef was flavorful and juicy, and the noodles were done just right.  Everything in the dish worked perfectly together.  The BF and I also split a Nam Salad; some sort of lettuce wrap thing that tasted pretty good although I have no idea what the filling was (kind of reminded me of Bac-os?).  Not as good as the noodles in my opinion.The service could have been slightly better (it took them forever to get us the wine glasses, although to their credit we were a large party and it was very crowded for the later side of a Friday night), but I was still very pleased with the food, ambiance, and overall value.  Definitely a place I would be happy to return to for a low-key dinner or even take out.  Also, at just under $20 per person with tax and tip included, it's extremely reasonable.  Do make sure you bring cash though."], ["Yo J.", "King soup the curry the grilled veggie and the papaya salad are my favorites !!! I only eat here when my friend works here or the manager because the new waiters usuallly mess up my order!!! But over all love the ambience and the authentic food!!!"], ["Despina T.", "My favorite Thai BYOB in Philly! Lots of vegetarian-friendly options. Service is always great. Only downside is cash only."], ["Krish A.", "So obsessed with this place now thanks to my friend! But seriously, best Penang curry ever and I love their vegetarian naam salad and Thai tea!! Service is also great and they're very friendly. I highly recommend this place if you guys are craving for some delicious Thai food! Mmm!"], ["Jenn H.", "I had the lunch special with Tom Yum soup, fresh spring rolls, and tofu Pad Thai all for a little more $11.Everything was really yummy and up to my standards. I have no complaints other than service was pretty slow but friendly. Either they need an extra person during lunch time on a Thursday afternoon or she simply was not attentive and proactive enough.For the sake of the food and just more patience needed (or merely hoping for better service next time), I definitely would like to come back again."], ["Kat C.", "The atmosphere here is kind of dark and romantic, so don't bring someone here when trying to keep them in the friend zone. Just saying. Overall: love the curry, pad thai is not great. Hate that they only take cash. Not my favorite Thai in the world, but I've yet to a find a favorite Thai place in Philly."], ["Connie J.", "Amazing food! I am obsessed with their Nam Salad. Although it is a tiny place, and very dim, I enjoy eating there. Their homemade sausages are delicious and full of flavor. I love their eggplant and duck rolls as well!Definitely a good place to dine!"], ["Vinayak B.", "We came here with friends in our hunt for a good Thai-Laos meal. We ordered the bahn-xeo, pad kee mao, spicy basil fried rice and green curry. The only dish that disappointed us was the green curry which was a little too sweet and watered down but the rest of the meal was pretty flavorful."], ["Lilli C.", "I have been following these people throughout the city for the last 10yrs.  They first operated out of their backyard under a blue tarp, served beer for 2 bucks, then was re-located to a wing shop by Drexel, and then was kicked out and moved back to their house but only secretly offering takeout from their house.  So I was quite happy to see that in the last few years they've been able to relocate to their own, cute BYO on Baltimore.Although the food doesn't seem quite as good as the days it was operating out of their backyard, it's still pretty solid.  The green papaya salad is delicious (but has a lot of fish sauce if you are okay with that), the pad thai has thinner, less traditional pad thai noodles which I actually like better,  isn't greasy and very flavorful."], ["Shilpa B.", "Came here with my mom and had the lunch special. The coconut soup and dumpling appetizers were delicious, as was the Pad Kee Mao noodles (like drunken noodles)  that my mom ordered . I wasn't a huge fan of the chicken satay - it was cut differently from what I was expecting and was just okay. The Penang tofu curry that I ordered was a little too peanut-y. Overall yummy, but it depends on what you get."]], "Pattaya Restaurant": [], "Roe": [["Eddie C.", "Wonderful family-run restaurant! Normally would be dubious of places that offer multiple cuisines, but Roe is exactly the place to get great fresh sushi AND a bit of pad Thai for dessert."], ["Ray M.", "Sorry to say my experience here was disappointing. The food was fine, not a wow! My green curry with shrimp was a 10 on the heat scale. I would of appreciated if I had a choice. The server was very friendly. The kitchen was very slow bringing out the food which made the server apologise to the customers every time for the delay. At the end of the meal the computer stopped working and they could not issue my check. I asked her to just give me the check and I'll pay cash. She didn't. I waited for a long while, but I had to go. I didn't want to walk out. Eventually the computer came back up. I will not be back again. I gave it my best. I was very friendly and patient. I understand it may not be in their control. I do feel they should have been a little better with customer service by not having me wait for my food and check. Take your chances, you may have a better experience.  But there are too many other place to go that are better."], ["Jason R.", "Got delivery from there twice. Both times took over an hour. Both times forgot stuff. When I call back to complain about both wait times and the missing stuff they literally laugh at me. I don't know why it's so funny? Done with this place for sure. Horrible customer service"], ["Casey B.", "Mehhhhhhhhhhhhh.Ordered from here on Grubhub. The driver accidentally switched my order with someone else's, so I had to wait for him to come back, which wouldn't have been a huge deal if the food had been decent, but...Also, it seemed slightly odd to me that the delivery guy took the food from me when it had been in my possession for a full half hour. I totally could have poisoned it or something. I'd never do that, but I'm just sayin. Seemed like a bit of a liability.Onto the food. We got an order of chicken fried rice, spring rolls, a spicy tuna roll, and a spicy salmon roll with avocado, both with brown rice.The sushi came with white rice instead of brown, which is a huge pet peeve of mine when I'm trying to trick myself into thinking that I'm being semi-healthy. The sushi was by no means the freshest I've had. The chicken fried rice was dry and really lacking in that delicious MSG flavor that I've come to know and love. The spring rolls were pretty decent.Overall, I was disappointed enough by this meal to immediately gorge myself on cold pizza after, so, yeah. Not a fan."], ["Ann V.", "Ordered from Grubhub during this horrible snowstorm. Food came w/in 30 minutes!! Super surprising since there are so many people on here that state that it took forever long. I suppose im not surprised it took forever for their delivery - that seems to be my usual experience with Grubhub in general.Anyway, food is decent. My pad see ewe was a bit salty and massaman curry wasnt as amazing as I've had at other places. Good enough. I can't expect anything more since most places that serve two types of cuisine always semi suck. Thai and Japanese? Just choose one and focus!"], ["Sarah R.", "Ew. I couldn't even eat the drunken noodles because they smelled like an infected wound and were slimy and disgusting! I love Thai food and have had this dish hundreds of times elsewhere, and this is hands down the worst. Shouldn't even be allowed to sell these and call them drunken noodles. Stay away."], ["Anthony S.", "Last night I ordered some food from Roe Thai via Grubhub, and I probably won't ever order from here again. I should've known better, since most places that attempt to do two separate types of cuisine (like Thai and Japanese) are very rarely any good. Service was fine, though. From ordering to delivery it took about an hour. I ordered the vegetable Roe Yaki Udon, which was listed as one of their \"chef signature hot dishes.\" Admittedly, I interpreted that as meaning it would be spicy, so I was extremely disappointed when it arrived and it had zero spice whatsoever. The noodles were salty and greasy, and the tofu was in such small pieces that it was difficult to taste it. The portion definitely wasn't worth $10.95, either. Maybe this place is better if you get sushi, but if you want Thai there are definitely better places to go."], ["Scarlett Z.", "Worst experience ever! I ordered a Lunchbox which cost more than 15 dollar. It came with one dumpling with really dry meat in it and a little curry. I chose shrimp in my green curry so I had to pay two dollars more. Even if I paid more money, I got four pieces of shrimps and little amount of curry on the bottom of a small box. I am wondering if I didn't get shrimp what will  be in the box. Only a little bit of vegetables in little amount of curry sauce.?Dishonest business. Worst customer service ever. It was the receptionist's fault that she didn't tell me earlier that my address is 3 miles away from their restaurant when I ordered the  food. After waiting for more than half an hour, I was expecting a phone call that asked me to pick up the food downstairs. However, she called me to pay 3 dollars extra or they will not deliver me food.Bad customer service. I called the restaurant and reported the problems to the receptionist.She didn't feel sorry at all.  She said that the lunch box is what it should be. It is because I am a first time customer that I don't know that. Yes! It is my first time to order their food ever and also the last time ever."], ["Suzanne H.", "As my usual sushi placed was closed last night I decided to venture out and try something different. After spending $33 on 3 rolls, I should have just had cereal. I ordered off of grubhub and the delivery was fairly quick however the food was very disappointing. The shrimp tempura was soggy, the spicy tuna had no flavor to it, and the american dream was also soggy. I called and spoke with manager. After telling him how disappointed I was I offered my order number so he could know what order I was talking about. He said \" I'll talk to staff and I got it\". I was even more disappointed that he didn't apologize nor did he offer a refund or gift certificate to try them again. As I am in the hospitality business and am a manager for a  hotel within walking distance, I will never recommend this place ever again to guests. Poor customer service. Poor food quality."], ["Rikka S.", "Delicious food and incredible presentation of the dishes. Also extremely friendly waiters and workers!! Highly recommend the Thai fried rice."], ["Angela W.", "Delicious!This is a fusion restaurant, which I tend to love. This is my go-to sushi place in Old City. I only live a few blocks away so I eat here quite a bit. I always get their vegetable sushi, which is a good mix of sweet and savory. Their miso soup is good and has these little mushroom things in it that I haven't seen in other miso soup I've gotten. My favorite is their Pineapple rice. It actually comes inside a pineapple! It has saffron and pineapple in it. It's a little bit more mild on taste (verses traditional friend rice) but it's not greasy at all and it doesn't feel heavy the way rice usually does.Every time I've been here I get one of two women waitresses. I wish I knew their names because they are amazingly sweet! Even when a costumer at the table next to us was asking her questions I would have considered were a bit on the racist side, she handled it well and never lost her composure or politeness (I feel bad I didn't call the guy out on it like I should have).I've never tried their pickup/delivery, but for in-house eating I definitely recommend it!"], ["Andrew W.", "Ordered from here on Valentine's night, my order was never delivered and they told my multiple times that i would receive my order within 10 mins that the driver is on the road. Ordered at 1030 and nows its 1:30am, no answer from the restaurant and no other place is open and if they would of just told me that they did not deliver it i would of got food somewhere else. but no, they lied to me numerous times and now its too late to order from somewhere else."], ["Grace R.", "I ordered food on grubhub and it took over two hours to come! When i got it the food was cold and it wasn't even good. I'm truly dissatisfied with their service and will never order from here again."], ["Jimmy S.", "I order deliver from Roe all the time. The food is always good. However the delivery drivers seem to have a hard time deliverying to my front door. Failure to use the call box each time."], ["Dima G.", "Really good sushi and byob, underrated spot."], ["Cat N.", "I've come back to this place for lunch the other day. And it's really tragic that the service is sooo slow. I know this is a small place, and they were kind of crowded that day about (4 other tables), but my co-worker and I waited over 1 hour for our 2 sushi rolls. It's not just us, but unless you get the lunch special, the service is pretty slow.I REALLY do like the rolls though. They have different varieties and interesting combinations. But my co-worker ordered 2 rolls that should be warm when eaten, but I guess since it took a long time, it was cold by the time it came out. She had the volcano roll.  The waitress was nice, but the service is slow. I would probably order out next time, because I can't wait over an hour for lunch and then inhale my lunch since i only have an hour lunch. MUST TRY; Las Vegas Roll"], ["Dia H.", "Always enjoy the sushi there. The seafood is fresh and the combination of items are GREAT!  Such a hidden gem!  Is also helps that the wait staff are so nice!  Small venue and great food. Mmmmmmm"], ["Sofia S.", "Uuuummmmm..... I don't even know where to start. Would I eat there again? Yes. Would I recommend my friends to eat there? No. As a vegan, My options for where to eat are limited depending on where I am. So I decided to go with Asian. That's always an easy pick. I didn't want anything too fancy. I just wanted to sit and eat and leave. I got that. What I'm confused about, is whether this place is fast food or not. I mean, that might be a bit of an insult, but I don't know what they were aiming for. It was awkward when you first walk in. Do I seat myself? Is someone going to seat me? Do I need to go ask someone? Very confusing. When I walked to the back, a few of the servers smiled, but didn't ask if I needed help or if I needed to be seated. So I'm left standing, awkwardly, among other diners. The food was... Meh..... It looked pretty, though. The server was very nice! I liked her, but we only saw her twice. Once when she took our order and second, when she left the check.  They were also playing two different types of music. I heard hip hop in one area and some traditional Asian music in another. The place is very tiny so that was super annoying. I'd say, give it a shot, but don't have high expectations."], ["Lindsay K.", "Delicious! So far the best sushi delivery I've had in south Philly!! I got the dragon roll and the volcano roll. I've also had miso soup, spicy soup, and shrimp pad Thai there. Yummy!!!! If someone thinks there is a better spot let me know! It will be tough to beat this place!"], ["Allison B.", "Pleasantly surprised! It's always a shot in the dark when you buy a Groupon for sushi.This is the place that took over Zento, which just moved two doors down. The upside to Roe? BYOB, baby.Fantastic roll (crunchy spicy tuna roll topped with salmon, yellowtail, avocado,and jalapeno tobiko) was indeed fantastic. Agedashi tofu portion was HUGE, lots of broth. Good to share, most def. I'll be back.Question: why do so many sushi joints play Top 40 so loudly? Don't get me wrong, I ADORE pop music, but I don't really want to listen to One Direction while I'm on a dinner date. Roe, could ya turn it down a notch?"]], "Jasmine Rice": [["Brian C.", "Jasmine Rice was a simple, elegant way to spend an evening with my family. I came to visit from New York and my father picked me up after making a reservation for 7:30pm on a Wednesday. We arrived 5 minutes early and were seated (the restaurant was half empty due to rain). We brought with us a growler of beer and bottle of wine to share, which was more than enough for us. The host was very kind and made sure we were well hydrated while we waited for our food to come out. It did not take too long before appetizers and soups came to the table, followed by the main course. I had the crispy duck fried rice, which was quite tasty, and all other meals were enjoyed as well. Overall a wonderful place for a meal, and not too expensive!"], ["Lauren D.", "Very very Americanized Thai. Very sweet. No fish sauce to be seen on the tables anywhere. No chilis in vinegar, no chili garlic sauce... The crispy is covered in straight hoisin sauce. I tasted ZERO tamarind which is a sour/tangy fruit to counter balance. The meatballs were the only saving grace, as they were savory with lots of garlic. The pad se ew was ok. Nothing to write home about. The ambiance was nice and the service well."], ["Sumita R.", "It was a little cold and blustery the other day and I wanted something warm and comforting. We had walked by Jasmine Rice before but never tried it. We decided to stop in yesterday for a really late lunch. I had the lemongrass soup with tofu and vegetables. The soup was like Tom Yum soup but a little sweeter. Overall decent and I would get it again. My boyfriend had the chicken satay and then we split the red curry chicken and had brown rice. My only comment on the red curry was that it was lacking in vegetables. The chicken portion was fine but it seemed like instead of vegetables, there were a ton of bamboo shoots. The flavor of the curry was nice and I thought the medium spiciness was dead on.  I thought the portions overall looked small but they ended up being really filling. I would definitely go back and try out more dishes !"], ["Aviral R.", "Food was well flavored. Wish the portions were larger. Minimal staff though this could have been because it was Sunday."], ["Natalie K.", "This place was good! I thought that the taste was on par with what I was expecting, a little more mild than I like. Prices were cheap, but I thought that portion sizes were a little small... kind of reminded me of the small space of the restaurant. However, that being said, I didn't feel ripped off. Prices were adjusted for the smaller portion sizes. A friend and I split the Panang Curry with just veggies (unless tofu is fried I don't want it) and the drunken noodles (Pad Khimao) with chicken. I was happy to split two dishes so I could try two of my favorite staples at any run-of-the-mill Thai place, but I was just coming off of post workout and the hunger was real (talking borderline hangry) and I just wanted more food than what was in front of me. Thank god it was a BYOB and we had ample wine to deal with that issue.I think they way they served the curry at this place was super strange though! It was served on a flat plate. Makes it a little difficult to eat curry. I had a spoon and I couldn't ladle any of the delicious-ness on to my plate, which made me sad. The only other thing that was weird was that our food was brought out at different times. We had all ordered dinner portions and for whatever reason, they brought out one person's much earlier than the other dishes. The service was very friendly though and pretty attentive to filling our water glasses and clearing dishes from the table. Like I said the food was good, but this is too far away to become my new staple Thai restaurant so I'll stick to the other one's close by!"], ["Jason Y.", "Party of 3 ordered meat ball, papaya salad and special dumpling that the waitress recommended. Papaya salad was good but we don't really like the meat ball and the dumplings. Too much dough for the dumpling. For entree we ordered duck noodle, seafood with rice noodle and curry. My duck noodle was basically tested like pure \"Hoisin sauce\" from the can which normally use for Perkin duck in Chinese restaurant. The seafood noodle was a little too blend in my opinion. The curry was good, that's why I rate 3 out of five. Table was very close to each other and the ceiling is very very low, felt a little too tight in there. Service was friendly and efficient."], ["Danan R.", "Probably the most authentic Thai restaurant in Rittenhouse with friendly service and very good food.  Some highlights:1. Pad See Yew: Made with Chinese broccoli and plenty of egg in a savory sauce.  Very very good.2. Red Penang Curry: Spicy and creamy with fresh veggies, plenty of beef, and the best curry broth.3. Ginger stir-fried chicken: Amazingly savory and cooked with tender pieces of chicken breast.  Great if you are looking for a non-spicy dish.4. Crispy duck fried rice: The duck definitely rivals Morimoto's with tender meat and a crispy skin.  The rice is delicious with plenty of veggies and egg.  5.  Siam Salmon: Great tangy sauce with a delicious fillet accompanied by crispy, fried crab.  Love!6. Salt and Pepper Shrimp Rolls: Filled with actual whole jumbo shrimp and served with a delicious dip.  This is unique to Jasmine Rice so highly recommend trying.7. Papaya Salad: Good but not differentiated from the other versions.8. Chicken Lettuce Wraps: A great spicy version of a classic.  It's a Gar pao accompanied with large Romaine leaves.  I would recommend getting a bowl of sticky rice and having the chicken with the rice.Service is very attentive but the seating is pretty cramped so definitely book reservations for a party of more than 2.  It was a Tuesday night and packed!  Will be back to try more of the curries but so far so good!"], ["Edward M.", "This cozy spot in Center City offers some tasty Thai food at reasonable prices.  The appetizers, like the spring rolls, can appear tiny when looked at.  Probably because they are.The entrees, at lunch, at least, are not particularly large, but are a good size to fill you up but not stuff you.  And more importantly, they are yummy.  At least my chicken curry was.  It was so good I wanted to lick the plate clean.  The chicken meat had a good taste and texture, too.  And there are many more entrees to try on the menu.Service was friendly and attentive, with a server never letting a water glass sit empty on the table."], ["Diana K.", "We came to Jasmine Rice because we were craving a spicy BYOB dinner. We were pleasantly surprised by how quaint, clean, and welcoming the restaurant is, and the location cannot be beat.We were very happy with the meatball appetizer (although it was very small for $8), and the green curry beef dish, which had an aromatic coconut and lemongrass flavor. I also ordered the green papaya salad, and it was a bit water-logged and had lost its crunch. I don't know if this dish was prepared fresh, but I have had much crunchier papaya salad at other Thai restaurants.In general, the portions were small, and we had to ask for extra rice in order to fill up. After paying $40 for two people, we almost left hungry, which was pretty disappointing. Overall, the quality of the food was pretty good, the service was nice, but I am not sure that I would come here again due to the poor value, in my opinion."], ["Jerry T.", "Jasmine Rice is a solid entry in the realm of Thai restaurants in the city.  A small spot on South 16th Street, you might miss it when walking by.  Lately, I've used it as a spot for lunch meetings - and found it to be a hidden treasure in that part of Center City!The service is always very friendly and helpful.  The staff really goes out of their way to accommodate you.  As for appetizers, I've tried the Ginger-Scallion Dumplings, Thai Basil Meatballs, and Sriracha Calamari - all served in generous portions and delicious!The Drunken Duck is my favorite - always a good choice - served in a healthy portion and absolutely delicious!  I have also tried the green curry, which is really nicely done - the sauce was spot on great!This is a great little spot - I highly recommend it!"], ["Anu P.", "Delicious BYO in Philly! I love that Philly have BYO restaurants that are actually nice and classy (to some degree) and have delicious food. My first experience was at Mercato and now at Jasmine Rice - both did not disappoint at all! We ordered a variety of dishes and here are my recommendations: +Green curry+Pad kee mao+basil tofu dish with egg on top+green tea mochaThe service is probably what set the good thai food apart from other thai restaurants - it was a nice sit down thai restaurant, without too much fuss / extravagant pricing, and considering we sat there for 4+ hours, the service was extremely kind. We were never asked to move faster than our pace, our waters kept refiling and our waiter had no issues clearing our numerous wine bottles. We were one of the last parties in there and he still very happily gave us dessert recommendations. The one thing that was off was that our dishes didn't come out together so we waited awkwardly for all 4 main courses to arrive before we started eating. Other than that, I would definitely come back here for another BYO dinner!"], ["Matthew S.", "Really fantastic food, and super sweet owners who took care of us at lunch time. The drunken duck is to die for! Some of the best Thai I've ever had!"], ["Liza K.", "I've been walking past Jasmine Rice for months and months, and always wondered about it, but was happy enough with Circles that I never gave it a chance.  Finally, I tried it with a friend for dinner and we haven't gone back to Circles since!  Jasmine Rice is a more affordable and, in my opinion, even better-quality Thai food option.  It's also really convenient to pick up from there instead of having to order from Circles.  We loved sitting in the restaurant - it has a very calm and laid-back ambiance.  It's not pretentious, but still very classy.  I loved the Chicken Massaman curry - my friend loved it so much that it's her new go-to.  Their classic Chicken Pad Thai is my personal favorite, but I do like that they have a nice variety for when I'm feeling more adventurous.  I always get a small Veggie Coconut Soup.  The broth is really light, with a hint of lemon and has just the right amount of veggies.  It's a nice way to start any meal.  Their spring rolls are just average, I think I'd like to try their spicy Thai Basil Meatballs next time instead as they get really good reviews on Yelp - update to come! Their Thai Iced Tea is good, just a classic.  I liked it to go and in the restaurant, so no difference there.Their Chicken Pad Thai is pretty huge - when I get it as take out, it usually lasts me two full meals, and by full, I mean that I'm really full after eating about half!  It's just your typical Pad Thai - nice rice noodles, great sauce and some peanuts sprinkled on top.  Mostly, I just find the quality to be really good - no MSG or any gross aftertaste that I've been fighting to avoid with take-out.  My roommate still prefers Circles in this department because theirs is more garlicky and has more of a kick, but I prefer Jasmine Rice's milder take, so it all depends on your preferences.  I think I get a bigger portion at Jasmine Rice too, so that makes a difference! The Chicken Massaman curry is a really tasty - it's has potatoes, carrots, chunks of onions and sprinkled with peanuts.  The sauce is tasty, mild, although don't get it if you aren't a fan of coconut.  I loved it because I can't handle anything very spicy, but do enjoy rich flavors.  This was a great dish for someone who doesn't want to compromise on something bland, but isn't in the mood for something super spicy!  FYI - Order it with rice - when my roommate ordered it as takeout it did not come with rice, so it wasn't something she had leftovers for the next day.  But it's still worth it, delicious flavors that don't overpower the veggies and chicken.  The Green Curry with Chicken was spicy, but not too spicy.  It wasn't anything super exciting in my opinion, I much preferred the Massaman to it!The owners are also very nice - and the service is great.  It takes 20-30 minutes for the food to be ready if you order for take-out.  I've generally waited a few minutes when I got there right at 20 minutes during peak dinner hours, so I might give them five more minutes next time.  But they're very friendly and make it easy to pay while you wait.Just FYI - it's BYOB if you go there, as their website suggests!  So don't forget to bring your own wine!"], ["Raj D.", "We went there yesterday based on the (mostly good) reviews on Yelp. The service was very courteous and that is the only reason why I'd give it 2 stars instead of 1. They can prepare dish, according to their menu, at different spice levels. So, I selected one of the dishes that looked interesting (The King and I) and I ordered it to be prepared at medium spice without the pineapples that apparently came with it.The dish came stocked with pineapples tasting like shrimps in sugar syrup ! I was in a hurry and didn't want to make a fuss of it, but regardless, when the host came by to ask how the dish was, I mentioned that it was too sugary. He explained that somehow his internet system had gone down when he was sending the instructions to the kitchen. I'll give him the benefit of the doubt, but with only 2 tables occupied in the entire restaurant at the time, perhaps a little more attention to what is happening in the kitchen and how the food is being served would do well.I'd accept their apology, but to be a great restaurant, you need to look at various aspects of the experience and simply being courteous to guests is only but 2/5ths of task at hand."], ["Luke D.", "So I've been here twice now, and I have to say it is really just OK. Positives include the service and a great guy who may or may not be an owner. Also, the veggie dumplings were really very good. On the other hand, both entrees I have had were mediocre. Most recently I tried \"The King and I\"--\"Jumbo shrimp & chicken sautéed in prik khing coconut curry paste with fresh string beans and bell peppers.\" The shrimp were anything but jumbo, and the coconut curry paste was bland, lacking any distinguishable flavor. Veggies were fine. Asked for 4/5 spicy and didn't receive (a recurring problem in Philadelphia Thai restaurants it seems). Before that, I had the Jatujak Stir-fried with chicken--also bland-ish and not very different even though this was a thai basil paste. Will probably go back because of the area, and hopeful for an improvement."], ["Kat S.", "Had dinner here last night with a friend. It's a small, quaint place. It wasn't too crowded last night around 7. My friend got the chicken satay skewers and I got the ginger dumplings. The dumplings were delicious and crunchy. The sauce for the satay skewers was also very tasty. For our entrees we both go Chicken Pad Thai. It was ok. The portion was a little on the smaller side and it didn't have as much peanut flavor as I prefer. My friend had been there before and got the Duck dish and said it was amazing. The service was good and prompt. I would try Jasmine Rice again and try a different entree."], ["Elizabeth M.", "Ordered take out after hearing rave reviews from friends and on Yelp. Unfortunately we did not have the same experience - we received the wrong food, portions were tiny, overpriced for the quality and amount received. Will not be returning since there are many other great places in the city for Thai food."], ["Roopa S.", "My new favorite BYO spot in Philadelphia!I feel like this is a gem that not that many people know about. I'm personally a huge fan of Thai food, and really wanted to find a good BYO spot to satisfy my cravings. Was so happy to find Jasmine Rice! It's a super small space-- probably the best for parties of 4-6 and nothing bigger. The food is quite tasty-- tried the green curry, pad kee mao, pad thai, basil tofu, green tea mochi dessert, and fried banana + ice cream dessert. I actually loved every single dish-- (would probably not recommend getting dessert just because it's nothing TOO special, but still a great way to finish a tasty meal). Ended up staying in the restaurant for around 4 hours-- felt no pressure to leave by the servers. This place will 100% be top-of-mind for me when planning my next BYOs. I feel like not that many students know about it, but it definitely should be more popular!"], ["Kay T.", "The food was very good. The reason for the three stars is the noise level. I was with three other people in a corner table and we had to shout to hear each other. If the restaurant could work on the noise level, it would absolutely get more stars. The pad see ew got great reviews from the person who ordered it. I got The King and I (veg/chicken/shrimp stir fry) and it was excellent. Nice heat and curry flavor. The pad thai was a bit sweet I thought, but the person who ordered it really liked it.Portion sizes are not enormous. We had some leftovers but also didn't come in starving.Good service, very attentive. The noise level was the only negative."], ["Andrew B.", "A pretty small place right around the corner of 16th and spruce. It's a good place to get Thai take out. I forget what I got exactly, but it was damn good. 14 bucks was worth the meal and a half that I received. Very satisfied. The owner/manager was very nice too."]], "Thai Singha House": [["Robert B.", "Very happy after our meal.Our spring roll appetizers were served quickly and eaten just as quickly--crisp, tasty, with a delicious dipping sauce.I had my usual green curry--excellent rendition, spicy and fragrant. My spouse experimented with ginger chicken (and asked for a light hand with the salt). All conversation stopped as she devoured all but one little piece given to me (a little reluctantly). Usually, I get about a third of any entree. We were almost alone in the cozy restaurant & hope more folks will try it. Certainly we'll return and enjoy the food and friendly service."], ["Jemi J.", "Dependable local thai. Wow. Words I thought I would never say in my time here in University City.I LOVEEE their drunken noodles. Can be a bit oily, especially when you order take out. But not too spicy, just perfect. Their spring rolls with the sauce are delish. I especially love how they were a part of University City dining days, so I was able to try things off their menu I never would have originally thought of, like their fried ice-cream ( not too bad), and a drink I can't seem to remember. It's a tight squeeze inside the restaurant though, so if you really want to eat here, probably get a reservation."], ["Roopa S.", "This place is 10x better than Pattaya. So glad it's here and super convenient for when I'm craving greasy and delicious thai food! I've tried a couple of the noodle dishes here, all of which have been fantastic. Service is great as well. Prices are very typical prices that you would find at a thai restaurant-- not too expensive and not too cheap either. Place is kind of small so not super ideal for very large groups, but it's a BYO and so definitely make use of that!Overall, great thai place near campus. Do yourself a favor and come here instead of Pattaya."], ["Phyllis P.", "Had a combo at 10-ish bucks: a soup, an appetizer and an entree. Very reasonable price and good service. Clean and warm place."], ["Jeff H.", "Thai Singha House has moved down the street in University City without missing a beat.  The food is as good as always.  What a great meal I just had here.  The starter of steamed edamame dumplings were perfectly prepared.  The main course of green curry in coconut milk with green beans and bell peppers was a totally tasty concoction.  And then for desert, the fried banana with a a condensed milk dip was a sweet ending to an excellent meal.  The service was top-notch - even though the restaurant was completely filled.  Thai Singha House is in the upper echelon of Thai restaurants in Philadelphia!"], ["Christine V.", "My sister and I came here to try out the food on a late weekday evening, thirty minutes before closing. The place is very well-kept and clean, which is always a good sign. Lovely ambiance!Their menu is extensive and serves up your typical Thai dishes. I wanted to try something I usually don't order so I ordered their seafood lemongrass noodle soup. I'm so glad I did because it was just delicious. The soup was great, and the lemongrass flavor was perfect and not overwhelming. It was slightly tangy and went really well with the seafood. Included in the noodle soup were shrimp, squid, fish balls, and fried wontons. Everything was very good, and I left impressed with the taste of their food and their quality. Great Thai place in UC!"], ["Elise M.", "Thai Singha is back! I've been a long time fan of Thai Singha, and was so sad when it closed about a year and a half ago. But now it is back, and I couldn't be more excited. It moved to a location just down the street from the original location. The decor and ambiance are brighter and livelier, the food is still delicious, and it is now BYO! I prefer Thai Singha over Pattaya, which is just down the street. At Thai Singha, the specials are better and the food has more flavor. I highly recommend having dinner at Thai Singha if you are looking for a casual, enjoyable dinner with yummy Thai food."], ["Jinsol L.", "I had heard wonderful reviews about the original Thai Singha before it closed, so I was pretty keen on checking it out when it opened. My first impression of the establishment was that it was super small, with only one or two waitresses who were doing everything - seating, taking orders, serving, etc. As such, service was definitely below par in the evening when it was pretty crowded. It took ages for anyone to seat us, replenish our waters, or even take our orders. When our orders finally arrived, I couldn't help but notice that the portions looked somewhat small compared to most Thai places I've been to, so don't expect to be super full/take any home from one serving.That being said, the ambiance is nice, clean, and cozy. The food was also deliciously flavorful! Definitely enjoyed each of the different dishes I've had including the standard pad thai, drunken noodles, green curry, penang curry, etc. Plus, when I had take-out from this place, it arrived much earlier than the prediction on Grubhub, so that was excellent.I was really wavering between 3 and 4 stars, but I'll favor the good food over the small(ish) portions/sub-par service. And okay, it is nice to have more than one option for Thai food in University City!"], ["Victoria L.", "I really hate giving places 2 stars, but my experience here could have definitely been better. My sister and I came here for the lunch special. Oh boy did we feel completely ripped off! FOOD:We began our course with the coconut soup and wonton soup. Both were very bland and extremely watery. For the coconut soup, it almost tasted as if we were drinking coconut flavored water with chewy chunks of chicken. For appetizers, we had the dumplings and friend wontons. Two minuscule, quarter-sized dumplings came out on a plate that looked too big for it. It was so sad! The fried wontons made up for the dumplings, but only JUST a little. Our main entrees were the shrimp pad thai and the chicken red curry. The pad thai was a nice surprise and it was pretty good! The red curry was okay. I've also ordered vegetable pad thai take-out from here. Excited for my pad thai, I was thinking it would taste as good as it would the last time I was there. BUT the pad thai was COMPLETELY pink. It was almost a salmon pink and extremely flavorless with too little ingredients.SERVICE/AMBIENCE: The service was attentive and friendly. Our waitress was sweet and nice! The inside is very nicely decorated and has a very casual atmosphere. It's also a BYOB, so that's a plus! Maybe if the food improves I'll venture here again to give it a third chance!"], ["Lawrence L.", "Figures that for under $11, I'll do the dinner special. The 3 piece fried tofu was a littl disappointing, sauce was okay, the soup was average (little on the salty side) & lastly, the shrimp pad thai, now having eaten at plenty of thai joints, the pad thai is either ketsupy (tomatoey) or just right. It was the former; not too bad, won't really come back for their pad thai anytime soon. Either case, what do you expect for $11 then again, had I ordered the pad thai as a normal entre, will have been disappointed. Just a solid 3 star"], ["Rachel H.", "Never been to their restaurant, but ordered delivery for the first time. GrubHub had a server error, so I called in our order. Making the order over the phone was easy and I was thankful they delivered to us when some others feel we're too far out. Despite being near 52nd and Baltimore, food came in 35 minutes. The Pad Kee Mao Gai - Drunken Noodles with chicken - was solid and the medium- spicy that I requested was right on target. My partner's Pad Thai Tofu was so-so, she knew it wasn't going to be above average when she saw it had a bit of a pink-tint to its sauce. The Tom Ka Gai - Chicken Coconut Soup - was perfect - better than Circles! Ordered a quart and am so pleased. For us, this is better than sitting down at Vientene or ordering from Lemongrass Thai. Solid option."], ["Steph V.", "My sister and I came here for dinner late one night. It's in a building where you walk up a small set of stairs, and the lobby is shared with another restaurant. It's not confusing though, don't worry. It's very clean, has great service, and is not loud!I ordered the pad see ew, and I really enjoyed it. What a good amount of food, and I didn't finish, so it was enough to bring home to make another meal! My sister ordered the lemongrass noodle soup. She really enjoyed it. I tried a little bit of it, and I really liked the lemongrass taste that complemented the seafood in the soup. I would say it was a little bit on the sweet side, so maybe ask for it a little spicier, but other than that, I really enjoyed this place."], ["Grace L.", "I may have to adjust my rating for Pattaya after coming here...I really missed this place after it went away from campus 2 years ago, and was excited when I passed by on a route I take frequently everyday--so it's a very convenient location for me! My boyfriend and I walked in here on a snowy night, at around 9:30 PM; relatively empty since it just opened, but we didn't mind at all. We were seated prompted, attended to quickly, and our food came out in record time. I got drunken noodles with tofu like I usually do at Thai restaurants, and it was the best drunken noodles I've had so far! The tofu was perfectly crisp, and the noodles were not too greasy. My boyfriend ordered chicken pad thai, which I also preferred over that of Pattaya; not too greasy, ample amount of meat, generous heaping of peanuts. I'm definitely a fan and would come back for a nice dinner or BYO!"], ["Sneha K.", "I was very excited to hear that Thai Singha is back in business! The Chicken Drunken Noodles here were a staple of my diet and I was so excited to have them back in my life. The restaurant has moved to a smaller location but its food is delicious as ever and it is now a BYOB. I came here for dinner a few days ago and was pleasantly surprised by the dinner special menu they offered ($10.95 for a soup, appetizer and entree). While Thai Singha's food isn't the best thai food I've eaten (I prefer Vientiane or Bangkok Thai 9), I think it is one of the best around University City. I am also a little disappointed that it now imposes a delivery fee on Grubhub when Pattaya right next door doesn't."], ["Kimberly Y.", "Apparently no one knows about Thai Singha's return, as it seems to be quite empty these days. They have relocated down the street to 39th and Chestnut in a corner of a building complex. Even from the outside, you can tell the interior is super clean and well lit, unlike Pattaya's more dimly lit vibe with ethnic music. The service was not the most attentive or well-staffed, which makes sense given the few people inside. My server was slightly impolite, but in reality probably just new and awkward.I had the chicken pad see ew, which was tasty and large enough to take some leftovers back home. Although some of the more exotic dishes like lamb and duck had scarily high prices, I was glad to find the other dishes were reasonably priced and competitive with Pattaya. I will definitely be back, especially since it's even closer to campus now!"], ["Jessica S.", "This is such an excellent Thai takeout addition to the city. Really, my new favorite, and as close to 5 stars as any Philadelphia Thai takeout has gotten for me, tbh.Tonight was now my second takeout experience, and second time happy. My first go around, I got a wrong item in my order which was quickly taken care of with a no questions, no stress refund for that item. No wrong items tonight, thankfully. Everyone loves a good pad Thai and a good Thai curry. These two items were verified by my recent orders. Vegetable pad Thai was an absolutely huge portion. It had a ton of veggies, but a good balance between noodles, sauce and veggies. So often, the rice noodles are over cooked, or there's way too much or way too little sauce, or the veggie:noodle ratio is wayyyyy off. These are all rookie mistakes for pretty much the most iconic Thai dish (in America, anyway) that you can get. No sir, none of that here.Tonight, I ordered Salmon Thai Curry-perfect spiciness level with a nice thin sauce to soak up that rice. I was honestly shocked that the salmon was not even the least bit overcooked. SHOCKED. I ordered it just assuming that it would be standard overcooked salmon, that's how much I wanted salmon curry. My only complaint would be to add more veggies to the salmon dish-it was pretty much just a (good sized) salmon filet with 3-4 red pepper matchsticks and a few basil leaves. A surprising appetizer that I ordered were the scallion cakes. Holy oh my goodness, these are damn good! NOT what I was expecting. A large amount of cooked chives wrapped in a soft, fried dough, with a ridiculously good sweet soy garlic dipping sauce. Get these!I will order from here again. In fact, they will remain my go to Thai takeout spot. Please Thai Singha House, don't let me down!"], ["Arthur C.", "Be forewarned, Thai Singha has returned, and it's a BYO! Having witnessed the state of on-campus BYO options dwindle, the return of this place was a welcome sight. With a new and even more convenient location, Thai Singha has started the conversation as to which is the top Thai restaurant around.The menu is none too different from that of Pattaya, with the conventional pad thai, pad see ew, drunken noodle, etc. There are also additional vegetarian options for those of that diet. In general, the portions are just right and the ingredients and flavors are done right. I can't say that the dishes are much different from Pattaya or better, perhaps because I haven't been to Pattaya since Thai Singha reopened. However, Thai Singha is on the fast track to becoming the BYO of choice for Penn students, so be prepared for some big and loud groups to be coming through on weekends. If you're looking for a quieter and more intimate meal, stick to Pattaya."], ["Cat N.", "I've been looking for the perfect Thai delivery place and have ordered from quite a few recently, and FINALLY think I may have found my go-to!  Delivery by GrubHub was fast, prices were decent, and the food was really, really good. We tried: Chive Dumpings. Maybe a little heavy on the \"dumpling\" part, but tasty and not too greasy. Dipping sauce was good (and not too garlicky). Vegetarian Pad Thai (no mushrooms). They actually listened to our request for no mushrooms! Pad Thai was tasty and plentiful, and had really good texture (crushed peanuts). A total win. Seafood Lemongrass Noodle Soup.  It surprised me to pull out a container of broth and a separate contained with seafood, noodles, and wontons - but it was a really nice touch!  Wontons didn't get mushy.  And everything was cooked perfectly.  The broth was HEAVENLY, spicy and flavorful. Looking forward to leftovers tomorrow. All in all, a total win! The menu is extensive, we'll be trying the currys, the drunken noodles and the papaya salad in the near future, plus more of the appetizers. Really 4.5 stars - half off for NOT honoring our \"save the environment, we don't need silverware\" request. And maybe ONE more dumpling would have been nice (we got 3)."], ["Victoria C.", "I came on Monday at 6:30PM with two friends just in time to order from their 'early bird' menu that ends at 6:30. The special consists of a soup, appetizer and an entreé for only 10.95, which is definitely a steal! I had the wonton shrimp soup, which came with lots of cilantro, green onion, a large shrimp and two wontons. The soup was a nice small starter, and was followed by two chicken satay skewers topped with a thick peanut sauce. I actually really enjoyed the picked veggies underneath, which were crunchy and tart. My two friends both ordered the fried tofu, which came with three small tofu triangles and was served with a plum dipping sauce.For the entreé, I ordered the chicken red curry, which came with white rice and some boiled, seasoned cabbage/carrots. The curry was flavorful and quite spicy, and there were basil leaves, bamboo shoots, and slices of chicken breast thrown in. It was a hearty combination with the rice, but in retrospect, the portions were kind of small. I'd go to Pattaya if you're hungry and Thai Singha if you're looking for a 'nicer' location with better food presentation."], ["Tiffany X.", "I was delighted to discover that Thai Singha has returned to near Penn's campus after closing last year. The new location offers a great value lunch and dinner special that students here take full advantage of. For $12, you can have a filling three course meal: a soup, appetizer, and entree. I ordered the chicken wonton soup with shrimp, the chicken satay with salad, and the shrimp pad thai, which I couldn't even finish and had to get takeout. The service was quick and the waiters are friendly. The place is also BYOB so on weekend nights, expect busier wait times and rowdy college students here, having a good time!"]], "Thai Singha House To Go": [["Hue T.", "I ate here only once but the foods are very reasonably priced and the quality is fine. The staff is friendly too. Definitely will order again."], ["Anne K.", "Best Thai food in Philly - cheap, fast, and they deliver!We had the vegetable spring rolls, chicken pad thai, drunken noodles with shrimp, pineapple fried rice with chicken, and red curry with chicken.I love the spicy, tangy plum sauce that they serve with the spring rolls - it's my favorite condiment of all time. The red curry, pad thai and drunken noodles were perfect - highly recommended. I would suggest the shrimp over the chicken though for many of their noodle dishes - their chicken can be a little dry. The pineapple fried rice was delicious as well, but it probably won't be a mainstay on my usual order.We ordered all that for two people and we will probably have leftovers for the next two days. They're really generous with the size of their portions!"], ["Steven M.", "Another lunch staple for anyone that works in Center a city. This tiny kitchen makes wholesome and inexpensive noodles. I recommend the drunken noodles (veggie w. crispy tofu) over the pad thai, but it's all good."], ["Shane L.", "Can't go wrong with this hole in the wall lunch spot.  Basic thai options for a quick and cheap lunch in the city."], ["Kelsey S.", "I was so excited to try this place because it's done the street from my new apartment. I got take out one night and it was awful. I ordered pad thai with chicken. It was very bland and didn't taste like much. It was also a little burnt on some noodles. Judging by other reviews, maybe it is just the pad thai that is bad. I didn't have to wait long for my order to be ready, and the people working were very friendly. However, I do not think I will be back."], ["Yiwen S.", "cheap, fast, and delicious!my go-to is always extra spicy chicken drunken noodle when i'm craving thai. and this place has the best drunken noodle i've ever tried in philly.it's not the best EVER, but when they say spicy, it is ACTUALLY spicy (godsend). and it's flavorful but not overly salty like many thai places. i don't find myself having to guzzle gallons of water afterwards.$7.50 for lunch, $11 for dinner. obviously, lunch is the better deal. but good portion sizes, so $11 is a justifiable price to pay.  4 stars for the drunken noodle! i've never actually tried anything else here.."], ["Jennifer A.", "This place is a hidden gem in the Rittenhouse area!! I happened to walk by when I was trying to find mutters museum and also when I was starving. I cant handle spicy food, and I was afraid the curry might be too spicy so I asked for a sample to make sure I can handle the spiciness. I tried the red curry and I was blown away! I had the chicken red curry rice and the whole time, I kept saying Wow! The owners are very friendly. I wish I could eat this everyday but sadly I'm from out of state :[I went back again before I left Philly to get a $6 lunch box. Bamboo soooo goooood!!!!!!"], ["Kristen M.", "I ordered Chicken Pad Thai and my dining partner ordered the Shrimp Pad Thai for takeout on a Friday night. The portions were large, enough for two meals each. Not sure how it compares to other Thai in Philly, because I have only dabbled in that cuisine, but it satisfied my craving."], ["Thuy H.", "For all the amazing reviews, I thought this place would have been amazing, but it isn't. The owners/workers are extremely nice, but the food is just bleh! I had the red curry with chicken. Normally, red curry has a little kick to it, but this one had none. Also, it lacked so much flavor. All that was in this dish was tons of bamboo (which I do love), chicken, and some measly pieces of red pepper. Where's the rest of the veggies?? Maybe they didn't want to add the veggies in it bc it might overcook it bc it is just sitting in a warmer (the curry was premade), but there's no excuse for the lack of flavor in a dish that should be a staple of thai.My friend ordered the pad see ewe and it was just ok (I had some of it). It was a little too sweet for my taste and they also seemed like they burnt it (maybe the eggs). Some bites had some major char taste to it which was totally unappetizing. I don't think I will be back at all. I rather just walk a few more blocks and order thai elsewhere. Totally dissappointed! If it wasn't for how nice they are there, they would only receive 1 star."], ["Sam W.", "I LOVE the drunken noodles. Spicy, flavorful, delicious.If only this place was open on the weekends..."], ["Karen F.", "Yes, it's cheap (especially if you get the $6 steam table - and especially if you show up at 11:30 or so when everything is fresh), but it's not that great somehow.I ordered the Coconut Soiup (with Tofu instead of Chicken or Shrimp) and today is was bland.  One-note coconut milk.So disappointing.I also got Pad-See-Yew (wide noodles with chinese brocolli and dark soy with scrembled egg and tofu (I got soft tofu instead of a meat or fried tofu.)  Good but also bland.Next time I will come on a Friday - the only day they serve Masaman Curry - and stick to the $6 steam table.  The $10 I blew on a (huge) lunch today wasn't worth it.  But at least I won't need to cook dinner."], ["Sam H.", "The best place to describe this place is with a story.Suppose you have a good friend whose family is from Thai Land. One day, s/he says to you \"hey, my grandmother is visiting from Thai Land, you want to come over for lunch?\" Its like eating your friend's grandmother's food. Made with love and tasty and fresh. Its no frills and just good. Oh, cash only."], ["Lisa X.", "I was surprisingly disappointed by their pad thai. It was greasy and did not have a ton of flavor. I say surprising because I always used to go to the thai singha house in university city before it closed and loved their pad thai. Whatever the reason, this was the first time I ever threw out a whole bowl of pad thai because I didn't want to eat it. If I am going to consume that many calories it better be delicious!"], ["Mary C.", "The coconut soup is disgusting. Way too salty. Try Circles' coconut soup if you're looking for the best in Philly."], ["Rich B.", "Great Thai food at an affordable price. At lunch $6 gets you a choice of two entrees(from the steam table) served over steamed or fried rice, or pad thai. Basil chicken, tofu w/ veg, red curry chicken are my favorites.Food is always fresh, excellent flavors and nice heat level. Service is fast and the woman and man who run this place are friendly and accommodating. Don't plan on eating in; as there are only 4 stools in this already cramped space."], ["Emmaleigh A.", "Great for a quick, cheap lunch! I got the $6 special from the steam table: white rice, cashew chicken (I think?) and red curry chicken. It was delicious and just a little spicy. I chose white rice instead of the pad thai because of the Yelp reviews, but I might need to try it for myself next time. For $6 you can't beat it!"], ["Shannon C.", "My favorite lunch, hands down. Can't beat the $6 steam table lunch special! The employees are really nice and smiley. The food is delicious. I love the pad thai and red curry. Also. the basil chicken is great. The coconut soup was pretty tasty but maybe had a little too much lemongrass flavor for me. The drunken noodles are to die for. This is definitely worth a try!"], ["Jessica S.", "One glorious weekday afternoon that I had off I decided to check this place out, as I am a Thai food enthusiast and I've heard about this place delivering on quality, cheap, good eats. A short walk from my house, I found this teenie tiny little Thai \"hut\" with friendly people behind the counter and the scents of some delicious Thai food filling the room. How have I not been here before?I opted for an item that wasn't on the $6 lunch special list, but I only paid $7.50 for it, so I wasn't feeling particularly bad about the extra $1.50. Especially after I received my meal and it was a HUGE steaming hot portion of noodles, veggies, and chicken. I got the Pad Sui Ew, one of my Thai go-tos, it was perfectly prepared. I also have an entire second meal in the fridge for lunch today.This seems to be the perfect lunch spot. There are like 3 stools in the window, but this is really a true carry out place (hence the \"to-go\" in the restaurant name). If you go just past peak lunch hours you will not wait at all, I walked in without any line at all. Plus I called ahead. Total win.I will very very much be looking forward to going back and trying the soups, the currys, and the other noodle dishes."], ["Vichet O.", "Fast, cheap, and good. A solid choice for when you need a Thai fix, but don't want to leave your house because there are hooligans roaming the streets who will undoubtedly mock you for your poor choice of pantaloons, musical taste, and what have you.Of course, TSHTG is not quite on the level of a sit down Thai place. But, you can't really blame them for this. I mean, come on - they have like, 5 minutes to cook your order before you get angry that it's not ready, because it's a take out place and that stuff should get done top speed!Again, totally worth it. Don't come for the atmosphere. Don't come for haute cuisine. Come here for cost-conscious, fast service, and tasty street-style Thai.On another note, I wish they were open late night, though. That would make this place a solid 4 for me. Then again, I wouldn't want these nice folks to have to deal with the Saturday late-night crowd in Rittenhouse aka douchers like me.Stay cool, Thai Singha House to Go."], ["Natalie W.", "It was lashing down with rain the day I ran in here to pick up some lunch and I was pretty flustered, which I hope explains why I tried to close my umbrella by pushing the handle against my chin. It promptly ricocheted open and bust open my lip which started bleeding profusely.Despite the health hazard I was posing, the lady at the counter was incredibly sweet and proffered large amounts of ice and tissues as I tried to make my order while trying to stop the bleeding, checking I still had all my teeth, and almost fainting from the shock.That alone would have made me give them four stars but I also thought the drunken noodles were delicious with a great level of spice (sure my judgment wasn't impaired by blood loss!) and I couldn't believe the generous and tasty portion we got for the $6 lunch special. That actually ended up sitting in the fridge overnight because it didn't get eaten but definitely did not make anyone sick even at that point! Love this place - food to cost ratio is awesome and they were just so nice to me!"], ["Luke M.", "Good pad thai. Not much else to say here, really."], ["Prasath S.", "Picked up quick lunch here the other day and I was very impressed. I went with the Steam Table Option which gives you either White Rice, Pad Thai or Fried Rice as the base starch and then you get to pick 2 entrees. I got the Chicken Red Curry and this other dry Fish dish. So delicious and perfect Lunch size at a price you can't beat 6 bucks !!! The lady was so friendly too. Great Spot.  I wasn't too impressed by the Pad Thai (A Little too sweet for my taste, but the dishes were amazing)I will be back !!!"], ["Anita S.", "The food itself gets 3 stars, but the $6 steam table is such a good value that I am giving this place 4 stars. The owners are very friendly and gave me lots of chicken and basil with my helping of the red curry, which didn't blow me away but was solidly executed. The shrimp with bamboo shoots was light on the shrimp but heavy on the spice. The Thai fried rice is again nothing that'll knock your socks off, but done well. The serving size is pretty generous, so for me, it's two meals in one, quite a bargain."], ["Ashley S.", "Got some takeout here the other day for my boyfriend and his family. My boyfriend and I split the shrimp pad thai, which was plenty of food for both of us, and we got the garlic with veggies and tofu for his dad and chicken pad thai for his mom. Everyone was happy with their meals, and the portions were pretty large for only $10. When we picked up our dinner, the staff (possibly the owners?) were very friendly. They told me about their lunch specials and wanted me to come back if I liked the food. I did like it, so I'll definitely be back :)"], ["Liza K.", "I went with coworkers for a quick and cheap lunch.  Can't beat $6 for their lunch special.  Loved the pad thai, curry and chicken I got.  The food was flavorful and the noodles were just right.  Quick and friendly service!  I recommend it if you're craving Thai food but you're on a budget."], ["Justin S.", "Really good Thai food at an unbeatable price. The lunch special is two entree dishes with rice for 6 bucks. All takeout, only a window counter."], ["Lap N.", "Ordered the Chicken Drunken Noodles and Shrimp Pad Thai for pickup.We ordered it and within five minutes it was ready for pickup.The drunken noodles were hot (spicy).The shrimp pad thai was sweet, sour and zesty.I enjoyed both plates. Great place, fast service."], ["Eric M.", "Wow! The reviews for this place are pretty great so my expectation were high and I have to say,  BULLSEYE!!! The two ladies working there were super sweet. it looked like they were closing up, I got there at 2:45, but they were happy to take care of me. I went for the steam table, again it was the end of the day so it was looking a little tired but with all the raves and at only $6 I had to go for it, and it was GOOD! Chicken curry over rice, pretty standard but tasty and the lemon grass soup with chicken. Full disclosure, I am a soup whore, and this soup is now in my little black book. Yum, yum,yum and they didn't skimp on the chicken. For $2.50 ya can't beat it.Finding a great little hole-in-the-wall joint like this makes my week. Go!"], ["Jasmine H.", "You can't go wrong with this place. It's delicious. I love how the people that work here are always so sweet and nice. I keep the pad thai, drunken noodles, and pad see un on a regular rotation when I come here. Of course better seating would be nice but hey its got a certain charm the way it is."], ["Larry N.", "The service fast, and the food looked pleasant. However, the woman tried to give me food that's been sitting out, and I asked for them to make it fresh- which they did without hesitation. I'm giving this 2 stars because the food is nothing special and you can get a way better meal, for what you pay, at any of the other near by Thai restaurants."], ["Meg S.", "I am so sad I just found about this place as I was graduating. For $7.50 (including tip), I had the most delicious bowl of drunken noodles I've had in my life. Spicy but not enough to overpower it. I was impressed by how quick the service was-within a few minutes, about 5 of us had ordered and received our food."], ["Sarah F.", "Wow, wow, wow! I feel so lucky that this is right around the corner from my house.I stopped in to this small kitchen last night around 9pm and ordered a monster load of Thai food for my friends and I after City Sips. Needless to say, we were starving and needed some serious chow down time. The service was friendly and super fast! The quality amazing and the price so cheap. How is this place real life?Favorites:Crab Dumplings for daysDrunken Noodles w/ ShrimpPineapple fried rice w/ ChickenCrispy Duck Curry: but really any of the curry the sauce is so, so good.Happy eatings! I will be back again and again and again!"], ["Eva U.", "Absolutely the best Thai noodles in Philly, and for a great price. The owners are very nice, service is speedy (I've never waited more than 5-10 minutes, even during lunch hour -- much faster than most Chinese places), and as a bonus, they have a really fun selection of Thai beverages.While there is a counter to dine-in if you're in a hurry, this is, as the name suggests, a location to order your food to go. The counter faces the street, and is great for people watching."], ["Monica L.", "PROS: cheap lunch, generous portions, tastyCONS: greasy, no space to dine-in, limited menuWith a $6 lunch special (tax included), you can't really complain. For lunch, you choose from a selection of pre-cooked dishes that a nice lady promptly scoops for you, cafeteria-style. Dinner prices are higher, but portions are not necessarily much larger so you get less for your moolah."], ["N E.", "This is where I feel in love with drunken noodles. When we first discovered this little jewel we kept going everyday, we surely thought their was addictive drug in the noodles because we couldn't stop eating them even though all were feeling sickening full. Finally got it together and started to order the drunken noodles with something less filling and sharing them. Love, love, love the drunken noodles!!!!!The only thing they could do better is settle down on a schedule that doesn't change. Such a drag to decide to get take out, Saturday and then find out they're not open on Saturday"], ["Meeta A.", "I was on my way home from work and needed to pick up takeout so I searched Yelp for \"takeout\" in the area and this was one of the results!  I had never been here before but figured I should give it a try.  I'm so glad I did. I ordered the fried tofu appetizer, the drunken noodles with chicken, wondered what curry to get and settled on the red curry with duck.  Everything was ready very fast.  My only hesitation from having read the reviews was that people mentioned a lot of things are pre-made, but they were definitely cooking things up then and there, and cooked the duck at that time.  They even thought to package the duck separately from the red curry so that the skin would stay crispy and the whole thing wouldn't get soggy.  The woman behind the counter was really friendly and chatted with me, as well as with regulars who were coming in to pick up orders they had phoned in.  The red curry was a bit on the bland/sweet side for me (but with lovely coconut milk flavor), but the duck was great.  The drunken noodles were very tasty -- nice and spicy -- and had a good texture.  I would definitely order from here again!"], ["Doyle J.", "Really tasty spicy Thai. You can eat in at a little counter facing the window but it isn't too comfortable. I had the Mango Chicken and Shrimp for $10. The bottle of water at $3 was the worst value in the place. I'll be back!"], ["Nicole M.", "Only Delivers after 4pm, Only Takes Visa and Amex, Only Open weekdays, Onlyhas bottled coke products and cans of juice/tea from \"foco\" which seems to be a pretty big importer.All that being said, In the 2 years I've worked in the area, and a few years prior when I was taking summer art workshops, hands-down favorite lunch source.I usually order by phone and orders are ready for pickup within 5-10minutes, depending on whether you order from their $6.95 lunch options or the rest of the menu. The difference - popular items like the Pad Thai and Curry are kept in heated trays and other stuff is whipped up when ordered. Everything is still super fresh, regardless.My favorites are Drunken Noodles and Lad Na, both regular lunch options. Lad Na must be the Thai equivalent of Campbell chicken and stars, because it really hits the spot on cold or rainy days when you just want to curl up but can't cause it's 1:30 in the afternoon and you're at work. both dishes feature Chow Fun - wide, sticky rice noodles that don't keep well as leftovers.The topper - service is always top-notch. the older woman who seems to be in charge is patient and attentive and seems to run a tight ship. Today when I couldn't pick up my order for 30min because I had an unexpected rush at work, they put it in a spare heating tray and kept it warm until I got there.This place has my eternal love and fealty"], ["Ambi C.", "Terrible, terrible, terrible. How could you not make any dish with steamed tofu! Surprised this place as four star reviews; Philly residents clearly do not know their Thai food."], ["Juliana K.", "Great place to go for fast take out. A lot of the entrees are pre-made so they just scoop it up. Pad thai is so-so. Same goes for the red curry. Cheap prices. This is a cheap and fast meal."]], "AmeriThai": [], "Xiandu Thai": [["Su H.", "Opening up a restuarant in center city is a huge risk.  So when I saw that a new restuarant took a shot at this location, I decided to give it a shot.  Boy am I glad I tried.  Restuarant has a modern decor, and rather quiet ambiance.  The walls don't have any art on it yet so when you walk in, it still looks a little barren.   (I did later find out they are waiting for the art to come in)Food here is absolutely amazing.  I tried the seafood dynamite.  The scallops were juicy and flavorful and monk fish crispy yet moist.  The sauce was that topped it was added the perfect about the of sweetness to the dish and  really brought the textures of the seafood to life.  This dish was absolutely amazing.  It was something I can definately see Budakan charging a upward of 30 dollars for.  It takes guts to open up in center city, but I really think they've got what it takes and hope that they do well.**also someone else also mentioned.  skip the spring rolls.  I do agree.  They were all that spectacular."], ["Shifa A.", "Stumbled upon this place on a summer evening, was arguing with a friend about deciding a place to eat, we jointly decided to try Xiandu out and we were not disappointed ! Loved the food, the waiter was excellent and bought us some hot peppers which gave the food an extra zing! Soup was well balanced and tasteful. Much better food than Spice 28 on 13th and chestnut! Will definitely go back there!"], ["Lilli M.", "Center city has a relative scarcity of Thai restaurants unless you're able to trek out towards 20/Chestnut-ish, so I was quite excited when Xiandu opened smack in the middle of Center City.This place smells new, like new wooden floors.  It has a very open ambiance and the tables are situated such that you're not elbow-to-elbow with the strangers at the next table.  I love the comfy white chairs here. Maybe because the restaurant is newly opened, I noticed that the walls were completely barren. Not sure if that was purposeful or not.I got a delicious chicken yellow curry and a Thai iced tea.  The curry comes in its own pot.  Usually, I find that curry at Thai restaurants is a somewhat small portion but I had leftovers this time.  All the wait staff were attentive.  One quickly noticed that I'd finished my rice before the curry -- good rice brings out the full flavor of delicious curry -- and swiftly refilled my rice.  The appetizers aren't the cheapest but I look forward to trying them sometime in the future.There's a 10% discount with a Jefferson ID, of which I was completely unaware until I'd left.  (The discount was printed on the take-out menus but not on the in-house menus)  Be sure to take advantage of that, given its prime location near Jefferson.  There also isn't a website yet, which I hope will be available soon."], ["Mayur C.", "Woah, what a hidden gem! I say hidden because even though it's right there between 11tth and 12th on Walnut, I have definitely never noticed this place. My bad...About 15-20 of us came here for a friend's surprise birthday dinner (Happy 23rd Josephine!) this past Saturday. Although I was the last one to arrive before the big surprise (#traindrama), I could see that the service was absolutely splendid from the beginning to the end. Since I came directly from the 'burbs, they were entirely okay with me leaving my bag with the hosts, as well as charging my phone towards the end.The waiter (didn't get his name) was so, so helpful and described all of the entrees in greater detail. He also gave good vegetarian recommendations (shout-out to my fellow herbivores), as well as informing us of what's popular at the restaurant. I ended up ordering the Panang curry with brown rice on a level 3 spice range, with 1 being the mildest and 5 being the spiciest. It was PERFECT. Everything, from the appearance to the spices, was just sublime. I was a bit upset that they took away my dish with a few bites left (I planned on finishing all of it!) when the cake came out. However, everything else was just so nice and I knew I was going to come back, so it didn't affect me toooo much. Since we had a large table, I wasn't sure what everyone else got, but it all looked pretty good. Can't wait to come back here on Friday for their lunch specials!A special mention has to go out to the manager/Xiandu queen Nancy. She has got to be one of the coolest, kindest managers I have ever interacted with! She kept the place open well past their closing time to make sure we were well accommodated and not rushed out. This is just one of the many examples of true customer service. So many places simply view their customers as business transactions, but you could tell that this place truly wanted their customers to have a legit dining experience. Nancy, you're getting an official invite to our next outing because you are a BAUSS.STOP EVERYTHING AND GO GET YOURSELF SOME XIANDU."], ["Aria S.", "Ok I'm pretty sure I blacked out for most of my dinner from how spicy the food was so maybe this review is just a blur... Anyways, it started with me requesting a 3/5 on the spice level for my dan dan noodles. I love spicy food and feel like I have a high tolerance. But ok, f that, not at Xiandu. Just a kind note for readers. The waiter kindly brought over some coconut milk that's used in the curries which I put on top of my noodles which alleviated the spice and actually added a nice flavor. I brought most of the noodles home which I added a zillion vegetables to to dilute the taste, and in retrospect (my stupidity for ordering the 3..YIKES), the food was really good, and same with the service. Every night they have a specialty cocktail for $5 which is really cool too, just make sure to ask! Prices for a Thai restaurant are slightly higher (like $13 entrees instead of the more like $10 I tend to see) but the ambiance here is definitely nice and so is the location."], ["Farha A.", "So. Good. Went here for lunch - it was $9 for Tom yum soup and an entree (I got the Pad Kee Mao) and it was out of this world. They brought out their homemade hot sauces (make sure to ask about these!) and the food was the best Thai I've had in a while! And for $9 + leftovers for later it's a steal."], ["Jessah A.", "Excellent food! Excellent service! Waitress is attentive, polite and informative. Over all experience was pretty excellent and the food was perfection!!!!!!!!!I ordered the Roti Canai for the appetizer and the Tom yum soup for the entree. It was one of the best Thai food I've had in a long time.Highly recommend!!! Will return back if ever in Philadelphia again!!Cheers!!!"], ["Michael N.", "I think Xiandu is my new favorite thai spot in Philly. We went with the yellow curry, the angry beef, and the chicken satay for an appetizer.  The yellow curry was certainly the highlight of the meal.  Price wise, with two drinks, the whole meal came out to about $65.    Aside from the food and the prices, the service was also great and it's easy access from Patco if you are coming over from New Jersey."], ["Carissa L.", "My roommate and I were craving Thai food but didn't want to leave the house, so we opted for delivery from Xiandu. I have tried several other Thai place in Philly and have left feeling minimally impressed... So Xiandu was a new choice for us - and it was delicious! Our food arrived within 30 minutes and was hot and steaming. I ordered the Thai Chili Mango and it was excellent - sweet, spicy and crispy. My roommate was similarly impressed with her Pad Kee Mao. The only reason this establishment is getting 4 stars for me is the drink - I ordered a non alcoholic three musketeers and found it rather watery. However the food was so good that I am looking forward to trying their beverages again in house! Definitely one of the best Thai places I have tried in the city so far, and comparably priced with other establishments."], ["Roma J.", "Last night I had Pad Thai w/o peanuts, Som Tum Papaya Salad w/o peanuts & a Thai Iced Tea delivered straight to my door. Totally satisfied!"], ["Nester P.", "Great thai food! We went as a group of four and ordered the calamari (eventually we got 2!), veggie and tofu green curry, chicken yellow curry and the chicken pad paradise. Everything was delicious, especially the pad paradise and the green curry. The server was really nice and polite, the food came flying out and even though we were there past the closing time, they did not rush us at all!Highly recommended if you are around the area!"], ["Sal D.", "Xiandu Thai... you're so good. First off service was fantastic, also they have recently received their liquor license and this place is looking to party with daily happy hour 5 to 7, speciality drinks are 8 to 10 bucks. Had a great appetizer, basically a flour tortilla with chicken curry $5 and for my entree of course I went with the Pad kee mao, steak medium cooked extra spicy... Of course it was not spicy enough so I was brought a side of some hell fire dry chili paste, which I have never seen the likes of... and fell in lust.  Will definitely be back for happy hour and the hot stuff."], ["Nicholas B.", "Excellent food and pretty authentic for fusion cuisine."], ["Meghan M.", "Meh. I ordered dinner from Xiandu while staying a few blocks away. I will say I am picky about Thai food and struggled with this rating...Food: 2 starsDelivery: 4 starsFood:I ordered Pad Kee Mao, spicy. It was okay...somewhat bland aside from the spice and very greasy. The portion was big. Delivery: Quick and easy. Ordered through Yelp and the food arrived to my hotel lobby quickly. I'm, honestly, really surprised that the rating is what it is but then again, maybe I just ordered wrong. Either way, not really interested in trying it again."], ["Rita D.", "Ate on a Sunday around 1 PM - no wait.They just started a Dim Sum menu for the weekends, so we tried the dumplings. They were very tasty and VERY reasonably priced.Thai Ginger & Pineapple with beef - very good and flavorful. Could have had a little more ginger though...Pad Kee Mao with Chicken - our favorite! My husband and I completely devoured this and wish we had more.Solid choice for Thai food if you're in the area."], ["Matt W.", "Excellent everything.  We were party of 6. We asked for help on choosing low carb, sugar free entrees. Brian the waiter was excellent.  Nothing bad to say.  Don't miss an opportunity to share a meal here."], ["Nam D.", "Surprisingly good thai food. I definitely recommend the thai curries and also the noodle soups. Also, recommend sexy fingers (I know it sounds weird) but they're delicious, it's really sexy shrimp (not fingers). They have good happy hour, even on he weekends."], ["Komal D.", "Philly has been in need of a good Thai place, and this is it. The service and food has always been on point. My favorite so far have been the panang curry with brown rice, drunken noodles and pad Thai. They have spice levels 1-5 I believe. The waiter explains the spice levels so you don't ruin your food by making it too hot. And then he even brought out extra chili sauce (super spicy) just incase. Good place over all, especially with the fantastic service staff they have."], ["Dana S.", "The three stars are for excellent food much needed in the area. Two stars less was because of service. Waiter was rude, inattentive, and rushing us. Maybe they need help with service. The food will bring me back and if that waiter is there, I will ask for takeout"], ["Nick T.", "Chicken with basil was very tasty, tom yung soup was a bit too salty. Service was good and prompt. We all ordered or food \"thai hot level 5\", even though we were cautioned of the spicy level none of us found the heat level all that high. It was spicy but nowhere near hot enough to warrant the warnings"]], "Sawatdee Thai Restaurant": [["Jordan P.", "(to the tune of \"Hotline Bling\" by Drake)You want some take-out? grab your cell phoneAt night when you're hungry at homeWant deliv'ry? get that cell phoneIf you're hungry, and you're all aloneAnd you know when you hear that ringIt can only mean one thing.When you hear that phone go ringIt can only mean one thing.If you tryna grab some thai food you...You probably also wanna BYO nowEverybody does, and don't be stressed outThey've got no cork fee, you will not be left out.If you tryna grab some thai food you....You probably wanna get yourself some spring rollsThese ones didn't really rock my world thoughStick to tom yum soup for an app, yo.You want some take-out? grab your cell phoneAt night when you're hungry at homeWant deliv'ry? get that cell phoneIf you're hungry, and you're all aloneAnd you know when you hear that ringIt can only mean one thing.When you hear that phone go ringIt can only mean one thing.SO, unlike Drake, they won't pick up their phone late night, if you need their love. Instead, they're open until 10pm. Jonesing for a little spice on a crisp fall night, we made our way over to the totally empty resto (7pm on a Tuesday, eventually 3 other parties showed up, but plenty of space). Saw a LOT of takeout or delivery orders being filled in that time. Spring rolls left something to be desired (just nothing to write home about, bland, needed a lotta sauce). However, the tom yum soup was delish and the Yum-Neua-Yang Salad was INCREDIBLE. Super flavorful meat, and the ground roasted rice was a fantastic textural addition. My dining date got the Pad-Khing-Gai with chicken, nice sized portion and really solid flavor. This spot makes a great quiet date spot for when you'd like to ball on a semi-budget and still get a zing of flavor. I'd request more spice next time, their standard is very mild."], ["Dave W.", "First time I've had Thai, so i didn't know what to expect.  My wife and I went on Saturday around 9:30.  There were still a good amount of people in there.  Sawatdee is small but very welcoming atmosphere.  We got a table immediately.  We brought a few six packs (we didn't quite finish them) and were given a big bucket of ice by our waiter.Service:  The service was decent  It's a small place, so they had one server.  He seemed very pre-occupied and busy, but he did have a few good recommendations and was generally attentive.  Food:  the food was great.  We started with the Ka Nom Jeeb (fried dumplings) which my wife loved, and Gung Sarong, which are delicious and hot shrimp in a pastry shell.  There's a big list of apps, salads, and soups to choose from.I got Khao Pad Poo for my entree, and it was the highlight of the meal for me.  I am 100% getting this again.  Their official menu description is \"Crabmeat fried rice with garlic, tomatoes, onions, scallions and eggs\", but that description doesn't quite capture how good this meal was.  First off, i was given a choice of how spicy i wanted it; i could choose from 1-3, 3 being the spiciest.  The waiter told me 2 is close to a \"srichacha\" spiced meal, so i went with it.  His assessment was spot on.  Not too spicy , but a good lil kick after each bite.   The crabmeat was excellent and every bite had a piece in it.   My wife got a salad; i forget which salad, but she was happy with it, although she loved my dish a lot more.We've lived in the area for 3 years but never visited Sawatdee, and i'm glad we did.  We will definitely be going back!"], ["Mike W.", "My fiance and I needed some dinner one night when we were leaving an appointment leading up to our wedding, so I thought of grabbing some Thai takeout on our walk home, since Sawatdee is right on our way. They had some items I was familiar with and some that I wasnt, so we ordered a mixture to cover all of our bases. I fell in love with Thai curry while in Bangkok a few years ago, so I had to order some green. We also ordered green papaya salad, Tom Yum soup and Khao Pad Ka Prao Gung, or Thai basil fried rice with pork, peppers, onions, scallions, and eggs with chili garlic sauce.  The food definitely needs a bit of improvement, well at least the take out side does. The flavors were good, but the flavor just isnt deep enough. There isnt enough seasoning and the dishes just arent spicy enough. I know they probably tone it down to make it more approacahable for the non-Thai customers, but thats the beauty of Thai food, the sweat on your upperlip, hot flash kind of heat. It doesnt burn deep, but it definietly leaves your mouth tingling and makes your body temperature rise a few degrees. It was a common theme through all the dishes. The flavor was good, but not enough seasoning or heat in the curry, papaya salad, or the Khao Pad Ka Paro Gung. The best executed of the dishes was the Tom Yum soup. The traditional sour and spicy flavors were there, again the heat was a little lacking, but it wasnt as missed in this soup. This was actually some of the better Thai food I have found in Philly so far. It still isnt up to snuff in my opinion in terms of where the flavors should be, but it was a pretty decent effort. Sometimes I wonder if it is because of the lack of Thai population in Philadelphia. I would order from there again, and I definitely want to check it out in person and see if it might be better when not ordering take out."], ["Sari A.", "On a very unseasonably cold night, we thought a nice spicy Thai food would keep us warm. Coming from a warm country I should have known better, eating spicy food help to keep us cool not warm.  Nevertheless the food was heavenly. Apparently common sense is not so common HahaThe waiter, Craig, greeted me with a warm smile and a friendly hello- Sawatdee, which is a polite hello in Thai! I was the last one to arrive and joined my party of 10. We placed our orders and it came out in a timely manner. Since I love to try coffee drinks, the Thai Iced Coffee caught my eye, so it was the first thing I ordered. Very refreshing coffee sweetened with condensed milk. Super dooper excellent! I ordered Satay-Gai, as a starter, a nicely grilled chicken, marinated in coconut curry alongside with a flavorful peanut dipping sauce and refreshing cucumber relish. I got the Massaman Curry with Chicken as a main course. It was absolutely delicious.The food at Sawatdee range from spicy to extreme spicy, I ordered mine to be made medium spiced and it was just right! Nice mixture of flavorful and colorful ingredients.  Sour tropical fruits , sweet pineapples, salty fish oil, sweet palm sugar, spicy Thai garlic cooked in coconut milk with a side of steamed jasmine rice. Very nice, warm and cozy dish.I had to leave some space for dessert. Poached Banana In Coconut Cream! Very simple and very interesting!  This Thai banana dessert is made with bananas which were poached and sweeten in palm sugar syrup and cooked in coconut cream. Naturally sweet and light.P.S: No check splitting and Max of 2 CC/table.Four Yelps!"], ["Liz P.", "DEEEELIISSH! Everything is amazing and the service is great. The restaurant is teeny tiny so it's a good idea to call ahead, especially on weekends. They only seat you if all of your group is there--but if it's not busy they have been flexible. (Tell your chronically late friends to hurry up.) And BYOB!"], ["Sal F.", "Joke.  Told me that if I didn't know the menu to call back.4 small hairs in my food, when I called to tell them they said they didn't need my business.Absolute joke."], ["Ashley T.", "Great service and good Thai iced tea.  For a thai place the prices here are reasonable!"], ["Luke D.", "I ordered Chicken Pad-Him-Ma-Paan takeout and requested spicy. It was OK, but didn't taste much better than a mall food court, which isn't saying much. Also, I like my Thai spicy, and despite the request, it really was about a 2/5 on the spice level scale. I live close enough so I'll try again and update the review, but for now this was below average Thai."], ["D D.", "Went to Sawatdee on a Saturday evening. The service was good, the food I had (sorry I don't remember the name), was made to perfection. So was my husband's and the appetizers.The atmosphere of the place is great, somewhat intimate. The service was excellent and the waiter very useful in helping us choose (unlike other pushy ones who want to make you get the most expensive item in the menu). His suggestions were great and to our taste.The prices of the food were very reasonable. Are there other Thai places who offer the same or better? Sure. Sawatdee can compete with other Thai places. Good service, good food, good atmosphere and a reasonably priced menu. It's a winner in my book."], ["Hagana K.", "Awesome thai basil fried rice.Awesome pad see ewAwful wings. Soggy and blah, avoid this one, stick to the Thai classics. Awesome server on the night of Feb. 25, 2015 - someone didn't show up so it was a one man show, and he killed it. Will definitely be back."], ["Aria S.", "Was supposed to get a drink with a friend but Cambridge across the street was excessively packed Friday evening. We both instantly smelled the thai spices outsite Sawa and decided to go in and split some goodies. I LOVE Thai food-probably my all time favorite cuisine. So naturally, I'm a little more picky because I've tried a lot of it. (Ugh, yes, Thailand is on my list of places to travel!)We only split a Panang curry and it was good! Personally, I wish it was a little more creamy (more coconut milk) not to reduce the spice level, but to just add some richness. It was a good portion to split since we got two rices. Service was great! We were seating immediately and given recommendations. Food came out at a decent speed (not too fast where it's weird or not too slow). I would visit again and sit outside with a bottle of wine!"], ["David J.", "The food is decent, however, the service leaves something to be desired. We've been here at least five times now and while the curries are flavorful and the portions are good, sometimes it can take a long time for the food to arrive.As I am writing this I've been waiting over 15 minutes for a mango sticky rice to go. The first three times I asked the server he barely even acknowledged my order. Only upon repeated questioning into the status of our sticky rice did he even make an effort to go back to the kitchen and place the order. Five minutes has now turned to 20 minutes. And still no sticky rice.  Over the last several months we've taken our Thai food needs down the street to a place called Jasmine rice where the food is excellent and the service impeccable."], ["Jamie D.", "I've dined in and had delivery and both were excellent experiences.My favorites are the the thai coconut soup, the chicken skewers, and the tofu pad thai.  Decent portions for the price and so fresh.  Grab this on a cold day and warm your insides, you won't be disappointed!"], ["A B.", "Definitely more authentic flavors I've had since arriving in Philly. Moderately priced, portions are generous and on a summer night, a very cool BYOB perch to people watch from."], ["Kelsey S.", "Update- I have received rude messages on yelp from 2 people who clearly work here and are trying to get me to change my review. I did not enjoy my experience here, both food and service were not good. I won't be changing my review and I will not be returning again."], ["Shannon R.", "We adore the Sum Tom (Thai papaya) salad here - If you've never tried this Thai staple, give it a try sometime! Perfect lime/salt/sweet combo. So refreshing on a hot summer night!Their Panang Curry is also really delicious! Thanks, guys!"], ["Sara P.", "What a lovely restaurant. We needed dinner for several people within a few minutes notice. I ran inside and asked for recommendations of meals that would accommodate interests of people I did not know well. The staff gave me great suggestions.  I needed some things that did not include meat or eggs and the staff customized some of the menu to give me great meals that were vegetarian and vegan.  We had a curry, pad thai, a vegetable/tofu saute and sticky rice with mango. for appetizers they customized the spring rolls for us!  The location is convenient for a lot of neighborhoods. They allow take-out. They have a lovely interior with outside seating as well.  Prices are in line with others and the menu is very good."], ["Dara M.", "I'm not sure whether I just ordered all the right things, or if this place is really so fantastic, but I had a great dinner here! It's small and noisy (that might have just been our table, though), cute, with cheery bright green walls. It's 4.5 stars, but I'm rounding up. Probably because of the green walls.Started with the Tao-hoo-taud, crispy fried tofu that was light and the perfect texture, served with a peanut sweet and sour sauce. Loved it. The Tom-kha was a bit different than I'm used to. The broth was perfectly white, with vegetables, coconut milk, lemongrass, galangal, kaffir lime leaves, and mushrooms. Not at all spicy, but really flavorful. Had the Pad-kee-mao-gai for my entree, and it was crazy delicious. Stir-fried flat noodle with veggies, bell peppers, thai basil, garlic, and chili. The sauce was ridiculously flavorful. I should've asked for it spicy, but didn't, so I added chili powder, and it was perfect. I think I could eat that once a week for a long time.For dessert, we had the Mango with Sticky Rice and the Thai Custard In Asian Pumpkin...apparently that's what they call kabocha squash. Whatever they want to call it, it was tasty and different and quite enjoyable."], ["Angela U.", "Went here last night and had an amazing dinner!! Food was soooo good, especially the fried squid and dumpling appetizers! Great location with outdoor seating, great service, great prices, plus it's a BYOB! What more could you want? Our server was the best - he was so friendly and funny (and looked just like Jordan Peele haha). I highly recommend this place and will surely be back!"], ["Matt E.", "My favorite Thai restaurant in Philly. My favorite dishes are the pad thai and the drunken noodle. The octopus appetizer is also very good. BYOB. You will not be disappointed coming here."], ["Bea F.", "Our go to place on a weeknight. Always good food and good service. I love spicy and they definitely make spicy."], ["Gautam T.", "This place is good but not great. Do you want a restaurant that will satisfy your hungry but not allow your taste buds the feeling of excuberance? then this is a perfectly fine restaurant. Don't get me wrong, the food was good but it lacked the certain panache is was hoping for. For example, the Red Curry; overwhelmed by just hot pepper and chili (I didn't order thai spicy if you were wondering), weak flavor of coconut the curry was a little watery. Now it certainly wasn't the worst, but not close to being the best either. Try the restaurant, you'll like it but you won't be blown away."], ["Danielle H.", "I have only had delivery from this restaurant, ordered through GrubHub. Both times, they have been great. The first time, we asked for a later delivery time so that it would arrive after we came back from a run. The second time, it only took 30 minutes to arrive! Wow!I basically followed another review on here with my order choices - the Tom-Kha and the Pad-Kee-Mao-Gai. The soup was amazing - very flavorful! The noodles were okay... I got \"spicy\" and they weren't, really. So, you know. I also had the Green Curry which is something that I always get at Thai places. I don't like Pad Thai, so Green Curry is my staple. Anyway, the Green Curry here is only decent. It doesn't have eggplant in it, and that seems like a huge oversight. The \"spicy\" level was good for me.The price is good for what you get...the rest is okay."], ["Karen B.", "Our favorite neighborhood restaurant in an area with tons of great food . Delicious and fresh Thai food. Late Night Noodles are yummy! BYOB and reasonable prices and good service !"], ["Natalee F.", "I am soooo boring when it comes to Thai restaurants - I always order pad Thai.  Every once in a while, I will attempt to take an excursion and order something else, but it always comes back to the standard pad Thai.  Also I think it's also a good way to measure a Thai restaurant.  This weekend was no different.    You can order it with different levels of spice, I went for #2 on a scale of 1-3.  It was pretty spicy!   It was mostly noodles, with not much else involved, unlike other pad Thais that I have had.  It was pretty tasty, along with the fried spring rolls I ordered as an appetizer.  The real star of the meal was dessert though - we shared some sort of sticky rice dish.  It was like a mixture of warm sweet custard on the top and cool sticky rice on the bottom.  I loved the mixture of temperatures and textures.Our waiter was super friendly and efficient and we didn't feel rushed at all, even though we were the last table there.  They easily accommodated our large group and the price was great!   Pro tips: It was pretty warm while we were there, so don't dress in a heavy sweater.  Also they don't split checks and take a maximum of 2 credit cards per table.  And of course, it's BYOB."], ["Sang D.", "You have to order right. The noodles with pork were bland and flavorless slop. Went back last night and i got red curry with beef, my girl had green curry with tofu and rice. It was delicious. Bamboo shoots, sweet red pepper, just the right spiciness, it was brilliant.  I would go 4 stars if i go again and have another good experience. Only other complaint was i am a pretty hungry guy so for $14-15 i would have liked a slightly bigger portion. For her, it was perfect. Guess im too cheap to pay for an appetizer. Oops. Dont forget the wine. Its BYO"], ["Lisa J.", "I love the food here. I have only ordered out, so I cannot speak to the service and atmosphere inside. If your into Thai or spicy food, you should definitely give it a try! I usually get one of the noodle dishes. Watch out because their medium spicy can be a bit on the spicier side. The options can get pricy with the protein not included in the prices but it's worth it, and the delivery is pretty quick."], ["Erica M.", "A friend had raved about Sawatdee so when we had a hankering for Thai on a rainy Friday night, we decided to give take-out a try. Thanks to a Yelp review, we thought to call and ask if they had any dumpling specials - oh em gee the Panang Curry dumplings were one of the best Thai food items I've ever eaten. Holy cow. We also had the Pad Thai with chicken and the Ba Mee Moo Dang (egg noodles with mustard greens). The Pad Thai was excellent as well, but we really didn't like the Ba Mee Moo Dang. Definitely a great Thai spot..and BYO, too, for those who want to dine-in!"], ["Alex J.", "Ordered from here for delivery. They forgot an item. Also, the por-piah-sod is made with raw spring roll wrappings, instead of the standard clear wrapping for summer rolls. Very unappetizing, would not order again."], ["Moira K.", "This isn't the greatest Thai food I've ever had, but it's very good.  Great soups, decent spring rolls, pretty good curry (though it's a little thing) with very plentiful meat (or tofu, or shrimp, if that's what you choose).  The service is polite, prompt, efficient, but friendly and welcoming.  It's a BYOB, but the prices are still MORE than reasonable.  Basically the same prices you'd pay for Thai even at a place with a liquor license.  Filling portions.  There's outdoor seating for good weather.  And the decor inside is great, a very fun, bright green with simple furniture.  A happy place.  And the location couldn't be more convenient!"], ["Sam A.", "Food was bland and completely uninspired. The real disappointment was the terrible customer service and rude wait staff. No wonder the place was crowded."], ["Michelle C.", "I returned to Sawatdee for dinner on Monday night. It was night two of my Thai cravings and I had to satisfy the beast. The hype of Sawatdee's opening has definitely waned and we were able to score a table with no problem. Service was notably better than my previous two experiences at lunch and dinner. Water glasses were kept filled and everything was cooked just the way we asked. For a starter, we shared the grilled chicken skewers with peanut sauce and cucumber relish. A nice little bite before the meal and not too heavy, either. I ordered chicken pad Thai sans tofu for my main, and I opted for a two star level of spiciness out of three. At first, the dish didn't seem spicy, but it was a deceptively slow burn. By the time I was three quarters of the way through, I was chugging water and had to tap out. Next time, I'll go with one star of heat. Truth be told, I'm kind of a heat pansy. But my meal was damn good nonetheless. I don't know what they do at Sawatdee that is different from other Thai places, but the noodles are just so much better. They easily swirl around a fork and are never stuck together. And the flavors of all the ingredients really pop. That was especially true for my dining partner's dish, the pad kee mao gai. Wow, was that good. I'm not positive that my cravings for Thai have truly been satisfied at this point. It probably won't be long before I'm back for another fix."], ["Joyce R.", "We found this restaurant by accident and were pleasantly surprised. The food seems authentic Thai to us, and we've eaten at numerous Thai restaurants before. The service was excellent, although it was a good idea to get there before 6:00 PM on a Saturday night because the restaurant seemed to fill to capacity by 6:30. The food was very good. I enjoyed my Massaman curry and my husband liked his ahi tuna special. The famed poached banana dessert, although very sweet, was worth it. Save room and calories for it. We expect to go back."], ["Helen N.", "I dont understand customer services these days. One of my pet peeves are stingy restaurants. For example, today I stopped by Sawatdee for a thai iced tea. I do not understand how \"not too much ice please\" translated to \"don't fill the drink to the top\". Seriously, how much can you save by being stingy to your customers. So I left with my drink, filled 3/4 of the way (picture attached), since I requested less ice. I even made a comment regarding to how much was filled, and they merely just added more ice. If you eat here, don't order your drink to go because you will be left feeling jipped. Also, their thai ice tea is terribly sweet!"], ["L R.", "The good news is that even mediocre Thai food makes a great take-out meal and its made even better by pleasant speedy delivery service on bicycles at 9:30pm. I'm curious where all these great reviews came from and Im wondering if maybe we just had a bland experience because its late on a Monday night. Maybe they ran out of the fragrant Thai basil, lemon grass, kefir lime leaves and galangal that make me love Thai.  Or Perhaps the people writing these reviews haven't experienced thai food on the streets of Thailand.  Anyhow... The service is excellent and remarkably pleasant so we will return. This restaurant is adorable. Every time I walk by I make a mental note to give it a try - We finally got around to it this evening. Authentic Thai? No...not so much. The green curry and panang definitely don't have the flavor punch I'm used to in Thailand, they both lack a spicy kick and sadly the sauce is so so thin.  Both the green and panang have the same exact veggies (carrots, green beans and green bell peppers) and i may have come across 1-2 basil leaves.  Spring rolls were good. Tom yum didnt have any galangal or kefir lime leaves and had more fish sauce than any spice.  The mushrooms they chose were great in there though.  We were looking for another Thai option besides Circles and our favorite Cafe de Laos but this didn't cut it. We will give it another try before giving up.  Perhaps they're better for an eat-in afternoon lunch at their adorable green and blue restaurant.Update: **Ya know... I should know better. Of course we can't find an \"authentic\" tasting Thai place that tastes quite the same as the food on the streets of Thailand.   Its like trying to eat American or Italian in Asia. The basic ingredients are difficult to find and when you do find them, the spices aren't quite as pungent so nothing ever tastes quite right. We lived in Asia awhile and even cooking our exact same US recipes in our Asia kitchen never gave satisfying results."], ["Joseph Y.", "Excellent food. Attentive service. Owners are from Bangkok so they know what they're doing. Can't go wrong with anything on the menu. If you like it spicy don't be afraid to ask!"], ["Diana K.", "Visited Sawatdee last night and it was really delicious! We got the seafood steam pot special, which was full of shellfish and tilapia, vegetables, and a yummy broth. They really did not skimp on the ingredients in this one. We also shared a chicken noodle dish, and although the chicken was a little bit dry, I would still give it a 4/5.The major downer was the service. For a Monday night, I could not believe how crowded it was in this restaurant. They only had two servers and they were completely overwhelmed, sweating profusely, and apologizing left and right. We waited almost 45 minutes for our check, and then another 15 for them to pick up our credit cards.  I really don't want to give them a hard time for being slow - I felt bad for these guys, but they need to hire some more servers! ASAP!"], ["Carla T.", "I've only been here for lunch and I must say that I'm never let down by the food. Staff seems very friendly. They have a great lunch special during the week."], ["Alea G.", "Food"], ["William B.", "Solid neighborhood Thai food, dressed up with a nice coat of paint-- literally.  I love the green walls, and they charmed me nearly half a star's worth.  Crispy tofu and bok choi was bland and I wasn't tempted to finish it.  Both the noodles and the panang curry were much better, but seemed like they were made from the same chopped-red-pepper/broccoli mix tossed in with them.  Portions were disappointingly small, too.  Good thing the walls were green."]], "Spice 28": [["Amy N.", "Thought their menu for City Sips looked like it had a decent variety of both food and drinks - and unfortunately the experience was not what it should've been. The lighting was awkwardly dim for 5:30 in the afternoon in July. The place was also empty, which normally doesn't bother me if the place is good -- but the waitstaff practically stalked us within an inch of our lives. At one point I ordered a drink, turned my head and another waiter was there asking me if I needed a drink...and then it happened again another two minutes later -- I thought that this was likely to continue either til I cycled through all of their waitstaff (unlimited supply?) or til the drink showed up (mercifully it did soon after.) Otherwise, they all hovered, refilled water if our glasses were even an inch lower than full and generally made it hilariously awkward/amusing for us. The Sips cocktail size was laughably small, as were the appetizers, which were nothing to get excited about. We finished up round two and settled our bill as quickly as possible so we could venture forth to greener non-Sips pastures."], ["Erin F.", "I went here on a whim with friends who were in the mood for Thai food. We sat at the bar. The staff seemed a little overwhelmed. They took a while to take our order. The staff member who took our order didn't really explain the menu items well enough to someone who's not familiar with Thai food. I honestly am a Thai food new newbie. Prior I only have had Pad Thai, but I would have liked a little more direction on what they think I would like based on what I told them . I ordered the Chicken Drunken Noodles. They were fine but it was a little pricey for what I got. Nothing stood out in the meal I received.The margarita drinks my friends had were delicious. Maybe the experience would have been different if we sat at the table but I wouldn't go out of my way to recommend this place to someone. It was not terrible, but not worth raving about either."], ["Darshana P.", "Awesome Asian fusion place from the decor to the food. There was plenty of staff there to greet us and help us with anything we needed. As a vegetarian they had plenty of options. Went with a group of five people and wanted to our share meals after spending a long day out. First ordered a small hot plate as an appetizer.  Two dandan noodles were more than enough between the five of us and even after being super hungry we could only eat about one and a half. So the portion sizes are good. The taste of the noddles weren't bad, but it wasn't the best dandan either. Could've used a little bit more flavor (spiciness). For the main entrees we orders the drunken noodles with tofu and mushrooms. This was very good, spicy, and flavorful . My favorite of the night. Lettuce wrap with tofu, which was okay in my opinion. The tofu was very hard and dry, but the lettuce did help. Tofu in black bean sauce was really good as well. It comes with rice and there's so much flavor enough that you don't even need this dish spicy.Overall the quality of the service, food, and pricing was great."], ["Rajiv D.", "This is a great little place in Center City, Philadelphia. the restaurant has a environment. You would think that being a fusion place, they try to do too much and lose the character of the dishes. But, they actually do quite well. The Szechuan stuff is awesome. The twice cooked pork is great, and the dry clay pot dishes are awesome. Watch out for the spice. It will leave your lips feeling numb. The vegetable sides are always good - especially the seasonal veggies.The Thai food is quite good as well. Panang Curry was excellent. Yeah, this place has dishes that are as good as the dishes you would find in specialist Asian restaurants. And the choice is great.The bar area is cool. It is packed on weekends."], ["Wayne H.", "Make no mistake - this is an Asian fusion Thai-Chinese joint. It's been modified to suit the American palette - I know this for a fact because I didn't like it but the American couple next to us \"loved it\"! Overall the food wasn't bad but it wasn't good either. Biggest let down was the green salad with mango dressing (think mango jam on your green salad). The menu said it was a \"mango salad\" & I thought/assumed it was the green mango salad that's ubiquitous in Bangkok. I know - I'm an @$$ for assuming."], ["Danny P.", "This place is easily one of my very favorite restaurants.  I've had some of the best dishes ever here and I enjoy the whole look and ambience as well.  One time when I ate here last year, the waiter even came over to my table to let me know he accidentally served me lamb instead of the beef I ordered and offered to replace it (which wasn't necessary since the lamb tasted very good as well).Overall, it's great Chinese food in a cool, modern setting."], ["Brianna F.", "We are here as a large group in Philly, and Spice 28 took our reservation one hour in advance! The food is great. The service is great. The ambiance is great. (The signature cocktails are also great!)If I'm in Philly in the future, I'll definitely come back here!!"], ["Sybille P.", "It was a beautiful Philly summer night (even more beautiful because both cars on our party found parking!!) and we make our 9:30 reservation on a Saturday night.  We opted to sit at the window (literally on the ledge) to catch a nice breeze and possibly people watch.  My brother even had a perfect view of the TV so he was able to watch whatever sports-thing-a-ma-jig they had the channel on. Wanting to further enjoy my night I ordered a Thai ginger coconut bomb.  Because of the name I was expected something spicy and sweet.  All I tasted was liquor, strong liquor.  It literally took me the length of the entire meal to get through it, but I finished it like a champ.  Since it was late, we decided to bypass any starters and go straight to the entrees.  Being a chicken Pad Thai connoisseur I obviously went with that.  Actually 3 out of 4 of us ordered the chicken Pad Thai and with good reason.  The portion was very nice considering they had a \"larger plates\" portion on their menu.  The dish was cooked nicely and tasted great.  My sister in law ordered the drunken chow fun noodles with chicken, which she said was spicy and delicious (I'm definitely trying that next time).  All in all it was a good time.  The atmosphere was awesome, the service was great, and the food was delicious."], ["Nikki R.", "My absolute favorite bar in the city! Food is so good and so inexpensive for what you get. I was addicted to the fried rice and would always get the dragon nectar drink with it. They have a great happy hour too. I always being friends back to this one...it's a keeper!"], ["SpottieMatic X.", "Ordered delivery from them on several occasions. Pineapple fried rice is one of my faves, as well as the Singapore street noodles--but quite spicy so be aware!"], ["Herbie H.", "I've heard positive things about Spice 28 and finally stopped by for lunch with my mom while she was in town.The interior and ambience is trying to be very trendy, chic, and lounge-y (which it might be for happy hour/dinner, I'm only basing it on my lunch.)I've seen some other reviews mention similarities to Han Dynasty - which based on the cuisine/menu, is accurate and on point. The lunch menu has a bunch of great options, for a variety of tastes and spice preferences. I opted for the Cumin Style lunch special (but requested tofu instead of lamb or beef.) The waiter said they could accommodate my request, and it was exactly what I wanted. The tofu was crisp and loaded with cumin flavor and a nice level of spice. I opted for the Tom Yum soup as my appetizer, which was bright and tangy and a perfect warm-up from the winter cold.The lunch portion was perfect, and both my mom and I enjoyed our meal."], ["Brian W.", "A mediocre experience overall. Walked in without reservations on a Saturday night at 9pm. Good service & strong drinks/heavy pours, a definite plus. Ordered the crab quesadilla based on other Yelp reviews, and it was terrible. 9 bucks for a fried, flattened version of crab Rangoon with very little filler and a side of mayo. Ordered pad Thai which lacked flavor and sauce, so it was really just a pile of noodles, and my partner ordered the fish hot pot which was very good and served in a bowl with a flame beneath it to keep it sizzling. Overall, I probably wouldn't return here unless it was for a happy hour, as the drinks are well priced."], ["Shawnette A.", "This is a great place to order lunch from if you work in the city and can't get out to a restaurant.  It does take 45 minutes for delivery but if you get your order in early they are very prompt.  They are kind and the mini wontons will give Han Dynasty a run for their money.  Prices are very fair for the portions and flavor.  My new go to.  Fresh ingredients!"], ["Dres D.", "El Vez was full so me and buddy were walking around looking for another Happy Hour spot. I saw the chili pepper in the logo, and thought \"Hey, another Mexican spot.\" LOL. Not until being seated did I realize, \"Ok, Asian fusion, also very cool.\" We sat in the front by the window, and the heat was on blast hardcore, so we were sweaty in seconds, but  they turned it down before we could ask, which is always nice to see the consideration. I ordered the calamari (meh..) and a few ginger martinis, which were tasty and pretty strong.Would I come back? Probably, but not for the calamari.."], ["A A.", "Strawberry iced tea is different and refreshing. I bet it would be great with rum or vodka. The Tom yum soup was very spicy authentic and delicious. Dumpings in chili oil are drowning just slightly too much. They are perfectly soft and spice balanced perfectly. Just remember to slide dumplings along bottom to get yummy spices. The pineapple fried rice is fresh and wonderful change to boring fried rice from takeout shops. The pineapples are large chunks and a perfect balance with green raisins and  the huge soft shrimps. Delicious!Now if I can just get the young blonde Asian at end to stop blaring her iPhone videos above even the music playing in here.... :("], ["Nick D.", "Friends, fiancee and I ate here for New Year's Eve dinner, as this was one of the only places that didn't have a ticketed event (originally tried Bru, then they suddenly started a ticketed open bar).That said, we were really impressed by the place: the modern decor is pleasing (think slightly-nicer-than-Crazy Sushi), the food was fine and moderately-priced, and drinks were interesting Asian-style takes on typical cocktails (I had a Thai basil gimlet which were nice and refreshing). Our server was also friendly and helpful with suggestions, etc.The fiancee and I shared shrimp green curry (which was okay - I could have handled much more spice and overall flavor) and seafood lo mein (which was  a nice, large portion and fine - neither outstanding nor bad)."], ["Thuy-My L.", "Dan dan noodles were good! All my friends liked it and had a good time. Waiter tried to make me pay more for whiskey so boo on him. Whole snapper isn't worth the price. Definitely had much better and cheaper places."], ["Christina G.", "I came here for the first time last week for my friend's birthday. I'm not sure why this place isn't busier. It's a good place for a group. It's trendy yet I found it cozy. Service was good and our waitress was all about  making recommendations. Portions were appropriate.The food was tasty. I ordered the chicken dry pot; I like it spicy and it had a lot of spicy peppers and got spicier with the more I ate.They have a full bar with interesting cocktails."], ["Brittany K.", "I went here the other night for a date night. When we got there it actually turned out to be restaurant week which was cool. So, we had reservations made way in advanced but when we arrived they said \"let me check if we have any tables\" .... Why would they need to do that if we made reservations a day ago!? Then they only had the table by the freezing cold window at the bar available. When we finally got situated at our table we had the bartender as our server. As the night went on our server changed probably 3 times. The service was really really slow.For dinner I ordered the Pad Thai with beef;Which was delicious! My boyfriend ordered the Singapore street noodles which was too spicy to have more than a few bites of. At the end of the meal; for two people it came to be about $120 including our tip. The food and experience was not worth the price. I would probably not go back there again; Han Dynasty remains our #1 spot!"], ["Brian O.", "First, the positives. We had fun (12 of us) & the food wasn't bad. It was good in some instances.The bad: These folks are absolutely inept. The whole \"running a restaurant thing\" is not their forte. A quick summary:We waited 10+ minutes to be greeted with a reservation. Another 10 minutes were spent waiting for our table.Our drinks took 5-35 minutes (5 for wine, 35 for others). No one ever asked if we wanted another.Multiple mistakes were made (I'm not kidding, more than 10). When we clarified they make additional mistakes on drink order clarifications. These were not complicated drinks.They forgot food for 2 of 12- 84% isn't too bad. It came AFTER 10 of us had finished our meals!Summary: Open up a food truck, retrain your staff or find something else you might be good at. Recommendation for you- RUN, fast... Elsewhere. This should be 0 stars!"]], "Smile Cafe": [], "Tamarind": [], "Cucina Zapata": [], "Baan Thai": [["Christina P.", "I moved away from Northern liberties but I still travel to Baan when I'm in the mood for Thai. Its my favorite Thai spot in the city. This place is family-owned and very authentic. Everything is so good - I can't help but order 2-3 dishes when I come here. Favorites: Moo yang with sticky riceDuck CurryAngel WingsBeef Salad"], ["Chinedu O.", "For our date night, we were looking for a spot that's intimate, somewhat romantic, reasonably priced, and (most importantly) served good-tasting food. We found Baan Thai via Yelp. It seems most other reviewers were on-point! I highly recommend the duck salad, which is a non-obesity-sized portioned salad generously mixed with crispy duck, onions, tomatoes, mint, spinach, etc. Probably the most satisfyingly protein-rich salad I've had in a \"nice\" restaurant. Worth every penny of the $8. We also had the combination appetizer platter, which was tasty too. We washed it down with our own wine. Oh did I forget to mention that it's a BYOB? Glorious.I was hoping to find their carousel of authentic Thai spices, but they didn't have it. The various sauces provided with our order were nice, but did not include anything hot, so I had to ask for hot sauce. They brought me a mild sauce. It was no good. I called some random waiter and insisted that he bring me back \"authentic, original, real Thai hot sauce\". He didn't understand much English, but he understood enough (based on my intense facial expressions, I suppose). He brought me something appropriately fiery. It wasn't what I'm accustomed to, but it was flavorful and fiery enough. We left a nice tip, because it was earned.If you're looking for a place to \"dress up and be seen\" and to blow tons of cash on bland food for the privilege, Baan Thai is not for you. It's a family-friendly, mom-and-pop outfit, with decent decor, decent prices, great service, attentive wait-staff, lots of casual guests, and TASTY food. We plan to return to this hidden gem, because it deserves support, and I REALLY hope they don't sell out anytime soon."], ["Nicole D.", "Headed here with a large group of friends last night for the first time.  The staff was very friendly and accommodating.The menu is pretty large, and everything was delicious!  Plenty of vegetarian options.  Generous portions, fresh ingredients.  Very reasonable prices.I agree that this is not only cheaper than Circles, but also much more delicious!"], ["Jen S.", "Do yourself a favor and grab some friends, a few bottles of wine, and head over to Baan Thai on a Friday or Saturday night before heading to the No Libs bars.Their pad thai is just what you want in a PAC thai. Just the right amount of seasoning and you can kick it up a notch if you choose. Appetizers are affordable and service is great!"], ["Max H.", "Baan Thai is so fast and delicious. As my friend said \"it was solid\"."], ["Magen S.", "Favorite thai restaurant in all of northern liberties. The service is always great and it's never too packed (they get a lot of take out orders as well). One of my favorite go to dishes is the chicken and vegetables in garlic sauce. My bf loves the pad thai and I sometimes order the pad woonsen which is also one of my favorites! The lunch special for $9.95 is an awesome deal including salad + appetizer or soup + entree including rice. It's also byob so it's always very reasonable dining here. I've had seafood here which I would not recommend. Just wasn't a fan. I am a frequent of this establishment and really have no complaints! Authentic, delicious, reasonably priced, and convenient locations. Highly recommended over Circles down the street."], ["Jessica M.", "Great food.  Nice guy.  Much better than the nearby Circles restaurant.  BYOB is a huge plus.  My BF was not totally happy with his dish.  He said it lacked flavor.  Maybe he needs more flavor!  Anyway, go here.  It's a winner.  -JM"], ["Adam J.", "While visiting Philly, a friend chose this place to dine, and I was a little skeptical. They had never been here before, and it was so random I didn't get a chance to yelp it first. But sometimes you just get lucky and this was one of those times.Conveniently nestled in Liberty Walk (Northern Liberties), it seemed a bit off the path for strangers, but likely a gem for locals and those in the know. The service here was phenomenal. While tiny, I did enjoy the intimacy and decor. So now to the food. I ordered a grilled calamari salad. It was deliciously grilled calamari over a bed of mixed greens with red onions, scallions, mint, and I believe tomatoes, topped with a chipotle lime type dressing. Amazeballs. I would love to return and try the Hi Ma Parn with chicken."], ["Sophia I.", "I'm a convert and happy about it (thanks Leo!).  The sacred Thai place that shall-not-be-named holding such sway over critics in Philly is good, but for tasty food at a great price point with personable service, get your butt over here.  The location is lovely: in the mix but not totally frat-happy.  They have outdoor seating.  It's byob and yummy to boot.  What's not to like?  In addition, they have a killer lunch specials menu that looks divine with tons of options."], ["Steven C.", "I've been ordering From Baan Thai for years. I like going into eat at their northern liberties location. It's very clean, the staff is friendly, somewhat romantic. It is BYOB. But, I think the best thing about Baan Thai is their super fast delivery service. I order delivery about 2-4 times a month. We live in fishtown but somehow they manage to get our deliveries to us within 20 minutes every time. Our favorites are the Hi Mi Parn, coconut soup, massaman curry, and the spring rolls are delicious."], ["Corey S.", "Gelatinous, Chinese takeout-style pad Thai. No spice at all although I specifically asked for it to be spicy. When I walked in to pick it up, the place was completely empty. I had to go back to the kitchen to find somebody and even then, had to wait a few more minutes for them to come out and take my money (the food was sitting on the table getting cold)."], ["Sade B.", "This was by far the best Thai restaurant I've eaten at. The service was great and the food was made with love. The flavors were bold and the prices were reasonable. I ordered the red curry sauce with seafood, it was the best choice. There was fried fish and steamed mussels, shrimp and squid. The flavors were so intense in this dish. The mango chicken was also good and the meat wasn't dry and bland like most places. This is a hidden gem, Byob was a good touch to enjoy the environment. I will be returning as a regular customer."], ["Christopher J.", "I didn't really like this place. The pad thai tasted like it had ketchup in it, and the fried appetizers were soggy and underwhelming. Granted, this was for a delivery order, but I would probably get Thai food somewhere else."], ["Thuy N.", "Who wants to cook when it's scorching hot out!  Thai take out on a lazy Sunday afternoon seemed appropriate.  I wanted to try a new Thai place in the area which did not compromise nor skimp on the fish sauce! I was a little disappointed the sauces used on the papaya salad was not as fishy, kick you in your mouth taste.  I guess they took it down a notch to cater to an American taste bud.Overall, the food was decent.  I ordered the papaya salad and firecracker which was good.  The papaya salad was flavorful but again could of used some fish sauce.  Biting into the firecracker (shrimp wrapped in spring roll skin) was crispy and juicy.  The plum sauce that came with this dish seemed like it was made from scratch, a nice added touch!The drunken noodles were tasty, light, and not heavily sauced.  It lacked a little \"umph\" but good enough.One of my favorite Thai dishes is pineapple fried rice and I was dissatisfied on how it was made here.  The rice was soggy and soft like it was freshly cook and thrown into the frying wok.  They did not fry the rice enough.This place is good for a quick Thai craving fix, however I will not be coming back again."], ["Gia M.", "I went to Baan Thai with some friends on a somewhat full stomach and this was a huge mistake, because it was delicious and the portions were super-generous. I really wish I had been hungrier. I ordered chicken pad thai (a favorite of mine) and was really happy to see a large pile of crushed peanuts on the side, allowing me to add them as I saw fit. I should have read the menu more closely, because I didn't realize tofu was mixed in with the dish. After eating a few pieces of \"weird chicken with skin on it\" my friends pointed out that the white chunk I was eating was indeed tofu. I will definitely pay more attention next time. le sigh. The noodles were tasty and there was a great abundance of bean sprouts (which are my all-time favorite component of Thai food). Basically I need to come back. Soon.BYOB, by the way. We stopped at Bottle Bar beforehand, which was a good call, because there's nothing better than a pilsner with noodles."], ["Joe D.", "Solid thai take-out with exceptional service.  We have tried all of the thai specialties, but i would have to recommend the Green Curry w/ Shrimp and extra eggplant."], ["Virginia E.", "Stellar little spot near the Piazza. I came on a date and had the mango stir fry w/ chicken. He had something else, but I tasted it and it was almost as good as mine. Would definitely come back!"], ["Vinny P.", "Oh yeah, I'm coming back here.Spring rolls - not what I meant to order but delicious. (I meant to order fresh rolls)Pad Thai - yes, flavor, funk, spice, solid portionMo Yang - oh hell yeah, freakin delicious and perfectly cooked.  (The sticky rice could have been better)Craving == satisfied."], ["Marie S.", "Baan Thai is a slightly above average Americanized Thai restaurant. Tom yum soup with shrimp This soup was oddly sweet and very mild in flavor. I asked for extra chilies and lime to get it to the correct spicy and sour intensity.Papaya saladThe papaya salad was very fresh and had great texture. But once again, the flavors were lacking. I added lime, but it still needed dried shrimp and more fish sauce to be authentic. I can understand if Baan Thai omitted those ingredients to satisfy western palates unfamiliar with those flavors.Pad kee maoThis was excellent. Spicy and a little sweet, the way it should be!Massaman curry Ugh. This dish made me so sad. Massaman curry is my favorite food in the entire world. It should be beef stewed for a long time in a rich curry. The beef was cooked to order rather than stewed. I wish I could transport myself back to Thailand to eat this again...I won't be making my way back to Baan Thai anytime soon. If anyone knows of a more authentic place, please let me know! This Thai girl is feeling homesick..."], ["Lolly G.", "I lived in nolibs (piazza) for 2 years. I frequently ate out, and the ONLY place I miss is this spot. I think that says a lot.The location isn't really the best. It's tucked away on a quiet street off liberties walk. It's not that it's in a bad/hard to find area, ifs just that they don't get much foot traffic. I've been here close to a dozen times, and each time the service is so good. They are all Thai and so kind and humbled that you've come in. The veggies are CRUNCHY. Ugh, I cannot tell you how many places I've had thai in this city that have soggy veggies. The first sign of authentic thai is that crunchiness. The tom yum is delicious. If you are a spice person, you're safe here. They will guide you if you are not. Translation: if you want to leave with a burning mouth you will. If you don't want to you won't. I love their tofu, and their curry never ever let's me down. I really miss this spot, and hope that if you are close by you try it!"]], "Erawan Thai Cuisine": [["Jeff H.", "The oldest Thai restaurant in Philadelphia - Erawan - is also one of the best.  I guess you could interpolate a causal relativity in that statement as well - \"because Erawan is so good, it has survived to become the oldest Thai restaurant in Philadelphia.\"  Erawan is located on the western edge of Center City Philadelphia and has developed both a loyal lunch and dinner following.  I had been there for dinner before but recently enjoyed my very first lunch there.  The key word in that statement is enjoyed.  The food was wonderful.  I started off with golden tofu served with a sweet and sour chili sauce.  Excellent!  The Thai salad with peanut sauce that followed deserves the same adjective.  And then came the totally tasty Pad Woon Sen.  This famous mung bean noodle vegetarian dish had flavor bursting out from every bite.  And the homemade chili hot sauce enhanced the flavors.  Service was pleasant and efficient - water glasses refilled several times.  Erawan is so good that I think it is going to stay the oldest Thai restaurant in Philadelphia for a long while to come!"], ["Thaddeus K.", "Always stop in here whenever I'm in town for the Flower Show.  Good soups and curries and along with Smile Cafe are the only two Thai places that seem to be decent in Philly (per my friends, they tell me good Thai is hard to find in the city, though it does exist in the suburbs).Decent Thai and like the cuisine, very reasonably priced."], ["Cat N.", "Another update on Erawan!  Last night we were craving Thai very LATE (9:45 pm). We remembered that Erawan was (a) fast and (b) a close walk. We called and put in an order, and even though they technically closed at 10, Patt (the owner) was gracious and said the food would be ready for pick up in 20 minutes.  We arrived a little later than that (oops, my bad!!!), and Patt greeted us at the door to make sure everything was in order.  She couldn't shake hands because her hands were floury - listen to what I'm saying people, the OWNER was cooking at 10 pm on a Friday night!!!  5 stars for service and personal attention, I would go to Erawan again if only to see Patt, much better than impersonal delivery.  On to the FOOD... The vegetarian pad thai with tofu and vegetables was good. Honestly, not great, but good. Lots of veggies, lots of peanuts, lots of tofu, decent flavor. Totally worthy of late night delivery/pick-up. But... The papaya salad was TO DIE FOR. So fresh and NOT overdressed, and a HUGE portion (seriously, it'll be lunch like half of this week). Still only one shrimp on top, but that's not why you order it, right? Really good. Even the BF was impressed, and he's not a fan of papaya.And (saving the best for last) the Imperial Golden Bag Appetizer...  oh my god. Amazing flavor and SOOOO crispy. Huge, like 3-4 bites. I got 1 (out of 5), the BF snagged the rest. I'm craving them again already. Have dreams of a lunch of papaya salad and golden bags (which means I'll have to order more!). 5 stars for personal attention and (mostly) food. Patt, thanks for a *great* meal!"], ["Natalie K.", "Favorite Thai option in the city! The place itself is quaint, with a few too many tables crammed into a tight space. But you can't be mad that them for trying to get as many customers in as possible! The staff is always very friendly and super accommodating. My go-to's here are the same as any other standard Thai place, but I will say that the quality here is great! Plus, I feel like the prices are just in line with what I would expect. Things you should try: Tom Yum Soup, Drunken Noodles, Crab Rangoons, and Panang Curry. All are very yummy - Tom Yum Soup is great for when you're not feeling well or it's just a bitterly cold evening. It's also a BYOB and there isn't a cork fee (obvi) so definitely bring your friends, bring your wine, and get ready to have a great dinner! PS: they're check-in special is a pretty sweet deal if you're dining with a group!"], ["Richard R.", "I am an avid foodie, who has links to the food industry, and normally do not write reviews. Nor will I here. Rather I will present a simple series of facts. The reader can make up their own mind what to think of this experience.1. At approximately 7pm I placed an order for this restaurant on Yelp (confirmation receipt sent within minutes, thanks Yelp!).2. Around 815 pm, I phoned and asked when the food would be arriving. I was told any minute.3. Around 845pm, I asked to speak to the manager and was placed on hold. The phone was not answered again.4. 854pm: I call again and ask to speak to the manager. I am told the food will now really arrive, the manager will be in contact later this evening, and that there will be future discounts.5. 9.08pm: food arrives (which I carefully document on camera).6. 9.10pm: Two dishes are found MIA (carefully documented on camera).6. Several days later: Nothing from Erawan management. I forgot to mention a 7 year child and birthday celebrations were involved: And I told the receptionist of both factors.Caveat emptor."], ["Chay T.", "Was in town for work and decided to kill a few hours in Chinatown before going home. Popped into this place on a whim for lunch and my oh my! So delicious!!!First off, a total bargain. About $8 or so for normal meats, an additional for shrimp, $11 for lamb. $3 surcharge if you ask for additional helping of meat. You also get a tiny (but tasty!) salad, and a mini appetizer.  I ordered Ka Pow. It said it was \"Thai spicy.\"  My only hangups (which weren't really THAT bad for the price): my entree was not that spicy and the salad was drenched in dressing. I would eat here again in a heartbeat. The place had attentive staff and a very classy, upscale vibe."], ["Casey B.", "Everyone that works here is a freakin CHAMP. I had my birthday dinner here last month and totally owe Erawan for saving the day. I'm an idiot and waited until the day before my birthday dinner to actually pick a location, and once I realized we had 20ish people coming I started to panic slightly. When I finally decided on Erawan, the hostess reassured me that they do this all the time and that it wouldn't be a problem at all.Fast-forward to the actual dinner (aka several tables full of loud, obnoxious, drunk-on-cheap-wine adult children) and I was sure they were going to kick us out for being ridiculous, but nope. They handled it with ease and didn't even look pissed off about it (or maybe they did and I was too happy-buzzed to notice). All this while ANOTHER party of 20ish people was sitting right behind our party and still, no complaints.I've ordered take out from here a bunch as well, and I'm always satisfied by whatever carb-y noodle-y rice-y spicy goodness I order. The food is good, the menu is extensive, the prices are cheap, and hello, BYOB is the effin best. Thanks again for not killing me and my friends. I'll be back."], ["Chris P.", "Honestly, the red curry is fire. Got to get it volcanic hot though.  The pad thai is pretty alright, a little peanutty.  All the entrees are pretty good. One complaint tbough is they dont have great vegetables in the ntrees. No brocollis or baby corns. We order here reasonably often and they are always quick. Have also sat down to eat a few times and the restaurant doesn't have super great air conditioning, but it does have some pretty money ambiance. Also it's byob if your into that sort of thing."], ["C M.", "Bangin pad Thai. Actually the best I've ever had. You know how you go some places and the pad Thai just sucks? The noodles are over cooked or the sauce is gross... Well this is just amazing. Chewy noodles that you can actually tell were cooked in a wok with a sauce that is sweet and flavorful. Oh... And it's so great... Mayor Nutter eats here too!"], ["Elise M.", "Erawan is a great Thai restaurant. I have been there twice now, and enjoyed myself both times!The food is tasty and reliable. Every person I have gone with liked their food. I get the Chicken Drunken Noodles (as I usually get at Thai restaurants), and they were warm and flavorful. Both times I went to Erawan were for BYOs. The place can be a bit loud because of all the young people BYOing. But I would describe it as lively and not overwhelming. The staff is quick and courteous. I definitely recommend Erawan for an enjoyable dinner or BYO. Be sure to check in on Yelp to get a free appetizer!!"], ["Jennifer M.", "Stopped here for lunch on a Saturday afternoon. There was a party of 3 (two adults and a child) already enjoying their lunch, and we rolled in as a party of 4. Another party of 2 arrived about 10 minutes later. If you do the math, that's 8.5 people dining IN the restaurant. Restaurant could probably hold about 30?Party of four ordered 2 soups and 4 entrees. Wait time for entrees was about 40 minutes. YIKES.There were multiple orders for takeout and delivery, but I would have thought our meal would have come a bit sooner. A lot sooner because this girl was pretty hungry! Regardless, the food was enjoyable. Our table ordered: Seaweed tofu soup, hot and sour soup, penang curry w/chicken, beef pad thai, pork pad prik king, and the fisherman's po tak. Soups were delish, but the pad thai was sweeter than what I expected. The penang curry? AMAZING. Definitely would order again. Nice spice and very flavorful.Our check was a bit more expensive than it should have been since they were really dinner prices. They do have lunch specials, but during the weekdays. I live closeby, but next time, I'll order takeout so the wait isn't so excruciating."], ["Christina S.", "We came here 4th of July weekend after a early movie. We were craving Thai. This was a nice spot off the beaten trail.Good food, good service, reasonable price."], ["Brandon K.", "After enjoying some delicious Thai cuisine a few more times, I had to bump Erawan up to 5 stars.  Again, the lunch specials are amazing and a great value. 3 course for around $10 - fantastic. I usually take my dad here when he's in town and he loves it.  The staff are lovely and friendly, and always great you with huge smiles. Keep up the great work!"], ["Keisha F.", "Hands down the best Thai I've ever had in Philly!!! The green curry fried rice was amazing and my friend also had the pad Thai which was delicious!"], ["Shannon B.", "Decent thai food.  I lived at 2400 chestnut so this was a really convenient take out option.  BYOB and reasonably priced.  My favorite was the drunken noodles!"], ["Maggie C.", "First time having lunch here and had a decent experience. The food was amazing but the service was quite off. Went around 1:30pm for lunch and was rush to order the food right away since the kitchen closed at 2, but the overall restaurant was open until 3. Had an Erawan Salad, Curry Chicken Dumpling, and Shrimp Pad Thai for only 9.95! One of the best Thai restaurant I ever been to in the city."], ["Ari S.", "I've been there twice now and had the exact same thing both times (it was that good the first time).  I ordered the Larb Kai (spicy lemongrass chicken salad) with sticky rice and Tom Yum Soup.  The first time around, everything was great.  The salad was perfectly spicy and flavorful, the sticky rice was sticky but pliable, and the soup was light and delicious.  The second time around, the soup was still just as good.  However, the Larb Kai was not nearly as spicy or flavorful and the sticky rice seemed to have been left out for awhile.  Not to mention it was still wrapped in plastic wrap on a plate when it came out even though it had been originally steamed in a banana leaf.  The service got to me the second time around.  Not that it was terrible, but it was definitely below average.  They brought out two of the three person's first courses without the third.  Normally that's fine as long as you bring out the third right away.  It was another five minutes for the third person's first course.  For the main courses, the same person's main course was missing for roughly 3 minutes.  If you're going to not bring someone's food out on each course, at least make the customers take turns!  I will go back again because the first time was very good.  Hopefully they can make some changes by then."], ["Jennifer R.", "After being at the chinatown location, I was skeptical when my friend picked this spot for her bday dinner, but it turned out a lot better than their other location. I'm confused why it was such an upgrade, as it's the same restaurant as the other location, but the food here was a lot more flavorful. We came with a huge group of 20 something people and they were pretty nice in dealing with our rowdy group of deliquents. I know it's very difficult for a kitchen to get 20 plates out at once but this place would get more like 3.5 stars if possible because some dishes came out 45 minutes before others and they were in the same \"hot noodle dish\" category. They had a full house and other large parties so its understandable, but 45 mins between similar dishes is pretty rough stuff.The atmosphere was average and service were pretty nice, and it seemed clean enough. Nothing spectacular but I'd come back. Our food was pretty delicious so I have to hand it to them on stepping up their game there. I got pad see ew which definitely rocked and all my friends had nice looking plates. I was bitter with the other location's pad thai that only had half the normal ingredients, but this location included the usual tasty works. nice job guys. give the chinatown location some pointers.Also, thanks for being byob and opening countless bottles of wine for us, as we waved bottles at random workers in far from sober states."], ["Nazee Z.", "I had so much fun at this place! Went for a friend's birthday party and they were very patient with us considering it was like 20 people at the table yelling, screaming and laughing like small children.We came in with a bunch of wine (yes, another BYOB!), and plopped ourselves down in a table that consumed half the restaurant and were very excited to order. I found the menu to be rather extensive, and all options seemed pretty tasty.I ended up trying a friend's crab rangoon appetizer and it was soo good! The pastry wasn't too thick so you mostly got cream cheese and crab and the dipping sauce was the right amount of spicy. My boyfriend also got a salad with a peanut dressing. I found it to be a pretty loaded salad, but the dressing was a bit flavorless.For dinner I had the green curry, which if you like spicy food, you gotta try! It was so well seasoned and had lots of food piled in there. Ended up switching with a friend half way through to try his pad thai which was a great relief for my mouth. Also a very tasty option. Then i tried my boyfriend's Duck Fried Rice--amazing!! So flavorful and tasty. A really simple and delicious dish. The guy next to me also had something with duck which was also amazing. Seems like duck is the way to go here.All in all, I had a great time, ate amazing food, and ended up paying $30 for a lotttttt of food--including the birthday girls. So worth it, so tasty, doing it again."], ["Gina M.", "Food gets a 4, service gets a 2.My coworkers adore this place for lunch, and it is a decent special, so we go probably twice a month. The quality of the food is consistent, though the portions rarely are, which is strange.  Last week the portions were perfect for one....today 3 of us could have shared one meal. Whatever I guess, as long as I don't go hungry.The service is lacking.  I will give them credit in that I've never once in 5 years seen an order get messed up. However, you best not get thirsty because your chances of flagging a waitress to get a refill are quite slim.  That might not be a bad thing though, since I've had more than my share of dirty glasses here.  Also, for some reason they seat parties on top of each other, even if the place is otherwise empty. Kind of annoying.  Overall, the price and consistency of food are what keep us coming back."]]}