{"Ho Ho Gourmet": [], "Golden Chow Mein": [], "Teahouse": [["Rachael M.", "Last night, my husband and I checked out Teahouse. It was close to our hotel and had decent reviews, so we were surprised when we drove up and there were only 2 cars in the parking lot.  A sign on the window said that they do Dim Sum on the weekends, so we were not sure whether or not we wanted to eat there.  We figured we'd walk in, check out the menu, and decide whether or not to stay.When we walked in, the scent of delicious food was immediate and welcoming. The decor of the restaurant is also really cool. All of the wooden panels on the wall have intricate carvings, and you would never know from the outside (a standard strip mall) that the inside would be so well decorated. The gentleman who greeted us at the door (who later became our waiter) let us know that even though they weren't serving Dim Sum on the cart, we could still order some of their best Dim Sum dishes off the menu, and he went so far as to suggest several.I'm so glad we listened to him!  We ordered spicy szechuan dumplings, steamed pork buns, Shanghai mini juicy buns, sticky rice with pork, and an egg roll.The egg roll and steamed pork buns were standard fare, but the spicy szechuan dumplings and Shanghai mini juicy buns were unlike anything I've tried! They were both packed with umami goodness and flavors that I haven't had anywhere else.A great feature of this restaurant was the service. Our waiter showed us how to properly eat the juicy buns and the sticky rice with pork, and he wasn't condescending at all. He even suggested what we would enjoy if we came back for weekend dim sum. I wish we were going to be in town for it!"], ["Nicole E.", "Great place and takeout. Staff are very friendly. The ambience is very dim and nice looking but still good food. My favorite the beef broccoli."], ["Makayla S.", "This place is aMAZing. Delicious food, great vibe, and fantastic service. We will either eat in or pick up food, and my husband usually convinces me to grab him some chicken wings from here once a week. They have the best wings, great general tsos, and the juicy buns are SO good. Even if you're just picking up your take out they provide good service, if you get there a minute early and it's not ready to go yet, they offer you a seat and bring you a glass of water right away. We honestly haven't been disappointed with anything we've tried from there, and we try to get something different whenever we get an entree. Anyone that wants some good chinese food, we recommend this place right away."], ["Kak L.", "Not sure why this place is listed under the \"tea room\" category. It's just a regular Chinese restaurant. There's no tea on their menu."], ["W M.", "Yum!  We went here for dinner on a quiet sunday night.  The staff were gracious, polite and swift.  They even brought rubber-banded chopsticks for our two kids.  The duck in bean sauce special was delicious.  The duck was moist and tasty and the veggies fresh and crisp.  My wife ordered the eggplant \"chef recommendation\" and it was fantastic.  The eggplant was soft and tasty.  Perhaps a little bit too much suace, but I have no other complaints.  As others have pointed out, the sesame chicken is indeed very good; a big hit with our 8 year old.  Out ever-picky 3 year old wanted noodles and I can say that the lo mein noodles were cooked very well and were yummy."], ["Jena B.", "I have been coming here for years, and most of the time I have had a great experience.  Good service, good food, lovely atmosphere.  There are a couple dishes which haven't been top notch, but their menu is so large there is no problem finding something great.  I like the Hunan pork and General Tso's chicken, and I have another friend who loves the sweat he gets from their noodle soups.  Others enjoy the chicken and vegetables.  Try it!"], ["Meg H.", "While planning for my sister's birthday outing, she talked about wanting to grab dim sum. People name dropped a few places, but they seemed too far, so we searched around and found this place. The bf and I decided that we'd make it our personal mission to scout out and taste test it first.Off the dim sum menu, we ordered 2 soy milks, pork buns, and some other meat item (bf ordered, so don't remember what it was). We also ordered the general tso's tofu and crab soup dumplings. The soy milk comes plain (and hot), so you'll need to sweeten it yourself, but tasted like it was made in house. Score! However, the rest of dim sum (including the dumplings that everyone keeps talking about) looked like they came pre-made/factory-purchased/frozen. I can't comment about the taste, but it looked alright. Boo.I thoroughly enjoyed my general tso's tofu though. Crispy tofu with a not-too-heavy coating of general tso's sauce and steamed broccoli. I was hit with nostalgia because it tasted similar to the one I eat in MA. Unfortunately I couldn't rate this place any higher, given that we only ordered dim sum  and one thing off their regular menu. Not enough to say I'm a fan if I only was a super fan of one dish."], ["Bill S.", "Dan Dan Noodles - mmm mmm!We often will order from the appetizer menu alone. Szechuan sauces are incredibly tasty, but they can be incredibly spicy! (chili oil is a wonderful thing)I bring along a towel to keep the sweat at bay."], ["Andrew H.", "Been here a few times now that I live in the neighborhood and this is some of the best Chinese on the east side of the Cities period. What sets it apart is not that it is incredibly authentic, its that they have a flavor all of their own, it might supposed to be Sichuan, but the spice isn't there the flavor is. The food speaks for itself, its not the flavor you were expecting, its better, unique. The spicy pork of some kind is what I ordered after a long day, this combined with my wife's Sichuan chicken and some crab soup dumplings. It was perfect, its not quite authentic when ordering Chinese, instead it is its own restaurant, and that isn't a bad thing. Just different, I always go here wanting great Chinese, what I get I like very much, but it isn't quite what I was expecting."], ["Washington N.", "Tea House offers robust Sichuan flavors and an excellent choice if you are in the mood for something spicy. I like to come here on the weekends before 2pm and order dim sum items off the menu. The servers have always been courteous and willing to offer suggestions whenever I asked. I personally like the Ma la beef tendon off the appetizer list or any of the buns. Be aware that some Sichuan style dishes have more unique taste such as heavy use of dried peppers or sourness compared to than typical Chinese food. I wouldn't bring a picky eater here, it's not Panda Express. The interior is well decorated but a bit more dim than I prefer but it is nice and clean."], ["Heather M.", "Oh man, those juicy buns are amazing! Have them show you how to properly eat them to enjoy their juice to the fullest. The staff was very polite and attentive. The portions are big so you'll have plenty of awesome leftovers! I had the pork Lo Mein and I gotta say it was fabulous! It's located in a small strip mall next to the east St. Paul Target. Low lighting and nice decor, not over the top and cheesy like some places."], ["Patty R.", "Damn!! This place is awesome! Great Dim Sum for Minnesota.  We ordered the crab juicy buns (crab soup dumplings), pork dumpling, and another pork dumpling in hot sauce which isn't spicy at all. Everything was absolutely delicious. You really feel like your in someone's home. Place isn't located in a great spot. Near closed businesses,  and from the outside place doesn't look very appealing.  Don't be fooled! Try it for yourself!"], ["Karl H.", "It's been a while since I've done a review but I couldn't think of a better place to get back on the reviewing horse.I've been here multiple times now since first being turned on to it. Originally I was ordered to go here and not leave unless I tried the pork juicy buns. Normally when someone orders me to do something I do the opposite but I followed through. I ordered the juicy buns and 90yhgxnclv l;knlaor09ak, sorry, had to wipe some drool off my keyboard. They're amazing! I could probably eat a couple hundred at a sitting. They live up to every ounce of hype they've received. Try them.After the juicy buns comes the main course and although the juicy buns steal the show everything else I've tried has not disappointed. The hunan chicken is really tasty and full of veggies if you're looking for those. Otherwise if you have someone to share with or are incredibly hungry the crispy whole fish is outstanding and probably one of my favorite dishes ever. Their menu is gigantic so you won't have a problem finding something, it may take a while to decide though.Not mentioning the great service would be wrong. I've always had incredibly polite and friendly service. Plus, they're always able to answer questions about anything on the menu as well. All in all, this is a stellar place if you're looking for some good Chinese."], ["Rita R.", "Juicy Buns one of our favorites! We try a different entree each time, never disappointed. We enjoy the sauces."], ["Martin H.", "Great Specials at the moment. We went all sea food and enjoyed a full range of flavors and textures. Never had a bad experience here. Great value too."], ["David R.", "Juicy Buns were the bomb....I used the online ordering and it worked like a charm. Food was done within 20 min. I tried their  Szechuan Kung Pao Chicken. Not really spicy at all but a really good flavor."], ["Jesus M.", "Please do yourself a favor and get Juicy Buns for an appetizer. These delectable steamed dumplings are filled with a delicious broth that you must slurp out before you enjoy the rest of it. Staff can be un-friendly but don't let that intimidate you. I've been there for dim-sum a couple times and it is pretty good. Everything we've ordered from the menu is delicious and would definitely get it again! We keeps me coming back are the juicy buns! If you are a fan of chinese cuisine, please visit the Teahouse!"], ["David T.", "Originally from Portland, my dim sum taste isn't as refined as those from San Francisco or Vancouver but at least I know that food shouldn't be served raw. 2 dishes that were served to us with raw shrimp and our pork buns were still cold inside. Needless to say, I'm never coming back."], ["Amy R.", "My search for really good egg foo young is over! I found it.Will be getting take out from here from now on. Egg Foo YoungChung King Spicy ChickenShrimp Fried RiceAll of which were flavorful, plentiful and made J&I quite full.Atmosphere is quaint.Place is cleanService pretty great.Our server Becky was kind enough to make sure we got the juicy bun tutorial. They were alright. The insides just kind of give me the creeps texture and moving around the plate wise.Other than that. Glad we finally listened to our friends recommendations!"], ["N C.", "This is our favorite Chinese restaurant in the Woodbury area! The shredded pork, Mongolian beef, orange chicken, and ducks are our favorites!! Their Chinese food is pretty authentic and the service is great and efficient!"]], "Shangri-La III Carry Out": [["Scott S.", "Excellent sweet and sour chicken! The cream cheese wontons are delicious we can't get enough of them! Great chow mein, great fried rice. Regarding the decor, IT'S A TAKE OUT RESTAURANT! They serve great food fast, you pick it up at the counter from the excellent staff take it home & enjoy it! My family and I too have patronized this restaurant for over 30 years. The owner is an amazing man who remembers all of his regular customers. The food is awesome, the people are great - This place is fantastic."], ["Jeff K.", "Had sweet and sour chicken and chicken fried rice... Both were excellent! I have tried all the Chinese food places near me and by far they are the best!! We will be back!"], ["Sean J.", "I LOVE SHANGRA-LA #3.  This is my favorite place I've ever been to for Chinese.  Make sure to get the Chicken chow mein or Sweet & Sour Chicken!You may need to ask for plates forks or soy sauce if you want it.The owner is super nice.  The building could use a bit of updating inside, but I love it.Make sure you eat here.  This is a MUST EAT location for anyone.  There is only one table inside, during North St. Paul car shows they put tables outside, it's really nice!"], ["Paul P.", "I remember this place from 40 years ago.  Though I do not remember getting take out from there.  The clerk was friendly and placing and receiving my order was fast. I got the chicken chow mein with an order of chicken fried rice.  This is a standard order when I am not sure what I want, but I know I am hungry ..I got my order home and poured on to a plate. I was not impressed with the chicken the way it was cut and the amount.  This was an order for 1.  I did not weigh the julienne cut chicken pieces, but would guess it was not more than 3 oz.  The volume of chow mein was decent, just not enough chicken.The chicken fried rice, again, volume was decent, but lacking in the amount of chicken. At least the chicken was cut right, in pieces, rather then the julienne style of the chow mein. It was plenty tasty without adding any soy sauce. The price was fair, but I have gotten better value at my local take out place..I am glad I went, but do not think I will be back soon. If I go back, it will be to get an order of chow mein and weigh out the chicken.  I am going to do this for other places to for a comparison."], ["Carol H.", "After reading the great reviews, we tried Chinese carry out tonight. We ordered 6 different menu items, and they were all terrible. We were very disappointed, and ended up throwing away most of what we ordered. It was bad tasting and the fried items were over cooked. Who can turn out bad tasting wings, egg rolls, and cream cheese wontons? This establishment  can, so we recommend avoiding their food."], ["DJ A.", "This is the best take-out only chinese in the area.  The chow mein is great, and I am also a fan of their beef & broccoli.  Their fried rice is among the best I have ever had.  The egg rolls are quite good, too.They have a very friendly staff, and the food is always done very quickly.Apparently there used to be several other \"Shangri-Las,\" but this is the only one still surviving.  With food this good, I know why!"], ["Josh G.", "There is absolutely no better Chinese food in the area! Trust me, you won't regret it."]], "Leeann Chin Chinese Cuisine": [], "Panda Garden Buffet": [["Noelle B.", "This has become one of our Roseville standbys. The food is good - not super awesome or gourmet - but it's always really fresh and is constantly being re-filled and tended to, which is more important at a buffet. Plus, one of the family members that works the front always remembers us when we come in, which is very sweet - and a little concerning, because it speaks to how often we eat there. Bottom line - it's tasty and it's consistently good. Go there, and make sure you get the potstickers, mushroom caps, and the green beans (they're fresh!)."], ["Garrett Z.", "Uh this place used to be soooo good! I came here quite a bit about three years ago but now things have kinda fallen in quality.It is a smaller buffet with a few good options. The pot stickers ate really good, but last time I went I was surprised by the lack of fresh, quality food. Dinner is $11.50 with tax and there is no crab legs. The food selection doesn't seem worth the price. Also we had green beans that looked like they were covered in snot. Yuck.There are so many options in the cities for Chinese buffets that serve much better food for the same price. You have to be competitive in this market! Focus on your quality and bring it back to what it used to be!"], ["Amanda C.", "If you're looking for an inexpensive buffet in the Falcon Heights/Roseville area, Panda Garden is great IF (and this is a big if) you like standard Chinese buffet style food. If you're looking for mind-blowing flavor, probably no buffet is going to be a great bet. Don't come expecting sushi or hibachi. This is a modest buffet, but it's priced accordingly. I think of it as basic Chinese takeout style comfort food. That said, the potstickers are in a league of their own, and I know people who come here just for them. The filling has great texture, the wrappers are never doughy, and the sauce is delicious (if you get these, put them in a bowl or eat them quickly, because they get cold fast, but it's totally worth it!). The green beans are snappy and fresh tasting, and sometimes some of the folks that work there are sitting at a table with a big pile of fresh green beans snapping the ends off, which I think is pretty cute. They have sauces, sprinkles and peanuts for your soft serve, and I love their almond cookies, which are pretty standard but have a nice big blanched almond half in the center. This would probably be a great place to take kids for their first try at American-style Chinese food. I've been eating here for about eight years. The food is consistent and it's always relaxing, speaking as someone who sometimes finds server interactions stressful. I see solo diners who come in with a book or newspaper almost every visit. As others have mentioned, beverages are self-serve (and included in the price), but the staff is very kind, everything is always clean, and you probably won't have dirty plates on your table for long. It might be worth remembering  that while you may not have received much personal service, your table doesn't clean itself, which seems worth at least a small tip."], ["Erin K.", "When it comes to Chinese food, I'm very picky - especially Chinese buffets! I've been here a few times now, and I haven't been disappointed.  The food trays are always being refilled with fresh product - compared to some places where they just stir the crusty crap around to make it look like it hadn't been sitting there for the past hour untouched. The Chinese options are the common items (sweet and sour, general tso, sesame, egg rolls, wontons, and others) along with american side items (mac and cheese, herb roasted potatoes, chicken wings, french fries, etc.). They also have seafood items.  There is a table that has the cold items; salads, jello, pasta salads, etc and another one with fruit and limited desserts. Oh, don't forget the ice cream machine and a few choices for toppings!Even though it is a \"whole in the wall\" spot, I've never seen it dead. There always seems to be a consistent number of customers.Panda garden isn't an \"old country buffet\" - IT'S MUCH BETTER!  And the price point is exactly where it should be (drinks are included with the meal). My boyfriend and I went there for dinner tonight and it came to $22 (not including the tip)! It was a cheap date, but we both left completely satisfied!"], ["Kristina E.", "I was super amazed with the taste. Everything taste great! I'm glad I didn't tip because you get your own silverware, and drink. They actually have ice cream toppings :) they have two buffet tables/lines. And a third one containing the desserts and fruit. Real good fried rice and lo mein. The price is very reasonable."], ["K F.", "First Time at PGB yesterday for lunch.  I found most of the ethnic selections to be rather bland. The stuffed mushroom caps, were very good and I pretty much made my meal out of those. The fried chicken drummies were also tasty.  Dining area was clean and I noticed employees were diligent about keeping serving areas wiped down and cleaned.  The restroom was clean.  This is not a place I would race to if I wanted Asian buffet, but for the price, it was ok."], ["Amy R.", "Not bad. Bad for us that we hit up a buffet after hitting the gym, but we restrained ourselves so our work out was not in vain.Quick, easy and fairly tasty and reasonably priced. Typical Chinese buffet; rice, really meaty and tasty chicken wings, really tasty stuffed mushrooms, ok fried rice etc.I like that they have lettuce and things to make a salad. They also had fresh fruit, but was paranoid about the cantaloupe and honeydew. Staff kept things well filled and cleared which is nice to see. Not bad for a quick lunch and if you don't have the patience for carry out or sit down."], ["Sandra M.", "My husband and I went to the buffet early on a Saturday evening.  No Mongolian grill, steam dumplings were cold and the rice puddling was inedible.  The only positive was the service.  Will not be a repeat customer."], ["Richard S.", "Nice big place, plenty of seats, plenty of parking. Large selection of food to choose from. I have eaten there many many times, but I love Chinese Food. So if you do too, give it a go...................Mr. Rik"], ["Katie O.", "If I can't make it to Great Moon in Maplewood . . . I come here. It's in my neighborhood and it's usually good. Panda Garden is definitely one of the more run-down Chinese buffets, but the food is good and the service is okay. It has a ton of seating and everything is self service, so if you want more pop - you just go get it. No waiting for a waitress.Check it out. But don't be surprised if it seems a little sketch and worn down."], ["Master A.", "The price is fair. The food is good (mostly chicken dishes). It's close to my work place. Great Moon is still my #1 spot. Their service is good and they are really nice. This place has all your regular Chinese buffet entrees, sweet & sour chicken, General Tso's chicken, buffet salmon, lo Mein, fried rice, chicken wings, chicken stir fry, beef and broccoli, pork rip tips, pot stickers, hot and sour soup, fried spring rolls, fried dim sum (my favorite), cream cheese wantons, stuffed mushrooms, and more.... Their food looks and taste fresh for the most part.Sometimes during the lunch hour, it's hard to find a parking spot because it's located in a strip mall. I usually just park in the 20-min parking spots. I would highly recommend this place."], ["Drew J.", "This will be the simplest and most pain free review I do for three stars.  In light of that, here's three things I enjoy:1.  There's (2) mainstream ways to make shitty crab rangoons.  The first, and the one I hate the most, is the simple fold over method.  This is where some culinary artist piles imitation crab meat, cream cheese, and filler onto a flat wonton wrapper and folds it in half.  Really?  The other method would be to pile less of that white, creamy, excellence in the center of a smaller wonton wrapper and simple lift all four corners together creating a pouch.  This method allows you to break off each corner as you see fit.  There's probably other ways, but those are the only two that I give a shit about.   Panda Garden does the latter of the two and it's marvelous.2. Fill your own beverage. You want to spike your drink Mr. Panama Jack? Go right ahead, no one will be the wiser.3. Szechuan beef that is both delicious and spicy, just like the creators of the Great Wall intended. Three things I dislike:1. All the chicken entrees are swimming in gravy.  Not even flavorful gravy.  Lame.2. Limited selection for a lunch buffet that sets you back eight cool ones.3. The workers playing mahjong while I eat.  Don't know why, but I do not trust people who play with mahjong tiles whilst I consume food.Overall, I would return. And I agree, Chinaman is not the preferred nomenclature. Asian-American, Dude"], ["Norton L.", "I used to live near here so we used to frequent this place years and years ago.  It was good back then.  They were one of the first Chinese buffets in the Northern suburbs and was recommended to my mom.  It was good back then.Now?  Yick.They've remodeled since the last time I was there, so it's updated more than it used to be.  But their food was horrible, half of the dishes were swimming some unrecognizable sauce, and they didn't have much selection.  My plates were only have filled because I couldn't find anything I wanted to try.  If you've ever seen me at a buffet, that just doesn't happen.  Nothing looked appetizing.At most Chinese buffets these days, community waiters pour drinks for you and they give you one set of silverware.  I always hated that because with drinks they either didn't fill up when I needed one or they filled up when I was about to leave, which I found wasteful.  And with silverware, I sometimes needed an extra fork.  Panda Garden has a fountain where you can serve yourself and an area where you can get your own silverware and napkins.Those are probably the only saving graces of the place, but if there was a girl named Grace that needed saving, I wouldn't have very high hopes that she'd make it."], ["dave b.", "O.K. folks,here's the dealio.......if you have ever eaten at great moon buffet,in columbia heights,mn,then panda garden buffet,is almost an exact carbon copy!.I went there for lunch,on saturday,sept 26th.The all-you-can-eat lunch buffet,was $7.78.The customer service at panda garden,is more\"hands off\",than great moon buffet......by that i mean,after paying for your meal,you choose a place to sit,get your own silverware,drinks,clean plate,etc.The employees will help you,if you need assistance with anything,though.The dining area is spacious,with red vinyl booths,up alongside the walls,and tables located,near the center of the restaurant.On this visit,i sampled the following dishes........vegetable fried rice,fried beef,swwet&sour chicken,green beans,salmon,garlic bread sticks,cream cheese won tons,and fried duck.All of the food i tried,was fresh,hot,and tasty......with the exception of the fried beef,which had a spicy kick,but tended to be a bit on the chewy side.All the buffet food,is clearly marked,on the glass sneeze-guards,so there are no guessing games,as to what you just put on your plate!.I ended my meal,with a dish of vanilla soft-serve ice cream,topped with chocolate syrup.Panda garden has plenty of free parking,in the strip mall parking lot.They accept cash and credit cards,but if i remember right,no personal checks.I can safely say that,based on my positive experience here,that i will return again,for another great meal,sometime in the future!.I give panda garden buffet,a solid four stars."], ["Nick J.", "For a buffet, you could do a lot worse. PGB has a lot of variety and some tasty dishes for a decent price. I tend to think of it as a Chinese Old Country Buffet, but better since its Asian food and the quality is a notch above the OCB. There are some dishes I like a lot including some of the spicy chicken dishes and the dumplings ( I love these). The decor is a little bland and old-school. Though there are some interesting lighted murals. But that's not really what's important right? Sometimes you just need a Chinese Buffet and PGB does the job. You won't be wowed, but you'll be satisfied."], ["Ryan M.", "There is a lack of decent food in the Como Park neighborhood.  My wife and I were pleasantly surprised by the yumminess that we found at the Panda.  There are a variety of commonly found Chinese dishes along with some unusual selections and the occasional American food (chicken strips and potato wedges) mixed in.  My wife loves the salty shrimp--heads, tails and all.  To top it off, they have fountain pop and soft-serve ice cream.  Pretty good for a buffet and better than the other non-buffet Chinese places around (I'm talking about you, Chin's Kitchen and House of Wong).  The only downer is that the employees, who are clearly family that run the place, always look tired and like they would rather be someplace else.  They are never rude but they work too much."]], "China One": [], "Chin Chin": [], "Cleveland Wok": [], "Cheng Heng Restaurant": [["Hnou V.", "This is one of my favorite restaurants. Don't let the store front deter you. Their food is fresh and delicious. I'm a huge fan of their food.  I like to get their Cambodian curries. It has an interesting tang to it. The vermicelli salad and pho are also good. I go here almost every week."], ["Jonathan T.", "This place mad flava, ya'll! Like when Nas came out with Illmatic or when Adrian Peterson ran for over 2000 yards last year.  I asked the owner what the best thing to eat was and he said the Red Cambodian Beef Noodle Soup. I think it Kar Koo... He said it was similar to Bun Bo Hue\" and he said \"no, all my Vietnamese and Chinese friends say it's different!''  I tried it and YOOOOOOOOOO, mad fresh! Like, the remake of Batman or when Adam Sandler fought Bob Barker in Happy Gilmore. Like Biggie's first album good and like the total opposite of Miley Cyrus' VMA performance!I'm not a big fan of their appetizers, but yo, when was the last time you hit up ya homeboy and was like \"yo son, gotta get them spring rolls?\" Haha. But f'real, I love their soups and that's why I come.Anyways, here are some notes:-Don't roll up to this joint and get the General Tso's chicken. It's a Cambodian joint!-Aside from the soups, you should peep the baked goods! Although, they are kind of oily, but if you are a pastry gangsta, then you'll be cool! -Next door, they have this room and a community meeting for Cambodians was going down. Peeps be claippin', having fun, etc..-Also, word on the street is that the family also built a school in Cambodia.  MAD RESPECT!The best part of the night though is when the family got in a fight about how to make playlists on somebody's iPhone. Despite the argument, the food was so good, ain't nobody cared they were yellin'. That's the ultimate test, pho sho.One of the freshest soup joints in the Twin Cities!"], ["Mina V.", "Love love love!! My husband and I always make sure to stop by here when in town. It's our favorite place for pho and banh xeo! We also had the duck pho and the spicy red soup (kor something?) by recommendation of the waitress. Their broth is definitely the best (and we''re foodies!! We know what tastes good!). Definite recommend the banh xeo (or banh chao, however it's spelled). It's a crisp crepe made of rice flour and turmeric, with a filling of meat and veggies. Just wrap the lettuce around it and dip it into the nuoc nam sauce. Light, refreshing, and super yummy!!!!"], ["Justine L.", "I'm Chinese, so going to give my Yelp-Asian-food bias here.This is a pretty small hole in the wall, but it's pretty legit, yo. I'm not sure I'd rank it on the \"Top 10 St. Paul restaurants\" (that's how I discovered it), but overall, it's pretty good. While the ambience is a bit lacking (e.g., fluorescent lights, small dining tables, etc.), the food is worth it. Now, we don't typically mix Chinese food with Cambodian, but this place does it pretty well. I like to come here on a cold winter night for some comfort food. The chive cakes are the man reason why I come back - so bad for you, yet so good. The curry is delicious, and overall the menu is huge. If you like to explore ethnic food, worth the drive to Frogtown."], ["Jay W.", "Lunch hours were busy. It felt like they were short on cooks and staff. We were there for half an hour before we got our food. The portions were less than usual. The katna vegetable on the beef fun noodles were quite bitter and the taste had to be balanced with vermicelli salad sauce. The #22 vermicelli noodle: I enjoyed the thicker larger noodle, and the egg roll was delicious. The dish itself was excellent. The only downfall is the portion size. The appearance of the chive cakes looked mouth watering, but as I took a bite into the cake, it was filled with oil. The dough wasn't fully fried. As I am writing this, I have stomach ache, my guess is due to the oil from the fried chive cakes. I still give this place a faithful 3 stars because I believe it can be better. I've been here before and my past experience does not reflect today's."], ["Koni N.", "I love this place. Pretty much every weekend I go here with my parents . We have almost tried everything off there menu. And they all taste amazing. The Tom yum with shrimp is good. And pork with basil is to die for.  The taste is always consistent. The people are super friendly . The parking lot is always full. This says a lot about this place. Amazing food brings in more people. Highly recommend this place. Cambodian food is way different from your typical pad Thai to the Vietnamese pho. Each country has there own flare in cooking. This place knows how to cook and represent Cambodia."], ["Tom K.", "We love Cheng Heng, especially the Tamarind Chicken and spring rolls. The service is always excellent."], ["Liv K.", "So glad we stopped! Wonderful and fresh! Not a bad order among us and we ordered a lot!!Highlights:62b-fried fish,light batter wonderfully spiced with gently grilled peppers and onions. Definitely a stand out!!Beef salad with fresh veggies #9 I think... Very fresh served with rice which wasn't needed but wonderful flavors.Tom yum with quail eggs, nice heat, great flavor. Again served with unneeded rice, but soup was delish.Chive cakes were unusual a bit creamy with crunchy outside. Worth trying.Spring rolls were typical, like Vietnamese but the sauce was really unusual. Light citrusy with peanuts on top.Boba tea, iced coffee were good and the egg soda is definitely worth a try. Comes out with a raw egg floating, we were a bit skeptical but we all enjoyed."], ["Alicia T.", "My boyfriend and I always come for the kor koo noodle soup. It's delicious! The owners of the resturant are always very nice and thankful for us coming in."], ["Kate W.", "Even though I've been eating at Cheng Heng for years I almost always drive past it, then loop back around to park.  This place is a gem.The food is fresh and the flavors are well balanced.  I'm darn near sure I've eaten everything on the menu, and all were delicious...for me, though, the soups are where it's at.  I dream of the bowls of fresh steaming wonderfulness.The portions are generous to the point that I wonder how the family turns a profit.Eat. There."], ["Mads V.", "Our family loves Cheng Heng, my son has loved the #38 cambodian soup since he was like 2 years old.  I still think they have some of the best eggrolls ever-very crispy and kind of delicate.  I also like the cream cheese puffs.  In the winter time we come here at least once a week. Delicious!"], ["Ka Noog Y.", "The food is quite average. Nothing too special about the dishes. Some things I don't like about this restaurant is the customer service. You have to seat yourself and they hand out your eating utensils on a piece of napkin, which I find unsanitary, because you don't even know if the server washed their hands or not. Other things I noticed is the restaurant itself doesn't seem too clean, imagine the kitchen.. These are just my opinions others may disagree or not even notice the little details, but I'm a very finicky person, so I like to look at every detail."], ["Emily W.", "I remember growing up in a Taiwanese household and eating lunch at my American babysitter's house. My favorite meal was macaroni and cheese with tuna fish, which I would literally eat so much of until my stomach hurt. Now looking back, I'm kind of grossed out by myself, but Cheng Heng brings me back to that time because this is probably one of the only restaurants in the Twin Cities that is so good, I will eat so much, ignore all satiety signals that my gut is sending to my brain, and put myself into a self-induced food coma with an associated stomach ache. Not only is the food amazing, but Cheng Heng is one of my favorite restaurants in the Twin Cities because it truly exemplifies a successful and small family-owned business. When my boyfriend and I go there to eat, its like we are treated like family. We love talking with Kevin, the owner, about what's going on in the neighborhood, and enjoy listening to the many spirited discussions about the iPhone in Cambodian. Its amazing to see how Kevin's children have grown up, from being unable to speak and walk to playing the iPad and doing homework at the restaurant. Not only that, Kevin and his family have even used the money they make from the restaurant to fund schools in Cambodia. We eat and educate other people in the process, how amazing is that?!But really, what we love most about the place is the food. This is not a restaurant that has compromised its flavor or its prices with the more success they acquire. I have been eating at this restaurant for almost 10 years now, and the flavor is the same, and as good as ever. Kevin's mother-in-law is still in the back, working as a chef, and her food is amazing. Not only that, their prices have not increased like other restaurants in the area or on Eat Street. When I come here, I literally feast and am always surprised by the amount listed on the bill. Some recommendations:- Phnom Penh noodle soup is my favorite- Boyfriend's fave is the Khor Koo (sp? Just ask Kevin)- Spring rolls are unique to anywhere else in the city and very tasty- Mussels are so inexpensive and tasty, be prepared for some spice- Tri-colored bean is unique to this restaurant as well and also very yummy- Curry is amazing, and great to take home The other day when I came here I overhead somebody say, \"This place is so good that I'm going to go home now and lay on my couch and say, 'Unnhhhh' because of how much food I ate\". I couldn't have said it better myself. I love this place, and will continue to make the trek from Uptown Minneapolis just so that I can go home, snuggle with my dog on the couch, and let out a satisfying, \"Unnnhhhh,\" at the end of the night."], ["Luis L.", "Great family run restaurant,  the Owner always asks how we are doing and always encourages us to try something new even though we are addicted to our staples. The Chive cake, and spring rolls are a must. I have eaten all up and down University ave and these are by far the best. The beef with black pepper and lime is a great dish along with any of their various soups. The prices are very reasonable and you will not leave Hungry! This is the kind d of place that you know it's grandma's recipes going on in the kitchen."], ["June K.", "Obviously their food is amazing. Every other reviewer will tell you how ridiculously great their food is - but they are the *nicest* people I have ever met. I've been in twice and walked out confused as to whether or not I was the beloved family niece or cousin of the owner. They treat me like their only customer whenever I swing by (not too often, sadly) and are consistently prompt, inexpensive, and really really nice.Even if you hate cambodian food, you should go just to have your day improved."], ["Eric Y.", "Awesome restaurant with awesome food. my favorite here are the spring rolls- Soft texture, great flavor and their dipping sauce is bomb. Service here is great, and the wait isn't bad. Must try!"], ["S W.", "I've had a LOT of  under $25 food moments, but this is possibly the best one I've had on University Ave in St. Paul.  I've only been once, had the Kor Koo and chive cakes and I plan on working through the menu.  Seriously. Go.  The Kor Koo is like a beefy second cousin of the best Bun Bo Hue you can think of. It's filled with fatty-ass fat brisket so good it melts in your face, but if you're scared of the good parts of dead animals and Big Bowl is your speed, just ignore my star ratings.Go.  Did I say that? Go NOW."], ["Hannah T.", "Went here last night after begging Nic to take me (He had been here 2 weeks prior and let me try two bites of his left-over soup) Well, I wanted to try the soup fresh! And I wanted to see what Cambodian food was all about since I had never had it!It's bare with a few Asian inspired pictures, but the staff was quick and friendly. We ordered the Spring rolls (since I'm obsessed with finding the best ones), at $3.75, an average price, and about average they were for me. The description made it sound like there were a lot more vegetables in them than what actually came out. No carrots, I swear it said carrots, oh well, the rice paper was a little too sticky for me as well. What saved these rolls was the mint inside, made them super fresh tasting, and the sauce was different, a sweet oil based sauce with hand crushed peanuts. Really good. I wanted to order more than the soup because everything looked amazing and it's fun to see the slight differences between different types of Asian cuisine. But, I wasn't that hungry and wanted the Tom yum soup over anything else. This soup is awesome the flavors are great! It's a sweeter soup, which originally I thought I wouldn't like being that I'm a master of the spicy world. The tofu was cooked perfectly and the icing on the cake is the Quail Eggs. Oh my goodness, they are like soft boiled (I think, I'm not an egg master) and they pop and melt in your mouth. It's a big bowl, and Nic and I were filled after the appetizer and soup, which comes with rice too!Love that everything is veggie friendly, love that it is super cheap, and I will be back to try some of the other dishes! Otherwise this seems like a perfect place to go when you want soup on those cold winter nights."], ["Samnang B.", "Best Cambodian Food Located in the St. Paul area! The decoration is not all that great. They need to remodel the place because inside seems so cold. Yet, the food is amazing! Each and every item on the list will satisfy your cravings. The pricing is extremely affordable! Parking- You can park on the street in front of the place if they do not have a spot open then there should be a small parking lot on the right side of the restaurant. Don't forget to lock your doors. I wouldn't trust leaving the car unlocked... Besides.. It's \"FROGTOWN!\" Not a very safe area."], ["m O.", "Close your eyes and pick anything on the menu...have been coming for years and it's all wonderful.  The springrolls are the best in town (I know, I've had them all!)  The Pho, fish wrapped in leaves, fresh stir fry with fantastic flavor.  The owners are dear people making a go of it with an emphasis on kindness, prompt services and great, great food.  Go....NOW!"]], "Kim's Kitchen": [["Dawn S.", "I could eat here several times a week.  Very good customer service.  Very short wait times.  Reasonably priced.  I don't generally order off of the menu, they make whatever I request well.  The only issue I have is that they use MSG.  They will omit the MSG if you ask, but some of the items are pre-made (chow mein) and already have MSG added.  Convenient street parking."], ["Sharon C.", "I have been to Kim,s four times .  There mushroom chowmein is very good.Once I had the subgum chowmein and I did not like that as well as I like the Mushroom chowmein."], ["Jeff S.", "I eat Chinese food all the time, I always try new places when I find them. And without exception the best food I have found is Kim's Kitchen on Randolph. The tiny little place 5 blocks from my house, how lucky. Try it you won't be disappointed."]], "Sui Yep Cafe": [], "Great Dragon Chinese Resturant": [], "Lucky China": [], "Café 99": [["Paul F.", "Pretty solid! Easily the best Americanized Chinese I've had in this surprisingly barren part of the country. Really unique flavors that put restaurants like Shuang Cheng to dang shame (had that part written in my head days ago). The spring rolls were the highlight--really fantastic and fresh and healthy. Walnut-honey shrimp were pretty good too. Had some surprising nutty undertones that kept it from being a buffet-worthy dish. I'm actually intrigued, and might bump this up a star if I find some better main dishes next time around."], ["Xia X.", "I'm from Chinese Student and Scholar Association...Each semester we will have some Chinese events，then we always prefer to order dinner for over hundred people from Cafe 99，because they provide amazing foods and perfect service. I really love their meatballs and cold dishes！I'm pretty sure next time，we will also ordered from Cafe 99 and maybe we will try something new，because I agree all the foods there should be pretty good！"], ["Paul P.", "Food is very good.   Nice selection of authentic and Americanized Chinese.   Service is friendly but seems to be inexperienced."], ["Yingjue C.", "I only ever want the spicy sole dish here, the fish just melts in your mouth with all the spices and pepper taste, super spicy, super numbing but definitely addictive.  I always forget to try something new."], ["BB S.", "Atmosphere is nice. I had been there when it was Bascali's and I can see how much work they put into it. I had the pad thai. It was ok. It was pink, which I thought very odd. Not as tasty as I've had from other places. Probably wouldn't get it again. Found 2 hairs in it. Bit of a turn off, to say the least. Now it's the following morning and I'm wishing we had gone to Willow Gate. Sick to my stomach. Really thinking that I won't be back there."], ["Zewen M.", "I like this place. The foods are really good. The waiters are the nice. There are always some new food I want to try here. Good over all."], ["Wenkai Y.", "超级喜欢他们的豆花鱼，梅菜扣肉，还有回锅大肠~~~好好吃~~服务态度也超级好！Don't how to translate these dishes. I have been there three times. But absolutely love several dishes. And service has been awesome. :)"], ["Wuming G.", "The best authentic Chinese restaurant in twin cities. Maybe American styled Chinese food like sesame chicken, orange chicken and beef broccoli are not the best, which should not be considered as Chinese food, but everything on the traditional Chinese menu is fantastic. Recommend to those who know how to enjoy food from a different culture."], ["Art B.", "A group of us had dinner here, last night.  Out of the 5 people, all were impressed with the food and service.This is \"different\" from most Chinese restaurants, and that might be a little intimidating, at first.  But, be adventurous and try this place.  You will be pleasantly surprised!  Huge portions, reasonable prices, high quality food."], ["Pedro R.", "Cheap, fast and the food was good. I came very early and I was almost alone here. I may repeat coming again."], ["Debbie W.", "I wish I had listened to the previous posts about Cafe 99. The service was non existent. The food came out at the wrong times, and the dumplings never arrived at our table. We had to stop someone to get refills and another drink. Best part, adding an 18% gratuity that was not deserved just because it was Groupon. Think twice and dont go!"], ["Steve Y.", "We had the chrysanthemum sole - it was delicious!  Looking forward to exploring the rest of the menu.  They did a nice job with the renovation of the space."], ["Dave M.", "This is my new favorite Chinese restaurant in the Twin Cities.  I'm lucky to have these guys 1.5 miles from my house.  I had dinner here with 5 friends last weekend, and we each ordered a different entree and shared with each other so I got to sample many dishes.  My parents ran a Szechuan restaurant growing up, and many of the dishes here are very authentic and well-prepared.  The service was slow -- many full tables and only 1 1/2 servers (the guy serving us was clearly not used to serving tables didn't know the English names of the dishes) .  Still, the food made up for the slow service.  Reading through some of the critical reviews is funny to me.  Not eating the tea eggs because they're brown?  Hahaha, you're missing out, buddy!  Dumplings too doughy?    More like they are exactly the same as the homemade dumplings my grandma would make --- deeeelicious!  Dang, writing this made me hungry.  On my way there now to get some take out.  Go check it out for sure and decide for yourself whether you like authentic Chinese food.  Don't tell too many people though, I kind of want to keep this place to myself. =)"]], "Peking Garden": [["Eva D.", "Authentic, fresh and delicious! A go-to for Cantonese seafood.My favorites here include the seafood tofu soup, they have the best walnut shrimp in the twin cities (get it Hong Kong style, not American). The pei pa tofu here is divine with pieces of shrimp and cafe tables and a delicious sauce. I also like the young chow fried rice (no bbq pork for us) and our newest discovery here is the steamed tofu stuffed with pork and shrimp. It is delicious!"], ["Denny G.", "Worse place. I usually give a place a 2nd chance thinking it could be busy or the workers are exhausted from a long day but nope. This place has the worse waiters and waitresses, one lady seems to do all the work while the Vietnamese fellow or Cambodian because he's not Hmong is horrible at remembering to bring us refills on water, even after he came seconds before and asked us.They have 5 pages full of wonderful foods that you can order but somehow it takes an hour for two small meals. Tonight we only ate our first meal and decided to leave and had to tell our waiter to cancel the 2nd meal. Maybe it's a comfortable place for some of the local people in that area but it's really more of a restaurant inside a fleet market type of setting which I feel bad saying that since a fleet market is better managed and taken care off. Oh and seriously clean the bathrooms, it's got piss all over the floor."], ["Tou Y.", "The food is good, but I've notice the portion has gone down a bit , price has gone up tooWhen in doubt ask for the price , just because some seasonal stuffs can get spendy fast ."], ["Jonathan L.", "I've been here a few times. Once with some friends and we ordered family style, which was really good. Duck is pretty decent, especially in Minnesota. I mainly come here for the Duck rice plate. It's basically roasted duck and some steamed veggies over rice. It's pretty good. Under $10 and filling. I love duck and this place has pretty good duck on most occasions. There are sometimes where the duck parts they give are more fatty and bony with less meat. Other occasions, they'll give you parts that aren't too fatty nor bony.  I like stopping by after work. It takes about 10 minutes for them to make my rice plate :)."], ["Sheri S.", "Who doesn't love a Chinese Buffet? Moreover who doesn't love a Chinese Buffet in a shopping center? lolThis Place is large and they have a good variety of food to choose from.There are a few things you should know though before you get too excited.  1. They cater for weddings and other special events they close by 7 pm on Saturdays and then reopens at 10pm for regular customers2. Don't get fooled by the buffet option. It is only for a limited time: from the time they open until 5pm. After that it becomes a regular sit down restaurant. 3. If you think you can sit down to eat and take away food that does not happen. It is an either you goto the buffet or you sit down, not both.Every time I have gone here it has been solid. They place is run pretty effectively and you are guaranteed some flavorful food.Some things I would recommend include:Beef fried rice, Chicken wings, Beefs ribs and their Beef and Broccoli!"], ["Jonathan T.", "To preface my review, I know a grip of peeps that like to debate the use of the ambiguous word \"authentic,\" which is understandable. I mean, what does that mean, exactly? Well, based on my past experiences that often relate to many other Southeast and East Asians that I grew up with, a Chinese restaurant is authentic if it meets the several criteria outlined below. Does Peking Garden pass? CRITERIA I: Fast service. Not necessarily friendly. Hungry patrons want to shove food in their face as quickly as possible, and most Chinese restaurants I've grown up in often skip formalities such as \"how are you this fine evening?\" A server at a Chinese restaurant will usually ask, \"What would you like to order?\" and wait for your response to scribble everything down on his or her little pad, then dash to the kitchen. As long as the food comes out blazing fast and piping hot, what else matters? Also, like with any job, a server might forget an order. And, if that ever occurs, make sure to wave a staff member down to remind him or her. Shouting is A-OK.During my most recent experience there, our food came out incredibly fast, and I had to flag down a server to get some extra napkins. (No big deal.) Our three dishes came out in less than 15 minutes, which was awesome. I'm assuming that the kitchen carries a legion of cooks. *Side note: Don't be offended if the server only looks at one or two people. It's customary that only a couple people order for an entire table.CRITERIA II: 90% or more of the diners are Asian.Shouldn't a cuisine -- that comes from a particular country of origin -- appease the people that also come from the same country of origin? I would think so! That's your bread and butter, yo! So, anytime Asian folks at a Chinese restaurant can be spotted, it's a good sign. (I say \"Asian,\" because I can't assume everyone is Chinese. Lots of Hmong and Viet folks there, too.)Peking Garden is usually filled to the brim with Asian folk, especially on the weekends. Not to mention, my girlfriend's family (Taiwanese) has been eating there for over a decade. Legit? I think so... BTW, why an arbitrary percentage of 90? Because us Asian folks love \"As.\" Ha. Ha. Ha. But seriously, I wouldn't be surprised if 5-10% of the Twin Cities' Chinese population ate there at least once on the weekends.CRITERIA III: The same old characters.There's the kid face-to-screen watching Pokemon on his iPod , the elderly grandma walking to the bathroom with the assistance of her daughter, and the old man with his shirt tucked in telling stories about the old times. Peking Garden often has all three of these characters, practically every night. Sometimes, they're all part of the same family. CRITERIA IV: Tasty food.This is the most important criterion that causes to I-III to occur. I'll review what we had, most recently. *Steamed Black Cod With Ginger & Soy-Sauce: Fatty and savory skin and luscious meat. If you love fish, this is definitely one of the best dishes in the Twin Cities. Not to mention, black cod is a much more affordable and sustainable than sea bass, and they taste practically the same.*Lobster With Ginger & Scallion: Can't get any better than fresh lobster! Peking Garden has several tanks in the back right filled with them, and when ordered, they're taken out and quickly cooked. There isn't a ton of meat, but plenty of flavor. *Pro tip: Fellas -- Give the claws to your girl. She'll appreciate that you're giving her the parts with the most meat. lol.*Crab And White Asparagus Soup: Usually served at Chinese and Vietnamese weddings, we indulged in this delight. Pretty good, although, there's an unusual after-taste. *Pea Tips: Best I've ever had and perfectly salted. Yum!*Note: Don't order General Tsos, orange chicken, and the like. ****Don't get me wrong, I enjoy eating at fancy restaurants and don't mind dropping money for them; however, if I had to choose how I would spend $70 on a meal and highly weighed value and taste over other factors, I would pick a Chinese restaurant like Peking Garden ten out of ten times."], ["Louise M.", "Peking Garden has no Garden. It's in a strip mall in St. Paul not in Beijing/Peking. I love how Chinese named their restaurants. It doesn't have to be true, but as long as it connects to the old country, it's great! .. And it is! When I first moved here, I was a bit depressed looking at the Chinese restaurant scene. There wasn't much choice compared to where I used to live. There really isn't much of the fancier restaurant either for celebration like Chinese New Year. The ones that always come up are Mandarin Kitchen and Peking Garden. Either is far from fancy but they do serve good non chop suey Chinese foods with selections of fresh live seafoods.Yesterday was my second Chinese New Year dinner at Peking Garden. Yeah, we did it a bit early so we can eat freely before Lent starts. It doesn't bother me but I'm a sinner. Big sinner. Some of my friends on the table probably had halo on their head trying to do the Daniel Fast for Lent. Not me. I may give up smoking or Candy Crush. Wait, I don't smoke and I don't play Candy Crush. I think it'll be a successful Lent!But Chinese New Year first. It's a huge holiday for Asians and it's one of my fave holidays ever. The kids and singles get red envelope filled with money and I used to rake it in and then had a shopping spree from hard work bowing with my hands clasped together and wishing my elders a prosperous new year. Peking Garden was packed from the CNY crowd too though it's way early for it. People can celebrate within the 15 days from the actual date as China had over 1 billion people in China alone and hundreds of millions elsewhere. We have relatives to visit and one day won't be enough.Service was fast and not at all delicate. They put bowls and utensils like they would throw it at you. Carts filled with food or cleaning carts smelling like bleach were also come and go fast and furious. That's how it is anywhere in Asia so it felt natural. Don't expect anything but that at Peking Garden. We ordered the course dinner for 8 and there were some fancy stuff coming. Lobster flash fried and  cooked with ginger; Shanghai pork chops - breaded pork chop in a tangy sweet but also sour sauce but not sweet and sour sauce; fried tofu cooked with mushrooms and pork slices; baby bok choy in garlic sauce; seafood stir fry; spicy manila clams; fresh whole steamed walleye; and Peking Duck!The Peking Duck really hit the spot. Too bad it came already cut and we didn't get the show on when they dress the duck table side. It also only came with the tortilla looking pancakes instead of the yummy steamed buns. However, it was still a huge treat and tasted so delicious!! The Shanghai pork chop was my other favorite. Tender pork, breaded and then paired with that tangy sauce? Happy new year to me! They also provided you with the tofu seafood soup to start and a tapioca pearl dessert soup cooked in coconut milk with chunks of soft taro. The dessert was awesome! I actually asked for another bowl. It is missing some of the more traditional CNY dishes that my mom would cook like the pork belly or anything cooked with these shreds of Chinese fungus called fat chay to resemble the saying \"Gong xi fat chay\" and have a great year. However, for what I could get here, I was pretty damn happy.I come here once in awhile for their noodle soup as well. It's great and cheap. That's also why my friends opted for here instead of Mandarin Kitchen. It was so much cheaper here. Our fancy dinner was only $25 per person with tip. That's so cheap considering we were eating lobster, a whole duck, and a whole fresh walleye. I almost wanted to tell the men to just pick up the tab.. Like Russell Peters would say in his made up Chinese accent.. \"be a man!\" Lol.Fun night, great food. Hope we started the year of the Ram grandly and great prosperous new year for us all. I'm a Rabbit and Rabbit and Ram are a good pairing. I'm looking forward to great wonderful things!! If you believe, you'll make it happened. Gong xi fat chay!"], ["G V.", "The food here are delicious! I have yet to complain about a dish and I would like to keep it that way. Servers are not really attentive but they do try. I understand that they don't want to be bothersome while you're eating but it's always a plus to check up with how the meal is going, making sure drinks are refilled properly, and asking if anything is needed."], ["Thomas C.", "Food is good. The beef chow fun is god like compared to a lot of places I've tried. However if you have a large group I highly suggest you ask for an itemized bill before handing over your credit card. Had a shady experience here where we given the wrong check, paid for, and the tip for the higher check was kept. The waiter with the balding problem and Lionel Hutz smile is someone to watch out for."], ["Liz K.", "I have been coming here for years and I'mloyal to the Peking duck. Its thinly sliced and comes with tortilla wraps and a side dish with cucumber, green onion, and hoisin sauce. This dish used to come with steamed lotus buns instead of tortillas..damn I miss those days!! I also like* soft shell crab for an appetizer* chicken & salty fish fried rice* house clams in black bean sauce* lobster in ginger scallion* hollow vegetables stir fry with garlic"], ["Qaiser B.", "I have visited Peking Garden at two different occasions now. The food is fine and not very expensive. It is a good place for very large groups as they have plenty of space. My only slight concern is the cleanliness of the place. I would really like to give it a higher rating but because of the abject state of cleanliness I am going with two stars."], ["Ka Noog Y.", "The food here is delicious ! Way better then your average Chinese food. When the food comes out, it comes in a big family sized portion and the wait isn't too long. The food is rich in flavor and I'm never disappointed in the dishes at all. The servers are okay, not the best, but they ain't the worst as well. This place is a definitely must try !Note: try the coconut walnut shrimp !! It's delicious!"], ["Laurie P.", "Great place.  We had the Peking duck--I recommend with steamed buns, as the pancakes are just tortillas (reason for the 4 stars) The duck was delicious.  And just as a note, their lunch buffet looked terrific.  Everything you can think of, including pizza!!  But fresh and for $8.25, it's hard to bear.  Clean, friendly,nice people."], ["Jennifer Y.", "Recently went back to the Twin Cities as having lived there 2 years ago for 3 years. But my mom introduced me to this place. Most Authentic chinese you can find around the cities. Hit or miss with the service. Both times I went though were not too good. But their food makes up for it i guess. I highly recommend this place for family dinners, as the spinning tables help with getting food from one end to the other."], ["Benjamin S.", "Went shopping at rainbow around 10:30 and saw that glorious \"Peking Garden\" sign illuminated across the way. I ordered up a thing of veggie fried rice and an order of cream cheese wontons. They said it'd be ready soon. So after shopping for 15 minutes I go over. Pay. And wait.....maybe 6 minutes for the order to come up. Get it home and damn. They musta just made it fresh cause everything was piping hot. Wontons were a staple of deliciousness and that fried rice? So many veggies in there! Packed full of veggies. For being a random idea it turned out great. Will definitely be back."], ["Ko V.", "Took the wife and daughter here for mothers day dinner. This place was PACKED. But we got seated within 15 mins. This is my go to place for Chinese food in the Twin Cities area. We ordered the dinner for 4, best deal on the menu. It comes with white rice, fried chinese broccoli, tofu of your choice(mapo tofu), lobster in your choice of sauce(ginger and scallion), don't remember what the other item was, then dessert. All for a decent price that doesn't break the bank. Service here had never been bad to me. Fast, friendly. Will definitely visit soon here."], ["Susannah H.", "Peking Garden is my go-to whenever I get a craving for Chinese...which is about twice a week.  Unfortunately I can't always get it twice a week, but you get my point.  Sick?  Peking Garden.Rough day at work?  Peking Garden. Hungover?  Peking Garden (+ Vitamin Water). Casual date night?  Peking Garden.  Delivery = fast/standard.  Customer service = (with the exception of one time with a larger group) super prompt and friendly.  And the food...I really, REALLY wish they did dim sum.  I have no idea how the buffet is, but all of the menu items we've had have been super tasty, well priced, with large portions.  Definitely a bit on the greasier side with some things (why it's 4 stars instead of 5), but we've yet to order anything that we didn't like.  Suggestion: the roast duck anything and the shredded pork, eggplant, and fried tofu dish.  They also have a Family Special deal for a 4+ people with tons of awesome looking food at a really reasonable price.  Plan on doing that in the very near future.   SUPER happy this place is so close."], ["Lyn C.", "I got Pork Eggplant Tofu in Garlic sauce and the salt and pepper fried squid. Eggplant was great and so was the sauce while the squid was fried nicely, but it slightly failed to live up to the \"salt\" portion of its name. The wonton and hot and sour soup were adequate. All in all, my experience here was positive and I am definitely coming back again because there are so many items on the menu I am dying to try! One of the best, authentic cuisines I've encountered so far."], ["Emily R.", "I traveled to China about two years ago and when I was in Beijing we went to a very popular restaurant called Peking Duck.  It was one oft he most memorable meals I had during my travels.  At first our travel guide was explaining what we were going to eat in broken English I had no idea what I was going to eat.  All she said was duck, pancake and sauce.  But it was amazing, best meal I've ever had.  Ever since that experience I wanted to find a similar meal in the states, which is sometimes impossible, but Peking Garden has Peking Duck and I highly recommend it.  You take pieces of duck and put it into a wrap, kind of like a tortilla, and put long onions, sugar, and a black sauce and then then wrap it up.  It's very hard to explain, so you just need to go check it out yourself.  Also half a duck is perfect for two people.  The service here is very kind and helpful! I highly recommend it!  Also as good as the real deal that you can only get in China!"], ["Henry W.", "Great food!  I've ordered from here a good number of times and am always nothing but impressed with the food!  My preference would be to be able to give it more stars, but I'm giving it three stars because of their policy that for them to deliver, one has to order at least $25 worth of food, which is a bit too much for me and probably many others."]], "Jingchu Land Chinese Restaurant": [], "Wong Cafe": [], "Wok Cuisine": [], "North China Restaurant": []}