{"The French Hen Café": [], "French Corner Bistro & Bakery": [], "The Happy Gnome": [], "Skinners Pub and Eatery": [], "The Blue Door Pub": [], "Coup d'État": [["Elyse A.", "Visited Coup D'Etat last weekend with my husband and some of our friends and I honestly felt as though I'd walked through a teleportation machine and was at a swanky restaurant in Manhattan. The crowd was painfully hip--did the restaurant hire all these extras to stand around and look glamorous and amazing? Or do these people live in Minnesota? I'm so confused.What I mean by all of this, is that the space is breathtaking. Gorgeous chandeliers, Parisian floors--the place is dripping in class and is beyond sexy. Dark, yet warm. Simple, yet chic. It feels massive and cozy all at once. How is that even physically possible? This is a great spot for a group gathering or a celebration! It feels impressive and special, and the people watching is exceptional.Although we just went for drinks and appetizers, we were all very pleased with our choices. My friends tried tons of the specialty cocktails (we had a special Minnesota giggle over the one called Duck Duck Gray Duck). And I discovered, for the first time in my life, that I like oysters! I never thought I did, but here they are warm and garlicky and not ocean-tasting at all. We ordered five for our group of six people and I ate two. Whoopsies! Our server was knowledgeable and charming and knew the menu backwards and forwards. She was nothing short of delightful and professional.I can't wait to go back and try more dishes beyond the oysters, french fries, brussel sprouts and cheese plate. The chef here here has such a deep respect for food and such a creative flair, that I bet it'll be hard to find a non-delicious item on the menu, albeit impossible."], ["Chris L.", "First time review and could go to five stars with repeat performance.Popped in for a late Monday night dinner.  Not packed and no wait probably added to the charm for me.  Party sat at a hightop in the bar.  Good beer selection and plenty of wine by the glass -- cocktail menu looked fun but no one partook.Food came out fast and was spot on.  Pepperoni flatbread done right -- crispy cracker crust and flavorful toppings.  Brussels were great and gnocchi even better -- very similar to 112 Eatery style.  Cheese plate was on par with restaurants of its type.  Companions had scallops (excellent) and duck confit/risotto balls -- good but so rich you can't finish the portion given.We took an informal tour and the semi-private dining room has to be one of the best looking rooms of its type in the Cities.  Some cool, eclectic furnishings on the second floor.  On the way out spotted some Pappy van Winkle in the wine cellar, and had our choice of a 15, 20 or 23 year pour (did the 15 year at $35 for 2 oz.).  Owner JT gracious and welcoming in discussing the Pappy.Going to be my new neighborhood place.  Welcome Coup d'Etat!UPDATE - Went back with wife and kiddo.  Still a four star experience.  No wait and good service if a little bright eyed (\"it's all good!\").  Mussels and clams were good, cheese plate was stingier than the last time (3 very small pieces).  Brussels were OK but not as good as I recall the last time.  Flatbreads are great.  Pappardelle dish was very good.  Still a good variety of beers to choose from (not just 15 IPAs)."], ["Brigid M.", "Was visiting the boyfriend's family and made some reservations with friends as it was the end of Restaurant Week. Here are the pluses:-Decor and set up is awesome, rivals quite a few places I've seen in Chicago.-Asparagus was a perfect portion, and nice touch with the prosciutto.-Strawberry rhubarb tart was not overdone, nice contrast of flavors. The cons:-SERVICE! Our server was literally high as a kite and couldn't focus on us. She would forget orders and mix up what people wanted. She was so slow that the runners and other servers were picking up her slack and delivering drinks and food. Granted, she was very apologetic, but midway through the meal began slurring her words and blaming her flightiness on boyfriend issues. At the end of the meal she took about 30 minutes to split a check amongst five people and even left some charges off the bill. It was a busy night, but a manager had to have seen that the server was mightily struggling and not sober at all. I hope that it was just an off night, but the experience would make me reluctant to try Coup d'Etat for a late night meal."], ["Kristi E.", "I went a few weeks after opening - we were sat at a booth near the bar, but would have loved a seat up top with a view, or in the impressive room in the back. I had the brussels sprouts (very vinegar-y), some cocktails, and fries (which were blah as blah can be). I'd suggest sitting by the kitchen at the marble-top bar, or up top. Grab the cocktails then head on out into uptown for some better food."], ["Galina S.", "Don't go for food, for drinks and atmosphere good, kitchen DOES NOT MEET THE PLACE, PERIOD."], ["John G.", "Minneapolis needs more restaurants like this. The entire concept works, from the decor and ambience to the menu and drinks, along with top notch service. The Old Fashioned I ordered hit the spot; one can tell the bar has great attention to detail. I'd like to see a Manhattan on the menu as well, but that's just my own taste. They also have an excellent beer selection that is seasonally appropriate with a wide variety of choices.I don't typically go for a flat iron steak, but it came recommended and I was happy with my decision - cooked medium/medium-rare with a ton of flavor. The Branzino was cooked perfectly as well - I'll be interested to try the other fish on the menu. And if you come here you must order the brussel sprouts. So delicious.The only thing keeping this review from being 5 stars is the price tag. I felt the entrees, while spectacular, were $5-8 overpriced, and the drinks were a bit too expensive as well (This is Minneapolis, not Chicago). Perhaps after a few more visits I'll conclude that the prices are justified for the overall experience. Given how fantastic Borough/Parlour are, I knew this place wouldn't disappoint. Well done!"], ["Ellen M.", "The atmosphere was quite nice.  And I could hear my friends speaking across the table.But the mussels, pizza and fries were only so-so.  The chocolate lava cake dessert was great, along with the 3 cheese appetizer.  No real reason for me to go there again."], ["Kate S.", "Great (semi-new) restaurant in Uptown! They have amazing ambiance, and GREAT Happy Hour - though some food a bit greasy, it has there classics (bone marrow and oysters) for 1/2 price (5-7 p.m.), also the HH Cocktails are SO good - I recommend the Apples to Apples yummmm.  Can't wait to go there again and again."], ["Vee V.", "The gnocchi was fantastic! Very fluffy and flavorful, and not heavy at all. It's a must try! Our table also had the grilled octopus, bone marrow, creamy polenta, and ahi tuna. These dishes all needed a bit more salt. They were \"so so,\" I wouldn't order those dishes again. The octopus was good alone but it had a spread that was a bit sour, it was kind of funky. The service was great, very friendly staff. The drinks were delicious, I'll be back for the Earl Grey old fashion!"], ["Jay B.", "Decided to give this place a shot after hearing a lot if good things from friends and reading reviews.  Disclaimer...poor service drives this poor review and it may have been bad luck...We were seated promptly at a nice table on the second level.  The waitress was slow to arrive and it only got worse.  Our party of four ordered a beer, scotch and two glasses of sparkling wine.  The waitress returned to advise the beer was gone.  A second beer was ordered and it arrived 5-10 minutes later..alone.  Next the sparkling wine arrived 5 minutes later and still no scotch.  Evidently the bottle was only stored on the lower level..so 5 more minutes and finally we all have our drinks.We ordered mussels as an appetizer which admittedly were good.  We placed entree orders and upon their arrival the fries were missing.  We ordered more drinks and they arrived in three shifts again.  Two glasses of wine arriving after the entrees were already eaten. The food was okay, not fantastic.  We had the pork, steak and halibut.  Presentation was fine and the flavors were as well.  Nothing to rush back for however.  For desert we ordered the smores and boozy ice cream sandwich.  Both good.  After paying the bill we determined the experienced was ruined by HORRIBLE service and the food was OK.  Again maybe bad luck...but I won't give them another shot.  My nights out are far to rare to be left to chance."], ["Sunny T.", "The decor/atmosphere of this place is amazing. It's like glamour met modern met chic yet it still has some sort of rustic/medieval feel to it. Not to mention, the outdoor seating is prime--a beautiful balcony area that wraps around the whole 2nd level of their restaurant. It's definitely an experience, especially on a summer night--perfect for people watching and just observing the lively mini Uptown area. Sadly, the food isn't on the same level (Ha, punny...get it?).The menu is on the pricey side--nothing under $24 for entrees. I was torn between the gnocchi (which I heard is heavenly) and their lamb pizza. I really wish I wasn't a sucker for lamb, cause my friend's gnocchi really did live up to the hype--it was perfectly pillowy and the parmesan truffle sauce was buttery with a sweet after note--delicious. If I was a cruel human being, I would've reached across, taken her dish, and devoured the whole thing, but instead I just nodded in awe, savoring the one gnocchi piece on my fork.My lamb pizza was below mediocre. It was more of a flatbread, with a thin layer of tomato sauce, feta cheese, kalamata olives, basil and lamb. Unfortunately the description sounded far better than the actual dish. The lamb tasted more like the kind you'd get at a cheap gyro joint, while the chiffonaded basil were skimpy and shriveled. I think I could've made a better pizza... it was completely one noted and just salty. I also sampled some of my friend's fries (she offered, I promise I'm not a moocher!) and they were inedibly salty. Usually I'll be complaining about something being too salty as I'm shoveling another bite into my mouth, but the fries were a whole other level. My tongue even started hurting. When you come to Coup d'etat, you're paying for the atmosphere. If someone were to suggest coming here again, I'd be more ecstatic to sit on the outside patio than for the food."], ["Carrie R.", "Went here for restaurant week.  Food was WAY too salty but good aside from that.  Service was good."], ["Jen W.", "The service is the star of the show here.  Without the stellar service provided by every single employee I encountered (from hostess to bartender to Kelly our waitress) I wouldn't be too geeked about this place.The space is well designed and certainly big, but not nearly as sexy as i expected it to be.  Reminded me of a cross of Stella's and 112 somehow.  You certainly don't need to dress up.Don't get me wrong, the food was good (deviled eggs, green salad, cauliflower gratin, parpardelle, carrot cake) but nothing was particularly innovative and everything was incredibly rich and heavy.  The wine list was curiously sparse; they appear to have spent all of their time on cocktails (which were delicious).All in all, a solid choice."], ["Alex S.", "If watching the bartender pour your wine in a uncleaned 3 oz rationing vessel before your glass then this is your place!"], ["Mickey N.", "When looking for a restaurant in Uptown, we decided to give this place a try.  The outside looked appealing, and I heard some good things about it.  Then when I saw the menu, I thought it seemed somewhat similar to the Libertine experience down the road.Break Down:Drinks: I had an overpriced summer sunset at $9 that was quite good, while my partner had a glass of white wine.Food: All items are meant for sharing as they are small portions.1. We ordered creamy polenta ($8) to begin, and it had a delicious garlic/mascarapone flavor.  I wish it would have been a little cheaper though for the size of the dish.2.  After that we had gnocchi ($12) and a sausage pizza ($14).  The gnocchi was rich, but good, while the sausage pizza was actually a very good serving size.  It also was delicious.I thought the inside was decorated well.  My only complaint is that it was quite loud.  We sat at the kitchen bar, and I could barely hear our server/bartender, even though she was a sweetheart.  I would probably come back here for a special occasion due to the price, but overall it a solid restaurant."], ["Michael G.", "The decor, location and style might make you think this place would be on the higher level of food quality, but in reality it was just OK.As we were just meeting for drinks, we decided to just order a few sides: the broccolini and the mussels.  The mussels were tasty if not a little watery, but the broccolini was superb.  We also had a number of drinks, and they had a great beer/wine/drink selection.The server seemed aloof and clueless, but not horrible, I guess I just expected a little more.It's a fun place in a fun area, will go back to try some other things on the menu at some point.  Still have the pizzas to check out, which looked delicious.  Additionally, they were able to easily seat our large party, and look they can accommodate parties of varying sizes quite well."], ["Mahesh K.", "This is a new place in uptown and it has been getting some rave reviews from friends and fellow yelpers. The place is huge with 2 levels of seating and the decor is stunning. The drinks are priced right given the uptown location and are also worth it because they are incredible.The food tastes delicious and the staff is friendly, knowledgeable and attentive."], ["Jennifer C.", "Only in Minnesota would critics, foodies and customers acclaim this restaurant as creative, inventive and delicious. I dined at Coup d' Etat tonight and certainly will give the restaurant points for interior design, but no more.We ordered the foie gras, gnocchi and beet salad for appetizers and the arctic char and halibut for entrees. The portions were small, food bland, garnishments lacking and service mediocre at best. I've lived around the US (New York, Chicago, Los Angeles), have traveled to 5 continents and nearly 40 countries and can say this restaurant doesn't make the top 50% of restaurants I've dined at. To pay $140 for 2 people for this was way overpriced. I'll never go back."], ["Justin B.", "I was excited to try this restaurant, but the experience left me never wanting to return.  The premium prices are not supported with premium food.  The appetizers were good and worth the price.  Our main dishes were small in size and were good, but not great.  Certainly not worth the price.  My meat came out Luke warm, which was extremely disappointing.   The cheesecake dessert was pudding squirted on a plate.  Not exactly what we had in mind.  All in all, this gets a mediocre rating.  Would suggest visiting the bar and maybe trying some dishes in the hopes the kitchen gets their act together.  The cocktails we had were excellent."], ["Irina R.", "Oh the expectations... they were so high and got slashed with every bite of the food.  With 4 appetizers I gave Coup 4 chances and it failed to win me over.  The only app that would get an \"OK\" rating would be Mussels and Clams; the rest I wouldn't order again if they were free.  Food gets 2 stars.The atmosphere, however, was great.  Lovely inside decor along with a 2 level patio gets 4 stars, giving Coup d'Etat a total of 3 stars when averaged with a food rating.I would return for drinks only, never making the mistake of ordering food again."]], "Moscow On The Hill": [], "Cavé Vin": [["Brendan T.", "This softened the blow of In Season closing since this gem is my new favorite in this neighborhood. Lovely decor and service make this a great spot. The wine list was very good and the caesar salad is the best I've had in town. The chicken entree is excellent, the char was good but not as great as the chicken. The desserts are lovely. Can't wait to come back and try the steak frites and french onion soup."], ["Brent B.", "Here's a hearty shout out to all the Yelp reviewers who wrote with candor and passion about your experiences here. Choosing to rely upon your tastes, we chose to follow your lead and go here for our anniversary dinner. This leap of faith required cancelling a revered reservation at an 'au Currant' top-five establishment. Thank you. This place is a new favorite!  The food is excellent, fresh and very well prepared.  While un-pretentious in decor, the real star is the food. We enjoyed the mussel starter, tossed baby lettuce salad and braised short ribs. I loved the pistachio crusted pork tenderloin.  Wine list leans towards France but you'd expect that here. A nice \"trip\" to France without the airfare. Prices are great, as is the service. As MacArther once said...\"We will return\"!"], ["Susan M.", "The best I can say is that it wasn't too bad. That's not high praise. The high point was the caesar salad which was fine. But the steak frites were meh. The stead wasn't great quality and the fries weren't nearly crispy enough. I've had steak frites dozens of times and have never had a filet. That's not traditional, since a filet isn't the most flavorful of cuts. In short, the place isn't very French at all. The setting was fine, but nothing special. Nor was it romantic. It looked like it had maybe been a casual burger place or even a breakfast place that had been converted to a French restaurant. The desserts were vaguely French. Just not classic or excellent.We shared a bottle of Malbec that was $38. That's not a huge amount, so perhaps I shouldn't have expected it to be drinkable. But the waiter should have offered a replacement when I took a sip and made a face. When diners leave most of a bottle of wine, it's nice if the server can be proactive. But the guys seemed merely pleasant, not old hands.Clearly, I wouldn't go back. But my friends who don't dine out a lot claimed they really enjoyed it. I suppose it's a matter of expectations. Mine were too high for Cavé Vin."], ["Brandon Y.", "Having used to live around the corner I have really wanted to try this place for years now and finally got a chance a couple of Sat. nights ago.  I'll be honest, though I've wanted to try this place for a while and have heard nothing but good things I was supposed to meet some friends somewhere else that night.  My friends live in Linden Hills and were going to head out to dinner at a local restaurant that doesn't take reservations so we called down to check on how long the wait would be and they told us over 3 hours!  3 HOURS!  I don't want to tell you which restaurant it was but I'll give you a hint, it starts with at \"T\" and ends with \"ILIA.\"  We called these folks and they were happy to accommodate us!  I am so glad we made it there.  We were greeted by the guy who we spoke with on the phone and he made us more than welcome and welcomed our friends (who just moved to the area) and I with complimentary champagne.  Service was over and above, and the food was amazing.  We started with the mussels and they were fantastic.  I definitely recommend getting some extra bread and soaking up the broth.  We were all over the board with our entrees One of us had a beef dish, one had a vegetarian dish, one had a fish dish and I had the pistachio encrusted pork loin which was cooked to perfection.  Can't wait to try this place again."], ["Nazgul W.", "We stopped in while waiting for a table at Lola next door.  We initially just planned to have a drink, but ended up ordering appetizers.  At first when we sat down at the small bar I thought we might be incongruous with the general clientele, but the employees here welcomed us warmly.  That was much appreciated.  They also didn't care that 3/4 of us ordered beer rather than wine, which is clearly their thing.  We had the Roasted Cauliflower dish, which was tasty but could've used a kick of stronger flavor.  It also was not a big dish by any means; it was gone in a minute or two.  We also had the Baked Bulgarian Feta, which was delicious.  The olive oil really put it over the top and it was creamy and sumptuous on little crostinis.I would certainly come back to try more of the menu.  I was pleased that they welcomed us so well and the place has a very comfortable and relaxing vibe.  Great service."], ["Amy G.", "Wow! I can't rave enough about this place. First time diners and we had to wait about 10 minutes for our table. No problem. We were greeted promptly, told we could get a sample of some wine which were two generous pours and upon finishing were given another bottle to pour ourselves a glass while we waited. Talk about customer love. Once seated we received a complimentary order of the best calamari we'd ever had. Not bready, just quickly seared. The moules were superb and an order of the fresh baked bread to sop up the broth is a must. Had the char and lamb chops which we shared - I enjoyed the char more but my husband swooned over the lamb. The butterscotch budino for dessert was delicious and complimentary as well since I was celebrating my birthday. The service and hospitality was impeccable. Couldn't have enjoyed ourselves more. While I give it 5 starts, the only suggestion I'd leave for the restaurant would be to go a bit easier on the salt. It was overwhelming in some dishes but not enough to reduce to four stars. The owners have done a marvelous job of adding acoustical tile to the ceiling to drown out the noise which is impressive given the tight quarters and long line of diners waiting to be seated. You have the strange sense of being  'at home' when you are dining here.... it was just a very lovely evening."], ["Alyse B.", "Amazing Valentine's Day dinner starting with the mussels. We shared the beet salad which was small but flavorful. I had the gnocchi with king crab and it was delish.. so was my fiancé's chicken parm entree. Finished with the tres leche cake for dessert. Great ambience and service! We will be back soon."], ["Darald M.", "Every time I visit this small but intimate and cozy restaurant, I'm guaranteed a meal that is superb.  My favorites include the pork loin and the salmon, but everything I've ever ordered there has been delicious!  Kudos to the chef and owner of this hidden treasure!  Top-notch!"], ["Katie P.", "Went here for my birthday.  I had the pistachio pork, my husband had the steak.Everything was good. I would say a bit over peppered for my taste, I would have preferred to taste more pistachio with my pork.   Bonus was that it was monday, half price wine night!  Ordered a Meiomi Pinot Noir, always yummy."], ["sarah p.", "How had I let Cave Vin fall off my radar? It had probably been close to a year since I'd been to this charming french bistro located next to Xerxes Market.Their steak tartare is my personal favorite in the city, although my table mates preferred 112s (I think Cave Vin's is a truer representation of the dish).We had the steak frites, the fig and goat cheese salad, mussels and hailbut with lump crab meat. everything was great, but I thought the halibut was a bit overcooked, but I'm notorious for preferring my fish more medium rare.Useful tip: On Mondays and Tuesdays they have 12 price bottles of wine."], ["Lorenzo B.", "Neighborhood gem. Steak frites are my favorite, atmosphere is very laid back yet somewhat elegant. Recommended."], ["Jason D.", "Return trip did not disappoint! We were invited to a birthday party here last year and had a great time so we to wanted come back for a date. I have to say out front I do not care for the reservation policy. You call and leave a message. You are confirmed unless you hear back. The food and experience made me forget; so I'm over it. We had a 7:30 reservation ( I recommend this; you need to call, no on-line reservations) and were seated promptly. Our server came over with menus, water & bread followed shortly after. While were we still looking over the drink menu the owner came over and greeted us and asked if we had any questions about the menu. My dining companion asked about a wine she wanted to try. He explained it was not is favorite, and offered to bring over a sample along with another she might like instead. He was spot on. The wine in question was not good and the recommended wine was good. The french beer he told me about was also good. We started with a Baked Bulgarian Feta Kalamata that was served with green olives, red bell peppers, capers, olive oil and croutons. I really wanted an appetizer and this fit the bill. I liked the saltiness of the olives that mixed with the cheese. For a salad I had the beet salad. I love beets! This beet salad consisted of thin sliced roasted beets, with cucumber, Gorgonzola cheese and Dijon vinaigrette dressing. Holy crap that was good. I combined each ingredient in each bite and they all mixed together like a symphony. Dining companion had a salad that was not on the menu; arugula and watermelon. Stay tuned to Yelp for that review. My entree was the Grilled Flank Steak served with sauteed vegetables and caramelized onion-gorgonzola-veal demi. I normally do not order steak, and for sure a flank steak. It's not my cut of meat. But when I was here last year the I had a different steak and it was fantastic so I went with it. The steak was well prepared. I did not think a flank steak could be so good. I loved it because it was kind of charred on the outside and medium rare and juicy on the inside. The vegetables served with it were outstanding. I can't describe the flavor, but I did get a taste of dill in there. The sauce on the steak was outstanding and mixed well with the veggies.  Dining companion had a pork tenderloin; also stay tuned for that review.The atmosphere was nice too. Small tables, kind of an intimate setting. There was a small child yelling when we first sat down. Kind of a buzz kill, but that not the restaurant's fault. It was lit up more then there than I remember. Our server was very friendly, and helpful when it came to ordering. We never waited long for anything and the timing on the food was perfect. If you are looking for a nice place for a \"date night\" I recommend Cave Vin.  We were going to hold hands at the table, but we were too busy enjoying the meal."], ["David V.", "Cave Vin is our neighborhood stand by.  Great food, great staff and easy to get in and out of if needed.   The salads are great as is the pork tenderloin."], ["Karen H.", "Consistently very very good food!  You must order the frites/French fries. They are light and crisp, not too greasy.  I typically don't eat fries but these are exceptional.  And they are served with an addictive garlic aoli. And in the summer the gazpacho is outstanding. The service and atmosphere is casual and friendly. Wonderful locally owned restaurant."], ["Tony T.", "Pistachio encrusted pork loin was awesome. Service was very good. Nice sized portions too."], ["Matthew J.", "My wife and I just randomly searched yelp while we were in the neighborhood and found our new favorite restaurant. The plates for the price are not skimpy and absolutely delicious. We just could not stop talking about it. I have been telling everyone I know and decided to do my first yelp post about this restaurant. The service was amazing for a walk-in and were helpful at every step. No delay in service at all, meaning every time I wanted something they were there to ask. I can not say more about this place, but just verifying all the good comments that people have posted."], ["Annie D.", "I came to Cave Vin on the wrong night. I was trying to eat lightly.This just in: French food is not light. So rather than torture myself, I got what I wanted... the cheesy, croutony, salty carmelized onion soup. Hot DAAAMN---it hit the spot.I did go lighter on my entree with a salad that seemed very much like one that I ate while in Paris (greens, roasted grapes, hazelnuts, warm goat cheese and vinaigrette). It was good, but next time I'll go for and entree... like steak frites or whatever else might be on their rotating menu at the time.I was snagged a taste of the escargot that came around during the first course. I haven't had it in a while, but I've actually eaten escargot more often than the average non-fancy pantsy person and Cave Vin's version was perfect. I agree with Melanie L that it might be a \"gateway mollusk\" for snail-virgins. I also tried a bite of dessert (not good for the eat-right plan!) and enjoyed the staff's demeanor very much.The price points are up there (entrees around $20) so I'll save this for a special date night. When that time comes though, it's good to know I'll get what I pay for at this warm and fuzzy neighborhood bistro."], ["Peter M.", "Cave Vin is a neighborhood gem and one of the most consistently excellent restaurants in Minneapolis. We support our local restaurants and dine here on a regular basis. They offer a straight forward French menu with classic preparations. Everything on the menu is fabulous, but here are a few recommendations:Bread and salted butterMussels appetizer (keep the broth for bread or frites later)Beet and fennel saladSteak and FritesPorkThe wine list is targeted and exceptional. Ask for Jeffrey as waiter, he's wonderful.Enjoy!"], ["Tucker G.", "Of course, I should state...that I was a fan of Cave' Vin before I even went.  Seeing as how it is owned by one half of the original Pane Vino Dolce...it had to be good.  And the Pecorino packets...TO DIE FOR.  They're Just like they were at P.V.D.  Perfect.Ok, ok...I've strayed.  So, like I was saying...Cave' Vin had been long on my list of MPLS spots to dine at.  Why I haven't made it can be attributed to a laundry list of unimaginable excuses.  This, I assure you.  But, upon a dear friend's invite to join in celebration the wedding of some other dear friends, I could wait no longer.Walking in, I was relieved to find the space small in size yet spacious in it's vibe.  And, dark.  All good restaurants have at least one thing in common, they're dark for dinner.  No exception here.It started with Pecorino Packets, cheese and salami plates, frog legs and steak tartare.  All perfect in their own regard.  I could have gone on to rounds 2, 3 and 4 of just apps alone...but had to man up and order an entree.  Enter the pistachio pork tenderloin:I had had this just once before, from a friend.  (his was so close in presentation I wonder if he was copying?)  To say this was \"good\" would be an misinterpretation of the sort of gibberish language that my belly speaks to itself, and occasionally, me.  I was already at FULL when this plate of pork and potatoes showed up in front of me but I knew it was a task that was not to be failed that laid in front of me.  Between bites of trying other dinner goer's meals I somehow managed to scarf all my dinner away.Somehow."], ["Kai T.", "Yes they're open!  Don't let the appearance of them being closed from the curbside fool you.  They have the best Tartar in the Twin Cities.  112 doesn't hold a candle to them.  I live in the neighborhood and eaten there 20+ times, and the food is almost always consistently very good.  Small menu, good wines, and don't forget about the mussels as a close second to the Tartar."]], "Heartland Restaurant & Farm Direct Market": [["Paul V.", "I went here for new years eve and several weeks later for a friends birthday dinner. The food was excellent both times, but the service was inconsisten-great the first time, just fine the second time. You can't go wrong with their pre-fix menue, in my opinion."], ["Jack F.", "\"The bill came... $130.36, we paid, walked out and was left thinking WTF just happened.\"It took a real terrible culinary experience to put me back into Yelp reviews and this was it. Solid 2 stars, thanks for that!This was me and the Mrs. first time here and we've been waiting to come here for a long time and we were here for anniversary. The service was OK but not great, the ambiance was amazing as we got a window seat but it was a bit loud for such a large space but the food was disappointing to say the least. Don't get me wrong, it wasn't inedible or anything but definitely not worth the price. Before we get into it, I'm comparing this to other Twin Cities restaurants at this $$$$ price point, Alma, Borough, Butcher and the Boar... Beverages:We had wine, muscato for the the lady and I had a Cab, it came out prompt and tasted fine, white was cold, red was room temp and it was not soured. Starters: A gift from the chef, it was goat cheese whip with a sliver of cracker, cracked black pepper and topped with some type of oil. It was very good! They also brought bread for each person and we had a choice, sesame or wheat. I chose the wheat as my wife chose the sesame, this was the hardest bread I have ever had. It would have been fine if it was a whole loaf, but it was about the size of a dinner roll and it had the full on sour dough shell, it was basically for a jaw warm up exercise for the big game. The butter it came with though was real tasty!Appetizer: My wife, vegetarian, chose the flora (vegetarian set meal) and course 1 was a gazpacho soup, it is served cold which is fine but pretty much felt like they served us a bowl of salsa. After thought on this, gazpacho is not the best vegetarian soup, it really needed some bite, maybe some seafood or something, seasoning was fine but I couldn't help her finish is because I didn't have any Tostitos. I ordered the bison tartare, it was paired with mushrooms which were good. As a whole the tartare was a tad of the acidic side but the crackers it came with was stale. I would give the soup 2/5 and the tartare 3/5. Main event: Flora was a porcine fettuccine, think about it... mushroom pasta, what could go wrong... everything. The pasta arrived, it was a very small portion, luckily it wasn't good so we didn't waste much. First it arrived lukewarm and there was more corn than anything. Secondly, it had zero mushroom flavor, the flavor that was over powering the entire dish was bell peppers. **I think bell peppers and celery taste like dirty towel water** So if you like bell peppers that this is your dish, not for me or my wife 1/5.      I ordered the pork chop, it wasn't good, it wasn't bad, but for $36 it was very bad. It wasn't a thick cut pork chop, minimally seasoned, just salt and pepper, which is fine and it was on a bed of green beans, peach gastric and a croquette. The peach gastric tasted like Heinz 57 sauce, which I like, plus! The croquette was good. If it was an Applebee's  I would have given it 4/5 but its not, 2/5.Dessert: I didn't even bother looking at the menu, but the Flora included one. Blueberry torte, honey granola, sorbet, blueberry coulis. This was like... like a blueberry cupcake from any chain grocery store except a cardamom or cinnamon bomb exploded all over it. The sorbet and everything tasted of it, over powering and we took 1 bite each and let it go in peace. The bill came... $130.36, we paid, walked out and was left thinking WTF just happened.I think Joe C, but it pretty well too: \"Often times the seasoning is off, the food comes out on the cool side, and while the ingredients are locally-sourced, organic, etc. etc., there's little done to highlight the purported farm-to-fork quality\"Final Words:Stay away. Its downtown St. Paul parking so it is a B, valet is $10 :( and there is so MANY other places to eat at this price point. I give this place a Solid D+ from the temperature how the food was delivered to the flavor. Either lower the prices or up the game!"], ["Becca G.", "This is a place that doesn't disappoint!I have been here a number of times over the years and love how innovative Lenny Russo is with his menu and offerings!I have to say that I'm sad that the deli went away. I loved to go in there to put together a perfect tailored lunch for me of charcuterie and other delights. It made for an affordably gourmet and nutrient-dense afternoon tickle to the tummy. Oh well, I guess some people are happier with the wine bar taking its place ;-)REGARDLESS, the food offerings in the restaurant are fantastic! Local, organic, humanely, and sustainably raised. Heartland, or more, Lenny Russo, has been a one of the pioneers in the Twin Cities to give us Minnesotans a much more satisfying and more easily-attained dining experience because of it!The menu is going to reflect the Minnesotan seasons and are always (ALWAYS) delicious. But what am I going to highlight? Prepare yourselves. The fries.I know...I know, I know, I know.Why the fries?Because Heartland is the ONLY restaurant that I've found in the Twin Cities that actually and consistently fries their fries in honest-to-goodness old-fashioned tallow! Even Julia Child's made her commentary on the fries at McDonald's not being as tasty any longer after they stopped frying in the tallow back during the '80s (tallow has a higher smoke point than the other oils). I've been surprised at how many organic/local focused restaurants in the Twin Cities who still use canola or soybean oil and say that they want to appeal to their vegetarians, too. I get that, but can we PLEASE have a few more restaurants that a carnivore can just be a carnivore? So from the deepest place in my heart, thank you, Heartland, for letting this carnivore enjoy her fries again."], ["Sarah U.", "Had the fauna 3-course meal: 4 star flavor, 2 stars for portion size. APP: prosciutto duck breast cake - 3.5 starsMAIN: beef roast w/ spinach and potato dumplings - 4 stars, but SO TINYDESSERT: mousse trio - 4 stars, loved this!Too expensive and pretentious for a HUNGRY a person. But not bad experience. Great service. Will be back to try the bar menu, much less expensive and actually has a lot of interesting items like beef fat fries!"], ["Lindsay H.", "I would have to say this is one of my fave restaurants in Minneapolis and St. Paul!Food is straight from the farm and delicious, always. But I just wanted to add quickly, THEIR COCKTAILS ARE DELICIOUS!!!That's all.Give it a try!"], ["Jennifer L.", "Stopped in on a Friday night and sat in the deli market area vs the restaurant area. We had a wonderful French Dip which came with some tasty pickled yellow veggie, and enjoyed a couple glasses of wine. The deli/wine bar area was pretty quiet and we had great food and wine and just chatted for a few hours A great place to unwind after work. My favorite happy hour in Lowertown so far. Can't wait to try the restaurant proper."], ["Wendi G.", "A cosmic dining experience. This is organic, fresh, local food at its finest. Every ingredient on your plate has a purpose on how it makes the dish taste and feel on the palate. The only thing that was not delicious or even tasty was the bread but \"oh well\" that's not what the meal is about. We had the winter greens with sweet potato crisps and bleu cheese mousse. The mousse was one of the best bleu cheese dishes I've bet tried and wanted to literally \"lick the remnants off the plate\" - lol. We also tried a very tasty grilled Bok Choy dish. For and entree we split the Trout entree and a side of roasted beets with rhubarb. Trout has a new definition and Heartland set a new benchmark. Although expensive, one must always remember the work and source where this food comes from and a meal at Heartland is worth every penny."], ["Angela P.", "Enjoyed a delicious dinner here with coworkers tonight!  Two of us ordered the fauna, and two got large plates. Among the four of us, we had beef, chicken, and fish, and all were delicious.  The bread was so good.  The desserts were fantastic.  I got the pumpkin flan, which came with candied pumpkin, and it was a delightful finish to the meal.  (I also got to try a few bites of the chocolate mousse, and it was so good that I got made fun of for how thoroughly I made sure not to leave any of it on the spoon.)The charcuterie plate wasn't a hit quite as much as our meals were (maybe it was just too fancy for us), but it wasn't bad.  Next time, I'd rather get two desserts.  :)We especially appreciated our server's wine recommendation. We wanted to get a bottle that would go well with our variety of dishes, and he spoke very knowledgeably about the different wines and where they were from.  The bottle we got paired really well with the food.The only thing that disappointed me was the fact that I was seated facing a wall, so I didn't get the opportunity to really enjoy the spacious and beautiful surroundings.  The lovely old building has high ceilings and a lot of charm.This is definitely someplace I'd love to return to for a special occasion."], ["Erin H.", "I really wanted to like this place because I respect what they do and I have heard such great things. However, our experience was one of the most disappointing I've had in awhile.First off, our waiter was not very attentive or helpful. It took an hour to order food and another hour to get it. Our server did let us know that he told the kitchen to put a rush on it, but the food was disappointing once it came. My boyfriend ordered the beef tenderloin--which our server said came medium rare. \"Perfect!\", we said. They beef came RARE. My flauna beef course was not hot, and therefore--chewy. When we asked to merely share our experience with the manager, he listened, but seemed disinterested. I wouldn't go back here based in the overall experience, and I wish it would have turned out quite differently..."], ["Grace H.", "Never been to the old location so can't compare but the couple sitting next to us said there was a more modern feel here.  The server told us they still had artifacts from the owner's farm like wood from the barn as decoration.  Our server was very attentive and took her time explaing the menu since it was our first time.  I was tempted to do both the fauna and flora 3 course but we opted to do the fauna and try a side dish along with a full entree. The lamb our server recommended was delicious.  Very tender and flavorful.  Not too big of a fan of the potatoes.  I also found it a bit odd how they tried to incorporate bok choy and chinese brocolli into the entrées since I typically just stir fry those at home.  Maybe they were trying to make the dishes more exotic but I don't think they were going for asian fusion.  Overall the ambiance was very open and friendly.  If the bill didn't end up being over $100 we might come here more often or consider purchasing ice cream from their store attached to the restaurant."], ["Noel M.", "We went here again for New Year's Eve. They were doing a special menu. You had 3 different choices for 4 course meals - a meat one, a fish one and a vegetarian one. We both chose the meat (unusual for me but it looked good). It was amazing! Not only was the food top notch but the service was excellent. Timing between courses was perfect. Server paid just the right amount of attention to us. Would definitely go back again for another holiday."], ["I'm O.", "I've had the pleasure of eating at Heartland twice and thoroughly enjoyed both visits. As you would expect from a chef who's been nominated for James Beard Awards several times, Lenny Russo delivers a beautiful plate of food every time. You simply can't go wrong at Heartland."], ["J W.", "OMG! Chief Lenny Russo is really amazing and has really outdone himself with this great concept for dining. The Food was phenomenal, the service was awesome and the atmosphere was beyond adjectives. We did the Chef's Table for our wedding dinner - Best wedding dinner EVER ! ! ! I would highly recommend this place, if you are looking for having a special dinner."], ["Elaine S.", "The ambiance was really nice and the service was good. But the food was mediocre. The bread was too hard, the food was overly salty, and for the price I expected more. My friend had the chicken and I had the fish. It was ok..."], ["Joe C.", "I've been here twice now: once for a Valentine's dinner and once for a business dinner. While the food has been fine both times, it never lives up to hype and is woefully overpriced. The deli/market sandwiches have been consistently great, which definitely bumps up the overall rating. However, the chasm between the food and the price tag bring things right back down.First of all, the ambience is great. It's unpretentious in a Midwestern woodsy way, but it's just refined enough to convey the sense that you're about to have a fine dining experience. The service is professional and more helpful than friendly, which doesn't help or hurt. The food, though, leaves me scratching my head. I'm no great chef by any stretch, but I could prepare any of the meals I've had here just as well if not better. Often times the seasoning is off, the food comes out on the cool side, and while the ingredients are locally-sourced, organic, etc. etc., there's little done to highlight the purported farm-to-fork quality. Between my visits I've eaten or sampled from five different meals, and every single one suffered from these issues. I was definitely disappointed since the deli/market side was consistently so good, so I was left dumbfounded by the mediocrity of the fine dining side. I've also sampled five desserts, and the story there is even worse. Two of them were left alone after just one bite, and the other three were unremarkable. Best just to avoid these.If the food were 30-40% less expensive I might not be so jaded, but both times the bill came I felt like I'd been duped. There are many better meals to be had in the cities at this price point. I won't say don't bother, but I sadly can't recommend Heartland and won't be going back."], ["Andrea T.", "We stopped in for a quick supper before a jazz set. There were not many options in the area and Heartland boasted valet parking which killed two birds with one stone. The space is really interesting, a little drafty, but definitely enjoyable. Their homemade bread is out of this world, but filling in a way you aren't dying for another piece. Which is saying a lot since bread is one of my favorite food groups. I had the ryewitness cocktail which is a smoky old-fashioned made with michter's rye. If it's on the menu order it! if it's not see if the bartender will kindly oblige you. I'm a snob for old-fashioneds and this was one of the best I've had in ages. My beau had drink-envy he tried a beer he had never heard of. We shared the beet salad which was perfection and very well suited for sharing. A red and pink beet with a poached pear and some charred cabbage. We shared the whitefish which was done perfectly. A lovely crisp skin, but fork tender. Served with summer squash, garbanzos and a light and slightly tinged with vinegar broth/sauce. We also had a side of the cauliflower with romesco sauce. The cauliflower was purple, green and white and roasted. The cauliflower was just heavenly. I could have eaten several portions of it! My beau commented it was one of the best meals we have shared in awhile and I wholeheartedly agree. Definitely a winner!"], ["L J.", "Two stars for the service. My dinner mate and I were here over the weekend.  We had a reservation and were seated right away. Our server acted like we killed her dog. She was inattentive and did not listen at all. On top of that, she must have forgotten to put our food order in or left it sit because we waited over an hour to receive our entrées. Every meal item was so slow to come out it was like they were growing the vegetables right then. Even my dinner mate's one glass of wine took forever. Additionally his food was room temperature once it finally arrived.I really wanted to like this restaurant. My meal actually was very good, and it's just too bad the service was so terrible. We did speak to the manager, but she seemed somewhat dismissive. We received a free dessert, but it really did not make up for the disappointing experience. Also, even after we complained the service did not improve at all. I'd like to give them another chance, but if we have the same awful service again....grrrrr."], ["Jon L.", "I had very high expectations for this place.  My wife and I went for our anniversary during the middle of the week (it is not cheap).  We got there shortly after opening and got a nice window seat overlooking the farmers market.  The menu's can change daily, so checking ahead can be a hit or miss.We asked the waiter for some suggestions and he plowed through his scripted response in about 15 seconds.  OK, efficient, but not the warmest vibe.  I settled  on the Angus beef strip steak and my wife the Yellow perch.  We ordered the Mushroom soup and a side of Asparagus to share as well.  The place remained pretty empty while we waited on our dinner.  The Mushroom soup came out first, it had a thick brown broth that resembled gravy.  It had a dollop of mushrooms, potatoes and scallions in the middle.  The soup was wonderful, very creamy and the mushrooms added the little extra punch of flavor. The  Asparagus came out with the meal.  It was covered in a white sauce with a slice of ham over it.  The taste was terrific and the ham added a little extra to the overall flavor.  The only minor issue was that the Asparagus could have been cooked a little more.  The stalks were a little to tough.  The main meal was very good.  The steak was done medium (asked for medium rare), but otherwise very good.   The cut potatoes had a distinct flavor that I absolutely loved.  They were nice and crisp on the outside and perfectly done in the middle,  The greens were wonderful as well.  The sauce that was part of the meal just multiplied the goodness of everything.  Great job!  My wife was very pleased with her meal as well.Overall, the food was very good!  The server seemed a little to aloof for me even though he knew it was our first visit.  He could have been a little warmer and more interested in being helpful.  He also was not as prompt at returning to our table even though the place was pretty quiet.  He assumed we did not want desert (which we did), and it seemed to catch him off guard to have to retrieve the menu again in order for us to order desert.Overall:  Food - 5, Service - 3  We will come back to give it another shot."], ["Gretchen B.", "Heartland is an amazing premise. Upscale dining, local, organic, farm direct market, everything prepared onsite. Ultimately, however, I didn't enjoy my food enough to justify the price.I went with my mother, and we have fairly different tastes, but neither of us were as satisfied as we wanted to be. The menu changes daily so I don't want to harp on my dishes too much, but they just didn't taste good to me.The atmosphere is spectacular, and I love Lowertown. The service was great, our server knowledgeable and just attentive enough. I always say that I'll try any place twice, but given the pricey menu, it might not be worth going to a second time."], ["Michelle B.", "From a vegetarian standpoint, this place is awesome! They have mostly meat dishes but it's rare to see a well-rounded vegetarian menu at a place that also caters to carnivores. Delicious! Give it a try."], ["Suzanne B.", "Heartland gave me that warm, cozy feeling that you get with satisfied taste buds, belly, and soul.  From the welcoming fires and hearths to the impeccable fusion of flavors, this is one place not to miss if you're in downtown St Paul and looking for a culinary adventure.  I was lucky enough to have a sampling menu when I visited recently, and my meal included Rainbow Trout, Chicken Breast, and a dessert with Poached Pears.  The menu changes daily depending on what fresh ingredients local farmers bring, but these were some of the selections on the night that I visited.  The meal was a feast for the senses.  Everything was exquisitely prepared and visually presented to be appealing.  Both my eyes and my stomach enjoyed each new plate as it was brought out.  I think both chicken and trout are fine at most restaurants, but I would absolutely recommend either to anyone wanting a recommendation at Heartland.  I can honestly say the chicken was the best piece I have ever had in my life: flavorful, juicy, and accompanied by perfectly cooked root vegetables . . . it was divine.  Adding to the enjoyment of the meal was an exclusive tasting pairing from a local vineyard, with each wine carefully chosen to complement the flavors of the food.  It's apparent that the chef enjoys and takes great pride in Heartland.  You can taste the care and passion cooked into every item at the restaurant, which is something I can't often say about eating out at a restaurant.  If you haven't been yet, make Heartland a dinner destination in the near future to experience what it's all about!"], ["Kristi C.", "I dined at the former St Clair Ave location several years ago and I have to say I REALLY prefer the Lowertown St Paul location and the beautiful interior of this space.  Also, I happily endorse the Farm Direct Market connected to the restaurant, always finding unique and local selections to take home.  Good move, Heartland!Service was top notch and so was everything served at dinner.    The Sweet Potato and Black Bean salad was lightly dressed with a vinaigrette.  The Steak Tartare, which was on the \"small plates\" menu, was perfectly proportioned if you're looking for a light dinner."], ["Amanda H.", "My experience wasn't horrible but it wasn't great. I thought it was overpriced but was still delicious and the wine was good (would be nice to just have a cocktail in the bar) It was freezing in the restaurant and I wasn't sure what to think of our waiter.. he was brash and kind of arrogant but talkative and funny. I'm not sure I would go back again."], ["Sue S.", "I generally think of myself as an independent thinker, but I have to go with the flow and offer a five star review here...Took my inlaws to Heartland to celebrate their anniversary and had a foodie-tastic time. This is totally the right place to let your inner foodie out. I personally got the prix fixe three-course option, which was composed of the most amazing pork medallion I've ever had (cooked PERFECTLY), a beef entree and a lovely panna cotta dessert with homemade biscotti. We're a sharing type of family, so everyone basically tasted everything that everyone got, and it was all pretty amazing.Two extremely minor criticisms: The beer snob in me wished there were more beers on tap (though the bottle selection was passable), and I thought they might have done a slightly better job explaining some of the fancy foodie terms on the menu for people who don't dine this way all the time (you, know, the common folk). I was OK but some of our lesser foodie companions had a tough time without a bit of translation help.All that said, a pretty amazing and outstanding meal."], ["Breena E.", "Everything about this place is beautiful, from the interior of the building to the flavor combinations on the plates. This is easily the best dinner I've had since I moved to Lowertown.I don't understand some of the yelp reviews that  complain about small production liquor (what did you expect in a farm-to-table establishment?) or the prices (again, you are paying for local, sustainable food served to you by wait staff so attentive that they fold your napkin, should you get up to use the restroom leaving your napkin in a flopped lump on the table). Though it isn't cheap, it is certainly worth what it costs.To start, I had the heirloom tomato and watermelon salad; the flavor combination of the herb puree, the goat cheese, the tomato, and watermelon was so fresh and so light, it was wonderful. It was a great choice starter for my main plate, the whitefish (on which the kohlrabi slaw just shined). My husband had the fauna choice and was really impressed. The presentation of the dishes was lovely. He said he was perfectly satisfied, not over-stuffed, just nicely sated.We both had some of their cocktails, all of which were strong but very smooth. I can't recommend them enough. I look forward to returning, and as their menu is constantly changing, can't wait to try what's next!"], ["Terry W.", "We really wanted to like Heartland, but after two disappointing dinners have scratched it off our list. The food presentation and taste never matched our expectations."], ["Abe M.", "I must admit, when I looked this place up online, I had my doubts.  It looked expensive and with expensive places, sometimes the quality is hit or miss as well as the quantity, luckily this wasn't the case. I love the fact that they incorporate local products into their meals.  That is a big plus for me.  I ordered the Midwestern cassoulet, which is a traditional casserole.  The lamb sausage in it was delectable!  The sour dough bread was good, if not a bit hard.  The Heritage potatoes were piping hot (temperature wise) when they came out.  These were supposed to have a bit of a kick in them from the jalapenos, but it must have been minimal as I could hardly taste the spiciness.  The size of the meal was perfect.  Not too much and not too little.  I didn't feel stuffed after-wards, but full.  In the end, I was happy about that.  I ordered a couple beers and the variety was good.  They had some good local craft beers (yet another plus).  We didn't sample any wine, but I was impressed with their wine list.  Keep up the good work Heartland!"], ["Surly M.", "Food was great but not memorable. What WAS memorable was their specialty (amaro?) manhattan.  They serve it on the rocks but do yourself a favor and order it straight up.  It was SO delicious and very unique. I knew it was going to be good when I saw it was garnished with dried cherries and not the food colored crap you get most other places. I switched to wine for my entree but secretly wished I had ordered another manhattan."], ["G. M. A. S.", "Regarding the market Only:Came this Sunday. New to Lowertown from another more expensive city's urban neighborhood. Just happened to walk by.My thoughts on the experience:Pros: nice selection of produce goodies, including hot peppers. Good meat selection, some very well priced. Pretty friendly and helpful staff. Bakery goodies were great. Went home with a sugared doughnut that had baked in apples and cranberries. Yummy! Great little neighborhood savior when you realize you need another ingredient to round out dinner cooking at home. Don't fault them for somewhat limited fresh produce selection as they are a local market, seasonal to the locale.Cons: The canned fruit and veg products are eye raisingly expensive compared to similar product in former pricey city. Some of the meat products also expensive."], ["Mindy A.", "I thought Heartland was excellent. Everything, from the service, to the building, decor, beer list, and most especially, the food, was excellent. It's reasonably priced for the high quality you're getting, and they have a great selection of Minnesota-centric options. Actually, I think everything that could be made or grown or raised or brewed in Minnesota was.I loved the idea of the flora and fauna menus. I selected the flora, my husband had the fauna, and our dining companions had a la carte selections. Everyone enjoyed their meals, but I especially liked the creativity of the flora options that evening - interesting ingredients, well-prepared, and simply presented.With all our meals, beers/wine/cocktails, a cheese plate, and coffees, the total bill was just over $300.We had reservations for a Friday night, but they were not necessary as the restaurant was only about half full.We were there late and didn't get to check out the market, but I'm sure it's amazing!"], ["Michelle L.", "We went to Heartland before a play at the Ordway last Friday night and left feeling very disappointed. The ambiance and overall feel of the place is somewhat empty and sterile (I'm sure it didn't help that we were there on a Friday night and it was not even half full). On to the menu.... while the food wasn't horrible (it was good not great), the overpriced menu was extremely disappointing for what you get. My husband and I both ordered drinks which were both fine. I had the prix fix menu while my husband had the trout and asparagus.  The food was fine on all ends, but when you're comparing the Heartland to similar caliber restaurants (and prices) it just doesn't measure up. I'm bummed to say this, because I was so excited to go here, but we will not be returning any time soon (unless someone else is paying)."], ["Jeffrey S.", "not sure about the below review but had a fantastic dinner in the bar area last night.  attentive bar staff and Lenny's personal recommendations enhanced the cool, warehouse atmosphere.the food was amazing!  venison burger was extremely tender and the trout was prepared well, and a generous portion at that.  the chicken breast had nice flavor, not overpowering, and again ample portion.  everything on the table was delicious, including the wheat bread and butter!we will be back for our rehearsal dinner in July!(check out the reviews for heartland under the grocery store listing...most of these are for the restaurant and reflect our experience.)"], ["Meggan A.", "I stopped in here for a quick lunch on the go per a recommendation from a friend. I'm so glad that I went!! I've lived in the neighborhood for awhile and had yet to venture in for fear of the prices. I'd heard through the grapevine about the dinner prices so I was skeptical for what lunch would hold. It held a pleasant surprise!Their offerings change daily. A few selections of sandwiches and hot items. I had the black bean and cheese sandwich with salsa and lemongrass pickles. It was made in a panini press and was absolutely divine. A+ for those pickles!!!! Choice of side includes chips, cold salad, or warm side. I went for the cold salad of beets, broccoli rabe, and radishes in a vinegar dressing. A+ again here. The salad was lightly dressed and full of flavor.The man behind the counter was more than helpful in explaining what was offered when I explained it was my first trip in. He was efficient in preparing my lunch and made sure to ask if I needed anything else, including silverware, napkins, and a bag. I went for a oatmeal raisin cookie for later.I was ready for what I assumed would be a large bill as the cookies were not labeled and I figured this is where they would get me. This was not the case and my lunch came to $9 which is average and more than fair for the quality of what I was provided. Way to go Heartland!! You made a new customer out of this picky gal!I would have provided 5 stars if their sweets selections would have provided a vegan option. I was hoping to bring a sweet treat to my friend who had recommended them but they unfortunately did not have one. It appeared that they typically don't and I would love to see at least an offering or two that is vegan."], ["Becky K.", "Went here after I saw it appeared on Eater's Top 38 restaurants to visit in 2015. I wasn't impressed. I did the Flora version of the tasting. First dish was an asian inspired soup. There were chunks of some kind of root vegetable in a dish and a clear-ish broth was poured over top. All in all it was sort of bland. For the main dish it was a tortellini. I am forgetting the filling, but it really didn't matter since you could barely taste whatever was inside. The pasta was cold and not tender, and honestly didn't taste freshly made. Accompanyments were bland as well. My BF ordered the linousine beef tenderloin. While he enjoyed it, it wasn't anything particularly spectacular. We shared my dessert which was a ricotta filled crepe. This was served cold, which was odd for a crepe. The atmosphere of the place is ok, but the high ceilings made it drafty on a very cold night, and honestly I found it not very inviting. Also our waitress didn't know anything about the dishes on the menu,  which I can forgive if the food is awesome. But it wasn't. Won't go back."], ["Victoria L.", "Came here for a date night when I first got into town because it was close and I love farm-to-table restaurants. The service was perfect. The atmosphere was probably inoffensive, since I don't remember it. The food was very good. Very, very good. My gentleman friend got the \"fauna\" prix fix, and I had the \"flora.\" The fauna involved a rainbow trout appetizer, elk, and a chocolate ricotta cake. The flora started with a chickpea cake salad, then eggplant pasta, then upside peach cake. All of it was delicious and beautifully presented (I didn't care for the elk, but I'm not a big meat eater, so that was probably me.) The portions are seemingly small, but actually perfect--it's exactly right for a three course meal so that you don't leave feeling over-stuffed. However, it was a little too expensive for what it is, hence not five stars. However, this is the kind of place I might come back once a season to see what they're up to, because everything is so nicely done. As someone else said, however, it would be ideal if it was someone else doing the paying..."], ["Michael A.", "Fantastic place - butcher shop downstairs.  Lots of game on the menu.  The building itself is an old warehouse, very nice and plenty of space.Everything is seasonal, organic and made from local ingredients. Also had a mind blowing Black Pepper IPA from a Milwaukee brewery and some stupendous Pinot Noir from Oregon. Excellent and knowledgeable service to boot.I drove way out of the way for this and it was well worth it."], ["William G.", "The reviews of Heartland exhibit a lot of variability around the mean.  Most reviewers seem to love it or hate it, and I was interested in seeing for myself. I went to Heartland with a group of six on a recent Tuesday evening.  There were very few customers, only one or two other tables were occupied.  The interior of the restaurant is dark and cavernous and the lack of people gave sort of an eerie, late-night bus station feeling. The ambiance is probably better with a crowd. We were seated promptly and our server was very knowledgeable about the menu and attentive but not overly so.  The menu is not large; there are a couple of prix fixe menus (vegetarian and non-vegetarian), a couple of soups, some salads,  and for the plat de jour fish, cassoulet, pork chop, and chicken, as well as a few sides and deserts.  At the urging of our server, four of us chose the pork chop and the other two had the cassoulet and the chicken respectively.  The chef emphasizes seasonality, flavor, and texture but not variety and presentation.  In fact the food is rather plain so I can see how someone going to Heartland expecting the standard \"fine dining\" experience might be put off.  Also the prices are pretty high.  This might explain the negativity of some of the reviews.  I had the split pea soup which was served with a generous garnish of locally produced prosciutto.  I thought that the soup was a success.  The peas were not over cooked and had a nice tooth feel and the prosciutto added a smoky note.  The whole effect was somewhat earthy which is appropriate for the season and this dish.  I thought the pork chop was less successful.  It was grilled, bone-in Duroc pork served on a bed of root vegetable with a tomato coulis.  The pork was somewhat dry and tough.  I buy Duroc pork chops regularly at Byerly's and fix them at home and to me they are better, just as flavorful but not as tough.  I did not think the coulis was successful; it was much too sweet - almost like ketchup.  For desert I had the chocolate pot de crème.    This was very good with a poached pear garnish which I particularly enjoyed.  The bread was a mystery to me. As other reviews have commented, it is extremely tough.  I found it difficult to tear and chew. I guess I don't see the point. I noticed no one in our group accepted the offer of a second.  Our group seemed to think the food was fine.  Personally, I would probably not return.  When I dine out at these prices I am looking for something that I cannot or will not cook at home - a new experience. I am a pretty good home cook and I could have done a reasonable job of replicating my dinner, except for the pot de crème, without too much effort and a fraction of the cost.  That said, if you are looking for the experience that the chef aims to provide you will probably like Heartland."], ["Jennifer S.", "Review of their Farm Direct Market.We came to this place on Saturday evening after participating in the St. Paul Lowertown Art Crawl, wanting to see what looked good to possibly bring home to have a porch picnic.  Under their deli counter they had quite a nice selection of meats, cheeses, and a few pre-made salads.  One salad in particular looked freshly made; and it was.  It was also very good (we got a sample of it).  So good, in fact, that we bought some to include it in our post art-crawl porch picnic.  And the loaf of natural sourdough bread I bought was outstanding, albeit cost $5.  In their freezer, alongside pint containers of Izzy's Strawberry ice cream for $9, were pints of ice cream, sorbet and frozen yogurt made my Heartland (for $8).Want a container of pork fat or duck fat?  They've got it.  For $12 each.  They sell some local honey, homemade jams and catsups.  They've also got fresh produce attractively displayed in open bins.  Loved the look and feel of this shop.  Also enjoyed the friendly and informed service we received from the woman behind the counter."], ["Jack S.", "The smallish bowl of cassoulet came with about one inch of browned crackers on top. After having some and removing most of the cracker meal, I expected to find the broth, beans and a variety of the promised meats and sausage. Instead there was a matrix of more congealed grains with a few indistinguishable pieces of meat. Any broth had been absorbed. $28 for this?  Major fail."], ["Katie F.", "Absolutely delicious in every sense of the word. Great wine list. Fantastic service. Heartland is the perfect place for a romantic dinner."], ["Kelsey K.", "After my trip to heartland I am a bit in love! I adore that they are passionate about farm to table eating..and they make everything but the cheese in house! How awesome is that! Their farm to market area was a hit! We picked up fresh and prepared items as well as 2 different kinds of canned ketchup. Everything was really reasonably priced which mad it even easier to bring things home to enjoy later. Dinner was top notch! Waiters were terrific and the food was so very thoughtful. We had a red gumbo that made me want to lick the bowl and my picky boyfriend also was super impressed. They gave us options of bread that were brought around and handed out individually which was nice (glad they aren't wasting food). My tenderloin with puree and sauce was as perfect as I can remember a entree being. It was just lovely...the most silky puree and sauce that made me scoop up every last bit. Meat was perfectly cooked. The BF had fish that was so crisp and fresh! I grew up on the lake and have had great fish but this might top them all. Dessert included a local grape sauce that was everything you would hope local food could be..in season...delish...and happy making. We also met Chef Russo and he was more than terrific to speak with...what a inspiring man! Really perfect night. A few things to note..many people were super dressed up but we came straight from a 5 hour drive so a little less fresh and everyone fit right in.Also my parents talked about thinking about going here a few weeks ago but not going because they were worried their wasn't enough options....let me reassure you that it isn't about what you get...because everything will be amazing. Let Chef Russo take care of you."], ["Karen S.", "What a great way to spend your last night as a 34 year old.  Seriously one of the best meals I've ever had.  I really didn't pay attention to the lovely space and ambiance because I was seriously digging the food.  Wow.  You know how to get me to love your restaurant - bring around a basket of fresh bread and sweet butter.  You know how to get me to really love your restaurant, serve me such good food that I only eat one fresh roll instead of  5.2 of us shared an app, each had an entree, shared a side, shared dessert.  Perfect amount of food.Curried veggie fritters appetizer.  Spicy, flavorful.  greens with some roasted shallots on the side were a nice touch.Pork chops with fingerling potatoes, mustard sauce and homemade kraut. for dinner.  Normally not a huge pork chop fan, but these were outstanding, perfectly cooked (not dry at all) and the sauce was perfect, not too salty, but really flavorfulBF had trout with fresh peas.  We shared roasted root veggies in a honey mustard sauce (way more honey than mustard).  A little too sweet for my taste, but was perfect for sharingCardamom pot de creme for dessert was the perfect ending to the meal.It's no wonder Lenny Russo was a James Beard nominee.  Really wonderfully prepared food, very tasty, and a great meal. Will for sure be back!"], ["Kim R.", "We had an amazing anniversary dinner at Heartland last night. After attending a membership meeting for the Saint Paul Chamber of Commerce at Heartland and hearing about how they only use local ingredients and make absolutely everything from scratch (including soy sauce!), I couldn't wait to come for dinner. There aren't many restaurants in MN that use strictly local ingredients, to the point that they don't even use olive oil at Heartland because you can't get olives locally, now that is commitment!The menu changes nightly depending on what ingredients they can get, so you will always  have something new to try. We started our meal with the amuse bouche of a savory zucchini bread with mascarpone whipped cream. It was an amazing little morsel of food. Our next course was the cheese soup with roasted broccoli. This was like a fancy, gourmet version of broccoli cheese soup. There was a great depth of flavor and it was perfectly creamy. I must also note that Heartland has impeccable service. We mentioned to our waitress that we were going to share the soup, and they split it for us into two bowls; such great attention to detail really makes the experience more memorable.For my entree, I ordered the whitefish and my hubs ordered the Duroc pork chop. I thought the fish was phenomal. It came with a wild rice crust and was topped with bok choy and cucumber. I normally hate cucumbers, but not these cukes, they were great! I had a bite of my hubby's pork chop and it was excellent, perfectly moist and served with a rich sauce made from their homemade soy sauce.Another nice touch is that the waitress actually came over to our table with a large bread basket. You don't see that too often. I had the wild rice and flax roll and it was excellent. Perfectly dense and it had great flavor. Even the butter tastes better at Heartland.We walked over to the market after dinner and picked up some homemade raspberry jam and a few cookies to bring home for dessert. The chocolate thumbprint cookie with chocolate ganache was excellent. Moist with a little crunch and the perfect amount of rich ganache.Heartland is definitely a winner and the perfect restaurant for a special occasion."], ["Suze S.", "The Man had some relatives coming in from California. They are quite snobbish and requested \"an upscale place with unique Minnesota flavor. Or something French.\" Well, the other half of the group that was coming threw a fit and refused to come if we were going to a \"French place.\" Sounds like Heartland to me!It ended up being a great choice. The atmosphere was perfect, we had a large table at the window overlooking the Farmer's Market, and service was great. The California folks were suitably impressed, and raved over the bottled wine prices.The food was terrific- everybody was ecstatic with their food- except me. I had the Gnocchi and the texture/flavor was great but the portion size was more like a half-portion. I was still a little hungry after eating it all and licking the plate... Which made me a little sad but then I got to eat off of everyone else's plates :)Everyone else had only good things to say about the food and their servings!"], ["Lindsey W.", "I had dinner with my husband and overall was very impressed with Heartland.  It is definitely one of the best meals I've had in the city.  I love that the menu changes nightly and you can always find something new in this restaurant...genius!We started with some great cocktails, the bartender was kind enough to make me a Moscow Mule (my favorite summer drink) and my husband had his standard Makers and water.  We started with 2 small plates.  The first was a pate served on mini crisps infused with blue cheese, pickled beets and a delicious ramp chutney.  It was honestly one of the best bites of food I have eaten.  The flavor combination was perfect.  Our second small plate was elk tartare.  Both my husband and I love steak tartare and we knew it would be slightly different.  This tartare was very lean in comparison to your typical steak.  It had good flavor and was served with crispy bread slices.  The only thing it lacked was seasoning and the table did not have any salt and pepper on it.  I know that you're a James Beard nominee chef however salt and pepper should be put on a table, I don't care how good of a chef you are, the customer should be the judge.  We moved on to the main portion of our meal and ordered a bottle of pinot noir.  We had the Evesham Wood from Oregon and I would not recommend it.  It was just a flavorless bottle of wine and I'm honestly a little surprised it was even on their menu.  For entrees my husband got the sirloin which was cooked perfectly and I had duck with a barley and fresh vegetable medley.  Both entrees were flavorful and really great!  For dessert we shared chocolate torte with caramel curry sauce and both had espresso.  The dessert was okay and not super memorable.  The curry flavor was a little overwhelming for a dessert and just didn't end the meal exactly how I had expected.  We also were not served any sort of sugar with our espresso, I don't know about you but I need a little something.  I typically drink my coffee black but drinking that black was a little tough.  Again, it would have been nice for the dinner to have the option instead of the restaurant making it for us.  It seemed like the type of place that it would have been completely rude to ask for...so we didn't.  I would possibly go back but the few hiccups in the meal were some what unacceptable for the $215 we spent on dinner."], ["Katrina H.", "I don't give five stars easily, and I wish I could give 10 stars for this restaurant!  We had SUCH an amazing experience.  The interior design is lovely, atmosphere is nice, drinks are creative delish AND a reasonable price, and the food...oh my gosh.  We decided to be a bit adventurous and weren't disappointed.  The food is beautifully presented, use creative ingredients and are farm to table.  My steak was not done to my satisfaction, and it was quickly replaced and done perfectly.  The staff was attentive and the chef came out to make sure everything was to our satisfaction.  Handing out amuse bouche and rolls plus the quality of the waitstaff made spending the money SO worth it!  The next day we were still talking about our meal and planning our next trip there."], ["Adam S.", "Overpriced for what you get.  The food was okay.  I've had much better at other restaurants in the twin cities.  I have been to Heartland a couple times and it seemed better a year ago.  My money would have been better spent at the Bachelor Farmer to get farm-to-table food."], ["Adam W.", "This update highlights the Farm Direct Market attached to the restaurant. Look for produce, meats and fish from the restaurant's purveyors (all local and all fresh), house made soups/stocks/preserves, and pastries (also made in house). Recent highlights have included house made pickles and ketchup, as well as some fantastic trout. You can also get a sandwich made to order, and/or a cup of Clover coffee. The FDM is a great add-on stop to your Farmer's Market visit, or as a destination for something good to cook or eat on the go."], ["Alison T.", "Heartland's new Lowertown location is hugely successful.  They really brought up their level of sophistication with an open, spacious lounge and a separately enclosed dining room.  We had a fantastic meal last night.  We opted to order ala carte rather than selecting the prix fixe menu.  I started with the Duck Terrine with hazelnuts and shallot jam, which was extremely flavorful.  My main course was the Duck Breast with Barley and Root Vegetables.  The duck was prepared very nicely with a lovely crispy coating.  The absolute standout of the dish was the Barley, which had such a depth of flavors that I could have eaten it as my main dish!  For dessert, I had the Chocolate Hazelnut Gateau topped with raspberry sherbet.  The cake reminded me of a melty Nestle crunch bar baked in your favorite chocolate cake.  The hazelnuts were perfect.  The only snags we encountered last night were in the poor service from the host and the frantic pace of the bar.  We didn't get our first drink for at least ten minutes.  Nevertheless, given the overall atmosphere and excellent food, this is now one of my top picks for dining in St. Paul."], ["Mariel J.", "Our wedding rehearsal was held at Heartland. We chose it because it had amazing food, and also had two options for large, private rooms. This was really nice because you felt as if you had the whole restaurant to yourselves - you could wander around and talk, and we were able to make announcements and give our wedding party gifts without disturbing anyone else.It was also an awesome opportunity for our out-of-town guests to try some really great Midwestern-inspired food - all of the dishes were very well prepared and really tasty, and the wine pairings were great!"], ["Dan B.", "There is a place you can go all year round to get farm fresh produce, and locally produced meat and cheese. Mid-January when I want something fresh I head over to Heartland Restaurant and Farm Direct Market.My wife and I love Heartland Restaurant. Creative menu using fresh, regional ingredients and some of the best hand-crafted cocktails in Saint Paul - What more could a guy want? But I wanted this review to focus on the market attached to the restaurant.This place has just about everything you could want to plan a create a fabulous meal. It's a green grocer, butcher, bakery, dairy, fishmonger, and coffee shop all rolled into one.They also have a hot food counter with selections for lunch and dinner. Today, I had two curried pork and potato cabbage rolls and a chocolate whiskey cookie. The cabbage rolls were excellent, but learned they're not street food. I tried eating them as a walked the streets of Lowertown and ended up with a stained shirt. The cookie was moist, gooey, and made me wish I had bought a few more.Having access to this fresh meat and veggies all year round is great, but I think I enjoy all the products that Heartland makes with their offerings even more. They have house made charcuterie, jams, stocks, soups and butter. Mmm butter. My favorite is the vast selection of pickled and jarred options. From pickled eggs that help cure a hangover to the absolute best sauerkraut I have ever had, Heartland does a great job of making their great products accessible to the public for use at home.The staff is very friendly as well, and completely knowledgeable about their products. It's the kind of place you can walk into and have the staff help you put together all the ingredients to create a great meal. Unfortunately, they won't follow you home and prepare it!"], ["N S.", "2 words: CHOCOLATE CROISSANTS. Get 'em before the lady who dropped in 5 minutes before you buys the WHOLE BATCH of them for her officemates and breaks your heart into a million pieces and you'll be thinking about chocolate croissants all day long before you give in and go to that place in the skyway that also has chocolate croissants that aren't nearly as good and it's.....so not the same. Or if you're really unlucky, you'll go to that place in the skyway for not-as-good chocolate croissants but they'll be sold out too, and so you settle for a chocolate chip cookie instead or a hot chocolate from Caribou or something because you Just Need Something Sweet but alas, it's winter in Minnesota and you just lost out on the best chocolate croissants ever and you had to step out of the skyway into the arctic cold to boot. Please, don't be that person who buys ALL THE CHOCOLATE CROISSANTS unless you are planning to share - with me."], ["Meghann F.", "The food was delicious - and the restaurant is in fact beautiful.  Very simple and yet elegant.  I ordered the Fauna tasting menu - the flora looked really delicious as well.The rainbow trout melted in your mouth.  The 2nd course was chicken with root vegtables - prepared perfectly.  It tasted amazing.  The dessert was good - it was a pear tart with ice cream and sauce - I don't remember the details of it - it was probably the weak point though if there was one . .. but then again, if its not chocolate - its not really dessert ;).I would like to come back and try more of the bar menu - which looks delish and a little less spendy.We also hit up the grocery next door - I got some soup to bring home - haven't had a chance to try it yet - and also a brownie - which was amazing and exactly the dessert i was looking for!!"], ["Gwen J.", "It was incredible! To start out, our waiter brought us each a sweet potato chip with an amazing dip/cranberry.  It may have been the highlight of the night.First course: Beef Tartar.  It was a unique prepartion with the egg white and egg yolk cooked in a sauce type side to go with the beef tartar (as opposed to raw in the beef).  It was amazing - reminded me a little of devlied eggs.Next we split the Pork Chop and the Cassorle.  The pork chop and the root veggies that came with it were in a sauce that I want to put on everything i eat! It was incredible. Made me want to like the plate.The Cassarole was delicious as well - there was rabbit confeit on top - so tender, so delicious!We ended with the cheese platter.  The blue cheese was to die for!Cant want to go backGwen"], ["Mike W.", "On the spur of the moment we decided to see if we could get a table at Heartland this past Saturday evening.   We must have done something right as we were told if we could get there in the next 15 minutes we were good to go.   So we jumped into the car and headed down to lowertown.There is not much I can say about Heartland that has not been said already.  The food was outstanding and creative.  Some of our part had the pre fixed Fauna menu while others mixed and matched.   Everyone loved what they had and walked away with full happy tummy's.The only reason this is not a 5 star rating is the service.  Our sever seemed a bit distracted, even though it was fairly early and things were not that busy yet.  It took 15 minutes from the time we were seated till our drink order was taken.  When we asked questions about the menu items, she could not give an opinion on which was a better option, only responding that it looks really good/. Huh?  really?  Come on, you could at least make up something generic.  Would I go back?  Yep, but next time on an expense account."], ["Lisa K.", "Great food.  The trout was delicious, as was everything it was served with (see menue).  I ate the whole thing, yet didn't feel stuffed.  My husband had the fixe combo that included the beef.  He really liked it and the presentation was excellent.  My mom had the chicken and liked it very much.  The tomato soup is very good and makes an excellent starter on a cold winter night.  Great wine menu.The atmosphere is relaxing, set in an old factory (?) with huge exposed beams, yet modernized with lighting, furniture, etc.  I'd definitely go back next time I'm in town."], ["William W.", "Pros:Great foodWaitstaffWineCons:Small portionsPriceThe food was fantastic but I feel like if you spend 100+ you should not leave hungry.  My group went to the bulldog and we all at wings after eating dinner."], ["Geoff S.", "I heart heartland. I may be a bit biased because I used to live across the street and used to grab a cocktail while my dinner was in the oven. But seriously, this place is excellent. I am a fan of the fixed price menu because everything compliments each other very well and sometimes I think the best decisions made are the ones made for me. Dishes are simple and small, but excellent and well-done. This is really what dinner should be. You are supposed to leave not because you are stuffed full but because you've had a wonderful meal with great friends, excellent service, and in a beautiful building. I love Lenny Russo. He takes an active role in the operations of the restaurant and is very committed to Lowertown, which I really appreciate. I could very easily classify this as my favorite restaurant in the twin cities."], ["Katie W.", "I really wanted to like Heartland--no, I really wanted to love it.  The restaurant has everything I want--a nice, comfortable atmosphere, farm to table food, a talented chef,  what's not to like?  First off, the menu is small.  Yes it changes frequently, maybe even daily, but the choices are limited.  Okay, I've been there three times and I've always managed to find something to order.  Last time we ordered sunchokes as an appetizer and we waited to close to an hour for them.  When they arrived they were almost inedible.  Still very hard and bitter.  The main course arrived about an hour later--seriously slow--but it wasn't that busy!  We had planned to go to a late movie, but ditched the plans when it was clear we wouldn't be out of the restaurant any time close to the start of the movie.  We filled up on bread because we had been there for quite some time with only stupid, inedible, sunchokes and no sign of our main course.  Finally the main course arrived.  The portions were small, and my fish was luke warm.  All in all we were there for over three hours.  For two people, that's a long dinner!  We left thinking we would not return.  It's too bad because it is a nice venue, and a great idea of farm to table, but the food is just so-so and it just takes too long . . .well beyond the point of it being a relaxing meal."], ["Susan W.", "Came here with friends as our going away dinner - wish we came sooner, might not move out of MN.  =)... The food was definitely awesome!  my husband insists it's the BEST he's ever had!  Menu changes everyday.  Six of us each had a different entrée from the menu.  The chicken dish my friend had was the best piece of chicken I've ever eaten - didn't know chicken breast can taste that good, must be farm raised... I had a bite of the steak my friend ordered, he had it rare, the meat was so tender and sweet, I did not mind the rareness at all. I had the pork chop, it was a big piece, and the meat was so tender and moist, not like how they prepare them in other places.  My husband had the roasted fowl breast with cranberries....exelleantly roasted with right balance of sweet and slaty with the cranberries working well with the whole dish - definitely a twist on classic thanksgiving dinner.  We also had a few small plates as appetizers to share, everything we had was good, even the dinner roll, specially made daily, crusty, flavorful.  The place is a bit spendy, however, if you've tasted the food, you would agree it's totally worth it."]], "Trung Nam French Bakery": [["Molly B.", "I'm sorry, I just don't get it.After hearing so many hyperbolic praises for Trung Nam's croissants, I decided it was finally time to give in and try them. I am always on the look out for a proper French croissant to have with a creamy cafe au lait. To my mind, this wasn't it.Sure, the croissant was what everyone describes in their reviews: slightly sweet, flaky. But it wasn't what I think of when I think of a croissant. Where was the golden brown exterior, glistening with butter? Where were the visible layers of butter pastry, staked on top of one another so they pull apart in sections? Instead, it was doughy and dry and too sweet -- I've only had flavored croissant that are sweet (chocolate, almond, etc), never a plain one and it wasn't what I wanted. Nothing like a proper croissant, which should look like this, from my experience: gregoiremichaud.com/wp-c…Maybe I went in with expectations that were too high. Or maybe a croissant in Minnesota is just something different than what I am used to, and maybe they do THAT kind of croissant better than anyone else. If that's the case, then I guess the Minnesota croissant is just not my thing. Either way, I won't be going back for the croissant.Maybe for the bahn mi..."], ["Susan C.", "When I was younger back in the stone age, I always had trouble getting to this place on time because they had weird hours and closed super early. Now that I'm older, and I won't say how much older, I'm an early riser and am probably the first person to walk in when I do decide to make the trip. Their pastries are very good, so warm and delicious. I always get the chocolate, raspberry, and blueberry filled croissants, along with a few house/traditional banh mi (not all for me of course!). Their french bread and banh mi are also sold at various local asian supermarkets in the city so you know their stuff has to be good. My only gripe with their pastries is the amount of filling that's missing--I wish they would at least double the filling, then it would be PERFECTION. The banh mi have a similar issue as well.Until this is fixed, I will still grudgingly love this place."], ["Beth J.", "Located in the heart of midway and surrounded by many viable vietnamese restaurants, trung nam offers hands down the best bahn mi sandwiches in the twin cities. My guy and I made our inaugural trip to trung nam late on a Saturday morning and bags of banh mis and croissants were flying out the door. We went into the inconspicuous building and discovered a small bakery counter with glistening croissants, a coulple cookies, and crusty baguettes. By the time we got there they were out of a couple flavors of croissants, so if you want the maximum amount of choices, get there early. We each ordered a bahn mi and chocolate and apple croissants from a friendly and efficient girl working the register. Too excited to try it, we immediately ripped into the neatly wrapped sandwiches. I was amazed by how each perfectly portioned element contributed to the most well balanced sandwich I've ever had. The wonderfully crusty bread was the stand out, but the crispy pickled veggies, spicy jalopeno, and cool pate  After just two bites into this sandwich masterpiece, we knew we needed more. So we hopped on the bandwagon of all the other patrons and went in to grab another four sandwiches. Although I was really full from the HUGE bahn mi, the sweet tooth in me overpowered my already full stomach, and I needed to try some of a croissant. Honestly, I didn't know I liked croissants till I had one from Trung Nam. After one bite into the wonderfully light, flakey, and not too sweet croissant, I couldn't help but continue to eat. The minimal sweet apple filing was perfect, because the croissant itself was the star. All in all, I L.O.V.E. Trung Nam's, I would give it 10 out of 5 stars if I could"], ["Chuy R.", "So glad to have this bakery in the neighborhood. LOVE all the croissants! My faves: chocolate, coconut and almond flavors. I recommend this place to any food junkie who fancies tasty and rich pastries. KUDOS TO TRUNG NAM FRENCH BAKERY STAFF! No other croissants will beat theirs! :)"], ["Daniel J.", "Ahhhh! I love their Croissants!Now if they could only come out with a Strawberry/Cream Cheese Croissant, I'd be here every single day...Actually taking the time to think about that...that would probably be a bad thing. I'd definitely be a fat ass."], ["Valerie S.", "So you think you have impeccable self-control when it comes to dodging carbs and buttery goodness? Trung Nam will seriously make you reevaluate your life.This bakery does one thing, and does one thing well- bread and croissants. Even if you're so/so on croissants, Trung Nam will draw you into a whole new buttery, flaky and euphoric world and you'll want to make this part of your every week routine.For just $1.75-2.50 you can get a cloud-like croissant with an inner layer dusted with strawberry, blueberry, raspberry, chocolate, or apple- OR an outside flavored with almond, cinnamon.. ect. As for the iced coffee, one sip and the word 'intense' will come to your mind- a powerhouse of both coffee and sweetened condensed milk. So bad for you, but so, so good.And I must go on.. The bahn mi? Um. I've had a lot of bahn mi through the city, and really has to be the best in Saint Paul. The bread is amazing (obviously) and the fillings are well worth the $2.75. Love you, Trung Nam."], ["Keith F.", "This place is so ridiculously good. I wouldn't stay away even if they were to \"Bahn Mi\" for life."], ["Linda H.", "Today, finally, they were not out of croissants so I got to try one....I REALLY wish I hadn't......I tried the chocolate one.  From the minute I took the first bite, it was like I was in a different world, one filled with lollipops and marshmallow clouds....I was splitting it with my daughter and she literally had to pry it out of my hand to get her half. I wanted so bad to turn the car around and get more but i didn't.You would never dream this place would have the best croissants like this but they do.......It is worth a trip from anywhere to get your hands on one of these little pieces of heaven.  Like others have stated, there is not much filling in them, I at first, had wondered if the chocolate was in it at all but the filling is about the size of a quarter.  It does not matter though because I would eat these with NO filling in them...So light, yet crispy on the outside.Stop in and try a croissant or two when you are in the area. You will not be disappointed and remember to bring cash!"], ["Terry B.", "Delicious flaky on the outside, moist on the inside croissants most of which are sweet flavors. I would suggest however, they incorporate some savory flavors. Also the prices are very reasonable."], ["Tina C.", "Best. Croissants. Ever. Trung Nam does a fantastic kob of making wonderful croissants and bahn mi. The staff are very friendly and plessant and the whole place smells of butter. Remember to go early as they can sell out early and remembee to bring cash."], ["Diana D.", "I definitely agree with everyone else, their croissants are AH-MAZINGG.The Vietnamese iced coffee is delicious and as far as the banh mi sandwiches...I've had better. I can't wait to go back to try their pho, I read on their facebook account that from Monday - Saturday, 2pm - 7pm ...pho is only $4.99. Whoa!!Cash only though."], ["Don C.", "I love this bakery. The banh mi is a revelation of deliciousness. For a bit more money, I always get the \"extra everything\" sandwich, which increases the portions of meat and pickled veggies. And I always apply a healthy squirt of sriracha sauce to make it a little more tangy and spicy. You can also order the \"extra meat,\" but I've never tried that version. The croissants are sinfully scrumptious: flaky, moist, buttery, rich. I've had the plain and almond versions. I usually get the canned soy milk (Yeo brand), which is a nice sweet complement to the spicy sandwiches. If you haven't had it before, I'd recommend giving it a try, though it has a more \"soybeany\" flavor and is sweeter than other popular soy milk brands like Silk. All this can be had for a steal. I went with two other friends last week and got two sandwiches, a croissant, and a soy milk for $11. That's a ton of flavor for very little money!Minor drawbacks: It's located in an old fast-foot restaurant, so don't expect beautiful decor. I think they only take cash. Their hours are a little unpredictable and they sometimes run out of baked goods or sandwiches if you get there too late."], ["Olivia T.", "YUM.  Coconut Croissants and some seriously delicious steamed buns.  If you're in the area and you want a snack, this is the perfect place for a pick me up!"], ["Karen S.", "Just bought (and devoured) two croissants for $3.00. I swear, I had every intention of saving one for later, but they were just too yummy. Plain was super light and flaky. Chocolate was brushed with a sugary glaze that must have crack in it.  I'm already craving another.Cash only!"], ["Alex Y.", "I had a day full of Trung Nam today -- breakfast and lunch! I went in at around 8:15am and was a bit disappointed by the wait. It took about 10 min for them to get the sandwich ready. I'm guessing there's probably no wait later in the day when they already have everything pre-made. I got an almond croissant for breakfast ($2.95) and their basic banh mi for lunch ($2.75). The almond croissant is about $1 - $2 more expensive than any other croissant or pastry they had. The croissant was quite tasty, being both super flaky and crunchy. A lot of croissants are often too soft, but this one definitely had a good balance of soft-on-the-inside and crunchy-on-the-outside. Nevertheless, I was a little bit sad that there wasn't more filling in the croissant. I'm used to almond croissants with a sugary almondy filling and was mildly disappointed that there wasn't much. There also doesn't seem to be a clear reason though why the almond croissant is more expensive than the other pastries... I'd definitely come back for a croissant, but probably not an almond one.The banh mi was good, even having some BBQ pork inside. Like the croissant though (this seems to be a theme...), there just wasn't enough filling! I understand it was the basic sandwich, but I still had a minimal expectation for being able to taste the filling with each bite of the sandwich. At times, there was just not enough filling to even taste it with the bread.Regardless, Trung Nam is still definitely worth the visit!"], ["D J.", "I was down this way in St. Paul for work and decided to try my hand at some Banh Mi. I have had lots of them when I lived in SE Asia, but man, this was delicious!The show stopper however were their croissants. I bought both the Coconut and the Chocolate ones and oh my god.....it melted in your mouth and just oozed deliciousness all over your taste buds. I will drive to the ends of the earth just to eat their Croissants"], ["Steve T.", "So I ended up flipping a U'e (is that even right??? : ) because Saigon was closed for whatever reason.  I wanted my cheap, yet delicious sandwich and have always wanted to try this place.So the sandwich.  I prefer Saigon's as I love their BBQ pork.  Trung Nam's was ok, it just seemed to be wanting more.  But I also never had their croissants and saw a coconut one that had my name on it.  Wow.  It was perfect!  I mean it was soft and flaky.  A buttery top and just the right amount of coconut flavoring in it.  No stringy coconut flakes, just pure bliss.  I'm going back today to try a different one as it was that good."], ["Aaron K.", "Croissants! Croissants! Croissants! Croissants!Trung Nam's croissants will decisively destroy any other croissant you might have had elsewhere. That's all there is to it. Flakey, buttery, and pillowy. Sink your teeth into one and there's the subtle crackle of the golden buttery crust yielding.My favorite are the plain ($1.75) but the Almond ($2.50) that many yelpers rave about are extremely good, my only reservation is they are a bit large, sweet, and rich for one person alone to eat. I suggest sharing it with another person.I would ABSOLUTELY give this place 5 stars if they were open longer hours. Oh, whoops, I clicked on 5 stars anyway."], ["D H.", "apricot croissants...amazing!! Staff is super nice, very helpful.... bring cash, no credit cards accepted"], ["Annie D.", "Every member of my family has been a regular customer here since the beginning of time. My aunt (in CINCINNATI) requests that we bring her a half-dozen banh mi from Trung Nam every time we visit her.The banh mi are only $2.50 for the biggest Vietnamese sandwich you can get your paws on. The croissants are only $1. I have had coconut, almond and chocolate filling and dear GOD are they good. The minimal filling actually doesn't bother me because the croissants themselves are heavenly. I think I like the coconut the best. That's like choosing between my children, but I just DID.When I need a lot of French bread for a party or to carbo-load or something, I happily skip Costco and come here. I'm pretty sure a lot of the University Ave. restaurants do the same thing and pick up bread for their own, slightly inferior banh mi...Also, they started serving pho!Remember to bring cash and that they are closed on Sundays. Go early for the best selection!"]], "Salut Bar Americain": [["Lewis H.", "The service here was excellent - attentive and friendly.  Salad was fresh and crisp.  If the weather is good, they have a very nice patio. Nice wine list.  All in all, a very enjoyable experience."], ["Laura H.", "The idea of Salut really excited me, especially since it's a bike ride away.  At first I thought their happy hour was 12-2 and that was even more exciting because sometimes I'm finishing work around this time and am hungry and thirsty for something tasty. It's actually 10-12, that's okay. So I finally made it over there and I tried to explain to the waitress I wanted wine and food pairings but I think she was under the impression I wanted 2 drinks at once.  So she brought me the burgundy, the French onion soup and the oysters all at once. I wanted to enjoy the oysters with a glass of persecco. Unfortunately there was a long gap while the oysters were waiting to be eaten and I had no beverage. It's ok. I ordered another batch of oysters when I finally got the persecco and unfortunately a few were a bit mush. She gave me a bit of a discount due to such. The patio is truly this restaurant's greatest asset. The music is very schizophrenic, I liked the 20s and Parisian music but then reggae came on?  It was weird. I really liked the French onion soup, I can see it warming me up on a cold Minnesota eve in the future. Service wise it took a terribly long time for drinks to arrive from the bar. Situational awareness and listening skills are my recommendations for staff improvements."], ["Vanessa W.", "I can honestly say, this place has the best service by far that I've had in a long time. Both the bar tender and server were gracious. The food was flavorful with a hint of spiciness,  yet was not over bearing. French food is in a class by itself and the taste is aquired. I recommend dining here a few times so that you can appreciate the food, service and atmosphere."], ["Bea K.", "Brunch was excellent!  My sister got the eggs Benedict florentine... I had severe entree envy:  the toasted buttered rounds were amazing, the tomato flavorful, the spinach wilted wonderfully, and the hollandaise perfect (I don't like an over lemon-y sauce, this was scant if any).I enjoyed the quiche Lorraine, which was delicious.  The onion was carmelized with a touch of mustard and the crust flaky.We both got the creamy hash potatoes, which were to die for... Sinful... Creamy... A bit of onion... Yummy cream/cheesiness!She got a Bloody Mary... With half tomato juice.  (Would have been very hot). Garnished with short beef stick, pepperoncini, green olive, and mini dills. I got the grapefruit sparkler.  It wasn't fresh squeezed, but Holly let me try a bit of juice to make sure I liked it.The house French bread was great and I asked to try their maple butter with it... Very yummy.Service was phenomenal with Holly:  friendly, knowledgeable, helpful and on top of things!!We definitely plan to come back!"], ["Kate M.", "Yummy food & even better atmosphere! Sit at the bar - I think it was Carin & Mike. They are awesome and super attentive."], ["Taylor L.", "Weekend Brunch was lackluster. Expensive and slimey. French toast was dry and flavorless. Good service, decent patio."], ["Katie Q.", "Really enjoyed this place! I came here for a work dinner and they were perfectly accommodating for our party of 20. Jordan was our server and he's got it down! He did a wonderful job of making sure everyone had what they needed at all times. Service-wise, they've got it dialed in. The food was also great. We tried several appetizers and I would recommend the crab cake and steak tartare, but note that portions are pretty small (it is a French restaurant after all). For my main course, I had the rainbow trout which was cooked perfectly. They also do a great job with presentation, which goes a long way in my book. All in all, I would definitely recommend this place!"], ["LB L.", "It was a perfect lunch on a chilly day. Nothing screams comfort like an almost perfect crock of French onion soup.  It was only 'almost perfect' because I like a few crispier cheese portions. Nonetheless, I was delighted. The French fries are always a must too... Delicious!"], ["Biff B.", "I'm not sure what has happened but this place has gone down hill. I used to go all the time and enjoyed the food and the atmosphere but stopped in there last week and something was different. The bartender was arrogant and unfriendly and offered poor service.  I ordered a beer and then asked for a menu. He walked past me 4 or 5 times before he seemed to indicate that he had forgotten that I wanted a menu and got me one. I ordered the Knife and Fork chicken club. I've had it before and I like the sandwich. It's $14 for a chicken sandwich but when it came, I was shocked to find this tiny piece of chicken on the middle of this large bun (the bacon was amazing). The fries were delicious as usual but they used to offer bread while you were waiting for the food. I guess I could have asked for some but the bartender seemed \"busy\" and he didn't check in on the food once it came. I'm disappointed with the experience.  I guess everyone can have an off night. I love the patio in the summer but if the food isn't better, guess we'll have to find another place to hang."], ["Amy S.", "I used to love going to salut, but the past three times, I've had the same snotty waiter. She is awful! I overlooked her bad attitude because the food was good but now I can scratch off the entire restaurant. Fries were double dipped, steak tasteless and over cooked and service was awful....as expected, but not worth it anymore."], ["T T.", "My cousins took me here for the first time for my birthday and it was pretty great. We were seated on the patio and was greeted and served right away. The server even alerted us that it was going to rain and to just go choose a diff place inside and she would find us. It poured and the bussers(?) (the Mexican man) promptly grabbed outdoor umbrellas and set them up over us. SO nice! We ordered oysters which were bomb, crab cake was great, escargot was good also. And a deep fried cheese dip thing and a pate spread which I thought would've been something great for breakfast/brunch. The server was really nice and she actually conversed with us and it wasn't the typical robot talk. She brought me a free birthday Creme brûlée and that was really good! 4 stars bc my cousin got a glass of beer that had a huge crack in it. She should've just got a free one after drinking out of a cracked glass."], ["Bridget D.", "Great customer service and food. Our waitress made a little mistake and they were so kind and fixed the mistake. Always a favorite spot in St. Paul. Awesome happy hour too!"], ["Megan M.", "This place has one of the best happy hours in the Summit Hill area! The wine is decently priced ($4) and the food is fantastic. The pomme frites ($4 or $5) are delicious and easily shareable with a friend. Also, if you're hungrier than usual, their happy hour meatball sandwich is to die for (for $7)!!!!The bar atmosphere is great - trendy and classy yet casual enough for chatting with friends for a few hours over snacks and drinks."], ["Hannah T.", "Nice little stop for happy hour. Unfortunately it was raining, only unfortunate because I love my patios, and the inside was busy, but still very managable to find a spot at the bar. Best deal on oysters, ever. Two of 'em for $4, super steal. They come in a superb plating, in a cocktail glass filled with ice, with 2 dipping sauces! The normal sweet and sour sauce as well as a cocktail sauce. Super clean and yummy too. I just had the boring house red, but it was a good pour. I would have got another round, but the bartender seemed busy and never got back to me. She was very friendly, just very distracted. It's looked like she was helping someone train, so I'm going to let it slide this one time.  I will be back for a HH. I have eaten at the one in Edina, which was delicious, so I might have to try it out for dinner too."], ["Scott D.", "Very average food. We ordered the special (chicken) and steak. Really bland flavor, which surprised me. I shouldn't need to add salt and pepper to my meal at a place like this. Great service and ambiance, which is why it's three stars and not less."], ["Jessica T.", "Had a nice dinner here with our kids. our waitress was very  nice. She was very attentive and even asked our 11 yr. about his Lego League award. Deux-yummy french bread and SALTY butter is the bestTrois-well done burger Americain with carmalized onions and blue cheese. YUMQuatre-we had coupons for free kids meals with a $12 adult order.Only down side- I forgot my I.D. and the waitress wouldn't serve me wine. I'm 43! but I understood. My husband \"ordered it\". Overall a very lovely time. PluPlonc!"], ["Jacky W.", "Greek salad & fries. I have tried a few other items, but these two are where IT IS AT.The restaurant is comfortable and welcoming. The patios are great for summer months, but it is pricey and the service is slow."], ["Charlene J.", "This review is mostly for service. A friend and i went to Salut for a drink last Saturday. We asked to sit at the bar. We told them immediately we were going to order appetizers and were given a drink menu, which only had a few items on it. Then AFTER we had ordered frites, we were given a full menu, with MANY appetizers on it! Thanks a lot. Oh well let me get to my major complaint. The waiters could not be bothered to make an expression for us. They did literally not smile once during our interactions. Were my friend & i not hipster enough? Who knows. The school of waitressing i attended taught more smiles= more tips. *shrug* the frites were indeed tasty."], ["Julie C.", "Fabulous restaurant that makes it easy to eat gluten free.  The waitress said the frites were safe to eat so I had them with the hanger steak.  Both were excellent.  Started with a wedge salad that was also wonderful."], ["Cameron H.", "I've been here a handful of times to meet up with friends and family when I'm back in Minnesota visiting.  My husband and I have always had good luck here.  The service is consistently good, the food is consistently great, and it's a cool atmosphere. The last couple of times we've been, we've had the chicken and artichoke crepes, which I am a huge fan of.  They're perfectly cooked with interesting ingredients that are pleasing to the taste buds. I had a cup of whatever the soup of the day was, a vegetable bean or something along those lines, and that was delicious as well.  When we were recently here, we took a seat outside on the patio, but had to move inside when it began to rain. They quickly got us into a nice booth and didn't skip a beat.  Check out the menu before you go -- there are plenty of interesting choices.  There are never any surprised when we go.  I really appreciate consistency at a restaurant, and the quality of the service the staff provides.  This place hits the mark on both notes which is why we continue returning."]], "La Belle Crêpe": [], "Barbette": [], "Le Town Talk Diner": [], "Meritage": [], "Cafe Levain": [["Lisa D.", "We held a sales dinner here during our last MN trade show.  Customer service was amazing from the planning to the final goodbyes at the end of the evening. Harvey & his team ROCK!! They worked to plan an elegant delicious meal that fit within our budgetary request.Chef Adam went out of his way to plan a special menu.  Our team is still raving about the meal here.  Here are a few comments from our group: Beautiful an delicious salad.  Halibut was prepared perfectly. Loved the short ribs (and wanted 2nds!)  Chicken was unbelievably tender and flavorful."], ["Laurel H.", "Sunday's three course \"date night menu\" means you'll enjoy a delicious meal while saving them dollar, dollar billz. I started with squash soup that I would have thought made by angels in heaven if we hadn't been seated within eyesight of the kitchen. You and your wallet will leave full and satisfied."], ["Philip F.", "I really wanted to upgrade my review of café leaving to five stars on this most recent visit last Saturday night.  I really do like this south Minneapolis restaurant and I am sure I will be going back many times in the future.  On this visit we brought a special aged Bordeaux wine vintage 1998 that we plan to enjoy during the meal.  The wine was a special gift from a friend.  We told our waitress upon arrival that the wine was going to need some time to air out and we each ordered a glass of white wine to go with our first course.   This first course was a amazingly delicious cheese plate that delighted all the senses.  There were three cheese varieties accompanied by some delicious side sauces and olives and figs.  We were anticipating a relaxing meal when halfway through our cheese course another waitstaff person brought our salads.  We turned those back because we were not ready for them however I do think the kitchen was already starting to work on our main courses when they saw the salads go out to our table.   As a result our main courses were substantially over-done. my pork was extremely dry and my wife's vegetable melange was mushy and lacked the normal crunch that this restaurant delivers with its fall vegetable dishes.   We do love the space and we do plan to go back and hope that next time we will be happy to give a five star review!"], ["Adam T.", "I had one of the best ribeyes of my life here. It was cooked PERFECTLY. It was seasoned and cut PERFECTLY. My first bite was an explosion of flavor that lasted to the very end. To top it off, the selection of wines was diverse and exceptional. The ambiance was relaxing and warm. We had prompt but non-intrusive service throughout the evening. I look forward to returning soon."], ["Jordan O.", "I wish I could give this place two reviews.If the restaurant is mostly empty, you will have a lovely dinner. The food will be good (not mind-blowing, not memorable, but pleasant enough), service will be adequate, and you will leave satisfied.If the restaurant is more than half-full, turn and walk away. As far as I can tell, nobody has been trained to run the front of the house, so the waitstaff are pretty much on their own figuring out what to do, and this all collapses when they are busy. Expect a simple two-course dinner to take two hours. Expect to not see your server (except far away, across the crowded, noisy room) for 30-40 minutes at a time. The food will still be good, but not worth the aggravation.I put the blame squarely on the owner, who needs to hire front of the house staff who can manage the room so that an average busy night doesn't turn into a clusterf***."], ["Rick M.", "First things first.  This would have been a 4 or 5 had I not gotten to the entree. The mushroom soup and onion soup we order was interesting and very good.  The short ribs where off the chart excellent.  Now comes the problem.  I order the ribeye with frites and seasonal mushrooms.  There was so much gristle in the steak I couldn't even cut through it.  Zero flavor for a medium rare steak (I'm being genourous here leaned much closer to medium) and the entire plate of food was cold.  Now normally I would have sent it back, but when u haven't seen your waiter in over an hour it was difficult to do.  The bus buy took care of us most of the night because he was the only staff member in the dining room. I was very excited about your food until midway through then it all fell apart.  No customer service at all took 15 minutes to get drinks 40 minutes for soup and another 30 for entrees (which one was inedible) is unacceptable.  I can overlook the long time between courses normally but I cannot overlook the fact my waiter came to my table 3 times during a 2 hour meal. Took my order dropped the check and returned my credit card.  A little customer service could have gone a long way here to resolve my issue."], ["Jim S.", "Excellent place for our group dinner. A variety of tasty main courses. Now waiting for desserts!"], ["Amy S.", "The wild salmon and short ribs were amazing! Excellent restaurant! First time here but would definitely come back."], ["Joy H.", "With all things go, I have mixed feelings about Cafe Levain. On one hand, their menu selection is quite limited and, in my opinion, not representative of all that French fine dining has to offer.When it comes to the taste department, however, this place has it solid. I was blown away with the samplings of their Mussels, French onion soup, short ribs, and sword fish. Since I was already full before I came to this place, I can vouch that my review was unaffected by my hunger.As for the ambience, lovely. I didn't go there for a date (doh), but I wouldn't mind having one there since it's cozy and intimate like stepping into someone's living room. In fact, the intimacy of the place might even be too much since all the tables were set pretty close to each other. Would I go there again? Yes, but only on special occasions since the experience and pricing of their dishes weren't spectacular enough to warrant another casual visit."], ["Doug F.", "On an actually dark and stormy Wednesday night in mid-September my friend, A,  and I walked into Cafe Levain.  The restaurant is comprised of a single open room: warm, dark, welcoming.  The restaurant was mostly empty.  Service was gracious and attentive without being oleaginous and there was mostly excellent flavor to everything we ordered.  The wine list is small but has something for everyone and every price range, as long as your price range starts at around $30.We started with mussels and french onion soup.  The mussels were delicious; chunky croutons, flavorful tomatoes: finger licking good.  And the soup was tasty too.  But tasty in an institutional way.  Like maybe the stock was not made fresh. I know it's nearly sacrilege to suggest."], ["Heather F.", "My husband and I continue to return here and are amazed every time. I don't often write reviews but we both thought this was worth it. The food is consistently fantastic. The French onion soup is a stand out on the menu. The ribeye is a perfect piece of meat and cooked with precision. This time we also had the root vegetable salad and brussel sprouts - both of which we loved. The servers are knowledgeable and conscientious. We didn't have reservations for a Saturday night but when I called the host said there was a place for us (6pm). By the time we left it was a full house and every other time it has been too."], ["Mark P.", "I went with two other people on a weekday evening, so we ended up being one of the two tables in the restaurant. Even so, the atmosphere in the restaurant is very welcoming, and the kitchen is in full view of the dining area (a feature I've come to appreciate in restaurants.) The service and food were out of this world. I'll admit that the two others I went with have been regulars for a few decades now, so the service was a bit above and beyond (multiple wine refills, free dessert) but you'd be hard-pressed to find a place like this anywhere else in the neighborhood. I had the spare ribs which were served in a house-made polenta. I don't know what they marinate those ribs in, but it might not be legal in the US because it is just to die for. Prices are a bit on the steep side, so it's more of a special occasion type of restaurant, but it's still certainly worth going. I'll certainly be back."], ["Victoria L.", "Cool place! Nice ambiance for a date. I expected the portions to be small due to this having a French Influence, but the entree portions are actually really big (enough to share). It's an open kitchen concept, which I love. The bread is to die for. You can't go wrong with the short ribs and French onion soup, the are the signature dishes and are both beyond amazing. One star deducted for a limited menu, not many options but you can't go wrong with anything on there. Bakery and pizzeria are next door and look like they are under the same ownership."], ["Jay H.", "Our friends are regulars, and we can see why.  Every dish we tried had fresh, top quality ingredients cooked to perfection.  I rarely order chicken at a restaurant, but the recommendation was dead on -- juicy white meat, crisp skin, on a bed of flavorful veggies and creamy potatoes.  Burger with short ribs was beefy delicious.  Service was top notch.  A great dining experience at a fair price."], ["Kay S.", "The atmosphere is very nice. We had 15 in our party and everyone was raving about their meal. The asparagus soup was awesome. I then had the vegetarian entrée and it was the best I have ever eaten. I am from another state, but will make sure to come here every time I am in town. It was a great evening!"], ["Rae B.", "We enjoyed an early New Years Eve dinner at CafeLevain, we arrived at 5:00, and we were one of two couples (not together). They sat the first couple the second table from a corner by a open doorway, then proceeded to sit us behind them - the restaurant was empty! So we asked for a different table and were accommodated.We started with an appetizer - mussels (eye-rolling delicious), and French Onion soup (perfectly made). For our entree we had lamb sausage (spicy, but just right), and beef short ribs (decadent!). Table service was wonderful; we haven't had such a lovely waitress in a very long time - not one did she refer to us as \"you guys,\" my biggest pet peeve!We will definitely go to Cafe Levain (just so you know-its down the block a bit  from Turtle Bread Co.)."], ["Arah B.", "I stopped by this place last evening, as I had some extra time in the area, and needed a meal and a semi-quiet place to try and do a little reading. The meal was so excellent that I'm kicking myself for not visiting this place sooner! I had the red wine (a Bordeaux) that was on special, which held up a little better with my first course than with my second. First course: a curly endive salad. Second course: the mussels with a cream sauce and spicy sausage. I love mussels, and this delivered. My third course was unexpected but delicious: I think the chef behind the counter (I sat at the open-kitchen bar) took pity on a single diner, and donated a pumpkin cheesecake serving to my quiet cause. The place wasn't very busy, though as I left, it looked like the connected bakery had about half its tables full. I plan to return, with my husband. Soon. Maybe we'll sit at the bar, too- the aromas and activity were great to witness."], ["Fred C.", "Hard to find but worth looking for. Staff was excellent, chef was great and didn't mind all my questions as I bellied up to the kitchen bar. Great care taken in preparing my ribeye and it was fabulous."], ["Andrea R.", "This place has seriously good food. This is definitely comparable to restaurants in NYC and Boston. Try whatever is in season and you won't regret! Short ribs are a 10 out of 10, and the pumpkin stew was absolutely amazing, I felt like I was actually in France."], ["Douglas A.", "This little cafe took us totally by surprise. A wonderfully calm but not stodgy space with well-spaced tables and friendly, efficient service.  And the food was perfectly prepared and fresh: our group shared a wonderful chicken liver pâté to start and, for the entrees, the beef short ribs and the seared tuna were both standouts.  There is a good, not-too-expensive wine list and select microbrews.  Not surprisingly for a cafe sharing space with the Turtle Bread Company, the bread basket (generously replenished) was also a highlight..The cafe was pretty quiet on a Wednesday evening in the summer and (while we wouldn't like to see it become overcrowded!) it deserves more attention than it seems to be receiving."], ["Marty A.", "Great meal and ambience. Started with the jalapeno corn soup which was very yummy and then had the short ribs with sides of frites, spring vegetables and mushrooms. It was all delicious and the service was terrific.  And nearly everything on the menu was gluten-free, a real bonus. I'll be back!"], ["Lindsey R.", "Always amazing. Great food superb service. Amazing place for any occasion!"], ["Ronnie G.", "Cafe Levain is the best kept secret in MSP. Easily.Sure it's sexy to eat on Friday and Saturday but Sunday's where it's at when it comes to this place.You walk in and boom, you're greeted by an open kitchen with the chef hard at work. The atmosphere is quaint and feels homey yet modern. About 20 tables perfect for a group of 2-4.But you didn't come here for the tables..or mirrors all around.The Sunday Supper at $25 is one of the best meals in town.- Sunchoke Soup: sounds...odd right? It's not, a perfect blend of turnip with chili oil, lemon, and a bit of cheddar. Not too bright, not too heavy. It's a nice start to the meal.- Chicory Salad: Another one where you look at the ingredients and think..uhm. sure why not? But instead, you dig in and all flavors come together like a puzzle. Some crunch with walnut, some sweet and tangy with the pickled cherry. Frisee's also adds some nice texture.- Truffle Pappardelle al Funghi: Levain took the item off the menu so I'm not sure if this is called but it definitely had truffle and funghi and pappardelle. Three of my favorite ingredients in life.A three course taster sounds small in portions but after it was all said and done, I was full and sleepy, perfect for a weekend cap.Go Sunday and enjoy my Yelper friends."], ["John W.", "My wife and I had not been back to Levain in several years.  I'm sorry we waited so long.  We had a late reservation on Valentine's Day and tried their Prix Fixe menu.  It was a bargain at only $35.00.  We both started with the Celery Root soup which was delicious.  My wife followed with the Swordfish while I had the tenderlion.  Both were prepared expertly.  Our server was perhaps the highlight of the evening and did a fantastic job.  next time we won't wait so long to come back."], ["Susan L.", "Two  years ago on an anniversary date, this place loved us and we loved it.  Three days ago on a pre-anniversary date, we had to break our love affair.  Levain, what happened??  When did you become loud and boisterous?  When did your flavors fly away?  When did you stop caring about yourself?We started off with the mussels, which have always been good and thankfully, still are. I had the salmon and my husband had the hanger steak with pomme frites.  The hanger steak was okay (a little bit saltier than I think a hanger steak should be) and the pomme frites were not worth singing about.  I mean, they were okay, but I think the burnt taste got in the way of the potato taste.My salmon was more like a cod than a salmon.  Salmon is really easy to overcook especially when you have things on it.  I understand what they were trying to do, but really, they could have just stuck to the basics.  I think I had some truffle oil on one side of my plate and some beans and veggies on the plate.  When I couldn't eat my salmon any more and shoved it over, surprise!  I had more beans and veggies UNDER the salmon.  How could I have missed that?  Oh wait, I don't think I want to eat that. Overall, I REALLY wish the food was like it was years ago.  I know you changed and moved some people around, but really Levain, what we had was special.  Maybe there are other treats that will flight my fancy, but I have to come to terms that you have changed, and not for the better."], ["Mike L.", "I've been holding out on going to Café Levain for a special occasion.We moved to the neighborhood, we walked there, and I feel this place demands a special event. It did not disappoint.It's an unassuming place, being connected to a bakery.I like it that way. I don't like having to fight hipsters to try out a \"trendy\" restaurant like Tilia only to be greatly disappointed.People don't rave about Café Levain much, but then again, 112 Eatery had a quiet start too. Café Levain has been there a while and it has solidified what a model neighborhood eatery should be.My father was celebrating his birthday, so I figured it's time to visit.He had the ribeye and ordered it well-done. I shook my head but he loved the steak. We weren't thrown out, despite wanting to let myself out after that. He loved the steak and the little fondue cheese it comes with. He was quite impressed.My mother and I ordered the chicken, which came atop kale, cucumbers and polenta. It was absurdly good. It makes store bought cooked rotisserie chicken taste like Elmer's Glue. The chicken was moist and the flavor combination was a perfect mix and temperature. My wife ordered the bucatini, being an italian food fan. It was spiced exceptionally well. Sorry Al Vento, this is a lot better.We shared some smashed potatoes, which are fingerling potatoes with a pea/scallion mix. They were very, very good-five stars good.Chef Adam Vickerman is a wizard and I hope Café Levain lasts forever. This is where I want to bring my future teenagers for nice nights out.Parking is a breeze, there's tons of street parking.It's a safe area. We saw the cooks taking a walk before their shift while we were enjoying the afternoon having a beer outside at Town Hall Tap.TL;DR Just really approachable food made perfect. Go visit, I'll be going back often."], ["Johanna C.", "Charming French restaurant and nice date night spot or option for intimate dinner with a small group of friends. We were able to get a table on a Friday night by making reservations 1 hour beforehand. Service was consistent and great, they even cut the bread off to the side - makes it seem very fresh and authentic. I ordered the onion soup for a starter - delicious, cheesey, and totally hit the spot. My husband ordered the heart of romaine salad which was fresh but nothing mind blowing - it's your basic romaine salad. For entrée, I got the chicken and the mushrooms and polenta were definitely the highlight of the plate. For dessert, we got the icecreams...highly recommend the mint and blood orange was interesting but more on the bitter side and not a good compliment to mint icecream."], ["Prachee M.", "Warm and quiet ambiance with dark wood paneling in the spacious open dining area. . Service was very attentive.Wilted green salad and mussels were excellent; just wish there was a non-cream broth option for the mussels. For entrees, both the roast chicken and salmon were outstanding, chicken was local free-range organic and cooked to moist perfection. The steak frites was not that impressive, somewhat wilted.Overall, great food in a neighborhood place."], ["Tim G.", "I really enjoyed our dinner last Friday night.  We had the Butcher and the Bear Lamb and the Polenta.  Both dishes had great flavor.  We finished off the dinner with our server's recommendation, the creme brûlée.  Also very good.The service was excellent, knowledgeable and friendly."], ["Emily T.", "I love this place. Tough to know it's there unless you know it's there, tiny sign, next to Turtle Bread on 48th."], ["Brandi A.", "My first experience to Cafe Levain was last night. The mussels were pretty good, but there could have been a better sauce/mussel ratio (more mussels). The ragout burger was also really good but the fries that came with it were WAY oversalted (and I love salt). They are doing cassoulet specials this month and my fiance had to duck cassoulet. This dish was not worth the money - the veggies surrounding the duck were bland and too rich and the whole dish was also oversalted. We both felt a bit sick later in the evening.The 1/2 carafe of white wine was reasonably priced though. Maybe we'll try it again next year."], ["Jody B.", "I took my son and DIL here on Saturday night. It was a snowy night in Minneapolis! The restaurant was just what we needed to get cozy. We were early for our reservation, so we stopped at a book store across the street. It was nice to pass the time looking at the books. When we got to the restaurant, we were the only customers. It wasn't good weather, so we figured no one was going out. About an hour later, the place was almost full! We sat at a back table. It was warm and cozy. We had some wine/beer, and the mussels app to share. We also asked for a \"side\" of their mushroom polenta entree. They were very accommodating and gave us a generous portion to share as an app. The polenta was very creamy. MY DIL and I loved it. We said it was sure to have plenty of cream in it, with a nice amount of mushroom. The mussels were very good, but some of the shells had grit on the outside. We didn't notice until we were almost at the bottom of the pile. I mentioned it to the waitress so she could notify the chef. I didn't expect any comp because we had eaten almost the whole bowl. They took them off the bill. Very nice/classy!My son and I had braised short ribs. It was very tender and well seasoned. Perfect for a snowy night. My DIL had scallops. She thought they were very good.We had the bread pudding as recommended by the waitress. It had this cherry sauce with about 5 cherries in it. We each took one to try. We all said OMG, I have never tasted a cherry THIS GOOD! They said it was like a maraschino cherry, with a fresh cherry, with a candy cherry all rolled into one. It came with a semi-freddo that was delicious. The bread pudding itself was good.We popped into the Turtle Bread company that is attached to bring something home to eat in the morning. Delish!"], ["Dawn G.", "The chef really seems to enjoy making unique options. It was hard to choose because the menu was full of great options. I had the scallops and ordered a side of the garlic pureed potatoes. Delish, both of them. Really looking forward to returning and seeing what new art they put on the menu. The only reason I'm giving it three stars instead of four is because of the really slow service that night. I sat for nearly 10 minutes before the server came to get my drink order and we had to flag her down long after we finished our meals to request the check."], ["Rich R.", "First dinner at Cafe Levain for my wife and me. Always wanted to go, so we went on Saturday at 5pm. Glad we did. Tasted my wife's onion soup, and wished I'd ordered that. Rich, dark onion taste, cheese loaded. Tasted my wife's Braised Beef Short Ribs and wished I'd ordered that (most tender rib meat I've had in a while).FYi: my Roast Chicken Breast was also delicious (and, yes, my wife had some!)Only slight negative was environmental. While munching on bread after being seated, we both heard what sounded like distant, muffled, chaotic screaming and yelling.We asked a server about it. He sighed and remarked that a sword fighting club meets in the basement underneath the restaurant, and their workout is peppered with attack shouts.I assume if their exertion makes them hungry, they'll come upstairs for a great meal at a terrific neighborhood eatery!"], ["William S.", "The meals we enjoyed were delicious and creative. The \"burger\" was quite unique and tasty. The server seemed to begrudge the four of us as we didn't want anything to drink but water which was unfortunate as restaurant would have earned 5 stars otherwise."], ["Karen S.", "So happy that Cafe Levain is within walking distance. We braved the Storm of the Century to walk up and have dinner after an afternoon of shoveling. Seems like only yesterday that their garden up the street (yes, they have a garden where they grow fresh herbs and veggies) was in full bloom. Spiced apple and butternut squash soup was fantastic. I had the coq au vin-agreed with the other comment that this didn't seem like *real* coq au vin, but it was tasty. Homemade noodles and bacon were a nice touch. Pumpkin bread pudding for dessert - really tasty, but didn't seem to be heated through all the way. BF had shortribs which were fantastic - just falling off the bone. Our server was very attentive (we were one of 2 or 3 total parties in the restaurant) and was generous with the wine. This is a fantastic spot for a casual, but nice, dinner. Food is well prepared, and staff is warm and welcoming. A great neighborhood spot!"], ["Brad B.", "Solid culinary and wait staff.  Food, sevice, and intimate space keeps us coming back.  Consistently reliable in our neighborhood."], ["Jeffrey W.", "What a cool thing, to have a wonderful little treasure of a restaurant, tucked away around the corner right in the neighborhood!  The Sunday supper is as tasty as can be.  Tonight it was a delicious mushroom soup, scrumptious chicken confit and topped off with a yummy panna cotta chocolate mousse macerated cherry delight.  Can't wait to return!"], ["Andreas K.", "We were there with friends on a Saturday night to celebrate my birthday. We had the scallops, the ball tip steak and the Levain burger. The food and taste was great, the wine (Jacuzzi) made the dinner a really nice event. However, the menu is somewhat limited. I recommend check the menu on the internet before making a reservation. If you don´t like what you find on it, wait a couple of weeks. They change their menu on a regular basis."], ["Mollee F.", "It's my birthday week so I'm trying to fit in as many free meals at new restaurants that I can :) This time, my mother-in-law took my husband and I to Cafe Levain to celebrate.Cute place, if you can find it. It sits unassumingly on 48th St behind a Turtle Bread Company on Chicago. Blink and you'll surely miss it. Pass a large garden and you most definitely have. Inside there is a long bar and plenty of tables - it's much bigger than it seems. We were seated promptly, but it took some time to see a waiter. Our server was nice, but he seemed distracted by a large party at the bar and as a result, our requests for drink refills, straws, bread, etc. took multiple tries. We started with the French onion soup to test the French bistro quality of the place. It was a good soup, served hot, with a rich broth, slice of baguette in the bottom of the bowl and plenty of cheese and onion straws on top. My mother-in-law and I opted for the short rib burger. It was such a unique offering, I couldn't resist. My husband got suckered into the swordfish when he learned they were just about out of it. He liked it, but it wasn't the most flavorful fish he had ever had.The short rib burger, on the other hand, was divine. Good combination of shredded short rib and beef. The burger had a nice flavor and was augmented by caramelized onions and a cheese sauce. It came with a ridiculously HUGE helping of frites (fries). I seriously couldn't even begin to make a dent, but I can't wait to dig back in at lunch today. The fries could have easily fed our whole table and then some. For desert, we sampled the butterscotch pudding. It wasn't as butterscotchy as I would have liked but the sea salt was a nice touch. Overall, this is probably more a 3.5 star place than a 3 star place, but I don't know if I'm ready to don 4 stars on it based on our first experience."]], "Salut": [["kathleen d.", "We dine at Salut often and it has always been good. Our recent visit was excellent. The food is good, service good and what really impressed me on this visit was the manager Zach. He is everywhere...to greet you at the door...he spends alot of time in the kitchen facilitating the orders and making sure everything is just right for each table. He is the most hands on manager I have seen ever in a restaurant. It was a great experience. Also this time they actually were playing great vintage French music including Edith Piaf."], ["kyle t.", "How to say it best, Viva La France! Love this place. First trip here was with a group for Sunday Brunch. Great menu, fantastic service and the caramel laced croissant was out of this world. This place has a very open, inviting atmosphere. Warm colors, comfortable seating. Enough said, on to the food! Try the lobster Eggs Benedict, it's out of this world!! Rich creamy sauce with lots of fresh lobster. By far the best take on Eggs Benedict that I have ever had and I hate to admit I have had a lot of them over the years. We have been here for dinner and I must admit I don't remember what I had but I do remember I loved it every time. Only negative I will say is that being in Edina on a Sunday you have to wait until after 12:00 to order a Bloodymary or Mimosa, snooty darn Edina people...don't you have something more important to worry about? Anyways, go after 12:00 and enjoy the heck out of this place. By far the best restaurant in this area. KT"], ["Glen S.", "This is your typical over-the-top Edina restaurant.I will admit, we did have pretty good service, nothing more than expected, but up to par with what I expect.On to the food.  I got the salmon and am not usually too picky on how it looks and what comes with it.  For the price, I'd expect a little more than the portion size I was given.  Dry. Dry. Dry.  I have no idea how to make salmon myself (hence why I go out and pay more than it's worth) but I assure you, I have had better from many other places who didn't charge me nearly as much.I don't really think I will be giving this place a second chance being that it is not really my crowd to be around (typical Edina) and felt as though everyone was looking at me asking, \"who is that kid?\"  Turns out, I was probably thinking worse thoughts about them then they were about me.Tips: Don't get the salmon.  Convention Grill and Chatterbox Pub are right up the street (6-8 blocks away), head towards them and find a table there.  If you decide to stay, plan on over-spending."], ["Kimberly T.", "I really like Salut. It is one of the few restaurants in Minnesota that doesn't feel like I'm in Minnesota! For some reason when I'm outside on the patio, I think I'm in NYC. This automatically makes my meal more enjoyable. Salut is a great place for HH. My mom & I got a bottle of wine that was the same price I pay for it at Surdyk's! The strawberry salad has an amazing champagne-strawberry vinaigrette. I want the recipe! The oysters are $2.95 a pop which is fairly reasonable for my new favorite food. I've had friendly service when I've stopped in. I haven't sampled much besides a few salads, the pizza of the day & the oysters. However, those few items keep me coming back, so they're doing something right!"], ["K G.", "Service was really slow but our server was nice.  Popovers would have been better warm and served with butter.  The egg white omelet was fantastic - I recommend switching the goat cheese to Swiss.  Potato hash on the side was delicious."], ["Jim R.", "Better than I remember.  Honestly we have been avoiding them for a while because the food just didn't seem special. Perhaps it is true that absence makes the heart grow fonder, or maybe now that 50th and France has so many restaurant choices, they've had to up their game a bit.  Whatever the reason,  I'm glad to see them moving in the right direction."], ["Karen S.", "Review  based on a late lunch Sunday.  Sundays Salut has a pretty extensive brunch menu with several breakfast and lunch options.  We each got the soup of the day.  Have no idea the name, but it was chicken broth with veggies, macaroni noodles, with a swirl of fresh pesto.  Delicious!   BF and I split the huge steak sandwhich which was also tasty, if a little pricey at 15 bucks.I'd go back for lunch/brunch, but probably not dinner since it takes too long to get dressed up for weekend nights in Edina."], ["Hung N.", "Came here for some drinks and to try some of their hor's d'ouevres. Everything was good or just ok...I enjoyed the escargot and steak tartare probably the most. Both are rich and savory...oysters weren't bad either, but not hard to mess up. The complimentary french bread was pretty good. Other things we tried are the pate and buffalo frog legs, which were meh...nice ambiance. I would come back for a happy hour or if I was in area and wanted to go eat somewhere other than doing regular american food."], ["Dan S.", "I popped into Salut for a beer before seeing a movie at the Edina Theater around the corner on a Saturday afternoon a couple weeks back just to check it out. I had heard good things about the one in St. Paul. I was dressed pretty shabbily that day and hadn't bathed, shaved, or combed by hair since Friday morning. The place was empty and I sat at the bar and got a $6.00 Kronenburg on tap. I thought this was pretty high for a Saturday afternoon. At Mounds Park Lounge on the Eastside of St. Paul, one can enjoy a Kronenburg for a mere $2.50, at any time. I sat at the bar and read a newspaper and enjoyed my beer for about 40 minutes, while I waited for my movie time. The entire time, I felt eyes on me and when I went the bathroom, I was followed by a waiter or something. I felt that due to my unkempt appearance, I was being watched. My recommendation, don't wear an old torn hoodie and tattered jean jacket in Edina. I generally try to stay away from that area, but the theater there has some of the best movies around."], ["Mn M.", "Pretty good ersatz French food with some bargains and outstanding dishes.  Great service.Salut is a formula restaurant dreamed up by Parasole and usually it delivers.  On occasion my chicken has been a bit underdone which makes me a bit leery of ordering it but this last Monday it was just fine.All ages seem to love this place and they do a great job with big tables including various nieces and nephews with kid palates and phobias.  I was really surprised to read negative comments on the service.  That is the one thing that has been 100% consistently good. Usually we ask for Eric who is super.Last Monday we went for their $10 wine by the bottle special.  They do a nice job finding some real tasty bargains.  The waitstaff seemed a bit stressed but they handled it well.  (Eric was off duty, sadly.) Most at the table had the hangar steak which is always good - and the fries are great. Chocolate cake is back on the menu but a shadow of its former self according to the experts at the table.All in all a pretty good place especially for groups with varying tastes.  Wines are well-priced, even on nights other than Mondays!"], ["Mark G.", "I just wanted to say the customer service we experienced today was excellent. We stopped by for a quick meal and got a little delayed due to a miscommunication with the staff. Needless to say they went well above and beyond in taking care of us. We are always very pleased with the staff and food which is why we continue to come back. The French Onion soup and steak sandwich were great, not to mention the bread and butter!"], ["Erik H.", "For $27 you can get 4 scallops. Nothing wrong with them but you'll need to swing by a drive thru on the way home. My wife liked her burger.  Stick to the burgers."], ["Amanda B.", "I'm a bit shamed to say I ate here twice within a week's span of time with my mother. Salut is the kind of place I like to take my mother, when she's buying, because I know she won't be offended by anything bizarre on the menu; she'll find herself a nice shrimp pasta or a cobb salad, and I won't have to worry that things are a bit overpriced for what you receive. No forcing on her escargot. We can park easily and safely, and heck, it's France Ave. We're going shopping at Anthropologie before dinner. I have clear expectations. But seriously, Salut. I visited when you first opened, when I was young and thought I was very sophisticated eating pommes frites and mussels. And I thought everything was good. But the food quality just isn't there anymore. My fish was overcooked and my salad came undressed. The portions are sort of ridiculous during lunch (my first of the two visits), and frankly... it just feels like a gimmick. A French theme with no soul. There, I said it. I suppose this review isn't really *just* for Salut. I fear for the empire of restaurants of which this is one. Every ethnicity, every themed decor, every trend feels like it's been exploited and capitalized upon to a T for the masses. That makes it all seem a little too plastic for my tastes. Next time I think I'll take my mother to Meritage. I think she'd appreciate it more than I give her credit for."], ["Emma O.", "Stopped by for lunch after some serious window shopping throughout 50th and France. My friend ordered the French Onion Burger, while I got the lobster club sandwich.Ok, so the sandwich was delicious. That lobster club sandwich was the perfect lunch. Wonderfully light yet still satisfying. Downside: the chicken noodle soup. I wasn't really a fan. It was especially watery rather than chicken brothy and had an unusually high amount of peas. Also the noodles were macaroni noodles. Not terrible, but not what I expected.Now. The service. I was disappointed. We came in at 1 and didn't leave until 2:20, which, for lunch, is a really long time. And it wasn't by choice. It seemed absurd that it took so long since the place wasn't so busy. When we came in our server told us that fresh bread was on the way, and we were very excited because FREE FRESH BREAD. But then no bread came. Our server came back and apologized, saying it was being baked and was on its way. We understood and continued to wait patiently. Then a manager (I assume) stopped by and asked if we needed anything. We simply said \"we're still waiting on the bread, but everything's great!\" and he was like \"coming right up!\". Then our meals came. So, no bread then? Oh, ok.Here's the thing. I wouldn't mind not getting any bread if they hadn't PROMISED that is was on the way. Really, stop teasing me! Just don't tell me there will be bread and then I won't expect it!Overall the food was good so I'll likely go back, preferably for dinner."], ["Angie S.", "We were in line at a restaurant that was over an hour wait.  We walked over to Salut and I couldn't have been happier with the choice.We sat patio and the groups of people were great.  You can lease up your pup while you eat or just sit with friends.  The wait wasn't long and we were greeted and surved right away.  Whatever place serves popovers needs to get a 5 start by default!I ordered the Chicken and Artichoke Crepes and they were so delicious with great flavor.  The brunch is great and one of the freshest brunches I have had in a while!  Absolutely check this place out!"], ["Christy N.", "6 of us came in for dinner last Saturday night.  I've been here for work lunches and a happy hour or two during the week and it's always been... fine.  Given the mixed dinner reviews I was a little nervous.We arrived about 10 minutes prior to our reservation and we ended up scoring a table in the bar because it just happened to clear.  The bar was a madhouse and I do have to say, \"Really? 4 tables in the bar? In the heart of Edina's shopping district?\"  We were really squished and bumped around which was annoying.  I ordered some sort of Lemon Martini and it was like drinking Lemonade-Everclear or something.  I can hold my own but that thing was potent (and really, really good).We had reservations at 8:00 and were seated around 8:20.  Not awesome, but not terrible.For appetizers, the table ordered the baked brie, which was pretty cold and rubbery.  No one was very impressed.  We also ordered calamari, which was really heavily breaded but did have banana peppers and jalapenos which we all liked.Our dinners were actually really good.  I ordered the filet mignon, even though I've never even considered Salut for steak.  It was excellent!  Not up there with Manny's but not far from it.  My boyfriend had the hangar steak and he really liked it too and it was loaded with blue cheese.  We ordered sides of macaroni and cheese (yummy if you add salt), mushrooms (good with a mix of ports, shiitakes and oysters) and brussels sprouts.  The sprouts bombed - undercooked with a big handful or red pepper flakes.  Not a good mix.  The fries with my steak were to die for - crispy and salty.Honestly, the Lemon drink that I'd had along with the wine we ordered pretty much resulted in my not paying attention to anyone else's food.  Sorry.  They all said it was surprisingly good though.We didn't try any dessert but that was because we needed to run to attend a party.I've had a lot of people say that Salut is 'snooty' or overbearing, but we didn't think so.  It was fun and the food was actually really good."], ["George S.", "Had the pleasure of eating here twice in the last few months and both times I left very satisfied with my experience.  The room is large with high ceilings and can get a bit loud but overall very attractive setting.The food was excellent I had the salad nicoise on my fist visit and a salmon special that was very tasty.  Our server was good not great but friendly.Overall I would recomment Salut on your next visit to Edina."], ["Aaron S.", "Returned for a business lunch on Thursday 1/26. Salut needs to figure out that the host person is a guest first impression of a restaurant. The hostess seemed confused as to where to put a table of 4 and (while it wasn't busy when we came in) we had to wait 10 minutes because a) we didn't have a reservation and b) not all of our party was here. Her rudeness and lack of professionalism (including her attire) Was VERY off putting and not what I am used to from Salut .That being said, our lunch was fantastic! The hangar steak was phenomenal,  and our server, Dirk, was professional AND hilarious. Attention to detail is VERY important to me, and he was absolutely  spot on with everything. It is always nice that a manager stops by to see how your experience is going,too. And you HAVE to have oysters here! Best in the city! As well as their incredible pear torte!!!We will be back again! And Dirk, thanks for turning our impression of the day around!"], ["Sara P.", "+Fun atmosphere+Decent wine list +Close to my parents house (major bonus points!)+Attentive service - our waiter, Eric, was very enthusiastic! +Valet parking - $3!!! I thought this was super cheap. Our table wasn't quite ready when we arrived so we went to the bar and ordered some drinks :) I had their sonoma pinot noir and my friend had a le french kiss martini. I loved the mini baugettes & side of mashed potatoes -- to die for. You can taste the cream and butter in them. Perfect."], ["Millie E.", "I had wanted to eat here for quite some time.  The fiance and I brought our kids for brunch.  What to order?  Everything sounded delicious- but decisions must be made.  I ordered the BUrger with the carmelized onions and french onion soup with a side salad.  It was delicious and a reasonable price (but I wouldn't have paid more).  I also ordered the Cafe Mocha. With all of its warm milk and cocoa goodness, I almost thought it was hot cocoa but there was that hint of coffee flavor. The cafe mocha came with 2 sugar cubes (why? I'm not sure) and a shortbread cookie.  The cup it was served in was more like a bowl.  I loved to drink in all of its warm goodness.We opted for the cheeseburger for our toddler and asked for a side of fruit vs. the fries.  The fruit was a good choice.  I wish I could say the same for the cheeseburger- I think it was a bit overcooked for a toddler- ours hardly touched it and he LOVES his cheeseburgers ('With Ketchup and mustard!\" as he likes to say.) My fiance ordered a chicken sandwich, which I tried but didn't love as much as my burger.  Must. Go. Back. Must. Order. French Onion Burger.Definitely good for brunch and suitable for kids- they were able to provide a high chair, sling, and a space for stroller parking."]], "Casper's and Runyon's Nook": [], "Red Cow St Paul": [], "Vincent A Restaurant": [["Carrie R.", "Great food and excellent service - a perfect example of what the dining experience should be."], ["Shawn W.", "Happy hour for the Vincent burger is the BEST deal in town for the BEST burger in town"], ["Ashley L.", "Amazing.  Service was exceptional. Our server (James) recommended some wine for our meals and they paired very well. Everything was delicious. Will definitely be back again,  hopefully served by James! Go try some snails (:"], ["Annie P.", "3 stars too low, 4 - too high but that's Yelp.  Vincent burger everyone raves about was very good, but a tad too salty. Fries no better than McDonald's.Would I go back?...Only if someone else paid...."], ["Lila C.", "Summer 2012 Restaurant Week: Vincent has done it again, another beautifully crafted experience during restaurant week. Service and Atmosphere: friendly and upscale. I made a reservation for Monday lunch  for 7, then 9, then finally ended up being 8 coworkers. They had no issues with me changing the number of people and were nice in changing the table arrangement when I told them it would be 8 when we arrived. The high ceilings and natural light from the large windows only makes the experience more enjoyable. Every time I tell someone I'm going to Vincent they reply with \"ohhh fancy\". Food: Small portion similar to last visit but still very rich and filing. Onto the Happy Hour: I've been here 4 times for HH, twice for the late night and twice after work. I love that they have HH twice at reasonable times and prices, though it's a limited selection of drinks and food - it might not be for everyone. Must Gets: Burger - Yes please! Ground beef and braised short ribs and that melty smoked gouda cheese. Plus you get the choice of fries or salad on the side, I choose the salad to add more veggies to the burger. Duck wings - I don't think I can do a description justice, just please try. Poutine - My absolute favorite. Greasy, cheesy, gravy and loads of fries."], ["Tony S.", "By far the best burger that I have ever had. If you visit Minneapolis, you must stop here and get a Vincent Burger. Like nothing else in the country."], ["Chris L.", "This is a lot of people's favorite lunch place and I won't argue with that.  I've just never had a knock your socks off experience here for lunch (and have only done group dinners a couple of times).  Burger is great although I liked it a bit less than my oversized expectations based on reputation.  Fries are done great here -- as you'd expect.  They may be great at dishes I don't typically order -- moules frites or duck.  Read this review more as a knock on my tastes than Vincent if you wish."], ["Nicole J.", "Eh, I don't know. I think there has to be better restaurants at this price point in the Twin Cities.We came here on a quiet eve before Christmas Eve with a group of 12. It was great they could accommodate us at a long table.We ordered a few poutines for the table as starters. I would have liked more gravy and for the cheese curds to be melted into the fries a little more.For being so close to Canada, I think these were a surprising \"miss\".Hearing that they are famous for the burgers, we got one of those. It's a riff on Minnesota's national sandwich, the Juicy Lucy (cheese injected inside the patty).I could tell the meat was high quality, which was nice, but I wouldn't go out of my way to order it again. Maybe the Lucy isn't meant for haute cuisine, as I felt the gooey cheese just overshadowed the delicious patty. Guess I'll stick with the dive bars for my next Lucy fix.The lamb shank was decent, but was lacking that special oomph I had hoped for.I did like that without asking they split the wine bottle 7 ways on the check. Never saw that before. And the ambiance was very relaxing and inviting. Overall a pleasant experience, but not one that will stand out."], ["Jennifer H.", "Went here during happy hour and had the Vincent burger. For only 8 dollars it was a great deal and a quality burger. I really loved it and would highly recommend to anyone craving a big juicy burger.  Beers are also reasonably priced at 3 dollars... Some of them anyway. Just a note: you have to sit at the bar for happy hour"], ["Beverly V.", "If you want to try Vincent's and pay a little less, go for their HH. They still have their burger on the menu, which is one of their most popular items. Their poutine is also delicious and on the HH menu. Overall, from what I've tried - very good food."], ["Jill P.", "Good restaurant. The food is always delicious but a little pricy. Some of the waiters speak french so that is a plus."], ["Shawn S.", "I wanted to give Vincent a better rating.  I loved my lamb shank entree, the butter squash soup, the dessert, and that I was greeted at the door with a happy birthday.But - they hit 4 of my pet peeves.1.  The Burgundy wine listed on the menu was a 2009, and they only had 2008.  If you know anything about wine, that is a significant difference.  I hate when restaurants serve an inferior vintage without at least telling you.  Shame on them as I think they are even on Wine Spectator's gold list and I intend to notify the mag.2.  There was not a soul in the restaurant when we arrived and they proceeded to seat us next to a table set for 19.  Seriously, why would you do that?  We asked to be moved.3.  This isn't a pet peeve - but there are a lot of options for French cuisine in the cities and I'd say half of the menu options were not French, especially the Grouper with Baby Bok Choy with Sesame Asian Vinaigrette.  I have loved my meals at Cave Vin, Meritage.  4.  One olive in my dirty martini.  Really?Bummer because it was my birthday."], ["RP P.", "B+ Everything was nice, but nothing outstanding. Escargot was kind of flavourless. Lamb shank fell of the bone as it should... but was also kind of flavourless. Louis the XV was not the chocolate bliss coma I was hoping for. I wouldn't mind coming again and trying some different things, but won't go out of my way to."], ["Jay E.", "I'd been to Vincent A Restaurant 3 times, was debating on whether to give it 4 or 5 stars, and then my buddy Dylan aka Pretty Elvis invited me to their happy hour the other day. Well, in the words of Dinah Washington, \"Laaaaawd, what a difference a day makes.\"This is a review of Vincent A RestaurantBy Lonny A CustomerFeaturing: Burger A TreatFlatbread A DisappointmentBeers A Bargain  And unfortunately starring: Bartender A JackassNow look, Lonny done tended bar and waited tables, meine freunde. One of Lonny's closest friends presently tends bar, another is a chef. Lonny knows the ways of the service industry. So when Lonny complains about service, best believe the service has to be especially horrendous. And boy, was this service especially horrendous. Our bartender was inattentive, curt, poured our beers sloppily, and generally seemed put out by our presence. Now, to be fair, the bartender I'd had two other times was wonderful, and my waitress the time I ate in the dining room was fine. I didn't catch either bartenders' names, but the wonderful bartender had kind of a crewcut, was tall, personable, all around excellent. But the horrendous one... yeesh. I remember little about him except he had glasses. And he was so awful that my rating almost went all the way down from 4 or 5 stars to 2. THAT BEING SAID: The food I've had here, in general, has been 4 and 5 star level every time with the exception of the flatbread. But going to a restaurant is an experience, and terrible service ruins the experience regardless of how tasty the food is, and how reasonably priced the happy hour menu is. I'll give this place another few chances in a month or so, and amend this review depending on my experience then."], ["Patrick O.", "It had been way too long since we had been to Vincent's but we finally made it back. The food was as excellent as we remembered it from about, I hate to say this, 5 years ago. We had the chef's tasting menu and the selection offered was marvelous; the preparation was superb; the presentation was gorgeous and the taste was as good as anything we've ever had the Twin Cities. We have to go back here again soon. Always an enjoyable dining experience even with the sub zero weather we had this evening. The place was full and the atmosphere was wonderful warm."], ["Jessica L.", "I've only been here for the happy hour, and WOW they have an excellent HH!Décor: Upscale, white tablecloths. Candlelit tables and a more formal seating to the right, but when you first come in, you can sit at the bar or the bartop tables for a more casual setting.Service: Friendly and professional, thanks!Food:- Steak tartare: better than some I've had, and the presentation was just adorable! (See pictures)- Duck wings: These were really good and saucey. It reminded me of the wings I grew up on (duck wings are a common Chinese food), and it definitely had an Asian taste on these with the bulgogi. Albeit, these are saucier (maybe to make it more like BBQ wings?)- The Vincent Burger: The burger was better than average- juicy and moist. I wasn't a huge fan of the shoestring fries though.- Louis Xv: It's a hazelnut chocolate cake served with a pear poached in wine and I'm a stickler for a good pear. Hence, I'm pleased to say that this pear was quite good! The wine that it was poached in was noticeable, so it added a good flavor to it. The cake was also very yummy, decadent and creamy.Overall: I don't remember the final amount that we paid for this meal, but I can tell you that it was a STEAL- almost diner like prices but in a nice fancy environment. Definitely recommend the HH!"], ["Sally B.", "I'm a fan, but I ordered poorly.  Phooey on me.  Should have gotten an entree.  Instead I had the special soup (butternut squash) - - delicious!  And the beet carpaccio, also delicious.  Then I had the lobster croquettes.  Over cooked and a bit too salty.  But they were the most perfectly smooth and round croquettes I've ever seen.  Great service and right-sized drinks.  Just don't make your meal from appetizers!"], ["Susan L.", "All I have to say is happy  hour and the Vincent burger. Go for this. This place is a definite go to after work.  If you get there right when they open in the evening, the patio is yours and everything is WAAAY cheaper.  My pockets like that.  Their staff is also super helpful and kind and they offer suggestions for wines to go with your yummy happy hour treats.  The only reason why I didn't give it five stars is that the poutine is not \"real\" poutine.  Having been to Montreal and some other restaurants around the country, Vincent is slacking a bit on the gravy and cheese curds. They are very generous on the fries, so I guess that is okay, but come on!  Where is the cheese and gravy? I want to feel French! I mean, I am not supposed to eat dairy, but when I WANT to, I expect a lot of fatty cheesiness and gravy drenched in my poutine!!  My only complaint - work on your poutine!!  Carry on!"], ["Patrick H.", "I had been meaning to try this place out for some time. Finally got around to it tonight, at the suggestion of my girlfriend. Being a smart person, she'd noticed that they had a reasonably-price prix fixe during \"Restaurant Week,\" and it seemed like a good opportunity.As others have noted, the sliced baguette is really nice. Great texture and served slightly warm.Our first course was solid, with a savory/sweet salad for her and a well-balanced root vegetable soup for me. I felt that the broth was legit, if perhaps in need of just a bit of salt. The vegetables in question were good and earthy, and there were bits of intensely-flavored duck. If the ratio had skewed slightly towards the duck, this would have been a real home run.My gal seemed to enjoy her poached Steelhead, which came with crushed nuts, some root vegetables, and a little hazelnut (walnut? I dunno, I forget. It was nut-related, somehow) oil. I enjoyed the bite she shared with me. Braised short rib was my choice, which came with savoy cabbage, roasted carrot, and fried onion. I was really pleased. The dish was hearty without being heavy, and even had some nice fresh herb flavors in the mix. Overall, a highly flavorful and fork-tender piece of beef, with some excellently-balanced supporting players. Now, I probably couldn't distinguish authentic French food from French Toast, but ladyfriend has been over there a couple of times. She was of the opinion that VIncent A Restaurant was bringing the goods.We had braised prunes and ice cream for dessert, which I enjoyed more than I would have anticipated. I'm no big fan of prunes, as they are just too richly sweet for my tastes. But they worked pretty well in this setting, perhaps because the serving was no larger than it needed to be: a couple of prunes, a bit of (pound?)cake, and a dollop of ice cream. Flavor combinations aside, I can really get behind the trend towards smaller, SANER desserts.The service, from start to finish, was great. We were greeted warmly and seated promptly. Our buspeople were alert and unobtrusive. Our waiter was charming and present, despite handling multiple tables, and without being annoying/cloying. He earned extra points by putting in some extra effort (involving some intense plate balancing) in order to clear our crumbs, without breaking a sweat. Sadly, you don't see that level of service in some of our finer dining establishments, anymore. I've eaten at many places that are more hyped/pricey than Vincent where such rituals are forgotten, so this was appreciated.All in all, I think we both enjoyed ourselves and will put this place on the \"definitely do it again\" list."], ["Jason T.", "Hmm... I'm not too sure about Vincent. First things first, I came here with friends during Restaurant Week. The menu was fixed and I ordered the poached eggs with shrimp and shrimp broth, as my main course. It sounded fancier than that on the menu and I was expecting something special. Instead, all I got was poached eggs, boiled asparagus, cut shrimps, shrimp broth (more like foam) and some veggies - LITERALLY. And it tasted like the way it looked, bland and ordinary. I was quite disappointed. My other friend had the pork tenderloin salad and it was literally several slices of pork tenderloin on a bunch of veggies - also very bland. Dessert, however, was a tad more special. I had the orange marmalade (which came with a biscuit, peppered cheese, bread and nuts). It tasted alright. But my friends who got the nutella Crepes said that it was really delicious, but otherwise quite normal. Service, on the other hand, was a mixed bag. As they were understaffed that day, it took them slightly longer to sit us and even longer to take our order. Will I come back again? Maybe."], ["Jeff Jfood S.", "At my last visit to Vincent's over four years ago I was not impressed with the Vincent Burger. But four years later I am glad I returned because the burger I recently ate was one of the best burgers I have eaten in the Twin Cities.To start my lunch I ordered a Caesar salad. It was a standard salad with lettuce, croutons, a single anchovy filet on top plus an interesting addition, diced tomato, all topped with a sprinkling of grated cheese. It was lightly dressed and good, not great nor memorable.But I was interested to either confirm my previous impression of the hamburger or enjoy what others have told me is one of the best. I was both excited and cautiously optimistic when it was placed in front of me. The Vincent burger is a unique combination...a double-patty of ground beef is wrapped around braised short rib and smoked Gouda cheese; served on a brioche bun; it is a haut cuisine version of a Jucy Lucy. It arrives open faced with French fries. The burger patty was on one side of the bun that contained a thin layer of \"special sauce\" and the other half is topped with lettuce, tomato and raw onion. The ground beef was perfectly seasoned with just a touch of salt. The Gouda was melted and delivered a creaminess to the burger and then the short rib textures and flavors kicked in. This elevated the Vincent Burger from excellent to incredible. The brioche added a little butteriness to the presentation and the sauce gave a few sour background notes. The burger was incredibly delicious. The fries were not in the same league. They were tasteless, cool and bland, more than likely came from a big frozen bag, deep fried and added to the lunch plates. They are the only reason this is 4 and not 5 stars.Overall, the Vincent Burger is an outstanding combination of flavors and textures and ranks as one of the best in Minneapolis."], ["William C.", "I've been to Vincent twice, once for lunch and once for dinner.During my most recent visit, we had the Lobster Bisque, Mushroom Risotto, Pan Seared Beef Tenderloin and the Cassoulet.  The bisque was amazing!!!  Full of flavor and real lobster; extremely smooth and the flavor wasn't TOO sharp like you find in other lobster bisque.The beef tenderloin was very well done.  The braised onions and bordelaise sauce was a great combination with the tenderloin; of course, it was cooked to perfection.I had the Cassoulet, which is a Southwestern French dish.  It's made with Tarbais white beans, preserved duck, ham and two kinds of sausage.  The flavor was excellent!  It was not gamy and the beans added a nice texture to the meat; the beans actually carried a ton of flavor after the dish was baked.An overall wonderful experience.  Our server that evening was amazing and extremely friendly :-)"], ["Alicia M.", "Great meal and great service. The location was right by my hotel (Hotel Ivy) and reminded me of a beautiful restaurant in Paris. White tablecloths and all. I had a quick business lunch and both of us ordered the savory crepes. Delish!"], ["Tom S.", "Work team of 17 went here on a Monday night. We even called a couple of times in the middle of the day to make sure they understood we were 17 strong. They obviously do not know how to deal with large groups. The group leader was trying to order wine...several times fail. The rest of us sat there for 45 minutes without so much as a offer to bring cocktails. The joint was empty.....and no service.  so..very French!That aside, the food was wonderful. Tasted every appetizer...all fabulous. I had the beet salad and braised lamb shank and both were excellent.I will go back with group of 2 ..."], ["Jennifer S.", "In for a post Orchestra Hall concert glass of wine, around 9:30pm.  Synopsis:  Excellent service!I found it so much better to be out enjoying the area around Orchestra Hall instead of idling in a car and waiting to exit a parking ramp with hundreds of others.We walked into a dimly lit bar area and took a seat at a table at the back.  We were pleasantly and warmly greeted by one server and we were told the bartender would be with us momentarily, or else he would return to us.  He then gave us a wine menu.We began perusing it and noted some very detailed descriptions of wines by the glass.  We selected a single glass of a Pinot Noir from France and and said that we'd like to share the one glass.  The bartender cheerfully poured a serving between two glasses and brought them to us.  We picked up our glasses and stuck our noses inside to inhale the wine's aroma, and... nothing.  We looked at each other, perplexed.  I dared to swirl a bit and then take a small sip.  Huh.  I found little flavor going on in that wine, nothing like what was described in the wine menu.  We each sniffed our liquids again.  Nothing.  Looking into my companions eyes, I smiled (smirked is more like it) and said, \"Have we become wine snobs?\"  We both began laughing.  \"Why yes, I think we have!\", he said.  My companion went to the bar to let the bartender know we did not like the wine and asked to instead get a serving of the California Cabernet split between two glasses.  Moments later, the bartender cheerfully brought us our new pours and removed the offensive ones.  Our second choice was spot on, even if several more dollars for the serving.  It was well worth it.That kind of cheerful, no-guff service is hard to beat!  I look forward to returning here for a meal along with some delicious wine! FYI:  We inquired about bringing in our own wine and learned they have a $25 corkage fee."], ["Maddie S.", "The food is fantastic. As a vegetarian the waiter was very nice and helped me find something to eat (that I would like). My brother got the Vincent's burger (and thought it was fantastic). The atmosphere is great, great decor, and nice people. I would definitely suggest going."], ["Scot H.", "decent food, service was great, got to sit outside...always good.  i had escargot and poutine, a bachelor's meal!  so yummy!"], ["Rob S.", "One of the absolute best culinary experiences of my life. Really outstanding.  Each course prepared beautifully and presented in an artful fashion. This is a dining experience not just diner. Take my word for it I would fly to Minneapolis just for diner hear."], ["Erik A.", "I was on a burger eating roll the week back in MN... looking for some great burgers and I was pretty happy with what I found.  The \"Vincent Burger\" with braised short ribs and Gouda cheese stuffed in it was pretty unique.  I will say it was a tasty experience - I'm struggling with the $15 price but it was an experience.I only grabbed the burger so can't speak to the rest of the main menu but other have told me it is very solid.The atmosphere is nice and the service was very good."], ["Jen W.", "Went back again last night, this time for dinner in the dining room.  Again, it was divine.  The best gnocchi I've ever had, both in term of taste and texture.The waitress offered us complimentary glasses of wine when our entrees didn't follow our salads immediately, which was nice but unnecessary as the wait was not unreasonable.  Vincent tops my list of best restaurants in Minneapolis."], ["Andy D.", "Must get the Goat Cheese filled Peppadew peppers!Great cocktail menu!"], ["Mariel L.", "I've been here several times now and I can comfortably and happily say I'm a fan of this place. Their lunch options are reasonably priced...and if you catch them during restaurant week, you get three courses for $10.I think what really tipped them over to four stars for me is their ridiculous happy hour; they wanna spread the happy so much they do it twice a night. :) But I've only been there for the 4-6 spread. The Vincent Burger -- probably my 3rd favorite burger in the Twin Cities at this point -- goes from $14 to $8! And it comes with their delicious shoestring fries. I would totally still pay $14 on any day, so this is really quite a steal at $8. Then, if you want to really want to go from filling to gut-busting, you can get your fries updated to their poutine for an additional $2.75 or something. That poutine definitely rivals the one I've had in Vancouver. Specially since you know our cheese curds here in MN are as squeaky fresh as they can ever be."], ["Nick R.", "The food was very good but the service was very slow.  I would have given it higher stars if I did not have to wait 15 minutes to get my check after I asked for it."], ["Don C.", "I had dinner here with two friends last week. It's a very fine restaurant with top-notch service, handsome decor, and a very extensive wine list. As a result, it's also very expensive, but you basically get what you pay for. We had a bottle of Shiraz for $67 that I thought was overpriced for what it was. My food was very enjoyable: I started with a bowl of Grandma's rustic chicken soup, which was good but didn't blow me away. My entree of olive oil poached monkfish was great. One of my friends had the cassoulet, but she didn't enjoy it that much: she thought it was too rich (but that's the nature of cassoulet, right?). The service was impeccable and the evening was really a great experience. I'm not sure if I'll return any time soon, but this restaurant is worth a visit."], ["Greg D.", "Went to Vincent with my mother and some family friends, not a mother's day event but close enough. The space is very open and inviting. We were there on a Friday at 7 and I was surprised that the there were only a few other parties there and the Bar was empty. Service was friendly but could have been a bit more attentive.Drinks were well made and tasty. I like a cold vodka martini and this one came with just that hint of slush floating in it that let's you know it is perfectly cold. The other mixed drinks our party had were equally well made. The bread basket was a crusty french loaf that was some of the best bread I have eaten recently, especially in the Twin Cities. Crusty and fresh with soft butter. I had the escargot which was excellent and the parsley butter left in the little cups was fantastic with the bread. For my main course I had the rib eye steak which cam with fingerling potatoes and a tomato confit and purple mustard. The steak was cooked perfectly the potatoes were smooth and buttery. The mustard was tasty but there was not enough of it. The others in our party had the lamb shank, which made me regret ordering the steak and scallops which also looked fantastic. Deserts were rich and beautiful, the Port I tried was a great end to a great meal.I will definitely be going back to Vincent some time soon."], ["Jason Y.", "Yeah I love their \"Vincent Burger\".  Ground up beef short ribs and smoked gouda inside!  Wow.  Best burger I have ever had!  Service was great and the place itself is a pretty high end joint!  Check them out!  Quality here!  I will be going back again and again!"], ["Paola M.", "I finally came here on a late night after having snaked at another place, so we only had a couple of smaller dishes which we shared.I will go back to try more and write a more comprehensive review, but I have to tell the world how great their steak tartare! I loved it. First it is properly ground, probably manually, so it has some texture. Then it is seasoned to perfection and comes with the customary raw egg. And finally it is big enough to be a real meal. It is possibly the best tartare I ever had.Will be back to try the rest of the menu."], ["Carolyn A.", "I've yet to make it to Vincent for dinner, but I have enjoyed quite a few lunches and happy hours here.LUNCH: I LOVE the crepes special.  I've almost always ordered whatever the crepe of the day was and the last time I was there, it was with an awesome cheesy/mushroom filling.  With the small side salad that was included, it makes the perfect indulgent lunch.HAPPY HOUR: There are so many fun things about this happy hour: sidewalk patio for when it's nice out, poutine, marinated olives, good drink specials like $4 glasses of wine and more.   But the kicker is that on HH, the famous Vincent burger (stuffed with short ribs and gouda) and fries is a steal at $8 (regularly priced at $14).  My only advice is to get there at the early end of HH as the bar does typically fill up quickly, especially on Thursdays and Fridays."], ["Dan S.", "Lorae and I have been talking about coming here for a long time and finally came in for happy hour on Thursday with a friend of mine.  The dining room is pretty fancy, we sat at a bar table in the bar section.  Their late night happy hour is 8:30-9:30, which is a pretty good time for me, most places have the after work happy hour, which doesn't help someone who usually works until 6:30 or 7.  Or they will  have a 10 o'clock happy hour, which gets to be a little late on a school night. The Vincent burger is $8 during happy hour.  I liked the burger, it has braised short ribs inside and a creamy Gouda cheese.  It is a fancy burger, but still substantial.  $3 beers is a good deal, most places have their special on the cheap beer, but Vincent has 7-8 beers on special, all of them premium beers.  The bar was full of finicky cougars, dressed up for a girls night. I'm sure they had no luck, they were kind of whiny and loud."], ["John H.", "I have dined here multiple times and have enjoyed it each time.Ambiance is top notch.Food quality is above average (grass fed, local farms etc)Food execution is spotty (oversalted more than once)Service is top notchThere are some innovative appetizers here.Prices are what they are."]]}