{"Bay Leaf Indian Cuisine": [["Amanda S.", "The food at Bay Leaf blew us away!  The food was very authentic and so fresh.  The chicken biryani was the best I'd ever had and the lamb curry was phenomenal as well.  You could tell that everything was just made and it made for a delicious meal.  The mango lassi is served in a tall glass and is great!  They also serve the dishes in massive quantities!  Be prepared to have tasty leftovers to take home. I really hope this restaurant sticks around because the food is incredible.  However, they are still working out some kinks.  For instance, the server stood over our table as we signed the check.  Also, our waters weren't refilled until we asked for them.  Last, the music videos playing are quite high in volume which could be turned down to make it easier to carry a conversation.Overall, it is obvious that the owners are dedicated to serving high-quality food and really want customers to leave happy and satisfied.  I wholly recommend Bay Leaf!!"], ["Linda C.", "Excellent food. Our favorite Indian place in Hopkins closed, and I have been missing the wonderful array of flavor  Indian food has... Tonight we stumbled across this wonderful place.Don't let the exterior fool you. The food and service is outstanding. Ambiance: Its like a small deli. Definitely my new go to place for Indian food!"], ["Jeff P.", "I love Indian food, by far my favorite ethnic cuisine. Having family over, we felt like exploring and trying a new restaurant. Saw the good reviews so we thought we'd give it a try.The place was clean and small. At 7 it was empty so we were a little skeptical. Looking over the menu I was surprised to see they have a pretty wide selection of entrees. We ordered Chana Masala, Saag Paneer, Chicken Tikka Masala and Ginger Chicken. Every dish was amazing! Some Indian restaurants \"Americanize\" their food by cutting most of the spices and making everything bland. The food here was perfect. Just the right amount of flavor and heat. I will be going back again. And again.Lastly, the price is great. You get a good helping of food for a low price. We ended up bringing a bunch home and as soon as I finish this review I'm going to have to sneak a few more bites."], ["Chris T.", "So sadly this is a place that has tailored to the locals ruining an otherwise great experience. The staff are really nice, even giving me an additional item because I was excited. However the flavored were good but off. Please increase the heat and reduce the butter! This place really made me miss the San Francisco Bay Area."], ["Rajesh M.", "Food tasted good except the briyani which was very dry, little confusing with a new lay out for an Indian restaurant , good spot for week day lunch not so great spot for a week end lunch"], ["Grace H.", "Normally I don't frequent Indian restaurants but this place was close to my client site and I had an Indian coworker that recommended it.  I guess if you know what to order or have a friend who can attest to \"ethnic authenticity\" results usually are better.  I enjoyed the lamb and the not so spicy chicken with noodles although rice is also an option (obviously since we're Asian).  I wasn't fancy enough to get the most expensive lunch combo but some coworkers did and the white plate with all their selections spread out looked pretty fancy.  I just opted for a take out box because their portions are pretty generous and I can never finish in one sitting.  One potentially confusing factor is their sign still says \"soups n wraps\" above the store.  My hypothesis is that they recently re-branded to Bay Leaf but wanted to be cheap about the signage or they are still working on getting a new sign.  They still can do wraps on request though since a coworker who couldn't handle any spiciness got special treatment and his wrap was deemed satisfactory for those usually not adventurous enough to try authentic Indian food.  Parking isn't a problem since it is in a strip mall.  Also, there's short term parking in front if you just want to do take out."], ["LB L.", "What?!?! Great Indian on Shady Oak? At a Soups and wraps place?  What is it? Why the naming weirdness?  Who cares as long as the food is good...  And it's not just good, it's great!  We got the naan and roti ( loved the naan and want to do the garlic naan next).  Then we got butter chicken (to die for!), palak paneer (excellent, but couldn't compete with butter chicken) and Singapore noodles with shrimp (yes!!!!  Delicious just like in Singapore!)They do take out and I have just found my newest go- to Indian place in the Twin Cities!"], ["Latha P.", "This is the second South Indian restaurant in the twin cities that serves authentic South Indian food. A better Hole In the Wall strip mall Indian restaurant. Appears clean and take out was quick and nicely packed. Chicken Biriyani had too much spice mix and planner kadai was just average. Chicken chettinad  and ginger chicken Indian style were mediocre.The mutton biriyani is worth the drive to this place."], ["Gary L.", "This was a good find!  Thank you Yelp for helping us find this restaurant. We tried this place for dinner on a Saturday night.  We were very impressed with the food and courteous staff.  The owner was over many times to be sure we were satisfied. Very unpretentious. The food was wonderful.  Just the kind of a little place that I love with great tasty food that is not overpriced.  Our new takeout place for Indian food as well.  Enjoy!"], ["Siva Sankar G.", "Best Food vs Money place.Quantity for Price matching is very good.best place for Business lunch.Choice of currys and rice.simple kind of Buffet."], ["Bob P.", "Outstanding Indian cuisine!  We stopped in on Friday for our first time for lunch.  We had the Chicken 65, Butter Chicken, and the Goat Byriyani, all 3 were wonderful!  Lots of flavor in all 3 dishes.  The staff was very friendly and attentive.  One of the other reviewers nailed it when she described the ambiance as that of a small deli.  Perfectly sums it up.  The only reason I didn't give them 5 stars was the cleanliness.  All of the tables inside needed to be wiped down, and the plates and glasses removed from the top of the trashcan. They were ready to slide off.  We will definitely be back!"], ["Rao P.", "Recently we have been going to Bay leaf Indian cuisine in Eden Prairie, MN for either lunch or dinners. We tried various Indian restaurants during our past 45 years of our  living in Eden Prairie, MN. One of those we liked in the past was Curry and Noodles in Hopkins, MN. Now the same cook from Curry and Noodles is the main chef at Bay leaf and maintained the commendable standards in regard to cooking and taste of the food items. I THINK THE FOOD TASTE IS THE BEST and is at 5 star level.  We love it."], ["Kenny D.", "Delicious fresh tasting food. Samosa Chaat and chicken#65 were particularly tasty. Great addition to area and best Indian a food for many miles. A must try for all."], ["Josh L.", "Delicious, fresh Indian food with friendly service!  I frequently go here for lunch and feel like it's one of the best places around in general, not just for Indian food.  I recommend it highly.  It is adjusted to be less spicy for lunch so Minnesotans are turned off by it, but the food is still delicious."], ["Ajay S.", "Went to this place for a lunch with friends ,this place had a decent decorum and food was tasty ,so was the waiter who served us.Definitely looking forward to go again."], ["Alex S.", "WOW, what a gem this place is! If you're in the area (and even if you're not it's worth the trip) you MUST check this place out. Don't call ahead for lunch, just show up and point to what looks scrumptious (it's all scrumptious) and they'll pile it into your container. 2 entrees delicious rice and fresh naan for 7.95, are you kidding me!? I also hear they have an all you can eat lunch buffet on the weekend, I'm considering making the extra commute on a Saturday just to try that out. 5 stars, no doubt - LOVE THIS PLACE."], ["Rakesh Kumar V.", "All the chats items are simply awesome...specially th samosa chat is simply makes me come back again and again....excellent customer service people are so kind and nice...place is little small but kept clean and neat..."], ["Akshat K.", "Worst experience.....Served us food as if we have bought that from grocery store. It was a shame.."], ["SreeKanth V.", "One of the best restaurants that showed up in Minneapolis in recent times... service was good but they should try to keep things on time rather than keeping wait on customers... Chatpatta chicken and mango lassi are my favorites here and biryani has got that authentic taste... will go again for sure"], ["TSaj M.", "Still our favorite Indian restaurant in the neighborhood. Consistent taste and service. Little spicy but I like it.However it looks the the quantity of meat in Biryani's are getting reduced over the period of time. Last boneless lamb Biryani ordered has got significantly less meat than previous orders I made. If intentional this practice may shoo away the customers, else the chef has to be carful choosing meat, rice proportions in food. Hence 4 stars.Tried some 'lamb josh' curry and naan, great.Also got a free mango lassi to compensate a past billing error, which was great. Now we have a new item to add in every order."]], "Indian Zayka": [["Karena D.", "First time at India Zayka, I had by default dined there due to a bad experience with seating next door at Classic Saigon. The server greeted me at the door & gave me options of where I wanted to seat. He was very attentive & personable. I appreciate the good service I received & the Lamb Rogan Josh & garlic naan I ordered was absolutely delicious! I got the Rogan Josh in a level 3 spice, but I underestimated how level 3 was NOT as spicy as I feared. It wasn't spicy at all, so next time I'll try a 4 or 5."], ["Mahesh K.", "Forget food, go here for the fantastic customer experience. The owners are warm and hospitable. The food is fresh and delicious with plenty of options for vegans and vegetarians. It's a different kind of Indian restaurant experience. The spread for the buffet was expansive. The dosa was crispy and the potato curry stuffed inside the dosa was cooked perfectly. I have had gobi manchurian and baby corn manchurian on different days and they were both the right amount of crispy and extremely tasty. The gravy dishes were phenomenal. The owners prepared a special mushroom vegetable kadai dish for our table just because we were vegans and there were \"only\" 2 other vegan gravy dishes already on the buffet. Since the naan at most Indian restaurants is made with milk and sometimes eggs, the owner got us tandoori rotis on the house. Very accommodating. It almost felt like eating at home."], ["Joella B.", "My husband and I went here today for the first time. I was impressed from the moment I got to the door. As I arrived they came and helped me with the door. The service for the rest of time I was there was shown by how they greeted me, kindness and helpfulness.Once we were seated they quickly got us our drinks and let us serve ourselves from the buffet. My husband had a mango lassi and it was one of the best I've tasted, rich and lots of flavor with just the right consistency.   The dishes from the buffet were well seasoned with being highly spicy. Just right for my husbands preference for milder food. The richness of the flavors convinced me that must come back here again at dinner to sample something with more heat. One of the highlights was their tandoori chicken which was full flavor and perfectly moist. The dishes included a small selection of desserts including my favorite, kheer. The kheer was sweet and mellow a delicious end to a wonderful meal. The items on the buffet change daily so I expect it will be a tasty new experience every time."], ["Dana W.", "Vegan recommended.  We went for a lunch buffet and not only had plenty to choose from, when the owner heard we were vegan, he made a special entree and special vegan roti for us at no extra charge.  All selections were awesome.  Great layered flavor.  I hope vegans support this place because they go above and beyond the call of duty to please!"], ["Martina R.", "While flavorful, the food delivered to the table was cold, in particular, the samosas were still \"fresh from the freezer\" cold in the middle.  Also, very rude service by the woman, whom I assume is the owner, when she was unable to accommodate a special, but easy dietary restriction.  We will not be returning."], ["Steve S.", "This is a local favorite of mine. The weekend buffet in particular is a great value. I'm a big fan of their chicken makani, naan, samosas, and curry. The restaurant itself is always and the staff, including the owners, are always very helpful and courteous. There are other options for Indian in Eagan but Indian Zayka offers the best end-to-end customer experience."], ["Ben W.", "I was very pleasantly surprised by Indian Zayka.  I've eaten a lot of Indian food and I'd say this is quite good.  The Chicken Methi Malai is great!The lunch buffet is acceptable, but not amazing.  The selection is just a bit limited, but they change the items each day at least."], ["Rosalind S.", "Where shall I begin? Me and my husband went to the restaurant for lunch. The food was cold, bland and unappetizing. The beef vendaloo was just vendaloo (means potato), the owners did not replenish the beef. The naan was flat instead of fluffy and soft. Their Chai was bitter, basically the best thing there was the cool, refreshing water! I wouldn't be accused of being a customer there ever again!"], ["Alex B.", "Is this the best Indian restaurant I've been to? No.  Is it super authentic?  Maybe not.  But this is Eagan.  I can count the number of non-chain restaurants in this city on my fingers.I'm really glad that Indian Zayka exists.  It is clearly the best option if you want Indian food short of driving into St. Paul.  Lunch buffet is a good value, menu is diverse, and the price is reasonable.  Is it Sambol?  No, it's not.  It's also not Applebees."], ["Peter W.", "Visited for lunch today.  The buffet was way above par compared to most.  Everything was piping hot and fresh.  Such a wonderful variety of dishes.  The atmosphere is elegant and the staff/owners very warm and welcoming.  I will be returning as soon as I can!"], ["Tam N.", "I live around the area and its very convenient.  Food is comparable to India palace in Burnsville which I also like.  Their chicken vindaloo/curry, naan bread, biryani rice is always spot on.  Spice level can be made quite hot which I love.  Good customer service as well! Good for takeout or dine in."], ["Blue N.", "Lunch buffet is awesome. It's more expensive on Fridays, because they have a special stir-fry dish. Great variety. Customer service is excellent. Friendly, attentive staff. Fills water and removes plates promptly. Highly recommend!"], ["Samuel W.", "This place (formerly Sambol) used to be amazing. I was absolutely in love with the murgh shorba and would make special trips just to get a bowl. It was creamy, rich and loaded with tender chicken... I can still taste it when I think of it and my mouth waters.Sadly, it and many other things have changed. The soup has turned into this overly thick, hamburger helper tasting concoction that is overloaded with unpleasant chunks of dry chicken. The first time I ordered this soup and ended up with this, I thought they were just having an off night. My worst fears were confirmed when I realized that it was a permanent disservice.As mentioned, however, the soup isn't the only thing that has undergone a transformation. Their curries were always outstanding. I could've been stuffed and I'd still lick the spoon clean after happily loading the leftovers into containers.Their thai coconut curry with chicken was, by far, my favorite.It has gone the way of the murgh shorba. I couldn't even stomach two bites... the entire dish smelled (and rather tasted) absolutely terrible. The chicken was very overcooked and sitting in an odd colored creamy sauce that reeked of burnt rubber. When I told the waiter he said it was because they \"roasted the spices\".  For the record of the readers of this post, my girlfriend also smelled and tasted the curry and recoiled in disgust. She agreed on the burnt rubber aspect of the dish.Ugh.My girlfriend and I used to absolutely love coming here... it was one of our \"date night\" restaurants, actually. The atmosphere remains very pleasant despite the changes in the food and the staff is always extremely polite. But a restaurant without edible food is like a hotel with no rooms. There's no point in going, no matter how great everything else is.I and several others I know will certainly not be returning. The quest for a new Indian restaurant begins."], ["Amy C.", "It's great to have a solid Indian restaurant back in Eagan again!I see several reviewers writing their critiques under the old Sambol page.  I think Indian Zayka warrants a new entry because it's improved so much over the previous ownership.  The menu remains almost the same, although I can't order dosas anymore off the menu, which saddens me.  The improvement in the new management is significant and it was much needed.  Food is served hot and fresh, no more hard, dry naan.  More intense flavored food, served piping hot.  Friendlier and more attentive staff, and they ask what spice level you prefer.  Decent portions, my daughter and I find one entree with appetizers is plenty for the two of us.  The kababs and tandooris are wonderful, and you can't go wrong with the lunch buffet.  Fridays and Sundays are my favorite days to visit.I'm a huge fan of the Alu Tiki and accompanying chutneys, so good.  The samosas and pakoras are also excellent.  Rice is always perfectly cooked.  One item not on the menu but available if you ask, is Sambol itself.  Sambol, or sambal, is a condiment made with coconut and chilis, and is a fiery delight.  I first had this dish under the previous management's reign, but after trying it at Zayka, I feel as if I've finally eaten the dish as it was meant.  Love it!"], ["Kjersti B.", "Wow! So delicious. The rice is so fluffy and lamb so tender. The service is also excellent. I'm gluten and dairy free and when my order was taken they knew exactly what to recommend.  Excellent."], ["Lisa M.", "Cute place for a strip mall!I had never been to the old Sambol place, but a coworker and I checked out the buffet recently at lunch.We arrived around 11:45 and were seated and offered drinks right away.  I looked around noticed how well maintained and clean the place was.  It had cute decor and looked kind of fresh for a strip mall.The buffet was huge and really fresh.  Sometimes the naan and the battered veggies can get soggy and gross, but these were crispy and fresh.  The buffet choices were on line, so that helps you decide if the buffet is worth your time.  I thought it was.  My favorite was the big plate of Deviled Chicken.  It was on a giant wok like thing in the middle.  It had fresh veggies around the outside and it was steaming hot.  I also liked your standards like lemon rice, tandoori chicken and chicken tikka masala.The prices aren't posted on the website, but I did learn afterwards, Fri, Sat and Sun prices must be higher - $11.99 at lunch - but they do have more choice than during the week.  If you are in the neighborhood looking for something different, I say check it out.  Oh, and don't pass up the balls.  We now love Gulab Jamun!"], ["Jason M.", "Great place for Indian food in Eagan. In town for work and we decided to go for Indian since a coworker had never tried it. We had heard good things about this place and decided to go. Nobody was in there when we got there and we were taken care of immediately. My cup never went empty once and service was great (except it took a long time to get the check, but we did and to for quite some time so we are also to blame I guess). We shared there dishes, mine being the Tikka Masala. Best I have ever had! Places like this make me want to eat Indian everyday!"], ["Nicole F.", "If you live near Eagan and like Indian food....this is a must! Nothing I've had has disappointed. Naan, Tomato Garlic soup, Chicken Buryani, Tikka Masala, anything w Paneer...I've only dined in once (gotten take out several times), but to my knowledge it was good service...no memorable moments amazing or bad I guess. Yum yum yum."], ["Dan F.", "The garlic naan is a must have-get the sweet one for dessert though.  I was very disappointed in the Sri Lankan curry.  Any evidence it had coconut milk as described had been cooked away long ago and I have a great set of tastebuds.  The servers were a bit stressed, but did well.  I would advise the owner to take his yelp reviews seriously because we want good Indian food in Eagan and the criticisms are very fair."], ["Tina D.", "I too, was deeply depressed over the loss of Sambol, where the service was mediocre, but the food amazing! When I questioned the name change, the new owner assured me that people were so grateful he was back. What?! Apparently, he owned the restaurant before Sambol, one that I despised. In giving the new place a chance, I ordered some food for take-out. My first response was it was ok, but not nearly as fragrant or flavorful as Sambol. Although my friends refer to me regarding  Indian food, they are curious as well. One friend took advantage of a Groupon deal to try it out. Just to clarify, isn't the idea of a Groupon supposed to help businesses promote themselves?? My friend invites me along and we go on a Wednesday evening. This time the food has improved. However, when the bill comes, the owner walks over to ask for the Groupon (kinda like he's mad that we have one), rings it up and adds gratuity. I don't mean to assume, but aren't 18% gratuities sometimes added for parties of 6-8 or more? We had intended to tip on the \"total amount\" like we are asked to by Groupon, but whatever. As we finish our drinks and conversation, the owner walks over and asks if there is anything else he can do for us, otherwise can we please take our conversation to the waiting area so that they can have our table for other customers? Apparently, he felt people were swarming the restaurant to get in on this Wednesday evening. We look around and there is no one at the door, four empty tables around us, and about four more on the other side of the restaurant. Are you kidding me?! I would've complained to the manager, but I'm pretty sure the owner of the restaurant is about as high as it goes... unless I can go to his mama to teach him some manners. Needless to say, we felt unappreciated as customers and will not likely share any great experiences this time with our many friends (and after 23 years here, we have a lot of them)!I know it's a drive, but Bukhara Indian Restaurant in Wayzata is OUTSTANDING in both food and service and worth the drive!"]], "Persis Indian Grill": [["Anil M.", "If you have ample time at hand, you for sure had evening snacks this is the place to be.The service is a little time taking but the Food is as close to Authentic Indian as possible."], ["Aldwin C.", "All good. They have vegetarian, chicken, lamb, goat and shrimpThey are not timid in heat and spices. So order a mango lassi to cool offTheir are plenty of seeds and spices that they use. Cardamom in their biryani.They have a great lunch buffet. So you can taste many of their main dishesTheir wines by the glass is around $5. They have 3 kinds of Indian beers. To complement your meal"], ["Bill S.", "How can a restaurant have only an eat-in buffet lunch during the day?No takeout until after 6pm.Not even the lunch buffet to go. I work in the area, but cannot do their lunch buffet. I get off at 4pm, and I live in Woodbury. That means Persis will not ever make money on me, which is too bad for both of us, because I really liked what I saw on their menu. There's a place in Maplewood called Charminar Biryani House, and they have a similar menu, so I can get dinner there, but MAN! would I love to be able to get lunch takeout at Persis!Somebody show them the error of their ways please. sucks..."], ["Leslie A.", "Wow there weekend brunch rocks The food is delicious and better than any other buffet I've been to as far as quality. Went in there once where we ordered off the menu it wasn't as good as the brunch options. Butter chicken is delicious potato soup was amazing!"], ["Lisa M.", "Pretty decent!This place isn't far from my office so I grabbed a couple of adventurous eaters (not many around my work place if this is what you call adventurous) and we headed out.  Now, the first time we tried to come, it was Monday and it was closed.  We finally got there later in the week and had the buffet.  Inside the place is very clean, modern and decent looking for a joint in a strip mall.The buffet had plenty of choices, so I think we tried almost everything and liked just about everything offered.I'm far from an Indian food expert, I just know what I like and I liked everything I tried.  Nothing was too spicy and the staff kept the food fresh and full.  And, the naan was always more, without being soggy, which is buffet bonus.The place was busy at lunch, so I recommend getting there early-ish."], ["Brian S.", "Before eating here, I had questions about whether a suburban strip-mall restaurant's food would merit four stars, which is the average rating of the 29 Yelpers who'd reviewed it before me. I left wishing I could give it closer to 4.5 stars.First, the good: My dining partner and I arrived at 5:50 p.m., 10 minutes before the restaurant reopens for dinner. We were pleased that the doors were open; we didn't get stuck standing in the cold. I've probably eaten at 50 Indian restaurants, and this one had some menu items I hadn't seen before. We tried the dosa, a crepe with a filling similar to those of samosas, as an appetizer and were impressed. I was similarly pleased with my entree of nellore fish curry, accompanied with rice and garlic naan. It had a good kick to it, and the fish was plentiful. My dining partner was less pleased with her chicken chettinadu, which she hadn't expected to include bones. It was gristly and wasn't as spicy.The menus we were given didn't mention that any non-alcoholic drinks were available. They were, and we enjoyed our mango lassis.The bad: Service was slow, which I attribute partly to the fact that we arrived a little before the restaurant reopened. Had the servers and food each arrived a few minutes earlier than they did, this place would be closer to five-star territory.As for the strip-mall location, now I know better than to judge. Persis is superior to any of the Indian restaurants I've eaten at in the Twin Cities' more \"urban\" areas."], ["Patti I.", "A big group of us (6 adults, 2 kids) had the weekend lunch buffet here. First off, buffets are the bomb when you have kids: no waiting, and you can get extra bits of what the kids like. Here, that means lots of rice and bread, as the entrees are mostly quite spicy.Strategy is important. On the first go-around, get a dab of each thing and on the second trip, go back and pig out on what you really love.The selection was generous: several types of breads, steamed and baked; onion griddle cakes; two kinds of rice; two soups; lentils; several vegetable dishes; several meat dishes including goat curry that was really flavorful, and a couple desserts. There were lots of distinctive tastes and with a little sampling we found a few non-bread items that the kids could handle. Plus we got mango lassis all around in case anyone's taste buds got a little too fried. MMMmm, smooth and delicious!Definitely worth a repeat visit!"], ["Subash S.", "Me and my friend wend to this place for dinner and we really liked it. Great place, great food and most importantly clean. Definitely will come back for dinner again. I heard they have really good buffet also.So we won't mind coming back for lunch buffet."], ["Pranav T.", "The 5 stars are not necessarily for the best food and best ambience or a best experience, but it's the best when it comes to getting Indian food in and around Minneapolis. I have eaten at most of the Indian restaurants in Minneapolis and this stands out purely on the basis of taste which to me is as authentic as it can get in and around Minneapolis. Some of my favorite dishes are Chicken Chettinadu, malai kofta & shrimp curry. The chicken biryani is always a good option."], ["Viroopa V.", "This has got to be one of the most authentic Indian restaurants I've been to in the Twin Cities area. I went to a lunch buffet on a Sunday and they had very non-standard Indian buffet food (pongol, mutton soup, soft idli) all very fresh and home style cooked. Roti and Khadhai Paneer was really great. Service is really fast with plates being cleared quickly. Place is very clean for an Indian restaurant. Chai was awesome. Wasn't a huge fan of their chicken wings and don't go here if you're looking for low calorie food because the food has a good bit of ghee and oil."], ["Lyle D.", "Food used to be good when it started. Now the quality has reduced drastically. I see a lot of food wasted on every table , I'm sure that everyone feels the same ."], ["Steve S.", "I struggled a bit with this review. The buffet offers a broader selection than some of the restaurant's immediate competition. However, I've found that they struggle with managing the weekend rush. On multiple times I have ordered a beverage only to have it never show up. However, at check-out I am almost always being charged for it and I need to point out it never arrived. The owner usually doesn't apologize. Anyhow, I would say the food is a solid 4 stars but the overall customer experience is 2 stars. I'll split the difference and give it combined score of 3."], ["Luca R.", "Came here for dinner with my wife and two small kids. We got water glasses for the adults and plastic water cups with straws right away. Service was polite and fairly quick.The vegetable samosa appetizer was very good; flaky and hot with a slightly spicy potato and pea filling. The two large samosas came with a delicious sweet sauce.There are many options for both vegetarian and meat dishes. We ordered one with eggplants, peppers, and peanut curry, and one of my favorite standbys, palak paneer (a creamy spinach dish with chunks of homemade cheese), as well as a side of garlic naan.The eggplant dish was VERY spicy. It was delicious! They're definitely not afraid to turn up the heat here. The palak paneer, which is often quite mild, was decently spicy as well. Just enough that the kids couldn't really eat it, but my wife and I both enjoyed the entrees very much. The kids were very happy to eat rice, naan, and pieces of samosa pastry.The entrees were filling and there was enough left over for lunch the next day. Prices are very reasonable.I'm really looking forward to trying the lunch buffet when I get a chance. The one disadvantage of coming at dinnertime was we couldn't seek out a few milder options for our children, so when both the things we ordered were too spicy, they just had to eat rice and bread.Highly recommended!"], ["Johnny A.", "This joint is always hit or miss. I don't think I ever will return here again + all your curries kind of taste about the same."], ["Billy D.", "We went here on Sunday afternoon for the infamous \"weekend buffet\" and were really impressed at the selection and quality of the food that you get for $14.95. It was packed to the brim. The chicken drumsticks were awesome, sauces really flavorful, goat soup was goat-y and delicious, and the curries were spicy and tasty. Definitely will be back to try the regular menu."], ["Marsha W.", "Before I ate here, someone told me that this was a type of chain/franchise and for some reason, that kind of ruined the experience for me and I am not sure why. It doesn't at all strike me as a franchise in a Jimmy Johns sort of way. Well, it's in a strip mall in the burbs but... I was seated immediately for a Saturday night. Also, the saag paneer and Riesling were lovely.  I felt like the curry was an appropriate level of spicy-ness for someone who wants their curry really, really hot. The food did not strike me as been a bland American version of Indian food at all. The waitress was very nice and attentive also. Our water glasses were always full and she checked in on us often.  This restaurant is pretty good choice for Indian food in Eagan, and , if I lived or worked in Eagan I would consider eating here more often."], ["Karl W.", "If you have a stuffed up nose or head cold, this is the place to come. The lunch buffet has a large variety of food and a majority of it is spicy hot. I had some Rasam soup and instantly had mucus running out of me that I didn't realize was built up. The peanut Marsala dish was my favorite. For an Indian buffet, this is the largest I have been too and love the variety. Very popular with a lot of traffic in and out. When I arrived someone was catering around 20 large 5 gallon trays of food out. Only downside is the atmosphere and location in a strip mall in the middle of a Dollar Store and Big Lots"], ["Bob M.", "This is the best Indian food in whole twin city. However, they have a good problem, whip is  the restaurant is always crowed.. They need to expand their dining room or relocate to a bigger place or allow take out during the day time. I doubt any other restaurant is as good as  persis."], ["Paul L.", "Never had Indian food before. I personally am not a big fan of the flavors that are used, however I found the food to be very dynamic in nature and high quality. If you have an exotic taste in food I would highly recommend."], ["Latha P.", "The food is out of this world and the service is is even better. Maruti at front of the house and chefs at the back of house are courteous, customer focussed and extremely flexible to go the extra mile to accommodate your request. A must try if your want to enjoy good indian food ."], ["Gary S.", "Great lunch buffet , they don't tone down the spice for Minnesota. Will go back soon"], ["Arun S.", "Awesome food on the buffet."], ["PJ B.", "I am by no means an expert on Indian food! Having said that, I found the food absolutely outstanding.  Fresh, flavorful, high quality, wide variety (the buffet has one line of vegetarian, and another line that includes meat).  One of my complaints at other Indian restaurants that I've been to us that the cuts of meat are low quality and dry ...but I have absolutely no complaints with Persis.  The chicken was moist and meaty.  Will definitely go back again and bring others!  (p.s. - I always think it's a good sign when I go into an ethnic restaurant and actually see that ethnicity represented in the customer base.  At Persis there seemed to be more Indians in the room than anything else.  A good sign...)"], ["Amanda D.", "Awful service. Amazing food.  Mr.manager, your food is wonderful but you are only one man, and you can't do everything, empower your staff to not just clean (they were wonderful but it was obvious they are not allowed to do anything) so customers do not have to wait around while you run around."], ["Denise D.", "I had the Gobi Manchurian and a Vindaloo. The Gobi was excellent! The vindaloo was good but a little spicy for me. Very good service, Will come here again."], ["Mohamed H.", "Tried dinner to-go and the lunch buffet. By far, the worst Indian food and customer service of the twin cities area indian restaurants and I have been to a lot bad ones...buffet is very limited, food is extremely salty and spicy in their over-compensated attempt at authenticity and at $16, there are better options..try Surabhi in Bloomington or Taste of India in st.louis park."], ["Arun K.", "By far the best Indian restaurant in Minneapolis. Their lunch buffet has many varieties and all their food tastes really good."], ["nav n.", "Go there if you do not care about service and ambience, reservations do not mean a thing and management constantly wants to move ppl out, they behave inappropriately by showing you the watch and placing the bill before you are done! I am not going to eat there again!!!"], ["Anwar C.", "Bad service, arrogant staff and a sneaky cashier, who added gratuity even though I paid as an individual for buffet and I was not informed about it."]], "India House": [["Justin B.", "The food, atmosphere, and service were all very good. I ordered the Chicken Tikka Masala and was satisfied."], ["Taren K.", "The Vegetarian Dinner for Two was absolutely incredible! The entire dinner was delicious and so flavorful from the wonderful appetizers to the nav-rattan-korma (my new favorite Indian dish), the palak paneer, the naans and the dessert gulab jamun to top it off! We couldn't stop raving about the food for the entire meal!"], ["JJ B.", "I went for the lunch buffet. The lack of flavor was astonishing. I had a bit of everything on the buffet, and I was disappointed in how bland everything was. I expected a much stronger flavor profiles. Where's the spice? And not just hot spice, but flavorful spice. . . there just wasn't much there. Apparently they forgot to put hot sauce on the buffet; I saw a sign for it, but there was nothing there. I kind of felt sorry for them. The dining room was nearly empty at lunch time and the waiters didn't seem happy. I used to drive 70 miles to eat at a great Indian restaurant TN. I can walk to this one, so I'll probably try it again with an item off the menu, but it won't be anytime soon."], ["Kim R.", "Just got back from a lunch visit to India House with a few co-workers. I actually have only had Indian food one or two times before, so I am by no means an expert. Since I had no idea what to order, I thought it would be safest to stick with the buffet and sample a lot of different items.THe naan was fabulous. Since the buffet was almost out the waiter brought a hot, steaming basket to our table. The bread was warm and chewy and perfect for dipping in extra sauce. My favorite dish was definitely the chicken tikka masala. I really liked the creamy tomato sauce and the chicken was not too dry. The yellow lentils were the spiciest thing I tried. Everything was hot and seemed fairly fresh. And the had a really nice selection if you are inexperienced with Indian food (like I am). Based on previous reviews, I thought the buffet was $8.99, but it is actually $10.75."], ["Rick T.", "The mango and strawberry lassi's are pretty good to drink but the food from the buffet was not spicy enough for me. But what the hell I love Indian food so much I will go just about anywhere that serves Indian food. I have been here twice and the servers are pretty nice, so I probably be back when I'm craving a lassi."], ["Aimee S.", "Pros: Food is really, really good. The Chicken Makhani is my favorite.The buffet is a really good deal and the food is always amazing.The atmosphere is really cool and you can actually seat a lot of people there. I've been there with just my husband or a group of 14 friends.Cons: Service is up in the air. I've had great service and ok service. The prices are a little high in my opinion as well. All in all, my go to for Indian in St Paul."], ["Eric S.", "Our experience was very pleasant. The server was a very attentive and responsive individual. He was consistently watching our table to see if we needed anything. We were seated very quickly and instantly given water. For a Sunday night it was relatively empty, but the food made up for the lack of atmosphere. Chicken tika masala was good and the lamb vindaloo was rich. Garlic naan is highly recommended."], ["M. A.", "I was satisfied with the take out order of chicken tikka masala and some vegetable side dishes. It was a little greasy and a few too many onions, but overall OK and the service was good."], ["Sean K.", "What a gem!  We love this place and the delightful servers. When we come with our 2 1/2 year-old daughter, the staff are always very sweet with her and bring her a tiny mango lassi or a little veggie plate with our salads. They always surprise us with their kindness. And in addition to warm and wonderful service, the food is great!They offer a nice variety of naan breads and appetizers. My wife always gets the butter chicken. I ordered the lamb shahi korma which was tasty, savory, and a little sweet. I also find the lamb rogan josh to be consistently good. Also golub jomuns. If you don't know what that is then just stop reading this and go get some. Sweet wonders!So India House scores on consistently yummy food, but even more so everyone there makes us feel a bit like royalty. We leave with contented palates and warm hearts."], ["Jonathan M.", "By far the worst place I've had to eat indian food at on multiple occasions. Yes I've been here more then 5 times and every experience is horrible. My cousin loves this place because it's near his house, when I visit we \"have to go here\" well that all changed when I introduced him to what INDIAN FOOD should taste like by dragging him to:India Palace in Roseville, MN.  It's a short 15 minutes away from here. This place serves bar-non the most bland, spice-less, least hottest and most defiantly cooked by White People Indian food ever. Their Naan is sh¡t, people Rave about how fresh it is... I make the yogurt bread myself at home (white guy) and I know why theirs is f*cked up, they kneed the dough way to much, Naan is supposed to be flat, light and Chewy not Dense and Requiring serious oral effort to rip a piece off. Tiki masala,    This is a yogurt and spiced sauce/ marinade. It's not a bland paste smothered over your meat of choice after it's been cooked or boiled as it had next to no flavor without a sauce. Worst of all of this is my girlfriend likes this place (she can't handle TABASCO SAUCE) it's too spicy for her... Indian food while not noted as simply pepper spicy is supposed to invoke you into feeling something along the lines of indigestion problems later that day and a flushing of redness on the skin if it's made right. This places offers non of the benefits of real Indian food from Taste, textures, smells, coloration, nactin flush (blushing/ red skin), or any feelings of chugging copious amounts of milk to sooth that burning sensation on your tongue/ throat/ stomach. Bottom line is this place is to Indian food as Lee-Ann Chins is to Chinese food, dumbed down and Americanized."], ["J G.", "This is our second visit, every Tuesday for the past 2 weeks. The buffet is open until 2:30 which is much better than the traditional 2:00 at other places. We arrived just after 1:00 both times and the buffet was amply supplied with food and they continued to fill the buffet during our visit. They are very courteous and filled our waters as needed. When they collected the dirty plates they even asked if we wanted to keep our forks. The buffet menu was basically the same as last week with a few minor changes. Since Tuesday is the day we can go, I am glad it mostly stays the same. We like it. When they brought the check they said \"no hurry.\" The food is delicious. I asked the cashier if they buy the sauces or if they make the sauces from scratch and he said the owner is the cook and he makes all the sauces. I also asked why they served a beef entrée and he said because it is what the patrons like so they try to respect others requests for beef. He also said there is spicier food for the weekend buffet."], ["Marcel H.", "Lunch buffet is a must.  great service, very fresh, nice setting"], ["Andrea T.", "This restaurant has the best Indian food I've ever encountered.  The seasoning and textures  of the food are perfect, the portions are perfect in that we aren't too full or still hungry after finishing our entrees, and I always leave feeling all around satisfied.  My favorite is their palak paneer. I always get it with their garlic naan and the house tea. The dining area is much larger and more elegant than you would expect.  I love the decor, the music and the customer service. The prices are decent and worth every dollar!  The wait staff is helpful and professional and you never feel rushed to hurry your dinner along. But, most of all, we always come back for their delicious curry. I've told all of my friends about this restaurant and have been a happy loyal fan since the first time I tried it. Yum!"], ["Oops A.", "Not from the area.... But visit often...went for yelp add... Food was not good.. Definitely not good representation of ethnic Indian food .. Felt like expensive Indian fast food..taste that is.. Not service!"], ["Amy R.", "Maybe its because my friend and I have to do the early bird dinner, but we both noticed whenever we dine out, we are always the first ones at the place. We even beat the seniors.Note, this place doesn't open for dinner until 5PM. Samosas remind me of little pot pies. Every place prepares theirs different, but this place was the best. Flaky crust, not greasy and a plentiful amount of meat inside.Spinach Naan was pretty good. I like my Naan a little chewy and chewy it was.I ordered the chicken bariyani. Not the best I've ever had, but it was alright. I'm not a fan of super huge chunks of meat in my rice dishes and this had really big chunks. Ordered spice level hot, and it wasn't that spicy. Came home with a bix box of leftovers. Usually if anything is remarkably good, I don't have any leftovers.Prices are reasonable and very reasonable when it comes to the appetizers. Service was pleasant and attentive.Nice dining atmosphere. More of a 3.5, not quite a 4 to constitute being a fan yet."], ["Natalie S.", "I lived off Grand Ave for a couple of years and I loved this place! I would get take out multiple times during the week because its pretty much amazing. I relocated to CA and I have yet to find a place that satisfies me like India House did. My go to dish was Chicken Josh, Naan, and some extra rice. How I wish I had a plate of this magic right now."], ["Liz T.", "The chicken curry here was amazing. And you can never go wrong with naan bread. Great place."], ["Andrew B.", "Indian is hands down my favorite type of cuisine, and in my opinion this is the best Indian food in the Twin Cities.  That's a lot from me. I am an Indian food aficionado.  Their chutneys are amazing.  The naan is fresh and delicious.  And you can never go wrong with their chicken tikka masala.  Seriously it's so good.  The ambiance of this restaurant is so much fun.  I love sitting in the booths facing the window and watching the people walk down Grand Ave.  But it can get crowded on random nights for no real reason. So I'm also super excited that now I can get it all delivered to my house by Bite Squad!"], ["A P.", "Our favorite spot for Indian in Minnesota. Fantastic service and delicious food. Try the Tandori Dinner for Two, great selection, lots of well grilled chicken, beef, shrimp and paneer. The vegetable samosas are a personal favorite, much better than the beef. They are also quite conscious about spice, we like medium + a nice kick but by no means over powering!"], ["Milo G.", "We love Indian buffets. We love Indian food in general, but it is the intermixing of dishes that really make it for us.Since we were headed to St. Paul, we decided to try a different place that was on the way and headed to India House. The selection was good and the tandoori chicken was perfectly moist. Unfortunately that was all we enjoyed about the place.All the dishes were really salty and on top of that, were completely void of any spice. C'mon, we've had Indian food in the suburbs that was spicier than that! So in the end, there are so many places that are so much better that we are not likely to return."]], "Malabari Kitchen": [["Cailin R.", "We got takeout here and while the food was delicious, the portions were incredibly small and they forgot an integral part of the meal. We ended up having to go get more food later (this time from a different place). I don't think I'd go back here, especially since Afro deli is so close and much better."], ["Sam E.", "We almost missed it because the sign out front says \"South Asian Kitchen\" or something, but thankfully we found our way. It was so cold that we were the only customers in the whole restaurant, and got excellent service from the Amazing Sleeping Hostess, who was somehow able to fall asleep between moments when our table would need attention. She had great recommendations and everything was delicious. I especially enjoyed the lentil donuts and chicken tikka."], ["Aruna R.", "We've tried almost every other Indian restaurant in Minneapolis and the surrounding metro, and we haven't been impressed. We read about Malabari in the Mpls- St.Paul mag, and I've got to say- this place is a burst of fresh air in a stale, repetitive Indian-food scene. Malabari kitchen brings back authenticity to south Indian cooking, making us recall ancient flavors from back when grandma used a mortar and pestle to grind masalas from scratch. It is run by a motivated couple who both cook and serve, and bring the home-style flavors from their table to this kitchen. Because it's mostly just the two of them, there is a significant wait time for the food, but as their menu claims, the wait is worth it! Also, there's literally just 5 tables because the place is tiny, but ambience is very tasteful.The food is spicy, and even though I'm not a spice fan, I was surprised that I could taste the flavors despite the spiciness ( lots of places don't achieve this.)Do try the chai. We have tried Chai everywhere- EVERYWHERE. And this one is the best, hands down. Skip dessert, get the chai. Love. Try."], ["Nihal P.", "I'm Indian, and have spent my formative years in Bombay. So I know Indian food very well. Malabari Kitchen has authentic Indian food from the southwestern region of India. It plays to its strengths, and sticks to a short, relevant menu. I had Beef Ularthiyathu (Beef Masala) for lunch, and chose a side of yucca mash. The mild taste of the yucca was a perfect counterpart to the hot, spicy and flavorful beef. The meat was tender and fresh.If you are tired of food usually found in Indian restaurants, you should definitely try this place. You will not find palappam or idiappam (rice-based pancakes and noodles) anywhere else in the Twin Cities. The service was friendly, unobtrusive and quick. I was given a small bowl of complimentary payasam (a light dessert with mini-noodles) at the end which was a perfect end to the meal."], ["Ravi B.", "By far the most authentic Indian food restaurant in town. Malabar is the south-western coastal region of India and this is micro-cuisine of the type we don't see in Minneapolis. Not your heavy creamy Punjabi fare. Hope Minneapolitans can appreciate it's complexity and variations."], ["Swetha A.", "Excellent Mouth Watering Food .. Everything in menu looks different and tasted really good :)"], ["Jerry M.", "Typical Kerala Restaurant. (Kerala is a southern state in India where Malabari Kitchen's menu belongs)My experience: Crab Curry (Njandu Curry) - 3.5/5 ( Very Spicy. Option of Chappathi, Rice etc as side which is free)Chicken Biriyani - 4.5/5 (Very Tasty. But don't expect typical Kerala Biriyani which has mainly Drumsticks and Thighs. This has shredded Chicken pieces.)"], ["Sairam T.", "Traditional Kerala food.Liked especially the pallapam with coconut milk  and potato curry.My friends had those with Chicken and egg curry which they felt really yummy.The people who serve the food are really friendly named Biju and Bindhu. Everyone of us did enjoyed the food and it's quality.Really Really Yummy..Hole they maintain the same even if they have a gr8 demand.Keep up the quality and good taste guys! Would definitely recommend for someone who needs to try with some really yummy food."], ["Pat H.", "I ate here for lunch today and it was excellent! The potato stew with idi appam was full of flavor and well-spiced, and the rest of menu looked just as appetizing. My server (I think he was also the cook?) was very friendly and informative. But I was the only customer -- I hope other folks discover this place soon."], ["Pravin R.", "We went there few weeks ago, mainly because of the craving I had for the Parippu (Dal ) wada.  It was awesome when I had for the first time.  To begin with, they ran out of the batter by 6PM on Friday even though the Restaurant was not busy so far.  The owner suggested Medu (Uzunnu)  Vada with sambhar curry instead of chutney, and charged me extra $ per plate the sambhar alone.  I never expected this as other Indian restaurants give you unlimited orders of sambhar and chutney for free.  The soft-shell crab curry was disappointing.  The crab was so tiny that seemed like a new born.   It was not tasty either.  The price of $12.99 for that was not justified, if you compare a soft shell crab dish with full size crab for about the same price  at the Pennisula Malaysian Restaurant. One of us was a pure vegeterian and could not take anything hot (spicy).  All she could order was egg curry and the Maitre promised to make it milder with extra coconut milk.  We thought that was a good plan but yet the curry was too hot to eat.  Last  time we went there the Meen Molly had more than 4 jumbo shrimps.  This time it had only 2.  That was disappointing.  On the positive note, Palappam, the wok shaped crisp pancake, was a novelty and delicious.  The chicken curry was still the best.  The tea was good.  Cashew rolls were good too.  Considering the portions size being reduced, I felt this place is bit pricey for the \"hole in the wall\" ambiance. When we left the place, we realized that our clothes enjoyed the aroma more than we did. ;-p"], ["Paul Z.", "Although a whitebread guy myself I was born and raised in Kerala and Tamilnadu, and so think I recognize good South Indian food.   My wife and I just had some at the friendly but unpretentious Malabari, which looks and smells like a high-class place  in Cochin or Trivandrum.   The palappam (a milky sourdough crepe) with potato and meen (fish) curry we had were excellent dishes, and hard to find in the standard US-style Indian restaurant, which serves quite different North Indian dishes.  The vada (lentil-flour donut, essentially) also tasted fresh and hot, and the coconut chutney was well above average."], ["Sundara S.", "real nice food... great service!!"], ["M K.", "My order was completely wrong. The food was extremely oily / greasy!"], ["Gina A.", "We went to this restaurant on a Saturday night and were very excited to try some delicious Indian food and to get out of our hot apartment. Unfortunately their air conditioning was not working so we received no respite. We also were very hungry as we hadn't eaten that much as we had been busy cleaning in the heat all day. We ordered some samosas to start with and a couple of lassis. It took about 30 min for the samosas and they were gone in about two seconds. But they were good. It took another 30 min for our main entrees. I ordered their specialty chicken curry- it was very watery and lacking the depth in spice and flavor I expect from Indian food. My husband ordered the mussels- which were extremely good. We finally received our lassis after every table after us received theirs. I think they forgot. All in all it was a hot, sticky, night there and a long wait for our food. Maybe we came on a wrong night, and everyone that worked there seemed very pleasant but I doubt we will be back."], ["Kara S.", "Wow!  I am hosting a couple from India in a couple of weeks and am completely ignorant of Indian cuisine...with the exception of a curry my mother attempted when I was young.  THAT left me with a distaste for anything resembling Indian curry.  My friends from India are traveling with a bunch of Swedish Minnesotans who think that ketchup is spicy.  They are in desperate need of good spicy food!  As I am up for pretty much any kind of cooking, I started to research Indian restaurants so I could understand the taste profile a bit better.  After reading lots of reviews for different restaurants, I chose Malabari Kitchen.  The owner was very kind and helpful, offering suggestions and tips on how to eat the appams as well as helping us choose a couple different items.  I am now a HUGE fan of Malabari Indian cuisine!  We chose the Palappam with Potato Stew and also* Kozhi Curry (Traditional Spicy Malabari Chicken curry).  Lovely complex sauces, a side veggie that was heavenly, nann that was out of this world, and tender chicken.  All covered in a velvety curry sauce that wasn't heavy.  I usually suffer a little from eating out because of the heavy oil laden sauces.  This time I felt healthy!  Based on the reviews about this place, we ordered the chai tea and were instantly hooked.  After lunch, the owner brought out a little cup of dessert.  Fantastic!  The cardamom dessert was fresh and tasty!  We will be back, next time with friends.  oh...and we made a beeline for the nearest Indian grocery-simply because I MUST have more of this wonderful cuisine and we live too far away to be regulars here."], ["Aishwarya S.", "The most delicious and authentic Kerala food in the Twin Cities!!!And a huge relief from regular North Indian greasy fare which is the only form of Indian food I have so far tasted in town. I can personally vouch for the authenticity since I'm from the same state and city that Biju (the owner) is from, back in India. I would highly recommend the tapioca and fish curry combo. Finger-licking good! Yum!"]], "Kadai Indian Kitchen": [], "Bombay Bistro": [["Gabriel S.", "Great indian food from both North and South India.I went with a friend from India and he showed me how to eat the food. What goes with what and to not use my knife and fork at all.Really good food for vegetarians or meat lovers a alike. Fine dining with a spicy twist and you can get in and out fast over the lunch our in downtown Mpls."], ["Steve S.", "Really good weekend buffet. Offers a broad range of breads, protein, and veggie dishes that are refreshed frequently. Pretty good service with a bright and clean atmosphere. If you are downtown Minneapolis and a fan of Indian cuisine, this is a stop with making."], ["Ellen C.", "I'm a HUGE Indian food fan and have tried Indian food in every city where I've been for an extended period of time (SF, Silicon Valley, NY, Chicago, Minneapolis) and I've never seen what I've always seen in the movies and wanted to try - the \"thali.\" It's the reason I prefer the buffets over a la carte entrees - the round metal platter of variety, the \"thali,\" a couple friends of mine finally introduced me to a place that has it on their menu!! Bombay Bistro!!I ordered the non-vegetarian thali and it came with rice, naan, little bowls of chickpea curry, chicken tikka masala, and raita. The items in the bowls may change but you'll always get a vegetarian, a chicken, and a raita @ this restaurant. It also came with a few pieces of chicken tikka and one little lamb chop. Everything was delicious - it was great to have this much variety and the roasted meats were perfect. Very moist, very tender, very flavorful. The curries were okay, could've been richer, but was still a great pairing with the carbs on the plate. The only drawback was that this thali was $27, which I thought was a little pricey.The staff were friendly, but they checked up on us a little too often. They forgot one of my friend's drinks but wanted feedback from another friend who didn't eat much of her entree, to see how they could better improve the dish in the future. All in all this place is great - cute and cozy decor, good for a date, good for a friend get together, good food. It's a little pricier than I would like though, hence 4 stars rather than 5!"], ["Rajesh M.", "Good buffet options.. They have dosa in their buffet .idli and other items are some time very dry.. Entrees and curry are good enough..service is average at best"], ["Jack P.", "Got here towards the end of the buffet time and they let us in, but there was just a bunch of empty sauces with no food left in them. About half of the serving trays were empty, but what little food I got to taste was not bad, with one exception: I think I ate some rotten chutney which gave me gastric trouble for the next few days.  They should not have charged us full price for a buffet which had hardly any food left."], ["Sam Y.", "I took my family there for lunch buffet over the weekend.  The food is better than average, but of the 1/3 of buffet was out such as dosa and others and they never refilled. I was there around 1.30pm, so mid lunch time.  That was disappointing.  Also when called, the lady on the phone said $13 and change for the buffet price. They actually charged $14.95. So yes the weekend buffet price is $14.95."], ["Brittany G.", "Excellent food here, and reasonably priced for Indian food.  With tax and tip, the weekday lunch buffet is $13.80, which isn't bad considering the amount of food and the cost of a lunch at other locations in the skyway. I believe there's also a cheaper take away buffet option as well.  Staff is polite, food is delicious and varied, and I'm not constantly spitting out chicken bones like I do at some other Indian places downtown. I like to come here a couple times a month with friends."], ["Alexander V.", "Very underwhelming. Came here for the lunch buffet and was treated to good, fast service, but bland food. I liked the naan dipped in the chicken tikka masala sauce (all the chicken had been scooped out of the dish when we were at the buffet). Will probably stick to Kadai."], ["Amelia M.", "Have never seen such a large Indian buffet before. Only been on the weekends so not sure what the weekday buffet is like. Superb food, nice staff and good variety all around. There are two types of buffets; northern and southern of you walk in one side you will see the smaller buffet - just ask them to point you to the other buffet and you will NOT be disappointed"], ["Makshita L.", "I visited this restaurant for the first time today after reading the reviews here. I went there with a friend and at first, we were amazed at the variety of dishes they offer in their menu... The lady server (an elderly lady) was courteous. There's a HUGE variety of dishes to choose from! We decided to order paani poori and mixed veg uttapam to have something different from the usual food we eat at home.. We were informed that they do not have South Indian food for dinner, which is okay! So we ordered manchurian as an appetizer. Before we were served our paani poori, the server appeared again to ask for our order. When we told her that we aren't here for entrée and would like to have different appetizers, she got so upset and the expression on her face was really unpleasant! Also, we had planned to have kulfi in dessert but we received our check while we were still eating. So we decided not to order it. It seemed like the staff here felt that we were a waste of a guest to invest their time and energy on.. However, I'd like to give a perfect score for the food as it was spicy, tasteful and specifically typical Indian! But the staff here, except 1-2 persons I could see from my table, were not at all hospitable and did not seem to value all customers alike."], ["NItin S.", "Upon friend's recommendation went to the Sunday Brunch and was pleasently suprised.Plenty of vegetarian Options. Sardarji was making superbly fresh Roti's."], ["Usha P.", "Best Indian food in the twin cities and very good service as well. We requested spicy and they made it perfect with the right amount of spice and it tasted amazing. I personally recommend the gobi 65 if you are missing spicy Indian food :)Portion sizes were very ideal. Would definitely recommend for a nice dinner on a Sunday."], ["Aileen A.", "Been here twice - no complaints! Great food and service was friendly and attentive. I don't have too much experience with Indian food but this was great. They can make it super spicy (not \"Minnesota spicy\" hah) and it is always served fresh. I got a lamb dish both times I went and garlic naan. The naan is absolutely delicious! Really I have no complaints with the food, lamb was soft and tender, and served hot. I'd recommend it to everyone :)"], ["Carrie N.", "Great food. Cute downtown restaurant!  I enjoyed every bit of my meal- the naan, Dahl, and gulab were delish!  My only complaint was the server sorta forgot about me for a while."], ["DrA Y.", "Naan was good, butter chicken was too sweet and tasted like too much tomato paste was added in the sauce.  Lamb biryani was ok.  Gulab jamun was super dry and hard.  I appreciate this is a small family business, but they are in need of investments in better service and better quality in their menu preparations!"], ["Joe R.", "I had to give 4 stars, despite the absolute crap service. The restaurant had 1 waiter, and when we asked him to explain an appetizer he told us that he was 'just the guy who took the order'. We ordered drinks & an app, then the Shahi Korma w/ Aloo Naan. I HIGHLY recommend the Shahi Korma. We come here regularly, and while the good is consistently delicious nothing is as good as the Shahi Korma. The service was so bad that if this had been my first time here I would have given it 1 or 2 stars, but hope tonight was a fluke; as we've been here many times and always had a great experience."], ["Parth G.", "This restaurant used to be my favorite restaurants to go to. But the last 2-3 times we've gone there (including today) - the food has been terrible, they never change their lunch buffet menu and today, they were missing things from the menu (like Pani Puri). Their Palak Paneer was actually bitter and so was their Sambhar. Idlis were a mess, you would be hesitant to even pick one. None of their vegetables were tasty. Their rice quality also looked poor, didn't dare touch it. Gulab Jamuns were not cooked properly.Not only was their food horrible, the service was even poor. Only two guys were on the floor and no management was around. One guy started vacuuming right next to our table in the middle of our lunch and the vacuum cable was on our table preventing us from eating.We are never coming here again and would not recommend this restaurant to anyone else unless some changes are made."], ["Reshma H.", "Good ambience, good customer service and yummy food. The place is open till 10 only. Nice location and  very clean"], ["Tony T.", "Just had a fantastic lunch at Bombay Bistro!  The buffet was packed with a variety of Indian delicacies as well as a very fresh assortment of vegetables in their salad bar area.  Tasty chai comes with the buffet and that is typically not offered at other Indian restaurants.  The rice pudding was also delicious and a perfect ending to a great lunch!"], ["Dinesh D.", "They were doing great earlier, nowadays the quality & taste of the food varieties are not up to the mark...."], ["Subhajit M.", "Pathetic service and had to wait for hours to get orders in, food was served without plates and had to ask for it, no one ever came and checked but looks like typical stereotypical behavior of Indian owners treating Indian customers,, also had to go and ask for check. I come to MSP for business and I will NEVER come here and will NEVER RECOMMEND anyone, food was trouble too ,,"], ["Rex L.", "The food here is actually good. But that's not the problem. The problem is the service.From the waiter who didn't write our drinks order down, and had to take it all over again, and then vanished......to the lady who brought the bill, and then hovered at tableside while our group figured out everyone's share.......it was just an uncomfortable evening.In fairness, they did comp us a bottle of wine. But that wasn't enough to erase the impression left by the unprofessional service."], ["Kiran M.", "We went to Bombay Bistro Buffet on Memorial Day and I was totally shocked by its spread and service. The staff seemed half hearted it their service. The spread wasn't good enough and most of the dishes weren't labelled. For a restaurant to have that kind of name and location, we were more than disappointed. Regarding taste, nothing much to boost off either.  It's not that the taste was bad; but it wasn't great either."], ["Irem G.", "Went to this restaurant when I was on a business trip. I went with my Indian friend who informed me that the food was actually really good.Staff was friendly and the atmosphere was very nice. We sat by the windows and enjoyed the view while we had dinner.Place was reasonably priced and it was not loud. If I am in town, I will go back to this restaurant."], ["Dawn S.", "I love dining at Bombay Bistro! It is the only Indian restaurant I have been to that when I leave I don't have the lingering scent of spices on my clothing and in my hair. It is very clean and inviting. We go for their lunch buffet and always enjoy everything we have. The owner himself came around to make sure we were happy with our meal."], ["Dee E.", "This place wasn't great unfortunately. Nothing on the Fair Buffet was worth $14.99 or my caloric allotment for that matter. I left sad (I enjoy scouting out great restaurants, so good food puts a smile on my face). They get an extra .5 star for friendly servers. That's it!"], ["Vikas S.", "I went to the restro on 8/6/2014. I am sorry to say but it was the worst food and worst experience I ever had. First of all, the crockery dishes was so dirty, it was too old and too dirty. No one bother to clean it  atleast. I tried many bowls, plates but ended up in cleaning it myself.Now the food, I asked for soup, they said yes, they have sambhar. I was never aware that sambhar is a soup. The paneer was cooked 15 days ago and they were still serving it. It was so sour and was smelling like anything.All the deserts were of worst quality and nothing was fresh.Now I wonder how people specially americans eat there and appreciate the food.I came to know that they don't know how the good indian food  taste. So whatever is served to them, they think its the indian taste. Above all, the music they were playing of something like played in circus. I seriously had worst exp in my life and will never recommend this to anyone."], ["Trinh N.", "This place is just everything. I went here an hour before closing and chose from the menu. The service was some of the best I've ever experienced, our waiter was so kind. We got garlic naan, this paneer and chickpeas curry and this other dark red curry. It was all so amazing and the spiciness was really clean and not overpowering at all. I would go back in a second."], ["Julianne Z.", "So while the rest of the interns went to Fogo De Chao, my room mates and I went to Bombay Bistro for some all you can eat Indian food. We were trying to avoid going into a food coma and we still did. We ate so much naan, butter chicken, and vegetable briyani that I couldn't do work when I went back to the office. My favorite dishes at the end were:Aloo Tikkis: It is a fried potato pancake with peas and carrots in the mix. They were almost like hashbrowns, but I just imagined that they were healthier because of the extra vegetables.Gulab jamun: I had these once in high school and they were way too sweet. It is basically a donut hole dipped in a sweet syrup and it has a very smooth and moist texture. I just squeezed out some of the syrup and it was a perfect way to end the meal. I am so happy that I went here instead of going to Fogo de Chao twice and it was a great meal with the roommates and a great way to finish off the last week of work."], ["Roy K.", "Excellent quality, tasty food. Well worth the $10 or so for lunch."], ["Fahmeen S.", "Food was delicious!! Amazing quality and presentation. This is coming from someone who has tried a lot of Indian/pakistani restaurants and is pakistani herself. I was surprisingly blown away by their food. It is the most authentic I've come across in Minnesota! Definitely recommend it. My favorite was the chicken 65 and the chicken tikka masala. And don't even get me started on their naans and parathas. You should definitely try this place out if you're in the area"], ["Sal K.", "This is all around solid Indian fare in lovely downtown Minneapolis. Not every dish I've had is mind blowing, but unlike many Indian restaurants around town, there's a full bar and it's more upscale. Plus, Bombay Bistro marks menu with a \"V\" for vegan items -- except I think there are a few unfortunate typos. They did confirm for me that they do not use butter in their rice. A-OK."], ["Gary C.", "I was yearning for a good Indian Lunch Buffet in Minneapolis.  Read the Yelp reviews and found that Bombay Bistro was in walking distance.  Nice window seating allowing me to People watch.  Also, I got seated right away.  Shortly after I arrived, the restaurant started to fill up.  Although the Buffet did not have a selection as large as I was used to,  it still was nicely laid out, and delicious.  It was missing the Pakora, Samosa's & Chaat.  The Rice was the best I've ever had.  The Naan was good, but I've had better.  The Tandoor Chicken was good, and not dried out. One thing that gives this place an extra star, was the SERVICE!  The gentleman that had the floor, was EXCELLENT, ATTENTIVE, and FRIENDLY!  The restaurant was clean & neat.  I will definitely be back!Enjoy, Chef Gary!"], ["Michael L.", "This is the among the best Indian food I have had, and I am a big fan of Indian food who has eaten it in highly-rated and -priced places on three continents. I cannot speak to \"authenticity,\" as I have never been to India and I am not Indian. But, I can tell you that the food here is as good as you will find in the Twin Cities and just about anywhere.If you know someone who does not like Indian food, take them here and order Chicken Shahi Korma (chicken in a mild curry-yogurt sauce with golden raisins), and they should be converted. My usual order is that, Garlic Naan (bread), and Raita (tangy yogurt sauce) and I could eat that every day quite happily.Unfortunately, it is also rather pricey, certainly for Indian food standards in this city. But not at all crazy. Expect a bill of $50-$60 for two, but with leftovers. I just kind of resent the fact that garlic naan is $4 for 2 fairly thin strips of bread. I like to order 2 of these, and $8 on bread seems excessive. Other than that, prices are very fair for the quality. The interior is elegant and fairly compact, and it is conveniently located downtown but not far from easy street parking on 2nd or 3rd ave."], ["Andrea F.", "To preface this I must say that I am traveling and I live in Montana where there is a dearth of Indian food.  So, I've only eaten at a couple Indian places, and not recently.   That said, I thought this was a really great meal. I had the samosa appetizer, goat vindaloo medium, and naan. The samosa was the best I've had, I really enjoyed it - perfectly spiced,  HUGE, and great sauces.  I've not had goat or vindaloo before. The goat was super tender, you can tell it was slow cooked. Spices were good, though I should have gone spicier but you never know what that really means restaurant to restaurant. There was just the right amount of acidity. The naan was really delicious, warm, soft, fragrant and a wonderful light texture. Best naan I've had. The service was good, the pricing was good, and the atmosphere was really nice. Overall I had a wonderful time and if I lived here I'd return! Until then I'll just go back to Montana and wish we had good Indian food in our neck of the woods :)."], ["Richard W.", "I pop in for the lunch buffet. I've eaten there before and had good food. As I begin to eat, I notice the food isn't going down. I have a condition where that happens sometimes. I end up puking and then I'm fine. It has nothing to do with the food. I figure I'll hit the restroom, finish my business, and come back.I ask the waiter where the bathroom is. He points out one door and the rest I couldn't make out. I take a look around and see nothing. I ask a security guard where they are and he tells me it's available to customers only. I explain I *am* a customer and he says I have to get a key. The pressure is starting to build at this point. I have to find a toilet now.I go back inside and ask for the key. I'm led out another door. After searching in a panic and not finding anything, I barf in a corner of the hallway.My hand is covered in puke. I go back in to get my stuff and leave. As I leave I briefly express my displeasure with the waiter and the guard. I walk down to the nearby Target where, thankfully, they aren't so covetous about their shitter and I can wash my hands.******************************************************************************IF YOU HAVE A RESTAURANT, HAVE AN EASILY AVAILABLE BATHROOM.IF THEY CAN'T FIND THE BATHROOM, SHOW THEM TO THE BATHROOM DOOR.******************************************************************************P.S: If you are from overseas, speak distinctly and project. No reasonable person should expect the next Shakespeare to come fresh off the boat. Any reasonable person could argue that \"hall... mumble... mumble... door.. mumble... mumble...\" doesn't translate to an exacting set of directions. Enunciate, goddammit."], ["Kevin T.", "Nice job on the lunch buffet.   Arrived at opening time to find the buffet items newly placed.   Everything was fresh, delicious, and nicely presented.They split the restaurant at times between Northern and Southern Indian Cuisine.  There are actually two Bombay Bistros dining rooms separated by a corridor within the same building."], ["Zach G.", "Really quite a disappointing meal. I ordered carry out and the service was far from welcoming. It wasn't rude, don't get me wrong, but I felt like a chore in their evening rather than a customer. I got a goat vindaloo, hot (not Indian hot, but hot), and an order of naan. It took about 15 minutes and I was on the way back to my hotel. So you know how vindaloo is supposed to be hot to begin with? It wasn't. At all. I wonder if Indian Hot would have even been hot on this dish...it seriously was nothing. In fact, the overwhelming flavor was vinegar. Almost overpowering, and really not very enjoyable as the dish went on and it was all you could taste. As a result, it was also super \"watery\" and runny. There was an okay amount of goat, but it didn't have a lot of flavor. The naan was okay...average. Nothing great. Same with the rice. I wanted to like this place, but I was severely disappointed. Bummer."], ["Patrick M.", "This is the second restaurant I went to which is advertised on Yelp as open, but says \"Closed Sunday's\" on their door hours. I think Yelp needs to double check their facts. And this is more of a tip than a review, but I don't know how to make it a tip."], ["Will P.", "The lunch buffet here is delicious. Lots of food PLUS one of the best desserts I've ever had. Ever. So setup an away message, forward your voicemail, and clear your afternoon schedule because unless you posses some superhuman brand of willpower, you're in for a major food coma. You might be able to send a few emails, but don't expect to be productive beyond that. Your day is effectively over.The food is hot (temperature-wise), well-labled (important for novice Indian food consumers), and the staff is friendly. Not the cheapest skyway lunch option, but you certainly get a lot of bang for your buck."]], "India Café": [], "Gorkha Palace": [], "Charminar Biryani House": [], "India Palace Uptown": [["Kara D.", "Yesterday was my first time here, and you can bet your ass it will not be my last. I wish I knew they had an attached private parking lot in the front (part of a plaza).  I figured \"Uptown? Parking is going to blow. Excuse me while I scrape my bumper across the curb a block away\"... Once I entered the building on such a chilly day, I was greeted by a warm and inviting employee (possibly owner or GM), fun music videos, a comfy booth, and beautiful buffet. Check out my photos of my lunch buffet plate - so colorful!! F* Skittles, come eat the rainbow at India Palace. Some of my faves from the buffet: Mushroom palak (spinach), tandoori chicken, chana (chickpea) masala, gulab jamun (\"milk solid dessert\"), and these curried meatballs. Each dish was flavorful and not too spicy. I liked to add the green chutney to up the heat. The naan was cooked fresh to-order, and was included with the buffet. I highly suggest you order the mango lassi too. Our servers were so sweet, and even described and imitated the people in the Indian music videos! We made sure to say goodbye on our way out. What a great lunch with great company too (shoutout to Gabriel C)!!"], ["Hailey S.", "Food was phenomenal. Service was very personal and our waiter was great.Feels like a small town place even though it's in the heart of uptown. Beef josh, chicken samosas and garlic Naan had me in heaven. Will DEFINITELY be back!"], ["Gabriel D.", "\"Meh, I've experienced better.\" Designated under the 2 Stars selection is pretty accurate.I have been to MANY Indian Restaurants, probably about a dozen in MN and a few more across the US; lunch buffets and a la carte.  This one, I had high hopes for, and at first seems great, but it falls short.Here's the main reason: not very authentic. To credit the manager who seems to come around and ask people how they like the food, they do use less overall flavor/spices/herbs/seasonings due to a \"Midwesterner's palate \".  On top of that, the quality of ingredients used are very poor; the paneer for example is premade and ordered in giant sheets and chopped up.  Probably the worst thing that is keeping me from coming back is this: the manager actually said that for the TANDOORI CHICKEN, a staple which even tastes very off (overly sweet like a Chinese buffet \"chili lime sauce\" and has limes and a sweet gooey glaze on it- yuck), apparently has KETCHUP put into it.  As someone who appreciates Indian food for the type of seasonings used and lack of artificial crap thrown in there, I don't really enjoy having that stuff added.  Here's an important thing to that as well: most ketchups have high fructose corn syrup AND corn syrup and gluten-derived additives... so if you go in there, and expect your classic tandoori chicken to be gluten free and free of sugar and gmo-crap your wrong!-besides that, that is NOT how tandoori chicken should taste!Further, I have come on multiple occasions and days to give it a chance, but authenticity is laughable. What are \"spring rolls\" doing on the line?  They are clearly from a package and heated;  the milk balls are not good, and the rice pudding that is even labeled to have pistachios, I have yet to find one ever.Warning: I have come across undercooked meat balls (beef and lamb), and these break apart easily due to the fattiness/quality of the meats.Not very many vegan dishes either. To their credit, gluten-free dishes are labeled, but not diary-free of vegan.  Oil is not fresh and everything is fried in the same oil as well, so don't expect anything to truly but gluten-free.  The pakora does apparently use chickpea flower, but the naan bread is all-purpose... which is really disappointing.  Also, the fats used in curries are vegetable oil (not too healthy when cooked with high temps) and butter is used as well- same issue. No ghee apparently as said by chef. FYI: Ghee vs. Butter. 1) Great for cooking: Ghee does not contain milk solids and it is very stable at high heat. Because of its high smoke point (~485 °F), it is considered one of the best oils for baking, sautéing and deep fat frying.  The manager tried to tell me butter and vegetable oil is healthier. NOT the case, and ESPECIALLY for those who are sensitive to dairy.Simple fixes: take the overly sweet sauces out of the mix. Use better quality ingredients (local does not always mean better) and actually make the food taste (from a seasoning perspective) authentic. Maybe include pistachios in a dish that is said to have it. Also, all the curries and the rice dessert is overly saucy compared to every other Indian place (including other India Palaces)Bottom line: if you are ignorant about authentic Indian food, and do not care about trans-fats or hydrogenated oils or fats that are oxidized or unnatural sugar being added to your food and just want cheap, badly greasy, Americanized Indian food, go here; you will get that and a bunch of smiles that will make you think you are experiencing some \"exotic\" delights!-Everything is overly sweet and has syrups added to it in a bad way.-Lots of food sits out for a while-Curries are overly runny, and break down and you end up with little bits of food amongst \"curry\" water, not even \"soup\"-The naan bread is brought out fresh, but due to the ingredients turns into cardboard after cooling rather than the expected constant doughy goodness.-tandoori chicken has ketchup added to it, which you can bet has corn syrup and high-fructose corn syrup in it, and hence is overly sweet and just off-tasting. -Odd things like Asian buffet spring rolls appear on the line-The salad is sad and wilted.-Waiters do not understand you when you ask \"what kind of tea is your hot tea\"-the saag paneer is a highlight and actually exceptional, but is a little sweet if you savor the bite and feel through the tastes, and the cheese is not from a good source.-gluten-free labels are nice but there is a major issue with the fryer and oils causing cross contamination.-not a very clean kitchen.-chicken pieces in dishes are dry and flavorless. I am a carnivore by nature but found myself not wanting to eat them as they are just Styrofoam and forgettable.I probably will not be back as there are MANY other places that use better ingredients (fresh, local, organic, better oils), authentic, are cleaner, and put out better overall dishes that don't break down and lack in seasonings. My stomach will thank me"], ["Debelah T.", "I take my son here sometimes for some good Indian food.  This is a delightful place for a good lunch or dinner.  I always feel welcome because of the good staff.  They're wonderful with kids.  They have paid closer attention to the needs of my son, which I like.  I feel like they tell me to come back when I leave, which I always do.This is a good environment to sit around and enjoy my meal.  Their food is delightful and to die for.  I have tried a variety of their plates, and I have never left their unsatisfied.  The staff takes the time to make sure that I am satisfied with my meal.I recommend this place to anyone who loves Indian food.  I love this place!"], ["Helena D.", "I've updated my review (it was at 5 stars and still is 5 stars) because I've been going here more often and trying more things so I thought I'd share. I've ordered take-out here a few times now and it is always timely and delicious. The staff here are wonderful. They are always nice whether you're there for take-out or dining in. I can't speak for everything on the menu but nearly all the chicken dishes I've had have been awesome. The best part of this restaurant though is the daily lunch buffet which is roughly $10 bucks and I've tried nearly all of it and can say I went back for seconds and thirds. So good. The lamb, the chicken, the beef. I don't eat naan but they give you fresh naan with the buffet as well. For those of you who are gluten free- they also label each item that is gluten free which is not only convenient but kind. Plus- there are plenty of GF items. Love love love this place!"], ["Carolyn B.", "I foresee many cold winter nights filling myself with warm naan and beautifully seasoned curries. I expected the usual Indian food menu, but was pleasantly surprised to see some more inventive dishes alongside the classics. One of my issues with Indian food is that the substance of the dish is usually limited to two ingredients--spinach and chickpeas or potatoes and peas or you get my drift. They have some veggie dishes that have more variety of vegetables, which makes me feel like I'm getting more of a complete meal. The one I got - balti special I think it was - was fantastic. Flavors were spot on and it was loaded with veggies. They also have tofu dishes, which is always appreciated. And yes, as other reviewers have commented, the service is very polite and professional. Rounds out a great experience. My only issue, and I'm in the weeds here, is that their silverware seems really cheap. The fork has these weird grooves or ridges in it that kept hitting my tooth or tongue in a distracting way. But my husband didn't notice at all, nor would most people. I just might bring my own fork next time!"], ["Robbie P.", "Service was great. The food is not up to the expectations, as we had some kabobs. Worth trying if you get there with no expectations."], ["Shelby F.", "Great food, great customer service, great atmosphere! What more could I ask for? All the food I've had is great. I've come for the weekend lunch buffet and had one of the meals for two they have. I really enjoyed the meal for two because it came with an appetizer, main dish, desert and flat bread. Highly recommended!"], ["Steph L.", "What nice people!  The food was delicious but what stands out just as much as the food is how nice the staff was.It would be okay not to expect much from a restaurant tucked away in a strip mall that had previously housed such greats as Baja Sol.  But, India Palace has fantastic food, great service, and a decent atmostphere... and a menu the size of a greedy kid's Christmas list!We've sat in and done take out, both times a charming experience.  There is a small parking lot but as they're becoming more popular, the parking lot has less and less space.  So for those of you just close enough that walking/biking is an option, but car would also be acceptable, get your exercise in.  Everyone needs that after some Indian food.  :) Hint: if you live in the Uptown area, they have a coupon out in the Fall Uptown Quarterly 2015."], ["Taylor Y.", "Was just in for a very quick lunch buffet... I want to go back ASAP!! I didn't have time to try it all, but what I did have was fantastic. You also get garlic or plain naan included In the cost of the buffet. Hurry!!"], ["Jamileh T.", "We have both missed real cultural food since moving to mt from more prominent cities. We found this restaurant on a trip through the state. Right when  you walked in it was busy but welcoming and the staff created you instantly.  Our service was the best we have had in a very long time in any state we have traveled to. His name was James, all his recommendations we're spot on and his care of love for what he does and where he works showed. Everything  from the garlic naan to the keeshar* (rice pudding) was made with  pride and  the upmost respect  for the craft of cooking. We met the owner and chef  and he could not have been a more humble simple man who deserves all the business and grand reviews. We will be going back when ever going into this state again. Such an amazing food and people experience."], ["J R.", "Excellent food and polite service. Great place to visit.  First time. Date night We had chicken tiki masala. It was fresh and worth ever bite. Place is very clean. Quick service. A must do if you are in the area!  We cam came for dinner. It was quick. My girlfriend had a nail appointment in 30 minutes. We did not want fast food. They got us in, took our order, and delivered on their promiseWho said you have to go to fast food place? Ha!  Thanks again. You have a new fan. We will be back for sure!!!JR"], ["Jack P.", "I had an intense craving for Indian food and a friend (a bit of an odd duck) who needed cheering up but had never tried Indian food before because even black pepper is too spicy for her.  (A true Minnesotan.  Uff-da!)  Honestly?  I'm a restaurant snob.  You'd better be clean and the service had better be friendly.  India Palace Uptown had both of these in abundance!  We had four different employees visit our table, including the executive chef, but it was very non-intrusive.  They were the kindest, most helpful and lovely people!  The hostess was very patient, understanding and accommodating of my picky friend who had a lot of questions and special requests.  (And we all know how annoying picky people can be!)  I have to compliment the design of the restaurant.  No carpet (tile) and no cloth booths or chairs (a very nice vinyl).  Why is that important?  Because all the surfaces are washable and won't absorb the oil and odors that I usually find in Indian restaurants.  What you smell is the aroma of FRESH food and not stale, months old odors that have permeated the carpet and chairs.  The atmosphere is very pleasant and not cheesy.  (I promise, I'm not affiliated with this restaurant in any way!)We started with the big appetizer, the Palace Platter, to give my friend a good sampling:  Lamb Samosa, Veggie Samosa, Alu Tiki, and some Pakoras (with sides of mint sauce and tamarind sauce).  I was impressed because these fried appetizers were NOT swimming in oil or even greasy to the touch!  The tastes did not blend together where everything tasted like grease.  Each had their own flavors and there wasn't a crumb left on the plate.  My picky friend enjoyed all but one of the items.  (I about fell out of the booth in shock.  Which would have been fine because the floor was clean...)For the entree, I had Chicken Josh and my friend had Chicken Tikka Masala (accommodated to be the absolutely mildest they could make it).  She loved it and I devoured mine.  I did, however, want mine medium spicy and it came very mild.  I think they carried her request for mild spice over to my dish, too.  I didn't care though.  It was delicious!  When the executive chef paid a surprise visit to our table, it really impressed my friend - and surprised me.  That rarely happens anymore.  My friend commented on how generous they were with the amount of chicken in the dish.We ordered two types of Naan - plain and garlic.  Both were great.My friend drank water and I had water and a couple of Chai Teas (perfect).  My ONLY complaint is that the water appeared to be tap water, not filtered.  Keep that in mind if, like me, you hate tap water.  Our bill came to $47 for a LOT of food and superb service.  We wanted for nothing and just couldn't make room for dessert.All in all, a great experience that really did cheer up my friend, satisfied my craving and will have me coming back for more."], ["Michelle F.", "Insane amounts of delicious Indian food, insane amounts of vegetarian options! The service was very friendly and helpful! Try this place out!"], ["Palash H.", "Food was ok.Seek kababs were  gud. Don't order chicken pakoda.N gulab jamun was terrible.But service was gud."], ["Robert V.", "Went for the buffet today, found the food very fresh and good the staff was eager to make your experience a good one, parking is a bit hard to find but worth it."], ["Santiago R.", "The food is fresh,  authentic and delicious.  The lunch buffet is just the best deal you can get in Uptown, the Naan is to die for.  Last night we went to dinner with friends and it was a great experience.  The price/quality relation here  is just unbeatable.  Just come and check by yourself, you won't regret it."], ["Matt E.", "This is some of the best Indian food I've ever had, and one of the best restaurants in the Twin Cities. Full stop."], ["Abby D.", "Best Indian food in Minneapolis! Just like their other locations this place dishes out the most authentic Indian food around and has outstanding service.  The tandoori chicken, veg curry and saag are all delicious. The naan was warm and fresh as well. Very attentive staff refills your water regularly. Go try it!"], ["BleepBloop P.", "I'm so happy this opened up in Uptown, the land of bland. The Indian restaurants in this section of town are not good and lack the spice that I know and love. I tried India Palace's lunch buffet (which is an amazing price by the way) and liked pretty much everything I ate. The chicken makhani was great and they have a staggering number of vegetarian options on the menu. The lunch buffet is definitely worth it! The dinner prices are a little steep, but considering the other options around, I would choose this place any night.I hope, as time goes by, they do not Minnesota-ize their spices. So much of any ethnic food found in this region tends to become blander over time to accommodate the boring Midwestern palate."]], "Taste of India": [["Gary H.", "My wife and I split a \"Dinner For Two - Vegetarian\", which included Appetizer Platter, Served with Palak Paneer, Nav Ratton Korma, Salad and a Bread (and rice). The food was flavorful and the service was friendly and welcoming. We were there on a weekday evening at 5:30 and the place was quiet. We'd go back."], ["Kristin C.", "We got lunch \"to go\" on a rainy Tuesday afternoon. The food was flavorful, and honestly, couldn't be improved on! Try the Chicken Mushroom or Mali kafta. Soak it all up with some amazing garlic naan! My family has been going to Taste of India for at least 17 years. The staff are hard working, friendly people who continue to put out delicious food year after year. Great job!"], ["Julie T.", "The food was very good at Taste of India. I had the Rogan Posh which is lamb. I had asked for medium and didn't find it terribly spicy so I would recommend a higher spice level if you are looking for HOT. The service was subpar. We entered the place and it was hard to tell if we were to seat ourselves or wait. We waited for a minute and started walking toward a table when a waitress yells across the room to someone in the dining \"do we have any clean tables? They are looking for one.\" There were about a dozen booths unseated. We were waved over to a table. We weren't given menus right away. I think my guest put it best \"It feels like we are kind of a burden here.\" It felt like our server was put out that we didn't order our appetizer and meal at the same time. Refills were non-existent. We waited for a while for our food and got a quick \"yeah, something is coming.\" All in all, the food is great, the service is \"uh\". The dining room has probably seen better days. Has a definitely \"hole in the wall\" feel. The buffet would probably be a better experience, then the staff won't seem so bothered when you get your own food."], ["Dave K.", "I don't love Indian food, but my wife loves it. She couldn't stop making sounds while she ate. Seriously, it was like something out of When Harry Met Sally. $35 for two people not too bad. We would come back."], ["Abigail C.", "This is my favorite Indian buffet!  I love it because they have the best curried vegetables- they are always so fresh tasting and bright.  The quality of their other dishes is always fantastic, as well.  I can barely restrain myself from seriously over-eating.The family who works here (owns it?) are also very kind and attentive.I do agree that the food in the buffet isn't very spicy, but that makes this a great place to take friends or family new to Indian food."], ["Warner W.", "One of a few Indian restaurants in St. Paul that further off the street. The Buffet is excellent I entirely enjoy my meal. Quiet place that is not fancy but food and atmosphere are worth trying."], ["DJ D.", "This seemed like a pretty good restaurant. We all felt that our curries were under-spiced, which is my main complaint... could have been much richer in flavor, with more heat (especially for a dish ordered 'spicy'). The meats were OK, not exceptionally good. Naan was tasty and up to scratch. Mango lassis were really, really good... 3/5"], ["Debra S.", "Great food, friendly staff. Had a wonderful experience every time. I do wish the food was a little spicier (I've even asked for them to make it Indian food spicy and not American spicy and felt it was still too mild for my taste). Will definitely go back and have already brought friends and family there to enjoy with us."], ["Birch S.", "I really loved  this restaurant. Unfortnately, it gave my dinner companion up-all-night-puking-his-brains-out food poisoning. Still, the food was good. It's hard to tell if that is just the price you pay for good indian food."], ["Alex C.", "Like many of the others, I've seen this place from the highway and always wondered about how good they are.  After finally stopping in, I think they may have a problem with consistency because I had a pretty good meal here on a Sunday night.I'm not a Indian food expert but I know what I like and typically, I like to eat a lot of it.  So no buffet so everyone order a bunch of dishes to share.  The chicken and mushroom in tomato sauce was very good and the naan was tasty too.  The we had chicken vindaloo (too), and that was supposed to be hot but was more of a mild...maybe medium.  We picked a lamb dish that was pretty good but I can't think of the name.  We had fried lentil balls (appetizer of sorts) and fried milk balls (dessert), neither of which were crispy.  I probably wouldn't order either again.  As fair warning, this and most Indian restaurants provide small portions....lots of rice and decent amount of sauce but not much stuff in the sauce.  That being said, the flavor and spice is done well even if everything seems to be mild on the heat.My party agreed that we want to come here again (more than just because they are the only Indian restaurant in the neighborhood) because we want to try the $10 buffet.  The dishes were generally in the $10 range.  While the naan costs about three bucks, the rice is good and goes well with everything and has free refills.  I watched mango lassis show up at the table next to us and got pretty envious.  Those run about 4 bucks.  Turn at the insurance place two buildings down from the McDonald's to get here.  Good service and a satisfying meal for a reasonable price."], ["Rick C.", "Went last year as my girlfriend and I had been regulars here often.  We were seated at a table that was in ill repair and the bench seat fell in.  When we asked to be seated elsewhere, the manager acted inconvenienced.Food arrived and a LONG black hair was on the plate.  The manager argued saying it wasn't anyone  on the staff.  Really??  My hair is 1/8\" long!Rather than comping the cost of our meal, a buffet, we got an argument.  Will never return to this place."], ["Sagar J.", "I just moved to Minnesota from Chicago, and have been raised on Indian food, being of Indian heritage. I've been trying to find a place that has great Indian food for a while now. I've tried 6 different places so far, not to be mentioned, and this place by FAR has the best food I've had. Their \"butter chicken\" - Chicken Makhani is absolutely AMAZING. Their garlic naan is also on point."], ["Ted P.", "Uninspired Indian food, with muted spices and flavors from what I would have otherwise expected for the genre...But more than anything, the joint was 59 degrees when we walked in. They offered to turn it up - it got to 60 before going back to 59... maybe the bad experience is on our shoulders for being willing to stay once we realized we would be eating with our coats on.  Still 59 degrees? Really?"], ["Adrianna P.", "I have been going here since high school.  It's one of my parents favorite places and it's awesome.  Definitely go for lunch because everyday they have a killer buffet and you can try a lot of stuff.  The best days I have found are Friday and Saturday.  For some reason they have a lot of new dishes out they don't have on weekdays."], ["Amy R.", "Have driven by this place several times, and finally stopped in after all these years for lunch. $8.99 for the lunch buffett is reasonable.In comparison to some of the other Indian restaurants I've eaten at, this one kind of paled in comparison flavor wise. While the selection was decent, it just didn't pop. However I'd almost give it a 4 for the non greasy prepared to perfection vegetable samosas. They were wonderful. Pakora so- so, naan was really dry.Tandoori was scarce and not much of it was replenished. When it was, all of the other patrons bum rushed the chicken and it was gone, so never got to enjoy that. I didn't feel like bum rushing the serving station.All dishes were labeled which was much appreciated. Decor is nothing fancy. The light bright velvet painting made me chuckle.Service is sweet and endearing. The petite older woman serving us was as cute as can be.Not fabulous, but not bad..worth a visit."], ["Cecelia R.", "This is our favorite Indian restaurant.  I'm not an Indian gourmet, I just know the food here tastes good.  I honestly couldn't tell you if it is \"authentic\" or not.I LOVE the lunch buffet, because you can try a bit of everything until you find what you like.  My favorites are the kormas and of course the samosas.  Also, this is a great place to take a mixed group of vegetarians and carnivores.No real desserts, but I always end up so stuffed from all the carbs it doesn't really matter."], ["Michael S.", "This is my Indian restaurant. My wife and I have been to this restaurant more times than I can remember. There are other options, but we prefer this one. They are very friendly and fast. I have no complaints on service whatsoever.We prefer dinner to the buffet, as it seems like the selection is somewhat limited, or, more to the point, it doesn't have exactly what I order. I order my Chicken Curry without fail each and every time, along with an order of naan. I've ordered the take out only once, preferring to dine inside. They use foil/cardboard containers, which didn't spill or anything, but neither do they feel super stable. On the phone, they are very adamant to make sure you're calling the right Taste of India, lest you believe you're ordering from another restaurant methinks.I've been a frequent customer of Indian restaurants and this is one of my favorites. I'm still constantly baffled, though, that the dining room is never busy. It simply baffles me."], ["Jennifer R.", "We saw this place from the highway and decided to stop in on Sunday for lunch. The buffet was $9.99: not extravagant, but I don't know that I'd pay that again for what we got.I did enjoy the spiced garbanzo masala and the vegetable samosas, but everything else at Taste of India was sub-par. The naan was dry and kind of crunchy; the curries were bland and a bit cloying. The goat curry had more bone than meat; at least three pieces of the goat on my plate were purely bone and connective tissue, nothing edible at all. And the mango lassi, which is usually one of my Indian restaurant go-to items, just tasted weird. It had little lumps in it and was beginning to separate. Not appetizing at all.The service was not horrible, but not good either. I think the best word to describe it would be \"aloof\".I think next time we'll give Taste of India a pass."], ["Jess H.", "Reheated Indian Food in a less-than-charming (or vacuumed) environment.My wife and I shared the Dinner for Two meal.The salad was a plate of iceberg lettuce that was at the end of its shelf life (beggining to turn brown), with some thinly sliced tomatoes and cucumbers.The Pork Curry was not spicy at all (we asked for medium to hot), thin and bland.The plate of meat had skewer marks in each piece, but it was obviously grilled at an earlier date and somehow reheated for serving... thus, the meat was dry and tough. All of the flavors were very bland (I almost want to say \"subdued\" but, that would imply a conscious decision by the chef to control flavor...which is definitely not the case here). One little aside, when the waiter was going to bring the hot plate of meat out, I watched him squeeze a bunch of oil, on to the hot place, to create a loud sizzle and steam as he presented the plate. I thought it an act to increase the showmanship of the presentation. However, I'm pretty sure now that it was a technique to mask the fact that nothing was freshly prepared. 5-will-get-ya-10 that there is a microwave working over time in the kitchen during service."], ["Brendan T.", "Ugh, this place has worsened in the past year or so. Lunch buffet was horrible, soggy papadam, bland chicken Makani, and bland Chana Saag. The second star is for giving my kids a dum dum sucker...not so compelling!"]], "Namaste Café": [["Crystal L.", "I'm not sure what all the hype is about....I've had Nepali/South Asian cuisine many times before (in Wisconsin of all places) and Namaste was just not up to par. It wasn't bad, but it wasn't memorable either. I had really high hopes, and I was so sad when those hopes were crushed. Plus it was a tad bit overpriced. Sigh. Guess my road to finding a wonderful Nepali restaurant will have to continue."], ["Manuel H.", "Best Indian food with a modern twist in the Twin Cities although the owners seem to be locals. Cozy place, friendly service. The Masala Chai is to die for."], ["Chris H.", "Food was good but, the staff seemed to be a little overwhelmed. Not very busy either."], ["Ms. M.", "Both the lunchbox special and items ordered off the menu were bland and flavorless, and in several cases served to our table cold. I am not sure how this could ever constitute Indian cooking. Definitely not worth a visit."], ["Chelsie B.", "This was the most magical dining experience I've ever had. I was visiting MN from out of town and stopped by for the Wednesday lunchbox special. Our meal was so good that I wept. Literally. I cried at the table.Not to mention the cocktails were phenomenal: honey mango margarita and Himalayan iced tea.Thank you for existing Namaste Cafe."], ["Rachel F.", "I'm writing this review because every time I see it pop up under restaurant searches as being valued as under 4 stars I cry a silent (yet invisible) tear. This is my sis and my go-to spot anytime we want something unpretentious, flavorful and consistently good. Our standard fare includes any drink on the menu (chai and cocktails rank as our favs), spicy potatoes and if we're feeling carby a scrumptious fry bread. This is usually followed by the Coconut spinach which is a delish creamy/curry and the Aloo Bodi which contains expertly spiced black-eyed peas. Both main dishes are vegan and GF and served with a side of rice at whatever spice scale you can handle! Now as for claims that this place is not authentic, perhaps not but who cares if the taste and flavor profiles are there?! Personally I am not offended by any liberties taken and still heart Namaste- this all said I'll end with my simple recommendation: Go there, try it, you'll like it!"], ["Erica E.", "We went for date night (Tuesday nights) with another couple. It is a good deal, for $40 you get a bottle of wine, 2 entrees, and a dessert. The service was good and the various dishes we shared were tasty. Some of the dishes seem to be a different take on \"classic\" Indian dishes. The ambiance is nice. It is in a cute house with lots of windows."], ["Jenni B.", "Namaste Cafe is the cutest, quaintest place to have a date on this side of Hennepin. It's pretty small inside so if it's cold be prepared to wait, but if the patio is open it still has that tiny little cafe feel. I love the summery feeling of having delicious, but not excessive amounts of Indian food under adorable little globe lights with the hustle and bustle of uptown as the view. The service is always so courteous, but it's a small kitchen and bar so things will be moving slow, but not intolerably so. If I were a guy deliberating on where to take a girl on our first date and I was looking in Uptown, hands down it would be here.The dishes are perfectly portioned for a reasonable meal, so if you are super hungry you will probably want to start with an appetizer. The garlic paratha is a flakey bread that is wonderful for dipping in all their flavorful sauces and makes for a good starter. My favorite though has to be the bison mamacha which comes with six little warm dumplings.For dinner I always get the vegetarian mushroom and tofu curry with peas. There is just something about the coconut balance in this sauce that I cannot get enough of, especially at spice level 5. That's right, Namaste Cafe gets my nod of approval for making any dish amazingly hot without compromising flavor. This is a rarity in pepper-averse Minnesota, so heat lovers rejoice! It's a slow build, but it won't disappoint. To finish off I had the super creamy mango margarita. It was so thick with fruitiness it was almost seemed more like a dessert smoothie than a drink. It was delicious.Needless to say, I love it here."], ["Kim B.", "Great clean Indian food. Nice spicy masala chai and a great menu full of options. Love to see that GF is available. Nice seating options inside and out. Great neighborhood."], ["Takashi S.", "Loved all plates I had.  I have been to many Indian restaurants but this time I went with my friend from Bombay.   So asked him to choose all plates.  Honestly I don't remember all names of plates but one with fish with ginger curry and lamb curry.   Also had a nice bread with yellowish orange sauce (tasted mango) and diced tomatoes etc.   good good!!!"], ["Ria F.", "Got the tofu masala curry which came with rice and the paapri chaat (basically Indian nachos) which both had amazing flavor. The tofu was alright, I probably would get it with chicken next time! Overall really good food :)"], ["Christa B.", "I like the ambiance. The service is great and reputable. The coconut chai was ok. A little too milky, but with a good flavor. The okra dish is delicious. If you are looking for something basic with not very much variation of produce in a dish, and rely on the flavor, this is your spot. I am the type of person who likes a variety of veggies in my dish, so it was disappointing to see that the menu is limited in that way. I left feeling as though I didn't get a full meal, lack of protein options for vegetarians who don't eat from the legume family: tofu, beans, lentils. But even the meat dishes that aren't priced higher than $14 don't come with a veggie in the dish really. The chicken comes from a local farm so that's awesome. I think overall it's a great place to come if you share dishes with others in your party."], ["Jesse J.", "Very good restaurant and I've never been disappointed with a visit. I'm always excited that they offer items which are vegetarian & vegan."], ["Karena V.", "This is such a late review since the photos I plan to add are from last summer-but, review I shall. Namaste is absolutely amaze-beans! I love the classic Rogan Josh (although I think it's just something along the lines of \"Namaste's Special Lamb\" or something I'm bs-ing). Basically lamb curry with yogurt (yogurt sold separately). So good! The ground spicy (which none of it is really spicy, then again I'm Asian & I don't think many foods are spicy) mamacha dumpling things are so delicious they just melt in your mouth. During this visit we ordered another round cause they were so good. For my beverage, I can't remember the specific name of the chai but it was a \"spicy\" one & by far the best chai I've ever had! (Iced). Definitely recommend Namaste for a cute little date spot or even for lunch. I think ok Tuesdays they have a special $40 for 2 entrees, a bottle of wine & app or something-may be wrong. Prices won't put a hole in your wallet/purse. The ambiance is just relaxing. It's just a hole in the wall type place you'd never think to go but the food is great (:"], ["Marilyn C.", "It is literally homey, as it is set up in a house with some outdoor seating.  I am rooting for this place, but where it falls flat on its face is in the dessert area.  Vegan options do abound but seasoning doesn't.  You have curry, curry and curry.  The truth is there are more spices on the spice road trade route and cuisine options that Namaste can seem to come up with.  Pass on the desserts, the brûlée was a soft imitation of the original french concept.  With the curry dishes, they should be flourishing with vegetables, not just potatoes.  I still see a lot of people come into Namaste, but primarily they are visitors who miss \"Indian\" food.  It's my hope they can become a bit more creative and develop a really good flavor profile.  It is very basic and service is cordial (neither hot nor cold)."], ["Paul F.", "This place is awesome! First great Indian food I've found so far. Not even our too-awkward-for-life waiter could ruin the experience. I recommend that spinach punjabi, which I spectacularly failed at recreating in my home.Cooking is hard. I should be nicer."], ["Adam E.", "A friend recommended this place so said why not try. Food was decent but kind of pricy for the portions. Service was good with the exception to one waitress. We asked her for some straws and instead of getting them for us she delivered the message to a different person. It only takes one bad occurrence to damp your experience...she was ours!!"], ["Annie D.", "You might think you can handle the extra hot Goan fish curry (because you might have vindaloo coursing through your veins)... but you can't and it hurts. Aside from that burning blunder on my part, I really liked my last meal here (I ordered delivery from BiteSquad). It had been years since I'd eaten at Namaste, though I do love that patio something fierce. I was craving potatoes the other week (odd, I know), and specifically the kind of potatoes that come inside a masala dosa. Their spicy fried potatoes are a must, though they are a bit different from what I had been craving originally. They are cooked with turmeric oil, cumin, paprika, cayenne, ginger and garlic. SO savory. I could've downed three big orders myself.The Goan fish curry is a spicy stew with grated coconut and poppy seeds. It comes from my own Portuguesey-Indian people. I was expecting MN hot, so I ordered it extra hot and almost died. Never again---the flavor was in there somewhere, but somewhat buried under hot chilies. I ended up having to put out the fire by swallowing my pride and adding a whole can of coconut milk at home. Who have I become?! As I said, it's been a while since I've been here but I also remember the chai and the momos being top notch too. The menu is nontraditional in comparison to other Nepalese or Indian restaurants. You'll still see old favorites, but slightly sexier. Like bison momos and rather inventive chaat. The menu is also really well-labeled if you have dietary restrictions (vegan, vegetarian, gluten-free, etc.).Happy hour is from 3-6 daily and they also do a Tuesday date night for $35 (two entrees, bottle of wine, dessert) and 1/2 price wine nights on Mondays. I will return for one (or all) of those occasions soon. However, not sure that I'll order the fish curry again. There are too many other things on the menu that look delicious and haven't tried to murder me."], ["Emily F.", "I want to like Namaste so bad because it's  just blocks away from my place and I love Indian food in general (I used to be a waitress at an Indian restaurant as well), but every time I try to give it another chance, I'm left disappointed and thinking only three words: \"BLAND. BLAND. BLAND.\" I have tried several dishes here, a couple being the Chole (more commonly known as Chana Masala), Aloo Bodi, and Cauliflower, Peas & Potatoes. Each time, the only thing I could taste was the heat (levels 2-3). I love spicy foods, but they have to have flavor. I also got the Garlic Paratha, which was equally flavorless (where the garlic at?), and overpriced, considering you only get one thin piece, when most Indian places give you at least two -- not to mention, with dipping sauces.The only reason I am giving Namaste two stars instead of one is because of the ambiance. It has a great outdoor porch and patio, complete with a nice touch of lanterns/garden lighting and a great people watching view of Hennepin Avenue just outside the heart of Uptown. The inside is cozy and \"homey\" without feeling homely. The service is also decent. So, if you're willing to sacrifice flavor for an enjoyable environment, by all means, go. I even give in from time to time because the location is so great...BUT if you'd like to have your Mango Lassi and \"eat it too,\" pass."], ["Jesse G.", "Excellent food and our waitress was excellent at her job and personable.  The food was healthy and non-greasy. The place was a chill in-house restaurant setting .  I will be going back especially in the summer. Beverage note: the mango lassi was off the chain good!"]], "India Palace": [["Alfred L.", "This is our go-to place when we are craving indian food on the east side of the river. They have a great lunch buffet and the staff is always friendly. It does attract a good size crowd during its lunch hours. Their naan bread is awesome!"], ["Dan And Mo D.", "Both food and service were very good. The appetizer platter was the best. We got the meal for two and it had a little bit of everything. It was pretty good but nothing special, although the naan and curry were delicious! We loved the different side sauces that went with the appetizers. The dessert was a warm sweet donut and it was okay.Our server was very helpful as it was our first time. Food came fairly quickly. If you're looking for a first experience with Indian food, this would be a great option!"], ["Liza P.", "This is a great lunch place, with friendly service, delicious food, and reasonable prices ($12 for lunch). Whenever I've come here with a group for lunch, we are always seated immediately (the restaurant seems to be perpetually half full). If it's experiencing a surge of clientele at the exact time you arrive, you might have to wait a few minutes in line to go through the buffet, but usually there is no wait. The food offerings are your typical Indian buffet food: rice, naan, some vegetarian options, a couple chicken dishes, and a lamb option (yum). There is also a small salad bar and dessert. Empty plates are taken away promptly by the waitstaff, and water is refilled often. I'd have liked to see a slightly larger set of options (maybe some samosas or those super sweet dough balls that ooze sugary syrup), but all in all, it's a lovely place to grab a quick bite to eat."], ["Jenny A.", "My first encounter with Indian cuisine was not at India Palace, but at Sambol in Eagan. Many years ago Sam asked me to dine with him and I agreed, but he wasn't expecting the meal to turn out so... romantic. We were \"just friends\" at the time and when we walked into the restaurant the dim candlelight, linen table cloths, soft music and abundance of adult couples became apparent. I thought for sure this was a set up and the look of embarrassment and nervous sweats beading off Sam's forehead was so adorable that I stopped caring how awkward it was. We laughed and joked while Sam offered me different types of dishes, most of which I hated, but he didn't know at the time that I don't care for lamb.  Despite that, I'll forever have fond memories of Indian food for the simple fact that it reminds me of that evening every time I eat it.Fast forward to more recent years; Indian food makes a semi regular appearance on our menu and India Palace is where we love to go to get it. The service at this particular restaurant has always been not only good but reliably good. The waiters and waitresses make appearances at only the appropriate times, not when our mouths are full. They talk quietly and calmly when taking your order and always get it right. I've never encountered a rude person waitstaff or even one that stand around with their thumb in their ass looking bored. The tables turn quickly and the restaurant is always clean. The food is great. I've tried a multitude of dishes here, some better than others but they're always cooked well, served neatly and always the exact way you ordered it.  My favorite so far is the Chicken Malai, but almost everything else I've had is a close second. The mint chutney is a spicy but fresh compliment to any dish you order. The wine is a good price so if you have the craving for a glass just go ahead and get it. The chai tea is hot and loaded with Indian Spices (I add sugar to sweeten it up).There's not a bad thing I could say about India Palace and the rich warm flavors are perfect for a cold winter's day."], ["Kara D.", "I have only been here once, so far, to grab lunch to-go from their buffet. When I arrived, I paid at the register ~$10 to get a container to fill from the buffet. At first I was like, \"ugh, all these jerks get to enjoy AYCE but I only get one plate\". I was honestly worried that I wasn't getting the same value as the customers dining in because I am cheap and internally obese. But the container they gave me was of ample size and compartmentalized, and it ended up being two large lunches-worth for me. Plus they give you a fresh batch of naan, complimentary. And the employees are really freaking nice there.I cannot recall all of the names, so please refer to the photo I posted as I describe the dishes by compartment and color of mush:- \"Try the grey stuff, it's delicious\"? F the grey stuff, try the green stuff. The dish in the top left corner of my tray was my favorite. It had tender chicken in a creamy and herb-y sauce (predominantly cilantro).- There is a small compartment perfect for condiments, which made me more joyous than I think is normal to be over condiment compartments. I filled it with spicy mint chutney.- The bottom left of my tray contained 2 entrees: what I would call the Indian chicken nugget, cooked in a creamy light curry. Another new favorite. And of course, palak paneer found its way to my face, per usual. - There was a bone-in tandoori type chicken as well (bottom right).- And of course, basmati rice. I threw in a few Indian \"pickles\" too somewhere in those heaps.This will be my new work lunch hot-spot, I just know it."], ["Dua X.", "I was skeptical about trying out this place because I've had negative experiences with Indian food in the past but this place blew my mind! First of all the service was exceptional! Our server along with all of the other servers in the restaurants were friendly and helpful. We went in a large group and they were very patient with us. To top it all off the food was fantastic! Everything was made hot and fresh! The wait wasn't very long at all either considering it was a Saturday night and it was quite busy. The Naan bread was so yummy and fresh along with everything else we ordered. I had the Chicken Josh and I would totally recommend it! Everyone at our table loved it! Awesome place! Will definitely be coming back to try out the buffet!"], ["Shirley B.", "The food was soooo good!  Service was very friendly and they kept our drinks full.  I can't wait to go back!"], ["Chris M.", "All of my visits here have been for the lunch buffet, so take my ill-informed and barely literate review for what it's worth. First and foremost, I generally steer clear of buffets for a number of reasons, including, but not limited to the fact that I generally prefer food that hasn't been aged in steam trays for hours, my general lack of will power and the inevitable food coma that generally follows said fits of overindulgence. With that said, I likes me some India Palace. The buffet itself isn't too large, but is generally comprised of a number of dishes that appeal to both vegetarians and carnivores (e.g., various curries, palak paneer, tandoori chicken, etc.), naan, a green salad, mango pudding and a couple of chutneys. Due to its modest size and popularity dishes are restocked quickly, so the food is generally pretty fresh from the kitchen.The staff are generally friendly and while the strip mall ambiance isn't anything special, it's a solid place to eat way too much over the noon hour."], ["Samuel W.", "We found ourselves here last night, coming off the heels of an absolutely miserable experience at Everest on Grand, and it occurred to me that my previous review was one of my early ones. As 'early' is code word for 'shitty, brief and underwhelming', I thought it prudent to revisit India Palace in a manner more befitting of its charms. The location hasn't changed, clearly--it's still situated in a small strip mall, coddled firmly by its suburban surroundings--but it's fairly easy to forget that once you're inside and encapsulated by the warm aroma of spices. Let's break it down into two sections.______Service: The wait staff work tirelessly here, constantly maintaining a clean environment and tending to guests with a smile. The service, though quick, is not rushed in the sense you feel as though they're trying to musket pump you out the door at their earliest convenience. Truthfully, as I take stock of the stellar staff interactions we've had here over the span of two and a half years, I'm compelled to easily give them five stars on that front. ______Food:I've said it before and I'll say it again:Great food can outweigh bad service, but great service can't outweigh bad food.Thankfully, you won't have to endure either of them being terrible here.Now, while I cannot rightly vouch for the 100% unwavering authenticity of the eats here (whyte 4 lyfe), I can definitely attest to the food having the 100% tasty 'I need dis' factor.As is the case with most cuisine of this nature, the spice level can be adjusted to your liking. I've always admittedly gone for mild (not because I can't withstand heat, but because I want to wallow unimpeded in the comfort of a sweet, rich, creamy sauce) so I'm not entirely sure if they're grading on a Minnesota curve. I've had 90% of the appetizer menu and I find myself partial to the Mix Pakora, the Tawa Paneer, the Samosas and the Paneer Pakora, all of which have excellent flavors and never fail to impress. The Palace Platter contains most of them and is a good way to sample a large variety without breaking the bank at a price of ten bucks. The naan bread here is great, too, and I recommend both the garlic and paneer varieties. It's hot, chewy (not frail and crispy like I've had elsewhere) and serves as an excellent complement to sop up the sauce from the entrees. I love paneer. Like... deeply love paneer. I'm a huge carnivore and I've been known to order off the vegetarian menu (Palak Paneer, Matar Paneer, Paneer Makhani) just to get my fix.Thankfully for me, though, they're more than happy to add it to any dish and I frequently have it tossed into the Chicken Kashmiri, Chicken Curry and Chicken Makhani. All of them have that thick, sumptuously creamy sauce I'd shamelessly clothesline a hobo to get my hands on.Their tandoori specials are certainly worth mentioning, too; the meat is always tender, juicy and sizzling when it finds its way in front of you.Again... five stars. ______Another cool thing that merits mentioning is the fact that they're open ALL day now as opposed to shutting down briefly from 2:30-5:00. This is odd, indeed, for an Indian restaurant and certainly something we'll be capitalizing on in the future.So... if you've had bad/borderline nightmare experiences elsewhere *insert still fresh scowl here*, come be comforted in a warm curry blanket at India Palace."], ["Toby S.", "Good Indian food in a strip mall? Heck yes!I first went here a few years ago on a first date where the food was the only redeeming thing.  So glad I went back again.The fresh made naan comes still warm and glistening.  We ordered two different chicken meals both filled with real chunks of chicken and flavored well.The meals are served family style making it easy to share.  The drinks are reasonably priced (Try a Taj Mahal) The service and atmosphere are great.  My one complaint was the glass that my beer was served with had food stuck to the outside.As we were getting ready to leave another table got a plate sizzling veggies and meat.  Must find out what that was for my next visit."], ["Lauren B.", "Considering the good reviews, I have to say that I was pretty disappointed with the food here. It was very overpriced and meat-heavy compared to comparable Indian restaurants in the area. The food wasn't bad, but I probably wouldn't go back."], ["Sophie P.", "we just moved to Woodbury and all of my dishes are packed. Great time for some Indian food. We ordered veggie samosas, naan, tandoori chicken tikka, palak paneer and beef josh. Everything was very tasty and the perfect portions. Wish they had chicken 65 like the Indian restaurant back in my hometown. We will be visiting for the buffet."], ["Bea C.", "Amazing food! Got the tandoor chicken for two and it was a lot of food for two. It even included dessert. Am definitely coming here again."], ["Thomas W.", "Always the best Indian food. The clientele reflects this opinion!Staff very helpful and service impeccable!"], ["Reggie L.", "I try to get here for lunch as often as I can, the food and service is outstanding, the naan is always fresh and so is everything else."], ["Kristine W.", "This is the second time I have been here for the lunch buffet.   The buffet is excellent.  I know what everything is, but it is very nice they have everything labeled on the buffet.  I have yet to try something I didn't like.  Very good quality.Service is always professional and upscale.We will be back."], ["Ramesh B.", "Over priced, sweet and not tasty (cannot be called an Indian curry). We had 4 takeouts curries - chicken josh, chicken karai, channa saag and shahi panneer. Both the chicken dishes tasted the same, creamy and sweet nothing like the description. The quantity is very less for the price."], ["Amy R.", "Almost a 4, but not quite there yet. Stopped in for lunch today. Was pleasantly surprised to see that they have ther lunch buffett every day of the week and for a pretty reasonable price. Typical buffett with:-Naan-Tandoori-Salad-Rice- and about 4-5 other main dishes. The dish with the tofu like chunks and vegetables was delicious!Really loved seeing samosas. I love those things. Very good at this place.Decent service.Will likely return if in the area and perhaps to try some of their menu items."], ["Phillip Y.", "OMG, I came here for lunch with a colleague and thought it would not be good for buffet.  Well, we came early at 11:30 AM and got a nice selection without the wait/line.  The nan was good and the curry was just right.  I only did 2 plates which was enough.  For $10 per person, you can't beat the price.  Plus, my colleague treated me since I treated him last time at Duc's.  Well, a lot of 3Mers so you know that people like this place for work lunch.  At noon, this place is full so may need to wait for table.  Btw, the BBQ chicken was my favorite if I had to pick one."], ["Zeke T.", "When I first tried Indian cuisine I didn't care for it very much.  This place reintroduced me to it and I've been a fan ever since.  When I was with 3M I used to come to this place a lot.  It can get pretty full during the lunch buffet.  I am not sure how the rotations work but the food gets changed up quite often.  I am a big fan of the fish pakora here and any kind of curry with goat in it.  If you're lucky you'll come on a day when they serve a type of frozen yogurt.  They don't have lunch buffet on the weekends, and that makes me a sad panda; albeit a highly intelligent one that can operate a computer."]], "Gandhi Mahal": [["Ellen C.", "I was excited. I wanted to get some Indian lunch buffet before heading to Rainbow and Target (which are basically right across the street) for some errand-running, and came out a bit disappointed. Wednesday lunch buffet was $10.72 including tax for one person. When you enter there seems to be two sides of the restaurant. Right down the middle is the table where they put the buffet line. To the left, in the front, is an area where I'm guessing their live music is played when there is live music. The left side of the room appears to be more for 2-person tables while larger groups would sit on the right. They did try with their decor. There's an obvious Indian flair combined with its industrial setting, which can be charming if you look at it the right way. There is a bar which is a bit untraditional. There were about 10 dishes and 2 desserts. From what I can remember, dishes included:Salad (shredded lettuce, shredded carrots, the usual)Cold potato salad (Indian style, with parsley, yogurt)NaanBasmati rice (plain & with peas)Spicy chili chickenTandoori chickenSaag with beansMixed veggie curryLentil curryMock meat curryThe desserts included:Rice puddingCoconut pudding of sortsI was disappointed there weren't more curry varieties - lamb, tikka masala, etc. And what was there wasn't very good in quality. The chicken in both the chili chicken and tandoori were dry and difficult to chew. The veggie curry was good but was obviously using frozen veggies. The mock meat curry was essentially fried gluten (frozen or in a can) put into curry. The desserts were good and were a good end to the meal, but for the price I would've better quality, better variety. And although I didn't mind, if you're on a date or business meeting, I found it surprising that they gave me my bill when I was still working on my first plate (about 10 minutes after having been seated)."], ["John C.", "Please be advised this review comes from someone with very little experience with Indian food:The curries, bismati rice, fresh flatbread and samosas are excellent.  I highly recommend the lunch buffet as a way to find out what you like if you are a newbie.  Hard to fault the waitstaff if they can't explain what \"vindaloo\" tastes like but you can usually talk them into bringing out a small sample if you really want to know.Looks like this place used to be two different businesses so if you find the live music to be annoying you can always sit on the other side and ignore it."], ["Jessica B.", "You must eat here it is delicious and the staff is friendly! Wish there was better parking..."], ["MD I.", "I Dine out at least 10 times a week. Usually not a review writer kind of person. But this time I thought I should. First of all, this is not my first time here. Ive been here at least 4/5 times before. Yes they \"had\" great food. Interior need a total renovation before people starts getting sick by dead skins and dust all over.Floors are greasy.Servers and Hosts are arrogant. The lighting is dark so that it hides blemishes, too late. I ordered Lamb kebab, Rogan Josh, 2 Naans, Order of Beef samosa and mango lassi.Lamb Kebab: It didnt have any flavors, simply grilled. no spices. people go to indian restaurants with expectation of indian spices. THis kabab was Bland. Also the onions that came with didnt seem to belong. Rogan Josh: Indian Food is all about spices and aromas. they put a lot of ingredients and yes they cook it for long time.My rogan josh was undercooked. I could bite gingers and garlic. No execration, Me and my wife felt sick afterwards. Beef samosas were Small, i mean very small. 5 bucks for two beef stuffed ping pong balls were not even tasty. It kinda tasted sandy. and they were over fried.Server: My server was Jamil. Okay, here is the fun part. I asked my server if they had any change in the kitchen, or any new chef, He said : No. we still have the same chef. Is everything okay?Me: I came today just to have the Lamb kebab, because it was really good last time. it seems to be bland now.Server: This is how the lamb Kebabs are.Me: And the Rogan josh seems undercooked. I think the spices are still raw.Server: This is How rogan Josh is.SERIOUSLY????On a note: I am from the same ethnicity. I know how each things should taste like. Matter of fact Those are my usual order in every Indian restaurants. I dont go to indian buffets because no place serves those in buffet.PS: I usually leave at least 30 percent tip. Bill was 50.xx. I put 51.00 and left.This place need a total renovation, if possible, otherwise it doesnt cost anything to take those \"decorative\" clothes from ceilings. and The music is suitable for Boutiques not appropriate for Restaurants. It sounds Horrible with Foods.Other Customers: Try Darbar India Grill Instead. Million Times better in every aspect. I hope the owners and managements take my review positively. So that I can go back again."], ["Kristina D.", "I'm a pretty big fan of this place, whether I'm dining in the restaurant, getting carry out, or ordering delivery. The food is fantastic and made from quality, fresh ingredients. My favorite highlights: a play area for young children, including a play kitchen, giant Legos, and various other toys. Convenient delivery options, either to your home or across the street to the Harriet Brewing Tap Room. Friendly, knowledgable staff willing to explain spices and the many gluten free options.There are a few downsides, which is why I didn't  give it 5 stars. The play area is extremely dark, and sometimes my kids won't play there without an adult nearby. It is also fairly small and tucked away into the corner - sometimes, if the restaurant is crowded, we can't sit near it and can't really use it. The service is often extremely slow - plan at least an hour for your meal. There is also no changing table in the bathroom.Despite these inconveniences, this place is one of our favorite choices to dine with family and friends, with or without our small children."], ["Ford P.", "I love the buffet. Great flavors, perfect spice, affordable, well stocked, attentive staff."], ["Danielle D.", "Food was alright, but not very flavorful.  I luv indian/pakistani food. I have had food made from friends are from india/pakistan. Depending on where you are from the flavor will differ. The decor was beautiful. There were two guys upfront playing music. I went with one of my favorites, dal, all I could taste was hot spice no flavor. Wont be back."], ["Callie P.", "I am officially an Indian food convert.I was dubious at first, but this place is ah-mah-zing. We get the samosas to start. They are buttery and flavorful. No sauce needed. I usually get the korma- it's the perfect amount of spice and flavor for me at mild. Medium starts getting seriously spicy. The rice is always a perfect al dente. There is always a wide variety of vegetables-broccoli, green beans, potatoes, tons of stewed yummy veggies.The DH got masala last time. He called it the \"perfect blend of spiciness and creaminess.\" If you enjoy carbs (as you should), order the naan. All kinds are great, but we usually get the garlic. Be warned- it's GARLIC. Perhaps the best part of Gandhi Mahal is the service. They have wonderful servers who are happy to help you order or refill your water. Give this place a try!"], ["Shuhana K.", "Visited MN just days ago with my husband, read great reviews about this place so thought we'd give it a try.  We fell in love with the food and staff!  Being from NYC I tried many Indian dishes but no place can beat Gandhi Mahals Chicken Tikka Masala and Daal, its the BEST I ever had like seriously!!!!  The ambiance was lovely, the staff were sooo friendly.  The manager went to each table making sure all his customers were happy he was very welcoming to my husband and I and friendly and took very good care of us we just loved the friendly atmosphere and of course the delicious food! I went back there again the next day for their lunch buffet which is also a PLUS!!!  My fave was the chilli chicken and daal of course!!!!"], ["Kurt M.", "I had dinner here for the first time last Friday. I've had this on my list of places to try for some time. I will definitely be back sooner than later. I'll try to add something useful to the many, many previous reviews.A friend and I started with orders of garlic and coconut Nan. Both breads were perfectly baked in the tandoor oven with excellent texture and flavor. The garlic Nan was satisfyingly savory and the coconut Nan had only a hint of sweetness which I found delicious. Previously, three sauces were brought out with complimentary Papadum (crisp, thin, cracker-like flat breads) and were all very good. While I prefer the green dipping sauce at Taste of India which has more of a fresh mint bouquet and taste while still packing a spicy punch, Gandhi Mahal's is top notch. The chutney was crisp, brightly flavored and had a nice sweet/hot balance. The tamarind sauce was very good but again, I prefer the version served at Taste of India.  For entrees, I ordered Chicken Tikka Masala. Using the green dipping sauce as a point of reference which, according to our server falls into their \"tura bahati mirchi\" or \"medium hot\" range I let myself be talked into specifying \"tura.\" Next time I'll know to insist on more heat. I may even give the Bollywood jana (extra hot) a try. In any case, my order was chock-a-block with chunks of lean, white chicken surrounded by a sauce that practically wanted to leap onto the Nan as I sopped it up. My friend ordered shrimp asking that it be prepared in the same fashion as the Sizzling Salmon, marinated in panch puran spice and garlic and cooked ala tandoor, served over grilled vegetables. I tried one and it may have been the best shrimp dish I've ever enjoyed. It was tender with a perfect sear and had a subtle smokiness that blended superbly with the spices allowing the underlying flavor of the fresh shrimp to really pop without being overwhelmed. There was a bit of a mix-up with a vegetarian dish. Mushrooms in curry sauce was ordered but what was brought to the table was Mushroom Paneer from the seasonal menu. The house was very gracious about replacing the dish. I have to say that we both tried the Mushroom Paneer and found it very tasty. We could have lived with the error. However, since the bulk of the dish was actually for my friend to bring home to his wife (or was he supposed to bring home jolly, jolly six-pence?) we asked for the correction to be made. I added a cup of Darjeeling which would be better if steeped with loose leaf tea, not bags. But that's nitpicking. This is a clean, friendly, casual place. Service was uniformly wonderful. A nice, classic touch is the delivery of a hot, moist towel with the check. You may hear live sitar music on Friday and Saturday evenings. Overall, another stellar Twin Cities outpost for Indian cuisine. BTW, the city has installed a couple dozen of the new multi-space meters offering angled parking in front. Or, you may be lucky enough to find a free spot on nearby streets."], ["Reggie F.", "I really enjoy eating at Gandhi Mahal. I recommend going during the buffet and filling up your plate with all sorts of things you might not have tried otherwise (plus a nice pile of Nan). I was skeptical, but completely fell in love with the flavors. The service is very nice, and the vibe is authentic and cool. Give it a try!"], ["John C.", "Overpriced. Good place for music."], ["Anna L.", "This was the most highly recommended Indian restaurant, and the first time I went there it didn't live up to expectations, but maybe my expectations were too high. The second time, the food was noticably less flavorful than the first time. The third time was blander than the second. The fouth time is the reason for the one-star review: The waitress took my order... AND NEVER CAME BACK until she brought my check. Someone else brought my food, and I had to flag down other waiters if I needed anything. My watiress had the two tables on either side of me and she waited on THEM but seemed to be deliberately turning her back on me or looking over my head. Sub-par food is one thing but being ignored is much worse. Also, my favorite dish is saag paneer, which is really hard to mess up, but they managed to take all the flavor out of it. I don't even know how."], ["Abhilash R.", "I seriously don't suggest the Gandhi mahal Would prefer the other Indian restaurant compared to it"], ["Daniel K.", "This place is awesome. Kind waitstaff, open late, with great food. I got the Ghandi thali. It was perfectly spiced and was so large I couldn't finish it all."], ["Ikram H.", "My wife and I went there for Dinner AND Lunch last week and our experience there was EXCELLENT!!!!  GREAT FOOD, GREAT STAFF, GREAT AMBIANCE!! What else can you ask for?"], ["Salena a.", "A number of people have told me about how great Ghandi Mahal is so I was excited to try. This is literally the only Indian place I ever hear about.1. Lack of vegan dishes. I asked if something could be made vegan and I was told nothing could be made vegan and was directed to three or four dishes that I could choose from. I don't expect every Indian place to have a whole lot of vegan options, but I was disappointed.2. Quick Service. This is not a good thing. It was probably five minutes between placing the order and receiving the order. Assuming the food was already made and no wonder they can't make changes to dishes. Also made sense why the food I asked to be made spicy, wasn't.3. Servers. It felt like 10 minutes into our meal that someone asked if we needed boxes. This was 7 on a Saturday and it wasn't packed, but we felt we were being rushed out of there. 3-4 more times we were asked if we wanted to box up our food while we had food on our plates. Someone eventually came buy and just placed containers on our table. The best part was that we had to ask for a bill and the server had this straight up annoyed look on his face when we asked for it. The food that we had was pretty good. I don't remember what my friend had, something with chicken, I had the something with peas and potatoes. I wouldn't say it was amazing in any way, but good. The whole meal (including, 1 beer, 1 tea and naan) was around $40 which was NOT worth that price. Great place in terms of growing food and sourcing food locally. But like most things, doesn't live up to the hype."], ["Marcus L.", "I really like this place.  It's so fairly priced.  We always get great food here. They support local farmers too. It's not fine dining Indian, but it's great solid food.  I dare you to cook more at home for less."], ["Lindsey W.", "Wow what awesome and authentic Indian Food!  We came here after a Red Bull Crashed Ice event and were freezing from standing outside for hours on end.  This place was the perfect spot to get ride of the cold MN chill.  We enjoyed the vegetarian samosas...great flavor and the green sauce is unbelievable!  We tried lamb, goat & chicken dishes with various preparations.  I love the lamb and chicken the best and I think those had the tikka masala preparation on it.  The coconut curry with the goat was just okay, I wouldn't get it again.  The garlic naan is delicious and I would definitely get 2 orders if you have more than 2 people!  I can't wait to go back and try some of the vegetarian dishes, I was with meat eaters who weren't too fond of just veggies (I think I'll convince them otherwise next time).  I also want to try the mango lassi...I'm sure it is amazing!"], ["Kim S.", "Tried the buffet & not impressed. Lots of spices but no balance. A funny after taste from the curried veggies & other  veggie offerings  Must be from the canned green beans & such.   $30 for - I'd rather go to an Indian buffet w/ lamb."]], "Everest on Grand": [["No One I.", "We came in here on a Thursday, the moment we walked in the food smelled amazing! We waited like 10 minutes them got seated. We started with somosas & mo mos. the mo mos were great, the somosas were not our thing though. We ordered the chicken tika masala extra spicy, the sauce was amazing. Loved it. We had garlic knan with it & it was great. I ordered the chicken chow chow & it was incredible! Noodles were a little greasy but still great. For sure will come back!!"], ["Amy J.", "Amazing food. The yak momos and accompanying doing sauce are excellent. And all the entrees I've tried are great too."], ["MALEAH A.", "Get in my belly!!That was my first thought walking into Everest.  Just one whiff is all it took.The most amazing smells are generated from this restaurant.  We contributed by ordering veggie pakora, yak momos, tandoori lamb, and butter naan.  Oh, and the chiya tea.  Each dish came with even more taste than it did pungent aromas.  The pakora was fresh and crispy.  The yak momos were flavorful yet delicate (apparently, I love yak!).  The tandoori was mouthwatering and amazing to the last bite! To be honest though, even if this place only served their buttery naan and chiya tea, I would be a repeat customer.  So delicious and warming on a cold March evening.Service was spot on.A wonderful place to warm up your taste buds and your soul. :)"], ["Sam A.", "Smaller, quite place with great food!"], ["Lisa M.", "Spicy, whew!In my never ending quest to try new stuff in St. Paul, I met up with a friend from out of town at Everest on Grand for the lunch buffet on a Thursday.We were put at a small table by the sweaty window.  The seating area is  a little cramped for me and everyone can hear everyone else's conversations.  I had water and she ordered a DC, which had we not asked, it would never have been delivered.She was going to order off the menu and get Chicken Tikka Masala to compare with other joints, but once she heard I was getting the buffet, she joined me.Here is what I liked - the back of the menu listed each day of the week and item on the buffet.  It's a great idea for those of us who want to try new things and come back again.Here is what I liked and what I didn't like -Liked -Pulao - the rice had a nice flavor and was very light and tasty.Pyazi - fried onions and jalapenos - nice crunch and good flavor, without being too spicy.Chili chicken - good spicy flavor with a great rather spicy sauce.Tarkeo Aalu - sauteed potatoes.Didn't care for -Gundruk - the soup was cold and the flavor just didn't work for me.Poori - the bread was greasy, chewy and also cold.I get that it's hard to keep fried items hot and not limp on a buffet, but maybe they could make less each time and keep it replenished?   I have mixed feelings about the place, I want to like it and go again.  I might go back and try some of the other buffet dishes, but in looking over the menu, I'm not sure I would go back for dinner.The food decent, the service meh, but for $10 or so at lunch, I guess it's not bad."], ["Suz S.", "Food: the chicken dumplings are amazing! I'm giving this place a 4 out of 5 stars alone for them! For 6 homemade chicken dumplings it's only $5!  We ordered the chicken tikka masala which was fine but a bit bland. We also ordered the sautéed noodles with vegetables which were fine as well.  Get the dumplings though, you won't regret it!Service: friendly and efficientDecor: cute interior and relatively comfortable if you're staying for an hour or so."], ["David S.", "Try the veggie momos and park around back.  First time having Himalayan/Nepalese food.  I had the veggie momos and the Jogi-tarkari (Mixed Veg Curry, mixture of potato, green pepper, cauliflower, eggplant, potato, broccoli, zucchini, carrot, snow & green peas).  I ordered it hot as I like spicy food.  The first few bits weren't spicy at all and I thought I was going to be disappointed.  However, the spiciness continued to grow and I was very pleased with the flavor and the heat.  Friendly staff that stayed around after they had closed and chatted.  I travel to the Twin Cities a few times a year and I am excited to come back and eat here again."], ["Karl H.", "I had to do a double take because I can't believe I haven't already reviewed this place.I'll start with the momos, they are indeed amazing. The sauce that comes with them puts them at crazy awesome level. Any of the meat or the veggie momos are great. Next up, the Samosa Chaat. Again, absolutely amazing and again the sauce is great. I usually can't decide between these of the momos, gives me a headache just thinking about it.On to main courses. I've tried so many and they've all been fantastic, not just good either, absolutely great. The Khasiko Maasu, aka, goat curry is surprisingly tasty if you're looking to try something different. Mostly bone meat so it's a caveman like dish but it's good.Another favorite of mine is the Ramtoria aka fried okra. I usually get a side of it just because I can't ever seem to pass it up. It's another  tasty dish.I could list off all of the dishes I've had here but that'd get boring so you should just go and try it instead. Everything on the menu has amazing flavor. If you want to taste some truly unique and amazing flavors I can't recommend this place enough."], ["Jeannie V.", "I could eat momos by the pound, and the ones at Everest are the best in the city.  Everything my husband and I got here was fantastic, and the service was friendly and courteous.  I have nothing negative to say about this place except that I wish it was located next door."], ["J. F.", "Yak momo...it is fun just to say, but it is more fun to eat.  Our table fought over the small order that we got as an appetizer.  We got samosas too, but the momos were better.The big bowls of rice noodle soup were perfect for a cold night.  Spicy and warming, but not heavy.  I'd love to come back and try more of the menu.  That's the sign of a good first visit, right?"], ["Mallory B.", "Such a cute little place!Our water glasses were never empty, which was top since the food we ordered was muy caliente. The Mo Mo's were awesome as were the curry's that my friend and I split."], ["Tom K.", "We love their spicy offerings, especially the vegetarian dishes!  If you go there and only have one thing, make sure you have the fresh garlic Naan bread!  Absolutely the best!"], ["Logan D.", "We love Everest and always choose it first for going out to eat. thanks to this place my friends now love ethnic food!"], ["An D.", "A solid restaurant that's manage to accommodate us even when we come in at weird times. The food has always been tasty. I almost always go for a lamb dish and it's always nice and spicy, giving me a good sweat. Honestly I'm writing this so Yelp stops bugging me, but I'll surely be back (I've been numerous times) and will fill in a fresh review when I do."], ["Mahesh K.", "Huge shoutout to Amy R for taking me out for dinner at this place. We were there just after 5:30pm for dinner and the place slowly started filling up tables. By 6:30, the place was packed with a few people waiting in line. The place is intimate, because of its size and too many tables too close to each other for obvious reasons. The appetizers (Veggie Momos) took a while to get to the table. Honestly, I was happy about it since they were freshly made. The sauce adds taste to momos and the spinach gives the flavor. All in all a good way to start dinner. I ordered the veggie combo meal, which comes with any 2 entrees. Mine were Palak Paneer and Katahar. I can vouch for the Palak Paneer as it is the best I have had in my life. Creamy, tasty and excellently done. The other curry is made with jack fruit and I guess I should have had it a little more spicier. I went with mild which is wjhat it was. May be a medium or medium+ will add great deal of taste to the already tasty curry. The combo meal comes with white rice and a dessert. The kheer could have been much better. I think they need to add more wait staff so they can attend to the customers in a better way. I will try their buffet sometime and update my reviews soon."], ["Dawn S.", "This was my first experience with Himalayan cuisine.  I think they have a very good selection of dishes, meats, and vegetarian options.Parking is not great on this part of Grand Avenue at 5pm when we arrived.There were only two people in the place, which made me nervous - but by the time we left at 7, more than half the tables were filled.I had the Veggie Pakora, Veggie Momo, and Veggie Thukpa.The Veggie Pakora is like tempura, but a lighter batter.  The seasoning was very good.  I can't wait to go back so I can order these again.The Veggie momo is a steamed dumpling with veggie goodness inside.  I liked them very much.  Next time I'm going to try the Veggie Kothe, which I assume is the same, but fried.For my main meal I had the Veggie Thukpa.  The waiter said \"you know that is a big bowl of soup\".  I didn't realize how BIG until it arrived.  I could only eat about 1/3.  The broth was so flavorful and the noodles were very good.  It seemed everyone that I heard ordering had trouble figuring out how spicy to order their food.  Everything is prepared to order, so you can decide how much heat.  They give you a scale of 1-6, I ordered a 2.  I can handle spicy food, but am glad I chose a 2, it was just the right amount of pain!"], ["Ellie B.", "I came here with my family and we had a good time. There are a great many vegetarian options for the lunch buffet.My husband liked his yak!"], ["Cindy S.", "This place has such great reviews and that's why I went. But, I was very unimpressed. I would have gave them a 3 star rating if it did not take 25 min for my Momos to come to my table and then another 20 min for my main dish. I had my 2 year old son with me and he was not very happy about the wait either. It was around noon on the weekend and there were only a few other tables, so why did it take so long for the food?? Another let down is the fact my dishes were dirty. I had to grab a new fork because it had some dried on food. Then after I had already been drinking my water, I realized the cup I was putting my lips on had lipstick on it that did not belong to me. *GAG*The noodles I ordered were okay. Plain, is the first word that comes to mind for me. I NEVER have to add salt to my food and I am still shocked that I had to reach for the shaker. The momos were good, but nothing special. The servers aren't much for talking, in fact I think the only thing I heard them say is \"what would you like to drink\" and \"what would you like to order.\" I don't know if I just came on an off day, but I really doubt I will go back, unless some one convinces me otherwise."], ["Patrick H.", "Basically, any place that serves goat is good in my book.I don't consider myself to be an expert in the foods of the Himalayas, but my feeling is that this place is pretty dead-on. I'm not nearly as keen on curries as many people, but Everest's are tasty, and they know how to upgrade spice levels upon request. The momos are somewhat different than ones I've enjoyed elsewhere, but still really good, & should be considered a mandatory starter.What else should be considered mandatory? THE NAAN. Again, this is an area of world cuisine where I hesitate to make authoritative claims, but DAMN that naan is GOOD. There are several varieties, but I might suggest just sticking to the plain style. Also, be prepared to spring for a second order. Also, be prepared to get another order to go.Prices are reasonable/moderate, & service is adequate. Overall, Everest on Grand is a nice option for a change of pace. Also, to stuff insane amounts of freshly baked, sweet flatbreads into your face."], ["Amy R.", "The restaurant is quite an intimate close setting and was fairly packed for a Tuesday evening. J and I met up with Mahesh K (our first friend on Yelp * smile*) for dinner. We were all newbies to this particular restaurant. Highlights:+ Steamed Momos- Little delights of fresh and tasty accompanied by an amazing sauce. The mom achar was a really nice blend of spices and goes really well with the momos. I should have added some to my chicken.+Palak Paneer really subtle and good.Midlights:+ Charako Chaati- Tasty, but a little dry- need a little bigger container of mint sauce, but still good. It's a lot of chicken for one sitting, but makes for nice leftovers.Tried a bite of Mahesh's Katahar jackfruit dish which was interesting. Interesting texture. J had the Shrimp-daal-bhaat which looked good enough. I'm not a big fan of curry. The shrimp were a generous size.Ordered some garlic naan and mint sauce which I didn't receive. Oh well. Probably didn't need the carbs.More of a 3.5 for me. May put this place in rotation to go back and try the fried rice which looked really. Reasonable prices."]], "Darbar India Grill": [["Anna C.", "Excellent flavors! Also helpful and attentive servers and really reasonable prices. The garlic naan was heavenly, and the vegetable korma and mango lassi are also highly recommended. I'm no expert on Indian food--just a fan in general--but this was as good or better than anything else I've had in the twin cities."], ["William C.", "So here's the deal, food is awesome, service is good, location is decent; if you want to know the dets...keep reading!I had a team event and we decided on Darbar because I'm the \"team foodie\" and we were in Uptown.  As always while in Uptown, the parking situation is NOT fun.  There is paid metered parking, ramps and good old human foot power.  The interior is nice (in line with other Uptown joints) and pretty quiet during the lunch period; we were a little late to the party, around 1'sih.  They had a lunch menu and full dinner menu available and like a typical foodie, I had to order something rogue (instead of the typical tikka masala).  Like a hungry ape, I ordered Keema Naan and Botti Ka Masala...hey, I like going down the path less traveled!  The Keema Naan, which is stuffed with ground lamb was a winner!  Hell, everyone at the table ordered naan, which made me feel less of a savage; everyone agreed the naan was fantastic.  The Keema was filled with a thin layer of ground lamb, lightly seasoned and didn't over power the naan itself; which by itself (I tried the plain version) had a great chew, steaming hot and just right to dab into your leftover curry sauce.  The Botti Ka arrived (lamb, onion, tomato, bell pepper) and I was honestly a little disappointed...the portion size to price ratio felt outta wack.  Now, I know most India places serve curry in the small copper tins, but $14 for small tin felt like a jab in the wallet (this is my ONLY grip BTW).  As for flavor, buckle up for explosions on your taste buds!  The sauce was a deep orange (maybe red to some peeps?), the veggies provided a nice balance to the heat (I ordered level 4 of 5, still \"MN Hot\" in my mind) with plenty of large chunks of lamb; the lamb was GOOD, lean with a bit of fat.  All around, I'm a huge fan of the food, but feel the pricing is driven by the \"Uptown Effect\"."], ["Mike B.", "Walked in here at 4:00 on a Friday after being overwhelmed by a curry craving. We were literally the only people in the restaurant for the first half hour of the meal. I understand it's a little early for dinner, but still...between the good Yelp reviews and the prime location, I thought this was a little strange. Good for us, though, as we had a private dining experience for a bit. All of our food came out fast and hot, and our service was fantastic.The naan, both the paneer and regular versions, were some of the best I've had. Perfectly fluffy and buttered. The paneer naan had some great spice flavors that paired wonderfully with some mint chutney. My chicken curry had great flavor but wasn't as spicy as I had hoped. I asked for a 4/5 on the hot scale and maybe got a 2.5, so ask for a level up from what you think you want. Again, great flavors, though, and the serving of the curry and the rice was bountiful. I also tried a bit of the coconut shrimp. This was spicier than my curry but was evened out nicely with the sweet coconut.Darbar was one of the better Indian food experiences I've had in town. Highly recommended when you're in the Uptown area and get hit with that must-squelch curry craving!"], ["Taylor S.", "The restaurant was bright and clean, the staff was attentive and lovely and most importantly, the food was AMAZING. We came in to use a LivingSocial coupon and I'm so glad we did! The seekh lamb kebabs, chicken tikka masala and mixed vegetable curry will not disappoint. We ordered the lamb kebabs as an appetizer, at a spice level 3 (which was plenty spicy for us) and the entrees at a spice level 2 (perfect for a Minnesota level of \"spicy\"). To round out our meal, we ordered raita, a kind of sauce consisting of a blend of cucumber/tomato/yogurt that added a wonderful contrast to the curry and masala sauces. We had more than enough food (including our appetizer and two orders of garlic naan) but if you're only ordering entrees, three dishes split between two people is a good idea. I also recommend multiple orders of garlic naan (SO GOOD). As evidenced by the multitude of Bite Squad drivers coming in and out to pick up orders, it looks like a pretty popular spot for takeout. Whether taking out or dining in, we will be returning very soon."], ["Christina H.", "It could be that I am terribly unlucky, but I had bad experiences all three times at the Darbar India Grill. I went there for the first time about a year ago for dinner and the service was severely lacking. Once we got our food, our server proceeded to ignore us. We had empty water glasses all around and he walked by several times WITH a water pitcher without even glancing at us. Second time, I went for lunch and ordered a chicken curry. It tasted just fine and service was mediocre, but when I got the bill, the curry was priced at more than what it should have been. I asked the server why that is so, and she said that she thought I ordered my curry from the dinner menu. The menu does have a lunch chicken curry at a lower price and a dinner menu further back with a full price chicken curry, but this was not explained to me nor was it clarified when I put in my order with her. Mind you, I was eating at noon that day and I really hate complaining at restaurants, but it really was presumptuous of her to assume that I ordered from the dinner menu when the lunch menu was placed in front of me first. I asked her if anything could be done about the bill, and she replied that management will not do anything. Yesterday, I ordered their food via restaurant connection (cheaper than Bitesquad in my area) and had it delivered to my house. Everything arrived promptly and well-packaged. However, I had requested all my food to be of medium heat, but they all turned out to be so hot that I could barely eat them. So disappointed."], ["Donald J.", "We've been looking for a good Indian restaurant in the city for some time.  The atmosphere is quite nice, the food was outstanding and the service was exceptional."], ["Andrew T.", "Don't know too much about Indian food except that curry and tandoori are common. I got a chicken dish off the lunch menu containting both of those indgredients, along with chicken, potatoes, carrots, onions, and spices. The chicken was cooked to perfection and seasoned well. It came with basmati rice and some really good garlic bread (it's almost pita like). There are recommended wine pairings on the menu, so that was nice, and the place was really nice on the inside."], ["Leah G.", "Delicious. I am a regular/fan of Everest on Grand Ave in St Paul and have yet to find realistic competition. Until today. Pros:-delivery. Enough said (small delivery fee, worth it)-delicious, fresh flavors. I had chicken saag and chana masala and both were really really good. I ordered medium spicy, a #2 on the spicy scale. Hot would be really hot. I love it. -free range, high quality poultry. -Minneapolis vs. St PaulCons:-delivery took 1hr plus. No way to track it and through a 3rd party service.I will be back."], ["Shah R.", "I've been to Darbar only once, and truly, once is enough. The food was great and the atmosphere and vibe were perfect, but the problem was with the way they conduct their business. The service was ok, but one thing I can't shake is my party of 7 and I ordered different plates that are supposed to come with our own rice. They made us share two plates of rice and then we had to flag down another waiter to call OUR waiter when we needed more rice. I guess it would've been easier to just give us our own rice.Another problem I had was with our leftovers, I ordered the chicken tikka and I had a significant amount left when I got full, but they took my bowl of chicken back. Never offering to package my chicken and rice. I basically paid for a full meal, for just 1/3 of the dish. Very disappointing, because I couldn't take my leftovers home. And this restaurant isn't too fancy enough for a \"no take-home\" policy. Idk. They just seemed really CHEAP! That's all I've gotta say. Wouldn't really recommend. There are many other Indian restaurants in the metro that I'll stick with."], ["Doc H.", "I have been here a couple of times for lunch. The food is better than fair, but each time the service has been very poor.There was an inadequate number of servers for the number of diners. We were not initially offered water or asked what we would like to drink. The server brought the appetizer and meal out of order without explanation. The server never returned to our table to check on us once he brought the meal. On our second visit, my fiance and a guest from two tables away each had to go to the bar to ask for items, while the server stood talking to someone that was not even a customer.While the food is not bad at all, and the restaurant itself appears clean and welcoming, neither is worth enduring the terrible service."], ["Jessica S.", "Given its location in the dead zone between Calhoun Square and LynLake, Darbar is never a top stop for a night out on town. As such, it was easy to secure a table for 11 on a Saturday night for a late dinner. The food was pretty good, but Indian food is a weakness of mine and I'm not too judge-y. Fabulous curry sauces and the naan was pillowy soft and warm. The fried (not tempura style) cauliflower was a favorite! It was fried in a similar manner that I expect sweet and sour chicken, that same thin fried shell that created a luscious texture paired with the warm cauliflower. An excellent meat substitute for vegetarians, though the non-veg crew enjoyed too. Trendy enough vibe to fit in with the rest of Uptown."], ["Jessica B.", "10:15 pm. Nothing would hit the spot more then some palak paneer and vegetable samosas. Of course not realizing darbar stopped delivering at 10 when I called for delivery I was so disappointed to find out it was too late. 10 minutes later the brilliant manager on duty did me a solid and had his delivery driver go out of his way to deliver us out food. Not only it being past their delivery time but the food was hot and delicious as always. Thank you mod and thank you darbar. You made our night!"], ["MP J.", "The quality at Darbar varies dramatically with each visit. Occasionally, I get a five star meal there. Occasionally, I get fresh naan and perfect samosas. Occasionally, the main dish that I select, and I've tried pretty much everything on the vegetarian menu, is just right. I've had some killer chana masala at this place.But the bad meals are coming more frequently these days, to the extent that it will probably be a while before I visit again. Last night, I ordered take out and it was nasty. I ordered the matar paneer. It was good, but the serving seemed pretty skimpy. I'd give it three stars. That wasn't the problem.I can't verify this, of course, and it seems unthinkable, but I think the naan I was given was taken from someone else's leftovers. It wasn't even a full piece, but a few little mismatched slices. It had other food stuck to it, like not the food that I ordered. And it didn't look like it had just brushed against some other food in the kitchen, but like it had been sitting with other food. I also ordered veggie samosas. One of them was wet. Like it had fallen in the sink or something. And to make matters worse, they only gave me about a spoonful of each of the sauces. Come on."], ["C D.", "It's very average for anything \"Indian\" related. The sauce defiantly is watered down and there is a lack of anything that makes this place stand out from (if not stomped on) by other similar restaurants. It will be a long time if ever I order from this ace again."], ["Michelle L.", "Although I don't have too much experience with Indian food, I thought the food was delicious! The naan had me dying. I honestly could not get over how good it was. Both my boyfriend and I enjoyed our dishes and I would definitely go back for the food. The prices could be better, but it's not like I'm getting Indian food on the regular so I'll deal.The atmosphere is great as well. It's very clean and nicely decorated. The service? I still don't really know how I feel about it. It took awhile for our server to even come to our table after we were seated so that was disappointing. We tried to make it apparent we were ready to order but he still took awhile and it wasn't that busy so that didn't leave us with a good first impression. Throughout the course of our experience though, he was fairly kind and did all the right things (stopping by to check on us, offering extra rice, etc.) but he was lacking emotion when he was doing all these things. It was just super... awkward and just overall not ideal. He was nice but it left me wanting more enthusiasm when he was talking to us. If I end up going back, it would be completely for the food. I'm dreaming of the naan and... *drools*"], ["Kavya J.", "Loved the ambience the moment I entered the restaurant! Very pretty :) Ordered bhature, channa masala, dal makhani, roti and aaloo tikki. Bhatura was too thick, nothing too great. Channa masala was OK too. So was the dal. Aaloo tikki was pretty decent. Too pricey considering that the quantity was not much and the taste wasn't that great. Nothing close to authentic Punjabi food.The best part: ambience and staff! Will definitely give this place another chance n order something different next time."], ["Mallory M.", "Fantastic food and excellent customer service and a great atmosphere. Could not say enough good things about this place!"], ["Bryan E.", "Good Indian at a decent price, that's difficult to find in the twin cities. This place is great!"], ["Lia L.", "My family and I went there for dinner on a Friday night and we had the vegetable samosas as an appetizer and the chicken tikka sizzler, chicken makhani,  lamb madrassi for dinner. The food was amazing and got to us quickly,  surprisingly for a busy Friday night. Our server attended our needs and we will come back..I would advise anyone and everyone I know to go there and try it out."], ["Jeffrey P.", "Updale used to be a hip bohemian area. Now it reminds me of an overpriced strip mall.And is where Darbar India Grill is located.Make no mistake. You pay for the glitzy atmosphere here. A pitiful TINY dessert of \"Fried Milk Balls\" was 4.00. It consisted of 2 very small \"balls\" each the size of a large marble.The entrees consisted of a very small amount of protein in a very large amount of sauce and a dish of rice. Taste was okay. But again, TINY pieces of lamb and beef and not many of those for 13.99? I don't think so.Naan was 1.99. Good but again when EVERYTHING is a la carte except the rice it is obvious the rent on the place is in the stratosphere.Service was disinterested, cold and slooooooooooow.There are so many great small \"hole in the wall\" Indian and Nepalese places to check out in the TC that I can really only say put this one on the bottom of that list.I thought about giving the place 2 stars but the semi tasty naan and food simply did not make up for all of the negatives.I can say however that if you need that hand shaken Cosmopolitan with your meal in a frosty tall stemmed glass this may be the Indian place for you."], ["Ericka A.", "My friend and I love Indian food and I wanted to take her somewhere special for her birthday. We could have gone to any hole-in-the-wall curry place, but I used the Yelp app and filtered by rating. At the top of the list was Darbar, a restaurant that promises delicious Indian food with upscale decor.They got the ambiance down. The place is gorgeous and fits in well with how fancy Uptown has become. It has the feel of a lounge with a spacious dining area and cozy full bar. I noticed Mai Tais on the menu and had to go for it. It was happy hour and I love a good Mai Tai. Unfortunately, it wasn't a very good Mai Tai. I don't usually say this, but too much alcohol overpowered the drink and made it bitter. I might try a wine next time, and I was delighted to see they offer pairing suggestions on the menu.I realize there are different types of cuisine in India. Region plays a big part in the type of food you are served, so I don't expect each place to be the same. However, I have noticed many similarities on most menus. I typically order Gosht Pasanda at my favorite place in IL, so I asked the waiter which of the lamb dishes on Darbar's menu would be most similar to that. He stared at me blankly, so I asked if he knew what I was talking about and he kinda goes, \"We have this,\" and pointed to one dish. I read the description and it didn't seem right, so I tried to explain what I wanted and he seemed very confused and then pointed at two more lamb items. There are only a handful, so it seemed like he was just randomly pointing at things. Again, I understand if he had no clue what I was talking about, but I think the appropriate response would have been to say he wasn't sure or to ask another employee or manager.I ended up ordering a order of garlic naan, which was very good and the Rogan Josh. I believe Rogan Josh may be the same as Gosht Pasanda or very similar, but it wasn't nearly as good as I've had elsewhere. It had a similar, creamy yogurt sauce but lacked the flavor I was searching for. My friend ordered Chicken Vindaloo, extra spicy. She was very pleased with her meal. They gave us a single order of rice to split. We also ordered Mango Lassis which never showed up until we had to reorder them after our meal.The food was pretty good, the atmosphere is nice and the service is pleasant, albeit slow and lacking in some areas. As Annie D. mentioned, the prices are about average per dish but you don't get as much food as at other Indian restaurants and I didn't feel the quality of what I ordered was as good as I've had elsewhere."], ["Alexandra S.", "Excellent food, sophisticated service (they don't bug you every 5 minutes to ask you how you are....they observe from afar and use their common sense! Nor do they rush the check on you while you're still eating!), decent prices, great low lighting and kind of a sexy atmosphere.....what's not to like?!"], ["Liza C.", "Ate at Darber for the first time last night. We had carry out so I can't attest to the service, this review is purely about the food. I ordered the beef josh and the chicken tikka masala appetizer. The chicken was sub par. The sauce was sweet, not creamy and surprisingly bland. On the other hand the beef josh was very flavorful and just the right spice combination . I ordered my dishes both medium for the level of spice (heat) but I barely considered either to be mild. The food was moderately priced for the quality."], ["JP S.", "Having been to Darbar about 8 times now, I think I am in a good position to give a fair review to wide range of items in their menu.--WinnersDal: Their yellow dal is winner by far. The simplest of all items on the menu is most authentic in taste as well. I won't refrain from saying that it is close to what you will get in decent dhaba in punjabGulab Jamun: Felt like freshly made. I would order again.Naan: Neither too dry nor too rubbery like most of the other restaurants  serve.They do a good job serving it warm. A small window to their kitchen towards the rear door gives you a glimpse of their tandoor and reassure that they are busy preparing naan fresh--Average:Rogan Josh, Palak Paneer, chickan tikka masala, Lassi. Malai Kofta, Tandoori chicken--Losers:Muttar Paneer: Easily worst preparation ever. Peas were still cold as if fresh out of freezer. Gave the feedback to manager in the end but he simply raised his hands and said \"can't provide the taste that you would get at home\". Now we all know that Indian resturants have one common tomato gravy which they use for variety of dishes but what others do better than this place is that they cook the items well enough that veggies do not stand out with their own raw taste in the dish.--Paneer Tikka: This is tasty but it is not paneer tikka. You are just serving lightly grilled paneer chunks on a hot plate. I I did not know anything about paneer tikka I would buy it but If I know I would just change the name of the dish. C'mon you call yourself \"Indian Grill\" you can do a better job in grilling tikkas!Another thing which I would comment is on spice level. When you tell them to make your dish very spicy they would just add more red chili powder. Its time that Darbar should train your chef to know that spicy means all the items in the base spice go up in proportion not just chilli powder.  Darbar needs to work on it if want to maintain my loyalty I have been going to this place from last two years now. Service has been on decline.I loved this place but after that mutter paneer incident I would be reluctant to go again."], ["Julie T.", "I really enjoyed Darbar India Grill. The atmosphere was very trendy and had a touch of romance in my opinion. Our group of 6 was promptly served. I had the Paneer Makhani. Delicious! I kept eating even though I was plenty full! The service was very efficient and friendly. I will definitely go again. Parking was easy to find in the area (less than a 1/2 a block away). If you are in for cocktails, it appears they had more than a full bar available for your enjoyment!"], ["Alexandra H.", "Megan W. & I probably should have checked Yelp before trying this place out, but the scent emanating from outside Darbar was too enticing to resist.Too bad the food didn't live up to our expectations. We did anything BUT order bland food--tikka masala, vegetable curry, basmati rice, garlic naan, etc.--but it all tasted surprisingly \"meh.\" I actually found myself wishing I was eating Trader Joe's garlic naan instead...With the plethora of options in Uptown, I probably won't go back for food, but the atmosphere is open and relaxing so I could definitely see myself grabbing a drink at Darbar."], ["Lauren J.", "It's 100 degrees outside and all I can think about is warm, comforting spicy vegetable Korma from DarBar.I have been dreaming of this place since I went a week ago. Like I said, the vegetable Korma is amazing. Includes every vegetable you'd want in a sauce with a complexity of spices I wouldn't dare try to recreate. It's just too bad that it is $11.95, which seems steep considering the portion side. Not to mention I also need the side of naan and yogurt dill sauce. I foresee an expensive future habit.But man, is that a good meal. I'm worried for my bank account once it gets cold as this place is only 1 block from my house."], ["Soma N.", "I love this place. It's the same owner as India Palace - my all-time favorite Indian restaurant in the Twin Cities. I've been going to India Palace in Roseville for 10 years now, since I moved up here and discovered it. Darbar is something special. The ambiance is amazing - contemporary, sleek, warm. They also make a great cocktail - definately not normal for an Indian restaurant! And of course...the food. It's essentially the same as the food at India Palace - that is to say, not Americanized Indian-ish type food. It is incredible!  We have our favorites - so we tried those. My date got the Lamb Shahi Korma and it was perfect - deliciously balanced, creamy, tender lamb....just delightful. They didn't skimp on the paneer, cashews, or raisins (which tends to be a problem for Indian places with this dish). I got the Mattar Paneer (peas and cheese) - and I tend to be picky with this dish in particular. They nailed it, of course!We also got plain naan and paneer naan (can you tell we like our cheese?) and they nailed that, too. Even though we came in late, about 30 minutes to close (we are late eaters....I just can't help that) the service was prompt and very friendly. The food was quick, fresh, and hot. I am in love! I can get a good cocktail and delicious Indian food at the same place - that is a rare combo, and I am thrilled to have found it!"], ["Madeleine H.", "This is the go-to Indian place for my husband and me...it's our favorite Indian restaurant in the Twin Cities, and we've been to a bunch. We usually get the chana saag (chickpeas with spinach...ask for it with no cream), which isn't often on the menu at other restaurants and is a nice change-up from the usual chana masala.At many places spice heat levels vary from time to time due to different cooks in the kitchen, but Darbar is one of the more consistent restaurants I've been to in terms of mild always being the same level of mild, medium being medium, etc.The restaurant is new and modern, so the ambiance is a step above many restaurants in this category.  Service can be a little shy and unpolished, but most of the servers are very pleasant.For vegetarians/vegans:Darbar has a long list of vegetarian entrees and many of them are already vegan, so just have your server point them out. You can ask for the roti without butter so it will be vegan also.One of my wishes regarding Indian restaurants in general is that they would offer coconut-based or some other type of vegan lassi.  If Darbar did, it would be 5 stars all the way!"], ["Jodi W.", "I ordered food via bite squad at 6:15 for a 7:45 delivery. I still don't have my food. If you can't manage the volume of orders, don't take them. Will never order again."], ["Rachel P.", "Great food and friendly service! I highly recommend the vegetable samosas, chicken saag, vindaloo, and any naan."], ["Annie M.", "I decided to try this place a couple weeks ago, and since then I have been going AT LEAST once a week. The food could not get any better. The Indian Cheese is amazing. I never eat vegetarian meals, but the vegetarian dishes leave me completely satisfied. The naan is fantastic as well. The staff is so kind and friendly, they remember us every time we come in and treat us like VIPs. Love love love Darbar!"], ["Maggie W.", "I am VERY picky about indian food - and this place just gets it RIGHT.Spicy enough (if you ask for it), and just delicious food all around. Don't miss their Tikka Masala sauce (with paneer or chicken) - it's a basic, but it is SO good here."], ["Ryan H.", "I wish I had more time in Minneapolis to explore their food, because almost everything that I tried was absolutely fantastic. I don't know if Darbar is the best place in the whole city, but my wife and I picked it based on reviews from Yelp and the distance from where we parked our van.I was a little turned off when I first arrived, because I tend to enjoy buffets when I go to Indian places for the first time. When we walked into the place at 12:30 on a Tuesday afternoon and found that there wasn't one other soul in the joint who was there to eat, we exchanged nervous glances. We decided to proceed anyway, because of the 50 something good reviews. We told ourselves that we were just used to places like Portland and Boulder where not many people work the whole 9-5 nonsense.For an appetizer we ordered some veggie pakoras which were some of the best either of us have ever had. Then we split a Chicken Tikka Masala and some sort of Okra dish (I don't remember what it was, as I was in the bathroom anally emptying my body of the spicy Thai food of the previous evening). Both blew our minds and made our bellies sing with joy.The server was extremely polite, even if he wasn't' the most friendly dude in the world, and seemed to know exactly when to approach us. The appetizer came out with enough time for us to enjoy it and have a few minutes of digestion before the main courses. Also, he seemed genuinely pleased when we told me how much we enjoyed the food. As a plus, when I came back from my second journey to the bathrooms, there were a few other tables with people- maybe Minneapolis just prefers a late lunch.Here are the only two things that I didn't like- 1. the lunch portions were small, but still as expensive as if we were getting dinner size plates and 2. both bathrooms had water all over the floor, causing me to have to squat on the seats (which I sometimes prefer anyway, as it's soooo much smoother).I'd like to try out more Indian places in the Mini-apple, because if this place isn't the best then holy hot damn!"], ["Joshua W.", "Delicious food, amazing plating, I so wanted to love this place, but the service was less than par. Drinks were surprisingly good for a \"first time\" attempt at a Soco Sour... which I had to explain that Soco was short for Southern Comfort and how to make it.The decor is nice, it feels like this place should be packed 24/7, but I think the vast majority have taken the hint that the service sucks.Food was amazing. The best tasting Indian food I have yet to have. The Lamb Vindaloo was awesome. We also got appetizers Lamb Samosas and Tandoori Scallops which were great.This was basically the best Indian food I've ever had. I would give this place 5 stars on food.But I have to remove 2 stars because the waitress was ditzy, the manager came over to see if everything was ok but was super awkward."], ["Troy M.", "Have ordered numerous times via Bitesquad. Never actually been to the place. The food has been great every time.  I have ordered many different items and they all have been awesome. My only criticism is that the portions you receive for takeout are smallish for the price.  One entree comes in a container that is basically the size used for a cup of soup.  Two of us usually order two entrees, naan (which is killer) and an appetizer.  If you just order one entree, you'll be left hungry."], ["S H.", "Food was decent, but ordered food to go, and got home to find that the extra order of naan that was paid for was not included in the bag, which was most of the reason for ordering Indian food that night. Pregnancy craving aggravated more than satisfied. Disappointing."], ["Sidharth S.", "Was not expecting much but... really good 1. great food - got the chicken tikka ( not masala), chana masala and chicken makhani with the bread basket and mixed appetizers for 6 people..Everyone LOVED it!2. good service.. also got a bottle of red wine the servers were prompt and very attentive even at peak hour3. Not expensive - the ambience and locations were fantastic and even then it was not more than 20$ a person including wine..Overall fantastic experience for me and my american / russian friends!! will go again!"], ["George Z.", "First of all, this Indian restaurant has the best ambiance of any Indian restaurant here in the Twin Cities.  Nice sleek white booths, lots of glass and natural light, and trendy decor.  Job well done with the atmosphere!Food, however, falls short when stacked against the competition.  I judge a Indian restaurant by their standard curry, and Darbar's product was only so so.  \"Watered-down\" is how I would perfectly drescribe it.  A good curry, in my mind, should be nice and thick and packed full of spices.  Here it was too \"runny\" and I couldn't taste the numerous spices that makes me crave Indian food so much.  Also, the naan bread isn't as fluffy and chewy like some other Indian restaurant that I frequent.  Furthermore, their tamarind sauce has this weird red color.  The tamarind tasted weak, and I've never seen it with this tomato-ish color.  To end with a positive note, their mango lassi is tasty.Service could definitely be improved.  Server never stopped by ONCE during my meal to ask if everything tasted okay.  And in general, she came across as someone that really didn't want to be working that particular day.  She wasn't mean or unfriendly, but at the same time there was no enthusiasm or cheerfulness.Uptown has a lack of Indian restaurants, and I would recommend Darbar over the Indian restaurant down the block.  Darbar's ambiance is worlds apart better, and it also has better prices, and more importantly, better food (i.e. doesn't taste \"old\" and \"reheated\").  However, every time that I've been here it's never been more than half full and often times I find myself in a empty restaurant during non-peak hours."], ["Joelle P.", "I've been to Darbar a few times now, and all times would receive the same \"good\" rating food-wise, hence why I've gone back. However, the service is just not up to par here, and that takes a way from the eating experience A LOT.First off, I love the atmosphere. It's very nice, kind of upscale, and doesn't have the smell of curry lingering in the air: big plus. The food is decent Indian fare, nothing special, nothing that will blow your mind. The naan is alright as well, although I've had way, way better. I would also say the curry needs a little more spice/flavor. I ordered mine \"very spicy\" and felt it was hardly spicy at all and lacked a little of the rich, full, taste of curry. Now, on to the bad part: the service. At a place set up like this, you would expect a good wait-staff. The server we had this past time was very impatient, rushed, and just not very nice. She didn't smile or greet us, she just asked us what we want to drink and then came back and asked if we were ready to order yet. Eh, I guess I can deal with this, not the end of the world. But wait, it gets worse. Our curry and rice was brought out before our naan basket (weird) by a different person who clearly did not know what was going on. We asked him about our naan and he seemed confused and had to go check. Then, after our naan was brought out by yet another person, we were not checked on again. No one stopped by to see how our food was, no one stopped to fill our water glasses or ask us if we would like to order another drink. We had to flag someone down to order more rice and get more water, and even that took some time. From what we overheard people talking about, they were apparently having some sort of party after they closed, and were all rushed to get everything ready for that. That is really not an excuse to me as the point of a restaurant is to serve its customers during its business hours. I'm not sure if I will be back because of this. It's too bad because it is very close to me and has a nice atmosphere for dinner. We'll have to see, maybe they can redeem themselves yet!"]], "Tandoor Restaurant": [["Lakshay C.", "Great food and great service...buffet is delicious with a lot of choices...if you go for dinner then you must try chicken makhani and chicken tikka masala with garlic naan..."], ["M K.", "Food options are limited but good. Ambiance is ok. Aloo chat is really different and good. Service is as usual."], ["Tom D.", "Their food is great when you order off the menu. The selection on Saturday at the buffet was below average."], ["J P.", "Toss-up for my favorite Indian restaurant in the TC.  Everything is so savory. Hate the bright white lighting."], ["Amelia S.", "We're frequent visitors of Tandoor and spend a lot of time eating their delicious food! Let me just say... if the owners are not in that day, you're pretty much screwed. But given that they are present nearly 99.9% of the time, you're in for a real treat. The last time we visited this place we went on a rainy Sunday and expected a lackluster buffet, given the cruddy weather. Man oh man were we wrong! All the dishes were savory beyond compare. As per usual, every single dish was out in full force.  I LOVE their Dosa combined with Coconut Chutney.... mmm. You also can't beat their heavenly Naan. If you're looking for an Indian Buffet, it doesn't get better than this."], ["Carlyn R.", "Yum. Food was scrumptious, service was slow.  Clean and quiet.  Easy access, conveniently located off 494 & 35w."], ["Lilly M.", "I've been here 4 or 5 times and have never had a bad experience.  Two faves are the mango lassi drink ($3.50 and worth every penny) and the Special Naan (naan filled with cheese and peas) served with the best minty, spicy chutney.  Total bill = $37 for the following *chicken tikka masala, lamb shai-korma, 1 order of special naan (you get a lot), 1 chai tea, 1 mango lassi*  Everything was great.  They have a lunch buffet which is nice, especially if you're not super familiar with Indian food because you can try a little of everything and figure out what you like.ps - If you're not familiar with true Indian chai tea, do not expect it to taste like Starbucks.  It's not sweet, but they bring you sugar packets at the table."], ["Carla J.", "We love Indian food and we love going to the Tandoor, because it consistently delivers what we want, good food, relevant atmosphere (the owner's contemporary Indian paintings hang on the walls), great service, and we don't feel we'll have to go into foreclosure because we went out to eat. We eat vegetarian when we are there because it is so good and everything is a hit. We've not had a bad dish there. Last night we had the Shahi Paneer (homemade cheese in tomato sauce with light cream) which was awesome. I love Paneer. We also got the Vegetables Shai-Korma, which is always excellent. The Bangan Barta, smoked eggplant, is excellent too, but we refrained from stuffing ourselves last night. I want to echo how great everyone is at the Tandoor. We always talk with our waitress and she cracks us up. She tried to talk us into cooking Nan at home. \"You should do it. It is not hard!\" (Hello, this is why we come to the Tandoor!)"], ["Conal G.", "I CRAVE this place.  I have almost eaten my way around the entire menu and haven't found anything that I wouldn't eat and that wasn't extremely tasty.  Buffet is pretty extraordinary as well.Staff is simply amazing.  Management is superb.  My daughter has a Mango Lassi prepared for her even before she sits down.  Kudos!Highly recommended if you enjoy GREAT Indian food."], ["Liz B.", "OK, so I know I've been to better places but this place will have to do for now... especially since I'm in middle America. =PService was pretty good. Waiters were friendly. I got a samosa for appetizers and it was okay... it could have been better. They should have put a lot more spice in the potatoes! And then I got the lamb curry/tandoori chicken platter. Uhm... well it was missing some spice. Especially when I asked for a spicy meal... I don't know why they tone it down alot. Kinda sucks that I'm not Indian. If I were one, maybe they'll REALLY spice it up. Haha..."], ["James G.", "I have been to The Tandoor for both lunch and dinner and am always happy to go back.  The lunch buffet is affordable and comes with a number of different dishes to choose from.  The servers are helpful and very nice.  It is a very welcoming and friendly atmosphere and the food is great."], ["Jim G.", "Very good Indian.  All of that traditional dishes are solid, and the Nan is excellent.  I haven't tried all of the Indian places in the twin cities, but of the ones I've been to this is probably the best overall.  Service is hit and miss but the prices are reasonable given the quality of the food."], ["Erik G.", "Simply okay Indian food served in an oddly fast food format (lots of plastic trays for appetizers and naan).  The entrees were solid, though the appetizers seemed as if they were cooked much earlier and microwaved.  And I can't help but feel that everything was $1-$3 too expensive for what you get."], ["Jana W.", "Great tandoor chicken/butter chicken!! Delicious naan (especially in the chicken sauce). However, the service is VERY slow. It's great if you want a sit-down meal without worrying about time, but don't go if you are in a hurry."], ["Richard M.", "Food was good. Service was indifferent. Not really great, not really bad."], ["Laura P.", "I have only eaten here once, but I thought I should give a shout out to this restaurant anyway. On the one occasion that I ate at Tandoor, I decided to partake in the buffet. Let me tell you, this is the buffet that defies all buffets!!!! I know what you must be thinking, a good buffet? A good INDIAN buffet at that? I know, I know, but let your apprehensions fall to the wayside, folks, because this is a buffet that will blow your mind. I cannot recount all the delicious dishes that I gouged myself on, but each and every single thing I put in my mouth was phenomenal. The buffet is very well maintained, staff are constantly stirring the food and checking to see if it is still fresh and replacing anything that seems sub par. The atmosphere of the restaurant is great! Beautiful artwork that was painted by the owner's wife line the walls. There is a gorgeous shrine near the entry way that is worth stopping and appreciating. There are tapestries and statues and many other neat things that make up a feeling that seems to authenticate the restaurant. For some ambiance, the restaurant had some Indian music playing. When asked, the manager told us that it was the 'Slumdog Millionaire' soundtrack. My friend that I was dining with was actually offered the burnt copy of the CD that was playing, simply because he said that he liked it and wanted to go out and buy it later. How nice is that?? \"Hey, I like this CD!\" says friend \"Here you go sir, you may have it.\" the manager. WTF??? Awesome!! The staff is very kind and attentive. They were very quick to refill my beverage each time it got low. I don't know if this is a common thing, but while I was there, the manager of the restaurant visited each table to ensure that the diners were enjoying their meal, which is something that I appreciated. At the doorway you can find a large dish filled with baked coconut and fennel seed which is supposed to help the body digest the food that was just consumed. It looks kind of like bird seed. I took a handful and chewed it up, and with some difficulty, swallowed it. It definitely wasn't that good to eat, wasn't terrible either, but it DID help me digest my food. I thought that was kind of cool because not only do they care about the quality of the food they serve, the atmosphere and decor of their restaurant while you eat, but they also care about how the food gets digested in your belly :) This is a must-try restaurant for any fan of Indian food. Truly a great place to dine."], ["McLain C.", "This to me is easily the best North Indian place in town.  I've been here probably five times, sixth will be tonight, and I've never been disappointed by either the buffet or the menu.  Everything I've tried on the menu is nice.  If there's a drawback other than the remote location (remote to my circle of activity anyway), it's that the service can be quite slow.  If you are prepared to sit back and relax and enjoy a great meal (and some good beers, which they carry), then you will really have a great experience here.  Highly recommended."], ["Call K.", "went a few times for dinner when we first moved to the cities before we found another indian place we liked better.  In all we had the Dum Aloo, Saag Paneer (palak?), chicken tikka marsala, daal, and the namesake tandoor selections.  overall i'd say their dishes were watery and not particularly flavorful.  if you ask them to increase the spice they turn up the fire without improving the taste of the food.  On top of the mediocre food the huffy lackadaisical service is what pushed this place over the edge for us.  Mind you, we're not high maintenance restaurant patrons, but we often felt that the proprietors of the restaurant felt they were doing us a favor when we ate there.  An audible sigh when we asked for a spoon they didnt bring was what sealed their fate for us."], ["Amy J.", "They have a lunch buffet that is really good. I wish they would do the samosas for their lunch buffet but their food is really good. The owner is always there and he is really nice."], ["Sanjeeva R.", "$10 for lunch buffet.  The choices were pretty average...naan, tandoori chicken, been vindaloo, egg curry, white rice, fried rice, noodles and some others.  This was below average for me."]], "Paradise Biryani Pointe": []}