{"Luci Ancora": [["Rebekah K.", "Lovely little spot with attentive servers and craveable food. Went for their Thursday four-course tasters special and was not disappointed. My favorite was the pasta. Perfectly cooked spaghetti (cannot be overrated, IMO), with a smokey spicy tomato sauce. After about two bites I decided I wanted to come back and order a big bowl of that pasta next time! I just couldn't get enough. Another surprise was the Mixed Salad that was served with a very tangy Dijon vinaigrette. It was a punch of flavor from the first bite. My dinner partner and I each actually made an exclamation upon tasting it. Also had the tiniest little tomatoes. Our water was constantly refilled and server was always swinging by to clear plates and make sure we were set. My only real complaint is that both the steak and salmon were slightly overcooked and dry. Not unpalatable, but an aberration to an otherwise nice meal. I hope to return for that big bowl of pasta!"], ["Gina D.", "We have never had a bad meal here, Tuesdays and Thursdays they have a special on their Prezzo Fisso menu. If you do not eat seafood they will substitute their American Kobe Style beef for the seafood dish on this menu, and the beef is so tender you could cut it with a butter knife. Everything is flavorful, and the menu changes from one time to the next. Bravo! We have been less happy across the street at their sister restaurant, Ristorante Luci, although that was still fine.... just a disappointment in comparison."], ["Maggie J.", "Went for an early (and rushed) dinner here and was pleasantly surprised.  We only had about an hour to order, eat, and pay, so our server kept that in mind and helped us move along.  None of the 1st courses were appealing to us, so we got some of the super small dishes to pair with the (amazing) bread.  Artichoke hearts and very ripe tomatoes seasoned well were a great start.  We split a large salad, which was ok but not memorable.  For a main course, I had ravioli with short rib on top.  So, so good.  For around $15 the handmade pasta and perfectly fall-apart short rib was a great, delicious deal."], ["Roxanne E.", "Good service seems harder and harder to find at restaurants in the Twin Cities.  It is so refreshing to dine at Luci Ancora and receive excellent service. From the moment I walk in the door to the moment I leave, the service is excellent and professional. Tonight, I had dinner with two associates from out of town. In all, we were there for two hours and not once did we feel rushed by our server. She was attentive, but not over bearing. She was knowledgeable about the menu and the wine list. We all had the four course tasting menu which consists of smaller portions of the night's specials. The antipasti course was a piece of shaved pork with some onions and radicchio. One of my companions was not a fan of the dish, but I think it was the radicchio. Personally, I love radicchio so was very happy. The Zuppa course was a generous bowl of a lovely tomato soup in a chicken stock base. It was warming and comforting on this snowy winter night. I would go back just for another bowl of this soup.The Primi Piatti was a pasta with walnuts and dried apricots. It was the perfect combination of spicy and sweet. I think the smaller portion for the tasting menu was the perfect size. It was interesting, but I wouldn't want a larger portion. For the Secondi Piatti I chose the  Kobe beef with risotto and truffle oil. The risotto was perfectly cooked as was the beef. Of the four courses, this was the least interesting. Still, it was very good.All for $33.  A reasonable price for a lovely meal.We each had a dessert to complete the meal. My companions had the carrot cake with the salted caramel. They raved. I had the flour-less chocolate cake. Excellent."], ["Emily G.", "For me, Luci Ancora is decent, but not exciting. This is the kind of place you go when your great-aunt or grandma or people from out of town want to take you out to dinner. Everyone will find something on the menu they like. Solid food, but not surprising or remarkable in any way. They do use really good ingredients, which helps. It would be a good place to go with people who are used to Olive Garden-type restaurants and you want to nudge them into something a bit better. They do have some specials that are a really good value: Currently, on Tuesdays and Thursdays you can get a four-course tasting menu of the day's specials for $20 per person, if two people order it."], ["Sen H.", "Atmosphere: 4.5What one generally thinks of as a slightly higher end, classic Italian restaurant. Romantic, dimmed lights, there was even a small fireplace in one corner. The decor was simple, but classy. All in all, nice, but a little on the small side.Service: 5.0Perhaps we were lucky to get a vegan server, but she, of course, certainly knew her stuff. She was very polite (even when one member of our party made quite a few complex orders), and was very attentive.Food: 4.5Quality-wise, the food was formidable. Unfortunately, there were not too many options available to vegans, but the restaurant in general seemed very accommodating to us (and the special was vegan as it was). Both the dishes I had were delicious, fairly classic and not too creative -- but both had a bit of a flair (for the salad, the very remarkable olives unlike most I've had, and for the pasta, shredded fried potato as a garnish). Keep away from the bread, however, as our server mentioned it having milk in it."], ["Lauren M.", "I've been to Luci's Ancora about 10 times or so and have had an amazing experience every single time.  The menu is always changing which is nice and makes each dining experience unique.  It really is a fine dining experience.  The service is excellent, the atmosphere is relaxed, and the food is phenomenal.  The first time I went I was expecting more of the traditional red sauce Italian food & pizza but this is anything but that.  It's fine fish, meat, pastas, salads.  All the ingredients are very fresh and everythign comes together perfectly.  I would reccomend getting the sampler dinner -- you get a lot of different courses and feel like you're havin ga very complete meal.  For dessert I absolutely reccomend the flourless torte.This is a great place, a great atmosphere, amazing food, and a fabulous dining experience."], ["Josh W.", "We checked out Luci Ancora for New Years Eve and were quite happy with our choice. Not only was the prix fixe menu complete with diverse choices, but it satisfied all members of our party (two being quite picky). The food was well prepared and the wine selection was fabulous. We will definitely return to Luci Ancora for a regular menu night."], ["Kristi C.", "Popped in for dessert.  Unfortunately they were out of Tiramisu by 7:30pm on a recent Wednesday night.  Decided on the Butternut Squash Ravioli instead.   A delicate sweet and savory, buttery treat.  I prefer the sister restaurant kitty corner across the street, Luci Ristorante, a bit quieter atmosphere there.  Service was attentive, but not overly so."], ["Rich F.", "We had a dinner gift certificate , and heard good things about Luci , but we were not impressed.  The service, atmosphere and quality of food was good, but we were expecting a little more than average Italian food.  My wife had the special , \" penne with squash\" , which turned out to be penne with traces of squash and little flavor.  My dish was okay, but nothing special ; a sausage and pasta dish that was good, but not any better than a Green Mill or \"dare I say\" Olive Garden?!  Italian food is tough to pull off , in a fancy way, after all , pasta is pasta! But to separate yourself as a fine dining establishment , you need to stand out with creativity and flavor! I miss Campiello!"], ["Catherine P.", "Bland. Both the food and the experience. :("], ["Chandler P.", "While this restaurant was stellar in the customer service department, it lacks in the FOOD department.  I threw a birthday party here and the event was a huge success and everyone had a great time.  The restaurant catered to our every wish, and I couldn't have asked for a better amount of service, but almost every attendee said their food was \"okay\" or \"not too good\".  As the host of the event, that was a little embarrassing.  I suggest whichever manager is reading this to please re-look at your cooking staff and up the ante on flavor and presentation as the place has all the potential to be a 5-star experience."], ["Tom K.", "New favotie place -  Tueday and Thursday evenings offer a 4 course tasting menu for $20 per person. Suitable size portions, making a generous, filling meal.1st course - Terrific, grilled polenta sitting atop  braised lamb and juices - crisp, golden  outside and creamy inside... perfecly delicious! 2nd -, had mushroom/potato soup (puree), and also ordered a small Ceasar  (true test of the  chef's skill... Honestly, the BEST I've had, period! 3rd course-mushroom risotto with braised beef atop...OMG! 4th - frilled fish - a new species for me - like a flakey grouper with pureed potatoes awash in dairy...so good.   Friend had the other choice, the Kobe beef, and really enjoyed it.  Service impecable!  I couldn't leave withour tasting the creme brulee.  \"Burnt' tableside, and great!  - Beautifully intimate, with Tuscan color schemeBack 2 days later for lunch with sister - We split a Ceasar. and split 2 entrees. Again, everything was exceptional...but not as good a value as the tue.- Thurs. tasting ment.Really enchanted by every aspect of this place.  Qyality everything!Added treat - Bigg picture window face St. Kate's campus (Across the street - who's huge pines are densly saturated with blue lights, for the Holidays...Stunning!"], ["S R.", "Absolutely the best Italian food I have ever had. I come from a predominantly Italian neighborhood (east coast) and I have tried my share of various pasta sauces and noodles but none as good as Ancora Luci. It is a delightful place with knowledgeable and friendly wait staff. The ambiance of the restaurant is very pleasing for romance or just relax and spend quality time with friends and family. It was a little pricey but the quality of food was worth the price and more. Hands down the best Italian in Twin cities. Cheers."], ["Kaye M.", "I have dined here a few times with different groups of people. The food is really consistent, always delicious and fresh. The ingredients used have a GREAT flavor! It does don it self for more of the \"blue hair\" crowd, but I like the mellow smoothness of it myself.  Really, it's a great value for what you get! It's a place where you go to enjoy a meal for 2 hours, certainly not an in and out kind of deal.A stand out quality is the PHENOMENAL wait staff! I never have to ask for more wine or water or bread (which is yummers). One time I took my dad and step-mom there and the waitress was SO kind to be willing to split the taster's meal THREE WAYS!!!  My dad is super cheap and thought that was 100% ok and the waitress didn't have to do anything special and he tipped her terribly.  Luckily, the next time I went back I had the same waitress and I could make up for the terrible tip.  Anyway, the point is, while it's a blue hair favorite, it really has some delicious food, and some great atmosphere. Positively a must try!!"], ["Ryan B.", "Nice little place for some romantic company. Great pasta. Good service. Make reservations in advance if you want a table."], ["Zachary S.", "Decent. Solidly so. Had a groupon.  I may really enjoy the smaller storefront sister across the street though..."], ["Tracy H.", "My husband and I have eaten and Luci Ancora twice in the last few months.  I am vegan and usually find going out to eat at a non-vegan restaurant can pose some ordering challenges.  Not here.  Both times the servers were great at getting me fed.  The kitchen whipped up some tasty meals for me.  I will definitely be back!"], ["Marci M.", "My hubby and I went there last Friday night because we wanted to try somewhere new.  We started off with the gorgonzola bruschetta - it was ok.  I had the caesar salad which was wonderful and hubby had the melon soup special.  For entrees we both had pasta - he the mussels and linguine and I the butternut squash ravioli.  The pastas were good but nothing special.  The pace of the meal was wonderful (usually we're out with our 2 1/2 year old so we're in a rush) so it was nice to move at a meandering pace and have enough time for each course.  Service was wonderful and we used our MPR membership to get 2 for 1 entrees.  I think we'd try it again."], ["Lindsay C.", "Took the parents and a friend here before a show at the O'Shaughnessy.  Small, quaint, delicious.  Started out with the Pizzetta and the table ordered a wide variety of entrees: beef, pork, ravioli, and pasta of the day.  Portions are smaller than may be expected, but priced just right.  FYI: I had a case of wine in my car I just bought so asked if they allowed this with a corkage fee, they do not.  Bummer.  All around great experience.  Will go back."]], "Carbone's Pizza": [], "Buca di Beppo Italian Restaurant": [], "East Side Pizzeria": [], "Pazzaluna": [["James A.", "Came here for an anniversary and it really wasn't what we expected. Walked in and we were not acknowledged by the hostess that was standing in front of us for about 2 minutes. We would have been perfectly fine with a hello can you wait a moment. Anyways, we get seated and our server came and she didn't seem very happy to be at her job, she didn't have any enthusiasm in her voice. The food came fast which was great. Way to overpriced. We got maybe 10-11 baby mussels for $12 and they seemed to be not fresh. The food was not that great. It didn't wow me at all. The restaurant was very pretty but the food was not good. The prices your paying is for the atmosphere."], ["Kate P.", "I have always had great food at Pazzaluna but tonight we had service to match with Rosanne!  Ask for her by name.  Great food and outstanding service."], ["Lauri F.", "Food was OK. Service was slow and they weren't even busy. Our server was having a non-stop conversation with one of the tables till someone finally brought our desert. The real reason that I'm giving it such a low mark is the music. Absolutely horrible. It was so loud that I couldn't hear a thing. I asked to have it turned down, which they did for 5 minutes, then louder than before. I don't go out to spend $100 on a meal and then feel like I'm eating at a rock concert. Fine dining Pazzaluna isn't. I'm NEVER going back. One time was too many!"], ["Lenore K.", "Love this place. Great atmosphere, pretty restaurant with pretty people. The service is good and occasionally even great. Whenever fish is on the menu it is excellent, and the deserts are pretty uniformly sublime. My only complaint is the place is overpriced, however in it's very trendy location in Downtown St Paul, close to the Ordway, the park, and the big parking ramps would you expect anything else? If you want affordable in this area I suggest Subway a few blocks over - Maybe Chipotle during its limited hours."], ["Jackson F.", "Went there twice and each time was a very pleasant experience.  The food was good both times, but it wasn't amazing.  For the price, there is better, but you'll get top notch service and the wait staff is very friendly.  The place felt a bit cold, and I don't mean just by the door.  It just didn't have a very welcome feel like other places did to me, but it seems like a guarantee to have a good meal there, and everyone I went with enjoyed theirs as well.  Little more upscale than your average place, so in that regards, the prices were reasonable, and I would go back."], ["Elias A.", "very pleased with service, atmosphere, food was fantastic (had spicy penne with sausage). This place is fantastic, from start to finish, and we'll certainly be going back."], ["Kristine K.", "Dinner was very good; had Angel hair pasta without shrimp.  Jake, our waiter, was excellent, as always.  Had him surprise me with a choice of wine. He brought a lovely Italian red blend - Locations.  I love Pazzaluna, it is always a great dining experience."], ["Audrey K.", "It was edible, just not worth it. The pizza had great crust but the sauce was so salty it overpowered everything else. We ordered the tuscan wings but the pesto was terribly bland. The service was less than mediocre, seeing as the waitress only stopped by our table once. My advice,  head a couple of blocks over for some better service."], ["Whitney F.", "Another pretty solid experience from Pazzaluna; this time again pre-Ordway orchestra. It happened to be Valentines so it was packed to the gills. Me and the BF were perched in a little back corner - I would have rather been by the beautiful bar space, but I held my tongue. We each had a few glasses of wine rather than a bottle because I am known to shake it up in between glasses; they have a nice and reasonable wine-by-the-glass list. For food, we snacked on some bread and ordered up the calamari. Not too fried, and included yummy octopus and fried veggie bites. I could have eaten this for the meal... but I would have missed the seafood risotto!The main courses were really satisfying. A little spender that I had imagined planning if we ordered a few of the creative pizzas. I had a little portion to go before heading over to the show. If heading to the Ordway, and it's -10 degrees out, Meritage or Pazzaluna are great choices. Would definitely take a chance at a bar seat if you are going on a less busy evening."], ["Bee G.", "One star, since I have to rate something. If you're still debating head across the street to St. Paul Grill or down the street to Kincaid's. In a word this place was awful and none of the people who rave about the food have any sense for quality cuisine. My boyfriend and I both said \"Olive Garden is better.\" We ordered the bruschetta and mussels as appetizers and the single enjoyable piece was the mussel sauce, which be dipped the bread in. The mussels were tiny and the bruschetta was bland, with soggy bread. I ordered the chicken Parmesan on recommendation from our waiter and could not have been more disappointed. It literally had no taste or flavor. There are no words to describe it because it tasted like nothing. My boyfriend got the lasagna which he said was ok. Food was really the major factor for my rating but then the restaurant manager really sealed the deal by shouting right near our table to a waiter a few feet away that he needed to clean the bathroom and refill the toilet paper. I get that that stuff needs to be done but seriously, don't talk about it in front of guests on the serving floor, that's amateur for a place that is desperately trying, and failing I might add, to be \"upscale\"."], ["Brittney P.", "This is one of the best happy hours in town. Great food, great service. This is a great place downtown to go after work and meet up with friends for a bite to eat and a few drinks.They have great pizza and great bruschetta! I've never been here for lunch or dinner, but everything I've had from their happy hour menu has been delicious. They also have  decent drink specials."], ["Meggan E.", "Was here for a bachelorette party last night and we had a large group. Good service of splitting the checks and being able to split the bachelorette's dinner over all the split checks.  Gratuity was added too thereby making paying up very smooth. I had a yummy arugula salad which was a perfect size for a first course or just dinner. I believe you can add meat to it if you wish. I enjoyed the light citrus dressing, apples and walnuts. Others in the party enjoyed homemade pastas or risottos. I would go back and try some more items."], ["Idaho Travelers S.", "Came here last week as part of a business trip. This place had simply amazing food! Our menu items included bruschetta, chicken/asparagus pizza, spicy sausage pizza, shrimp, olives, cheeses, beef tenderloin, salmon and grilled veggies. All of the food was spectacular, and the service was outstanding. The only downer was that we had taken the sky-walk system from our hotel, and the stairwell down to the restaurant smelled really, really bad... but that is not at the fault of the restaurant.I highly suggest this establishment. Great experience."], ["Shane H.", "Took over an hour for a pizza.... Valet was 15 minutes and food compared to service was sub par.... Go to Meritage, Kincaid or St. Paul grill before you spend money here....."], ["Andy N.", "You have got to be kidding me! I would have given Pazzaluna two stars if the food was actually market priced, but these guys missed the mark. This might be a stretch but Olive Garden miggggght taste better. A group of 4 of us started with a nice bottle of wine, then it all went down hill. Appetizers were tasty but rather small. Crab and avocado bruschetta was delicious...calamari was mediocre but fried veggies and sauce was good.Dinner ... Oh dinner ... We felt like we tried everything on the menu but here goes:- seafood linguini was average with just a few clams / mussels and two shrimp- sea bass tastes like it was boiled and then pan fried with the crust on it. - gnocchi was disgusting as it tasted like a mushy messGood luck!"], ["Shondip C.", "I was in the mood for an artisan pizza.  Though the pasta dishes looked amazing as well,  I took the bar tender's advice and ordered the grilled veggie pizza. Loaded with tender grilled asparagus,  artichoke, red onions and spinach with sun-dried tomatoes,  it wasn't what I expected ( no sauce or cheese). But after the first bite, I knew I had made the right choice.  Balanced with a nice light beer, great service and ambiance,  it was the perfect,  guilt-free end to the evening,  for under $20."], ["Rachel E.", "I think I have underestimated the greatness of Saint Paul. Not only is the downtown area beautiful in winter, but there are also some great restaurants to swing in to, including Pazzaluna. My mom picked Pazzaluna for my grandma's birthday and all three of us had great meals. I picked the spicy penne with shrimp - delicious with the perfect amount of spice! We also had a great Malbec bottle between us for a reasonable price.For a Tuesday night, Pazza was packed - but this could be due to the fact that Elf was showing at the Ordway that night. Either way, they must be doing something right!"], ["Vishal S.", "$5. Pizzas in downtown ST Paul!!! You can't beat that. The place was packed but there was open seating at the bar which was a rather large space. Great wait staff and excellent food."], ["Patrick P.", "This place is so warm and inviting. The Happy Hour has to be one of the best in the Twin Cities. Shout out to the wonderful hostess Dawna and the awesome cook Mike. Thank you. Patrick-Minneapolis"], ["Ryan G.", "I hear there's a restaurant on the other side of the bar, but their happy hour prices are insane for the quality of food you get, so as a resident of the area I always go between 4-6 p.m. or after 9. The pizzas are very good, although another minute or two would leave them with the kind of crispy, thin crust that holds up better to eating without utensils. The roasted garlic and gorgonzola bruschetta? I could drink that sauce. The meatballs are a great option as well.At $5-10 an item (and most things skew towards the $5 end of that spectrum), it's a great place to hang out with some friends, co-workers, etc. At those prices I might even hang out with my enemies.The only occasional problem (and one that's not much their fault) is that the bar area tends to fill up quickly after 4:30 and on evenings of events. Unless you enjoy being elbow-to-elbow, I'd recommend showing up early or making sure there aren't events going on at the Xcel or Ordway. Or, just make sure you're there before the events conclude. In my experience, showing up midway through the third period works just as well!"]], "Cossetta Alimentari": [["Justin T.", "St. Paul!  St. Paul!Oh what a town!I step in to CosettasI say do you have any pasta, you bedda?They put the cream in my cupAnd the gal on my armHands me a pre-nupI get a sloppy noodleand stop to pet a frisky poodleIts easy to seebaby you and methe Xcel and Union Gospel MissionDon't do no Mississippi fishin!The carp are full of leadJust like the feet of a groom to be wedMullet hair the Xcel Center gamesDarling what a shameCause, St. Paul, oh St. PaulYou're.  Myyyyyyyyyyyyyyy.  Tooooooooooooooowwwwwwwn.'Tanks for the memories, Cosetta.Your my baby, my darling.  St. Paul, I mean.  You'll always be my kind of town baby doll.  Here St. Paul, give me a smackeroo on the old smoochers.  What?  Why are you handing me a carp?  No, baby.  I ain't sexist.  Love,Old Blue Eyes"], ["Alan C.", "The food is one of the best Italian places in St. Paul. What makes this place exceptional is the atmosphere and view. The music creates a great feel and when sitting outside, its the perfect place for a date."], ["Dan C.", "Cafeteria style dining. Great interior. Great patio seating. Great food."], ["Kelly R.", "Everything about this place is amazing!!! We love to go to the market and get their meat and cheeses !! The best ever and yes, the bakery is amazing and the potatoe salad second to none!! Great food and decent service!!  The breads are amazing too and great selection of high quality chocolates!!"], ["Donna N.", "UPDATE:  NO longer carries Queen Ann products (Ravioli, Manicotti) from Brooklyn, so no need to go anymore.Found great substitutes (better products at lesser price than Cosetta charges) at Bon Giorno"], ["Diana O.", "Food was good with very large portions and ample seating upstairs. We tried the lasagna and special (mushrooms, bacon, penne, cream sauce), they were both tasty. Wasn't a fan of the ordering style as it was a little high pressure and chaotic for us first timers that weren't really familiar with their dishes and what to order. We made split second decisions. The dessert bakery was what really got me, awesome looking sweets as far as the eye can see, plus gelato. I would go back just for that."], ["Taylor Y.", "If I could leave 0 stars, I would. I have been coming here for 20 years and have never been treated so poorly by staff and management. I ordered a large mostaccoili with a meatball and was given a small portion in a large container. My boyfriend agreed it looked skimpy - so I asked the girl if it was indeed a large and she said 'yes' not friendly. I asked again since I'm used to getting an overflowing amount and she very rudely said \"YES\" and rolled her eyes at me. As we we were getting rung up, the cashier asked us what size mostaccoili we had...so we told her what happened and how strange that she couldn't tell what size we had either. She said she would pass it along to management, but I was not offered anything (like more pasta!) beyond that. My boyfriend ordered a bland and over salted tortellini dish the he didn't even finish half of. We decided that perhaps some redemption could be had for this establishment....we soon found out in speaking with the manager, Gregory - that would not be the case. He said bc more than half the pasta was gone he couldn't get us any other entree. Mind you we only asked for a small mostaccoili that is much less than the cost of the pathetic excuse for pasta they served him. Frustrated, we began to tell him of how we were treated by his pasta scooper and his only response was \"that is a separate issue.\" He offered us dessert which we did not want. We weren't looking for any freebies, just to be happy with our 30$ meal of 2 pastas, a meatball and sodas. Give me a break! No wonder the staff acts the way they do with a manager like that."], ["Sam H.", "I love it I love it.What a great spot for lunch. The pit beef sandwich with the giaderia is incredible. Coworkers have raved about the pizza as well.This is the only place I go for lunch when up in St. Paul."], ["B B.", "1* for dinner.  Everything had too much sauce, dressing, cheese, ect, and way too salty to eat.  The kids behind the counter didn't know what they were doing, hence the drowned salads and pasta.  4* for dessert.  Excellent Gelato, pastries and coffee!  Sadly, not up to my memory of Cassettas from 20 years ago.  It seems more like a tourist trap for hockey and concert goers."], ["Rachel W.", "In the heart of downtown St Paul you can't help but have Cossetta's on the top of your list. I was nearby recently and we made it a destination spot for lunch. Having been in the old space I couldn't believe the size and extend of their renovation. It took me a few minutes to just walk around the space and absorb the many options available for dining. Anything from deli salads (sold by the pound), soup and hot/cold sandwiches to pasta entrees and pizza's. The nice thing is you can grab a slice of pizza or pick out an entree and be on your way if you're in a hurry or need to get to an event. My husband went with a pasta option \"Florentine lasagna\". I tried a few leftovers and it was filling and tasty. I loved the homemade minestrone soup. It was plentiful with all kinds of vegetables but added an additional breadstick to fill my plate. I enjoyed both but the breadstick was filled with butter and a little to greasy for my liking. The space is open and now offers ample seating with the addition of Louis Ristorante & Bar upstairs. But wait! You can't possibly leave this place without either having dessert or bringing something sweet to eat at home. The pastry shop is one of the most impressive I've even seen. You will quickly develop an overwhelming desire for something sweet when you scan the dessert showcase. If you like to cook the Italian Market (now 3 times bigger) offers all kinds of imported ingredients as well as take home options for dinner too."], ["Jason Y.", "This place is just amazing.  If you're in downtown Saint Paul, you have to make plans to stop here.  Great market store, dessert counter, deli line, and the restaurant upstairs is awesome.  There are good views of the city from the upstairs areas and plenty of places to eat or sit all over the place.  Kinda busy at times during the day and parking can be difficult-but it's worth it.  I live nearby so Cossetta is a staple in my diet!Check 'em out!  You'll love it!"], ["Jenna C.", "I have been going to Cossetta's for years now! It is my favorite authentic Italian restaurant. (Olive Garden does not even compare!) I love that you don't have to deal with a waitress you just wait in line like a cafeteria with a tray and tell them what you want. My favorite is the mostacholi! The red sauce is amazing! And they have a bakery and a little market! You can buy the red sauce at the market also :) super yummy I definitely recommend this place if your looking to get your Italian fix!"], ["Sarah U.", "Decent pizza and always buzzin before and after a game or concertI wouldn't be mad if someone brought me home a slice but I wouldn't make a special trip just to get it."], ["Lauren P.", "It was girls' night out last night, and Louis (a part of Cossetta's) was just what the doctor ordered. Our server Mark was en pointe,  giving us suggestions that were catered to our desires. To finish off our meal, we shared the cheesecake (to die for!) and the chocolate dessert (a ganache-filled upside down cupcake of sorts). Overall, our experience was top-notch. The only low point of the evening was the special, a salmon dish. Although the fish was cooked to perfection, the accompanying sauce left much to be desired. It was quite salty, and the brussels sprouts were undercooked. Thank-you, once again, to our server Mark for helping us enjoy a wonderful evening."], ["Alexander M.", "Cossettas is an institution for good reason, the remodel is amazing and the food didn't lose its amazingness. The pizza is some of the best out there and the prices are great, it isn't always easy to park, but you can't hold that against them, just show up early!"], ["Sarah S.", "Great desert items.I just love it's vibe the  food is great but not extraordinary i have had better.Just regular pizza and pasta.Cold salads are v good."], ["Braeden D.", "Very good pizza and service! I have been going there since i was a kid and it never gets old! Classic Italian style pizza with glass bottle coke! The one reason i didn't rate this 5 stars was that it has lines..... lots and lots of lines!"], ["Carl B.", "This was the first time I've ever been here and I'm definitely coming back! The place is basically ran cafeteria style.  I ended up getting the lasagna which came with garlic bread and a pasta side. Both dishes tasted great. My friend had a cheese tortellini that was was very good as well.After the meal we grabbed some desserts.  I chose cheesecake,  cannoli, biscotti, and a vanilla cream filled desseet. All made on site and very delicious. I also checked out the market area. Tons of fresh pastas, meat, and cheeses amongst other things.  I wish I could live in the building.  I'm definitely going back!"], ["J S.", "It's good. Pizza has better flavor than pasta. The canalonis are to die for. The environment is outstanding."], ["Fryem T.", "Go here and order anything! There is nothing bad on the menu.  This is also the perfect place to hit before a event at Excel. Parking is hellish but if you brave that you will have a great Italian meal."], ["Donna V.", "Their food is always, always, always hot and fresh. I ordered food for 10+ people in the office and they didn't mess up on any of our order. Their customer service is prompt and professional. I went to go pick up after calling in my order, I went to go pick it up during their busy lunch time but instead of having me park across the street in the other lot, the (very helpful and polite) lot attendant allowed me to park right at the front door and I was able to be in/out. Will definitely recommend it and will most certainly go back!!"], ["Joelle P.", "I don't even  know how to properly rate Cosetta... On one hand,  my food tasted like my little brother tried to make pasta in the microwave (including those meatballs in the freezer section of the grocery store). On the other hand,  the macarons I had after my meal were life changing.  I mean,  for real.  I love macarons and have been obsessed with them since my visit to Paris and Italy where I had the most heavenly macarons of my life.  Anyhow,  I had given up hope that anywhere in MN had macarons that could even compete with those I had in Europe,  but I was wrong. These macarons are PERFECT.  I had the lemon and the pistachio,  but in retrospect,  I should have gotten one of each flavor. Actually I think I saw they sell them by the pound... This now makes sense to me.  They are nice and crisp on the outside but he minute you bite in they are gooey,  slightly chewy,  and melt right in your mouth.  My mouth is watering as I type.  They also have a whole case full of delicious beautiful desserts,  I need to try a cannoli, another favorite of mine,  and a Gelato freezer which was also tempting. In  conclusion,  I won't probably ever eat the food again,  but I would make the trip to St Paul for the bakery for sure. So the bakery for me is really 5 stars and the restaurant is like,  2.... So I went with 4? I don't know,  I feel wrong for not giving those cookies at least a 4."], ["Alex G.", "I have been going to cossetas for years and love their food!! But today I went in and got 2 small gorganzola salads and a parmesean chicken. One the parm chicken I had to wait for and it was extremely small portion compared to normal and wasn't good quality. Then I went to eat my salad, it was like eating marinated onions. You couldn't taste the dressing,the cheese or tomatoes!!! It was all ONION!!! The worst experience I have ever had."], ["Jim L.", "Cosettas is an OLD family owned business that I have been going to for years!  It was a \"must stop\" whenever I am in St Paul around lunch time.  I have had their pizza which is good, they hand toss the dough.  A lot of places have pizza so I usually get the Lasagna when I go there.  Sometimes they make a couple variations of the lasagna to try.  With the lasagna, you get a bread stick and Baked Ziti with a bunch of delicious sauce poured all over the top.  How can you go wrong?The dining area upstairs was dated and very close quarters.  They just expanded in the last couple years (which made the tiny parking lot smaller) that made the restaurant larger.  They improved the flow of the ordering, you take 1 line if you are doing pizza and a different line if you are doing anything else. the lines come together at the central check-out area. This place is very busy during prime time eating hours and before events at the Xcel.  They are pretty good at getting you through the line quickly but it gets like a zoo in there sometimes!  They also have a store attached where I have also bought fresh dough, sauce and other ingredients to make their pizza at home and call it mine!  Today I even went in the store and got some dessert.  The Tiramisu was awesome.The influx of traffic and people are a turn off at high eating times."], ["Mama D H.", "This is my favorite Italian restaurants in St.. Paul.The atmosphere is warm and welcoming.Love the layout and all the small details.What more do I need say about the food here....I love the pizzas, I have never had a bad meal in all the years I have gone to this restaurant."], ["Khyre D.", "Cossetta's itself is a very beautiful building with a industrial look and a cool cafeteria feel to it.Pros:Very Spacious Dining AreaDecent food choicesQuality ingredientsVery pretty locationThe cake is AMAZING! I always get the carrot cake and it is the best.Cons:Lack of Customer Service (The nicest people are the one's at the register.)A little expensive The bread ( Let me explain, I always order a sandwich because I like the quality of the meat. However, they give you very little meat. And the bread is very thick and hard to chew. I take half the bread off so that I can eat my sandwich.Overall I will continue to go here because I love the balcony seating( And Cake) and my kids love the pizza."], ["Susannah H.", "Yeahhhh, I'm glad Cossetta's exists.  As an Italian grocer, it's the best I've been to in the Twin Cities hands down.  The staff has always been really friendly as well, so no complaints there...But the food is just insanely mediocre and usually way too salty (especially the pasta sauces).  They're a St. Paul Institution, I get it; and they're considered a Twin Cities staple even outside of the metro, but seriously - the food is just lackluster.  The pizza's pretty \"meh\":  the sauce is forgettable, the crust is just not crisp enough (big fan of the NY slice).  However, their pre-made raw dough is great - just a bit too salty....maybe that's just some weird MN thing? The pasta and sauce:  like I said before, way too salty.  Would be decent if it weren't for thatSoups:  like the sauces, too salty (which is too bad because they have potential to be awesome)And the cost:  definitely not cheap...and no offense, but since the food's flavor (not quality, I assume the quality is why it's so expensive?) is maybe only a few steps better than what I can get for a fraction of the cost at a mall Sbarro's, that's kinda ridiculous.  I feel like I might get a lot of flack for giving Cossetta's only two-stars - it practically has a cult-like following...but honestly, \"meh\" is basically the perfect way to describe it.  Sorry."], ["Neal C.", "Really good quality Italian food served quickly-cafeteria style. There is a salad area, hot sandwich area, cold sandwiches, hot pasta, and pizza as well. The portion sizes are very generous. Prices are reasonable- $8 to $11 per item (except pizza which is $4.5 and salads are $5-7). My favorite items are the Chicken Parmesan, veal parmesan, and cannoli. The red sauce they use is very flavorful, smooth, and has plenty of garlic (a plus for me!) The pizza slices are gigantic. Easily a lunch for $4.50-- good NY style crisp crust with plenty of toppings too. If you want a quick, delicious Italian lunch in St. Paul, this is a must."], ["Kaitlyn F.", "If this review would have been written a year ago, it would have only received four stars because of the long lines.However, because of the remodel/expansion, the joys of Cosetta's has been enhanced! Now, I can receive the crisp salads, delectable soups, enticing entrees, and warm chewy garlic bread in less than ten minutes. All the makings for a perfect afternoon savoring the comforts of Italian cooking like Mama G makes. I loved Cossetta's before, and that love has only grown.I also highly recommend the store attached to the restaurant! Being able to take home Cossetta's may be the reason why I had to buy a larger wardrobe. I'm not disappointed."], ["Tina Y.", "Cossetta has a bakery, market, and restaurants all focused on Italian cuisine. If you're craving sweets or you have a sweet tooth in general, their bakery is perfect for that! They have a lot on display and can be overwhelming to pick from but I decided to get their popular peanut butter chocolate and the chocolate covered cheesecake for $4.31. These two desserts were rich and sweet. It's probably best to just get one because of how rich it is and save the one for later. Would I come back here again for dessert? If I was craving that rich sweet flavor and willing to spend a few more bucks than usual on dessert then I would. The dessert is more on the high end so it's a little overpriced for me."], ["Ty T.", "Best Italian food I have ever found. Everything from pastas, salads, deli meats and the main attraction.....pizza. Since I've moved away from the twin cities area years ago, I have yet to find an authentic joint for Italian. The pizza is made with the freshest ingredients prepared daily. No substitutions. Plus if you're a die hard hockey fan such as myself, its a five minute walk from the Minnesota Wild arena."], ["JJ W.", "I love this place!  Granted I've only been here twice but I so wish I lived closer to the location!  Awesome food that I cannot say enough about.  Good salad, sandwich, and most importantly, the pasta!!  Oh and the attached bakery- my eyes light up like a kid in a candy store!  If only I can consume it all without gaining 20 pounds!  Btw, there is limited free parking behind the store but I can imagine it filling up during peak hours.  Such good food, it's worth waiting in line and even parking away and walking for!"], ["Leah M.", "My family has been going to Cossetta's since I was 3 years old. I love this place and it's even cooler now that they've renovated everything!I know their pizza is the best known thing on the menu, but my personal favorite is the mostacoli and the cossetta house salad! The Caesar salad comes in at a close second for sure.I now live in DC and miss this place a ton. It will alway remind me of home and is on Mu list of places that I must visit when I come home each time."], ["Pat L.", "Best food before a WILD game. We come here for every game. 8 x per year. Italian beef rocks. Mostacolli is the bomb. Bread crushes it! Can't go wrong here. Lines may look long but they go fast."], ["Ben S.", "We're here for lunch or dinner once a week...sometimes twice.Take it from an original NJ Boy and Girl:  \"Now, that's Italian!\" The ambiance, the aromas, the music, the service, the employees, the Cossetta family, the market, the bakery AND the FOOD...my goodness, what FOOD for such a busy restaurant!  The sausage & peppers selection is unbeatable anywhere in the Twin Cities.Cossetta's has it all...including pictures on the walls of \"the old neighborhood.\"Buon appetito!"], ["Jennifer L.", "Wow!  Best Italian food outside Chicago.  The Alfredo is divine. It's a cafe and a specialty Italian grocery."], ["Alexander V.", "This place gets rave reviews from a lot of my friends, and I can understand why to an extent. The presentation, the name recognition, the easy setup (cafeteria style).My review is based on the numerous food items I've tried here.I find most of Cosetta's hot pasta offerings to be bland. They taste fresh for the most part, but it lacks the bold flavors that I really enjoy in Italian food.Some people enjoy the subtlety of the food here, which is fine for them, but I can't remember mainstream Italian food being known for its subtlety.I do enjoy the cold pastas and the salads, so I gave them an extra star for that.Stop by if you want to buy something cold or keep driving and pass up this place"], ["Joe L.", "What a great spot.  The pastas and meatball subs are great.  Also maybe the best cannolis in the upper Midwest."], ["Marguerite A.", "THE BEST ITALIAN  CARBOHYDRATES    E V E R   !!!!!!Walking in here is like entering Italy. The walls are filled with photos both of celebrities and non celebrities. Definitely a trip through St Paul history. This is a true treasure for downtown St Paul.  The renovations are superb.We arrived after the lunch rush, and the only problem was deciding what to order. We got a huge slice of pepperoni pizza and a HUGE chicken parmigina  sandwich. Wow, what a delightful lunch!  The 2nd floor was spacious and sparkling clean. All the staff we encountered were eager to help. The chocolate dipped cannoli made with marscapone was, as they say, to die for. What a way to go.Then there is the grocery store.  It looks like authentic sausages, cheese, and a whole lot of other items are available.  I bought a few goodies, and plan on returning when I prepare my lasagna with 5 cheeses. Authentically made ricotta is the secret ingredient. Shh don't tell anyone.  There is a loaf of bread with the procuitto baked INTO the bread. I Love it.It is all about the food here, and any family owned and run restaurant that lasts for decades is doing something RIGHT. And yes, it is a little pricey for some things, butY O U   G E T  W H A T  Y O U  P A Y   F O R  !!!!!!!!!!!"], ["Jim R.", "So at height of lunch hour, 10 min wait for slice of pizza of the day?  But I could get 20 some-odd slices of pepperoni...Passed and moved on...disappointing experience"]], "Punch Neapolitan Pizza - Highland Park": [], "La Grolla": [], "Scusi": [["Jeff C.", "Great date night special $50 for two people includes bottle of wine, entree,  appetizer. Awesome happy hour, very good service. Never a disappointment!"], ["Sue M.", "STARTED OUT GREAT BUT THEN . . .It was so promising . . . the white table clothes, the menu, and server, the wine list and quiet table.  Even the salad and focaccia bread were wonderful.  But then the entrees arrived. How can you screw up the San Marzano Pasta?  It is basically angel hair pasta in a simple San Marzano tomato sauce.  But alas, the pasta the mushy and the sauce all absorbed into the pasta.  The Eggplant Parmesan was inedible!  What did they do to it?  It was so tough we needed a steak knife just to cut it!  No flavor either.  How is that even possible?  Probably cheap ingredients.  Eggplant Parmesan is a classic Italian dish.  You can't call yourself an Italian restaurant and screw this up so bad.  Adding to the misery of that dish is that it came with a side of San Marzano Pasta.  The joke was on us apparently.  The pizza looked good - but then pizza always looks good.  I will probably try Scusi one more time since I am in that neighborhood all the time.  But one more strike and they are out!"], ["Milly M.", "I really want to love Scusi. i do. The food is pretty good. It feels a bit uninspired though. Very Midwestern take on Italian. It's a great place to bring a group of folks if they are food sharers. ( not so great for the non sharers) Good happy hour prices. The staff can be either complacent  or surly. Generally the bartenders are helpful.  Happy it is in the neighborhood.  Just ok."], ["Henry W.", "Scusi is really good!  I haven't been to Scusi, though I've ordered from there several times.  The food is great and I like being able to get delivery from them."], ["Dorian T.", "Amazing Happy Hour treats at Scusi. No corkage fees so it was a nice Happy Hour special with ByoB. We had the amazing fried artichokes and Anrancini (fried risotto balls) before having our 5$ pizza. It was fantastic.J'ai adoré Scusi, meilleur Happy Hour de Saint Paul, sans hésitation !"], ["Jessica W.", "I had the pleasure of going to here for my birthday last year. The service, wine, meats, cheese and olive appetizers, pasta and desserts were absolutely fabulous! The experience was so enjoyable that I treated all my family members to gift certificates for their birthdays.and their experiences were just as enjoyable. I will return!"], ["Joe B.", "Jeezo Beezo! If you want to order one their salads, get the Beet Salad. Do not think about. Don't put it to a vote, Don't ask the waiter. Don't flip a coin. Don't look to Yelp....well yes you should. Just order the Beet Salad.Overall this is a wonderful establishment. The menu has many of the standards you'd expect at an Italian restaurant. To me what really seperates the men from the boys in an Italian restaurant is if the establishment can make Carbonara. My experience with Carbonara has been  a bit of a crap shoot. The egg is either completely scrambled, or they are using some weird alfredo type sauce. It's not unlike asking for a medium rare hamburger; it's not that hard, but you rarely get what you expect.Scusi produced a wonderful plate of Carbonara. The bacon was scrispy and well balanced in amount, And the sauce was not curdled! Overall very good. I think they should add peas instead of spinach, but that is just my opinion.We finished off our meal with an order of Zeppoles which were very good especially with the sweetned ricotta.Overall I would have given this place five stars, but I hate sitting at those mini euro-tables..."], ["Becky Cudd K.", "Enjoyed their 1st CICCHETTI, it was an amazing experience! The wine they paired with the delectable small plates was amazing!  Can't wait to try the fall and 2nd CICCHETTI!"], ["Morgan F.", "We spontaneously stopped to eat here and had a tremendous experience. It was a beautiful evening and as we walked past their sidewalk cafe we spotted the chef in the window. We communicated our desire to eat there by hand signals and she came out and seated us and explained their specials menu for the day before the waiter took over. After starting with delicious calamari and fried artichoke antipasti, we had an incredible basil, avocado, and blood orange sorbet garnished with watercress before our main course. We finished with a luscious mushroom pizza that was an aromatic olfactory experience. The waiter was very friendly and helpful throughout. To top it off, the chef returned to check in on us and briefly chat. She clearly loves her food and her career, and it shows in her cooking. An all around great meal!"], ["Dan B.", "A couple months ago, Sara and I happened upon the place and decided to stop in for Happy Hour. We had never heard of Scusi and were pleasantly surprised by the experience. No wonder,  then, that my wife suggested  we try it again last week when we were out running a few weeknight errands.When we arrived we thought about grabbing a table in the dinning room, but you know we love to sit at the bar so we opted for that instead.Correction: I love to sit at the bar, and Sara lets me have my way. Usually.As we saddled up to the bar we were greeted by a couple of waters and a very nice bartender. The two times we have been to Scusi, I have been very impressed by the service. Friendly, fast, and knowledgeable. What more could you want?During Happy Hour, Scusi offers all their pizzas at half price and has specials on some red and white wines. Having a pizza was definitely going to happen, but we needed to pick some wine first. All wines at Scusi are served a little differently than I'm used to.Rather than having the choice of a bottle or a glass, they have three different size carafes: Quartino, Mezzo, and Bottiglia. A quartino is about 8 ounces-so about a glass and a half. A mezzo seemed to be about twice that size, and the bottiglia was a little bigger than a bottle (if you didn't figure that out by the name).Sara chose  a quartino of Chianti, and I went with Pinot Nior. Then it was time to make some decisions on food. While we perused the menu, our bartender brought out some rosemary crackers and a delicious white bean spread. Just the thing to rouse a diner's appetite.Per usual, my lady decided on the Sausage pizza (fennel sausage, San Marzano sauce, provolone, mozzarella). I really wanted the Duck pizza (duck, apple, Gorgonzola, rosemary, honey, Alfredo) but decided to go with something a little different and ordered the Salumeria assortment of three.Salumeria is a fancy word for salami shop. Traditionally, Salumeria just sold cured meats, but recently have been know to sell cheese and other types of antipasti as well. You know I love antipasti, and with the assortment I got to pick one salami, one cheese, and one type of olive. Three of my favorite things on one plate! I went with the Sopressata, the Fontina, and Mediteranian Mix of olives.The pizza was terrific. High quality cheese, light crisp crust, and tasty sausage. My plate was really good too, and I was especially impressed with the size of the portions. I'm often leery of ordering cheese or antipasti at restaurants because you never know how much you're going to get. I got 8 nice slices of meat, two huge hunks of cheese, at least a cup of olives, compote, and warm bread. Pretty good deal for $14!One of these days, Sara and I will have to try a full- on dinner at Scusi. The great experiences we've had at Happy Hour justify that. Or maybe we'll head over for Sunday Brunch? That menu looks amazing!So the next time you're looking for a little Italian in your life, skip watching My Cousin Vinny, and head over to Scusi!"], ["Phil A.", "Every time I've been to Scusi, I've found their food delicious and their staff friendly and fun. The atmosphere is what I would call Casual Nice, where you feel like you can pop in like it's a neighborhood joint, but it's still got a touch of class. The wine selection is good, so it's a cool place to kick back with friends or to have a nice date. I was last at Scusi in May, celebrating a huuuge milestone. When the waitress found out, she brought glasses of champagne on the house. It's a little thing, but it made the night really special. Scusi will definitely be a regular spot of mine when I get moved up to St. Paul."], ["Jennifer S.", "Review of wine bar only.Nice wine selection and $2 off per glass 8-10pm during week.  Nice, big map of Italy on the wall behind the bar is fun to peruse and see which regions produce which wines.  I'm lucky to be able to walk a block down the street to get a nice glass of wine.  This stuff gets 3 stars.However, walking in later one recent evening felt discomforting.  Many of the patrons already there turned to look at us.  Since the space is relatively small and well lit, when people turn to look at who's coming in, it's a palpable, slightly negative vibe.  I never experienced this feeling when I entered this space when it was Heartland.Next, the bartender.  Upon arriving at 9:45, we acknowledged from the sign out front that the place closed at 10pm and voiced our understanding of this when we sat down at the bar.  That's why we ordered only one glass of wine to split between us.  We would have no problem enjoying a half-glass of wine and then being out of there within 15-20 minutes.  Several minutes after serving us our half-glasses, the bartender told us \"last call\".  So we ordered one more glass split between us.  From the time we sat down until our last interaction over paying the bill, we felt as if we were a bother to the bartender and even unwelcomed by him.  It seemed he had no interest whatsoever in making us feel welcome or even interacting with us at all.The vibe of the place = 2 stars:  meh, I've experienced better.  So much better.For a future late evening glass of wine \"out\", close by,  this place will do.  But in general, it won't be someplace I'd often seek out or recommend to others."], ["Angie S.", "I truly enjoyed this experience!  First of all the atmosphere: It has a cute little restaurant which had outdoor seating as an option, and cute indoor tables.  I would recommend a possible reservation.  The waitress was such a great help and shared with us the plates can possibly turn into 'tapas'... ITALIAN TAPAS!  Yes Please!We tried the beef appetizer (debated against that and risotto) and it was delicious! Had a great blend of aolio and beef!For dinner we had the Short Ribs (MUST TRY) which we got the Large plate and had left overs, tried the gnocci (very delicious made with spicy Italian sausage) and homemade noodles and lamb pasta.  Everything was delicious!  I would COMPLETELY go back to visit - so cute and very delicious!"], ["Erika B.", "I really wanted to love this place.  I didn't.  Would I go back?  Probably.  Is it on my list of places to revisit on a regular basis?  Nope.Quick Review: Food was just ok. Service was great. Atmosphere was good (I agree with others that the TV needs to go). Full Review: We had a 7 pm reservation on a weeknight. They had our table ready and waiting and even were able to seat us early. Our server did a great job explaining their menu, making suggestions, etc. Our little brown bag of crackers brought us a friendly little ant...  We split a Caesar Salad to start.  It was excellent and probably my favorite part of the meal.  We then split the Lobster Fettuccine and Scallops with Butternut Squash Ravioli (both recommended by our server and items we were already considering).  Both dishes were cold.  The ravioli was actually cold enough I could feel my mouth warming it up!  The scallops were cooked well but lacking in flavor.  The ravioli was very good in flavor but it was oddly cold.  The lobster fettuccine was...boring.  Lacking flavor of any sort and also cold.  We actually compared it to some $3 frozen dinners we've had.  I could easily create a better tasting lobster fettuccine than what we had at Scusi.  Highly disappointing.  We ended with doughnut holes covered in chocolate, with some whipped cream and dried cherries or maybe raisins; I'm not sure.  The dessert was as unimpressive as the rest of the meal.I can spend the same amount of money at I Nonni and receive five star food, service and atmosphere. Scusi was three star and not worth the $50 (each) bill we racked up.I would eat that salad again!"], ["Jackie T.", "Just had a surprise 18th birthday dinner here with 17 of us eating. My daughter loves pasta, and she thought it was yummy!  Service was awesome and food menu had great choices and was very good!"], ["Meghann F.", "I was really excited to try this - we tried to go a few weeks ago on a friday night and the place was PACKED.Anyways - reservation, thursday eve - better. So get seated in the dining room - very small table made much smaller by the pizza stand with the plates underneath.The tables are way too close together as well - definitely could take a few out to make the dining experience feel less cramped (cramped table space, cramped tables)The bring you a white bag of rosemary crackers and some white bean dip - both were good, i found the white bag to be strange, lazy, and well wasteful.  We got some wine from a keg - cab, zin, syrah mix i think - very good.As far as the food goes - the beef carpaccio was good, they put the dishes on top of the pizza holder deal - which i found strange i guess .. . then the Caesar came out - also tasty - grilled romaine heads w a little dressing, a hunk of grilled parm on top and an ample supply of the anchovies.  Got a sausage and pepper dish as well as the duck risotto.The sausage and pepper dish tasted fine - hard to screw up?  The sausage was pretty tough, i got one piece that was tender and nice, but the rest of it - I was hoping was tender and delicious, but no dice.When the sausage dish came out - a dirty plate was clearly sitting in front of my boy and the guy serving just dumped the dish off and didn't bother clearing the plate.  We put it on small plates and placed the serving dish on the empty table next to us, that finally prompted him to take away the dirty dish - such dirty, menial work.  The risotto was really tasty with the fig and the duck balancing nicely.The menu looks good - I might go back to sit at the bar sometime and check out the wine selection, but to be honest, the service wasn't awesome, the food was good, but not amazing (well maybe the risotto was) but definitely left feeling like it could have been soo much better. . ."], ["Jana H.", "I will never go back here again! The service was poor (extremely slow from beginning to end), our waitress was rude and the food was bland and overpriced. Once my friend and I told the waitress we would not be ordering any alcoholic beverages, the service went from average to completely lousy!  I would rather go to Perkins and eat their sad mock-up of what they consider Italian Food, than eat at Scusi again.  Quick Tip: Don't order the Polenta Fires! They taste like a mix of leftover greasy French fries form the State Fair with a juiced up - canned tomato dipping sauce found in your Grandmothers Y2K panic room! I ordered the linguini with clams. For $14.00, the portion was small and the garlic was over powering (this is coming from someone that loves garlic). There were not many clams in the dish, let alone some of the clams didn't even open up. When I pointed this out to the waitress she said \"oh that happens sometimes\". If you aren't going to give me many clams - in my clam linguini, at least give me a few extra clams that are edible!!!"], ["Elizabeth H.", "Have eaten here a couple of times now and am the biggest fan of eating in the bar, mostly because of the ambiance.  The tables are smaller and it is quieter.  It reminds me of its own little bistro, off the bigger, busier and less interesting dining room.  Had a fun time chatting up the bartenders, who made some special recommendations of the extensive, approachable wine list.  In the bar area, you'll have fun staring up at the almost-lifesize poster of Italy. Who wouldn't daydream of the day you'll get to taste the wines in the very region they are actually made? Underneath the map, is a massive wine-bottle-fridge that enables the restaurant to offer so many delicious wines by the \"quartino.\"   My friend and I enjoyed sharing our arugula, roasted red pepper and truffle-oil pizza on the mix-matched plates and he liked the novelty of the veal pizza, too.  Best of all, they were half-price after 9pm even on a Saturday night!  And carb-lovers everywhere will delight in their flat bread and white bean dip.  Looking forward to the desserts next time I go.  And there will be a next time."], ["Kristi C.", "Inconsistent? Disappointed :(   This visit gets two stars.  On the plus, this time the service was much better.  The cioppino I so highly recommended in my last review, this time did not have the depth of flavor,  we picked out a half dozen small splintered pieces of the mussel shells, the fennel almost overpowered the entire dish and there was very little broth.  I don't think I'll be gambling with my $19 on which version I'll get in the future.  Our server suggested an apple spice cake, subsitituted with salt caramel ice cream instead of vanilla...yowza!  And the espresso was outstanding.  Thanks for saving the evening with that delicious end."], ["Ian W.", "Couldn't be more in love with an Italian place.  The food is excellent.  Have been there many times and still haven't had the pizza.  The olives are the best I have ever had, the calamari and scallops are the most amazing I have ever had.  I couldn't even finish the scallop dish.  A great place for a stop in for happy hour at the wine bar or for dinner in their dining room."]], "Caffè Biaggio": [], "Carmelo's": [["Rhonda G.", "I've been putting off writing a review because I haven't been here since they opened, and I wasn't especially impressed. Since then, they have obviously gotten their act together. It was late Sat. around 8:30, we had to stop at Kinko's and we were pretty hungry and wanted some place close. It was the end of Cheesefare week, and it's a good time to combine cheese and seafood. So that means Italian or Mexican. So glad I thought of this, and it turns out I'm going to be thinking of it a lot more. Basil wanted soup, I ended up eating half. It was a tomato soup with mushrooms, so simple it was laughable. The first OMG moment. The second was the most delicious Italian bread I've ever had. Huge, generous slices take 1 pat of butter. Soup and bread could be all you need. Our cheesy seafood choice of seafood cannelloni stared us right in the face. It was a surprise, because when it reads a mixture of crab, scallops, shrimp, etc. It is a literal mixture not just a blend of pieces. I could only eat one of the two and was stuffed. It includes a nice house salad with a great creamy peppercorn dressing, get extra. We finished up splitting a tiramisu. Creamy and yummy, but my favorite is still Russian style at Moscow on the Hill.The service was good, but we especially took notice of Logan, a young wait assist/ runner. She does everything with a smile, clears plates, fills water, you name it. She also recognized us because she is good friends with our sons, which made it a very nice touch. This is not a great place for groups, yet one was having a great time celebrating a birthday. Strangely, there is an intimacy as loud as this place is. I like the roomy, handy spot for coats, as well as the general lay out."], ["Cindy W.", "Quaint and delightfulA great date or fun night out with friendsRisotto is excellent and the wine pours freely"], ["Anne P.", "Teeny-tiny and unpretentious. I will admit that I am biased towards long-standing neighborhood restaurants, cafes and bistros, so even if there are things that I do not like about them, I will rate them higher than other places. I am also especially biased towards neighborhood Italian places. Let's see; my visits here were for date nights and my dad's birthday, (where I inherited my preferences for neighborhoody italian joints). I ordered the signature lemon chicken entree, which delicious other than being heavy on the lemon, and the pasta was a bit too oily. My BF ordered seafood cannelloni, which he raved about for days... months!So the food was great, but service was casual, in some cases, lacking. It's clearly a family-owned place; the owner's kid was working the restaurant floor, and would lift the glass by the rim - right where you put your lips - when refilling water. But it's evident that the owners/managers have a good relationship with their staff. Every visit in has had friendly but not obnoxious demeanor. They like working there. Lastly, the ambiance. From the street, it's nondescript. The space is tight, decor seems to be an afterthought, and the crowd is the frumpies you'd expect from the St Kate's area. My BF was going to wear dress slacks and a button down. I convinced him to change to jeans but he definitely was one of the more dressed up in his button down. It's homey - you hang your winter coat on hooks in the stairwell, and you can tell the focus is on friendly service and the food."], ["Mar N.", "We had reservations but didn't seem to need them. It was not that busy for a Friday night. Good service and food. Not a bad noise level which was nice. I know many people have complimented the bread basket but we thought it was basically bland, soft white bread. That's my only complaint. Otherwise we will definitely return."], ["Scott B.", "Went to Carmelo's after our reservation was \"lost\" at Luci's. Sorry Luci's you just lost out. Carmelo's was a treat. I tend to love the small locally owned places. We don't really go out for Italian food that much because it's been difficult to find a place that is a step above without having thier hand on my pocket book (if you know what I mean). There restaurant looked very clean and may have just been repainted. There was no art on the walls although the walls wer painted a dark color making it seem very warm and inviting. The garlic smells greeted you as soon as the door opened. There was a waitress wanted sign in the window and only one waitress on staff. My first thought was that we were in for a long wait, howerver she had 2 helpers and they made it a smooth experience. We startd off with a glass of red then got down to eating the bread and salad. Both were understated and very good. They didn't drown the salad in dressing which was a plus. I ordered the Costoelette Rosemarino new yourk strip steak and my dining partners both ordered the Bolognese. All were perfectly prepared and served piping hot. Portions were large enough so that we each brought home leftovers.All in all a great experience. We will be back."], ["David H.", "I it looks like I'm bucking the trend here of great reviews for Carmelo's.  I will say that this was my first time here and of course it could have been just an off night.The service was OK, we waited an unacceptable amount of time between appetizer and dinner service (empty wine glass during that time), and then very little checking back throughout.Food was good, though not outstanding.  We started with the Calamari, which was well cooked and came with a tasty (very lemony) aioli.  The Caesar Salad which I selected as part of my pasta meal was probably the highlight of the dinner, very flavorful and the recommended anchovies were a great touch.  I had the Seafood Cannelloni, which was certainly not hot when brought our.  My GF had the Artichoke Heart pasta dish, which she did like.I will say that the prices were great, and you'd be hard pressed to get the kind of value at most other restaurants around town. Atmosphere was also nice as promised by most other reviewers.With all of that said, I would go back as I believe in second chances :-)"], ["Dan S.", "Carmelos is not the best high end Italian food out there. But that being said, it's good food and I've been coming here a couple times a year since I've been 20. If you go to one of the nearby ACTC colleges, it is probably your best bet for a nice romantic dinner that wont break the bank. The entrees range from $13-$19 and there are a couple of wines under $30 a bottle. I like Carmelos because it is tiny family owned restaurant where they really care about your dining experience. There are less than a dozen tables in the main dining room and about the same downstairs. I think it's a good place for a special occasion. I also like taking people here for the first time because it's not a well known restaurant. Everyone that I've taken here has liked the place and wonders why they have never heard about it, particularly people who live in Minneapolis. I would recommend getting a reservation because the place is usually full. I would also ask for a table in the main dining room, because I don't like the feeling of eating in a windowless basement. Although, you kind of feel like Vito Corleone, hiding out down there because it's small and dark."], ["Evan M.", "Our first time here and we all (6 people) had amazing meals. Everything is homemade in house and mostly locally sourced. Great service too. I love garlic but everything was a little heavy on garlic so just ask for it without."], ["Kim R.", "I finally got around to trying Carmelo's after years of driving past the tiny restaurant on Snelling. The inside is just as small as the outside makes it look. There are only a handful of tables, so I'd recommend making a reservation. When we got there at 6:45, the place was packed. The inside is very quaint, and you can tell this place has been around for awhile.We started our meal with an appetizer of the artichoke dip. The dip comes with crusty crostini and is very creamy. I liked the addition of the red pepper, but could have done with a little less onion in the dip.For my entree, I ordered the spinach and cheese ravioli with marinara. The ravioli are homemade, and were pretty tasty, but there was an odd flavor that I couldn't quite place. I think it might have been from the spinach. The marinara is your typical, American-style red sauce. What I liked best about this entree is you could tell everything was homemade. The portions are big so come hungry.My husband ordered the bolognese and wasn't too impressed. He thought the sauce didn't have enough meat, and the meat that was in there was too crumbled.Dessert selection is minimal. The have tiramisu, a cheesecake and a chocolate espresso cake.This is a nice place to come with a few friends to relax and enjoy a nice dinner. We didn't feel rushed at all during our meal, in fact, we ended up staying until close to 10 pm, and were some of the last people in the restaurant."], ["Jay B.", "Stopped back with six of my friends for dinner.  Everyone was pleased with their meals.  The wait staff was top notch.  It's  nice to see a little neighborhood restaurant packed with customers."], ["Phil M.", "This very well could have been the restaurant that Billy Joel was singing about  in \"Scenes from an Italian Restaurant\" on The Stranger album...\"A bottle of white, a bottle of redPerhaps a bottle of rose insteadGet a table near the streetIn our old familiar placeYou and I face to faceA bottle of red, a bottle of whiteIt all depends on your appetiteI'll meet you any time you wantIn our Italian Restaurant.\"Visited Carmelo's on a quiet Monday night, around 6:30.  Had called ahead for reservations, although for that night, at that time, they weren't really necessary.  It certainly is a cozy (but definitely not cramped) dining room, so I could see how Thurs-Sun you would want to call ahead.There's a great atmosphere going inside Carmelo's.  We chose a comfy booth, along the side wall.  There was a good vibe going, with classic American standards (Frank, Dean, some Ella) playing softly in the background, and a good level of conversation happening among patrons - that perfect level of background noise, but not so loud that you felt distracted.  The small candles on each table and good lighting completed the atmosphere.A pretty standard, nice wine list...none of the glasses were more than $5/6.  Our waitress was very pleasant and confidently explained the specials to us.  I went with the Chicken Parm with marinara, while my date chose a chicken ceasar salad (what's up with girls ordering chicken ceasar salads everywhere?).  She said the salad was good...certainly looked good, so that's cool...I've got to compliment Carmelo's on my Chicken Parm.   Good sweetness to the sauce, nice and hot bubbly cheese melted on top of a perfectly crispy, breaded chicken breast.  Totally standard Italian-American fare here...but what's not to like about that?  Carmelo's doesn't try to hide what it is...a completely unpretentious, comfortable, friendly, Italian restaurant.Our waitress was really attentive, the food was good, and the atmosphere was great.  Check it out next time you want a good meal."], ["MALEAH A.", "Finally, a dinner out with one of my girlfriends! While I confess, I attempted to take her to Scusi's first ( there's a few more things on that menu I want to try....) they were too busy and we just couldn't wait. Still in the mood for Italian, I suggested Carmelo's.  I hadn't been there before, and even though my boyfriend and I had planned to go soon, well, there's no time like the present, right?! so off we went.We walked into a pretty empty, \"quaint\" restaurant, greeted by nice hello's from the staff and immediately seated and tended to. That was easy! The menu has a lot to offer, and seems to stay very true to traditional italian, at pretty reasonable prices. The special for the night was the butternut squash ravioli in a sage cream sauce. Two please!! Er.... they only had enough for one, or we could both go with two less raviolis and get a discount on our meal. Well......ok then. I am sure my waistline will thank me later. Not to mention I had already started on my wine (the red sultry blend...it's good!). And they hooked us up with bread (it was warm, soft, moist, i HAD to bring some home for the boyfriend!), and our dinners came with a salad!! woo hoo!! The ravioli was good, maybe even great. I was pretty busy playing catch up with my friend, so, I confess, i was kinda just shoveling it in, not critiquing like a good little yelper.  But it was gone, nonetheless. The sage cream was flavorful, creamy, decadent. The ravioli was cooked perfectly and the squash inside (there was a nice sized chunk in each) was fresh and creamy and spiced nicely.Can't wait to go back so my man can try it too. And that scallop and crab pasta dish is calling my name!!I recommend. :)"], ["Dee T.", "We've driven by many times in our first year here, and that particular corner, along with St Paul Drug, has always struck me as friendly, neighborly, cozy. I was excited to finally try the place.A free lot is available on the southeast corner of Snelling and St Clair. We were greeted by our most friendly waitress, who seemed to have worked there for a while and also struck me as an actress (she delivered their specials with such ZEAL and FINESSE, you know). The place is really cozy; well, at least the main floor dining room is...I could not fathom going down into the basement to dine...The food is really good comfort food prepared \"fresh and simple.\" The bread is just to die for. We liked their calamari, not heavily breaded and accompanied by a delish lemon aioli. We both got the butternut squash ravioli in sage sauce, and while I found the sauce too rich, the herbs and spices added such a nice touch to the squash. The wine list is decent, with cute descriptions. Dessert? Not this time...really must dine with someone who can go all.the.way sometime ;)All in all, we had an enjoyable meal here and I'm sure that we'll be back."], ["J S.", "We tried Carmelo's and were very impressed.  The dining room is small but we went on a Saturday night at 5PM with a reservation and it was not overly packed at all.  Great music playing (Frank Sinatra and such) over the speakers so that was enjoyable.  The service was excellent and our server was extremely friendly and attentive.  The bread was a piping hot loaf that was soft and had an incredible flavor.  My husband got the meat ravioli and it was delicious the flavors came together just right and every bite was a delight for him.  I had the chicken parmigian which was tasty, it came with a side of the fettucini noddles with white sauce and it was all so yummy!  All in all we loved this place.  The combination of the flavors in the dishes were sophisticated that is the only way I can describe it.  The meals also include a salad and that is nice.  We ended up spending 40.00 for two of us which included the tip, so the price point was good.  Try it you will love it!!  I don't think we will be able to stay away!!  Not sure if this would be the best place to bring a kid unless they are well behaved just due to the small dining room. If they act up there would be no place to hide!  They do offer take out though"], ["Rob R.", "Excellent. Curious why it was so quiet on a Friday night. Our gain. Portions fit the cost. Larger wine selection and cloth napkins would make a five. Service was quick, although I felt for the ladies working as they ran into each other going through the kitchen door a couple of times.  Can't wait to go back."], ["Rob G.", "Carmelo's is definitely one of the better venues for good Italian food in the Twin Cities.  I cannot complain about anything that I tried there on my recent visit with the exception of the crab-stuffed mushroom caps.  The mushroom caps were not bad but found them to be lacking in flavor and \"pizzazz\".  It's definitely a nice spot to take a date.  The atmosphere is cozy but doesn't cross the line into awkward or intrusive.  I'll likely go back again."], ["Amber O.", "Carmelos is a tiny hole-in-the-wall, but it isn't a place to be overlooked. Service was friendly and prompt without being overbearing. We took our time with our meal and never felt rushed. Their crab-stuffed mushrooms were delicious. I had the Ravioli Carmelo, which was tasty, but didn't have as much prosciutto in it as I would have liked. The wine selection is reasonably priced."], ["Aaron S.", "Awesome dinner here... great service and comfortable, close atmosphere.  Our pasta was wonderful, unique, and creative.  It's a good place for a casual special occasion."], ["Randall W.", "Carmelos is a perfect dining experience.  Eating in Carmelos should be an extended affair.  Begin your experience with some wine and bruschetta, explore a generous portion of rich and delicious pasta with more wine, and finish off with a piece of fabulous tiramisu.  Extend your conversation and evening with a final glass or two of wine.Carmelos has a small and cozy atmosphere.  It isn't presumptuous or pretentious.  It is the perfect place for an anniversary, a date, a devoted conversational meal with a friend, or an evening's eating event.This Mac-Groveland restaurant serves a lasagna that I really enjoy, but if there is one dish to rave about it, my wife is devoted to one in particular.  Seasonally, Carmelos serves a butternut squash ravioli in a sage reduction sauce that is anticipated year round.  Patrons call to find out if Carmelos has begun serving this dish.  If you can, go in the Fall and try this dish.  As I have been told, \"it is to die for.\""], ["Raedean F.", "Great little place on Snelling! It has limited hours so I'd definitely recommend calling ahead and making a reservation."]], "Louis Ristorante & Bar": [], "D'Amico & Sons": [], "DeGidio's": [["Tony N.", "Food is fantastic. I always order the Triple Dip.Food is very reasonable and it's more than you can finish.We used to order Spaghetti and Alfredo sauce To Go, but they doubled the price making it not worth while any more....too bad"], ["Michelle G.", "Satuday at lunch, walked into a very dark room, with very cheap suspended ceiling tile.  Open table surrounded by dirty napkins.   Ordered two cola's both were mostly seltzer water.  The two sandwiches, including a juicy lucy were just fair at best.  The pasta with red sauce was delicious and worth re-ordering.  Don't come during the day on Saturday.  It is an off day with not very good service."], ["Jeremy B.", "I showed up to St. Paul from Ashland, WI one night with a hankerin' for some lasagna.  Ashland has no Italian restaurants and I was hangry.  I was sooo happy!!!Get the lasagna"], ["Molly G.", "This place feels so inviting and comfortable as soon as you enter.  Everyone is so friendly and seems genuinely happy to be working there. We did not make reservations because it was a Saturday night(Fridays and Saturdays it is first come first serve), but they had a booth available right away.  I ordered the baked goat cheese/marinara appetizer and it was delicious.  I also had the seafood linguine- it had great flavors, a little too much broth, but otherwise great! Can't wait to go back. Another added bonus was that they had a large parking lot!"], ["Angela P.", "Super delicious Italian food here.  It's prepared simply and well.  I recently got the spaghetti bake special, and it was a big cheesy plate of hot, delicious pasta happiness.  The spaghetti and meatballs is also great.The portions are very generous, definitely enough for one or two more meals. You definitely get a good value for your money here.I can't wait until my next visit."], ["Brittany H.", "Amazing food! One of my top two Italian places in the cities. Great flavors. The portion sizes are large so you will definitely have leftovers. The staff were really nice and it feels like a family-run restaurant."], ["Randy S.", "On weekends, they don't do reservations, but we only had a 10 minute wait.Service was good, dinner was great, dessert was great.  Ambiance is a little unique, in a good way.My wife and I pigged out, had drinks and dessert for less than $50.  I love it!"], ["Samuel W.", "I am in deep, deep love with DeGidio's. It's a little bit of an unhealthy obsession, but it doesn't matter. There is only one thing I hate about this place; everyone else is in love with it, too, which means it's usually very busy.This wouldn't be a problem if the parking wasn't such a pain in the ass when this occurs. But let's just forget about that for a moment, shall we?Their lasagna is perfect. Everything is balanced and the portion is HUGE (easily enough for leftovers the next day). It's cheesy, meaty and comforting like a warm blanket fresh out of the dryer. The mussels with linguini is equally amazing. The sauce, a soft broth of white wine, garlic and butter, is beautiful in its simplicity. There's nothing quite like listening to the soft clacking of the mussel shells while you spin a forkful of pasta.Other highlights include the Linguini Bolognese (creamy, satisfying and just a touch spicy from the sausage), the Arancini Di Risotto (crispy, cheesy and a great start to the meal) and, of course, the garlic bread.I'm blown away by the prices at this place. They're already cheap but when you factor in the quality and quantity you receive, they're stunning. I just can't begin to think of another place that even remotely compares. Do yourself a favor and eat here. I can absolutely promise you that you won't be disappointed."], ["Linda H.", "How have I lived in St. Paul for so many years and never visited this place?!The atmosphere is classy, the food is amazing, and the service is top notch..We had cheese bread for an appetizer and it was the best cheese bread I have ever had.  Most places you get two slices and cold sauce but here, you get ten pieces of ooey, gooey, crisp on the button, soft on the inside bread. I might just order this next time and eat it for my meal!We ordered Chicken Parmesan.. Yep, my dining companion and I both ordered the same thing and it was spicy with the most perfectly balanced red sauce, and covered in cheese.The prices are cheaper than comparable Italian Restaurants and they have daily specials which are crazy reasonable.The portions are huge, enough for two meals or to split. I had more than half of my chicken Parmesan leftover but I left it in my friend's car, so they got to eat it!!!!  I was so upset!I can not wait to go back and try more items and this time, I will not forget my leftovers in anyone's car!"], ["Dave F.", "I don't live and die by the words of Dara MG, but she nailed it on this place: this is the king of red sauce in St. Paul!Many of my fellow Yelpers have already described the perfect blend of herbs and spices(props to Jenny A.), but I had to give DeGideo's my own high-five. The sauce whisked me back to the days when we'd visit my Italian grandmother in Chicago, who knew a thing or two about Italian food and was in the right area to buy her ingredients.This is the deep red, tangy, ultra tomato-ey, beautifully seasoned stuff that is somewhat rare in these parts. Paired with their delicious spicy sausage, this is a real treat. This place isn't trying to be Pazzaluna, and the low prices reflect this. It's simple, flavorful, homemade- tasting Italian food (if you're lucky enough to have an Italian grandma that loved to cook).The warm, dark colors and reasonable prices make this a great choice for a casual date night."], ["Steve S.", "We sat at the bar for appetizers; great setvice ;,  good calamari & goat cheese as there red sauce is authentic! My wife is Italian. & loved the sauce ! Nice Tuscan atmosphere. !"], ["Erin M.", "Great food at a great price. I was there for a private party once and that was great too."], ["Carol O.", "OK I am into places that serve my favorite cocktail -  a Dewars Rob Roy - properly.  Many places think it's dry vermouth or add an olive or get the proportions wrong and that is a big minus for me.  I never know whether to trust the establishment to know how to make that drink or to micro manage the server by telling him/her 'it's basically a scotch manhattan.  I am pleased to say that DeGidio's knows how to make a Rob Roy.  Okay let's get onto the food part.  The couple we dined with were lucky enough to find a free appetizer coupon online and we enjoyed the terriyaki chicken wings.  They were really meaty and the terriyaki sauce was very good.  Lots of celery with a very good blue cheese dipping sauce was also provided.I have to say that my dinner was a tad disappointing.  I ordered the whole wheat spaghetti with chicken meatballs.  HOLY COW what was I thinking?  This is an old established West 7th Italian landmark so why am I ordering WHOLE WHEAT pasta and CHICKEN meatballs.  The sauce was really good but the meatballs were on the dry side and extremely salty.  The whole wheat pasta was OK but not like real pasta.We all had a glass of wine with dinner.  My chardonnay was very nice (it was the house choice and I neglected to get the name) and it was a very generous pour.  Our companions were delighted with the nightly special which was a breaded chicken breast topped with their Italian sauce, a caesar salad, a side of spaghetti with sauce and a second side of veggies.  The veggies tonight were green beans which looked to be sauteed with some green peppers.  A bread basket with 'soft' butter and warm Italian bread was a definite plus.  Our waiter was great allowing us to proceed at our own pace and there when we needed him.  Our bill was just a tad over $50 - a bargooon.  The place was pretty packed on a Wednesday night which says a lot!!Don't miss it if you're in the neighborhood and if your not it's worth a drive - plus you can stop into the West 7th Hardware Store just down the street a ways and find anything your heart desires in the shape of nuts, bolts, screws, nails, hammers, etc etc.  Greatest hardware store ever!"], ["Gaile S.", "I love the food here. Good apps and good pasta. The hot dago is delicous and huge! Their red sauce is very tasty. Always good service."], ["Nicolas H.", "Wow, delicious!My fiance and I have been here a few times. DeGidio's holds a special little place in our heart, we've celebrated a few occasions here, but the reason we've been back, and will continue to be back is that this place is by far my favorite Italian restaurant in the Twin Cities, and I love Italian food. Helpful little hint, try the Tortelloni Bolognese.... It's a little piece of heaven."], ["Lindsey R.", "We ate here a few weeks back, we were actually doing a tasting to see if we'd have DeGidio's cater our wedding.  Oh my gosh!  The food was ALL so good, and they took such good care of us!  The restaurant itself is very nice and relaxing inside, the food just speaks for itself! The owners were kind enough to come out and visit our venue and were very responsive.  I'm so impressed with the restaurant and the catering business.Specifics... Strawberry salad -- yum!!  Stromboli -- super yum!  Also loved the pastas in white and red sauce with sausage and peppers."], ["G S.", "I really like this place. Been coming here for years, always great food and service. Homemade sauces, meats are great, just all around good home cooking italian food. Great portions. The red sauce is one of my faves. Like their italian sausage too. Great place for kids."], ["Amy R.", "We pulled in one night and the parking lot was packed to the gills.  No wonder this place is always busy. The food is really good!\"Please Seat Yourself\" sign was posted, so we chose a booth. Not worried about a server not seeing us. Ours must have been waiting in her area. Shortly there after she came over with a menu and took our drink orders.They serve unsweetened ice tea which is a big plus.We could have done without the garlic cheese bread appetizer, but we were starving when we arrived. It was ok.J ordered the Blackened Shrimp Alfredo which was very good. Liguini with blackened pan seared shrimp in a very tasty sauce. I had a few bites and it was incredible.I was really in the mood for a steak. I'm usually not a fan of sirloin at all, but this place impressed. I ordered my meat medium rare and this was done perfect to my liking. It is more of a hunk of meat. Dry rub wasn't overly flavorful, but it was still good.They have hand cut fries which was a plus. I prefer these over the sysco system fries.The caesar salad was one of the best I've had in awhile. Nice size salad that came with my meal. It had black olives, marinated red onion, parmesan and a really good caesar dressing.Seems like a great family run neighborhood place with a bar, nice dining area, good service and great food!"], ["Natalie S.", "My husband and I loved Degidios, the food is always great. I have to give him credit for thinking to look into this restaurant to see if they also hosted wedding receptions. From the very beginning, Jason and the staff at Degidios have been fantastic. The prices are very reasonable and the food is high quality. Jason gave lots of helpful suggestions and if we had questions they always responded quickly. The employees who staffed the reception were efficient, very professional and frequently checked with us to see if we needed anything. We got lots of compliments about the food and were so happy that we chose to have our reception at Degidios! (We were also happy to support a small local business)"], ["Kate C.", "I have lived near here for a while and never been.  Sunday night I wanted Italian food in the worst way so off we went.  I grew up on the East Coast so my Italian needs are specific, I want an old school red sauce joint.  I was NOT disappointed.  The portions were huge and delicious!  Our table had a variety of the entrees, I tasted my husband's filet mignon and it was amazing, my tortellini bolognese was exactly as described and yummy and for a pleasant change, when they say spicy Italian sausage, you get spicy!  My daughters chicken parmigiana was huge and looked great although I have not yet dived into the to go box with her leftovers.  I particularly loved the bread basket because - you get the garlic butter on the side, so if you prefer light garlic you can control the amount.  I admit we stuffed the left over garlic butter into the leftover box as well!  My only reason for not giving them five stars is that as a wheelchair user, I found the table a little crowded with chairs and the aisles a little narrow but the hostess was really helpful and gracious."]], "Yarusso Bros Italian Restaurant": [], "Zamboni's Pizza": [], "Ristorante Luci": [["Cindy S.", "We ate here during the Spring Graduation Ceremony at St. Kate's. The staff was top notch, the restaurant was clean and the food was delicious."], ["David F.", "Been here multiple times over the years, and it's our go-to place for a great meal at a reasonable price. Service is always on par, and it's by far, the best Italian food in the cities. As others have stated, the decor is understated, and the tables are close, but it adds to the ambiance in my opinion. Make a reservation well in advance, and enjoy a fabulous meal!"], ["Adam W.", "Ristorante Luci is a gem.  The space is intimate, with white tablecloths and candles glowing.  Servers are friendly and skilled.  The menu offers some fantastic bargains as well as daily specials and a changing tasting menu.  The carpaccio was perfectly sliced and impeccably fresh.  The zucchini soup (daily special) was surprisingly good, with a delicious nutty finish.  Caesar salad was a bit small but had a nice garlic flavor and came with anchovies, as a proper Caesar should.  I was most impressed with my spaghetti carbonara, which was perfectly enveloped in eggy goodness and came with plenty of lovely pancetta.Service was friendly and professional.  A solid selection of Italian wines by the glass and bottle are on offer.  Prices are extremely reasonable given the quality of the ingredients. I've dined at Ancara many times but found its reach often exceeded its grasp.  From now on, I'm walking across the street to Luci and calling it good."], ["Catherine P.", "Living only 6 blocks away, we often drive past Ristorante Luci and wonder why we never go there. Then, when the opportunity to go out for dinner happens, we never think of it. Last night, after living half a mile away for 5 years, we finally gave Luci a shot.The food was absolutely fantastic and the service was wonderful. The hot, fresh bread on the table kicked off an amazing meal. We tried the daily antipasto (a tomato and beef bruschetta), the spaghetti carbonara and the spaghetti with clams and peppers. It was all super wonderful.I'm reserving a couple of stars for the same reason I reserved them on my review of Luci Ancora (the sister restaurant catty corner from Ristorante Luci). The environment is so bland! The blinds are pulled so you can't see outside, the lights are too bright and very stark, no music was playing so we could hear the hushed conversations of our neighbors word-for-word, and there is absolutely no decor in the place. Brightly lit, bare walls. I find this to be so weird for a place that has put so much thought into their wonderful food and their great staff. Other people have called this place cozy and intimate but I totally disagree. Where's the ambiance?I would so happily make Luci my neighborhood staple, but I think take-out in my own home would be a better dining experience."], ["Scott E.", "We love this place. Over the years this has been the best Italian restaurant in the area. Do make it a point to dine at the original location (small and intimate) for the best experience. The new larger building is not my preference. The bread is made daily for the number of reservations and so yummy. The place is small and intimate but the spacing is enough to allow conversations to remain private. The wait staff is the best. Always friendly, professional and smiling. The chef has been at this location for a long time and our favorite meals remain consistent over the years. The prices today are not much higher than 15 plus years ago. From special family moments to marriage proposals to fun nights out, Ristorante Luci has always delivered a great dining experience. The parking is plentiful on the street in a safe quiet neighborhood. Reservations are needed. We enjoy the three course tasting menus and of course the desserts! There are few places like this in Minnesota. Enjoy!"], ["L E.", "Been to Italy 6 times and Luci feels very much like the neighborhood restaurants there. This is not (in my opinion) a flashy place to get all dressed up and have a 'fine dining' experience-- I mean, they have a Pabst Blue Ribbon sign, for heaven's sake!!  With that said, it is VERY impressive that they always seem to have some prime beef on the menu. (sidenote: it's unbelievable to me that so many of the top Twin Cities \"steak places\" don't offer prime beef). And the wine selection is good without being outrageously expensive. The wines by the glass were nice though you do need to talk to the servers to pinpoint which ones are likely to suit your tastes (dry or sweet, tannic, etc). For me, this is one of my favorite places to have a comfortable, delicious meal with friendly, responsive service. I'm a huge fan of Broders Pasta Bar but find it frustrating to have to wait for a table there, every time. Every pasta dish I've had at Luci was just as good at Broder's, but it helps if you asks the Luci servers which dishes are made from housemade pasta-- those are better. I've dined across the street at Ancora, which is much fancier but I prefer the cozy space and feel in Luci.  Ancora is a bit more of a place to get dressed up for- both have delicious food that matches what I found in Italy."], ["Roxanne E.", "I had a lovely dinner at Restorante Luci with two business associates.  This is a small restaurant with  maybe 12 tables. That results in a very cozy and intimate dining experience.My party of three enjoyed the Prezzo Fisso tasting menu - $25/person on Wednesdays.First Course:I had the mussels in saffron broth. I was served six lovely mussels with a spicy red broth. The mussels were fresh and the broth perfect. Second Course:The ceasar salad was good as far as ceasar salads go.Third Course:I had the Beef Ragu.  Paperdelle with braised beef in a san marzano sauce. It was amazing.Fourth Course:The lamb shank with butternut squash. The lamb was falling off the bone. The braising broth was perfect. The squash added just the right compliment to the lamb and broth.The tasting courses are exactly the right size. I was pleasantly full.The service was outstanding.  I will be going back. On a Wednesday."], ["Jim R.", "We had the flight of wines and the four course dinner.  They've made a lot of improvements in the ambiances for Ristorante Luci, so if you haven't tried it in a while, I would strongly recommend you do.Great service and food."], ["Eliot G.", "Visiting Macalester for overnight stay for my daughter. This place is small, quiet, personable. I had the prezzo fisso sampler for $32. It was a fair price. The food was very good. Not super great Italian.  Perhaps a bit too salty. I'm not sure they make places like this anymore. It is simple, honest and authentic."], ["Kathleen C.", "Spaghetti Pomodoro ~ Fresh Heirloom Tomato, Roasted Garlic, Onion, Carrots, and Olive Oil. -- What does that description elicit in your imagination? I thought of a nice, fresh tomato, garlicky, summery sauce that pops in your mouth. I got overcooked noodles with a sauce that was less interesting than Franco American spaghetti in a can, but similar in consistency. I loved that stuff as a kid, but have out grown it..The butternut squash soup was quite good, but the pasta after the creamy soup that was unexpectedly creamy didn't give a nice balance. The waiter was good enough, but I would have hoped for a little more from him. Was not asked how everything was while eating (I would have told him) and I was waiting for 15 minutes alone for a friend who was late and not offered anything like a bread basket with my wine for quite some time.I might try it again because of some other good reviews.I agree with Catherine P. about the ambiance. I was looking at the walls, thinking I'd like to sell them some of my colorful hand-painted tiles, ditto on the window treatment and conversations. And finally, while I hate freezing my butt off in a restaurant, it was a hot summer day and it was a bit stuffy, leaving me longing to have to put on the extra shirt I brought."], ["Bryan E.", "This is a small cozy neighborhood joint close to it's sister restaurant Luci Ancora.  Our table was very tight but, the food was amazing.  You have to have a reservation or you won't get in.  The dining area seats a very small number of people.  We ordered the Roasted Beets ( fennel, almonds, parmigiano, green onion, dijon vinaigrette) which were delicious.  We also ordered the soup of the day and the pasta special of the day where were both very good.  The service is immpecable.  The only downside to this restaurant is that they don't have that many entre options for patrons that don't eat meat."], ["John C.", "This is the smaller, simpler cousin to Luci Anchora down the street.  Doesn't have the full scale ambiance of Anchora, but more intimate and quiet.Enjoyed a nice meal of the Spaghetti special, a Caesar salad with chicken, and Shrimp scampi horderve.Amount Saved - $20 with a Groupon"], ["Kristi C.", "Here's my full dinner review.  First, a question.  Ever have that feeling that you really want to LOVE a place?  Well it was easy for me to feel that way about Luci.  A very unassuming exterior.  Inside you'll find a simple decor that includes white table cloths and an ambiance makes you feel you're the special guest at someone's family dinner.  Service was personable, friendly and perfectly attentive.  I really felt like these folks cared that I completely enjoyed my meal.  And that we did!   My intent was to come back especially to try the  four course Taster Menu and it exceeded my expectations.  The dishes were thoughtful combinations of simple ingredients, in smaller portions.  In my opinion, the size all restaurants should serve.  Citrus Olive Crostini-YUM!  Corn Chowder with a kick of habanero pepper, they were 2 for 2!   Our penne pasta dish had a lovely fresh tomato flavor.  The salmon was spot on.  Desserts aren't included with this special, so we added the Passionfruit Cheesecake.  A wonderfully bright and slightly twangy fruit that flavored a creamy white chocolate base.  And can't close without saying that the bread pudding was also very satisfying in that \"comfort food\" kind of way.  I liked that this place is small enough that on the way out we could express to the chef's the super job they'd done to make the evening a very enjoyable foodie experience."], ["Colin S.", "A hidden gem.  Luci still in an unassuming location with little hype out front.  Inside you are greeted by a friendly staff, an intimate atmosphere, and a cacophony of  enticing aromas.  Luci is small, thus make a reservation or plan to wait.The menu is little more than a page but full of wonderful dishes.  The wine list is interesting yet not overwhelming, and there are plenty of good glasses for less than $10.The food smacks of \"you can get this level of Italian in the Twin Cities?!  Damn....\"  I went with the classic spaghetti carbonara.  If you have ever tried to make this dish, then you know how it can stress test a chef's skills.  I was not disappointed with Luci's offering.  The pasta was stupid good...most likely due to the fact that is it made on site, and the sauce was of the consistency that I always try to achieve yet miss.  I wanted to go to the kitchen and ask, \"how did you do this?\"Luci is now on my list of \"the best\" in the TC, but try it for yourself.  I will be surprised if you are disappointed."], ["Gina D.", "This was only a disappointment in comparison to their sister restaurant, Luci Ancora, however this location is more casual, and more affordable."], ["Angie S.", "Italian can be pretty heavy on your body after a meal.  (At least what I had).  This meal was italian but with a lighter twist -  but still left me very full.  I had the Butternut Squash Ravioli which was delicious.  It was light pasta, with a hint of the butternut sweetness.  Afterwards everyone shared the limoncello (which was VERY sweet but still good just the same).  I would recommend that this would be a great intimate date night for two.  I would also highly recommend a reservation being made, otherwise with the limited seating and the deliciousness of the food, you might be in line for a while."], ["Elizabeth L.", "Would prefer to give zero stars. Nothing was homemade or fresh, which is opposite of what the website claims and what our server told us. Everything was prefrozen and probably microwaved. Not acceptable for the price. It smelled like an old stuffy room that makes you think you're back in the early 1900's. Not only will I never return, I will be sure to tell people that this place is a restuarant nightmare. Servers, what are you thinking working there? You deserve better! Chefs (if you deserve that title), what are you thinking serving that crap? Your customers deserve better!"], ["Tim I.", "Food took forever, staff couldn't have cared less. Mediocre when we finally got it.  Too many good options in the area to deal with the attitude of the staff and the food, which used to be very good. It happens when a place gets complacent. What a shame."], ["Nicholas P.", "This place is about as close as your going to get in the Twin Cities to the feeling of walking into an Italian Trattoria.   It is quaint, dimly lit, and can be a bit loud at times.   When I want to feel like I'm in Italy, this is where I go.  We had a nice simple bottle of Montapulciano wine, and have been buying it up all over the place ever since.   It goes so well with Italian food.  It was recommend by our server and went perfectly with our meal.   The food is terrific.   Please make your way here and check it out.   If you're looking for a more modern Italian restaurant, go across the street to their sister restaurant Luci Ancora.   The food is just as great, but it's more open and airy.   Just depends on what you are feeling for that night."], ["Benjamin B.", "I was a bit confused when I saw an old PBR sign near/above the restaurant, but it turned out to be for a nearby establishment. Don't get me wrong, I love PBR, but not what I had planned for an Italian dinner.Ristorante Luci was. The cozy, intimate sibling to Luci Ancora (across the street) Ristorante Luci seats about 25 people, and serves up some tasty dishes. I was really impressed with the gnocchi and kobe beef entres. The fucilli wasn't all that impressive, however.Great date spot. Good menu selection (not enormous, but options), and a decent wine list.They're also offering some sort of sampler special on Tuesday/Thursday nights where it's $20/person if you have more than two people."]], "Aesop's Table": [], "I Nonni": [["Mike B.", "Another great experience for my wife and I. Leisurely 3 hour dinner with a great bottle of wine. Everything is excellent but its all about the pasta"], ["Beth J.", "To be honest, Italian food has never really excited me... until I found i Nonni.Located off hwy 13, i Nonni is tucked away in an unassuming small office complex at the front of a gated community. The interior has a simple elegance that perfectly complements the style of food their delivering. Also, their little known patio is a great place to enjoy a relaxing glass of wine while you listen to the waterfall of the man-made lake behind it.Their happy hour is one of the best in st. Paul in terms of value. $10 crafts of wine and half price, amazing appetizers. The mussels in a spicy tomato broth are the best mussels in the twin cities - some how two loaves of their warm crusty bread always seem to disappear, while I use it to soak up every last drop of the well developed, perfectly seasoned tomato broth. Also, their perfectly tender micro pork shanks fall off the bone - convenient, because I seriously could not eat them fast enough. SO GOOD! Finally, their sausage pizza has a nice cracker thin crust with a generous amount of cheese and high quality Italian sausage.I've sampled all most the whole bar menu and been very happy with everything I've ordered, but in my experience with their dinner menu, some things have been hit and miss."], ["Shanna K.", "Went here for a lovely meal with a good friend while I was in town visiting this past September.   It's taken me a long time to write this review unfortunately so I've lost a lot of detail but suffice it to say... I was very impressed.  The atmosphere is elegant and the bar knows how to make a fine cocktail. I like my cocktails far less sweet than most women and they really listened to my preference.  I started with their variation on a negroni and it was perfect.  After time to sip and contemplate we decided on the prix fixe menu with wine pairings.  At $39/per person - (exclusive of pairings) this is a hell of a bargain.   Unfortunately I can't recall the price point for the wine pairings but I remember that it was quite reasonable. Our meal began with sweetbreads and shaved lardo.  Outstanding.  Not too rich and just enough for the two of us to share.    Next up was veal shoulder tagliatelle.  This is one of my absolute favorite types of pasta and the tender, melt in your mouth veal shoulder took it right over the top.  Out of the entire meal this was my favorite dish, hands down.    Lastly, our main was the hangar steak, which was also delicious, perfectly cooked  and well proportioned.  I had a fantastic time and would not hesitate to return.  It's nice for smallish groups and great for a date night as well."], ["Kathleen K.", "This is the second time we have eaten here and both times it has been wonderful. They have a tasting menu that allows you to select an option from antipasti, primi and secondi for $39 (several options have an upcharge). I recommend that option. The first time I had an amazing gnocchi with fava beans.We started with:CARPACCIO  thinly sliced beef, arugula, lemon, parmigiano My tasting menu:INSALATA DI MARE  house specialty-crustacean salad, mussels, clams, shrimp, squid, lemon, wild arugula CARBONARA  torchio, maine lobster, farm egg yolk, black pepper, pecorinoIPPOGLOSSO   pan roasted halibut, apple wood smoked bacon, caramelized sweet onion-sea beans, basil sauceMy husband had:OSSO BUCO   gremolata braised veal shank, saffron risotto, bone marrow, veal jusThe carpaccio was excellent and the salad was very good. My only complaint about them was the arugula. It was very tough and sharp edged, it may have been a little old. Lobster carbonara was so wonderful that it begged to be sopped up with some bread (which I did). I would go back and just order that. My only complaint about the halibut was the onion-sea beans. They had an off taste with the fish and sauce and were over-cooked slightly. They did a fantastic job on cooking the thick halibut as it was perfect.My husband is a very picky eater but he loves the osso buco. He said it was even better reheated the next day.Their Sangiovese wine (by the glass) was perfect!Cost is in the high range and service was very good."], ["Shanno R.", "This place was so wonderful...we will be back!  We had a very romantic anniversary dinner here on Friday..  Love this place!  Our waitress was great she recommended a wine for me which was exactly what I was looking for!  I did notice that our waitress seemed to take her time while serving us but I felt like it was intentional to not rush us through and let us have a relaxed dinner. I never once had an empty glass and the timing of our dishes was perfect.We started with the carpaccio which was the best we've ever had and a very large portion. We wanted to try a variety of items on the menu so we both ordered the tasting menu (3 courses of your choice for $45) it was a great idea! The crustacean stew was superb, the seafood was perfectly cooked and the broth was addicting. We also had the warm brussel sprout salad, super yummy! The shrimp fettuccine with mushrooms had a fabulous sauce, and again shrimp cooked perfectly. The braised short rib with kale and mashed potatoes had so many great rich flavors and it was perfectly tender! We just loved every dish that came out. The portions were so big we brought a good amount home and warmed it up the next day- just as yummy as the first day!  We also brought home a piece of tiramisu..Yum.. It was perfectly creamy and light and fluffy :) What a great meal and great experience! I'm so happy we decided to try this place :)"], ["Melissa B.", "I came here for the first time with my family last week. The gnocchi was my favorite. For dessert, I would definitely recommend the cheesecake. Excellent service too."], ["Mon P.", "Yep .. still as good as it gets!We came here for an early dinner tonight. My bf was complaining a bit at the beginning because of the long drive, but by the end of our meal, he said .. yep .. this place was worth the drive and totally deserved 100 out of 100.  The first thing that I have to mention is the service. It was impeccable. I was so lucky to sit in the same server section that served me the last time I was here. Jay was absolutely amazing and so elegant. He was very knowledgeable. He explained the menu to us in great details. Too bad we didnt drink wine with our meal, because we overheard the manager mentioned to the table next to us that Jay knows more about wine than he does.Actually, it was not only Jay that was amazing. It seemed like everybody was working harmoniously here. Our water was filled probably after every 3-4 sips, our silverwares were replaced after each course, our bread basket was never left empty, and the most important thing we didnt have to wait for food that long even though the place was almost all full.We decided to go for a traditional three course degustazione. I chose raw tuna with sicilian relish and white shoyu from antipasti, garganelli with braised rabbit ragu from primi, and braised beef short ribs from secondi. Bf chose romanesca salad from antipasti, lingunie with fennel sausage from primi, and grilled hanger steak from secondi. Then we ended our meal with chocolate cake and pistachio gelato.  My raw tuna was very good. It was so moist and just melting in my mouth. The sicilian relish and white shoyu was a perfect combination for the tuna. My bf's salad was also good. The roman lettuce was so fresh and crisp, and the dressing with all those shaved cheese were great. My pasta dish was nice, though the cheese flavor was a bit too strong to my liking. My bf's pasta dish was really good. I dont know how they made the lingunie, but it was very good al dante. You could taste that it was not too mushy soft or too crunchy hard. It was a bit chewy but also soft at the same time. .. just perfect.My braised beef short ribs was amazing. It was so moist and so tender. The spinach with parmigiano potato puree was a great addition to the dish. My bf's steak was amazing. It was medium with pink center. Though it looked so pink, it didnt taste that pink. It was actually very tender and just melted in your mouth. The dessert was a great ending to the meal. Though the chocolate cake was a bit too sweet to my liking, the pistachio gelato was really nice. My bf is a chocolate and ice-cream lover, so he liked the dessert very much. He would probably lick the plate clean if he could."], ["Mike E.", "You can expect a memorable experience\" when dining at I Nonni - it will be a meal not soon forgotten.  As others have mentioned, the service is exceptional, and the entire staff seems to work in perfect harmony.  If you can, request to be seated in Jay's section, as he has 20+ years of experience in formal Italian dining.  He's a star and a delight.The lighting and mood are perfect for a formal occasion, or for a semi-formal cause for celebration.  I ordered the DEGUSTAZIONE, which is one item each from antipasti, primi and secondi, which currently runs for $39.  I chose the VONGOLE (steamed clams, smoked soppressata, scallion, potato puree), GARGANELLI (braised rabbit ragu, treviso, caprino, rosemary), and the AGNELLO (lamb chops \"scottadito\", lemon, fingerling potatoes, arugula, pecorino).The vongole and agnello both stood out as all-star dishes, the kind of flavors I will remember for months, or even years.I am told some of the wine options here are not sold anywhere else in the US, and they have an attached market where you can buy wine to take home.Our meal ended up lasting 3 1/2 hours, with the time passing impossibly fast.  Truly an awesome experience."], ["Meghann F.", "The food was very good as the other reviewers have suggested - we had a deal that I got with wine and three courses for two peeps - we had some salad to start and ordered a couple of extra things beyond our deal - I got the scallops for an entree and my boy got the lamb, steak and sausage sampler - both were amazingly good.  We got a gnocchi w/ meat as a pasta - extra - i forget because it wasn't on the menu and tried the ricotta cheese dessert - which was essentially a cannoli.  The wines that we got were amazing - i first got a really dry red - i forget the kind - but it was $16 and tasty!  (and covered by the deal ;))The service was okay - they were really, really busy -  the server forgot one of our extra courses that we ordered  - which was okay because we had plenty - and we might have ordered a bottle of wine if she had come around more often - like i said they were super busy - so it wasn't her . . .maybe they need more staff?  We had others looking after us - getting us bread and water as well - but they missed out on us ordering some extras because they didn't have the time to spend that I guess I expect more at a fine dining establishment?"], ["Joe K.", "I did the Degustazione Menu for a three course experience.My favorite was the anitpasta Caciucco alla Livornese.  The broth was on an another level compared to the rest of my meal.  My Primi was the Funghi e Nocciola which was overwhelmingly earthy.  I wish I had ordered what my friend got the Piramidi di Gamberoni essentially shrimp ravioli.  My Secondi was the Capesante con Funghi.  The scallops were amazing but I didn't care for the parsnip puree.If you want a starter to share, get the Formaggi.  You won't go wrong with cheese, dried fruit and crackers.Overall an enjoyable experience but a little pricey for what you get.  I'm more interested in Buon Giorno next door."], ["Nicholas G.", "We're off to Mendota Heights where a place called I Nonni Osteria & Buon Giorno is serving some fantastic Italian cuisine. I Nonni may be on the higher end of the price list and if that's a deal breaker for you, then stop for lunch and let Buon Giorno, their pasta bar and fresh Italian market make something delicious for you. There is plenty to choose from and you can even take some of it home with you from their fresh market. If you're eating at I Nonni, I recommend their house special spaghetti and sausage and I guarantee that you WILL NOT find a better dish anywhere else that shares similar ingredients, period!"], ["RICK L.", "My wife and I recently visited i Nonni for the first time for our wedding anniversary. By the menu, reviews, and price range, we expected a top-level experience. But overall, the establishment fell short. The food was excellent. My wife, who has to eat gluten-free, had the hanger steak \"secondi\" and enjoyed it quite a bit. She was disappointed in the caprese-style antipasti ($13) that was a special that night -- in particular, the mozzarella was nothing \"special.\" I had the halibut and it was very good. Where I take away the most points was the atmosphere. We were seated at one of the tables in the main room -- not the bar area, but at the edge of the main room, closest to the bar area.  The bar area was loud, frenetic, and full of slobs in T-shirts -- completely out of character with the restaurant. It's a very schizoid identity that i Nonni should address. When I spend $140 on a dinner for two, I don't expect the atmosphere of a Chaamps."], ["Alex C.", "I had heard a lot about this place so I was pretty excited to get a Crowd Cut here.  Their market is huge.  It's like a fancy version of the old Cossetta's market.  Their restaurant is beautiful.  I was the only person in a tie the night I was there but I definitely got a country club vibe from the place.  It is really nice looking inside and I thought the people were all great but my wife echoed what others have said about a pretentious feel.That being said, the food was fantastic and very well priced for a fancy restaurant.  I started with the lamb crudo and the portion was big (of course not too big...I can never have enough raw meat) and incredibly tasty.  Sometimes stuff like this leaves an oily or fatty film in my mouth but not here.  My wife started with a beet salad that she really enjoyed.  Everything appeared to be in perfect sized bites.  For dinner I had the hanger steak which tasted and looked like a large tenderloin.  The sauce was mushroom and cooked cherry; a strange but amazing combination.  The cherry added just the perfect amount of sweet to the meal.  This  was one of the best cooked steaks I've ever had.  My wife had the lobster mac & cheese for under $20.  There was an awful lot of lobster for a dish under $20.  She greatly enjoyed it too.For dessert, we finished with the figgy toffee pudding.  This was the best fig newton tasting dish ever created!  I like fig newtons, my wife didn't like it as much so that meant more for me.  It doesn't look like a fig newton but it tastes like a newton with cream and a little salt to help maximize the flavor.  That toffee is just awesome!It's a great special event space.  Entrees were between 20 to 30 (my steak was 27 and a ribeye was 32), the noodle dishes are all under 20 with half sizes available.  If you're hungry, you're crazy not to do the tasting menu at $39 which gives you a smaller noodle, entree and salad/appetizer."], ["Ken S.", "In my humble opinion this is by far the best Italian restaurant in the Twin Cities area. Been a regular since opening and the high standards has not changed at all. The service staff is top notch, many of them veterans from opening day. Try the three course tasting menu along with  wine pairings and let them help you make your choices. During nice weather the patio is a must. Buon appetito!!!"], ["Kelly J.", "I came here with my boyfriend for our anniversary dinner. This place is hidden and I hope it stays that way! The food was amazingly delicious, the wine pairings were superb and I can only mention a certain dish that will change your life: Figgy Toffee Pudding. Seriously - you must get it. Dessert will never be the same again.We had the tasting menu which is more than enough food, and quite a good deal for the price. You start with an appetizer, then have a pasta dish and after the pasta you still get a main course! The sausage rigatoni is simple but pristine, and I cannot say enough about the halibut I had - to die for. They have a seasonal menu so the dishes available when you go may be very different, but I can be quite sure that the food will be consistently delicious no matter what time of year it is."], ["aaron a.", "I previously rated I Nonni at 4 stars.  Little did I realize how wrong I was.  This is a five star Italian restaurant all the way through.The service is exceptional.  The wine list is amazing.  And the service is outstanding.  The food outshines all of that.The last nightly special I had yesterday knocked me back a few paces.  It was among the best seafood dishes I've ever had.  Zuppa de Pesce taken to a new level, loaded with clams, lobster, shrimp, tuna...wonderful and delicious...sea beans?  Who would have thought.  Saffron, lovely.  This was the highlight of this month for me.  It was terrific!We come here often for happy hour to eat at the bar.  This place has the best pizza in the city.  We always get the margarita and add anchovies Napolitana style.  Amazing thin crust, just like we ate many times in italy.  The sauce perfect, the ingredients top shelf.  And at 1/2 price between 4-6 for a measly $6, I can't think of a better deal on a pizza anywhere especially at this quality.Every dinner I've had here in the last 9 months has been exceptional and we eat here up to 2 times a week.  It's so consistently amazing that I have a hard time going anywhere else for Italian food in MN.  No, actually, I probably won't bother going anywhere else for Italian in MN.  I found the best around."], ["Jim R.", "We have visited this out of the way Italian restaurant on 4 different occasions. Each time the food and wine has been excellent. Our most recent visit in August didn't live up to the other 3 and it underscores what a difference the waiter can play in your overall dining experience. Our first visit (yea Groupon), we had Jay - and his descriptions of the food, helpful tips about portions and wine recommendations really put the icing on the cake for my wife and I. We've eaten at hundreds of restaurants and I'd have to put Jay up there in my top 5 waiters ever! So on our subsequent visits we asked to be seated in his section and had 2 more 5 start experiences. One time we even let him just bring food and wine based on what he thought was good. Probably our best dining experience since our trip to Italy last year. This most recent visit we couldn't get in Jay's section (he was working the great patio and it looked like rain so we opted to eat indoors). The food was just as good but our efficient and impersonal server left us wishing for Jay. Food recommendations: Peekytoe crab salad (yum!), fried zucchini blossoms, Oso Buco, Blood Orange Sorbet (love it!)  and whatever wine Jay recommends to go with your food."], ["Rob G.", "I just had dinner at Osteria I Nonni for the third time, and I couldn't live with myself if I didn't take a few minutes to give them a glowing review.I Nonni is probably the best Italian restaurant in the Twin Cities.  Why do I say that? It's because they win first prize in all categories.The food is absolutely spectacular. This evening I tried the veal sweet bread as an appetizer and it was delightful.  Next, the sausage gnocchi blew my mind as they somehow managed to evenly balance the ingredients to simultaneously enhance the high grade of the pasta while complementing the spices in the meat.  My main entree was the halibut which was perfectly cooked and topped with fresh spinach leaves, served with a split pea mash that was phenomenal. The service is always terrific.  You'll never be left alone for too long although a standard dinner will last about two to three hours, depending on your pace. It leaves a lot of time for conversation which makes this place a top-notch dating venue, assuming that you're willing to pay more for good food and that you're not an introvert.The dining room is dimly lit and the tables are set with quality dinnerware and are well spaced to allow for some privacy. If you're with someone, I'd suggest a booth but they'll get you to the right table when you check in without having to explain what you need.  They've got an eye for that sort of thing, I suppose.I am really looking forward to my next visit and can't say enough to recommend I Nonni to anyone who is looking for an A+ dinner experience."], ["Andy O.", "This is five star all the way.  This is probably the best Italian restaurant around.  I've been here twice, both for special occasions and it did not disappoint.  The prices are a little high, but you are getting really amazing food in a beautiful restaurant.  Definitely give yourself some time to eat and enjoy, this is not a place to rush through dinner.  Dinner for two here works just as well as a group setting.  The menu is always changing so don't be afraid to try something new."], ["Anne W.", "Consistely good qaulity, intersting without being wacky, and excellent service. I'd go 4.5 stars if I could.  I Nonni has a number of exceptional dishes (which may or may not be on teh menu at any given time) including the lamb, sweetbreads, carbonara, asparagus w/ egg, pheasant ravioli, and the orange polenta cake for dessert.  I find a few dishes (the mussels and some seafood pastas) too spiced for the delicacy of the seafood, and some of the desserts are a little wacky without that wackiness necessarily adding to the flavor.The wine list is excallent, and Jay is great with getting to know our wine tastes and helping to select a diffent lovely botle to try each time we go there.  The service in general has always been excellent; the servers are experienced, professional, and just plain nice people. Overall, one of my favorite places in the St. Paul area."]], "Buon Giorno": []}