{"Catrinas Mexican Restaurant": [], "Acapulco Restaurante Mexicano": [], "Supermercado Y Cafe La Palma": [["Alan S.", "First of all - not Mexican food. Jeez - get it right. I mean it even says Salvadorean on the yelp page! Not every brown person from south of the United States is Mexican and not all food from Spanish speaking countries is Mexican food. If you don't come with these assumptions you'll save yourself a lot of trouble and have an unforgettable meal.This is Salvadorean food - so for beginners get the Pan con Pollo. The top dog of all Central American sandwiches. Delicious moist chicken, toppings piled up so high that they practically dare you to smash the thing into a sandwich that can be consumed with two hands (it cannot - use a knife and fork)- salsa and oh that creamy mayo.The market is awesome and a lifesaver in a metro area bereft of Latin groceries. Old school meat counter where you can get fresh or marinated cuts. Very fresh produce with a great variety of fruits and vegetables that can be hard to find elsewhere."], ["Anthony C D.", "This was the worst Mexican food I've ever had in my entire life. I ordered a simple Veggie Burrito and my wife had the Steak&Shrimp Fajitas. My Veggie Burrito was flavorless and the steak in my wife's Fajitas was practically all gristle. Our food was too expensive for being such bad quality and took forever to be served. You could taste that the beans came from a can. My wife and I were so disappointed with our meal that we were both in bad moods for the rest of the day. We talked about how wewished Chef Gordon Ramsey would show up to this place and curse them out for the terrible disaster they call food. After eating there today, my torso feels like it should be in an episode of Law and Order. Ever seen the Movie ALIEN? Yeah, that's what I feel like."], ["Kyra M.", "This place tends to get ignored when people rave about the gentrification and food establishments on Payne Ave. Unfair. It's a unique, yummy restaurant. Best bets: The pupusas and their \"buffet\" sort of offerings right at the register. For around $8 you can choose several items including unique meats, stews and vegetables. There is a small bit of a language barrier, but not too bad. It's in the back of a market, so space is limited, and it's not fancy or anything. I've been here several times, though, and it's always been yummy."], ["Victoria L.", "I am going to be honest, I got food poisoning from the food there a few days ago. Avoid this place! Cheap Mexican food that made me ill!"], ["Penny P.", "Love this place! Food is all very authentic Salvadoran food! Love the pupusas are amazing! I've also had and enjoyed very much the beans and rice, tacos, and not sure what they do to their refried beans, but they are to die for!!!Go check it out - LOVE IT!!!"], ["Nicholas G.", "This quaint little market also has a small restaurant in the back of the market and they're serving some of the most outstanding food around. I recommend, well, everything! I had their Pork taco's, but everything I was looking at looked good, smelled good and I wanted all of it. Can't wait to go back to try everything else on their menu."], ["Matt M.", "Just Like a Cafe in Mexico and not the Tourist parts! great Authentic Mexican Food with the feel of being in a neighborhood cafe in Mexico a Must Try!"], ["M L.", "I'm really trying hard to write shorter reviews, but brevity just isn't my long suit. Guess we'll see how I do this time..First point - this isn't a Mexican place. The folks who run La Palma are primarily Salvadoran, and their menu offerings reflect this fact. Naturally, Salvadoran food does share a great deal in common with Mexican, but they have their own take on a number of dishes - and offer several things you'll just not find in a typical (Tex) Mex or Mexi-Cali eatery. Like what, you ask? Like pupusas, I reply. What's a pupusa? It's a somewhat thick, corn masa pancake that's filled with any number of different meats and/or cheeses, and frequently a combination of several. They are traditionally served with a two-part condiment of mildly picked shredded cabbage (think Central American cole slaw) and a thin, runny tomato sauce. The idea is to use the sauce as a dressing for the cabbage - adding it just prior to eating. (If the two were mixed beforehand, the acids in the tomato sauce would soon wilt the cabbage into an unappetizing pulp). So which kind should you order? I'd suggest the *ready* kind; just ask what's in the pupusas-of-the-moment and call a yea / nay on it. The best I've had so far were filled with a mixture of veal, pork and cheese.This advice holds for the place in general - in my experience, unless you have some time on your hands, you're best off ordering right from the cafeteria line, on your way to the cash register. This isn't to say that I haven't enjoyed several wonderful meals prepared-to-order, just that you're going to wait a while if that's what you'd like to do. On the upside, when I have had to wait for my food, the food both appeared and tasted unhurried - and came out piping hot. Having said this, there are so many great, ready-to-consume options, that this isn't much of an issue. But I do hope that they eventually find a way to streamline their kitchen operations, as the menu is quite large, and offers quite a few dishes that I've simply never encountered before - and they call to me, every time I visit..Because the food, here at Cafe La Palma, is fabulous! Everything I've seen, smelled, tasted or touched has come across as highly authentic and very much home-made-y. My advice? If it looks good, it IS good - you'll love it, and you'll have plenty of it. If you're unsure, don't be shy - ask for a little sample, and they'll come through for you. The portions are full-days-work generous, and only once have I been able to finish off everything put in front of me in a single sitting. Plain and simple, this place sets out some really serious grub.Prices are quite reasonable, though a few of those mysterious menu offerings, some with lovely photos, do rise into the $10-15 range. My only potential gripe with this place is the language barrier issue - which is not so bad, really, but I do sense that it's limiting my full enjoyment of everything they have to offer - and has resulted in a couple of screw-ups that proved somewhat tedious to correct. 4/5 stars for fab food served by friendly people, and a menu that has something for everyone."], ["Sarah C.", "Friendly, clean and nice. The music can be a bit much, even for the semi hispanic in me. I've yet to try the cafe but it is always packed. Got some decent meat here and stocked up on supplies. I find myself going to burrito mercado more often...if only for the aesthetic and better vegetable selection."]], "Border Taco Truck": [], "Rusty Taco Saint Paul": [["John O.", "The parking here sucksThey could also use more staffAvoid the lunch rushI have been here at least five times now.  The parking situation is horrible.  With the Trader Joe's and other businesses nearby, there is never a spot in the street level parking lot.  There is an underground parking lot, but I believe it is just for the Trader Joe's.  Usually end up parking it on Randolph and walking the rest of the way. Nobody knows the troubles I've seen.Got there during the noon hour lunch frenzy today.  Line was backed about three to five outside the door.  Probably about ten minutes to the counter, and then probably another fifteen until food came.  Only people working were a cashier and the cook.  They were seriously overworked!  Later saw a woman who I am guessing was one of the owners behind the counter - she did not really seem to be doing much of anything to help out with the demand for the product.Tacos are small, but cheap and tasty.  All but the seafood options are $2.50, and the seafood ones are $3.00.  Anyone with an appetite will want to get at least two. I recommend shelling out the extra change for the seafood ones - both the Baja shrimp and the grilled fish hit the spot.  Also, if you don't like cilantro be sure to tell them \"NO CILANTRO!\" as it is the standard default on most everything they have.Also, they do have beer - including Lagunitas. My only other complaint that I have not already mentioned? The music was awful.  Felt like I was in an 80's German Discotheque.  Do you want to touch my monkey?  Touch him!  Love him! My story has become tiresome. Auf Wiedersehen!"], ["Nick C.", "Called to place a order for pick up. Was left on the mine for 5 minutes. We hung attempted to call back and they did not answer. This is very disappointing because the food is above average. But the customer service is a below zero. I hope owners realize the gem that they have but with the people that are working there will ruin there business."], ["Kirsten O.", "Cheap good food. I like the eclectic atmosphere. A little bit Chipolte mixed with wahoo tacos."], ["Christina G.", "Meh. It's okay. Not the best, but if you're in a hurry and don't care if you're eating mediocre food- try it out."], ["Jeff S.", "The tacos are good the service can be iffy.Been scolded for ordering eight tacos to bring back to the office. He said I should have faxed the order in. Sure I will go in to the office - fax then drive back. I was just ordering when he gave me my scolding and I wasn't in a hurry if it took a little bit I was fine with it. - Haven't seen this guy in a while luckily.Now the Gal in there, I stopped 5 minutes before thy opened and was waiting in the car outside the door. She was coming in for the day gave me a cold stare. Then came back to the window again.  Maybe thought I was casing the place at 11 AM on a Tuesday?. Geeze relax I have been regular since they opened.At the counter she is a cranky one."], ["Carol O.", "We stopped in here last evening for a quick bite.  I've passed by this place many times and have had a few people tell me it's worth a try so in we went.  I ordered two crispy shrimp tacos and my companion ordered the grilled fish tacos.  The tacos were pretty small but so reasonably priced ($3 for the shrimp).  On the taco was a slather of an orangy spicy sauce, the shrimp (which were crispy), a bit too much cilantro and some red cabbage.  All in all it was tasty little taco.  My companion liked his grilled fish a lot but also commented on there being too much cilantro.  If we stop in again which is very likely - I would ask them to go easy on the green stuff. My companion ordered a Fosters and I asked if they had wine.  I found out they had red and white - that was it - so ordered a glass of white and it was really quite nice for I think a $3 price tag.   There was one wall mounted TV where we watched the Vikes continue to rule!  The place is small with long tables to accomodate several groups at each.  Very clean - friendly help.Stopped in at Trader Joe's which is right next door to pick up some of their frozen brown rice - so gooood.  But, I guess Trader Joe's should be separate review."], ["Mo M.", "Rusty Taco is a good option for a quick, fairly cheap dinner option if you're in a rush.Not every kind has been stellar, but the fish taco and the rusty taco are both solid.Service has always been quick and friendly."], ["Steve T.", "So it's day 1 of this joint and there are definitely some bumps.  BUT, I've got myself a taco joint in the hood that makes quality south of the border style tacos and I'm hoping those bumps go away.I had two tacos tonight. The fish taco grilled.  It was a tad on the fishy side and dry but in general, the taste was good.  You can also get the fish fried. The other was the roasted pork.  That too seemed a little too shredded vs pulled which seems more authentic but overall the taste was good. In total, there are 11 different tacos you can get.  Beers, while struggling with the opening day blues, are a nice selection.  Of the 4 taps availabe, (Fulton brewing being one of those choices) only Hamm's was available.  It was also odd that the Hamm's and Fulton were priced the same. Bottle beers are $3.50 and silos are $4.  Overall, great pricing on the beer.  Wish Flat Earth or Summit were also on tap but that's cause I'm a St. Paul boy.  The sauces are nice.  The hot, made with habanero leaves a nice linger heat.  The med has nice taste and tomatillo, their mild, is nice and fresh. I'll definitely be going back."], ["Dawn S.", "The food is average, as is the service.The tacos come out very quickly and they have a nice choice of three salsas.The tacos are ok, reasonably priced.  The guacamole is average.  I would eat here if I was super hungry and already had a parking spot from getting my nails done next door, but the food is not good enough to make a special trip.The parking sucks!"], ["Suzanne P.", "I came here ready to EAT.  I was starting a big diet the next day and thought to myself, \"what better way to go out with a bang than with yummy mexican fare.  Unfortuantely, that didn't happen.I would give this place 1 star because they didn't get the basic foundation right; their guacamole is TERRIBLE.  Seriously, you couldn't have made fresh, chunky flavorful guacamole?  I know we're in Minnesota, but still.  I expected better.I added an additional star because the fried chicken was pretty decent.  The pork taco was forgettable and the beef brisket taco was a horrible mushy mess.Sad face.  I wish my last post-diet meal was better."], ["Anjali T.", "I personally really like the small taco shop. It's good food and good service. It's a good place just to stop for a light dinner or lunch it's quick too. The tacos are small and it's nice because u can try different kinds and each taco is pretty inexpensive. I would recommend the black bean taco, the chicken and the shrimp. They also have nice hours because when nothing els is open on say the 4th they were and we had a nice meal. Just FYI the takeout isn't as good because it get a little cold. Otherwise I would deffinal recommend rusty taco to anyone."], ["Ben R.", "Their grilled fish, brisket, pork, and rusty tacos are excellent.  The beef and chicken tacos are a little dry."], ["Kelly S.", "After a handful of visits I have tried a smorgasbord of their tacos. They're all great! My faves are the brisket, pork, and fish tacos. I like the flour tortillas better but I always forget to specify that I'd like the flour instead of corn. I wish they'd ask your preference upon ordering. Convenient location makes for a congested parking lot.  Despite this fact, I haven't yet (knock on wood) had an issue with finding a parking spot."], ["Rhonda G.", "At its inception this was on my J. Edgar Hoover enemies list of personal boycotts. Mainly that I resented the greed of the developers of putting in this building, when it was obvious that Trader Joe's would need it for parking, which it still does. I needed to go to TJ and I was sick of going in hungry. I stepped in and loved the cool layout. They fit in a good amount of seating without feeling cramped in a small space. Service is friendly, and any hurried feeling was on my part because you feel exposed during the ordering process. I went on a Friday, and noticed a special on fish tacos. They were really good with a delicate crunch to them. I tried the guacamole, not expecting much at a fast food, that was good as well. They have long tables which can be shared by strangers. Handy, clean bathrooms. I like the metal decor, unpretentious, just like the food."], ["Andy T.", "This is my first visit to Rusty Taco. I ordered two tacos. #2 roasted Pork and a #5 Brisket taco. They're served in a corn tortilla with what looked and tasted like Cojito cheese. The Pork was very juicy, good flavor but not spicy at all. Throw a bit o kick in that recipe! The Brisket taco was similar but a bit dryer. Both had perfect portions and the  Service at the ordering counter was friendly and food came out quick. Rusty Taco is leaps and bounds above your fast food gut bombs. I'll be back to try more for sure."], ["Amy C.", "Given the option, I'd give the Rusty Taco a 3.5 star rating.  Good word of mouth, and a nudge from Foursquare were enough to prompt a stop after a visit to Trader Joe's.  The minimalist decor is reminiscent of Chipotle, as is the tight menu.  The low prices make sampling several tacos a viable option.  We tried the fajita, shrimp, fish and brisket tacos, as well as pico, guacamole and chips.After paying for your order, you get chips and salsa right away.  My husband and son sidled up to the bar while I paid and grabbed the chips.  My attention immediately went to a woman sitting two seats down from my son...she had a cat in her lap.  Ummmm.....ma'am?  Why did you bring your kitty to a restaurant?  A better question is why the staff didn't object.  And just three feet from where food is prepared?  Gross.  I mention this because seeing a cat in a restaurant distracted me from the bottles of salsa available for topping the tacos.  So, the first two bites of my brisket taco were okay, but were upgraded dramatically once I added the medium salsa.   No one is afraid of cilantro here, much to my delight.  My brisket taco was smothered in it, and it's prominent in the pico and salsa.  The pico was bright and fresh.  Guacamole was a little too lump free for my liking, and could have used a little garlic and/or salt, but it was good nonetheless. I really liked the fish taco, the red cabbage substitute for lettuce was visually appealing and gave the taco a nice bite.  It's clear the owner isn't bulking up the staff and squandering money on unnecessary payroll, but if the place was any busier quality would have suffered.  I'm going to try it again, I suspect strong potential that wasn't obvious on this visit.  The location next to Trader Joe's is great for built-in clientele, but parking sucks.  During better weather, I'd be inclined to park in the basement of TJ's and walk over."], ["Timothy K.", "Tried it again because I had a coupon. Service is still terrible, food is still average.It didn't seem like the guy who took my order wanted me to be there at all.  I was able to finish my entire soda before the guy who actually assembled the taco arrived from the back to make them.  The making didn't take very long at all.  Just a minute or two to make them, but I still needed to wait.  Maybe it was an off day or there was something more interesting in the back room.I really, really wanted these guys to be good.  I did not enjoy the fish taco at all.  Very small fish to everything else ratio.  The pulled pork was pretty wet and made eating it a drippy experience.  I don't need my meat dry by any means, but there was a balance there that was missing.The parking adds to the issues that I have with it.  It's a really small lot that they share with Trader Joes, the yogart place, Papa Johns, and a nail place.  Very small lot for so many store fronts.It's not right for me, but the siren song of a taco joint right near my place might make me try again.  Perhaps a different taco..."], ["Andrew R.", "I heard about this place from a co-worker and decided to try it out for lunch. It is located in the small shopping complex that shares a parking lot with Trader Joe's. Due to that and the way the place it is set up, it has a very fast-casual feel to it. You order at the front and purchase drinks, and then find a seat in the smallish but clean dining area.They offer beer and wine, as well as a pre-mixed margherita, which I would definitely not recommend. Their menu consists mostly of a good number of different small taco options for $2.50 each and some side items. I tried the signiture Rusty Taco and the Fish Taco (Grilled). The food was ready almost before I even sat down; service was extremely quick. They have 3 different levels of salsa you can add to your tacos, all of which were pretty good with varying degrees of heat. Both tacos were tasty, thought the fish on the Fish Taco was a bit mushy... I would probably opt for fried fish the next time around. But flavors were good, fresh, and varied enough from taco to taco to add variety.Taking off one star because I wish the atmosphere was a little more sit-down-y, but then prices would also likely go up, so I'll take the good with the bad. Good service, good value, fresh food, and fast if you are looking for a quick lunch or dinner on the go. Overall a positive experience... I will definitely be back to try some of the different taco combinations."], ["Dan B.", "Best taco outside of DistrictDel Sol?No, but it is the best taco within 100 feet of a Trader Joe's. The wife and I hit The Rusty Taco, off of Lexington and Randolph, this last weekend and we both enjoyed it. They have eleven different tacos on their menu (not including breakfast tacos), along with chips, salsa, guacamole, beer and wine. We each tried two different tacos, and my girl still raves about the BBQ brisket taco (#11).  I would have sucked down 13 or 14 Baja shrimp tacos (#8) if it had not been for the very large can of beer that was already in my belly. Good food at a good price, and very fast! We had our food about 3 minutes after we ordered it, and that may be my only complaint. The Rusty Taco is set up to serve many people very quickly (an assembly line format). I understand that 90% of their menu can be served that way, but if they had taken an extra 2 minutes to fry my shrimp to order, then they may have one of the best tacos in Saint Paul. I will go back if I'm in the area, but I can't see myself seeking it out.."], ["Rakhi N.", "Okay, when Rusty Taco first got here, I really did love the place, and my hopes were really high. But, things have changed. I'm older and wiser. The good: Beer prices are awesome and tacos are good!  The tacos are the perfect size (this is not a burrito joint, people). I also love the breakfast tacos, and worth getting up a little early for work to make a stop.The bad:  I *used* to love the shrimp tacos, but now that they're at $3 a pop, I'd rather spend it on some two (three?)-buck-chuck at Trader Joe's next door. \"Queso\" is a spicy velveeta which is great, you know, at Super Bowl parties and whatnot, but notsomuch at a place trying to be a real taco joint. \"Guacamole\" is made from the crappy bagged bulk avocado that doesn't really taste like avocado - it was really disappointing.Lastly, and most annoyingly, the beer is served in these heavy duty plastic cups that are not recyclable and they don't re-use. When I mentioned to the manager that this is a bit wasteful he replied, \"what can I do about it?!?!\"  Hm. Maybe he forgot that he was the manager...?"]], "Homi Mexican": [["Wanda M.", "Tamales w/ cheese and jalapeño were delish.  I have been looking for a place closer to home than Chicago's Old Town Ale House random tamales.  Found it!Cheese quesadilla was pretty good too.Guacamole with no onions!!!! Jackpot!"], ["Jean J.", "The first time I tried this place I ordered the fajitas.  It came to me with way over done pepprs & onions, and the meat had not even been seared. It looked (and tasted) as if it had been boiled.  I decided not to go back.But I did. I ordered one combo platters.  It was obvious that it had been pu on the plate cold, then nuked. Example; pinto beens dry and bubbled at one side, stone cold at the other (only 2 inches apart on the plate.  The entire plate was like that.I don't know how anyone can even pretend this is good food."], ["Andrew W.", "Only been there once, but it was really good. I had the quesadillas which were HUGE. The guac is made from scratch. A couple owns it and they are super sweet and super hard working. Yeah, it's a bit pricier than I would ideally like but considering the owners' situation, I'll dish it out. Only reason I didn't give 5 stars is because the tamale's were a little subpar. Gave my wife some upset stomach feelings post-prandially."], ["Lauren G.", "Normally I'm very happy with the food from Homi. Unfortunately this time around I'm extremely disappointed. Finding a HAIR in my food is quite disturbing. I the server was not wearing a hair net, I know the server works in the kitchen. It will be a long time before I go back. So sad."], ["Ruth D.", "I'll give it another shot, especially since the reviews are so good, and the food was pretty tasty, but I was a little disappointed. Everything costs extra--lots of nickel-and-diming for things like an extra bowl of chips ($2) to the $2 side of sour cream that is about two tablespoons. I did really love the homemade guacamole, although it needed a little more salt and pepper. The chicken was juicy and perfect and spot on -- and the beans (which are my never-fail bellwether for good Mexican food) were delicious, although for what I paid for a side of rice and beans I expected more than a quarter cup of each.I didn't try the tamales, which are a personal favorite, so I will definitely be back to give those a shot. And the service was friendly."], ["Susannah H.", "I hate to say this, but I was pretty disappointed with my experience at Homi. So many people have spoken of Homi glowingly, as one of the best places in StP for proper Mexican food. Maybe I didn't order the right thing?  Maybe I came at a bad time (hour before close)?  Maybe it was just an off day?  I'll be giving it a second chance, but so far, not impressed. We ordered lengua sopes and two tacos: one lengua and one carnita.  Both were really greasy, the lengua was cooked well but borderline bland, and both dishes were pretty lackluster. We also ordered a side of rice and beans...beans were bland and the rice was crunchy as well as bland.  That basically summarizes our whole experience: bland. Again, many different factors could be playing into our experience that night, so I will try it again and am open to any suggestions people have to give in regards to the menu. The service is what gave this review 3-stars instead of 2.  The staff was friendly and the service was quick. The decor was simple and the restaurant seemed pretty clean (albeit a lot of flies).  Maybe next time I'll try a tamale."], ["Jonathan T.", "Grubbing at Homi is like having a meal at a Mexican family's home. At least, that's from my experience. I roll with a breaking crew called Mid-West Monstaz, where everyone is Mexican except for two other dudes and me. Upon entering, I thought I was transported to my boy Vic's house in Rockford, IL.There's no mariachi music, the décor is bare, and, I guess, you could describe the space as a textbook \"hole-in-the-wall.\" (I feel like the phrase should be renamed to \"home-in-the-wall.\") I felt so welcomed.I visited during lunch and found two people making yummy noises while scarfing down gigantic burritos at a table in the back. It was that quiet... I sat myself and waited for someone to come out who happened to be the owner. She was sweet, short, and wore a hairnet since, during that hour, served as both the cook and server. Since it was my first time, she suggested that I try both her tamales and tacos.Oh my goodness...She brought out a pair of steaming beef tamales that were made within the half hour. I am no tamale connoisseur, but I thought they were outstanding. Incredibly moist, packed with flavor, and perfectly salted - I was left craving for more and decided to order three more to go. They're only a little over $2 or so for each, so why not?I then had both tacos carnitas and al pastor. My initial impression was that the tortillas were slightly larger than the ones served at a traditional taqueria, and I think that they make their own. The tortillas were gently toasted on both sides and filled with diced soft meaty morsels. Although they weren't as seasoned as other Mexican restaurants I've been too, I found them to be delicious in a different way. Topped in each taco were generous handfuls of cilantro and onion, too.The tacos also came with one green and red sauce. I cannot take the heat like I used to, but food nerds that can -like my friend BK- will love these salsas. For me, though, they almost cooked my insides. However, I would easily try them again, despite knowing that I would have to lay on my bed in agony for about ten minutes. haha.For both the tacos and tamales, I washed them down with a tall glass of a sweet, cinnamon-y, and cold horchata. Loved it.Despite being filled to the brim with food and drink, when I heard that Homi served flan, I couldn't resist ordering it. If you decide to get a serving, you'll notice it's a thicker kind than other Mexican flans you may have tried and is drenched in a sweet caramel-y sauce. I left satisfied and happily carried home three more palatable tamales to devour later.Homi's not a Mexican restaurant to have margaritas with friends after work, pound shots of tequila and wear a sombrero on your head when it's your birthday, or watch soccer games; rather, it's a home-in-the-wall to get fantastic food at decent prices served by lovely people.I'll be back soon, Homi."], ["Sarah J.", "This place tasted like when I was in Mexico, as authentic as I have found yet. I had the empanadas, added beans and rice, they were delicious!  The horchata was fresh and home made, service was good, a great little hole in the wall place!"], ["Crystal L.", "I am always on the prowl for good Mexican food. I just recently found out there are many different types of Mexican/Hispanic food based on regions and even cities/villages! Maybe that is why I feel like Mexican cuisine can be so creative. I came here a while ago for Valentine's Day with my boyfriend and I loved my experience. It was tear-jerking - literally. I was bold and got the Shrimp in Hell Sauce. Yes. Ironically, I was in HEEEAVVEENNN!! I lovveeee spicy food and this dish definitely reminded me that my once magnificent tolerance for spicy food is faltering. Think it may have something to do with my diminishing youth. My boyfriend got the burrito. I have to say I wasn't impressed...it was massive, but bland. I'm glad I stuck with something different. I have to go back soon to try their other dishes like the Tamales and Gorditas."], ["S W.", "This is so fine, so plastic tablecloth love and homecooked comfort food.Say yes to the guacamole you will be offered. It's a charming yet potent upsell.If you like fresh avocado, youtube puppies, daisies, sixty degree days and breathing in general, you'll at least like it if not love it. Same with the horchata, normally not my favorite thing and often suspiciously like it's from some mix - here it's perfect. Perfect.It's the little things here, they add up. Maybe some people would find it bland. Salsa here is not messing around at all, and I don't always feel like I need to be sledgehammered with the sabor, though I can appreciate it when it happens.Usually I go for a benchmark of  tacos when I'm on a first date with a place. Homi somehow seemed to urge me into plates soups and dinners - Pozole? Sopes?  - I went for a trio of Empanadas, crispy with delicate potato and subtle but nice chorizo. Even the rice and beans are above average.Everything is just wrapped in a warm fuzzy of likeability and subtle awesomeness.  I'm already being begged to go back soon from the people I went with. Clearly this is doing it right."], ["Melaney S.", "The First thing you want to do is ask for the fresh guacamole. She serves it with the stone in the bowl. I don't know why but it is kinda cool. My hubby and I went recently to make me feel better after a Dr. appointment and it did. I tried the Tacos for the first time I got this huge plate full of them so filling. I normally get tomalis or one of the soups. My Husband got a new dish as well that he loved. It seems every thing we try here makes us happy. I have asked her how she makes her food so tasty she says she just uses fresh ingredients, I think she must have some magic. That guacamole is not form this world. The decor is as everyone says hole in the wall they only reason I have not given 5 stars is the loud bad TV who wants to eat to day time talk shows.  The menu is fun the english translation is not good. Be prepared to laugh. Take a chance, enjoy."], ["Patti I.", "It's hard to find a sit-down Mexican restaurant with food as good as what you get from a truck or a taqueria, but Homi does it. The place is really plain but the food is what brings you in...and will bring you back.A friend and I ate lunch here--shared a plate of green enchiladas with carnitas ($11.50) and a plate of carne asada tacos (3 tacos for $7.50.) The sauce on the enchiladas was make-your-toes-curl spicy. They were really good but I might get something different next time...like the tacos! They're simple but just delicious. We finished ours and I craved more.I've been back for a second visit, and service is the issue that keeps me from giving the place five stars. The waitress who's been there both times is a little slow and I've had to ask multiple times for things like more water, an extra plate for my granddaughter, or some silverware.The menu is really extensive so it will take a few more visits to decide what I like best."], ["Rhea S.", "Food was meh. Nothing caught my interest. In addition they screwed up one of our orders and then forgot the rice and beans with our dishes. They came out later, but they were cold and so mushy. No thanks."], ["Veronica O.", "I just read Amy K's 3.13.14 review and it's obvious other than \"learning to speak Spanish...she has zero context about the culture. Marketing, branding and lush surroundings do not make a great restaurant. Mole is made to order and anyone who has cooked or learned to cook would know this. IN addition, there are many things which you could have had either vegan or vegetarian and modifying your desires without actually looking at the menu (over 15 choices for veggies) is actually speaking more about your obvious stereotypical ordering of enchiladas.Ensalada de cactus, flautas de papa y arroz con frijoles --- totally vegetarian and without cheese the salad is vegan.Why would you get refill on a 32 or 16 oz glass of Horchata no one in the Latin food scene does that NOT even Gringolandia loved Chipotle. step back Never ceases to amaze me the white girl who studies Spanish only to order margaritas in a Mexican restaurant which typically is not the case in most restaurants.In addition whether it is Trieu Chau or Ngon Bistro the staff usually eats in the dining room; the fact you mentioned this says more about your obvious class issues and your need to be a stereotypical anglo tourist in my culture. step back and bow downLa Negra Negrita de mis pesares,ojos de papel volando.Negrita de mis pesares,ojos de papel volando.A todos diles que sípero no les digas cuándo.Así me dijiste a mí;por eso vivo penando.¿Cuándo me traes a mi negra?Que la quiero ver aquícon su rebozo de sedaque le traje de Tepic.¿Cuándo me traes a mi negra?Que la quiero ver aquícon su rebozo de sedaque le traje de Tepic.Mariachi Vargas de Tecalitlan I am leaving the country. I am 100% Mexican born in NorCal, raised in Houston Texas and Peoria, IL. I danced folklorica till was 16 and especially to the song above. This is what was playing in my head when I was eating my food.I immediately loved how simple the space was. I never trust a place with Talavera pottery tiles from D.F. or ornate or ugly murals. I trust my palate. The bases of the mother sauces of mole, salsa verde and enchilada sauce (de cualquier). Chiles; dried and fresh, seeds (pumpkin and sesame), ginger (dried and fresh), chocolate Mayordomo, cumin (seed and ground), epazote, Mexican oregano, Mexican vanilla, Mexican cinnamon and so many other spices.The caldo, menudo and posole bases are key too as they have the same complexity of the flavors which are required by certain proteins to possess the key sabores Mejicanos! Similar to the soul food of other major Asian soup entrees such as pho, udon or ramen...menudos y caldos are just as ingredient intensive.Horchata was think, sweetened nicely and the fresh canela a mano...de Mexico was surreal as I felt I was in San Juan de Dios in Guadalajara, having a glass while stopping to rest from shopping.Sopes. Are simple in presentation but, the technique and preparation for these heavenly earthy masa cakes is not. In addition to the cake having to possess the right amount of stiffness to maintain the tower of ingredients...they have to be bite friendly and strong. Hortencia achieved it. She was right on. Hortencia is the H-O in HOMI...she is the heart and soul. Her smile as she came to say hello was exceptional.She also came to the table and spoke to us, personally. She told us about the menudo preparation as our food did take 45 minutes but, it was worth the wait. We ate like Europeans leisurely y sin prisa! (no rushing) At my house dinner is on Mexican time, it says 7pm on the Evite but I run 30-45 mins late b/c my friends are fully aware that my food takes time.This is the same expectation.So, you are not lowering your expectations by choosing to come to a simple, non-descript authentic Mexican place. And don't be stereotypical Gringo/guero/guera and order enchiladas and tacos. Order a rich and complex dish. Order chiles rellenos, menudo, caldo de borrego...go beyond the stereotypes. Mexicans don't eat steak tacos everyday or fajEYEtas. We don't drink margaritas everyday or Corona. I know right? Colonization of the other through food is bad but, exploring a culture through authentic dishes and through the honesty which is the New American entrepreneurial condition is awesome!Thank you Hortencia for making my MSP farewell food tour so incrivel! Besos mi negra! Veronica"], ["Amy K.", "To Veronica O and a general update to not sound so \"anglo uneducated.\"Your detailed review is admirable but sterotyping is not. I am not a simple minded anglo guerra tourist with class issues and no concept of Mexican culture. Ive studied in Puerto Vallarta, my in laws live in Guerrero, mis sobrinos y cuinados son latinos, I worked and lived with mi banda de latinos en Miami and Wisconsin and my mother in law who cooks at a telescundaria has shared incredible recipes with me for mole, ceviche, tacos de papas, ensalada de cacto, chille rellenos, etc that I cook often. The man I went to Homi with was born and raised in Mexico and our friends own a minor thrills atmosphere, known for the food, eat along side your guests Mexican restaurant that does not market or advertise but still thrives.We love enmoladas de Mole, so we went to Homi just for that. On any given day, as reccomended, I too would go for a rich off the grid dish, but we went for the enchiladas de mole as thats what the reviews raved about. A server who can multitask and take a seat to eat and chat among their guests is a true gem, unfortunently we didnt experience that here, we were nearly ignored. The refills we didnt get were for water not the huge glasses of horrachata, and a fresh tamarind Margarita can be as traditional for some as jalepenos are to salsa. No bar, no biggie if the atmosphere is welcoming, and the food is good, but it wasnt for us.Maybe we went to Homi on an off day, especially considering some of the raving reviews, and I apologize if my review came across anglo angry, tacky tourist like. To Veronica, in your reviews you seem intelligent, flavorful and full of foodie fun, your review of mine wasnt, in my opinion, tastefully simple.To those who are still reading this that are seeking out Homi, Go check it out! Dont let my prior review stop you. Homi has AMAZING HORRACHATA and an owner who I wish I could have met from the phenomenal reviews of her. Sounds like theyve got an extensive menu and if you do end up waiting enjoy the telenovelas because they are addicting. Find what you like not what others do! ¡Desaya que tengas buen dia!"], ["Abulous F.", "Yes! This place! Small, clean, friendly. Lots of veg options and everything is made fresh. We got the Chilaquiles Verde which had a touch too much spice for my dining partner but I thought were perfect, (the Rojas are more mild). Fresh, simple guacamole with a tasty salsa on the side and Sopes. I will be going back for more Chilaquiles very soon!"], ["Kite W.", "I got a chicken quesadilla and a chicken burrito, 30 minutes before they closed.  I originally ordered steak from the list of fillings, but my waitress said the steak filling was $2 extra on top of the price, even though there was no mention of that on the menu.  Adding mozzarella cheese to the burrito was listed as $1 extra.The burrito was about 35% bigger than a Chipotle burrito, but the ingredients weren't as fresh.  Seemed like my tomatoes were sliced in the morning, not this evening.  The burrito was served just a little bit warm and not hot at all.  For a hole-in-the-wall place, the prices seemed quite high.My quesadilla was a little greasy and a little over cooked, but good.Service was tolerable, but not what I would define as friendly or upbeat.The only other people there included a young boy who screamed every 15 seconds, for fun, loud enough to hurt my ears, for several minutes.  The boy was not upset, he was screaming just for fun.  Instead of being considerate by taking the kid outside if he refused to stop screaming, his mom, who weighed around 300lbs, just smiled and told the boy to stop, while encouraging him at the same time.  The kid continued for another 20 screams or so.  I said nothing.All in all, not particularly bad or good."], ["Brittney P.", "Their salsa verde is really, really good. I want it on everything, wow!This is a tiny, hole-in-the-wall Mexican restaurant, and I love it for that. It's a small, family-owned establishment with a small seating area and never more than one or two waitstaff and what I assume is a one or two person staff in the kitchen. Everything is made from scratch, so keep in mind the number of staff and the time to prepare from scratch meals. I've always been happy with my food and service.The food does seem a little pricey, for two of us to each get an entree it's always $30, which is more than we really want to spend at go-to lunch spot. The portions are huge though. I always get the chilaquiles with salsa verde, which won't keep for leftovers, maybe I should get enchiladas or something else with the salsa verde that I could save as leftovers for the next day."], ["James L.", "Twilight ZoneThis was an odd experience, and we're not likely to ever visit Homi's again.  You can believe me or not when I say I know Mexican food.  This place was, again, odd and extremely overpriced.  It's a hole-in-the-wall near a decades-old steakhouse, which we wished we had eaten at after our meal.  Now, I love hole-in-the-wall places and mom and pop restaurants.  Homi's was a visit to the Twilight Zone.  Our food took a long time -- OK, everything is prepared from scratch.  The place, while not filthy, is not very clean.The food (plate of enchiladas and a plate of chicken fajitas) was not very flavorful.  After a few bites, I realized that there was little garlic, cumin, or any other seasoning in the fajitas.  The tortillas, while almost handmade-looking, had an acrid smell.  We spent much longer than anticipated, even though we and one man were the only diners.  Having not seen the prices in the menu, I was floored when the bill came.  For these two entrees, a tea, a watery horchata, guacamole (which was very good), and chips, our total was $38.00!  Our old taqueria in San Antonio would have cost about half that or less.  For that price, we could have had a king's banquet at any Vietnamese restaurant down the street.We got in the car, and all I could do was laugh.  How could a simple lunch have cost $38.00?  Was there a mix-up on the bill?  Did we get charged for four entrees instead of two?  Do very narrow tortilla chips cost the restaurant dollars per basket?  Evidently, no to the last three questions.  As we left, we drove past the Best Steak House on the corner.  Their window sign said, \"Steak $12.88.\"  Live and learn."], ["Ahmad R.", "This place was great. I had the guacamole and mole enchiladas combo. Loved it. It was extremely slow. There was only one server (the owner and master recipe maker) who was working very hard, apparently also cooking, but she was nice. There is a sign mentioning they make all their food from \"scrach\" and it will take some time, so just don't come here in a rush."]], "Barrio": [], "El Pueblito Tacos": [], "La Cucaracha Mexican Restaurante": [], "Tavial Grill": [["Jess M.", "I love this place! It's so nice to see a family-owned restaurant open here. It looks kind of like a chain from the outside, so I wasn't expecting much, but...This place is so, so good. Don't let the exterior fool you. The chicken and cheek meat tacos are my favorite, and at less than $2 each they're a steal. Also, the burritos are just as big as Chipotle's, but tastier and cheaper. There's this great creamy green salsa sauce that comes with the food, and it's soo good. For those who like spice, there's also a hot chipotle salsa that comes with everything.Every time I've been in here the service is fantastic and friendly. The owner has cooked our food and his kids are there to ring me up and serve. It's just a wonderful overall experience."], ["Jason Y.", "Good Mexican food and reasonable prices with a nice overall menu selection.  The service is fast and friendly.  I have been here a few times and I like the food.  Try this place if you're in the area.  Good for lunch or a quick dinner.  Takeout is my choice here..."], ["Emily H.", "Muy bueno. Hands down the best tacos in the Twin Cities. I cant order anything other than their Mexi-style street tacos. Tortillas, meat, onion, cilantro, and salsa. The al pastor and carne asada are my favorite. They're absolutely fantastic, hope they stick around. Their hot salsa is impeccable. Lastly, the owner is an awesome guy and it is always nice to talk to someone who knows their tacos."], ["Dianna N.", "Had to order extra tacos for lunch the next day. As we left there was a van behind us swerving and kept turning his signal on. We thought it was a drunk driver, but it turned out to be the cook. He flagged us down, because I forgot my 2 extra tacos. What great service! Fantastically awesome!"], ["Kris G.", "Love! Love! Love! I love this place! The prices are low, place is clean, staff is friendly and food is awesome! I love the asada and the chicken tacos. They are flavorful. The tamales are big and not dry. The chips are always on point and the guac and sauces are awesome! This is a great diamond in the rough!"], ["Karey M.", "Outstanding service!!!!  Outstanding authentic Mexican!!! Clean!!! Yum!!!! The darling owner has a return patron in me!!"], ["Ice C.", "Everything I've tried here is great. One particular item that was weird but amazing was the choriqueso. I'd describe it as a chorizo/onion omelet made with cheese. Like no egg, the \"egg\" was cheese. I hope that description makes sense! I wish I had taken a picture. Weird but decadent and wondeful! Great addition to the neighborhood!"], ["Ben C.", "Amazing Mexican food! I was looking for some good burritos and I found this place on yelp with great reviews and I can only add to the heaping number of 5 star reviews. Huge burritos, extremely friendly owner, great tasting, and cheap! What else more could you ask for? The restaurant is clean, and the wait is short! The employees go out of their way to help customers. I'll definitely be back"], ["Justin S.", "I went to this place because the reviews were unbelievable.  I am not a guru when it comes to Mexican food but mostly because it all tastes the same in other places, not this one....This place delivered on all accounts.  Customer service was great.  Cool kid behind the counter that appears to be family and was good at letting me know what was best.  Ended up getting the asada nachos and the asada burrito. Way too much food but tasted  amazing and I didn't want to stop eating it!!  You can get by with only one as portions are pretty big and price is right.  Definitely will frequent this gem."], ["David B.", "I stopped in on a weeknight and wanted some simple steak tacos. The tacos here were fantastic. Delicious steak with cilantro and onions, plus some refried beans and rice on the side. I'm so glad there's a place so close to me with such good Mexican food. And the service was top notch."], ["Sabrina F.", "Great food, very friendly and welcoming staff, great prices!   I really can't say enough good things about this place.    You can tell that the owner is very passionate about his food and that always makes for a great experience.   Tried the Enchilada entree and it was delicious (and probably enough food for two people!)    The guacamole is fresh and fantastic.   I am looking forward to the next visit where I plan to pick up some to-go Tacos and Nachos and head over to the Summit Tap Room."], ["Zach M.", "As others have said, not appealing from the outside but this place serves up awesomely tasty and authentic mexican food. I work nearby so I decided to give it a try. It's not the proximity that keeps me coming back, it's the food quality!"], ["Matt R.", "Bored of the same dining options? Check this place out. Good food, cheap and authentic. Myself and 2 other people went to eat there one night after reading reviews on yelp and was not disappointed. We each got a burrito and split an order of chips and salsa. We paid about $22 for all of it and it was the best money I've spent in a long while. Will be going back and have been telling everyone about it!"], ["Cassie J.", "After all of the very positive reviews for Tavial I was hoping / wishing for something better. Living with a man from Southern California, we're always searching for authentic Mexican in the Twin Cities. While the food was decent and there were some authentic ingredients it just didn't live up to expectations. If you're wanting a slightly better than chipotle burrito, you won't be disappointed."], ["Rita P.", "This place was pretty great for meat lovers!  They have very limited vegetarian options, otherwise I would have given it 5 stars.  The corn tortilla for the tacos were very tasty!"], ["Grace G.", "This place is amazingly good. The food is delicious, and the atmosphere is simple and upbeat. We came close to closing and  they didn't even seem to mind. We ordered all the tacos. The cabeza (cheek) and linga (beef tongue) are SO good. The pork tacos are divine. Make sure to get both green and red sauce. Did I mention it's dirt cheap? Their chicken enchilada could feed two ppl. I'm in heaven. Perfect for takeout or better sitting there and enjoying it hot. Best authentic Mexican I've had in a long time."], ["Sofia G.", "It's so nice to have a mexican restarant in the area and the food its sooooo good very addicting !!!! Great service"], ["Thomas H.", "Awesome in every way"], ["Kristin N.", "A friend and I met here for lunch a couple of weeks ago, and I will definitely be back.I tried the cheek meat and carne asada tacos, as well as the chips and guacamole. The tacos came with a two different salsas both of which were amazing. Everything tasted fresh and delicious. In addition to the food being awesome, the service was also fantastic. Various family members were working behind the counter, and they all seemed genuinely happy we were there. The owner came out to visit with us and ask how we liked out meal. Definitely a different experience from a fast food chain with a stoned teenager ringing you up.I love the fact that they do take out, and the owner mentioned to us that he wants to add delivery service as well. All in all, a great addition to the neighborhood."], ["Ron L.", "My son and I went their before the Rush concert last night. Victor and his family deserve your business, based on the quality and flavor of the food and his love for cooking. I got the impression that Victor is living the American Dream of becoming a restauranteur..and will succeed based on what he is serving...Go there!"], ["Nichole C.", "This place definitely deserves the high ratings that it gets. I stopped in for lunch when I was in the area for work. I ordered a chicken taco and a pastor (marinated pork) taco. Both were delicious, with just the right amount of filling and flavor. I checked out the rest of the menu and found that they have a pretty big selection that would please even picky children. They have fries, cheese curds, quesadillas, and chicken wings. Great service as well. I will definitely be bringing the rest of my family here soon."], ["Gina C.", "I was not planning on partaking in a taco, but when I had some time to kill I popped in. My friend's business is a few doors down on West Seventh and she had sung praises for this place previously. So, I walk in and there is a huge table of people, one person for take-out and A gentlman ordering desert. I ordered a chicken taco and a side of rice. (Really nice staff) A pleasant young man brought out my food. I think this a small family business. Anyways, I opened up my taco and to my surprise, it was asada! (steak). It looked so good  I ate it anyways. the gentleman came out and told me he was sorry and then he brought me out a chicken taco! Yum. The tacos were the real thing. The rice was good. The sauces they provided were off the hook. As I was leaving  I thanked him and he mentioned that on Saturdays, he makes homemade tamales. I am going to go out of my way to get back here on a Saturday! Lovely people, lovely food."], ["Scott W.", "I'm a Southern California native, so I'm used to good Mexican food. I've been in The Cities for over 3 years now and still haven't found a go-to Mexican food place. My search is over!! Tavial Grill es FANTASTICO!! The carne asada burrito was delicious and the red salsa was amazing! Flavorful and hot, buy not melt-your-face-off hot. Now if I can just talk the chef into making a California burrito..."], ["Betsy F.", "Great family owned AUTHENTIC place.  Where else can you get tongue and cheek?  And I mean tacos!  The tongue burrito was wonderful and the salsa was hot hot hot!"], ["Raj P.", "This place has 5 stars written all over. One of the best Mexican places I been to recently. Food is very fresh, very generous portions and perfect proportion of ingredients. Fell in love with this place and will be going there again. Try Jarrito tamarind drink! You will like it. Very good customer service! Don't let the small size fool you!"], ["Waris H.", "We were driving by and decided to check out the place for late lunch. It was a good decision. My wife had the Tacos and I had the chicken Quesadilla with Cilantro added added by special request. The Quesadilla was excellent and reminded me of one I had several years back in California. The place was very clean and food showed up quickly.  Highly recommended."], ["Pat B.", "AMAZING and flavorful Mexican food made by friendly people who clearly know what they're doing. They are willing to please anyone that comes in the door...they have some non-Mexican fare available too, along with kids options. They clearly want nothing more than to cook really good food for you. Happy to have a place like this in the neighborhood!"]], "Fiesta Cancun Mexican Grill & Bar": [["Debbie R.", "Very good 7 of us had range of food and drink. Wonderful \"Texas\" margarita. Tasty food served well"], ["Suzanne N.", "Went here last night to try it out. The menu is huge, almost overwhelming. My husband and our friends had their margaritas---they commented that they were good, not outstanding but good. I had something called a alambre--it was flour tortillas on the bottom with peppers, onions and meat on top with melted cheese. It was very good, the portion was huge, only ate half. Our friends had enchiladas and a burrito-type thing without the tortilla, both liked their entrees. Husband had fajitas which he enjoyed also. The service was excellent as well. Overall I would come back again."], ["Clarice R.", "Where to start. The food was very good, I reccomend to get something with chicken. However, the music and people are rather loud so the waiters can't hear your orders at first. The waitstaff are enthusiastic and perky."], ["Angie K.", "The food is amazing!  The portions are huge, I usually order the chicken fajitas and get three to four meals out of it.  The price is excellent for the portions!  The staff is great, they all jump in and do what is needed at the time.  They are very friendly and always have a smile on their face.  This is my fifth time there and I have never been disappointed!"], ["Larry T.", "We had waited several weeks for this to open, but sorry to say after trying once, will probably not try it again. I would like to list positives and negatives, but unfortunately, it was mostly negative. The silverware was dirty, the food arrived on an extremely hot plate but the meat inside the burrito was barely warm (how can that be?), the food was average at the best, the windows next to our booth in the bar were very dirty. Overall, not a good experience and there other Mexican options in the area that are superior"], ["Gigi G.", "I have eaten at this restaurant twice and both times ordered different entrees, both times food was great!!! I will continue to frequent this restaurant, wait staff is very friendly, polite and attentive."], ["Jill S.", "I was excited to try Fiesta Cancun in Eagan since the location in Brooklyn Park received good reviews.  We started with the chips and salsa.  Chips were standard and the salsa was good... not too mild.  My boyfriend had a frozen margarita and I had a tap Negro Modelo.  Beer was very good (never had this brand on tap before), but the margarita looked like it had green food coloring in it!  Other than that it tasted okay.  We ordered guacamole... this is where it got bad.   It didn't even look like guacamole!  I think it was mixed with sour cream or something else as a filler!  Looked like pistachio pudding to me!   The food wasn't much better.  We order vegetarian.  It seems like Mexican restaurants just add a veg section as an afterthought.  My plate had a white nacho cheese sauce poured over it on a yellow plate.  No lettuce, tomatoes, beans or anything to add color.  Very boring looking.  Why are most Mexican restaurants using cheese sauce now rather than real cheese?!  I'd rather pay $1-2 more for an entrée with real cheese!  I might give this place one more try since it's fairly close by.  I wish they served real guacamole!"]], "La Loma Tamales": [], "El Burrito Mercado": [["BK J.", "This is a review of the grocery part of EBM, not the restaurant side of it.I had a deal coupon and the weather finally stopped crapping on the Twin Cities so across the river I went.  Not being native to the Twin Cities and having lived on the west metro/suburban side I had not been anywhere near Cesar Chavez Blvd.  I knew there were a concentration of Mexican restaurants/stores/taquerias in the area so I was looking forward to the trip.After checking out the location on online maps (both google and bing) I opted to hit downtown St. Paul and cross the river at Wabasha which turns into Cesar Chavez when Wabasha turns south after passing by the river bridge.  I was amazed at how close EBM is to downtown StP.Once I found EBM I parked and went inside.  I have to say this is one extremely clean and well maintained store.  Granted most of the grocery items are packed in containers that are only in Spanish, but it is not that hard to look at a product and figure out what it is.  Unlike some ethnic food stores with meat counters, EBM does not have any off odors, or any odors to speak of.  This is really a place that is concerned with maintaining cleanliness.The aisles are well marked in both Spanish and English.  I ran over to the grab and go and topped off my basket with a half dozen tamales which are chilling in my fridge before I heat and eat them tomorrow.  Nice selection of tamales, but I was sorry to not find any Oaxacan tamales in banana leaves.Staff are friendly and love to help you out if you ask.  The cashier at the check out counter was fast and efficient and made sure I had not forgotten anything I might need.I was intrigued by the offerings on the restaurant/grab and go side of the store.  These offerings will bring me back, and soon, I hope!"], ["Sandy G.", "Up until yesterday, I would have rated this place four stars. We get our prepared masa here for the traditional Christmas tamales and it had been great. Something was wrong with our masa this year and sadly, you don't know it until your tamales are on the stove top. So, four days of cooking, seasoning, shredding meat and then a whole day of tamale assembly for naught. We have four dozen sub-par tamales to the tune of about $45.00 for the two bags of masa alone. And then the meat cost  is also a wash. Thanks, Mercado, from now I have to make my own masa says the hubby. Hell no!  Now what will my family have to unwrap Christmas morning?"], ["Patty R.", "Love the atmosphere of this place! You can find pretty much any latino product you can't find at a local grocery store. Besides that, the food is authentic! We had the carne asada burrito and supreme nachos. Both equally as good. I Highly recommend big you're looking for real authentic tasting Mexican food. Although they do have pupusas too!"], ["Kathy M.", "Food was good but service was not to good only if you are \" white\" they will be nice to you the person in the cook line give me attitude but the person before they were nice and patience and the cafe waitress never came to me if I need something only to the american customers Hispanic customer are important too!!!!"], ["Emily S.", "I am shocked that this place has such a high rating. The market is pretty robust and impressive, but the food is NOT good. I will not eat here at the restaurant again because it lacks flavor and is NOT authentic. I knew it was going to be trouble when the waiter poured our chips from a bag. Honestly, these \"authentic\" chips tasted and looked like Tostitos. The chips alone made us want to leave, but not wanting to be rude we stuck it out. Long story short, we shouldn't have. We should have just left. My boyfriend's carnitas was dry and flavorless. My gorditas didn't have much flavor, either. Everything was just disappointing and tasted like it came from a big Mexican chain restaurant.I'm fairly certain the only reason this place has such a high rating is due to the large variety of options in the attached grocery store. If you want real, authentic Mexican skip this place and head for Las Teresitas or Homi Mexican. For a good Mexican market, check out Andale in Bloomington (this smaller market also has food next door that's better than El Burrito Mercado).I won't go here for Mexican food again."], ["Jessica S.", "This was our first visit back in many years and we did not see the back seating area until after ordering our food.  We were told we could sit there, then told it was for alcohol drinkers only, and not invited to purchase alcohol. It was very disappointing and although their food is always great, service like this makes me question why I would want to return."], ["Stephanie C.", "I haven't been here since I moved to Minneapolis from St. Paul, but I remember it being awesome. Very authentic and fresh."], ["Beth J.", "Hands down some of the best Mexican food in the twin cities! I've frequented the Mercado several times enjoying food from the authentic street food on the patio, fast-casual in the cafeteria line, and relaxed sit down environment in the dining room, and I've never once been disappointed!Located on the primarily Hispanic lower west side of St. Paul, Burrito Mercado is an authentic Mexican grocery store and restaurant, principally frequented by natives. The friendly, informed bi-lingual employees are egger to describe the food and offer their authentic opinion. In the cafeteria line, there is a choice of all the Mexican favorites - tacos, enchiladas, fajitas, tamales, etc - assembled quickly infront of you. The best things to order in the cafeteria line are the masa entrées (tacos, sopas, gorditas, etc.), where the house-made masa is paired with your choice of tasty, authentic protein options. The rich, complex flavor of the 26 ingredient mole sauce, reminiscent of the type of sauce a Mexican grandmother slaved over for days, makes the chicken mole the top protein choice. Soo good! Also, the hardy pork and potatoes in scrumptious, spicy green sauce are another magnificent choice. Finally, one can accessorize their entrée with an variety of genuine garnishments like house made salsas, cojita cheese, mexican crèma.  All in all, I love this place. With the variety of dining options and choices, I could eat here every day!"], ["Sal G.", "I come here for take home products.   Fresh items from the deli and fridge case in the back, all ready to eat.  Everything is of good quality and flavor and fresh with no preservatives.  I have never eaten in the restaurant.  But a fun Mexican atmosphere."], ["Steve S.", "check out the bars happy hour."], ["Sue S.", "We really liked this Mexican market/carnisserie/cafe. We stopped by on a weekend in the hopes of finding barbacoa, and we found exactly that. They had lots of meat from carnitas to the barbacoa available by the pound in a hot bar. We also ate lunch at the little cafe portion of the store, having some really good sopas and enchiladas. The food was very traditional, with super tasty Mexican rice and beans on the side of each plate. They had a lot of things we like when we can get them like horchata and a bar with pickled veggies and sides that you could serve yourself. We also stopped at the meat counter and picked up some arrachera meat to take home and prepare later.The produce selection was good and at typical Mexican market prices. Limes were six for $1 and avocadoes were 99 cents. I don't know what it is, but I always feel like the quality of produce at these markets is so much better than traditional stores (where you pay twice the price!). They also had some of our favorites, including El Milagro corn tortillas. Mmmm, just a great stop for dining in or taking items home for later. Sure we'll be back.Private parking lot behind the building."], ["Kellye K.", "Maybe I've just been spoiled by the SO's family's cooking, but I'm not incredibly impressed with the actual restaurant portion of the Mercado. The ingredients aren't particularly fresh, and the portions are too big. Strange that I, an American, would say that, but they are. Based on the amount of food you get for the cost, the food itself is a great deal. El Burrito Mercado is basically Mexican fast food. It's only the fact that it's one of the few Mexican restaurants here that makes it so special.I'll be back because it's one of the few restaurants near my office. The enchiladas con salsa verde y crema (in the refrigerated grab & go section) are delicious, though. Also, Mexican Coke. And pan con crema."], ["Allison F.", "Fantastic food, very friendly staff and great deals!"], ["Manu K.", "The best mexican food i ever had!!I took a burrito platter... and asked for chicken (spicy)..YUMMM...it was sooo good... A good place to try.."], ["Aaron G.", "Elotes in the late summer!!! So fantastic I am speechless!!"], ["Jana C.", "The only factor keeping this review from being a 5 for an almuerzo that was both  fabuloso and sabroso is the chicken! That darned chicken breast was just dry, no matter what kind of sauce has soaked its way through the pollo's mitochondria!Restaurant only continued filling up from 1100 onward on a great, warm, sunny, and charmed day in St. Paul. Very cool addition to the south of the store, which doubles both as a market, bodega, and a cafeteria. I desired the charm of a sit-down lunch, and the ambiance was alluring--esp. Mexican tile. I've lived in a home whose kitchen was paved with such marvelous artistry.Having gotten a great deal online, I decided to splurge for lunch, as I had a suite room which included both a fridge and microwave. I'm decently skilled at delineating tortillas autenticas, hecho de maiz. I commented to the nice gal in the one of the languages that qualifies me as a polyglot that I felt those corn tortillas were one of the best I have ever eaten!!! She heartily agreed, though I joked that her waistline was offering clues that she was being mendacious (try size zero).Actually, come to think of it, those chips and salsa were pretty darned excellent too, leading me to my personal edict: ANY CORN DERIVATIVE OFFERING HERE JUST ROCKS. There; that was more accurate...(surprised I couldn't hear those maiz-laden doughballs against a stone getting tenderized by being slapped silly by an abuelita in the back)Beautifully done, the quesadillas con carne asada. I'm not usually partial to mexican rice, but the pairing of the fresh diced tomatoes together with the fresh aguacate made me mix it all up and savor my side. I tried the gordita de puerco and also the sope de pollo. Ehh on the chicken, but thumbs WAAAAAY up on the pork. Mexican pork is always shred-from-the-touch-of-the-fork tender and soft.... so wonderfully delicious. Fan, fan fan, fan.... especially since Wabasha becomes Cesar Chavez once crossing over the Mississippi River, and the charm between the two sharply contrasting areas adds all the more to the experience. It was so beautiful out, I walked off the lunch by crossing the bridge as a pedestrian and walking over to the Science Museum on Riverplace.Nicely done."], ["Samreen S.", "Authenticity at its best - food is delicious! Absolutely love the grocery section too."], ["Michael M.", "As a hispanic So.. California transplant to the mid west I am so gratefull to have found this place...Its like my grandmas are both back in the kitchen cooking for me...If you want truly authentic Mexican food this is it..."], ["Tom J.", "This is a great spot for authentic Mex  a bit on the high price  side but worth itTry the roast  corn in the summer"], ["Deb M.", "Don't understand the high ratings. This place has some of the most dull and flavorless Mexican food I've ever tasted. My torta was supposed to be spicy - no spice at all, in fact I found myself reaching for the salt shaker. But then, at the deli I asked for mild salsa to bring home, and ended up with $6 of salsa that is so spicy nobody in my house will eat it. (And my husband LOVES spicy) Also I thought it strange and quite annoying that there were no prices displayed at the deli. All in all, would not eat here again, just perhaps come back to try something from the meat counter."], ["Patrick H.", "Going to Mercado for a late \"breakfast\" has become something of a tradition for me & my girlfriend. I usually get the huarache platter (grande, kids), & one of a variety of interesting bottled drinks to wash it down. It's a large serving of food, but not too large, & the flavors are really solid. Midwesterners need not fear; spice levels in the dishes are moderate, but a range of salsas are available for those of us with higher tolerances.Afterwards, I usually do some shopping in the grocery store proper. Although I'm a local/natural food type guy, the grocery at Burrito Mercado has a lot to offer. I've really taken to their bakery section, as I enjoy the emphasis on drier, flakier pastries, instead of the overly-sweet/sticky varieties typically available at most stores. Like yourself some beans? Mercado has a dizzying array to choose from, in canned & dry formats. They also offer homemade chips & tortillas (including doughs to make your own at home), & a fairly solid selection of fresh meats, cheeses, fruits, & vegetables associated with Central American cuisines. Obscure (to most North Americans, anyway) spices, too.It's nice to have a good, solid meal & leave with groceries for another one later in the week!"], ["Jennifer R.", "I enjoy a nice, well-stocked mercado, and this is definitely one of those places. It's so much fun to poke through the aisles and find things you'd never see at your friendly neighborhood Cub. But this is better than your average neighborhood Latin market: the deli counter is huge, with salsas, empanadas, different kinds of guacamole, and a big steaming tray of carnitas.Now if you're like me, you can't be near hot carnitas for any length of time without your mouth filling with drool. You gotta eat--now. And here, you can! There's a cafe area where you can just order at the counter and then tuck into your burrito (or whatever), or there's a little sit-down restaurant in the corner where you can even wash down your yummies with a cold cerveza.When we went on a Sunday afternoon, the little sit-down restaurant was pretty quiet, but the service was still fairly decent. I had the carnitas (of course), and they were decent. The husband enjoyed a plate of ancho chicken enchiladas, which were a little spicy for his taste (but, hey, ketchup is sometimes spicy for his taste).We'll definitely be back, but we'll probably stick with the little deli/cafe area in the future.Oh, and hey! We spotted a current deal on those carnitas. If you get 4 pounds of them (they're about $6/lb), you get free tortillas and salsa. There's your no-brainer family meal, ready to go! You're welcome."], ["Ben G.", "I continue to be a fan, and a loyal customer. After leaving a negative review last week, based on one negative experience (my only one in a decade of being a loyal customer), in which we were treated unfairly by a server, the owners reached out to listen to my complaint (which probably should've been filed with them directly rather than here on Yelp). Really love this place."], ["Lindsay F.", "Over the course of writing this review, I have changed the number of stars from 4 to 5 back to 4 and then back to five again several times.  Perhaps it is because as I simply think of the food and write the name, those higher centers of thought process and control in my brain are making me salivate.  From the mere thought of the food. The place is consistent, quick, and the food is delicious.Is it fine dining? No.  Is it 120 % authentic.  Close to it. Is it absolutely delicious with layers and layers of flavor and satisfies any rumblings of your stomach at a nice easy price?  Oh yes.My favorite thing to get is the plato de tamales.  But the especialidades del dia are great too.  Wash it down with Jarritos, cane sugar not the fabricated kind, and you are good to go!"], ["Fernando C.", "I'd love to go back - if you were paying.It was Taco Thursday which meant 99¢ tacos so I dove right in. I ordered 3 Asada and 3 Carnitas. Not impressed.The Asada had no real flavor to it. Just a slab of sirloin chopped in bite-size pieces. I added extra salsa and lime but all that gave me was the bubble-guts. NO Bueno!The Carnitas were descent. I haven't had great Carnitas in a while so at this point I'll take any you put in front of me. They were a bit tasteless and not chewy and juicy like they should be. But I have to admit that after I added lime  and a tad of salt, they tasted better than the Asada tacos - by a mile.The service was mediocre but I didn't care much, what can you expect from a gal with a hairnet who had about half a bottle of Aqua Net holding it slick back? Not Much right? Right!Salud!"], ["Linda H.", "The last time I was in this place (about 15 years ago) it was teeny tiny and it was just a restaurant, they sold nothing else. I didn't really know what I ordered last time and I still wasn't so sure this time either as far as what meat I picked but back then it was yummy and it still is! When you walk into this place, its as if you are walking into a grocery store similar to what you would expect in Mexico. Its super fun to shop here for Mexican food as well as other items. You can eat either at the cafeteria style cafe or you can go to the restaurant side. I do not see any reason why you would go to the restaurant side except you get your food delivered to you instead of prepared in front of you. I wanted to order the sopas because the man in front of me ordered them and I had a strategy this time, I was going to get exactly what he ordered since he seemed to know what he was doing. My plan failed, however, because they ran out of the little sopas so I opted for a burrito. I picked the pork meat (not sure what it was exactly) but it was really good. My daughter got the tamale platter. She thought they were OK but the masa was too thick which is exactly why I don't like tamales. She said she would not order the tamales again. The re fried beans were really good, the rice was OK. Next time I will order no rice. There was nothing spectacular about my burrito but the meat inside was really good. The deli is great, they have fresh salsas, chicarrones, churros, three milk cake, lots of yummy goodies. The people who work here, for the most part, seem rude to me but it might just be the language barrier. I never see them smile though, so not sure and they seem to be much more friendly with the Mexicans. I don't care though, I just go there to eat, not to socialize with the workers. Check this place out if you like good authentic Mexican food."], ["Christopher H.", "I think my only major complaint about El Burrito Mercado is that it's a long haul for me to drive over to St. Paul to enjoy one of my favorite breakfast spots.  My go to dish for breakfast is and always will be the chilaquiles.  For the uninitiated, chilaquiles start with deep fried stale corn tortillas.  They are then topped with your choice of red or green sauce.  Personally I always go with the green as I love the chicken in it but I'll have to try red one of these days.  You can optionally add crema and cheese, which I always do.  Finally, you get your choice of eggs or cecina with your chilaquiles.  I can't get enough of the cecina personally.  It's a lovely, very thin slice of cured beef that is just a bit salty.  Personally I've found that chilaquiles with cecina is a great hangover breakfast for me, though perhaps not for everyone since the green sauce is a bit spicy.I've tried their lunch options a few times, generally the taco platter.  I've always found those good but not great and certainly not in the same league as the chilaquiles.  That being said, I may have just picked meat options that weren't that exciting.  The market side is great as well.  I've picked up a number of things here for when I'm cooking mexican at home.  They also have a great deli selection with homemade salsas and other goodies.  I've had a few of the salsas and found them to be top notch.I'm thinking I'll go drinking tonight so I can have my hangover breakfast at El Burrito Mercado tomorrow."], ["Michael N.", "I'm having trouble rating this place because I've had two different experiences here.  The first time I ate on the cafeteria-style side of the store and it was pretty good.  I was hoping for breakfast but the lady said they just stopped serving it.  Anyway, I ordered an enchilada platter and it was pretty tasty and priced right.  From that experience, I'd give it 3 or 4 stars.  I returned recently and sat in the cafe section this time.  Service was terrible.  The waitress came to take our order and that was the last we saw of her until we finally flagged her down for our check.  Someone else brought our food out and refilled our chips.  My water was only half filled to begin the meal and it sat empty for 3/4 of our time there.  The food itself was alright but I don't get why they even have the cafe portion of the restaurant.  They should just have it all cafeteria-style if the service is this poor.  I had the gordita platter with pork and she had the beef fajitas. The grocery store and bakery both looked good but we didn't try anything.  I'll have to come back to try the tres leches.  I'll be sure to stick to the cafeteria side if I decide on food."], ["Lauren D.", "El Burrito Mercado was a very clean and well organized Mexican market. The neighborhood had several other Mexican shops and many signs were only in Spanish. The market had moderate to inexpensive prices that were clearly displayed. The market had several employees who were walking around the store providing assistance to customers. The store was large and had wide space aisles. The market featured a restaurant and a large prepared foods section. There was only one clearly labeled WIC-eligible item (Nuestro queso cheese). The market featured a good variety of fresh, attractive produce which included tomatoes, exotic fruits, onions, root vegetables, fresh herbs, and more. The market had a very small cereal section that only had a select number of cereals, which included Cheerios, Reese's Pieces, grits, and oatmeal. The market had a large selection of different candies and snack foods. El Burrito Mercado also offered many Mexican toys and decorations, including piñatas, Mexican BINGO, and dolls. I purchased a peanut marzipan candy (image on right) in a pack of six. The price was fair. The store keepers were friendly and attentive. The market was busy with many shoppers."], ["Dennis N.", "Really wondered what we got ourselves in to when we walked in the grocery part. There was a buffet line, not in English of course, and we almost left until we saw the sign that says \"sit down restaurant in back\" We were relieved and sat down. Not recognizing the items on the menu, I described what my burrito should be, and very quickly it showed up, Pork Burrito with all the trimmings..awesome. For dessert, we had the hazelnut chocolate cheesecake. Be forewarned, two people can eat that in one sitting---it is too rich, though we tried!"], ["Thomas C.", "Excelente!  Food was outstanding with every option I could imagine."], ["Jason K.", "My wife and I were out to see the George Washington exhibit in St. Paul and we had a gift certificate for $25 at El Burrito Mercado.The parking lot was crazy busy with people driving the wrong way, it was weird. The place is 3/4 grocery store with Mexican foods and a cool deli with homemade salsas and baked goods. It looked real yummy. Lots of burritos and other warm goods.They have tables you can eat at and serve yourself, or else towards the back is a sit down restaurant. It is a pretty cool setup. We headed to the back and sat down.I ordered a $2 Miller Genuine Draft , good deal and not bad for a light beer. They had a few items that looked great on the menu, but I opted for the Gorditas with chicken. My wife ordered the shrimp fajitas.We drank and talked for a few minute and then our meals came out. The fajita plate looked awesome with lots of big shrimp on it. They were juicy and the veggies were sweet as well. The corn tortillas looked awesome and my wife loved her meal.The gorditas were three round sandwiches with lots of shredded chicken. They were a little sloppy, but real tasty. I could have used a little more spices, but easily remedied with hot sauce.I ordered one more beer and with the gift cards it was $0.83, a solid restaurant with super good service. Tough to understand, but good service. A fun time. (The George Washington this was pretty cool too at The History Museum."], ["Michael G.", "The budget-conscious pleasures of El Burrito are many -- burritos the size of a baby's head with your choice 10 or so different meats; really tasty shrimp dishes for around $10; the best refired beans around; and authentic Mexican drinks.Plus you can take a little bit of Mexico home with you! In addition to the restaurant, there is an attached grocery store and meat market and deli!The deli salads are fabulous as is the corn bread. I used to make corn bread at home to go with chili but could never match the moistness and flavor of the EB corn bread so we just buy it -- for less than $1, you get a giant-size square!Forget your supermarket meat aisle! This is a real deal meat market where actual butchers break down sides of beef and process whole pigs. We love making soup at home and this is the place for bones and specialized cuts. The prices are very reasonable too!Summer Bonus: EB has a wood-fired corn-on-the-cob roaster near the back door! Perfectly roasted corn is brushed with butter, sour cream, queso cheese, and sprinkled with chili powder. Ay Curumba! $3/cob seems kinda pricey though..."], ["Karl H.", "First experience was not so great. Keep in mind we dinned in the cafe portion and not the cafeteria. I'm hoping to update my review more favorably when I go back and try the cafeteria section.The service was downright craptastic. It took forever to take our orders, granted we were starving but it must have been a good 15 min of waiting and it wasn't busy. The food didn't come out speedy either. I tried the carne asada which was a bland piece of meat barely worth the protein it gave me and the sopes platter. The sopes was also unspiced shredded steak on three less than spectacular corn bread circles with diced tomatoes, iceberg lettuce and what looked like Kraft Parmesan cheese. The sides were nothing worth eating, your normal low grade refried beans and tasteless rice.Normally after an experience like this I wouldn't think twice about going back but I've got to try the cafeteria. I guess I should have read my fellow yelper reviews more closely and went straight to the cafeteria to begin with. Hopefully a positive update to come soon..."], ["Phil A.", "SPECIALTY FOOD: BONE ENCHILADAS.  I had to first ever click to read the review guidelines.  That's how bad it was.  Oh awesome, \"Colorful language and imagery is fine, but...\"  This place was pure, unadulterated dogshit.  Being Spanish fluent w/a mom who lived in Guadalajara I love Mexican.  Boca Chica down the way was closed for a holiday so we went to El Caca Mercado to the restaurant side on Saturday mid-day.  Shitty-ass service, horrible service.  (Wow, I can use colorful language, thank God for this asswipe outfit I can.)  I had a real big-ass chicken bone in the enchilada, a wing bone.  Yes.  I showed the useless woman and she did NOTHING.  Me and 2 buddies got cold food.  Service slower than glaciers.  They charge for the chips by the way, is this place fucked-up or what?!  Charging for chips and then being cheap-ass fucks and not refilling.  Not cold beers.  All the tables' patrons were staring at each other at 2:30 p.m. on this Saturday wondering why they tried this place.  How in God's name did this place get so many stars, payola, kickbacks, relatives???  What a goddamn dump disguised as a rip-off.  AVOID.  Se necesita evitar este lugar siempre, vale verga.  Vale VERGA.  Huezo!?!  Cargas por nachos??!!!  Vale verga."], ["Amy R.", "They have some of the best tortilla chips, plain and seasoned. There is also a great variety of pastries.Prices are reasonable and service has always been great."], ["Chris W.", "My mouth waters just thinking about the food.  Food is always, always good I love their torta platter.  Go on weekends for fresh menudo.  Bakery is super good.  Cant say enough good things about the food."], ["Chris M.", "Note: my review is only for the cafeteria, I've not actually tried the sit down restaurant. As long as I've lived in St. Paul people have always been raving about this place - maybe it's just not my cup of tea, but I've never been overly impressed with the place. Everything has been pretty bland (perhaps I'm just ordering the wrong things) and I walk away with the feeling I've just been to a more authentic version of Chipotle. Some good things the place has going for it are the salsa bar, wide selection of meat choices and Coke with real sugar (not to digress, but it's pathetic that the absense of high-fructose corn syrup is something that's a treat in the States).All-in-all I suppose it's worth trying because of all the hype, but I never put it near the top of the list for dining options."], ["Tony L.", "Being from the Bay Area in CA I grew up with authentic Mexican food and mercados.  This place is heaven sent, the smells, the sights, the perfect tortilla chips.  Everything from the deli is fresh and tasty.  They have so much to choose from, meats and salsas.  I think they are way above everybody else on taste and service.  Always smiles and wonderful service.  I love the fact they have the best bagged chips ever, they should go national with them.  This place is worth the trip from anywhere to get great mexican cooking supplies or a fresh burrito from the deli.  Go try it.  They even do roasted corn on weekends, but they lose a star for using margarine instead of butter.  I ask for dry and buy butter in the store."], ["Carmelo W.", "I am not Hispanic but I am a bit Italian, so even though I couldn't understand anything the mariachi said to me, I still felt a strange ancestral psychic connection to the man that transcended our language barrier. That same feeling permeated my dinning experience. You see, this is food that feels old and comforting. Everything I tried was simply prepared and mostly unmolested by American influence. The tomatillo salsa was fiery and fresh tasting thanks to the generous amounts of cilantro, onion, habanero, and a dash of tequila. My tacos were nearly overflowing with beef that had been slowly cooked to the point where the fat and spices had homogenized into a delicious red concoction that flowed onto my forearms as I plowed them into my mouth. In short, this is fine food that is certainly worth a revisit."]], "Mañana Restaurant y Pupuseria": [], "Taqueria Los Paisanos": [["Teri S.", "Exceptional authentic tacos.... We had chicken, steak, and roasted pork, and every bite was delightful!"], ["Gina B.", "Wow, great lil hole in the wall Mexican place. We were using a coupon and we loved it. Burritos were nice size for the price. The pulled pork was amazing. The rice and beans were mediocre.  Staff was nice. The ambiance isn't anything to sing about but we didn't mind. It was clean for the most part."], ["Lisa L.", "Looking at the menu, awesome, they have beef head, lengua, and Caldo de Res! Not many cook the Caldo de Res. Excellent green sauce! We had a Carne asada burrito which was good and fresh but a little flavorless. Chorizo nachos were ok, fake nacho cheese. Carnitas taco was good! Tamale was good and so was Carne asada taco. Interesting and diverse clientele. No chips and salsa to order."], ["Melissa A.", "The tacos here are everything! The pollo, carne asada, al pastor and chorizo are great but I'm sure you can't go wrong with any of the options. Also the horchata was the perfect thing to wash things down."], ["Jaclyn L.", "The dive of authentic Mexican....I have been to lots of little Mexican owned spots with authentic dishes like here, but I would call this one the bottom of the barrel of those. This is authentic, but the amount of meat per taco is low compared to others like Ocampo or Tavial or El Burito, for the same price. They only give one small thing of salsa for a whole platter. The staff didn't speak English. The meat was fatty, and I tried Carnitas, Cabeza, and Carne Asada, all very fatty. If you're in the mood for authentic Mexican, skip this spot and go to Ocampo or Tavial. The only pros were they made my meal fast, the place appeared very clean, and the salsa was very tasty."], ["Linda H.", "I loved this place!  I would have never stopped here had I not had a restaurant.com certificate so I'm bowing to some marketing person!FYI they only accept the paper certificates so if you are a paper hater like me you need to know ahead of time. I had to run home and print it real quick but it was totally worth it!Ci and I both had tacos since everyone raved about them and they were perfection!I had Carne Asada and Carnitas and Ci had lengua and Asada. She is more daring than I and she loved the tongue. We eat tacos all over the metro, taco taxi, O Campo, and they all are good but here, it's like they grill the tortillas and meat a little more and it just adds a little sumthin sumthin. I also had refried beans and I almost licked the container clean. I probably would have in the privacy of my own crib. Loved them. For six tacos, refried beans, side of sour cream, and two drinks. $17!!! You can't beat that!!"], ["Ken R.", "Inexpensive, tasty, quality food.  Open late."], ["Ryan J.", "Ordered through yelp for pickup. Thought it would be flawless. They shorted me a order of Queso Nachos listed at $7.25 called the restaurant and talked with someone with little english. First impressions are everything. More than likely will never go back."], ["Karl H.", "I can't call myself a taco connoisseur but I do know delicious when it hits my mouth and every bite of taco at Los Paisanos has been worth savoring. A lot of mexican places I go to are too bland for my tastes but they know how to smack some flavor into their meats here. I'm just starting to adventure into trying more exotic meats and this was the first time I tried my top two below. Cabeza (beef head) - probably my favorite, not chewy like I expected, tender, salty and spicy, worth trying I swear.Lengua (Beef tounge) - also amazing and I was even more surprised at how tender they made tongue, really, really good.Al Pastor (pork) - Really smoky/earthy chili spice that I can't get enough of. Usually always order at least one of these guys.Carnitas (pork) - Really moist and savory, perfectly roasted.I still have to try the Tripa (tripe) and the chorizo. They also have carne asada but I prefer the other meats to that one. You really can't go wrong with any of them though.The place is clean and the people are friendly the only downside is it's locale. The last time I went here to introduce the place to my wife some cracked out lady nearly threw herself onto our car all zombie like(We've been watching the walking dead lately). It freaked my wife out enough to where she ordered I squeal out of the parking lot but no zombie lady will keep me away from these tasty tacos. I will be back, baseball bat in hand."], ["Garret R.", "Fan freaking tastic! The torta is incredible! The steak tacos are delicious and fresh. Amazing food for an amazing price. Will return... Soon!"], ["Pierre B.", "Best tacos in the twin cities.  Period.  Two tacos w/rice and beans for $5.99.The tortas are great too."], ["Andrew B.", "My turn was up ahead, but then I saw it again: that bold yellow storefront. It was beckoning me again, and this time I could not deny it. I knew nothing about the place. I pulled in the parking lot and turned off the car. Nearly all flaked off, I stared quizzically at the letters of the title, as an archaeologist staring at a stela, trying to decipher some meaning. There were all the signs of a good ethnic restaurant: in a possibly sketchy part of town, a rather fluky aesthetic, and rudimentary signage. I was sold, no dish is denied my fork.What I ended up getting was a variety of tacos, eaten under the allure of upbeat Hispanic music and surrounded by sentimental decoration. The value is remarkable; the food more than reasonable. This wouldn't be the last visit."], ["Chris M.", "Taqueria Los Paisanos has had a few coats of paint applied and other small upgrades over the years, but one thing has remained consistent - solid, affordable Mexican food with friendly service.While there isn't a shortage of taquerias and other Latin cuisine within a few blocks of this intersection of E 7th and Arcade., the affordable tacos, and more notably, the tortas, are the reason I'll keep coming back. Oh, and the fact that I can wash either or all down with a Modelo doesn't hurt either.The location itself isn't anything worth writing home about, but the inside is clean and has recently been gussied up a bit (relatively speaking), so it's certainly not just a takeout joint (though it's by no means fine dining either)."], ["Joelle L.", "I ordered carne asada nachos to go. When I got home I realized that they put carnitas on by mistake, ok I like carnitas but there was no meat, it was pure fat, globs of fat. Then they use canned cheese sauce instead of anything remotely resembling cheese and about a cup of sour cream. I threw away the whole thing it was completely inedible. My boyfriend got el pastor torta which he liked. I will never come back because there are many other taco places in the area that serve much better food."], ["Gabrielle H.", "Loved the torta with chicken! So delicious. Super friendly service. I can't wait to try the flan!!!"], ["Adam M.", "Awesome Tacos, try the carnitas and Lengua, my opinion they are the best. Great, quick service. Nothing else you can ask for, Well worth a try if you haven't been there! They also deliver for orders over $30!"], ["Mo M.", "Love this place! Al pastor and steak are both mouth watering, in tacos (my favorite), burritos, or quesadillas. Fast, friendly, and no frills. We get take out from here several times a month. Never had a bad experience.I will say I don't love their tortas. They won't get knocked a star from me on that though, because I only love Manny's Tortas. Never had another I liked, so it might be me and tortas."], ["Patti I.", "I recently moved back to Minnesota from the Bay Area. I lived a couple miles from \"Little Michoacán\" in Redwood City and I really miss the great tacos and sopes there. Based on Yelp reviews, I visited Taqueria Los Paisanos today. It's the closest  I've had to RWC tacos. In my experience, the best tacos are found at little places where you order at the counter, not at sit-down restaurants where the tacos come on a combo plate with rice and beans.I ordered 2 tacos, Al Pastor and Pollo, $1.75 apiece. Each taco consisted of two small soft corn tortillas, seasoned meat, chopped onion and cilantro. I was disappointed that sopes were not on the menu, but I spied the cook making one and asked. They're $2.50 apiece, about 4-5\" in diameter, with beans, lettuce, meat, cheese, onion, and cilantro. Filling and delicious!The place was pretty busy when we arrived, and it took awhile for our order to be ready. But it was super-fresh and hot. The woman who took our order opened an avocado and mashed it on the spot to make us a side order of guacamole. Yum!The reason I gave four stars instead of five is that the salsas--one red and one green--could have been better. They weren't that spicy or flavorful."], ["Dan S.", "I've been here a few times and it may be the best Taqueria in the metro.  Yes, I've tried the plethora of places on the West Side and East Lake.  For me it's all about simplicity.  For $1.50 you can get steak, pulled pork, or chicken that's been simmering in spices on two corn tortillas, mixed with onions and cilantro, add a squirt of lime juice or some chili sauce for additional flavor.  That's it.  It's all super fresh and super tasty.The menu is in Spanish and most of the employees speak only very limited English.  They have a few other menu options, but I'm only there for the tacos."], ["Eric S.", "The Cheek Tacos are some of the best I have had anywhere. Al Pastor is also second to none."], ["Greg S.", "My go-to for Mexican. Authentic and delicious tacos -- which is just about all I ever eat there. I'm a sucker for corn tortillas, steak, onion and cilantro tacos -- simple and perfect. Add a bit of lime and I could eat it everyday. The sauces are also delicious, the staff is friendly. Every time I get tacos here, I say to myself, \"I could eat here everyday.\"I have no doubt the other menu items are good, but the tacos are good enough to get each and every time."], ["Seth M.", "Best...Mexican Food...Ever!Typical East Side Mexican food joint. Not much to look at, but it was clean.  Parking is a bear if you're not there early. I was the first one there and they must have just opened because the griddle wasn't even fired up yet. The only downside I can say is the place smelled fairly strongly like floor cleaner which is both good and bad. Bad in that it's not a good smell. Good in that I was reassured they kept a clean establishment. But once they started cooking, that went away pretty quick.I wanted to try a few different things so I got a steak torta, two tacos (real tacos, not tex-mex hard or soft shell), one steak and one chicken and a tamale. They include a couple of bottles of sauce on your tray (one red sauce and one green) which you return when you are done.I started with the torta and it was incredible. I don't believe I have ever had a torta before and I was blown away by the flavor. The sauces are mild so I loaded it up with green chili sauce as well. I can still remember how it tasted. I hope I wasn't making it too obvious to the guy behind me how much I was enjoying it.The tacos were great and the tamale was worth trying. Add some fountain Dr. Pepper in the mix and I was a very satisfied customer. I am curious to try other Mexican places in that area since I haven't had good Mexican in so long but I am afraid I will hold them to the standard of Taqueria Los Paisanos and be disappointed every time. Get here if you can."], ["jared h.", "Great authentic tacos. Try the roast pork tacos and the Al pastor quesadilla. Skip the rice and beans.and um wear a coat in the winter in here... the propane space heater was a bit concerning"], ["Kate C.", "Good food, fast service, clean place. We'll return."], ["Jasmine Y.", "\"Everybody is a Taco fan!\"I never really like Mexican food but this place makes some awesome Tacos! That's probably the only thing I would get though. Feel free to explore but personally I love to eat the steak tacos. They taste amazing. their menu is simple, cheap and the workers are very friendly. The food tastes so authentic! I love inside! It's fairly large, beautifully colored with pink, green, etc. Lots of booths and a few tables. There is a large TV in the dining hall and bathrooms. What I really like about the restaurant is that it is usually quite which makes it a nice place for a private dinner. Parking is nice, they don't serve alcohol. There is not an outdoor seating area, they accept cards and cash. Overall I'm very impressed with the place. Definitely a place to try!"], ["Jim S.", "Authentic Mexican tacos. My favorite are the carnitas.My fussy 12 year old loves the cheese queadillas with just cheese.TJ a friend of mine turned me on to this place and I have never been disappointed.A long time ago this was a Clark's submarine shop. I'm awfully glad  it turn into a great little east side restaurant."], ["Omar A.", "Great little restaurant. Try the steak tortas. wasn't a fan of the chicken burrito."], ["Allison D.", "The first time I went here was right after they first opened, some years back. The food was everything I wanted, the service...not so much. The cashier, (female), was rude and short with me. I had a feeling that it was discriminatory. I then began to go to Los Ocampos on Arcade st., which is comparable, but way overpriced.So...I decided to try Los Paisanos again after about 4 years, just because of my craving for authentic Mexican and the good reviews here. Glad I did! Same great food and the service is now very friendly and welcoming. I always order the carne asada tacos, sometimes the combo with rice and beans. I must say the rice is nothing special, but the beans are definitely NOT from a can as some other reviews have stated! The only thing I didn't like is that they have a sign stating that they deliver, but when I called today, the lady said they do not. Disappointing since I am without a vehicle, at the moment. I love it so much...I found a ride!"], ["Calypso C.", "Disgusting.My boyfriend and I ordered a shredded beef burrito, two shredded beef tacos, a shredded beef enchilada and a side of beans and rice to share. The \"beef\" tasted like a soggy dishrag cut into thin strips. It was extremely dry, but as you bit into it a flavorless water spilled out. It was horrible. The beans were obviously canned and a little dry, the rice was undercooked and tasted burnt. The \"enchilada\" was simply a taco flipped over with some unidentifiable cheese smothering it but no sauce. How can an enchilada not have sauce?The toppings were fresh (onion, cilantro) and the tortilla fresh but the beef was just disgusting.The guacamole was very good, but I could make better myself at home."], ["Amy M.", "Fresh ingredients, pretty good prices, fast service. Authentic Mexican."], ["M P.", "This is the best taqueria food I've had since I lived in San Francisco.  While the burritos could be a bit more carefully rolled and the shredded beef was a tad dry and lacked some flavor, everything else was fresh and superb.  The guac was perfect and made fresh to order.  The horchata was delicious and refreshing.  Place is clean and service fast and courteous.  We were just passing through and looking for a good, fast lunch for us and the kids.  We got a real treat!  I would especially recommend the tacos."]], "Anita's Cafe and Catering": [], "Morelos": [["Ana T.", "(I am not sure if the address is currently accurate on here?? It is located in the strip mall at the intersection of Dodd Rd and Smith, within the little strip mall there). Very unassuming from the front but now that they have been open for a while, the inside if fully established.Been here a couple times now and have yet to dislike something. Their horchata is house made and the BEST I have tried... EVER.... please, please try their horchata...Food is fast and delicious. Have tried their menudo, fried fish, sopes, a veggie omelete (also interesting to note-- they have pancakes!), and the cuban torta (something to rave about). Everything is very generously portioned and I have left feeling like a water balloon every time. Only because it is so fantastic do I insist on stuffing myself to that pathetic extent !!They charge for refills on the chips & salsa! Just beware-- they ask if you want more, and then a charge of about $3 for the refill shows up on your receipt. Also a huge fan of the salsa verde the chips come with... clearly house made with an amazing avocado taste.Would highly recommend this place."], ["Martha Z.", "My husband has been wanting to try this place, but I was resisting for some reason. Maybe because it doesn't look impressive in its strip mall location....but as the saying goes: don't judge a book by its cover! This place was amazing!! The beef soup (Caldo de Res) was redonkulous. The broth was flavorful and the beef melted in my mouth. The refried beans were the best I have ever had and the Alambre Morelos was so, SO good. We will be back again and again. I almost forgot to mention the great service! Please try this place...you won't be disappointed.  I promise!"], ["Jer B.", "Had take out at least 10 times and have eaten there at least 5 times. Every time service for take out is FAST. Food is spectacular. Pazole on weekends. Comes with 2tostadas. Spectacular!  Try the pancakes. Chef used to work at Perkins. Try the Zapata Salad. Spectacular!"], ["Pete B.", "Excellent food. The Huevos Divorciados are amazing. The services is fast and friendly and the prices are reasonable. I can't wait to come back and try more items from their large menu."], ["Nolan H.", "Great mexican restaurant with a great staff and menu. I have been here numerous times (live nearby) and have Never been disappointed."], ["Victoria B.", "Service wasn't good and the food was okay. Definitely have had better Mexican food such as Teresa's Mexican Restaurant. Might sound harsh to say but I think Taco Bell is better then this place."], ["Michelle G.", "Delicious fresh food.  Authentic fare, but not sure which part of Mexico.  My partner ordered beef soup of all things.  Asked for a small portion.  Received a delicious good sized portion of Mexican beef stew, which he slurped up.  Enough protein for two days.  Our guacamole was well flavored and fresh!  Watched yummy looking platters of food go by to tables full of patrons that looked like happy repeat customers.  Cheese enchiladas were perfect.  We will return."]], "Boca Chica Restaurant": [], "Cocina Del Barrio": [], "Taqueria Los Ocampo  - Arcade": []}