{"Masu Sushi & Robata": [], "Origami Uptown": [["Courtney L.", "Great service!  Everyone was extremely professional and helpful.  The rolls were marvelous, sashimi was gorgeous, and the saki was hot instead of lukewarm.  Happy hour went late, even on a Friday. Very nice ambiance, they did a great job with such a small space.  The tempura squid was only ok, but everything else was wonderful!  We tried the never-ending summer roll, and it was delicious.  The spicy tuna and salmon skin rolls off of the happy hour menu were great as well.  We're definitely planning to go back!"], ["Jonathan T.", "Minnesota's snow season is almost as brutal as Rebecca Black's new \"song\" Saturday or any kind of prank seen on Japanese TV. *Note: Look up the one where the velociraptor runs down the hallway of an office building scaring the person running in platform shoes. Hilarious! Lately, the howling cold has made my face permanently look like --_--, and I've depended on my happy lamp a bit too much. But, I've also been incredibly hungry and have lived by one phrase the Marines say (according to my brother): \"Mind over matter. If you don't mind, it doesn't matter.\" lol. Screw you Old Man Winter!My boo and I went for a date Friday night. We spent a considerable amount of time fighting -9 degree weather, and ended up seeking foodie refuge at Origami Uptown. I have to say, my overall experience there was totally awesome. Beginning with the service, could it be better? With our teeth clattering and our faces pale, the first thing our server gave each of us a hot towel to warm up. How considerate! While defrosting, we ordered the sushi deluxe (consisting of an assortment of ten different kinds of seafood on rice). If that wasn't enough, we also got two rolls: a Shrimp Tempera and a Caterpillar.Given that I live in Minnesota, I'm pleased with the quality of sushi there. Everything is fresh (as can be), and doesn't smell old. I particularly enjoyed the tuna and mackerel nigiri. The Shrimp Tempera is yummy^2 and the Caterpillar Roll is avocado goodness -in the shape of ....... a caterpillar- with octopus for eyes. Oh, and we got pretty warm drinking the generous sized flask of drunkety funkety saki. It made our post-meal scamper to our car more bearable than the one to Origami Uptown.When I thought our meal finished, the chef -who has been with the same restaurant for about 17 years, wears a badass sushi bandana and a party tie- gave us a free dessert. My God, the dessert came with Pocky Sticks! LOL! #asiangrocerystores. #childhood. Duuuuddeeeee, HOW DID YOU KNOW?The bill was hefty, but if there's a better place to find high quality sushi paired with outstanding service, then let me know ASAP! I'm sure DeAnna J will tell me once again to visit Masu -and I will- but for now, O.U. has won my heart/ belly.Origami Uptown, next time I'll say \"thank you\" by making ya'll a paper... uh... airplane? What? Yeah! Come to O.U. haha"], ["Evan A.", "I like the food and the atmosphere here. Happy hour all day Sunday and Tuesday was a good deal for both food and drink. Good salmon avocado roll, a little strange spicy tuna. Good dumplings. Nice patio. Service at the bar has been a little hit or miss but not terrible."], ["Rowena N.", "I came here yesterday for a light dinner and was pleasantly surprised that they have an all day happy hour on Tuesdays on top of Sundays. We ended sharing a beef donburi (basically beef bowl), hamachi roll, salmon and avocado roll and a spicy crab roll. The beef bowl was average although I wasn't a fan of the pickled ginger which was salty when I expected it to be sweet. I liked the hamachi and salmon rolls by themselves (that is without my usual wasabi and soy sauce). These rolls were light but the fish were mildly underwhelming compared to some other sushi joints. The spicy crab roll tasted just like a standard California roll so nothing too special there but a safe choice. Overall I thought the food was good but I am not compelled to say it is a place I must return. The prices for happy hour were pretty reasonable (~$8 for beef bowl, $5.5 for each of the salmon and hamachi rolls, and $6.50 spicy crab roll).In terms of service, our waitress was pretty attentive and nice. We sat outside as their indoor seating was stuffy and humid (didn't seem their air conditioning worked or existed). Decent happy hour experience overall."], ["Elizabeth R.", "The staff really sold this place. The bartenders are knowledgable about the food and the varieties of sake available, and offered me some sake to try based on my preferences. I would say it's not the best sushi I've had, and I was especially bored by the tuna options. The nigiri and sashimi were pretty standard, but the spicy tuna roll was lopsided. Some pieces barely had any tuna, while the other end was overflowing with tuna. The special the night I was there of flounder was the highlight. I had five pieces of flounder nigiri and would have had more if I hadn't filled up on the tuna earlier."], ["Bruce K.", "Met my friend (and his dog) here for a good bunch of sushi. Great service, good sushi. And if the weather is good, stay outside. Bring your dog!Ordering from the sushi menu, most of it seemed to be rather towards classic rolls. Spider, Rainbow and the like. I managed to find something slightly different - the \"Never Ending Summer Roll\" which was asparagus tempura wrapped with tuna and avocado. With a special dipping sauce, really good.Miso soup was plenty hot. Beers were plenty cold.I would return!"], ["Takashi S.", "Ramen time with other Japanese friends.  Miso and tonkotsu ramen here is the best ramen in town after all.   Soup is what I like.  Honestly sometimes the noodle is not done well.  It happened 3 times in ..  Well don't know how many times I have had ramen. There but minimum 50.   Hope other ramens in town go this direction instead of strange sweet taste or too thick creamy soups."], ["Krista H.", "First, I was nervous that Origami Uptown wouldn't be able to accommodate my party jumping from 6 people to 11.  I called earlier in the day to discuss the reservation change with the hostess and manager.  They said it would be no problem.  (!)Upon arrival, they were completely ready for us.  We were seated immediately.    Our server, Kia, never missed a step.  She was incredible, and when anyone was undecided or unsure (whether it be about the menu or any of the beverage options) she was patient and offered suggestions to make sure you got what you were expecting.  She even let us know when late-night happy hour started, just in case we wanted to check out that menu... which we did, naturally. (Nicely done, Kia! I was so thankful that my guests were being well taken care of.  As the organizer of this dinner, especially with an unexpected large group, I was a bit nervous about entertaining \"out on the town\" ... but here... it was a breeze.)The food was fresh and well made--as sushi should be.  The appetizers; edamame, pot stickers, seaweed salad--all well done. They have a great variety of maki rolls, and the soup and sashimi were delicious. This was our first time at this location and WOW, I say it goes toe-to-toe with the Origami (downtown)...another favorite of mine.  Settling up at the end of the night was no hassle and we all left happy, full, and honestly, I was already looking forward to my next visit. I put Origami Uptown in my Top 3 for restaurant experiences in Uptown. I will be back, and often."], ["L J.", "First visit last night. We were impressed. Shared a tuna avocado salad, edamame, broccolini, Kimchee, and a couple of rolls. Everything was fresh and delicious, service was good, and the happy hour specials made it very affordable. Great location for a before-movie dinner (it's next door to the Lagoon theatre). We will return."], ["Sue S.", "We generally frequent the other Origami location,  but we chose the new location just for something different and because we happened to be closer to it than the other store. We were pretty impressed.The store is a bit bigger, newer, more sleek than its counterpart across town. But the quality of the sushi is the same. We were pleased to find that on Sundays it's all day happy hour, so we were able to partake in some of the beer and sushi specials. While many of the items were discounted on the Happy Hour menu, we did locate a few items that were the same price on the regular menu and the Happy Hour menu (generally the more expensive toro and such). I guess that's buyer beware -- we generally order what we feel like eating if we are splurging on sushi. But just a note to look out for if you are eating on a budget.More than anything we were super delighted with the service (shout out to our server, Dana). He was attentive and thoughtful, made good suggestions and went the extra mile. He asked our preference for timing the different items we ordered, and he never let our glasses run empty. He even treated us to dessert when we mentioned we were celebrating our anniversary. In all, it made for a lovely evening out and really top-notch sushi."], ["Anya C.", "I ordered from BiteSquid as to go Una-Ju and Tako Sansai. The rice of Unaju is under-cooked (or over night), I think for $24 is absolutely not worth the money. For Tako Sansaj, it's not bad but not very special and just soso. Overall, i paid $50 for this (including $7 delivery and $4 tip) is disappointed."], ["Joey F.", "Nice place to sit outdoors during the summer.  You are better off just going to Bar Louie though if want to be outside.  I found the fish to be very unappetizing and the rolls to be tasteless.  There is much better sushi places to go to in the city."], ["Johnny P.", "I'm not sure it was stand out. The Mussels were mis-leading as how we thought they'd be served. The squid is decent.The sushi was really the best part of the meal.I give it 4 stars just because the staff was really nice."], ["Bobby L.", "I was hesitant to come to another sushi restaurant, but my interests perked when I saw that they had noodles and rice bowls. Katsu don is my favorite dish in Japanese cuisine, so I had to try it. It was good, not the greatest. The pork cutlet wasn't crispy like it should and it didn't have enough sauce/soup.But it was good."], ["Sheresse S.", "Origami I love you. I have to say, this was one of my favorite sushi experiences ever. Had a beautiful, well designed setting, totally blown away by everything we ordered here. Super fresh and inventive rolls.  A bit pricey, but worth every penny. The place was completely empty, which was confusing/surprising. We ordered: - Philly - Sea Girl- Philly Ex RollService was fantastic. Attentive, helpful, friendly and very very quick. We will definitely be returning very soon!"], ["Jim C.", "We used to frequent the Origami in the Warehouse District years ago, so I was eager to give the Uptown location a shot.  Went here one evening a couple weeks ago and ordered a number of things off the happy hour menu and a few off the regular menu.  The happy hour rolls, while a decent value, were only okay.  Despite featuring different fish (tuna, salmon, crab), all the rolls tasted very similar.  I think it was due to the relatively small ratio of fish to other ingredients in the rolls.We only shared a couple things off the main menu.  While more flavorful than the HH items, they were more expensive than at other sushi places in the area.  Based on our experience, I don't feel an urgent need to visit again soon.Note: if you do head here for HH, grab a table outside--there's decent people watching on a nice night."], ["Sean H.", "Our dinner was disappointing.  We ordered chicken pot stickers and three rolls: Crunchy, Myabi, and Rainbow.  The pot stickers were over fried on one side and doughy on other.  The rolls were essentially flavorless.  The biggest disappointment was the Rainbow Roll: there was not very much fish and a lot of egg curd?  I have no problem paying premium for good sushi rolls but I felt that we paid a premium for flavorless rolls that really skimped on the fish.  Our server was nice and the atmosphere is ok but we just won't be back."], ["Illinois C.", "I have dined at this location in Uptown (tonight) and the downtown restaurant on 1st Street last month.  Nothing bad to say. Sushi and rolls were served fresh and cold with a pretty presentation and everything was DELICIOUS.  Uptown restaurant is a bit more casual atmosphere than downtown... Low lighting, very nice.  Service was perfect and even though we finished our food and wine, we didn't feel rushed as we sat and talked for probably an hour afterwards.  My second experience at Origami and I am pretty sure there will be many more.  I get why this guy is opening more of these restaurants... How aboutt another in Chicago? Cheers!"], ["Hannah T.", "I stopped in for a solo happy hour, mainly because I was tired from shopping and needed a little sushi fix to wake up. Now going alone to happy hour is already slightly strange, but walking into an empty restaurant didn't help. It was 5pm on a Thursday before the holidays, so maybe that had something to do with it or people get off work later. However, the bartender was cheery, talkative but not overbearing, and helpful, making me feel comfortable. I had the Morimoto beer, which wasn't on happy hour, but my first love in life was Iron Chef, the original and newer one, so I had to have a beer that Chef Morimoto helped craft, specifically to go with sushi. The happy hour menu is large enough for me, but apparently they are adding a lot more options most likely to draw people in. I can only assume this will happen after the new year, so make sure to check it out, I know I will! There are plenty of appetizers between $4-$8 and same prices for wine, beer, sake, and cocktails. I was very pleased with my $5 salmon roll, very fresh, with perfect rice, and 8 pieces. I didn't try anything else, but there is a check in special that I discovered as I was about to leave! I am excited to go back and try more!"], ["Kashmir S.", "Late Night Sushi Happy Hour. Count me in. One of my go to sushi spots in the twin cities has just made me a bigger fan of theirs. Now that they have relocated to the Uptown area they are doing late night HH and to top it off they have plenty more options on the menu (HH) then the location downtown so that's a win in my book. Plus, since Yelp is the cool kid on the block with every check in they give you a free appetizer (edamame, ebi shumai or gyoza). The sushi is still amazing and fresh. This place has yet to disappoint me, whether it is with their sushi, the variety, friendly staff and reasonable prices.During this visit we decided to sit at the sushi bar, which was a good decision since we were provided with something to nibble on from the sushi chef prior to ordering our food. Our waitress was very attentive and all of the food that was ordered came out rather quickly, which is a good thing. The new space that they are in has a great décor and there seems to be plenty of seating options as there is a 2nd floor, not sure if that's for bigger groups or not. The only downside to the set-up of the new space is the fact that the bar area is located right next to the door so every time the door opens on those cold winter days you might feel the cold draft. They also do parking validation in the parking lot next to them for an hour, wish I had known about that before.  Great location, amazing food and an amazing time. Can't wait to visit again."]], "Taste Of Shoyu": [["Scott L.", "This fascinate sushi bar is located by G gates, I didn't find this place first time when get to MN. Finally gets a chance on the return trip. Everything is digitally ordered through IPad. The atmosphere is delight with the open glass and all the oriental decorations. I ordered the stir fried lamb, which I liked most. I also had edamame and fried squids, flavor is not strong enough maybe less salt?The waiter is super nice and always has his service around. Will go back next time fly through MN."], ["Chris H.", "For an airport restaurant this is close to a 5, but to be fair it is more of a 3.5 overall.A little pricey, and not everything on the menu is a hit.I recommend ordering sushi or the ramen noodle soups. Those are solid and get brought out quickly."], ["Lindsay E.", "I very rarely write 1-star reviews, but the underwhelming and overpriced food, the weird atmosphere, and the bizarre iPad-operated ordering system leads me to say that I'd recommend against visiting this place.  Unfortunately, we almost knew what we were getting into.  I had much higher hopes for the food than I should have, and I ended up being severely disappointed.  As my husband later said, when in an airport, always go with a chain restaurant.Neither of us finished the ramen we ordered, which is a total shame because we both love Japanese ramen.  The server who came by with our water and who explained the ordering system was friendly, but the experience swiftly went downhill from there.  I can imagine that if you are traveling alone, having an iPad sitting in front of you wouldn't be too much of an imposition, but gosh why not just let the guests watch the fascinating chefs in front of you or do some great airport people watching?  I'm sure there's some money-saving reason why the airport decided to implement the iPads (it's no just Taste of Shoyu; they're everywhere in the airport), but I can't imagine the pros outweighing the cons here for the restaurant.  Interacting with friendly staff can do so much for customer loyalty, especially when food is sub par.  I suppose Taste of Shoyu is counting on first-time guests being enticed by the interesting cuisine like I was.  I don't think I've ever said this before, and I hope I never have to again, but I wish I'd gotten McDonald's instead of spending so much money on crappy ramen."], ["Linda O.", "My husband and I ate here during a layover.The computer offers a unique way to view the menu and order. Sushi was just slightly above average."], ["Mark W.", "The food is really good here, but the service and high prices make it one to skip when at MSP. Be prepared to pay $20-30 per person and leave hungry.I recently stopped by for sushi on a layover in MSP. The restaurant has all iPads that are used to place your order. Once you place your order, a waiter comes over to get you anything you need (usually). On the most recent visit, I had to flag somebody down to get waters after waiting 15 minutes. It's worth noting that at least half the tables were empty too.It was like pulling teeth to get a paper receipt (needed for expenses) from the waiter. I had previously been here and another waiter had asked us if he could get them for us, so I thought it was a common request.I ordered the miso soup and a California roll, but the miso soup was SO salty that I ended up only eating half of it. I would have sent it back, but the waiter never showed his face at our table after delivering the waters (food brought out by food runners).Additionally, I happened to be sitting with a co-worker at a table for two and our dinners came out at least 10 minutes apart (about a twenty five minute wait total for her food). Again, hard to understand since the restaurant wasn't even full.The sushi was quite good and the food I've gotten in the past has also been quite tasty. Perhaps I'll stick to take out in the future?There are so many great restaurants in MSP that this one is not worth the time. I won't be going back anytime soon."], ["Angie P.", "Unbelievable experience at Taste of Shoyu! I had about 30 minutes to chill before I had to catch a flight back home. A friend told me I needed to check this place out. I am so glad I did!From the ambiance to the ease of ordering & paying via an iPad, the delicious shrimp pad thai, I was so pleased! I didn't even feel like I was eating \"airport food.\" It took hardly no time at all from the time I ordered, to the time my food arrived. And it was steaming hot! But oh so good. The shrimp had a nice, light batter. The pad thai was amazing - the spice, the noodles ... all of it! There wasn't a need for waiter interaction, because I sat at the bar. I liked how you could watch the \"goings on\" in the \"kitchen area.\" Also, plenty of TVs can keep you up to date on sports or news.  The spot was very clean. Prices were a bit much, but understandable. They over Asian dishes as well as sushi."], ["Anna S.", "I fly back and forth every weekend and I see this delicious place that I want to try. So, I decided to go today. I ordered the soft shell crab, was fantastic, but I didn't imagine it was going to be a small portion. So, I ordered another dish, something lite, the Cucumber Roll. Darunt den, den, den..... It was just disappointing.  I took pictures to show you guys. Told one of the waiter that I was expecting the one that was advertise on their online menu and she said that it depends on the chef on how they prepare it. I told her that its false advertisement. So she changed it and that is why I'm giving them a 2 star instead of a 1 star. I'm afraid to even eat it. I'm thinking they might spit inside or do something because I spoke up. But regardless, since I'm a nice person I want to help their business grow, so they must know."], ["Jin N.", "So, you know how there's that quote, \"He can dance for a White guy.\" I don't know if it's fair, but, \"It's good ramen for an airport.\" Airport food normally sucks. You got the usual Mc Donald's that's overpriced but tastes extra gross. Somehow they manage to make soggy fries, just because it's in an airport. Panda Express always has the mushy orange chicken.  It's like airports are really talented at serving crap food no matter what chain it is. This airport seemed to have quite a variety of foods. Nice job. Love the iPads everywhere, and the super semi complicated but high tech system of ordering foods via the iPad even when you're actually SITTING DOWN INSIDE of the restaurant. I found that a bit weird, but I get it. You guys are a hub, and you want to be cool. Pork ramen- 4 stars.  4 stars for an airport? Well, when expectations are low,  you can't help but to be a bit impressed. IT was actually not bad at all. The broth was clean, simple, and flavorful. Not the best ramen I've ever had, but good. Sadly, went to eat here again on our return flight, and this same dish went down to a  2.5 stars for me. Broth was not as good, was just plain salty, and MEH. Hence, perhaps there are different reviews and ratings at this place, depending upon who's the chef? Thai fried rice with egg on top- 4 stars. NOT BAD AT ALLLL. This dish was actually good, I mean like if it WASN'T at the airport, I still woulda given it a 4 stars. Nice flavor. Serving was ridiculously huge, we couldn't even finish it. Tantan men- 2 stars. MEhhhhhhhhh. We ordered this on our return flight, and again, maybe the chef was different because it was really weird. The broth was super thick, and the noodles were almost hard and mushy in a weird way. Somehow the starch in the noodles and broth weren't mixing too well, and it just didn't taste right. I wondered if they threw in corn starch to thicken the soup, hence this weird situation was going on. Not that great at all. Good luck, fellas. Your flavor experience here might really just be based on a who is cooking in the back. IT's hard to screw up on a fried rice dish, unless you're Panda Express at the airports, so I say try them out first."], ["Scott N.", "I have been wanting to eat here for years!!!!!!!!That sounds weird, doesn't it? I mean, it's a restaurant in an airport! This time the walk to my connecting flight took me right by Shoyu and I had enough time to stop in.I am a sashimi fan, so that's what I wanted. Two pieces for $8 - hamachi. I ordered 'times two', because two pieces surely wouldn't be enough.Tiny, tiny pieces of hamachi. The flavor was okay, but it wasn't super fresh. I'd say, what would one expect from sashimi in an airport? but hey... it's a restaurant that serves sashimi. There's no reason it shouldn't be fresh; that is their business.Don't get me wrong, it wasn't nasty. It was okay and it was tiny. Did I mention it was tiny? It was tiny. I mean at $4 a piece... seriously, even at an airport where everything is expensive, make it not tiny.They have other items on the menu that might be better options, but I don't think I'll give this place another shot."], ["Debbie P.", "I love that MSP has an alternative to the usual airport eats.  And Shoyu is one of them. The first time I flew through MSP I saw Shoyu and made a mental note to eat here during my travels, plus I love ramen!  It is located at the entrance to terminal G or as my friend calls it the \"hipster\" terminal.I've eaten here twice now.  It's a cool, modern space in the airport.  Shoyu has an eating bar the spans the perimeter of the kitchen, which is where I like to eat.  There are tables and seats as well.  Each bar seat has an iPad and charging stations.  The iPad is there for free internet surfing, but most importantly it is where you place your order.  Yup!  There's is minimal interaction with staff, but they are there.  So here's the caveat, service sucks here, I don't know if the iPads make the staff seem despondent or what.  But in my most recent visit each person sitting near me had to ask for utensils and napkins AFTER there food was delivered.  Now wouldn't you automatically have those when they give you water?  And speaking of water, I had to ask for refills several times.  Anyway, that's where I will end my \"b!tch\" session on service. Now about the food, I've only ordered the pork ramen.  And it's actually pretty good for an airport spot.  It's salty, and the noodles are cooked well (i.e. it's a still al dente and not over cooked).  The pork in the ramen is a bit sweet and reminds me on kalua pork (like from Hawaii).  I like Shoyu enough that this would be my go-to dine in spot at MSP.  But I'll only come by if I have a long enough layover.  I hope to try more food items there next time."], ["Jeff L.", "I'm laying over again in the MSP airport, and downgrading my review. Basically, I was tickled pink the first time I reviewed this place because I could get ramen in an airport outside of Japan or California. Now I'm just much less impressed.The ramen isn't all that good. It's decent enough for airport fare, but it won't make me come back the next time I'm in this airport. I'll try another place instead.Also, the service is just so bad. First of all, the place looks like eatery from a dystopian future where people all have a screen in front of their faces, a la Wall-E, and no one actually interacts with other humans. Oh wait, that's not a dystopian future...that's reality today. I digress.  Anyway, since you order and pay (and tip!) from an iPad before a human ever even looks at you, the service is extraordinarily bad. Sushi comes to your table 15 seconds before your ramen arrives. When you ask the server to bring you water, he asks if you ordered any. You say yes, and he scurried off with a confused look. Then another server comes with your water several minutes after your food has arrived, and the original server who is returning to your table with water looks even more confused. Sheesh. Now that you finally have your water, you have to deal with your entire meal which didn't come out in courses, but is sitting in a jumble in front of you. You don't know whether to eat the ramen now since it will get cold if you don't, or if you want to wolf down the sushi so you can move onto ramen before it cools. What a mess. You consider leaving a shitty tip, but then you realize that you already tipped 18% when you sat down."], ["Jeff M.", "Started with Sapporo and had a very good spicy tuna roll sushi and shrimp pad Thai noodles.  Great atmosphere with lots of tv's.  Good experience for a layover!"], ["Rockne H.", "It was time to head back to San Francisco. On our way to the gate, we decided to stop at this Asian restaurant. First off, it's pretty odd to see an Asian joint at an airport and secondly, my friend told me the food here was amazing! Since we had time to kill, I knew we had to stop by. Around the corner from the Delta TSA check point, you'll see this modern space. there are booth and table top seating and a window to watch them make homemade noodles. The dark tiling and ipad ordering systems on the table really created that modern vibe. Yes, I said it. There are ipads on each table! You browse through their inventory menu, swipe your card and a server will be at your table shortly to bring your food. So cool!For lunch I got the Tokyo style Pork Ramen for $13. This ramen was filled with shredded pork, hard boiled eggs, bamboo shoots, greens and seaweed. Lots of different flavors and textures. The pork had a smokey flavor to it and the ramen was of course, amazing! The broth had a really nice flavor to it as well, however, my only gripe about it was it was too oily. I think it's from the pork but not really a fan of that. Listen, make no mistake. This is a fantastic space for a meal before your flight. You will be amazed by the modern details and the food is fantastic, especially the ramen. Whenever in MSP, come check them out!!"], ["Biota H.", "Since I eat a plant-based diet, I often have trouble finding healthy vegan options, especially in airports. So I was excited to find out from Yelp that this place offers both soba and sushi, which are two of my favorites!The automated ordering on the iPads was cool at first but then seemed more gimmicky than practical. On multiple occasions, I tried to call a waiter over using the option on the iPad and waited long stretches of time before finally having to wave a waiter over. It was nice at first that the iPad would help you to track your flight, but I found that after I ordered and was waiting for my food, the iPad would constantly time out and I would have to re-enter my flight info to check for updates.I ordered the wild mushroom soba (shiitake, enoki, and spinach) for $12.00. Since I'm vegan, I opted out of the tamagoyaki (grilled egg), which normally comes with it. But especially since I opted out of one of the add-ons, I was surprised to find the vegetarian mushroom broth substitute would still cost an extra $1.50.I was also surprised at how limited the sushi offerings were; the only vegetarian option was a cucumber roll, and it was more expensive than usual. I had to ask a waiter if avocado could be added, and he told me there would be an extra charge. I ordered two cucumber-avocado rolls to-go, since my flight was boarding soon.The soba ended up being incredibly bland, almost like the noodles were sitting in water rather than broth. I did enjoy all of the toppings, but even worse than the  blandness of the noodles was eating the tofu without any sort of flavoring.The avocado-cucumber rolls I ate mid-flight. Considering that these hand rolls are pretty simple and should be very basic for a sushi chef to make, I was surprised to find that the cucumber in the roll was literally a slab and not the usual julienned version. I felt like each bite of sushi was almost a little interrupted trying to get around the solid chunk of cucumber.The only highlight of this meal was that the manager wasn't present, and they couldn't charge me extra for the added avocado. I did appreciate that the avocado was on the house.The cost of the soba plus two cucumber rolls with tax ended up coming out to around $26. I would willingly pay this for quality food, but this food was really sub par. There were way too many surprises with this meal, and none of them were good."], ["Jamie Antonette Q.", "I had some amazing ramen. The pork, delectable. The broth, rich. The noodles, perfect. So much umami flavor! It made waiting for my flight more enjoyable."], ["J T.", "Ill state I have been here a few times.  This review is for one visit as I see a trend in the quality moving the wrong direction here...Id love to rate this place higher but just cant anymore.  $27 bucks for 1 bowl of shady Ramen and 1 small bottle of Chinese Beer.  Yes.. I said Chinese.  This is because all Japanese beer was sold out.... *sigh.  (I ordered a Asahi)The Ramen.  I had high expectations for this with the noodle hanging up from being freshly made.  But it really failed or fell flat.  The broth was under seasoned/watery and there wasnt a full portion in the bowl.. The \"server\" or the people that drop your food off after you do your own ordering on an iPad pointed out for yet another $2 I could have gotten extra broth... Extra?  No.. I want a portion...  The toppings were nill and just not a great version of Ramen. I was really bummed. A sliver of asian cabbage.. I think it was but there wasn't not enough to tell exactly what it was. It wasn't Nori so I think.. it was a sliver of cabbage.  Meat.. No. Bones yes.  Seriously.. All bones.. Im still not a fan of the iPad only ordering and setup they have. If you decide to have a second drink or order someting else.. Second tab/bill.  The prices here are ridiculous for what you get in quality.  WAY WAY out or proportion even for an airport.  But I suppose need to pay for those iPads huh?  I could forgive the prices if the Ramen was good; but it really did disappoint."], ["Grace Y.", "Walking through the G terminal I was surprise by many of the different order from your iPad restaurant options (most of them felt Italian or American food) then I found myself at SHOYU. This was not typical airport food - I had the Tuna burger and it was delicious! At $15 it was typical airport prices. Some folks around me had rolls and those looked good as well.The kitchen was open and you could see food being prepared and made!If I'm ever at this airport again, SHOYU fo sho!"], ["Charlie C.", "Better than fast food, not nearly as good as Ike's . I recommend not questioning something being prepared differently than described on menu. Servers were nice but i was left with the odd impression that the staff would rather work elsewhere."], ["Michael G.", "Fantastic Sushi Spicy Tuna is second to none. I love it when I can have time to dine here. Fast friendly and great flavor."], ["Margaret M.", "This place is the best Asian airport food I've ever eaten. As a well seasoned traveler I've had my fair share of airport fare. This is top notch. I always try to make a point to stop at Shoyu when in MSP. I've tried their sashimi, pork gyoza, and spicy edamame, but I must say my absolute favorite is their ramen!! It has braised pork that is so tender and compliments perfectly with the rich ramen broth. You can even get this dish with vegetable broth and tofu if you're vegetarian. I seriously dream about this ramen and look forward to eating a bowl during my layovers. You must try it!"]], "One Two Three Sushi": [["Bert B.", "I really like this place.  I have tried several of the rolls and they all taste great.  The ingredients are fresh and the rolls are skillfully made.  You can get through the line quickly.  Their prices are reasonable.  The staff is friendly.  It is a little difficult to find a spot to sit in the restaurant, but there are plenty of places to sit down near by.  And don't worry -- their containers are well designed for carry out.I highly recommend stopping by and giving them a try if you like sushi.One additional note: the spice rolls actually are somewhat spicy."], ["Jeremy A.", "Reasons for stars1. Fresh ingredients2. Decent pricing3. Friendly Staff4. Variety of healthier soy sauce typesReasons for lack of more stars- Sushi rolls not assembled properly.*Meaning rolled tight enough (constantly breaking apart, bites are large). Not sure if there has been recent turnover, this wasn't an issue 7-8mnths ago and not isolated to one worker. One additional suggestion would be to serve the roll standing instead of laying down inside the box. - Would like additional choices for drink sizes. Even just one more. I realize there are more positives than negatives here. However, if the roll breaks a lot, it ruins the sushi experience."], ["Kate W.", "One Two Three Sushi's ramen is decent. I've had the chicken katsu and pork belly and, though a little pricey, would order both again. But the name of the game is sushi, and their's leaves much to be desired. I suppose the name of the restaurant implies that it is quick, which it is, and which I appreciate. And their ingredients seem fresh enough, which I suppose should be the most important thing with sushi. However, other reviewers say the rolls are \"skillfully assembled\" and I have to disagree.I've tried their sushi rolls a handful of times (I really /want/ to like their rolls) but have been disappointed each time. My biggest issues with their rolls is that 1) they are not rolled tightly and 2) they are assembled/rolled/cut lengthwise instead of widthwise. Accordingly, when cut into 8 pieces, the rolls end up being enormous. A sushi roll should be small enough to be eaten in one bite, and should not make the eater cower behind her desk so that coworkers don't scoff at her inability to close her mouth when chewing.I cannot recommend this place for their rolls. If you want $10 ramen and are in a pinch for time, this place might be for you."], ["Taro T.", "Sushi is decent, somewhat flavorful. I believe the pork tonkatsu rice bowl could use some work though, it is a bit lacking in flavor and has too much rice."], ["Todd G.", "Super fresh. Skillfully assembled sushi rolls. Along with the classics, theyll also make to your specs, so for my first time here I m having ahi, mango, lettuce roll with ginger & wasabi on the side. Best new thing in the skyway."]], "Kyatchi": [["Mr Bear P.", "We had a wonderful first experience.  I normally am not a fan of Japanese food, but this place was pretty great.  The waiter was very well versed on the menu- and we ordered a few basics, and asked him to fill in the gaps to make for a representative dining experience.  He did a great job.  From start to finish the food was wonderful.  The prices were very fair, and the dining room was surprisingly cozy and pleasing.Can't wait to go back and try more items!"], ["Madina T.", "I would not come back here again. Maybe I just don't understand Japanese food but I know my food. I know what tastes good and nothing tastes good here. Homemade Kaiso salad - very bland. We didn't even finish it. Miso soup - too salty. My husband and I both added water to it which cooled it down and we couldn't enjoy it.Sake roll - very simple. Nothing specialSuzuki roll - pressed sushi. Too much rice and hardly any fish. This is a block of rice topped with some sea bass, tasted like toothpaste with fish. And it's $14. I didn't even eat half of it. The menu is hard to read. I didn't know what 75% of the menu said. I had to ask the waiter. He was very patient but it didn't help us understand what we were actually ordering. Hard to place an order when you don't even know what you are ordering!!! The bill came to $85. I was not happy with our dinner and felt like we were ripped off."], ["Wanda M.", "We arrived near 7pm on a Monday night with immediate seating.  We ordered three sushi selctions (Kappa, avodado and bincho) all super delish and super fresh.  We also ordered the lucky 13 (a Monday night special) Ramen and pint for $13.  I really enjoyed the chicken broth based ramen and the accompanying pint of Sapporo.  The place was busy, but not too busy.  The music was nice, but not too loud.  I could easily hear what my dinner date was saying, but not the people next to me.We will be going back and hopefully soon."], ["Alice S.", "Despite the fact that this is a bit of a schlep for us, I foresee many more visits. We went very early on the Saturday before Labor Day (like 4:30 early) and the place was empty. The waiter was incredibly attentive and obviously really proud of the place. The sustainability factor is pushed pretty hard, which is fine, but the actual taste is the key of course. And it's very very good. The ramen was just lovely, light and tasty. The sushi has that extra edge, that delicate touch that puts it over the top. There's a great beer and wine list, and a kids' menu (for next time) that promises greatness. This is a real gem."], ["Iris H.", "Had a friend from out of town and we went here for dinner. Our server was very knowledgeable about the seafood and sustainability but a bit inattentive. When we were ready to order another round of sushi our server didn't come to the table for 15 minutes, yet served others around us. The food was great, and we got two rolls, a hotdog, the meatball appetizers and the suzuki. Everything was fantastic and had well matched flavors. The suzuki comes with lemon pieces on top and has strong citrus notes. It's very refreshing for a hot day. The potato salad on the hot dog was very creamy and light. It's closer to the mustard/mayo version rather than vinegar based, but it's not too rich given the amount you receive. I also highly recommend the appetizers. They were out of the mushrooms so we got the meatballs and chicken. The meatballs were phenomenal. I don't know what seasoning they use but it's very flavorful. Overall it was a fun dining experience and I would go back again. It's a pretty expensive night but most sushi usually is."], ["Cassandra B.", "I have to admit, I was suspicious when this place came out.  It boasted sushi down to the very basics, plus... hot dogs?  One thing I remember about living in Japan was that hot dogs were wrong and terrible.  In convenience stores, sitting out, pre-wrapped with ketchup and mustard drying on them, the meat was a weird consistency and oddly sweet.  Not much better in the nearby big city occasionally sold by street vendors, either.  Hot dogs isn't what brought us to Kyatchi, though.  That was ramen.  My husband greatly enjoyed the simple, comforting ramen, the kind you'd find in a stall on the street.  It wasn't beautiful, but it was unpretentious, and as he said, the taste was exactly what he needed to end a stressful day.  We're always on the lookout for this simple, delicious ramen like we used to have in Kyushu, the secret spots that don't put on airs because the food speaks for itself.  We haven't yet found this in the Twin Cities, but Kyatchi comes close, and certainly serves as good comfort food.About the rest, Chef Tozawa must have been eating different kinds of hot dogs, because the avocado and egg dog was piled high with deliciousness!  We went during happy hour and had a good sampling of some of the deals.  The simple rolls and nigiri delivered on the promise of sticking-to-basics-done-well and attention to detail.  While I'm a fan of some of the crazy American-style rolls (which is almost every roll with more than one or two ingredients), this nailing the basics is their schtick, and it's done very well.  We topped off the evening with some refreshing cold sake."], ["Jerice A.", "Highly recommend! Happy hour gives you $2 off tap beers, and sake specials. I got a plate of 5 pieces of sashimi and rice (chirashi) for $10-that's a steal. I got the unfiltered sake for $5 which was delicious as well.They have house made seaweed salad which was delicious-sesame oil soy sauce vinegar combination.I sat outside which was nice as well-7 tables outside to choose from and inside had a sushi bar and other tables.I had a very prompt server who explained the menu to me which was highly appreciated.They have grilled seafood, sushi, soups-I like the creativity of the chef-well worth the bill."], ["James M.", "Yes. Yes. Yes. If you like sushi and Japanese food you must check this place out. The rolls are killer (I had the Wanna Roll, haha) and their seafood is some of the best I had in the U.S.  Try their grilled mackerel with sea salt and their grilled squid. Both are \"out of your mind and off your face\" kinds of fantastic. Just beautiful dishes. They also have... Wait for it... Hot dogs. Yup, I said it. Hot dogs, with a Japanese twist. Something about one of the owners once being the personal chef of a Japanese Twins player, once. Or some shit, I don't know, I was busy stuffing my face with sushi. Soooooooooo good. The only I didn't pop for the full 5 stars was because their service was a little slow. Probably just because it was Memorial Day and this was the only place open in the neighborhood and they were RAMMED, really busy. If I could give these guys 4.5 stars, I would."], ["Amee K.", "Surprisingly good food. My boyfriend and I arrived during happy hour and we were rather surprised on how good things tasted even with a hr or two before closing. Though their HH menu was quite small it did offer a pretty good deal for items compared to their regular priced dinner menu. I opted for the chirashi which was a good portion for the HH priced I paid of $10, plus they weren't afraid to give you good pieces of sashimi, like hotate, for having paid their HH price. My bf order the soba dog which he was satisfied about. I wasn't too thrilled about the cost for it, since it was a hotdog but overall taste was good. We also ordered a pork belly kushimono (tontoro) which was excellent with sea salt.Can't complain really about the overall visit. We were quite satisfied and will return again in the future."], ["Sarah U.", "A little noisy, but fun décor and some outside seating are avail. I loved the different takes on some common Japanese dishes like miso soup and seaweed salad. Service was not only friendly and professional, but also the well-educated servers seemed to be as passionate about the dishes as the owner. Food Notes:-Tokyo Turnip Salad: I could a whole bowl of this, seriously-Seaweed 3 ways: The red one is the best! Savory and a little crunch-Teriyaki Hot Dog: great flavor but a tad salty-Skewers: Amazing! Chix meatballs were so juicy and flavorful, would pair great with some cold noodles-Sashimi Bowl: Fish was very fresh, all the fixings reminded me of home. Pickled everything was great, wishing I had more seabass-Strawberry Sorbet: simply deliciousWill be back! organic, locally sourced and free-range? I'm in!"], ["K K.", "I give this place 4 stars for quality of food, not necessarily value. For example 5 pieces of Goyza for $8 is a bit absurd. If you want fairly decent quality and good price point then happy hour is the winner. Also don't expect large sizes. Quantities are fair but you won't be full by ordering just one dish. Two people should order a few happy hour sides in order to make it a meal. Otherwise you'll leave wanting more."], ["Gracie H.", "This little gem may quickly become your go-to if you like Japanese food and appreciate attention to detail. Knowledgable, friendly staff will happily offer up suggestions. The rice / noodle bowls / hot dogs give you the biggest bang for your buck. But don't steer away from the starters/ sushi. I highly recommend the \"Portlandia\" very refreshing and surprisingly filling. Accessible front entrance. Seating inside and outside would allow for comfortable configuration for wheelchair users. 2 gender neutral bathrooms! #winning"], ["Kristie Q.", "I would give this place 3.5 stars if that was possible. The service was very good! The staff is friendly and attentive but the sushi is just ok. I had the chirashi bowl and yellowtail roll which were both fine but nothing to write home about. What is unique about this place is the hotdogs. I tried the yakisoba dog and it was surprisingly really good."], ["Patti K.", "I heard about the oshizushi (pressed sushi) here and made a reservation right away. I haven't had oshizushi in years, and I felt any place that had oshizushi on the menu must know something about Japanese food. I wasn't disappointed.So much to love about this place. Sustainable seafood. Authentic menu. Hot towels. A cute name (\"catch,\" as in catching a baseball and perhaps catching a fish). Artwork andauthentic Japanese baseball memorabilia that evoke the name. As I scanned the menu, I made a mental note of what I would try next time (ramen, donburi, tonjiru pork stew...and it goes on). We ordered the mackerel and sea bass oshizushi, salmon skin salad, and nukazuke pickles. The oshizushi was wonderful, as promised. When the server asked me if it was as good as what I had five years ago, I had to qualify my answer that last time I was close to the ocean. (On the bullet train headed to Shizuoka, in fact.) But in any case, very good. I thought they fell down a bit on the salmon skin salad and the nukazuke, though. The salmon skin salad dressing was wonderful, but the salmon skin itself seemed to need salt (perhaps purple shiso salt!). The nukazuke pickles tasted like they hadn't been pickling for a week, but since I don't like super strong pickles that's not a bad thing. Several reviews compared Kyatchi unfavorably with certain other restaurants, on the grounds that the prices are too high. Having been to many other sushi joints in the Twin Cities and having lived in Japan for six years, I would say that Kyatchi stands head and shoulders over the vast majority of the other Japanese restaurants in the area in terms of authenticity, food quality, and overall experience. Yes it is more expensive, but in my opinion completely worth it. Service was quick and attentive. And there was parking by the side of the building. Lots to love about this place, and we'll be back again soon!"], ["Marci M.", "We've been here 7 or 8 times now and each time I try to remember to write a review. Our last visit was so memorable that I finally remembered to actually follow through. Our last visit was on a Sunday night at 5pm. We arrived as a party of 7 (5 adults + 2 kids) and were sad to see the place was packed (great for the restaurant, bad for us). Unfortunately it was raining so the lack of outdoor seating may have been part of the problem. Anyway, we decided to come back another time since the chance of a table large enough for 7 opening up soon was pretty slim. We were about half a block away when the host came outside and told us he had figured out a way to make room for us! They cleaned off the large booth in the kitchen at sat us there. It was an awesome experience, the kids loved watching all the food being prepared.Food has always been 5/5 for us. We love the chicken meatball skewers, sushi rolls, chiryashi, salads, ramen and tonkatsu sliders. Awesome happy hour specials 7 days a week. It's pretty rare to find an awesome sushi restaurant with a kids menu. But you should definitely not go there because that will just make it harder for me to get a table ;)"], ["Meredith S.", "Ran across the street to grab a bite to after a full day of crazy day of data analysis. Wanted to have a glass of wine, pick up some sushi and head home. I was not expecting anything special to be honest. Well hot digity it was quite good! I sat at the bar during peak time, the service was great, the bartender was extremely knowledgeable and attentive, the selection was almost too much, so many great choices! My sushi was spot on, the scallops - wow! I thought the prices were fair, i loved the partnership with the Monterey Bay Aquarium and the focus on sustainable fishing practices!Until tonight I had my 2 go to Minneapolis sushi favorites - not anymore! Kyatchi will get another visit really soon!"], ["Shawn S.", "Kyatchi has a place in the MPLS sushi scene.  They have great sushi - but this is not their only focus.  The story is that when former Twins pitcher Nishioka was cut after a high salary and less than commensurate performance, the personal chef he hired decided to stay in the cities and open this place up.Here - you are gonna order bites for $3-8 like skewers, miso, creative salads, rolls, etc.  Or you will go for the sushi platter.  Or maybe a hot dog in  nod to baseball past.Or perhaps some soba or udon noodles.  And maybe some sake or choose from the large tap selectionWhatever you order, it will be well prepared, and the servers are knowledgeable and committed to the success of this place.NOTE: at the time of this review they did start taking reservations."], ["Christopher O.", "I consider this my neighborhood joint, as well as my favorite new(ish) restaurant in the Twin Cities. Every visit has topped the previous one with my selections. The service is great--especially the owner/hostess--and the chef absolutely knows his business. I like to support sustainable foods when I can, and if it were all as incredible as the menu here, I'd do it all the time. I've tried quite a few things here. The ramen is very good, but the tsukune donburi (a chicken and rice dish) is sort of magical. The hot dogs are awesome--one of my buddies claimed it was the best he'd ever had. The Chirashi (a sashimi dish) was remarkable.They have a nice selection of sake, including my favorite Otokoyama. The last time I was there, however, we tried some of the sparkling sake--it was a little on the sweet side, but delicious. It would make the perfect celebratory date drink.If I have to sum up the wonderful Kyachi in three words, it would be these: Order the scallops."], ["Dan And Mo D.", "We were looking for a sushi place somewhat late at night and this was one of the restaurants close by that had good reviews. We had high expectations but it wasn't that good for the price.We ordered quite a few rolls and other than the sushimi and chicken skewers, which were awesome, everything else was okay but nothing special. The pork belly skewers were not very good - they had a lot of fat. We also tried the hot dogs, which were unique. We got both the Yakisoba and House - we would recommend the former. The service was pretty good but if you're looking for a good value, you may want to go elsewhere."], ["Cristina Y.", "This place makes one killer egg and avocado hot dog! This was the first time I've gone there to meet up with my friends and the servers and hosts were so sweet. We definitely overstayed our welcome after our dinner was finished, but the hosts were attentive coming back to ask my friends and I if we wanted other drinks as they refilled our waters. I'll be coming back for more hot dogs!"], ["Courtney S.", "Fantastic food! We live just down the street and went twice the week we found it! Owner was super nice and was there both nights helping, great service."], ["Ashley O.", "Amazing Ramen, unique hot dogs, rolls are sustainable & authentic, and the baseball theme = home run! This Chicagoan will be back every time she's in the Twin Cities. Bravo!"], ["Leigh L.", "This place was amazing! Friendly and welcoming. Laid back. I've never experienced mouth watering sushi AND gourmet hot dogs, all freshly made and absolutely delicious. A must try!"], ["holly v.", "This place is amazing!  The food was incredible, the staff was attentive and friendly, and I love all of the traditional decor mixed with baseball memorabilia.  As a vegan, I was skeptical that there would be much to eat, but I was absolutely proven wrong!  Lots of the menu can be altered, and our server went above and beyond helping us through the ordering process.  I don't know what the deal is with all of these people giving mediocre reviews to their agedashi tofu, because it was absolutely the best tofu I've ever had!  Also, they are super sustainable, which makes their prices totally worth it. Can't wait to go back!"], ["Madeline R.", "This is the best sushi I've had in Minneapolis. It's fresh tasting and has amazing flavor combos. This is high quality sushi (I'm from LA so I think I have a good sense). HIGHLY RECOMMENDED!"], ["Jim K.", "Best seafood in a 2000 mile radius. Shut up and come.  I'm here at 6pm, every Sunday.  So amazing.  That is all."], ["Michele V.", "If you are looking for sushi, this is the place.  This was my third visit.  I am impressed with the friendly and knowledgeable staff, the service, freshness and quality of the food.  They have a welcoming atmosphere.  The patio is open.I have had many of their dishes and ALL have been wonderful!    I will be going back."], ["Chris L.", "First visit review.  Came in with high expectations.Service was a-ok.  Good selection of craft beer and wine.  Our party of 3 liked the hamachi sushi special the best.  Much of the rest was simply passable -- best of the rest may have been the squid and the beef tenderloin skewer.  The chicken meatball entree was akin to, but a step below, the yum-yum bowl at WSK.  The curry dog just didn't do it for us -- skin too tough and not enough curry flavor in the cabbage.  The japanese pickles were quite odd in our book -- lightly marinated raw vegetables would be a better descriptor.  All in all we were hoping for better.  But not a disaster and it merits a second look.  Sadly, the only remaining dessert was a sorbet.  We did get right in a 7pm on a Friday -- you can't beat that."], ["Heather L.", "I really, really wanted to like this place. I like the concept, and I am a huge fan of the sustainable practices. But it was just a little disappointing (and expensive).Sushi was good - fresh and good size pieces. The chicken ramen was ok, but it didn't seem hot enough. We also had a few of the chicken skewers which were pretty good. The beef tataki was also good (and very expensive). But the biggest disappointment was the onigiri... I was so excited because I've had onigiri in Japan and was hoping this would measure up, but it didn't even come close.Overall the food was OK. I guess I had higher expectations from hearing the press about it."], ["Seth L.", "Really interesting to see a hotdog on a Japanese restaurant's menu. It was delightful. I had some of the pork belly skewers to start out. They didn't get too greasy but we're cooked to perfection. The hotdog with noodles kept true to both the American roots while tastefully adding a Japanese twist. Very good."], ["Takashi S.", "actually I wanted to give 3.5 while I liked the place and I will come back. Foods were good, very good.  Authentic (for me, Japanese) except ramen was instant noodle (I am pretty sure).  grilled fish, soup, sushi and lots of izakaya items. Liked the decoration of the restaurant also.  I can tell the owner loves baseball.  Nice simple design. I went in 7:30, busy time.  So I guess the service would be better next time (the server didn't bring napkin, chopstick, soy sauce etc till I asked). Not so important when food is good... but just a note. I guess prices are very reasonable.  3 of us became more than full and $60.  Quantity and quality (again except ramen I love). well, I will go back and taste more for sure."], ["Jessica B.", "We resisted trying Kyatchi for quite a while, loyal to another sushi spot in town. Thank goodness we came to our senses and realized we can have multiple restaurant-loves! The onigiri (rice balls) make us feel nurtured and comforted, and we've been eating several a week, quite happily. They are filled with either salmon, bonito flakes and soy, or pickled plum (my favorite, tickling my tastebuds with the blend of flavors), and although one teen wishes there was more filling, the audible \"mmmms\" tell the full story. The skewers we've tried were all delicious, especially the succulent pork belly and the  steak with sea salt, and every piece of sashimi we've ordered has been fresh and delicious and impeccably cut. Another standout is the sake oshizushi, which is a gorgeous presentation of pressed salmon, lemon, rice, and tobiko that is well-balanced and fresh and delightful!We've dined in and taken out and had nothing but wonderful service each time. Seems some of the earlier reviews might've been before they worked out the kinks, because I've seen nothing lacking in service or food.The best part? Their focus on sustainability! I'd rather fast than eat factory-farmed meat, but no fasting is required here, and each bite of fish may be taken with gratitude, reverence, and free of guilt. Thank you, Kyatchi, for this gift to us. You satisfy our family of foodies, and you honor our planet with your awareness and dedication to respecting and preserving the inhabitants. And you feed us such deliciousness, we moan in thankfulness and smile contentedly."], ["Lana J.", "Went for happy hour and selection is sparse also my tuna tatami was grey and smelled fishy. manager, waiter? Challenges me and argued that it's suppose to be that way. Also, place needs shades or curtains to block out bus stop. Won't frequent this place. Also nothing spicy, bummer..."], ["Timothy F.", "Kyatchi definitely has some amazing food, but it also has some work to do in the area of service.  The various rolls and sashimi were delicious, and there is great variety throughout the menu.  The inclusion of hot dogs on the menu is fun and the House Dog was delicious, as long as it was hot.  Once the hot dog started to cool it lost much of its flavor and juiciness.The real drawback during my experience was service.  The restaurant filled pretty quickly and there were only two servers to take care of the entire restaurant and patio area.  After sitting at our table for over five minutes, our server asked us if we knew what we wanted to order, while failing to notice that we hadn't even been given menus.  Food delivery was very slow and it was nearly impossible to get our server's attention.  The worst part was when we asked to have our ramen packed up for us to take home since we hadn't eaten very much of it.  The server took our bowl and dumped it; she only returned to our table with our bill.  Dirty tables were never cleared even after customers were gone, even with people standing in the doorway.  At one point a chef came out with a bus-tub, cleared one 2-top, and then returned to the kitchen.  Given the delicious food, the terrible service was a real black eye on the experience.Kyatchi has some real potential and I will definitely give it another chance.  Hopefully service will improve as time goes on."], ["Chris R.", "Come for the sushi.  Stay for the hot dogs.  I normally don't write reviews but this is the best hot dog I have ever had.  The sushi was very good as well."], ["Ronnie G.", "Meh.I really really wanted to like Kyatchi. And that's not because the owner said baby G. was the cutest baby she saw today.Walked in on a Sunday afternoon. It was empty, which is okay, it's a new place. The area seems up and coming, cool that it's trying to be part of an evolving neighborhood.I dug the decor. Not stuffy, a little hipster, bright and open.Menu was pretty interesting. Looked fresh, nicely designed. Food was actually reasonably priced. However, what came out was slightly different than expected.Best example was the sake oshizushi. Salmon, fish eggs, slice of lemon. Cool. Unfortunately, when it came out, the ratio of rice to salmon was way off. It was a thin slice of salmon and then topped with a lemon slice. For $15.Is it that the owner thinks people will trade quality for the fact the food is sustainable? That won't fly. It could work if it was in a better location but people won't come out just the food is sourced well.Good luck to Kyatchi, I do hope they figure out the right balance."], ["Kee S.", "This is a great place to eat some sushi or try something a little more fusion.   The dogs are great and the staff is friendly and helpful.  Prices are decent and they focus on sustainable fish and local meat products.  Don't miss out on this place.  Kyatchi, roughly translated, means catch.  The decor is playful with the word.  Decorated with Japanese baseball jerseys and Japanese art of different fish.  It's a fun, relaxed atmosphere."], ["D B.", "Food was not good on our visit.  We left hungry and unsatisfied and finished our dinner at Blackbird down the street.Staff a bit disorganized, hostess bored.We prefer Obento-ya."], ["Brea E.", "First time being here and loved everything about, very reasonable price...coming back here"], ["Ian W.", "Though I have been a faithful sushi goer at another establishment I decided to get out and try something new.  Kyatchi was a great place, great ambience, perfect for a winter night.  They have great nigiri, and my wife thought it as the best nigiri she has had in MPLS.  The tap beers were great, good selection, some different selections from the usual as well.  We also had some miso soup which was good, kind of like my own better but the sushi roll we had was great.  It was the special and had a unique and great flavor, we loved it!  I will definitely be back to try our the hot dogs and their entrees!"], ["Azlan M.", "Love their ramen and agedashi tofu. Sushi rolls are really good too. Really cheap happy hour and our kids all like it too. Friendly staff and good sake."], ["Alexandra B.", "I'm an adventurous person, so I was willing to try anything. But the menu descriptions left me in the dark which was frustrating. Kyatchi makes a claim to authenticity, so the hot dog menu had me scratching my head - even if it's good, it's not what I came for! That being said, the Sake Oshizushi was delicious, as was the Kanpyo. The Tamago was interesting and I enjoyed it, but it was not something I'm accustomed to. Warn people about the Ume Shiso because it's hit or miss (I liked it). The sorbet, cantaloupe lime, was the highlight of the evening. I miss the black sesame pudding!Kyatchi has the potential to beat out the sushi restaurant competition by being less commercial and more relaxed, with an almost café-feel. I appreciate the authenticity but it's not consistent throughout the menu and I wasn't always sure what I was getting."], ["Mallory K.", "I absolutely love this place, it is a total hidden gem! The sake oshizushi is hands-down the best sushi I've had since I lived in Tokyo, and the lemon garnish is really refreshing. I'm also a big fan of the hotdogs. On top of that, the owner Kim is super attentive and really friendly, and you can tell she cares about giving her patrons a good experience. In short, great, authentic food, and amazing service. A must!"], ["Sunny R.", "SO SO SO good. Went last night and was amazed by the quality of the fish and the hot glory of their ramen. Everyone around our table had a lot to say about their meals, it came out mostly in 'ooohs' and 'ahhhhs' - that good."], ["Kelly S.", "friendly neighborhood place with great music and even better food! unique fresh citrus'y fish that will leave you wanting so much more! get the pressed sushi Suzuki or salmon with roe and roasted shishitos. we will be back & if it's consistently delicious & if the happy hour measures up I'll up my review to the full five stars!!!"], ["Karen S.", "A group of 5 of us went here for lunch.Good points: great decor and good server.The chicken meatballs which come on skewers and as part of a donburi bowl are great. The Tsukune Donburi bowl with the chicken meatballs and poached egg is delicious and a good size. rice is good.However only 1 of us got that bowl and the rest of the food was unimpressive.As mentioned by another reviewer, the \" small \" plates are actually micro plates.The sushi choices are limited and costly for portion size ( e.g. compared to Sakana).The soups were not as tasty as those in many Japanese places.Prices were very high, $125 for 5 of us for lunch and no one had alcohol. We prefer the food at obento ya."], ["Lauren P.", "If you want great, authentic Japanese food, here is your spot.  This place is not just like every other sushi bar in the city, it is so much better. Their sushi dinner and Japanese hot dogs are to die for. The chef is amazing, and the friendly owner checked in on our table after every course to make sure we enjoyed our meal. The sushi dinners are an amazing deal for sustainable ingredients and the freshest fish you'll find in the city. We will continue to return again and again."], ["Jen N.", "Best Pork Ramen yet! I have recently been on a ramen kick and wowza! I'm usually in need of sriracha to give my soup a boost but not necessary here. I appreciate the good service and attention we recieved on a very busy holiday night.  The owner was polite and thoughtful, saw to it that we were satisfied. ( I think it was the owner!) We will be back!! Yum!"], ["Nicole H.", "I have gone to Kyatchi multiple times, and I have never been disappointed. Its one of my favorite sushi places in the twin cities. The service has always been very prompt and nice. The sushi rolls are reasonably priced and really good. Great beer list as well. I would recommend Kyatchi."], ["Kimi H.", "Kyatchi is not your average Japanese/sushi place, and I mean that in the best possible way. Husband and I just came back from eating here, and it was so good I was compelled to immediately gush about it in on Yelp. When I say it's not your average sushi place, I mean don't expect to find a menu full of specialty rolls and overpriced cocktails. In fact, the sushi roll portion of the menu is small - maybe eight items. And not a spicy tuna roll in sight (which was a bummer at first because I love me some spicy tuna rolls). Because of this I'll admit we were a bit taken aback when we first sat down with the menu. While there was no gyoza or wasabi shumai, there were...hot dogs? And something called 'pressed' sushi? What the heck? Unfortunately they were out of hot dogs, but that's okay because everything else we had was, for the most part, FANTASTIC.I'll start with the least impressive: the tofu salad. Yeah, I don't know what I was expecting; it's tofu, of course it was bland and weirdly textured, like tofu always is unless it is deep-fried into deliciousness, but the creamy sesame dressing was great and made it taste better/have any taste at all. The avocado rolls were AMAZING. I know you're thinking, \"Avocado rolls? Big deal.\" Well, I'm telling you they are a big deal. A delectable blend of the best sushi rice I've ever eaten, combined with a generous portion of perfectly ripe, perfectly creamy avocado. Lightly dipped in the (also fantastic) soy sauce, it is the best avocado roll you will ever have. EVER. (About the rice: it is phenomenal. SO many sushi places have such mediocre rice. Not Kyatchi. I have never tasted sushi rice this good. Each grain is plump and squishy, yet still textured enough to provide the perfect base.)In short: at $4 an order I can safely announce Kyatchi has the best, most valuable avocado roll in Mpls, if not in all of the land, and I plan on ordering it often. Pressed sushi with lemon and fish egg: DROOL. The salmon was SO fresh. The rice (as previously mentioned), SO good, and then it was topped off with a thin slice of lemon and a smattering of roe. Simple, but oh-so-tasty. I would warn that you should probably really like lemon if you want to order this dish, as it is very lemony, but I am obsessed with lemon so it was all good. Also, it is different than any sushi I've ever had in that it is sort of like nigiri, but pressed into a square, and in the menu it's lumped in with the rolls and not the nigiri/sashimi. Husband loved all his food, but he especially loved the chicken meatball skewer. We've already made plans to go back so he can try the chicken meatball entrée. I, for one, can't wait to try everything on the menu!The service was fantastic, and everyone was so nice.  All the staff and servers seem super pumped about being open, and you can tell they really feel passionate about the food and location. Twice we were asked if we lived in Kingfield, so it's clear they're invested in the idea of being a neighborhood place. Tl;dr:Kyatchi is fantastic; the food is phenomenal, the service is great, and the prices are reasonable. I look forward to making it one of our neighborhood go-to spots for food and drinks!"], ["Shelly E.", "Great melt-in-your-mouth multi-flavor-layered food (おいしい!), the best service (Tim was very attentive, helpful and thorough) lovely atmosphere (and music!) ... There are many more things I want to try - I'll definitely be back ^^"], ["H L.", "Tried this place last week. Very unique, unlike other sushi places I've been to. The service was outstanding, the sushi was good but the real standout were the hotdogs! Loved the dog with avocado and egg so much we ordered a second round. Tofu salad was very plain. Quality is high and you pay a premium for it."], ["Ben C.", "Been meaning to try this place for a while now and boy was it worth the wait. We went for happy hour and I can't wait to go back and try more of the sushi and other menu items ( I'm looking at you, ramen). The sushi is the standout item for sure. I am always super skeptical of sushi in the twin cities. Most of it seems to be those ridiculous dragon rolls covered with a million sauces and gigantic slices of avacado - GROSS. Thankfully that is not the case here. These minimalist flavor bombs have to be some of the best in the Cities, which probably has to do with the fact that kyatchi sources their ingredients from local fish farms and what not. You can read about it on their site and they also tell you when you order. All I know is that the fish had great texture and flavor. We had salmon, iwana(sp?) and mackerel nigiri and all three melted on our tongues each with their own unique flavor. Honestly, at times i actually wondered whether or not I truly enjoyed sushi because of instances around these parts where even salmon nigiri produced an urge to wretch. Case closed. I LOVE nigiri. Fack. So effing good. Apparently it's just been that long since I had quality stuff. Man, they were yummy. As for the other menu items, they were also tasty. The tomato skewers really stood out and so did the hitachino beer. Yum. The curry dog was ok. It's topped with a kraut that's flavored like Japanese curry. I was impressed that it tastes just like the curry Japanese and Koreans put on rice and fried pork cutlets, but it just wasn't all that great on a hotdog. Thats not to say it wasn't bad though, just not my fave. I still snarfed it :-) Overall, kyatchi was great. Tim, our server, was really attentive and nice as well. Place was a little cold this time of year but meh. Just warm up with some hot sake. Can't wait to try the other seafood items and gorge on the sushi now that I know it's awesome."], ["javad k.", "Great atmosphere and fresh sushi!"], ["Tony K.", "First time here and loved it! Yakisoba hotdog? Heck yeah, it was delicious! Ramen? It was terrific and is better than most in town (best broth around!). We will definitely be back again real soon."], ["Alice W.", "Food was pretty good but portion was really tiny for the price. We waited 25 min for our food and so the wait built up a lot excitement and anticipation for the food. I guess the first bite didn't blow us away as expected. We ordered the square sushi roll with sake and lemon slices, but the lemon was a bit overpowering. We also had the sake and hamachi sashimi which tasted fresh. The avocado and egg hot dog was ok but maybe was missing a sweeter ingredient to pull it together. The momo and beef skewers with yakitori sauce were a bit bland actually. The owner and waiters were really nice though."], ["Bridget L.", "I have been eagerly waiting Kyatchi's opening as I walked by and saw their  \"sustainable sushi coming soon\" sign.  To explain my excitement, I love me some sushi but I've watched enough nature films and documentaries to make me stay away or feel horribly guilty for eating sushi.We went in on their opening night, by accident mind you, and were greeted right away by the owner who was extremely friendly and such a gracious host.  It has a great local, community feel to the restaurant.  There were three of us total and we wanted to try as much as we could from the menu and I can honestly report that it was all amazing!  Our server was very helpful and answered all our oddball questions.My absolute favorite was the sake (salmon) sashimi with the hotate (scallops) sashimi following as a close second.  We tried a few different rolls which were also all delicious.  Another member inch my party favored the Big Roll above all else.  The shiitake mushroom and the pork belly skewers were melt in your mouth goodness.  We also had the house hot sake which was a nice addition to the meal.  We ended it with the black sesame butterscotch dessert and while I don't like butterscotch, I love blacks sesame and that dessert did not disappoint.  It inspired me to try to find some black sesame dessert recipes to try on my own.The price is a little higher but not by much and as cheap as I am, which is pretty cheap, I'm willing to pay it to feel good that I'm not completely destroying vast amounts of ocean creatures just so I can have sushi.  I'd also like to note that unlike some sustainable restaurants that raise the prices of everything on the menu, Kyatchi's menu was very reasonably priced in areas where the sustainability factor didn't come into play (i.e. drinks, desserts, soups, etc.)I had waited so long for them to open and even with such high expectations, I was still blown away by the quality of food and the friendly feel of the place.  I will definitely be back!"], ["John W.", "Quiet on an early Sunday evening.  Daily happy hour from 4-6 includes $2 off draft list, which has a lot of good local beers.  Started with some gyoza, very fresh noodle and good filling, nice subtly citrusy soy dipping sauce.  Mackeral with sea salt was crispy and delicious.  Avacado roll and daikon rolls were nice veggie options.  Other foods ordered at the table were chefs choice, which would be great for die hard sushi fans."], ["Zorah J.", "First things first this is a strictly dinner establishment, which I didn't know the first time I tried to go. I did however make a second attempt for an early dinner. The food was ok. I'm more into rolls than sashimi and nigiri so I was a bit disappointed to find out they had way more variety in the sashimi/ nigiri category. They definitely have a simple theme when it comes to their food which I liked. We tried some the guy tataki, rolls, some nigiri and I had the ramen. The tataki was good. The ramen was just ok, nothing mind blowing if I'm honest. The sushi rolls were good and the nigiri was ok, although it didn't convert me. All in all it was ok ( kind of expensive but most sushi places are) but I'm not rushing to go back."], ["Josh R.", "Great atmosphere. I read a review that said ramen was salty but our ramen was perfectly seasoned. House dog was good."]], "Sakura Restaurant & Sushi Bar": [], "Osaka Sushi and Hibachi": [], "Akita Sushi & Hibachi": [], "Saji-Ya": [], "Red Lantern Sushi Bar": [], "Nakamori Japanese Bistro": [["Richard J.", "Amazing Tuna roll is as the name says and the presentation is beautiful. Tempted by the Lobster Roll and Pink Lady.Everything is very fresh and clean. Will definitely be back. Also, enjoyed the Sho Chiku Bai Sake. Warm, pineapple and juniper spice. Incredible."], ["TC C.", "Great service, clean place.  The Hawaiian roll stands out.  The sushi and sashimi pieces are just okay.  They were fresh enough."], ["Matt H.", "Our kids favorite!  Tempura, great noodles, edamame and fantastic waitstaff make this our go to choice for Japanese !"], ["Jordi B.", "Great sushi and sashimi place. I had the sashimi entree, which tasted great. I also had a special roll and it was fantastic. I'll be back."], ["S L.", "My group really enjoyed the rolls. The black dragon and spicy girl were excellent. Highly recommended."], ["Emma N.", "I really like this place! First time eater.Came here with my boyfriend. We were greeted by the sushi chef and server as we walked in and was seated right away. It was a really nice welcoming. We order sashimi/nigiri lunch. And a few things from lunch. Everything was delicious. We started off with a miso and onion soup. It was super light and delicious and it came out a perfect hot temperature! Most sushi place I go to the soup are pretty much just warm. Had the squid salad to share and that was nice and flavorful. Definitely would order again. Also order the shrimp and vegetable tempura off happy hour. It was really good. I usually just get just vegetable tempura at most places. A lot of time the shrimp would come out too soft so it's not my go to app but I decided to try theirs. Their shrimp tempura were so flaky and had such a nice crunch to them. And their tempura sauce was also flavorful but light if that makes sense. We had some nigiri and sashimi. They were nice as well! I like how it was nicely cut. And not so thin or too thick. It was just right. For the nigiri it was perfect amount of rice. Our server was very attentive. Always gave us refill on our water once he saw it was empty. And cleaned empty plates promptly. Also even tho we were seated at table. The sushi chef would come over and check if everything tastes fine. Which was nice. The man preparing our meals checking in. Will come again! For sure!"], ["Chad W.", "3.5 stars overall but a 3 would be a bit unfair.  Compared to other options in the immediate area though, I think it's a great choice for fresh quality sushi.  Can't speak to the rolls as I'm not a roll guy, but based on everything else we got, they'll be a solid choice.  Overall I wasn't blown away, but would classify here as a good quality, dependable option.  For an entree I ordered the sashimi dinner, which came with 15 nicely cut pieces.  It consisted of the basics -  tuna, salmon, snapperWhat impressed me here was the quality of the fish.  It was definitely fresh and not recently-defrosted.  The tai was actually tai, complete with skin, which you don't actually see very often (often tai is tilapia or some inferior fish).  They also have plenty of hot/cooked Japanese cuisine as well as a full bar.  The grilled squid and gyoza where okay but again, not memorable.  One thing to note...it seems pretty spendy for the area.  Non-HH special for 2 pieces of sush was $6 for spicy tuna, $8 for ikura, $9 for uni, for example.  If you didn't go for a \"dinner\" you could drop some serious coin here.  If that's your style, go for it, because you won't be disappointed.  But if you're looking for $7 or $8 futomaki rolls, you're not going to find them here.  Notes:Quality of fish - 8/10Quality of non-fish sushi - n/aQuality of non-fish dishes - 7/10Happy Hour:  8-close (don't recall the earlier one, but they have it)"], ["Simon S.", "It was very good, reasonably priced, good selection and great service. Great selection of rolls and sushi. It may not be the greatest in the world but it's quality at a good price and super convenient. It's a bargain and I give it thumbs up!"], ["Alex D.", "Was my first time here and I was extremely impressed. Very friendly staff and excellent service. Got sushi and it was excellent as well. Very reasonable prices for top quality.  Would 100% go back here again!!"], ["Jon M.", "Me and my wife had stopped in for date night for dinner. The staff was energetic out going and professional. Overall the service was fantastic. The sushi that had arrived to the table was presented wonderfully and executed to a high caliber. Me and my wife will be returning soon because this place is not a place of disappointment. Thank you for a wonderful meal and a out going atmosphere. One small thing that would be nice is a little bigger variety of saki on the menu."], ["Adam F.", "Usually I brag about the food which I will, but I have to start with the staff. Incredibly friendly. First time here, but they made us feel like regulars. I had the winter roll which had the perfect balance of spice and crunch. And the place didn't smell like so many places do that serve sushi. With our entree we got soup, salad and hibachi. Normally we get it with rice. Do yourself a favor and get it with noodles. Great food all around. I had scallops and my wife had chicken.Unassuming place in a strip mall. Don't let me this stop you from going to this gem."], ["Tom G.", "Parking can be a little tight but it is worth it.  The wait staff is delightful and the food is just as it should be.  Authentic as you want it to be with awesome teriyaki chicken for people like me.  I will be back again soon."], ["Garrett E.", "Being a corporate pilot and traveling all over, I try to sample sushi from around the country.  This has some of the best so far!!   Highly recommended.   I had the Winter Roll and it was amazing!"], ["Sarah S.", "This place was a surprise solution to our dilemma of impromptu Saturday dinner date night. Where to eat? Shall we venture into Minneapolis or stay local? Shall we do Mexican, Chinese, American, or Fancy? Of course, we consulted the wonderfullness of Yelp and found that a new sushi place in our Edina neighborhood opened up. Even better, Happy Hour was 8pm til close and I am always down for happy hour sushi.Nakamori is located on in a strip mall off of France Ave. When we went, there were only a couple of tables of people, but there appeared to be ample seating for any high times. It had really cute decor, modern, and was generally a nice place to eat. Our server was very attentive and friendly. Their happy hour menu had plenty of variety $3 tap drinks, $1 apps, $4 salads, and sushi rolls ranging from $4-$10. These included specialty rolls. The seaweed salad: This made me feel less guilty about eating sushi and skipping my fiber portions. I've never had seaweed salad, so had nothing to compare it to, but it had a nice crunchy texture and was lathered in a sesame seed oil and vinegar dressing that was slightly sweet. For $4, I can have this salad to accompany my many sushi rolls and not feel terrible about eating out. The sushi: I ordered the Spicy Girl and the Winter Roll. Winter Roll was awesome hands down. Spicy Girl was good, I just didn't expect the fish to be ground up and rolled in the rice. I judge the sushi by the freshness of the fish and the creativity around the flavors and textures that are brought together by the ingredients. The Winter Roll embodied this meeting of flavors and textures really well. I look forward to trying other rolls with a bit more crunch to complement the winter roll. Tempura ice cream: there are many flavors such as mango, green tea, red bean, vanilla. We went with vanilla this time and it was okay. I have had the tempura much crunchier at other sushi/hibachi places, and unfortunately this was the disappointment of the meal. I am hoping that this was a fluke, because I would really like to try the red bean next time I am there!As far as non sushi food goes, my husband enjoyed his hibachi chicken that was accompanied with soup, salad, noodles, vegetables, and shrimp. He opted to add extra fried rice for $3. Chicken was flavorful and moist, vegetables were perfectly stirfried and most of all the fried rice was not wet and nasty, but a delicious blend of egg, oil, and rice. Yes, we have eaten at places that screw up fried rice, and we were glad this place was not one of them. We'll be back for sure to try the many other items they have on their menu."], ["Amber J.", "Have been here several times now, and I've got to say this has quickly become my favorite sushi spot! Nice portions, fresh fish and an awesome happy hour. What's not to like?! After trying quite a few rolls, the winter roll is probably my favorite. And I can never pass up a bowl of onion soup! Yum!"], ["Matt B.", "Second time here, waitress is very sweet!Their lunch deal is excellent - the portions are great! (Sushi rolls are tasty!) Definitely coming back!"], ["Katey S.", "Lovely atmosphere and customer service! Sushi was on point.  I had the pink lady, spicy tuna, and fancy ninja rolls which were all delicious and unique.  For dessert I had a hard time deciding between the red bean and green tea ice cream.  I ended up getting green tea but the server was very sweet and put a sample of the red bean on the side so that I could try it! I would defiantly go back and recommend!"], ["Craig S.", "Really great value!  What can I say, their fish/rice ratio is awesome; picture a perfect spicy tuna roll with just a thin layer of rice and about 85% fish.   I'll be back"], ["Patti K.", "Beautiful cut stone walls. The friendliest and most attentive service I've experienced in ages. Furniture and decor sure to attract a hip yuppie crowd. Flat screen TVs for the ESPN and CNN sets. I sure wish the food matched the rest of the experience.Like many other sushi joints in the area, this place will probably satisfy 90% of the likely patrons. But if you actually care about Japanese food, you will be disappointed. The salad dressing tasted suspiciously like the dressing you get in a Big Mac, with some grated ginger and radish mixed in. The miso soup was not bad, but also not authentic. I strongly suspect they simply added miso to the clear onion soup they serve with the bistro entrees. My husband's sushi roll, wrapped in a bright pink soy or rice paper, was a tasty tempura lobster/crab creation, but the crunch and spice overwhelmed what real sushi should be about: the rice. I couldn't taste whether or not it was real sushi rice. My salmon teriyaki entree was not bad. The first bite was very tender, but the salmon got drier towards the center. Generous helping of two salmon slabs over a stir fry of onion and asparagus. The rice was a little dry. We stopped by because it was close to the movie theater and we had a coupon. Hubby will probably get lunch here because it's close to his work, but I won't be going back. For the same money, I can get more authentic and better tasting Japanese food closer to my house. Come on, guys! A little more effort in the right places will go a long way. You don't need 30+ different kinds of sushi rolls to impress. Start with eight rolls that you do really well, and work to perfect the basics. You can probably lift better dressing and miso soup recipes from Epicurious. From the reviews so far, though, I imagine you'll do pretty well regardless of what you do."], ["Pearl H.", "I LOVE Japanese food, but not sushi. Sometimes these days it's hard to find a Japanese restaurant where all of the food, not just the sushi, is worth writing about. It was my birthday and I wanted Japanese. I googled \"best Japanese food in Minnesota\" and this place came up. i enjoyed the salmon and steak hibachi.  The salmon was sushi quality and was AMAZING. Will order that by itself next time. The service was very attentive and appreciative. My 13 year old wants to be a chef and was mesmerized by the sushi chefs. One of them was so patient and made the night even that more special. Will definitely return!"]], "Sushi Takatsu": [], "Tanpopo Noodle Shop": [["Jennifer S.", "I still love this place. This summer, I've eaten dinner here twice and both times the food was excellent. On the first occasion, an appetizer special consisted of pan-fried tiny cauliflower-ets with a light, flavorful rice-wine dressing. The second occasion offered  an appetizer special consisting of pan-fried dumplings with a light, flavorful dipping sauce. Both appetizers were remarkable and memorable. Both times, I ordered the Nabeyaki Udon. Oh, so delicious! As a reminder, a 15% gratuity is automatically added to each and every bill. My guess about the reason they do this is because in Japan, tipping is rather an insult (according to friends who have spent time there). And besides, wait staff ought to receive at least a nominal amount gratuity and more still for great service."], ["Madina T.", "I had the udon noodle soup. It was really salty. I had high expectations as this place is known for their noodle soup. Not that impressed. The space itself is beautiful! Love the beautiful wood tables and decor."], ["Nhi V.", "A hole in the wall noodle shop with quiet and relaxing ambiance. Pricing for the noodle bowls were  decent. As for the beer it was a little steep, perhaps go elsewhere for drinks. The food was superb though the portions could be a little bigger. Parking is a hassle here and a downer is the 15% gratuity added on to the bill automatically. Service was mediocre. Love going here in the winter for hot noodle soups! We ordered this time :Tempura udon soupKimchi nabe Nabiyake soba"], ["Gary H.", "It started off a little shaky. We had reservations for three, but when we showed up our seats had been given away. However, after a short wait, we were seated. The server was friendly, professional, and knew the menu. A couple of us had the special, which was dumplings with soup, salad and rice. It was all tasty. The atmosphere is simple and comfortable."], ["Lyn C.", "The staff are very friendly and welcoming. Waits can be long and there aren't that many tables. The food is also tasty, but it wasn't enough to bait me into wanting to come back again. The Kimchi Udon's broth was ok, the chicken akage and tonkatsu were cooked well, but I've had better. My dish was the wild mushroom udon which was really tasty but lacked a \"wow I can't get enough of this\". The beef though that I requested to be added into my bowl was cooked really well. The mushrooms were also good. I wish I got more enoki but there is a good amount of shiitake. Serving sizes are just about right.  The ceramic bowls they use are also a very nice touch.Overall, this is a nice/decent place if you have an udon/soba crave that needs to be sated."], ["Caitlin H.", "Super good. I had the ramen and it was fantastic. Cold ramen was new to me, but I am now a fan. They also had Mochi there too for dessert!!"], ["N C.", "Food is fantastic! We enjoyed the tempura, agedashi tofu, not to mention the wild mushroom udon. The vegetarian broth is to die for. The only downside of this restaurant is that the 15% service charge/gratuity is already included in the bill but the credit card sheet is still printed the gratuity section, which easily mislead customers to put gratuity again... I have been to the restaurant multiple times and never noticed it. I thought they can do a better job reminding customers."], ["Robyn H.", "We went on a little date night here on New Years Day. Waited about 5 minutes for a table, looked around. First impression, it does lack the desired 'ambiance'. The space is wide open with hard wood floors, tables aren't very private. We ordered the California sushi roll to start & the Nabeyaki Udon bowls. The bowl was beautiful AND delicious. On New Years Day, it cured our hangovers. I'm pretty sure it could cure any hangover or head cold. The servers all seemed very young and quiet, but they were friendly. I felt everything was reasonably priced -- a nice place for a quiet dinner."], ["Kien N.", "I parked my car on the side street and saw the sign for the noodle shop.Walking towards the shop, it seemed like this small hole in the wall. OHHH SHITTTT, A HOLE IN THE WALL!! I LOVE HOLE IN THE WALLS!! THIS IS GOING TO BE MY FAVORITE HOLE IN THE WALL!!  My excitement spoke to me, and it was right.  This place is awesome!Though the place was packed, the atmosphere and staff were warm and welcoming.  After soaking it all in, my friend and I were seated at this nice side bar.Going down the menu, there were just too many things I wanted to order.  I finally decided on the nabeyaki udon as it seemed like it was bursting with flavors and goodness.  I don't eat udon often, but I know when I like food and it was damn good, dammit!All around this place is fantastic and I get giddy thinking about bringing new friends here."], ["Maggie H.", "We made reservations here for a birthday dinner for 2. When we got there we were seated at the bar because there wasn't a table ready. Other people were seated before we got a table. What's the point in a reservation if you don't use it ?Anyway, the tofu was great and we were pretty satisfied with the noodles. I love that they have a mushroom broth option. I tried the mushroom bowl - I would have preferred something else. Just not my thing. We will go again. :) (The sake was great as well!) So-so for me."], ["Doua L.", "Love the atmosphere here, nice and quiet great for conversations while slurping down your bowl of HOT noodles! I love the different variety of Japanese beer aside from your Kirin and Sapporo which is a plus in my book! The beer selection alone is worth me coming back, two thumbs up"], ["Rita P.", "It's very infrequent that I go for Japanese Udon because I normally don't like the vegetarian broths used.  However, I decided to try this place out last night since its 2 blocks from my place.  Had the veggie tempura udon (Kaki-age Tempura Udon).  AMAZING!  The vegetarian mushroom broth was very tasty without tasting like soy sauce and the udon was soft.  The only downfall is that aside from the tempura used, no additional vegetables were in the soup (see picture).  Nonetheless, it was very filling and that is why I'm giving this dish 5 stars.  I'm looking forward to sampling the other veggie options!  Hopefully I'm as happy with the rest of the menu.  :)"], ["Katherine L.", "If you like noodles and protein, this place rocks. If you like seafood and fried food, this place rocks.The service is superb, punctual, attentive, friendly and on par with traditional Japanese culture. The decor is simple but reflects the menu's simplicity quite well. It's a no frills noodle shop with fixings that glam it up without adding in attitude. They have specials representative of the season's offerings. Plenty to drink for those who prefer alcohol or tea.Prices are fair. Food is fresh, well-presented and seasoned adeptly.However, it may be a bit salty for my taste. I also was not in the mood for noodles, thus the dilemma in writing a review. I feel that there should be a few more offerings in the appetizer section other than a salad and spinach that are vegan. The miso soup and kimchi are not vegan. The agedashi tofu is definitely not vegan. There is traditional fish broth all over the place in tofu dishes and veg dishes, so just let them know you are vegan to be safe.I appreciate that they have mushroom broth, but it costs extra...... Doesn't seem fair, but then if someone seeking vegan noodle soup had a choice, this is an unlikely first choice.You won't starve as a vegan, but if you are a gluten free vegan, watch out!"], ["Jessica B.", "I wish I could give this place 10 stars. My family goes here at least once a week, it has become our comfort food. The food is amazing and leaves you feeling full but healthy, and not over stuffed and greasy. The food is legit Japanese and everything on the menu is good, I can vouch, as I have tried everything!!! Good price for a sit down restaurant and the tip is included in the total bill!"], ["Rowena N.", "My friend came from Rochester after some intense interviewing, so we thought we would grab some food and relax. After 3 minutes of serious yelping, we decided on Tanpopo.The restaurant was seriously empty when we came (around 6pm on a Friday). Servers immediately seated us. but here's the breakdown:Food: - Sushi rolls are meh. We had the special salmon and avocado roll which came out in less than 2 minutes that we ordered it. (Seriously the server walked over with our slip and walked back with a roll). Immediately, we sighed because likely the roll wasn't made fresh....and it wasn't. Rice was harder and drier than typical sushi rice should be. The salmon was okay, but the cut/quality seemed like it was a bit old (and chewy). + We got the dashi tofu and that was much better. I would recommend this one. The tofu was silky and the green onion and dashi on top reminded gave it extra flavor. The sauce looked like soy sauce but was a bit sweeter rather than salty. Overall, I would get this again. I actually wish we ordered two rather than the sushi roll. (sigh again)+ Nabeyaki udon: My friend ordered this one. The soup base tasted same as mine below but typically most ramen/udon places have only one or two bases and I am not surprised. The tempura and other seafood in there was pretty solid and flavorful. Udon noodles were soft but not overcooked. She enjoyed it and I enjoyed stealing bites.+ Beef udon: I love love love love beef udon. In San Francisco, I almost always opt for this. The hard part is always for them to get the soup right, and not overcook the beef in the process. Tanpopo met my needs! Their beef udon was perfect. The beef slices were still tender and moist when it arrived. The soup was as expected, just seasoned correctly and not watered down. Noodles were soft but not overcooked. Overall I'd say between 3.5 to 4 stars for food.Service:- Although there were plenty of empty tables, the server kept coming back every 5 minutes to ask how we are doing. The first few times were nice because we thought she was attentive, the last 10 times were annoying because we felt pressured to go when a quarter of the shop was still empty. Literally I finished my last bite of my food and she grabbed my bowl so my friend felt rushed to eat hers. Then she did the same thing within few minutes after she's done and dropped our bill. It would be nice not to feel like we are entering a revolving door restaurant ma'am.- This was entirely my fault but I did not check the receipt and didn't know they automatically charge 15% for tip. I probably would have given around the same amount, but being asian we battled for the receipt and I came out victorious. Or not, because I end up putting tip on the receipt not knowing they already charged it. So, I would say it is my fault, but I also feel restaurants who do that (when it is not a group of customers) are just insecure.Overall, service received was off and slightly uncomfortable, so I'd give it about a 2.Parking: + Park to the lot next to the building (if you go further almost under the bridge. It is a prepay lot and at night (past 4pm) it is only $1.Overall, I thought the food was alright. I am not entirely sure if i would return given the food did not exceed my expectations so much, to offset the awkwardness in service. But good try."], ["Karyn P.", "Ok gave this place another try and glad I did. Had the pork dumplings and all I can say is wow I could've eaten a ton of those. Definitely going back to keep trying their specials. The sevice is always prompt and friendly."], ["J D.", "We had high hopes for Tanpopo because it seems to have a home-style approach to Japanese food. We were surprised by the hipstery vibe of the place in person. The food was carefully prepared, but we aren't likely to return because of the service and the challenge and expense of parking. I'm all for paying waitstaff a living wage, so I don't have a problem with an automatic gratuity, but the service we got was pretty terrible. It was really slow and our (incredibly young-looking) hostess/waitress lacked professionalism and courtesy."], ["Colleen B.", "Simple atmosphere, simple menu options and simply great food without a ton of trendy frills. This small noodle shop makes me feel like I'm at home. I've never been disappointed by anything I've tried here and the recipes and flavor combinations are authentically Japanese -- which isn't something you can always say in the middle of the U.S. If you're expecting a lot of overpowering spice and convoluted sauces you will be disappointed since this authentic Japanese food is about subtlety and beauty on many levels. So as long as you're in the proper mindset when you go, you'll be very happy. One tip: I enjoy going here for a weekday lunch more than for dinner since it's usually much less crowded."], ["Ken P.", "Food is really high quality and even amazing. Wait staff does their best but they are so understaffed that service takes forever. You have to be patient when going to Tampopo. Can't imagine how in the world they handle the increased traffic that will surely come with the completion of the Saints stadium. But it is so good it's worth the wait even though parking sucks as well."], ["Justine L.", "Having just gotten back from 2 weeks of eating my way through Japan, I'd say that this place is spot-on good (for Minnesota). Perfect place to go on a cold winter night - awesome noodles, and they reminded me of the udon noodles that I had while in Japan.I've seen some previous complaints about service, but when we came here with our Twin Cities Supper Club, it was decent. We had a waitress in training, and she was slow, but hey, it was likely her first week. The ambience was great - mostly wood building, tall ceilings, relatively warm feel to it, and relatively quiet (I like to be able to hear my peeps while eating dinner). I'd go back - two thumbs up, and that's coming from an Asian."]], "Suishin": [["Laurie T.", "We tried the sampler dinner, so got to try many things.  Enjoyed them all, but Sashimi is my favorite and it was good!  Service.......ummmm....nice enough waitress, but it took a long time to take our original order.  Others were impatiently waiting for service and it was NOT busy .  We had about 8 different courses and unfortunately most of them came at one time and we waited for the first for about 15 minutes after ordering.  Beautiful restaurant inside.  Quiet and nice."], ["Lisa C.", "Fantastic sushi. Husband and wife team work well to provide a great experience. Try the fried tempura green tea ice cream!"], ["Rick B.", "I had to write a review to try to balance this restaurant's overall rating.  As Curtis mentioned, the decor is really quite nice and upscale for a strip mall.  The gyoza was above average. The California, spicy tuna, asparagus and tuna rolls were all very good and reasonably priced. The shrimp tempura roll had a sweet sauce that my wife and I were split on.  We enjoy sushi and have been to all of the best options in the Twin Cities.  We are very pleased to have one which is on par with the best, near home!"], ["Forrest R.", "Suishin makes excellent sushi, and is only slightly inferior to Origami, the best in the Twin Cities.  It rates a full 4.5, and would rate 5 if it had a wider variety.  The quality of the fish is excellent, the preparation is good, especially the hand rolls, and the atmosphere is modern and relaxed.  This'll is a diamond in the rough."]], "Origami": [["Kamil B.", "I am a native Minnesotan who's been living outside MN for more than 10 years. I haven't had many chances to come back, but in 2012, I was able to attend one of my science conferences in downtown Minneapolis. Saturday night I was looking for some excellent sushi and stumbled across Origami. Didn't feel like waiting for a table, so I sat at the sushi bar.  The tea and miso soup hit the spot. Loved the nigiri and sashimi, which were very fresh. The chef was very nice and the atmosphere was ultra chic. This a great place to start your evening right."], ["Ken C.", "Good food, good service, long waiting time during rush hours. Must try its amazing \"UNA-JU\". I also tried \"NABE YAKI UDON\" which turned out a little above average. The \"caterpillar roll\" was good."], ["Harsimran B.", "Awesome sushi.. Lomi lomi salad a must!"], ["Chad T.", "If I was reviewing sushi places worldwide, I might give Origami 4 stars.  But because it is excellent sushi and hands down the best place in Minneapolis I am giving it that extra bump.Fresh fish, great quality options, and if you're with someone who doesn't want raw fish there are other options like tempura or tonkatsu or udon/ramen options as well.Also, they have a great sake selection.  I was surprised to see a yamahai nama genshu on the list (most places in NYC don't even have something like that) as well as a nigori junmai ginjo.  I could stay here all afternoon just tasting the sake selection, all of which is available by the glass, 500 mL, or 720 mL bottles."], ["Amanda M.", "Our male waiter was a DIVA! The worst service that we have had in Mpls so far. We asked him to take a photo of us on our date night (rare opportunity for us) and he refused!!! We ordered our food, he chose not to write it down and he got my order wrong. I told him and he said \"I HEARD YOU SAY......\" Ummm...what? Last time I checked, *I* was the customer. Sushi was mediocre-go to Crave for excellent sushi AND customer service."], ["Tian Q.", "Pros:-Good happy hour deal, $4.75 for 5 standard-sized takoyaki-Great mango hi-chew drinks, I ordered like 4 of those, couldn't taste any alcohol at all when I chugged all of these like a goldfish, then I started seeing rainbows and unicornsCons:-Very underwhelming sushi, caterpillar roll had negligible amount of eel, the rainbow roll tasted very much like the sari roll and both were mediocre, not to mention sloppily put togetherI had high hopes for the sushi here, but they left me unimpressed :("], ["Josh B.", "Great atmosphere! Try the philly X it was amazing....cucumber, cream cheese, warm!!!! Try it out."], ["Adam O.", "Ate here Saturday, had a few sushi rolls, a few hours after started feeling terrible.  Ended up with food poising which I won't explain details of.WILL NEVER EAT HERE AGAIN.  Hopefully you haven't ruined my love for sushi, Origami."], ["Sona P.", "In the Twin Cities for work, I found this place via Yelp and had to throw in another stellar rating.  Had the sushi lunch special, 5 pieces of assorted nigiri and a good sized roll, with miso soup and salad for $14.95.  Very generous portion and fresh.  Wish I could have done dinner there!"], ["Daniel O.", "OK. So my review is a little tempered because: a) I didn't try any of the Japanese dishes, and b) I am rating this solely on the quality of the sushi.So we had the crunchy roll and a roll that was something like 9 Weeks Of Summer. Don't quote me on that one. I have been to SO MANY different sushi places around the country. I'm not kidding. I have had crunchy rolls from almost all of them and I have never had a crunchy roll like this one. This isn't a compliment. It wasn't very good. It didn't have any type of flavor or taste that I would normally enjoy in a sushi roll and I was very disappointed.Next up: 9 Weeks Of Summer (or something like that!). So this one was about a half step above the crunchy roll. It did have avocado and unagi and shrimp as well, but there wasn't really too much flavor. I was kind of taken aback because I was excited to try this 4 star sushi joint in downtown Minneapolis but clearly many people that come here either come for something different or they may have not tried high quality sushi before. I would give it more stars if it was less expensive due to the quality of the sushi.Oh yeah! We also had the miso soup. Very interesting. I wouldn't get it again honestly. It's too bad because there are so many times that I go into places like this one and I'm so excited to maybe find my new sushi place. I've had better, and it's not even close.Sorry, I try not to be so negative, the service is what bumped it up to 3 stars.Service: 5 starsFood: 3 starsPrice: 1 starAmbience: 4 stars"], ["Rhett P.", "I have sushi at least once week and I rely on yelp to guide me for the best Restaurants.. This was likely the least impressive sushi I have every had.  I will try some where else next time.  Crave is 100 times better!!"], ["Terry Scott N.", "This is a four star review solely because of the quality of food and drink.  I won't go into specifics but the courses were great; appetizers and entrees, were amazing; fresh and visually appealing (of color).  The drinks were exceptional (sake and Sapporo), and the setting within the restaurant (placement right in the front window) was, as Ferris Bueller says, \"choice\".  The reason this is not a five star review is because:  I frequent sushi restaurants in town (mpls), and I would have gone for a five star review at Origami except for the poor quality of service.  We came as a group of six, we had made reservations, and we were with friends from out of town.  Our reservations were for 8 pm.  Upon arriving minutes before 8 pm we were told to walk up to the bar, we would have to wait 'some' time.  After arriving at the bar somewhat cramped we realized that our reservations were backed up for other tables and other patrons.  One of our party spoke to a host and after some conversation, back and forth,  we were taken to a table, 20 minutes later a bit dishevelment.  We took our seats and that is when all of the inattentive service began.  -we felt as though our waitress knew -we were a party of six- that she was automatically going to get gratuity, even if she was not providing optimum service.-I was surprised at the lack of support and assistance we received from the staff.  I felt as though our group was on an island; we were waving SOS for service.  We would have purchased more drinks, and possibly dessert, but by the time the waitress came back we were asking for our checks.  I enjoyed the food, but for the price I expected a bit more from the staff.  Also, be mindful of the \"stuffy\"* atmosphere, I think it's a North Loop thing, but IDK.  Otherwise the sushi is quality, and they did play some very interesting music.  Go for quality sushi, but be mindful of the aloof service.  *JLD"], ["Rick G.", "Great sushi, cool atmosphere, and excellent service.  I've been all over, and Origami is a consistent performer."], ["Sarin M.", "Nice atmosphere and food looks good, but was not worth the price. Soy sauce was for some reason way saltier than usual."], ["Rich T.", "Consistently delicious. Origami has delivered tremendously tasty fish, great service and hot sake every visit. One of the better sushi spots in town"], ["Shawn S.", "From the authentic greeting when you walk in, to the hot towel you get when seated, to the cozy sushi bar, Origami is still going strong.  The sushi is top quality.  Over the years, they have survived increased competition and they have the celebrities signatures to substantiate their longevity.  They do have some specialty rolls and appetizers that don't rotate all that often, and a standard roll/nigiri list.  But that's because they stick to the basics and deliver quality vs relying on gimmicks.I prefer to sit downstairs but for some reason when I do not sit in the sushi bar I end up upstairs.Love the authentic origami about the space that help decorate.I also love their green tea - there is some roasted rice in the brew that gives it an awesome unique flavor.Shawn's tip - free parking after 5 in the lot across the street."], ["Sho N.", "My wife and I love both locations. I am a huge fan of Han Toro( Tuna Bacon), its oily and wonderful, I don't find it on too many menu's but when I do, sold! We have tried many of their signature rolls and have yet to find one that didn't taste fresh and great. Highly recommended."], ["Abdalrahman A.", "Best sushi bar in the twin cities. Tuna is super tender, the fish is very fresh and the presentation is great. Rolls are carefully rolled and the the sashimi is fantastic"], ["Sarah Z.", "Origami serves the best sushi in the Twin Cities. The fish is as fresh as it (can) get. The venue is quaint and fits with the traditional Japanese focus (or so I feel). The service is gratuitous and kind.I highly recommend the mackerel appetizer. It first comes out and, \"omg photo op!\" it's so beautiful. You eat the delicate sashimi and admire the fish skeleton that provided it. Then, as usual, your server comes and takes the dish away. But you're not done with it yet... They bring the fish carcass back after it has been deep fried. You can eat the bones--and the eyeballs if you dare. It's a really cool experience!All of the rolls and sashimi at Origami are delicious. Desserts are also a good way to end the meal. Origami is an institution.A great place for a date, too ;-)"], ["Melissa S.", "I wasn't super impressed with the vegetarian sushi options but I left my purse there and they stayed after they were closed so I could come pick it up. They didn't know I was a tourist here for 2 days, but it meant a lot to be able to come get it before leaving town. While I was at the restaurant the staff was very attentive and nice. Cute place nice atmosphere and they were one of the only places open on Memorial Day."]], "Kyoto Sushi": [], "Hiko Sushi": [], "Sakana Sushi & Asian Bistro": [["Kristin G.", "Excellent rolls - the Twins roll was delish, our favorite for sure! Before trying that we had the Spicy Girl and Lotus Roll and I thought those were my favorites! I would highly recommend this restaurant for sushi"], ["Norman M.", "Ok.... First my two star rating is a 2 1/2 but this doesn't allow you to do that. Secondly my low rating relates to waitstaff knowledge and service and restaurant organization.I called in to ask a question regarding the veg udon noodle entree - the girl said she was \" drawing a blank and didn't know but she knew it had lettuce\". OK not a big deal but not a good way to start. I then asked if it was vegetarian and she assured me it was. I will jump ahead here - my wife (who is a vegetarian ) upon first bite clearly tasted FISH! So I called later and upon further investigation the chef revealed that they use a bit of fish oil in the broth - sorry but that is NOT vegetarian .Back to the rest of the experience. Upon arrival for my takeout order I was told it would be a few minutes- great! Another customer got his takeout order and left but came back 5 minutes later and I gathered that there was a mix up- he received part of my order. They took care of him but I ended waiting for another 20 minutes and then I finally got my orderFor a total of 55 minutes which includes the initial \" it will be ready in 20 minutes.Ok now for some positives:The hostess did comp me for the screw up - gave me the spider roll for free ( cause of delay) and an additional shrimp roll- this is what a restaurant should do in light of a mistake. This is one reason I will come back.The food is pretty good - very tasty. The hostess was very friendly but I think they waited too long to reveal there was a problem....had to sit there a longtime watching them scramble.Basically this seems like a young inexperienced restaurant working out the kinks - I highly recommend that the staff should learn about what is on their menu and ESPECIALLY letting people know that there is fish oil in something they refer to as vegetarian - imagine someone with a fish allergy who asked and then later...BAM! Nice recipe for a pretty serious lawsuit."], ["Matthew R.", "Excellent food and service! Menu and happy hour are great! Good prices and location. The sushi was fresh and served quickly. The miso soup was also very good."], ["Marcus D.", "Seriously underwhelming. We have been coming here since we read the \"updated\" reviews about customers coming back to have outstanding food and service earlier this year. Usually, this is an outstanding place, especially during happy hour, and today's effort was terrible. I can't explain how bland the crunchy roll and the spicy girl were today. Neither had that usual \"punch\" that we've grown accustomed to. I know 4:30 on a Sunday is not a high time for service, but the fact that we sat around with empty glasses for 5-7 minute stretches made us feel neglected. Lastly, one of our favorites, the yellowtail jalapeño, has undergone several changes since we began eating here. The previous iterations have always been good, but the most recent experience has us asking where the consistency went. We'll be coming back since it's near the house, but another experience like today will signify the end of our patronage at this establishment."], ["Soma N.", "We LOVED this place. I cannot express how happy I am that a place of this caliber opened up in Highland. My husband and I will LIVE here this summer. Our server was super friendly and attentive while not being overbearing or intrusive. There were 3 in our party and we were one of the 5 or 6 tables in there. Normally, I expect great service under these conditions, and normally I'm disappointed. But not here, not tonight. My glass of wine never got too low, my company's beer never went dry. We got recommendations for everything we ordered, and we each LOVED everything. We ended up spending way more than was necessary, but we felt it was worth every penny. The oysters were fresh and just amazing; each one of the 4 had unique and delicious accoutrements. I cannot remember the names of the rolls, although 2 were specials and not on the menu, but I cannot imagine being disappointed with any of the sushi there. The wine list was short, but I guess I expected that, and I knew going in that it was a beer, wine and sake establishment. We did find a small bone in one of the rolls, but we loved everything else so much that we really didn't mind much. Our server was sincerely apologetic and tried to offer any way to compensate, but we were so happy with everything we couldn't accept.I can't wait to go back and show everyone I know the gem that is hidden in Highland Park."], ["Lindsey R.", "Last night was my third time having Sakana.  The rolls were perfect, the service was excellent and everything was great.  My only gripe was the miso soup was just barely \"hot\" and more like really warm.  Beer and wine came out quickly, our server was very attentive without being \"too much,\" which is important for a nice date night.The california, spicy tuna and philly rolls are all usually pretty standard but tasted incredible.  We agreed it was the best sushi we'd had in months.  Can't wait to come back!"], ["Rhonda G.", "I had to write an update because now that I'm back eating meat, there are some things not to be missed. At the top are the pork dumplings, and the wonton soup which is loaded with pork dumplings, and made to order. I went for lunch once and this is included in one of the specials, but a smaller portion. I've since had sweet and sour chicken and it needs more sauce. At dinner I would recommend getting a kobe beef dish. For what you get, you get more value then if you saved money on a chicken dish. I still haven't tried the damn sushi yet, they lure me in with all this other great stuff more suitable for this weather. I met one of the owners who is also the chef. He appreciates all our multiple visits. I just don't have the desire to \"try\" other places. It's easy not to be fickle with a true artist."], ["Amy T.", "Great new place in St. Paul!  I'm so excited to finally have a good sushi place that is in St. Paul where you don't have to go downtown.  We went on a weekend with a group of 6 people and had made reservations.   They were pretty busy and the table we were supposed to be at had people that stayed a lot longer than they expected.  After about a 20 minute wait, they offered us all free drinks for waiting.  We weren't expecting that at all, since the place was really busy.  We were getting pretty hungry after waiting 40 minutes, so we ended up going to the sushi bar.  We started our orders there and about an hour after our reservation time we moved to the table reserved for us.  When we got there, they sent us free apps for our long wait.  Service was great, sushi was delicious, and we can't wait to return."], ["Ward T.", "Tried this new sushi place last week. We asked to be seated at the sushi bar near the sushi chefs. They were friendly, but not very talkative. I got the feeling that most people didn't engage them in the usual patter I have come to expect from a good sushi joint.Sushi was good and fresh but expensive."], ["Kevin Q.", "You know how you can always tell when a new business opens up inside an old SA or 7-Eleven but you never see anything but the convenience store? Well, that's not the case here. I stopped by tonight after work to get take-out on a whim and I'm really glad I did. Nothing about the building inside reminded me of the old KFC it once was.Upon entering I was greeted very nicely by a hostess who when I told her I was wanting to look at the menu and do take-out, she escorted me to the bar, gave me a takeout menu along with the full menu, and a glass of water to order by. After ordering she told me it would be about 20 minutes, but I got it in 5 (that's probably as close to fast food as I'll get). I got the Thai Style Pineapple chicken and lightly fried spring rolls and they were both quite good. A nice spice in the coconut pineapple yellow curry sauce, fresh vegetables, and the sauce for the rolls had a good kick. On a Wednesday at 6pm, there were two tables of patrons and another party at the sushi bar, so relatively quiet. When I asked the hostess if business was good she said it has been very busy. She said they've been open about 3 1/2 weeks. Ambiance is very good; dimly lit in a good way and nicely set tables. They did a really good job remodeling inside and again nothing made me feel in the least that this used to be a fast food restaurant. The service, food, and everyone was great. I will definitely be back and next time will try the sushi."], ["Benjamin B.", "One of these stars is for the fact that the space took over a KFC. One of these is for the sushi itself. But that's about it.Avoid takeout at any sort of peak hour. I pre-ordered and then arrived to pick up my order, only to have to wait for an additional 30 minutes and watch a total debacle ensue with other, hungry, waiting guests. The layout is ridiculous. As you enter, you are met by a sea of people waiting for tables or takeout, and the host station is hidden behind a wall. This mini hallway also happens to be the route to the bathroom, and the route from which servers deliver food from the kitchen. Great space planning!On the second check-in on my order, I came to learn that it had been sitting at the host table for the last 20 minutes. It was promptly thrown in a bag, which failed to include chopsticks, napkins, soy sauce, or an apology for the wait. Maybe give them a few weeks to get their things together. Or just go to one of the many other sushi places in town that already do."], ["Rob G.", "Wow this place is great! Formerly known as Kentucky Fried Chicken in this Highland Park sweet spot, Sakana has not disappointed me in the least. I dropped in with a group of friends to try it out and was disappointed to find that our reservation couldn't be filled on time but only because the people whose table we were supposed to have didn't leave and had stayed for almost three hours. When we finally were able to sit, we learned why, but only after being comped around of drinks! Also the host was very apologetic and gave us several free appetizers! Great service!The sushi was terrific. Everything was very fresh and neatly prepared, and served quickly in spite of how busy it was that evening. I would point out specifics for you but honestly everything was amazing. It was a great experience and I look forward to going back soon."], ["Patti K.", "Most Twin Cities sushi fans will love this place. It's got a trendy vibe, a better-than-average sake menu, and a long list of imaginative sushi rolls. The seaweed salad was close to authentic, with colorful American garnish, and the sweet potato tempura (billed as \"sweet potato fried\" on the menu) was served french fries style, with a ketchup-sized dish for the tempura sauce. I ordered the pink panther roll, which was a tasty soy paper-wrapped creation with spicy tuna, generous avocado, cucumber, peanuts, and mango salsa. There was not much rice, so I couldn't tell if they actually put vinegar in the rice for real sushi rice. The roll was a little mushy with the spicy tuna and avocado, but the cucumber and peanut made for a nice crunchy contrast. My companion ordered octopus and spicy scallop nigiri-zushi. We had a difficult time discerning the scallop, but it was still tasty. As is the case with most Midwestern sushi places, people who want authentic Japanese food should go elsewhere. A small handful of Japanese side dishes like miso soup bumps elbows with a dazzling array of East/Southeast Asian foods such as lo mein, Korean barbecue wings, and tom yum soup. For me, the selling point is the sincerity and local flavor of the place. It's not a slick corporate restaurant joint with mango cocktails. I'll probably go back to try the cooked \"house favorite\" dishes.Update: A year later, Sakana seems to have slid downhill, so I've changed my rating to two stars. We took some friends here over the summer, and I was embarrassed that there were fruit flies all around us. Today I ordered takeout.They messed up my order because the person who took my order hadn't been there long enough to know that what I ordered was no longer on the menu and didn't call me back. I ended up waiting 20 additional minutes for takeout. The food itself was a bit disappointing. My mango shrimp was billed as \"spicy,\" but it was a very ordinary sweet stir-fry with a watery sauce. The kung pao beef was overdone, perhaps because they made the order and had it sit there while the replacement food was being made. I did want to see this place succeed, because at the very least the owners seem to know something about sake. The hostess was also kind enough to give me a discount on the food. But enough is enough. I tossed my outdated takeout menu."], ["Stephanie S.", "Very good sushi. Highly recommend the salmon and scallops. Best quality scallops I've had in the twin cities.Very nicely decorated with good ambience. However, the music sounded very 80s, in a \"classy\" sort of way (think 80's elevator jazz). I dug it."], ["Alec W.", "We went here last night after it turned out Highland Grill was a little overcrowded. I'm really glad we did, because we got some fantastic tasting sushi.We were immediately welcomed in and felt right at home. The only sign that this is a former KFC is the takeout window in the corner of the restaurant. Other than that, they did a fantastic job of re-doing the place.We ordered a couple apps and some sushi. Again, the sushi was really tasty. Overall, I'd say it is above average sushi. The only part about it that wasn't great was the appearance. Some of pieces of the rolls were a little squished and deformed. Still, it's easy to overlook once you taste it.I was pleasantly surprised when they brought the check out. It was much less than I had originally thought.Sake menu was great, and again, the service was fantastic. We had a great time, and we'll be returning soon. Try it out, I don't think sushi fans will be disappointed."], ["Antonio G.", "I've had take out a couple more times from this place and it has impressed me! Sushi is very good by MN standards."], ["Chase D.", "Horrible service. We were never greeted and it took forever to get drinks although there were only 3 other families.  Once they found out we had a \"groupon\" we were treated badly.  I'm pretty sure they also served us less food also.  Sushi was good, but the service was very bad.  The entire staff, including the kitchen staff lounged around in street clothes, sagging pants, backwards hats and all. They were all at the bar talking loudly of their personal lives about 5 feet away from our table, and they watched us eat our mediocre food.  One of the waitresses decided to start actually doing something and got a bottle of some cleaner that smelled like ammonia and began cleaning menus; 5 feet away.  We could smell this cleaner as we ate.  Never going back."], ["Jonathan W.", "I agree with others that the service and protocol is seriously lacking. And also agree that the layout is really dumb. Overall the sushi was well done, but not for the purist. The service was disorganized and slow. But they HAVE to do something about the layout. The big dumb bar thing in the middle is really a bad idea. And sitting watching the staff stand there and chat with each other while I was waiting for service actually started to piss me off.First , when we walked in we felt like we came in the wrong door. Directly in front of us were 3 people who worked there but all avoided eye contact and chatted with each other. After a few moments of confusion a woman poked her head around the corner to the left and asked if we had a reservation. We said we didn't. She looked at her chart and said there was space available at the (uncomfortably low) sushi bar. We walked past many empty tables that she promised were reserved for another party. (the party never showed up and it would have been nice to be re-seated at a regular table, but the space was given to others) We sat and ordered from the friendly sushi chefs (though it was difficult to see what they were doing because we were so low). The sushi was fine. The service was late and disorganized. (after we were finished the waiter called up to the sushi chef \"Hey, what'd they have?\", but then went back to him behind the bar and asked again, didn't add to the experience.) Overall, meh. I might go back and order from their menu to find a favorite, but it may take a while to do. Maybe longer than I'm willing to invest. I'm more likely to walk down to Punch pizza where they do their one thing right."], ["Courtney J.", "I had been eyeing this place for a while and I'm very happy I've now tried it.  The menu has a very wide variety of dishes which I'm sure will satisfy a broad range of tastes.  I had the Japanese noodles with soba noodles and it was delicious.  It's a dish that I think even my midwesternfoodonly eating father might enjoy!  I also had the sweet potato tempura roll which was fantastic.  Since I'm a rare meat eater I tend to go vegetarian which I think some might find difficult as a sushi based restaurant, but I can vouch for this place that there is plenty on the menu for us veggies oriented diners.The ambiance is nice as well although similar to what Rhonda G mentioned, it's pretty standard for an Asian restaurant.  It is a cozy environment so it's a nice \"fancy but not too fancy\" type place for a date.  The servers were attentive and very pleasant.  They didn't hover but when I needed a refill on tea or water they were on top of it.Overall a very satisfying visit which I would recommend to anyone who is looking in the St. Paul area.  I have no doubt I'll give this place another visit!"], ["Peter L.", "Great Spot! I was craving some sushi and this place was right in our neighborhood. For being Minnesota sushi it was excellent!"]], "Obento-Ya": [], "Haiku Japanese Bistro": [["Jesse B.", "Great sushi, great udon. Not quite what I've had in Kyoto, but very tasty, with good presentation. Also impressed with the service. They were busy on a Saturday night but made every effort to get us seated quickly."], ["Jenn W.", "Ended up going here because of a Groupon, and glad we found it!  Service was fast, food was very fresh and delicious. We got the Love Boat, can't go wrong with just a boat full of delicious sushi.  We got the Fat Boy Roll with it, and that was amazing!  Worth your stop, they know what they are doing."], ["Kien N.", "Haiku has an awesome location right on campus.  The restaurant is well decorated and the atmosphere is pleasant.  Our waiter was polite and accommodating.  My classmates and I went during lunch and their lunch specials were very affordable.  I had 2 rolls and miso soup for $8.Aside from the convenient location and affordable prices, the quality of food was average.  I would recommend this place for its convenience and affordability, but if someone is looking for delicious sushi, they're better off driving off campus. Recently, they have been posting up signs for late night karaoke.  I am assuming there was little appeal, so they added colored printer paper advertising free drinks for girls and $1 Bud Light.  The taped color paper with sharpie writing is distasteful considering how nice the restaurant is.  Also, desperate."], ["Wil G.", "7:00pm: Arrive - the place is busy there are people waiting to be seated and I count 4 empty tables. The hostess is running around like a headless chicken and is having hard time figuring out how to get 3 sets of guests seated at 4 tables.7:20: Get seated at the Sushi bar (after a guy who was sitting there waiting for a TAKE OUT order got up and left!)7:35: Asked the girl washing dishes if there is a server7:37: Someone came over and asks me for my order, (food not beverage) then he ran off right away.7:45: Get asked if I'd like something to drink7:50: Miso soup and salad show up - no utensils or sticks (Iceberg lettuce! Really?)7:52: Someone finally brings over chopsticks and a napkin8:10: I've been for over an hour and still no entree. The service is insanely bad. I wish I could review the food. Sadly I'm still without. -------------------------------------8:11: My Sashimi Entree arrives - I'm hoping it was worth the wait.The food wasn't all that great. The tuna was mostly fresh and was a tad softer than it should be. The salmon was edible after smothering it in soy and wasabi. I've never had to do that before. Certainly none of it was photo worthy in presentation.Sadly it was not worth the wait.8:30: I'm ready to leave8:37: Finally flag someone do to give them my money8:40: I'm out of here - never coming back!By 8:00 the place had emptied to about half full, but the wait staff still couldn't keep up with other peoples orders. This place seems very unorganized and isn't capable of handling a dinner crowd efficiently. As best as I could tell only one person knew how to operate the cash register and she was also supposed to be serving people at the Sushi bar.------------------------------------------------------------UPDATE: 7/18/2015This is the second time I've been here. I'll never go back. The sashimi isn't suitable for bait. It was old, slimy, smelly, nasty tasting stuff."], ["Elena T.", "SWAG.This place is impressive. Their sleek and stylish decor matches the exquisite presentation of each dish served. The menu is extensive, creative and delicious. This place is all about perfection in the details. And it's sexy. Highlights:Kicking King Crab RollOyster Tempura RollSashimi SaladHaiku Japanese Bistro = Crazy Sexy Cool"], ["Kristi C.", "Some of the best sushi I've found in the Twin Cities and score, it's in the south metro. The spicy tuna roll was well executed and tasty.  My dinner mate let me try what I've decided is the best unagi (eel) I've had to date. The interior is sleek and tastefully decorated. The noise level isn't too loud, you can still carry on a conversation.  Service was impeccable!"], ["Katrina M.", "Jalapeño watermelon margarita was strong but good. Decor is beautiful, stunning even!We had the lobster roll - good but I didn't taste much lobster, The spicy girl roll was delicious with the tempura flakes on top. The tempura flakes are fantastic! They were on our Slammin Salmon roll as well!Caterpillar roll was wonderful with mango inside! The favorite so far!Scorpion roll was good and different.Tuna family was amazing. SOme seared, the rest, raw.Slamming salmon was fantastic with lots of tempura flakes and tobiko!!!!!We went on a Tuesday night with the family and were seated immediately. Our waiter, Ferry was very attentive and sweet."], ["Allison K.", "All of the food and drinks I've gotten here have been delicious. Creative rolls and quality you wouldn't expect in a strip mall location. A little confusing last time we went as we were handed a tablet computer along with our menu and it wasn't explained what it was for. Apparently it just has pictures of the menu items on it? A little strange. Service is good, not great but you'll be hard pressed to find better sushi in the area"], ["Jodi P.", "The friendly service, calming atmosphere (even when every table is full!), and above all, the food - keeps us coming back.  We frequent 2-3x/mo.  The owner is personable and professional, with a staff that is such, as well as knowledgable.Top faves:  the sweetheart roll, sea bass soup, avocado salad.  My husband likes everything he tries (varies a lot).  Our 9 yr old even likes several non-sushi dishes.  Having lived on the West Coast where fish is fresh, Haiku measures up - the food is very fresh!"], ["Rachel T.", "Wow! We come to Minneapolis a few times a month and when our go to sushi place in uptown's first available reservation was at 9:30pm we decided to go try a new place. We made the 25 min drive and it was well worth it. Sashimi was fresh, rolls was unique and delicious!!! Seaweed salad was one of the best I've had and I've had sushi from California to New York. Don't let the strip mall deceive you. When you walk in it's just as swanky as any downtown bistro. It's worth the drive if you are not in the St Paul area. Awesome place. Our new go to place."], ["Seppuk U.", "Lets be clear right up front.  This is quasi Japanese food.  Obviously Japanese food popularity has exploded in the last several years and this place is a cheap ass attempt to cash in on that.  From the error on the menu, which in japanese characters says \"ageku\" not \"haiku\"...(seriously?  you open a japanese restaurant and don't have anyone that can read japanese??)  and the same error all over the wallsto the ridiculous iceberg lettuce salad.  I have n.e.v.e.r. been given a salad in any J restaurant before comprising solely iceberg lettuce.  Cheapo.  Very unimpressed and if this place actually knew anything about Japanese food they should be embarrassed.to the yaki tori app that was not yaki tori.  This was a shish ke bob.  I feel sorry for any American that samples this places \"take\" on Japanese food and comes away believing that is what Japanese food really is.  I suppose it'll fool the peeps who go to Chinese buffets though, and believe General Tso chicken is authentic and eaten all over China.The only redeeming factor for this place and why I even gave them 2 stars is the nigiri and sashimi were decent.  I give the Chinese owners and staff props for using Japanese rice too, usually knock-off joints skip that little detail.TL:DR:  This is a joint surfing a trend.  The food is heavily Americanized and I would almost compare it to chain restaurant stuff, think Olive Garden as Italian.  Sushi is OK, but I wouldn't go out of my way to return here."], ["Joe P.", "Great interior! Restaurant looked amazing inside. The service was nothing to rave about nor was the food. We had a spicy girl roll which was good but far from the best I've had. We also had a steak and shrimp hibachi entree. The onion soup and ginger salad were good. The shrimp was a little over cooked. I would go back but won't be my first choice."], ["Angelica K.", "Finally authentic sushi in Mendota Heights.  We order the the yellow tail Ceviche, very tasty and the fish very fresh.  We also order fatty tuna, it was supper.  We have a couple of sushi rolls, and sashimi pieces  fresh raw fish and good.The decor is super,  the place is clean, and the the service was great."], ["Donna N.", "Everything is excellent.  Great sushi, hibachi dinners and great tempura. Very high quality and reasonably priced.   Waitstaff very nice owner is present most times and very hospitable.  Note this is on 110 in Mendota Heights, not Saint Paul"], ["Jenni F.", "This place is magnificent!! The decor gives the impression of an ice bar or a swanky lounge, the food is incredible and reasonably priced. I recommend the Sashimi Dinner. The service is amazing - on my second visit the server asked me if I would like [the same beverage] as I had last time. I feels pretty awesome to be remembered!As someone who could take-it-or-leave-it with fried rice, theirs is to die for!We typically end up with a larger group since it's one of the go-to spots for many of Boltz's Family Martial Arts adult student after classes. The staff is so accommodating of groups and allows us to push a few tables together. I have recently taken to picking up something to-go for lunch since I work so close, too. Just as delicious and even more reasonably priced than the already-reasonable dinner prices."], ["Adele L.", "Surprisingly great sushi and sashimi. Authenticity is overrated when it comes to cuisine. After years of sampling sushi all over the country, I can say this place serves astoundingly good food. If the food is fresh, tasty, and combines flavors in a pleasing way, then it's perfect. The truth is that authentic dishes are often unpleasant to people of other cultures (e.g. chicken feet and mock duck). Americans will like the food served here, and the prices are so reasonable considering the decor is so elegantly beautiful. If I could afford their interior designer, I'd hire them for my own house. The sheer inventiveness and elegance is rare in a restaurant I can afford to eat at. This is a great place for a first date, just come in after 8 pm for the happy hour prices."], ["Jen K.", "My husband and I used to enjoy going to lunch at Haiku. We quickly noticed the food quality (at lunchtime) go down but still wanted to give it a chance, until our last visit. Not only was the food disappointing, but the Groupon we had just purchased was not honored. Haiku will not accept the Groupon for lunch even thought it does not state that in the fine print. Rather than be apologetic about the situation, the owner told us to take it up with Groupon blaming them for being inaccurate. Making a mistake on a coupon is one thing, brushing off a customer will sadly continue to drive business away. I wish them luck, but will no longer be dining at Haiku."], ["Grace C.", "Haiku was freezing cold. Wear a sweater. Their onion soup was good. Their Spicy Tuna roll wasn't spicy at all, it was totally bland and muddled down with topiko. The California rolls ingredient proportions were outta whack: too much avocado not enough crab. I won't be going here again and instead I'll spend the extra money on good quality sushi."], ["Paul A.", "Great sushi bar that has impressed each time I've visited.   I think the lunch specials are very good and offer enough options.  It's not a buffet style which I shy away from.  I don't like sushi that waits before it's severed.  Try it if your in the Mendota heights area."], ["Serena R.", "Some of the freshest shashimi I've ever had. Absolutely would go back again. I hope they do well as it's nice to have a good Japanese place locally."]]}