{"Ruam Mit Thai": [], "Taste Of Thailand": [["Tiger H.", "Great hidden gem. Very authentic taste, it's the real deal. I love the cream cheese wontons- thin and crispy- even though it's not authentic Thai food, they're amazing! Their pad Thai isn't the best I've had but the sauces in their stir fry entrees are BOMB! Good vegetarian options. I like the extra time they take to make flowers out of the carrots. Think about that, it's all about the details! Anyway, go before dinner rush or expect to have a leisurely dinner. Service is a bit slow but hey, it is a local family owned business and cultural differences aside, their heart is in the right place. Also, looking at the other reviews, make sure you check what you're getting in the take out container before you walk out."], ["Theresa M.", "I'll start with the best part, the pad thai is my favorite in the Twin Cities.  The flavor is reliably delicious every time.  I give the restaurant 2 stars for a few reasons.  As a reviewer said before, there have been multiple nights in the past two months that they have not answered their phone when I've called for take out.  The phone rings and rings and rings.  It's extremely frustrating when you're trying to give a restaurant your business.  One time we went in to order out and were basically told we couldn't because they were too busy.  We were ordering one meal.  That really turned me off.The chicken pad thai is delicious, but the additional charge for the chicken is not worth it.  You get a few thin slivers that do not stand up to the amount of noodles.  Also, there are no smaller or cheaper lunch time specials."], ["Joseph L.", "update-   NOPE!--------Tip- make sure you have a lot of time.  Service is very casual.This is where I have been going since I was a child. I loved this place.   Their #65 curry fried rice is amazing- when they make it correctly.  I also always buy the Curry chicken #32/33.  It has changed and become smaller over the years. My favorite is #3.  Their special egg rolls.  The wrapper is fried and crispy yet still chewy.  I think they use rice paper which is not common for an egg roll.  The seasoning and pork is not comparable to anywhere. They have/had other locations.  The one in Fridley stayed the closest to the original recipes. The one in Apple Valley closed and was reopened by the employees of the taste of Thailand in white bear lake.  They have the original recipes and always make the food the way it is supposed to be.  The new Taste of Thaiyai is my favorite in Apple Valley. The location in downtown MPLS seriously has to serve portion sizes that are half the size and cost $1-2 more dollars.  It's outrageous. So back to the review for the Selby location. The food is always hit or miss.  It's always a different cook with different ideas on how to make the food. They also mess up often with the take out orders.  I stopped going there because at first they would be off 2 out of 10 times and it turned into 8 out of 10 times. I would rather go somewhere else.  Save your money"], ["Norman M.", "Hey Taste of Thailand...you need to learn how to answer your phone. Called 15 times and no answer. When you hear the ring you pick up the phone - simple.This has happened numerous times on previous occasionsAfter no answer I called to On's Thai on University and guess what? They answered their phone and we ordered. Last time I will ever visit or call this place."], ["Gordon M.", "This is seriously the worst Thai restaurant I have ever been to (I've been there twice, just to give them the benefit of the doubt). My girlfriend and I call this place House of MSG, because that is the only thing that gives any of the dishes that I've tried any flavor whatsoever."], ["Gao Y.", "This is definitely a mom and pops restaurant. If your looking for fancy restaurant and speedy service, this isn't for you. My favor dish is the chicken laab/salad, it's one of the best that I've had. Although the fried rice was a bit on the sweeter side, I enjoyed it. There's only one server and hostess... And that's the mom/grandma, so service is a little slow. She's super sweet and her English is pretty good! Also I think there is only one cook (husband maybe?) So, expect this to be a casual restaurant, as many Asian restaurant are anyway. Oh, and I'm guessing they don't have a liquor license, since there wasn't a drink menu."], ["Allison K.", "My personal favorite Thai place in the cities. I used to live right down the street and often got food here for both dine in and take out. I miss it and try to get over there every once in a while. The lunch buffet doesn't offer a huge selection (or at least it didn't the last time I was there)."], ["D K.", "Taste of Thailand was our neighborhood restaurant so we used to go to it quite a bit,  but it had been backsliding for years.  The restaurant has no ambiance although they updated 4 years ago, which was a major improvement from what it was.  Service is slow.  In many cases wecall for pick up and have learned to add an extra twenty minutes to whatever they say or end up waiting.  The food is alright in a pinch.  It's now become our place if On's Thai Kitchen isn't."], ["David B.", "This has long been one of my favorite places for getting Pad Thai, but I haven't always received the best service.  But my last visit on a Saturday night was as good as it could have been.  The service was attentive and prompt, and the food was characteristically terrific.  Highly recommended restaurant."], ["Maggie O.", "How can I describe the level of disappointment: colossal!  It was a TERRIBLE dining experience.My sister and I were in desperate search of some Thai food and Pad Thai and Supatra's were both closed.  So sticking to St. Paul, we were left with Taste of Thailand--or Taste of Sodium!The ambience is bleak in this place: laundromat-ish.  But that was the least offensive part of the experience.Clearly when we got there and saw the rest of the patrons without food, we should have turned and run out the door.  But we didn't.  And so It took over 50 minutes to get the food that we ordered.  We watched the one beleaguered server go from table to table without ever bringing food out to the customers.Finally he came to us with our bill after 45 minutes.  But wait, we hadn't even had our food yet!  We watched a couple leave before they got their order and we should have followed their lead.When our red curries finally got to the table, they looked like over-cooked vegetable soup.  There was no taste of curry, only straight salt and soy sauce and droopy, chewy broccoli.  My sister's dish was missing most of the vegetables it was purported to have.Needless to say, when he finally brought our bill, I told him that we didn't get the curry we ordered.  He offered to bring it back to the kitchen.  NO WAY!!  Let me out of this hell hole.Horribly tasteless food.  Slow-as-molasses service.  Gross ambience and dingy environs.I will NEVER patronize these guys again.  If you are short-staffed, just do everyone a favor and close shop for the night.  You've just lost my business and you can bet I've told my family and friends to go elsewhere!"], ["Rouzbeh T.", "Wow where do I start . I've been coming to this restaurant for the last ten years and especially the first 5 years .. Ever since the mpls location opened up, this Saint Paul location has lost quality and consistency. Food portions,taste , just the whole experience has just diminished . Runny sauces , no flavor, tiny pieces of chicken & oh two spinach leafs. Prices have gone up and everything else that made this restaurant special in the first place has gone down. Having a person that answers the phone and is consistent would be great too. It's unfortunate because this place used to be a hit but I can see why grand pad Thai has accumulated all the customers and grown so much . I know you guys probably won't care about this review but I work in the restaurant industry my self and I would never write a review like this unless I knew from experience . This has been long coming and I hope you guys step it up ."], ["Niki S.", "My husband picked up some take out on his way home from work. We ordered vegetarian spring rolls, Chicken Pad See Ew, and Red Curry with Tofu. First off, the red curry was a mess. It was NOT red curry, rather it was a greasy stir fry. My husband ended up bringing it back and trading it for a mediocre pad thai. I've had better take out pad thai in the skyway at lunch. I will not be ordering from this restaurant again."], ["Patrick C.", "GET TAKE-OUT!That's my suggestion. Why?1. Decor: dated. 2. Service: scarce. 3. Cleanliness: adequate. 4. Restroom: marginal. 5. Food: FANTASTIC! (We had special spring rolls, vegetable red curry w/mock duck and pad med mamuang himaphane w/chicken.)Skip the average stuff and get it to go."], ["Lindsey W.", "I wanted to like it, I really did.  I even gave it three chances.  Unfortunately, I've always been disappointed.  The servers aren't great at pretending they care about their jobs.  If you need a water refill, be prepared to flag someone down.  My pad thai had way too much sugar, and my pineapple fried rice seemed too saccharine as well.  This saddens me because it's the only Thai place within walking distance from my house.  However, I think I'll take the trip over 94 to University to find my Thai food from now on."], ["Joelle P.", "Stopped in here because Pad Thai on Grand is closed on Monday and I just had a craving for pad thai (what's new). I ordered quite a bit of food, per usual, for my boyfriend and myself. I got it to go as I was on my way home from class. I don't think I would choose to eat in, however, it wasn't the best location really and was almost completely empty around 7 PM. I got an order of pad thai with chicken, the massamun curry with chicken, and the sriracha fried rice with chicken. My boyfriend was not too partial to the curry, he is a true panang follower, but I thought it was decent, however nothing special. The pad thai was decent as well. It was kind of a weird gray color, but the taste was alright and there was plenty of chicken. The sriracha fried rice was the best of the dishes. It had a great spice level, tons of large pieces of chicken compared with most fried rice, and it was a very large serving. We had a lot of leftovers. I don't typically like fried rice, so it was surprising to me that I liked it so much. My boyfriend loves fried rice, while I am more of a white rice/noodle person.I would go back for the fried rice again possibly, but I would definitely choose a different restaurant for curry or pad thai which is what I typically look for when I feel like Thai."], ["Lorraine N.", "Decent Thai food and various options of heat levels ---very typical of many thai places I have been in with red gold décor--tons of green plants---some elephant décor and for some reason they don't turn on the lights too much in here  My daughter and I can go in here and eat a nice hot meal--generous portions ---and get treated nicely all for under 20.00...."], ["Nicholas L.", "I would LOVE to support my neighborhood Thai joint - but this place, leaves way too many things lacking.75% of the menu has MSG, and while that in itself is not too big of a problem - the fact that you CANNOT remove it from the dish for most of them, implies a lot of pre-made sauce bases.I've been here multiple times, hoping I just caught them on an off-day or service - but they are consistently lackluster.Pricey too, for overcooked pork.At least they have decent beer. Delicious Mirror Pond Pale Ale was not enough to save the food.Yes, I have high standards for Thai food - but shouldnt we all?"], ["Dave P.", "This place continues to disappoint. I've avoided this place for some time now but the person I was with had \"heard\" this was a great place so I agreed to try it yet again.With soooo many great Thai restaurants in Minneapolis/St. Paul there is no excuse for this long standing trainwreck, except maybe, that it's near a collage. So perhaps the yearly influx of new students keeps them in business. First the food: Not awful. just bland and average. The stir fry vegetables were old and the cuts of meat were obviously cheap and low quality. My dish came out cold as some of the refrigerated/precut vegetables were obviously thrown in at the last moment as they still had ice on them and cooled of the entire dish. Their \"fix\" was to microwave it and bring it back out. Again, serviceable, but not quality. They could have at least tossed it back in the wok. Then the service: Iif you don't know from good Thai food, you can still find a good reason to stay away from here. The service. It's just not good. (see above reheat) If you have to ask for each and every service item, don't get your tea refilled, don't get offered chopsticks, don't clear empty dishes and you still have to get up to get soy sauce from the server station yourself, you might as well cook at home. And they weren't busy. And this isn't the first time, it's every time. Knowing that, I've even tried having it delivered on several occasions too and after twice having to wait over 2 hours and both times not getting everything on my order, I'm completely done with this place. With so many really first rate Thai restaurants in the cities, both corporate and family owned, I just don't know how such a consistently mediocre place continues to stay in business."], ["Jennifer S.", "On a recent rainy night, we came here for dinner.  My companion was fending off his lingering cold, and I was fending off germs in general.  I suggested this place since I hadn't been in more than a year, and he'd never been but had already been thinking that day about eating some spicy food.  Since this place opened back in the 1990s, I've been coming here for both dine-in and take-away, and I've always liked their food.The place was not busy that night, like I remember it always being.  I wanted soup and ordered the lemon-chicken-coconut milk stuff; he ordered the fish curry (spicy).  We had a pleasantly attentive server who kept my water glass filled when it got low.My soup came with a dish of white rice.  The soup was absolutely delicious, with plenty of mushrooms, but only a few slices of chicken.  The rice, I thought, had a weird lingering taste to it (metallic?).  My companion loved his fish curry and he also loved my soup.I had enough soup leftover to warrant asking for the remainder to be cartoned-up.  The following day, I made some basmati rice and heated up the leftover soup and had a nice, modest meal.  mmmM good!"], ["Keith S.", "I'm a regular at the White Bear Ave Taste of Thailand and have always had great food.  I ordered takeout early on NYE, and granted, it was NYE....it was early.  And they closed at 6.  And it was pretty dead.They were out of broccoli, pea pods, cream cheese puffs, and a variety of other things that I couldn't understand when they kept coming back to update my order.  They did manage to make me a good tasting meal but it was far from what I wanted.  Not sure if they were understaffed but it took forever.  I'll stick to the White Bear Ave location."], ["Matthew H.", "Terrible. They had one guy working the whole place. We waited for 20 min and got one thing....water!!!!! We got up and left and went to Mango Thai and loved it!!'n"], ["Ryan K.", "Very disappointing. Over the past few months I've been scouring the city to find a closer go-to spot for Thai takeout. Being a spice junkie, I was excited when I saw their slogan, \"when we say HOT, we mean HOT\". After calling three times I finally got ahold of someone to take my order. I ordered the trusty Pad Thai dish for myself and made sure the lady understood I wanted my dish \"very hot, very very hot, SUPER spicy\" I told her. When hanging up, I was almost nervous about how hot they may actually make it. After arriving back home with my dish, I opened the box labeled VH (very hot) to find a very colorless, lackluster bed of noodles. After a couple bites I was full... of regret. The dish was quite ordinary and completely lacked the heat and spice I was looking for. As far as overall flavor, it was okay in the sense that it was edible and tasted fresh. It wasn't the worst Pad Thai I've had but there are certainly much better places close by."], ["Ruth D.", "Taste of Thailand routinely wins awards for their spring/egg rolls, and rightly so. They're crisp and crunchy and hot and delicious and just right. We've never eaten in, only gotten takeout -- but our orders have always been correct and delicious. I have yet to have a bad meal from Taste of Thailand. The only complaint I have is that they're often so busy that there's some wait before you can get your food, but they've always been extremely nice about it. Their pad thai isn't the best I've ever had, but everything else I've had from their menu has been exceptional."], ["john c.", "Finally. A Thai restaurant with good food that is actually decorated nicely. I was beginning to think that fluorescent lighting and white walls were the only indication that the Thai food would be delicious.I love the food, but they need to improve on the service. As long as your not in a rush I recommend this place on Selby."], ["Michael I.", "Some of the best Thai curry in the Twin Cities is here. I also believe they have the best eggrolls in Minnesota. Seriously amazing. The lack of 5th star is for the dine-in service. It can take as long you're willing to sit quietly to have water brought to you, or to order your food. If you're willing to speak up, there's no issue. Also, the Pad Thai could stand to be better. It is very sticky, and tends to come in a single ball of noodles. The spices and flavor are far behind the curry. Still a must-try for everyone who enjoys Thai food."], ["Victor M.", "I have been slacking on my yelping so but i am catching up now/ Me made another trip to the taste of Thailand  7/9 and the food was great!! i love this place and i wish i lived closer. The service is always good and the beer is a reasonable price."], ["Alex M.", "Yum. If you're craving Pad Thai, come here. I'll admit, this place doesn't look very happening from the outside. Dull red signage that is poorly lit, this could easily be missed. I wasn't actually sure it was even open when showed up for a group dinner outing. But I was glad I came in once I got a whiff of what was coming from the kitchen.The food and friendly service outweighed the lackluster décor and exterior of the restaurant. The food was reasonably priced, the beer cold, and the food came out timely (especially considering we had a party of 12). We ordered family style so I was able to taste a good variety of dishes. Fried Bananas - Good. Heavy batter, almost like a dumpling. Banana retained it's texture well.Cream Cheese Puffs - Average. Quantity of 8, but small. Pad Thai - Excellent. I'd rate this in the top 10 of all Pad Thai that I've had. It was spicy, savory, crunchy, fresh and not overly salty... all the things you hope for when ordering up the dish.Pineapple Fried Rice with Pork - Above average. Good taste, large portion size, but slightly overcooked so the texture was a bit mushy.Pad Preow Waan with Tofu - Good. Fresh and full of veggies, this is a good filler without being heavy. Sauce was sweet and tofu crispy.Pad Pak with Chicken - Good. Savory broth with stir fried veggies. Chicken was perfectly cooked.Laab Gai - Above average. Fresh and flavorful, but the sauce was a bit on the salty side. Soup was standard broth + veg.I recommend checking this place out. I'm not sure if it is a family run operation but it had that feel. I think you will enjoy."], ["Trevor B.", "From the outside this place might not look very pleasing to one's eye, but as soon as I stepped in I felt comfortable and thought it had an enjoyable atmosphere.The GF and I decided to split some starters and share an order of Pad Thai. An order of cream cheese puffs is something we have to order at every oriental restaurant we try. I thought theirs was really good -- they were small, crunchy, and had a perfect amount of cream cheese for their size. We also ordered the Chick Satay to start with. The chicken is served up on a skewer and cooked perfectly! Great crunch on the edges and wonderful flavor. It came with a delicious peanut peanut sauce to dip the chicken in (I'm a sucker for peanut sauce). The Pad Thai was good. We ordered it medium hot which gave it a nice kick of spice for me, who doesn't have a very strong tolerance. My GF even made the claim it was better than Pad Thai's on Grand! Pretty bold -- I would have to taste the two side by side personally."], ["Jorn K.", "So, one day, we grab a menu from this place and phone them up. Requesting a quick dinner for take-out, I order off the menu by number. Simple enough. When i get the food home, it's not at all what we ordered; not even close. So, did they screw up? Nope. Seems I ordered from a very out-dated menu. Whatever it was we ate, it was fantastic.So what's the lesson here? One could play menu-roulette and come up a winner. Trust me, I've tried it again. EVery unpronounceable, mysterious dish I have tried has been a winner.But, what really keeps me and my friends coming back? The spring rolls. You must have the spring rolls."], ["Carrie W.", "I had take out here for lunch at work. I was kinda disappointed. I'm used to more thick and creamy curry. It lacked real spice and zep. The service was pretty fast but the containers were ridiculous! I don't know how the watery curry actually stayed in the standard folded paper take out box. Serious problem! I ended up periodically pouring it over the rice in the other container because it was just way too watery and messy. I was looking forward to a hot lunch at work but just ended up unimpressed and full of rice. Not worth the price at all! Go to True Thai!yelp.com/biz/true-thai-r…"], ["Brandon B.", "This place has the slowest service you will ever see in your entire life.   On top of that the staff is ALL rude,  and they don't seem to understand anything that is going on.Do not EVER order take out.  They will get your order wrong in some way and whatever time they tell you to pick it up, add thirty minutes to it no matter what.  Trust me, i lived two blocks from this place and gave it 5,6,7 chances to impress me and it never worked.Don't bother asking for \"no MSG\" all of their food is DRENCHED in it!!  And even if you ask for no MSG, they will still give it to you and assume you don't know it's there.  THEY ARE RUDE!Even if they don't manage to screw up your order, it usually is over priced for how mediocre it is anyways.  The only thing worth ordering there is the egg rolls.  They are great!  But that's it.  And like i said, if you don't like MSG don't even touch this place.Last but not least, the palce is very filthy.  I've seen staff drop silverware on the floor and pick it up and put it on tables they're setting up.  Yuck!Trust me, stay away from this place!"], ["Betty C.", "Back with an update. The last time, our wait was insanely long. This time, is was quite short and the food was just as tasty. The decor can always use help, though. And the woman at the front counter was on the phone when we walked in and said she'd be with us in a minute, but my dad had to go find her because she had apparently forgotten about us. We were the only customers! In any case, their tofu is very crispy and the best I've had. But the thai iced tea was WAY sweet. I had to dilute it multiple times!"], ["Anna J.", "I have missed you T.O.T.  I think my last visit was in 2004 (the year I dissapeared to Chicago) but I am back now.  I used to have crazy cravings for this place back in college.  I was here at least once or twice a month.We got there a little late in the evening, I could tell that they wanted us to order quick.  The restaurant was also super super cold.  But, the chicken satay made up for all of that.I got the pad thai.  I don't normally order pad thai because..ahh it's pad thai.  But, this is totally worth getting.  I would order it again and again.  My bf got the pad see ew and it had lots of vegetables.  Fresh veggies too!  In fact I could easily order vegetarian here.  The restaurant looks nicer than i remember but still isn't too nice.  But, sometimes those are the places with the best food.  Best thai in the twin cities."], ["Melissa C.", "Awesome pad thai. Slow service and dismal atmosphere.It's tough to find a good pad thai--one that tastes fresh, isn't sticky/congealed, and has the right amount of spice/bite to it. This was absolutely one of the best pad thais I've ever had. I got the veggie, and instead of limp chunks of overcooked broccoli (like you get at a lot of places) it had fresh, lightly-crisp, delicious veggies. However: our service was abysmally slow. We went with a group of 6 over lunch, and while I appreciate not having my food sit under a heat lamp until the rest were ready, there was one order that came out 15 minutes after everyone else's plate. And that was a fried rice order. They also need to figure out the lighting situation. During the day, a lack of interior light made the place look dusky and dank. Though no one had the buffet, it looked incredibly small (hence why no one had the buffet). Amazing food, and they're able to accommodate \"no MSG-please\" orders--but plan on having time to go here...and maybe bring your own cell-phone-flashlight for menu-reading/companion-seeing."], ["Todd S.", "Its tough to get a 5 from me but I have no complaints at all, the pad see yew was outstanding, pad thai tremendous, and the egg rolls were off the meter.I ate well at TOT for my first time there. I ordered all cliche dishes but oh well they were damn good and i'm glad I did.Prices were 9-13 for most entrees, which for the amount of food you get there is very reasonable. Ambience is dive-y but that means nothing when you are eating food that good. Best thai food i've had in the Twin Cities so far."], ["Shekinah S.", "Best. Pad. Thai. Ever. I don't even bother trying other dishes. Everyone I've ever gone with is braver than moi and they usually seem happy with their non - Pad Thai choices. I make sure to hit this place up every single time I go back home. Yeah, the decor is crappy, service can be painstakingly slow and there are usually flies buzzing about, but I don't care. When I moved from PA to WA, we stopped in good ol St Paul for a few days. The day before departing I got my beloved Pad Thai at Taste of Thailand. I ate half, and put the other half in the freezer. Next morning brought it w/ me in the car and let it thaw for a few hours. Somewhere in the Dakotas I had it for lunch, didn't even find a microwave in a truck stop. And it was still delicious. This is a true story."], ["Shanelle F.", "This place has some of the best egg rolls I've ever tasted.  I had the vegetarian egg rolls. 3 for $3.50. This is an awesome price in my book. I also order the pad thai. It was edible, but not very good, especially for 11 dollars. Service wasn't the greatest. I received a lot of head nods and smiles but there seemed to be a huge language barrier. I asked about a pineapple dish that I had at another Thai restaurant, they insulted me by stating that I should go to a Chinese restaurant. The building was a bit dirty. Or maybe because it was so old. I went the take out route and it appeared that other customers usually do as well. I would definitely go back for the amazing egg rolls."], ["Andrew K.", "Just went back for my 10th college reunion. This was my place. It's not so good anymore. I don't like the reno. Other way was cozier. The masaman (my former staple) was too runny and sweet. Sad."], ["Rob K.", "I have been going to this place for a little while, and I have always enjoyed my food.Some people are frustrated by the slow service, but I would just recommend getting take-out and showing up 15-20 mins after the projected time they give you.  This almost always works.People often say that you can judge the quality of a Thai restaurant by the quality of the peanut sauce.  I agree with this criteria and one dish at Taste of Thailand demonstrates their peanut aptitude.  The #38 Pra Ram Long Song with Chicken is a simple combination of perfectly cooked and tender stemmed spinach, peanut sauce, and meat.  I have often gotten it with tofu (excellent) and my sister gets it with mock duck.  I have been to a lot of Thai places and this is the most consistent and delicious meal I have gotten anywhere.  I like things pretty hot, but I have found that asking for a 7 out of 10 gets it spicy but not over-poweringly so.I would like add that I have recently discovered a hidden gem on their menu.  Their crispy chicken wings are the BOMB!  They are $4 for six wings that are always fried crispy and served with the most dynamic, mellifluous, and tasty sauce.  The sauce is really hard to describe, but I will say that it has a variant of a sweet and spicy sauce that leans towards the spicy side.  It is not overly sweet and is spiced with something I cannot quite put my finger on.  I have tried a lot of different wings sauces, and this is definitely the most complex and unique.Try the chicken wings!"], ["Michael R.", "Worst service ever. Delicious food. What this means is: pick-up or buffet only.The lunch buffet is offered sporadically but it's delicious. It's not a huge spread but they don't stick to basic dishes and they don't hold back on the spice.Pick-up orders tend to be fairly prompt but knowing how slow they can be, I give them 30 minutes so who knows?I've dined in a few times, each time service was slow or with errors. Sometimes they are out of certain types of curry or other staple ingredients. Bewildering."], ["john p.", "I'm totally willing to put up with terrible service when it comes with great food at an authentic ethnic restaurant. But terrible service for god awful food? No thanks. Long wait times, cold unflavorful food, and indifferent staff. Two of our party got their food 40 minutes after we ordered, and the other two of us got ours 20 minutes after that. No refills on drink, no prebussing, no sense of urgency. And really, the food was awful. There's so many good thai places in the cities. This isn't one of them."], ["Tammy L.", "I'm not a picky eater, as long as the food is edible than I'll eat it no problem! But I'm not a fan of Taste of Thailand at all, especially when there are so many other surrounding Thai restaurants. The curry isn't great, neither is the pad thai. The laab is okay, and so is the curry puff pastry. The papaya salad needs more shrimp paste, and the pad see ew is mediocre. The spicy wings is also decent. The only thing I thought was pretty good was their fried summer rolls (pretty much like eggrolls) only because there is something about that sauce that comes with them. It's a decent sized restaurant. The ambience isn't the nicest, but it's okay."], ["Aaron S.", "Take this review with a grain of salt (or MSG, since ToT puts it in a lot of their stuff) - I've only eaten their food a couple of times, and I'm still crabby about my most recent experience (see below).I've only had takeout from Taste of Thailand, and it was good but not great.  Probably would have earned 3 or even 3.5 stars based on the food alone.As plenty of others have complained, however, the service is lacking.  I found this to be true even in takeout (jeez, I thought I'd AVOID the bad service by doing takeout).  In my most recent attempt to order takeout from them on a Sunday night, I couldn't get through (\"voicemail inbox is full\") for about 5 min, and when I did get through, the woman on the other end of the line asked if I could hold for a moment.  She then put the phone down and I sat there listening to the sounds of the restaurant for the next 5 minutes (tying up the phone lines for the next poor sap trying to order takeout, no doubt).  10 minutes of unsuccessfully trying to order takeout from them?  I eventually hung up and called the cheery fellows over at Pad Thai on Grand."], ["Austin L.", "I haven't been to ToT in approximately 7 - 8 years, as it was the first, and so far only restaurant, I've vowed never to return to.I used to get Massaman Curry (my favorite food) from them quite often, often enough to go from a \"Mild\" Minnesotan palette up to \"Thai Hot\" for my spice level.  The curry used to kind of separate because of the amount of chili oil / sambal wouldn't mix with the coconut milk.One day I ordered my massaman curry for takeout over the phone.  I arrived the 30 - 45 minutes later to pick it up and take it home.  Upon returning home, I discovered my vegetarian order was chock full of chicken.  Mistakes happen.  I called them, was asked to come back over with the food, and I'd be given a new order.  So I walked back over, returned the dish, and was told they'd be right back with my veg order.  I got it, inspected it for chicken, and went back home.When I got home I was getting my spread ready and some sauce got on my finger.  I licked it off to discover a very chickeny flavor.  All they had done was taken out the chicken.  This isn't \"vegetarian\", this is still going to give me a horrendous bout of diarrhea if I were to eat it.I marched back over, explained I wanted my money back, and seriously debated forcing myself to vomit in their lobby.  If I was allergic to the ingredient (like overlooked peanuts), it could kill me, or if I was a religious person and ate something against my religion, I couldn't get into Heaven.  This was easily the most shoddily my vegetarianism has ever been regarded.  Forgivable at a Famous Dave's or some obviously un-veg friendly establishment, but a Thai restaurant?I always kind of thought it would eventually be my turn to give them \"The Speech\".  More often than not, when I would be waiting for my food, there would be an angry person telling them that their wait was ridiculous, the service was terrible, or that it was the last time they would be eating there.  My luck eventually ran out."], ["Dennis L.", "With Thai food on mind my and recent trips to Sawatdee and Supatara I wanted to have a new spicy Thai place to add to my list. The St. Paul Taste of Thailand was decoratively very plain and uninspiring.I started out the meal with vegetarian egg rolls which were good, but at the same time I can't remember that last time I had a bad experience with thread noodles and  vegetables deep fried to a crispy goodness.For dinner I ordered the Pad Bai Kra Prao (basil, mushrooms, onions, peppers and pork) and asked for it spicy.  The dish was filled with mushrooms and pepper chunks but lacking on spice and pork. Overall Taste of Thailand definitely didn't wow me and left me so uninspired about Thai food that I probably won't make a return trip!"], ["Andy G.", "This is a tough one. The food is some of the best Thai food in the Twin Cities but the service is very \"hit or miss\". Take out orders can be wrong and they are not always quick to answer the phones. When I have eaten at the restaurant the service is usually great. As annoyed as I get at the to-go service, I keep coming back for the food."], ["robert k.", "I've spent many hours in this place, reading 'Asian Pages', contemplating life, waiting for food. And a couple years ago it was worth it.I think Taste of Thailand is still a 'better than average' Thai place. In fact the Pad Thai and Masman Curry have been two of my favorites in town. That said, I think the food has become inconsistent over the years while service has remained completely maddening. They used to be able to skate by with not answering the phone, ungodly wait times, etc. but that was before the competition upped their games dramatically.Still a decent option for take-out if you hit them at a non-peak hour, but not so much for me anymore. These days you'll find me muttering to myself, silently cursing the wait at Mango Thai."], ["Charity L.", "The food is excellent here but be prepared to wait...even if you are the only people in the restaurant. Lack of 5th star is due to wait."], ["Abu G.", "Very disappointed. Service was awfull and food does not taste good."], ["Jessica D.", "Yum yum yum. Thai take out has always been a favorite of mine! We ordered the tofu pad Thai with spinach and Thai peanut chicken. Basic, I know, but ya like what ya like, right? It was great, the spice was there but not over powering, it didn't taste like it was from a mix either. It had an authentic taste to it that I enjoyed. They lightly fry the tofu and then package it separately so it doesn't get soggy while you're driving home, which is smart and makes the tofu so good. Good Thai food all around."], ["Jackie L.", "This has always been my favorite Thai restaurant in the East Metro. I've been going here since it first opened. They still have the best Pad Thai I've ever had. One thing that I read a lot about (not just on Yelp) is that their service is, well, lacking. In my experience, the service is hit or miss-- sometimes I've had very attentive waitpersons, and other times you have to work to get their attention, especially if it's very busy.*If nothing else, get take-out... it's all about the food here. That's the reason I've been coming here for 18+ years. * The Taste of Thailand location on Hudson Road and White Bear Avenue has the same food, but better service."], ["Kate H.", "I was craving pad thai tonight. After 20 mins of trying to call and getting a busy phone line, I sent my husband over there to order (even though I knew it would mean having to wait 30+ mins at the restaurant for our food). He texted me a picture of their phone clearly off the hook. He then called me and said no one was interested in taking his order. I asked if there was anyone working and he said \"Oh yeah, there's several employees here but no one will help me.\" He has zero patience for this type of thing so he left. And now I am left with an unsatisfied craving. And a husband who will never eat Thai with me again. :("], ["Nate D.", "Solid food. Only complaint is that they have the wrong phone number listed on their OWN website. If you want to order takeout, their number is 651.644.3997."], ["katie h.", "Based on the very positive reviews while in St. Paul last weekend we decided to stop by.  I have to say that were I a college student I probably wouldn't have minded the grimy booths, the stained carpet, the sticky menus, and the tired buffet, but now that I'm a grown up all these things are no longer charming - they're just gross.  The prices weren't particularly student-low either.The food was pretty okay.  Not terrible - but not great either.  The phad thai was nothing to write home about.  We liked the curry better.  The thai iced-tea definitely should be skipped.Service is as stated by others - s l o w - .I wouldn't recommend going out of my way for this one."], ["Tina D.", "I love what I eat here, which is always the same thing, unfortunately. I actually crave their Pra Ram Long Song and Pork Pad Thai. I don't typically like pad thai, but LOVE theirs. I also think they have awesome spring rolls with lots of fresh mint. I really should try other things on the menu, but I only go there to get these favorite dishes. On the downside, I laugh at the service because they are consistently unfriendly and rude. I wonder why they work there?? If you don't care about service, take a friend to lunch!"], ["Michael H.", "On a trip back to the Twin Cities, I had a stop at Taste of Thailand on the agenda. This establishment gave me my first experience with Thai food in the late 90s during college; it became a staple of my diet back then. I was worried that the food wouldn't live up to my memory. What if my tastes had developed? What if their quality had declined? Not a chance. The spring rolls were divine. The pad thai was perfectly seasoned and wonderfully tasty. I wanted to put the restaurant in my suitcase and bring it back to Washington, DC. In the past ten years, I have not found a better reasonably priced Thai restaurant (one of the best values in town at around 10 bucks an entree). Taste of Thailand is the place to go.  The only caveat: the kitchen can be slow when they're busy. Don't necessarily go in a rush at mealtime. That said, I got my pad thai in 20  minutes last time around. They have takeout and dine-in. Yum."], ["Drew B.", "Pad thai at its bestExtra peanuts on top pleaseGood lord that is hot(If you haven't tried taste of thailand, you really should.  I agree with Eric's comments below that the food can be a little hit or miss.  It's better than most Thai places EVEN WHEN it's not at peak performance, though!  So just do it... go and grab a take-out order of pad thai, go home, and enjoy! Oh, and get it spicy, if you can handle it!)"], ["Margaret O.", "Best Thai food in the Twin Cities. You may have to wait a bit, but it 's worth it. The interior was also re-done in the last year, so the atmosphere is much enhanced.  My favorites are the special spring rolls, Pra Ram Long Son (sp?) - spinach and peanut sauce with your choice of meat, and lemongrass chicken soup with coconut milk. Cream cheese puffs are light and crispy with not too much breading and lots of yummy cream cheese in the center. And for those of us with a \"minnesota\" palette, ordering anything 'mild' won't reduce the amazing flavors but will mean it's not too spicy to enjoy.  My friends who love spicey food, however, also tell me that ordering 'with spice' is great for them. Because the wait time can be long, and service is spotty, I'll often get take-out."], ["Riley G.", "I'm a huge Thai fan and this is one of the best places around the Twin Cities, hands down. My favorite is their classic pad thai dish. I always get mushrooms with pork and I get it on the spicier side. It's perfectly seasoned and pretty generous portions (I usually have enough for two meals). I've also had the coconut curry with chicken...and that was excellent too. I usually get take out, but have eaten a few times there too. If you live in the St Paul area, this is the best place for classic thai food in my opinion."], ["Michelle P.", "In my meat eating days, I ordered a chicken fried rice. Took quite a while to come out. But it was pretty good, and a fairly large serving. Nothing fantastic, but it seems like a reliable place to go to."], ["Eugene V.", "This restaurant is better than most Thai places I have visited, and certainly better than anything within 10 miles. The portions are not huge (if you're ordering entrees only, don't expect to take anything home) but the food is wonderful. Try some of the beef laab and sticky rice! I would avoid the Thai coffee, though -- too sweet. The menu is large and varied, with a number of selections I have not seen in other Thai restaurants, but the classics are all there. Taste of Thailand is one of my new favorites!"], ["Keely R.", "We went there tonight for the first time. Service very attentive, drinks refilled constantly, and food (Pad Thai with shrimp and Pad Bai) was delicious. We will be back."], ["Joseph W.", "I can't take my friends here.  It has given several of my friends head aches (MSG?).  I don't get headaches but I still don't go there because while it is cheaper than some Thai places, it's still not worth the large dip in quality.  Their food is greasy and you would be much better served going to Pad Thai Grand or Krua Thai on University."], ["Rhonda G.", "This is like old home week for me. I haven't been here since 2000. This place has been remodeled and nothing like the last downer. The walls were painted a nice burgundy, that gave it an ambiance it never had before. We started with the special spring roll. I like the texture of the wrap. The flavors mixed with a syrupy dipping sauce felt like someone doing a jig in my mouth. It's definitely my favorite. I ordered#38. It's a curry, which I don't usually get but it was a peanut sauce on a bed of spinach. Who can't use more spinach in their diet. I got mine with shrimp, 8 good medium size. My husband got #48,  it had cashews in it, and was very good. My only beef is they don't give you enough rice for your entree and you have to pay a buck more for extra which is necessary, it's spicy, even if ordered mild. I have a feeling this is true for most of the entrees. They have a lunch buffet that I remember fondly, though some items are spicy. On it they had fried veggies and once it was fried corn. Being from the northeast equals corn fritters. If only I had some maple syrup with me. I ordered something more interesting for the sake of the review, but they do have the best pad thai, that I'm getting next time. The fried rice is excellent, it has a sweet under taste. Where you will go broke is the appetizers. They all sound so good, you'll have to show some restraint. The service can be trying, so don't hesitate to call someone over to take your order."], ["Robb S.", "The pad thai and spring rolls were a great combination."], ["Dan B.", "There's a reason I've been going to Taste of Thailand since I was a kid. The food is absolutely spectacular, and the owner is an honest to goodness sweetheart. Their Pad Thai is superb, but don't limit yourself to just that. Taste of Thailand has a gigantic menu with every Thai dish imaginable.  The portions are generous and the prices are very reasonable. I highly recommend this place."], ["Judd H.", "Take out only people! This is the only place I have not left a tip in my entire life. The food is above average but the service can be really bad."], ["Goober G.", "Slow, rundown, and filthy...no towels in bathroom, the entire place smelled foul.  The food was o.k., but not like it was several years ago."], ["Kat P.", "First time: Unbearably slow service -- probably a three star experience (okay food).Second time: Unbearably slow for takeout (took 50 minutes when they'd say it take 20); food wasn't very good.  The next day, WE WERE BOTH SICK AS HECK.  Taste of Thailand promptly lost all its remaining stars in my book.  There are far better options out there (that won't leave you doubled over the next morning)."], ["Courtney W.", "A friend took me here once and totally got me hooked - on takeout.  The restaurant itself is a filthy hole with fly paper hanging from the ceiling.  The outside isn't better.  I watched our server go out in front, stand in our window and smoke.  He worked on his car a little too.  So after a few sit down experiences, I decided to end my suffering and only order takeout.  And I became a happier person because of it."], ["Barbara J.", "After reading several reviews about the pad thai, I had to to make a special trip.  I walked in, grabbed a menu, ordered some food to go and was impressed by this place.  It was not busy so it only took about 8 or 9 minutes to get my order.  And, I got a nice hot cut of tea (for free) while I waited.  I gotta say, that pad tai was the best I have ever had.  Now that I have a menu for next time I will be back!"], ["L R.", "Been there twice and haven't seen the bad service that others have experienced.  I could eat their red curry vegetables and tofu every day for the rest of my life.  Four stars instead of five on account of the decor."], ["Ninja S.", "How dare you people compare this to Sawatdee!  I wouldn't let my dog eat at Sawatdee (if I had one right now).This place rocks.  A family establishment that tries very hard to make your dining experience a fine one.All the traditional thai meals are here and prepared well.  If you want takeout, it is painstakingly packaged and wrapped so that it will be nice and hot when you get home.I recommend trying the curry puffs if you haven't had them.  They're unlike anything I've had anywhere else.Update:  This place isn't quite as awesome as I remembered.  A bit dirtier, and less tasty.  I'm not sure what happened, but they're still an ok 4 stars."], ["Steve B.", "Usually I avoid this place because I think there is far better Thai food in the Twin Cities.  However, it's close to work and decided to give it another go.  Made to order is much better than their buffet, however my last visit I ordered the buffet adn thought it was pretty good and surprislingly spicy."], ["Amy M.", "Came for Pad Thai and Cream Cheese Wontons on a Thursday night. Quick service, great food!"], ["jordan o.", "Great Food, Horrible Service!"], ["JeongEun K.", "This restaurant and Sawatdee are my favorite places to get pad thai and cream cheese wontons. They recently redecorated, so it looks nicer inside; however, the booths are kind of uncomfortable. The one I sat in during the last visit seemed to be missing a spring. The food alon makes it worth it."], ["satchel b. m.", "i live above another thai restaurant with a couple locations in the twin cities but i continue to return to taste of thailand. best curry and best pad thai in the twin cities."], ["Mike F.", "THE BEST THAI in St. Paul. Ninja Ian down below makes a good point, Sawatdee is nothing compared to this place. I still miss it."], ["Erik B.", "Not to bad of a Thai place - the decor certainly isn't anything to talk about nicely, but I wasn't there for the bad chandeliers.  The food was pretty good - everyone seemed to enjoy it very well.  Unfortunately the service was kind of slow - but they guy could have just been having a bad day so I won't hold it against the place."]], "On's Thai Kitchen": [["Ramesh P.", "11/20/2015: Here for lunch with coworkers and everyone really enjoyed everything the group ordered.That place gets busier around lunch time so plan on coming a little early!"], ["Alice M.", "Ever since Bangkok Cuisine closed, my coworkers and I have been on a search for a replacement Thai place. Unfortunately, I don't think On's is it.We started with egg rolls and cream cheese wontons, which came out relatively quickly. The egg rolls here are really good-- nice and crunchy with yummy filling & dipping sauce.  As a cream cheese wonton connoisseur, I was NOT impressed with these. There was way too much cream cheese and the dipping sauce was too thick and syrupy.  The one saving grace was that the wrapping was nice and crunchy despite being on the thick side.For my entree I chose the tofu red curry. FYI-- the curries here are very soupy. It was good, but I wish the menu had been more descriptive/accurate of what vegetables would be in the curry.  I also felt the curry was heavy on the fish sauce. I've had the pad thai here before as well and it was not anything special.Our waitress was friendly, but the host was very curt and slow.  The service was quite slow as we were there for an hour and a half-- not what most people are hoping for lunch on a work day.The search continues for the perfect Thai..."], ["Kevin N.", "Great Thai food! We stumbled upon this place on Yelp after deliberating of where to go for dinner last night and I am glad we did. The ambiance is a bit rough but symbolic of a hard working and successful restaurant. If you are looking for fancy Thai this isn't the place. If you are looking for really solid Thai food and a traditional experience On's Thai Kitchen is it. We were sold by the photos of their spring rolls that we saw on Yelp, they did not disappoint in person. The menu at On's is your classic Asian fare picture menu. Albeit cheesy and cliche, it was particularly helpful in choosing from their array of traditional Thai dishes. My wife and I both shared the spring rolls and then ordered an entree to share. It was tough to decide as everything looked great. We landed on the chicken Pad Thai and Chicken Pad-See-Ew. Both were fantastic. The Pad-See-Ew was savory and delicious with perfectly cooked vegetables (Thai Broccoli) and the Pad Thai was a nice mix of sweet and sour. My mouth is watering as I write this review...dammit I might have to go back tonight! Prices are great at $8.99 for many of the noodle and stir fry dishes. We ordered two Big Singha beers, an appetizer and two entrees for under fifty dollars.Only downside and reason for not giving it 5 stars is the environment, its weathered a few storms. The kitchen is in the entry way hidden behind a curtain. It did not alter our experience whatsoever but with a little polishing this place is 5 stars for sure!"], ["Linli F.", "I love Thai food, with a passion. Of all the Thai restaurants I've tried around Twin Cities, this by far, has to be my favorite.Don't be fooled by this tiny family-owned restaurant located on University Avenue. This place is usually filled with people unless you're one of the first ones in. Of all the places I've been to, this has got to be the absolute BEST place to get tom yum soup. Their spice levels are on the \"Thai scale level\" so medium is very spicy. I usually go with mild-medium which is plenty for me and I am a lover of spicy food. I've tried tom yum soup at multiple Thai restaurants before and find that they vary greatly. Some have a creamier base, some have stronger herb flavors. This one is more of a water-base with a perfect amount of savory, sour, and spicy. It's the perfect balance of everything and it is absolutely delicious, hands down. It includes mushrooms, various herbs, and your choice of meat (or tofu).Another favorite of mine is the pad see ew noodles. It's a very flavorful noodle dish that comes with thick noodles stir fried with Chinese broccoli, eggs, and your choice of meat (or tofu). This dish is the perfect amount of sweet, mild saltiness, and savory. I can drown in this sauce, whatever it is. You can't go wrong with this dish.I've also had a few of their salads which were very authentic and delicious. I've tried various other dishes including their pad thai noodles, their pineapple fried rice, all of which I've enjoyed.Only down side about this place is that service can sometimes be quite slow, especially during their busy hours. Sometimes, you'll never get your water refilled after your first cup. I've came here a few times early, being one of their first customers in, but it still takes 20-30+ minutes to receive food. Don't expect it to be quick trip! If you're extremely hungry, portions are also smaller compared to other restaurants. You can get extra noodles for any noodle dish at an extra cost. I've tried this once, but felt like the portion of noodles they gave was not worth the extra price.Regardless, this is still a must-try."], ["Erin G.", "Definitely one that lived up to the hype. I wanted to LICK THE PLATE it was so good.I got a chicken Nam Thok, which is kinda like laab but sliced meat. It was absolute heaven. Perfect amount of spicy. I loved it. My server was attentive and helped me make choices. I can't wait to come back and try everything on the menu. Just go. There's really not a lot to say that hasn't already been said. It's so legit."], ["Linda H.", "Its about time I update my review considering I practically beg people to try this place!  Since my previous review, I have eaten here probably 25+ times.  I have never experienced the bad service again.  I would not come here if you are in a rush, however, because the wait times can get a little long and it does take awhile for your entrees but when they do get to your table, its piping hot plates of fresh goodness!I love #76, the Peanut Curry, Pad Thai, Cream Cheese Wontons, Spring Rolls, Egg Rolls, and Ci loves loves their Pad Se Eww.  She also tried their Pho and said it was good.  I am not a Pho fan so I didn't even taste it.What I love the most, is how fresh the meats and veggies taste, and how hot the food always is.  You can actually see them preparing your food as you walk in.  No secrets here.  I really like open kitchens.  I feel its best for accountability.  My friend ordered the shrimp as her protein on a dish one time and they were huge! Not those teeny tiny shrimp you get a Red Lobster but big shrimp.  She was actually a Thai food Virgin and she raved about how much she loved the food!What more can I say?  I am upgrading from a three star to a Five Star and should have done so a long time ago!  Try this place but I would suggest going mid week.  Parking is a little tight but Do NOT park in the salon parking spaces, I hear they tow even later at night so park in the lot immediately behind or on the top lot."], ["Elena W.", "Woah! Here we were, nowhere to eat on a Friday afternoon because Supatras was closed for lunch (inexplicably, but that's for another review). We wandered into an awesome maternity 2nd hand store (again, another review) and expressed my insatiable, pregnancy fueled desire for some kind of soup. I had wanted some kind of Thai soup Supatras claimed to offer for lunch. Understanding my need, the owner of this maternity store directed us here to On's. And wow, am I glad fate had its way with us. For starters, I am never in this portion of St. Paul. Discovering Supatras was a fluke. This was even more happenstance. Unassuming from the outside, I was pleasantly surprised with the inside. Ample booth space makes way for an adequate sized dining area. There were plenty of open spaces to sit and we were seated promptly. **Diner be ware! I have been informed this is unusual -- It gets busy here. We were dining during non-peak hours, a few hours after a normal lunch rush, on a week day. Use great caution going during typical dinner rush hours, and especially on weekends. Papaya Bubble Tea was delicious! And the portions are heaping, which is nice considering it is a bit pricey - $5.00 for the only size they got. Jasmine tea was light and fragrant and allowed to steep loose in the pot, so you will have some divination to catch up on once you finish your cup. :) Menu is large. I am so happy to see so many offerings at a Thai restaurant here in the cities. I feel that so often, Minnesotans have the wool pulled over their eyes. We are easily malleable creatures. Pad Thai is the only Thai dish we need. Anything else is frivolous. On's, in it's own way, sets out to change that. 4 double sided menu pages chalk full of delicious, authentic Thai offerings. Soups, Salads, Entrees, Pad Thai, and Appetizers make a colorful and diverse menu set. A friendly Minnesotan warning: The food is spicy. Spicy. Capital S. Medium was making my Ghost-Pepper addicted boyfriend sniffle and slow his eating down. Maybe he's a wuss, I don't know. Anyways, I ordered my soup Mild. It was Mild, and my Minnesotan palate was happy and no flavor was sacrificed. Order Spice at your own risk. The Food:*Massamun Curry. Ordered Mild. %##%^&^%$@!!! DELICIOUS! What is this?! Why is it so good? I think this soup could turn any bad day into a \"learning experience\". A good book, a rainy afternoon and this soup would turn anyone into a firm believer that food is an experience to be enjoyed. Chicken noodle soup will do nothing for my colds, now.A creamy yet translucent broth sprinkled with pepper flakes is the medium for the potatoes, meat (I got tofu, I'm sure anything else would be phenomenal), onions and, apparently, pineapple, although I did not find any pineapple in mine. No matter, it was delicious. Served with a small side of rice, I spooned some of the broth over rice and ate my tofu with it. Eventually I ditched the rice and went straight for the good stuff. Either way, this is a must have. *Beef Pad Thai. Ordered Medium. Spicy! Exciting! A perfect blend of noodle and sauce. Do not be afraid of the tragedy to befall many Twin Cities Thai restaurants. These noodles did not clump together and weigh you down with starch and sauce. Plate presentation was beautiful, too. A filling dish for sure, but not so much you can't walk when you're done. Medium was spicy. See above. A must-try. *Cream Cheese Wontons.Not Thai. Probably related to the \"Chinese\" fortune cookie. Either way, house-made and definitely delicious. Steaming hot, too, so watch the filling. The sweet and sour was NOT a cherry jolly rancher colored corn syrup mixture, but rather, had a slight kick to it and looked quite home made. Really, it was good. 4 Stars. We will be back. Service was good, but, we did wait for some time before we were given waters or drinks. About 10 minutes. The server was otherwise very attentive, but I hear this place is quite the popular joint, so be cautious about what time you go. Parking is on the side of the building, but it might be hard to find during peak hours. Take that into consideration prior to planning your visit. Happy Eatings!"], ["Jonathan T.", "I've been meaning to eat at this hideaway off of University and Snelling for a hot minute, but something always happens. Whether the family -- that owns the joint -- is on vacation or the line is out of the door and into the parking lot, I've never found \"a good time.\" Thankfully, my homie John O (aka the TC's Beer Battalion Captain) suggested to have lunch there, and I immediately leapt at the opportunity. Since then, I've been back. Okay, let's get into it:I. FOOD*Stuffed Chicken Wings: I thought my Hmong fam bam were the only ones that these stuffed chicken wings, but I was wrong. These beauties were hella plump, thick with flavor, and came with a delectable sweet dipping sauce. You get a lot for the price. *Stuffed Crab Cakes: Pretty good, although not my favorite. A bit over fried. **Pad See Ew: This is Paul Pierce good aka The Truth! The sauce they use help pack umami bombs for days, and they definitely don't skimp out on the toppings (whatever you ask them to be). **Thai Green Curry: A bit too watery for my taste and they skimp out on fillings. I would not recommend. II. SERVICEAlways nice. Always friendly. Always no issue.III. ATMOSPHERE/ DÉCORIt's really dim inside, and I wouldn't characterize it as intimate. It's also small, so make sure you visit during non-peak hours.IV. PRICESDespite the hype they have, they haven't really compromised prices. And that's amazing, since hte food is so good.V. OVERALLHell yeah, I would pho sho come back to On Thai's! It's one of my favorite Thai joints in the TC, no doubt."], ["Naomi T.", "SO GOOD! I always want to order so many dishes when I go - mango salad, spring rolls, pad see ew with tofu, panang curry, cream cheese wontons. I just always hope that the friends I go with will let me share! We usually try to go a little early or it can take a while to get seated and served."], ["Ellie E.", "On's Thai Kitchen is totally legit!  I loved everything about this cute little place.  Service was prompt, however, my visit was during 'off peak' lunchtime hours during the week. I couldn't decide what to get and my server gave me a bunch of recommendations, but didn't overwhelm me.  I decided to start with egg rolls for $3 while I browsed.  They were insanely good.  Seriously, I could taste what was actually in them, and not just random deep fried crap.  I loved the dipping sauce that came with them.  Yum!I settled on the spicy noodles with chicken.  I reeallly loved it!!  I have no idea what the \"On's spicy sauce\" is that comes on the noodles, but it was fabulous!   It was large enough that I was able to take half of it home.Reviews on here warned me that the spice level at On's are a little higher than at other thai places.  The server also double checked with me about the spice level.  I got a little nervous and decided that I could always add more if it wasn't enough, but taking spice away is much harder.  I ordered my noodles \"mild-medium\" and it was perfect!  If I hadn't been on my lunch break, and could order a beer or cocktail, I probably would have gotten medium."], ["Troy J.", "We couldn't have asked for a better start to the meal than the pork egg rolls at On's. They were crispy, tightly-packed and meaty. The sauce that accompanied the egg rolls had better thickness, flavor and shine than the sauce you'll see at every other Asian restaurant.  The spicy noodles, featuring On's own spicy sauce, were tangy and sweet with a peppery afterburn.  The ratio of sauce-to-noodles was off for my taste. When I was done eating, there was still a 1/4\" of sauce remaining.  It could have flavored an entire, additional plate of noodles. Overall, I'd describe the food we ate at On's as 'saucy-er' and 'tangy-er' than the food you'll have at other Asian restaurants. The fact that On's food is saucy may account for the general stickiness (aka 'icky-ness') of the tables."], ["Sonya F.", "Based on the rave yelp reviews, I was expecting better.I have been there twice now. The first time I got the pad thai, which was fine but nothing to write home about. The whole experience was pretty unremarkable.The next time, my bf and I were craving some green curry and decided to go to On's since we were in the neighborhood. We walked in around 2 pm on a Saturday to a pretty empty restaurant. We were seated right away and immediately knew what we wanted but our waiter didn't come to take our order for about 25 minutes. We eventually got our green curries, which was decent tasting, but nothing special. Our waiter never came to check up on our table while we were eating. Then, once we were very clearly finished eating, our waiter never came to give us our bill. We were finally able to flag him down about 30 minutes after we were done. I don't like to change my ratings for places based on service unless it is exceptionally good or bad. And in this case, it was BAD. We felt completely ignored the entire time we were there. There was another server working there at the same time who seemed to be much better. She seemed efficient and friendly. Maybe our experience would have been different if she were our server. Unfortunately, our whole experience left a really bad impression and the food wasn't nearly good enough to make up for it. I don't think I'll be returning."], ["Sophie C.", "This place is probably the most authentic Thai food in the Twin Cities area that I have tried so far. I also really like Amazing Thailand, but On's taste a bit more authentic Thai. It's not exactly clean though, but I would go there for the food again.1. When you asked them to make your food spicy, it actually comes out spicy. I would say spicier than the spice levels at Amazing Thailand.2. I had the peanut sauce entree that is mentioned in many Yelper's review, but this was too sweet for my taste. I probably wouldn't get this again personally.3. The Tod Man appetizer is like a Thai version of fish cakes - will order again.4. The Tom Kha soup was very, very good. It's a coconut cream based mushroom and cilantro soup with lemongrass, and you get a choice of meat. I regret making this at the spiciest level since I felt like the spiciness took away from the taste of the soup. 5. I can feel my eyes burning a little while dining in since it's an open kitchen, and they are constantly cooking with peppers :)"], ["Zack B.", "This place is hands down THE BEST THAI RESTAURANT IN SAINT PAUL!!!! I always get the green curry Thai spicy and it's the BEST!!! I literally crave this place and I eat here once a week at least if I am in town and not on the road working. I'm fortunate to live a few miles from the this gem of a spot but I would travel from Minneapolis once a week if need be for this food. The staff is great as well and the price is excellent for the value of this marvelous food! 5 stars all day everyday!"], ["Master A.", "I should follow my own rules. There were plenty of signs that told me to turn back, but I didn't. I had to find out why people are giving this place such good reviews. It kind of reminded me of the Final Destination movies where death is giving all sorts of signs, but they just didn't get it.Here were the signs....1) Parking is horrendous.  Their parking lot can fit about 6 cars. You will have to park in the parking lot on Sherburne and jump down to the alley. Yes, jump, like Micheal Jordan jumps when he dunks a basketball. JUMP!, like how Kriss Kross will make you....Good luck getting back up there if you don't have a nice vertical.2) The waiter wasn't Asian (always a bad sign for a supposedly hole in the wall Asian restaurant).3) I didn't see any Asians eating in there. If Asians don't think the food is good, it's probably not good. Also, a good majority of the reviews were by non-Asians. (I'm not prejudice. I have many non-Asian friends.)4) It took the waiter forever to give me the menus and water. It didn't even look busy. There were plenty of tables open. Took forever to come take my order too. I had to go hunt him down.Now on to the food. The food was actually pretty decent. The 2 star review is mainly for the service. I guess since not many Asians eat there, they had to garnish it up to make it look pretty. I don't care about the extra cucumber and lime slices to make my fried rice look fancy. The rations are also a little smaller than other Thai places on University. The prices were also competitive with the other options on University as well.The service was very slow. It took about 15-20 minutes for them to take my order. I put my order in. It was a simple order. Eggrolls, Pad Thai, and fried rice. It took over 30 minutes to get my food. When I was done, I needed a box and needed to pay. No waiter in sight. I had to go hunt him down again, but ran into the bus boy and he gave me a box. Finally after 5 more minutes, the waiter finally came by and I was able to pay.After I was done, I looked at the time. It had been almost 1 hr and 30 minutes since I sat down. If you like to wait, this is the place for you.Would I recommend? No. I'm all about the service. I can get egg rolls down the road with better service. The ambiance isn't too pleasing either. They reused the old tables from the previous restaurant, which was Bon Xai. The ceiling was sprayed black to cover up any imperfections and the walls painted Halloween orange. I'm looking for a lunch place that I can actually go for lunch. Since this takes way more time than my allotted lunch time, I will not be going back."], ["John O.", "Never had beer hereBut the food is off the chainYou can get beer hereI absolutely love On's.  Seems to be getting good buzz on Yelp.  See people checking in all the time and tell them how awesome it is.  However, I haven't explored all that much on their menu.  I found one thing that I liked and I have stuck with it: Pad See Ew.  I had never had the aforementioned dish until I first came to On's probably about nine months ago.  I was looking for someplace near work to go and found  former TC YM Annie D's review and photos of On's.  Sealed the deal.Pad See Ew is kind of like Pad Thai, but the noodles are flat and thick.  Since having it my first time at On's, I have tried several Thai restaurants both in TC and in Phoenix and nothing else comes close to the Pad See Ew at On's.  I'm thinking Brown Sugar might be the thing that sets On's apart from others, but I am no expert in this area.  Just know that On's has the most flavorful, by far.  Oh yeah, and if you order it spicy - it comes out spicy!  I have a pretty high threshold, but I think it was causing JT some discomfort when we had lunch here.The parking does absolutely suck.  I have always gotten lucky the times that I have been here - often finding the last spot in their tiny, shared, sloped lot behind the building.  Take the light rail if you must, get the Pad See Ew, thank me later."], ["Caitlin H.", "Finally something that feels authentic (I'll pretend I didn't see cream cheese wontons on the menu)!Come here for dinner, some very authentic feeling dishes. Was the first Thai food I had in the twin cities that reminded me of being in Thailand. Staff was good, and pretty fast. If you don't like spice, be careful here! They spice their food like Thai people, not like Americans.Tried the Pad Suki Yaki. Super interesting. Almost like a thai spin on Franks Red Hot sauce with noodles and veg. Pad Shrimp and Asparagus was my mom's favourite. Had it mild and has a very tastey sauce. Green curry was very good. Personally wish there was more veggies, but the flavour was there. Also had dumplings and they were steamed. Much different than a pan fried, but super good as well!I will be coming back!"], ["Briana M.", "GREAT Tom Kha! Went at the end of lunch time and was impressed by the family atmosphere."], ["Mandy K.", "While my experience is limited, On's definitely has the best red curry I've ever had. Stopped by after a doctor appointment and was feeling like a dookie but the soup and service were excellent and I felt so much better afterwards. My partner got the Massamun curry and it was faaaaabulous in its own right."], ["Mahva J.", "Yummalicious Thai food found here! This restaurant serves, authentic, wonderful food here. It's kind of divey, which adds to the ambiance for the mix of people who dine here. The thing I love most about this place is that they do actually make your food as hot as you desire it...and they have PORK BELLY!!!"]], "Pad Thai Grand Cafe": [], "Asian Deli & Restaurant": [], "Pupraya Thai Restaurant": [["Mahva J.", "Nice place to convert others.My daughter wanted to go to Sawat Dee for her birthday. I refused and told her that I'd take her to a place for some really good Thai. So, we came to Pupraya Thai and as expected, it did not disappoint. My son, who doesn't eat anything at all spicy, was very happy with his Chicken Satay. He gobbled them up pretty quickly.My daughter got the Massaman Beef Curry and was very happy with it. I got the Tom Yum Soup, which I tend to get every time. It is the national soup of Thailand, and it deserves such a place of high stature. Daughter and I both got four on the heat scale (goes from 1-5) and our mouths were nicely on fire.One of the things that I love about this restaurant is that you can get genuine Thai food that isn't just hot. It epitomizes the Thai philosophy of Sweet, Sour, Salty, and Hot.I ordered a crab dish to go so that I could share it in the next day or so to follow the birthday dinner.  The only drawback is that the crab was still in the shell. It was, in spit of this, quite delicious.If you're on Rice Street looking for an unusual and wonderful place to eat some great Thai, stop in at Pupraya. I'd be surprised if you're disappointed."], ["Maya H.", "This place is no longer a restaurant.  They are a \"dance club\" Thursday-Sunday night."], ["Amy R.", "We were contemplating a stop in here the other day and remembered it for lunch today.Practically had the place to ourselves. There were just a few other tables.Their lunch buffett was pretty boring, but we were in somewhat of a hurry so we chose to do that option instead of the menu.-Fried rice-White Rice-Tofu soup-Chicken dish-Curry Dish-Cantaloupe and honeydew-chicken wings-spring rolls-Pad Thai-SaladAll of which were pretty bland and boring. No sticky rice or Thai peanut sauce? Really? We asked if they had any and it was like we were speaking Greek. Our server said they have sticky rice on other days. I figured both of those were staples. Not the case.I usually don't drink pop, but was craving some carbonation. Apparently all they serve is Coke or Sprite which comes in a can.The owners little girl was hanging out in the restaurant and kitchen. She was as cute as a bug, but liked to belch and then laugh about it. Mildly entertaining the first few times.I noticed one of the other patrons take her used bowl up to the buffett. We were both done after seeing that. There were plenty of clean ones that were wanting to be used to.Not sure I would go running back. At least not for lunch."], ["Ashley K.", "I visited Pupraya for the first time this past week with a group of friends and couldn't believe I had been missing out on this place for so long! The prices are very reasonable and the server was patient and friendly. However, we were the only people in place at the time. I ordered my food with three spicy stars out of five, and it was pretty hot, but I liked it. I had the drunken noodles and couldn't stop eating even though there was definitely enough food on my plate to feed 2 people. Not a good beer selection--the waitress claimed they only had Corona... but there is a \"full\" bar, too. I can't wait to return for a visit on a Friday or Saturday to check out the live music and dance floor!!! If the music video that was playing on repeat is any indication of the type of dance party they host, then it is sure to be entertaining! My only complaint is that our food did not come out together. They must have a really small kitchen...? Or the little girl prancing around and clicking her heels like a leprechaun kept getting the way of the cook...? Apps came at the same time or after entrees and I was finished eating before the last member of our party received her meal (I know, terrible manners)."], ["Nate D.", "Went here for lunch.  At 12:30, the place was empty.  That should have been a warning sign. But I decided to give them the benefit of the doubt.  Tried the lunch buffet.  All the food which looked fine at first inspection was really old and bland.  The pad thai was clumped together in a mass of noodles that had to be chipped apart.  And the service was terrible. Waitress never checked on me, her only customer, and when she forgot to give me my tab, I set cash on the table.  She still asked me to walk it over to the cash register to pay rather than just running my tab.  Thankfully there is a Subway in the same strip mall.  It is sad when Subway is seen as an upgrade.  Maybe the menu items are better, but the lunch buffet food and service are atrocious."], ["Eric S.", "Delicious Pad Thai and for $8.00 the portions were very big. Enough for 2 people. I also ordered the egg rolls which were just as  proper egg rolls should be, crispy, crunchy and well seasoned. Also had the beef noodle soup which was a bit like Pho and I asked for it super, super,super spicy and when it came it was not spicy at all. Clean restaurant and bathroom. Fast, attentive and polite service. Again only gripe is they didn't come with the spicy like I asked."], ["Mon P.", "Nice Thai place with good food but poor service.When we were there, the server couldnt answer anything that we asked. She kept saying 'I dont know.' Anyway, the food was really good though. We had calamari, papaya salad, roast duck curry, stir-fried chinese broccoli with crispy pork belly, and stir-fried crab with yellow curry sauce."], ["Ilovefood Y.", "My first time there was during the entertainment hours. It was very interesting! They have a good mixture of popular Asian music. The dance floor was packed with women and men dancing such as square dancing and traditional dancing. It was too crowded though in the restaurant, but it was fun watching. However, best of all was the FOOD! Talking about it makes me want to go back there now! I would say my favorite dish was the Laab Duck. Yum! It was very tasty, the herbs and seasonings in it was very flavorful. Gladly, my friend had ordered that. As for me, I ordered the House Special Pho and Thai Papaya. The pho was delicious! I thought it would taste like other Vietnamese places but no, I was wrong. It has it's own unique taste and the broth was just perfect. It had a very rich taste to it and was ready to eat. I didn't have to add any other condiments to it besides beat sprout, basil and lime. Oh and yes, I can't forget the about the Thai papaya, it was good and satisfying. I had them make it hot and boy was it hot! The spice was creeping on me but water did the job well for me. It was sweet, hot and a hint of sourness but very fresh papaya. The texture was good and crunchy. Just how I would like mines done. Overall, this was a wonderful experience. From music to dancing then onto food. I willcontinue going back to Pupraya!"], ["S O.", "I've been here for lunch with my mom. The food was pretty good, I mean, it's standard Asian/Thai fare, and in the end we had absolutely no complaints. so, that's that. Pad thai, rice, some chicken stir fry thing was what we ate."], ["Tim R.", "The lunch buffet was really cool but they stopped doing that.  I had a homeless person come up to my car, while in their parking lot, to pan handle: that was different."], ["Pang F.", "Food was ok but I ran into a situation with the owner. I presented the Yelp coupon on my mobile device and she refused to honor it after I had ordered $50 worth of food. She was adamant about the need for the print out when clearly the policy on the voucher stated otherwise. Will not return again."]], "Royal Orchid": [["J S.", "Great staff. Chef/owner came out and greeted. Owner's son runs front of the house with outstanding customer service. I knew about this place when I worked downtown a while working there the times I chose it were limited (sorry). Food is great! The price is reasonable seeing as though you get home cooked style food with a comparable price. I also dig karta Thai, but seriously this place delivers to my house....booya that is awesome.  I support local businesses; if this place were in apple valley they would be out the door."], ["Mike B.", "Love this place. Been there many times. Gluten free options. Reasonably fast service. Usually pretty empty so I hope they don't close."], ["Jeannie V.", "So get this:  After writing my review, Royal Orchid contacted me with some new information.  Apparently, if I ask, they will make me the thin-dough potstickers of my dreams.  AND they deliver within a 5 mile radius - how did I miss that??  Definitely getting Thai for dinner tonight!"], ["C A.", "I can't praise Royal Orchard enough. Every item that I've ordered has been delicious.The Pad Thai is exactly what I would expect. The noodles are cooked well and has lots of flavor regardless of the spice level. I love their lunch specials because I can try more items at once, pairing two items plus rice. The Yellow Curry Chicken is my favorite dish yet. The chicken seems to be good quality, the curry is flavorful but not over powering and it just gets better the next day. I believe that the owners run the store day to day and are always very attentive. I do not think that my glass has ever been empty or we have waited more than a couple of minutes for service. The decor is a bit out dated but that's not why we go there. They will deliver if you are within 5 miles but be prepared to wait depending on how many people they have available at the time."], ["Tommy_n_Loretta C.", "Stopped in for lunch and had the potstickers and tofu pad Thai. The pad Thai was a bit too sweet for my taste. I asked for very hot spice level and got what I asked for. They should add fresh cilantro and a lime wedge to even put the sweetness of the dish. I would get the pad Thai again if they added lime and cilantro."], ["Ed C.", "The food was slow but was very good.  We were there for good quality food and service.  This place is top 1-2  Thai restaurant on my list in the TC.  The Pad Tai, Tom Ka soup, Massamun Ck Curry was very.good.  This is our 2nd time back and the kids just loved the food."], ["Travis D.", "In the mid 90s this place was winning awards left and right, but it's 2015 and there are better Thai restaurants in the area.  It needs a facelift, the service could be better, and the food wasn't great - but it was good.  It's just that I'd rather go down Central a bit for better food and service."], ["Emily H.", "Thank goodness Royal Orchid came back to the Twin Cities! I was kidda disappointed that they didn't move back to Roseville but nonetheless they are back! They have hands down the best pad thai. It's just very authentic like it came from your Thai Grandma's kitchen. No where else compares to their pad thai and believe me I tried to look. The look of the restaurant is very homey but don't let that turn you away. They service is pretty fast for a family run place. I would definitely  recommend this place to anyone craving good pad thai and would want to go here once a week if only it was closer."], ["David G.", "So good The  only problem is that Royal Orchard isn't closer to my house. We will be back"], ["Kyle T.", "Incredible food, I had no idea they moved from their location in Roseville, but I'm so glad I rediscovered this gem in Columbia Heights. Their homemade food is fantastic, I would choose this place over any other Asian food place in Minnesota. I can tell why they have won top 100 in the country."], ["Rosemary D.", "Found it to be really expensive and my food was sub par. I threw away the shrimp wonton things, they had no flavor."], ["Chang L.", "I don't often write reviews, but wanted to contribute in some minor way in promoting this restaurant.  Matter of fact, this might be the only review I have ever written on Yelp.  Although I might have, in the past, written one for like the Urban Bean or something.  I'm not sure why.In any event, I've now gone twice to this not-so-conspicuous restaurant bordering Nordeast and Fridley.  I don't want to make any grand statements about how it's the \"best Thai food in town\" - personally I would believe it - but, while I've tried quite a number of Thai places here, I haven't tried all of them and it would be silly of me to say.  But just in the two times I've been to Royal Orchid, I can genuinely say they make my favorite Thai food in the metro area.My typical go to dish is the Pad See Ew (spelled a variety of ways throughout town,  but here it's \"Pad Siew\" - and I do appreciate their concision) and this place does the job well.  Better than well.  I've also had the pork fried spring rolls, which was also quite good, the satay, which came with it a healthy and much appreciated slather of peanut sauce underneath the skewered chicken, and this most recent time, the chicken panang curry.  The single gripe I had about the food was that the panang curry, when ordered with chicken (and presumably with any other type of protein), came with only chicken and the curry, and nothing else.  I'm a fan of vegetables, and I was hoping, nay expecting, some (any!) would be included in the dish.  There were none, save for some basil leaves.  It was really my mistake, and I should have ordered an extra serving to be included, which would have made the dish exceptional.  But really, the dish itself without addition was already quite exceptional.  I, without second thought, ate the entire thing. I did also shamelessly reach across the table on several occasions and tried my friends' curry noodles and red curry, both of which were quite amazing.  So this place gets my 5-star review.  I would suggest you go.  The reason being, typically when I have Thai food, I'm not either disappointed or blown away.  The food goes in, and shortly thereafter I forget about it.  This place has broken that pattern for me.They do take-out, they do delivery, they do dine-in.  The owner/chef both times when I went came out to the dining area and spoke to us at length about all manner of interesting things.  Turns out he is an amazing fruit carver.  I didn't know that was a thing. He also gives lessons for that."], ["D M.", "Enjoyed the pad thai, which was among the better that I've had in the cities. My friend also enjoyed her meal. We'd both return. The restaurant could likely benefit from some background music, but the food makes up for ambiance."], ["Jeff K.", "Great wings and soft rolls for appetizers. Can definitely recommend the curry noodles with seafood adder. Excellent service and great food- will be back to enjoy the food again!!"], ["Hayley R.", "Great food, great service. The curry puffs were out of this world. We had the fried rice and pad Thai, both made at the perfect spice level. Quality!!! Will come back again."], ["Bill E.", "We used to go to the Royal Orchid when it was in Roseville, and we just discovered their new location today. I had the pineapple fried rice with tofu - a dish I had enjoyed before - but this time I had it stir-fried with yellow curry. The presentation is striking (served in a pineapple shell) and the taste is amazing, with strong hints of ginger. The server was very friendly and accommodating."], ["Sarah L.", "My husband and I are big fans of Thai food and have frequented the other Thai restaurants in the area quite a bit. Royal Orchid is closest to our house but we had never tried it.  One day we decided to order take out and now we are hooked!  Each time we've had something different.  So far we've had the pineapple fried rice, curry noodles, cream cheese wontons, peanut sauce chicken stir fry, Tom yum soup, Tom kha soup, curry puffs and the brandy noodles (like pad see iew).  Everything has been very very flavorful and delicious!!"], ["Amber N.", "This has become a staple with my family. We love the pad Thai and the pho. The place doesn't look like much but the food is amazing."], ["Dakota K.", "This is my favorite Thai restaurant I have ever been to. And I've eaten a lot of Thai food! Very vegetarian and vegan friendly too. The food is honestly just so good, I wish I could eat here everyday! The Pad Thai is probably my favorite dish I've tried so far, but I've had many others and honestly everything is great."], ["Joy H.", "This is STILL my favorite Thai restaurant of all time.  Service is slow, so come with people that you like to talk with.  The food is worth waiting for.  Interesting flavors, as spicy or mild as you like it. Starting right at the top of the menu, the Crispy Rolls (egg rolls) got a double thumbs up from those who ate them.  The Chicken Satay has spoiled my daughter so she doesn't like any others. I was with 6 other people tonight, and everything we ordered was outstanding.  We avoided some of our older favorites like Pineaple Fried Rice, their coconut/curries and Pepper Basil stir fry, and tried some dishes that were new to us.  The Ginger Brandy stir fry was a delicious sweetly savory combination, which we ordered medium spicy to give it a little kick, and may have been my personal favorite of the evening.  Both noodle dishes, Pahd Siew and the Curry Sauce Noodles, were fabulous, and our resident noodle - head couldn't decide which one he liked better.  The Pahd Prik King was satisfying to those of us who liked a little more kick to our spicy dishes, as was the special - a complexly-flavored tuna dish that surprised me a little with its spiciness, but still let the tuna flavor come through. For dessert, the Thai Custard was good, the Mango with Sticky Rice was better, and the home-made Coconut Ice Cream (not on their on-line menu, so I am not sure they normally have it) was simply addictive.  I was disappointed to see that they were not really, really busy on a Saturday night, because there is nowhere else I know that makes food this good, and I wouldn't want them to close."], ["Mary W.", "Pad Thai and Panang Curry are favorites but haven't had a bad dish. Great spicy food."], ["Phil M.", "This restaurant has been open for 9 months and I had no idea.  Drove past probably 20 times and never even saw it!   Spotted it a week or so ago and went this weekend to check it out.  I am glad I did.  Parking was easy and free, and the food was great.  I chatted with the owner and the owners son who were very friendly.  Its the kind of place where the people are so nice that you want to see their business grow.  They are also originally from Thailand so the food is the real deal. When it came to ordering, everything on the menu looked great so it was hard to choose.  I eventually landed on a sweet stir fry with pineapples, peppers, and mixed vegetables and also ordered the Massaman curry. Both were very good and I would order them again but will likely try something different next time.  The portions were good sized, the vegetables were crispy yet still cooked and both had a very good and distinct flavor. It is some of the best Thai food I have had in a long time.   Regretfully the place was not super busy other than several people picking up take out.    Reasonable prices, easy access, worth checking out and even taking a drive to do so.  I will be back again for sure."], ["Heidi O.", "I vote yes to this place.  Went for lunch today with a friend.  We shared an order of the crab soft rolls, which were fresh and delicious -- then each order the combo lunch special.  I couldn't decide between the pad thai and the panang curry - so ordered the combo with some of each.  The pad thai wasn't my favorite one I've ever had, but was still tasty.  However, the panang curry was magical.  And the lunch prices are tough to beat.  The regular lunch special was -- I think -- about $5.49, and the combo was something like $6.79.  Pretty hard to beat for such a delicious lunch!The gentleman who served us was also great - very friendly and helpful!"], ["Laura F.", "LOVE this place!  We eat here all the time and always have a wonderful experience. We have loved everything we have ever ordered. Fantastic authentic Thai food! The chef/owner always comes out to greet us, the service is wonderful every time. They make sure our meals are always made vegan. Not only do they get it right, they remember. We have brought so many family and friends here, they have all loved it as well. Royal Orchid is a fantastic little family owned restaurant! We can't hardly for our next visit."], ["Jason S.", "I have been coming to this Thai place for some time now. I love  the food; Pat the cook is always more friendly than anyone. I feel like I am in Thailand when I am there with the friendliness and the overall food expertise!"], ["Miss C.", "I was visiting my sister who lives in Columbia Heights and we looked up thai food that was close to her house.  Royal Orchid was about 4 blocks away.  I eat a lot of Thai food, and am pretty picky about good Thai!When we got there, we were greeted by a young man who was extremely friendly.  He seated us promptly, brought us water and took our drink orders right away.  We then ordered the Larb salad with tofu.  AWESOME!!!!  The spices were perfect, just the right amount of mint and cilantro.  I also ordered the avacado spring rolls which were really a nice departure from plain tofu spring rolls.  For an entree we had the Bourbon noodles which were really tasty.  During the course of the meal, the owner and his sister both came out to talk to us.  They were so warm and friendly.  The only issue I had was that I didn't save enough room for the Sticky Rice and Mango for dessert.  But no worries, I will get that next time I am there.  In short, LOVELY food, friendly people, decent prices.  I WILL be back!!!  Do yourself a favor and go!"], ["Kate R.", "Literally the best Thai I've ever had! The green curry and phad thai are excellent, and the staff is so attentive! They do convenient take-out! They also cater to vegetarians and vegans."], ["Rachel C.", "Went here on my lunch break with my boss. We work down the street and like to try the local places in the area. I want to start off by saying how friendly and personable the owner and his son are. They know how to make you feel welcome. The interior is typical to a lot of NE restaurants: not much to look at, but you can bet the food will be great. And it was. My boss and I both ordered from the lunch specials menu - enough food for a great price. I got the broccoli beef with rice. A little heavy on the ginger, but otherwise very fresh and delicious. Not greasy and fatty like a lot of take-out place. My boss ordered the spicy version, and it was amazing! I'll be getting that next time (it was a little too spicy for his tastes). They serve beer, including a variety of Asian imports which I'm down to try sometime. Go eat lunch here sometime. It's very laid back and the food was very fresh!"], ["Caitlin S.", "I went to the Royal Orchid for dinner with my dad, sister and grandma. My grandma was the one to suggest it as the Royal Orchid had participated in a food tour recently and she had really liked the food.  So glad she recommended it!We shared the cheese puffs for the appetizer, pretty normal, I guess you can't really go wrong with cream cheese won-tons though. Our entrees were amazing, we each got something different and thoroughly enjoyed everything. My grandma finished her entire pad thai -- totally unexpected! My sister got the Peanut Sauce Stir-Fry with Chicken. Super yummy, peanut-y and mild with lots of flavor. My dad got the Curry Sauce Noodles - glorious. I'm getting this next time. It came in a massive bowl which I thought would last him about 3 meals. He did too until he polished it off. I got the Green \"Sweet\" Curry - IT IS NOT SWEET!! It is delicious and has tons of flavor but, like most green curries, it is SPICY!!  They do say this on the menu and I knew to expect spice so I was completely fine with it but I did get made fun of a bit - I looked like I was suffering through dinner. Totally worth it though. The owner was really nice, friendly and offered us samples of caramel rolls before we ordered. Apparently they take 3 days to make! He clearly cares about his customers and made it an enjoyable experience for everyone.I'll definitely be returning to Royal Orchid - I didn't realize until we got there that it is the same Royal Orchid that had been in Roseville near Babies'R'Us. I'm glad we've found them again! Highly recommended!!Parking is on the street on Central Ave. There's a ramp behind the restaurant that I believe you can park in but I think you'd be better off parking at the strip mall across Central and walking over if you're not up to parallel parking in front."], ["Adriane G.", "UPDATE:So, we decided to give this place another try after being open for a good 6 months to work out the kinks. I am pleased to say that they have definitely won me over with their delightfully spicy Panang curry, sweet green curry and tri-spiced fish. We also loved the paradise shrimp, which were cooked to perfection. There were a few things we did not love, but overall I was a vast improvement compared to our first experience and we will definitely be back."], ["Laura J.", "Royal Orchid is a tiny gem buried in Columbia Heights. My husband and I were drawn in by the \"BEST THAI FOOD\" If it's posted in the window, it has to be true right?! Well, we really thought it was going to be a laughable buffet style hangover joint and we were so wrong. The chef is a true master of his craft. The curry is always a perfect balance of coconut and spice. The thai tea will keep me coming back for years. My husband's favorite is the Thai Curry Noodles which he so affectionately calls 'the best thing ever'.The place is not fancy nor ever packed, however, you will always see a steady stream of people getting take out because THEY KNOW. They know it's great food and can't stay away for long!"], ["Mindi R.", "We love this restaurant. We used to eat at the Roseville location, and were excited to see them reopen. The only reason I gave them a 4 instead of a 5 has nothing to do with the food or service. I think attention to detail is missing with the restaurant environment. I don't find it dirty, or I wouldn't keep going back, but I do feel that the place could be lighter and brighter. It just seems dingy because it's too dark :)"], ["Cindy S.", "Amazing! We've been going to RO since it was on Nicollet. Still love it just as much as we did back then... complex flavor and a menu that's perfectly varied. Yum, yum, yum!!!"], ["Jigleepaf D.", "The pad thai was very good as well as the curry puffs. Prices are not bad especially that you get a huge serving. Service was very good. Would definitely go back to try more dishes."], ["Elisabeth M.", "I was excited to try Royal Orchid....I heard many times that their previous location in Roseville was very good.  I was disappointed to say the least.  The Pad Thai was very bland with only a few veggies  when I asked for a lot. Also I requested no tofu and the dish was full of it.  The spring rolls had one flavorless shrimp in them and too much lettuce.  I'm giving them 3 stars because the curry was pretty good....nothing spectacular just basic and filling. My kids liked the meatballs but I thought the texture was rubbery.  I won't be back :("]], "Karta Thai": [["Rachel E.", "Another excellent dinner at Karta Thai - but this time dining in!I brought my dad here for dinner a few weeks ago. If you have read my Yelp reviews before, I haven't mentioned a dining experience with my dad yet. This is because he is the least adventurous eater in the world. He literally told me Punch Pizza was \"too exotic.\"By some small miracle, I managed to drag him into Karta and told him to get the chicken pad Thai (typically a safe bet for a timid first-timer). Our waiter brought out complimentary egg rolls with the cream cheese puff appetizer we ordered and I forced my dad to try them. He thought they were fantastic.Yelpers, that simply doesn't happen with my father.Our entrees came and I was thoroughly pleased with my green seafood curry. The real treat was that my dad also liked his meal. I almost video taped him saying \"it's pretty good!\" to send to my brother because I was so astonished that he wasn't pushing it aside and saying he would grab just Subway afterwards.SERIOUS props, Karta Thai. You've managed to win over a man who thinks Olive Garden is phenomenal Italian."], ["Paruj A.", "I recommend eating here! Trust me! It has very good food ... a cat walked into the restaurant while we were there... it was kind of cool! It apparently wasn't a pet...Food is great!"], ["Kate S.", "Terrible take out experience tonight. Quoted 30 minutes and it took a hour, no apologies were made for the inconvenience, then when we got home, one of the dishes was chicken instead of vegetable and the other was bland and flavorless. They were VERY clearly understaffed and even the bitesquad guy mentioned it being worse than the night before, which doesn't give me much confidence in returning. The next time you're thinking of approaching Karta, do yourself a favor: turn around and walk into Sen Yai Sen Lek instead."], ["Jennifer B.", "I'm stoked to have gone here, and until it disappoints, it'll be my go-to for Thai in Minneapolis area.  It's definitely better than the Thai place across the street.  The vegetable penang curry was delicious but not quite spicy enough for me.  I also liked their pad thai (I had a bite of my friend's), even though it was too sweet for her.  Great price, good service if a little slow, but tasty food is what matters most!"], ["Marlee M.", "My boyfriend and I came here about a month ago on a Saturday morning and it was virtually just us in the restaurant which was nice. The lobster cream cheese rolls are absolutely amazing! The main reason I'm giving one stars because my boyfriend ordered a pork stirfry and about six hours later and it up with violent puking spells and after 25 bathroom trips it was apparent that he has severe food poisoning.. Undercooking pork is easy to do.. And since I had a chicken dish I didn't have symptoms. When I went back the next day to politely let the ladies know they were less than friendly and insured it was something else he ate that day. Which in fact he didn't because his stomach was in knots all afternoon. Just be careful' make sure your food is cooked thoroughly!"], ["Alejandro C.", "I use to love this place but the last to times the food its not what use to be . We order the pumpkin curry with chicken , the chicken wasn't fresh and the pumpkin hard like rock ."], ["Lila C.", "I was craving pad thai for a while and True Thai had closed so I was back at square one. It was a toss up between Karta Thai or Chiang Mai Thai in Uptown but laziness and proximity won so my friend and I headed to the NE.  We were able to get street parking directly in front on Central Ave despite the fact that it was winter and 6 pm on a Monday night. The service was friendly, everyone in the kitchen was festive with santa hats for the holidays, and the space could have used some Pier One help but I had only come for the food.  1. Spring rolls - too many noodles in this, needs more veggies, and some sad small to medium sized shrimp. 2. Green Curry Tofu -  a pile of vegetables and tofu with a little kick of spice but I was hoping for more sweetness to balance the dish; though still my favorite of the 3 items. 3. Chicken Pad Thai - really disappointed with this dish. This was straight up the Noodles & Company 's pad thai, and God knows I've eaten my fair share of that stuff to be able to recognize. It was clear to me that it exactly like Noodles by the taste and color, it's super bland and the sauce has an overall pink orangish glow. Same goes for the presentation, some sliced cabbage on the side but nothing to write home about.  The total came to $23 so at least we weren't playing for rent space in Calhoun Square but I think next time we'll have to splurge. I did see that they offered Bite Squad for deliveries.  2.5 stars."], ["kyle t.", "Kyle talk thai, Kyle talk good thai!Great find in Minneapolis while exploring the Northeast area, one of my favorites.  This is a little off the beaten path and not really what I even consider Northeast but this is another great place in a spot on Central that has more than one, good restaurant that is.This is a very clean, open and inviting little place with a great authentic feel to it.  Being fall they had a great Pumpkin Curry dish that was served in a hollowed out Pumpkin for a great presentation.  The food was very good, good spice, great presentation and a creative menu.Well worth the trip.KT"], ["Lacey H.", "Ummmmm.....I don't think I'll be ordering their chicken pad thai again. Very very dry. After I ordered, I remembeed that I was never asked how spicy i wanted it, which was a huge disappointment. I was even more disappointed when when i opened it at home and seen there was NO cilantro, lime, and it only had 5 slivers of green onion. I guess I paid for a few pieces of chicken, noodles, and pad thai sauce. More than disappointing since home is an hour north. Oh yeah, I swear on all 4, soon to be 5 of my kids I tasted Ketchup"], ["Amanda J.", "Wonderful, cheap curry. I love red curry and massaman and this place doesn't disappoint. Tiny space but good service!"], ["Maggie P.", "On a very hungover Sunday my boyfriend picked us up some cream cheese puffs, because we can never not have cream cheese puffs, pad Thai and the karta special noodle soup. The pad Thai was ok, it was a strange orange color and was a little bland according to my boyfriend who easily spiced it up with some siracha. The soup however was delicious, it was similar to pho but the broth was different, less sweet and more tangy. The highlight however were the cream cheese puffs, amazingly fresh and hot and the perfect amount of cream cheese."], ["Caitlin D.", "Absolutely would recommend stopping in to this hole-in-the-wall restaurant. Extra parking in the back."], ["David H.", "We had just attended the matinee show of Shen Yun.  Where to catch a bite to eat? We had no reservations so turned to Yelp.  We like Thai food and Karta Thai popped up.   Rice in a heart form.  A creative surprise.  Great Pad Panang and Green Curry."], ["Jonathan T.", "Heo yeah (Vietnamese joke).  Yo, I'm a big Asian dude and I gotta give mad love to this joint.  I have eaten at a lot of Thai places!  The green coconut curry is legit!  The drunken noodles is off the chain! SAY WORD!But yo, I wasn't really feeling the Pad Thai or Tom Yum Soup.  Other than that, the place is bomb dot com flying higher than a mastadon.  Peace!"], ["John C.", "Decore - standard, space - standard, service - standard, food - above average.The Shrimp Red Curry was very good, with a nice consistency and very good portion.  I love red curry (or any curry I guess, except maybe the one curry you sometimes see on Chinese menus), I like it a bit richer, thicker and more complex, than Karta Thai, but it was still quality.  And the eggplant entree was cooked well with nice flavors.We ordered some plain noodles for my daughter, and they brought out a nice portion of noodles for her.My only complaint was that the server was pretty hard to find, you know, phone and all, so I had to get some of my own utensils.  But I need the exercise."], ["Magnolia Y.", "Best Authentic Thai food in Minneapolis hands down!"], ["Dave L.", "Good spicy stuff. Weird art. The green coconut curry and drunken noodles is wonderful. I usually have quite a few left overs too. Nice, friendly service."], ["Gabriel D.", "Maybe my second Thai food experience in my life. Went here to have a buddy of mine have his Thai fix. Portions were big. Flavor was kicking and with one server she was everywhere and on point. It made me want to venture out some more in this unknown world of curry and spices. I'll be back."], ["April H.", "The food is amazing!! My favorite dish is the seafood basil and you can't skip out on the wontons. It's a bit small and in a small location but can't miss out on the food. The service might be slow on some given days but it's worth the wait. The food comes out quickly though. It's a good hole in the wall to try out."], ["Natalie W.", "This is currently my favorite Thai in Minneapolis. I try to go to a varied selection of restaurants, but Karta Thai just keeps popping into my mind and gives me a craving I cannot ignore. I've tried and loved 4 of their curry dishes and their cream cheese wontons (they're pretty good, certainly not the best ever), and my fiance can't even get himself to order anything other than the curry basil fried rice because he loves it so much. We've sold lots of others on it, as well. And the fact that they have super reasonable prices makes it a complete no-brainer.Note that I've only done delivery, so I can't speak to their service quality. They have had trouble with our online orders a couple times, but the quality of the food makes me more than okay with ignoring that."]], "Supatra's Thai Cuisine": [], "Mango Thai": [["Sue M.", "Outstanding!I have traveled extensively in Thailand lived in Asia for many years and when I got back to the Twin Cities I tried every Thai place in town to my disappointment.  But not Mango Thai!  Every dish is fresh, creative, beautiful just like the Thai people.  That special flavor of Thailand must be hard to reproduce over here since there are so many awful Thai restaurants. It just makes me appreciate Mango Thai so much more.  I will keep searching but so far Mango Thai is the best.No liquor served - be warned!"], ["Sheri S.", "The girls and I went to Mango Thai on a cool Sunday for dinner and it was delicious. I had the Seafood Pad See Iew. The food came quite fast and the service was decent. The food was really flavorful and scrumptious. The portion was large and pretty satisfying. I didn't want the meal to end. The shrimps were crunchy on the outside and moist on the inside. The seasoning was well marinated into the shrimps and I personally felt like the food came right off the stove. It always makes me happy when I feel like the food is really fresh. I loved the thai iced tea also. The overall ambiance was cute. I could see this being a nice place to lounge after you have had your meal and want to talk for a little. They had pretty large windows that were open which was nice because the light was able to shine in and the breeze flowed throughout the restaurant. I would love to go to this place over and over again!"], ["Becca S.", "I was craving Thai and this quaint spot in Saint Paul hit the spot. From the spring rolls to the spicy basil chicken and shrimp (even the fried banana dessert) was scrumptious. Come check out this little gem."], ["Cathi T.", "I recently visited Mango Thai for the first time.  It was alright, but I don't know if I'll go back again anytime soon.  Cozy and cute inside, service fine, food just so so.  Not bad, but nothing to write home about."], ["Sarah T.", "Mango Thai is amazing. Although it's a bit more pricey in comparison to other Thai places in St. Paul, but there's definitely a reason to it! The modern, organic interior design of Mango Thai adds a natural, genuine feel to the atmosphere. The staff are nice and the food preparation was very efficient. I especially enjoyed the eloquent aesthetic appeal Mango Thai puts into their food presentation. (See Photos) It's a great place to go when you're feeling fancy, but wanna stick to a more casual attire."], ["Breanne P.", "Not very good at all.  Boyfriend got pad thai which tasted strongly of ketchup.  He ordered it without egg due to his egg allergy and was charged an extra dollar fifty for that...WTF?  I understand if you wouldn't charge LESS for an item you order off, but to charge more?  GREEDY I got the basil beef fried rice.  Didn't smell good but tasted just okay.  Definitely not something I would get again.  Music was loud and annoying.  The place is pretty small."], ["Kamaraj S.", "Amazing food. We are vegetarians and most of the food on the menu was non vegetarian. However  they said they could customize every dish to vegetarian. And they did. The food is awesome. Would definitely return for more. The peanut sauce is the best!!"], ["Robot D.", "We love Mango Thai. It's super small, so go early or be prepared for a wait. It used to be BYO, but they stopped that when they applied for a liquor license. We haven't been since the license application, so no word on the selection yet. The food is great, haven't had a bad dish yet. We have had to ask for extra chiles, but that's to be expected in a land where black pepper is considered a bit too spicy for most people!"], ["Leslie S.", "I gave Mango Thai four stars because of all of the flies-to defend them, it was hot so the doors stayed open. The most popular item is pad Kee mow. For me, it's a bit too spicy.  The cashew chicken was good and very filling. It's worth eating here again."], ["N B.", "One of the things I love about Thai food is that it is a pleasure for all the senses. Being from San Francisco, I've had my share of Asian food, from chicken feet at Dim Sum to Tokyo-style late night Ramen. I had a favorite place I would stop in to grab a pork Pad Siew after work. Yummers. Well, I was disappointed to learn they do not do a pork Pad Siew here. At first I was disappointed, but I was still starving. A little voice in my head told me that the vegetable Pad Siew would be healthier anyway, so I ordered that. :::health & ethical meat eating reminder to myself::: Pork is one of the most highly acid-producing meats you can eat, and the least nutritious for the calories. If you are going to eat meat, grass fed beef or lamb is the most nutritious. Pork is also one of the most unethically & cruelly raised meats. So much so that Chipotle stopped offering carnitas ::: end health & ethical meat-eating reminder to myself:::So good for YOU, Mango! And holy moly! I think this was the most beautifully presented, fresh, tasty, lovely Pad Siew I have ever had. I had to get in & out fairly quickly for an appointment and the server graciously accommodated me. It was satisfying in every way -- a little pricey, but I will be back for sure."], ["Nicolas H.", "I went here for a lunch meeting, I've never really tried Thai but nevertheless I agreed on the location. I was pleasantly surprised, and had the Shrimp Tempura Pad Thai, it was awesome and the server was very friendly and always checked to see we had everything we needed. I will definitely be back with my wife for a date night, she's going to love it here."], ["Jennifer G.", "Was craving Thai food while visiting,  and convinced my mom to come and check it out.  Delicious!  My green curry was perfect with a medium spice (which our server asked on heat level) and mom enjoyed her tofu rama.  We split an appetizer of spring rolls.  Nice little space and atmosphere.   I'll definitely go here again when I'm in town to try other items on the menu."], ["Roxanne P.", "Mango Thai is the best in Saint Paul hands down!! The food is authentic and exceptional. It is a cozy intimate experience that I enjoy every time. Indoor and outdoor seating is a plus as well as the bar. Who needs alcohol when you have yummy Thai iced tea and coffee!! Their red curry panang is my absolute favorite, but the sea bass is delicious as well. On the topic of service, it can't get better. BRYAN is very knowledgeable, professional and handsome. ANNIE is great as well. I always feel welcome when everyone knows me by name. GIVE MANGO A TRY. YOU WILL NOT BE DISAPPOINTED!!!!!"], ["Majestic L.", "The service was great! Everyone there was really nice. The food though was not authentic thai,  more American flavor they didn't even have jalapeños.  I was very disappointed."], ["Prachee M.", "I eyed this place when I was in the neighborhood for breakfast a few weeks ago. Called them on a Friday evening - and surprise! They take reservations for 4. Disappointing that they don't serve alcohol and can no longer allow BYOB because they don't have a liquor license.The color palette in this place is lime green, black and white and pictures of mangoes and mango orchards. The vibe is laid back, casual, stylish. As we sat waiting for our order the servers were carrying food to the other tables and the presentations were gorgeous! Our Thai salad with fried tofu, eggs, greens, and bean sprouts came with a sauce that was perfectly balanced between sweet and tart and salty. The Thai iced tea was very very sweet but our server had warned my husband of that. It's the first time I have heard my husband pronounce something too sweet - he drank it all though.  I got the mahi mahi special and it was over the top superlatively excellent. Flat rice noodles sat in a green curry sauce. Baby bok choy, red peppers, bamboo shoots, and eggplants, each  done to varying degrees of softness, topped by pan fried mahi mahi that was crisp on the outside and unbelievably moist on the inside. The sauce was again, balanced between hot, salty, and sweet with so much depth and complexity that I just fell silent, savoring every mouthful. I loved that there was a nice balance of vegetables and noodles. My husband got the Pad Kee Mow - flat rice noodles with chicken, onions, garlic, chillies and basil - and when I asked him how it was, all he cold do was close his eyes and hum mmmmmm - he couldn't be bothered to respond. Dessert of sticky rice and mango was beautifully presented but Supatra does a far better job of this dish. I can't wait to go back and try other dishes."], ["Ken P.", "Super food. Curry served in a pumpkin shell is my favorite followed closely by curry sea bass. Can't go wrong. A little disappointing that they don't serve any alcohol but the food makes up for it. You don't miss it."], ["Jill F.", "I am in from Boston and this is the best Thai I have ever had. We had the fried rice, Pumkin Curry,  Pad Thai, and Walleye... amazing. Not to mention the mango spring rolls; the peanut sauce was to die for."], ["Trish L.", "Small intimate dining in the cathedral hill area. I have dined here a few times and the experience has been consistent and wonderful. The presentation is fantastic. The proportions are right sized. The dishes are full of flavor. Highly recommend the walleye."], ["Matt B.", "I highly recommend this place. Though the spacing is small and limited, if you can get a seat it is well worth it."], ["Katie M.", "Calling all curry lovers - go to Mango Thai.  You'll love their Panang Curry - it has a bit of a kick (well, maybe my Midwestern upbringing makes me sensitive to spice).  Mango Thai is a cozy space with outdoor seating and would be a great date spot!  Rumor has it that they used to let you bring your own booze, but that is no longer allowed.  They may still be in the process of acquiring a liquor license...I've never had a problem finding a free spot to park on Selby - it's a great neighborhood!  One of my favorite spots in St. Paul."]], "Lisu's Thai Taste": [["Donna B.", "Spectacular. Where to start? The owner and people who handle takeout orders are so nice and accommodating. As for the food ... Every single thing I've tried from this luscious little jewel box has stirred my soul. The tom kha soup crafted in their kitchen is otherworldly. An enchantingly complex lullaby of lemongrass broth, scented brightly with kaffir lime leaves and coddled in a warm bath of coconut milk loveliness. Tears. Of. Joy. And then there's the rest of the menu ... I've already rambled too much here so I'll only mention a few of my favorites: Crunchy, cilantro-spiked fresh spring rolls. Or the crispy, tightly wrapped golden treasures that are their fried egg rolls. Another must-have: the Shrimp Pad Thai. Think plump treasures of the sea nestled in a bed of perfectly al dente noodles -- slippery with garlic, tamarind-and citrus-accented fish sauce. Nom nom nommmmm. P.S. Before you order takeout (or visit), make sure you have room for leftovers in your fridge. The entree portions are gigantic."], ["Catherine C.", "Lisu's was great for authentic Thai food. It wasn't my favorite place, but I wanted to break away from my beloved Karta Thai just for a change. It's super close to us, in Roseville, which added to the allure of the place. Don't expect ambience or a posh eating environment. But do expect hot, delicious Thai food. We came for dinner on a week night. The place was busy (mostly with takeout orders on the phone and people waiting in the lobby) and the servers were very rushed and visibly stressed out. I totally understand so I didn't want to be impatient. It took us 30 minutes to get our water and our Thai iced teas. Another 25 minutes to get our appetizers and then our food shortly thereafter.My Green Curry with shrimp was delicious, and quite spicy. I ordered Medium spice and I ended up sweating at the table. My sister got their Shrimp Pad Thai which was also very good, and not as sweet as Karta's. I didn't care for the rice, my batch was hard and kind of burnt on one side. Our appetizers were great though! Cream Cheese puffs and Chicken Satay with peanut sauce. The Chicken Satay was out of this world. Usually they can be a bit dry and small, but these were large, thick and juicy! Well done on the Satays! A generous portion for a good price.Overall, I think this place would be better for takeout after work or for a quick lunch if you work in the area. I have mixed feelings. It's not bad but it didn't blow me away. I don't usually give three star reviews but this is my honest experience here. The prices are unbeatable for the area, that's for sure!"], ["Carly M.", "Every so often I get a major craving for Pad Thai that will not be satisfied by an Americanized (Big Bowl. *ahem*) version so when Lisu's started getting good reviews we decided to check it out. . . and it has become a family favorite. I have to admit I'm not a great judge since I can't yet get beyond the Pad Thai but let me tell you. Authentic without being too spicy (unless you like it that way) - tofu done absolutely perfectly crispy and chewy; the entire dish is perfectly balanced. My husband swears by their Mossman Curry, and their cream cheese wontons with their drinkable sauce are crunchy and not-overly sweet. Interior is predictably underwhelming but I have to say, it seems more real that way, plastic bonsai and huge fish tank make the food that much more exciting."], ["Eva D.", "Excellent hole in the wall! Food is flavorful, fresh and delightful! The basil stir fry and Tom kha were stand-outs. The pork egg rolls and pad Thai were also very good. Service is attentive. A must try if you like Thai food!"], ["Josh M.", "We used to come here when it was a Chinese restaurant. It's pretty much the same atmosphere as before minus the gumball machine. The food is excellent from the spring rolls to the entrees. Expect a lot of food at reasonable prices. Go here for food and not ambience though."], ["Lisa M.", "Big portions, friendly service and tasty food!Stopped in for a quick Friday night dinner around 7:00 recently.  Place is pretty big, very clean and basic.  Which I like - I like kitchy to a point, but kitchy to me sometimes means dust and I hate dust.  We got the pork egg rolls, the pork Thai basil fried rice and a green coconut curry chicken.Egg rolls came quick and were tasty, I really like the sauce and the crushed up peanuts that came along.  Our food followed right after.  Vy B said the rice is good and it is!  It was a huge portion with nice ribbons of Thai basil, a certain crunchiness to it that I also enjoyed and a good amount of pork.  My husband said his green coconut curry was good and had lots of nice veggies in it.Both servers thought I didn't like my food cuz the portion was so big I couldn't finish it (I did eat all the basil, veggies and pork, so it was just rice, although I bet I could use the rice as a base for something else now that I'm thinking about it......) and I declined a to go box since I wasn't going to be around to eat my leftovers.  Rest assured, this big eater liked her food and would have taken the remainder home and made a whole other if she were going to be in town.No beer or wine that I could see, but they had DC in a can, which is always a bonus.Comfortable atmosphere, great service and delicious food is a winner in my book!"], ["Seth M.", "Exceptional, traditional Thai food. Friendly staff. Recommend the Pak Pao Guy (Chicken, Peppers & Basil)."], ["Andrew P.", "Stopped here based on Yelp reviews, we were not disappointed, We ordered the Drunken Noodle with beef, Red Curry with chicken and the Vegetable Fried Rice. Everything was excellentAnd the serving were huge, took a doggie bag home, and it made a full lunch forBoth of us. Hope to return."], ["Mike B.", "So far I've sampled the spring roll and the pad thai.  The spring roll would be better described as the \"incredibly roll of lettuce roll.\"  It was wholesome and the sauce served with it was nice, but it was overwhelmed by the quantity of lettuce.  I don't know from Thai spring rolls, but I like some aromatic ingredients instead of all filler.   Bottom line: my lunch partner and I left half a spring roll on the plate. The pad thai was slightly sweet and was actually hot when I asked for \"hot.\"  Also, my \"bad pad thai\" scale has been reset recently by the place where it was apparently made with Miracle Whip.  This at least seemed kinda sorta like pad thai.  I do find that what I think of as \"real Thai\" restaurants offer a little selection of condiments (peppers treated in various ways and so forth) for the diner to apply as necessary.  There was nothing like that here.  The only table amenity that I really appreciated was that they posted their wi-fi password on the wall.Next time I'll try the green curry (note: at least they HAD green curry).  My overall description when we got back to the office was \"it's better Thai food than anyplace closer.\"   They are definitely not as good as Taste of Thailand in Fridley, however."], ["Jeannie C.", "Got the egg rolls, Tom Kha soup, and red curry. All very good. Medium spicy is spicy enough and I eat Indian regularly.Will be back!"], ["Rob S.", "Wellllll it's looking like the third time for Lisu's takeout in three days for my wife and me. Sure hope this doesn't blossom into a full-blown addiction. Roseville's been operating at a Thai Takeout Deficit for years now, so having this place be SO good and SO close (and, bonus points, SO right next door to dogfoodland) makes it unbeatable.Pad Thai (w/ shrimp, and near-Thai-hot) might just be the best I've ever had, spice and heat flat-out ignore what state we live in and portions are gargantuan Spring rolls are fresh and amazing. Prices are good to the point of wondering about a misprint.Resistance is..futile."], ["Ahmad R.", "Fine option if you don't want to travel further. We got a whole bunch of items here recently and I'd say it was good enough to enjoy, but there wasn't a wow factor of wanting to return, over say, On's Thai.They were polite. The atmosphere is hollow and dark with a giant TV."], ["Jerusha A.", "I got pork egg rolls, basil fried rice and a noodle dish. I have no complaints!!Placed a carry out order and it was ready within 15 minutes, when I got home the food was still hot and fresh. Absolutely loved the dipping sauce for the egg rolls! Perfect amount of spice on each dish based on what I requested (I'll probably go hotter next time).Reheated the leftovers the next day and I was still pleased. I would definitely go back!"], ["Vy B.", "Had the opportunity to try Lisu's and I must say I am glad I decided to randomly stop in at 9pm on a Friday night. This restaurant appears to be relatively new and is located in a really quiet strip mall in Roseville -- maybe a minute or two from Rosedale mall (near Play It Again Sports). When my friend and I first arrived, there was only one other pair of diners in the restaurant so we were a little hesitant but still decided to follow through with trying this place out. Our server was very nice, attentive, and kept the water refills coming all night long. They put slices of oranges in their water...which is actually very refreshing and my new preferred citrus of choice! We ordered the vegetable wonton soup, vegetable pad thai, thai chicken wings, pork thai basil fried rice, and thai iced tea. First impressions of the food? Delicious! For what seems to be a very random restaurant in a ridiculously deserted strip mall/business area, this place serves shockingly fresh and authentic thai food. Here's a short rundown of the items we ordered:Vegetable wonton soup - pretty basic soup base but balanced nicely with the flavor explosion from the other items. Vegetable pad thai - perfect combination of sweet and salty, I think I would order it spicier next time. Pork Thai Basil fried rice - a great texture to the rice, the rice was chewy and the grains were separated, not over cooked and stuck together aka I loved it.Chicken wings - very flavorful with a sweet chili sauce, I would recommend ordering the sauce on the side, it's super sticky. Thai iced tea - not overly sweet or overly bitter, a really great combination of the tea and condensed milk poured over ice. Overall, the dining experience was great, service was fast, and parking was ample...which makes for pleasant meal. Can't wait til this gem is discovered and starts to thrive."], ["Maren L.", "Ordered the Pad Thai, beef lettuce wrap and spicy chicken wings.  The pad Thai was.. Eh... Nothing special. Beef lettuce wrap( laab) was no good. The sticky rice that cane with the lettuce wrap was hard,  couldn't even eat it. Spicy chicken wings ...I wouldn't recommend it. Service was even more eh.... Don't think I'll be coming back"], ["JuliAnne O.", "Oh praise His Noodliness! This place is amazing! Run, don't walk, and order anything on the menu. We went nuts and ordered spring rolls, two curries, a huge soup, and a noodle dish. (Between two people!!!!) Now I am in a food coma and will go home and dream about waking up to leftover Thai food for breakfast. The joint is clean and spacious, staff is friendly, and the food is amazing. We will be back."], ["Amy M.", "Delicious sauces! The veggie fried egg rolls were amazingly good and fresh tasting. The peanut sauce was great! Also tried the cream cheese wontons - the sweet sauce that came with them was awesome!The Basil Fries Rice was a-maz-ing. The pad Thai had a nutty flavor to it that was delicious. Everything tastes fresh and delicious. The service was attentive and friendly. I love supporting small, local businesses.  If you do too, check this place out!"], ["Steve M.", "First off, Lisu's gives you 3 large egg rolls for $3.95! Not 2 like most other places.Okay on to the food. I got the pad thai and green curry. Oh man I wasn't ready for the flavors in these dishes. The green curry had this amazing sweet, creamy start and spicy finish at the end of every bite. I tried to savor each bite of the pad thai but it was gone before I knew it. However it had a sweeter than usual flavor, which I think is catered more to American palates.I highly recommend Lisu's, the flavors are great and the portions are really large for the price. The only thing that could use some work is the weak ambiance the place has."], ["Jeff A.", "Grabbed a late lunch here. Quiet, though nearly empty at 2:15 on a Friday. Good and prompt service. Reasonable prices. One of the best and freshest tasting spring rolls I have ever had. All the vegetable and herb flavors came through very well. It literally tasted like spring!I had pad thai for my entree. Huge portion. Could have been spicier. I gotta remember when I'm in the Midwest to ask for spicy. On the coasts, medium spicy is enough for me, which is what I asked for here. My fault. Aside from less spicy for my tastes, the flavor was very good, portion size was huge. I'll definitely come back when in the area. Yelp didn't let me down again."], ["Nick M.", "Signed up for Yelp just to give this place a great review! Stumbled on this place with a group of friends on a busy Friday night, and fell in love with their food. The staff was really friendly as well, and everything was perfect. You can ask for mild or spicy as well, and when they say spicy, it's SPICY. The food was on point, and I've came back numerous times and will continue to do so. Definitely recommended if you're in the mood for Thai or Asian food in general!"], ["Brooke U.", "One of the best Thai restaurants I've ever been to!  Everything was fresh and delicious. We had the egg rolls, the red curry, the drunken noodles, the pad ginger, and the papaya salad - all phenomenal. The tea was also exceptional.  Be sure to go check this place out!"], ["Richard W.", "Reading the other reviews I had high hopes for this place.  Unfortunately, it fell a bit short for me. Overall the flavors were OK but could use some tweaking. Personally I was hoping for more traditional and bold flavors. The interior is in need of updating along with new dishware. Service was good and friendly, and the prices were fine. With a few adjustments and updates this place could be quite good."], ["Steve T.", "I've enjoyed the massaman and chicken curries, they were both incredible. Today I also tried the pork egg roll - it, too, was amazingly delicious. The atmosphere is simple but the service is transcendent. Lastly, the prices make this place an amazing value. I could eat here twice a day for what I normally pay for a single meal. I highly recommend giving it a try."], ["Gao Y.", "The food here was pretty solid. They made my dish spicy as requested and I appreciate that fresh Thai chili peppers was used. I ordered stuff chicken wings, which needed a little more flavor but was cooked to perfection. We also had chicken laab and pad Thai; both pretty solid. I would probably go back. I'm Asian and I approve!"], ["Lynn H.", "Food was great! Simple but tasteful ambiance in one big room. Brightly lit. I particularly liked basil fried rice."], ["Alex J.", "Fantastic thai food.  I had no idea this place opened.  The spring rolls are large and top notch.  The pad thai has great texture and good flavorful spice."], ["Sarah B.", "Delicious, from the appetizers all the way through the meal. Have never had a bad experience at this place. The service is wonderful - so friendly. The ambiance is a little dated, but the food is outstanding. Love it!!!"], ["Dale P.", "Amazing food, fresh, hot, tasty and different than all the other Asian places out there.  We started with pork egg rolls, $4.15 for 3 huge Thai egg rolls with a delicious sauce.  My wife ordered Shrimp Pad Thai, she said it was way better than Big Bowl, and Big Bowl is her favorite Pad Thai.  The shrimp were huge and fresh and plentiful. And it was accompanied by an absolute heap of crushed peanuts.  I opted for two appetizers. Chicken Satay first, which was 6 humongous skewered chicken tenderloins and a generous bowl of the best peanut sauce I've ever had, and a cup of sweetened cucumbers.  I also ordered Thai spicy chicken wings....6 crispy fried dummies and wings in a sweet and spicy sauce, plenty to scoop over the wings if you wanted it juicier.   And I also ordered a Thai lemonade, a delicious mixture of strong fresh lemon and lime with just the right amount of sweet.  Total bill was 30 bucks.  It's positively incredible, and we went right before close, and still got amazing food and service."], ["Chuck U.", "Wonderful dinner there tonight, all vegetarian, except for one with shrimp. Ate with three others, and EVERYTHING was fresh and delicious. We highly recommend it, and I will be back for meat dishes at lunch soon. Very near Fairview, just south of County Road C in Roseville. Wow!"], ["Sophia W.", "I was so pleasantly surprised by this place! The server was so sweet, and the restaurant itself was nice and clean. My friend and I ordered three appetizers (cream cheese wontons, chicken satay, and vegetable egg rolls) and two entrees (lettuce wraps and chicken curry fried rice), which all made it to our table in really good time despite it being the lunch hour. Everything was so, so good. The vegetables tasted fresh, the meat was perfectly seasoned, and the portions are perfect for leftovers! Already went back for my second time in one week today and had an equally pleasant experience with their takeout. Didn't have to wait long at all (over the dinner hour), and the server recognized me from the other day and was so kind. Can't recommend enough."], ["T C.", "Fantastic Thai food....Massaman curry was just like my host mother made when I lived in Chiang Mai"], ["Mao H.", "Their service is super good! All servants are nice, they even customize the dish for you: I don't like sweet and so I requested no sugar and not spicy for the Pad Sew dish. Tastes Great."], ["Daniel D.", "Since it was our first time eating here we went for the standard: pad thai, green curry and tom kha -- all outstanding and just right at medium spicy.  Can't wait to try more!"], ["Lisa B.", "It's funny, because I drive past this place occasionally and would have NEVER thought to try it based on their location plus the fact that it's relatively new.  However, I was searching for something else on Yelp when I happened across it.  I went there based on Yelp reviews and everyone is right. This place is amazing. There is a Thai restaurant in town (I won't name it but it starts with an S) whom I have always considered their Pad Thai to be the gold standard of Pad Thai.  I have never found a place better or even close to the S's Pad Thai.  So this was going to be the big test.  The results were they beat out the S place for Pad Thai. It was truly wonderful and I can't wait to go back and have it again.  My challenge will be branching out and trying something new because I'm always going to want the Pad Thai.  The noodles were the perfect degree of stickiness and the flavors balanced to a tee.  Not too sweet or spicy or citrus-y.  Loved it."], ["Jim B.", "I've finally found a Thai restaurant that compares with my favorite, Taste of Thailand, in Fridley.  I have been to lunch now twice at Lisu's and everything has been super.  All items were freshly made.  Be sure to try the Shrimp Spring Rolls with mint.  They will make them either optionally with mint or cilantro.  I totally dislike cilantro so this was a big plus.  Be advised, ordering a dish with medium spice will be quite hot.  I plan to move down to mild.  They don't have lunch specials but why care.  The entrees are big enough to take home half for another meal.  Service is prompt, friendly and attentive. The restaurant is freshly decorated and clean.  Give this place a try."]], "Lao Thai Restaurant": [["ML N.", "I am in love with this place! Their pad thai and papaya salad is a must for me every time I come there! I would have rated this a 5 star but their restaurant isn't the cleanest."], ["Attention A.", "Good food, good customer service. We had LAO Beef lard salad + LAO papaya salad + Lao soup Kan pun   all yummy food.  Definitely I will come back."], ["Dara T.", "Great food, love their catfish curry or tomato sauce. Chicken wings are always a must; beef salad or the seafood salad is definitely a hit. But the best dish they have is their raw larb salad(raw ground beef in spices and herbs), but many may want to go with their cooked/semi cooked beef larb salad. I can't complain about any of their food. Wait staff was okay; the food will make me go for more."]], "Sams Thai and Chinese Resturant": [], "Sawatdee": [["Melissa M.", "This place is amazing! I've ordered take out twice for lunch since I work downtown. They had a groupon special for two lunches I purchased. The first time I had the Rama Thai I didn't really care for the peanut sauce it was really chunky and an over powering peanut flavor. I'm a huge peanut butter lover too. Just something was off. However they packaged the sauce, chicken and veggies (I substituted green peppers and onions for the spinach) separate for my to go order. The chicken and veggies with white rice was actually super good and was a huge portion I was able to take for lunch the next day!The second lunch trip was what took the cake, literally! I ordered the Massamun Beef Curry and Sweet Potato Cake! Wow! Both were amazing. The curry taste was out of this world. The cake was one of the most delicious spongy/moist/jelly cakes I had ever had and didn't have an overwhelming coconut flavor either! I'll definitely be back for this exact meal. They also have me a coupon on my last trip for a delivery service they use! I'll be ordering again very soon!"], ["Troy J.", "I love the decor and the casual vibe at Sawatdee. Unfortunately, the ambiance is better than the food. This is why you're more likely to find me here during happy hour with appetizers and cocktails than during the dinner hour.  It's a great place to hang out. I just wish the food was better.The Pad Thai is 'wet.'  It has a bland, watery sauce that drips off the noodles and pools on the plate instead of clinging to the noodles. To me, this is a serious mistake for any Thai restaurant to make.  Sauces need to be think enough to cling to noodles and hold their flavors. In the best scenario, noodles are also  tossed with their sauce in a pan over fire, long enough to create random, saucy sear marks of flavor.  The other serious mistake at Sawatdee is their level of spice (aka 'heat').  Their scale seems off because the 'medium' Pad Thai I ordered was bland and flavorless.I could see the peppers that they had added, but they didn't cling to the noodles. Maybe that was the problem?  Alternatively, it might be that they brought me someone else's Pad Thai by mistake.  I ordered Pork Pad Thai and they brought me shrimp.  Appetizers are good here. The beef egg roll was notably good. It was large, crispy and beefy.  It was a 'sweet' egg roll with a 'sour' sauce.  It set a tone to the meal that entrees didn't live up to.Sawatdee is a place that I really want to like. It's in my neighborhood, within easy walking distance. I'll keep going back from time to time, with high hopes, seeking better food."], ["BillandCoral F.", "I had the Thai fried rice and it was pretty good. Service was ok; they seemed busy. Not the best Thai place I've been to but not bad either. I would come back if I was in the area."], ["Liza P.", "This place has great atmosphere, friendly service, and yummy food. The ambiance is dark, cozy, and calm, which makes it a great place to go on a romantic date! The food options are all standard things you'd expect at a Thai place: curry, noodles, fried rice, savory soups, etc. Each dish can be customized with respect to its spiciness: you choose from a scale of 0 to 5 peppers. This of course brings up the all-important question we must ask of all Thai restaurants in the Twin Cities: will the dishes be spicy... or just \"Minnesota spicy\"? Well I'm here to tell you that the spice is... not real. Sadly even if you decide to go down the 5 pepper route, the spice level of your dish will not be authentic. But that's okay. What this place may lack in authenticity it more than makes up for in atmosphere and service. I highly recommend it."], ["Ellie E.", "Sawatdee has some nice lunch specials.  I tend to get it to go, because they never seem like they're in a hurry to get you out the door.  I stopped by and ordered the lunch special with fried rice and the chicken satay.  The lunch specials are an entree and and an app for around $12.  I have no idea why I ordered two chicken items, but whatever.  The fried rice was over cooked and crunchy.  My favorite part was the chicken satay.  The peanut sauce was super delicious!"], ["Naomi T.", "Good happy hour prices for appetizers and drinks, but the food is nothing special - I live closer to Sawatdee but would rather go a bit farther to Ruam Mit Thai."], ["Meredith M.", "Great lunch menu, but beware, it's pretty pricey for your typical lunch! Food was good though, I tried the green curry (spicy level 3) with a side of spring rolls. I was able to take some back with me since it was pretty filling. Quick service (since we asked) and neat ambiance. Enough to make me want to go back!"], ["Zarina M.", "Great service on a slow sunday afternoon. The server was prompt and knew we were on a tight tine frame due a play we were about to see. Here's what you should get:masuman curry beef with potatoes - out. of. this world. I can't put my finger on what are all the spices in it but it's grande and it make the other people dining with you seriously jealous. mango sticky rice - the sticky rice was perfect. perfectly creaming and not over cooked or hard. it was the bast palate cleaner one could ever ask for. You won't regret it.What not to get:thai fried rice - so soggy and wet.  two adjectives that I don't like my rice to be.spicy noodles - overwhelming amount of red onions and very anticlimactic. fried calamari and fried wontons -  i could tell the oil on that these were fried in was old. the food become very chewy because of the old oil. This place needs a good floor and wall scrub... I really tried to not pay attention but it was unavoidable."], ["Avonlea R.", "Being from the East coast I am very particular about my seafood! But this place was actually pleasantly tasty. The setting of the Resturant reminded me of your typical coastal Atlantic Ocean Resturant you find on the beach.  I wish there was more food for the money you spend but overall not a bad place."], ["AJ J.", "I've eaten here a handful of times and have never been impressed with the food nor service. This is the 5th Sawatdee I've eaten at and one of many Thai restaurants I've eaten at across the country and in Thailand. The service is pretty lackluster. The staff just don't seem to care much about the customers. The food is not that great. It's not bad, but not good. Recently I ordered a dish asking for absolutely no spice (I explained to the waitress my throat hurt and I didn't want anything spicy). Well, I got plenty of spice. Not cool! It was also quite salty."], ["Tony T.", "Being this is a chain; albeit small and somewhat local? Correct me if I'm wrong. It's quite fantastic.In any case, I have been to many Thai joints of carrying price ranges/atmosphere and this was definitely on par with some of the best. everything my table ordered was delicious. One of the guests with me had been to Thailand on several accounts and proclaimed that the food was \"on point\" and I have no reason to doubt that. Price: reasonable Food quality: excellent Food quantity: very good (we left full) The staff was awesome and our waiter was very nice and helpful. Gave sound recommendations for those who had questions.Do not miss:-Sarong spring rolls : a real treat of chicken spring roll stuffing wrapped in a nest of noodles and fried. Win- masuman curry : this was probably the star of the table and really had a fantastic rich and fragrant flavor, the toasted peanuts gave a welcoming crunch and added heartiness to the dish, beef was fork tender. (My only real complaint is that this would have been even better had it been made with pumpkin rather than potatoes, especially since it's November! ) - Tom yum soup : with shrimp and a level 3 spicy which  perfect, these guys don't skimp on the shrimp!"], ["Jonathan T.", "On July 8, 2014, history was made when pizza was eaten at a Thai restaurant for the first time ever by a band of Azn renegades. And no, this eatery did not serve it.Let me explain...After throwing an event next door at Tin Whiskers, my friends and I walked over to Sawatdee and grabbed a table outside. After perusing through their menu, we ordered a couple apps for all of us to try and drinks.AppetizersThai Golden Shrimp: Damn you crispy coconut flavor! Because of your sexy deliciousness, I decided that frantically devouring you was worth scorching the inside of my mouth. Fried Chicken Wings: Pretty good! Even though the sauce could have been a bit thicker, I couldn't help myself from taking the bone from one of my wings and repeatedly dipping it into the sweet sauce to slurp it up. DrankMai Tai: Don't judge. My bloodline comes from the beach, so I'm pretty sure Mai Tai ingredients flow through my veins. Plus, it was just what I needed after a long day.So overall, I thought the food was great! But, the service is the reason why Sawatdee will forever have a special place in my heart. *****Enter: Pizza-gateRight as we finished our meal, one of the bartenders from my event walked by holding a full-sized za that was leftover. She offered it to us, so, on behalf of our squad, I graciously accepted. Coincidentally, we were still hungry and our server was nowhere in sight. What's the harm in eating some pizza? Like a jedi, I skillfully balanced the box on one hand while disseminating slices out to my homies with the other. One by one, we ripped into our respective basil, sausage, and feta awesomeness. Carb-city. Carb, carb-city!Then, from behind, our server exclaimed, \"Are you guys serioussssss?\" She gave us \"the look.\" It's the same one that my boo gives me when I accidentally say or do the wrong thing. (\"No, I don't like mint brownies! You should've just came home! Do you think this will make me feel better?\" That's a totally different story...)I mean, if I was serving, I would've thought we were huge stupid assholes. (And shoot, we definitely were!) Everyone at the table felt really bad, so I decided to place our meat pie on a nearby table. But the damage was done, history was made, and she was... hella cool about it? I think she even laughed. Maybe? lol...Mystery woman - Thank you for being one of the best servers ever and letting us idiots/ history-makers eat pizza at your Sawatdee. Your service alone will encourage me to return. No pizza next time. Promise."], ["Marc B.", "Had a wonderful lunch there. The red curry had a nice bite to it and the portion was huge. I'm definitely going back."], ["Regina J.", "Had carry out delivered to Tin Whiskers brewery. Our appetizer was yummy, though we asked for it to be for two people and it only came for one. I'm glad they work with the local businesses to support each other!"], ["Vanessa Y.", "The best curry and pad Thai I've had since relocating here from Chicago a year ago. The spice levels are awesome and do not disappoint! If you're like myself and can handle very spicy foods, make sure you ask for \"Thai spicy.\" Three stars because service goes a long way and since this place is either a hit or miss...it does not deserve more than that, in my opinion. Will keep going back though, since food is delicious."], ["Ashley G.", "Great food, but recommend ordering it to go or delivery. I took my friend there who was visiting from out of state, hoping for a great experience... But was disappointed. Awkward greeting, poor service, and a group of men sitting next to us were smoking weed, not discretely, as we were trying to enjoy our meal. Just kind of ruined the experience for us... Disappointing!"], ["Jenny K.", "Borderline 3 stars versus 2 stars. While the dish I tried was good (tofu, veggies, green curry, noodles), it was wildly overpriced. I ordered online and picked it up as carry out. The bag was ready to go and all stapled up. Get back to my hotel to find they didn't include any utensils or chopsticks. How is someone supposed to eat noodles without utensils?!"], ["Holly G.", "This place has gotten a lot of negative reviews for the service and unfortunately (or maybe fortunately) I can't speak to that as I ordered online and had my food delivered. I started out with just an insane craving for spring rolls and Sawatdee was the only Thai I could think of that would deliver in Downtown St. Paul. Since they won't deliver me just spring rolls I *had* to order more than that. Darn. I figured I'd make the $5 delivery charge worthwhile and order enough that I'd have leftovers. The order showed up right within the window I was quoted on the website (about 45 minutes) and the delivery driver was very friendly. Everything showed up hot and exactly as I had ordered it. The spring rolls were amazing, as I expected. Fresh and crisp and nicely stuffed. Sauce was great too. I also got a cup of the Tom Yoam (Yum?) Soup with chicken. I'd had it once or twice before from other places and really liked it but Sawatdee's is by far my new favorite. Medium spice was exactly that. Hot enough to make me sweat a little but not so hot that I had to stop eating it. Because I didn't. Until it was gone. So much for leftovers. With what little space I had left in my stomach I started in on the Green Curry w/shrimp that I had ordered with noodles instead of rice. Same story with the heat, medium was perfect. I ordered it with a little cup of fresh cilantro on the side, which was a perfect addition in my opinion. It was saucy, spicy, and full of peapods, green and red peppers, peas, and shrimp. Only the fear of my stomach bursting stopped me from polishing off the whole (generously sized) order. The next day it was also amazing as leftovers. Overall, I see no reason at all to give less than a five-star review. Loved it!"], ["Erick P.", "Order takeout. Service can be very poor depending on who is on wait staff. Food is good. 10 minute wait between being seated and given water was not."], ["Emilie B.", "Absolutely, without a doubt, the WORST service I have ever experienced in my life. The owner(s) of this restaurant should be embarrassed for how terrible their waitstaff is! Full story: I placed a takeout order online for dinner for my husband and I tonight (9/12/14). We had never tried Sawatdee before, and just moved to the area, so we were excited to try out the restaurant since Thai food is one of our favorite types of cuisine. The confirmation email said my order should be ready within 15-30 minutes, so I walked over from my apartment at the Penfield about 20 minutes after receiving the confirmation, just to be safe. When I arrived, the restaurant was about 2/3 full, at least 4 employees in the dining room, but it took literally 7 minutes to be acknowledged. More than one waiter saw me (and another couple that walked in at the same time as I did), yet they did not acknowledge us standing there- they even had the audacity to ask customers if they wanted refills before acknowledging us! Eventually, the couple that came in at the same time as I did left because they were so fed up with waiting. I wished I could have left too, but I already had pre-paid for my meal with the online takeout order, so I felt stuck. Finally I went up to a waiter and asked if I could pick up my takeout order. I gave him my name, and after a check in the kitchen he said \"no we don't have a takeout order for you. We havent been answering our phones.\" By this point, I had smoke coming out of my ears. He didn't apologize, didn't act like he cared whatsoever!! (short, little white guy with dark curly hair) -- I showed him the confirmation email on my phone, and he lackadaisically took my order so the kitchen could make it for me. Again, no apologies at all. While waiting for my order to finally be made, I watched a few other couples walk out after standing around for unacceptable amounts of time and not being acknowledged/seated. Horrible, truly horrible customer service!It's unfortunate that the food was actually pretty tasty, because I will never step foot in that restaurant again after that that experience. Thankfully, since I ordered through Menufy.com, I contacted the Menufy customer service and received a full refund for my order, so Sawatdee lost the $44 for my meal, plus the money from the multiple couples that walked out of the restaurant after not receiving any service while I was there (and I'm sure MANY other lost customers because of their bad service).(by the way, there was a tall white male that was filling up his own beer behind the bar, sitting around texting on his cell phone and walking around and talking to employees in a manner that made me think he was a manager of some sort.... regardless of his position, it is ridiculous for someone that is not on staff to let themselves behind the bar and pour themself a drink and drink it right in front of customers that are standing there waiting to be seated/served!!!!!! The employees, managers and owners should absolutely be ashamed of themselves for treating customers the way that they do."]], "King Thai Restaurant": [["Mae M.", "I came here the second week the restaurant opened up so the server was still very new. It took them 16 minutes to finally notice us at our table to give us water but the server apologized and was extremely nice throughout the rest of our stay.  Unlike most Asian restaurants on University-Midway area, their food took a long time to come out. The interior, however, is very fitting and clean. I'll go back and give them a try again as the food was pretty good!"], ["Kalvin V.", "This place is not that good. Service was slow no refills on coffee and Thai tea! I ordered pho and got it after people who came after me. Like bruhhhhhh wtf is this! The music is weird it's old American music in a Asian restaurant? There was no decorations, except he old buffet remains. Ok appetizers, got eggrolls and spring rolls. Eggrolls Hmong version a lot of noodles little meat, spring ok nothing fancy. Dad ordered chicken and catfish laab. Mom got phoking, and I got fried chicken combo. The catfish was interesting different for sure, but not the best. Chicken as good but  hot as shit . The pho was any ordinary pho but leans more to Vietnamese pho. The fried chicken thigh was actually good with salad and asparagus. The Thai coffe was good, but like I said no refils. The pricing is a itty bit overpriced but it was ok. Therefore I'm giving it one star for bad service not being Thai food when I wanted it and just weird taste in things."]], "Bangkok Thai Deli": [["Alexander V.", "Avoid the duck at all cost!I've heard good things and want to go back to give this place another shot....The duck was just terrible though. It tasted off, like it had been sitting around for a week or so. Want to give it 1 star, but my friend enjoyed his tom yum soup, so 2 stars it is.Pretty much what everyone else said as far as service goes; hit or miss.The bathrooms need some work. Smelled bad upon entering and I quickly determined that they don't care much for bathroom upkeep. Will update my rating after a second trip. Will have to try out the other dishes that have been listed to get a better feel for this place. May opt for a takeout order instead."], ["Eva F.", "Best Thai restaurant in twin cities for sure. The food tastes exactly the same as in Thailand."], ["Chad F.", "I normally don't right reviews but after waiting over an hour for take out and still not getting our food all I got was I'm sorry and I don't know what happened. They never once checked on us to let us know that the food was coming. While standing at the counter two other customers walked out saying they waited over an hr and didn't get any food nor did anyone check on them so they were leaving. They do have good food at this place. If you're willing to wait more than an hr to get food and make sure you keep the workers on task then you may want to try this place. Very disorganized staff and not very customer friendly."], ["Maya N.", "I love the pad Thai, tom yum, and Thai fried rice here. I think this is going to become my go to Thai restaurant. Word of advice though, the spice level here is insane. I can handle spicy anywhere else but one bite of the spicy pad Thai had me gulping down an entire glass of water. So I suggest going down a level of spice that you're used to."], ["Amelia D.", "This is my favorite Thai restaurant. If you go, you should know that the spice level is higher than at other Thai restaurants. Medium is very spicy, too spicy for me! (That is my usual)I would eat here every day of the week if I could. The service is friendly, and the food comes quickly and very hot. (Last time we ordered soup and it was still boiling when it came out!)I think that they had a little difficulty adjusting to a larger restaurant. One time we went, and waited about 5 minutes for a server and none came.... I went to the counter to ask, and they sent someone immediately. There was confusion about who our server was supposed to be. But other than that, everything has been wonderful.It is always busy when we are there. Last time we were there at 2:30pm, and it was nearly full!  We have never had to wait for a table, but I am glad to see they are keeping busy. They are obviously doing something right."], ["Crystal R.", "Delicious Pad See Ew, spring rolls, and Pad Thai!  Reasonable prices and fast take out.  This is my favorite Thai place."], ["S W.", "My Khao Soi was still one of the best things I've ever put in my face in my time in the Twin Cities, but you guys are doing it to me with the dysfunction levels. Go here if you have time and you're willing to do some battle for food greatness. But if you're expecting service you're a crazy masochist."], ["Adam W.", "The spring rolls were quite good--tightly rolled, freshly made.  Pho was served in a generous portion and was decent but lacked the depth of flavor offered by the best examples, e.g. Quang.  Servers were friendly if a bit slow.  Prices were extremely reasonable."], ["Alisha H.", "This is by far my favorite Thai place in the twin cities. I will admit that sometimes I even cross the river from Minneapolis to get it (What a sin, I know!). I have had a couple things from there and never been disappointed. I've eaten in and dined out. Portion size is large and you'll have leftovers - unless of course you're in it for the long haul then prepare to leave with a VERY full belly. Dishes I've had/tried:-Pineapple Red Curry with Seafood/Shrimp: I ordered the shrimp and tofu version for just myself the last time I was there. Large tail on shrimp and a decent amount of them. My one very small gripe would be that my tofu was a little overdone so it was tougher than usual and sometimes the curry can seem greasy but it's sooooo good you won't even notice once it hits the rice.The Seafood version includes more than just shrimp with calamari/octopus and other protein pieces that I wasn't sure of, but still very tasty nonetheless. Perhaps just a little more adventurous so keep that in mind.-Pineapple fried rice: also delicious and pretty self explanatory. Huge portion.-Spring rolls: Oh yummy. And the dipping sauce? Yes please. Give me extra. -Fried Tofu - simple and done well. - Pad thai with tofu and extra veggie: upcharge for the extra veggies but it was good pad thai and huge portion. Probably could've kicked it up a notch on the spice scale when I said \"mild/medium\". Next time I would go just medium or medium hot. But do so at your own risk. I like spice. Definitely leftovers here too. And the best part for me is it wasn't super greasy as can happen at other places. Overall, I can't wait to go back and try their Panang Curry or the Pad Kee Mao. It's just a small joint in an old Burger King on the LRT construction zone near the Capitol that could use your patronage. Eat up, friends. You won't be disappointed."], ["K Y.", "I've never been more disgusted with Thai food in my life. After the spring rolls were served, I was already afraid of the other items I've ordered. The beauty of Thai food is the freshness in ingredients.... The spring rolls came with wilted greens and slimy mint leaves! Right after the appetizers were served, random food was placed at the far side of my family' table. When we finally noticed the food was ours - we moved the dishes to our own table... When we proceeded to dine - despite the rudeness of the servers - I found the food to be very old. Myself and my kids couldn't chew the pork belly because it was extremely DRY! Almost as if it had been cooked the night before or the morning of and then reheated!(I frequently cook Thai food in my own kitchen) The grilled beef salad was NOT grilled and the beef had a slight flavor of an unclean and over greased pan! A $15 shrimp, tofu and ground pork dish came with over and pound of tofu, the ground pork was barely noticeable and it ONLY had 5 shrimps covered in an oily brown sauce! The dish alone speaks about how much the owners appreciate their own food and customers.It was our first time, and it will be our last time at Bangkok Thai Deli."], ["Mindy T.", "#1. Dont mistaken this Bangkok Thai Deli with the other Bangkok Thai restaurant (next to Ai Hue, on the south bank of University).#2. As with any Asian restaurants, don't expect high quality customer service. Food should be your only FOCUS !!!Other than that, my family love this place. We come here almost every week. My daughter always orders \"Stuffed Chicken Wings\" from the appetizer menu. You can't find those wings anywhere around here. She also love the Creamy Tom Yum soup. My 10year old daughter is a picky-eater but she loves going here. Great food at good price and a satisfied pick-eater, what else can i say !!!"], ["Eric K.", "The service was good.  The food was good.Order the fried Pork-belly, you will not be disappointed.  The spring-rolls were very good and fresh, with shrimp and pork, yum.Food was overall pretty good, portions were decent.  The squid in my dish was severely overcooked and was like chewing on superballs, but was otherwise quite acceptable.  But the prices are phenomenal.  40 bucks and all three of us were stuffed, and a lunch for tomorrow to boot.The menu is huge, so even if you are with someone who is like, \"Ew, Thai food.  I've never had that.  Can't we just have mayo on Wonderbread?\"  you can still take them and find something they would like.The wait staff is pleasant and friendly. The TV playing Thai music videos is cute to watch too."], ["Melissa A.", "Service isn't great but it's by far the best Thai good I've had in the Twin Cities! So flavorful."], ["Aaron G.", "Mmm mmm mmm. First I have to say I LOVE Asian food. I just moved from Chicago by way of the Bay Area (my home, 3rd generation) so consider that as you will. Honestly, we (my darling love and I) found it purely by accident. We were going to another place which happened to be closed. We were already parked, I had seen a number of people in this place so we strolled down University Ave and walked in. I knew we were in a good place immediately as the majority of patrons were Asian; something Asians and Asian food lovers agree is always a good sign at an Asian restaurant. The wait staff was cute and relatively attentive. Cute in the sense that I firmly believe most of them were children of the owners; they were kidding with each other, had smiles on their faces when they came by the table and were generally fun.If you have read other reviews of mine you know I care not about atmosphere; it is all about the food.The food was great - inexpensive, large portions and very tasty. The menu is a book so besides taking a long time to get through it (completely worth it) there is something for everyone (my dear heart is gluten sensitive and not a problem making her happy here). Take out and dine in, either one we will be returning soon and often."], ["Joy Z.", "Completely authentic and delicious.  Fresh food, no ambience, but they put all the effort into the tasty dishes.  My only wish is that it was closer to my house!"], ["Laura E.", "According to a colleague who has lived in Thailand, Bangkok Thai Deli is the best spot for Thai cuisine in the Twin Cities, and having tried half a dozen places around the metro I agree! The new location has better lighting and is cleaner, but the main draw remains the food.The restaurant was full but not packed on a Thursday night at 5:30. Service was prompt, friendly and accurate. My friend ordered Coconut Soup, which had lots of flavor with just the right amount of heat. I ordered the Stir-Fried Sugar Snap Peas, which included bell pepper and beef - a mild dish that tasted fantastic and very fresh.This was my third or fourth visit to BTD. Every time I order something different, and every time what I order is absolutely delicious. Finally, don't forgot to order a Thai iced coffee or tea to sip with your meal!"], ["Food E.", "This is the best Thai food in the Twin Cities. Flavors are complex, portions and prices are perfectly matched, flavors are consistent each time we go."], ["Linda L.", "This is by far my favorite place for Thai food. I've never been to Thailand or would I know anything about authentic Thai food, but my parents say that this place is the closest to tasting like the food back in Thailand. I love their pad see ew(big flat noodle stirfry) dish. It's super flavorful and delicious.It's inside an old Burger King building and usually they're packed, especially during weekends. But the food is too good to pass up."], ["Nancy L.", "Food is good like always BUT horrible service that only continues to get worse. I'm a regular here because I like the food and the owner seems nice. But most of the waitresses do not care about giving you good services. They will forget to refill your water, forget your plates, and even ignore your requests. One even insisted that my sister eat the Pad Thai with peanuts (even though she ordered without peanuts) because she said my sister was not allergic.  Had to ask for my rice that comes along with the red curry three times today. The first two times they just disappeared into the kitchen area and never came back. The third time, the waitress brought it over, threw it on the table away from where I was sitting, and rolled her eyes. She marched away quickly. The bowl of rice was spinning because she was so rude with it. By then, our red curry was no longer hot. Don't know why she had to be so upset about bringing out someone's complete order. No one came back to check on us, no sorry, no check. My fiance made a complaint and the owner was apologetic. I like the food and the owner is okay, but am sad about my continuous bad experience and will not dine here again."], ["Bret F.", "The old Burger King vibe was fine, the food was really good, service quick yet scattered.  My wife had stir fry beef with basil (Spicy) and I had the traditional Pho.  My broth was excellent.  The spice level on her dish killed me (I'm a wimp) but she loved it.  We'll go again."]], "Eastside Thai Restaurant": [["Micah L.", "This is my favorite place to get Pho. Not only is the broth dark and full of flavor but they have the most amazingly crunchy pork belly.It's a very small location and seating is limited so the wait can get a little crazy during busy periods."], ["Pardra H.", "Everything was good--it was just a little crowded and muggy. I ordered the large pho combo and it was good, I didn't really like the texture of the pork in it because it was very hard to chew, but other than that the dish was well prepared. I also ordered the Thai Green Papaya salad and it by far one of the better ones I've tasted. The sauce was light, refreshing, and tasty. The service was decent. Went for lunch so not a big deal that service was extremely slow in serving but it did take a while to get our food. The employees were decent. Our server seemed like she was angry and didn't really want to be there--I've worked retail and can understand but do try to control yourself in front of customers. Other than that, food was great and the place looked nice."], ["Mandy H.", "I really tried to fall in love with this place, but unfortunately I wasn't able to. We ordered fried rice, pad see yew, chicken laab, cream cheese wontons, and the combo pho.Fried rice and pad see yew: They were both okay. I didn't taste anything that WOWed me. If I came here again, then I would order these two dishes. Chicken laab: There was hardly any chicken...it was mainly all onions. Combo pho: The broth was very watered down. This was what I was looking forward to the most since people were raving about this on Yelp. The only think different about it compared to other places is that they have pork belly meat. The service here was awesome! Everyone was super nice and welcoming."], ["Garrett Z.", "Loved it the first time so we went back again! Service speed has greatly improved so they totally deserve 5 stars!!We got the Pad Thai, Pineapple Fried Rice, Sweet and Sour Chicken, and Fried Pork Belly Fried Rice.   We also got a side of cream cheese Wontons.The rices were delish. Pineapple had a wonderful flavor. The pork belly was good, had a very strong pork flavor but if you love pork you will find it enjoyable.Pad Thai and SAS Chicken were very good too. I lived in Thailand for a bit and I can honestly say this is some of the more authentic Thai food in the cities. Everything was served very fresh and hot And to those who think the neighborhood is sketchy...its not. Its the cities, just as sketchy as in downtown MSP. Give this place a shot, you will be glad you did!"], ["Pa Nhia Y.", "Food is okay and customer service sucks. Waited over an hour for two bowls of pho and cheese puff."], ["Paige V.", "4/27/15Ordered combo pho, grilled beef salad & vermicelli salad.  Pho broth was good, but the pork belly could have been cut thinner.  It just got too chewy after sitting in the broth after a while. Vermicelli salad was just OK. 'Grilled' beef salad was too sweet than savory.  They put way too much dressing on it that the veggies were swimming in it at the bottom & soggy.  The beef wasn't grilled,  maybe boiled.  Knocked off a star for the servers. They weren't nice, but not rude. Seemed like we were hardly acknowledged :("], ["Mary T.", "This place has the best pho and fried rice!  The service is fast and simple. This is one of my number one places to go eat at. The only down side is that it's crowded and not alot of space but the food is definitely worth it!!!"], ["Tom E.", "We just ate there tonight, had a fine meal, but left Yelping.  Our son and his fiancee wanted us to try Eastside Thai and gave me a generous Fathers Day gift certificate. The food was very good, the price is a bargain and the wait service was good, BUT...We presented our gift certificate which covered almost twice the cost of our meals.  We were told that we had to use it all that night, despite the 12-15 expiration date.  One 'helpful' option offered was to buy more food.  Despite the 4 star food, I give them a 1 and that's being kinder than I feel."], ["Lee-sah H.", "I don't really write review for anything but this place is so worth the money. Husband took us out to try different restaurant around our area and we stumble upon east side thai. It's not as big as you expected, but I do recommend it."], ["Robin K.", "Delicious food! These guys serve the best Pad Thai I've ever had. Love their Pho as well. Can't wait to go back."], ["Bill S.", "Pork Belly Fried Rice - I had no idea this was an authentic Thai dish. Crispy pork belly in a nicely flavored fried rice. Adding a side of pork belly for $3 makes it even better. Everything that we've eaten here has been very good."], ["Anissa G.", "We stumbled across this place accidentally tonight and were very pleased. Service was great, food was wonderful, I highly recommend!"], ["Sadie S.", "This is a great little Thai restaurant on the east side.  Nice atmosphere, good service and good food.  The food is not quite as good as On's Kitchen, but it is a great option if you're in the neighborhood.The portions are big enough to bring home leftovers.  Added bonus is that they give you a nice, reusable to go container rather than crappy styrofoam."], ["Mai C.", "Pho is the best. Different from the usual Vietnamese pho. Pad Thai is good, it lacks a bit in the flavor though (sauce). Papaya is excellent (Thai style). Fried rice is delicious. Yam beef with sticky rice is excellent. I love the eggplant, onion,  lime, rice powder, cilantro and green onion mix. Overall, the majority of the restaurant's food is good to excellent. Service could be better, but not too much to complain. It's a small cozy place, family-owned/run. The owners are nice."], ["D V.", "One of the  best Hmong-Thai food in town. Service  is great. My food, especially pork belly is among my favorite. Pork belly stir fry is awesome."], ["Rodriguez B.", "Horrible experience. Had to wait forever, they forgot our order. Very disorganized. Food was cold and we were upset. They offered us the food for free rather than hear why we were upset. We didn't want to waist the food, and my son had to eat something after sitting there for over an hour. Never again!!! There are many Thai restaurants and other places near by that can give a better service experience. It's a service industry and the service i received from this place sucked. I'm usually the one that assumes positive intent and I have to be honest...they dropped the ball real hard and the experience me and my family received was bad. NEVER EVER GOING BACK TO THIS PLACE AGAIN. By any means necessary!"], ["Conor D.", "The Massaman curry is delicious. By far my favorite spot for Thai food on the Eastside. Same owners run Soberfish sushi place in Seward neighborhood Minneapolis, but the curry here is spicier and even better if you can believe it.  I usually get it with beef. My only complaint is that it can be a little hot in here on summer days."], ["Brittney P.", "I would love to check in here, but they are closed, even though their posted hours say they should be open. This happens ALL the time, they always close early, they're never open,  or their doors are locked even though there are people inside. Super frustrating.  I'll never eat here. I'm taking my business to On's Thai Kitchen in the Midway."], ["Lauren V.", "GUYS. Remember how in my last review I commented on how the interior decoration of this place left a lot of room for improvement? Well, they ROCKED it. Closed for about 4 or 5 days while they gutted, rennovated, and improved this space. It's modern, and sleek, and more efficient now. It feels cleaner (not that that was bothering me), and it just LOOKS awesome. The staff continues to be the most delightful, and the food is as good as ever.BONUS: they even fixed that horrid bathroom up. It's divine."], ["Mao H.", "Place is a bit too small and crowded. Love their pho with with my fave pork belly. My go to place for pho."], ["Mon P.", "Decent and inexpensive Thai food."], ["L C.", "Great neighborhood spot. The Pad Thai is wonderful as are the curries. Never a disappointment when stopping in for take out on a Friday night. Friendly staff, reasonable prices, good size portions, and close to home... what else do you need"], ["Ashley C.", "I love Eastside Thai!  I have worked on the Eastside for 5 years and have not found food this good . Best Pad Thai  and the papaya salad is amazing as well. Ate it 3 times last week and plan on eating it for lunch again today."]], "Thai Café": [["Sarah S.", "Found this place almost by accident and wow what a treat!  Got and shared the Thai noodle soup, Thai papaya salad and the green curry. Everything was superb and the service was excellent. We'll most definitely be back to try more here...probably next week."], ["Sean M.", "The astounding thing about Thai Cafe is that no one ever seems to be eating here. I was hesitant to write a review, because I like it that way. I've been probably a dozen times, and this food is the real deal. They won't give you an actual 5 in spice unless you make really big fuss, or go there often. My personal favorite is the Spicy Pak Ka Pao with pork. Another suggestion is the Massaman Curry. Portions are sizeable, service is quick and friendly, and you have to walk through the kitchen to go to the bathroom. What more could you ask for? If you're coming with a party of 6 or more, know that this place is small, and probably only accommodates 20 people tops."], ["Cailin R.", "The curry is incredible, spring rolls to die for, and any stir fry will blow your mind. I absolutely love this place. It's not quite a hole-in-the-wall location, it's one step up from that, but priced just like a hole-in-the-wall. I highly recommend it."], ["Alex I.", "Delicious, fast, spicy.  It seems like most places I go, when i order \"Hot\" and they give me some moderately spicy stuff, expecting you to not really want it that hot.  Inevitably the next time I order, I have to say Extra Hot.  Not here.  We ordered hot and we got hot.  Not only that but they said 15 minute and it was ready in 15 minutes.  That's another thing with takeout that always seems to happen.  Most places say 15 minutes and you show up 15 minutes later only to sit around for another 5 minutes.  Not here, it was ready right away.  On top of that, it was really tasty.  Tonight was our first experience there, and it will definitely not be our last.Oh, and one more thing, it was really reasonably priced.  I got a big noodle bowl thing and it was like $8.  I'm pretty big and it was more than enough for me."], ["Luca R.", "TOTALLY AWESOME THAI FOOD!!! I always get the curry for myself, green or red, doesn't matter, it's all good. Their other dishes are delicious too. The prices are very low and the service is friendly. Good for take out too.Their bubble tea goes really well with the spicy food too. Unlike most bubble tea, theirs is made with crushed ice, sort of like a frappuccino. Taro is my favorite."], ["Marijane T.", "Wanted to like this place cause of a billboard I saw, I ordered pho, it was exactly like the MAMA pho you get in the packets. Have no plans to return."], ["jared h.", "Authentic and inexpensive. Coming back for sure. Great papaya salad, It's definitely the best thing I've had on the menu. Ask them to crush the peanuts on it.The Thai coffee is really tasty too, it's like a dessert in itself."], ["Michael B.", "My family LOVES Thai food and we've tried many of Thai resturants in St. Paul. This one was recommended by a co-worker and based on these reviews we had high expectations. We ordered a wide variety of food for take-out (egg rolls, spring rolls, beef salad, pad thai, stir fry, curry). The food lacked flavor and spice. We ordered it medium spice, which is usually good for us, but this wasn't. They also put tripe in the beef salad, which was nasty. There are much better options for Thai on University Ave. Currently our personal favorite is On's."], ["Kris B.", "WOW.  This place has been open only about a month.  They have a menu consisting of about 5 soups, some fried noodle dishes, fried rice, stir fry, curry, and fish.  My husband and I went there today and each got a different soup, and I am BLOWN away.  Their Thai Traditional Noodle Soup is my new favorite soup of all time.  The waitress was also, I believe, the daughter of the owner, and she was the one who steered us to the above soup.   Talking to another of the customers who is a regular, we learned that the restaurant is always willing to create something that is not on the menu for customers.  This is a small place with fantastic food -- please go, spread the word, and above all, trust the wait staff to suggest good dishes!!!UPDATE: I've now been here 5? times.  I'm still really in love with this place.  Just wanted to give a couple more suggestions:1) The Pork Sour Ribs: You have got to try these.  They are cooked with keffir lime leaves that are not decorative but are meant to be eaten with the pork.  Oh my god, this is just an amazing, flavorful, addictive dish.  My new favorite thing on the menu.2) The Thai fruit salad, suggested by our server, is a unique and wonderful appetizer.  One would think it would be sweet, but it is actually savory and spicy.  I have never had anything like it.  Please try."], ["Salinee H.", "Delicious! I wish it was by my house. But it's probably a good thing that its not or I'd eat there everyday. The prices are good too."], ["lazy s.", "The food is good but the service is really bad. We ordered the taro bubble tea, an appetizer and the main course. No kidding but we waited for the longest time for the food to arrive. It arrived but only the main course. The bubble tea came when we were half way through the meal and the appetizer right after we were done eating! We told the waitress that we will 'to go' the appetizer. sigh. Bringing the food after a very long time  is one thing but not even acknowledging the delay and apologizing for it is another. At least she could have done that. I don't think the food is that exceptional that it is worth waiting an hour, not to mention sitting an eating in that no so great looking place. I mean the food is good but isn't worth going through all that."], ["john c.", "My partner and I went on a Sunday morning to try this new addition to the Saint Paul University Avenue asian culinary family. I was very impressed with the food and the attention given by our server.We started with an Eggroll appy, and an order of the Fried Bananas at the suggestion of our server. Yum! For our main, I ordered one of the Noodle Soup dishes and my partner ordered the Panang Curry. I have only found a couple of Thai restaurants that can pull off a soup similar to my mom's and this place is definitely one of them. The broth had a wonderful fresh smell and the oversized bowl was filled to the top with noodles, beef, tripe, shrimp, and meatballs. I started getting full only half way through the bowl.My partner thought the Panang was a little salty, but the taste I took seemed okay. I am not a fan of curry so I am far from a connoisseur. I can't wait to go back and try some of the heartier dishes and I definitely recommend giving this place a try. The menu is small, but the variety makes up for it."], ["Corey P.", "Yum! We had the Chicken Pad Thai and the glass noodles with pork, both equally delicious. You should try this place, it's so yummy."], ["Luther M.", "I've been here three times so far and it gets better each time. First time I ordered Pad Se Ew (chicken) dine-in. Ordered spicy, dressed with fish sauce and sugar (very important) at the table. It was some of the best fried noodle I've ever had. Next order was same but take-out, ordered mild or medium. Was out of fish sauce at home, no dressing, was still pretty good. Every time Heat level was spot-on (although I always ask to Thai-med, or Thai-hot, not Minnesota-tames heat)Two nights ago Pops and I went for dine-in. Ordered the Sour Pork Ribs app, Pad Se Ew (pork), and Green curry (chicken). The curry was fantastic, SO much better than my homemade. We dressed the Pad with fish sauce, sugar, and dried pepper and it was better than ever. Great main dishes totally worth the trip.The real show stopper were the ribs. I've never had anything like them. At Dad's prodding the owner/chef came out to tell us how they were made, with her daughter helping with translation. They're bite-sized pork rib nib-lets served with cloves of garlic, chili peppers, and kafir lime leaves, all beautifully fried and served hot. The ribs are beautifully yet indescribably sour. Turns out that they are actually fermented with cooked rice. According to the Chef, the longer they ferment, the better they get. I'm pretty sure Thai Cafe on University is the only place in the cities where you can get these. They were fantastic! Not something I'd eat everyday but a great taste experiment. Both Dad and I were in a rush to get home to look up how to make Thai Sour Ribs. After reading the recipe I'm more than happy to go buy them from a trained chef rather than trying them myself. Fermented Pork, Wow!OK, travel details, Thai Cafe is about four doors east of Western on University. There is lots of Light Rail construction in the area but all the more reason to get them your business. It's easy to get there from the north, avoiding all the construction. head down Western until just before University, park on the street or in the lot behind. Walk less than half a block east of Uni & Western, and you are there.The place is small and cozy. Quite utilitarian, but with beautiful art tucked in between full color photos of their dishes. The photos help make it easy to order. This is a family operation. I'm sure if it got busy service could be hit or miss. Dad and I had great service overall but we got our meal piecemeal with the app served last. Not a deal killer for a couple flavor junkies like Dad and I. Frankly I'd rather be served food when the chef is happy to send it out rather than some sort of arbitrary order. The whole menu is also available for take out. Prices are great given the quality."], ["Courtney I.", "I love a place that takes a white girl seriously when she says she wants the food \"hot.\" I ordered the massamam curry, and it was so delicious. My fiancee ordered the Pad Kee Mao and loved it. We would go back in a heartbeat."], ["Teebs C.", "Delicious home made Thai food. This is a hole in the wall family business. Mom is in the back cooking the meals which are made to order. I had pineapple fried rice with chicken. As far as fried rice goes this tasted extremely fresh. Usually when you get fried rice the egg can come out a bit chewy but this was perfectly cooked. It could have used more chicken but honestly that is probably my only minor complaint about this place. Husband had duck laab which is basically a meat salad with some rice on the side. He loved it. Thought it was fantastic. We stopped by for a quick bite on our way cross country and were not disappointed. If you live in the area and are looking for a home cooked Thai meal definitely check this place out!"], ["Prudence T.", "Red curry is a great choice if you want veggies!  This place is fabulous.  Everything on the menu is great.  Tuesdays = free egg rolls! :-)"], ["Lindsey D.", "This place is freaking good. Just do it. Pad Thai was sooo good. Just moved here and all the Thai we've tried sucks, until Thai Cafe. Amaazzing egg rolls. We are picky and snobby about food and loved this little place. Check out the crazy Asian grocery store next door while you wait."], ["Jules E.", "After reading the many positive reviews, my wife and I decided to give the Thai Cafe a try, even though we've been quite happy with our regular Thai place: Sawatdee. We saw that they did not serve alcohol, so we bought our own bottle of wine. We tried a couple of our favorites: Pad Kee Mao, and the Panang Curry. Both were delivered quickly, and with fresh authentic flavors. The table had assorted condiments and spices to allow you to tune your dish to the desired level of heat, which came in handy because on our first visit to a restaurant we tend to play it a little \"safe\", especially since many Thai restaurants have a wide chasm between \"medium\" and \"hot\".The Thai Cafe's atmosphere is simple and unadorned, the service is friendly, the prices are very reasonable, and most importantly, the food is delicious. We will be back many times.As a side note, the construction on University Ave is making it tough for so many small businesses, so please, please, please, keep supporting the wonderful little gems like the Thai Cafe so we can continue to enjoy them for years to come."], ["Kyra M.", "I second Kris B's accolades for this tiny little restaurant. Service is super friendly. The food was very fresh & high quality. The curry was wonderful. The beef in my pad thai was tender. Prices are good. I think our entrees were around $7.50 each. There are bags of their dessert specialty lined up on the counter - a fun, crunchy, light, crispy pastry made from tapioca flour. It isn't \"sweet\" but it tastes sweet after eating the spicy Thai!"]], "Thai Ginger Restaurant": [], "Royal Bangkok": [["Heather W.", "Royal Bangkok is AMAZING! My husband and I decided to stop for lunch on his day off and we couldn't have found a better place for authentic cuisine. The owners were a delight and ensured every aspect of our first dining experience there was exceptional! For only $4.99 you get 5 choices to choose from and was more than enough! This place is a hidden gem and can't wait to go back!"], ["Kyra M.", "The lunch special is like walking into another dimension. 4 bucks! Only 4 bucks for lots of good food. Been here a couple times for the lunch, and both times the service was incredibly friendly.You get 5 choices for lunch. It's a lot of food. I like the chicken that's been slow-cooked so it is falling off the bone. You have to add spices to it, but they have all sorts of spicy condiments to add. I also like their curry.This place is kind of hard to find. The door is nondescript. There is no sign that says, \"This door right here to $4 lunch no kidding.\" Don't be afraid, just try the door. There is a seamstress shop just inside the door to the right with fancy Asian dresses in the window. Walk past that into the restaurant."], ["Sonya K.", "Lunch special for $3.99 for 5 samplings from their buffet? Yes, please! I'm surprise they can stay afloat with prices so low, but don't be fooled by the low price - the food is delicious. I like their pork belly fat stir fry and their papaya salad from the lunch special the most. It's absolutely to die for."], ["Thomas B.", "I wanted to like Royal Bangkok, there can never be too many Thai restaurants to choose from. Alas, I left quite disappointed. I met a friend that was visiting from out of town and I chose the location because we had eaten in the same space when it was Bangkok Thai Deli prior to their moving across the street. When I walked in to the space, I thought they were probably closed as there was nothing welcoming about the open, food court feel to the restaurant. It was dark and it was not until I approached the tables that I noticed two tables with diners, my friend sat at one.Shortly after we ordered our meals a construction worker began working on the front counter and was pounding and drilling throughout the time we were there.We started with an order of Fresh Spring Roll (3) Shrimp, BBQ pork, fresh vegetables and vermicelli noodles which were bite size greasy, overcooked and with very little filling. My friend commented that they were probably bought frozen than deep fried and served with a tasteless cucumber dipping sauce. Needless to say I was discouraged. My friend ordered Fried rice with mock duck,  vegetables and gravy; medium spicy. when it arrived it was served as a stir fry; mock duck and vegetables were sitting on top of a tasteless mound of rice with tiny specks of egg mixed within. What little gravy there was had no taste and nothing about the dish was medium spicy. I ordered SPECIAL PHO COMBO with Imitation crab, shrimp, fish ball, pork & beef, beef tripe and beef meatball. It was hands down the best part of the meal but the broth appeared to have been bouillon based and not very flavorful. I had to ask the waiter for fresh basil as it was not served with the bean sprouts and pepper (one red chili).Based on my meal I would not return. The prices were reasonable, the service was decent and friendly.It will take some convincing for me to go back to Royal Bangkok.....there are too many great choices that I would not waste my time or money going back"], ["Jade M.", "I actually like their food. We ordered a lot and it's not that bad on pricings. Quality and quantity of food was good. Actually they Gave us so much rice we couldn't even finish it (ITS A GOOD THING). I would definitely come back and eat here next time i come back to MN. The service was kind of slow though but it's not like we have to wait 30 for an hr for our food."], ["Sheng T.", "Finally stopped by for dinner. Great service for a small family owned restaurant. Their menu is huge!!! They serve authentic Thai, Lao and Cambodian food. The red curry was delicious. Pad Thai flavor was perfect...but it was quite slimy. Hoi Jor here is my least favorite of all Thai restaurants I've ever had. Fried tilapia in house sauce was delicious! Beef skewers were smoked in lemon grass. This was our favorite appetizer. One small change I would suggest is for a side of peanut sauce for the beef skewers...or some sort of special dipping sauce. It is served with a side of chili oil which I'm not digging. Great to see an extensive menu, but for a small family owned restaurant it makes me question how fresh their food really is. Overall, great service! The chef/mommy dearest herself came out twice to greet and check on our table. Sweet family. I would certainly come back."], ["Valerie S.", "THIS PLACE.So this place gets the incredible rating in my book for several obvious reasons. When this place opened, it seemed like it could be just another Thai place on within a three block stretch of University. I think there are at least five.So what sets Royal Bangkok apart from the rest?1. $3.99 lunch special which includes five (!!) entree samplings. You can get a healthy portion of pad thai, the curry of the day, laab, papaya salad, stir fry all for under $4.00. UNREAL. You can't even get fast food for that. It seems incredibly under priced. Oh yeah, everything on their menu is like this.2.Okay so it's cheap, but is it good? Absolutely. All the entrees are spiced well to fit most anyone's palate and their flavors are so rich and vibrant. You can tell they take great pride in their new establishment.3. Their spring rolls are the best. They give you three instead of the usual two and stuff them with plentiful, fresh ingredients. They also give you the option of ordering five (for like $7.00) which comes out as a mountain of spring rolls. Don't try to eat this alone. 4. Their service is phenomenal and the establishment is always spotless.I haven't tried their bubble tea yet, always too full when I am finished with my meal here."], ["Mer K.", "We just got their delivery through Bite Squad lastnight. Yum! And cheap! Ding, ding, ding! That's a winner. We got spring rolls, eggrolls, laab, beef with basil, fried rice. I tried everything and it was delicious and good quality, nicely presented, non-oily, and not cookie cutter Thai/Chinese. What a find, this is going to become go-to takeout for us."], ["Kalvin V.", "I really love this place! Obliviously great food(pho and kapoun my favorite), big spacious room, has a food market next to it(owned by owners of Bangkok), good service. Also on the weekdays it's not busy so you may be the only one there, this you get treated extra well."], ["Narin V.", "I have tried many Thai restaurants around town, but I have to go back to the Royal Bangkok Restaurant because the food is more real Bangkok style Thai food. I went to the lunch special on the noon time noticing the price is now $4.98 for choosing up to 5 items. To me the price is still good with all the food on my plate. I like to order online with my friends through Bitesquard.com for a home delivery. We enjoy the food and the price, keep it up!!!"], ["Maren O.", "This place is always good. I continue to try something new when I go, and with a menu this long its easy to keep up that practice! The phó is delicious, the curries are rich and full of flavor, their soup comes in hot pots to share, and their larb is exactly how I remember it should be. Their Thai tea and coffee are really great, too, and I've been promise a full assortment of jellies and bubbles for teas in the near future. And the staff are ridiculously helpful and friendly. They never say they're out of something, but you may have to wait while they whip up some more. To top it all off, it's cheaper than eating at McDonalds! Take your family and have a real dinner! I can't wait until the LRT opens and this place gets tons of business - I know I'll take advantage of the transportation. But right now I like the feeling that it's there just for me."], ["Jake B.", "We wanted Thai tonight, but something new. This place has a great diversity of tasty dishes I have never had before. Diverse menu, excellent flavors, nice people, good value...yeah the ambiance isn't much, but otherwise an excellent meal. Definitely want to go back. If it looks closed, or like your at the wrong place, just keep going!"], ["Mat L.", "This is a new restaurant in the old location of Bangkok Thai Deli (which moved across the street into an old Burger King). Bangkok Thai Deli used to be our favorite Thai place in the Cities, but since it moved across the street (and maybe even a little before) we've noticed a real decline in food quality. We decided to try Royal Bangkok instead and were favorably impressed. I don't think it's quite as good as Bangkok Thai Deli was at its height, but it is better than BTD is now. The Pad Thai was a little one note and lacked the freshness and complexity the dish can have when expertly prepared. The green curry, however, featured well cooked, but still crisp vegetables in a non-greasy sauce. The spring rolls were large, but the peanut dipping sauce was a bit weak.Overall, this is a pretty good hole in the wall Thai place, but it doesn't reach the heights of the old Bangkok Thai Deli."], ["D B.", "We would really LOVE to give this place a 5 star because we really want them to do well, but sadly, no.  First the food, because that is all it is about.  We have been here on two occasions.  Visit 1:  'Grandma' the matriarch was in the kitchen.  We know because she came over and talked to us after our meal.  The vegetables seemed very fresh, the was an adequate amount of them, and the flavors were really great.  My husband was a little more impressed than I was and thought he had finally found a good Thai restaurant in MN ~ he was REALLY (REALLY) excited.  I was less impressed.  We did agree that the flavors were good and well blended and were so glad there was no oily ick on everything (as we often experience at other similar restaurants).  I was disappointed that he Pad See Ew noodles were a bit too crunchy and there weren't very many of them.  We both thought it was great that they told us next time we come we could byob since they don't have a liquor license.Visit 2.  The matriarch was NOT in the kitchen.  We know because we could see from the plastic on our booth that a younger man and woman were in the kitchen 'cooking'.  The food was horrible.  We were SO disappointed.  That oily ick I mention above was the worst we had ever seen it ~anywhere.  Appetizers - though they were fried, were cold in the middle.  HUH?  Gross. Pad See Ew was even CRUNCHIER with even LESS noodles (like 2) this time ~ basically uncooked.  Curry was an oily unblended mess with hardly any vegetables.  On the plus side we enjoyed the beer we brought to drink.  This second visit left a bad taste in our mouth - literally.  Boo!The atmosphere we can mostly get past if the food is good - it is florescent light/strip mall exciting. However, I was scared to use the restroom there and my husband confirmed I shouldn't after his visit. I wonder how clean the kitchen is that I can't see and the hands washed in the bathroom with ice cold water.  And they should stop wheeling a cart around the restaurant and dumping in people's food into a sloshy bucket after they leave (bring the food to the cart in the back ~out of sight~ instead).If Grandma wants to retire, this place has a dim future I'm afraid, and that is too bad because you just so want them to succeed.  Though the people working here are all EXTREMELY nice and conscientious, either Grandma is going to need to keep cooking or they are going to need to hire an experienced cook. Like I said - We SO wanted to love this place and we wish no ill will, but only success for this family.  Unfortunately we are not sure we can be part of their future and that saddens us."], ["Jackie B.", "Have been here twice now, no real complaints.  Extremely friendly staff.  The daily lunch special is insane (5 sample entrees for a mere $3.99).  Go fast for this deal, I predict they will change the price once word gets out to enough people."], ["Meg D.", "I had dinner there last night (11.12.13).  I arrived about 7:30 on a Tuesday night, and the place was totally deserted except for the proprietors and two of their daughters.  I thought I was at the wrong place for a minute, until I saw the tables and chairs in the middle of the space.  So I sat down and ordered.  My food arrived quickly and was DELICIOUS!  I ordered the red curry with pork.  It was wonderfully flavorful, with the complex blend of flavors I remember from my meals in Thailand.  Their medium heat was just the right amount for me, and I do like my food a bit on the spicy side.  It came with a mountain of rice.  I ate as much as I needed that night (as I'd missed lunch) and still had plenty for another big meal today.I also ordered the salt and pepper calamari appetizer.  The calamari was lightly breaded and fried, with slices of jalepenos.  Whilee it wasn't particularly spicy, it was great calamari.While I was eating, I chatted at length with one of the owners.  We talked about Thailand - I took note of several travel tips - and chatted about our lives and our families.  When I left, I knew I'd not only found a place with affordable, authentic and delicious Thai food, but I'd made a new friend."]]}