{"P.F. Chang's": [["Tushar A.", "Love their spicy chicken lettuce wraps. Of all the PF Changs I have been to, still see the same flavors & taste!"], ["Viviane M.", "I love Pf Chang's!!!!!  I don't love the bartender talking to a couple next to meand my friend. Im Brazilian he is Colombian... Well she was talking about people from different countries and how cheap they are..THAT ALL SOUTH AMERICANS ARE CHEAP...How rude is that!!! Not everyone is the same!!!I hope corporate gets this . She needs to go clean the kitchen and see how hard that is..."], ["Darko G.", "Great place and awesome diner. This is my second time here which means that they have a great atmosphere and delicious food. The server Ashley was knowledgeable about the menu. She was checking on us multiple times during our diner. Recommended!"], ["Alina A.", "PF Changs overall is a very nice Asian Fusion chain of restaurants and I enjoy their menu which changes seasonally. However, this particular location didn't impress me as much due to the spotty service. Waiting 10-15 mins for a server to come and take a drink order when it's not busy? No bueno. :(However I will say that once the orders were placed (and we had another server relieve the one who originally waited on us), things went much smoother."], ["Nix T.", "Been here before and the spiked lemon tea drink is good. The crispy honey chicken is yummy."], ["Juan S.", "Perfectly respectable Chinese (but Americanized) chain restaurant. 3 stars.PF Chang's brought Chinese food to the masses and they do a pretty good job of it.Food is tasty. Service is good. Prices are fair.  Nothing outstanding here but makes for a decent lunch or dinner place."], ["Zenia R.", "Every Time I come to this place I have a good time. The service is great, Anthony was really great with the kids and the attention he gave us! ;) and of course the food!!! Yummy!!!"], ["Leo L.", "Terrible service! Waiters and managers should get lessons on how to treat customers appropriately and with respect."], ["Katherine M.", "I'm kind of sad to give this location two stars, but it has to be because of their service. I have always been a HUGE PF Changs fan in Dolphin and Brickell, but I am so disappointed at the service. Food takes extremely long to arrive and the staff isn't inviting. It bothers me only because I love their food and I love being around Brickell. If it were up to the quality of food, I would rate it higher without a doubt, but I refuse to because it's quite possibly one of the worst services I've encountered. Hostess was rude and had a mad face, and the past couple of times haven't been busy, but server only came to our table about twice... I had to ask for water several times... I wanted to order drinks, but the waiter was MIA, so I said \"forget it\"I am super sad to rate it so low, but there's proof service means ALMOST everything! It's a shame because I used to be a regular..."], ["Madeline L.", "Love brickell's pf changs they are on point from the minute u walk in, timely service. Aventura location took 30 mins to get waiter to come over, eg drop soup made it before the drinks, no lychee tinis, Thank goodness the waiter carlos was hospitable. not a pleasurable luncheon. Manager needs to check on customers in the beginning not only at the end."], ["R G.", "Waitress great only reason scoring this high. Ordered beef and broccoli arrived hot, displayed nicely But so salty hard to eat. ( and I love salty) tasted like salt spilt out on beef."], ["Ashley N.", "I never wrote a review before but after this bad experience I had to. Came in happy hour because I've heard their menu was pretty good. I'll just cut to the chase, the guy behind the bar area (Reese) was very rude and very short patient with me.  Not sure if he was having a bad day or whatHe brought me the wrong order after me waiting 45min and basically told me that I ordered what he brought me. The turn over time for a soft drink with only 5 other customers at the bar and 3 bartenders helping is 15 min with him. Food was cold and dry when it finally came. The only positive thing I can say is that a bartender  named Vanessa came to the rescue and tried to rectify the situation and she was great! So sweet and understanding. I've been to other PF changs and this is the only one where I felt like my business was not wanted here (at least with bartender Reese)."], ["Crystal M.", "Second time visiting this one and i had the same experience; both times was during lunch. It didnt take a long time to be seated whixh was surprising. Our waiter Mike was nice and attentive. He made sure we had everything. The food was delicious as always. The menus have changed but its easier to find items on it. I went with two coworkers and the both enjoyed their food. One of my coworkers cant eat rice so they gave her two soups instead. The prices are reasonable. The food was fulfilling! I ordered the seamen chicken and rice. Ive had it before at other restaurants so nothing was special about it. The only negative thing I have to say about the food is the rice is DRY! Please add some sauce or flavoring to it. Its extra dry and its like you have to force it down your throat. I always get the ginger beer whixh is a good drink. Thats a hit with me. It tastes so good. No free refills on it through. Next time ill have to try the other drink on the menu that was advertised. Ill come back again."], ["Jimmy D.", "We like that Chang offers a gluten free menu.We ordered the Chicken Lettuce Wraps and the Singapore street noodles last Saturday. It was really great.The serving sizes are huge so whatever you don't finish just ask the waiter/waitress to pack it for you to go."], ["Aline O.", "I've been here twice or 3 times and so far I can say they have some things I love and others I'm not a big fan of. I love the chicken lettuce wrap, it's very tasty. Most of the appetizers I tried were good. Their hot and sour soup is not great, it's really sour and has a too strong flavor. One of my Chinese fav is hot and sour soup but not here. My favorite food is Chilean sea bass. I tried it here and found it too plain and tasteless. The shrimp and chicken dish was also very poor on flavor. I like a spicy beef I had once, I think it's called Mongolian beef. The service is fast and the price is very affordable."], ["Lily Z.", "Consistent service and food across the country.  We were fortunate enough to get a large group reservation on a Saturday night (probably because it rained all day).  Chicken lettuce wraps and mongolian beef are my 2 go to dishes.  Love it!"], ["Chris G.", "Employees there are thieves! Walked away from our table and left our sunglasses there, called within 3 minutes from leaving and the waiter, busboy and manager said they are not responsible for our glasses disappearing. Total of $800 in glasses just lost in a blink of an eye. If you want to lose your belongings, then go there to eat."], ["Jackie A.", "Bad service. Distracted waiters. Food below average. Air conditioned not working properly. Will not be returning. My waitress did not offer me any of the signature sauces to accompany the food which is one of their signature highlights. When I asked for the sauce , she brought it and even asked me if she wanted her to mix them for me? Really? That's also part of what the servers there normally do. To make a long story short, had to take my bill to the register as the waiter never came back to process the credit card."], ["Rachel F.", "Couldn't get anyone to answer the phone when trying to place an order. Tried from two different phones to make sure it wasn't a service issue on my end."], ["Rosie R.", "Ok I work right in brickell mall n for some reason every time I come over here they take for ever to take my order maybe because the guy is always alone in the bar , ? But this time I don't think that was the issue he saw me n he didn't even give me a menu he keep cleaning n doing other things .. I wait for like 10 minutes for him to take my order .. Seriously guys that's part of customer service even for the ppl the work at this mall I'm here to buy something. Sometimes I don't even want to tip anyone ... Wow u should work n your team customer service ... N being friendly with all the clients ..."], ["John P.", "Great food as always.This is a chain, but truly is worth the visit.  Great size portions generally large enough to share.  Try the Wonton's."], ["Alex H.", "P.F. Chang's may not be the Dead Sea, but it sure is close to it. It was very evident to me that they were using salt as a replacement to complex flavors. Biologically, humans are inclined to eating things that are sweet and salty... thanks (Charles) Darwin. We can't help it and P.F. relies on it our basic biological desires to keep our desires satisfied. I can't blame the chefs on this one... it's a corporate issue.Our group sat down for dinner on a Friday night. Our wait was 30 minutes, which was acceptable for our large group. My only complaint was that we had nowhere to sit for about half of that wait. The small bench is good for a few people, but as the wait gets longer, the space gets very limited to even stand. The weather outside, for Florida, was chillier than normal, so standing outside was not in our interest. Is there a fix for this? Not really, so I won't complain about it, but it is mentioned.As I started jotting notes down of problems, I began to notice a pattern for the issues.. namely a corporate failure. A business, may it be corporate or small business, needs to keep the business operating at a reasonable level. Unfortunately, P.F. Chang doesn't seem to train their wait staff. To compound the issue, there is no organization among the wait staff, kitchen, and bussers. The wait staff had difficulty with the menu. The kitchen was unable to provide hot water for tea that was ordered at the table. The first kettle of water for tea was EMPTY. The second kettle of water was COLD water. Finally, the third (and last) kettle of water was luke warm. The kitchen churns out food that rivals the Dead Sea in salt content. Yes, salt is a flavoring tool, but I'd rather not be licking a salt block.For an appetizer, there were a few plates ordered. I got to try out a crispy wonton. It was good, but very salty.... yes, that will be a trend. I hate to sound like a broken record, but ultimately, I think I had more than 5000mg of sodium without even using soy sauce! Although I saw our server many times, the bus service was very unorganized. Our server was the one who needed to bring us (flat) water. /facepalm/ I  feel that the bus servers should be the ones providing that... minor quip. I shouldn't need to ask... another minor quip.For my entree, I ordered the Mongolian Beef with brown rice. I tried the rice BEFORE the beef and found it completely bland and flavorless. The beef was juicy and tender, but once again.. too salty. The vegetable with the beef, which I can't quite remember the name of at the time of writing this review, absorbed a good 60-80% of the salt. So if you plan on ordering the beef, stick to the beef and skip the veggies (if you aren't Mr. Ed).I had the opportunity to try the lo mein. Very tasty, surprisingly. I had a bit of trouble telling if it was salty because my taste buds were shot. I was able to tell that the celery had an overpowering flavor. Hmmph. Not bad. Not special. For dessert I ordered a mini great wall of chocolate. It was a chocolate fudge on top, with a brownie layer right below and a strawberry-chocolate at the bottom. It was a clever (pallet cleaning) dessert, but felt a little out of place. Aren't there any non-salted Chinese (or asian desserts) they could have placed on the menu? I would hope so. Sadly, I didn't see them.I highly recommend that corporate P.F. Changs reconsider their menu, train their staff, and organize the front of the house a bit.Bottom Line: I'm no Mr. Ed and I don't appreciate dishes with more salt than the salt shakers on the table. Not bad, but I can't see myself going back anytime soon."], ["Shelia G.", "The lettuce wraps are my favorite as well as their garlic spinach. They now also offer sushi and it is a great lunch option for the Brickell business crowd. They are always busy so be prepared to wait a little while."], ["EliMelinda M.", "We went for New Years and man what a great decision. The food is always great and the service Is almost always consistent. Best china bistro we've ever been to. Cheers!"], ["Aggy C.", "Ehhhhh... I don't get it? Why is this place so hyped up? The food really isn't all that. Actually I think the food at Pei Wei is a bit better. This place is really nice inside and the some of the servers are good and a lot of the servers just really suck the life out of you. My friend waited almost 30 minutes for his dumplings! 30 minutes! The bill was so pricey and we only each had 1 drink and some appetizers. This place is the epitome of overrated.The calamari was gross.The spring rolls and shrimp dumplings however were delicious! Would I come again? Ehhhhh if you're paying."], ["Olivier D.", "It seems that the taste of PFC is very consistent. It really stands out for a chain. Although I would not call it Chinese. It's more of a mix American Chinese"], ["Fatima L.", "I forgot about pf changs! So a random Wednesday afternoon as I roamed around brickell in search of a tasty late lunch, I bumped into this oldie but goodie and decided that was the spot. We walked in and were immediately greeted by the hostess who was so absolutely amazing and sweet. I wish I got her name. We chatted for a few, she doing out we had not been in a while and she was curious why - she seemed to care a lot. She needs to be a server, will explain why below. She sat us outside as we requested and brought us out menus, reminding us that it was still happy hour too. We both commented on how refreshing it was to have someone so good at their job. Then came the reason this review was not given stars: our server. She was so monotone and seemed bored out of her mind, hates her job, is rude and careless, and maybe hates life in general. Getting her to crack a smile became a painful mission at best but I lost in the end. She wouldn't stop complaining about how slow the kitchen is and we were not even waiting that long. She did the same thing with the table next to us. We had to leave and continue our happy hour elsewhere in the end. I can sip wine at home and be happier watching my puppy chase her tail."], ["Daniel R.", "I'm not sure why there are negative ratings here, but I for one think this place is pretty good. First off I came here with family, we've never been to a PF Changs although we hear about it constantly so we decided to try it out. First the outside of the restaurant is well maintained and nicely decorated, as soon as we entered the restaurant we were greeted right away. The restaurant was definitely well maintained  as was our table. Our serve was exemplary she was attentive and went through the menu and explained to us the best dishes and etc ... also showed us how to mix the sauces and etc.. the Food in my opinion was EXCELLENT. I strongly believe after checking some of the nutrition facts that this place is a lot healthier compared to the traditional \"Americanized\" Asian restaurants.. Especially the ones that REHEAT 2-3 day old foods. This place the food  was served perfectly and tasted fresh and was rich in flavor. FYI if you choose spicy YOU WILL GET SPICY i was sweating as if i went for a jog.The only negative thing ... its that it is a BIT pricey but it ain't to bad. The service and the food made up for it.I RECOMMEND 100%"], ["Saily L.", "Delicious Delicious DELICIOUS is what I can say about everything in P.F. Changs. I absolutely love their chicken lettuce wraps and their Mongolian Beef and Shrimp Fried Rice. Accompanied by a good Mai Tai and you're set! For Dessert try their Raspberry Chocolate Cake. Fascinating! One of the reasons why I absolutely love them is because they're a modern version of the typical chinese food we are used to eating. Takeout, etc. The ambience is great! The dimmed lights give it that extra touch. Will definitely keep going as much as I can!"], ["Sabrina L.", "After a great yelp event, my friends and I were hungry for some food and decided to try this restaurant. We opted to seat by the bar area, since there was a 25minute wait for a regular table. I looked at the menu and was quite surprised at all the vegetarian items available!! my kinda place!! Since it was late, I went for an appetizer, I ordered the vegetarian lettuce wrap( made with tofu)...wow!!! it was sooooo good...I am still thinking about it! My friends ordered the spring rolls, mapo tofu, and shrimp fried rice. Overall a great experience, our waiter was very nice and the atmosphere was laid back. I would def be returning to this restaurant to try more of the other options!!"], ["Manny B.", "Line out the door here. Waiting for take out as well. This place is solid for chinese food.Creative shrimp dynamite, lettuce wraps, dan-dan noodles. You cant miss with any of those.The wine flights are great too which gives you a sample pour of four selections.Do a couple of those and start your night out right.The desserts are served in a mini format so you dont feel bad when you order one.Comparably you can be disgusted by those ordering 4!Love PF's Kids love it too. It's Modern Chinese at its best."], ["Elizabeth Y.", "Chang's Spicy Chicken... nothing really spectacular. I tried my friend's Dan Dan noodles and they tasted much better and were also cheaper... Would come back to get those, but other than that.. eh"], ["Naty K.", "This review is regarding this location, not the food itself as the food is the same in all franchise locations.  With that being said, this is the WORST service you will receive.  I have gone 3 times, and every time it has been that way.  I went for lunch once and the supposedly \"quick\" lunch special, which is supposed to get you back to work in less than an hour, took an hour and 20 minutes.  Unacceptable.  On a Wednesday night, I waited 45 minutes for a table since they refuse to take reservations, and ended eating in about two hours due to their slow service, whereas in the Aventura location, you are done in less than an hour.  Also unacceptable.  The third time, they ended up forgetting about us and had we not mentioned that we had been waiting over an hour to the manager and asked when we would be getting a table, we would have waited all night.  They did not even think to ask why we were still sitting waiting, looking bored, after an hour.  I guess they thought we looked like we were having a grand ole time? Please.  Totally unacceptable.  Three strikes and they are out, I will never again come to this location.  This place is seriously understaffed and don't get me started on the lack of parking.  The waiters are running around like headless chickens, bumping into people, messing up orders, and this place can be summed up in two words: disorganized disaster.  I implore you to go to another location, rather than letting the awful service here taint your perception of the P.F. Chang's chain of restaurants."], ["Farris J.", "I had 2 holds put on my checking account as I was using a debit card when I only authorized 1 charge.  Suggest you check your account online if you have online banking.  Someone put it through twice for over $60 when the total bill was $35.08."], ["Lia P.", "It's your typical PF Changs. I never really come here for the food- I usually get dragged by friends. The food is decent but not my favorite. I will say I do like their desserts a lot though!"], ["Kelly J.", "Hit or miss.  pot stickers are good.  The noodles come with barely any meat.  The food is on the greasy side! Can't wait for china grill to open down here........"], ["Chris A.", "I came here for lunch and the service took so long we all had to leave. Over 20 minutes just for water and there was only one other table with people. Not sure what the service issue is"], ["Alex V.", "This place is pretty americanized chinese food but it is comfy. you can go there and not be afraid of trying things cause they are very good a making sure that everything they place on that menu, your avg person can eat.I go there for lunch when I am in dtwn visiting clients. It is good for that, cause it is classy and you don't break the bank. My favorite there the Kun Pao shrimp and the house fried rice BAM,,,It is very cool to celebrate bdays here. I have been to a few and they help u out with good staff."], ["Alison M.", "This location is your typical P.F. Changs, basically it's glorified Americanized \"Chinese\" food, but its pretty good and actually the only Chinese restaurant I've found in these parts. I recommend the the lettuce wraps, the wonton soup, the Mongolian beef and the banana dessert with the coconut ice cream - yum. I don't recommend any of their noodle dishes. I would also like to use this forum to talk about the strange obsession with sauces at P.F. Changs. For example, you might be innocently sitting at your table talking when a server with a crazed look in his/her eye interrupts and starts rambling about sauce. He/she will continue to talk about sauce without pausing for 5 minutes all while mixing up a crazy concoction using 6 bowls and all for no apparent reason. And then just as suddenly the server will disappear from the table. Never once have I had any need for this additional sauce. I just don't get it. They don't give you anything to use this \"special\" sauce with and all the dishes already come sauced. It's just really weird."], ["Elizabeth M.", "BEWARE ROACH PARADE!!! If I could give this place 0 stars I would. Ewww.This location was my favorite since it was close to home.  I love their Wonton Soup, Kung Pao Chicken and Mongolian Beef.  The LAST time we visited the place was slammed (as usual) so we scanned the bar area for seats.  On the far right corner of their bar the counter drops and there are 3 regular chairs where you can sit.  We grabbed our seats and ordered our food.  Our food arrived quickly and we were ready to dig in when all of a sudden not 1 but 2 cockroaches walked by the edge of the counter right behind our plates.  The waiter noticed and stood there completely stunned... the manager who was standing near by immediately grabbed a napkin. He then began swatting at them right in front of me over and over. My appetite - GONE. The Manager apologized (repeatedly) and put in an order of food in a doggy bag free of charge. Ummm... Thanks???This made me wonder..  The lighting is so dim.  Is there some kind of cockroach party going on while everyone is eating?  It's sad because I really enjoyed visiting this location.  Someone call an Inspector!  Gross.I heard P.F. Chang's makes some great frozen food.  That's as close as I'll ever get to a P.F. Changs!"]], "Kon Chau Restaurant": [], "Chong's Chinese Restaurant": [["Chloe D.", "Small wonton soupSweet and sour chicken Special fried rice 2 egg rolls Great flavors, fresh tasting, good portionsLess than 19$ The lady on the phone taking my order was very polite. Be prepared to speak Spanish even though they can do English if needed. The delivery person is always very kind and polite.Overall, good food, good portions, good prices, and staff feels like very good kind people. Best Chinese food I've had in Miami"], ["Jess L.", "Love this place! I've been coming here ever since I was a little girl. I'm obsessed with their lo mein, I have it all the time. For only 5$ they give you at least two servings of lo mein noodles (without meat). Their beef fried rice and side of fries are delicious as well! The servers seem nice. The place itself is a little run down (restaurant owners cant do anything about it since the building is owned by someone else) but makes up for it with good cheap authentic chinese food. The food is fresh, they make everthing to order. They get a lot of regular customers coming in every day. Its the only Chinese restaurant I keep going back to."], ["Emma F.", "I went here with my younger cousin because we were craving Chinese food, price are good for the amount of food you get, Service was also quick and the food tasted great really enjoyed it."], ["Alejandra M.", "I've been coming here since I was a little girl with my family!! Very good place, food is excellent!! :)"], ["Jasmine J.", "Great if u want something quick & cheap. The chicken chopsuey, special fried rice,  shrimp in lobster sauce, and ox tail are among my favorites. The servers are friendly (at least to me since i've been their customer for 5 yrs.). Huge servings, and the food is delicious for the price u pay. U could also order by phone for pick-up."], ["Jet C.", "This is some of the best pork fried rice I've had in a long time. The portions are very generous and the staff is friendly. I would definitely come back."]], "Pekin Restaurant": [], "Momi Gyoza Bar": [["Eddie D.", "Brickell's twist on a Japanese noodle bar is pricey but didn't disappoint. Came in for a quick lunch. Picked the oxtail ramen. Most of the noodle dishes are $25. Yikes. But it was tasty and the ingredients were quality. The food came out quickly. The service was attentive. I'll be back to try the gyoza and dim sum. More later."], ["John Y.", "This place is quirky.I don't think I've ever been in a place where every beverage, including water, is served in a plastic bottle. And it's cash only (I have to say, if I didn't love the food so much, I would have deducted a star or two for that alone.) And it is, on the surface, pricey. But...It really is amazing. The quality of the dim sum is head-over-heels better than anything I can get in NYC, even. The accompanying sauces were out of this world. The portions aren't exactly dainty, so that is what contributes to the big bill at the end. But its quality is the main factor... and it's worth it.Nice atmosphere, and great Brickell location."], ["David R.", "Came hoping to finally find my soup dumplings spot in Miami only to find out they don't have it on the menu any longer.  All was not lost however as the staff was extremely friendly and helpful and the atmosphere was cool.  The server suggested a spicy chicken dumpling that they were trying off the menu.  Along w the duck pot rice and shrimp shumai it was a filling meal for 2.  It's cash only which is always annoying and the menu isn't cheap for the casual atmosohere.  6 bucks for a miso soup seemed a bit much (meal was about 100 with a couple glasses of cold sake) but I'm nitpicking.  It was certainly a good meal and I'd come back.  I just wish they still had soup dumplings!"], ["Ivy C.", "Great food, but super overpriced. It kills me that a dozen fried dumplings (gyoza) cost nearly $15 here... That's over $1 a dumpling!! In Asia, you could get an entire box of these for a couple bucks. The scallion pancake was good but also ridiculously overpriced. Guess that's Brickell for ya though. Also, they only take cash, which is rather peculiar for a place that is so pricey. Good for a quick bite but expect to leave with your tummy and wallet half full."], ["David L.", "Momi brand has taken over the whole block, which is a good and bad thing. Good because the food is decent, creative and tasty. Bad because it's way too expensive for what it is. Spent 85$ and left hungry."], ["Alina T.", "Amazing food!!!! Everything is delicious. Staff is super friendly. Very clean and small place. Please note it is Cash ONLY."], ["Rita P.", "Good and bad experience.  Ordered the edamami shumai with the information that they were vegetarian.  However, I took a small bite, smelled fish and asked another server to verify this - yup, had fish!  I almost vomited right there. Had the pan seared gyoza and the scallion pancake.  Both were tasty but oily (fried foods!).     Bad thing about this place is that you need a group to go here for the food - definitely not a place for 1 person (I had to-go boxes)."], ["Francisco S.", "Save you money and go to Gyu-Kaku... The prices must be wrong here??? $20 for a bowl of rice? It's $8 for a Bibimbap next door, and it's much better. Also, bottom of the barrel sake for $10 a cup??? Really disappointed. It's the fake version of a real dumpling joints, the only thing they have it common is cash only. Food was standard at best. No ice water, just lukewarm bottles (at least they were free)."], ["Cristina F.", "We basically ordered  the whole menu here, not one thing was bad. I recommend the \"pancake\" with cheese.. Forgot the name but you say this they'll know. Crab meat, pork, all delicious... The BEST thing? The \"wings\" served with a house mayo that was to die for!!! Very authentic and the service was great, he recommended most of what we ordered this is my new fav spot!"], ["Carolyn S.", "We have eaten here twice already and will be back again tonight.  Jeffrey Chen has once again opened an amazing restaurant.  Everything we tried has been extremely tasty.  The food is all so very fresh and the concept is fun. As with the other restaurants the place is pristine.As others have said, it is cash only.  There is a cash machine right out front for anyone who forgets. The prices are very reasonable. There is beer and wine.I have found my new favorite!"], ["Jake G.", "Really happy to see Momi add another location giving Brickell more diversity in food options.  The gyoza, dumplings and shrimp shumai were all outstanding.  The only reason it's not a 5 is because the menu still needs to be expanded.  Looking forward to seeing Dim Sum brunch here."], ["Amber M.", "The food was amazing but the service was slow. The waitress only ordered one ramen when we requested two. I would definitely return, but probably not as hungry. The dumplings and ramen were on point! This place is pricey as far as ramen generally goes but it's worth it!"], ["Michael L.", "Walked in on a whim. Totally blown away at how fresh everything tastes. Huge chunks of meat in the dumplings - you can tell what you are eating instead of some mystery meat or leftover parts. Service is sweet and impeccable. Very casual service and dining experience. Bring your wallet - cash only."], ["Caro C.", "I'm a foodie and am willing to pay for quality but I have to say that although the dishes are delicious here, I wouldn't say their quality merits the prices. The pan fried pork gyozas are probably the best i've had in Miami but cost $15 for a few. Last night we ordered the pork belly ramen noodles, also amazing but $25 for the dish. If you order that, it is large enough to share though! I'm hoping they realize this and adjust their prices. We were the second table there last night and no one else joined since so the turnover definitely reflects something is going on. I have to say, the service was excellent contrary to our other experience at the Momi Sumi restaurant around the corner. Also, they only accept cash - pretty annoying considering their high prices."], ["Basmah M.", "The food is GOOD. NOT great, not amazing. Just good. That being said, the prices are beyond unreasonable to the point of being insulting. The owner \"doesn't like computers\" so it's cash only. That's just laughable. Will not be returning. I can make dumplings as good as these at home. K thanks bye."], ["Chia C.", "Just ordinary gyoza I could get in a chinese or japanese restaurant for less than $10, which they served at $14.99. The seafood gyoza ones doesn't even have shrimp. They basically raised the entire menu by $1-$3 since they opened in a few weeks. The pork belly ramen is at $24.99 now. Not happy with the food we paid at this price!"], ["Samantha P.", "I've come here several times now and was very pleased with the food. I've tried several different gyozas. I am more of a pan-fried gyoza person vs steamed. The chicken, pork belly and edamame gyozas are really good. They give you two different sauces as well; a ponzu ginger sauce and chili flake oil.  On my last visit here I was a little upset because of the serveware situation. When we asked for bowls for our oxtail hot pot rice we were given clear plastic Chinet plates. They seemed to have run out of bowls and the place wasn't even full yet. The non-alcoholic drink selection is very limited. They only have bottled drinks. Also it is still a cash only place which I think they need to change. Personally I never have cash on my so it is an inconvenience. I know it just opened two weeks ago but giving plastic plates is not acceptable. Overall, the food is really good so I will keep coming here but some things need to be changed."]], "Blackbrick Chinese & Dim Sum": [["Kelsey K.", "Just tried this spot for the first time. We were impressed by the amount of choices on the menu, however, we left a bit disappointed in the food for the high prices. We got the tater tots which were delicious, but the dumplings were just ok for how expensive they were. Additionally, the portion sizes were very small. We left a bit hungry still and overall disappointed for we had hoped to find a Chinese restaurant in Miami actually worth going back to."], ["Grant S.", "Innovative Hong Kong style Chinese dining comes to Midtown, and its not to be missed! Chef Richard Hales of Sakaya Kitchen hit another home run with this intimately sized eatery serving the kind of dim sum you'll only find in actually ethnic kitchens, but with a Florida twist to use fresh ingredients.  Ask for an array of sauces, the \"Smack\" sauce is addictive! instagram.com/p/lyVQWqhd…I'd call it a tasting menu, meant to be shared, even the small portion items. The best meal I had included 7 dishes that we shared (soup, egg rolls, pork buns, rice, veggies, entree and dessert). You can go traditional 3 course and keep each dish to yourself, but this misses the pint of a flexible and wonderfully diverse menu.For starters, they've got a Grade A+ Hong Kong style wonton soup.  Mostly, these soups are an afterthought, but Hong Kong style wonton is an experience. One bowl is plenty to split two ways (which service gladly offered the first time I visited and every time after) or enough for a complete meal for lunch or the main entree on a cold night! Its got the usual wontons (though made perfectly!!!) as well as noodles and free floating sliced pork!  The broth is very tasty, and its served with homemade egg noodles. Worth the visit alone!The Chinese pork buns and sweetbread dishes (Lao bing) are completely wonderful.  I usually split one with a friend as part of any meal.  The shrimp egg rolls will blow away 99 out of 100 egg rolls out there (2 per order, to limit fighting). The entree sized General Tso's gator is a great example of local ingredients creating farm to table Chinese cooking you won't find elsewhere.Lastly, the peanut, coconut and sriracha ice cream is a great meal topper, loaded with taste, tangy (serious) spicy notes and a fortune Cookie that's got homemade written all over it (and inside too). instagram.com/p/kYUy66hd…If you love Chinese and stepping out of traditional boundaries, Black Brick is a must visit!"], ["Marilyn G.", "Excellent food, excellent drinks and excellent service.  You can't ask for anything more."], ["Luis M D.", "This place is particular, is not a clasic chinese rest. Looks more like a casual bar. His proposal is autentic chinese cusine mixed with signature touches. The result is an interesting chinese food. Beef noodles and shrimp egg rolls with pumpking sauce was great. They have veggie menu section. Good price. Funny decor. We'll come back."], ["Renee H.", "I was incredibly disappointed:( After reading some of the other reviews I was super excited to try this place. The food was less than average and really overpriced.  There was really no flavor in any dish.  I have tried dim sum all over the world, and this was as far from authentic as possible.  Honestly I have had better from the freezer section:(  The noodle dish that we had was so oversaturated with oil, that I felt like we were at a fast food restaurant.  Even more upsetting was that I brought out of town guests to the restaurant without trying it first myself...huge mistake. I spent the entire ride back to my house apologizing to them and promising to take them to a tried and true restaurant for dinner.  Needless to say, I will never be back.  Horrible."], ["Mike H.", "Dock fried rice, fired beans, gator, fried peppers, it's all good.Love this place, funky decor, open kitchen, great beers on tap, finally a go to Chinese restaurant!"], ["NB K.", "We shared dinner tonight with our neighbors, who've dined here before.  Loved the food -- selection, quality, quantity.  Terrific waitstaff.  The ONLY downside is there are no shades on the windows, which face west.  In Miami during the summer, you don't sit in a west-facing window because of the heat and the glare.  Our reserved table was in one such window.  We told the staff that it was unacceptable, so they graciously made up another for us.  However, that table, too, was in a window, \"But only one of the seats is in the sun.\"  I was dumbfounded!  We shared the large table in the middle of the room.  The food made up for any inconvenience.  The restaurant is small and reservations are a must."], ["Shelley B.", "So after hearing raves about this spot and how it's one of the top places to have dimsums at.. Had to say i was disappointed. Waiter had no customer service skills whatsoever, barely even spoke and the guy that cleaned up our table didn't know what was the difference between our aps. Super greasy shrimp rock rice, worst cha siu baos (pork filled buns).. Won't ever care to go back."], ["Michael C.", "Black Brick was a phenomenal experience.  We grazed through the menu including dumplings (pork), dim sum (shrimp & cilantro; duck), lamb chops, Dan Dan noodles, fried rice (duck), and orange peel flank steak.  The food was spectacular...so much flavor!  Service was first class.  Definitely recommend!"], ["Ali G.", "Dude. So good. Why does it only have 3.5 stars. This place is awesome, unique, and affordable. Go here for a good time!"], ["Gianluca I.", "If there was a rating lower than one star I would give it to this place. Hell I made this account just to write about how horrendous this place was . The food was bleghhh it made me sick but that's not even the worst part. they offered my 14 year old son and daughter alcohol!!!!!! (They don't even LOOK 21)  I ate their fried Asian chicken dish and I would have gotten my money's worth at KFC .... I hate youPs: my sons food got there late and cold because there was a shortage of plates and I hate you even more than I said I did the first time"], ["Eddie D.", "I will say that on subsequent visits Black Brick impressed. The service is still hit or miss, but improved. The food has been consistently above par. Sometimes things are not available, but so many good options. I still go primarily for the dim sum. Yum! But other great picks include lobster Cantonese, rock shrimp fried rice and the breakfast fried rice to name a few."], ["Alexandra S.", "I haven't written a yelp review in a while but our experience at Black Brick last night deserves a review. I've been to Black Brick around 6 times now. Each time the food is good and so is the service. Last night we celebrated my brother's birthday there and the service was exceptional. They were so accommodating. They typically lightly bread their chicken wings but my mom is gluten free and they custom made wings for her. The portions are really big even for the apps which is great. Good bang for your buck. We enjoyed everything we had and we had a lot. Kale, Brussels sprouts, dim sum, two different orders of ribs, chicken wings, shrimp fried rice, and hog fish stir fry.We didn't like the hog fish. We weren't really going to say anything but when they asked how everything was we mentioned it was tough and kind of fishy tasting. They took it off our bill. We ordered one of the Azucar ice creams for dessert and when the server found out it was my brother's birthday she brought out another scoop of the birthday cake ice cream for him on the house. It's so nice to experience genuinely good service. Congrats Black Brick!"], ["Nicole D.", "I've eaten here twice and enjoyed both experiences.  I ordered the Salt & Pepper Shrimp- very tasty, though it was fried which I wasn't expecting. The Fried Chicken and Garlic dumplings were delicious. For desserts, the Apple Pie Trifle and Bourbon Trifle are two of my favorites, but the standout is the Guava and cream cheese ice cream with chunks of cookies inside!"], ["Thomas P.", "My fiance saw this place was the only restaurant in Florida listed on Bon Appetite's 50 best restaurants and we just had to go. I have to say, this place has become my favorite go-to restaurant in Miami. Every time I have friends in town we stop by for delicious cocktails (especially the Chinese holiday), the addictive vegan pork rind appetizers, fresh vegetable dishes, and unique entrees. I find the entrees somewhat pricy, but definitely worth it if that's what you want. The staff is very accommodating and always lets my fiance know what is or can be made gluten free (she has celiac disease)."], ["Jen M.", "Wow !!! 7 staff members , 2 customers  and we had to flag down someone every time  we needed  something . One item never even made it to the table . Things happen I know , but come there was no one in the place. Your first customers should be treated just as well as when you are at your peak seating time . Disappointment  bye bye black brick"], ["Nachi D.", "Not at all impressed. I was excited knowing that the chef had a few other tasty places...but the food did not wow me. I've had fresher and tastier dim sum and were not worth the wait. Nothing about the menu really stood out or excited my taste buds."], ["Seth S.", "A nice step forward for the Sakaya Grill crew, Blackbrick is a cool, understated newcomer in midtown Miami offering a nice range of modern Chinese dishes, with an emphasis on roasted meats, bao (buns), and noodles. It's definitely the best Miami Chinese newcomer I've been to since the great Chow Down Grill closed in Miami Beach.  If you're judging by food alone, Blackbrick is also a much better restaurant than Gigi, a flashier neighbor that (at least for me) has always missed the mark on quality Chinese dishes. Blackbrick standouts include Peking Duck, excellent dumplings, chilled chicken thighs in wine sauce, mustard greens in garlic sauce, and fried long buns, essentially rice pockets with beef filling.  Service was not spectacular on a Sunday night, but I like the comfortable, mellow vibe, and the great location in Miami's midtown.Mostly, I'm delighted to have a solid Chinese option for a casual Sunday night family dinner, and Blackbrick could become a standby.  One last note:  home made fortune cookies pleased the little ones, too."], ["Jorge B.", "Drinks were great i had the Bruce Lee and loved it. The food was great as well the lobster fried rice was delicious and the platter is a must have.. The only thing i did not like was the dim sum it was over steamed and fell apart before it got to the table. The service was great and the cutie who attended us was a pleasure to deal with... All in all great for a group of friends or just 2"], ["Francene H.", "Their food is good but service was not on point. They didn't bring out one of our dishes until AFTER they cleaned our plates ... Like what ???.."]], "Pekin Chinese Restaurant": [], "China Steak House 3": [], "Chop Suey International Restaurant": [["Eileen P.", "Great Chinese food around here love my shrimp lo mein the BBQ ribs I was not a fan the taste was just not what I like maybe someone else likes it, they were not bad but not for me service was good be better but acceptable"], ["Lily F.", "Good Chinese food"], ["Devin C.", "very authentic Chinese restaurant. I highly recommend. If u want to try real Chinese. That's the place you should go. But u need to ask the waitress for the different menu. The price is reasonable. We spent around $18 per person"]], "Chinese Guy": [], "Dim Ssäm à gogo": [], "Silver Palace Chinese Restaurant": [["Mark W.", "The food is great and portions are large. They have authentic Chinese food, not just the Americanized Chinese available at so many places. We ate in, but it's obvious they do a brisk take out business. The staff was really, really friendly even when my mother asked for e tra take home containers and my wife asked for another complimentary orange plate so our sone could have more. It's in the Miller Shopping Strip Shopping Center and the restaurant is not included on the street sign so it's easy to miss. Prices are low, food is good, staff is friendly, attentive, and helpful."], ["Alfredo G.", "If a considerably large oriental clientele is an accurate barometer for an Asian establishment's authenticity, this place is as true to form as you'll find west of Shanghai. Miami isn't exactly known for having a sizable Asian population, which makes it all the more impressive when a restaurant accomplishes the unlikely feat of making a Hispanic male feel like a minority in the middle of Kendall. I honestly couldn't have asked for a better omen before having a Chinese meal.I cannot detail here much of what I sampled, I'm embarrassed to admit. I met up here with some Chinese friends of my own, and I took the lazy route and deferred to them when the time came to order. Having been there before, I trusted they'd know the choicest items on the menu. And boy, did they.We started off with some garlic chicken, cooked to perfection. A few sips of chrysanthemum tea later, they brought out an eggplant dish and some beef belly, in addition to some squid. All were tasty and were quickly gone. Luckily, the waitress promptly served some shrimp and broccoli, and a tofu and vegetable dish as well. A vegetarian item followed, along with a fish dish; both were delicious. I'm sure I'm leaving something out, but suffice it to say that nothing was left for anyone to take home. I suppose I will have to brush up on my Cantonese and come back to feast another day."], ["Turly H.", "Finally, I found a decent Chinese Restaurant with excellent Chinese food and good servicers!! Highly recommend for everyone!P.S. they have THE BEST crispy chicken w garlic sauce in town!"], ["Rosanna L.", "One of the best Chinese Retaurants I've been too. Fairly small, but gets the job done. My favorite dish had to be the salt and pepper squid (yelp.com/biz_photos/LpgZ…) or the seafood with chow mein noodles (yelp.com/biz_photos/LpgZ…). Everything was very flavorful and tasty. Real chinese food with all the goodness.Only down fall was the mongolian beef dish was spoiled. We returned it and opted to not go with another dish. Luckily I didn't eat it, but as soon as my dad tried it he knew it wasn't fresh.Overall a great family dinner place."], ["Daniel G.", "BEST CHINESE PERIOD! This place has exceeded in every meal and have never had a bad meal. Although not traditionally a Chinese plate, honey chicken done to perfection. MUST EAT FRESH! Salt and pepper shrimp was also amazing! Always ask them for recommendation and they have all been great suggestions. Good staff and accommodating to their best abilities. They get you in and out fairly quick with good food."], ["Mike B.", "Best Chinese food I've had in Miami. Everything is delicious but if you're serious about Chinese then order from the Cantonese section. Garlic chicken, fish maw soup and pretty much anything salt and pepper is amazing. Not the cheapest but you wont be disappointed."], ["Jeff K.", "Crispy garlic chicken is amazing. Only thing I get from here!"], ["Suzette R.", "Authentic Chinese food! I ordered the crispy garlic chicken, ginger and scallion fish and seafood with pan fried noodles which were delicious and fresh. The service was also very friendly and efficient. I will be returning again to try more items!"], ["Celine C.", "This Chinese restaurant offers American Chinese and Traditional Chinese food.  It was my first time trying out this place.  I've experienced a lot of traditional Chinese restaurant before.  Compare to other restaurants, this one took a while for the food to come out.  The service was quick and fast, but just not the kitchen.  We ordered salted chicken, salt-n-pepper squid, sweet and sour pork chop and a plate of vegetable.   I was disappointed in the way they battered the salt and pepper squid.  It was lack of crispiness and they just put a lot of lettuce on the bottom to fill out the dish.  I also didn't like the sauce for the pork chop.  The salted chicken and the vegetable were good.  The food is overall okay.  The restaurant is kinda dark. The decor  is definitely outdated.  It was very busy the day I went.  If you want to try it, you need to go there early to get a table since the restaurant is very small."], ["Madeleine C.", "Woohoo! As good as it gets!This place is 100% the real deal.  Good authentic chinese food is hard to come by in south florida.  For me, this is as good as it gets for us south of NW 163st.Their chinese style beef stew hot pot is THE BEST!! I can taste the subtle orange peel, star anise, and cinnamon they use to season the beef... it's amazing.Please order:Deep Fried Chinese Flounder with ginger/scallion sauceBeef Stew HotpotHome Made Chinese Roast Pork (may have to order 24-48 hours ahead of time)Crispy Fried Garlic ChickenHome Made Cured Pork Belly Stir Fry with Lotus Rootsigh.. makes me so hungry to even think about this place"], ["Nino R.", "Silver Palace may be the best Chinese food restaurant in Miami.  You also should know that isn't saying much.  Being an Asian living in Miami, I've come to realize that any Asian food in Miami is not as good as I'm used to.  So don't go around thinking that anything you come across on Yelp is going to be authentic.  If you want good pho, banh mi, choo chee, congee, or even sinigang ng baboy, then you'll have to travel to Southern California, San Francisco or NYC for the real deal.Silver Palace claims to serve authentic Cantonese food.  The menu slightly looks authentic but doesn't quite execute.  I've had the Salt & Pepper Squid, Pork Egg Foo Young, and Peking Pork here.  All dishes can be found on their Cantonese menu.  Sadly, I've had much better elsewhere, so if you think it's good, then you'll blow your mind if you ever make it out to Flushing, Queens (NYC).The dining room at Silver Palace smells very musty and I would suggest against dining in.  They do offer some good lunch and dinner combination options, so make sure you order for pick-up only.  Pricing is a little higher than what I'm used to but it seems par for the course as far as Miami is concerned.I really feel bad for the locals here.  The only viable option is Latin food, and although it's very good, variety is the spice of life.  I guess you'll have to stuff your face when you're on vacation because if this is the best Chinese food in Miami, then you don't have much to look forward to.And that's not good..."], ["Mildred F.", "Very good Chinese food! I really recommend! Very flavorful."], ["Wai C.", "This place is absolutely fantastic!  Order there BBQ roast pork, HK style, a couple days ahead of time and I promise it will change your life.  I think this is the best chinese restaurant down south.  Really.  As far as authentic food goes, this is as good as it gets, in Miami."], ["Chris C.", "How could you have run out of duck!Don't get me wrong, this place was tin-tun-pan-ping-pong-licious. BUT THEY RAN OUT OF DUCK.It's like going to Hooters and ordering a steak....YOU DON'T DO IT!Since I had no choice I decided to eat the garlic chicken. This was a very tasty alternative, but I must return and conquer that duck."], ["Katy S.", "Why have I waited so long to review this place?!?! AHHH.... Omg...Silver Palace is legit ran by real Chinese people who know wtf they're doing!!! If you're looking for an authentic Chinese meal this place is for you!! :o) What I love:Salt and Pepper Shrimp - crispy; spicy; amazing with white rice. House Special Lo Mein - delicious!! perfect. House Special Fried Rice (no bean sprouts please) - amazing! Egg rolls - yummy fried goodnessFor me, this is the best Chinese food in Miami. The only other place that I've eaten better Chinese food from is in a place in San Francisco's Chinatown.  Go figure. Anyways, hit it up if ur looking to Chow mein...I mean, Chow down ;)"], ["Virginia M.", "I never thought about going to this place because the strip mall that it is located in is a bit cramped but lo and behold, I found a gem!Big portions, decent price and the 2nd best Chinese food restaurant I've tried (it also helps it is much closer than my favorite!) When they say your order is going to be ready in 15 minutes, they mean 15 minutes. I really liked that and the staff is also very pleasant to deal with. Now, I mean no harm when I say this but if you see Chinese people eating in a Chinese restaurant, well you know it's good! It is so rare to see them eat anything other than their cuisine (and why would they- it's delicious!) but when they're at a Chinese restaurant and decide to hold meeting here while munching over their cuisine, you have to try the place out! I have found my 2nd go-to place for Chinese food. About time."], ["Lei Z.", "Like authentic chinese food? This is a good place to try.Like maybe americanized food, they'll have the food you love also."], ["George B.", "This place is the REAL thing! First time visit, based on Yelp reviews. Had wonton soup, beef chow fun, chicken w broccoli, and pork fried rice.All were excellent, based on NYC Chinatown experience (from living there). My wife, mom and I went on a Sunday at 6 pm. Three large groups of Chinese families came in and added to the ambience. (It's also an endorsement.)Great food, service, decor, and even customers on this day."], ["K P.", "The hubby and I are pretty much regulars here.  They have Chinese American Menu, Chinese menu in Chinese, and Chinese Menu translated in English.  We get the Chinese menu that's translated in English.    The waitresses remembers our orders because we always order the same thing.  We change it up on special occasions.  Our usual is the Crispy Garlic Chicken (about 9 bucks) and the Pan Fried Noodles (about 9 bucks) with Chicken.  The portions are generous and we always have leftovers to bring home.   Also, they don't mind giving you extra pint of rice to take home with you. The Crispy Garlic Chicken is amazing.  You have to mix the sauce with the rice...it's just sooo good this way.  You get half a chicken fried to perfection and it's so juicy, not dry.  The fat has all been rendered so the skin is thin, delicate, and crispy.  This is what 90% of the Asian people in there get.  Trust me, I looked.The Pan Fried Noodles is also delicious and they are generous with the chinese veggies like Chinese Garlic Chive Blossoms and the dish itself is huge.   The dish is NOT greasy.  You get a nice balance because it's not heavy and they put a ton of veggies. You also get unlimited rice here.  The customer service is wonderful here and they always refill your water and rice bowl.  It's really a cheap place for a great dinner.  Costs you less than twenty five bucks for two people and that's with tip!  It's always crowded with Asians but there's never a long wait. We've had the roast duck. We didn't have any problems getting it on a Saturday night.  It's good but not the best that I've had.  I like the Gou Lou Cheong Bbq Restaurant in Ft. Lauderdale Roast Duck better.  The Pickled Mustard Green with Chicken/Squid/Beef is amazing too.  The pickled mustard greens are sweet, tart, and crunchy.  The salt and pepper squid is good but I think alittle salty for me.  The portion is generous though.  The fried shrimp paste tofu balls are really bland but seems like a favorite to many others."], ["Patrick A.", "I have been going to sliver place for years, it is the local authentic Chinese  restaurant.  The dead giveaway  with the huge round table with the lazy susan  in the center. Silver Place has all the standard Chinese American Fare (honey garlic chix, special fried rice, etc.). But, if you want to live on the wild side I recommend you play Russian roulette with the Chinese menu (authentic mandarin menu, must request). The solid dishes for the novice are crispy garlic chix, noodle dishes, snow peas tips. The service is solid and very friendly."]], "Ming Yuan Restaurant": [], "Tropical Chinese Restaurant": [["Dan B.", "We have been going to Tropical Chinese for years.  It is not your \"corner Chinese restaurant\".  It really is something special - a place to take clients, business associates or celebrate special occasions.  The food is high-end, high quality  AUTHENTIC chinese and the menu is very extensive.   There also is an extensive full bar and a private room in the back that can accommodate up to about 35-40 folks. Mei, Greg and their family have owned and operated it for decades and it is wildly successful.   Tropical sponsors many charitable/community events and has generously contributed the private room, food and beverages for charity events that wife and I hosted at the restaurant.  I can't say enough good things about the restaurant and the Yu family that owns/operates it.  Try it for dinner.  You will love it.One last comment:  The Peking Duck and the various dishes in black bean sauce are some of the best dishes I've ever had, anywhere."], ["Lana N.", "Came here because of a friend's suggestion. It satisfied my long time craving for dim sum!! The decor is pretty cute and having the carts adds to the experience (another place I went to didn't have it). They accommodated our group including a baby quite well. The staff here is extremely accommodating with several people continuously refilling our water, clearing plates, giving us sauces, and correcting our orders. The things I liked were the Shrimp Dumplings (a classic) and the green dumplings that might have had tomato in them? The egg tart filling was good but I didn't care for the crust. However, my friends said they could taste the gas in the leek dumplings (one of the Yelp highlighted items). Overall, the price isn't bad but not cheap (it's Miami after all). However, if you're looking for a nice Sunday dim sum meal to get full off of, I'd recommend trying this place."], ["mariana c.", "My favorite Chinese dim sum on the east coastClams , leak , beef and shrimp shumai and everything else"], ["Porterhouse P.", "Love this place Dim sum PEKING DUCK Dumplings Imperial prawns Fries rice Honey chickenScallops Beer is coldAlways fill your water Authentic"], ["Carlos F.", "Ambience/decor: 4Food: 4Service: 2.5I went to try this restaurant for dinner, and noticed it is VERY expensive Chinese food and portions are so small they are basically for one person. They charge for tea per cup/person (only Chinese restaurant I've heard in South FL that charges for hot tea)Quality is ok, nothing out of this world. You'll notice that only gweilo (鬼佬) eat here for the atmosphere."], ["Frank C.", "Had dim sum here, Straight 2 stars.Good decor. They have generic tea instead of the regular selection (bad sign.) Dim sum offerings are piled on carts (steam cart, fried cart, baked cart, etc..) instead of their own dishes and kinda crude in prep quality (saltwater fried dumplings are small, no fried taro dumplings in sight, taro cakes cut unevenly, etc..) All that and a bit pricey. The steam cart was covered with a cloth napkin (instead of the regular metal basket lids -- a slight sanitation issue there...) Not good for dim sum. maybe better for dinner. get the sense it'll be american style chinese with the attendant MSG...not promising..."], ["Marisa H.", "Don't judge a book by it's cover! The outside might look sketchy but the inside is so nice! What a perfect spot in Miami to have some great DimSum! The food and atmosphere was good and the menu very extensive! Deff a place I will come back too! 5/10 atmosphere 8/10 food 7/10 experience"], ["Paloma A.", "I had been looking for a good Chinese restaurant in Miami and Tropical Chinese is just that. We had some dim sum for appetizers, Pork and Shrimp Siu Mai and Fried Wonton Shrimps. For dinner we had the Chicken in Black Bean Sauce and Special Fried Rice, and of course some Jasmine Tea to make it perfect. I was missing a good place like this since I moved here. I am so happy they exist. The staff was amazing, the waitresses were attentive and one of them even covered our 3yr old who was sleeping making sure he was warm. WOW! Definitely making this our family restaurant. Can't wait to bring the rest of the family. Thank you to the staff!"], ["Huy N.", "A dim sum restaurant is defined by its chicken feet. And man does it suck. No skin on the feet to eat with a lackluster sauce. Btw no congee served too.Service was good but the plaques on the wall were commemorating a by gone era of this restaurant."], ["Lee Z.", "We ordered a pan fried noodle dish and several dim sum. Overall, the food is average  and prices are higher than other dim sum  places in South  Florida.  The decor is nice and very modern, unlike other Chinese restaurants, but them again, I'm going for the taste and quality of the food and not really for the decor. Of course having both is a bonus.The service was really good compare to many other busy dim sum restaurants."], ["Na Y.", "Very impressive Chinese food! The server is very professional and the dishes are served to the table really quick!"], ["Natasha P.", "As soon as you walk in your invited by giant red lanterns and infront of you a case with a buddha statue. They have a cool wall with pop art modern designs that brings it a cool feel.The servers are very nice and attentive. Theres also a glass wall where in the kitchen, you can see the chef and staff. The food is very good and fresh. Not greasy like other Chinese restaurants. Very authentic and a huge menu to choose from. We ordered shrimp wontons, 1/2 duck, and special fried rice Will return. I've heard it's so much fun for Chinese New Years, there's a dancing dragon and everything :)"], ["Luciana P.", "The food taste is ok, we've tried several things already, but as far as dim sum I think it's way over priced. The waiter talks as if he was barking at you. They carry 2 beers only, Sapporo and Lucky Buddah but they carry an extensive and expensive wine menu. Last time I ordered the honey orange beef and it was actually pretty good, but when I got home I had to have a snack because I was still starving...! My boyfriend ordered 3 shrimp dim sum and he was also very hungry. We spent $60. Not worthy at all. The good thing is that it's MSG free and you can tell that the food is very fresh and not heavy. I've done better and I was a bit disappointed because I've heard so many good things about this place."], ["Paul G.", "Food was delicious and authentic, service was excellent and the food was reasonably priced i will definitely be back."], ["Seth S.", "Heavy Duty Old School Chinese from a Miami institution on Bird Road.  Coulda' been from the days of my grandparents.  Spinal Tap would like dining here.   And yes, you can still get fried rice, egg rolls, egg drop soup, and beef with broccoli, too.Cheeky comments aside, this place is an institution, and for good reason. It hasn't changed much over the years, the peking duck is still quite solid, and parts of the menu appear to date from Dwight Eisenhower's administration. Chairman Mao would be pleased. I'd suggest the dim sum when available."], ["Nurys I.", "This was my first visit to Tropical Chinese and I loved it! The ambience was nice. The restaurant was nicely decorated and looked clean. We ordered dim sum to start: shrimp dumplings, pork and shrimp dumplings. Then we ordered Chinese broccoli in oyster sauce and for our starters we ordered black bean chicken in a hot pot and sticky rice. It was just the right amount of food for the three of us. The food tasted fresh and very flavorful. We skipped dessert and instead ate the complimentary fortune cookies and orange wedges. The service is not 5 star but it works. I would definitely come back with a group of friends and try more food. Note: you will walk out smelling like your food (or your neighbor's)."], ["Carol M.", "This is my favorite Chinese restaurant in Miami. It is usually full and there is a window that allows a view to the kitchen.My favorite dishes are the Peking duck and the wonton soup. Highly recommend it!"], ["Armando N.", "Hands down the best Chinese cuisine in South Florida. I've been coming here since a year ago. The service is outstanding and the food... oh my... amazing.My recommendations:- Siu Mai Dumplings- Stuffed Mushrooms Dumplings- Peking Duck Wraps- Twin Phoenix Hot Pot- Braised Pork Belly- Prawn with Jalapeños- Maine Lobster- Pineapple Fried Rice.I could go on... Their menu is huge and all their dishes are truly delicious.As for drinks try the byejoe fortune cookie martini."], ["Otty B.", "One of our favorite restaurant. It's great to come back on Wednesday May 27th. Luv this restaurant because it's always consist on the food and service . So hungry! After finding our florist for the wedding. It's great to be able eat delicious food."], ["Charlie S.", "I've always loved the dim sum here, and having eaten here since their re-design, I'm even happier with the food. Pork buns are a favorite. The Chinese broccoli is excellent, and pretty much always cooked perfectly. Other favorites include:- the \"crab claw\" (note - only a little bit of crab here, mostly delightful fried shrimp)- shrimp and chive dumplings- tofu shrimp- orange beef (though frankly this can be sometimes inconsistent, sometimes too chewy).There is much to love here. By far the best dim sum in Miami, and served from the carts (which has its own special magic)."]], "Canton Palace Chinese Restaurant": [["Jennifer F.", "We order from here a lot. Great wings, fried rice and I love the Wonton Soup. The sizzling steak does not travel well."], ["Julio R.", "Best Dim Sum in Miami. Loved the wonton soup."], ["Miyamoto R.", "One of the best Chinese restaurants in Miami.This is the real deal folks who are from Manhattan and looking for a real Chinese restaurant in Miami. Who knew it would be all the way out at the edge of Little Havanna?  It's the real deal when the windows are covered with Chinese newspapers and more than half the patrons are Asian.The reason to go to the restaurant is for the dim sum selection. Special fried rice, shrimp balls, gow gee, shanghai steam buns, they got it.  And it is good. And reasonably priced.  Go for the shu mai, great stuff.Prices are reasonable, I would take it slow. It's easy to get carried away checking off a bunch of the dim sum menu items and then realizing you ordered too much."], ["Kimmy P.", "I really liked this place. The people are really nice and the dim sum was GREAT! They have it available during all open hours, not just during some hours like some other restaurants have. The dim sum menu had a variety of foods and I loved everything I picked, it all tasted great to me. I loved it and I've taken my parents here and they've loved it as well. I haven't ordered anything off of the regular menu, I've always picked from the dim sum one."], ["A.J. C.", "This is probably the best chinese restaurant in Miami. Price wise and quality wise. The staff is really nice and the food is allwaaayysss good. I go on a regular basis and never have a complaint."], ["Guy L.", "Too expensive. Food was good. Enough for 2 people but a Lil too expensive. Stereotypical Chinese food."], ["Richard L.", "Four of us were here for dinner. The food was exceptional. We had some dietary issues which were handled without a problem. I have been eating here for about 20 years and the food is always great. One of my favorite dishes is the shrimp wonton soup. I have ordered this in other Chinese restaurants and this preparation is by far he best. I recommend the fried chicken with garlic slivers. Very juicy very tasty."], ["chris h.", "Not worth the trip.  First of all, the place has no ambiance.  Very old tables & chairs.  No table cloth.  Then, the waitress comes over with an unhappy face like you have done her wrong in the past.  She doesn't want to be there.  She doesn't care if you come back or not. You want to ask yourself: \" Why do i want to eat here???\""], ["Thomas M.", "Canton Palace has the best authentic Chinese food for the price in Miami hands down. Hidden behind Danny's in a common 8th street strip mall you find a small section with pitch black windows with a tacky neon sign \"OPEN\" behind it's doors you find an ordinary decor with cranked up A/C, friendly staff and yes a Chinese Restaurant. I always get the House Specialties you will not be disappointed. Be careful the portions are with interest, very large. General Tao, Mongolian, Roasted Duck, various Soups, dumplings, Sp. Fried Rice, Sautéed Shitake Mushrooms, Sautéed Bok Choy are very good as well. It's always busy so don't be disappointed if you have to wait or the food takes longer than usual. They do run out of the duck, so if you are a duck fan get there early in the week to ensure they have supplies.. You will find lots of Chinese ppl eating here, not sure if they are family as they all know each other but damm those ppl can order. The lazy susan can barely handle it LOL."], ["Dawen H.", "Oh! C'mon! Give me a break! Sweet Ma-Po Tofu? That is way too South Americanized! Rediculous!"], ["Big H.", "Great food. Good service. Only setback, they had no bitter melon"], ["Rick R.", "I had one of the lunch specials and it's typical Chinese American food. Not horrible but nothing great either."], ["Michael C.", "Food was good but it rates 2 stars because how expensive it is for average Chinese food. This is yet another OVERPRICED Miami Chinese food restaurant where mediocre tasting food is considered great by Miami locals. $10-$15 per entree for  a plate of simple vegetables mixed with a little meat is RIDICULOUS. That same dish costs $4-7 in other cities but in Miami the locals get their wallets stolen because they just don't know any better. For the price Canton Palace charges, the food better taste damn good by use of excellent quality chicken / pork / beef (with no tendons, ligaments, skins) or use of authentic vegetables like ginko nut, dried seafood, lotus roots, seaweed, etc. etc. instead of the usual cabbage, bok choy or gai-lan stir fried in peanut oil. The menu has chop suey (huh, WTF?), pineapple chicken (ya gotta be kid'n!), broccoli beef (typical asian dish), and so on and so on. Not alot of imagination for a place that charges $10-$15 per entree.The restaurant would rate 3-4 stars if the cost of the dishes were cut by half - the price point  for the quality and type of food they deliver. But if you think excellent Chinese food is fried rice, sweet and sour pork, beef chow mein, and maybe bok choy then this is a destination restaurant for you... pay their price, you'll love this place!"], ["Andrea W.", "I go to eat dim sum if not every week atleast 3 times a month. And this place never disappoints. Today we had sticky rice wrapped in lotus leaves which wasn't  my favorite but its was still interesting and delicious. Seafood pan fried noodles is so much fun to eat my only complaint is that it comes with fake crab (not a fan of at all) and the scallops tasted fake too but its was still amazing. We ordered our usual dim sum items for I finally decided to try the stuffed bean curd with oyster sauce I can't even describe how good it was. It is tofu sheets stuffed with pork, mushrooms, and bamboo shoots. If you are adventurous have them bring it out to you immediately! It was 7 of us and i didn't even list a third of all the regular items of dim sum that were ordered and I went with 6 full grown hungry men and the bill was $75 so this place is delicious and doesn't burn a hole through your pocket."], ["Carolina M.", "We've been going to this restaurant for a few years. In the past, the place looked old and outdated, but a few years ago, it was revamped. When you go in and you see that you're the only non-Chinese and the menu in the blackboard is written in Chinese...you get the feeling that this has to be a good place. The food is authentic Chinese, with the all-favorite chinese-american dishes. Try the Yeung Chow Fried Rice; it is a fried rice with pork, chicken and shrimps (big and fresh), but it has only a little bit of soy sauce. Also, the sweet and sour shrimp or chicken; the batter is so light and crunchy, it will melt in your mouth. They don't have anything ready, they prepare everything on the spot. I know that because one day last minute I decided to have more fried rice and they apologized and said I had to wait until it was prepared. We drive like 10 miles to get to this place...but it is worth it!!"], ["L R.", "You know when they say \"if you see other Chinese people eating at a Chinese restaurant, that means it's authentic and good.\"  Well, I believe this saying and they are talking about this joint.The restaurant is not very fancy.  But the food, especially the dim sum, are divine.  The prices are just right for the portion of food. Some other dim sum places are cheaper because the dim sum are so tiny and vice versa.  My family loves the fried shrimp balls, so crispy and delightful.  The sesame balls are just right...I mean how can anyone mess this one up. We love everything that is stuffed with shrimp like the peppers, eggplant, the mushrooms. And did I mention their sticky-rice wrapped in lotus leaves??? DIVINE! It's like a meal in one. It has chinese sausage, chicken, pork and I think beef all tucked inside a bed of sticky rice.YUM!!!! The duck soup is my all time favorite.  The staff are friendly enough that they will answer all your curious questions about the dim sum or any of the food...just be nice.  I crate the food hear almost all the time. Thank goodness its from away from me. Enjoy!"], ["Rob C.", "fair number of asian patrons.  menu has a decent cantonese section.  funny to see spanish written in it also.  additionally, there is a menu written only in chinese.  you can order dim sum anytime (35 cents extra after 3 PM).  so I had the steamed parsley dumpling, pan fried leek dumpling and pork and shrimp dumplings, which were ok.  i didn't care for the fillet fish congee--fish was \"fishy\" tasting (not fresh)and it was filled with lettuce and no ginger.  the sticky rice in lotus leaf was massive, but lacking some flavor b/c too much rice.  the overall atmosphere is exactly like kon chau (dirty and old), but maybe i should try the dim sum during more regular hours."]], "First Hong Kong Cafe": [], "Chung Heng Chinese Food Restaurant": [], "Changs Chinese Restaurant": [], "Dragon 1 Restaurant": [["Marcus Z.", "One of the first things I noticed since I came to the States almost 4 years ago is that all the early Chinese immigrants (before 1990s) are from far south China, and all the typical Chinese stereotypes and Chinese food are associated with south Chinese people from 1 to 2 provinces(out of 32). As a north Chinese guy, it is nearly painful for me not to be able to find Chinese restaurants that present food that taste like home. But it seems that, the pain is over after I found this place, as the chef is from north China!I ordered Tianjin pancake, which is a very popular breakfast for north Chinese. The flavor is very good, although not exactly what I used to have, I am still really satisfied. I also ordered the spicy pot, which is very good as well. The Chinese barbecue also tastes great. They also offer Beijing duck, but you have to call ahead of time for them to prepare. I will definitely come back for more."], ["Xuchuan Z.", "Never have I had such spicy food that can taste good. This food is very delicious and spicy at the same time, which is a hard combination even for skilled chefs. The type of oil they use to cook their food is very delicious and looks great. The lamb skewers are great, the water cooked fish, and the stir fry lamb and cumin is delicious as well."], ["Sebastian S.", "Bad quality of food, waiters are nice, but the food is hard to taste and swallow beyond words. I wonder if they cook with expired meat and vegetables and sauces?"], ["Regan L.", "Awesome restaurant, best Chinese food I've had since coming to Miami. Very authentic dishes, my favorite is the pork and tomato with eggs. The lamb skewers, crabs and Peking duck are also incredible! The staff are friendly and very helpful. Highly recommended and a personal favorite in Miami!!"], ["Luqi C.", "Travel for a long time, this restaurant it is the most tasty and traditional Chinese restaurant!  I can say bye to the Panda Express"], ["Andrew M.", "Fantastic mapu tofu, and i love a lot of their dishes. It is a bit small, and the service is not always great, but the good is still really quite good. Do NOT go here for the typical american faire of chinese food, this is not the place for that, go for the sichuan style food for sure"], ["Diane H.", "So gooooooddd!! I've been here several times and I always have my roommate order for me since she is Chinese. Though I never have any idea what she ordered, it's ALWAYS good. Some of my favs are the sesame noodles, noodles with minced pork, twice fried pork, garlic bok choy and chili pepper chicken. If anything, their chicken in chili oil can be more flavorful, but the chicken is still very tender. They also serve a variety of Chinese drinks to make your meal even more authentic. I also love how the owner can always be found mingling with customers and even sharing a beer with them. My favorite Chinese restaurant since I've moved here from CA :)"], ["Jorge B.", "The food was very tasty and the service was pretty good. The only complaint was that I had trouble getting across that I like my Sichuan food extremely spicy. Eventually they brought me some excellent chili in oil. I will go back just for that chili.  The place was full and I was the only non-Chinese in the joint. The place is a little dirty but the food is worth the visit. If you like true Sichuan then order off the second menu you have to ask for if you are not Chinese."], ["Arturo B.", "Authentic Chinese food which is SO MUCH BETTER than the usual 'american'. After visiting China this summer, I have been looking for the real deal in Miami and thankfully found Dragon 1. Most of the patrons visiting are from the motherland - which is ALWAYS a great sign.Ask for the Chinese menu (with english translation) and be adventurous. Order different things. Let them show you what real Chinese food is. Adventurous souls will enjoy dinner here. Can't wait to be back and enjoy some more."], ["Melody T.", "I cannot figure out how this place gets such high reviews. Maybe their food is generally executed better than our experience.I was so excited to discover that Miami finally has some authentic Chinese food, and was pleased to find a menu with dishes that reflected it. So what went wrong? We came in at 5:30 pm, and tried to order no less than 4 dishes (in mandarin)- all of which we were told they ran out of. No problem. I quickly scanned the menu and decided on sautéed cabbage, beef brisket with napa cabbage, and double cooked pork. Our food came... And this is where it got really really bad. Strike 1:  beef brisket/tendon dish- the meat was completely inedible due to the fact that it was not cooked long enough. The tendon was so hard and chewy that we spat it out, eating only the tough beef surrounding it. This dish, if cooked properly, is delicious, with soft tendon and melt in your mouth meat. I have never made such a horrible rendition of it myself, much less ordered it at a restaurant. Strike 2: double cooked pork- again with the poor execution. The pork belly was overcooked to such jerky like consistency that even the fat surrounding it could not save its texture. It was also way too salty.Strike 3: remember when they told us they were out of all those dishes? One of them was the beef noodle soup I saw being placed on the table of a couple who arrived 30 min after we placed our order.And so i left thanking my stars that I do not live in this city anymore, and will be hightailing it back to Rockville, MD for some real food soon.End Note: the two stars was for the cabbage. It was delicious and I highly recommend you order it."], ["Claudia J.", "Authentic Szechuan food, mom & pop operation.  Don't expect much!! they might sometimes forget to bring you something, but it seems they are short staffed.  Small place that fills fast!  See pictures please.  The cabbage, chicken, pork belly was yummi, lamb stick... all of it, super yummi.  Better know what you want to order, menu is in chinese only.  Yes, this food tends to a bit on the spicy side - but not too spicy!"], ["Krys P.", "This place specializes in Sichuan cuisine and offer many of its signature dishes, like tea smoked duck, twice cooked pork, cold beef tripe, mouth-watering chicken, chili fried chicken, beer duck, mapo tofu, kung pao chicken and more.The dishes are on the small side, and best served family style. Be warned that Sichuan food is known for its spiciness, and not just spicy, but ma-la, numbing spicy.  Sichuanese peppercorn has this special effect that will gives you a tinkling, numbing sensation. Which can be totally addictive like crack...  -  The cabbage looks bland, simply stir-fried with a hint of salt and chili pepper but is addictively delicious.  -  Lamb skewers are $2 each; the meat is a little mushy but flavorful with a good kick.  - Spicy smoked tea duck comes on a bed of fiery red chili pepper.  Slightly on the dry side.- Beer duck, stewed in a rich broth, is rather spicy but very delicious.  - Huí guō ròu, twice cooked pork belly, is another winner with crispy but not greasy pork belly with bell peppers.  - Sichuan jelly is some white jelly (made with rice and bean flour) with cucumber, swimming in a sauce of chili, green onion, peanut and garlic.  So delcious!- Hand torn chicken was just okay, probably won't order again.  - Clay pot ribs has a few chunks of ribs atop napa cabbage and bean threads and taste rather bland by comparison,  its only virtue being the only non-spicy oasis in an ocean of chili oil.  Yup,  Sichuenese is known for its fiery spice.  If you can't handle it,  be careful what you order. - Squid with green bell pepper - would like more pepper.  Squid was chewy.- Fried croaker: a plate of fried whole fishes, about 4 or 5 inches long.  You can eat the whole thing except the head.  I like it overall though the croaker can sometimes taste a little fishy.- Cumin Lamb: tasty with good spice.- Water Boiled Fish: Don't let the word \"water\" fool you.  The fish is swimming in red chili oil, not water.  Fish is tender and you'll keep eaten in spite of your swollen lips.  - Peking Duck: a plate of roasted duck, sliced mostly skin with a little meat, is eaten along with scallion, cucumber and sweet bean sauce wrapped inside thin crepes. The leftover duck is used in a soup. They slice the duck inside, so without the table-side show, $40 seems rather steep for a plate of duck skin and a soup.  Authentic restaurants in Beijing uses fruit tree wood, so you're missing some nuance of flavor, but the crepe and the presentation is really authentic.  Needs to pre-order. We enjoyed the dinner so much we came back on a Sat afternoon for lunch.  Walk in at 11:30, half hour after opening, they are still mopping the floor and there are trays of dirty dishes from the night before.  We try ordering the handmade dumpling,  are told they sold out last night.  Plan B and C come back with the same reply.  We end up with the beef noodles and pork veggie bun.  The buns were microwaved, not steamed, as evident by patches of dry dough. I definitely felt like I'm helping them clear out left over. Brisket could be more tender and I am disappointed that the restaurant doesn't make it own noodles as most Northern Chinese places do.  All in all, ok lunch, great dinner."], ["Mia H.", "I am from Sichuan, so I thought I was in position to judge the authenticity of their food. I was surprised they offer lamb skewers. I went there twice, the food was okay-- I could have given 4 stars but the service just wasn't good. The servers were not attentive AT ALL. I was never greeted with a smile. I told the server to bring me a soda, but I never received my drink, and they brought me a check with a charge of soda on it. tl;dr: Food is OKAY; service should be improved."], ["Isabel L.", "Our first time to this restaurant for lunch. Waiters were very helpful and friendly. Meals are excellent! We didn't  wait for too long for our meals to come up, they served very fast! If you like authentic which yang cuisine, then this is the place! This is not the normal Shichuang food that you normally eat in chinese restaurant. This is authentic!好吃的四川菜，如果您喜歡吃麻辣，一定要來這裡！ 老闆說再過幾個禮拜還有北京烤鴨吃哪！太棒了！"], ["Sam P.", "I came here with a Chinese colleague of mine for lunch. It is a bit of a 'hole in the wall' kind of place (i.e. not much ambiance), and it is pretty small (10-12 tables). But the food is very good! Authentic Chinese served 'family style'. They do not have traditional American Chinese dishes. Rather, they have several meat dishes, and a couple of vegetable dishes, and they come in large portions that are meant to be shared with the table. Prices were a moderate. I will be back!"], ["Iris C.", "I was recommend by my boyfriend's dad to eat at this place.  I have been here about 3 times. This place is very authentic and it serves Northern Chinese cuisine. It is unlike most Chinese restaurant in S. Fl that serves mainly Cantonese style dishes.  The first time I came here, it was with a very big group, and we literally ordered what seemed like the whole entire menu. All the dishes are very flavorful and different from what i normally have. You know a Chinese restaurant is authentic and tasty, when you see it filled with Asians. The authentic Chinese menu is written in Chinese, so if you don't can't read it, it's best to look over at the neighboring tables and see what appeals to you, or ask the waiter/waitress for their recommendation. They also have a American-Chinese menu that is written in English for those who are unwilling or not really to try real authentic food.  The service there is decent, the restaurant is pretty small,so if you come with a big group, it's best to let them know ahead of time. The group of people that i went with, expected everybody to speak somewhat perfect English. So, before coming here, you must understand that majority of the workers do not speak perfect English, therefore, you must be patient and understanding. I absolutely fell in love with one dish. Their beef noodle soup is different from what i normally have, and their noodles are awesome. its not the thick cut flat noodles, but instead it looks like Chinese lasagna  looking noodles. The texture is chewy of the noodles allows it to absorb the flavorful soup.  Plus, the noodle dish was only $7!!I also had this dish that looks like stir fry chinese bacon, with black bean sauce. It was delicious and spicy. ***If you cannot handle spicy food, you should let them know, because their level of spicy is not your average tabasco sauce, but rather pure hot oil from fresh hot peppers. ***"], ["Donna W.", "Based off of the other reviews me and my friends decided to try Dragon 1 Restaurant.  I have to say I was disappointed because I was asking for the Beef Noodle Soup and they told me they did not have it on the menu.  We were given the \"English\" menu and it is true there is a Chinese Menu for the patrons who are obviously \"Chinese\".  I ordered the Mongolian Beef, and my friends ordered Boneless Ribs, and Shrimp LoMein.  I feel like I was cheated out of an experience.  The Chinese Patrons had big bowls of food and it did look delicious, but I have no idea.  The English menu was just like all the others.  Very disappointed and I feel discriminated against because I'm American.  Maybe they should consider adding photos of the different plates.  We don't all have a Chinese friend to translate for us."], ["William L.", "I don't know how this place gets good reviews. I like traditional Chinese food but the people here just treat you like a outsider. They don't really have a broad range of chinese food and the place looks like it's overdue for a inspection."], ["Michael T.", "I have eaten at many, many of those run-of-the-mill Chinese food places in my lifetime. You know, the kind that are on virtually every corner? I went to this place expecting to get that kind of quality, taste, selection but I left with sooo much more than I could have expected!!For the record, I didn't Yelp this place before going so I didn't exactly know they had a wider selection than the \"American Chinese\" menu from which I ordered. Even though I picked a regular dinner item, the food was NOT the same as those other places, it was absolutely delicious. Not only were the spices and flavors more authentic, but the quality was just above the rest. The dumplings aren't filled with that weird light brown pork paste - instead, there are what I think are chives, the pork is chopped and the outcome is a flavorful, light and airy dumpling - even fried!The General Tso's chicken has REAL, big pieces of chili pepper with it! That is a first. The chicken is not overly breaded and the sauce is actually really spicy. So perfect.We also had the Hot and Sour soup. I knew this place was different the moment I opened the container because instead of that weird, clear \"gel\"-like consistency of typical Hot and Sour soups, this one was dark and brown and decidedly missing that odd gelatinous feel to it. I get Hot and Sour soup every time I eat Chinese and this was without a doubt the best one I've had. I will order this again and again!The fried chicken wings are small compared to other places, but way less battered (if at all) and pretty cheap at $6.50 for 10.As for the staff, they were very helpful and courteous. The waitress took the time to figure out exactly what we wanted despite a bit of a communication barrier. I would prefer that to someone who just gives up and gets our order wrong.  The owner is really awesome and was out there making sure everything was running smoothly.Overall I really enjoyed the experience and I plan on going back to try their \"Chinese\" menu. I'll come prepared with what I want and maybe make a few friends in there who can make suggestions! I saw a crawfish dish that looked phenomenal and will totally be getting it next time. Will update!"], ["Jason W.", "If you're craving authentic Chinese food near FIU, Dragon 1 is one of the best in Miami-Dade.  Opened up only a month ago, this place serves up hearty Chinese food for a reasonable price.  Not the greasy, overly salty stuff you find in most other places in Miami.It's always a good sign when you go to a Chinese restaurant and find that most of the tables are occupied by students from China.  The owner is from Tianjin, China, and has lived in the U.S. for 14 years.  He's very friendly if you can talk to him in Chinese.This place was recommended to me by a friend of a friend, and if I lived closer to this area, I would definitely choose this restaurant as a regular place to get my Chinese food fix.  Definitely worth the drive, however.  I recommend the mapou tofu, and if you're feeling adventurous, the crawfish.  The kebabs are exactly how I remember it tasting at a Xinjiang restaurant in Beijing.    If you don't like spicy foods, be sure to clear that with your waiter beforehand since some of the food can be spicy.If you don't understand the menu, you could always point to a dish you like from someone else's table :).  A great place to make your Chinese friends take you so  you can get a taste of what some of the food is like in China."]], "Gourmet Gourmet": [["Carina I.", "Yum yum!!! A co-worker brought some lomein and fried chicken wings...it's awesome! Definitely recommend:)"], ["Bill L.", "Before they moved, I would have given GG a 4.  Picked up an order a few nights ago from their new location.  I'm pretty sure it has nothing to do with the location but the latest round from GG didn't seem up to their former self.  The order seemed just a little on the bland side.I would like to be more elaborate with this review but what can you say about a take-out joint?  Like I said, seemed as though they were a little slim on the flavor."], ["Tim P.", "Definitely above average Chinese Takeout.  --  I found this place on Yelp! with help from other reviews.  On the way there my GPS had the location wrong so I called and they provided great directions, when I came to pick up my food everyone was very cordial and welcoming.  The hospitality didn't stop there, on the way home I got a call from Gourmet Gourmet saying that they had forgotten the \"Crepes\" that come with the Moo Shu Pork.  I told them that they really weren't that important and not to worry however, they insisted that they bring them to my hotel at no cost!  That is good customer service in my book.  The food is delicious too, not just your typical Chinese Takeout!"], ["Brian B.", "Really this place should get 4.5 stars, but when you think about what it really is, it bumps it to 5.  This place is the best chinese takeout in the gables/coconut grove area.  Mind you this place is ONLY take-out or delivery, no seating here. So far everything I've tried here was deliciousso this place moved. and i haven't tried the new location yet."], ["Ivonne Marie C.", "Chinese food is, well, Chinese food - unless you've gone to China you're not much aware of how Americanized Chinese food is in the US. But in all, it's good, quick food; and Gourmet Gourmet is no exception. I used to always eat here back when they were closer to downtown CG. When I'd literally eat my lunch atop a refrigerator b/c their shop was so small. Not much has changed, except now, they have six stools, one counter, and a stainless steel metal shelf placed too high to eat comfortably... another thing that hasn't changed - their food and their service. Seriously, the couple of people who work here are just nice; and best of all, it's super cheap!!yeiii that Gourmet Gourmet reopened, and yeiii that it is still relatively close to my work so I can come back every now and then. * Warming - if you are claustrophobic I recommend you order delivery and do not make plans to stay and eat inside. I'm sure you get the picture - my walk-in closet is larger than this place.** Credit cards accepted for orders of $15 or more."], ["Juan A.", "I don't eat Chinese food from any other place in Miami. I've been going to Gourmet Gourmet since they were in the Gables. Our office has lunch from them once or twice a month, and everyone loves their chosen dish. It's not a place to go to sit down and eat, but its worth the hassle of taking back to your house or office."], ["Praneeth W.", "Wow, there is only one way to describe the food I had at this place. Completely awful. Looking for a quick, cheap takeout Chinese place, I found \"Gourmet Gourmet\" on Yelp and ordered General Tso's Chicken and Pork Fried Rice.What I received was absolutely hideous. Chicken that was so rubbery and fatty (some pieces with skins), fried rice again with as low quality meat as possible. It managed to even smell bad.Looking at other reviews here, maybe I just ordered the wrong things? I hope that's the case but considering the quality of the meat, hmm.To top things off, they charge for their hot sauce too. Yes, the prices are low but not really low enough to make up for the terrible food."], ["Janine C.", "This is one of the best Chinese places around! Jose Sang is one great chef and he cooks the food right there in front of you. There are  only 3 seats at the bar to eat, but worth it!!! The chicken over Jade blossums is the most amazing dish, but everything I have eaten has been incredible. The fried dumplings and the spare ribs are awesome. The soup is delicious and the main dishes are huge and can be shared between 3 people easily.  Most people order take out and delivery, but if you eat it there, you will come back again and again!"], ["Chris L.", "give it 3 stars only because it's in miami. I would be 1 star if it's in bay area."], ["Shawna M.", "This was my first try at Gourmet Gourmet and it was great! Take out is the way to go as there is really no place to sit and eat.  It's perfect if you are anywhere around the Gables!  I've finally found my go-to Chinese!!!!!"], ["shelley l.", "Coral gables Locals.  This is a perfect weekday dinner fix.  The food is better than the local competition (Canton).  The restaurant is also very cleanly.  You can see everything from the front of the store.I highly recommend the Mu-Shu pork,  the portion is big so I suggest ordering an extra 4 crepes so that you can have the leftovers.This will feed 2 people.Also,the egg drop soup is a great option if you are feeling under the weather."], ["Jessica C.", "alrighty .... below is my original review ... since then, Gourmet Gourmet has become my go to spot.  the staff there are hilarious and incredibly nice ... the food is phenomenal -fresh cooked, every time ... and scrumdiddlyumptious to boot.  doesn't matter what you get, you can't go wrong with Gourmet Gourmet!  i just wish they delivered after 9 pm =(i actually live right down the street, a ten minute walk from gourmet gourmet ... so late one saturday night i realized i was craving chinese food, and since my favorite spots are at least 30 minutes away, i logged on to google and yelp to see if it was worth a try... i really can't give more than 4 stars since i've only ordered once, but the food was great ... spring rolls were fantastic, definitely the best i've had in a while ... the beef was absolutely incredible -tender and not at all chewy or rubbery, veggies were great and the sauce was absolutely delicious ... next time i get the itch for chinese, i'm gonna let gourmet gourmet scratch it."], ["Francisco R.", "It's reopened!After having walked by this place in the Gables a bunch of times I was intrigued for years, but since I don't LIVE in the Gables I wasn't just going to drive out for take out...Well, I went to their new location 4249 W. Flagler, which is on my way home and did my research to make sure it was the same owners and my first order was AWESOME.Parking is in the back.  I can't wait to try out everyone's favorites!!!"], ["Francisco S.", "Had the sweet and sour chicken lunch special a couple of weeks ago and it tasted great, crispy outside and tender and juicy inside with a great not overpowering sauce. The side rice was great too. Owner is very cool and attentive. They cook everything in front of you so you know it is fresh and how they do it. This place reminds me the old Chinese take-out places in NYC. The owner highly recommends the special rice that it is what I am thinking of getting today!"], ["Miggy F.", "House special rice, fantastic!"], ["Jennifer R.", "They make it quick, they make it good and they make it cheap.  The portions are enough to feed 2 people and on top of all that, they deliver in the CG neighborhood.It takes a real good Chinese takeout joint for a Chinese person to recommend it to other.  This place is awesome and we order from them about once a week.This little \"hole in the wall\" takeout joint has been there forever and the quality of the food has been consistent.They have the best Singapore Noodles (the BF can't get enough, we have to order that every time) and the Sasha Beef is magnificent."], ["Alex L.", "Have to say that I agree w most of the reviews. I ordered ham fried rice, honey chicken n egg rolls. The rice tasted so fresh n yummy, the honey chicken was very good too. The egg rolls had sort of an over powering flavor, it had too much of something, can't really pin point it. Food was ready when I got there n staff was very nice n friendly. Prices r reasonable.......But no fortune cookies :-("], ["Kelly O.", "2.5 stars. Wow a lot of high ratings. I think the take out is ok.  General Tsao's chicken is usually only dark meat. The  fried rice is decent. I love the salmon and cream cheese wontons. I hardly ever take out from here anymore. The place grosses me out and I found better in the gables."], ["Renee D.", "Now you have to realize I came from the beach where Chinese food takeout was a staple of our diet. Oh my fu*&^ing fried rice and chix with broccoli!!!! I think the last time I tasted Chinese so yummy was in San Francisco. Someone here  knows what they're doing - ps - my hubbie went inside to pick up the food - so I can't really comment on it's interior, but take out?? A - PLUS PLUS!!! I can't wait to try more things on their menu... and I need to find out if they do dim-sum! Anyone know?"], ["miGs v.", "Food is good and they have good lunch specials..... entrees are huge ... one is enough for two.....  the wontons are golden.....didnt have any cups and ice for my coke which i thought was weird..... but then again its a little hole in the wall... foods good... cheap and kool.... theres only like 5 chairs in a bar type setting (no tables)  and no one was there.... mostly take out ... id go again"]]}