{"Downtown Bistro": [], "Otentic Fresh Food Restaurant": [["James B.", "We only ordered 2 plates but they were both EXCELLENT... and very filling, which is not usually the case for me. Service was very good. I came on Saturday night and the place was definitely more on the empty side. The food came out super quick, which was a nice plus. Ordered: - Steak Maurice: Highly recommend it. The only downer of the plate were the pieces of pure fat embedded in the steak. There were a few too many of these chunks of fat that was just inedible. Other than that, the plate was outstanding, 5 out of 5. The steak is a 12oz ribeye with some melted brie and mushroom sauce over some gratin potatoes. This combo is as good as it gets. At $28 it's one of their more expensive dishes, but it is probably one of their best as well. - Otentic Pasta: The pasta was heavy, creamy, and very filling. It came with pork belly, ham, cream, and plenty of shredded cheese. Just looking at the ingredients you can see it's a very fatty pasta, but it tasted soooo goood. It's a very safe option for picky eaters bc it's basically like a bacon pasta. The stars of the dish are the pork belly, the strong flavors of the shredded cheese, and creamy textures of the pasta. Definitely recommend this pasta."], ["Ivy Z.", "The octopus salad/appetizer special is to die for.  We kind of wished we could've just ordered like 3 of them to make a meal out of it!  The texture of the octopus was so perfectly cooked.  It was full of deep flavors that lingered in your mouth and melted as you chewed.I ordered the rib eye course and my friend ordered the roasted chicken so that we could share since we couldn't decide between the two.  The ribeye was cooked perfectly.  However, the roasted chicken was a little dry for me.We had a large group of 12(?) girls and they gave each of us a complimentary glass of chardonnay.  The service was excellent and I am still thinking about that damn octopus...!!"], ["Juan S.", "Wow amazing meal here.This place had been on my radar for a long time and I finally got around to going here.Tremendous value, really tasty food and nice unobtrusive service.This place will be one of my new regulars."], ["Gam B.", "Amazing place if you're looking for a decent French and seafood meals. I had goat cheese salad, steak, and pasta."], ["Chelsey Anita C.", "Just AMAZING! Food is perfect, service is outstanding, and the price is very reasonable. I would visit Miami again just for this restaurant!"], ["German M.", "I came to Otentic on a Saturday night with a party of 9 and had a great time. As soon as we checked in, we were taken to our reserved table. We sat outside and I wouldn't recommend sitting outside because there's no air flow in the allocated seating area. The server immediately welcomed us with water without requesting it and a small glass of Chardonnay to taste. I tried their Otentic and goat cheese salads and they were alright with a great nut and fruit combination which made them memorable. This was the first time I tried the escargot and I really liked the way it was seasoned.For the main course, I had the scallops and they were very flavorful with an incredibly tasty side of couscous and veggies. For dessert, we had the sampler and my favorite was the chocolate mouse -- it was very rich. In terms of presentation, the plates were a bit overwhelming due to big proportions in small plates which diminished the visual appeal.The appetizers took about 20 mins and the main dishes took about an hour to come out. The desserts came right away. So, make sure you plan accordingly.Overall, we had a great experience at Otentic. The price point is great compared to restaurants in SoBe and the food quality does not disappoint."], ["Dany B.", "At last!I found the best restaurant in Miami Beach!The food was great!They greet us with a little cups of white wine for appetite and bread with a very nice dip.The atmosphere is romantic,yet casual and cozy.The service was great as well!I had a special request to have the salmon very well done and they took care of that!Would recommend 100% ,I also think its a perfect place for a first date.It is reasonably priced as well!"], ["Isabel M.", "I couldn't believe a restaurant like this existed! A French restaurant, with reasonable prices, good service and sizeable portions.We came for dinner and then returned immediately the next day for brunch. That's testament to how great this place is. Between us on both visits we had the grilled salmon, roasted chicken, brunch chicken sandwich with avocado, and brunch special of a bacon, brie and egg crepe. All the meat was tender, fresh and cooked perfectly. All the sides and sauces were exquisite. I must especially mention the fluffy, light gratin dauphinoise that came with my roast chicken. They were just the perfect compliment to the thin but INCREDIBLY tasty porcini sauce and the crispy skin and soft flesh of the roasted chicken. A real stand out meal. Service was slightly aloof but thoroughly efficient and knowledgeable. On both visits, we were greeted with free glasses of Chardonnay and fresh bread. Water was constantly refilled and no one pressurised us into buying wine when we just wanted sodas.The desserts and coffee looked incredible but on both occasions we were way too full after the entrees to even think about trying them. It's not that the entree portions were giant, but the ingredients so wholesome and the meals so well-crafted that we were totally satisfied after eating.Definitely up there with one of the nicest restaurants I've visited recently. Oh, and unlike many other restaurants in South Beach, there's no annoying hostess outside pressurising you and screeching at you to come in. Extra points for that."], ["DeeDee G.", "Ordered the rib eye steak and eggs, medium and a strawberry, banana and nutella crepe - it was excellent.  My only comment would be that the steak lunch was supposed to come with a small salad which actually amounts to no more than a few pieces of lettuce..would have loved a small salad Otherwise, a most enjoyable meal.  will be ordering again!"], ["Jonathan K.", "This was an incredible experience. Fine food, great service, and an incredible wine and beer list. The octopus was a real treat! This place is perfect for a romantic date. Proust is written across the ceiling and wall. I mean does it get more refined than that? I'll admit it made me want a Madeleine but I settled for the cake. And it was great. Bon ap!"], ["Joe S.", "Otentic is a great brunch spot featuring bloody mary's, mamosas, and house special drinks. More importantly, they have great food: the roasted chicken with mustard sauce was outstanding.Very affordable for such an authentic and well-executed French restaurant. I would go back in a heartbeat."], ["Jennifer N.", "I was a bit taken back and impressed by Otentic. It's another Miami Beach hidden gem off of Washington Avenue: a french inspired atmosphere.  Amazing, they serve you a glass of chardonnay (just like in France) when you arrive at the restaurant as you were being welcomed/seated. Recommendations: french onion soup, grilled octopus (if you like octopus), mussels i wine sauce, sun dried tomatoes and olives with pate, and the Crazy Platter.  The Crazy Platter (foie gras, brushetta Serrano, merguez & squash skewer, machego, tuna tartar, charlotte d'avocado), as an appetizer is big enough to share in a group of 2 or more people. Fortunately our group was fairly large, and we ordered 14 plates of food and did a family style french outing."], ["Kristina L.", "Cute little hip place. Very Otentic!The service here was great and our waitress (Asian lady, wish I new her name) was super nice and friendly. She always had a smile on her face.Comp Chardonnay... I was thinking... Is this a dream?!?Seated octopus: - Appetizer - BEST DISH!Nothing of this kind. By far the best cooked octopus I've ever tasted!! Celery mixed with capers, and tomatoes with a delicious sauce smothered on top.Steak Maurice - waitress said that this place is known for this dish. It Was covered in mushroom sauce with melted Bree on top.Seared Scallops - with quinoa - delicious, however, more on the salty side, but the scallops where so soft like butter, melts in your mouth.If I am every in this area again, I would definitely some back! Its so cute, the staff is super nice. I am a fan!"], ["Jeannette F.", "Decided to try this place out after reading the glowing reviews. We got the escargot and mussels to start with a side of the homemade french fries to start. Amazing flavor, and neither were gritty. We were basically too full for our entrees, which were the pork and roasted chicken, and those were amazing as well. The prices more than matched the quality and portions of the appetizers and entrees. We will definitely be adding this to one of our favorite local spots!"], ["Danny L.", "The Otentic is a great restaurant that gives you quality as well as solid bang for your buck. A random Thursday lunch at this place for us consisted first of complimentary shots of champagne, a flavorful country duck terrine appetizer. Tender salmon and rich pesto cooked linguine and my sandwich.  The Comme Labas, which was a solid size, flavorful, smoky merguez sausage sandwich with a sweet red onion taste and spicy kick. Also came with small salad and fresh fries.  Good food, good prices, and cute decor makes this a much better place than most of the money grabs at south beach"], ["Jorge R.", "The food is great, and it is in a great location. The ribeye is delicious. The service is great, the server Fernando was very attentive."], ["Kathleen C.", "This was a  perfect restaurant. They had the best escargot I have ever had, including many times in France. The service was wonderful, the prices fair.  The atmosphere is relaxed but elegant."], ["Andy R.", "Amazing food. Excellent service. Remarkable value.One of the best casual meals I've had in Miami (ever?).True gem. I'll be back as often as possible."], ["Chris W.", "This place was amazing! Walking distance from the Hilton Bentley and the beach. When we sat down, they served us complimentary wine. We ordered their mussel appetizer which is cooked in a creamy sauce that was great for dipping bread and sharing! We had their blackened salmon and roasted chicken. Both nicely cooked, especially the chicken. Probably some of the best roasted chicken I've had in a while. All for a great price"], ["Victoria B.", "Good food, poor wine selection.We tried white and red wines, both were very low quality and they do not carry any CA wines, only French. If you come for food, go for it, do not order wine."], ["Rachael H.", "I would really love to give this place more stars. Between the amazing, attentive service to the complimentary champagne which both are unusual for beach restaurants, you'd think I wouldn't mind going above 3, but the food was just lackluster.We had the escargot, nothing out of this world. The French Onion soup I must say was one of the best I've had. For the price I paid I expected it to be.Service was outstanding. Very attentive, very accommodating. I forgot what out server's name was, but he deserved a large tip."], ["Emmy F.", "I'm from Texas and came with a group of friends for 4th of July Weekend. We stayed on Ocean Drive but weren't finding any restaurants to seat 7 (yea we didn't make reservations or plan ahead, we were in lazy mode!). Instead went a couple blocks away from the beach and found this gem that seated us right away. Great service and amazing food! We sat outside but luckily it was cool since the sun had set, and our waiter was the sweetest man. Get the Otentic Pasta, SOOOO GOOD! I just looked at the description with pork belly, cream and egg and had to have it, not what I was expecting for a French restaurant but damn so good! Also I'm used to seeing high dollar signs for French food but his place was actually affordable, most things in menu range fork $15 - $25. Our table was happy with everything they ordered, so it definitely wouldn't hurt to try this place out, whether you're a local or a visitor."], ["Laura W.", "Really cute, chic little place in South Beach.  French cuisine, done pretty well.  Some comments:--A small glass of wine is brought, gratis, when you sit down.  It's a nice touch.--The portions are large, and sides are unnecessary. --The house salad is really good.--If you want chocolate mousse for dessert, ask at the beginning of the meal that one be held aside for you.  They do sell out.For the management's consideration:--I know they are going for French authenticity when they bring water without ice, but this is Miami!  A little flexibility here would be appreciated.--Turn on the air conditioning.  Again, this is Miami, not a restaurant in southern France."], ["Chevonne W.", "I was pleasantly surprised with this place. I was also surprised that it was pretty empty for primetime lunch. But I did Google it and then found on yelp that It had pretty good reviews so decided to try it out. They had a lunch special for $14 which included a soup or salad main dish (one of the specials) and a dessert which was chocolate cake. Today the specials were either a steak or salmon. Me and my friend both had the steak. I asked the waitress what kind of steak it was and she didn't seem to know. However it did come out pretty juicy, I believe it was a ribeye. She brought us complementary tastes of the wine they had on special which was good and some bread which was nice before meals came. The place had a very French appeal to it. They even had French music playing in the background at one point. also played a lot of old-school stuff like Etta James. Needless to say I enjoyed the music and the atmosphere. It even had French writing on the walls literally..\" even on the ceiling. It's a small place. Great for a date."], ["Renea S.", "I Absolutely loved my meal!  The presentation and the choices were amazing!!  I had seared scallops I've cous cous and green beans. Then chocolate mouse for dessert!! Our waiter Fernando was also great!!!"], ["Jean-Marie T.", "I had already dined there once and loved itThis time I ordered food deliveryEverything arrived in perfect restaurant conditionVery very highly recommended"], ["Anton Z.", "This is a great place, everything is fresh and very tasteful! The staff is very curious and attentive!! Lunch specials are great and always just the right amount of food. Must try if you are near by!"], ["Marj S.", "This is the first review I've ever done here in yelp and I have to say this is one of the best restaurants I've ever eaten from. Must try the escargot, foie gras, and the steak maurice!!!"], ["Bruno L.", "Amazing place.  Food was perfect and portions have a good size.  I had a plate of scallops that were so good.  Service was great and they were very kind."], ["Sarina H.", "nice little french style restaurant!Love the French Escargot there sooo juicythe enviorment is awesome and suitable for couples dating"], ["Mela P.", "I'm so delighted to have finally discovered Otentic. It's a deliciously charming French restaurant unobtrusively located on Washington Ave. I'm a South Beach local and I know that this place is going to be one of my new hangouts. The food was amazing and surprisingly affordable. I sat at the bar and enjoyed extremely attentive service and drank several glasses of excellent wine. The charming owner, Greg, happened to be there and was very thoughtful and made sure I was well taken care of. The decor and ambiance is perfect. Highly recommend this gem of a restaurant for a casual night out with friends or for date night. I can't wait to go back!"], ["Simon W.", "What a gorgeous place ... And an amazing menu. Do yourself a favor ... Give the touristy places along Ocean Drive a big miss and come here instead! Cute., quaint, fresh food and great atmosphere. Make sure to try the duck terrine!"], ["Michaela V.", "Loooove this restaurant.Usually go for lunch with a friend and we both very much enjoy the service and food. It is extremely fresh and the waiter there is great!!Recommend it to anyone!!!Great prices too..."], ["Juan Pablo G.", "I come here often to have lunch and I always order the lunch special, but as well I've come in other occasions and I always get very good service. Flavor wise normally is great, but sometimes the specials are shameful presented, such as extra small portions of salmon or steak full of fat. I know that as my colleagues that order the same special might get a bigger piece of fish or non-fat steak, so it seems that they don't take care of those little aspects. The rest of the menu is normally really good and well presented. I would definitely recommend this place to others."], ["Mark D.", "Amazing!  Great food, great ambience. Delicious choices for all, none to be disappointed.  My wife and I were in from out of and town and would bet local foodies would enjoy as well. Highly recommended!  Oh and this is the first time I've bothered to write a review."], ["Stephanie S.", "First time I have been at the french restaurant i love this place!!! OMG food was amazing so delicious and their desserts are the best so tasty and beautiful!!! I would love to visit this place again!"], ["Marc S.", "One of the best places on the beach.  Great food, great prices. This is one of the best deals!  Don't miss out!"], ["Justin W.", "Wow! Soo good. The food is excellent. Service is top notch. Portions are spot on And prices are incredibly fair. I'll be back for sure. I got the filet mignon beef (pork was tempting)... Done. :):)"], ["Wen G.", "Best crabcake/eggs benedict I have had in ages! I am an eggs benedict addict, my go to choice for brunch. This place has really perfected it. It is a cute little shop with AMAZING desserts and super nice staff. They really should have more customers!"], ["Karina S.", "A disappointment I must say to be honest. For someone who's familiar with French cuisine you know this is not good French food. The baguette gives it away at first. The quiche was sad and dry. The steak Maurice was a nice attempt at something original but the meat was rubbery and not good quality. The worst part of the experience was the service. Pretentious and careless. I wish I hadn't dragged my husband there for our last dinner in Miami."]], "DB Bistro Moderne": [], "L'epicerie at Wynwood": [], "Cafe Bonjour": [["Nisha C.", "Stopped in for a quick breakfast to go! Had the breakfast sandwich and a side of fruit to go! Service was fast and very friendly. The sandwich was delicious especially the bread! Definitely want to go back and try the desserts too, they looked incredible."], ["Jose Angel M.", "I stumbled upon this place about a week ago and decided to try it out today. Let me tell you, this is quite the spectacular restaurant! It's very small but quite cozy, and the owners are the friendliest people you could possibly meet. I ordered the steak (medium well) and fries, and as far as steaks go, this one was top notch! The fries or \"frites\" were very tasty as well. If I had more room in my stomach I would've also tried out the desserts since they did have many choices that caught my eye. Overall a wonderful experience, I will definitely be back for more!"], ["Roselin S.", "Don't know about lunch or dinner, but I wasn't impressed with breakfast at all.  Not sure how you can get an omelette wrong but it seems like they didn't add any salt to the eggs so they were very bland.  I don't like to add salt to my eggs and prefer them already seasoned, especially in an omelette.  May give this restaurant another try for lunch or dinner to be fair."], ["Dave W.", "Visit Paris in a strip mall in Miami? It seemed impossible but it is fun to make the impossible possible...The critical test is a proper croissant. Flaky, buttery, with a crunch. Check!The cafe ole was strong and authentic.The desert-ready almond croissant was to die for! We got several to go.It's not easy to imagine you are on the Champs-Élysées when you view the parking lot outside. Still, enjoy it. we did!"], ["Hikari G.", "The steak and frits is a must try, and their chocolate cake is simply amazing; it's as if a chocolate truffle and brownie got married and had a very light chocolate baby cookie in your mouth. Phenomenal!"], ["Ana Cristina P.", "Je t'aime, Cafe Bonjour.  You have the best Croque Monsieur this side of the Atlantic!You are a small yet bright beacon of all things French (hellloooo croissants, croque monsieurs, steak frites, etc!)... I would LOVE to see your dinner menu.  I suspect I will be hitting you up for a date soon.Service was lacking, they brought us the wrong thing twice... But I suspect it's because they were shortstaffed.  A seasoned Cafe Bonjour diner was with me and mentioned that they were missing a waiter when we went, so I'll have to give the service another shot next time.  No matter, this place is worth it just for the deliciously authentic French goodies!"], ["Iliana R.", "This place is my new spot! They truly put love into the food and you can taste it! Attention is friendly and warm, it's a pleasure to visit! I had a special of the day which was a hog snapper (one of my favorite fish) atop veggies cooked in wine, herbs and capers. So fresh and delicious! The real show stopper here is the steak and fries!! The steak is as soft as butter!! Mmmmm deelish! My 8 year old son begs to go here every weekend because he can eat the entire plate and you can't blame him lol. The escargot was really good and plenty is served. It's out of the shell too so The portion is good. The white chocolate and chocolate cakes are heavenly! Haven't had one bad thing here. It's amazing!"], ["Anon M.", "Magnifique.  How can a place have such good food in a small strip mall in South Miami?  Well, yes, it's possible.  Perhaps the food is pricey, but the quality is supremely high.  The escargot is better than many fancier French restaurants, the quiches are light and tremendously flavorful, and the chocolate cake is ridiculous.  Go there and have a great meal."], ["Laura D.", "I go here at least once a week for breakfast. The owner Amen already knows me because I always come in for my coffee latte and croissant. There croissants are amazing. Both times that I've been there for lunch, they are packed. The steak frites (fries) is delicious. Everything is fresh and homemade (I know because I smell and see them cooking in the morning). The soups are delicious and very generous. I recommend you try the croissants as they are so tasty. Pretty close to a croissant in France, and that is very hard to find in Miami. I highly recommend anyone wanting some french cuisine without paying an arm and a leg to try Cafe Boujour."], ["Carolina M.", "This is my favorite spot. Lately, if I'm craving something delicious and refreshing I know where to go. It is a really small place but very cozy. The owner and the servers are nice and pleasant. I've been here several times and I have always had a great service.  The food is fresh and the flavors are amazing. My favorite of all times: The apple chicken salad. My hubby's fave: steak frites; he claims it is the best of the city!!!Make sure you leave some room for dessert. OMG!!!! Pastries, tarts, macaroons, cakes, eclairs....etc...Pick randomly; I can guarantee you instant  happiness. The best part is that they're not too sweet like all the cakes and pastries of regular bakeries.I'll see you next time cafe Bonjour!"], ["Knicki B.", "The food is always perfect.  I don't mean good, I mean perfect.  I go whenever I'm in the area and that's at least once a month.  Order the steak frites, duck, salmon --- anything you will not be disappointed.  The chef deserves praise because - every dish, every time.  This place is why I eat out even though I love to cook at home.  Get a glass of white wine and enjoy the rustic French chic of this restaurant."], ["Belinda B.", "Last minute dessert and coffee meeting! Service has improved..desserts are scrumptious. Nearby patrons were happy to offer suggestions of their favorites - actually made the experience better. Owner offered sample of the puff pastry - we purchased four to take home. Good coffee. Business complete!"], ["Steve H.", "I decided to try Cafe Bonjour because I had to eat lunch in South Miami, and I have had it up to here with the three other restaurants which serve edible food. If I have to face the dirty-foot smell of Carrabba's one more time, I may go nuts and take some hostages.The cafe is very small and narrow; I think they put too much space behind the counter, which is where they prepare food. When the waitress moves from table to table, she has to navigate a pretty narrow passage in order to keep from bumping into people's backs. I counted 14 seats, if memory serves. The cafe uses simple wooden tables for two. Most are in a single row along a side wall. One person faces the wall; the other faces the partition between the open-air cooking area.The cafe appears to be SURGICALLY clean. That's very nice. A restaurateur who displays filth out front is probably doing incredibly disgusting things behind the scenes.They have French cafe food (surprise, surprise). You can order a croque monsieur, onion soup, salade nicoise, various sandwiches on baguettes, and desserts such as eclairs and tarts. Their menu is on their website.I had a half-sandwich and onion soup. I ordered a turkey sandwich, but the owner's wife brought me chicken. Oh well. The bread was hot and yeasty. The \"Cajun mayonnaise\" on the meat was good, but it leaned more toward the blandness of French food than the heat of Cajun cuisine.The onion soup was very nice, but it seemed sweeter than it should have been, and it was a little low on salt. It came with two crusty pieces of bread floating in it. For all I know, this is how onion soup tastes in France, but in the US, it's usually less sweet, with more salt.They brought the sandwich out after I finished my soup. That's just crazy. It kills the whole point of the dish. It's \"soup and sandwich,\" not \"soup and THEN sandwich.\"I ordered pommes frites instead of salad, purely to see what a good French cook would do with French fries. I remembered having wonderful fries in France, cooked in flavorful olive oil. The ones they served me at Cafe Bonjour were somewhat more restrained. They were cut extremely thin, like shoestrings, and there was very little fat remaining on them. I wasn't able to detect any identifiable flavor in the oil, so maybe it was canola. The fries were executed very well, even if they didn't have the olive taste I missed.The food came quickly. Apart from the sandwich error and a wobbly table, there were no problems.I got an eclair to go, again out of curiosity. I was a little disturbed to find it had chocolate filling. I am used to getting vanilla-flavored pastry cream in eclairs; maybe that's not the French way. The filling seemed to lean more toward American chocolate pudding than a French concoction, but my knowledge of eclair filling is based on the vanilla type, so maybe it was perfect. I would not buy another eclair there. It was good, but it didn't do much for me. I missed the chocolate outside versus vanilla inside battle I'm used to, and the filling just didn't say \"France.\"It's nice to eat in a place where they obviously care about standards. It's also very unusual. The food is good, the place is clean, there is plenty of parking, and it's a great place for lunch. If you need a better recommendation than that, I'll also point out that the people at the other tables were speaking French."], ["Berta C.", "First time at Cafe Bonjour today for lunch. Delicious butternut squash soup. Service was attentive and friendly. I will definitely be returning for lunch when I am in the area."], ["Nelson G.", "The menu looks great, butttt the price is a bit steep. I am a native New Yorker and this is South Miami not Soho, I just tried the croissants and some danish looking almond pastry very good but pricey for I just ask for 4 croissants and 2 of them almond danish looking pastry pay $18 dollars. Too pricey the place"], ["Angie V.", "Food is amazing, when it gets to your table...The dinner steak frite is amazing but the service is a little slow and rude. I went for lunch the other day and they wait was ridiculous because they gave me table order to another table that got there after us and ordered the same thing. No apology from the waitress who clearly knew what happened. Yes, lady, other people who don't look french SPEAK french. An acknowledgement of the situation would have been nice but like I said before the service is lacking."], ["Rob R.", "Great little spot for lunch. Food was great and desert was even better. Smoked salmon salad was A+.  Added to my little hole in the wall list."], ["Melissa P.", "This place is all about the food. The service is quirky, yet pleasant and feels more like you're at a large family dinner than a restaurant. The Soup du Jour was Tomato, not one of my favs, so we opted to share the calamari and were not disappointed. A nest of expertly seasoned, crispy, lightly fried, battered rings of tender calamari arrived in a parchment lined bowl. Fresh herbs, lemon and a zesty aioli accompanied perfectly. For our entrees, the Steak Frites, of course, and the Duck confit. I had the duck, and while it is extremely hard to pass on the much-raved about Steak Frites, Duck Confit is very hard to come by in a non-$$$$ restaurant. Upon our entree's arrival my beau was presented with a mountain of glistening hand-cut fries, sliced filet topped with an almost-finished-melting dollop of herbed compound butter and a crisp simple salad.The duck, served with delightfully cooked and un-fussed over root vegetables, arrived with no liquid or sauce to speak of. I was concerned at first, but the thought quickly vanished from my mind upon first bite. Absolute food candy, duck heaven. Impossible to not eat every bite of either dish. Don't dare pass on dessert, take it home at the very least. You can't really go wrong, but the chocolate cake, a divine combination of mousse and meringue is so crazily rich and light at the same time. Definitely make reservations!"], ["Rachel P.", "Perfect date night to celebrate our 3 year wedding anniversary at Cafe Bonjour inside of a strip mall nonetheless! This little hidden gem is just what we were looking for. We did call to make a 7:30 reservation since this is a small restaurant that fills up quickly, so I highly suggest calling ahead if you plan to go at your typical breakfast/lunch/dinner time. We started out with the Warm Goat Cheese Salad which was probably one of the best salads I have had. They split the salad for us and we still had a very large portion. It had warm goat cheese, tomatoes, walnuts, & warm bacon. The warm goat cheese was of course the best part and such a large serving of it was a nice touch. Next came the steak and frites (excellent) and one of their specials which I ordered,  roasted red pepper raviolis stuffed with warm mushrooms and goat cheese covered in a creme sauce (heavenly!!). We shared our dishes like we often do and we agreed since we rarely eat french fries, these would be the ones we would want to splurge on. The steak was on the small side, but very tender and juicy. So of course the best part was the chocolate cake. It is like nothing either of us have ever had, super moist  and rich chocolate cake with a crunchy outside texture. It is almost like a mousse cake. We will be back to try brunch soon!!"], ["Maria S.", "I was only there to pick up some pastries so I can't speak for the food,  but I can say BEST CROISSANTS EVER!I tried the plain and chocolate-filled; both are amazing!The owner was very nice and the place was clean."]], "La Crepe Bistro": [], "Neighborhood Bistro": [["Jeanette R.", "This little hole-in-the-wall is consistently great. Family-owned and operated all the food is made to order. Prices almost double for dinner time but they do offer discounts on Yelp or at the actual restaurant you may ask for a 10% discount card good for every time you come during dinner. Try the lamb shank. The mushroom chicken is amazing (and I'm not a big mushroom fan.)The curry meatballs are also good. I like their julienne vegetables side and the Creme brûlée dessert is fantastic as well."], ["Nathalie D.", "My mom, sister and I came to Miami for the day from Orlando. We were looking forward to eat at l'entrecote, but unfortunately it was closed due to kitchen renovation.. So we searched French restaurants and found this place. It's super tiny, and a small menu. It truly is a hole in the wall. When we came in, they immediately spoke Spanish to us, and I thought that was strange because I expected to practice my French.. The lunch menu wasn't very French.. I ordered a grilled flat steak, with rice and beans. My sister ordered a risotto de mar and my mom had a flounder with salad. When the plates arrived my beans were missing and I had to tell the waitress... She said they were out of beans.. She didn't ask me what I would like as a replacement, but just brought me split pea soup... Which was not what I wanted.. The food was good, but not amazing, and the service was absolutely horrible.. They were so rude to us as we asked questions about the menu.. I'm so upset. It was not a good experience. I would not go again."], ["Diana M.", "Cozy, frenchie and exquisite taste is but the fair description of this beautiful bistro, in which every detail has being thought for the culinary experience.I ordered the Rabbit Stew Provencal the minute i read it on the menu and i was every bit satisfied and grateful that we chose this place!!! My husband had Sautéed Garlic Shrimp .... Impeccable"], ["Franco B.", "Great small place at Coconut Grove, right next to Flannigan's. They have a good menu, always came for lunch and never let me down. The options they offer are homemade and cheap, but not lacking quality. They also have very good expresso coffee."], ["Aylin M.", "Homemade food in the heart of coconut grove. Today I had the grilled chicken with mushroom sauce and with rice. My husband's favorite dish is the fried fish with French fries. And for dessert, I like the cheesecake with mango sauce. Cute outdoor sitting with plenty of fans and great service."], ["Kevin H.", "Delightful! We found ourselves here on rainy Saturday evening and had one of the best meals ever. Started with the escargot which was perfectly prepared. My wife had the salt crusted Branzino while I had the scallop risotto. Both were perfectly prepared! The owner and his staff were all very nice and contributed to the great meal. Highly recommended!"], ["Orlando D.", "Small local restaurant. Good food, good service. Really enjoyed the shrimp fettuccine Alfredo and guava cheesecake."], ["Jeff S.", "Absolutely amazing. A hidden gem tucked away on Bird Avenue. If you are in the area you will not be disappointed. Had the Beef Bourguignon and Grilled Chunasco, both amazing dishes. Don't let the tucked away location keep you away. The food, service and attention to detail are awesome."], ["Peter H.", "The neighborhood bistro in Coconut Grove can be easy to miss but when you find it you will be richly rewarded. I had the lamb shank for dinner last week and it was fantastic. Perfectly cooked and great flavor. I finished with a wonderful creme brule.  My friend had the skirt steak and was not disappointed, he especially enjoyed the fresh salad with the house dressing. He had the mango ice creme for desert.I highly recommend this restaurant which is located next door to Flanigan's in the Grove. I have eaten at the bistro several times and the owners make their guests feel right at home and offer good service. The prices are reasonable and they have a nice patio as well."], ["Ann H.", "We love The Bistro- a family place with fantastic quality foods and someone who can really encloset the values we have alread expecll eqygect."], ["Lazaro E.", "Love this place.. I used to live down the street and never knew it existed. I hate that I live in Pinecrest it's definitely a commute for lunch. My absolute favorite dish is the tempura fish filet with rice. Duck confit was spectacular.. Also loved their shrimp ceviche dish.."], ["Stephani N.", "I try to come here every 2 weeks. The food is delicious, the portions are big and service is good. Some items on the menu change nightly. I always get the fried fish.I love this place!"], ["Noel C.", "This place was recommended by a co worker so I decided to try them out. I am so glad I did. The owners are extremely friendly and very nice !!!! The food was delicious. It is a casual atmosphere and worth the visit. I will return again and again. The menu changes daily so there is always something new to try. Loved it !!!"], ["Jose T.", "After my last review Yoan from the restaurant contacted me on yelp. Because that was a nice gesture, I decided to try to give it another shot. My confidence has been restored. The food is very good and very reasonably priced."], ["Jeff S.", "Expert food with fantastic service.  You couldn't ask for a better experience.  Sea salt whole Bronzino was terrific."], ["David A.", "We have only eaten here once but they say the menu changes daily. We had the lamb shank stew, grilled chicken with mushroom sauce, cheesecake with mango sauce and a cappuccino. I would highly recommend this place."], ["Magnus J.", "The perfect neighborhood bistro! It's small, charming and relaxing! More importantly, the food is consistently really good and at tremendous value for money! Try Curry Meatballs, Ahi Tuna Teriyaki Salad, Lamb Chops, Churrasco or The Pork Loin...In fact whatever is in the board is great. I have never had anything I didn't like and there is something for everyone at very very reasonable prices! Just try, they won't disappoint! Oh, I'm a sucker for their guava bread pudding."], ["Lila W.", "This is homemeade food cooked by a family of Cubans and Colombians. The owner studied atnCordon Bleu. In the last few years he has gotten help, and hands down his menu has.the best International flair in Coconut Grove for lunch. The best part is the cost."], ["Eldon L.", "I come here for work lunch about once a week.  I have never had a bad experience there.  Best pork chops, fricasse, beans, etc.  great prices as well."], ["Brian M.", "Best casual restaurant in the Miami area, if not all of Dade co! I have been here at least a dozen times and have gotten the Tempura Filet if Fish and fried potatoes every single time. I know I need to try something else but I love the fish. Best \"Fish and Chips\" outside of England!"], ["Carol M.", "Great food, very reasonable prices and excellent service every time! Best entree is the Salmon with leek sauce. French-style cuisine. Free parking in the Grove is a plus. Try this place - you will not be disappointed."], ["s r.", "delicious! went for lunch after reading reviews on yelp. very easy to order menu. all apps 6.99 and lunch 7.99. had pork loin with mustard sauce and jasmine rice. huge portion. absolutely delicious!!! very very high end food. reminded me of ortanique. we ordered the guava pudding, like a bread pudding, for dessert.  saw the waitress take it out and cut out our portion. absolutely homemade. sooooooooooo good. i will remember this meal for a very long time.  its a husband and wife couple also which is nice.  he's the chef. she's the waitress. loved it!!!"]], "La Fresa Francesa": [], "Buena Vista Bistro": [["Katerina S.", "Yes! I had taken like a 4 year hiatus from BVB but it's seriously as good as ever. I was so surprised to see how much they've expanded. Michael is an awesome waiter. The corvina is my absolute fave. The French fries are soooo addiciting and I could eat the entire.thing. Just great all around French food. Very authentic and amazing prices ($19 for a huge piece of fish and a side)! Go!"], ["Sky B.", "We ate here a few nights ago and it was amazing. The waitstaff is super super sweet and helpful and the food is just amazing. We had the grouper, veggie curry, endive salad and an apple tart. All of these dishes were super delish. We ate in the garden and it was lovely. I would highly recommend this place and will definitely be back soon."], ["Ilia M.", "Best steak tartar in Miami!!! My husband and I just came back from Paris a month ago and we were craving French food. He brought me here and it did not disappoint.  Besides the steak tartar we also had the mussels and fries. They were also good."], ["Lindsay B.", "Ate here yesterday and everything was simply delicious. I wasn't expecting such good food given the area it's in. Definitely a hidden gem. It has nice outside seating, minus the traffic flow. I had the chicken curry which was absolutely amazing. My boyfriend got the lunch special which came with choice of soup or salad, entrée and dessert for only ten bucks! This was a total steal because the entrée itself was huge. He had the salad and pork chop. The salad was good and had a simple homemade dressing. The pork was cooked perfectly and the dish was extremely filling. Total comfort food. For his dessert they brought rice pudding, which was the best I've ever had. I am rating them four stars instead of five because the server didn't bring me my side of rice pudding to go that I asked for(which I was very sad about lol) and because of the location and lack of parking. I would definitely recommend this restaurant regardless, the food was perfect and they had fair prices."], ["Natalie I.", "I'd say this is a neighborhood gem. We have wanted to check it out for awhile and glad we got to this weekend. We only had an hour to eat because we wanted to get home to watch the heat game but we really wanted to try this place. Because the food looked so yummy! We were seated quickly as it was a rainy Sunday afternoon. The waitress was great. She knew the menu, had the specials memorized and was able to answer all our questions. One of the most compatent and freindly waitriss I have encoutered in awhile. I would say this is french american food and i just love sauces that everything came in. I got the duck special, i love duck most places do not do duck right. I don't know why duck is so hard to cook. I had amazing duck in China and then truly epic duck in Juno beach however when I get it in Miami its always a fail. This place did duck right. It was moist not greasy and the sauce it came in was yummy. My guy got the mussels he loved them, and the creamy white sauce it came in.Sadly we didn't have time for desert due to the heat but we will be back."], ["Tony R.", "We tried this place for the first time about 2 years ago. It was quite good but out of our way. But, we recently tried it again and had the duck confit. Another reviewer said it best. \"Poorly fried chicken.\" Although confit is to be crunchy on the outside, it must be moist, fall off the bone on the inside. This was neither. The side of potato was ok. Glass of rosé wine: perfect.That's is all."], ["Lou D.", "We biked over to Buena Vista on Mother's Day and had the sweetest afternoon. I had a lovely glass of bubbly while dad had French Toast and Rock Star baby enjoyed an omelette. As always, staff and the musicians treated the baby like a Prince. The vibe was relaxed and mellow and service excellent. Both boys loved their food, and I enjoyed the whole scene. I love the minute my bike leaves the beach and I'm over on 2nd Avenue. Refreshing    to chill at a spot absent of tourists and South Beach robots."], ["Stephanie B.", "I only rate 5 stars if I know for sure that I will be back somewhere, and quite frankly I can't wait to come back to buena vista bistro!!! My friends and I went last Sunday morning for brunch and the whole experience was just easy, enjoyable, and delicious, nonetheless.So basically I recommend valet parking which is in front of mandolin aegean bistro (less than a block away, not a long walking distance). It's like $3-$5 and takes away the hassle of looking for parking on the street or getting your car towed. Unfortunately we saw someone's car getting towed so don't risk it! Just valet. Anyways, my favorite part of buena vista bistro was the live music!!! It was a 3 man band with a piano, saxophone and cello. We chose to sit outside and enjoy the nice weather. We decided to start with mimosas and ordered eggs Benedict, Spanish omelette and the French toast. I can't begin to tell you how delicious the French toast was. I've never had anything so perfect in my life lol. It was like toasty on the outside and soft on the inside. It wasn't overwhelmingly sweet or drenched in maple syrup- it was just right. The fruit on top added the final touch. I had the Spanish omelette and it was delicious! In my opinion, it's really hard to mess up an omelette but this one is really worth trying. It had onions and peppers and came with a side of potatoes, sliced tomatoes, and toast. It certainly was a large amount of food, lol. I didn't get to try the eggs Benedict but my friends devoured it off their plates and said it was delicious as well. The service was good but slow towards the end. Good friends and good food... It was a perfect morning!"], ["Jen C.", "Delicious. This was my first real meal in Miami, and it was so great that I don't want to move from my temporary lodgings. The steak onglet and the famous (\"famous\"?) chicken curry were fantastic. I got my food to go, but hung out and had a beer at the bar (not a full bar with liquor, mind you) and watched my food prepared through the cutout between the kitchen and the bar. Everything was delicious. The ingredients and technique worked for me. Nom.----------I somehow didn't submit this review in late 2012, when I wrote it.  Here it is.  It's all still true.  They get their bread from the Buena Vista Deli, which I also love.  Definitely worth a visit."], ["Renier C.", "I still remember the first time I had dinner here, years ago, and it's safe to say every intimate dinner since then has been more than memorable each time. The sea bass is still to date one of my biggest recommendations on the menu and I have yet to hear from an unsatisfied diner. I just wish I didn't smell like food when I leave, alas that is just part of the charm of a bistro this size. Nonetheless, just pack a small bottle of febreeze if you have plans to go out after your meal or sit outside if available :-)"], ["Laure M.", "Buena vista is a great place for lunch or diner. Easy and authentic. Portions are good and food is very tasty. They also have delicious fries :)"], ["Airam G.", "Five stars for the food and the waiter service (best quiche I ever had). ZERO STARS FOR THE TYRANNICAL MANAGER-DIVA MAN. I don't know the manager's name, but WATCH OUT for the tattooed, Dolce Gabana sunglasses wearing, and egotistical manager-diva. We went for lunch on a Sunday afternoon after the place we were going to go to was unexpectedly closed. The Buena Vista Deli was at capacity, so we were told to sit at the Bistro and that we would be served there. Cool. So, we walk into the Bistro and have a seat. Within seconds we are served delicious, ice-cold water by the greatest waiter, a beautiful man with a heart of gold. This kind man probably has a family, and he is working hard to feed them all. Every day. Working hard.HOWEVER, at this establishment there is also an evil, bully-man, tyrannical MANAGER-DIVA. This roadkill of a man was talking down to the poor waiter in front of the customers for \"not working well.\" This waiter is an angel. He doesn't know English well. He's timid. But this jerkface was humiliating him for \"not working well\", when in reality he was the most gentle and loving and attentive and lovable waiter ever. He meanly told him that he \"couldn't believe what he was doing\" and that \"he could go home if he wanted to.\" I wish I could have taken him home and away from that hell-hole of a restaurant. Not only did the scum-dump manager make this little precious man feel bad, he also had the AUDACITY to make sarcastic remarks behind his back and HYPOCRITICALLY be falsely nice to the all the other hipster-rich employees and customers. This manager is the spawn of Satan. Literally. Nobody deserves to talk to such a beautiful and gentle man down like that. Especially such an ugly person who probably came from NOTHING and is bullying his employees. I recommend this restaurant ONLY for the food and for the waiter that I was lucky enough to meet. I, however, DO NOT recommend the manajerk. 10 out of 10, do NOT recommend."], ["Bernardo K.", "Just had dinner, the service was ok as well as the food, we had the bouillabaisse and it was like a campbell tomato soup with everything they could find in the kitchen, the grouper was the best dish.For desert we order the chocolate mousse ok, the apple tart was horrible heated up in the microwave made everything soggy o and the homemade vanilla ice cream was actually a milkshake you could eat it with a straw."], ["Meryl L.", "I've been coming to BVD for a little over a year now since a co worker told me about it.I love this place for a few reason:1. They serve the local panther coffee and I'm always a big fan of locally owned businesses supporting eachother. 2. Dining out in Miami, if you want good quality food is not cheap and for what you get BVD is very reasonably priced. 3. The Quiche Combo! This is the best bang for your buck. I love love love the mushroom and goat cheese quiche and I usually get the tuna Niçoise salad. Both wonderful. 4. The ambience- they have a quaint little deli style inside and a nice shady outdoor patio. Though if it's really hot, sitting outside is your best option. The inside doesn't have central air and can get a little hot. Only 2 complaints;1. The wait staff can be a little... Unfriendly, we will say. They are not very attentive and sometimes have to be reminded to give you more water etc. Not a huge deal breaker for me as it's only sometimes. 2. A lot of their breakfast items, although wonderful, are pre made. So if there is something you don't want- you have to suck it up. I have only ever come for breakfast/ brunch, never for dinner but I'm always pleased. If it's busy- you'll be seated fast. Tables turn quickly!"], ["Monica S.", "My favorite Sunday brunch goes to BVB. Mostly, the french toast alone makes the menu (and brunch) as amazing as it is. Simply put, there's no other restaurant in the world that can make french toast as good as the BVB version. The photo I snapped of the meal only begins to suggest what's in store for your senses, but with each bite of sheer decadence, it's total bliss. The other breakfast favorite is their Spanish Omelet. As far as eggy creations go, this simple and veggie packed item is perfect as your savory counterpart to that sparkling mimosa. Out with your dog? You can enjoy brunch from their outdoor covered patio, it's completely shaded and you'll likely find most diners enjoying their fare from one of the many tables. So yeah, if you're heading to BVB, wait for a Sunday afternoon to pick from the best brunch (you won't be able to catch the french toast on any other day)."], ["Fiorella B.", "I had the crab cakes and the scallops and both were amazing! I didn't like that much the basmati rice cause was little tasteless but other than that everything was perfect and good service!!!"], ["Howard Z.", "Great little place near my friends place.  In good Miami fashion, it was too hot and humid to sit outside.  All of the food is great quality; I would definitely think this place as a neighborhood hot spot if you haven't been here yet.  Would definitely take visitors like me to visit!"], ["Hernani I.", "First time here and I was really impressed.I had corvina fish with mashed potato ( delicious).Also the waiter was totally confindent about the menu, specials and suggestion and provided us a great customer service.I definitely recomend!!!"], ["Julien M.", "A good and real french bistro in the heart of the design destrict.You will enjoy a large choice of wine and and a great menu.The lamb is delicious !"], ["Bella S.", "Best corvina and sautéed octopus I've ever had! I always order the same thing because it is that good!!Wouldve given  5 stars but the outdoor seating area feels as if you are 'sitting in the street' and I love outdoor dining gems! The service is outstanding and the food, I keep going back after 7 years!!!!"]], "Cena by Michy": [], "Delices De France": [["Courtlani M.", "Ham and cheese. Yes please. Guava.  you will want to botha'. Eclair. you must dare. It is hit or miss for the line situation but worth the wait."], ["G C.", "This is, hands down, the best Bakery in Miami, French or otherwise. Their tomato basil quiche is light and fluffy while still just rich enough...mouthwatering. The almond croissants are my weakness, with or without chocolate. Just the right amount of sweetness, never overpowering, and always flaky. Fruit tarts are amazing. Baguettes are delicious by themselves or with a small pat of butter. The owner, Patrick, and his staff are friendly and efficient. I can go on and on. Can't stay away from this place!"], ["Angel R.", "Omg, what a great french bakery. Everything and I mean everything is great. Brrads, croissants, coffe, sandwiches...... all great"], ["Linda A.", "It's about time I review this place. I love it! I started coming here a few months on the weekends with my boyfriend. I usually get there around 10am on Saturday and Sunday and it's always packed. My bf and I always have the cortadito with a chocolate croissant and cheese Danish. The raspberry cheese Danish is what originally got me hooked but the apricot cheese Danish is just as delicious. The guava croissant is magnificent as well. I've also started going during the week in the mornings around 9am/9:30am and the line is not bad at all. During the week I've been able to try the mini cheese Danish, mini chocolate croissant and mini cinnamon roll. They cost about $1 and I think it's the perfect size for a quick morning snack. So far all the pastries I've tried here have been wonderful. The only thing that was kind of meh was the \"colada\" I ordered one time. It was kind of flat and bitter. Tasted like American coffee that had been sitting in the pot for some time. But the cortadito is always on point. Would definitely recommend this place."], ["Adrienne L.", "They are awesome the service is ok. But the almond and chocolate croissant are so good. I venture to say one of the best croissants I've had. If, I'm on a cheat day than I'm here. I would like to try one of there sandwiches, so I will return."], ["Stephen H.", "Guava croissants are delectable!  Pastry part isn't the best I've had but their guava filling more than makes up for that."], ["Ruben N.", "French bakery with all the goodies you will find in any cafe in Paris. The baguettes are so fresh and with the perfect texture."], ["April A.", "Utterly amazing croissants and quiches! I've had my share of almond croissants- I originally discovered my love for them in Paris and I would scavenge Miami in search of a reasonable comparison... Not until now have I found one and it's at this French Bakery! So yummy. I also shared a spinach croissant with my friend and we both enjoyed it quite a lot. I recommend their Cafe au lait if you love Cuban cafesito. It's delicious."], ["Tyler L.", "I love this place! The customer service is warm. The food smells good, and the atmosphere is relaxing"], ["Lena S.", "My favorite place in Miami...Coffee, desserts, breads are delicious. Long lines at times but worth it."], ["Charlotte H.", "This place is everything! It never fails me! I always get the baby tuna on baguette with a chocolate croissant. My bf loves the Orange juice here along with the black Forrest ham sandwich. I come here a few times a month. Tré magnifique!"], ["Patrice A.", "Moved to Palmetto bay 2 years ago. I literally was hooked the first time, and I go to FB at least 3 times a week, every week. Some of the reviews are very confusing, and I don't know what their expectations are, and I have never experienced this rudeness some people note. They turn out fresh sandwiches and delicious pastries in no time, and almost all of the workers know my name and how I take my coffee. The tuna and prosciutto are my favorite sandwiches, and the turkey and cheese, mini almond and Danish are always perfectly fresh and delicious. Everything only costs a few bucks, and if there was a negative, it would be that they can get very busy in the morning, the line out the door sometimes, and the place is kind of small (but I get it: 1 they are packed for a reason and 2, it's a good business model, less mess, less maint., less liability.) I'm a huge fan and will continue to frequent the FB."], ["Sara E.", "Since it was my first time here, I decided to order the almond chocolate croissant, since that is their specialty here. My croissant was topped with white powder sugar and was filled with a sweet Custer and milk chocolate.  There are plenty of bakeries in this area but this one had great service, very clean, and cute inside! There are also little tables to sit at outside. Plus the women who were working gave great customer service."], ["Ismiray G.", "EVERYTHING IS GOOD.  That's it. Croissants, best tuna , best madelines, best coffee. Great customer service experience."], ["Ivette B.", "So glad I finally tried this place! The croissants were delicious! I tried ham & cheese, almond, guava, and chocolate-almond. All were on point! Also tried the cafe mocha (I try this everywhere) and it was by far one of the best I've had. Must be the Belgian chocolate they use.  I will return here many times."], ["Nauman M.", "Best French bakery in the neighborhood. Never a disappointment. Not to mention the coffee is great here too!!! Chocolate mousse cake is a must try"], ["Kim O.", "Yum!  Had the chance to try 2 of their signature sandwiches today and we really loved them. We started off with a croissant because we were STARVING!  It was ok. Not as flaky and crusty as I had anticipated. It kind of made me scared about the sandwiches but I was worrying for nothing. We split the prosciutto with mozzarella and the Parisian which normally has salami and Brie cheese, but I substituted turkey for the salami. Wow. The prosciutto is served hot with a pesto like spread and the most yummy mozzarella I have ever had. Loved this sandwich. The Parisian is just as good but served cold. I think it would be even better served hot. It has an amazing Dijon sauce and the Brie is so,yum. I took most of it home and am looking forward to toasting it up tomorrow for lunch!  We didn't try any of the cakes but they looked super rich and very cute. I bet they are amazing too!"], ["Mitzy R.", "Great food quality prices are reasonable to high. Service it's slow and the staff is not not too friendly but it's worth it. My advice is to order carry out and enjoy it somewhere else. Their sandwiches and pastries are absolutely fresh and taste delicious. Sandwiches ate big enough to share if you are not hungry. The OJ is squeeze while you wait."], ["Ariana C.", "Best French bakery I've encountered in Miami. The almond croissants are a must. The quiches are delicious. The fruit tarts, the orange juice, everything is! The staff speaks English, Spanish and French and they offer great service. 100% recommended."], ["Michele L.", "It is so nice to have a french bakery in the area let alone one that is totally authentic.  I've been going there for a few months now and I have never been disappointed.  Actually each time I go, I end up trying more items.  The breads, baguettes, cakes, tarts, croissants and quiches are all delicious and what you would expect from a quality french bakery.However, it is a bit chaotic inside, so you may jockey for a place in line.  Also, I have never found a server that is pleasant.  I go back in spite of this because this is the only place like this in the area."]], "French Bistro": [["Jaime R.", "Excellent food, service and ambiance. The salad and the bread are unforgettable. The service is perfect as the location (right across the Falls shopping center)"], ["Supawat J.", "The food is delicious, good service.I love the crab cakes. Quiche is very good too.The location is closed to my house. Lots of parking space."], ["Aimee R.", "I love the quaintness and decor of the place. Service very attentive. I went here for lunch and had the Frenchy Sandwich. The French bread is sooo soft. Very tasty. Filling but not over the top. Parking is plentiful and right In front.  The price is great for lunch and moderate for dinner. This restaurant has been here a long time. I just love coming here."], ["Harold R.", "The food was ok. Wished they had more french cuisine. Seems like they mixed Argentinian with French. Croissants would be nice. Not even that. Service was good so that's why the 2."], ["Ashley W.", "Absolutely horrible!!!!! Had a groupon so decided to try this place out. Atmosphere was cute but food was disgusting!! Potatoes were flavorless, veggies frozen with no seasoning and fish was completely inedible! Stay away!!!"], ["Kat A.", "This is a small and cute little spot with lots of variety of foods. I ordered a crepe and it was great! Great for lunch specials. The service is great. Everything made you feel right at home. Food was also fresh and served quickly!"], ["Michel V.", "Don't be fooled this place is not a French restaurant !!! The owner is Argentinian and the menu is all but French. If you look for a French restaurant go to cafe Pastis in SunsetStaff is nice, menu is reasonably priced but not French"], ["Brett F.", "Not so good , service sucks and food average .. Will never go .. Bad experience and bad day"], ["Nicholas J.", "Just because this restaurant is run by an Argentinian with experience in Italian cooking doesn't mean it has to bad French food. And as another reviewer pointed out but is incorrect, the vegetables are not canned. They are horrendously overcooked but lacked the over salted and metallic taste of canned green beans. Still terrible. Fruit is far from ripe. Chicken is tough and tasteless. Salad is like the salad you'd get from a typical Cuban restaurant (iceberg, unripe tomato wedge, balsamic vinegar on the side). Nearly $100 with tip to feed a family of four, everyone left hungry and dissatisfied. Le Provencal on Coral Way, that is where you spend $100 and are happy. Bistro Foly on Old Cutler Road in Palmetto Bay, another $100 well spent. This place with their rehydrated mash potatoes (as in just add water, from the box) on an adult meal... inexcusable.  Escargot was okay. Mozzarella sticks were okay. Pink sauce on the pasta was terrible. It would have been better from a jar.Don't go here. You would do better at the checkers in the same shopping center. If you want French, Bistro Foly is great and nearby. Le Provincal is also great, farther away.Side note, the place way clean and nice enough, service was acceptable."], ["Nina V.", "I love this place!! The food is always delicious! I am sure to visit them on Thursdays.  Why?  Because the chicken hunter is amazing! My favorite dish by far! Also,  Thursday is when it is on special!  The servings are huge and way worth it.  The food is FRESH.  The service is always great! It's a little hole in the wall and family owned if I'm not mistaken.  This is one of my favorite places I found randomly, and I will recommend this to anyone that likes great food, prices,  and great service!"], ["Scott S.", "This place is not French. Very far from it. As another reviewer said it is Argentinian. All that aside the food was terrible. They serve canned vegetables and mashed potatoes made from powder. Not sure how this place is even open. Staff was nice though."], ["Bee R.", "Excellent service. Great food. Me and my brother went to french bistro with one of our friends for the weekend  brunch.  We live 5 minutes away so we didn't call to make reservations. We were greeted by the  manager and we were seated pretty quickly. Our waiter brought us the lunch menu. We asked for the brunch menu but the manager apologized and told us that the only day they have brunch is on Sunday's.  We were a bit disappointed because it was only 11:30 and we were in the mood for eggs and coffee. We  apologized and decided that we would go somewhere else and return another Sunday to french bistro. As we proceeded to leave the owner came after us and asked us to stay and told us that the chef would able to accommodate us with basic breakfast items such as  omelets and pancakes. We were happy with that  and went back in. My brother ordered chicken omelet and our friend ordered the Mediterranean omelet. They had a crispy calamari salad as the daily special and I ordered that. The food came out pretty quick. The quality was great. Both omelets came with roasted potatoes that were delicious. Also included warm french bread. My salad was arugula and radishes with a tangy dressing that complemented the calamari perfectly. I suggested french bistro to many of our friends and we will certainly go back."], ["Carolina V.", "I've been going to this little hidden gem for many, many years and it saddens me to see that some of the other reviewers irresponsibly almost with some sort of weird personal vendetta (?) leave terrible reviews like the one about the bread in the basket not doing their share of research as the restaurant was under different management back then and in no way reflects the current restaurant nor how its run. The place is more of an International Continental Cuisine, it has food from Argentina, France, Cuba and Italy. The food is simple, flavorful and high quality. The atmosphere is casual, warm and inviting. I have never had a problem with any of the items I've ordered. They use fresh ingredients, maybe not like the over flavored, high sodium ingredients now commonly rampant in most restaurants, but its refreshing for food to taste like its originally meant to. While I'm personally not a fan of the vegetables, the sauces such as the mushroom sauce from the Chicken hunter are great. Restaurant owners can't taste every dish and sometimes chefs occasionally drop the ball, but I have no doubts that if you bring up any complaints to the manager he/she would not only be grateful, but would also make the necessary changes to please his clientele. For the price, the restaurant is exceptional. And its also refreshing to still have these types of family run businesses around that should be supported rather than the common chain restaurants that microwave their food and mask flavor with salt."], ["Dennis A.", "My to-go spot for lunch.  A good home cooked meal from a family owned business. When choosing between a quick bite at a fast food rest or chain , this place is the way to go.  I usually call in my lunch special and it's only a few dollars more then fast food.  May not be the date night spot but a good spot for locals."], ["Adela A.", "Had dinner here with my family on the last day our Groupon was expiring.  I will never eat there again. Where do I begin? First and foremost: this is not a french restaurant. Frankly I don't know what to call it, nor do I care....Faux french onion soup, check. Instant mashed potatoes, check.  Pasty, bland pink sauce on seafood pasta dish, check.  Foul tasting marinara sauce on my son's gnocchi dish, check (he had a stomach ache later that night). Tough as nails ultra thin grilled chicken, check.  Drastically over-cooked side vegetables, check.  Stale lemon meringue pie, check.  Check, check, check!  When the check arrived they had tacked on an automatic 15% tip for a party of 4. Waitress said it was the owners order since it was a Groupon.  Too bad, I would have left my usual 20% tip since the waitress was not to blame for the lousy food and the service was good. As a previous poster stated, dinner at Checkers in the same mall would have been so much better!"], ["Eddie L.", "Yeah... NO!  This place is small and quaint!  Which is fine!  But right from the start with the appetizers you could tell that the quality of food was below average.  The lunch sandwiches were just sandwiches.  Nothing worth coming back to this place.  True.. I haven't had everything on the menu, and quite frankly they might make a signature dish that will knock your socks off.. But there are plenty of other places worth eating at that are better all around!"], ["Earl V.", "I noted there were mixed reviews to this place so I decided to give it a try. Food was below average, they do serve canned vegetables, I ordered sea bass which was bland but disguised with a lot of sauce poured on it. Waited a long time for waiter to pay my bill, finally had to get up to deliver bill/credit card to waiter as he chatted with friends. A repeat visit is unlikely."], ["Laura S.", "Perfect place for a girl's night out! Amazing food, amazing service and all at an affordable price. I love this restaurant in every possible way. If you expect snobby French, think again! The restaurant is unassuming, cozy, and welcoming. True hidden gem!I think some of the reviews on here that are negative, expect upscale fancy dishes, again, they're much more casual and offer home style comfort food. Simple, yet with layers and layers of flavors. Highly recommend!"], ["Bob S.", "I thought I had found a good, consistent nice little place to eat.  Food was good not great with a varied menu.  After 3 visits that went well enough I wanted to take my daughter who had not been there and I guess I raised her expectations we'd have a nice lunch experience since I'd been there 3 times already.  Things did not go well.  We tried to order two different soups which they said they were out of including the French onion soup.  A French bistro running out of a signature french soup?  Apparently we just needed to wait 5 more minutes to order it because other tables were getting that soup soon thereafter.  After the waiter took our order we never saw him again.   It took a long time to get a couple salads, the place only had 4 tables occupied. Nobody checked on us except to bring the check.  I raised my concern about the soup issue to a server who blamed everything on the waiter that we never saw again and apologized.  Service was lacking that day and the salads were mediocre.  Not sure we'll try it again."], ["Carlos B.", "This is a small casual cute restaurant! They have the best lobster bisque soup in Miami..however, it is only served on Friday,Saturday, and Sunday only! Very good prices, good quality food, and very nice attentive service!"]], "La Tour Eiffel": [], "Brasserie Azur": [], "Le Bouchon Du Grove": [["Melissa S.", "I've been wanting to try this place for quite some time and finally had the opportunity to brunch here the other day. It's an adorable French cafe in the Grove. The set-up is half indoors / half outdoors but it's an open indoors so you get plenty of fresh air. I'm giving it four stars because they allow smoking outside and because of this open set-up and the fact that the place is intimate, you can smell the smoke in the entire inside of the restaurant. Though I typically want the authentic foreign experience at a restaurant, this was too much for me. Otherwise, the place is perfect. For brunch, I shared the banana pancakes and the eggs Benedict in addition to having a piece of a chocolate croissant. Everything was absolutely delicious. In particular, I thought the banana pancakes were out of this world. How do they make them so good? Why can't I make them like that at home? The brunch at Le Bouchon Du Grove is extremely affordable. I've even heard that they give you free mimosas on Sundays! The dinner looks more expensive but I'm sure it's also delicious. The service here is great. The place is so small that you're always near a waiter. I also like that they left a carafe of water on the table so I can refill my water glass to my heart's delight. Additionally, the decor is adorable French vintage and makes you feel like you're in a real French cafe. Definitely check out this place for brunch!"], ["Raydel C.", "It's nice to know that after a long night in hospital with a sick nephew, I can walk into a restaurant on thanksgiving that was just about closed and finally get a bite to eat. The service was great and the food was amazing!!!"], ["Jaycee G.", "Get the  Roasted Rack Of Lambwith Provence herbs, white beans and basil pesto. Lamb gravy. Amazing!"], ["Clari C.", "I was really excited to try this place after all the great reviews in Yelp and reviews from friends, but it was not big hit for me. We got reservations for 4 on a Saturday night. We were first greeted with a free glass of champagne. Nice! (I believe this was because a Jazz Fest event going on in The Grove). We also got a basket of french bread and butter. The ambiance was nice and somehow romantic but very hot. All windows and doors were open and it was very warm out. Wear something light and refreshing if you are coming here on a warm night. This was in November so I can't even imagine dining here during summer time. My husband ordered a bottle of wine (Pinot Noir) and unfortunately it was nothing special and   it lacked body. Our waiter strongly recommended for appetizer the Escargots (snails) and honestly they were OK. The texture is gummy and it lacks flavor. Nothing you really need to taste in life!For my main entree I ordered the New York Steak and it came with a red wine sauce that was not tasty at all. I ordered medium well and I definitely got well done. French fries are frozen fries, nothing special. Definitely not a $25 plate. Overpriced for the quality of what you get!My husband ordered the Roasted Snapper filet and it was crispy, salty and just delicious. I didn't get to try the ratatouille but it looked good. Note: It's a small dish; thank goodness I didn't finish my steak and my husband ate half of it. My friends shared the Mussels and they really liked them. I tried them and they were good and has a nice flavor. It was a big portion good for two people. For dessert we ordered the Creme Brulee and what a big disappointment. We were expecting something creamy and with some taste of vanilla but it was nothing like that. Not sure about coming back to this place. Maybe for brunch! Maybe!"], ["Wendy L.", "Come here if your looking for something a little different for breakfast, lunch or weekend brunch!! This is one of the best places I've been to in Miami for brunch. The portions are perfect and the prices are reasonable for the quality you get. You will love it here if you're a fan of French food or just love breakfast/brunch items like me. I loved their raspberry pancakes. They use fresh raspberries, balancing tart and sweet. They cooked over medium eggs perfectly and their breakfast potatoes are standout. Get the French onion soup, especially if you love cheese--they definitely don't skimp on the good stuff! They also have a huge wine selection. The decor is pretty rustic and it's open to the outside, so it's pretty warm inside during the summer, but not uncomfortable to the point where you are sweating during your meal. They have a bunch of overhead fans which helps. It's definitely a cozy little place and their bathroom is super cute, but there's only one stall available. I was happy with the service here, the food was brought out at a reasonable time and our bread basket was refilled."], ["Jenny C.", "I have told this story to a few close friends, and now I will share with the whole world: the chicken fricassee once saved my life. Many, as in 4, years ago I went to dinner with a group of friends here. Right before we went I got very sick off of 2 blue moons (perhaps a small sign of gluten intolerance which I refuse to investigate) and almost canceled on dinner. Well, I soldiered up and didn't plan to eat, but ordered this just in case. When it arrived, the clouds parted in the sky and the sun shined down upon me. I actually heard God whisper, \"it's alright child, you may eat now.\" I happily indulged in the feast before me and felt nothing but wonderful afterwords. Every time I come back here it cures ailments I didn't even know I had.Protip: skip their brunch and just do dinner. Service is slow as it is and it's really nothing special unfortunately."], ["Paul W.", "What an unexpectedly good find this place was!  I had a friend visiting from out of town, and we attempted to hit Greenstreet for brunch on a recent Sunday; The wait for a table was about an hour, so we decided to stroll.  Though I'd passed Le Bouchon Du Grove dozens of times while entering Sandbar Grille next door, I'd never actually checked this restaurant out. We had a look at their menu and decided to stop.Know that the seating at this restaurant is a bit cramped - the tables for two seem to be tucked into spaces behind doors, in corners, etc. and if you select one of the tables for 4 to sit at, they will put another couple of 2 next to you, seated about 2 or 3 inches away so there's little privacy. This happened to us, and luckily both our groups had a sense of humor about it and managed to carry on our own conversations, but I'd not been in a seating situation this cramped since I visited New York City.Once we were seated, a server was there right away with 2 complimentary mimosas for us, a basket of bread and butter and a carafe of ice water.  I ordered the ham, mushroom and cheese omelet with roasted potatoes, my friend got the salmon tartare.  Both our meals were very good, we were happy and the service remained attentive throughout the meal, but I would note that my potatoes were quite salty, and the omelet was a touch on the salty side as well.  That said, I was satisfied with the food overall and would come here again."], ["Sally R.", "Came here for the first time on Friday (Memorial day weekend 2015) around 8:30pm...We were thinking of catching a movie but we had some time to kill so we decided to take a walk in the Grove and try a new place for us since we always go to the same places.  We were thinking to get a few drinks since we wanted to make it to a movie so nothing really big...First, we stopped at La Gamba, a Spanish place, and we were not accommodated so with that bad incident in mind we took another chance and went across the street to Le Bouchon.  Thank God we did because we found a jewel!!!! They were not only very friendly and accommodating but the food was excellent even though the place was packed!!!   In my opinion, that is a sign of a good restaurant with a talented chef. So,  we got a table without any terms or conditions (unlike the previous place) and we were lucky to get am amazing waiter,  Sebastián!  He was so great that we decided to try some food....  It was so delicious food and such a fun atmosphere that  we stayed for dinner and forgot about the movie. That's what I called goooood! The mussels with fries were delicious (20$).  They have an extensive menu with great seafood and meat selections in addition to the daily specials.  They also have a nice French wine menu and great desserts. Great service,  delicious food,  great atmosphere and No rules or conditions to get a table. Everyone was friendly and they even spoiled us when we were greeted by our waiter with a glass of  an aperitif (I think it was some type of Prosecco) that by the way it was delicious.  Great way to stimulate our appetite!  The way the tables are arranged in this restaurant makes it very easy to make friends with the people on the table next t you. So, you have an option to be romantic by getting a table right by the two big opened doors (a little more private) or have fun by getting a table inside and make friends with other customers. up to you! Either way you should be able to enjoy this place. If you are in the Grove and want to experience some French cuisine and wines with some great service this is your place and Sebastian is your guy. The menu is not cheap but the food is delicious and the experience was worth it. I know we will be coming again very soon!!Merci à Le Bouchon! Santé!"], ["Alessandra P.", "I have been here twice for brunch and it's good.It does make you feel that you're in Paris because in Paris the restaurants looks like how Le Bouchon, which is tiny. I had the eggs benedict both time and it's worth it. There are times that the service does take long. But it's worth the wait because the food is great and you will not be disappointed."], ["Chi D.", "I love Le Bouchon Du Grove, just saying the name makes me feel fancy! Haha, but I have been here a few times for breakfast and I love it. For some reason the decor reminds me of New York city, it's so cute. A few dish you should try besides just pancakes and the regular stuff are  Egg Benedict (only on the weekend), Cajun Omelette with Shrimp (this dish is awesome if you are a sea food lover), or their Grilled Salmon Salad. Everything tastes great and reasonably priced. If you're in the mood for some sweetness, get a Chocolate filled croissant, I can guarantee you'll love it! Service is a breeze, very attentive and polite! I'd highly recommend it if you are looking for some delicious breakfast with style. ;)"], ["May A.", "Walking in, you are immediately attended by a hostess who seats you. She seems nice and sits you within seconds. The restaurant is smaller than the average and the tables are very close to one another. Walking to your table, may be difficult if 2 people are walking in the same aisle. The restaurant has a bunch of doors that face the street and they are all opened. Making it very hot if you go during the day.     We came for brunch on a Sunday for a friends birthday. Once we were seated, each of us received a complimentary mimosa. Great start! I ordered the 2 eggs with canadian bacon and potatoes, as well as the french toast. We didn't have to wait very long to receive our meals, maybe about 15-20 min, and the place was pretty packed. The food itself was very good, and the french toast was fluffy. As of now, I was having a great eperience.    The waiter overheard us talking about my friends birthday, so he told us, \"Oh you should've told me it was her birthday, I would've brought you a dessert as a courtesy. Would you like for me to bring you a dessert with a candle?\". We were full by this point, so we politely declined. He asked us again, \"Are you sure?\". We replied by saying, \"Yea its fine\". He said, \"We always like to give our customers a dessert for their birthday\". He had already asked us various times, and since he said it was a courtesy, we decided to accept. He brought the dessert, a chocolate mousse, which was very tasty.       It came time to pay for our meal, and we saw that the dessert was added to our bill. We thought it was an error so we told the waiter about it. He told us that he never said that the dessert was for free. Since the mimosas were for free they cant give us the dessert for free. My mother and I both told him that we understood that he meant it would be for free. He again said, that he never told us it would be for free. By this point, I was frustrated because he clearly told us it was a courtesy. It wasn't just me who heard him, but everyone else in my party did as well. I honestly felt lied to, because he kept insisting us to get the dessert. If it was up to us, we would have never even gotten the dessert!     Overall, the food was great, there is no denying that. However, the service I received from the waiter towards the end was unacceptable."], ["M. T.", "My favorite Parisian restaurant in all of Miami. Love the warmth of attention one receives from the waiters, and above all the quality of the food. You cannot go wrong at Le Bouchon."], ["Elaine Z.", "Cute French spot in the grove..do not put off by the complete lack of service by a host or hostess. I was tempted to leave when I came to Le Bouchon and was not received by anyone, instead standing in the doorway/front of the restaurant for probably ten minutes and being completely ignored. No one came out or even indicated for us to come in. I'm hoping this was a one off day even though they did not seem busy and had tables ready. We finally got in when a patron after us went inside and almost demanded service for both of our tables.Now on to the food - I had a tasty red pepper omelette and my boyfriend had a Cajun shrimp omelette. Both were good and we enjoyed the free mimosa as well. The portions of the omelettes were not large, so if you have a bigger appetite, you may need to order a side. French bread was provided with butter and was fresh and soft. We did not order dessert but perhaps would come back for dinner and try on another occasion."], ["Don O.", "Let me start this review saying this was the best dinner I've had since I moved to Miami 2 months ago so this is my new favorite restaurant for now.My wife and I and a friend had 7:00pm reservations last night and when we showed up there was only 2 other couples in the restaurant. It was still a little early but it didn't have the crowd I was expecting and that I saw a week earlier when I just happened to drive by. The restaurant is small and the tables are tightly packed together. We chose our table and sat down and ordered a bottle of french Pinot Grigio wine. I dont really drink often but my wife and our friend later finished the bottle and said it was great. A very nice waiter who was from france and had a heavy french accent suggested we start out with the Charcuterie Platter which we did. The ladies were drinking wine and the Charcuterie platter was served and we just sat and nibbled at the meat and cheeses for about a half hour and started our night just perfectly. We ordered our meals around 7:30 and the place was starting to fill up and we continued chatting. I ordered the Homemade Duck Legs Confit, our friend ordered the Chilean Sea Bass and my wife ordered the Chicken Fricasse. About 15 minutes later our meals were served and everything looked terrific. What did catch my eye was that the Chicken Fricasse was served in a cast iron pot kind of thing and not on a traditional plate and it was really big.We all started to eat and my duck legs were really good. The skin was light and crispy and the meat was very tender and moist. I would have to say it was in the top 5  duck dishes I've ever had. I loved the fact that it came with 2 duck legs instead of just the one you usually get. The Chilean Sea bass was really good as well as it presented beautifully and baked to perfection. It was very flakey and not overcooked or undercooked. I only had a sample bite but I liked it a lot.Now here's the game changer. While I was eating my duck legs my wife kept commenting on how good her Chicken Fricasse was and that I needed  to try it. Since she is a picky eater I thought to myself hmmm, it must be really good. So about the time I finished my duck my wife was a little tipsy from the wine and told me she was finished and said I can have the rest of her chicken. Since she raved about it i took the dish and sat it right in front of me and took my first bite. Almost instantly I was like OMG, OMG, OMG this Chicken Fricasse is AWESOME.  I freaking loved it and kept eating until I finished the whole thing. It was not only was the best chicken dish I've ever had it was one of the best meals I've ever had as it truly tasted incredible. I cannot go into the details of what all the ingredients were in the dish because I don't really know what was in it. I did taste a creamy mushroom flavor but the chicken was mixed in a pot of who knows what and it was unbelievably good. I think I  loved this dish more than Christmas as a child so when you eat here you HAVE to order the Chicken Fricasse. It's the best dish you're ever going to eat, trust me.By 8:00pm it was very busy and people were packed in like sardines because the tables are so close to each other but it feels more like a family get together rather than a restaurant. Everybody was talking to everybody.This is a great place with a great vibe and an incredible menu. I'll definitely be back often and you if you come here you will not be disappointed."], ["Frances T.", "Excellent French Restaurant! The quality of the food is always good. The Chilean sea bass with lobster sauce and the chicken fricassee are the best options. For appetizer the escargots."], ["Cassandra C.", "I only have fantastic things to say about Le Bouchon. Every time my family is in town we eat dinner and or brunch here, both meals amazing. The atmosphere is unique. A small restaurant with high energy, lost of laughter and lots of champagne.They serve you a complimentary glass upon arriving. I've had the filet, duck, salmon and sampled a variety of other dishes. All clean your plate amazing. Everything is savory, you never want to finish your meal too quickly! I would recommend for both brunch and dinner. Amazing atmosphere and the food is just divine."], ["Tina P.", "Very good. I had the mussels and there were plenty to fill me up! My boyfriend had the chicken fricasse which he enjoyed. It was a nice treat but not the most comfortable spot for repeat dining. Our waiter was excellent and we'd recommend anyone to try it at least once."], ["Trou D.", "Great atmosphere, Sebastian (waiter) is excellent, the Bouchon Omelet (ham, Swiss, and mushrooms) is delicious!"], ["Brian M.", "The food is very good but that doesn't excuse having one waiter for 30 tables! Waited 10 minutes for menus, waited another ten for beverages, then about 20 minutes for the salad. I let this go on a number of occasions, but this time was enough. You can't just have great food, service is as important and sometimes more important than the food. It's not that the waiter was bad (although he seemed to be paying more attention to the big parties) it was that he had way too many tables to handle! Even the best server cannot properly manage so many people. It's a matter of being properly staffed on a big holiday weekend so your customers have a good experience. Not sure if management knows of this problem as there was no manager to be seen! The food was excellent. I had the Salad with large grilled shrimp. Very tasty and tempting to bring me back. Just need to remember the service fiasco and I'll give it a little time to get it together. Maybe in a month or three!"], ["Jeremy M.", "My wife and I arrived to coconut grove late in the afternoon after traveling most of the day. We were starving and were willing to eat almost anything but ended up eating here. I ordered the beef stew and she ordered the filet with green peppercorn sauce. Both were outstanding. My wife typically eats like a bird but she cleaned her plate here. Service was awesome as well. If I had one point of criticism, is that that do not have a full bar. We were both looking forward to a cocktail but the only serve beer and wine. Not a big deal, I enjoyed a French beer."], ["Gilbert T.", "If you would like french food in miami, come in here. The food and service are fantastic. This is the time of year to come as it is open door seating. In the summer it can be down right hot. But from october til april it is great. I cant say enough good about the place. A great cozy atmosphere that can remind you of a small cafe in paris. Try the specials, the mussels and the escargot. Ive been in several times in the last year and it always feels like a special treat. Larger parties need a reservation"], ["C M.", "Was there on a sunday noon, with my fiance, sat down  after a long wait we got our server, took our orders, we ordered some eggs benedict and tuna tartare for myself. Seemed like a busy place, lots of tables, kitchen running behind, understaffed, we had to wait 40 min for our food.It finally came , we were happy we got it, first bite i took out of my tuna tartare,A BIG PIECE OF BROKEN GLASS ,in my mouth mixed with the tuna, i dwear was a 1/4 inch think size of my nail, thank god i didnt swallow that. Imagine from a regular meal , you could have destroyed your entire life, cut your stomac , your intestin. It is very upsetting this people are doing this to us, verry very upsetting. How can you serve food with broken glass in it . Who does that , i cant even imagine what goin on it that small kitchen . Its just horrible. So please be advised, before you go there, it can turn out very bad for you."], ["Isabel G.", "My parents, husband and I were completely amazed by the food this restaurant serves.As very foody people, this place is a hidden gem in Miami.Not only because the food was more than excellent, and the dishes were prepared as French dishes/cuisine are meant to be prepared, but the quality of each ingredient was really high.the people that work there are 100% professional, the chef, the waiters etc.Small and beautiful restaurant, magnificent experience,congratulations."], ["Gaby O.", "Wow! Everything in this place is amazing. Is a Pettit France in Miami. The place is really small, as the real french bistro's so better do a reservation and be on time. The attention however is a bit slow, so better take it easy and enjoy the moment. You can order anything on the menu you won't be disappointed."], ["Dario C.", "I'll make this simple:  This is the best restaurant in Miami.   I come every time im in town!  Its THAT simple."], ["Michael C.", "\"Cute little French breakfast place\".  That was my tip.  Sorry to say I was really disappointed to what could of been a nice little start of our day. When you look at the pictures, the French décor is really inviting for a place to walk into.  No doubt about that. We walked in here and sat down and there were probably only 6 other tables taken, so it was not that busy.  All the more reason we should of had great service and a nice welcoming.  WRONG.  The staff here were \"rude\", had to be chased down for any little thing we wanted, even the check.  And when they brought the check, they forgot the pen, so I had to get up and ask for the pen.  The menu was not difficult to see that there were mainly eggs, omelettes, and pancakes.  The eggs and omelettes are served with a side of roasted potatoes and they also had Canadian bacon on the side if you wanted.  I ordered the salmon omelette and a side of Canadian Bacon.  As you can see on the picture the omelette was sitting on a \"bed of water/butter\".  My wife ordered the 2 eggs which came with the Canadian bacon, no problem there.  I had to find anyone I could to let them know that my waiter forgot to bring me MY Canadian bacon, so I let one of the servers know. The waiter came over and I reminded him.  Now I was half way through my meal and I could hear the waiter asking the kitchen for \"that side of Canadian bacon\" 3 times. This was getting annoying.  Finally when my waiter brought over the Canadian Bacon, he just put it down on the table and mumbled something, I am not sure but it was not an apology or anything of the sort.  In fact he barely made eye contact with us. I think he was looking up at his other tables.  These people here never smiled and I felt like they were doing us a favor by serving us.  When we were done with the meal it was a little more busier, but this place is not that big and my waiter was only feet away from us most of the time.  Had to track down the check.  Got the check. I had to put my hand out with the credit card and the check for him to notice and when I got them back,, NO PEN.  So,,,, had to get up and ask for a pen. By then I wanted this \"experience\" just over. I really do not understand how a breakfast place like this that is pretty simple and has such nice décor and a great set up can make anyone feel like they did not want to be there. Maybe they didn't. On a positive note, the little French tables were set up with a carafe of water and 2 nice little wine/water glasses   They had a bottle of some French Rose which added to the ambiance, cute.  The bread was served with a delicious raspberry spread, really delicious.  Beyond that, I will not be coming back here, sorry to say."], ["S T.", "I would give 3.5 stars if I could. The good: service was great, goat cheese salad was tasty, and the sea bass was decent. The bad: everything was very overpriced with a small portion for the entree. Risotto was a little undercooked. They managed to make the sea bass kinda crunchy which was just odd though the whole dish had some nice flavors. I was here on a business meeting so I didn't have to pay out of my own pocket, but if I were the one footing the bill, I would not return."], ["Jackie I.", "Came back once again for their awesome Mussels! They give you a nice big pot for only $20.50!!"], ["Mc C.", "Cute place; great food; pace of service perfect for conversation and falling in love.  Went for lunch and the duck was outstanding; she had the carpaccio with a HUGE prawn; add a cote du rhone and you'll swear you're in Paris bistro, tranquil and feeling so romantic."], ["Otty B.", "The Best Day of my Life.  Celebrating our Engagement .This 's one of my favorite restaurant. Amazing service, Excellent food &  Good Food is always Better when Shared with Family."], ["Yanelly S.", "Stopped in on a recommendation and it was wonderful. Great service.. Lazaro especially made us all feel welcome. The food was excellent (came for breakfast twice and had the French breakfast and eggs your way) I will be coming back whenever I'm in town."], ["Lauren A.", "Our favorite place for Sunday brunch! Can't go wrong with the atmosphere and free mimosas!  We frequent this place and have had nearly everything on the menu-- haven't had one complaint about the food yet! I gave it 4 stars because parking can be tricky, and its a little crammed inside, so you can very well share your low conversation with neighbors.  If it doesn't bother you (doesn't bother us!), then you're good to go!"], ["Jorge D.", "I must say I was very disappointed.  We were walking thru the grove looking for some breakfast and we found Le Bouchon Du Grove.  We were sat quickly, but the place was soo packed we couldn't really move in our chairs. customers and wait staff were constantly bumping our table.  It was very awkward. I will admit the Champagne was a nice touch.  I ordered the hot peppered omelette (I cant recall the name) and I really didn't enjoy it.  The food was just ok.  There are many better options for french or brunch in Miami."], ["Carolina G.", "Went for brunch.  I had heard good things about this little French bistro.  Brunch is... crowded -- as all brunch spots are in the Grove.  Service is slooooooow.  And you are right next to another table, like RIGHT next to.  This is ok, if you get a cool group, but not so great if you don't.The food is... ok.  My friend's Cajun omelette was pretty bad according to him.  My Croque Monsieur was edible, but seriously what is a Croque without Bechamel?  This was an open-faced baguette with ham and salamandered cheese on top.  Tasty enough, but it's no Croque.The place is quaint, however, and so I'll probably be back to try out the regular lunch or dinner, which I hear are quite good.Looking for a romantic spot in the Grove and this is an option, except for the very, very tight seating which doesn't lend itself to intimate conversations."], ["J L.", "Sooooo NOT impressed. The food was not cooked to order. All was overdone. This is my second time and thought the first time/dish...must have been a miss based on all if the reviews. Find another French restaurant in Miami!"], ["Viviane B.", "What I like about you...Ahhh Le bouchon... Love at fist sight. I simply adore this place!!The food is delicious & always consistent. Big fat A+ for the kitchen staff! As for the waiters... I think Le bouchon would be a better place if they changed their waiter staff or had a long course on hospitality.You go there wanting a table... and you're either going to catch the waiters on a good mood where they will acknowledge your presence & sit you... OR you'll get them on a bad mood where they will see you standing there for 10 minutes & not say anything (while having 4 open tables) until you finally tell them that you want a table.Thats all folks."], ["Catalina M.", "The plan was to go to Greenstreet, but we passed by this place and it looked interesting- I'm glad we stopped and changed plans! We waited about 10 minutes to be seated. We got a complementary mimosa and the food was very good  we didn't have to wait much for it either, it's very tiny place but we had An amazing time, it's not too loud and it's a nice setting for a Sunday brunch. Our waiter was nice and he spoke Spanish which was a plus for my aunt. They ran out of croissants but the banana pancakes and omelet were really good. Good pricing too. Will come back"], ["Vivian D.", "We go to Le Bouchon at least once a year on a special occasion. The ambiance is great, feels like you're in Paris at an affordable price. I've hade the Chicken Fricassee, the Duck and the Chilean Bass. As well as the escargot and the onion soup. All are to die for!!! Last night we went for my Bday and got complimentary champagne. This place is a keeper!!"], ["Lorelei W.", "Perfect place for brunch!  Amazing omelettes & lattes.  Super dog friendly.  I LOVE this place!!"], ["Cathy C.", "Went last night to have dinner with my boyfriend, let me tell you.... AMAZING!!!! Love this place! We were a little bit late and even though They were almost closing the staff welcome us and make us feel at home! No rushing at all like in most restaurants when you go late at night! We had the pleasure to meet the chef and owner who was really nice too! as an appetizer we got the \"Escargots en Persillade et au Pastis\" And the chef recommend as the entrée  \"La Fricassée de Volaille fermière à l'ancienne servie avec un risotto aux Morilles et son Biscuit de Parmesan\" pardon my French but this was FOOD PORN! Best meal I have had in a long time! The flavors! OMG! To die for! We accompanied the courses with a glass of champagne (courtesy of the house) and a bottle of French rose wine! LE BOUCHON in now one of my favorite restaurants in Miami! Thank you very much for an amazing night! Really good service! And most of all thank you for an epic food!"], ["Andy D.", "Dear AbbyI know your dead and your advice is now limited to Psychics, and the NSA, but I have a perplexing problem.I used to go to a French restaurant in Coconut Grove, mainly to be seen, but I soon realized what a gem this place was, was as in past tense.I hadn't been there for a while, but after returning from Europe, where the food was mediocre and service was shit, I craved true European food and my old friend Le Bouchon would provide.When we arrived at Bouchon Du Grove, we were greeted by the sign \"Your Hostess will seat you\" alas no hostess, until a lady dressed in black got up from a table and nervously smiled asking us where we'd like to sit. How nice that our hostess was able to take a break from her day and relax with the others. She sat us down, and we waited and waited for our waiter. He apparently like her was on a true French work week.When our waiter did arrive, he took our order of Escargot, Onion Soup, Veal Cheeks and Mussel's with two glasses of Cabernet. The waiter then disappeared. After two quick games of chess, and a read through of Tolstoy's War and Peace, the waiter came back with the onion soup and Escargot, but no bread or wine.The Escargot was good, the onion soup was ok, but still know wine. 10 minutes later our entrée's arrived and I asked the waiter about our wine, again Ms. Abbey he was dumbfounded, our cabernet finally got there, just before it hit the vinegar stage.The mussel's were passable, but dry and overcooked. The Veal cheek's were inedible, So over salted, they tasted like Moses sandals.How can any chef salt that food that many times. I actually felt my body swell six times it's normal size, and not the part of my body that usually swells on every other Wednesday, and during computer porn night. Oh, and Abbey the wine, I mean vinegar didn't even mask the pathetic flavor of the veal cheeks.Well Ms. Abby, now that I have your attention, I'm not asking that God drop a cinder block on the head of our hostess, that imbacilic excuse for a hostess, I don't want Jesus or St. Peter to kick the chef in the gonads for not tasting his food prior to serving, I'd really hate to see the waiter stabbed in the face with a for, and force to spell the word ASSFACE in his own blood, till he get's it right. I don't even want the owner to die, while choking on his own vomit, from eating that nasty food, of course while seated with the imbicilic hostess. No Ms. Abby, what I'd like to know why this review will never become the Review Of The Day, since there rarely picked for there sarcasm, and lack of star appeal.  Abby Baby this was a horrible meal, I'm attempting to use good humor only to keep the food down. Others need to know! I used to love this place, now mmmeeeeehhh not so much."], ["David M.", "The food was pretty amazing.  I had that halibut risotto and my boyfriend had the mussels; the mussels where a large enough serving they could have fed a village.  Both dishes were fresh and packed with flavor.  The restaurant however is really cramped. You're elbow to elbow with the surrounding tables and service is really slow.  Maybe we were there on a an off night, but if you have plans after dinner, this isn't the place for you.  Come here planning on making an evening of it, and you'll experience a great French meal!"], ["Mead M.", "Fantastic French bistro in the heart of Coconut Grove with unbelievable seafood lamb beef service and atmosphere."], ["Alden K.", "Inexpensive place for French food, what's not to like? My only regret is that I don't visit this place often enough. Everything is always tasty. Great atmosphere and a great location. I wish there was more activity like this in the Grove."], ["Alexandra D.", "This place is so special to us. We have celebrated so many wonderful occasions here over the years, just the two of us :)My husband lived in France and he always says this place takes him right back! We lived in DC for some time and honestly could not find a French place as good as Le Bouchon.  I love the escargots... so buttery and delicious. We always order the steak au poivre (not on the menu) with potatoes au gratin and it never disappoints! We usually order a bottle of Cote du Rhone that was recommended by a waiter on one of our first visits.  I can't wait to go back once our baby is born and share a bottle with my hubby!The complimentary champagne and the overall vibe of the place almost makes you forget you're in Miami!"], ["Yuliya M.", "The food is delicious, staff are friendly and I definitely would come back again to try the dishes we haven't yet tried. Gluten free options available! The place is very crowded and stuffed with decorations. Felt like we were sharing a meal with strangers that's how close else were to each other but haven't been to France, that's how a lot of their eateries are. The decor was a little over crowded for me, too much memorabilia for me- associate it more with with a sports bar but food is the winner."], ["Alfredo H.", "Usually it's very good but today everything was off. From the host who was very condescending and rude to the food which was below mediocre. The onion soup is better from Campbell's. I hope it's an isolated incident."], ["Mark M.", "Were I of sufficient means, and a local, I'd take one meal here each day. No less than an all-round dining delight. Marvellous omelettes, coffee, and the panoply of bistro basics."], ["Alex D.", "Love it, love it, love it! This is the place to get mussels and frites whenever I can visit Miami! The owner / chef is very friendly and really wants folks to get a taste of French cuisine when they visit his establishment.Location is fantastic as well - right in the commercial center of Coconut Grove! The bistro style food is very appropriate when walking around the area. The decorations in the restaurant are also very interesting and tell the story of this group well.Like other reviewers have touched on, this place can get full sometimes, and you may have to wait to be seated and wait for your food - I have never been disappointed, and take these moments as good opportunities to relax, sip on some good French wine, and enjoy the company of my family when I'm here. If you rush through the experience, you are somewhat missing out on the European ambience here. I never minded it.Looking forward to my next visit!"], ["Mariana R.", "Run!!! Away from this place!! I found a cockroach in my salad!! Needless to say we got up and left.  Would not recommend."], ["Amanda Maria A.", "Food was pretty good! Enjoyed it very much. Service was slow.  Seems like everything down here in the grove the service is super super slow. I dunno, maybe where I come from, food shouldn't take an hour to receive. Lol"], ["Arta L.", "If you'd like to avoid the lines at the brunch places down the street (wont name any names :) ) and prefer a more intimate and friendly brunch spot that gives you FREE mimosas, this is your place. We found this place after attempting to eat down the block and being disappointed by the ridiculous wait time (I'm sorry but most breakfast is just not worth a one plus hour wait)This place was perfect. What friendly staff, some of whom were actually French! Everyone was very nice (French? Nice? Yes!!!!). And hardly anyone gives anything for free these days so free mimosas was a very nice welcome.The food was fantastic. We had the cajun omelette and raspberry pancakes and both were equally delicious and flavorful. I loved taking a break from my breakfast to enjoy the cute french atmosphere and decor. They were also playing fun, hip music in the background that wasn't obnoxiously loud.  We ended up paying less, waiting less, and eating better than we would have down the street. Overall, a winner!"], ["Graeme J.", "Went for lunch to have Escargots. Simply not worth it. Escargots were tasteless at best and probably worst  we have had. Service also not good. Would never  go back"], ["Solana F.", "Escargot. Fricasse. Tartatin. My favorite restaurant in Miami. Greatest service. Greatest place to spend your birthday too. Bruch. Lunch or dinner."], ["Alessandra C.", "again the fricassee and scargot are a must. The service was better the first time,  I don't like when the waitress don't pick my food up when I have finished! I almost pick the food up by myself -.- I really  don't like it,  I was without water, anyway the fricassee is the best! :) I want to give them 5 stars but in this kind of restaurant the attention is important."], ["John S.", "This wonderful and cozy restaurant is entirely open on the street side for cafe style dining you'd find in Paris, but don't worry they still run the a/c so it is comfortable inside.Upon seating we were each given a glass of Champagne, mildly warm bread, and delicious butter.  Servers were attentive from the beginning without ever being intrusive.For dinner we each had a salad and soup.  Each salad was big enough that with the soup they served as a complete meal.  After dinner we had the mousse with cream Anglais.  It was thick, rich and oh so chocolaty.  Another note about the authenticity and ambience.  On a rather slow Sunday night in the Grove we might have been on the only table that wasn't French speaking."], ["Frank F.", "Wine, desert, coffee wow!!!!  Sea Bass \"Rico\" but if you really want to go crazy try the fabulous \"Chicken Fricassee\" heavenly out of this world!  Definitely will comeback for more, and bring your girl if you don't , well you know!!!"], ["Tai T.", "Ate here on Valentine's Day & was seated fairly quickly, though it took a while to get menus or drink orders. The escargot was pretty good, the pesto it was served in was a little too garlicky. I had their Halibut special & it was pretty good. A little pricey for the quality of food though."], ["Jason C.", "We had been here once previously and enjoyed the food, atmosphere, and service. But this morning we arrived with our two small children, having planned our day around starting breakfast there at 9:30a, when they open, only to discover that Le Bouchon DOESN'T OPEN on time - in fact, they'll be a half hour late beginning today. Thus if you value your time, Le Bouchon isn't for you, despite its good food."], ["Leyna C.", "This is my FAVORITE Restaurant! I absolutely recommend a reservation the location is very small (in a good way) and don't be late they will give it away if they need the table. The food is amazing, you are safe ordering anything on the menu. I definitely think it's better to go on a cooler day though, it can get warm in the restaurant due to their large open windows in the front of the location. Don't forget to order a creme brûlée at the end! Great for dates or special occasions! Really reasonably priced for a really good time."]], "Bistro Cassis": [["Serge G.", "I live between Paris and Miami so in general I am deeply skeptical of French restaurants in Miami. I have not tried Tour Eiffel on Biscayne or the Moroccan French called Rouge in North Beach. I have had one delicious lunch at La Fresa Francesca in Hialeah (highly recommended). Which brings me to Bistro Cassis. Now my review is based on only one sampling so maybe there are other dishes that are good. The quiche loraine had a pastry that was hard like a rock. I gave up trying to eat it one third of the way through. Lardon frisee salad would of been ok if the vinaigrette was not so sweet. The tarte tatin was acceptable. I don't think I will return. There is another French bistro that just opened in midtown ... Azur, but I am scared to try. I might have to wait until I am back in Paris to satisfy my \"envie\" for cuisine Francaise."], ["Sue S.", "This place is new, and tasted like a winner. A lot of classic French choices. We started with the terrine of fois gras, which was smoothe and deep flavored. The beef tenderloin topped with seared fois gras set upon tender asparagus was excellent. As were the lamb chops. There's not a huge red French wine selection, but several other origins available. There are also several choices of cocktails with a modern spin, aperitifs, Ricard, and champagne/sparkling wines. Classic,well prepared and presented desserts. I'll probably try the Ile Flottante next time, (because you rarely see that on a menu) but had the daily special of the tarte cassis. It was  a cold creamy custard atop a baked crust and served with fresh berries and white chocolate.Excellent server. The restaurant was quiet on Sunday evening, so we received very attentive service. All the wait staff were friendly and informative. It's situated right in the Midtown shopping, across from the Nordstrom Rack on Buena Vista. I'd come back here any time I was in the area!"], ["Ceek K.", "Simply, does not get any better ... it is authentic!Our party ordered a range of dishes, from salad chèvre, tuna tartare, grilled octopus, carmelized onion tart, bouillabaisse, pistachio rack of lamb to creme brûlée - and every one was to perfection. More offerings on the menu were: onion soup, escargots, mussels, chicken a la several ways, steaks, duck. The daily specials were tasty temptations.Good news is that it is open all day into evening service, so if you feel like an early dinner (say at 4:30pm!) its there ready to welcome you. Open 11:30am-11pm.Will be back soon .. in fact, maybe later today!!!!"], ["Patty L.", "This place was mediocre at best. The food was okay, but the service was absolutely terrible. We went on the first night of Miami spice. The restaurant was not busy at all, yet it took the server 40 minutes just to get our twelve dollar drinks out to us. We asked him about 25 minutes into our wait, and he stated \"I've been rushing the bartenders, but they haven't made them yet.\" Mind you, this young gentleman hadn't been by the bar, and the bartenders were not busy in the least, but I digress.  When he finally brought us our drinks, they were completely watered down and this, combined with the fact that the glass was covered with condensation, made it obvious for us that the drinks had been sitting out for a long time. When we confronted the waiter about this, he said, and I swear to our mighty maker, that he tells us, \"That's how the drinks are in France. That drink tastes very watered down, that's why I usually don't recommend this particular drink.\" At that point we were very upset. IF that were the case (the drink tastes watered down normally), then why didn't he share with us his recommendation before placing the drink order?!  He didn't change our drinks, he just justified why the drink was not good. Needless to say, after this entire experience we were just annoyed. We were there for three and a half hours just to finish our dinner. That's how slow the service was. I cannot stress enough, the restaurant was NOT busy! I will NOT be coming back here again. The food was not worth the wait and the hassle. I will be taking my money elsewhere."], ["The E.", "Came to Bistro Cassis for Sunday brunch and was immediately surprised at how many times I had walked past it without noticing it was there. I have not been to many French places in Miami, but I had heard excellent things about their brunch menu. The very attentive waitstaff immediately brought out fresh bread and croissants, which were very delicious. I ordered the royal benedict which was two poached eggs on a croissant with smoked salmon and hollandaise. It was good, but not so over the top that I feel the need to come back. I also got to try the sandwich bouchere which was a sliced steak sandwich with caramelized onions. Once again it was good, not great. My biggest issue, which prevails for most brunch places was that mimosas and bellinis were $6 each, which is way to expensive. Although it was not a bad experience, there is too much brunch competition to just be good at this point."], ["T. B.", "Good food, good portions at reasonable prices. Service is also good especially for Miami.  The cocktail menu is ok, not great, but they have a full bar and a nice wine list."], ["Limor W.", "Came for dinner.. Great food selection, service, wine list and the brunch menu looks delicious! Had the French onion and the warm goat cheese salad. Wanted to lick the plate! :)"], ["Andrew B.", "Alright so I wanted to give this place 5 stars because the food was amazing. The muscles in white wine was excellent as well as the Duck breast. They serve you delicious hot bread non stop with different spreads so that was a plus. But our waiter (a bald guy with an accent) was pretty frazzled. We ordered our entrees and appetizers and after we finished our appetizers the waiter takes all our plates and says, \"Would you like some dessert?\" Huh? We only just ate our appetizers and are still waiting on our entrees. He realized his mistake and brought our plates and bread back. After the meal was done my friend asked for their tea selection, and said he'll bring the box of tea right out. After waiting for about 15 minutes we just asked for the check and left. Not to mention i ordered a beer and had to remind him when the appetizers came to bring one. Conclusion: Food = Amazing. Particular server = not great. Hopefully you can come here and not deal with this guy, but the food was excellent."], ["Doug L.", "Came back.  Had the steak tartar and Ahi Tuna Salad.  Everything here is so expertly crafted, and it not stuffy french.  Very casual.  Wife loved the bread, butter, mustard and steak sandwich"], ["Robin S.", "Fabulous,trendy Bistro with REAL French Bistro food. Don't miss out on this hidden gem."], ["Scott F.", "I've been here twice already and each time has been amazing! The Sunday brunch is delicious and for dinner the duck l'orange is a must!!"]], "Eden In Eden": [["Mariana R.", "The soy tuna, and the soy sausage sandwiches tasted delicious.  Overall the food tastes great and the cashier was super nice.  It is a great vegetarian meal option.  I also had the ginger carrot soup but wasn't in love with the texture.  It was very watery and the fact that it was heated in the microwave bothered me a bit.  I would definitely go back but may skip the soup."], ["Krupa H.", "I was excited to come this place since I am vegetarian, but I am not mainly because of the price and the service. When you walk into a new place that has opened and you are the only ones in there, usually the staff might greet with you a warm welcome and questions like is this your first time, would you like some recommendations, something. The guys barely got a hello out and then I asked him for his favorite thing on the menu and he said the CREPES CHAMPIGNONS which I got. My hubby settled for the QUICHE VEGAN with spinach.The food came out pretty quickly and was served a sauce that we dipped our food in. The crepe was ok, nothing spectacular and I wouldn't call it the best thing on the menu. My husband's quiche was pretty good and I would come back for it. The only problem I have with the place is the lack of excitement from the staff and the prices. On their website the prices are $8.50, but we were charged $13 for each item which I don't think the ambiance and the food is worth that."], ["Francis M.", "I live nearby and I absolutely love this restaurant. It is a small family owned place with great service and great food. I come here on my own all the time, always looking forward to having a talk with the front of house as well as the chef. They really care about their food and  the health of their customers, and you can tell they put a lot of love into everything they do. I've tried pretty much everything, but my favorite item they have is the vegan creme brulee. It is fantastic. Yes they are pricey, but they use organic ingredients in everything they make, so I personally am willing to spend more for quality ingredients. Overall, I enjoy this place and hope they are successful. There are not many vegan locations in Miami and I feel that this is place is a great addition to this city. Excellent service and excellent food is what it takes to make a great restaurant, and in my eyes they have succeeded on both counts. Five stars from me, definitely."], ["Douglas S.", "My fiancée and I were very impressed with the food options and great service at this quaint little cafe. I give them kudos for being innovative and bringing up this new concept..French/Vegan cuisine. It was refreshing to step into a vegan place that offered more than just salads and wraps. We had the vegan sausage quiche, ginger/carrot soup and a smoothie. They all were all delicious. I also liked the fact that the portions were fairly big (compared to most vegan places) and the quiche was warm, hearty and filling so it definitely hit the spot for me. I'm sometimes left feeling a little hungry after eating at some vegan spots, but not the case this time!The place was clean and had a very positive vibe to it. You can tell they put a lot of effort into opening and managing it. It's a family operated restaurant so it seems like it's been a labor of love for the owners which is always great to see. It's located in the silver bluff neighborhood, which is up an coming with great new restaurants and things to do everywhere. Overall...it was a great experience and we will definitely be going back. Great food, interesting vegan options and quality service = FIVE STARS!"], ["Felicia B.", "5 star amazing salad dressing they called it \"sea salt\" the name doesn't do it justice.Delicious and generous sized crepes. Watermelon juice is a personal favorite.Had the chocolate mushroom coffee for a sweet ending and because the opportunity to try something new is rare and I really enjoyed it. Will definitely return and hope they stick around a long time!"], ["Erin B.", "Delicious, light lunch. The salads are wonderful. They make a fake tuna that is amazing. Everything was fresh & the people are kind. Unique place I will always visit when in Miami!"], ["Gabriela S.", "A vegan or vegetarians paradise. I had the taboulet salad which was very generous in portion size and delicious. The vegetarian white ham in the salad was so tasty and really tasted like ham. So large I had enough leftover for lunch the next day. Really recommend this place."], ["Sonia T.", "Was delicious! Everything! Owners were extremely nice. So good to have vegeterian French food! It tasted exactly like an authentic Parisian crepe. Tres bon! ;)"], ["Milan P.", "A delightful amount of love and expertise went into my Salade d'Automne...who knew that vegan turkey could be so tasty!"], ["Christine R.", "The owner is from Paris & the food can be vegetarian or vegan.  I love the concept & I love the Crepes!  They also sell vegan products. I tried the Vegan ice cream (Dolce Peccati) & it was surprisingly delicious. They also make fresh vegetable drinks.  A great find!"], ["Ana C.", "Everything about this place is perfect. The adorable family that owns it. The music. The location. The easy parking. And of course the delicious French vegan food. They have vegan crepes and quiches. Great juices. Delicious soups. Perfect salads. A must for any healthy eaters in the area!"]], "George's in the Grove": [], "Cane A Sucre": [], "Frenchie's": []}