{"Mandolin Aegean Bistro": [["Greg T.", "Nice location in the design district.Came in for lunch and ordered a gyro which was both lamb and beef. I was hoping for a more traditional preperation of lamb only but it sufficed and tasted good.The tatziki sauce was homemade and very tasty while the fries were okay and seemed previously frozen.Service and ambiance were both good."], ["Carol M.", "What a wonderful terrace! This is a great place to dine al fresco. We went on a Sunday night and the place was packed. This restaurant is located around midtown and offers Mediterranean food. We ordered the stuffed zuchini, kefte - which is like beef and lamb meatballs -, the special of the night, wine and dessert. Everything was fresh and delicious. The waitress was attentive and took the time to explain the menu items. Highly recommend this place for a romantic dinner or a night out with friends."], ["David L.", "Amazing dinner, can't wait to go back. Romaine salad with dill dressing is amazing. Staff was great!"], ["Lee G.", "Beautiful setting and good food. U go thru a wooden door and u r transported to Greece. Candlelit tables, a few sails die the daytime and a great atmosphere. Menu is simple. Great salads, cool veg and Kofte to start. Main courses of fish and chicken. All simply prepared and served with rice a mourasalata a kind of greek salad.  Service was decent without beg fussy. All was great except wine which was distinctly average. No cocktails. Definitely worth a trip to design district."], ["Claudia D.", "Very good artisan food. My concern is that the menu that is here is not updated, the plates actually have extra three dollars on each plate..."], ["Steph G.", "What an awesome spot! We went to meet friends for dinner and were so pleasantly surprised by the entire experience!The decor and feel of their outdoor space is perfect for a cool afternoon or summer evening. They have beautiful giant trees and umbrellas decorated in a very rustic manner. At night, the entire outdoor space is light with lanterns set on tables and gave a very romantic vibe.The food and drink was excellent! We ordered a pitcher of their white sangria which was so refreshing for the outdoors. For the Appetizer our group ordered calamari and the octopus. If you love octopus you will love this dish! It was cooked to perfection and the smokiness from the grill gave it a nice twist.For entree I ordered the rustic pasta, which was a bit heavy for me but extremely delicious. It's layers of very well seasoned ground beef, homemade noodles, and a vechamel sauce. Great meal to have before a night out!We ordered their pistachio baklava for dessert. I have a killer sweet tooth, so although this was great it was a bit on the salty/sweet side. Nonetheless, a great mix of pastry and honey!"], ["Marie M.", "I went there on a Sunday night, the atmosphere is very pleasant, it is way bigger inside than what it seems from outside. Very charming place.I got the stuffed zucchini as an appetizer and I really liked its unique and tasty flavor. Then, I ordered the whole fish, it was good, however, I have to say that I was quite surprised when I saw it didn't come with anything AT ALL! I get it, they charge for sides (and they are pretty expensive) but not even some vegetables or a small salad... I mean whatever they want but something... It was very strange to me.My husband got the moussaka, a typical Greek plate that is made with ground beef, eggplant and cheese, and it was delicious!"], ["Lindley L.", "PROs: As other reviewers have stated, this place is adorable and very quaint.- Great outdoor patio - Grecian colors and decor- Family- friendly- Ambiance is on pointHowever...CONs: Pretty much everything else. - Terrible service (this could have had something to do with the fact that it was somewhat busy, as are most Saturdays). Took us 15 minutes to get the check and then another 10 for her to actually pick up - Horrible white sangria. If you want to make at home, dump a bunch of Granny Smith apples into white zinfandel and chill. Disgusting- Grilled octopus was yummy, but you get ONE leg for $18 which is kind of ridiculous- Greek salad was the \"highlight\" of the meal: maybe 4 slices of cucumber, 5 Kalamata olives, 8 capers and then one hundred tomatoes. Oh, covered with a brick of feta cheese. Greek salad is pretty tough to mess up but somehow Mandolin has it down to an artBOTTOM LINE: I would never, EVER go back here to eat or recommend. To top off the shockingly bad dining experience, the food made 2/3 people sick within an hour. YUCK."], ["Steffi M.", "Amazing. Light. Clean. I'd 100 percent eat here again. They don't offer delivery, which is annoying, but worth the pickup. I can't believe someone gave it a bad review for not changing and redoing their menu to fit their diet trend. Go to a vegan restaurant if you'd like a massive selection of vegan food."], ["Lana N.", "Overall: wonderful outdoor atmosphere, perfect for a romantic date! As I looked at other reviews while I waited, I saw rave reviews of the Grilled Octopus and they did not disappoint. Make sure to squeeze the lemon on it, the dish was top notch! So my friend and I shared this as an appetizer with the bread they already provide. She got the pulled lamb sandwich that she said was okay, however she absolutely loved the hand cut fries that came with it! I gotcha the Village Pasta based on a review that said it was great if you're craving comfort food and indeed it was. The white wine rose water sangria is soooo good as well. It was a pleasant evening and even though it was a bit expensive, we'd be willing to go back and support this lovely restaurant. :)"], ["Katy P.", "Mandolin is truly a hidden gem in the middle of Midtown. When you walk through the blue double doors you find yourself in an enchanted outside patio with wood tables and chairs that are covered with blue accents. The restaurants owners have made sure to bring authentic food that can be found by the Aegean Sea, which has been called the \"peal of the Mediterranean.\"At Mandolin they are proud and very passionate about the food they grew up eating. They are dedicated to creating and serving the locals homemade specialties that are simple, yet authentic. When you go to Mandolin you have to eat the Turkish Sampler, which has a pretty healthy serving of homemade hummus, tomato walnut dip and fava bean purée. Make sure to not over due it with the hummus because then you have to try the Greek village salad with chicken. So light and refreshing.And, of course, you have to eat their baklava. All I'm going to say is you might want to order seconds.And make sure to pair all of this delicious food with their very own Aegean Sangria, which is absolutely perfect for these hot summer Miami nights. Their sangria is made with white wine and rose water.Mandolin is truly a place to not only feed your stomach, but also your soul."], ["Christina K.", "Wow, best stuffed zucchini with FRESH tomato sauce. Juicy kofta that melts in your mouth. A MUST SEE while in Miami"], ["Cullen A.", "Great Mediterranean food. Chicken kebab and butterflied tiger prawns are really delicious and juicy. Definitely a good find if you're in the design district"], ["Vanessa B.", "This place is easily my favorite restaurant in Miami, whether for lunch or dinner!! It really is a cute, small getaway that transports you to Greece. The decor is all white and blue and it is mostly outdoor seating, although there is an inside as well! Everything I have tried on the menu has been fantastic! I come very often and will continue to do so as I am never disappointed by it. :) 5 stars!!"], ["Francesca S.", "Food is ok , but the scenery really make it up . you feel like you are in a greek little garden.Perfect for  a first date or  a get together in family"], ["SO S.", "I love this place, been there so many times and never got disappointed. I usually share 3 to 4 appetizers cause they are so delicious. Grilled octopus, garlic shrimps, Kefta... Good wine selection. Turkish coffee. Not many places with such unique ambiance and authentic food. Keep doing what you re doing!"], ["jackie a.", "Great food, atmospheric and staffs extremely friendly. I would recommend this place for food and ambiance."], ["Julio L.", "Positives: The food was amazing! We had the grilled octopus, lamb, and tiger prawns. We could have done a second grilled octopus instead of the tiger prawns as they were our least favorite dish. The cab wine by the glass was enjoyable and the baklava for dessert was good as well. Not the best I have tasted in the past but good. While we where inly a party of to there where large groups there and it seemed like this was a great place for large parties. Negatives: Because we did not have reservations we could not sit outside which is what would have made my review 5 stars. Typically I would not hold this against the restaurant as it was our fault however when we where seated there where about 40 outdoor seats available and when we left there was about 20 seats available outdoors. Not sure how they could not arrange to sit 2 outdoors."], ["Eric J.", "My first visit was lunch and I had the Gyro. Don't order the gyro get something else, this isn't the place to try a gyro. The fries are good, eat the fries. The Gyro was made thinly sliced strips of meat that you can buy in a grocery store, thus the meh."], ["Heberto V.", "The place is very charming. Nicely decorated. Definitely a place for a date.Since we were a large group we tried several things on the menu. The two outstanding dishes were the fried calamari and the grilled octopus. They were truly excellent. The rest of the food was mediocre. Not worth the price. The pasta was burnt at the bottom of the casserole, the lamb chops over cooked, the lamb burgers were bland and so on. I believe that if you go for a glass of wine and a couple appetizers it is worth it; otherwise I'd go someplace else. For the money Miami has many more great options to choose from."], ["A P.", "Been twice.Second time at 12:30 noon on a Friday they had already run out of spinach pie and greek balls (what!).Octopus ok. Shrimp saganaki is best.Lamb sandwich was dry in a huge bun.Service inconsistent when they are busy.Not excited to go back!"], ["Michelle L.", "The ambiance at Mandolin is five stars. Upon entering, you quickly get transcended into old world Mediterranean charm. My date and I felt as if we were dining in a little remote location in Greece. I recommend a cool night so you can sit outdoors in their garden area and calling ahead for reservations. The inside is small but really warm and quaint, adorned with flowers and traditional Mediterranean décor. The food: We began with the Turkish platter of three different kinds of hummus and spreads with a glass of their malbec. Followed by the grilled octopus that was tasty and the lamb chops served over pine nut rice. The lamb chops were my fave. And to close, baklava of course. The meal was delicious. To be honest, the foodie in me wants to critique and say that it wasn't the best Ive had but it definitely was very well prepared. The service was top notch too. We had a lovely time and it wasn't very loud. I didn't have to yell across the table. I recommend valet at the door."], ["John M.", "This is one place you leave feeling you were taken advantage of, when you consider what you paid for. A grilled octopus appetizer will typically run about $18 a plate, but most of the time two or three people can eat from it, as an appetizer. I paid $18 for pretty much one tentacle? NO drinks just water, one dessert shared three ways, and three Turkish Coffees; the bill was well over $100!It's a shame. The food was really good. I've been to Greece. The place feels Greek, the staff was very attentive, but the food wasn't pricey, it was down right unarmed robbery.I doubt I'd go back. Maybe if I was a date for someone else picking up the bill!!! Like in some of the reviews written on this place. LOL! I'm turned off by the prices. That's what sticks in my mind."], ["Anna L.", "YES YES YES YES....First of all this place is adorable..we sat outside. Food was awesome. Mediterranean food is always vegan-friendly, but of course there was lots of meat for dad. Great place for sharing also. Loved it!"], ["Marina A.", "Great outside sitting, like in someone's backyard with huge umbrellas protecting from the sun and the rain. Simple,Fresh and Delicious food. Great service. Octopus is excellent, Turkish trio is good to try as well. Stuffed zucchini very different and amazingly good with great sauce. Will be back :)"], ["Daniel C.", "Mandolin has a lot going for it. Awesome midtown location, amazing open air space. And to my surprise, they have really stylish canopy style covers for when it's rainy. We had a reservation for a party of 5 and 9:30pm, and we walked up to the host stand and were seated immediately. That's a great start, in my opinion. All the food was great for the evening. We started with grilled octopus and beef and lamb koftas. They were both excellent - to octopus really stood out and was cooked to perfection. For entrees, we had the fish special (a fish I've never heard of before that is sea-bass-esque) and the gyro. They were both really nice - the fish was simple, flavorful, boneless, and delicious. The gyro was standard. For dessert we had the baklava and the chocolate mousse. Both were fantastic, although in general I find baklava too sweet to have more than a bite. Our service was excellent and overall, it was a great experience. We hope to go back soon."], ["Lee H.", "The two of us arrived at 12:00 PM for Lunch and it was the perfect time since they get crowded fast. We decided to sit in the open courtyard dining area despite the rain that started developing. There were large over hang canopies that kept us dry even though it was pouring. We started with the daily special salad of watermelon, tomato, basil and feta cheese. They were accommodating and added the arugula to the salad that I requested. In addition we ordered the grilled octopus. Both were absolutely delicious. The octopus was cooked to perfection. The thunder roared, rain pouring over in buckets and the ground was flooding as we attempted to keep our feet dry. After our appetizers we shared butterfly trout with veggies and the most amazing Moussaka that I ever had. Despite the floods the waiter staff were very attentive and friendly. We finished with a Turkish coffee. I suggested to the manager to have the owners add a floor water drainage system so that the staff and patrons could easily move around during torrential  rains. Overall it was one of the best lunch experiences with great quality food, attentive staff and a quaint atmosphere. The best dining experience in Miami."], ["Valerie A.", "Delicious sample platters, both the Greek and the Turkish are great. The gyros are pretty good (order French fries on the side, yumm). The service was very slow and waiters seemed not have interest in making our visit special at all."], ["Hal M.", "From the moment we walked into the outdoor covered courtyard, we knew that we had made the right choice. The ambiance, the colors, the lights, the smell...all of it was a sensory delight. We started with the Stuffed Zucchini for an appetizer which was accompanied with some tasty bread. My wife got the Chicken Kebab which came with a very tasty romaine and feta salad and orzo. I got the Classic Gyros with the same salad and a side of their handcut fries covered in tatziki sauce. Everything was outstanding and would highly recommend this place to anyone looking for a good meal."], ["Joe Y.", "Mandolin has been one of my go-to mediterranean restaurants since its opening. It's a great place to have lunch with friends any day of the week, food is tasty and reasonably priced. As others have mentioned you can't go wrong with the lamb burger, it's delicious. Other recommendations should include the Gyro, the Hummus sampler, white sangria and any salad."], ["Lien T.", "Shared lots of meze between the 4 of us, plus the barley salad, moussaka, sangria, and baklava. All the food was delicious especially the stuffed zucchini. This dish can be shared, but it was small enough / good enough to order a 2nd dish.The barley salad was not as fruity and light as I expected but good nonetheless. We also enjoyed the lamb dumplings (unique, bite-sized, a special of the day) and the cheese saganaki (delicious especially topped with lemon juice). The sangria was light and refreshing if not also light in alcohol content (which was fine by me).The outdoor atmosphere was really pleasant and cozy. Our waitress wasn't the most attentive, thus the 4 star review. The baklava was also decent though denser than most baklava I've had and not worth the $11 price tag. I prefer Baklava Factory's. Overall, I look forward to returning and trying more dishes and enjoying patio dining."], ["Marcus Z.", "I got here on a busy Friday evening, I didn't get a reservation but lucky enough to get a seat in the outside siting area. The decoration, atmosphere is great outside, although frequently we were interrupted by the noise of plane flying over. By the time I left, there was already a line at the front door. So definitely try to make a reservation before you come. I ordered the famous octopus as the appetizer, lamb chop and lamb sandwich as the entree and house baklava as the desert.... And the food is barely a 60/100. The octopus is a bit over cooked and kind of chewy and lost the freshness of what a good seafood dish should be. It is fun to see though. The lamb chop is mehER than the octopus, it is so boring and unmemorable and not even as good as what you sometimes can get from a lamb over rice food truck. The lamb sandwich is above the average, but again, boring and forgettable. The baklava, don't even want to mention, I can only say, I haven't had worse. Overall, the food here is alright, I won't be back for the food, but the outside sitting area is definitely nice, which is probably why the restaurant is packed with people. Overall score: 70/100."], ["Maya P.", "I used to love this place, it is very romantic at night time but the other day I went and got the grilled octopus (got only one tentacle but still got charged $18) a delicious cucumber soup, 3 prawns and a starter plate with 3 dips and bread, drank water and paid $78 + tip , ended up paying like $92 and hungry. Last time I go there... I went there two other times for my anniversary, but really, you don't get what you pay for."], ["Jorge L.", "Came for dinner with my wife and one of her friends. This place has been on my try list for several months. The decor and atmosphere is wonderful and feels very greek all your missing is an ocean breeze. We ordered several appetizers; they were all great (saganaki, turkish app, octopus). Best food overall was the octopus. We then ordered some calamari which tasted like nothing. Our friend ordered the burger which she said was ok. I ordered the pulled lamb sandwich which was ok, you couldn't taste the lamb and it had a bit of a sloppy joe taste. I really wanted to love this place but just fell short overall."], ["Luca P.", "Poor portions, zero personality from the servers. The octopus 18$ per 3 inch, a lamb 36$ for a tiny portion. Sorry not my type of restaurant. Over rated."], ["Talal A.", "I give mandolin 3. 5 stars because of the price.   Food,  service,  and ambiance are good.   Salads are fresh and tasty, the grilled mediterranean branzino is made the same way we make it home but only better.   The grilled octopus is delicious but it was a small tentacle for $18 which I find a bit pricy.  Bathroom is clean and feels as you're the first one to use it."], ["Miguel P.", "Excellent food. Great quality with simple flavors. Can't go wrong with anythibg. The butterfly trout is exquisite. Friendly staff and comfort atmosphere."], ["Stacey C.", "Loved it.  One of the best meals we have had in Miami.Simple and delicious food.Such a cozy space, eating under the strings of lights and a few airplanes going over (ha!).   Very upscale crowd, nicely dressed, lots of groups.   Great wines by the bottle and glass.   We had the lamb chops, the trout special, arugula and date salad, Greek salad, prawns and Turkish mezze spreads.    Loved it all.   Can't wait to go back to Miami and eat in this lovely restaurant again."], ["Henry M.", "Fresh veggies, cool ambiance and great deal seafood's the whole staff is very attentive and kind. The owner was really hands on to his business. The patio seating was awesome perfect for relaxation."], ["Samantha E.", "Absolutely love this restaurant.  My husband took me here for our first date.  We had the lamb and a bottle of cabernet.  The ambience and setup is beautifully done.  Recommend to anyone for a fine mediterranean meal!"]], "Mina's Mediterraneo": [["Ari S.", "This is difficult.  The food is okay for Mediterranean. What I mean is that the food is good but it's not fantastic Mediterranean. Second it is very expensive for what you get. Good beer selection. Service needs to step it up!  I give it a 3."], ["Jose A.", "We went to celebrate my wife's B'day.  The restaurant has a nice decor and feel. I liked the menu because not only does it have the traditional Mediterranean food for the foodies (wife and friends) but also more common fare for the rest of us (me). The waiter was not the greatest.. He actually took our food order but not our drink order.. Lol. I did not want that to reflection my over all review. The food was good. Everyone in my table was happy. Great comments were heard about the basil tomato soup. Wife had the lamb plate (oso something) and she liked it. I had the Greek pizza with chicken and it was tasty. The crust was thin, crunchy  and delicious. We also ordered the samples of the dips and they were very good. One comment the soda was in a bottle not fountain (no refills!?)  I would come back for the food but hopefully a better service experience."], ["Alexander F.", "I can 5 star in the first few minutes if I choose,  especially taking into deep consideration how rude, unprofessional,  and fuckin tacky most servers in Miami are. Well, my server was exceptionally funny and witty and welcoming. He guessed the perfect beer, as I dared him to do.......the rest was a fabulous piece of happy eating!!!! Every one must come here!!!"], ["Christopher D.", "Outstanding ambiance, service, food, and all the rest. Juan was our waiter and I haven't had service ever this good in Miami. The owner is of Egyptian decent with a beautiful story and great family recipes that make up the menu. This is an A+!"], ["Pablo M.", "I had great expectations. Ill start on a positive note: the place looks amazing. the second thing to be said: the waitesses are super nice. but...the banaganush wasnt special. the kebab was good but not great. the osobucco was nice but rather small. all was served cold and had to be sent back. i dont know what to think really. i hope next time will be different."], ["Fred L.", "Wow what an amazing find! Great fresh food, excellent service and very cool local crowd. Highly recommend...everything!"], ["Sam H.", "I come in about once a week and grab food to go, but the treatment I get is as if I were dining in.  Staff is great and food is delicious.  Its definitely a place you need to check out.  The menu is diverse, not just straight Greek food, a very nice selection of food and wines.  They haven't gotten their full liquor license yet, but thats not uncommon down here.  If you choose to come in and dine make sure you ask for Tommy at the bar, great guy very knowledgable about the menu and friendly.  He waits on me each time  I come in and I feel like a VIP whenever I walk out.  Great location on 79th street, especially in a place where there aren't too many places to choose from."], ["Naty K.", "Mina's is an unusual place.  It's in a somewhat remote location, dotted with auto mechanic garages, a boat marina, an AA meeting place, yet close enough to the Boulevard.  It is a large greyish building that if you blink, you may miss it.  I had seen this business advertised on Yelp as a new business and thought it looked promising, so I suggested coming here to my friend.  We came on a Sunday during lunch hour.  The parking lot behind the restaurant is rather large.  There is an outdoor seating area and a wicker couch with red pillows.  You walk into a modern establishment with lots of windows and natural lighting.  Dark wood and grey finishes take over the place.  In addition to tables, there are some comfortable couch booths, where we decided to sit.  They are plush and cozy.  I looked around the inside and really liked it.  Very clean, modern, minimal decor, but appropriate.  The menu had many choices that looked good, everything from French to Spanish to Greek, a great medley of cultures, but I knew I wanted the stuffed cabbage appetizer, as it was highly recommended by Yelpers, and I wasn't sure about the main course.  The waitress was very friendly and pretty.  My friend, who is male, agreed.  The stuffed cabbage was delicious and flavorful.  The leaves were tender and the sauce was great.  I was hoping we'd get 4, instead of 2, as the Miami New Times reviewer claimed they served 4, but we only got 2.  My friend decided for the beef bourguignon, while I opted for the osso bucco.My friend found the beef interesting, as his mother makes it, but not chock-full of potatoes.  She serves potatoes on the side and so the stew is juicy.  Here, they put it in a bowl with mashed potatoes covering the meat, like a shepherd's pie, but as a result, it leaves the beef dry, so although tasty, he found it too dry.  I am not sure what the traditional/correct way is of preparing beef bourguignon so perhaps it's not supposed to be juicy.  My osso bucco, which is a lamb shank with a chunky tomato sauce, was juicy and the meat was so tender, I did not need to use a knife,  I really liked my meal, and the portion size was great.  The mashed potatoes worked great.For dessert, my friend had baklava (he's so predictable!) and I got the chocolate tart, recommended by our waitress.  It was rich and delicious but not very sweet and the graham crust was great.  The music was interesting, covers of Lady Gaga songs with acoustic sounds, and it wasn't too loud or overpowering.  Service was friendly and efficient, and she congratulated us for eating all our food.  I very much enjoyed my experience and would like to try the Greek dishes next."], ["Flora F.", "My reviews usually stem from bad food and horrible service, but this time I am compelled to share my amazing experience at Mina's.  I have not been on this side of town for a while, and am so glad this was my dinner stop last night.  First, the place is very cute, with just the right amount of old country décor and urban feel.  The building has these amazing windows that play very well with the interior lighting and set the mood.  Second, our server Juan, was excellent.  He greeted us right away, poured water and offered his appetizer suggestions.  Throughout dinner, he was very attentive and didn't seem to mind our indecisiveness or my endless questions about the ingredients and food preparation.Most importantly, everything we tried was amazing.  The dinner started with a sampling of the dips: Besara (amazing), Tzatziki, Baba Ghanoug (good but I'd like it with a tad bit of garlic), Spicy Feta (not what you'd expect but great), and Hummus.  Then we had Stuffed Cabbage (very well prepared) and Mussels (the butter, garlic and parsley sauce is incredible).  Next came the Moroccan Pizza (spicy and delicious) and the Greek Salad (was not too impressed as it seemed a little \"empty\" to me.  I would have liked to see the veggies cut in chunkier pieces).  We finished with a sampling of the Pita Sliders - Falafel, Chicken, Gyro, and Lamb.  All the meats were tasty and perfectly cooked.  I left my pita aside and just combined the meat with the salad and harissa that accompanied the dishes.  Lastly, although we didn't have any room, we had to try the dessert and opted for the Dark Chocolate Tart.  Needless to say, it was out of this world.  Also, the mint tea is a must as the after-dinner beverage.Overall, I am beyond excited for this up and coming restaurant.  Cannot wait for their brunch to start!"], ["Lyle C.", "Had dinner there last night and all I can say is \"AMAZING\"  79th street corridor has just had the bar raised with a restaurant of this caliber opening. Its very obvious that the owner has invested a lot of time, money and effort in this restaurant to make it perfect. And perfect it is. Plenty of parking and something on the menu for everyone.We look forward to returning soon."], ["Lana N.", "I attended a networking lunch there on Friday, 6/20 and had a great time. The food is very authentic and the spiced hummus was out of this world. I didn't get to see the entire menu as it was already planned for the event, but I'm sure the rest of it is just as good. The restaurant has an outdoor patio as well that looked lovely. If only it hadn't been raining. The only drawback is the neighborhood is a little dicey, but they have their own parking lot. That being said, I'll definitely be back."], ["Barbara R.", "We went last night with a couple of friends who ate at Mina's before.  The place looks good upon entering, but the menu is too 'eclectic' for my taste.  If I go to a Greek or Lebanese restaurant, I do not expect to see Penne Arrabbiata, Osso Buco, Paella, Coq au Vin or Beef Bourguignon or pizza on the list.  Not to mention Spaghetti Bolognese or Mac and Cheese.We wanted to order hummus, but our server insisted we tried the Besara dip and we all hated  it.  The hummus was decent, but nothing to write home about.  It was the tiniest bowl of hummus I ever did see: one bite each for the four of us and it was gone.My husband and our friend ordered the Chicken Kebab.  They didn't complain about it, but the portion was minuscule, probably less than 4 oz chicken, a handful of rice and a couple of pieces of pepper.  My friend had the Beef Bourguignon and was disappointed about the size, so they gave her another couple of bites of meat on the side. She also had to fight to substitute Brussel sprouts for potatoes.  My $18 Fish Tagine arrived in 3-inch diameter baking dish set on a large plate.  It should be called \"Potato Tagine\" as the mahi-mahi promised by the menu is barely enough to feed a Siamese cat. It was accompanied by a little bowl of extremely boring couscous that tasted like it came out of a box. Overall, not very satisfactory.Mina,  the owner, was there, but  she didn't bother to stop at the table to greet the patrons, something a new restaurant owner should do to get the scope on what people think.Everything tasted like home cooked by a very uninspired cook and the portion size is ridiculous, even for me and I'm not a big eater.   The place is nice and very tastefully decorated, but they need to seriously work on the food.  The owner said that she keeps the prices low because she doesn't need a chef.  The prices are not that low if you consider that what you actually eat is the size of a Gerber baby food jar.  There's nothing worse than going out to eat and feast on chips back home.The lack of a chef shows. Sorely."], ["Carolina M.", "Yea, well... it was ok but i was not blown away. I mean, nothing that impressed me so much that i am dying to go back and eat there again. I can pass up on this restaurant.But again, that is just me, i always have high expectations, and usually end up disappointed.Now, the service was friendly , our waitress was nice and the flavors of the food were good.Not amazing. I guess i am jaded.We were 3 people and we order wine to start. They do have a nice selection of international wines.We order for appetizer the pita ( waas just ok). The tzatziki was yummy but the babaganoush and the Bessara was not as good.I don;t even remember what my hud=biie ordered, that is how memorable the food is. My friend had the Beef Bourginon and he said it was very yummy. I had the Coq Au Vin and it was good but definitely very different from the authentic French Coq Au Vin.I find that the menu tries too hard to be international and with so many dishes from so many different cuisines i guess it gets lost.Overall and ok meal but like i said nothing too memorable. I could cook these same dishes at home myself and they will taste just as good. And that is not why i go out to eat to have my own food outside of home."], ["C M.", "Great food and prices! Just wish the portions were bigger or there was something more included like a side of bread and hummus... there was a nice variety though so we'd like to come back and try other plates :)"], ["Juan S.", "Excellent excellent excellent!A great new addition to the Miami dining scene.  Very cool restaurant in gentrifying neighborhood in the 79th St. and Biscayne area.Food is delicious.  Hummous and other spreads are very good.  Spinach pie is so good.  Tangine fish is great.  Kabobs are good, but nothing special.  Choclate tart for dessert was pretty good too.Overall a really nice surprise and definitely see myself becoming a regular here."], ["ROCKITSOBE L.", "My husband and I went for brunch. The waiter was super nice provided great service. We both had egg dishes which offered great flavor. We started with hummus and they had no problem giving us cucumbers instead of pita bread. Wish it was little closer to me!"], ["Elena S.", "We never noticed this restaurant the way the building is located, but once inside it's very cozy and welcoming. The food was very good. Definitely recommended"], ["Sal B.", "The pita slider sampler was fantastic (chicken, falafel, gyro, lamb).  Very nice set up, Old warehouse turned into a awesome Mediterranean restaurant. Very cool atmosphere, enjoyed pita sliders, spanakopita, mussels.  Save room for dessert (there is a dark chocolate treat with an almond crust that is fantastique! Definite repeat."], ["Steph D.", "I have been here for both lunch and dinner. Very reasonable prices for both the bar and food. Service was attentive and helpful. I really enjoyed the Mina's Pizza and Greek Salad. The pita slider burgers were okay. We had a the sampler...it was not my taste. The menu is very wide. Not just your typical Greek/Agean food, the menu also includes coq a vin and other French and Spanish dishes."], ["Star.rodriguez F.", "EAT AT MINA'S every chance you get!  You will not be disappointed on any level.  The food is BEYOND delicious, the service was spectacular, and I can't wait to eat there again."]], "Estiatorio Milos By Costas Spiliadis": [["Tracey S.", "This is your typical ridiculously overpriced, staff-thinks-they-are-above-you, food-is-mediocre, SOBE restaurant.Dinner for 4 , appetizers, 4 cocktails, and tip: $800.  Skip it.  It's a wannabe SOBE scene. If you are a foodie....this is a definite must miss."], ["Vinnie F.", "This is one of the worst restaurants I've ever been to. They have like 500 of the same wines and drinks and they only have like 12 drinks. Also the steak is dry and they do not serve ketchup. The retarded owner believes that nobody should have ketchup so the can enjoy the true taste of the food. Also when I was complaining about how dry the steak is this waiter got into my business and started to argue with me telling me that the steak is juicy. Also no wi-fi. #wow"], ["Oksana R.", "Originally from my hometown Montreal, Canada. This place is delicious. Fish and produce is all so fresh. I love the 25$ lunch menu: I start with the tomato (Greek) salad, followed by the Dorade fish and finish off with either fruit or Greek yogurt with honey. So satisfying."], ["Emily R.", "I was not impressed with the meal or the service. I saw several employees standing around as our finished plates piled up rather than removing them from the table. Our beverage glasses were not refilled unless we chased down a server. It took forever to get our change from our bill. The food was mediocre. Portions were small and under seasoned and horribly overpriced."], ["Camila G.", "The fish is very fresh , we went to the back where the fish was and choose the one we wanted. The wine list is awesome and the service excellent. The food is good but i missed a little more spices , found it a little bland but fresh and true to its flavor. The oysters were to die for. The greek yogurt with honey was really good!  Pricey but worth it ."], ["Cecilia T.", "5 stars for food, 3 for bad service and snobby servers. Came here with a group of friends. The menu was very limited in my opinion, but for what was available to choose from, the food was all delicious. I got the salmon tartare and oysters. All of my friends seemed to enjoy their food as well. So here comes the bad...The servers were not very clear about how much food you would get for the pound, because the seafood is all based on market prices. They were very pushy in upselling you. For example, when I went to order my oysters, which were listed at $4 each, I wanted to order three for myself because nobody else at the table wanted oysters. This is the conversation between myself and the server: I'll have the salmon tartare and three oysters pleaseOysters are generally served in half a dozen or a dozenBut I just want three. It says on the menu that they are $4 eachOk I'll talk to the chef and see if it's ok*insert unimpressed eye roll*Are you kidding me? It's not as though it's difficult to separate oysters...they come individually. If it was a matter of dividing a fish for example, I would understand. But he made it seem as though it would be a problem that I wanted only three oysters. In another example, my friend pointed to a particular red wine on the menu when she ordered. And when she got the bill, that one glass of wine was $25, and was not the one that she had pointed to. The server should have clarified with her in regards to what wine she actually wanted. Basically if you're going to come here, be prepared to spend a lot of money and to not be really sure about what you're going to get for your money."], ["Anhara M.", "We went yesterday recommended by a friend that went to the one NY. As suggested we ordered the grilled octopus it was good, not the best I've had but perfectly cooked. We tried the lobster pasta and the lobster was tender and flavorful the actual pasta was undercooked. Also ordered the halibut with cous cous, loved it. For desert we had the baklava which was okay. The service and ambiance was excellent. Overall I nice experience."], ["Marc B.", "Never a bad meal at Milos- YES expensive - but the BEST seafood- This is a restaurant for people who want the best food and service- A calm in the storm of bad  expensive restaurants in miami- Excellent service, great food- beautiful room- what else can you ask for- We came with our 7 year old and two infants- we were treated so well- the waitstaff is amazing and always has been- we come here every time we are in miami- our one year gobbled up the salmon.  Just as good as new york but quieter room."], ["Ethan Y.", "I was everyone's review on Yelp.  I had the much revered octopus sashimi.  Meh.The lamb chop wasn't flavorful.  I mean, come on, it's a Mediterranean restaurant, right?  You can't mess up lamb chops.  Why do you have make everything high end taste like French?!Well, I don't know.  The ambience was definitely fantastic and the fresh oregano is a great touch.I was sitting at the bar and I wasnt served water the entire time.I sat down at 8:20PM and I wasn't asked what I wanted to order until 8:45.  Sigh."], ["Adriana O.", "Completely overrated.food was ok, but not for the price you pay. Place is nice though. But, I would not go back, once was enough."], ["Kristin W.", "I came for lunch on a Sunday.I had several items: grilled octopus = awesome, authentic Greek salad = refreshing, lobster pasta = eh, it was ok.I will definitely be back here."], ["Grace R.", "Excellent service and delicious foodI went with a friend for lunch and the restaurant has a price fix menu $25 for 3Courses.   We had the meze plate and tomato/feta salad, shrimp saganaki and salmon for main course and Greek yogurt and fruit for dessert.The staff was very friendly and super attentive.  The tzatziki was fantastic - just wish it came with some pitas so I could eat all of it.  There were two shrimp but they were large and it was actually quite filling meal by time I got to dessert.  The Greek yogurt had honey on top and it was fresh and unlike any other Greek yogurt I've had.Want to try dorado next time"], ["Oliver O.", "Again and again and again...We have been to Milos several times and the experience is always very pleasant. The waiters are friendly, knowledgable and attentive. The seafood is amazing and fresh. Last time we were there with my visiting parents and ordered their Greek salad (Tomatoes are from a different planet, amazing) the grilled octopus is a must. For the main course we went for the Branzino in salt crust. The taste of the fish was perfect and it was cooked to perfection. My father a chef of 50 years was stunned by their food (happens very rarely). We will be back for sure. Milos is expensive but worth every penny!"], ["Alessandra G.", "The restaurant is beautiful and the fish is always fresh. We ordered the charred octopus starter and the Greek salad to share as appetizers and then ordered a dorado. The fish was grilled to perfection and was so flavorful. I definitely recommend ordering the fish on the grill to share as even the skin is perfectly crunchy and delicious. Everything was perfect."], ["Michelle G.", "Amazing Meal! We have eaten at Milo's in NYC and Las Vegas and it never disappoints. Friendly staff , excellent service and amazing food! Great cocktails and wines! Even child friendly ."], ["Laurie S.", "This is one of the most pretentious and overpriced restaurants I have ever been to. I went on Friday night August 7th with my husband, his brother and my sister in law. Where shall I begin? We are seated promptly and asked if we would like to see the fresh fish choices, our head waiter took us back where there is a lovely display of whole fish, lobsters, shrimp and more. They seemed to be pushing the New Zealand red snapper even though they had beautiful local red snapper and some fancy giant red prawns. They explained in great detail about each fish including where it came from, the flavor and consistency and the portion size.We were re seated and they brought Greek olive oil and the server cut in fresh oregano which looked and tasted lovely, this shred the table with warm crusty bread that I believe was the highlight of the entire meal. I wanted the local red snapper but was told the snapper was too big for one person, my brother in law and sister in law ordered Bronzino and the Greek salad to start. My husband was on the fence also wanting red snapper, again they said it was too big for two and perhaps try the fish from New Zealand. This seemed crazy to me and they suggested we all have Bronzino. I ordered the large Greek salad as my entree and the rest shared a Bronzino which cost $150 for the three portions with no sides. The fish was moist but flavorless and my sister in law kept drizzling it with olive oil. My salad was unremarkable at $30 . I expected a memorable Greek salad at such a highly rated Greek restaurant but it was easy to forget. I give the restaurant two stars because the servers (under our head waiter) were so nice, the place was spotless and the bread / olive oil was outstanding. The food left me wanting something more. My suggestion is go for a drink at the bar and order an appetizer and a bread basket.Please do not think my complaint is purely on the price because the night before we ate at an outstanding Sushi restaurant where the bill was way over $500 for the four of us but the food and service were spectacular and all four of us said what a delicious and memorable meal it was.I resent the fact that they show you all the different choices but then tell you for one person you can't really have anything but a whole fish which serves two three or more, what if everyone wants something different, what if I prefer local fish not fish flown from around the world? I think this is a place to see and be seen, so if you really care about good food more than being at a pretentious 'in' spot skip this restaurant."], ["Annette P.", "Absolutely wonderful.  Great fresh seafood prepared perfect.  I had grilled octopus and shrimps. Then Greek salad and pork chops. Cooked to perfection.  And of course can't forget baklava and yogurt. And if you really want to appreciate the restaurant go for the Greek wine. Also delightful.  The service is great. Never had to ask for anything.  It is expensive but worth the money. Will be back"], ["M W.", "DO NOT GO THERE ! HORRIBLE SERVICE. OUTRAGEOUSLY OVERPRICED! We had a reservation for over a month on a SUNDAY night. Arrived on time and were told 10-15 minutes. After 30 mins were told 5 mins more. Meanwhile friends of the maître d arrived after us and were seated immediately. After an hour complained to the GM and were finally seated. Charged $80 for a single serving of snapper. Will never return."], ["Julien D.", "Food and service is excellent. Lunch menu is ideal if you want to stay in the 5 star review. However this places cannot hold 5 star for me for the simple reason that prices are over the edge. Isn't it the subject where all Miami Beach restaurants gets their trend nowadays? However, being the most expensive of all won't get you at the top of my list. Pricey would be fine, fishes coming all the way from the Mediterranean Sea are not cheap but their is limits to my generosity. I will go back for sure but mostly for lunch. I recommend the grilled octopus salad. Probably the best I ever had in the U.S yet.I am certainly raising from 4 to 5 this updated review as the price even if it is still a bit over the top at night remains now far from other places such as Juvia which way over rated...Besides, after so many visits I realize and must admit that the service is one of the best in town!!!"], ["Josh B.", "My date and I got violently ill after eating here on Valentine's Day. The food was great and the service was good for Miami; no one waiter pays attention to the table so much as a collection of waiters handles tables to try to not miss anything - they mostly did not miss a beat. While the prices are crazy, they're forgivable if you walk away without getting sick. Unfortunately, my dinner experience continued until the wee hours of the morning and I cannot recommend Milos in good faith."], ["Tiffany R.", "Love it went here the ambiance was nice and the fish was really fresh so was the shashmi"], ["Camille O.", "Exquisite! Good selection for Miami Spice. The octopus appetizer was delicious ad well ad my Lamb Chops. My boyfriend had the Cod Fritters and Dorade, both equally good. We ordered from their regular menu the Ceviche. It was very fresh and had feta cheese sprinkled on top with fresh herbs. I've never had ceviche served like this and must say that it was delicious if you like feta cheese. The Almond Cake for dessert was very moist and not too sweet. The design is very elegant in a casual manner. I loved the fresh fish display. An impressive kitchen is exposed for everyone to see. We were treated very well. I made a reservation for 8:30 and got seated immediately. 40 minutes later the restaurant was packed even though it was on a Monday. Will come back on a special occasion since it's on the pricy side."], ["Jelena P.", "I have been to Milos at least 4 times since opening and their service was never great. Food is good, not mind blowing for sure but most of the dishes I had there were good( except very salty). I am amazed that this place hasn't improved their service since they opened but it's not bad enough  not to go back for the ambiance and grilled Branzino. lol"], ["Mike W.", "This place was nothing less than fantastic!  Despite the less than affluent appearance of some of my party, the treatment and service was top notch.  The seafood offerings were top notch and the visual menu was a great touch.  The raw bar offerings were equally impressive.  If you're ready to drop some serious cash on a dinner out, I strongly recommend Milo's."], ["Lori D.", "Ok, so yes the decor is splendid and almost whimsical, for that matter. For that, I give 5 stars, however, with regards to food and service...meh. Wasn't too impressed. I'm a big fan of value for what you get and here, you don't really get much. I don't mind paying hefty prices for darn good food AND service. Here, I can't say that either were amazing. Not for those prices. If you're looking for a sci sci glamour type of \"see and be seen\" venue, then yes, you'll enjoy. But if you're a true foodie and enjoy creative dishes with some pizzaz, I'd pass and find another spot. Miami is notorious for its restaurant scene so please...do your research!What did we have? Fish. With lots of bones. Lamb chops were good, but I don't know many high end Mediterranean style restaurants that goof lamb chops. Drinks were pretty stellar, but there are sooooo many fabulous places to shell out that kinda cash so I'd hit up some other spots before landing here. It's likely we won't be back (unless I'm invited, of course!) ;-)"], ["Lori W.", "The date-night location to propose! This dining experience was AMAZING. I'd never had greek food before so I was a little hesitant going in but as soon as I walked in and was seated I had a feeling it was going to be a great night. The inside itself is beautiful (hence the reason why you should bring your gf and propose) with candlelit tables, low playing music, the very elegant dressed staff, and the beautiful fish on display. Our server was ever so attentive, I mean I guess he has to be considering how pricey the bill was, but he was very helpful in explaining the menu and pointing out what things we may like to eat as this was our first time. We went on his recommendation and ordered a few drinks, tomato salad and some large fish that I can't remember the name of. I can't remember the name of the fish for my life BUT the fish was the best fish I've ever had and that's saying something because I typically eat my fish raw (sushi) or not at all. This fish was cooked to perfection, buttery soft, falling from the bone! My experience at this place was fantastic and I would definitely go again and recommend it to my friends but I will say that it is one of those types of places where you go to be seen, which I'm not particularly fond of but being that this was the first time it was ok."], ["Nicki B.", "I just enjoyed this place for lunch. They have a price fix that in includes 3 courses. Starts at $25 per person but can go up. There olive oil is a little too grassy. I  recommend the seared scallop as a starter but not Mediterranean Sampler, it's to strong on the cheese flavor. The lobster pasta was incredible and definitely worth the carbs. And the lambs chops are a must. The place is located a little ways for the main strip on Collins Ave. The location appears less tourist like. It's a great looking place. A feeling of summer breeze and Mediterranean Sea from the glistering panels of stone on one wall. The ceiling have intersecting golden woodwork. The light fixtures spherical and soothing. I love the white sheer tapestry."], ["Jaimie A.", "One of the worst dining experiences. For as expensive as it is, service is not up to par. We waited so long for bread we finally asked the host. And there is a runner just for bread! Then he started taking the bread away when I was still eating it! A runner also tried to take my drink away when I wasn't finished! We left after appetizer. For $36 for ceviche, I wasn't impressed but then again I was so stressed from the experience I couldn't enjoy the food. Other diners, you could tell, appeared frustrated, looking for their food and the staff seemed very overwhelmed."], ["Georgio S.", "2.5 stars....Really beautiful restaurant with expensive food and terrible service. Dinner for 2 was a 3 hour experience $400 bucks. The food will not wow you it's decent Greek food humbly prepared. The service is really confusing. First someone comes and takes your order than she disappears. No bread,no refill wine nothing. Tables around us had similar problems. Had to look for the closest staff member to refill my wine. Had there been decent service perhaps I would of bought another bottle. In order for this restaurant to succeed the management must reevaluate how the servers are trained. I will be sure to try back in a few months and see if the restaurant improves."], ["Paulo B.", "Please guys,i LOVE the food ,but the music is the WORST. Portuguese Fado and other depressive tracks.Please buy a good music TrackThanks"], ["David R.", "Beautiful decor and ambiance.  but nothing bothers me more than a table for 2 that is less than 6 inches from another table of 2.  The food was excellent and well prepared.  The servers were helpful and polite.  The prices are pretty steep but that shouldn't surprise you given the location.  I was pleasantly surprised by the Greek yogurt dessert.  It was unlike any other Greek yogurts I had eaten, almost tasted like an ice cream.Overall I'm not sure i need to come back but I enjoyed the meal."], ["Danielle H.", "Awesome food! Amazing sea salt crusted branzino. If you make a reservation you get seated immediately. Great service. Just expensive but worth it."], ["Jody M.", "This restaurant is gorgeous!! The wait staff was very attentive, but I wished the menu had more options. I would have given this restaurant 5 stars if it wasn't so ridiculously over priced. Yes the fish is spectacular..... Should one Branzino cost $150 - I am not convinced."], ["Mimi A.", "All I can say is WOW! The wine selection was amazing! We bought a bottle of Chianti and a bottle of Barolo that were exquisite. Besides the wine, the service was phenomenal. Chris took care of us and I don't have enough amazing things to say about him. If we got up from the table our napkin was folded perfectly when we came back. We had new plates after every course. Our waters were refilled and our silverware was replaced. I have worked at restaurants for about 15 years so I'm very observant and particular w my service and and this place was perfect. The food was OUTSTANDING!! We had the salmon tartar and the ceviche... AMAZING!!! We had grilled veggies and stuffed flowers (I forgot what kind) then we had carabiners shrimp with a Shot of Sherrie.. DELICIOUS!! Our dinner was a sea salt crusted red snapper which we hand picked!  This was the juiciest most delicious snapper I've ever had! Also, Chris got every server to sing my mom happy birthday! As a long time bartender I have always hated singing happy birthday!! Chris got every single server to sing my mom happy birthday and did it w a smile!! He definitely made it an extra special evening!  I am so glad we found this place. We will definitely be back!!"], ["Arina A.", "For me it's the most delicious place in Miami. Kids friendly restaurant! Good service. It's the ONLY place were I really want to give tips! I'm pretty stingy and prudent, so I love this place for its value for money, for the high price I get a decent service."], ["Drew D.", "I'm basing my review off of Miami Spice 2013 menu. First, I must say, this restaurant is stunning. Not a detail goes unnoticed. The service is impeccable, the interior is sleek and clean and the wait staff is well staffed! For the starter I had the grilled octopus served with a hummus while my husband had the raw plate which featured two oysters, tuna sashimi and larvaki sashimi. The presentation was almost as stunning as the fish. My octopus was cooked to perfection and full of flavor. The Main course was Colorado rack of lamb that was gamey and delicious. My husbands lavraki was flaky and full of delicious fresh flavor. We both devoured our plates, which were generous portions. Milo's was an amazing deal for Miami Spice  especially given the high price of this restaurant. We were wowed and will definitely return to try the regular menu!"], ["Eve C.", "The only thing that keeps Milos from earning that coveted fifth star is its prices.  The food is amazing, the service is stellar, and the space is open and airy - there are so many pluses that it's easy enough to overlook the prices.  But for many of us - locals and tourists alike - an $80 per person meal is just not feasible much of the time.A friend and I strolled up to Milos on a rainy weekend night with the intention of grabbing a couple of seats at the bar for dinner.  The place was packed!  Every seat at the bar was taken, as were most of the tables in the spacious dining room.  But within a few minutes, we were able to snag those coveted bar seats, and our dining adventure began.My friend was a seasoned Milos veteran, and knew exactly what to order - the charred octopus and the \"Milos Special\" as starters.  The charred octupus was outstanding - the perfect texture (meaning not too chewy), with just a touch of herbs and olive oil on the plate.  The \"Milos Special\" - a tower of super-thin crispy zucchini slices and fried kefalograviera cheese, with a hidden pool of super-creamy tzaziki sauce underneath was divine.  Despite the fried nature of the dish, neither the zucchini nor the cheese were greasy.  These starters are perfect for sharing, and could potentially be a meal in themselves.For our main course, we decided to split the halibut filet, which was grilled, and presented in a light bath of olive oil, along with some fresh steamed broccoli.  Our server/bartender had warned us that there'd be some bones in the filet, but there weren't too many of the sneaky suckers, just a big t-bone like thing in the middle - which made it very easy to avoid.  The fish was cooked perfectly and was delicious.I'd love to return and splurge on one of their whole fish or salt-encrusted options, with some of their fresh-from-Greece selection, but if you think the other menu options are pricey, these take it to a whole other level!Overall, the meal was great.  The charred octopus was definitely the stand-out, and will become a must-order on all future visits.  But the hard truth about the prices - with a drink a person, sharing appetizers and even entrees, expect to spend roughly $80 a person, including tax and tip.  However, you could very easily spend $120-$150 a person with more drinks, the pricier fish options, a side dish or two, etc.We had an amazing meal at Milos, but I'll probably reserve it for special occasions (or the occasional splurge) only.  If Milos dropped their prices just a bit (to make it say, $50-60/person with a drink, tax and tip), I'd be there quite frequently.  But that doesn't appear to be happening any time soon."], ["Beini X.", "First time I went there was with a business meeting. And all the food tasted so good that I take my mother in law and husband there again last weekend.Wonderful place to have lunch with family. Tomato Salad is amazing. all seafood is fresh and delicious. The Greek Yogurt is a must try. Mom loves it , so as long as mom is happy I am happy"], ["Donna S.", "Truly amazing food. Just pray some one has an expense account or black card and have patience with the staff"], ["Paul K.", "THIS REVIEW IS FOR THE LUNCH SPECIAL ONLY. What a great great deal. $25!!  Appetizer, entrée & desert. The place is beautiful. The food is always great. It's really the best.  Give it a try. You won't be disappointed."]], "Daily Bread": [["Meh G.", "This place used to be very good 4-5 years ago but their food and service have declined significantly. They usually heat up the meat and the bread in a microwave right in front of you and they charge you for the basic stuff like extra tahini sauce. Their market has a decent selection of middle eastern items but definitely overpriced."], ["E Alexander G.", "Great family run business, with excellent fresh food. As a vegetarian, I have always appreciated that there are so many options...even if I do default to the  falafel sandwich on most occasions!  Hard to believe I have been coming here for more than 30 years, and now loving the new Dadeland location as well."], ["Cassie G.", "I pulled into the parking lot of this shopping center with one thing on my mind: a cold cut sandwich from the German deli. Much to my surprise, it was closed for the day (who closes on Sunday AND Monday?!) and I was in disarray. With my stomach grumbling, I scanned the other stores hoping something would catch my eye, that's when I settled on Daily Bread knowing that I had read about it on Yelp before! All of those hours of procrastinating and bookmarking places finally paid off... I walked inside and knew that this would be a great place to grab something to take home with me. Before I ordered, I snagged a small container of hummus and headed to the counter to order my falafel plate accompanied by tabouleh, eggplant dip, and a cabbage salad! I got the sauces on it all, a couple wheat pitas, and was out the door! I was impressed by the friendliness of every single worker here and they were happy to answer all questions, make any substitutions, and wait for me to decide. I got my food home and enjoyed every last bite. The portions were huge so I even got to save half for lunch the next day and it was still tasty. I tasted a bit of the hummus and can say with certainty it beats any supermarket variety. I will definitely be back when I have a hankering for some Greek food, I'm certain everything from their gyro to kibbeh is delicious."], ["Caroline M.", "Be ready to pay for basics, like tatsiki (sp?) sauce for gyros. Also, check your bags with take outs.Food is good but super disappointed with service and unnecessary charges"], ["Carla L.", "When I am in the area I stock up on the supplies I need to make my daddy's family recipes. My hubby and kids are always hoping I get into the mood to wrap some of Papa Felfle's grape leaves. I also grab myself a bite, some amazing Lebanese style Pita, and olives. The prices are always pretty good and the service always with a huge smile."], ["Jimmy B.", "Fresh and healthy"], ["Alex A.", "I eat here all the time seeing as I work in the mall. It has really good, fresh food. Unlike the other food court options, it's not laden with grease and breading. That bek g saud, they have the BEST french fries in the food court (tied with CHikfila). They have great hummus and tabbouleh as well as a chickpea salad and a mixed veggie. I usually get the chicken platter with veggies and hummus but I switch it up. The gyro is amazing. Something serious hides inside their tzatziki sauce. Ask for dressing on the side when your order a Greek salads as it can be rather sour and for me dirsnt need the dressing. occasionally theyll being in a new item off the menu and its never dissapointed. Also The staff is always friendly and welcoming. It was such a great upgrade from the previous place (Mr.kibeh)"], ["Chip D.", "I had the falafel platter with hummus, taboulleh, garbanzo and fava salad, hot sauce and it comes with good pita. Absolutely hit the spot! Hummus was as good as it gets, probably as good or better than mine...It's cafeteria style and you can be eating in less than 5 minutes. There is a store there that sells all things Middle Eastern and the food is also sold by the #.Great, polite and pleasant customer service!Hidden in a small strip mall.Price issues?? What in the hell is wrong with you?12.50 with tip & bottled water??? BTW it was enough to feed 2."], ["Stephanie N.", "Thank you, Living Social! I wouldn't have tried it without you!I have to say, trying new places is my favorite part of this whole coupon revolution. Thanks to Living Social and a couple of positive words from Yelp, this was a deal I just had to grab, especially because I'm part Lebanese and Middle Eastern food is the bomb!So, first of all, the staff is super friendly and attentive, they make you feel right at home and answer any questions you have. I had the gyro platter. All platters come with two sides and a choice of rice or salad. I chose the salad, hummus and tabbouleh. The gyro was topped with tzatziki sauce which was just perfect inside of my whole wheat pita! The tabbouleh, on the other hand,was not my fave since it had mint (I'm not used to that) but it was not bad, still very fresh. The hummus was the best I've ever had. Period.Also, don't forget to try their fresh spanakopita and baklava. The walnut baklava was to die for! I loved this place!"], ["Madison S.", "Food is cooked before and is sitting behind their counter an when you order it they just zap your chicken or meat in the microwave to heat it up.  Why do I want to go and get something not fresh and pay close to $11 for a platter. I got the chicken platter and the meat had no flavor an was tough and cold in the center even after microwaving it. Also the other meat on display was their gyro that had been previously shaved off and put behind the counter. It looked all dried up and old.  I love middle eastern food and have tried plenty other places and know what's good tasting and fresh. Daily bread is the worst middle eastern food I've ever had because it has no flavor and it's not fresh."], ["Meghan A.", "Mmm.. this place is yummy. I always stop here when I'm craving Mediterranean (which happens often). I usually get the gyro platter or shish-tawook (chicken) platter. It's casual, quick, fairly inexpensive, and satisfying.They also sell yummy treats like baclava and those little sesame seed candies, turkish delight and grocery items to cook your own Mediterranean food at home if you're a pro. Awesome right?!"], ["Zina A.", "YUMMM!! i cant believe i never saw this place before! i have only tried they gyro platter but it was delicious!!! im so glad i found a mediterranean place a few minutes from my job. I am looking forward to have lunch there often. the hummus was very good and the lamb was very good."], ["Roger A.", "The service at this place stinks. Specifically there is a fat girl who has worked there for years, who is very rude and bitter all the time. Every time I go I dread having her take my order as I know it will be an unpleasant ordeal. I used to tolerate it because the food was so good but over the last year the food has gotten worse and worse. They no longer offer Shawarma and they no longer make the sandwiches with pitas instead they use a sort of flat bread. They put Tzatziki sauce and if you ask for tahini you get an attitude and more bad service. If you ask for olive oil for your hummus you get attitude. Never mind that it should come with olive oil by default. If you ask for a side of tahini for your kibbe again you get dirty looks and attitude. I have been a customer for over 10 years but honestly I no longer go. It is a shame because the Daily Bread was my favorite middle eastern market."], ["Elle M.", "I used to love this place - until I discovered Mediterranean markets just like it that will cook your food when you order it. At the daily bread, falafel is made ahead of time and microwaved when you order it. They do have good Spanekopita, but it is best to get there when it comes out of the oven at around 11 am cause those too will be microwaved. The final straw came when my bf and I split a sandwich and both became violently ill within an hour of consumption. Good to buy products for cooking at home but there are better Mediterranean restaurants with good, cheap food."], ["Tricia K.", "Don't feel like cooking?  Head over to the Daily Bread in Pinecrest!  Get a gyro sandwich or platter - my favorite!!  The pita bread and hummus are good too!  While you are there, pick up some pastries, olives and dates too!!  Lots of great Middle Eastern stuff.  Great service.  Family owned and run."], ["Brad B.", "Great food and very nice staff.  The place is always clean and the food is  fresh.  The desserts are great too.  I really enjoy grabbing their various platters... their kibbeh and falafel rocks! Since it's family run, the quality is always there.  You gotta try it!"], ["Elizabeth C.", "The other day, my boy and I stopped in for an unexpected lunch. I wasn't that hungry, only because I had recently stuffed my face with sushi with friends after school (AKA work; we teach). I just had to order something, ya dig? I got baklava, and it was heaven-sent. I usually never have room for dessert here, so I never got around to their baklava. Let's just say I will be having a little cylindrical piece of heaven with a shell-like drizzle of chocolate on top from now on. I also recently tried moussaka. You guys, moussaka is lasagna...but better...with...wait for it....no carbs! Yes, I know, I've changed your life. Go have a square."], ["Carolyn D.", "I have fallen in love with this place.This is a cool family owned business that has been recently renovated.  They have expanded the market/restaurant  area to include a coffee bar. If I am not mistaken, they have wi-fi too!The food is incredibly delicious. So far, the gyro and the spinach pie have been the tastiest things I have had there. I also recommend the falafel sandwich and kibbeh sandwich. The angel kisses are a wonderful dessert. The service is the best part. They will bend over backward to make sure you are satisfied. I definitely recommend this place HIGHLY."], ["David H.", "Just say Yes. We ordered the falafel platter with tabouli, hummus, pink cabbage salad, and pita bread. We just said Yes to all the offered sauces and additions (except the onions - - we had black olives instead for 75 cents more). What a deliciously light fresh taste everything had - -  we were worried about the tabouli based on some other reviews but they seem to have gone back to the original recipe. The tabouli and hummus were fluffy, slightly lemony, spiced just right - -  best I've ever had in a restaurant. The falafel was crunchy on the outside, soft and tastey on the inside, again, the best I've had in the US. The pink cabbage salad (can't remember what it was called) was wonderful, delicate and fresh tasting.  The portions were generous.  It was counter service only but the seating included booths that were clean and the atmosphere was pleasant. It was busy but not overcrowded when we were there (4 pm) and you can't beat the prices. We will be back."], ["Ashley S.", "Yum, yum, yum!!  Me and the work gals were bored with the same old, same old in our Dadeland lunch spots and all wanted something different.  We all, coincidentally, had a craving for Greek.  One of us remembered someone mentioing this place, and I am so glad we went.  The food was delicious and like the Greek food you get up north in authentic Greek communities (see Chicago!).  We each had the gyro (that's pronounced HERO!!!) platter; two of us had the babaganoush and hummus side and the third had the hummus with rice.  Each of the platters came with pitas and a side salad--including yummy pickled cabage.My lamb/meat was so tender and delicious!  The babaganoush was the perfect consistency as it can sometimes be too creamy.  I will definitely go here again.  I love that they also had a market and one of the ladies got a package of the meat pies to go.  My only gripe is that it was counter service--which actually probably saved us money and time--but I was just in a princess mood and wanted to be waited on.  Just a tiny gripe!"]], "My Little Greek Deli": [["Megan A.", "AUTHENTICAnd delicious! The foods is so amazing and the servings are Hispanic-style generous. The owner is so sweet and pleasant and just happy to help. Great staff and amazing food."], ["James P.", "I'll start by saying i use to be a regular here but due to their slow service, it has changed. Everyone from work has decided to start ordering by phone and still service has been terrible. We decided to give them another shot today so we ordered our food for 4 people at 12:25pm and they told us 30-35 minutes. We left the office at 1 and arrived at 1:15. After asking if our food was ready, we were told it would be another 15-20 minutes. Mind you, we only have 30 minutes for lunch break so this was a real incovenience. There was other people there also waiting for their order and stayed longer than we did, since we left before them. The worst part is they didn't even apologize, they just said they're busy. We finally received our order at 1:55pm and complained about the ridiculous wait. Even suggested for them to give customer a more accurate time frame to pick up or at least a courtesy call. The guy completely ignored us and said yea but were busy. This was completely unaccceptable and i refuse to ever go back no matter how good the food is.You thought i was done??? NO! To put the icing on the cake, while we were eating my coworker found a good size bug in her salad (pictures will be posted). This is what just put us over the top and theyve lost our companies business."], ["Candace R.", "Really good little place for lunch! Skip the hummus and go straight to the chicken pita or gyro. The hummus was good but pricey compared to the rest of the menu. The chicken was seasoned perfectly and I could eat that all day. Pay the 50 cents extra and add feta. Coleslaw was good, but nothing special. My husband had the gyro and Greek salad and said it was delicious."], ["Jazmin H.", "Great, great little hole in the wall! Been here on several occasions and this spot never disappoints. They are open late, the food is always freshly made and the staff is extremely kind. Huge portions for an extremely fair price!"], ["Steve B.", "I arrived at this place just about 45 minutes before closing and my girlfriend noted the high reviews on Yelp. I was slightly hesitant because it was very close to closing and we noticed only one person inside. My better side told me to forgo the lack of people and try it out. I'm extremely glad I was convinced by my girlfriend to walk inside. This place is a traditional and typical Mom & Pop place, most commonly found in the Miami Springs area. It has a true diner/deli feel and I felt as if I was eating in their home. I ordered the Fried Eggplant and for my main meal I had the Greek Lasagna with a Greek Salad and my girlfriend had a Gyro Greek salad. The portions are pretty big and enough to share. The prices are affordable and the menu is pretty extensive. I spoke to the owner Betty who was extremely nice and helpful with her recommendations. The restaurant has approximately 34 types of Greek salads. So your choices are basically endless. I can't wait to return and try the rest of the menu."], ["Cid P.", "Food is amazing here and oh my God they are so nice but, there is something you just need to know. Today was my second visit. I could have written a  Yelp after the first visit. I was like, no...I need to come back. Maybe I came on a bad day. Again, the food is amazing and the employees are so freakn' nice.Today, for the second time, I was left just sitting there with an empty plate and longing for another beer for what seemed like an eternity. The young man dining beside me finally flagged her down. Were they busy? Nope, they weren't. Both times I came here was after their lunch rush was over. I have passed by, between 11:30 and Noon more or less, and this restaurant gets swamped.So, for the second time, I was brought my bill after a long wait, still longing for another beer. Maybe two more. Work on that and I'll gladly issue you more stars. On my first visit I had:Spanakopita - It's a spinach pastry-like thing. It was good. Just very filling. Keftedes - Basically, Greek Meatballs. They are amazing. I had this with Greek Rice and Onion Rings. DELICIOUS!On my second visit I had:Lamb Shank - I had this with Greek Potatoes. This entire dish was left at the waitress' recommendations. DELICIOUS! You've never had lamb before? Don't worry. Today was my first time. I just wanted something really authentic. If you've never had lamb but would like to, I recommend having it here. It doesn't taste like chicken. It doesn't taste like cow. It tastes like a lamb I guess but, with those Greek Seasonings it's cooked in, you will never know you're eating one of Bambi's closest next of kin. DELICIOUS! I will be back.Things to note and blah, blah, blahs:* Parking - OH MY GOD! YOU CAN'T FIND CURBSIDE PARKING? Relax. Directly behind this restaurant there is a free parking lot. * Ready to pay your bill? I saw it happen again today. When you're done eating, you grab your bill and walk to the register to pay. I didn't know either. * Today was my second time having Greek Food, the first visit here was my first time, EVER! What a Foodie, eh? * On both occasions I was left wanting to order other things. I rarely go to Miami Springs. Do I recommend coming here to eat? HELL YES I DO!DELICIOUS and they are genuinely so nice. But yeah, only three stars because asking a customer, \"would you like something else\" before bringing the bill is just common sense."], ["Sheetal B.", "Exceptional customer service..I ordered the let it be Greek gyro which came with gyro meat(80% lamb 20% beef),chicken,roasted red peppers and onions.I only realized this when my order came to the table..Since I don't eat either beef not lamb, I would have been satisfied separating the meat myself but the waitress kindly took my order back and replaced it with a chicken only gyro.   Highly recommend the calamari for appetizer you wouldn't regret it. A gem in Miami Springs"], ["Melli B.", "We arrived just before the lunch rush and it's a good thing because this place gets pretty packed! Seems the patrons are mostly cops, firefighters and detectives. The staff was very nice but a tad bit slow. I think it's because of the amount of patrons they receive daily versus the amount of staff they have on hand. I've only seen the same two people working when I've come here which is ok, I guess, if you're in no rush. The food is pretty good. I've had the platter with Greek salad, hummus, pita, and spanakopita. All fresh tasting...all delicious! Just be prepared to wait during lunch rush but outside of the wait, it's definitely worth it! Food is goooood!"], ["Arlyn G.", "Went on a Friday night and it was packed! Sat at the counter. Ordered the chicken platter (2 chicken breast, greek salad & onion rings). My husband had the gyro pita with onion rings. The food was great and portions were huge. We also had the hummus that was very good with pita. The service was by far the greatest. Will definitely will be going back!!!! TIP: they have Greek wine & beer"], ["Wii H.", "Believe it or not but Omaha Nebraska has great Greek restaurants. I was spoiled for 10 years, eating great Greek food in the middle of nowhere. Now, I have been given the gift of this lovely restaurant near my home. A family owned restaurant run with passion and love, offering huge gyros, incredible lamb dishes and homemade desserts! They are all about fresh, so when they run out it is because they do not want to sell leftovers tomorrow. If you want lamb for dinner, call ahead to reserve and don't be late or they will sell as demand is high and they don't waste food! No Miami time allowed. Lovely family, you will fall in love with the food and the family."], ["Valerie Y.", "We had the most amazing experience here!! It was recommended to us by coworkers, and I'm so glad we went!!It's the little neighborhood spot you always dreamed you would find. Small, welcoming, great food, very reasonable prices, big portions, clean....we were made to feel like Family!!  Service was very fast!This little hole-in-the-wall gem is located on a corner, and we found street parking directly in front.We ordered (1) the gyro platter which came with a lot of meat, amazing lemon potatoes, a fantastic greek salad, and warm buttery pita bread and (2) the Mediterranean combination which came with grilled chicken, delicious spinach pie, and a fantastic greek salad.After we left, we literally talked about the food for half an hour!!! It was that good!!!!I cannot wait to go back!!!"], ["Mathew C.", "Wow!! It was delicious! I picked up two Gyro Pitas with salad and a side of onion rings to take home for lunch with my wife. They were super busy during lunch and I would recommend calling ahead for take out. The Pitas were huge with more meat than I have ever seen on Gyro. It was chunks of delicious meat, not thin shavings. The onion rings where delicious and so was the salad. We had to save most of the salad as we were so full from the Gyro. The staff was very hardworking and friendly. The prices are very reasonable. I can't wait to dine in and try something else. Very good. Thank you!!"], ["Maria D.", "A must try hidden gem in Miami Springs. Great food; great service!!!Try the Crete gyro salad, the lamb shank or the gyros_ all fantastic.The owners greet you & serve you. We'll be back... Soon!"], ["Jacquie N.", "This is the go to local restaurant for the Fire Station in Miami Springs. Yea, it is across the street. No, they do not offer a discount. The truth is, the food is not only damn good but consistently good. This is a mom & pop place that works hard to please. Proof is in the plates and the swing through firefighters who ask \"where is that Greek place everyone talks about\""], ["JoCat R.", "Yum! Great lamb gyro with lemon potatoes with a drink for $7.99!! Now that's a great lunch special if you ask me :) Absolutely delicious."], ["Marilyn V.", "Best Greek food , I've had in a long time ., the Mykonos Salad was amazing ., best hummus - our waitress Betty was exceptional!!!!!"], ["MICHELLE C.", "Delicious Greek food literally down the block from my office.  Yesterday I was starving so I walked over.  Small dining area and they stay very busy.  Next time I will call my order in.  Although I ordered at the counter for take out I did not have to wait long at all. The menu offers salads, pita wraps,  sandwiches, platters, and desserts.  Very cute restaurant inside and the young gentleman who took my order was super friendly and fast! I ordered a Chicken pita wrap which came with Taziki, lettuce, tomatoes, deliciously seasoned moist chicken and a side of fries.  Oh my it was less than $10, a good size with plenty of chicken.  Super fresh lettuce and diced tomatoes.  Fabulous food and I can't wait to try some other Greek delights! Excellent service, great food, and very reasonably priced."], ["John L.", "Small hidden Gem in Miami Springs Area. Tiny but clean and nice location. Every time we go and try something  new  it gets even  better. No doubts! Always great  food and even better service. This time we had one of the 25 specialty & delicious salads called \"Alexander\",this one has Chicken strips,Gyro meat,cranberries, sliced red apples,kalamata olives,garbanzo beans,roasted white onions and grilled red bell peppers,tomato wedges,baby greens spring mix with greek house dressing ....delicious !  We also ordered a platter called Ignacio, which is gyro meat,with 2 sides,I chose fries and coleslaw and pita bread. Everything was delicious.Betty the Owner/Waitress speaks English, Spanish & Greek,"], ["George M.", "small deli but HUGE flavorMLGD is one of those places that you have dinner at a table next to the owner and his family and you get to talking to him about the food and the Springs and other thingsBe careful when ordering with the sweet older lady cause I'm not sure she doesn't hear well or just doesn't give a fuh but we didn't exactly get what we ordered but we did enjoy what we got"], ["Tee S.", "Perfect spot for the authentic taste of Greece. Nice and friendly place where they remember you name and order! Makes you feel at home. And the gyro, win every time!"]], "Super Pizzeria": [["Brian J.", "Don't let the looks fool you, this hole in the wall has the best GREEK Salad!!! Loads of feta, pepperocinis and the best dressing! The gyros and pizza are great too. The 4 stars are the the salads. Have to try the subs, haven't had on yet."], ["Shae S.", "Won't ever be ordering from here again. Pizza was so bad we threw it out and ordered from Pizza Hut."], ["Doug R.", "The Miami sub's comment is beyond ridiculous. These gyros r legit! I had the lamb one and it wasnt the biggest gyro like at the fair but it is compact and full of deliciously seasoned lamb and right amount of tasiki sauce. Hit the SPOT! Will recommend to anyone that likes gyros the Mediterranean way. Will try the pizza next time."], ["Chris U.", "Ok pricing, good customer service and pizza is ok. Not good but ok. I had the Greek pizza per recommendation from the store. Although the toppings tasted fresh, the crust tasted pre made and previously frozen."], ["Armando L.", "Best gyro in town. Haven't had the pizza or subs, but I can vouch for the Gyros, onion rings and Greek salad. The owner is a great guy as well."], ["Jose B.", "The food the service and the personality of this place is great.  It's hard to find a place that delivers excellent gyros!"], ["Guillermo R.", "Wow, you can get a better pizza out of your local supermarket frozen food fridge. I got a gyro as well , thou it wasn't that bad, I would prefer miami subs gyro . Will I buy from here again? no! Would a recommend it ? No! I'm sorry just being honest. People seem to like their salad, I wouldn't know . My search for a local non franchise pizza place will continue. Cheers !"], ["Nicole A.", "We really didn't want to go out, and this was pretty much the only place that would deliver to our hotel on a Sunday night. Delivery was quick, prices were fair. The garlic knots were great! However, the pizza is nothing to write home about. It wasn't bad at all, but it just did the bare minimum in covering our pizza craving."], ["Lidia C.", "Great Gyros! Excellent Greek Salad! Pizza is bready but crust is tasty."], ["Gui C.", "Super surprising - gyro is great, salads are too. This has become go-to take out for our family."]], "Stoupsy's of Athens": [], "Elia Gourmet": [], "Kouzina Greek Bistro": [["Ramsey C.", "If I could put negative stars I would! Reserved here for Mother's Day. Arrived at the place... No host/hostess. Waited a few minutes to see what could possibly be the owner strolling his way at the speed of a snail to the front to \"greet\" us; a scruffy, shabby looking lad in blue jeans and shirt tucked out. The first thing he said: \"How many?\" ... Nice greeting right? When I mentioned we had a reservation for 4 he replied with the following: \"We have no more seats inside, only outside\" --- ??? When we finally sat down we were served water and bread... Then we waited and waited and waited some more... No one asked if we've been taken care of, no server swung by to say hi, no acknowledgement whatsoever!!! After 30 minutes of waiting we decided to get up and leave... This is what is surprising though: As we were leaving no one bothered to ask us what was wrong. Actually, no one even seemed to realize they were losing customers right under their nose... This experience was pathetic to say the least. Never posted a negative review for a restaurant before, never bothered to do so... But this one just pushed me over the edge!"], ["Matt M.", "By far the worst greek food ive ever had. First the supposed greek fries were soggy tasteless fries with something not feta cheese, no wonder the waiter who took my order acting like he had no idea what i was speaking about. The greek salad with chicken, the chicken was by far the driest and tasteless chicken ever, and then the lamb platter was shredded pieces of meat that taste more like goat. First and last time customer."], ["David C.", "Great foodBest thing to do is to order a bunch of appetizers and enjoy.  So many great things on the menu.Service was real good . Live how they decorated the place."], ["Alejandro G.", "Really nice outdoor seating. Food was good, including grilled octopus and stuffed grape leaves. Service was friendly and ok, only downside was that they were blasting the music. Otherwise I recommend it over all."], ["Laura G.", "The food is the equivalent of a greek tragedy. It's so sad, too, because this place has the potential to be amazing. The ambiance and location are great, but it looks like they spent more on their design that the quality of their food.We ordered the octopus, which was the best part of the dish, but the calamari were greasy and heavy (which means their frier was not hot enough) and their Santorini chicken, recommended by the hostess, did not compensate. I love greek food, I have been to Greece, and thank goodness it is nothing like this."], ["J K.", "The three stars are for:the attractive, clean decorLovely outdoor dining space and barWell priced wine selection that includes some surprisingly good Greek options\"dip\" platter app that tasted fresh and homemade. Minus 2 stars because the service was \"meh\" and our entrees were really awful. We ordered variations of lamb- a gyro and the roast lamb plate. Oddly, when the meals arrived the meats looked identical-- like ropa vieja. Yes, shredded.  There was no detectable lamb flavor. In fact, there was no flavor period. The side potatoes were greasy and mushy. A huge disappointment."], ["Tony R.", "Update: Returned for early Saturday night dinner (6:30) with prefix menu Groupon. This special provides diner to select one of three entrees. Yet, how can this restaurant be allegedly out of beef skewers by 6:45 on a Saturday night, one of the three entrees. Seriously? Also, Manager needs to become better familiar with Groupon's terms and applicability on a Saturday. Prefix menu Groupon is valid until 7:00 pm on Fridays and Saturdays. Food is decently prepared, particularly the fish. Nice size fish and kitchen will debone if requested. 5 very small lamb chops were flavorful. Good Mykonos salad and good wines."], ["Krys P.", "I wish, wish, wish I could give this place a five star.  Tucked away on a small street a few blocks from all the midtown happenings, this is the prettiest Greek restaurant I've been to; both the garden and the indoor dining area is so beautiful and cute.  I want to just hug one of their pastel-colored pillows, lie down and spend my afternoon away.  I just want to call it home and not leave.  Service too, is nice.  The only problem is the food doesn't exactly wow me.  We had some cod croquette, and in fact we couldn't quite determine what it was.  Some  of us think it's the cod, some think it's just potato, or fried cheese.  The hummus is creamy but not very flavorful.  Ditto the main dishes, and the selection is limited.More like a three, but I totally love the decor so a bonus little star there.  Hope they can improve the kitchen and rake in a true four or five!"], ["Stephanie S.", "Love, love, LOVE the hospitality in this place! First time coming here and I already feel at home. The restaurant is under new management and the owner and his staff have made it all worth while. Slipped in for a quick bite and then \"we did everything else\". Food and a show, definitely recommended and will be back myself :) UZO!!"], ["Kyriakos P.", "I missed food from home but I found the best place for authentic greek food. Kouzina impressed me with their friendly environment, greek food and desserts as well as greek wine. The new management does absolutely great job."], ["Miranda D.", "Overall a good experience. Nice decor, good food, and okay service. I recommend the lamb chops, they were delicious. The hummus and zucchini fries were also very tasty. Lastly, for dessert I recommend the Greek yogurt, something so simple but so good."], ["Mauricio V.", "After reading several reviews i finally decided to try out Kouzina. To keep things short: A gastronomic disappointment in a city with several innovative and new options... - I've never seen a menu so dirty. I don't even want to image how the kitchen is.- Bread was old and tough.- Roasted lamb was below average. It was cold with several chunks of fat.- Chicken Santorini was as dry as a cracker and the salad was soggy.- Meatballs were decent.- Baklava was ok.- Service was ok.- The wine list has a few interesting optionsNot sure about giving it a second chance..."], ["hannah a.", "Food: skillful.  nice variety.  many homemade things, not the typical standard fareFood quality: Really good.  The individual components-feta, olives, meat, olive oil, fish-they are very nice quality.  This isn't the standard mass-greek-food supply food.  Greek restaurants can order standards from Sysco-like suppliers, ie their gyro meat, the feta, the olives, the baklava--and it's pretty gross.  These guys don't do that.The other big greek place in the Gables, Mykonos, is also greek-people run but it's pretty tired.  This place is far superior.Service: not fantastic.  Actual Greeks means actual greek attitude, which is more casual than miamiPrice: some decent prices, some higher pricesAtmosphere: it's an actual bar in actual Greece, i swear it.  there's a spot inside where the old greek guys hang out, by the indoor bar (there are 2) and drink coffee and watch soccer.  that's pretty cool. Get: grilled octopus, lamb, horiatiko (village) salad, avgolemono (egg and lemon) soup, oregano chicken, baklava"], ["Martina S.", "I usually don't rate this low..unless there's a serious reason to do so. I went to Kouzina  a few months ago for lunch and it wasn't bad but whatever I wrote in my first review really needs to be edited after tonight's experience. I ordered online a Greek salad, fries and spinach pie triangles. As soon as I submitted my order I received a text informing me that since the restaurant was busy I would have had to wait another additional 30 minutes. Ok, no problem... After 1 hour of waiting I receive a call informing me that the delivery person had an accident and I had to go pick up my food.. Alright, I don't live far and thought it wasn't a big deal. When I got to the restaurant I was surprised to see that literally nobody was there. How can a restaurant be so busy that it needs extra 30 minutes to process a very simple order when nobody is eating there? The waitress who gave me the food was extremely nice, which I appreciated. I asked her if I could be refunded of the $5 delivery fee and delivery tip and she said no problem and also asked me if i spoke Spanish and wanted to speak with the manager..I do not speak Spanish and because of that the manager refused to deal with me.... The fact that my order had been delayed \"because the restaurant was very busy\"when in reality it was completely empty and that the manager didn't want to speak with me because i didn't speak Spanish threw me off but the real surprise came when I opened the boxes where my dinner was supposed to be. I use the past tense because I quite frankly didn't receive what I ordered: the salad was composed by a sliced tomato, capers, 1 olive and a piece of feta that hadn't even been sliced. The portion was so small that it fit perfectly in the corner of the box.The spinach triangles were fine but were cold and mushy. The fries were a huge disappointment: the portion was so little that it wasn't enough not even for one person, there was more potato skin that potatoes and everything was extra mushy and cold. I will NOT order nor go to Kouzina ever again. Unexpected issues can happen but the $25 I spent on this \"dinner\"were a real rip off and the fact that the manager didn't even bother to come and talk to me shows how much he cares about his business. Just NO!!"], ["N H.", "Excellent food and atmosphere. I had the Greek Salad and Dolmadakia!  Delicious!  Friends had the Kouzina lamb(muy sabroso)  another delicious plate with a generous servings.Highly recommended!"], ["Fernando M.", "The ambient is very nice, food is \"OK\", service not so good... We ordered 4 entrees (two couples), and every plate came in different times... With at least a 5 mins difference from each other. Only two beers on the menu (corona and mythos). No juice, only soda and tea. Waitress would come by hardly ever, and that's bc the place was empty. Not sure if I would go back..."], ["Kathryn S.", "Kouzina Greek Bistro is a wonderful new addition to the Midtown area of Miami. I arrived for dinner with a large group for a girls night where the objective was to try everything and to have a great time.From the beginning, all the staff was very kind and helpful to us. The waitress was especially great. She was able to keep up with all of our orders and kept the drinks coming. Note: the restaurant does not have a liquor license yet so all alcoholic beverages are wine based. The table decided to eat family style and I basically tried everything from the menu. The dishes that stood out to me were the manouri cheese envelope, saganaki, and especially the zucchini fries. The zucchini fries need their own special shout out because they were the best thing I tried. We had to order them several times because everyone kept devouring them.At the end of the night I was insanely full off of the good times and food. I would recommend Kouzina to anyone who would like to have a wonderful Greek meal with great service."], ["Hamlet G.", "I have been many times at Kouzina and I can recommend you this place because the quality and variety of Greek food. This restaurant is just delicious."], ["Caroline G.", "Waited over an hour for an appetizer. We left before having to wait another hour for the next course..."], ["Estephanie E.", "AVOID THIS PLACE! You will leave with a headache! The service is SO bad that any possible good food gets killed! We waited over an hour and a half for our food and then another 25 minutes just to get an incorrect check. When we asked for a manager, she simply apologized and was USELESS. AVOID THIS HELL HOLE. IT WILL KILL YOUR NIGHT! This was not a one time incident, all tables were complaining and miserable."]], "BarMeli": [], "Maria's Greek Restaurant": [["Damaris C.", "I love Greek food... I've been coming to Maria's for at least a decade, tracing back when they were in their other location. Authentic Greek family-run business in Coral Gables. Good pricing, good food, and good service. I totally support the locals :-)"], ["Camila L.", "We ordered from Maria's Greek Restaurant for an office lunch some time ago. The delivery service was great. The food was ok. I have definitely had better greek food.I ordered the gyro platter- it was tasty but not the best I have ever had.Other people ordered the Chicken Kebab Platter and it looked a lot better.Will give this place another try."], ["Laura R.", "We always pass this restaurant on our way to the grove and decided to give it a try. We both ordered the lamb gyro platter, one order of eggplant appetizer and one order of baklava. We drank tap water. The lamb gyro platter was good - but not amazing. The French fries were good. The pita bread left something to be desired. I didn't like the eggplant appetizer at all. My mom makes a killer version at home and this one had no flavor. Baklava was fantastic. We didn't try anything else - maybe other items on the menu are better. If the price was lower I would give this place 3 1/2- maybe 4 stars if the price was right. But for a meal that was more than $60 it simply wasn't worth it."], ["Betsy F.", "Our family has been enjoying this restaurant for many years!  It's alway good...we love the roasted chicken, greek salad is a must, gyro platter, and avgolemono (lemon-chicken) soup & Pastitsio (greek Lasagna).  Service is very friendly..We love!"], ["Steve T.", "I have always liked this restaurant but have not been in a while so after another good experience tonight I am getting around to writing a review. We started with the fried calamari appetizer which was expertly cooked and delicious, served with a side of cocktail sauce and lemons. The batter was light and crispy, an excellent offering.  For dinner the Gyro Platter which comes with gyro meat (the menu says lamb), greek salad, fries, and condiments. We finished with rice pudding and expresso.  Everything was delicious.  I noticed a lot of people were ording the hummus appetizer so it must be good.  The service was friendly and timed just right.  We enjoyed it and will return again soon."], ["Suzanne P.", "This review is based on delivery, not dine in. Our old go-to Greek restaurant has just been kicked to the curb!  Maria's Greek just took my #1 spot. The ordering process was smooth and I did not have to repeat myself in English and Spanish. Two thumbs up. He quickly informed me that delivery was taking up to an hour at the time, prior to placing my order.  Thank you. The hummus was \"scoop out that last bit\" good. No, it was amazing. Perfect balance of flavors and the pitas were still nice and hot.  Very generous portion Greek salad and they are not stingy with the Feta!  I ordered a side of grilled chicken kabob and it was perfect. This is my new go-to \"healthy\" takeout.  My husband had the Pastitsio and it was creamy and meaty and delicious!  As if all that wasn't enough, we had Baklava. Oh my, I was in Baklava heaven!!!!!!  Why did I only order 1?!?  My mouth is watering. I already know I want Maria's Greek tomorrow, and perhaps the next day too."], ["William C.", "This is truly a hidden gem.  For the locals it the secret place.for me as I think of wellness and great food this is my heart felt destination.  The Village salad is Mandatory for a great meal."], ["Bruce E.", "Best Greek food Ive had outside of Greece! Must say its the best lunch I've had since moving from NYC a year ago! Had the gyro platter which was HUGE for about $12! I could easily eat here several times a week if I didn't care about getting fat from the huge portions. It's just so good that you can't stop eating even when your full at about halfway through."], ["Wara R.", "Another amazing dining decision. My boyfriend and I are into for the weekend and not really interested in the whole south beach scene. We wanted to try something the locals would dine at. First, we talked with the concierge at our hotel who threw us so many ideas.. but still I didn't know exactly what I was craving! Gyro! I want some tasty gyro meat. We started looking on yelp what the area had to offer. Then we drove by Maria's. It looks welcoming and they sat us right away. It was about 20 min before closing. Right away the server was friendly and very helpful even offering the lunch menu. We ordered the fried cheese. It was good but I'd probably not have it again. My boyfriend loved it though. Then we ordered the gyro platter! Oh my! This was awesome! 3 large pieces of meat and french fries and a Greek salad. I turned mine into a giant gyro sandwich. I was a little messy but the taste made it so worth it. It was so filling. I just had to tell everyone how awesome it was. I wish we lived in miami. This would become a regular spot for us. If you want some tasty food for a good price! Check this place out."], ["Vanessa P.", "Was greeted warmly by owner Angela. And, yes, the tomatoes were nice..I had forgotten how great this little family run spot is! It has moved since I was last here-/ maybe 15 years ago? Wow! It's even better than I remember. So kind, real and delicious. Take out works great. Prices might seem high for take-out but absolutely fair.  We adored the light and puffy moussaka, tender kabobs and hearty village salad. Shrimp were tasty but could have used some more lemon. But those cookies buttery kourabiedes (walnut cookies) were so insane I actually his them from my own kids and ate them all. Am I a bad mom? Or just a Maria's fan! Now I just have to clean up all the powdered sugar evidence."], ["Sharon W.", "I came last night with 2 friends. I arrived first and was greeted immediately and offered a table. I opted to wait at the front because I wasn't sure if our entire group was going to show. Once my friends arrived, we were shown to our table and given waters and menus by the friendly server.Friend 1 ordered an entree, while Friend 2 and I both ordered two apps as a meal (we both had the spanikopita and the grape leaves). Warm pita was also brought to the table with our food. The food was good - the phyllo on the spanikopita was a little dry, but the filling was perfectly seasoned. The grape leaves were very good as well, with a creamy lemon sauce on the top. The service was really great; the restaurant was fairly empty and they didn't rush us  at all, but brought the check promptly when we were ready for it, along with a little sweet Greek cookie. We definitely felt the Mediterranian hospitality at Maria's!"], ["Dewey C.", "I came on their opening day and came so many times I had to shift to Mykanos down the street. Mykanos is ok but Maria's is really the best in this part of the world."], ["A P.", "Unfortunately the former owners of Egg and Dart have not carried the same quality here. The eggplant salad had a sour vinegar flavor as did the Greek meatballs. The calamari was over breaded. The chicken kebab lacked flavor. Wish we could go back to the great food at E&D."], ["Alessandra G.", "Tasty, affordable, authentic Greek food.Loved their lunch special of a double Greek salad with gyro. First time tasting lamb and I was SO impressed. It was delicious and they gave a hefty portion.Great hummus and pita as well. Ordered the fried cheese...it was delicious (I'm sure my hips won't thank me later!)."], ["Alex H.", "Terrible and irrational service. We went in about an hour and a half before they were closing and the young girl seated us at a tiny table (there were three of us). We asked to be seated at a larger table that had 4 chairs with it. The place was nearly empty and we wanted to try some greek food comfortably. The girl told us \"no, we need those tables available for larger parties\" and I let her know that with 1 1/2 hours left until closing that would be highly unlikely as there were 4 empty larger tables available and the restaurant was empty. She still said no -- I am not in the mood to have to request a manager in scenarios like these because I would assume the manager should coach them on being able to make educated decisions on their own. We got our stuff and began to walk out and all the waiters just sat and watched us go. Unfortunate."], ["Miguel S.", "Decent Greek food, and convenient delivery. I do not give it four stars because I have had much better Greek food. I would order again because of the convenience of delivery. In contrast to the main courses, which were only average, the baklava desert was excellent."], ["Steve C.", "A five star treat that just goes to show that with all of the fancy places to dine in Miami, Maria's is a fine example where the locals go for high quality, delicious Greek food food.  Wonderfully authentic, all the dish come out piping hot from the Greek kitchen.  Tonight we had the \"flaming cheese\" (although the Fire Marshall insists that the flaming be done in the kitchen), an several Greek apps.  The Moussaka was scrumpous.  Treat your palate to a bottle of the white Greek wine (Keloni?). super affordable and different than what you probably drink regularly. Baklava...homemade, war...amazing.  All of this, and a doggie bag, for under 75 bucks.  We will be back...hope to see you there."], ["Michael S.", "Miserable meal. Came here today for lunch with a co-worker. They had about 8 empty tables when we got there, but the manager refused to seat us for 10 minutes because they were somewhat busy.  We looked at the menu while we waited, so we were ready as soon as we were seated. However it took another ten minutes before the server got around to taking our order. I ordered the gyro platter with the greek salad and fries. My co-worker ordered the gyro platter with double greek salad. Finally 25 minutes later we got our food after I got back from feeding more change into the parking meter, as I had put 50 minutes on it and knew there was no way on Earth we would get out in the next 5 minutes. Now keep in mind that gyro meat is already cooked on a spit, so what took 25 minutes for two gyro platters.So the food finally comes and they brought us both gyro platters with double salad. He rushes off before I can say anything. A few minutes later I manage to catch him and tell him of the mistake. He acts very annoyed by my inconveniencing him. About 5 minutes later the manager plops down the plate of fries and walks away without any apology. No ketchup or any trace of a server to get some. If the service wasn't enough to keep me from coming back the food sure was. The gyro meat was average, but the greek salad was wretched. The lettuce edges had the orangish/brownish color of lettuce going bad and the feta was flat out disgusting. I love feta cheese and eat it regularly, so I know what reta tastes like. I don't know if it was rancid or what.Rude/slow service + bad food = never coming back."], ["Lissa B.", "The first time I ate Maria's I could almost hear the angelic choirs praising \"Aaaveeee Mariiiiaaaaa\". Is this why it's called Maria's? Anyhow, it is heaven sent. I confess, I've never even been to the restaurant. I was brought Maria's to-go one evening by my roomie, who happened to stumble upon it by foot on a stroll down Coral Way. I remember it clearly. It was a big lamb gyro, abundant with greens, boasting thick juicy strips of seasoned lamb, and glistening with delicious tzatziki sauce, all wrapped up in pita. As soon as my nose sniffed it, my palate skipped grace, and before I knew it, I was devouring this lamb gyro with all the gratitude I could muster. I've never been the same since, no other Greek restaurant satiates my craving the way Maria's does. I've tried Mykonos, Mylos, Maroosh, Opa but they pale in one way or the other. Maria's tastes of a mother's love. I suspect they are a family business. It is now my go-to Greek Food to-go. I hope to make it in to the actual restaurant one day. The grape leaves are nicely spiced and come with a delicious lemony sauce, the spreads are always perfect in consistency, they are very courteous in interactions and very fast with delivery. Their prices are great and portions are substantial. I have seen the light of Maria."], ["Lilly R.", "Looking for a healthy and quick lunch? Maria's is the place! Order the hummus to start. It's delicious! The Gyro platters are allDelish! And my personal favorite: the Chicken Kabob! Enjoy!"]], "Gyroville": [["Stephi S.", "A nice plus in visiting the culturally diverse South Florida area, is the variety of unique cuisine experiences.  Gyroville offers a fresh and delightful Greek menu with a \"Build Your Own\" concept.  It is very similar to Chipotle. As soon as you walk up, there is a big sign with clear instructions on the ordering process.Style:  Pita * Rice * Wrap * SaladProtein:  Gyro * Chicken * Falafel * Chickpeas * Mahi MahiTzatziki/Hummus Topping: Original * Spinach Jalapeño * Honey Mustard * FetaThen your regular Veggie Toppings: Spinach * Lettuce * Tomatoes * Etc... You can add a combo with options like fries, chickpeas, rice, salad, falafel, pita chips and a drink.I had the Pita - Gyro - Tzatiziki Spinach Jalapeno - with some extra veggie toppings and a salad. It was really cool that with even down to the salad, I got to choose exactly what I wanted from their various fresh ingredient options. Wow everything was so delicious. You can really taste the freshness of all the ingredients. The portions were very satisfying as well. They also offer a variety of small dishes, a special selection of features items and a kids menu.  Gyroville offers a diverse menu of traditional and contemporary Greek specialties with fresh and flavorful ingredients, a clean and bright establishment, has very friendly service and affordable prices. YELP BONUS: They give you a free hummus & pita for checking in on Yelp!! Heeyyy now!!!  I will know I will be back, but when is Gyroville coming to California!?!?!?!  :)"], ["Brandon S.", "The menu is a bit \"busy\" & I saw multiple customers seem confused by it's layout.Nice lunch spot. Friendly service, fresh ingredients & quick turnaround. Free pita & hummus (pretty small) w/ Yelp check in."], ["Nato S.", "Passed by on a whim - pleasantly surprised by great service. The gentlemen behind the counter were super helpful and really friendly.Had a salad with gyro meat and a bunch of additions. Everything tasted super fresh and all the flavors were on point. You can pick and choose what you'd like and can end up with a lot of food at a super reasonable price.To those contemplating coming here -- think Chipotle style Mediterranean."], ["Dennis N.", "The Gyros are good all side ingredients are fresh! The staff is knowledgeable and helpful. Unlike other Gyros spots that claim good food Gyroville is ligament. Only thing that would get them a 5 star from me is the tzatziki could be thicker but that is just the way I would like it not all folks are the same."], ["Daniel S.", "Love this place! The food always taste great and is always fresh. Staff is super nice and if you are interested in trying something before you buy it they will let you (I tried the Greek Italian dressing). If you love Greek food then this is the place to come."], ["Amy M.", "We visited Gyroville after hearing about it on yelp. I love Greek food, so I was excited to try it. We even got a free hummus for checking in. The hummus was excellent. I ordered my go-to pita, the falafel. It was awesome! The ingredients were fresh and the pita was stuffed! My husband wasn't AS excited about his gyro (I don't eat lamb), but he said it was still good. I would recommend this place for someone in the Kendall area who wants a quick, fresh lunch. Well done!"], ["Darin L.", "I can't even tell you how many times I've passed this little gem on the way to the grocery store or the pharmacy...now that I finally tried it, I am kicking myself for having taken so long to realize this place existed. Super fresh food! I had chicken on a pita. The pita was warm and soft, very well made. They have a variety of toppings to choose from. I went a little heavy on the olives and and feta...but who doesn't love olives and feta? The staff was cool and courteous, which I can always appreciate. I didn't get a chance to look at the whole menu, but they seem to have a decent selection. It is in a super convenient location, I'm not sure how I've missed it all this time. They may want to consider advertising with bigger signage, or maybe I need glasses. Anyway, I will absolutely be back to try again. The free pita and hummus was a bonus"], ["Albert T.", "These gyros are delicious and even better when paired with an iced green tea. My only complaint for this place would be their questionable hygienic standards."], ["Nicole W.", "This place has some delicious healthy eats and friendly staff! I ordered the Zeus (Gyro, Chicken, Tomato, Onions, and Tzatziki sauce on a warm Pita). I also received a sample of their hummus for checking in on Yelp! The food was tasty! Their hummus is a little different, but also tasty! I will be back!"], ["Yvelin R.", "Had been meaning to try this place for some time now, so glad I finally did. Loved the free hummus and pita you get after checking in on Yelp and ordering your food. I had the gyro meat on a pita bread with lettuce, feta cheese and tzatziki sauce. Plain and simple but very yummy. Place was clean and service was good. Will definitely return for more."], ["Julie M.", "My husband kept insisting that I try this place. He had already been there several times before. Everything was clean, and the fresh toppings looked \"fresh\". The staff was a little dry, and it wasn't like they were busy at all. The food was good, but I wish they would've warmed the pita bread a little bit. We had the chicken wrap and a gyro and they were both VERY good. No real dessert options, but that's ok. A little pricey for \"fast food\" but not too bad. Definitely will be coming back."], ["Sean B.", "The Zues Gyro here is just fantastic. Gyros are one of my Favs and Gyroville never disappoints. The Tzatziki is great and also a good little extra is putting pineapples on your gyro called the Apollo with extra sauce and Feta cheese."], ["Alexander B.", "I love the spinach pie! It's healthy and delicious, and they serve IBC Root Beer my favorite brand."], ["Raul R.", "A GYRO-enthusiasts Paradise! I really like the food here, especially the generous portions of Gyro meat.... Definitely keep that up. They also have a nice offering of sauce/dressings for your pita and salads (Feta Tzatziki is BOMB!). I really like the Miami freestyle (Nice & Wild - Diamond Girl 1986) music the play. Areas For Improvement: Some of the hygiene of the staff looks to be questionable to me. Hair should be neat and finger nails should not have grease/dirt under them. Wash the greens thoroughly."], ["Haley P.", "Delicious, cheap, friendly staff. I had the falafel and a side Greek salad. The falafel was made in front of me so it was warm and fresh. LOVE he jalapeño tsasiki. Would certainly come again."], ["Bernardette S.", "I was looking for a place near Hammocks park late in the evening after a softball game. I of course yelped and decided to swing by gyroville. Although they were already cleaning up they attended me very promptly and nice. I took a minute being my first time there and changed my order a few times, they were so patient with me. The food was delicious! My only down side was that when checking in for yelp you get a free pita with hummus. They forgot my hummus... Didn't hold it against them, the service and food were great."], ["Ivonne L.", "Recently went to turkey and Greece and was craving a gyro so came here. Resembles a subway for gyros. The pita was soft which I loved and fries were fresh. I couldn't give the full 5 stars because ofcourse nothing compares to the actual döner from turkey but it definitely satisfied my craving. Also appreciated the free hummus and pita from the yelp check in! Although wasn't a huge fan of the hummus"], ["Priscilla R.", "One of my favorite local spots. Food is always fresh and delicious and the staff is great. Never had a bad experience!"], ["Lauren S.", "Loved the food, ordered to go. It was efficient. Great for when I want something healthy but don't want to cook! Hehe."], ["Elin M.", "Great place to get your Gyro fix! Parking is a little inconvenient at times. But the food is worth it. Workers are nice, the place is very clean, and the food is incredibly fresh. I ordered Hermes which was small but very satisfying. It was grilled cheese, gyro and tomato all on pita with honey mustard. I believe it's also a reasonable price for the food you get.  I will definitely be going back to try something different!!!!"]], "Eat Greek Souvlaki / Brickell": [], "Ergon Greek Deli and Cuisine": [["Matt A.", "Hidden in the coconut grove, this place is another branch of the Ergon franchise. We stopped by for a quick bite. I had the Greek salad sandwich which was very fresh tasting and just what you would expect. The tomatoes, the cucumbers, etc were very fresh to the bite. I loved the creamy salty taste of their feta cheese. Although it tasted unpasteurized, I think it was made out of sheep's milk which gave it that flavor. We also had the Greek salad and the spinach pastry, both of which were also fresh and delicious. They have a selection of Volkan beers from Greece and a large pantry selection of sauces, dried herbs for cooking, pastas and other dry goods such as lentils, beans, etc. I didn't have a chance to have any semolina cake but it looked delicious!"], ["Chris T.", "I've been on the hunt for a good greek taverna since I moved to the area, so I was excited to try Ergon when I saw it opened right up in the grove...big disappointment.Food was mediocre, I got the pork souvlaki and it was dry and over seasoned.  My gf got the chicken breast souvlaki, and ended up with what seemed like processed chicken thighs, when she nicely asked to replace it with something else she was met with blank stares. Overall decor seemed nice, sad the food & service did not live up to it....the hunt for good greek food continues."], ["Miriana M.", "Was a little hesitant about visiting this new spot based on the mixed reviews. Thankfully I went with my gut feeling and gave it a go. The place is very clean and modern with a relaxed vibe. The menu is very easy to go over, no fancy descriptions. Tried the Pork Gyro, Feta French Fries, and the Greek Salad. Everything came out in less than 15 minutes and surprisingly very fresh! Everything was quite tasty, but the winner of the night, believe it or not, was the Greek Salad! Cucumber, tomato, red onion, black olives, feta cheese, and pita strips all in a delicious refreshing dressing. I would definitely come back here and try their other dishes, but I know the Greek Salad will be my go to dish every single time. It's THAT good."], ["Charlie S.", "Ergon is a worthy addition to the Grove area (which is hard up for Greek restaurants). I confess to not being blown away, but I liked it on the whole and anticipate returning. Know that Ergon is not your typical, \"I'll have an gyro and fries\" Greek restaurant (in fact, a lamb gyro is not on the menu, though a pork gyro is available). The focus here seems to be more on the \"deli\" side of things, with a lot of dips, Greek pies, and salad options. I had the chicken breast souvlaki. It turns out that the chicken breast was served on the kabob. I found the chicken itself to be quite plain and underwhelming. Not much flavor here. Plus there was a bite with a gross fatty texture. The pita was good and the accompanying side salad was above average. The tzatziki sauce, however, was exceptional. I am not normally a tzatziki lover, but though this was great. It had a noticeably thicker texture than other tzatziki sauce I have had. I had a bite of the lentil salad my dining companion had and thought it was very tasty. For an appetizer, we ordered the feta crust. Or tried to, anyway. It turns out that the person at the counter misheard what I said and put the order in as feta fries. The server ended up bringing us french fries drizzled with feta cheese sauce and sprinkled with thyme. I told the server we had ordered feta crust, and he said that's what this dish was. That sounded bizarre to me, but I accepted it and was ready to dig in.  These fries ended up being quite good (they are VERY crispy, if you're into that).I ended up asking the person at the counter (the manager?) about this, and it turns out the french fry dish I was served was not, in fact, feta crust as the server had told me and which I had tried to order. The good news is that the person at the counter made this right -- she brought out a dessert on the house which was a honey-soaked cake with cinnamon on top. This was excellent. And it was a great response to the confusion that had occurred earlier."], ["Sam W.", "I think thy are off to a great start and will only get better with time. I loved that they gave out samples at the counter while we ordered. The sample of the coffee cheesecake was delicious. I would recommend trying it out. I got the chicken souvlaki which had a nice crispy skin but juicy meat. Came with sauce, tomato salad and pita. My boyfriend got the spinach risotto which was a little runny. We also shared the feta crust which I highly recommend. Perfect blend of flavors!"], ["Allyson M.", "The people have a constant \"deer in headlights look,\" the food is mediocre at best and beware the $4 chicken addition to a salad that LITERALLY was three pieces of processed, pre-made chicken. There are flies all over the front pastry counter and a GNAT inside the casing. Furthermore, they weren't that busy and the wait was insane.Save your money from this overpriced greek trap"], ["Juan S.", "Very nice surprise!Excellent Greek food in more of a fast-casual concept rather than a full service restaurant..  I was a little hesitant to try this place as we were the only party there, but once we came in, 4 or 5 more parties showed up.The food was delicious:-olive bread...amazing-Chicken kabobs...very good and fresh-tabouli and lentil salads...all very good.Portion sizes are excellent and looks to be a great value.  I would definitely come back and recommend.The only thing I'd recommend is the atmosphere could be a little more upbeat...music, etc."], ["Marisa C.", "Everyone working here was dazed and confused. I ordered the chicken breast gyro plate but the meal came and it looked like lamb. When I brought it to them, they told me it was chicken and they knew I didn't care for the dish. They did not offer something else and the chicken was so fatty/chewy I couldn't even eat it. This place won't last long, sadly disappointed in my first visit."], ["Chelsea J.", "Delicious artisanal offerings to eat there or take home! The pies and yoghurts are to die for. I've also tried the salads - tabouleh, couscous and lentil. All tasty and healthy. Met the Greek owner, everything is sourced from local Greek purveyors, handmade and flown in from Greece. Just what the Grove needs more of!"], ["Peter K.", "This place is awesome! So glad a good Greek place opened in the grove! Can't wait to come back!"], ["Charlie A.", "Nice casual dining environment. Don't need a masters degree in foreign affairs to understand the menu. Simple and accommodating service.  Tabouleh salad is delicious. Gyros are outstanding. Don't let the deli style order counter fool you. The food is great!"], ["Robert B.", "Grove gets great Greek! The Pork Gyro comes deconstructed, has a side salad, and is delicious. I would have licked my plate if I weren't in public. Greek salad sandwich is small but very flavorful. Greek yogurt is amazing, get it with walnuts and honey and share for dessert. Ergon is a winner!"], ["Carlos P.", "Great place to come have lunch with friends, the food was really good as well with the food was very tasty and delicious"], ["Philip R.", "This is some of the best Greek food you will find in the area. Almost everything is imported, authentic and high quality. It's delicious and a very healthy option for a fast casual concept. In their early days they've struggled with service, but the staff is very friendly and accommodating. The highlights are the pork gyro, and their salads. I'm looking forward to trying more from the bakery. Also, they sell imported items and the olive oil I bought was outstanding."], ["Johanna R.", "My friends and I shared the feta spaghetti, fries with feta sauce, gyro and chicken skewer. All were spectacular. Very delicious and authentic."], ["Melanie A.", "Delicious sandwiches and salads. Really nice ambiance. Very relaxing, clean space. Definitely recommend trying this place for a quick lunch or coffee. I shared the chicken and avocado sandwich and the Greek salad with chicken. Pleasantly surprised! Very tasty."], ["dayana r.", "Great food, wonderful atmosphere and friendly service. We had the octopus, lentil salad and lamb chops, delicious. No beer or wine but you can bring your own or go to Chianti wine and liquor around the corner and buy some. Wine glasses and bucket were provided to us at the restaurant. Cute market inside."], ["Michael S.", "Great new place in The Grove. We tried a variety of items from the menu...stuffed grape leaves, grilled octopus, zucchini balls. Everything tasted great and had a nice presentation. Try Ergon!"], ["Tim H.", "The food is great. Can't deny that. But waiting for a Gyro shouldn't take 30 minutes to get to me. After repeatedly asking if it was coming soon, I see two Gyro walk past me to a table that came after me. Then I go up to the counter and speak to (whom I think is the manager) and he looks at me with a \"What do you want?\" look and hands me a bag with the missing gyro. I understand the restaurant is going through growing pains but don't take your frustrations out at the customer. I wasn't rude in asking where my food was, but being treated as if I was doing them an inconvenience."], ["Peter M.", "Had lunch with a friend and we both liked the meal.  I had the pork gyro and he had the Greek salad with chicken.  Our only complaint would be that the chicken on the salad portion was small, but the salad itself was a very good portion.  I'm glad to see there is more quality Greek food in Miami."]], "Poseidon Greek Restaurant & Outdoor Lounge": [], "Miami Mediterranean Cuisine": [["Joe B.", "This place is an absolute gem. Delicious food for a fantastic price. So far, I've had the lamb shish, gyro wrap, and Greek med salad. Every one was fresh, tasty, and pretty healthy. It's a small place, but not cramped. It's walking distance from the beach. The owner and staff are very friendly and welcoming.Could not recommend this place more highly. I'll be back often!"], ["Frank S.", "Not 5 stars because of size, place is small. Hole in the wall it is & I live for them, but...Well, baklava delish, gyros as well. Trying falafel &/or chicken gyro shortly.Yes I do, will return. Try it out. Not typical Sobe get no food for a lot of  $$$, although no where near as nce as those types of places"], ["Steven G.", "This location has had many Middle Eastern incarnations, changing hands many times over the years.  I am not sure this is even the name!The current owenrs serve healthy, fresh, vibrant Med menu, I think they are Turkish.  Lentil soup - best I have had.  $5-$6 for a pint, good price and better taste.  Memorable.  I always throw in thier chili paste and \"white sauce\", tzatziki.The falafel is the best I have found in Miami, and the $6.00 sandwich is my fave and I work a few yards away, so this is a huge positive for me, South Beach being such an over priced tourist trap!Vegetarians can do very well here as well as carnivores.  They offer combo platters with all the fixings, rice and sides.  Gyros, kebabs and deserts and coffees.Very clean, good vibe, great food and great prices.Winner!"], ["Besho A.", "The food tastes good and delicious. However, the place is small and your clothes will smell as you were the chef. The area is not convenient, and you feel like it's not safe. If you're don't care a bout the place, I'll recommended for you."], ["Bob F.", "Just as advertised on Yelp. Food was very good.Very big portions. Probably ordered too much food but that is ok as was good leftover the next day. Lentil soup and falafel were delicious. Chicken plate was also very good. Owner was very friendly. Tight space only bad thing. But is definitely worth going."], ["Elinor G.", "HORRIBLE SERVICE! Do not order from here!! They delivered the wrong order to my job, I called them back to let them know and the man ABI who works there hung up on me after I asked for refund. He gave me a whole story saying I needed to be honest with myself!?!? I can't believe how rude someone can be in the customer service industry. DO NOT ORDER FROM HERE, very bad service."], ["Andy N.", "Went with my friends during lunch hours. Ordered falafal wraps and chicken kebabs. The taste was awesome and freshly prepared. Really enjoyed the food and it was not that pricey."], ["Blackrose B.", "Peeled myself off the beach and was starving! Pulled up Yelp and had them do the work, as always they came through finding me this GEM! Photos looked good, and the actual food did NOT disappoint!! 1st :  though the place is small,the staff was very nice, you order at the counter and they bring the food out to you and real plates (classy). 2: i order the bhakalava for my appetizer. It was VERY sweet (more so than Im used too) but all in all still good. It was 4 small pieces for $5, not bad. 3:I had the lamb Chops with salad over white rice pilaf and that tatziki sauce!! I never knew love like this before!! OMG good! Ordered mine medium...like duh. 4: place is super clean! Bathroom says \"out of order\" but its not, they give you the code to get in b/c its keypad operated! ENJOY!"], ["Issac R.", "This is one of those hole in the wall restaurants that impresses at first bite, and again, they are consistent. I've tried the lamb, the Babaganush, stuffed grape leaves, Eggplant salad which is excellent, and for desert, baklava and turkish coffee. Btw, it's family owned, it's a jewel. Just go!"], ["Geraldine A.", "Came here cause I was craving Mediterranean food and it was the closest spot to me. I tried a few different plates and although they were good, none particularly impressed. The cigar rolls were very salty, the tzatziki sauce was a bit bland, and the tabbouleh didn't taste so fresh. However, the hummus was very good and the pita it came with was so warm and toasty. The Chicken Shish Kebab platter was pretty good. The chicken was tender but the rice was the best part, it was most and soft and perfect.Overall good food, but service was very inattentive. We had to call the waitresses' attention every time and ended up just walking over to the counter for everything."], ["Vijay V.", "The food was not the best turkish/middle eastern. Their free humus and pita for checking in on yelp does not apply anymore."], ["Ank S.", "Perfect dinner. Ordered using the Yelp app as I couldn't get anyone on the phone. Tried the hummus, cigar rolls, and falafel wraps. Delivery estimate was 45min to an hour but the food came to our hotel, the Hilton Bentley, within 30 min. The food was great and they have extra sauces and all. Highly recommend!!!"], ["Vanessa V.", "Love this neighborhood joint. Hits the spot - although you need to be ok with the occasional bone in your shwarma. :-/"], ["Emily A.", "Gluten and over-charged.  I explained that I could not have anything that contained wheat and the young lady with a European accent and the cook assured me that the dish I requested was gluten free.  As I started to eat, I realized that the rice was mixed with orzo.  They did not know that semolina is a type of wheat.  People who work in restaurants need to be well informed about food allergies!I also think she over-charged me and didn't actually ring up the purchase.  The owner was next door at the beauty salon, not in the restaurant."], ["Jonah K.", "I don't understand all of the glowing reviews. I came here with my wife and we both got gyro salads. The gyro wasn't really well cooked, just warm off the skewer, but not charred at all. The dressing was essentially lemon, and the side of baba ganoush was subpar. The pita they use is straight from Publix and not at all decent.The staff was doing the bare minimum, but seemed unhappy and not really interested in doing their job, they were more interested in speaking with the other lebanese patrons.  I'm missing why people give this place such high ratings. I will not be back."], ["Marcelo M.", "I was looking for a mediterranean food and I just found this one.The food is very delicious and the staff, specially the guy in charge named Celal. The service it's fine. It's available wi fi.The atmosphere is very kindly.The prices are acceptable.I strong reccomend this place.Es un magnífico restaurante, limpio, comida deliciosa. Un ambiente muy amigable y tranquilo. Lo recomiendo. Y los precios son bastante razonables. El encargado, muy amigable."], ["Xavier B.", "This place takes the cake. I visited here 3 times in 24 hours. The lightly charred and flavorful proteins they serve are addictive. Miami Mediterranean was my culinary highlight of my trip this fall."], ["Lisa Y.", "So delicious! Huge portions. In a very central location. Although the place was small and had no AC. Great if you are not dining in though. The prices were decent. I paid a total of 14.12 with tax. I would most likely come back in the future."], ["Jacie N.", "BEST Mediterranean food I've ever had! We stopped by for a late lunch so there were only a few other people inside. Just a couple small tables, no outdoor seating. The waitress was so nice and answered all our questions about the menu items. Tried the lamb kebab with rice and side salad, chicken gyro wrap, and Greek salad. Super fresh ingredients and it was all SUPER yummy! The kebab and salad came with pita that was warm and fragrant. The rice was perfectly cooked and so flavorful. I'll definitely be coming back all the time!!"], ["J H.", "Kinda loud for a small place. Taste was ok. Average. Prices hmm..u might have guessed, when the food is not as u expect it to be ur not gonna be happy seeing the bill either. Anyway. The potential is there. There was no reason what so ever to have dry chicken and Kota served. 8 mean come on!. They need to put there feet on the ground and pay attention to the details for the food to taste good and be moist. Best of luck. Maybe on next visit u will improve so I can at least improve my rating"], ["Atiosis B.", "Awesome food at a fair price. Super fresh, delicious and good portions.  tabouli and the baklava were my favorites."], ["Brittany B.", "Amazing place with awesome prices and friendly staff! The rice is amazing and the taziki side is to die for. Will definitely be back!"], ["Maria K.", "This place is pretty darn good! Things to order....  The best way to go is the mixed grill or chicken kabob dinner.  They use a charcoal grill that makes such I great difference!!  They definitely need more staff members because they get pretty busy. There prices are very affordable especially for the beach. You should give these guys a try, support these small businesses! I hate to see them close down. P.S. check in for a free hummus"], ["Amber B.", "The food was delicious! Quantity and quality was top notch. I had their regular & chicken gyro, both were really good. This is a place to get quick take out or if ur in a hurry, definitely not a fine dine in restaurant."], ["Ms K.", "This store is exactly what you'd call a hole in the wall, but don't be fooled. The food is amazing! Chicken kabob plate comes with rice, pita bread, and salad...all for just $12. I could eat this every day, and I almost did while we were visiting South Beach. Place is a little small and smoky to dine in, but definitely makes for great carry-out to eat at the nearby Lummus Park Beach."], ["Brian L.", "Great Gyros.  My daughter and I found this on Yelp while on vacation.  We were tired of going to over priced restaurants and looked for something less expensive.  I think this was the best food we had while in Miami!"], ["Marc D.", "I've Been a steady customer of this place for quite sometime and it seems like they've gone through new ownership.   The food is still good but the service is the worst   You walk in and they quickly catch and attitude as of you are a burden to them.  Tables are always dirty but don't you dare ask anyone to clean it so you can sit.  Mind you I am a regular here and I get treated like trash.   This is the last time I'm coming here.   Good bye."], ["Xinyue L.", "Five stars for the food and service. I love the lamb kebab and the dessert. Because I checked in on Yelp, they gave me hummus and pita bread (very fresh!). They also served me Turkish tea with dessert. I love both! I will definitely come back for the lamb and the dessert. =D"], ["Jack D.", "Not good fries suck. Ordered large fries and they gave us 5 frozen fries from Walmart"], ["Steph B.", "Staff was friendly. I got the falafel appetizer and a Greek salad to go. The salad was plenty and pretty good. I'm giving the place 3 stars because the falafel was flavorless and disappointing:( maybe it was an off night, or that's just not a dish they serve often"], ["Josh M.", "Fantastic quality Arabic/Greek food for a fantastic price in a very expensive neighborhood. Hummus and pita was absolutely delicious as was their lamb kebab. My wife and I ate there for under $40 which is very cheap in the south beach area. And the food was fantastic. Definitely recommend."], ["Abdullah A.", "Possibly the best restaurant in the area and the prices are amazing. Quality and cheap, what  else do you want? (This is my first yelp review! I actually took the time to write this."], ["Bardiya A.", "It was great. The prices was reasonable, and the food was good and delicious. I ate Kofte Kabab, and I really liked it. The place is not classy or cozy or with view of ocean or full of people, but it was worth it. We were hungry, and I suggest this place if you want to be out of the beach for half an hour."], ["Greg W.", "We went here for lunch. The Hummus and gyros were amazing! It's inexpensive. We would definitely would go back."], ["Clifford H.", "Unbelievably delicious.  Had the grape leaves, lamp gyro, Mediterranean salad with grilled chicken.  I'm not the biggest fan of grape leaves (they were for my gf), but they came with toasted pita bread and some great sauces (yogurt/cucumber down solid - SOLID; light hummus type of sauce v. good) that I practically inhaled.  Gyro was top 3 I've had in my life and  priced fairly for sobe.  The salad is a salad, but the grilled chicken on top was so, so good.  You could taste the smokey grilled flavor on the outside, opening to moist and juicy white meat on the inside.  Just ridic.The guys working (one of which appeared to be the owner) were extremely kind and helpful.  Overall, a great meal and experience.  Thank you guys!"], ["Danielle E.", "Amazing food. Great staff. A must go for Mediterranean food if you're in south beach! The hummus is homemade and absolutely fantastic."], ["Tanya T.", "Stopped by this tiny hole in the wall place with my sister while in south beach Miami. It's about maybe 5 tables. The staff here Super friendly. This totally reminded me of the food I had when I traveled to ISTANBUL. I felt like I was back in Turkey.  Turkish coffee was a great compliment after dinner. All it was missing was the baklava or kadayif dessert. Everything was flipping fantastic & I  highly recommend.Checkin on yelp and get free hummus ;-)"], ["Tal Y.", "Great Turkish food I like the appetizer , lamb kabab , and baklava"], ["Mario D.", "I could not have been more satisfied with my visit. It's a small place with few tables but do not let that fool you. The quality of the food is premium. I ordered  a Lamb Sish wrap and I would not be surprised if It appeared in my sweetest of dreams in the near future. I also sampled the humus and to be honest I have never tasted one so exquisite. Everything is made fresh. When I walked out of the place to had a smile on my face like after a first date hopelessly anticipating the next time we meet. I am very glad I went."], ["Twee V.", "Busy eating my chicken Kabob, fresh salad and to die for humus. Just come and try them yourself.  Thumbs up!"]], "Mykonos Greek Restaurant": [["Stuart B.", "A rare find in Miami.  I've had almost all of their mains.  The combination souvlaki and shish kabob is really good and can feed a small army.  Their calamari and desserts are also very good.  Bonus, they deliver!"], ["Jennifer C.", "This is solid, traditional Greek food. The price is not overwhelming, but can be a bit hefty. Parking is really awkward in its position off the street and limited availability.The gyro plate is delicious - the pitas are warm and soft, tzaziki is delicious, and gyro meet is juicy and succulent. I love it! I wish it didn't come with fries on the side - perhaps standard potatoes. The moussaka is alright. It's a little more like shepherd's pie, however, than moussaka. It was somewhat under seasoned. Side ride and veggies are not particularly good. Peas and carrots are bland and rice was a bit dry. I wish the side dishes were more authentic or that they would forgo  sides and just pay to add them on.Baklava is delicious."], ["Wendy H.", "Gyro Heaven!That's all folks."], ["Miky L.", "I have been coming here for years for gyro sandwich.   The price for what you get is amazing!  Over the years, never been disappointed!"], ["Laura R.", "My favorite Greek restaurant!!  Big portions...  Everything is very typical ... Nice ambiance .. I learned to love Greek food because of this place , and still to me this one is the best"], ["Shannon R.", "Love this restaurant! The best Greek in Miami!"], ["Theo H.", "I came on a Saturday and the place was empty. It was actually a nice day, so we sat outside and enjoyed the gyro plate. The bread was delicious, but there really wasn't anything memorable about the meal. Personally, I prefer the gyro place downtown, but this wasn't terrible."], ["Adam S.", "My better half picked this up for us for a quick and easy Sunday dinner as it is not far from the house. The food was ok (not terrible), but there were some things that I did not particularly care for. First, I didn't really like the hummus. I felt like it was too yogurt-y and just didn't really taste like hummus to me. My gyro platter was ok, but the gyro meat was dry and overcooked. The pastitsio was probably the best thing I ate here. It was what I would describe as good but not great. It was nearly $40 for dinner here too which is expensive. There are Mediterranean places close to here that are much better."], ["A A.", "We love this place! The food is spectacular, authentic Greek food all around. The decor makes you feel like you are in the most wonderful Greek island."], ["Clair C.", "Food goodThe busser was drinking out of the customers cups then serving them.... Eww"], ["Alex E.", "We just had the best Greek food in Miami, by far! Kai eimaste apo stin Ellada. Para polu wraio faghto! We had the Avgolemono soup, the Horiatiki Salad, and the Kotopoulo (Chicken) with rice. Amazing! We just moved here from Greece, with a brief stop in LA, and this food is the closest we can get to Athens. Euxaristw Paidia!"], ["Mari T.", "We ended up in this place by accident. My friend heard from someone that this place was really good so we decided to give it a try. We really enjoy our meal here. The service was great, our waiter was really nice the food came out really fast.  We had for appetizers the Greek yogurt dip and the octopus vinaigrette. Those were delicious!!! For main course we had some kind of meat sampler for 2. Everything was good the only thing why I'm Givin 4 stars is because the pork in the sampler was not good. Definitely will come back!"], ["Audra B.", "Best Greek food in Miami by far! Huge portions of food- awesome taste, and no extra charges for tzatiki sauces and what not. Usually we get the combo platter and can never finish it, just take half to go:) So for the price and quantity it is a bargain..and you're getting authentic delicious food. Win Win...Love this place!"], ["Melissa A.", "I love their gyro sandwiches and hummus platter. The only complaint I have is that they always burn the pita bread!  Last few times I have come back I ask them to lightly toast it, however it still comes out slightly burnt. Service is good, food is good, they just need to stop burning the pita!"], ["George M.", "Some hits and some misses but first i have to ask why is it that Greeks love to put cucumber on and in EVERYTHING?!?I really enjoyed the outdoor seating on a rainy night, the fried calamari, warm Pita bread and Jenny really liked her GyroI got got the chicken souviaki platter and was disappointed    The waiter who would disappear for long periods of time said the marinated chicken in the platter would be a lot tastier than the one in the gyro and if thats the case I will take it to mean that the unmarinated chicken taste like cardboard      My main restaurant pet peeve is waiting to get the check after I am done eating    It got to the point that we had to go inside and find the waiter in order to pay    It should be some kind of rule that if you are made to wait longer than ten minutes to settle a bill, it should give us the right to leave aka dine and dash which I come to find out my dad is an expert at but that's another story"], ["Sean E.", "This is surprising yum! Got it delivered so it was just all about the food. Combination platter was yum."], ["Naty K.", "I was pleasantly surprised after I decided to give Mykonos another try.  The lamb shank was very tender and falling off the bone, and the Ekmek dessert, wow, I have never tried anything like it nor have I found any other restaurants that offer it.  It seems they have improved significantly since the last time, so I may decide to come here more often."], ["Sunflower F.", "I've been eating here for 23 years and still love the food.  Over the years I've had just about everything on the menu but my personal favorite is their lemon chicken soup, Saganaki (omg i love this), and Musaka. I would also recommend their Calamaris, or Taramosalata as an appetizer... they also have an appetizer combination platter which is great to share.They have the best Souvlaki (i like the chicken but my mother get the pork every time) in town (by far)! I get the platter but they also have a Souvlaki wrap.Let see what else... oh and for vegetarians they have  vegetarian Mousaka, Melinzanes Tylixtes,  and vegetarian Lasagna. oh and of course desserts!!!! yes you can get the typical baklava or greek cookies which or good but if you want something that will blow your sweet tooth go for the galactobourico.... I'm getting hungry just thinking about it.Note get the village salad(real Greek salad) over the Greek salad it is really yummy and a great healthy deal for $10. Ok so other then the food its has traditional Greek looking restaurant however there is a beautiful mural on the back was of Mykonos."], ["J N.", "This used to be our favorite Saturday lunch spot. I recently went there after two years and found this to be a completely revamped place from inside. They appear to have more servers and better decor. The downside is that prices have gone up substantially and the home-like feel is tempered down.The food has always been good.  Their Chicken Gyro Platter is my favorite. It comes with chicken gyro and a side. Pita bread always tastes fresh to me and chicken is always tender and flavorful. Occasionally I find chicken a bit too rubbery but then flavor compensates for that. Depending on the cook, their gyros can be full of Tzatziki Sauce which gets a big overwhelming after a point.  Portions are large and, if you are not very hungry, can be shared.This restaurant has been there for more than 20 years and is considered a landmark. I would have given it four stars but $12 + drink + tip for lunch is bit steep. I am sure I will still find some reason to visit this again soon."], ["Pete P.", "Incredible brisket! Great service. Strong Greek coffee!"]], "Rice House of Kabob": [], "Eat Greek Souvlaki": []}