{"Proof Pizza & Pasta": [["Danielle A.", "Love this restaurant. It was recommended to me by two fellow foodies, and their suggestions did not disappoint. I was mainly driven by the idea of eating a French Macaroon Ice Cream Sandwich that I saw on Yelp, and all I want to do now is go every day to eat one. Pizza was great and so was the pasta and appetizers! Limited menu, just to the point so that you don't flood yourself with too many options that make it hard to finalize on meal options.I say go go go!"], ["Emmanuel O.", "The oxtail pizza is amazing, first time i've tried this, it's a must.  Good service and the brussel sprout salad is great."], ["T B.", "Had such a wonderful time here with my friends and were totally that obnoxious group when we came in. I think our reservation was for 6- we showed up with 12 and most of us came from the bar. Holy crap this place is amazing. The server handled our table super efficiently and had drinks for everyone before we knew it. The menu takes some time to look at and I think between us all we only missed one or two things on the menu.  The octopus- seriously like a dream. So super yummy. Bone marrow pizza. So. Fantastic. Fresh mozzarella. So tasty and warm with delicious focaccia. Bolognese was the favorite Desserts were all yummy and had huge portions! Everything was so great! Hats off to your kitchen and staff Proof! You rocked our world!!!"], ["Leilani D.", "This place is really top notch. I've been here a handful of times and because I made such good choices the first time around I've made pretty similar selections every time.If you go, which you should, get the gnocchi (little pillows of perfectly cooked heaven), the short rib pizza with black garlic (one of my top five favorite pizzas ever) and the ice cream sandwich macaroon they have that day (I've tried two - strawberry champagne and red velvet, both were amazing).While it's usually full, sitting outside is worth a little bit of wait. The outdoor area is really cute, quaint, and the perfect atmosphere for this delicious meal.On top of that, the service has also generally been excellent. Basically, this place hits it out of the park. One of my new favorites in the neighborhood!"], ["Emily R.", "I have a mixed review for proof pizza. I will try to give constructive feedback so the reader can make their own decision. Firstly, I like the decor. It has a very hip vibe. The acoustics in the dining room are a problem. I recommend the owners invest in some acoustic tiles for the ceiling and consider also adding carpet. The sound just bounces of the floor and ceiling and you have to shout to be heard. It really spoils the meal to be assaulted with amplified dining room sound. The gemelli pasta with the meat sauce is simply divine. The depth of the richly flavored sauce mixed with the lightness of the whipped ricotta created a sauce that is so good I wanted to lick the bowl. I was very disappointed I. The small size of the portion and that you don't offer complementary house bread with the entree. The food costs on pasta and house made bread are pennies, you can afford to give your patrons a portion than can satisfy an adult as an entree. You need to avoid the \" piss off\" factor when you skimp on portion size and fail to offer bread.The pizza sauce was a bit acidic. I would cut it with some sugar and take the salt content down about 5 notches. The sauce made the pizza inedible for us. These are easy fixes. I would like to go back when the kitchen works out these issues. The menu, albeit extremely limited is interesting  and it shows imagination and creativity in the kitchen.The best part of the meal was the olive oil cake with lemon curd and crushed pistachio nuts. The perfect balance of texture with the whipped cream and lemon curd contracted with the sponge and the crushed nuts for a perfect bite. It was beautifully plated and its a dessert I could eat again and again. The server was knowledgable and attentive."], ["Adriana M.", "Came here over the weekend. We didn't have to wait for a table and the service was fast. The waiter was eager to answer any questions we had about the menu. We decided to go with the margherita and the white pizza. I didn't try the margherita but according to my friends it was good. I had the white pizza and it tasted pretty good. We decided to finish off with the dark chocolate panna cotta which was delicious. We also got the macaroon with ice cream, but I wasn't a big fan of the pineapple ice cream. Overall, food and service were good."], ["Greyceli M.", "Proof is a cute place. It's almost a toned-down-3-notches upper east side joint.Servings are small and meant to be shared so don't go if you're selfish and/or one of the pigs from Spirited Away. We ordered the mozzarella and focaccia appetizer. Words nor pictures can do this plate justice. The mozzarella ball is the perfect amount of salty, fresh, and soft. If the focaccia were served in complimentary endless breadsticks fashion I would eat here every day until I die. The angel hair crab was delicious but I couldn't stop thinking about the mozzarella. Ox tail pizza was interesting. Since their pizzas are \"proofed\", the thin crust has a super airy feel, different from a typically baked thin crust pizza. Macaron dessert didn't impress me too much. Hopefully they'll add a little variety to the dessert menu."], ["Caio M.", "Tasty place, not cheap and not expensive.  Honest food. Small, quaint and great for a quick local pizza.  Try it out friends!"], ["Jonah K.", "Small place right near the shops at midtown, a great location, but not in the mess over there. We came for a weekend late lunch after I had gotten off a flight and this place was on the list and on my way home to Miami Beach. Tried a couple pizzas here, both were very good. The manager was very nice, and the service was prompt. I wouldn't put this in my top 5 pizza list for Miami, but I would put it in the top 10. I didn't try any pastas."], ["Jorge M.", "Good addition to Midtown Miami. I know you're probably saying that's what we need another pizza joint but this has homemade pasta made on premises.  Walking to this place you notice some real kewl artwork on the sides of the building. Once we walked in we were greeted right away and was asked if we wanted to seat inside or outside on the patio. We chose to seat inside. The server came right away and told us what the place was about and his favorite plates to get. We decided the start off with the grilled octopus. It was perfectly grilled and not to chewy. Also had a sauce that was made with the ink and a green salad on top.  We also had the burrata salad. Which is a ball of mozzarella with a creamy center with beets. We also ordered the house bread. Which is like a pizza but without the sauce or cheese. For entrée we had the bow tie pasta with the meat bolognaise sauce and it was delicious. We also had the angel hair pasta with crabmeat. We also tried the Margarita pizza. It was good but would have like it a little more well done and thinner. Then for dessert we had the champagne and strawberry macaroon ice cream sandwich. It was really good. Place is small not to big inside and has beer and wine. Great service and food."], ["Mandy J.", "Great service and atmosphere. The ox tail pizza with caramelized onions was awesome! BBQ octopus was delicious and icecream sandwhich a must! Definitely will go again."], ["Barby M.", "We went to proof for our date night a couple of weeks ago, and we had a great experience! It was a beautiful night, so we sat outside in their patio area, which was very quaint and romantic. To start, we had a glass of wine and fresh mozzarella, which was absolutely perfect. We shared a margherita pizza, which was good, but not my style. It had a very \"smokey\" flavor, which I am not normally too keen on. The dessert was a chocolate cake-like thing with sea salt and caramel (Okay, the memory is a bit fuzzy on what it had in it), it was divine, whatever it was."], ["Caro D.", "I went to Proof on the recommendation of a friend who's last rec was a complete disaster. I took a chance on this Midtown spot because it was close, well-priced and willing to seat a table of 11 on a Saturday afternoon for lunch. Proof knocked it out of the park. As a family, we made the mistake of each ordering individual plates. Once the plates started hitting the table a chorus of \"OOOO! wait, I want to try that\" forced us to go the sharing route. Between the burrata with arugula and beets, warm farro with duck proscuitto, shaved raw brussel sprouts with craisins and the lamb sausage with lentils (excellent), we split a menagerie of appetizers among the 11 of us.The octopus: grilled to perfection, tender, and rid of all the tough skin - sitting in a sauce of squid ink and salsa verde or something magical. Just magical. The selfish kids in our party (myself included) stuffed it down our throat so fast our parents just kind of looked at us in awe, and then ordered a second one just for them - and quickly understood. We picked the highlights from the pasta menu, and not a single dish was not exemplary: pappardelle with mushrooms and sherry, spicy angel hair pasta with crab, agnolotti stuffed with chestnuts and apples, and the home made gnocchi that was closer in tenderness to mashed potatoes than any sort of traditional pasta product. The dessert menu came and we just gave up and ordered two of each. The winning dessert was the lemon cake with olive oil, although the ice cream sandwiches made with macarons were worth noting because they were original and beautiful.Service was excellent, food was even better and the draft beer selection sedated my \"connoisseur\" cousins (I call them hipsters to piss them off). Would repeat, would recommend and I looked like a restaurant recommendation super star in front of my whole family."], ["Melissa P.", "I was so excited to check this place out. I bugged my husband for days! But the portions are small for the prices. The pasta (gemelli bolognese) I had was really delicious but so small. And the margarita and Salumi pizza were good but again small and just not satisfying for the price plus they charge you for the tab water and they don't give you any bread for starters.  I was kinda sad because I really wanted to like it! The service was very good! But the dessert was delicious!!But with so many pizza and pasta options... I guess it just didn't do it for me to go back."], ["Belinda B.", "Wednesday evening, we opted for bar seating. We were the only people at bar with John, the bartender.  John was pleasant and knowledgeable about menu. We enjoyed a good bottle of red wine and our meal based on his recommendations. Oxtail pizza - sweet caramelized onions and earthy shredded oxtails. John reminded us that everything is freshly made in the kitchen.  (there's an ox in the area right beyond the kitchen). The oxtail pizza is on the rich side and we asked for a salad to give our palate more balance. John suggested the red oak lettuce salad (hold the oak, heavy on the lettuce). Best salad ever! I may return just for the salad.       My friend and I shared the chocolate chip ice cream sandwich macaron. I am a chocolate chip lover and macaron lover and ice cream lover. We wanted to love this dessert but we had to deconstructed it to optimize the flavors. I enjoyed the oversized macarons. My friend enjoyed the ice cream.        We will return to try other menu items!"], ["Cherisse M.", "Awesome pizza and pasta! Quaint spot with friendly staff. Will definitely be back before returning to NYC for some more of the white mozzarella pizza."], ["A P.", "Great little find!Limited menu but several gems.Shaved brussel salad is excellent!So is oxtail pizza (ask for extra oxtail and crispy)!Down it all with Miami Weiss beer.Blueberry macaroon is the grand finale.Great value and service!"], ["Audrey G.", "The pizza was delicious, light and fresh ingredients, it tasted authentic. I had the White Pizza and highly recommend it. The staff was extremely friendly and attentive. This is the best service I've seen in this area. For dessert I had the Champagne and Strawberries Macaroon Ice cream sandwich, which was very yummy.  The ambiance is cool inside and the small outside terrace is cute and cozy. I will definitely go back."], ["Linet P.", "Love the pizza here. Never disappoints me. All of them are delicious.I have also had the carbonara pasta and I was wowed by it. Beautiful outdoor setting."], ["Robin D.", "This place is a nice lunch spot. Also kid friendly. The angel hair pasta with crab was delicious. The oxtail pizza was also delicious. The macaroon icecream sandwich was okay, I hope they have a pumpkin macaroon for the holidays."]], "Soya e Pomodoro": [["Talisha M.", "Escape to Italy!!!Wow this place is so cute & totally takes you to Italy. Even with the lack of ac it feels just like Europe lol. The live music on Friday was extra special. The pappardelle with lamb Ragu was the best I've ever had. Sangria was great too. Can't wait to come back...maybe when it's cooler at night. This place is so unique & one of Miami's best kept secrets...and mine!"], ["Mauro R.", "Soya e PomodoroLOCATIONRight in downtown Miami.AMBIANCEOpen space, industrial look, a mixed between some European places and some in the North-East USA (or Chicago). It's not about fancy here, it's about food.SERVICEService was good, nothing to complain about, attentive, timely without rushing us.FOODThe food is pretty good. If you come here I suggest you try their homemade pasta, any of them, depending on the ingredients you like. The homemade pasta is probably the main reason to come here. Strangely enough, the appetizers seem a little overpriced compared to the past dishes and even the entrees are well prices. If you are hungry try the stinco!The fazzoletti di pera e formaggio are a nice idea and it came out almost perfect. I am not sure the shrimps fit much into that, still it was a good dish.Overall the food is well cared for and nicely done.VALUEThe value is a good 7/10. Prices are not cheap, but not high either and the quality makes it worth.Final commentThe main issue with this place is the heat. There are fans but no air conditioning and for most part of the year you might find yourself uncomfortable, sweating while eating which to me is not a great combination. It really depends on how well you tolerate heat. I would definitely consider this place during winter months, but from May to September I am staying away, as I tolerate better the cold than the heat."], ["Sonia A.", "This a little, quaint, quirky restaurant in downtown Miami. My friend who is from the area, suggested it. The service was a bit disorganized, and they didn't speak good english. So minus one star for that. As for the food, it was pretty good, not amazing, but good. We get the Melanzan alla parmigiana as an appetizer, homemade gnocchi and lello. All good options to try. We got ice teas with fresh mint, which were a lovely addition. It's a nice Italian place to try, if you are in the area and you appreciate a very eclectic, yet comfy atmosphere that opens to the outside."], ["Marilyn M.", "I've caught myself day dreaming about the pasta hear at least 3 times this week alone. I really need to make my way over there soon!I've been here three and loved my pasta each time.The little purses of shrimp, cheese and pears are DIVINE as as the ravioli in walnut cream sauce.  Absolute perfection.  Cons: *Very hot and humid despite their efforts with the fans. Their pasta is THAT GOOD that Ill endure the sweat dripping down my face while eating a HOT dish on a hot day in a hot place. *We were ignored at the entrance both times we went. *The salad they bring out before your pasta is pretty boring. Pros:*Service is nice once you are seated.  *pasta is INSANELY good. *The bread is tasty but butter is wah-waaahh *Black tea with mint is refreshingMUSTS:*Fazzoletti with shrimp & pear*Ravioli in walnut cream sauce"], ["Ashley H.", "The second I walked into this place I felt as though I had been transported right back to Rome. Everything from the live italian music to the architecture makes you feel as though you are far, far away from Miami. This restaurant is in a hallway with fake clothes lines hanging from windows which gives you the feeling of eating in an alley way in Italy. Bookshelves with Shakespeare and other old books line the walls. As you can tell, the location and decor is stunning...but as for the service it was mediocre at best. I have now been here 3 times and every time service has been our one complaint. We were there for 15 minutes before even being asked if we want water and another 15 minutes for drinks and just as long for food. The food itself is a mix between out of this world and bellow average. I have gotten dishes such as the pasta with zucchini which was mehh and then the lamb which was ouuuuut of this world. I don't normally care for lamb but a friend of mine had it the last time we were here and I had to get it and it was by far the best lamb I have EVER had. Overall I'd say the service could be Improved and depending on the dish you get you can have a completely different experience than the person next to you. I would highlllly recommend this place for a date if that's what you are looking for because it is incredibly romantic and it's a trip to Rome  right across town. If it's not a date and you just want to have some good food and good service I'd probably choose else where."], ["Yoanka V.", "This place is in the middle of downtown Miami, it's a very different place to have an unique experience.  The food it's awesome and authentic , and the ambiance is good , decor its antique , parking space is a mission but ofcourse you are in Miami , so it's normal , if you have reservation try to get there with a lot of time to find parking , they have live music on Saturdays , the only thing  I didn't like its That  the restaurant doesn't have air conditioning ,it has fans and that can be uncomfortable ,  also service it's very good, I will recommended if you want to feel that you are in a different country , for me a one time experience was enough :)"], ["Andre W.", "Such a lovely restaurant in downtown Miami!Me and my very good friend stopped by here as she mentioned it was one of her favorite restaurants in Miami since she moved there last summer. She also mentioned that they have live jazz on Friday evenings and she knows that I love jazz. We actually was there around 8:30 as we got to watch the band setup and kick the night off. The scenery of this place reminded me of a couple of places I visited in Rome as you are inside but it looks and feels like you are outside. the ceiling are very high and have really cool art on the walls along with dim lighting, but I felt like I was eating in an alley in Rome which was cool. The band had a lounge singer as part of the group and she was awesome. Very gorgeous smile as well as a gorgeous voice attached. We actually saw her when we came in as she was trying to get the host to tend to us, but owe just thought she was a regular patron LOL. Very nice crowd was here this evening and everyone seemed to be enjoying themselves here.We started out with a bottle of pretty good sauvignon blanc along with cheese an olives plate. Lots of cheese and very little olives. I then ordered the Pappardelle Gambrel which was a huge amount of pasta with tomatoes and pistachio sauce with full shrimp on top...no the head and eyes were not cut off LOL. Very good dish but I liked her dish better as she got the Fazzoletti Formaggio which seemed a little like gnocchi. Our server Armando was awesome...he seemed more like a manager of the place though. Good spot...love it!"], ["Boni L.", "The meal is like a tour of Italy, like no other. I love this place. Downtown Miami has many restaurants but none like this."], ["Angie N.", "Excellent place, food was delicious, service outstanding and the ambience makes you feel as if you were in Italy...highly recommended!"], ["Stephen F.", "Soya & Pomodoro is really one of those hole in the wall places that you just accidently stumble upon and then think, how did I not know about this place?!  First of all, when you arrive you're gonna take a step back and look around twice, no way are you in Miami any more.  The decor inside is so eclectic and European, it makes you just want to sit and stay to take it all in.  I've been several time for lunch and the service is on point and friendly. My favorite dish by far is the Saltimbocca di Pollo, which is a perfect combination of salt from the ham and juice from the tender chicken.  Just amazing.  You have to go here."], ["Stephen C.", "Fantastic little place, downtown, a hidden gem that's like eating in Trastevere in Rome, you feel like you're in a back street, with all the history and romance of Italy. Amazing food, the owner stops by says hello, great guy who really takes an interest. I can't say enough good things about this place ..... it's a must every time I'm downtown."], ["Nicole W.", "I dined here while shopping in the nearby Seybold Building. It's a quick 5 minute walk, and as I entered this restaurant I was wowed by the decor and ambiance. We sat outside in a patio type space with very high ceilings . It was a hot day, but we enjoyed the nice breeze that came through. You definitely feel like you're in a small town Italian cafe here! Our lunch started out with some wine, yummy bread, and a salad. We ordered the Spinaci salad with chicken and the Pollo al Funghi (Chicken Scallopine with mushrooms). Both were fresh and tasty, however the chicken in the Scallopine was a wee bit overcooked which made it a little chewy. Overall, this is a great place for a casual affordable lunch. Next time, I will try their homemade pasta!"], ["Grace B.", "I had a chicken with a side salad. The veggies were steamed and it was good. The location is right outside court house which is great for government workers."], ["Nurys I.", "This is a hidden gem in downtown Miami! The vibe is phenomenal. Bohemian Italian! It's as authentic as you can get. I love the exposed brick walls of the historic building they are in.  I've mostly gone for lunch but I know some weeknights they have live music - molto romantico! The staff treats you like family from the minute you walk in and they refer to all women as \"Bella\".  Great for the ego! ;)Now to the food... I haven't tried a single thing I didn't like. The bread and olive oil are absolutely amazing!!! Ask for the spicy olive oil if you wanna jazz things up a bit.  The soups are ALL OUTTA hand.  The orecchiette with broccoli rabe is excellent. Their fish specials are always excellent. Their salads are all really really good. If you don't have a huge appetite, a soup and a Pia (smaller eggplant parm portion) is perfect. A must try!!"], ["Ara R.", "I asked for the Pappardelle Gamberi, it was good. Did not  have a lot of flavor it was more like a plain pasta. My partner asked for the Pappardelle With Lamb and it was better, more flavor on the pasta.  I love the ambient, great spot. They charge you $2 per person for the music to support the musician, which is not much but is weird to see that on a menu. Overall, i like it."], ["Filippo T.", "Real authentic home made Italian food... If you want a real Italian food with great quality and a more than honest price this is the place!Remember to keep a space for the desserts, fruits sorbets from Eccolopops and home made cakes are amazing."], ["David B.", "Great place. I loved it. Brought my girlfriend there for her birthday, and everybody was super nice. The owner and chef even came to our table and personally greeted us. The food was amazing! They had a nice jazz band playing and singing. They even went the extra mile and brought out a dessert with a candle and sang Happy Birthday for my girlfriend. Truly a great experience. I would definitely recommend it, and I'll be coming back."], ["Clay K.", "We dined here last week and absolutely loved it. This is one of the most unique dining and entertainment experiences I've had in Miami. The space is not so much a building as it is the space between buildings. Once you are there you could swear you had found some little spot in Venice or Florence. They offer live jazz which made it even more great.The furnishings are a hodgepodge of found antiques and curiosities. Somehow it all works to create one of the most romantic and unique spaces I've seen. The ramshackle kitchen puts out food that will remind you of an Italian mother telling you to \"mangia, mangia\". Portions are hale and the food is delicious and well prepared. We particularly loved the mustard crusted sea bass with rosemary potatoes. Highly recommended for those seeking something different and something delicious in more ways than one."], ["Ginger N.", "I dislike leaving anything but 5 star reviews. I have been to this place on several occasions and was happy w the service. The last time I went here for a birthday party (March 2013) I was one of the last people of the party who paid bc I used a credit card. The unfortunate thing that happened was that we had less people who ate and drank than planned/reserved and the last 2 of us guests got stuck paying for the few extra guests who didn't eat. I talked to the manager to see if I could resolve this and the answer was NO. We said we would happily pay and leave an honest yelp review. 3 stars is generous."], ["Mario D.", "Great ambiance and wonderful food. Love the live music. Careful, you might miss this hole in the wall of a gem."], ["Miriana M.", "I love this downtown spot. The location is so unexpected, yet it works! The area is not so great late at night, but once you're inside the establishment, it seems as if you're transported to a romantic little alley in Europe. The ambiance is great, the live jazz is great, food is good. Of course reservations are always needed as this is a popular little gem. Great for a romantic candlelight dinner date!"], ["Brittany B.", "Incredible food and service. This restaurant has a great energy. Dining here was like taking a short trip to Italy. Can't wait to return."], ["Nicole T.", "Best Italian food, hands-down. Love the old-world feel. It's a bit like being in a library, silent speakeasy (oxymoron, I realize) and talented Italian mom's extended dinner table in one. Dishes are made and served with love."], ["Drew B.", "Had a great business lunch today. Great spot with a great atmosphere. Very friendly and attentive staff. I had a chicken baguette sandwich. It was great. Came with a nice healthy green salad. I will be back."], ["Melany M.", "Delicious! Fresh pasta and dessert.I'm definitely going back for more!"], ["Henry H.", "The food is great. Simple as that.  I never go here and sit down to eat because its way too hot in Miami and this is an outdoor place stuffed in a beautifully covered alleyway.  They have a few fans but its still sticky uncomfortable. Ill order out when I can but its not as good as it is when it comes out fresh.  All in all it is a great place to eat but for my creature comforts  I need A/C."], ["Momo B.", "DOWNTOWN LUNCH SPOTWe initially sat at a front entrance table to briefly take advantage of the cool fresh air. Unfortunately there was an inconsiderate diner who smoked acrossed from us.  Luckily there was another open table at the backend by the bookcase to this unique semi open air facility.Don't think any two chairs or table are a matching set. The bookcase behind us masked a plywood temporary wall that hides the rest of the facility seemingly used for everything but as a restaurant. My photo will show a ceiling not matching wand there  are walls to two exterior facades facing an alley. Amazingly, how does this landlord pass city codes.Our guest ordered lentill soup and salad combination. While I could not resist from ordering the papparedelle with shrimp, Yu-go chauffeur goes for the entree of the day orichiette and lamb ragu. The general consensus was the food was excellently prepared. I was aware that there had been remarks of shortness in table service, but today it was never an issue. In fact the wait staff was very vigilant."], ["Liz J.", "My husband and I had our wedding reception at Soya e Pomodoro recently. It was absolutely fantastic! Rosario and Cristian responded to every e-mail, phone call, and in person meeting to help us plan every aspect of the event. They were very accommodating to every last minute change. In the end, the event was a huge success. Our guests were happy, the food was great, the staff very helpful, and everyone had fun. It is one of the most unique venues in Miami. We also hired the regular Thursday night band to play Cuban music, so most of the restaurant quickly turned into a dance floor. Overall, an amazing reception and we can't wait to visit the restaurant again."], ["Gaby P.", "The pasta is fresh and the music is live. Can't get much better than this quaint hole in the wall in downtown. Must visit"], ["Lena C.", "Today was a special lunch for me since I'm celebrating a promotion. It's Italian Friday (as we like to call it at work) and we chose Soya y Pomodoro, just a few blocks from our office. Maybe deciding on this place for lunch during one of the hottest days of Miami's August wasn't the best move, since they don't have AC? Yeah, maybe I should've done a bit more research on that one. But anyhoo, on to the food.I had an amazingly creamy dish (which I guess is the running theme this week) of ravioli stuffed with ricotta & spinach in an almond cream sauce with pecans. I absolutely loved every bite. The other two big hits at our table were the pene pasta & the broccoli soup. BUt sadly, not everyone enjoyed their meal. I have to agree, the lasagna was bland at best and the panini was skimpy. I would think that an Italian spot would have a bit more flavor in their lasagna. I did love my dish, but after tasting the others, I had to knock it down to the ol' three stars."], ["Carolina V.", "decided i wanted to munch somewhere special for a lonesome birthday lunch and i had already heard wonderful things about this place so i gave it a shot and wonderful it was indeed. Everyone was very attentive and quick and helpful. The location makes it seem like a hole in a wall, an almost hidden treasure. decor and music made it seem like i was in another world..very italian and very vintage. cant wait to come back."], ["Zeel S.", "Went here with my colleagues for lunch and oh my was I blown away! For appetizers we got the bruschetta classica: Really fresh great flavors, the Formaggio E Olive: Great selection of cheeses and the Melenzone Alla Parmigiana: that was delicious!For mains I got the Ravioli Ai Funghi Porcini: this was the hero of the meal! The walnut sauce was to die for and it went great with the mushrooms stuffed in the ravioli!Definitely one place I am going to keep going back to"], ["Janet M.", "First of all it's not in the hustle and bustle of downtown Miami as I thought.  Restaurant is in more of a industrial district which was a disappointment but that's where it ends.  This place is fabulous!  it used to be a bank so it has the high ceilings and an open space but it is a small restaurant.  You will need to make reservations .  It is romantic with subdued lighting and a very nice ambience.  It is an Italian restaurant and when you walk in and look up you see clothes hanging to dry on a clothesline like the city of Naples.  I'm not sure about Friday but on Saturdays there is live music and there is a small section with sofas to just sit back and relax while having a glass of wine. There is a small area on the other side of the restaurant but they don't have a bar nor do they have a full bar menu , disappointed about that! Their wine menu wasn't even that large so that was even a bigger disappointment.  The food definitely made up for it though.  Their pasta is homemade and the shrimp pasta dish that I had was out of this world!!! We met and spoke with one of the owners and he was a delight to speak to.  We will definitely go back!  it was a beautiful place that brought us back to Italy !"], ["Fernando C.", "We went on a Friday night The quality of the food is not what it used to be.... they had a band playing witch was nice, however when the bill came there was a $4 dollars charger for the band playing.... I had never since such an absurd charge...."], ["Silvana P.", "I really love this restaurant, the fresh bolognesa pasta was amazing! The ambience of the place is unique, as well as the live music"], ["Anton R.", "A great downtown lunch spot to eat in or take out. Relatively cheap, great quick service and the food is fresh and always good.I believe that the Eggplant parmesan is the chefs home town dish and is excellent, and the Gnocchi is great."], ["Joanna L.", "Always delicious! Beautiful, unique setting and authentic italian dishes. Love when there is live jazz on the weekends. So romantic!"], ["Nicholas S.", "I have been to downtown and have worked in the area for the past 15 years and I always see this restaurant but I never get the chance to stop in and try the food. Today I just happened to have an extra half an hour for lunch so I stopped in and have their gnocchi with pomodoro sauce. It is the second best gnocchi  I have had in my entire life other then the one I make. It is definitely homemade and you cannot beat the sauce. This restaurant and food gets a 10 out of 10 from me and the service is amazing as well and very friendly and homey. The restaurant has a very rustic Italian feel to it and it makes you feel like you are at a very trendy restaurant on the coast of Italy. A+++++ from me."], ["Eddie D.", "Authentic and fresh. This rustic Italian restaurant tucked into an old downtown space never fails. The location was never meant to be a restaurant but it's super cool with lots of yesteryear character, including archways and super high ceilings. The food is equally full of character and taste. If you like Italian you'll love this laid back and delicious slice of Italy tucked into a backstreet in downtown Miami."], ["Lucy O.", "Let me start off by saying that I LOVED this restaurant.  The food was excellent.  The space was very cool (in a lobby of a former bank in downtown Miami - high tall ceilings and tall beautiful columns). The staff were all Italian, the service was good, the wine they recommended was great! We ordered a couple of items off the menu and a couple of chef's specials. All the dishes were excellent.  A dinner for 4 with a bottle of excellent wine cost us $125 and was worth every penny!  We went to Soya e Pomodoro for dinner on a Saturday night.  They had a band playing and they were very good. If you seat right next to them, it gets a bit loud and hard to talk.  And it's also best to make a reservation. The place does get packed. I highly recommend it!"], ["Helene B.", "I love the atmosphere in this restaurant You feel like you are in another country in the 50's The food is really good Always a pleasure"], ["Jordan N.", "And so I've been back again... and I don't know what it is - but the more times I stop by during their jazzy nights, the more I start feeling the amore. Their mismatched chairs, Italian laundry hanging on the clothesline above, the menu in old leather cover, the books in the shelves, and that lone stool for the troubadour... and coupled with friendly staff and tasty al-dente pasta, I think I'm finally sold.I was told that the popular dish is the pear and cheese pasta (fazzoletti di formaggio e pera - $15), but honestly I thought that could be found in many other Italian places. Then I was confided that the staff's favorite dish was the eggplant pasta (paccheri melenzane e ricotta salata - $13). And upon tasting this dish which I had expected to be simple and plain (Vegetables and pasta? No meat? Really?), it ended up satisfying my tastebuds so much that I had wished there were more (even though I did get full after having my whole plate).Coupled with my glass of Chianti, and the saxophone tuning in with the guitar, I couldn't have asked for a better laid-back night anywhere in Miami.Funny how the stars for this place keeps growing since my first visit back in 2007 (they've actually been open for nine years now and still they remain on the down low)."], ["Carolyn F.", "This restaurant has great ambiance. It's like you're sitting outside a restaurant in Rome Italy but you're inside!  Good food and service. It's off the beaten trail just a couple blocks from Bayside/ Bayfront.  We thoroughly enjoyed our meal."], ["Luis E.", "I had heard so much about this place and I wanted to try it out so bad... but I sort of forgot it existed... until recently.Took me a long time to go to Soya e Pomodoro, but it did not disappoint. 10 of us showed up on a Friday night and the place (a very different looking restaurant) was packed. We had no reservation so we almost walked away but they managed to fit all 10 of us in a table fairly quick, so we stayed.Ill start the review by saying that the service is probably one of the best I have ever seen in Miami. These crazy italians clearly enjoy what they do. Maybe its because we had italian-speakers at the table..They offered us a deal, pay $30 per head and they would just bring food... and they did.... We had Burrata, eggplant and several tablas of prosciutto and cheese. Excellent.... oh and the bread? Oh-the-bread...For the main dish they brought these huge plates of Pasta... simple, but tasty. Cant complain. With house wine, beer, coffee and dessert we ended up spending about $50 per head, which is not bad at all.Will definitely go back... if I could I would give this place 4 1/2 stars, because I did feel the pasta's could have had a little bit more to them. But its closer to 5 stars than to 4, so..."], ["Cora Q.", "This is a great romantic place to share with a significant other. The ambiance is with low lights and great music! The food is like home made."], ["Luis K.", "Great atmosphere. It's like being out of Miami for some time.... The food is not great but very good for the price... Recommendable!"], ["Jessica R.", "Never have I ever visited Soya e Pomodoro and leftdisappointed. Starting with the staff, everyone is friendly, helpful and charming. The food (my mouth waters as I think of it) exquisite. My favorite dish is the Fazzoletti Di Formaggio E Pera. It is the perfect mix of sweet and salty. I highly recommend this place for any occasion. It is cozy and romantic, authentic and just perfection. You almost feel like you're in another country. They have live bands and performers quite often. You can check their website for scheduling."], ["Karissa O.", "Love this place. Charming set up and great food at reasonable prices. The pastas have all been delicious."], ["Erika K.", "I love the romantic rustic-chic vibe. This is a great place to take a date. The food is fresh and the attitude is unpretentious. The live music is a major plus, and I like that it is not overpowering.  Friendly service and fresh food for a reasonable price- can't be beat!"], ["Marc F.", "Want to head out of Miami for the night but too lazy to pack, pass through security and risk the possibility of a delay? Easy, visit Soya & Pomodoro in Downtown Miami. Headed to this restaurant on a Saturday night with a group of friends and as soon as we got a block away from the restaurant we could already here the live Jazz, it carried us right in. It seemed as though the host would have bet you we were not in Miami, from his clothing to the accent, we were convinced. We sat down inside and after speaking on how the setting itself is so refreshing and unlike Miami restaurants we began ordering some wine and appetizers. My wife ordered the pear filled pasta and I went with the Lamb shank and both were delicious, I had no problem finishing off both plates. With wine, a salad, 2 meals and tip we spent $70. I have already recommended this place to friends and family and plan on coming back soon! The only thing I would have changed was the level of the music, it was very loud; remember me mentioning it carried us in almost a block away? ..... Exactly, it made conversation difficult, but then again so did the tastiness of the food."], ["Cynthia F.", "The food is ok, prices reasonable, the service ok, the place original yet too hot, the live music cool...not too crazy about this place, just an ok place that's all."], ["Amanda M.", "Fabulous Italian cuisine, could be a little less salty though. The tiramisu is delectable. I felt like I was back in Europe. Would definitely recommend for date nights."], ["Laure M.", "Great unique authentic Italian place downtown Miami.Amazing setting as it kept the original arcades inside an old building. The decor is unique, filled with personal touches and all chairs and tables are different, colorful so it makes it cozy and charming!  The menu is stapled to a soft leather cover which is adorable.Complete menu with appetizers, salads, sandwiches, pasta and italian dishes. Everyone there is italian and speaks italian. You think you are somewhere in Italy!!For lunch we had the Tortellini Arianna (Ricotta cheese, Spinach in a Tomato & Basil sauce) and the Bistecca alla Pizzaiola (Pan seared NY steak with fresh Tomatoes & Oregano, served with roasted potatoes and peas). The pasta was good but lacked a bit of cheese. The steak was good, a bit chewy but still good, topped with a nice tomato sauce with capers. The potatoes, roasted with rosemary, were delicious. The peas were ok.No dessert because our dishes were big enough. Both entrees served with a house salad first, it was a nice touch.Very nice, different italian place. Very charming and authentic food! Great place for lunch or dinner if you want to travel to Italy while staying in Miami!"], ["Meg r.", "Super wonderful find. Got a table easy enough at 7 and ordered an affordable bottle of Proseco then a tasty meal of pasta and veal. Good server and the placed filled up as we eat while a band set up just to our left. Lively boho jazz filled up the vaulted ceiling in this strange courtyard alley looking space."], ["Adriano P.", "Very nice place. Italian food. Good pastas and salads. Very cool italian place. Prices are good. Good ambience. We got a Montepulciano wine, and the food was OK. I can be back, love the ambience."], ["Manuela F.", "I ' m here everyday for lunch. I think this is the best italian restaurant in miami. Rosario the manager is always nice like all the staff."], ["Jennifer S.", "If you have not been to Italy -- you must visit this place and get a feel for what the experience would be if you actually did. To all those complaining about the food: I have not ever, tasted anything more authentic, to Italian food, before I discovered this little spot in the dark streets of Downtown Miami. Owners are, like most Italians, so very-friendly and warming, they do know how to make you feel at home. They even took, my friend and I, on a tour of the place which in the past (20 years or so...) used to be a virtually Hollywood hidden gem for filming high-profile movies, as it, too, used to be a bank. So unique.The food is freshly prepared, made from scratch. They do take their time, but hey, find yourself a good companion and wait on.I would say the only downside is that they do charge a $2 fee (per person) on the busy evenings to support the live Jazz bands that come out and entertain you. But who would complain about jazzy nights, good company and excellent food.So, give it a try!"], ["Romi C.", "Very interesting ambiance. perfect place to get ugly before bumping uglies.It's humid and dank..no big swinging menu to roll your eyes at or annoying staff to interrupt your conversation..its not busting at the seams with Italianized Venezuelans having conversations with the restaurant- its just right. nice carpaccios, nice wines, nice live music.Unpretentious and charming. Very good place to take your flavor of the week and fool her into thinking you're more interesting than you really are, haha. Take notes."], ["Rodrigo G.", "You can't manufacture character. It's the product of all the little things in an experience. The decor, the food, the staff, the entertainment, all of it.  Housed in a 1920's era Miami building, boasting authentic Italian cooking it and great live music it's a rare find. A distinctly european vibe for people who appreciate la vie boheme."], ["Jacqueline B.", "My new favorite Italian spot downtown. Move over LaLoggia, you have some competition. I went with 3 friends. I had the penne pasta with spinach, mushrooms and mozzarella. Absolutely delicious. I wanted to lick the plate! (I didn't.) The portion was big enough to take some home. Friends had spaghetti with meatballs, fazzoletti with shrimp in a creme sauce (like pasta \"purses\" filled with cheese and pears) and lastly, the eggplant. The only complaint was that the eggplant didn't come with pasta. But everyone was thrilled with their choices.I love the ambiance. Having never been to Europe, Soyo has the look and feel of an Italian cafe. Or rather what I have seen in pictures! Yet, with the \"Miami\" experience of an outside Cuban cafe. It's an open air restaurant with no A/C but lots of fans. If you're a native, this won't bother you. If not, you may be a bit warm. The decorations are wonderful. The old-style archways, brightly colored paintings reminiscent of Haitian art, even up to a laundry line hanging way overheard, it's a cool, fun place to sit in and look around.We got there about 12:45p, and got the last table. The service was good, considering it was so busy. I see folks complaining about the service. Did he smile enough? Did they ask if all was ok? Did they refill my water glass without asking? Maybe not, so big deal. The food and atmosphere more than makes up for it.I hear Happy Hour is wonderful with live music. Can't wait to check it out."], ["Marty C.", "Couldn't decide where to eat on Thursday night, so my lady and I decided to go to the closest restaurant with the best yelp reviews. That brought us to Soya e Pomodoro right around the corner. The meal started kind of weird when the waitress said she wasn't sure where her chef was and made it sound like maybe he wasn't coming. She clarified and said he'd be in, so we just ordered the cheese plate and chilled until he came. All three cheeses were outstanding and brought me back to my favorite Italian store up north (why don't they have any good ones down here?). It was served with some shaved fennel, kalamata olives, and green spanish olives which was a nice touch. While the filet medallions with smoked mozz sounded pretty great, I would have rather seen it with gorgonzola, so I did a 180 and opted for the paccheri melanzane (tube pasta with eggplant and pomodoro sauce). It was delicous and covered in aged ricotta cheese. It was indeed al-dente, but could have actually used a couple more minutes in the water. Girlfriend got the porcini mushroom ravioli and it was outstanding. Creamy but not heavy-- really well balanced.  Overall you can't beat the vibe of this spot. You will be hard pressed to find another restaurant in the downtown core that has better ambiance AND food. I definitely recommend checking it out and will be back myself to try something new."], ["Lisa K.", "Live music and delicious food with a really cool ambiance. This is one of my favorites in Downtown Miami."], ["Edwin G.", "Awesome spot in downtown Miami! Been to it Fridays and Saturdays and the live music and good food always leaves me satisfied."], ["Christian C.", "This place is a great place.. My wife and i really love the ambiance as well as the food.I would have given this place a higher score however i feel there is room for some improvement. While having dinner we ordered  a bottle of red wine., now we go often to this place and the last time we thought it was just a mistake., the bottle of red wine is always chilled. This is excellent for white wine but for red wine is not good.Additionally i felt our waiter service was not on par with the owners which i think is great! She came very late and pretty much told us that we were jot going to have dessert.Highly recommend this location , however i do hope ownership addresses the waiter service quality."], ["MICHELLE C.", "Been trying to come here for over a year. They have some very strange hours and days that they are open. Voila, we pulled up and they had just opened. Our waitress told us we could sit anywhere and the kitchen would not open for about fifteen minutes. No biggie, they had an art exhibit throughout the hallway of the building. We ordered a very reasonable good bottle of wine and walked around enjoying the exhibit. The wine list is very small but good prices. I found it interesting that they had wine from Italy, Spain, France, Argentina, etc....but yet no American wines. The decor of this restaurant is so different from anything else I have seen around here. It is located in an old bank building basically tables lined up in the hallway of the arch of the building. Books align the walls, with some cool art pieces. What I found so cool, is that every single table had different chairs around them. As we sat there I could not help but to take in all the great vibe. You felt like you were in another country. Relaxing and very comfortable. My only thought was during our peak season heat, although they have fans, I can not imagine sitting out there with no AC. Our waitress brought over the menu's, so cute, soft brown leather and the menu is very small. I immediately spotted an eggplant appetizer, so of course being my favorite I had to give it a try. A few minutes later a basket of bread and the eggplant arrived. The Pomodoro sauce was perfect, and the eggplant was exactly how I like it, light and flavorful. I highly recommend this dish. Next was our entree's, hubby ordered the spaghetti bolognese, and I chose the Orchiette with clams in a light white wine sauce. Both of our dishes were flavorful and very good. Now, I must say I am a huge salt lover, to the point where for most people comment on how much salt I use. Having said that my dish had so much salt in it where believe it or not it was almost to much for me. Hubby was kind enough to switch plates with me. Do not get me wrong both dishes were great just a bit much on the salt. I found that their pasta dishes were pretty authentic, simple, with very good flavor. Now I will say for the price, I will admit the portions are quite small. We had an appetizer and one pasta dish each. We did not leave hungry but we were not full either. Reason for the four stars was the service was very good, the ambiance terrific, and the quality of the food very good. Looking forward to going back and trying other dishes. Eclectic kinda place. We were there early so as far as the live band I can not comment on."], ["Stephanie G.", "Soya continues to serve the freshest and most delicious Italian food and salads on my side of Downtown. Every time I visit, I find myself wondering why I keep going to La Loggia instead.I went for lunch today and tried their ricotta ravioli in a walnut sauce. The dish was outstanding and I can't wait to go back!"], ["Mia D.", "The place was chill, very different - but oh so hot! Sure they have fans, but with this miami weather and after a few glasses of cheap wine, I thought I would faint. The food is good though, albeit a bit pricey. But they had a super cool band playing while we dined, so it made it worth it."], ["Katherine G.", "Just ignore the servers' attitudes--they're Argentine. It's the busboys and the owner who are courteous. :)I had to start that way, but it's my only reservation about Soya. One of my havens from a busy schedule, it's a hideaway from deadlines and stress. The pastas are wonderful and come with a small salad. My other go-to is the steak salad or the Nicole salad (with salmon). Everything tastes healthy, fresh, and delicious, and while not inexpensive, is a decent value for the price. I am definitely a fan and love coming here to unwind and actually have a conversation. It's my way of pretending to be European, if only for the lunch hour. Prego!"], ["Ashlii P.", "Did someone say Italian food?  When I heard that there was a place that incorporated Jazz and Italian food, with a twist of an eclectic atmosphere - I had to rise to the occasion and see it for myself. Yesterday, me and my \"true loves kiss\" decided to experience \"Soya e Pomodoro\" for the first time. (Well, I was trying to surprise him, but he's too way curious for surprises...Anyways!)         First Thoughts: Sh*t, I probably should have made reservations.   The place looked pretty full, but luckily we were seated within the next few seconds.As we were given the menus, I sat back and took a few moments to really take in the atmosphere. Now I know I wear glasses but It was rather dark, I could have been having dinner with Hugh Jackman- or maybe that was the wine?  ;)   I had a delightful time at this restaurant. The drinks were good, the music was \"Latin Jazz\" - and well, that's that. The food was nothing impressive, pretty standard -anyone- can-make-pasta-backyard-hole-in-the-wall-I-can't-believe-you-don't-have-garlic-rolls- Italian food.  Let face it, the prices are reasonable, the food wasn't dangerous and the vibe points were a solid 5 out of 10.Looking for a city gem to hangout with your- I-promise- I'm- avant-garde-friends, have a few drinks in the dark to some live music? Kick it here, good vibes- not too crazy about the food.           Last Thoughts:  I'd come back with a big group and go in on bottles of wine and Bruschetta."], ["Sofia C.", "Love coming here! The atmosphere makes me feel like I'm in Europe, the employees are genuinely friendly and the food is to die for! And I'm an Italian food buff. I especially love when the live bands play. A special dinner place for sure as well as a nice getaway lunch place."], ["Ricardo S.", "We went in for a quick lunch.  Items ordered:  Sandwiches Melinda and Bobbi's y Saltimboca de pollo.  Beverages: Mint Iced tea and 2 bottles of sparkling water.  The Melinda sandwich is ok, just what you can expect when you order breaded chicken breast in bread; unimpressive, but the baguette was fresh and crisp so it did the job.The Bobi's is a soy burguer.  It was again what you would expect when you order this kind of stuff in a place that is not specialized in vegan food.  The patty appeared to be the commercial brand kind,  I think it was the wrong item to order but also a wrong item to have in the menu in an Italian restaurant.  The Saltimcoca di pollo  was the better item, it is something I would order again.The service was adequate for a busy luck time. The waitress was very busy but managed to stay pleasant.   She is probably slammed with things to do because when asked for a latte on ice she warned me that she would be bringing the latte but that I would have to put the ice on it myself.  I was happy to assist her in this very difficult, time consuming task.  Luckily,  they have an assistant /bussboy that will bring things like extra ice and salt. We paid with my Barclays Visa card which I had not used for anything in well over a week.  An hour later I received a call from the fraud department at Barclays to double check on potentially fraudulent charges.  There were almost $500 in charges made in Walgresens, BJ's and other merchants that.... needless to say I did not visit that day. Soya e Pomodoro's employees were the only people with access to the card, that is not a good thing.The place is interesting looking, I would imagine it looks really cool at night.  I might give it  a tr for dinner  sometime but I'll make sure to pay with cash."], ["D. G.", "I've had lunch here many times. I took my friends from Milan here and they thought it was very authentic. The place has a real charm to it.I recently went for dinner Saturday night with some friends visiting from NYC. We had such good food and service. The live music was...o-k? I would prefer to not eat with a band playing..."], ["Jonathan P.", "In terms of look and feel, this place is 5*.   Simply put, you don't feel like you are in Miami here.  The place is an old Bank with arches and architecture that you only see in Europe, Boston, and London. We had the pasta and sausage special.  Very good.  Very authentic tasting.  It tastes like an Italian grandmother was in the back cooking.  We also had the spinach salad and it was very good. Again, nothing fancy, but that added to the charm.  It was just good, simple food.  Just as they claim.The bread was also amazing! Crusty....something you don't find in Miami, ever.   There are lots of yelp complaints on the service, but I found the service good.  People were friendly, but left us alone unless we needed something."], ["Ashley M.", "The ambiance is what makes this place so spectacular, while the food is very good, as well. The decor is a mixture of old world alley (think Rome), art gallery and hip bookstore. The owners are actually Italian, which is a breath of fresh air in Miami, and the food they serve shows it. The menu is simple, but adequate, and prices are average for Miami. With a bottle of wine and two dinner entrees, our bill came to $73.00 with tax and tip. My favorite dish of the night was the fazzoletti di formaggio e pera, cute little pasta purses in a gorgeous cream sauce. Better half ordered the orecchiette vongole e zucchini, which was lacking in flavor and the sauce was very thin. The service is very slow, it took about 20 minutes to get dinner menus because they had ran out (too many guests). We also never received a tiramisu that we ordered because the waitress forgot, and it took another 10 minutes or so to get the bill after reminding her and cancelling the dessert. A good date night choice, but be ready to spend a long evening here. Weekends usually has live music and they are good about drinks, so you'll be entertained at least ;)"], ["Kristen T.", "After all the great reviews on Yelp and a recommendation from a friend, I REALLY wanted to love this place... more so after I finally got there, and saw just how cozy and chill the space is, with an artsy, laid back vibe, a live band, chic mismatchy decor and funky art all over the walls... you think, how could they go wrong?  Definitely a young, attractive well dressed crowd, with hardly anyone speaking English. I was definitely expecting some authentic Italian at this point... The first time we saw our server was when she came up to us and asked \"are you ready to order?\" .. No introduction, no hello, no talk about specials, or asking us if we had any questions or wanted bread.. nothing. She did ask us though at one point if we wanted more water. Hmm it's 80 degrees in Miami and we are eating huge plates of pasta, but please, no water refills, I'd like to instead sit here and die of thirst. I could have sworn most servers just fill up the water without asking. I'll give her the benefit of the doubt and assume it was a rhetorical question.  My BF and I were surprised at how boring the menu options were. We settled on the cavatelli pancetta and the spaghetti bolognese. Serving sides were good, prices were definitely reasonable, but the dishes were sub-par at BEST. The cavatelli had no taste, hardly any pancetta, and the saffron sauce was really bland. I dumped as much salt and pepper on it as I could handle but nothing helped the dish. It tasted like a Lean Cuisine... considering how small the menu is, I was surprised they hadn't mastered every dish, or at least had better options. The bolognese was definitely the better of the two, but also similar to my favorite Lean Cuisine. Actually I'm lying, Lean Cuisine is much better. The bread was the best part of the meal. We asked for our left overs to be wrapped up and asked for the bill. On the way out, we realized we never got our left overs. We go back in, and no one has any idea what we are talking about. They offer to give us dessert, panna cotta, as compensation. . great, our least favorite dessert. We go home, open the box, and see that they actually gave us tiramisu. Best mistake of the night! Yay! Except it had WAYY too much cream topping. Good flavor though. I found a lady finger eventually...Going to this restaurant is like meeting the sexiest man of your dreams then realizing after the first date he brings nothing to the table whatsoever.. but you give him one more chance to impress you anyway, since he's at least nice to look at. So I will probably be back.. just as long as I am not paying, and with much less expectations."], ["Andy R.", "One if the best experiences in Miami. Intimate, cosy with excellent food and wine and service that's neither too pushy or too relaxed. A well priced gem."], ["Alex H.", "What do you get when you cross a yard sale with an Italian kitchen then toss in a library? Soya e Pomodoro. I'm not sure how to effectively review this very unique ...ummm restaurant. The chairs don't match. The tables are all unique. The library... wait, it has a library?? Hold on, this was a restaurant review... and they serve Italian food in the middle of downtown Miami in what feels like a hallway of an old building? I'm confused and I'm writing this review. Is it indoor or outdoor seating? Is the sky blue? Is the sun hot? I'm confused!!I figure I'd mention this, there was a minor scene filmed in this restaurant for the TV show Burn Notice where the location was filling in for a restaurant in SOUTH AMERICA (Columbia). I don't remember the exact episode, but it was in Season 5. Anyways, back to your regularly scheduled review...There is no A/C, but it isn't too hot either because they have some very questionably setup fans high above the tables. I have only been here for lunch and they are reasonably paced at getting the food out. I've had the ravioli (in a white creme sauce), Penne Affumicate, Gnocchi alla Sorrentina, and quite a few other dishes. They are all quite good. The odd cow-hide like menus have always taken me aback... sorry, stream of conscious speaking out. Bottom Line: Worthwhile for lunch, but don't come with a large party because space is rather limited."], ["K C.", "This review is long past due. I was here a few months ago. Great menu options, pasta with cod fish was good but the salad was straight out of a bag (looked and tastes like it). I think the extra star is for ambiance - like the decor and feel very much. I'd go again to try another pasta dish."], ["Felipe J.", "My friend recomened this place on a nice night with my girlfriend. I took a bottle of wine to the owner as a nice gesture. The live music was great, food delicious, and service couldn't have been better. The ambience couldn't have been better, I highly recomened it on a cold miami night."], ["Juan S.", "I finally got around to going here after years on my bookmark list.It's on a somewhat obscure street downtown, but only about a block or two away from most everything.  Overall, the two things that stood out were the food and the atmosphere.I had a panini and some pasta and both were delicious.  Food was fresh, portions were good sized and prices were right. The atmosphere is funky and somewhat bohemian.  It definitely feels like you're in Europe and there's a lot of character here.  A negative is their lack of air-conditioning?  and a loud fan clicking next to my seat in the restaurant...somewhat annoying, plus the tablecloth had writing on it....little details like that make a difference which they should work on. (minus a 4th star)Service was OK.  Overall, I\"m glad I came and probably would return..."]], "Perricone's Marketplace & Cafe": [["Karla T.", "Excelente food, excelent service and great ambience!"], ["Gabriela I.", "Absolutely loved my first experience at this place. We came in for lunch and were quickly seated. When you walk in it looks like a cafe/bakery, but as you walk back you enter the restaurant area. It's a beautiful ambiance, makes you feel like you're in Italy! The servers are extremely knowledgable and great when asked for suggestions. The service was exceptional. They bring you a basket of fresh bread to dip in the olive oil/balsamic. Their wine list is great and the server also had great recommendations in that area. I ordered the Churrasco Steak Salad and it was delicious. Perfect portion, not too big or too small. (See Photo)I can't wait to return to this restaurant!!"], ["Gina M.", "I always make sure to stop by when I'm in town. Absolutely in Love with this restaurant! Amazing Italian dishes and the Baked Brie is just a piece of Heaven. I love the scenery and ambience! Me and my girls always sit outside and have an amazing dinner, the staff is wonderful! Love the service! 5 stars I definitely recommend this place!"], ["Eric M.", "If you haven't  eaten at Perricones, you have no idea what you're missing. The ambiance is fantastic, the food is outstanding and the service is top notch. We have visited Perricones over a dozen times and always ask for Carlos Zambala  to be our server. He is one of the many reasons we return here. If you want a dining experience like no other, visit Perricones and ask to sit in Carlos ' s section. You won't want to leave. Eric n David"], ["Karina P.", "Very delicious food! Loved the variety on their menu, and the atmosphere is very nice and cozy! Also, the waiters are very friendly. Eduardo was our waiter and he was great!This is an ideal place to go on a date, very romantic and intimate atmosphere"], ["Sarah X.", "Wiow....beautiful restaurant... great service... great drinks....which I may have had one or two many of.... Pricey, but it was a very pleasant place to have dinner.Plants everywhere (in the dining area we the way to the back) topped it off as a super nice place to eat"], ["Kimberly R.", "The salmon with quinoa & and asparagus was magnificent. My calamari had an enough crispiness paired with flavorful sauce. People who work here were knowledgeable aspect of this establishment. I'll be back as soon as I can. Never forget to try their desserts!"], ["Punya N.", "Finally made it to Perricone's for their $10 pasta night, and I'm so happy I did. The restaurant itself is huge, which was good because it helped accommodate the long line of people waiting to be seated. There was a good amount of patio seating outside, and then most people were waiting inside near the bakery cases where you can pick up things to-go. Our party of 8 was seated after a short wait and we immediately got started with the baked brie. It was out of this world -- coming from someone who is not a huge fan of brie. I can't stop thinking about how delicious the appetizer was -- the puff pastry combined with the warm cheese and fruit definitely satisfied the taste buds. The complimentary bruschetta was perfect -- the tomato mixture was addicting and the bread was soft on the inside and crisp on the outside.For my entree, I had the gnocchi with pink sauce -- the texture of the gnocchi was perfect, melting in my mouth, and the sauce was creamy without being too heavy.To reiterate: the baked brie was definitely the highlight of my meal and I will be going back to Perricone's, especially to have more of that brie."], ["Nicole S.", "This is my favorite Italian restaurant. Everything tastes very fresh. You can't go wrong with anything you get. It's all amazing. I've been to this restaurant over 10 times. It's simply the best. All tables get bruschetta and bread to start. The bruschetta flavor is out of this world! Freshness throughout. My family got a few appetizers to share: fried calamari and zucchini straws, baked Brie en croute and we made the pasta dish Fiocchi Gorgonzola an appetizer for the table. You really can't go wrong with what you order. The Brie is amazing. Very good portion size of cheese and comes with apples and grapes and crackers. The Fiocchi has a creamy filling and in a creamy sauce. Very tasty, but can be very heavy if you eat it all yourself (that hasn't stopped me in the past). I got the chicken Parmesan as my meal. The amount of food and quality is incredible. Their pomodoro sauce is homemade and has lots of flavor. It comes with a side of pasta. We shared three desserts for the table, the tiramisu (my personal favorite), banana cake and chocolate truffle mousse cake. Everything was devoured."], ["Raye T.", "Saw the reviews so I had to try. Ordered the jumbo lobster ravioli in pink sauce. Was amazing. Ate it all which is something I rarely do with American servings. I even had ice cream after cause it was that awesome. Definitely worth going and the pricing is quite good for what you get. Top verandah seating was nice at night when they open it up. Food was very fast to come out. Overall was a great experience and best one I've had since coming to America for 2 weeks."], ["Andi T.", "Went here during the week this time. This time we were seated outside by the fountain. It was very noisy as we were in the area with the live music. The server was amazing. She was always there when we needed her, polite and served everything in a timely manner.Split the Brie appetizer with two others and split a bottle of Zinfandel wine as well. The Brie was probably one of the best appetizers that I've ever had. I had the rotisserie 1/2 chicken special for my entrée. I think it was a bit overpriced for chicken and ended up eating it over the next few days. The mashed potatoes that came with the entree were phenomenal- I just want to make babies with them. It sucks that I enjoyed the sides better than the chicken. Next time I will stick to apps & wine."], ["Hernani A.", "Iove their tiesday sandwiches two for one! Perfect if you work in the area! They so have nice salads.  Im not a big fan of their pasta dishes or their dining room as it takes forever to be seated and served... But for pick up is great! And their ice creams and cookies are so yummy!!!! As usual... Brickell has this parkingAnd traffic problem... Otherwise we would probably come more often...."], ["Will C.", "I've been going to Perricone's weekly for over six months now and decided to finally leave a review. The food at the restaurant is always amazing! I have never been disappointed by any item on the menu; to the contrary, I've always been surprised that even on Pasta Thursdays the dishes are fresh and delicious. The servers and staff are mostly very pleasant. We did have a situation once with the owner that kind of left a bad taste in our mouths but we chalked it up to him maybe having a bad day. Basically we had a group of us go there for a birthday luncheon and he was very adamant that there wasn't enough space to accommodate all of us at the same table, when literally all it took was pushing a couple tables together. It's not that it couldn't be done... He just wasn't willing to. We ended up winning that one though. Desserts are to die for, both in the restaurant and at the marketplace out front. Marketplace gets a bit crowded sometimes so just be patient. Overall an excellent establishment and I will continue to frequent it weekly."], ["Marilene L.", "Best brunch in Brickell- beautiful atmosphere, amazing service, well priced drinks and delicious food. All around lovely"], ["Boni L.", "People come for a romantic and yet delish dish. Make sure to get your Rewards card for the points. This place has great Italy local wines!!!!!"], ["Hershell C.", "Winding down on vacation and figured Italian was gonna be the last meal.. Staff really nice.. Food was good.. Lasagna was tasty.."], ["Lenya S.", "Went for lunch today with a few coworkers, they have a special pasta Thursday- highly recommend it! It was my first time going to this restaurant even though I've always heard how great it is . We got there right on time, no wait we were seated right away. The front of the restaurant it's a small mini market for wines, cheeses, and desserts. It has a very rustic look, similar to an old bodega. As soon as we were seated our waitress came to introduce herself and get our drink orders. She was very pleasant and recommended plates off the menu. I ordered the Fiocchi Gorgonzola - ITS A MUST TRY! It come with walnuts, not a fan of nuts in my pasta, so next time I will do without the nuts.FYI tables are extremely small, specially if you're in a party of four! Overall, good location, nice staff, great food! Perricone's I will be seeing you again ;)"], ["Jenn G.", "Living in brickell, I've visited this place for both brunch and dinner. The food is usually great. Unfortunately the last time I went I ordered the seafood linguine and the pasta was a little tougher than usual. Also the owner was running around and being very rude to his staff. Overall a nice romantic setting for brunch, a little noisy during dinner service. But a great spot."], ["Jessica C.", "I cannot believe that my dad has been hiding this gem from me. It's such a beautiful concept, both market and high-class restaurant. The greenery that surrounds the whole restaurant is amazing and at night it lights up so beautifully, playing with the twinkle of the glasses, plates, and stars. My parents, my boyfriend & I came here for Valentine's day celebration. When it came to food there was a definite must that my dad suggested that we order and it's their Baked Brie. This was one of the most delicious food I have ever tasted. Baked to perfection with their apricot sauce, crusted in brown sugar served with various fruits & crackers. You slice it open and the perfectly velvety smooth brie just melts out of its pastry crust... I mean wow. This was a great great great place just because of this baked brie. Their food, although expensive, was also great. Pasta was aldente and their menu offered a variety of food. But their pasta sauces lacked that WOW factor. It wasn't memorable, nor was their chocolate cake. The staff was very attentive to us and made sure we had a great experience. I will come back here for sure just for the baked brie, and just eat somewhere else for a main course."], ["Lisa C.", "Absolutely AMAZING meal! Wonderful GLUTEN FREE options! The caprese salad, portobello torta, salmon, fettuccine with filet medallions, it was unbelievable. Highly recommend and cannot wait to come back!"]], "Strada In The Grove": [], "Cibo Wine Bar South Beach": [["Robert K.", "Dinner was fantastic. We made an effort to visit the Cibo on south beach after having been one in Miracle Mile. The area and ambiance is extremely welcoming considering the fact we had no reservation yet the host made a effort to find us a table quickly. The house wine was lovely and paired well with the lasagna. All and all I'd say the CIBO on south point is my favorite and we will be coming back."], ["Priscilla H.", "Top place! Gorgeous decor,great service and amazing ambiance. It's a 3 story restaurant (yes!) and you must check each floor, just beautiful decor with positive writing around.The wine cellar is incredible! We went to Cibo for the 4th of July festivities and wow... It couldn't be better!The rooftop has awesome cabanas and it was the perfect spot to watch the fireworks in South Beach.Great complimentary olives! We got the formaggio platter with prosciutto and wine. My son had the margueritta pizza...It's huge and delicious! In the second time, we went with a big group of friends, we sat downstairs and it was even better. We tried the carpaccio (I will give a 9),Grilled octopus (8) and the caprese pizza (10).My favorite actually was the specialty drink, however I can't remember the name. It was a mix of spices, olive oil,lemon and ?? I don't remember,but I will definitely come back to try it again.From the hostess, to the bartender and the waitress we had an amazing service.We love this place!"], ["I C.", "Service very goodFood \"áverage\"'"], ["Aleksandra C.", "Very disappointing...went to the one in coral gables and thought it would be a similar experience but it didn't end up being.  The service was extremely slow at the beginning.  It took us 20 min to get a drink even though the place wasn't full.  The food was horrible...pizza soggy, the chicken parm was nothing special and the potatoes were undercooked.  The only thing that was good was the prosciutto and cheese plate but can't do much wrong there."], ["Chabely B.", "Awesome place, awesome service, delicious food!!!!!!! I'm definitely going back again!!!!!!!!!! Loved this place"], ["Anna F.", "Came here for happy hour and had a fabulous time tonight.  The Prosecco was refreshing, served by the greatest bartender, Marco.  The pizza and polenta fries were delicious.  The only downside was our waitress who was a little rude when she realized our group wouldn't be as big as we had originally stated.  Sorry I can't control the rainy weather that keeps people indoors."], ["Catherine W.", "Love this place! My new fave go-to in SOBE! It is so impressively stylish and trendy...the architectural and interior designs are visually appealing and amazing! The staff is courteous and professional, the ambience is comfortable and inviting, and the food was so very good. They also have a beautiful rooftop outdoor bar with incredible views! The unisex hand washing station on the second floor is so cool, too! This place is IMPRESSIVE!"], ["Carl R.", "OMG, one of the best places we had dinner in 47 years... Great wine selection (we had Amarone Zonin), great menu, great service and most important of all, great fresh Italian food.One of our top 10 in the world; a must see. Our server recommended the Burrata and the Carpaccio which were very nice"], ["Anhara M.", "I've only been to brunch on Sundays and I enjoyed it. Its $30 per person buffet. Bottles 50% off. They have an a la carte omelette station. A pizza and pasta station and a meat station. They even have clams and mussels and stone crab. A nice variety of cheese and cured meat. Also focaccia bread. The only station I didn't like was the dessert station, they were tasteless. They need to step it up on that. Also parking is extremely difficult, very busy and not a lot of street parking so you kinda have no choice than to Valet $15.00. I would recommend it for brunch"], ["Leyli J.", "Ok so I'm not one to write reviews much but I had to write one about this place. It's awesome! The vibe, the decor, the food all of the above! Finally some real homemade pasta, yum! I love going to a place where their cocktail list is not ur typical Cosmo, Gin and tonic... You have to try their Romeo and Juliet strawberry Rosemary drink, ridiculous! Who knew combining Rosemary and strawberry would taste so good? I also had the pleasure to meet the brand ambassador, she was so helpful and explained their event ideas. Definitely a place to consider for your next event. One last thing, STOB BY THE ROOFTOP! Check out their beer selection, they literally brew their own beer!"], ["Lulu W.", "The brunch here is mouth watering, classic Italian delicious. I came here for Sunday brunch and had an amazing experience. The waitress was wonderful, friendly, and attentive. We were seated right away. The valet was convenient and only 10 dollars. The selection for food was PHENOMENAL. And its BUFFET STYLE!! This was my second time here, and I was still blown away. Last time I was blown away with the crab legs they had at the seafood bar. This time I found that there was lamb on the menu... what more can you ask for?? Oh wait, don't tell me... there's a gourmet omelette bar! The cook at the omelette bar was not only a self-claimed (and self-proven) greatest omelette maker ever, but he also offered sooo many delicious choices for ingredients (like SMOKED SALMON). It was the best omelette ever created. And if all this wasnt enough to convince you to come for their brunch, then perhaps the amazing cannolis, pastries, and belgian waffles with ICE CREAM on top can change your mind. They also have a mouthwatering selection of cured meats and fancy cheeses. Everything from the melt-in-your-mouth lamb, to even the bottle of olive oil and balsamic at each table, was of highest quality and taste."], ["Amy B.", "After a group event - food and drink were good. Waitress was not the best but our host Marco was awesome. Would definitely come back again."], ["Mar V.", "Came here on a Thursday night ...I ordered pappardelle lamb ragu and it was tasty, no complaints. However our service wasn't up to par... two incidences our waiter I gave us the wrong dish...We met the sommelier she was really nice but her  flouncy short skirt was very distracting it was difficult to take her seriously, very distracting not professional. I know we're on the beach and all, but I've never met such skimpy sommelier. The ambience of this place is a little confusing."], ["Deepti D.", "The food at Cibo was amazing, and if it wasn't for the horrible service I would've given it 5 stars! Arnaud was our server, after he introduced himself he forgot about us. We waited and waited for our wine and bread. Finally we got his attention and reminded him about water, wine, bread to start, and he seemed to have gotten annoyed. After that he just had a scowl on his face the entire time he served us. He kind of slammed our dishes down on the table, made no eye contact, and had a foul look the whole time. The pizza appetizer he literally tossed onto our table and walked off. It was a very awkward experience to say the least, we felt very unwanted and unwelcome. We were almost a little apprehensive to eat our food. He never came back again to check on us. Each time we needed anything we had to flag him down as he was running past our table. Whatever we did eat however was delicious. We ordered the seafood linguini, chicken parm and penne arriabiatta. The burrata and prosciutto were also delicious! Ambiance is very chic, the acrobatic wine sommelier is a nice touch. We were celebrating a special occasion but the waiter put everyone in a really sour mood. Really wish the service was also good so that we could've enjoyed the delicious food and ambiance! Being locals in south beach, we would've definitely gone back but not sure if we will now."], ["Sher P.", "Love this place.  Atmosphere is great! Well designed. Bartenders are great ! Can't wait to go back!"], ["John H.", "Great decor on the south end. Trendy spot and cool cocktails. Can't vouch for dinner, only drinks. But good service and a nice spot to unwind."], ["Charles F.", "The food at this place is soooo delicious, and the various dining rooms, bars, and rooftop eating areas are very enjoyable to eat in.  This is a must-eat place in South Beach, I'm a local and take visiting friends here often."], ["Anthony C.", "Had appetizers, dinner, and dessert on a Saturday night. Amazing service, amazing food, amazing view- what more could you ask for?"], ["Claudia S.", "I have to say...EVERYTHING about this place is fabulous!The ambience, the food! And of course our server Rolando! You are amazing!All the food is made in house, ingredients straight from Italy. I would DEFINITELY come here again.I want to make an emphasis on Rolando's service. EXCEPTIONAL PEOPLE. He is attentive, kind hearted, everything a server should be. This was my first time here and TRUST ME...many more to come!"], ["Jiannalin L.", "I love this place! Though I didn't get to go upstairs because it was already closing time (yes I was there awhile) I loved it. Love the wine selection! I was in heaven."]], "Riviera Focacceria Italiana": [["Gabriel M.", "Great place to eat. Great food and Great service.They also have options for people with allergies.Highly recommended"], ["Saskia D.", "Food was cold, pasta was undercooked........plates did not come out on time , we were a table of four, two were almost done with their food and one person had still no food!!!The dessert was on the house, unfortunately we did not go for the dessert.Will never go there again."], ["Liza M.", "Friendly & professional service, amazing hospitality & fantastic wine selection. Food was authentic & very tasty I also loved the rustic & charming décor..Looking forward to my next visit."], ["Xochilt A.", "I feel horrible because I love this place so much jaja. I cheated on my other Italian favorite spot!! The food is just so amazing!!!!! Taste so homemade and the place it just reminds me so much of Italy, feels like we are at Italy. The food, and the ambience is very cozy and many Italian locals stop frequently, which is a plus. I only have one complain, I want more! I think the entrees are very small, I would prefer to be served just a little bit more since well the price is not that cheap. Nevertheless, the food is so amazing that I would definitely go back and bring my Italian friends :)"], ["Chloe T.", "Again, big crush for this place. If you want to enjoy your lunch or dinner for a real decent price, you should pass by this place. The food, the service, the owner are amazing. It s like family style and in Miami, sometimes we really appreciate simplicity."], ["Michelle M.", "What comes to mind when thinking about Focaccia? If you are like most people, you probably instantly thought of the soft, fluffy pizza-type bread that has been popularized in Italian restaurants all around the world. If that is the case, I have news for you: real focaccia, the kind that was invented hundreds of years ago in the Ligurian town of Recco, has nothing to do with this fluffy version. Recco-style focaccia actually consists of two incredibly thin layers of dough stuffed with dreamy melted cheese, and it is one of those delicacies that is very rarely seen outside of Italy. Fortunately, if you live in Miami you too can enjoy this unique dish thanks to Riviera Focacceria, a new Ligurian restaurant that opened in Midtown Shops a couple of months ago.If you go to Riviera Focacceria, you absolutely must have the Focaccia di Recco. It would simply be a crime not to. The traditional cheese one is filled with stracchino, a tasty soft cheese that is so unique and important in the production of the dish, that it is flown weekly directly from Italy. A couple of months ago, I was lucky to try the original dish in Recco, so I was a bit skeptical before having it again in Miami, thinking that it would never be the same as my experience in Italy. I am happy to report that it is exactly the same, and this is thanks to Massimo Travaglini, the Geneva-born Master Focaccere and Executive Chef of the restaurant, who specializes not only in this unique focaccia, but also, in traditional dishes from the Northern Italian region of Liguria. The great thing about this place is that they have different types of focaccia, including one with ham (Focaccia con Cotto) and one with Genovese pesto, a sauce made with local organic sweet basil, pine nuts, parmigan cheese, garlic and Ligurian extra virgin olive oil. Normally, I would have gone for the pesto one in a heartbeat, but given that my boyfriend cannot stand the smell of garlic and having it would have meant having to be at least 3 ft. away from him the rest of the night, I decided to go for the traditional cheese one instead. This turned out to be a great choice and a win-win for both of us. Just like the focaccia, the rest of the menu is also top notch. Since the place is also known for its homemade and always fresh pasta, I went for the Pansoti al Sugo di Noci, a light dumpling filled with spinach, ricotta cheese, chards and spices and than served with a delicate walnut sauce, which also turned out to be a perfect choice. The sauce was so creamy and cheesy that I ended up scraping my plate with the fork to enjoy every last bit!Despite my initial pre-judgement, I was quite impressed with my experience at Riviera Focacceria. This place is as authentic as you can get in the states, and it is most definitely a new addition to my list of favorite Italian restaurants in Miami."], ["Abigail B.", "My husband and I went to Riviera this past Friday evening using a Gilt deal that included a bottle of wine, an appetizer, 2 entrees and dessert. We loved the high ceiling, industrial look of the restaurant. We were seated inside, and had friendly, attentive service throughout. We ordered muscles for an app- yummy, and even better when we soaked the croutons in the sauce at the bottom. I had seared tuna- very fresh. He had beef ravioli, which he said was amazing. We then shared a Nutella tart for dessert- the crust was SO buttery and crumbly... dangerous lol  We will be back!"], ["MICHELLE C.", "Casual decor, not wild about the set up in the dining area. They have a walk up counter area when you first walk in with various types of Foccacia if you are lucky enough to get some.  They run our very quickly. I did like the open kitchen but felt like the dining area looked more like a cafeteria. Our server was a very young girl and she was basically in another world throughout our dining experience.  She was sweet but honestly had no clue how to serve.  This was a huge turn off for us. We started with a decent bottle of wine and a meat and cheese platter.  It was very good and they have really nice tasting Foccacia.  But again when we ordered more we waited 20 minutes to get a few pieces. The three of us ordered three pasta dishes. I found the portions to be on the smaller side. The pasta was all overcooked.. No complaints on the flavor, as all of our dishes were tasty. Prices are on the upper side for such a casual restaurant.  Portions are small and service was just not very good. Way to much competition of Italian restaurants to have me wanting to go back. Nothing stood out for me just an OK to Meh experience."], ["Francesca R.", "Most of the time food is good. Real Italian  last time gnocchi were too hard could not eat it  I been charged anyway. Pretty rudeA female waitress was too arrogant."], ["Juan B.", "The spaghetti was very good. The cheesecake was great because it was a very subtle taste, not overpowering like at most other establishments. The Italian artisan beer was strong, tasty, and refreshing.The servers were very helpful and attentive. Overall a great place for friends or family to have a nice dinner- be it an expensive one at that."], ["Cristina C.", "This is the best place ever! 100% Italian and authentic in all aspects. The place inside is not so big but extremely cozy and food is amazing. If you are Ligurian you should try the \"Original focaccia di Recco\" it's worth it! And also the pesto and panzotti in salsa di noci are awesome!!"], ["Anne J.", "One of the best to go to eat good and have a great timr. We really anjoy & we'll go again The suggested focacca was just delicious"], ["Jorge S.", "Highly recommended true Italiano ristorante. The focaccia is like nothing you've ever had before. Filled with Stracchino cheese imported from Italy. In between 2 layers of very thin dough you'll find a deliciously melted cheese. Perfection!  Truly original and delicious. Only the finest ingredients. The wine list is not only very good but bottle prices very reasonable. We ordered the Spaghettoni with Ragú Genovese. Wow is all I can say. A thicker spaghetti, perfectly cooked al dente with the absolutely most delicious meat sauce aka Ragú. Hearty, meaty and quality ingredients equal a palate pleasing meal. Also had the Baccala Vegia Zena - a delicious pice of grilled cod, in a tomato sauce with an absolutely wonderful symphony of Taggiasca olives, potatoes, and capers in a tomato sauce. Normally a salty dish if not prepped properly but this kitchen got it right. Finished the meal with a perfect espresso and the Sacripantina for dessert. A moist sponge cake layered with chocolate and vanilla creme. It was refreshing, not too sweet and just plain different from any other dessert I've ever had. Highly recommend this as a sharing plate to end a great meal. This is my new \"Italian go to\" place. You will be pleasantly surprised. Can't wait to return for my next meal. Maybe tomorrow?"], ["Denisse R.", "BEST foccacia and genovese food ever! Love the recco faccacia! Perfect to share! This place it's definitely my new fav place in miami!"], ["Sergio F.", "New restaurants are always a challenge to review since they're finding their footing. But when you see the wait staff try their best I'm inclined to bump them an extra star. Kudos if they mention an ingredient on their menu that you overlook when ordering and I'm allergic to, so they take care to not use it.You know my baseline measurement for an Italian place is their caprese and Riviera doesn't disppont. The greens seemed fresh, heirloom tomatoes plentiful and mozzarella cheese served cubed instead of the typical slice. My next favorite dish was their pannacotta. Garnished with mint and berries, and drizzled in a cherry sauce, the vanilla base was deliciously bouncy, creamy and sweet. My main course was a pasta with more tomato slices as well as a marinara sauce. However, it was a little oily with the olive oil added. That was my bad in asking for oil.Bread came in a cloth bag,  with a nice variety of baguette and sesame seed rolls. I had to ask for balsamic vinegar to dip the bread in, since it wasnt provided table side. However, once brought it was rich and subtly sweet. The space is clean and well lit, with a glass enclosed kitchen. As I mentioned earlier, service was great for a newly opened spot and my waitress went over the ingredients, helping to prevent a food allergy. I also appreciated the manager going by my table."], ["Sally T.", "We always enjoy eating here: the food is good and as authentic as it gets. The service is fast and everyone is friendly. Nice decor too.  What really keeps us coming back is the focaccia of Recco, made with real unique stracchino cheese. We tried it once in Portofino, Italy and loved it, but never thought we could find it in Miami. It literally melts in your mouth, try it to believe!"], ["Carlos E.", "Excellent restaurant. Great food and the service was incredible. Highly recommended!"], ["Kiah T.", "Genova is where my father's side of the family originally hails from. I have never had the opportunity to taste the food of my people until now. O M G .. Bread. Of course. Why shouldn't the featured dish be bread? And it is the thing that greed is made of. I just couldn't stop eating it. As for the pasta dishes, in the Miami market some may seem inventive (see Dreamy Walnut Sauce), but they are very typical to the small town in which this cuisine is based. The pesto is unlike any other local pesto. There is no grittiness or separation to it like so many of its imitators. It's funny, that in Italy even after a meal of wine, bread, and pasta, you never feel overstuffed. The dishes here carry that same lightness. The owners and much of the staff are from Genova as well and are happy to discuss their home over a glass of super dry prosecco."], ["Katy P.", "I am going to start this review my admitting that I am not a big pasta eater, but when my family wanted to try out this new restaurant in Midtown I was in, and boy am I glad I went. It was hands down one of the best and most satisfying meals that I have had in Miami. The food was fresh and homemade, and the service was flawless. I would go again and again.For the first course we started with one of the biggest reasons why people folk to this restaurant - their Focaccia di Recco - two layers of incredibly thin dogh filled with imported stracchino cheese. Warning: Once you try you will be hooked. We also tried their Focaccia de Recco con Pesto, which is made with their deliciously homemade pesto sauce.And even if pesto sauce isn't your thing I highly recommend you try their Mandilli di Seta al Pesto. Their handkerchief style pasta with authentic pesto cause (made with organic sweet basil, pine nuts, a touch of garlic, extra virgin olive oil, and Parmigiano cheese) is out of this world. I literally couldn't stop eating it.And for those who don't want to venture into the pesto then try their Pansoti al Sugo di Noci - pasta that is stuffed with spinach, ricotta cheese, chard, Italian herbs, spices, and Parmigiano cheese. Or their Polpo Riviera - a lighter option with octopus, diced potato, celery, olives, cherry tomato, topped with extra virgin olive oil.And, last but certainly not least, the dessert. We tried their Sacripantina and Mousse di Pistacchio. Both of them are so incredibly delicious you wont be able to put your spoon down.If this hasn't made you incredibly hungry then there may be something wrong with your palate."], ["Ivan G.", "This was my third time in riviera. The first time it was amazing the service was quick and well executed and the pasta was balanced, hearty and expertly cooked. The focaccia was delicious. My second time was disappointed the handkerchief pasta was soggy, the sauce overbearing and cold and the service was ok. On this occasion I went with a group of three other friends. I would not be returning to Riviera. The server was lost as to the menu. My pasta was soggy and overcooked and the sauce was rather tasteless, it was a mixture between baby food and tomato paste. My friends dishes did not fare better the tagliatelle was overcooked and the sauce crummy, the seafood pasta was disappointing and the seafood of poor quality."], ["Mill R.", "Food was excellent and service was nice and extremely helpful on providing good recommendations!!"], ["Valberta G.", "Wow..both my boo and I was super disappointed in our dinner. My boo barely touched his dish because it smelled super fishy and mines, well, had an almost unpleasant odor to it. On top of that, lol, we had no idea it was a grand opening that night. Super busy, we waited about 10 or 15 minutes for a table. Once seated we looked over the menu and everything looked good. I ordered the Ravioli Genovesi al Tocco which was \"homemade ravioli filled with braised Angus brisket, chard, spinach, Parmigiano cheese, marjoram in a 5 hours slowly cooked beef tomato sauce\". My other half ordered the Tagliolini del Mar which was homemade tagliolini with Ligurian style seafood ragu. Before the main food arrived we ordered the Riviera Focacceria bread with cheese for an app. It was pretty delicious and freshly baked.So finally my dish came but NOT my boo's. WTH?? Then immediately the smell of the brisket had a weird odor to it. So I tasted one and it was edible. But the odor itself was super powerful. But how come my baby's food didn't come out yet. Apparently it was craziness in the kitchen. So finally my baby's food finally came out...after I finished my meal which was like 30 minutes later, smh.  When the food arrived immediately already he could smell the strong fishiness to the dish. I tasted a little of the food, omg, wow, no...uh uh...heck no...you could not barely taste the other ingredients. Something was wrong where you can literally taste the \"ocean\". You can couldn't taste the other flavorings of the dish. He barely finished the dinner and pushed it aside. A few minutes later our waitress came and he had her smell the dish and she didn't find anything wrong. Of course not...**sarcasm**Anyways, we were hungry and wanted to try something different. But after that experience I doubt we will be giving them a second chance."], ["Anhara M.", "We finally went for dinner this past Sunday. We ordered the Octopus and a ham and cheese platter as an appetizer. The Octopus was okay cant say it was great, very little pieces of octopus. The cheese platter was good, adequate size for sharing. As an entree we order the tuna and pesto pasta to share. The entrees are small portions. If you don't order appetizers you will stay hungry. The flavors were good, presto was fresh and tasty. Off course the desserts were excellent. Pistachio mousse is a must. I find it to be a bit pricey but I guess with the location they have to."], ["Jonathan A.", "True Italian arrives in Miami. Being from DC with a healthy number of wonderful Italian restaurant's I've been in search for good true Italian since moving. Finally I found it! This quaint but modern jewel opened last week with a quiet soft opening but this place is anything but soft when it comes to its spectacular dishes. Just because of their name don't think its all foccacia - besides it's amazing. They have a strong menu featuring homemade pastas with beautiful sauces as well as stand alone main \"secondi\" dishes. In two nights I've had the black squid ink pasta filled with cod as well as the roasted beef. Both were absolutely amazing. Even better, the staff is absolutely impeccable being quite attentive and ultra friendly. They truly operate on whatever your desire they'll do their best to accomodate.Of course with any new restaurant there will be times when things are not great. Their timing at this point can be a bit prolonged but they are working hard and fast to become acclimated. So if you're looking for AMAZING italian food I'd suggest you get here before its hard to get a table."], ["Mr. H.", "Delicious, fresh, quaint and friendly. Had lunch here and was very pleased with everything."], ["Natalie I.", "Riviera Focacceria Italiana was mediocre, nothing was bad yet nothing we ordered stood out either and I am not sure why. The décor was perfect, spotlessly clean, welcoming and stylish. The ingredients used were super fresh you could see them excellent quality. The servers were attentive, polite, and knowledgeable.  We instantly felt relaxed when we entered the restaurant. The lighting was soft but light enough that you could see. Which I LOVE I hate eating in the dark and I hate eating with blaring light. This restaurant did everything right,  it was very reminiscent of Italy. We both ordered a pasta dish, it was ok not great. Came out slightly cool maybe that was why neither of us were crazy about it. We probably ordered the wrong thing. It seems Focaccia is what you should order. We will order that next time because i cant write theis place off just yet.   I will update this once I do!"], ["Maikel M.", "Everything in this place was amazing, not your topical Italian restaurant (and I say this as a positive thing). Their Focaccias are amazing, they are thin, light, flavorful, just perfect. Ambiance is relaxed and friendly, they have outside and inside sitting.Staff and servers where very nice and helpful, I really liked this place and will be back for sure."], ["Jonathan P.", "Great authentic Italian homemade pastas. One of the best Italian restaurants in Miami without a doubt. Huge portions, amazing food and reasonably priced. The clams to start are also great. No complaints at all and they just opened so they got off to a great start with their service and real Italian food."], ["Laure M.", "Good place, focused on flatbreads. They do offer pasta and italian dishes but the pasta are mainly vegetarians and the dishes are quite expensive. The food is good, the ambiance is nice but i wish they had more options for pasta."], ["Stephen M.", "Great place to eat. Casual atmosphere and located right in Midtown Miami. Best Pesto sauce I had in Miami. This is the real deal.The focaccias are also very good. The restaurant is clean and the staff is good and friendly."], ["Anna H.", "Authentic focaccia like no where else in Miami! I lived in Liguria for many years and longed for their culinary delicacies. I need to look no further. Their classic and onion focaccia are mouth watering just like I would find in the Vecoli in Genova. But the one that really takes the cake is the focaccia de Recco with authentic stracchino cheese layered in the thinnest most perfect Italian crust. Did I mention it's totally authentic?! You will want to return over and over again!"], ["Kristelle B.", "I went there for a quick lunch break alone, I sat on the bar and ate 2 slices of fresh pizza.. it was heaven. Delicious, fresh and friendly atmosphere."], ["victoria b.", "This place was so good! 5 stars for food, attention, service and overall aspect of the restaurant. My mother and I went in for dinner on Sunday, after doing a bit of shopping for my sister, who needed things for her newborn baby. We were both famished and were so pleasantly surprised that our food came out really fast! Our server Paul was friendly, welcoming and really attentive-- he recommended delicious plates as well as a great glass of Vermentino wine. The owner, a legit Italian man from Recco, was super nice and came by to check on us a few time. The best part of the evening came after we paid the check, when Paul, our server, showed up with a little Nutella tart for my sister. We had told him that my sister was at home because she just had a baby, and he remembered and sent her dessert as a congrats on the new baby gift! That just made the whole experience that much more special. It was really thoughtful and prompted me to write this review. So if you're around the Shops at Midtown Miami and are in the mood for some really scrumptious, authentic Italian food, definitely stop by Riviera! 2 thumbs up for this place."], ["Vic L.", "Extremely Expensive for just a prosciutto focaccia, spinach ravioli, octopus appetizer  and two non-alcoholic drink. Total $80 tips included. I rather go to Salumeria 104 Highly recommended."], ["Josh T.", "Don't like the food here though I haven't tried all their options.  My honest opinion is that if the food isn't good, it shouldn't be on the menu period!  The veggie pizza's here were not good at all and too greasy.  I hear that at least their lasagna is good, though I haven't tried for myself.  Plenty of Italian restaurants around, look elsewhere."], ["Mike S.", "This is a quiet and casual place. Most of the seating is outside and in the cooler months it is beautiful to sit out. This place is unpretentious and will calmly serve good food. Nice to have a spot like this frequent. I go close to once a month since it is a great date spot with my girlfriend. Great homemade pasta especially the pesto!"], ["T. W.", "Delizioso! Can't say enough good things about this restuarant. I ate there three times since their grand opening last week. This is the real thing...Northern Italian focaccia. This is not pizza so don't compare it to it's sauce and cheese laden cousin.They serve a wide variety of focaccia and other Italian specialties. All fresh, all flavorful all the time.  The owners, manager and chef are Italian and they are constantly working the room.  The atmosphere is warm and cozy with an open air feel.This will be a regular stop for this Italian. Bravo Riviera!"], ["Ward B.", "Went while visiting the Art Basel. Great location,good cafe seating.Lots of interesting choices on the menu.I had the smoke salmon/cream cheese focaccia with greens,my wife had black spaghetti with mussels and octopus. Both were good choices. The service was great and friendly."], ["Jack D.", "Authentic pasta, real ingredients. The ravioli was superb.  Focaccia was excellent.  Plenty of pine nuts in the Mushroom dish.  The kitchen is a part of the dining room, which adds an intimacy.  Very clean, well-lit.  Nice outside seating along the streets of Midtown's design district.  Menu is sufficient, but doesn't overwhelm; they know what they are about.  Waitress, Jade, was flirty and fun.  My only complaint was my water glass went unfilled for too long, but this is a new addition and hiccups are to be expected."], ["Ja A.", "100% Authentic and will be back soon!!! The food was absolutely delicious you can tell it was pure quality! I felt as though I was back in Italy. . The focaccia was one of the best I had in Miami so far....The service was amazing which is also so rare to find in Miami....(If you know what I mean) All the servers were very polite and cordial Will be coming back alot!!"]], "Via Verdi Cucina Rustica": [], "Osteria Vecchio Piemonte": [["Michelle C.", "Best Italian restaurant in Miami. Seriously! Highly recommend the pumpkin ravioli, and if you like lasagna, their lasagna hits the spot. I've stolen bites from my boyfriend, who typically orders from the specials menu and I've never been disappointed. Don't expect lots of cheese, or tomato sauce, big portions or any of those other things that make Italian food so stereotypical. This is the real deal, 100% authentic although I've never been to Italy. Great selection of wine and for desert try the espresso with ice cream, you won't regret it. Service: is typically very good and very Italian. If you don't have a reservation expect to wait."], ["Isabel C.", "Tasteful lunch.Pros: - The temperature of the food and restaurant- Grilled tomatoes in the caprese (added a depth of smokey flavor)- Welcoming staff- Frank Sinatra playing in the background- Complimentary bruschetta appCons:- The bill was not separated the way I requested"], ["Marty C.", "Let me begin that initially, this place caught my eye as I drove by on Sunset Drive. I made a mental note and thought, I must check Yelp.Later that day, I checked Yelp and was blown away by the reviews.  Still a bit apprehensive, I bookmarked the restaurant and thought one of these days I'll try it.  Well, that day arrived.  Since it was a Saturday, I figured, let me be on the safe side and make a reservation.  Arrived a few minutes early and was happy to find plenty of parking spaces.  Upon entering the restaurant, I didn't think it was as small as some of the previous reviews.  More on the intimate side but still, warm and inviting.  We had a gracious welcoming and were immediately seated.  What a great sign of things to come.We were initially served a small bruschetta piece each along with being asked if we wanted mineral water or regular water.  After receiving our menus, our drink order was taken.  We weren't rushed and had plenty of time to review the menu along with being advised of the daily specials.I chose my weakness, homemade Gnocchi with a pesto sauce.  My other half, the special, Lobster Tortellini.Let me begin with my meal; the gnocchi was made to perfection and not doughy at all. The sauce was a creamy pesto sauce that was delicate and complimented the gnocchi perfectly. I also tried my husbands Lobster Tortellini and it was also amazing.  It is obvious that when they say most of their food is homemade, they are not kidding. We skipped ordering any starters to save room for the dessert.  After a brief struggle over what to choose, we decided to share the Tiramisu.  Again, it was light and yummy. The service was attentive and as I mentioned before, it was evenly paced from the moment we stepped in the restaurant.  It is obvious everyone in this restaurant cares about their customers and it shows.  I have seriously found a gem of a restaurant in a very unassuming strip mall.  Step in and get ready to be amazed.I'll be back, very, very soon!"], ["Mike W.", "Best Italian I've had since moving to Florida.  I'm from NJ /metro NY and this rivals the best up there."], ["Krys P.", "This retail spot has seen several failed businesses, Thai, Japanese, and a few more, but finally here's a winner that will likely stay.  We went on a Tuesday night and the place was packed!  As all reviewers mentioned, service is excellent.  When we walked in, the owner asked my hubby his name, and when we left, he said goodbye using his first name.  Even if he had to jot it down on a notepad it still shows he cares.  As the menu and wine list is heavy on the region of Piemonte, we asked if he's from Piemonte.  That brought on an ode to the bountiful delicacies of his birthplace, and he rattled off \"BaRRRolo\", \"BarbaRRResco\" in the charming way only an Italian can.  For appetizer we tried the special, sliced sausage from Italy on top of polenta with fontina cheese sauce. This dish is plate-licking delicious.  For the entrees, the agnolotti with meat sauce and the fresh fettuccine with mushrooms are both bursting with flavors. I do find the fresh pasta a little softer than I prefer so maybe next time I'd tried the hard pasta to see if it's more al dente. Their wine list is, naturally, composed mostly of Italian wine, especially from the region of Piemonte.  The prices are very reasonable.  An Aramone is $60 a bottle, and this wine, even the less expensive labels, goes for $30 or so.  Other wines are about $30 -$40 a bottle, so the mark up is about double rather than the standard triple.  I highly recommend getting some wine while you dine here.  Not to mention that you can trust the owner to give you good recommendations."], ["Julie M.", "I'll get to the point - why 4 stars instead of 5? The menu was very short, and vague.On to the good stuff - very small place, with a very authentic feel to it. While the menu itself was short, and some of the pairings were a little awkward, the food was AWESOME! It was cooked perfectly, and the portion size was very reasonable for a lunch item. I am definitely going to give them another try for dinner. I think what really made this place a 5 star experience for me was the staff - they were so attentive and friendly, even when my 1 year old decided that he wanted to act out and bang his toy on the table nonstop. I would definitely recommend that you give them a try!"], ["Lissette V.", "I definitely found the best authentic Italian restaurant in Miami. Everything was magnificent! The service couldn't have been any better. The food was amazing and the dessert hit the spot!For starters we were given a sample of their bruschetta which was very tasty as well as a basket of bread. For entree I had the fettuccine Alfredo with chicken. It came with a soup or salad. I felt as if i were in Italy eating authentic Italian dish. The pasta was definitely homemade and the sauce tastes like no other. The chicken was very flavorful as well. Although we were stuffed we had to eat dessert. We went with some type of mousse with strawberries. It definitely hit the sweet spot without being to heavy.I can't wait to come back!!!"], ["Therese P.", "Awesome food, great service. The mahi mahi was amazing. I can't wait to go back. Since I wrote the above 2 sentences I've been back 3 times. This place is ruining my life because the food is so damn good. As an Italian person I'm super picky about my Italian food. This place is legit."], ["Carlos M.", "Excellent service 10/10Food is 9/10Wine 10/10The owners are always there and when theirs owner active then service is A+It's a small place so seat are limited, if you need to wait then wait as it's worth waiting Will comeback with more friends and family"], ["Rick A.", "Great food and amazing service.  Kids food was served first.  Free desert for my moms bday.  The attention to detail was always there from beginning to the end.  Will definitely come again."], ["Michele L.", "We went last night to celebrate my son's birthday.  You are greeted and welcomed at the door.  The tables are nicely set with linens and dark napkins.  Service was prompt, professional and friendly.  I would suggest a reservation as it got full as the evening went on. The music was upbeat early then changed to soft jazz later.We started with a bottle of their prosecco which for a $30 bottle was crisp and perfect for a flavorful meal.  The house specials were the pork sausage with arugula over polenta in a cream sauce and  the escargot in a marina sauce both were very good.  The lemon grilled octopus over sliced potatoes which is on the menu was also very good.The entrees of skirt steak was seasoned well and cooked medium.  It was served with a very tasty chimichurri, roasted potatoes and fresh chunk vegetables.  The salimbocca was very tender and the sauce was perfectly flavored, served with the soft roasted potatoes and fresh vegetables.  The penne with pumpkin, pancetta in a cream sauce was rich and savory.  They served a cannoli dish with a candle for our event and our glasses were never empty.This is a wonderful dining experience even if you aren't in the Kendall area; a very charming intimate resto.  It's worth a trip from the initial welcome, personal and customized service to full flavored and quality dishes"], ["Jorge B.", "My family wanted to eat here for Mother's Day and we tried to make reservations but they don't normally book you. However they made an exception and we were lucky to have chosen this hidden gem.This is a small place with great service and outstanding food. Each of the plates were better than what I ever tasted before. From the anti pasto, soup, entree, dessert and surprises at the end with after drink and a rose to each woman.I think the overall experience makes you remember them and bring them up every time someone asks you for a recommendation for an awesome place.This is a definite be back customer. We were a party of 13 and that's usually hard to make happy. Check out some of the pictures and explanations and let them convince you not me."], ["Karla S.", "Wow! Just wow! I honestly expected to be underwhelmed. I live and work right by this little Italian place and never imagined such a treasure laid there. We let them make recommendations on wine which were spot on. For antipasti we had the calamari which was hands down the best we have had in the city. My husband ordered the ossobuco with saffron risotto and I ordered the skirt steak with roasted potatoes and vegetables. Ossobuco is my husband's signature dish. He always orders it whenever on a menu and has tasted his fair share all over the world. He knows when it's good. He said this was en par with the best ones he's ever had in his life. I know skirt steak, vegetables and potatoes is not a normal thing to order at an italian place and I was worried I should have gone for something more traditional. Let me tell you I am so glad I ordered it. The steak was melt in your mouth perfection. Seasoned perfectly and most importantly cooked beautifully. It was the epitome of a prime example of what a medium rare steak should be. The potatoes were crisp and light. The veggies still in good texture but earthy. I heard everyone around me raving about the food. I've lived next door for quite some time and cannot believe it took me so long to come here. It was truly spectacular. I've yet to try the pasta but so far with what I tasted this is right up there with Fratelli Milano (if not better) and easily destroys any other italian restaurant I've been to in Miami. Last but not least the service was lovely. Everyone made a point to remember your name and address you by it making you feel special.  Truly wonderful! Can't wait to go back :)"], ["Suny R.", "This is a hidden gem, but be sure to make reservations as it is a tiny place. I went on a Saturday night and people were lining up outside waiting for a table. The service was a little slow, but everyone was so generous it almost didn't matter. The calamari was fresh and perfectly fried. The porcini mushroom pasta special was my favorite - oh my so so yummy! The rainbow trout with champaign risotto was also very tasty. For dessert we had the cannoli and the hazelnut cake and both were outstanding. We accompanied the meal with a bottle of wine, suggestion of our waiter, and it did not disappoint. The wine was so smooth and delicious. I enjoyed the dining experience and will definitely be back."], ["Arelys G.", "This place is a hidden Gem! they're food is delicious and they're service is fantastic. I've had both dinner and lunch and they where so yummy. if you plan on having dinner here do not forget to make a reservation in advance because it is a very small place and without it you will be waiting for hours."], ["Daniella W.", "This is is the first time I've been here and I have to say that the service is impeccable. Both bread and soup are both great... And the food. Oh the food is SOOO delicious!!You have got to eat here!"], ["Gabriel R.", "Great food and excellent service. The staff immediately make you feel welcomed and as if you are a regular even if this is your first visit.  The staff is quick to offer help in deciding from the menu as the choices all sound so good. It also helps that there are so many pictures posted on Yelp. They give you a sample of bruschetta to start the palate festivities. The saltimbucco was very good. A must try is the dessert with strawberries and a fantastic cream, could've had 2 of those by myself, but the wife wouldn't allow it!  Just kidding.. definitely get a reservation and make this restaurant a priority on your list!"], ["Samantha P.", "One word... Amazing. Nothing else to say, by far one of the best True Italian spots in Miami. The hospitality you receive the second you walk in the front door is incomparable!! LOVEA"], ["Luisa H.", "Great place! Food was amazing and the service was extraordinary! Please come and try it!!"], ["Reyna d.", "Our review today is for Osteria Vecchio Piemonte located at 10480 SW 72 Street.  This tiny restaurant is located in the corner of of shopping center, and had caught my attention as I drive by with frequency by this area.  Lately I had seem several people waiting outside plus lots of parked cars when usually this place was empty before.The location is small and before the restaurant became Osteria, a sushi restaurant  and a spanish tapas restaurant had failed at the same location, in both cases neither restaurant lasted a year.   Italian cuisine is one of our favorites and this place was intriguing, so we decided to try out on a Friday night and without reservations. Upon arrival, we were surprise that the place is actually smaller than what we anticipated.  The sign by the door read \"Capacity of 45\", but even that  looks like and generous number.    We were lucky that they had available a table for 2 and we were seated immediately.  A waiter came quickly and brought us the menus and the wine list.  Bread and butter came a few minutes later.   At first glance the menu shows a variety of  antipasti, salads and appetizers.  The only soup in the menu is the soup of the day.   Additional selections of pastas , risotto, meat and chicken dishes were listed.The wine selection is mostly compose of Italian wines, and a few spaniard and american wines as well.We had not finish reading the menu when another person approach our table and offer to tell us about the specials of the day,  We listen carefully to the soup of the day; and the other choices such Osso Bucco with champagne risotto, and fresh snapper.  I must confess that we both thought that the italian accent of our waiter was a bit funny, almost borderline ridiculous to be a real accent ,  but what the heck; this could be an opportunity to remember our trip to Italy and we might even get to practice our rusty italian.After a few questions about the daily specials we  accepted their suggestion for a crab cake as an appetizer and order a bottle of sevignon blanc  from Uruguay.     Both excellent choices as the crab cake was cooked to order and was fresh and light.  The crab cake came on a bed of arugula and grated parmesan cheese sprinkled over with balsamic vinegar . The wine was properly chilled and was crisp and fruity, a good complement for the appetizers.For our main course we ordered spinach ravioli with tomato three way and Fagottino di Pollo ( chicken breast stuffed with asparagus and fontina cheese with a rosemary red wine sauce ) .   The main course took a while to come, during which time we drank most of the wine, ate all the bread and watch the interaction of the waiters with the patrons.During the 10 to 15 minutes that we waited for our meal to come, we saw two birthday celebrations.   All the  waiters came to the table with a canoli desert and a lighted candle , to sign happy birthday in italian ( Tanti Auguri ).  We also noticed how the restaurant personnel is very alert and fast in cleaning tables to accommodate the  people waiting to be seated.    Since the restaurants is very small, people waiting for a table must do so outside where  a few chairs are available.   Those waiting outside are offered a complimentary glass of wine as a \"thank you\" for waiting.   This is a nice gesture which will pay dividends in the form of repeat customers.Finally our meals arrived and we were offered some additional parmesan cheese and fresh pepper , which is always  a welcome idea.  The Ravioli with three tomatoes is nothing more than a way to present the pasta dish with tomatoes sauce, fresh cherry tomatoes and sun-dried tomatoes.   We were not impress with the dish, but rather surprise at how the combination of the spinach ravioli and tomatoes came together in a nice taste.The second meal was chicken breast stuffed with asparagus and fontina cheese.  The chicken was presented in small cut sizes and with fresh cooked vegetables and fried potatoes,  The vegetables were cooked well  with the right combination of being fully cooked while at the same retaining crispiness and flavor .   I recommend this dish if you don't want to eat pasta.I rate this restaurant 8 out 10,  I must come back and try different items front the menu to give a more solid opinion of the food.  I believe the restaurant is on the right path of success as I experienced first hand the high level of service by the staff and management.  We saw how many of the patrons were repeat customers, many of them already on a first name basis.It is a pleasure to see how a restaurant can prosper with good food and the right attitude.Thank you for accompanying  me on this journey.  Bob Appetite    if you received a freebie for writing this review, or if you're connected in any way to the owner or employees."]], "Fratelli Milano": [["Vera A.", "Excellent! The Veal Tortellini was one of the best dishes I've had. Had a few bites of the Pollo Farcito, chicken was very tender with a light crisp on the outside, also a great dish. Everything on the menu looks delicious, highly recommend this place. Great atmosphere and friendly service."], ["Caroline K.", "Damn, I must've bookmarked this place for literally years.  Never thought I'd actually make it out here, but life surprises ya.The Italian food here is ON POINT.  My bf and I loved everything, from start to finish.  And our server Paola was so sweet and accommodating.  We couldn't stop raving about the calamari was the best we've ever had.  Like my fork was actually able to go through it and not bounce back like it does with the other hardened shit back in NY.  We killed our salads.I got the penne, but I kind of wish I got the seafood pasta instead.  The table next to us made it look real good, but it's alright.  Their dessert which was something akin to a chocolate lava cake was super rich and filling and added a thousand calories to my waistline right there."], ["Laura A.", "Just one more review for this amazing place that already has hundreds !One of my go to spots for Italian food in Miami, the food is consistently amazing !Its a small place, so weekends are def busy! I went on a Friday night and was able to get reservations.For entree I  shared the calamari which was big portion to share. Loved itEntree I had the lobster ravioli , which is a MUST order ! If u like to but eat portions , I can see where that might be a problem since the serving is not that large .The rest of my party had the seafood risotto which I thought lacked a little seasoning, and the flounder which was to die for !!!!!! I wanted to get another flounder for myself .For dessert , the creme brûlée was my all time favorite !!! There is a parking garage right in front of the restaurant for 10$ flat rate"], ["Jeanette R.", "This has been my go-to for authentic Italian cuisine for almost 10 years (since its opening circa 2006.) it's owned by two Italian brothers, one who specializes in the pastries and the other in the pastas, which are home made daily. Their sauces are delicious. Pizza is delicious. Salads delicious. Desserts delicious. Every thing is consistently excellent here. What can I say with modesty about this place? It is a MUST for your \"al dente\" list if you have not been by already!"], ["Matt K.", "Let me sum up my experience here in four words: excellent food, poor service.The Bad: We called ahead to get evening reservations and the host continually interrupted us, saying that \"we might have to sit outside\" even though we were fine with waiting. He just continually interrupted us repeating this until we said thank you and got off the phone. Very odd and off putting. The waiter also provided poor service, only came by the table to take our initial order then drop the check off, no refills of water or checking in on anything.The Good: the food was outstanding. We enjoyed the bruschetta appetizer before moving on to the main course of caprese chicken (fresh grilled chicken, dark red tomatoes, zesty cheese).Bottom Line: even though the food was delicious I would not return here... when you are paying a decent amount for a nice dinner the atmosphere and way you are treated makes a big difference in the experience."], ["Nicole W.", "I had dinner here last night! I'm sad to report that the service here has taken a turn for the worst! I don't know if they are short staffed, but our water glasses sat empty until dessert, we were never offered a drink, our waiter never checked on us after the food was served, our dirty plates sat in front of us for a good 10-15 minutes after each course, and there was a large gap of time between each course. I tipped a measly 15% and left. It's kind of unfortunate as the food is here is still good! Last nights meal included meatballs and calamari for appetizers, mushroom risotto with scallops (a special request) and the seafood fettuccine. It was all good, but I'm not one to put up with bad service, so arrivederci Fratelli Milano!"], ["Claire W.", "Called in for a reservation for 2 on a Saturday night. The person who answered the phone was polite. We arrived and the restaurant was over half empty. More people arrived as we were eating. The FOOD:- bread (2/5): The roll was dry and we also got these small, long breadsticks. The red sauce was different, and tasted okay. - calamari appetizer (5/5): very tasty!  Excellently breaded so the batter didn't come off when being dipped in sauce. Nice large rings and the calamari tasted so fresh. The tomato dip was unique and there was plenty of it leftover, so serve generously. - fiocchi (pear pasta, 4/5) was pretty good and had an interesting array of flavors and textures. Not to mention each ravioli looks like a bag of money, so in every bite you are winning. Haha, so punny. - fettuccine allo scoglio (seafood pasta, 3/5) had a good amount of sauce, but tasted pretty salty. I'd eat it again in hopes they turn the saltiness down a notch. The Service was good, we didn't experience anything like I was reading about in some reviews. They were attentive, poured water when needed, removed empty dishes when indicated and served our food in adequate time.  No complaints. I would definitely return again, especially since I live within walking distance, so sorry- I cannot attest to the parking situation. Average price for Italian food and the portion size was decent."], ["Bernice M.", "Oh my, what can I say.  This restaurant was within walking distance of my hotel. I read the review before going, and am so glad that I went. IT WAS DELICIOUS. I ordered the pear pasta everyone raves about. I loved it. My boyfriend order chicken, and he loved it. Will most likely go to Miami again, and when I do, I will eat there again."], ["Spencer A.", "I know Italian food.  Real Italian for.  And this place has it very close, but something was missing.  My bet is that the chef and owners are not Italian.  It felt more like I was in NY than Miami on our visit, tight seating and bustling.  Service was very good and the portions were very large.I also shared some issues that I have read in other reviews regarding reservations and having to sit outside.  Clearly they are trying to drive customers to their outside seating.  But on a humid Friday night in October with their neighbors pressure cleaning the sidewalk-outside was not an option.  Plus when I arrived they couldn't find my reservation in the system.  They \"believed me\" and then found it scribbled on a piece of paper under the counter.  Small detail but a rocky start and a similar experience for others.I liked it.  Would I go back?  Sure, if I am downtown and hungry.  Would I make a special trip just to eat here? No, and neither should you."], ["Navene S.", "Came here for dinner and had a good experience. We ordered the traditional bruchetta for an apetizer which was delicious very light and flavorful. For the entrées we ordered the seafood pasta and the filet mignon pasta. They were both good, I preferred the filet mignon pasta. However, I did feel that the dishes were very salty. So much so that I couldnt finish my seafood pasta. For dessert we ordered penna cotta (one of my fav desserts, so I had high expectations) and it was very very good. It was very thick and rich and the cream on top tasted very fresh. Loved the floural design with different sauces, it allows for trying the penna cotta with different flavors such as chocolate, lime, and strawberry.Overall, nice place, nice atmosphere and good food. I want to come back and try their pizza and more dessert!"], ["Alana A.", "Incredible!You probably wouldn't think much of it when passing by. But my goodness, I felt like I struck gold.I ordered the gnocchi in pink sauce. I didn't really know how good that plate could be until I had it here. The pasta was perfectly cooked and the sauce, the sauce, the sauce - amazing! Soooo creamy and flavorful, it was mind blowing. For the first time in my life, I devoured the entire plate of pasta. Yum!I didn't have the pear pasta but I will definitely be trying it next time! My colleague had it and he loved it and it's the most popular plate here.Service was great and prices were pretty decent, especially considering how amazing the food is. Service was excellent as well.Tip: On weekdays, try to get here a few minutes before noon; otherwise, you may have to wait quite a while for a table."], ["Alison B.", "Delicious mushroom Risotto oh yeah!!! My honey had the lobster ravioli but the portion left him wanting more. If you have a big appetite, definitely order a starter. Great customer service; welcoming, friendly staff!"], ["Mark G.", "The fiocchi was one of the best of not the best dishes that I've ever had. It's filled with cheese and pear with one of the best sauces you could create. This has to be a fan favorite, haven't had anything like this before.I took a few bites of the gnocchi as well. This was a great dish too. My takeaway from these two dishes is that they do set themselves apart from the average place and they are one of the best Italian restaurants.If your in Miami this place should be on the top of your list. I've eaten at many Italian places but not many reach the level of flavor they did from the two dishes I've tried. I only can guess the other choices follow suit."], ["Wei J.", "Excellent excellent excellent. It was surprising how fantastic everything was. This place is located Inside a nondescript building. You can't tell how good this place judging by the exterior but you'll recognize it when you see that the place is absolutely jam packed at lunch time.Get the fettuccini allo scoglio. You'll love it."], ["Lizzy H.", "What a hidden gem! We had a little mini stay-cation at the Epic Hotel in Miami this past weekend. While walking around the area, we stumbled upon Fratelli Milano. We took a chance and made reservation for dinner that evening. Boy oh boy was I glad we found this place! The restaurant is very cozy and warm, but it's still quite modern. The menu is very reasonably priced and they have quite a selection of homemade pastas. Who doesn't have homemade pasta? I highly recommend getting at least 1 pasta dish if you're dining at Fratelli Milano.We tried many dishes but we all agreed that the best dish of the night was the Pappardelle Milano. It consist of homemade pastas, filet mignon, porcini mushrooms, sundried tomatoes, chianti wine, goat cheese, truffle oil & fresh tomato sauce. It was pretty much heaven with every bite. It was the perfect balance of creamy, nutty, and tang all in one. Truly delicious!!If you can, I would also suggest that you try one of their dessert. We tried the creme brulee and panna cotta and they were both so decadent.We cannot wait to return to this great little neighborhood joint."], ["Josh C.", "Had the best pizza margarita and farfalle with diced tomato, basil, and fresh mozzarella.  Highly recommend."], ["Foodie G.", "The pasta texture was delicious with lots of seafood in the seafood fettuccine (especially calamari).   I was delightfully surprised that the portion was so large considering the romantic atmosphere of the restaurant.  Really great value for $21.   I would definitely come here again!"], ["Diane W.", "The service here was very under par. They told us the wait would only be 10 minutes and they had us waiting for over 20 without even saying anything or an update. When they finally sat us down the waiter was very rude and short. It also took forever to get the check, and he added gratuity to a table of 4 which was a little insulting. I ordered the filet mignon pasta and the flavor was very full, but the tomatoes took over the dish, and that's pretty much all I could taste. The noodles were very fresh though and I loved the texture."], ["Colette T.", "I came here recently with my friend to try out the Italian fare around my apartment.  The restaurant is super cozy and the decor is really warm and inviting.  I loved it and it's within walking distance!  So good. I decided to try the Bucatini San Babila because I love Italian sausage.  Literally my favorite.  When my food came, it looked AMAZING.  It tasted amazing too. You could taste the freshness of the ingredients and the pasta definitely was handmade.  The sauce to pasta ratio wasn't too overwhelming either.  Like my pasta wasn't drowning in sauce, it was more coated in sauce. So good.  My friend loved her food as well.  The price isn't unreasonable either.  Definitely worth the money.  I will definitely come back again.  The service was great and it just seemed like a restaurant that would allow me to have a relaxing time."], ["Emily R.", "Excellent authentic Italian fare. We asked for salads which were not listed on the menu. We enjoyed a Caesar salad and a house salad . The lasagna could perhaps be the most delicious I have ever eaten. The veal was also well prepared and the pasta is indeed fresh. I would love to go back."], ["Patricia A.", "AMAZING! Service was great. The staff was super cute and very friendly. Food really tasted genuine Italian. Very delicious! We paid 16-18$ per main course. Big portions - couldn't finish it off.Will def come back here!"], ["Terry L.", "In my best Italian voice - Questo era davvero buono (this was really good)! I have had Ristorante Fratelli Milano on my bookmark flow for quite some time but kept talking myself out of it (ex: oh the parking situation is going to be too crazy or the restaurant is going to be too packed for enjoyment), but this past weekend as I was chilling near Bayside, I finally choose to make the jump and dine in.I can't front, the signage for this place is not really all there which caused me to pass it twice but once I found it I was able to park across the street in ease (yeah say whattttt - in Brickell/Downtown?). As I approached the restaurant, I prepared myself for a crowded place with a wait time to be seated, however the restaurant gods were looking upon us and there was no wait, in fact, the place was rather empty for a Saturday afternoon... I was happy because I hate overly crowded places.We opted to sit at the bar area although the outside area looked so tempting, the place is well decorated with a bar area attached to a tempting desert glass case, several tables outside and a dining room with ceiling fixtures, stand alone tables and couch wall type seating with a large outside window for people viewing!The service was (for the majority) on point, with the bartender/waiter checking on me and ensuring that all was OK and even making some recommendations as he could tell I was possibly not making the right choice on a dish!The Food...The Fried Calamari was fantastic, this is a dish that can be shared as the portion is pretty big. The calamari was tender and not chewy, the breading around it was well seasoned and it not overly done and the marinara sauce was perfect and spicy (you could actually see the spices in the sauce)!The Fettuccine with Bolognese sauce was excellent as well, again another dish that can be shared as its a pretty big portion. The pasta itself was on point as it was perfectly Al Dente and you could taste the freshness in the ingredients (no store bought pasta folks). The meat sauce was great as well, it contained a mixture of both pork and beef with beef being about 90% of the protein. This was a very hearty, warm and relaxing dish that made you smile within every bite!Overall this is a great place to get your Italian grub on with authentic flavors and great ambiance for a quick lunch or a dinner date, if and when I'm in the mood for pasta or even a nice pizza or a cannoli - I'll most def be back to check out this spot and you should too!"], ["Andrea C.", "Amazing dinner, the ambience was relaxing and very elegant...I love the flavors and the pasta's taste..."], ["Jennifer P.", "I read such great reviews and I really wanted to give this place 5 stars. But it just couldn't be done all because of one minor issue.I ordered for delivery to the Epic Hotel where I'm staying for the week. She said the food would take 45 minutes - came exactly in 45 minutes and as I'm in my hotel room taking out my pasta, there are NO utensils.If I wasn't so annoyed to begin with because I was so hungry I guess I wouldn't have minded as much but it just seemed like the standard thing to do for delivery. Other than that food was delicious and I'd love to dine in some day!"], ["Den L.", "Very authentic hand-made pasta!  Some of the best pasta I've had in Florida over the years.  The decor is cozy, warm and modern, so it's a nice atmosphere to dine in the Miami downtown area.  We had the Fettuccine allo Scoglio (seafood fettuccine) and the Tagliatelle Spiga (fresh-made spinach pasta with grilled vegetables).  The portions are very good, they were piping hot, and absolutely delicious!  The pasta itself is very tender in texture, some of the best hand-made pasta in this area.  And it was loaded with lots of seafood, even had large shrimps and scallops.  The calamari is cooked perfectly without any of the rubbery-textured stuff you might find in lesser restaurants.  The prices are very reasonable, good value and not very expensive.  Service is fast and excellent too.  Would come back again!"], ["Allan W.", "Outstanding! We had a reservation for lunch. Good service, great food, & overall a great experience. The wait for dessert order got a little long, but they were busy, so it was understandable. Everything was cooked to perfection.  A little too packed during dinner!"], ["Shir L.", "Bread + tomato sauce/oilFritto milano -well fried calamariFiocchi di pera e taleggioLasagna caserecciaFettuccine allo scoglioTrofie alle melanzaneStagioniFood was delicious. The sauces were wonderfully paired with the perfectly homemade pastas. Service was great and prices were decent. Overall I'd come back when I'm in town again!"], ["Melissa S.", "Easily one of the best Italian places around. I've been here twice and I love it because they use incredibly fresh ingredients, have great service, and the perfect atmosphere. To start, they serve complimentary bread and tomato sauce. Why doesn't every Italian restaurant serve their bread with tomato sauce is going to be the only thing on your mind after eating the bread! It's great and high quality. We also ordered the traditional bruschetta. Again, delicious, high-quality tomatoes. I always think bruschetta is so easy to make at home, why do I order it in restaurants, and then I have a bruschetta like this and realize why. For entrees, we had their homemade spinach pasta with vegetables and the veal cutlet with tomatoes and mozzarella on arugula. Everything was delicious and you could sense the freshness by looking at the dishes. Very highly recommend for a nice Italian dinner!!! In summary, this place is outstanding for its high quality, fresh ingredients!"], ["Nicole R.", "What a lovely experience this was. My husband brought me here for our anniversary. He made a reservation for 7:30pm and upon arrival they had our table ready and waiting for us. The place as otherwise crowded so I am glad he made a reservation. They also brought us a complimentary round of champagne to celebrate the occasion as we looked over the menu as well as a basket of bread with some sort of bruschetta dipping sauce. The skinny bread sticks were my favorite in the bread basket. Very addicting and the dipping sauce was so flavorful. The waiter was back shortly to take our orders. We didn't order an appetizer because I wanted to save room for dessert. For dinner, I ordered the seafood risotto and my husband ordered the lobster ravioli. Omg. The risotto. So so flavorful and FULL of seafood. I could not finish it as much as I wanted to since the portion size was pretty hefty. I was so happy to have the leftovers tho!  So yummy. Hubby loved the ravioli. He finished every bit of it. For dessert, we ordered the creme brulee and the lemon tart. Both were super fresh, it definitely seemed they were made that day. Great way to end a meal. I wish I lived in the area so I could come back for lunch! Highly recommend."], ["Paul S.", "Ravioli is outstanding. I went with the house special. Glad I did. Nice place for a date."], ["Judy P.", "Visiting Miami for work and decided to give Fratelli a try based on reviews and the menu. I got the salmon and seafood special which was delicious and had great service by Eduardo. Lots of yummy looking items on the menu that I'll come back for on the next trips."], ["Monica G.", "Probably the best Italian food I ever had.  Very unassuming yet such a gem.  We had their Agnolotti di Pollo with pink sauce as well as Fiochhi Di Pera and both were so good.  This is a must go if you like Italian and are in Miami."], ["Arezou A.", "This place was great. From the outside, you don't expect much. It's pretty well hidden. We went inside and the place is really beautifully decorated. Very intimate, probably a good date spot. We ordered the bruschetta, gnocci, and the mushroom risotto. The bruschetta was your typical bruchetta, four pieces. The gnocci and risotto portions were hugggeeee. The one place where the price is worth the amount of food you get. Expect to bring your food home with you, you'll want to! The service is really excellent. They consistently came around and filled our water, asked if we needed anything, and explained the menu as necessary. One of the few places where included gratuity didn't even make me feel bad."], ["Maureen A.", "Loved the warm, modern decor. Food was fabulous and could not have asked for a more courteous, attentive staff. Very pleased. Did dessert as takeout for later, we were so full! There is a parking garage across the way, so secure parking was $24 for 2 hours."], ["Phil M.", "It's hard to find, real authentic Italian food in Miami.  This place offers authentic dishes at great prices in an intimate setting ideal for 2 or a group of 8-10.  Two thumbs up!"], ["Mathilde P.", "I used to love this place but I have been ordering twice fiocci do Perra and I got sick twice, we used to taste the pear and the cheese distinctively with this sweet and salty taste, but the last two times I just didn't taste anything but a cheesy pasta, really disappointed as I used to love that classic Italian"], ["Bonnie A.", "I loved this little Italian Restaurant. I'm not too familiar with downtown Miami, and we spent most of time in Miami Beach, so we ventured to downtown to eat at this highly rated restaurant. I had the pasta filled with pear and taleggio cheese in a butter sage sauce. It was heaven. Absolute heaven. The most delicious Italian I've had in quite some time. The BF went for the lasagna, which he also enjoyed. The menu has so many great choices, I highly recommend it!We sat outside, on the sidewalk, which I really enjoyed. The tables are situated under the canopy of a huge gorgeous tree. Just a great setting... lots to see. Very nice area."], ["Troy F.", "Yes, eat here!Solid, tasty Italian in a cute, neighborhood spot. HMB and I have eaten here twice, both on Miami getaways, so a return visit speaks highly of Fratelli Milano given all of the other options available. The food is very good.  I've had the fish stew and the seafood risotto, both of which were cooked to perfection and had an abundance of fresh, delicious shellfish.  The risotto was firm, yet tender and had an amazing, tomato base that beautifully elevated and didn't overpower the delicate flavors of the fish. Yum. Overall, the menu doesn't try to get too fancy - it promises relatively straightforward Italian dishes and then completely over- delivers on expectations. Wine list is good - nothing overly adventurous, but you'll most certainly find a bottle you'll enjoy. What takes FM from a good experience to lovely memory you'll want to have again and again is the service. It's family run business and that pride of ownership really comes through at every touch point - when you arrive, when you're having a glass of wine at the (tiny) bar, or throughout your meal.  Attentive, friendly, great pacing, never rushed.  I'm confident that at the end of your dinner you'll walk out arm-in-arm, smile on your faces, looking forward to coming back.  We have (twice)."], ["Cristy C.", "Excellent. Truly authentic Italian food.Try to lobster ravioli or the seafood pasta. The lobster ravioli doesn't look like it will fill you up but trust me, it will. I was also blown away by the antipasta appetizer. It was super tasty. Great place for a romantic dinner. Highly recommended."], ["Devika M.", "My friends and I (all girls) were visiting Miami and went here for dinner. Since we were not familiar with the area we parked at a public lot and then had to walk through a rough area to get to the restaurant.  It was scary to say the least. So parking is definitely not a plus here especially if you don't know the area.  Now that that's out of the way- let me tell you!  The food was delicious,  we were pleasantly surprised by the ambience of the place and the service was great!!  I had the spinach pasta dish( I don't remember the Italian name)  and it was hands down one of the best dishes I had ever had.  As a vegetarian I definitely appreciated this dish and the fact that their pastas are hand made. We all had different things and we each enjoyed our dish! I love the sauce they bring with the bread!!!! Yummy!! Would definitely eat here again!"]], "Ni.Do. Caffe": [["Dustin R.", "Always fantastic!Great Mozzarella options. Specials or regular items, each are great. Been 10 or 12 times and has been consistently great."], ["Lexi A.", "I want to start off this review by first stating that my coworkers and I once LOVED this restaurant. We work across the street and would order often as well as order for our clients. If they weren't too busy a server would come to our business and drop it off, and we would be sure to tip well for making things convenient for us. Then we hear there are new owners. This brought us to getting charged $18 for an arugula salad (salad implying mixed) that consisted of just arugula in a box. But that we let slide, thinking it was just growing pains or a misunderstanding.******Then today happened. We had a pretty busy day at our business. We asked if it was possible to get delivery across the street which they said they will no longer be doing.  Ok fine, no big deal. We order, and I was available to pick up the food. When I get back, my co worker had a quick 15 minutes to eat in between clients and found A GIANT ROACH in her caesar salad. She put it in a paper towel and showed it to me. Completely repulsed I told her not to throw anything away and not to touch any of the other food (2 pumpkin soups and a side of bread) and I would walk back as soon as I got a free chance to inform them and ask for a refund. About an hour or 2 later I had time to walk back over to NiDo in between clients. I asked calmly and politely to speak to a manager. I was pointed to his direction and walked over to him at the back of the restaurant. I went to him not wanting to make a scene in front of his other customer. I took out the salad box and said we would like a refund. He asked why, I told him to open the box ( again not wanting to make a scene). The manager got INCREDIBLY defensive telling me there is \"NO WAY\" that this was their fault and that he made the salad himself .  My co worker put a dirty paper towel with some left over hair extensions from our salon in the box from when she was going to throw it away ai I can understand why it may have initially come off as suspect. But why would I bother coming to him about a roach? He would not stop being hostile and denying any fault.  I kept asking, \"why do you think we would lie?\" \"Why would we put a roach in our food?\" because really...why would we want to be hungry at work with what little windows we have to eat at our establishment?This went on with him speaking to the cook and to the other servers essentially blaming us for the ROACH being in the salad and took no responsibility in an unnecessarily aggressive manner. He was incredibly hostile and rude. I was completely confused (having worked in the hospitality/restaurant industry myself) that I did NOT in the very least get an APOLOGY. Instead I got an incredibly dramatic scene and was treated like a lying P.O.S. Sure, maybe the a GIANT ROACH somehow opened the plastic lid in the to-go container to let himself in to die unbeknownst to us.  But the fact that I was treated in such a low class manner in what's suppose to be a high class establishment is incredibly alarming and unprofessional. I am more disgusted in this manager's manners than I am with the roach in my co workers caesar salad. Needless to say we got our refund with a HUGE attitude and still no apology. I strongly advise people avoid this restaurant. If not for the possible pest problem, but just for the blatant lack of common sense on how to treat a customer."], ["Carlos F.", "My first time hitting this little hit spot in Miami. I went with some great friends. Its nice quaint Italian Restaurant with a great selection of Wines. Ordered the Bufala Campana! My son ordered some really interesting Raviolis. that were very very  tasty with am excellent tomato sauce. Everything was really fresh and delicious! I didn't the know the servers  but they were very accommodating and they knew their menu. I will be going back!"], ["Eric M.", "A really cute, slightly upscale (but never pretentious) Italian cafe.Went for lunch and brunch. At lunch, the octopus salad was absolutely amazing... Big chunks of fresh octopus that clearly had just come off the grill, and cooked perfectly. The fresh bread (baked in the house) that they drop on every table is worth the trip, as well as the accompanying high-quality olive oil and the basalmic vinegar.Phenomenal service. And for brunch, easily the best coffee in this area of Miami. (It's run by Italians! I would expect nothing less!) Oh, and the Eggs Benedict was awesome too. Don't forget to check in on Yelp for a free glass of wine. :-)"], ["Gina T.", "Highly recommend! Delicious food. Friendly staff. This is what we had for dinner and it was all outstanding: Tuna tartare Artichoke soufflé Stuffed meatball Lasagna Tiramisu Bravo! We will be back!"], ["Rebecca B.", "Continuing with my love of the Mimo district here's another ode to biscayne blvd. Nido rocks in all categories. The interior is chic with nice dim lighting and somehow they've created the most inviting patio right on biscayne blvd. the food is spectacular and the pastas are top notch. They have several little unique touches that make this place a must like various infused olive oils, truffle is great mint is surprising, and a wonderful mozzarella bar where you can order a unique Dollop of mozzarella with fresh veggie sides and a vinegary veggie tapenade. The wine list is well thought out and pretty much all Italian. If you are will to go to the $100/bottle range there are some real standouts like the bold Brunello di montalcino and the Amarone.Service is wonderful. The manager/owner is attentive and classy, really wants to make sure you are enjoying the meal. They have some interesting salads too like the calamari steak with Farro, where else would you find that?All in all a super dining experiences in the amazing Mimo district. A little pricey but worth it. Parking is pretty easy to find in small lot and around the block."], ["Irina G.", "Great brunch spot in Miami. I found the place on yelp and got my fiancé to drive 5 miles out of the way to check it out. Location: there is parking in front and some street parking. When we arrived, all the spots were taken in front and we were lucky to find parking on the street.Service: at first the service was a bit slow, but we got to meet the owner and she made our day! She was vibrant and excited and ready to make us happy. The Italian hospitality and charm was shining through. She listened to the types of wines we liked and got us a bottle that knocked our flip flops off! Food: excellent. We both had eggs Benedict with smoked salmon. The potatoes that came with the meal had just the right amount of salt and baked garlic that complemented it nicely. They staff also worked with us to fit the menu to our food restrictions (gluten free). Overall, we were happy with the food. The wine took the meal to the next level. We took a picture of the bottle so we can find it again."], ["Ute L.", "Easy to miss restaurant tucked away in a Biscayne Blvd strip mall. Didn't know it existed until a friend had her birthday brunch here. Friendly servers who are patient and go out of their way for special requests. They joke around with you and willingly take group photos. The food can take a little while, but they do make sure to let you know it will be out soon. I was too busy with good company to really study the menu. I wanted some greens with fresh seafood, which wasn't on the menu, so they grilled some octopus and calamari and tossed it on top of arugula and breakfast radishes, with a side of lemon olive oil dressing. It was worth the wait. The octopus steak was meaty, tender and had a great char on it. Everything I wanted it to be, only better. The calamari were equally soft and delicious. It was such a huge portion of seafood that I had half packed up to go.All the brunch portions looked generous (none of that trendy tapas-style fufu stuff) and homey. I did get to try the French toast, which was more of a dessert. Doused in cinnamon, which I can never get enough of, topped with fresh fruit, and I am talking REAL fresh fruit: big chunks of mango, banana, apples and strawberries. The home-made whipped cream didn't hurt either. Darn it, I wish someone came up with a vegan and zero calorie version of whipped cream already!Refreshingly unpretentious, authentic Italian food with a side of Motown music and free parking out front. What are you waiting for?"], ["Joanna R.", "Had a lovely meal at Ni.Do yesterday with my boyfriend and his folks. We sat outside in the  shade and even though it was a hot Miami day we weren't sweating profusely. We all got the steak and eggs which were good, but I can say with conviction that the real star was my boyfriend's lasagna. Italian is their specialty and they execute it to perfection. Man that was delicious and I had major food envy.Speaking of Italian, expect slow and relaxed service. Just pretend you're in Rome or your favorite Italian city and trust that the wait is worth it. Next time I'm in Miami I will have that lasagna and won't be sharing with anyone!"], ["Laura A.", "Romantic ambience -- make sure u her an outside table of weather permits .The Pinot noir ( which  I can't recall the name but it's the only one by the glass ) was delicious . You can buy by the glass or the bottle . I suggest getting the bottle.App- must have the meatball with cheese on top, it's not huge as described by Other Yelpers , good enough to share between two people .The taste was fresh and authentic. For the entrees I was not too impressedThe lasagna was just ok, and the lobster bisque risotto wasn't the best I've ever had The service was outstanding !!"], ["Rachel S.", "We stopped by here one evening after shopping in the area. We waited a while in the parking lot, and still didn't find a space. After parking across Biscayne Blvd we walked back and were  fortunate to snag one of the last available tables.The atmosphere at Ni.Do. is cozy and feels authentic. We sat outdoors on the side of the restaurant. The decor seemed to be from Italy with cute window covers that open to a mirror.For food we ordered:Vellutata Di Zucca creamy pumpkin, creamy parmesan & rosemary- It was creamy, hearty, tasty, and hot! (the way soup should be!)Pappardelle Con Salsa Di Porcini home pasta in porcini sauce-The pasta tasted home made. The porcini mushrooms were outstanding. The flavors in this dish were perfect.(The following were thoroughly enjoyed by my friends, I did not get to sample):From the Mozzarella Bar: Bufala Campana Polpo octopus, arugula, chick peas, kalamata olives, feta cheese & orange section.Spinaci. Caprino E Pancetta baby spinach, goat cheese, crispy pancetta, peanuts, raspberry vinaigrette.The atmosphere and food were outstanding. The service seemed rushed and overwhelmed, and were difficult to find when we needed something.The prices are slightly above average, for the service, but the food is of excellent quality.Overall, it was a good experience, and I would return to dine here again."], ["Karina C.", "I really enjoy this restaurant. I've been here a few times and the good is always fresh and good. Prices are reasonable and there is a very pleasant and covered patio on the side of the restaurant. After a meal, their cappuccinos are always on point! My fiancé and I will drive there all the way from Hallandale because we know we will have a nice meal."], ["Shab Y.", "If you like Italian food - don't think twice! My best Italian place in Miami so far!The Paccheri Con Patate,  is amazing."], ["Dan T.", "Came for brunch. Short and sweet menu. Food was fresh and delicious. The plate looked adorned perfect. Service was excellent as well. Excellent coffee."], ["Kathy B.", "On a trip back to Miami to visit some friends I ate here for lunch and it is pretty darn good. You have a casual cafe type setting and seemingly authentic Italian servers with accent and all. My friends and I ordered the lasanga, gnocci, and fettucine gamberi. The lasagna was pretty good and my friend commented that it wasn't over cheesed with ricotta like so many other establishments. My dish didn't have very much sauce to it at all. So when it first came I was a little disappointed, but as I ate more and more of it I liked it a lot. Despite it having so little sauce it had so much flavor to it. They also put in a tiger prawn head on and everything for a beautiful presentation. My personal favorite was my friend's gnocci dish. It's a punch of flavor and the gnocci was made and cooked to perfect soft chewiness. I had to reserve myself from eating most of her dish instead of my own. I forgot to add that we did share an appetizer of prosciutto and burrata. It came with a side of roasted and pickled  peppers, eggplant and capers. It was a very tasty accompaniment to the dish. Although with a dish so simple I think this can be a dish skipped beause of the price and the availability of burrata and prosciutto now. I make this dish at home already. The only gripe I had with this dish is that they brought out a reduction of balsamic vinegar straight from the bottle. Now I'm not sure if this was more for advertisement purposes for the balsamic bottler, but it brought down the refinement a bit. It would have been better if they brought it out in a separate dish or just put on however much they pleased and called it a day. But with that said it's only a small gripe that I'm splitting hairs with. This place is still pretty tasty and this area is definitely on the upswing for gentrification."], ["Norma G.", "Wow! This place was just pure perfection. Came here on a date night. And I'm glad we picked this place. Everything was absolutely perfect. From the moment we arrived we were greeted by whom I think it's the owner, a very pleasant lady, didn't get her name but she was very personable. Greeted us with hugs and kisses, very Italian of her ;) . It was a perfect weather night so we decided to seat in the patio, not too big but very cozy. The service was impeccable, from the bus boy, to our waiter. Everybody seemed happy to be there.We started with a mozzarella and prosciutto salad, I believe it's made at the restaurant, it was very tasty. As entrees we chose the Osobuco ravioli which was very rich and perfectly cooked. And also we had the porcini pappardelle, wow! I was in heaven, you can really taste the love they put into preparing your food in every bite. I think we'll definitely will make this place our own. Can't wait to go back, I'm sure I won't be disappointed. Thank you NiDo...see you soon ;)"], ["Tracey K.", "We came here for dinner before seeing a show at the Adrienne Arsht Center and got seated outside relatively quickly. We ordered the tuna tartare and polpo (octopus) salad to start, followed by risotto with scallops and asparagus in a lobster bisque sauce and gnocchi with buffalo mozzarella and basil. The tartare and octopus were just ok...probably not the best choice at an Italian restaurant, but we were fiending for some octopus after having some at a greek place. The risotto had a generous amount of scallops and was good for the first couple bites, but then it got a little too much like flour mixed with water. I also wasn't a fan of the presentation. My bf said his gnocchi was good, but we've both had better. The sauce was a simple tomato with no added flavors. Overall, I wouldn't knock this place off any list and would be willing to try it again, but I'd prefer to try other places first."], ["Andre G.", "First time at Ni. Do. It was on our list for a while given all the good reviews.We weren't disappointed.Good looking interior, good service and very good food. Reasonable prices.My veal ravioli were excellent, my mum loved her lasagna, and my father his porcini pasta.Tiramisu was one of the best I have had (and I love tiramisu): real mascarpone, not too sugary, good coffee cake."], ["Maria Z.", "It was my first time here on 8-9-15 and I was not disappointed. The service was good and the food was delicious."], ["Naty S.", "What an amazing evening!!! Finally a truly Italian experience. If you want to have authentic Italian food this is the place to go.The menu is filled with amazing Italian choices from Burrata, Buffala Mozzarella with Prosciutto, to amazing fresh Salads, all the Italian pasta dishes Gnocci, Lasagna, to amazing desserts. Tiramisu is highly recommended.The service is outstanding, our waiter was very patient and was able to explain the specials and made very tempting suggestions.The owner came to our table to make sure we were satisfied and was open to our comments. She wanted to make sure we were satisfied with our experience at NiDo.They also have additional Menu item on a chalk board by the bar where I found a delicious salad with Fresh pears and blue cheese (I asked If I could get Goat Cheese instead, and they were able to accommodate my request)The lasagna was amazing. The sauce was carefully infused with herbs and spices that were all over my taste buds.It is a perfect place for a date, family dinner or a group affair. Tonight we had kids in our group and they were able to make some simple dishes for the kids to enjoy as well. Their pasta was perfectly cooked, the sauce was Impeccable and the kids devoured it. The check was presented in this tiny wooden treasure chest, that I thought it was a beautiful touch.what a beautiful night overall!!!"]], "Fornaro": [], "Il Gabbiano": [["Kimberly B.", "Came to Miami for a week long business trip, stopped here our first night out to dinner with 6 or 7 of us. The service, food, view and atmosphere were unbelievable!!!Before you even order they are already bringing you fresh cheese & balsamic, zucchini chips, bruschetta and other delicious breads for the table.I ordered a pasta dish that was just wonderful. I am still dreaming about that deliciousness. Several members of the party ordered the Branzino and were talking about it for days later. They served us complimentary limoncello at the end of the meal.Everything was so delicious we went back on our last night! If you are ever in the Miami area this restaurant is one you absolutely have to try!!!"], ["Vikram N.", "Good food, good location, great starters with zucchini chips, garlic toasted bread, Parmesan with balsamic reduction, and some really attentive service. The waiter spoke a little fast so it was hard to rally understand what the specials were, but he was willing to repeat, so Service orientation was high.  However, They REALLY need to work out their birthday celebration routine. My daughter told them it was my birthday, so they brought out a nice cake at the end ... Only to take it away, and use the SAME cake to sing Happy Birthday to someone a couple of tables away.  I would suggest at minimum a single scoop of gelato ... We talked to the Manager afterward to figure out what happened and it seems we were to have been offered individual desserts .... But weren't!!!!!  Maybe language problems got in the way, but for a high end restaurant, that is not a valid excuse!  The manager apologized for the misunderstanding and offered to buy my wife and I a drink.  We will talk to the Manager and see if we can come back for a slightly better experience."], ["Nataly F.", "Hands down the best Italian restaurant in Miami, the food is incredible and the service was amazing. The specials are a little on the pricy side but totally worth it.The burrata is soooo good, the seafood is also all good.This is a must!"], ["Jane B.", "Now I know why they say this is one of the best italian restaurants in Miami. I had no excuse but to finally go here since I live in the building, so a group of 4 of us went to indulge. The wait staff was lovely and seated us right away. Before receiving the menus, they bring out delicious bread, parmesano cheese cute from a block tableside, and bruschetta to start. Drinks are delivered promptly, while you eagerly await the menu. Our waiter arrived and listed probably about SIXTEEN specials that were being offered that day (I used to be a waitress in fine dining back in college, and let me tell you that is NOT easy). The specials sounded so unbelievably delicious that we all ordered from those choices. The veal, scallops and chicken fra diavolo were superb. For starters we all shared the grilled octopus (probably one of the best cooked ones I've had in a long time) and the escargot.After dinner, we sat and took our time finishing our drinks without any issues. What a fantastic experience and truly a great meal. But, with such a great experience, comes a great price tag, so unless you are ok with dropping some serious dough, I would reserve this restaurant for a special occasion, trying to impress your in laws, or going here once in a blue moon."], ["Lu H.", "The meal starts off with a nearly full plate of food as soon as you sit down, before you order anything.  I was totally obsessed with their balsamic vinegar, which is to die for -- thick, with a far more complex flavor than your run-of-the-mill balsamic.  It reminded me of the aged balsamic vinegar I tried in Modena, Italy.  I could not get enough of this stuff, which was quickly sopped up with the generous bread provided.  Luckily for me and my dining companions, who were equally wooed, our waiter provided a refill.  :)An excellent chunk of parmesean cheese, taken straight off the wheel at your table, is plunked right next to the vinegar.   A bowl of fried zucchini chips (actually not crisp at all, sadly) for the table.   Finally, bruschetta with fresh tomatoes, rounded out the series of on-the-house appetizers.    And then, your meal starts. The waiters seemed to be SO Italian that you could barely understand the run-through of the menu specials, especially in a cavernously loud restaurant.  I had the grilled octopus to start and the irresistible sounding porcini ravioli with truffle cream sauce.  The grilled octopus was just alright.  The waiter was quite enthusiastic about it, but when I tried it, it was a bit tough and over-cooked around the edges. Maybe I was already full from the free starters to really appreciate  a rather heavy appetizer.  The ravioli with truffle was decadently delicious.  The full portion came with about 8-9 pieces, which was way too much.  I could only finish about 3-4, and even that was pushing it.  After all of the starts and apps, by the time this entree came out, I found myself wishing I had ordered a more refreshing pasta.  A few of us in the party were disappointed that they did not have ice cream.  How strange is that?  I thought I wasn't understanding the waiter correctly, so I probably asked about four times if they had ice cream (the fourth time I said, \"oh, okay.  Do you have gelato then?\").  In any case, we settled for an assortment of desserts.  A friend and I split the trio of desserts, which included a dense, flourless chocolate cake, tiramisu, and ricotta cheesecake.  All were excellent, especially the chocolate cake, if you like a dense, rich, not-too-sweet (in fact, almost bitter) chocolate.  Definitely a Miami kind of restaurant based on atmosphere, view, and clientele.  Lots of women in tall heels and short skirts.  Whether or not that's your scene, the food is quite decent and, if you order correctly, could rival some of the well-known Italian spots in NYC."], ["Stephanie F.", "Amazing! I was treated here by my group of girlfriends for my birthday and let me just say that the entire night we were beyond impressed. From the view to the waiters. They almost sing you their specials. It's quite impressive hearing them give you the run down and you get almost drunk in listening to their Italian. As soon as you sit they quickly bring you Bruschetta, Zucchini chips, a toasted almost Melba type bread, aged Parmesan cheese and balsamic sauce. Wow. I ordered the Lobster Ravioli. Hands down the BEST I have ever had. And at $49 it was worth every penny. I also had the Tiramisu for dessert and it was just as amazing. I ordered a Crown with Coke and let's just say I was not disappointed. Thought it was iced tea at first sight. Good job to the bartender!"], ["Oana C.", "Every thing was perfect, from the moment when I enter to the moment I left. I was coming to eat dinner with my family and we have a great time. The server was a Romanian, who was very nice and was telling us the menu like you was having the chefs in front of you cooking. Very skillful, top 10. The food was perfect and the experience also . I'm coming back."], ["Ana V.", "Celebrated my husband's bday on Saturday night. Great atmosphere, wonderful view and the food was amazing. We had the lobster ravioli and seafood linguine. Reservations were at 8:00. However, table wasn't ready, which isn't uncommon in South Florida. We had a drink at the bar. I asked the bartender for a cocktail menu and he responded that he didn't have a menu. I found that odd. I was surprised that for a high end restaurant in Brickell, the service was mediocre. The waiter didn't provide us with the wine menu until I asked and didn't encourage appetizers or recommend we try anything specific from the menu. It was as if he wanted us in and out. I had to request the desert menu as well.  I expected more from this restaurant.  I'm  not sure if I would return but as mentioned,the food was amazing. I may give this restaurant one more try. For the price and location, I expect better service."], ["Mel G.", "Well we were there last week . Very attentive Quality of the product is top notch , great for formal Dinner or business lunch , Very busy place , i ll highly recommend the reservations , had a ravioli and old Italian recipe spinach soup w/ eggs in it .It was fantastic . Service is impaccaple always .   I ll be there for lunch again next week."], ["Ariana M.", "Safe to say the best Italian food I've had. The block of fresh Parmasean cheese they bring will make any cheese lover happy. They give you complimentary bruschetta, basket of bread, AND fried zucchini. Took a minute for us to get our wine order in, but with all the appetizers and presentation we were easily distracted. One of my all time favorite desserts is the berries and cream they make AT your table. Gorgeous presentation of yummy fruit and champagne foam. Went as my birthday gift and loved it as always."], ["Evie L.", "My favorite restaurant in Miami. As soon as you sit, you get all different types of bread, zucchini, Parmesan cheese, and more. The service is beyond amazing, the food even better-- and the ambiance is perfect. And the bartender definitely knows what he's doing! I've had the best lychee martini here. You'll leave very satisfied."], ["Bruce S.", "Forget what I can write, JUST GO HERE! This was one of the best meals I've had! I ate so much there Wednesday that I only Thursday, and have been winging it since, it's now Sunday. I ate like a monster, I only wanted to have something simple like soup and salad when I walked in, but within moments I knew this was going to be a pig out of terrible proportion, and the Orgy began. I ate the brushetta (sp), garlic bread, balsamic vinegar reduced to the consistency of tooth paste, fist full of fresh cut parmasean (sp) cheese Tri-color, salad, Lingini with clam sauce, and chianti classico to wash it all down. Then my table mates started giving me hunks of they're food, veal parm and another veal dish, off the charts. I was done, then came the Tiramisu......"], ["Sher P.", "Great atmosphere! Good food.  Starters were exceptional cheese, zucchini chips , assortment of breads.  Food was served at the right temperature! Vibe bar scene bartender s very attentive!  Need fans that work when you are seated outdoors!!!"], ["David R.", "When it comes to an elegant, class-driven restaurant, Il Gabbiano takes all 4 stars!!! With absolutely excellent food and amazing service, the dinning experience at this restaurant is superb! Definitely a place to go for a romantic dinner with a significant other or to celebrate with the family. I ordered the pescatora all Veneziana and it was very delicious. As an appetizer I had mushrooms with escargot (snails) and it was sooooo good! closed down with a sweet wine and it was perfect. I did not give this restaurant a full 5 stars because even with a reservation we waited for almost 35-40 minutes before being seated. If this would have been different, it would had taken them all!!"], ["Jessica G.", "Best Italian Restaurant in Miami!!Amazing service by Mario and the rest of the team. Food was spectacular. We had the lamb chops and the lobster ravioli. Great ambiance, view, food and service."], ["Meghan S.", "WOWZA! So delicious. Beware: when ordering a special, you might want to ask how much it costs if you're trying to not blow $45 on porcini mushroom ravioli. It was uber delicious though! My bill was like $65 for my entree and a glass of wine if that is helpful for anyone.You are served a variety of breads and fried zucchini as an appetizer. We also got a slice of bruschetta and it was the best I've ever had!!! After the meal I was given a limoncello shot. Bleh...not my favorite as a shot.It's def a nice restaurant so don't go in shorts and flip flops or sneakers. I'd say business casual is about right."], ["Christopher B.", "the best place in town . the food its just perfect .Fresh Fish , outstanding pasta ! everything its so fresh. the wine list ,  the service its really amazing like in a luxury resort . the view cant be any better. i really love everything about this place. they really make you feel pampered here. highly recommended"], ["Kay P.", "Came here for a birthday dinner with a group of six. We were seated outside and the view of the water was beautiful! We were immediately served some starters that got us very excited for the main course. Our server was a bit obnoxious and arrogant bossing others around and when giving us the specials he talked so fast that I thought he was telling us about one item when in fact it was ten different items. I had the Capellini all'Arrabbiata which was good, but a little bland. I was expecting a lot more flavor. The rest of my party said their food was amazing. Before we left, a small cake was brought out with candles so stiff they looked like they were cemented in. Before the final words of Happy Birthday was sung, the cake was whisked away and as we waited for the bill, we inquired about the disappearing cake and was told it was just for appearances. LMAO I've never heard or seen that before. How bizarre! Was a little tacky to me.All in all we had a good time and will return."], ["Anita G.", "It's very hard to give this place only 3 stars when the service they provided me there was outstanding. 1 mega gold star for service. My 3 girlfriends and I got treated like royalty there. From our waiter, hostesses, busboys, great job! Didn't even feel like we were in Miami since mostly everywhere here the service is horrible.1 star for food portions (big).1 star for the view.One missing star for quality of the food :( my friend branzino (fish) was chewy. My other friend's veal was too salty and tasted old too and my gnocchi was over cooked :( the only good thing was my other friend's risotto. Another missing star for the decor of the place. Old and outdated.And that's all I have to say about that ;)"], ["Yisel F.", "A lovely setting for a romantic dinner.  Came here for bf's bday.  The food is amazing!  The atmosphere is classy n just quite lovely.  They have a great selection of wine.  I ordered the lobster ravioli that came with pink sauce!  Omg, it was incredible. The best Italian dish I've EVER had.  Even beats the Italian dishes I've had in Italy.  I give the food and the place 5 stars but I'm knocking down the rating for what happened at the end. Let me start by saying it was all great. They brought out zucchini, bread, and bruschetta which were delish and they even gave our small party delicious complimentary shots at the end.  The only thing that turned our celebration sour was when they brought out a \"cake\" to sing Happy Birthday.  I've never been here so didn't expect what we got next.  Everyone was very excited and my bf blew out his candle and as soon as he did, the waiter picked up the cake and said it was just for show, we have to purchase the cake if we wanted it.  I couldn't believe what had just happened!  First of all, if they would've mentioned that when I called to make the bday reservation, I wouldn't have even thought twice and would've gotten him the cake.  It was the way they came across... Classless for an upscale restaurant and frankly quite rude.  To mention such a thing in front of him and the party is beyond me.  They should've just given a small scoop of ice cream or anything super small that's edible with the candle.  The bad review is for our unexpected experience at the end of our dinner!"]], "MC Kitchen": [], "Spaghettino": [["Leo L.", "Really slow service for so so food.  And it wasn't even that busy. Not worth a return."], ["Alicia W.", "This is absolutely one of my favorite restaurants in Miami. The food is excellent and the customer service is impeccable. There aren't many places in Miami where you can find the kind of service like they provide which is why I go out of my way to eat here whenever I'm craving Italian. You've got to try the Chicken Parmigiano and the Spaghetti with Sausage/Meatball combo. These 2 entrees are to die for. Don't forget the Mozarella Sticks.... they're AMAZING!"], ["Mel H.", "I love this place. Whether I dine there or get delivery, it's always consistently great.Their Caesar salad is always great. Their mozzarella is always crispy and hot. And my favorite meal ever, Chicken Francaise is always on the money.Thank you Spaghettino!!!!"], ["Milana Z.", "Soooo delicious! Nice atmosphere. I had burrata and lenticcie soup- fresh, amazing and very tasty. Love this place. Highly recommend"], ["Krizzy B.", "This place is two blocks up and literally a right and boom we are there, from my job.This place was designated for our holiday luncheon. You are greeted with a lovely lady in the front with a smile and a gentleman opening a door for us. Staff: Friendly, Fast, and Pleasant. The Setup: There is just something odd of the way the seating is, like it is long instead of a little wide. Giving off little room. The lighting is a little odd as well, some dark areas, some light, it did not seem even. Food: Ordered The Pollo Parmigiana. At first, the pasta resembled Mac & Cheese, the thickness and the color. However, awesome tasting, I couldn't finish it all. Even though I wanted to. Desert, Italian Cheescake, yummy! Their food presentation is elegant. Price: I am sure it is a little pricey, but it is gourmet food. You will enjoy."], ["Jeanette H.", "Back here again- my neighborhood gem in Brickell. I gave an extra star for consistency! Service & friendliness of the staff are consistently great.  They know when to leave you alone and when to be alert.   Quality of ingredients and execution great.  Pasta - my fave linguini del salvaggio- with fresh mushrooms, spinach, sun-dried tomatoes w/ chunks of garlic in a garlic sauce... I asked for extra al-dente and came out as such.  Check-in w Yelp and get a free glass of wine!"], ["Darryl I.", "Came here as it was near our hotel and there was a Yelp voucher for a free glass of wine.  Nice one Yelp!Really great service. We talked with the manager Kendall as he was helping with the Yelp voucher - he was very helpful.Food was good - What to expect in an Italian restaurant.  Lentil Soup was so so and pasta tasted great, really seasoned well.They have free wifi and really close to all the businesses on Brickell road."], ["Martin L.", "I'm very hard to impress! I'm picky about my food, drinks and atmosphere. Spaghettino is the real deal! Great food and I love their mojitos!!! I highly highly recommend this place. The Tuna Tartar is the best!!! Prices are worth the pleasure you will experience."], ["Jennifer V.", "I love the food!!!! I always order online.  They deliver quickly and never forget anything.  I really like their Italian dishes,  the pizza, and their tiramisu is awesome!"], ["Thomas S.", "Mediocre. That's really the best way to describe the place.The food, average.The ambiance is terrible, it's essentially a to go restaurant and they have  DJ playing club music. The 4 star Yelp reviews and $$ made me want to try it - but it's just average and the prices are actually $$$.Servers were nice, but mediocre Italian at $$$ = bad."], ["Crystal H.", "This place has gluten-free pasta which you can substitute in any pasta dish! The service was very good, our waiter was very friendly and attentive."], ["FJ S.", "Excellent Happy Hour that runs until 9:00pm M-F which is rare in the Brickell area.I've been here twice, both times have been memorable for the food and service and the Meatballs are amazing!The prices are very good given the location and quality of food.Overall, 4.5"], ["Karissa D.", "The moment my friend and I walked into the restaurant, we were greeted kindly and were seated right away. No wait, which was wonderful. It wasn't too busy since we came past the dinner rush. The server, waitress, hostess, and even the manager checked in on us and we're very efficient, it was like they read our minds on what we needed! The food was delivered in a short amount of time and was amazing. I had the lasagna and it was soooo good- hot, fresh, cheesy goodness! I so got the Profiteroles which was an amazing combination of a light, crisp eclair with ice cream inside. I will definitely come back whenever I'm in town!"], ["Melissa K.", "I work in the area and came here for a team luncheon after a meeting on June 15, 2015. Overall the restaurant seems pretty busy during lunch. A few of us ordered pasta and tortellini, which looked quite nice and tasted good. One colleague had a salad topped with some kind of cooked fish, which was a bit smelly. I had unfortunately ordered the Di Tonno Rosso, which basically was \"Ahi\" Tuna on some greens. Well, I was up for an experience with this plate. I left the restaurant feeling as usual for the first 30 mins and then had to quickly be driven to the Baptist Medical Plaza in Brickell. My tuna was definitely not fresh and/or improperly stored and not safe for consumption. I had to undergo an emergency treatment at the hospital and felt horrible.If you go here stick with pasta. I would avoid any form of sea food, fish or not fully cooked meat."], ["Julio L.", "Positives: i really enjoy the food here and order in several times a month. Their Pizza Parma is amazing and one of the best fresh tasting pizzas you can have in Miami. Just the right amounts of sauce cheese and meats. Great pizza to enjoy with some red wine. I also enjoy their pasta which I have ordered about 5 different ones."], ["Melissa S.", "This place is extremely close to where I live and I really wanted to love it but I don't think I'll be ever going back. I've been there 3 times because again, it is super close and they have good deals on various days of the week (lobster day, pasta Thursday, etc.). The pasta is watery and does not taste homemade. It is also over done and not perfectly al dente as good Italian pasta should be. The chicken is tasteless and the vegetables nothing special. The service is also painfully slow each and every time, even when there is no one else in the restaurant. The place is trying very hard as I always see the owner recruiting people from the street but honestly, if you are in the area, you will get significantly better food at Perricone's for about the same price so why ever go here? Yes, there is never a wait here and frequently a line at Perricone's but doesn't that say something?"], ["Jim R.", "Great pizza. Great service and very fresh salad. Great place. Good people. Try this out"], ["Seffrina H.", "This is the same owner as Carpaccio in Bal Harbour with the same menu and quality of food. I've been there twice and the food is identically impeccable ! The lobster with linguine and pink sauce is the best in Miami! The pasta Bolognese is fantastic and the beef meatballs are perfectly seasoned and huge! Brava  well done! The waiter and waitresses are always sweet with us!!  Perfect Brickell location !!!"], ["Cynthia B.", "I came here for my birthday and had a nice experience.  Food was good, the wait staff and manager, Kendall, were very nice and provided good service.P.S.  I like coming here for happy hour on Fridays for a nice glass of wine and relaxed vibe (you can actually have a conversation with friends and not have to talk over music) but I'm confused as to whether the drink specials are only inside or what?  They use to be till 11pm regardless of the area you sat in.  I would hope that with the coming weeks of beautiful weather, they extend it to the outside as well."], ["Tiffany C.", "Dined at this restaurant several weeks ago. My boyfriend and I had originally set out to eat at another Italian restaurant for their Thursday special but when we realized how long the wait list was, we left and came here. I'm really glad we did. The food was delicious. The service was also very attentive. We had the burrata cheese which was very good. We enjoyed it so much we decided to order delivery through eat24. Looking forward to dining here again."]], "Vapiano": [["Jen R.", "Came to Miami for a cruise and stopped here because the yelp reviews were so high.This place definitely didnt disappoint. Its inside a hotel, but the patio outside was really inviting. When walking you are given a tap card, and with that you can keep track of all your order. I ended up getting the Carbonara, which i like extra garlic and added some broccoli for a buck. The pasta was so creamy and delicious, and these Chefs really work for there customers. Overall- if I am in the Miami area, I will be sure to bring back family and friends. The music is good, the ambiance is good, and the price is amazing for  what you get. ( please share) we ended up with too much food.  You will be happy you came."], ["Antonio R.", "Fast Italian Food done right, but not perfect. My first time coming here, the whole pay-by-card concept was a little complicated, but since I came at a late hour, with little people inside, I quickly got the hang of it. It goes a little like this...Pick up your card when you walk in, read the menu, visit the designated station of your corresponding order, Tell the chef your order, let the chef scan your card on one of their machines, and voila.I Ordered a Granchi Di Fiume Pasta. You get to choose the type of past you want too! I got Spinach Ravioli ($3 extra) and a Side Caesar Salad to accompany it. My pasta was a watery, salty, buttery mix. It definitely wasn't the best thing in the world, and for nearly $18, it might have been a little too expensive for what it was, but I liked it. The Caesar Salad was incredible on the other hand. This self serve system leaves room for improvement too. Getting a glass of water from the bar can be a chore. And there should be at least one or two waiters walking around to check on everybody. Also, if you order pizza or a salad, they give you a pager to wait for your order. With Pasta, you tell the chef what you want and how you want it as he does it. He'll cook it in under 7 minutes tops.I really like this place. I'll pay another visit If I'm ever in the mood to eat a quick pasta, which sounds weird when I think about it..."], ["Paul W.", "A co-worker took me here for lunch, and while I thought it was a cool and interesting concept, at the same time it feels a bit disorganized, especially for first timers.We arrived and the woman at the register handed me a charge card, and explained that this card would be scanned each time I ordered something. After I'd eaten, I'd bring that card back to the register and pay for all items that were scanned or charged to it. Great, but that's about all the direction I was given, and once I left the front desk, everything was a bit disorganized.  I saw lines of people, but no real explanation of what you would get from each station, why they were waiting in line, or what the process was.  Luckily my co-worker explained everything to me a bit more thoroughly than the staff did. I looked at the menu he gave me and decided on the bruschetta pizza.  I went to the pizza guy (there was no wait for pizza, but there were lines 4 or 5 deep at each of the pasta stations), he took my order, told me to scan my card, then had to show me exactly where/how, then had to do it for me as the machine wasn't working correctly.  He told me to take a pager from the docking station which would alert me when my food was ready; I had to spin the pager around a few times as he attempted to see the number to program it into the point of sale machine.  In all, it just didn't feel like an intuitive and straightforward process.   While waiting for my pizza to be ready, I made my way to the bar to get a bottle of juice.  The woman there was a bit more helpful, but after she entered the info about the juice I bought, I had to excuse myself and try and weave through 3 other customers to get to the end of the counter where the point of sale machine was located so I could scan my card.  Again, a bit awkward.A few moments later my food was ready, I picked it up, grabbed silverware and was off.  The prices were fair; it was $9.95 for the pizza and $3.50 for the cranberry juice. Based on this experience, I'd give this place a solid 3 stars.  4 stars for the food and the general concept which is unique, but 2 stars for the cumbersome, unintuitive and somewhat disjointed process with ordering and the charge cards.  With maybe a bit more explanation and some signage for the newbies, that might cause me to raise my overall rating."], ["Natasha M.", "Love the vibe here. Pasta really isn't my favorite thing to eat but having visited the location in NYC, I wanted to give this place a try. My penne arrabiata was delicious and I was struggling with my inner self about finishing the entire bowl. I really wanted to, but I had a bathing suit to get into the next day (the struggle), so I finished up my salad (which was also delicious)."], ["Alejandro F.", "Excellent taste, excellent system very different from what you are used to, but very convenient and easy to use, food very authentic and fast !!! Free parking bring your ticket !!"], ["Cassie G.", "My first question is why don't more places function like this?It seems so simple: walk in and grab a card, head to different stations (think salad, pasta, pizza) to construct your meal, sit down with friends, enjoy, and pay on the way out! Unlike a traditional cafeteria, you can take your time and order dishes (and multiple drink rounds) without having to close out each time. We started at the bar where I got what they described as an \"Italian mojito.\" It was alright but I prefer the glass of house red I got a little later. These, along with Peroni on draft, were on happy hour special for only $3, even at 8pm on a Saturday. I knew I wanted pasta so went with a seasonal special, the pasta vitello, but they were out of its namesake veal, so I got beef instead. You can pick the type of pasta you get so I chose parppadelle which I thought would complement the sauce well. Wow! Within minutes they whipped it up in front of me and it was a hearty portion of pasta and sauce that I simply couldn't stop devouring. I also got a side salad which I'd order next time but with the dressing on the side as it definitely drowned the lettuce. And the cheesecake... Oh man, the cheesecake. It's arguably my favorite dessert in the world and this was pure NY cheesecake that reminded me of some of the best slices I've had in the city. With a little bit of a strawberry drizzle and cut strawberries scattered on top, I was in heaven. I honestly didn't expect to like this place as much as I did. I'm usually not one to dream about pasta but oh man, I can't stop thinking about returning!"], ["Jess M.", "Overpriced, non-authentic, unsavory Italian pasta -- didn't try anything else because you have to carry your food back-forth to your tables.  While the location and restaurant is beautiful, that's really all it's got.  The pay-by-card system is also disorganized and highly flawed especially for big parties.  Only one card was given to my party but at check-out cashier accused us of losing cards because \"Everyone was given a card.\"  When he realized he only gave us one card, he didn't even apologize.  We left a nice tip, but we definitely will not be coming back."], ["Brian D.", "Great service. Great management. They worked with us to create an amazing birthday party for my teenage daughter in the upstairs mezzanine. Solid food. Reasonably priced. Casually relaxed yet high quality food. A definite must go. Lunch or dinner."], ["Mariangelli A.", "Their best assets are the staff. Always smiling always willing to help. Must try beef carpaccio, for me is the best on the menu. Oh! The tiramisu is also great !!"], ["Fabiola F.", "I love this place. The food is awesome!!! Service and environment are excellent too. We were heading to watch a show but before we decided to have some great food. We got surprised by the great food, customer service and how fast the food is ready. You must come! I ordered a carbonara pasta and it was super yumm!!! My sister had cesar salad and the chicken was wow! And the rest of my family ordered prosciutto pizza which was awesome too. Their food aren't that expensive and the portions are perfect. Love it! I would totally come back!!!"], ["Nicole R.", "This place was fantastic! Great atmosphere and the food is fantastic. I got the pasta arrbiata with Italian sausage and a side Cesar salad. Oh my goodness the pasta was just the right amount of spicy and the Cesar dressing was fantastic as was the fresh shaved Parmesan cheese and baked croutons . I would definitely recommend this place if you're looking for a trendy place with fabulous food that won't break the bank."], ["Liz L.", "So GOOD!! I remember I first tried Vapiano in D.C. years ago and my wishes came true when they  opened this location a little while ago. :) I just love the concept. You get a card upon entering and all orders are uploaded on your personal card. You pay at the end.  It is kind of an upscale cafeteria style spot. There are particular stations for pasta, salad, pizza, etc and you go to the line of your choice. There are delicious menu items or you're free to tweak menu options or create your own dish.  You can interact with and watch the chefs cook.   :). Everyone in our party ordered pasta dishes and dessert( tiramisu) and it was all delicious.The ambiance is trendy, fun, and open. There are trees and plants right next to tables, as well as candle lit booths and an up stairs area for more intimate dining.There is a full bar, desserts,  and of course,  free gummy bears on the way out.Its probably a good thing that this restaurant is not right next door to me, Or I'd be carb loading on their delicious and freshly made pastas and pizzas every day. Maybe throw in one of their salads once in a while ;)Parking in Brickell is usually a pain but there is a free 2 hour validation in the parking garage connected to the building that Vapiano is located in. So.Awesome.Looking forward to my next visit!"], ["Hortensia A.", "One of my favorite new places for affordable pasta and everything under the sun. The concept here is very cool. You walk in and are given a card ( like a charge card ) per person. Then you continue into this very chic yet a bit rustic atmosphere that immediately invites you into your eating experience. You can start at the antipasta station and try the steak carpaccio. It it absolutely delicious, delicate, and light. After you have wet your appetite, you can waltz yourself to one of the cooks, who you will tell which sort of fresh (homemade) past you would like, and the the of sauce you will drench your pasta in. The cook will immediately drop your pasta in boiling water, and before your very own eyes, develop a delicious sauce custom made for your pasta. If you like a little spice, or a lot, you will be there through the process as it's made. If you've ended your delicious meal and card for coffee of a drink or dessert, they have a station for those too. You will swipe your card at each station and pay on the way out. It's kind of like a high end cafeteria. At any rate, remember to tip on your way out before digging for some complementary gummy bears. Enjoy !"], ["Christina Z.", "This place is awesome! I loved the concept, the music and the ambience. The restaurant is gorgeous and the food spectacular. I had chicken carbonara and it was really yummy!"], ["Melissa M.", "I just moved to Miami from NYC, and was a regular at the Vapiano in Union Square. I was so excited to find out that there was a restaurant in Brickell near my apt. Just as amazing as the New York location! I had the tagliatelle bolognese and it was delicious. I will certainly be back soon."], ["Jiten S.", "This place is as spectacular as its reviews suggest. amazing pizza and pasta bar set ups and preset menu options.Make sure you voice any customization requests you have."], ["Madeline M.", "An out of the ordinary dining experience with a twist. Pleasant ambiance, moderately priced. Great for gatherings and nice bar for happy hour! Tasted the new Shanghai dish and loved it."], ["Jeremy F.", "This place is a real gem. Casual but nice. The Pasta is incredibly good. I also got a drink at the bar. Bartender Carson is a super cool guy. Very easy to talk to, personable yet professional. I really like everything about this place.  Contrast this experience with my terrible \"My Ceviche\" experience a few blocks away. The comparison between the two being local \"casual\" spots stops there. The quality, service and price certainly weighs in Vapiano's favor."], ["Puja B.", "Came here again and had ravioli funghi and tried their pizza and tiramisu. Really good, convenient and well priced. We'll be regulars!"], ["Maurice L.", "Love the concept, the food is pretty good.  Desserts are not very good or creative by any means. Everything else is made to order which is what i think makes this place good and unique. Very affordable (inexpensive). The only reason i didn't give it 5 stars is because I like desserts, and they just don't really have any!"], ["Dion-Marlon B.", "Amazing pizza and salads. This might be some of the best pizza in Miami. I'm from NYC! The protein portions on the salad are way too small, which is why I gave the 4 stars. The gummi bears are awesome!"], ["Dorothy R.", "Love this place! Just wish menu was a little bigger. Hostess is very nice! Walked in without reservation"], ["Kai B.", "Finally, a real 'European-style' restaurant in the US. And it is as good as their spots in Europe. One thing I missed, the Homemade Tomato-soup. No problem, because everything on their menu is great!I tried their new Risotto, but they have to work on it. Was a bit overcooked, but still beter as a normal American-restaurant (sorry about that). I cannot wait for our next visit (will be in Europe this time)."], ["Melissa S.", "I have probably been here about 10 times and I love it each time! Before going here though, you need to have reasonable expectations. Each person is given a card and you order your food made to order cafeteria style by waiting in line at different stations. Then you collect your food and your party has a table. You swipe your card to pay and pay on the way out. It is both good and bad for large parties. You will spend a lot of time separate in the beginning while everyone is separately getting their own food and you are taking turns watching the table. However, it is great in that when you leave, you only pay for what you order so you don't deal with the catastrophe of splitting a large bill at the end and some people over paying. The food is consistently very, very good. It is not gourmet and out of this world but very solid. My favorite is the pesto pasta, the goat cheese and strawberry salad, and the margharita pizza. I have decided that adding protein to the pasta is not worth it since they do not give you a lot for the price. All the water is infused with fruit which is excellent of course."], ["Jessica B.", "Oh boy i was pleasantly surprised, came here last night with my hubby and best friend.  Loved the ambiance, the decor, the service staff was really friendly.We shared the ceaser salad, the greek salad, the mushroom brushcetta, then the pasta scampi and the carbonara.  All the pasta was really light and flavorful.  For dessert my bestie had the chocolate mousse and she loved it.Free parking at the building behind for 2 hours."], ["Ozzy M.", "Interesting place, different.I've only been here for lunch no parking which is typical of Brickell, and I've only had the made to order Pizza which was very good.My friend had the pasta which looks very good.Will come back for dinner and report back"], ["Nadya G.", "This place is Amazing!!! They make pasta there in the restaurant then they cook it I front of you, and you pay around $10 ! This is insane)). I love it)) salads are great too , pizzas are ok! No waiters so no waiting time for business lunch is perfect !"], ["Suny R.", "This is a great \"fast food\" place. Pasta is very fresh, food is cooked to order and you can't beat the pricing. Everything from the pastas to pizzas to salads are so well priced and filling! If you want quick quality food - check this place out. Oh and not to mention the very reasonably priced bar selection and Happy Hour specials!"], ["Gabriela I.", "I walked in and I didn't know exactly how the place worked. One of the host. Explained to us and he was super friendly. The vibe is amazing, it is definitely something different, the environment, plants around you and the food not to mention was amazing and it is brickell, nothing better than that. Definitely going to be coming back here again!!"], ["Michael H.", "When we walked in, I really wanted to like the food. I really liked the ambiance, the concept and the price. Everything feels very natural (the decor is mostly plants like basil that you can actually eat) and I really like that feeling. The hostesses and the chefs were all very friendly. There were no lines at the pasta station or the pizza station, but the pizza does take a lot longer to cook. We had the pesto pasta with chicken and the garlic tomato pizza. Both tasted great and you could tell it was freshly made. So why only 3 starts. First, as I write this the next morning, I have a terrible stomach ache, probably because the food was so oily. The pesto pasta was literally floating in oil. The pizza was also greasy, but no where near the amount of oil as in the pasta. I would definitely try a different dish next time as I know pesto is oil based, but it really needs to be lighter. The other complaint is they need to improve their craft beer selection. I don't want to drink Heineken or Bud, they just aren't tasty. I don't even care if it's a dollar or two more, they need to have the options."], ["Janexis R.", "Came here for my 21st birthday had an amazing dinner and the happy hour was good. Great pasta, ambience and drinks ! Whats not to love ?"], ["Cristina P.", "This is one of my favorite restaurants. They prepare the pasta right in front of you, and ask you whatever ingredients you want to add. The food tastes amazing and the service is very good. Perfect place for a quick lunch"], ["R P.", "Excellent food. Pastas are made right here and you can get your pasta any way you want it."], ["Sabrina F.", "Happiness is actually spelled P A S T A This place is great,  it's casual and cozy and very nicely decorated. The staff is always nice and friendly.  They have everything from pasta to pizza even salads! The food is cooked right in front of you and it's delicious! Try their spaghetti bolognese with a little of the spicy stuff, tastes even better the next day if you can believe it. Their bbq chicken pizza is also good and today I had their pomodoro spaghetti with spinach mozzarella and parmasean so so yummy! The portions are huge so it's great to save some for another meal especially if you go at lunch and plan to stay awake the rest of the day lol. I've never tried their desserts but they look yummy. On your way out they give you free gummy bears and honestly you can't go wrong with that! Check this place out if you're in Brickell!"], ["Marvin A.", "Upon arriving the place is very cosy, low lighting all the employees are dress according to the restaurants color scheme. We we're greeted and given these card that keep track of your orders. Simple yet genius, you go up to the cooking stations pick what you want. Swipe your card and that's it. Our server Carlos was very attentive, we began with the carpaccio.Very fresh and the cipriani sauce was out of this world. For the main entree I selected the Pizza Americana. It was pretty good, thin sliced packed with a punch of flavors. My girlfriend selected the chicken Alfredo, she gave me a bite and it's was yummy. In conclusion I give this restuarant a 4.5 because although the place is very nice and the price is more than fair I felt that the pizza and pasta fell a bit short of great. However we will be going back!"], ["Madeline A.", "Use to go here when I lived in DC. Love that it's in Miami. Although the location is out of the way if you're not in walking distance.Parking is a nightmare/expensive. But the food is delicious. Not a place for groups. But good for a quick bite or catching up with friends."], ["Rory S.", "Last time I was at a Vapiano's, I was in Warsaw.  So glad they're bringing this excellent, fresh Italian food Euro-chain to the states and so glad they started near me in Miami."], ["Andre S.", "Besides the fact that the style of service is not only unique but refreshing, the food here looks and tastes amazing. The ambience is relaxing and inviting to groups, the furniture is welcoming, and the service is friendly. Would I come again? You'll see me here next week."], ["paige j.", "Great selection, concept and good food. The service and food are ways consistent, prices reasonable and allow for a variety of tasty options. This is one of my go to places in Brickell."], ["Olivier S.", "Fresh pasta, they make their own pasta and prepare it on front of you. You can't go wrong. During the week you can find a lot of people here on lunch from work, all in business attire, nevertheless it is still a laid back restaurant with decent volume for the music"]], "Primo Trattoria Italiana": [], "Bin No. 18": [["Ute L.", "My fellow yelper's reviews prompted me to purchase a Gilt City dinner for two voucher for Bin, with somewhat high expectations. Unfortunately, I really don't get what the hype is about. Between the mediocre service, high prices, small portions and hideous decor, this place is simply below par.We made a reservation for Saturday night, which was a good thing because the place was booked solid. Upon walking in, we stood at the entrance for a minute or two waiting to be helped. Two waiters walked straight past us without so much as a nod or a simple sign of acknowledgment. I finally walked towards the bar area in the back where someone helped us get seated.The pinot grigio we had was nice but the cheap baby wine glasses took away from the experience. Come on, you call yourself a wine bar, you need to do better than serve wine out of picnic glasses.The salmon tartar starter was tasty, no complaints here. But then the entrees took forever to come out.The entrees come in either full or half sizes. We ordered the full size, which was very small, so makes me wonder what the half looks like. My scallops were nicely seared, so was the creamy polenta. All in all the food was tasty and I like the fact that there are several vegetarian options. Dessert was once again disappointing. There are only three choices, the best one being molten chocolate cake a la mode. Well, lets just say this molten chocolate cake came out of a freezer box and the ice cream was cheap as well. Not worth it.The kicker was when they added $22 gratuity to the bill, based on \"the value of the dinner voucher\". They are off their rockers if they think a bottle of cheap wine, one appetizer, two teeny weeny entrees and a single frozen dessert are worth $120. I want some of whatever they are smoking."], ["Tiffany S.", "We absolutely loved the food here! Came on a Friday before it was too busy, and got a table right by the door. Make sure you order the brie fundido -- it was amazing. The garlic infused honey was the perfect touch. The lamb and feta meatballs were also tasty, but stood in the shadow of the brie. The best was yet to come though, with the Fagottini Di Pere -- pear and cheese pasta. Sounds like a weird combo, but it was to die for! We finished our meal with the chocolate souffle (5 stars) and the key lime pie (2 stars). The atmosphere was so-so, it would benefit from some fresh paint and music."], ["Lauren R.", "A nice alternative to fast food or mediocre plates from surrounding establishments.  We came here as a party of four looking for a place to enjoy some eats and a few drinks on a Friday night.  We were pleasantly surprised that there wasn't a wait since we didn't have reservations.  You can make reservations online through their website and they will Email you a confirmation.  Our party ordered a total of 6 appetizers.  All of them were delicious.  The warm brie with honey and butter was rich and might be a little heavy for only two people.  I really loved the octopus.  The salad that accompanied it was perfect.  We will definitely be back here to try out some other tasty bites."], ["Nick Z.", "I'm not much for words so I'll echo the words of the guy seated near me at the bar:\"This food is insanely delicious.\"\"This is the best beer I've ever had.\"I opted for the Tablas menu and two cheeses and three cured meats. All delicious."], ["Tommy T.", "We had a wonderful evening at Bin 18!  I am not much of a \"foodie\" but I was taken-aback by the amazing combinations of flavors. The Scottish salmon is divine. Double thumbs-up for Bin 18."], ["Rob G.", "want to go back..."], ["Bert G.", "Original food and delicious! The appetizers are all well priced, the Cuban Melt is awesome!"], ["James H.", "Where can you get a fresh Mediterranean fish served in the same pan where it was cooked??? In the coasts of Sardinia and this place! I was amazed at the freshness, combination of flavors, herbs aromas, etc. Amazing!Then finishing my meal with a dessert made in-house, plus a really delicate selection of wines at a really fair cost.Don't know why It took us so long to come to this little, roughly elegant spot. Back for sure!"], ["Lina T.", "Food was great! Hard to find parking, but it is wynn wood so I understand. I had the best scallop I ever had. The apricot beer was delicious. Had a great time with my husband."], ["Andrew P.", "Every dish I've tried (warm figs, beef carpaccio, pear pasta) was excellent, but the artichoke carpaccio was the best."], ["Juliana G.", "My hubby and I headed to Bin No. 18 for the Gilt City Special.  We had reserved expectations and full bellies from our huge meal the night before (Ok, I didn't have a full belly, but he did, he is still a rookie). The Gilt City Special allows you to choose one appetizer, two entrees, one dessert, and a bottle of wine.  Our server told us that they were out of some of the items on the menu, so we decided to order the peruvian ceviche with sweet potato, and mango chutney with honey. It was a new item on the menu and we hope they keep it. The combination sounded strange, but the potatoes actually went with the ceviche quite well and the ceviche was fresh and spicy. Since I normally have appetizer, entree, and dessert as a warm up for my meal, we also ordered the tabla, where you choose cured meats and artisan cheeses. You create your own tabla with 3 choices for $22, 5 choices for $34 or 8 choices for $48. We chose the latter (of course) and asked our server to choose the ingredients for us.  He did really well by selecting four meats (bresaola, prosciutto di parma, jamon serrano, and chorizo), as well as four cheeses (pecorino tartufato, manchego, brie, and parmeggiano reggiano).  They come with artichoke and truffle mouse, fig and port jam and anchovy mouse (instead of olives, which we don't like).  They were delicious and it was really nice to try each meat with each cheese to find the best combination along with the spreads.  The tabla alone makes the whole meal worth it and we would go back just to have that with a bottle of wine. For his entree my husband ordered the 1/2 chicken which comes with artichokes, arugula, sun dried tomatoes, and olives (which they happily agreed to leave out at his request. We really don't like olives).  I tried a bite of his chicken and it was crispy outside and moist inside. He can't tell me whether he liked it or not because by then he was so full he couldn't eat (rookie). I ordered the ravioli bin no. 18, which comes with brown sage, truffle butter, tomatoes, and toasted almonds.  My cleaned out plate was testament to how good this plate was. I had never had toasted almonds and pasta together before. The almonds went really well with the cheese and truffle butter and they added a nice crunch to each bite. I confess that I had to take my dessert to go because I was very full. Of course, I ate my dessert (key lime pie) while writing this review.  It was just sweet enough and the crust was crumbly and crunchy.  Really good and I finished the whole thing. Meanwhile, the chicken is seating now in the fridge waiting for my 3:00 a.m. cravings to kick in :) In short, this is a nice place with good food and friendly service. Nothing fancy, but we'll be back and will make sure to tell our friends about it."], ["Marni M.", "It's my second time here...the first time was a bust because I was pregnant and couldn't eat all the lusciousness I wanted to try. This time, I have an 8 month old in tow. We came super early, because that's how we roll now, and had the cheese/meat plate (charcuterie if you want to be fancy). The portions were huge. Really. Huge. The meat and cheese selections are standard, but reliably good. I could do without the truffle oil in the artichoke souffle. The taste was haunting me hours later. We sat outside because the baby prefers it. I don't suggest it if you want to be romantic. Next door is a dog kennel, and they bark incessantly. Watch out for the flies, , too. They really don't care if you want them off your beautiful pile of prosciutto di parma. No. They come back with reinforcements. Not really Bin No. 18's fault. I hope to return again for a more adult night, and try the entrees."], ["Alex D.", "Love this place! Good food and interesting wines."], ["Steven C.", "Wow! I loved this place. Me and sugerfoot went on a Saturday night and left extremely happy. Great beer selection. The fig dish is a must. The lamb and feta meatballs was a close second. We also had (in order of best) the salmon tartare, chocolate molten cake, caprese salad, and the beef carpaccio.  I can see parking possibly being an issue. They have a free lot behind the building but it's small. Service was great! Try the Palm Beer from Belgium."], ["Matty A.", "This place is fantastic. Roasted salmon was choice. My friend had the chicken and was also impressed. Will for sure come back!"], ["Diogo M.", "Nice place! Vegetarian dishes available! :)"], ["C K.", "great service, found us a great wine.  Portions for the five plate were perfect for three people.  Their eggplant bruschetta  wasa perfect start.  I will go back to try more.  This is my second time, my friends fifth time.. does not disappoint. One friend said worth the drive from Fort Lauderdale.  Great meet up place for friends or lovers.  You can actually talk to each other, no loud music to shout over."], ["Lauren S.", "This is definitely a hidden gem.  The food is to die for.  The staff is always excellent.  I have never had a bad meal here.  Ever.  The pork belly that they sometimes have on special is out of this world.  I wish they would add it to the permanent menu.  It's crave-worthy, mouth watering, you need this in your life. Mmm pork belly.The appetizers: Fig appetizer, the lamb meatballs, the octopus salad- all heaven.  I''ve had so many different meals from Bin 18. I have yet to be disappointed.I am the type of foodie who orders one thing on the menu at restaraunt and I always stick with it, because I am extremely picky and have a very particular palet.  Not here.  Here I can't narrow it down to just one.  My husband and I always share our plates.  You definitely can't go wrong here."], ["mairi g.", "My husband and I went yesterday at 6:30p and they informed us it would be at least 1 hour before our food would be served. Yet they had several tables available. All we wanted was a few appetizers. Very disappointed."], ["Nemer A.", "I have dined here 3 times. Each night was pleasant. All food is gourmet. Nice waiters. Not to full. parking along the street and gives you a nice walk holding hands. Cozy. great date place. Gourmet food, especially, if owner Andre is there. I like the churrasco. Not too pricey. Last time I was there, I was entertaining out of town guest and they loved it! Had two bottles of wine, one appetizers a 4 entrees (churrascos) for about $150. Cant beat that at a gourmet place. Thats what Im talking about."]], "Toscana Divino": [["Grace B.", "A group of us from my Master's program (15-20 people) were able to arrange a package with the restaurant that was affordable for everyone. The fact that the restaurant was able to cater to our needs as a group and give us fair pricing was remarkable for me, and I wanted to tell them Many Thanks!We had unlimited wine tasting, unlimited appetizers and then delicious risotto and pasta. Miguel was the wine expert who explained to us the different kinds of wine and from where they came from. You were able to try the red wine and the white wine. The ambiance was great, it is located in Mary Brickell Village. Everyone was able to catch up and enjoy a wonderful evening thanks to the great staff from Toscana Divino. I cannot to come back and have a proper meal. But if it was anything like the other night you've won me over!"], ["Henry A.", "NPS = 5A bit overpriced for the food and ran out of the special we were particularly interested in for the evening.  I get it.  It's Mary Brickell Village and the rent is expensive.  But man...these guys really love the margins.  Talk about squeezing.We went for the $1 oyster specials.  Unfortunately, they had run out of them for the evening but we decided to stay for dinner anyway.The food was good, but the place was a rather madhouse with music BLASTING.  Note:  do not go to this place if you are expecting a romantic dinner.  The ambiance will teleport you back to a Miami reality full of 50 year-olds having a great time jamming to Gloria Estefan classics.Another thing that ticked me off a bit was that we were promised $8 appetizers and instead had to pay the full price.  I even asked the waiter if there were any other specials and the waiter said , \"No.\" Wish the would have been better informed of the specials for the night.Sigh...anyway...it was a bit of a disappointment."], ["Elisa M.", "I came here for lunch with Miami spice, and left disappointed.The atmosphere and music of the restaurant was nice and romantic.My hb starter`s was so tiny that I felt ridiculous (tagliere), just a small rubbery bread with a few pieces of ham on the top. My starter was not bad (Panzarella salad) but most of the salad was bread croutons, and the vinegar was too strong.The main courses were good, black maccheroni and fish stew (cacciucco), but the mussels on the stew were not fresh and they tasted and smelles too strong.Both desserts had some alcohol in there, which I think is not good since some people might dislike or be unable to drink alcohol! The cantucci + vin sant were 3 tiny cookies and sweet wine, and the other dessert was a cup with a foam made with limoncello (liquor), fruits and milk. Overall, not the place to come with Miami spice since the portions they serve are too tiny for that price. Is not worth it!!"], ["Jim A.", "Although I've had excellent lunches here, this review is specifically for the \"Thanksgiving to go\" meal offered by TD. The price was very reasonable, and all of the food was delicious, particularly the stuffing and pumpkin pie (complete with whipped cream). My only complaint was that we were given a disappointingly small amount of gravy and cranberry sauce, but TD was very apologetic, and even credited my purchase a reasonable amount. (Luckily, it wasn't difficult to make extra gravy from the turkey drippings!)"], ["Janesse S.", "My boyfriend and I came here for Miami Spice deal. We both ordered the Risotto. Buuuut, my boyfriend can't have dairy type products in his meal so the Chef made a special Risotto just for him and it was deliciousssss! The chef really listened to our concerns and delivered. Since it was Miami Spice, I remember it came with a tuna tartare appetizer but it was nothing to write home about. Still, a good deal for the attentiveness and Chef preparing a special meal for my boyfriend. They have an outdoor seating area which is nice, because I like to people watch but I can see where it can be a problem with the huge crowds that visit that Brickell area."], ["Shan N.", "Came here again. And every single time I have come, everything from the food to the service has been consistently excellent. Definitely worth checking out!"], ["Liz J.", "Gave this more stars than I would have since the location, atmosphere, and service was great. Food was delicious as well but the portions were so small that I came home and had dinner again. I'm not a big eater. I usually go home with leftovers. This is an Italian restaurant with French size portions."], ["Sally R.", "Great service, good happy hour, and delicious pasta! The bartenders are friendly and professional. Yuri and Douglas  will really make the experience even better with their charisma and excellent customer service. Food is delicious. so far the sliders, the pizzetta and the duck ragu pasta are my favorites. Prices are average to the Brickell area. The bar area is fun and the restaurant inside is very nice and modern. The outside seating can be romantic at night with candle light and the water fountain near by. Everyone here is s friendly and nicely dressed.Definitely a place to try if you are in the village."], ["Andrea F.", "Delicious food, great service. The bartender was very friendly, very knowledgeable of the menu and super skilled. He improvised a passion fruit spicy cocktail so yummy and hot! The gnoqui and linguine vongole were so good that I'll be  Back Over and over again for for more. Props to the chef, and specially the manager for having such great staff"], ["Lauren C.", "Enjoyed a happy hour at this trendy Italian gem with a few regulars. Kicked off HH with an excellent variation of an Old Fashion. Such a delicious drink. A bit of sweet meets a bit of that 'Jack' hardness. Perfect. The nibs were spot on with the Truffle Ricotta, with Honey, Pepper and tasty crispy toast...couldnt stop eating the ricotta or any of the other bread lying around. It was that delicious! Also tried the Crispy Porchetta (Pork Belly) with Red Onion, Radish, LemonParmigiano, and Micro Herbs. The presentation was phenomenal. I loved the crispy-ness of the pork belly although it was a bit too fatty for me to fully enjoy. Would totally return to this spot and the trendy Brickell neighborhood."], ["Sarah S.", "You would love this place if you really appreciate authentic Italian food. Miami spice lunch critique...Appetizer: Tagliere Toscano (prosciutto w/ house made ricotta crostini) was delicious.Chianti crudo could have had more lemon.Entree: House made pappardelle w/ white pork was delicious. My friend loved her Cacciucco, but I don't like mussels so I didn't order. Dessert: Zuppa Inglese in Alkermes was fantastic! Burst of sweet flavors in your mouth, which included, limoncello, amaretto, and berries."], ["Irina L.", "So glad we have an authentic Tuscan restaurant in our hood.Toscana Divino is always a great time and great meal.Went with my sister Wednesday and dinner was perfect.We ate light. She ordered the roast chicken and I have to  say it was really good. Chicken is not something I would order but I am glad she did. Moist and the veg were divine.I had the risotto with mushrooms and spring onions.So creamy. Fantastic flavor. How did they do that?We shared tirami su for dessert. I will let the picture speak for itself.Alessandro was attentive and spot on. Davide was best busser. And of course Mauro was charming as ever.I recommend this place for business or romance. I was there twice last week so you know we love it."], ["Jacques R.", "This place is well located in Brickell... Nice ambiance and has inside and outside seating.. Managers and service was above average. Food, they really know what they are doing! Last night we had a new \"plate\" pisi with lamb. Maybe the best I've had in US!! Well balanced, homemade pasta.. We also had duck that was also cooked to perfection.. All in all this place is a must for anyone wanting to eat true Italian food. Their wine cellar is pretty good and their wine glasses are also quite nice! (Dont have to bring my own glasses!!).Try this one... Enjoy"], ["Jr F.", "I had dinner with a couple of buddies here last weekend and was very pleased. I had the Squid ink pasta. The pasta was cooked perfectly and the seafood was very flavorful. The highlight of the night was the service we received. Our waiter was very tentative and provided so many great recommendations."], ["Barbara R.", "We ended up at Toscana Divino, because the reservation we had elsewhere was not honored.  I was born in Italy and hate Italian restaurants because they are never the real thing so I avoid them, but we took a look at the menu and seemed very close to the original.The bread was excellent and the rest of the food tasted good too. So why a one-star review?Because we spent $126 before tip and we left hungry! My husband $23 past dish was only 5 small ravioli and my octopus salad was a joke: I stuck my fork in it and all came up at once. And the octopus? Just a couple of slivers to justify the name. The place is nice and the service good, although slow, but Toscana Divino is a rip off."], ["Hazel Z.", "Did not like the place. The tables were very crammed. 2 tables were place right at the exit of the kitchen and the space to get in an out of the kitchen was very tight. unfortunately that is where we were sat because it was saturday and full. because of this my husband was hit in the head with a butcher block. the food was tasteless and very small plates for the prices. I was able to see the kitchen where I was at. there was a stand up fan facing a prep station which is a no no.... because you have all types of dust flying onto the food. then the same runner that just picked up dirty dishes from a table was in the kitchen cutting bread for service with his bare hands, no gloves. I will never go back to this place.resumen: tight space, bland food, no gloves worn by anyone!"], ["Jeanette H.", "Good vibe @Mary Brickell Village and was packed on a Friday night. Happy hours are limited just to the inside bar area, while outdoor dining is very nice. I only got to try small side dishes this time. Brussel Sprouts and Baby Vegetables were very good. Bellini is advertised as with fresh peach purée but it's actually a canned peach purée. Strawberry purée though is the real fresh purée.  Great place to hang out.,"], ["Katy C.", "I really loved this place! everyone was super nice and friendly, the drinks were exceptional!!! Very nicely decorated, good crowd, the appetizers were delicious, overall a fantastic place i would love to come back and enjoy again"], ["Uni C.", "Happy Hour prices and menu are fair but it's till 8pm so definitely extra bonus points there! Service at the bar was okay... He was the only bar tender. Food came out very quickly compared to the wait for a menu. Overall, we had a good time. The ambiance is a nice mix of modern Italian and Miami Brickell flair. Gets pretty packed on a Monday night. $5 for a glass of wine and $8 appetizers. Monday night cheers!"], ["Apurva N.", "My friend and I went here for dinner earlier last week, as our pre-race meal (before the Miami Marathon & Half Marathon). We had made reservations, and were promptly shown to our table by the friendly hostess as soon as we arrived.The waitstaff too, were very friendly and generally chatty. To start, we ordered a portion of the calamari. The calamari was very different that we expected, and very fresh. A bit too \"fishy\" for me, but that's just my taste.As my entre, I had the pasta with the braised beef ragou. The entrees when they arrive, seem like they are very small portions. However, when you're done with them, it leaves you with that perfectly full feeling.. not too tfull, and not hungry.. just right! I forgot what pasta dish my friend ordered, but I remember him saying he liked it too :)For dessert, I had the chocolate crusted tart, which was really fantastic! Overall, although this restaurant appears like a fancy tourist trap in the middle of Mary Brickell Village, it really is a really good restaurant.I definitely recommend it!You should check it out!"]], "Vero": [], "Salumeria 104": [["Johnny T.", "I've never been to Italy. But when I get there, I hope to have some of the same languid food experiences as I've had at Salumeria 104. This is the life. I mean, what's better than a slow Friday night, eating al fresco, drinking wine, talking with a good friend, and eating as much meat, cheese and pasta as is humanly possible?The neighborhood/setting is a bit of a question. The hustle bustle of superbusy NE 1st Ave seems to be at odds with the old world feel of Salumeria 104. But, you can't choose your family. I don't pay the rent, so I am not going to complain about placement. I'll just concentrate on the eating and drinking. And, in truth, it's pretty easy to concentrate. I love when concepts know what/who they are and stick to it. There's no need for S104 to through a bunch of stuff against the wall and hope that something sticks. Not at all. You come here for meat, cheese, pasta, and wine.Meat: any of it. Seriously. Any.of.it. With a name like Salumeria 104, the salumi is serious business. My friend and I ordered the Salumi appetizer and we devoured it. Well, I suppose 'devour' isn't the right word. That seems far too gauche for what we did. We tasted, chatted, laughed, and appreciated the various forms of cured pig that made its way to our plates;Cheese: again, eat it all. The formaggi plate is as much of a must as is the salumi plate. Expertly crafted cheese, specifically chosen to compliment cured meats... this is what you've been waiting for. Go a little off the beaten path and order the grilled Belgian endive salad with stracchino cheese, balsamic reduction and fig. Your mouth will be your new bff;Wine: any... you get my point? My personal favorite here is a sparkling red that seems just wrong enough to feel naughty but right enough to go with whatever you choose to eat; and Pasta: it sounds like a cop out but the ravioli is really really good. I know. Ravioli. How boring. But when the ravioli is hand-made, stuffed with ricotta and prosciutto and tossed with oyster mushrooms...You're welcome."], ["Marco C.", "Simply amazing traditional italian and the cured meats selection is by far the best in midtown a must for italian, we were lucky enough to be served by Alex a manager on shift that night , every dish that came out was followed by a brief explanation which made the expierience even better,, Salumeria has 5 stars for me for sure becoming a reg here Thank you Alex"], ["Nora D.", "Of all the italian restaurants I have tried in the miami area, this is the best one. It is my favorite italian restaurant. Very nice place, limited menu but everything tastes amazing and fresh. Price for the food and wine is reasonable...You can also purchase cold cuts and other yummy stuff at their deli. This place is a little piece of Italy here in Miami. Don't hesitate to try it!"], ["Christian C.", "If you are not Italian you will probably like this place .. If you are actually Italian this place is sub parNeedless to say will not go back"], ["MICHELLE C.", "Fantastic new Italian restaurant in Midtown. A few tables outside, inside the dining room has tables throughout, the decor is simple.  From the moment we arrived the hostess was super friendly and took care of us very well.  They were quite busy the evening we went. No worries they know how to handle a crowd.  The dining room is a bit cramped but once we started drinking and eating we became very happy.  We took our own wine with a $10 corkage fee, yes thank you! We started with meatballs and a cold cut tray of Parma Proscuitto, and a salad. Oh my the meatballs had excellent flavor and the marinara sauce was simply divine. They were so awesome we ordered another order. The cold cut tray with an excellent cheese was excellent as well.  I chose pasta with fra diavolo, pasta was cooked perfectly and I thoroughly enjoyed it. All of our entree's were amazing.  Our server was terrific, we never waited for anything. From the bread and oil to all the apps we had and each of our entree's, it was a very very good meal.  Prices are reasonable, service was great,I can see many returns to this fantastic restaurant. Take away all the fancy large restaurants and dine here, you will not regret it. The quality of all the food was impeccable. Two bottles of wine, four apps, four entree's, our bill was $139, not bad at all. Do try the amazing meatballs and for sure the cold cut tray, wow very impressive."], ["Jennifer S.", "WHAT A NIGHTMARE!!!!For the sake of people that like Italian food -- please stop changing owners/chefs. I came here about 3 months ago for dinner and the memory of the stomach ache I was left with still haunts me, making it almost impossible for me to even say \"gnocchi\" out loud without experiencing hang-reflexes. What are they thinking? I honestly have never had such bad experience. Service was slow, we kept getting the \"YOUR FOOD WILL BE RIGHT OUT...\" message over and over from 2 or 3 different servers, obviously not organized nor personalized.The food is a royal disaster...my \"Gnocchi\" was more of a buttered soup than actual pasta, IT WAS DISGUSTING! I am not sure who told the chef that he could cook, but he clearly needs to go back to the car wash business.I am typically not this brutal, but I could never look at pasta the same way, so it is well deserved. Thanks, Salumeria."], ["Mourad O.", "Delicious!!!! We had the Vitello Tonnino as an appetizer , then the pasta cavallieti and the cacao mactaguati with asparagus and Gorgonzola sauce for the entree... Good service!!!"], ["Lesli D.", "Went out for early dinner and lived the restaurant. the porchetta was delicious, as was the pasta with truffles. Must try the guanciale!"], ["K G.", "Bolognese is irresistible.Service is incredible.Complete and total win.Went two nights in a row while in town. Go."], ["Jessica L.", "I Need to give it a second chance... The burratina was good as was the bread but I was frustrated when they brought me an $8 glass of Pinot Grigio less than half full :-/ The waiter gladly added a bit more, but left me feeling uneasy about the restaurant. Otherwise, all the food looks very fresh and the servers were quite attentive during a 2 o'clock lunch"], ["Irene P.", "My husband and I randomly popped into this place for lunch. The place is nice but the food is just meh! My pasta was floating in butter, the ricotta wasn't fresh and the prosciutto was m.i.a and my husband's dish wasn't anything to remember. I recommend this place if you go for wine, cheese  and some charcuterie but avoid the pastas!"], ["Kelly T.", "I was so glad we chose this place for dinner tonight. Food was absolutely amazing. We had the flat bread (Foccatina?) and the spicy salami for appetizers as those were extremely delicious and flavorful. Our waiter was very knowledgeable about ever dish and gave us great recommendations. We ended up with the cavatelli and Gnocchi alla romana, (old style gnocchi), probably the best Italian food i've had EVER. We were told that this type of gnocchi is very popular in Italy but unfortunately, Americans only know about the one type with potatoes but this is absolutely so flavorful and tasty that I wanted another plate. The only compliant I have is that the place is a bit too LOUD, even if there were only 10 people in the restaurant, the walls are probably really thin."], ["Maglenys S.", "I have been here a few times and it always makes an impression . The service is outstanding. The last 2 times I've dined here David was our server and he is excellent. He was extremely attentive, conversed with our group and made it a great experience . The food ... Omg!!! I love truffle oil and they have prosciutto marinated in it - cotto al tartufo ... It's sooo good! Ok let's move on to the tagliatelle bolognese - ah-may-zinnggg!! It literally comforts my soul! Then there's the almond cake with ice cream  for dessert. It's moist and warm and just perfect! The wine selection is great , and the cappuccinos are delish! Def will be going back"], ["Jacques B.", "I have eaten here a couple of times and the food is been always delicious.The fist time I had the grilled langoustines (scampi) which was perfectly done and a glass of Italian wine.The second time, I came with some friends, so we had a bottle of chianti, the assortment of prosciutto and salumi which was very tasty,  then I had the parpadelle al fungi which was exquisite.  The  atmosphere is very pleasant. It feels like a trattoria...I would recommend it."], ["Alissa W.", "Finally tried this place Saturday night after walking by thousands of times. the place is always packed inside, and outside. Service is very good the menu needs a few more entrees it is lacking in that department. At first I thought this was mainly a meat place. Started out with the burratini was excellent room temperature with a panzenalla salad with bread, Israeli cucumbers, small yellow and red tomatoes, and red pepper $12. Very fresh tasted like the vegetables were just picked off a tree. The bread they serve you is very good they toasted in not and crispy. For my entree I got the cavatellii fresh pasta with  tomatoes and reggiano parmagina. The quality is excellent and the prices are good too nice size portion for the money $14. Weird they added gratuity never seen that in Midtown area so heads up on that I would have had no clue."], ["David A.", "This restaurant has become my girlfriend and I's favorite restaurant in Miami. I am saying my girlfriend and I but it is great for bigger parties too. The food is delicious and very affordable. You need to try the burrata cheese which to me is probably the best one I tried in Miami. We usually share the burrata and 2 orders of pasta. You can't really go wrong with the pasta as they are all delicious. It mainly depends of the mood you are in. Waiters are always very polite and look happy to serve you. You know what? Now that I am writing a review for salumeria... I think we are going to go to Salumeria tonight. Enjoy everyone!"], ["Angela M.", "My husband and i randomly popped into this place one night for dinner. We ordered 3 different pasta dishes. We didn't expect anything amazing, but we were pleasantly surprised. The atmosphere is similar to a cheese course type of place, except with table service instead of the counter. The most stand-out dish was the homemade gnocchi. Upon their arrival to the table, they almost look like a scallop- five big, fat gnocchis deliciously covered in creamy goodness! We were so surprised that this random little place in midtown was SO GOOD!"], ["Lilia G.", "Amazing food. Amazing service. My husband and I eat there almost weekly. From the soup, cheese, pasta and bread. Everything is delicious."], ["Melanie A.", "Casa Tua, STEP ASIDE. I will spending my time and dough at Salumeria 104 instead. Talk about a REAL Italian restaurant! They don't need any plush white chairs or models as the core of their amazing business is great food, wine, and service. You really feel like you're in Italy here.We decided to go somewhere after the \"Second saturday art walk\" to grab a bite to eat and hopefully watch the Heat game. Our friend suggested Salmueria 104 and we called to make sure that they had a tv/were playing the game. We ended up snagging a table for 5 right in front of the tv, literally. The restaurant was full but then again it is a very small restaurant.Their wine list is by price, which I like, and they have several wines under ONE price bracket. The wine was amazing and the waiter told us that he is actually from the town where the wine was made. We then went on to have a conversation with him about why he moved to Miami (just three short years ago) and where has traveled throughout the world (he traveled extensively for one year prior to moving to Miami). It was interesting to meet someone in Miami who fortunately, doesn't have rocks for a brain!!!!! YessssssI started with a salad (with lemon dressing). It was light and refreshing. I then just had pasta with mariana sauce. My fiance had the steak and our guests had speck/also pasta with mariana sauce. It was delicious. It's actually tough to make a pasta with mariana sauce because I frequently make that at home and am constantly comparing it to my own doing so I am pretty critical on this simple dish! It was amazing though.The prices are sooooo affordable (shocking almost) as our wine was $30 and my salad was $7! My pasta was like $15 or something, wow. I guess we are too accustomed to the $100+ wine and $16 salads in South Beach. No mas! We will be spending a lot more time in midtown at Salmueria 104!"], ["Arielle S.", "Delicious brunch! The baguette and potatoes were particularly good. Reasonably priced for the quantity and quality received (in Miami). Will definitely be back to try lunch or dinner!"]]}