{"Mandolin Aegean Bistro": [], "Mina's Mediterraneo": [], "Crazy About You": [["Colleen B.", "WOW! If I was basing my review strictly on the view, this would get 5 stars... however, the service wasn't the best and the valet parking was a little confusing. So let's start with the view... WOW! We scored a table right on the water, yes, right on the water, for a Wednesday night happy hour. What does that mean? The sunshine, water and gorgeous afternoon, lent itself to a perfect backdrop to wind down the day. Also, it meant $1 glasses of champagne for women who purchased an appetizer. I went with the Mexican caprese salad which the only different between a regular caprese salad was that there were some greens and guacamole. It was a perfect, light bite to accompany my champagne. Our server was okay but not extremely attentive or informative. It wasn't even busy for happy hour.The inside was very nice as well but I can't imagine sitting inside if the weather is nice when you have a great view at your fingertips. Overall I would absolutely stop back here for happy hour or dinner. If you are in the area, seek out this gem, sit back, relax and enjoy!"], ["Marc S.", "The decor, atmosphere and setting of the restaurant are amazing.  I wish i could say the same about the service and food.  The service not attentive.  Only came to take order and serve meal.  When we asked about long time before getting food (45 minutes), we were told they had a computer glitch in the kitchen (computers making food!!!).  We had clamari and croquettes, short ribs and chicken cutlet.  Nice presentation but execution was average and taste was very ordinary.  Not exceptional here, just plain food.  Manager came to give us the bill.  After answering him about ur experience, he blamed the computer system for the long wait and sub par service.  There was an error on the bill, charging us an extra 10$ for an appetizer we did not take.  I would not recommend the restaurant for dinner.  Maybe just for appetizers and drinks, before having a decent meal somewhere else!"], ["Eugenia M.", "This place is great for brunch, good food, drink and service, thank you to our server Chris for all the suggestions.I highly recommend the Croquettes!"], ["Andrea V.", "When you walk into the venue, you love it's ecletic feel. At first is the lounge then you walk into the restaurant. I truly loved the decorations. We decided to sit outside, to enjoy the view of the bay. The menu was very funny and quirky. The menu had various items to choose from. You are first-served some nice pieces of bread with olive oil,  which tastes like it was made fresh in the kitchen. I chose to eat the \"I can't believe it's not pasta\" which was made with zucchini like noodles. I thought it was Genius. Even though it is creamy, The pasta like feel was hearty and healthy. Then we had the message in a bottle dessert. The attention was wonderful by the staff. Also their lemonade is homemade, which helps with the Heat of Miami. At the end the manager came over, to make sure we enjoyed everything. I recommend this restaurant."], ["Juan C.", "Whether you are a sitting inside or you find a table outside facing the ocean, this is a great place to bring someone special. They have a great menu selection designed to share your food (or not) plus they have some good wines starting at $10."], ["Gabriela G.", "The location is great, definitely get outside seating if you can.Service was pleasant, not overly smothering. But now for the food, I was pretty disappointed. I came here with high expectations but when I got my Firecracker Rigatoni pasta all that flew over and landed right into the bay behind me....the only thing I can say made my experience an 'ok' one was the Sangria  so cheers to that, I guess."], ["Monica D.", "Hi everyone! I really recommend this place and the excellent service. David, I thinks it's the name of the guy who helped me, it was very friendly and helpful, very comfortable, beautiful place and service!"], ["Renee H.", "Really enjoyed this restaurant with my friends. We went for dinner and drinks. Staff was great too. Chilean sea bass was superb!"], ["C P.", "I like the place but not the food.It was over cooked and there were not to much options. I don't recommend you this place if you are looking for a good food! The dessert was the best!"], ["Elgina H.", "This place was amazing. the view, food and our server. made reservations for my boyfriends birthday and he enjoyed the setting and environment. he also liked the fact that they provide a place to set your cell phone down at the table so you enjoy your dining experience."], ["Josette S.", "This was my first time there. Overall, I really liked the place. The ambiance is fantastic and it is just a comfortable atmosphere. We ordered the seabass and filet mingon for main courses. Both plates were delicious, especially the sea bass.  Each entree comes with an appetizer which we had the calamari flatbread which was excellent and the chihuahua cheese casserole. For dessert american churros and happy endings. Everything we ordered was delicious. The only thing I would say was a down fall was the service. Our server was nice when he was there, but took forever to bring us our drinks or to check up on us. Overall not a bad experience. I would definitely come back more for the lounge happy hour outing rather than a full meal service.:)"], ["Sean B.", "This is a simple one - just go.Drop whatever the hell it is that you're doing, it's not important, and go.No, your work can wait. Screw it, if you're waiting on your wife to give birth, she'll be fine - just go. If your husband is in the hospital after thinking he can run for 2 hours and hurt his ankle - leave him in the ER and go.If the kid/husband don't understand how good the food is and that you had to leave, you do not need them in your life.What? too much? ;-)"], ["Stephanie S.", "I am crazy about this place. Everything I've had has been amazing, particularly he calamari flatbread and the I can't believe it's not pasta carbonara. The prices are very reasonable, especially for Brickell. The $15 bottle of wine is a nice touch and the bay view is spectacular. :) I would highly recommend this place. I loved the box that suggests placing your phone in it for the entire meal to allow for a more engaging experience. This place is great for a friendly lunch or a romantic date and the decor is super cute."], ["Adriana P.", "One of my favorite places I've been in Miami so far. The ambiance is definitely one of the prime reasons why it's so great and the food is pretty good as well. We went for dinner and sat outside by the water, and the view is phenomenal. Also, you definitely get what you pay for. The price includes an appetizer which is a good size and then the entree which was delicious. I would definitely recommend this place and try to sit outside if you can. Makes everything so much better."], ["Tori M.", "I fell in love with this restaurant when we walked in. The decor is very unique. The service was excellent. We had a server named Carlos. He was great. We were early for our reservation but they sat us immediately. They gave us the option to sit outside and they were nice enough to find us a good table inside when we thought it was going to rain. Now for the food: the calamari flatbread was great, so were the fried green tomatoes. The Serrano ham croquets were amazing-a must! The risotto was delicious, my favorite dish so far. The churrasco was juicy and tender. I had the zucchini pasta with chicken. Best of all. Everything was reasonably priced and every entree comes with an appetizer. The wine was $5.00 a glass and overall, we paid less than $30 a person. Great place. We'll be back."], ["Sally R.", "Nice ambiance!!! Food was not bad...... Kobe sliders were delicious.  Pizza was just okWednesdays is ladies night. 1$ champagne with every appetizer purchase.  Not advertised so you need to know it Prices are average for the areaIt was raining so we had to stay inside but the outdoor patio is nicer than inside.  Romantic and beautiful waterview ;)I will go again"], ["Krystal O.", "I am crazy about, crazy about you. I love this place and have been here quite a bit. Dinner is delicious everything I've had has always been wonderful. They have an awesome ladies night happy hour where apps are half off and free champagne for ladies. My absolute favorite dish here is the calamari flatbread, this thing is amazing!!!! Beautiful location on the bay and fun DIY dessert with the message in a bottle. I highly reccomend this place for a special ocassion dinner. One of my best friends had her rehearsal dinner here and the service was wonderful - I would also reccomend this venue for a similar event or shower."], ["Jan N.", "The view is what makes this a 4 star rating.  The food is good - don't get me wrong - but the view is what lures you in...We came here to celebrate my husband's birthday on a Tuesday night.  And let me tell you - it was pretty bustling.  I had made reservations beforehand and had requested outside seating, but the girl taking my reservation said that seating is wherever is available when we come in.  Slightly turned off by this, I still plowed forward and decided to give this place a try.Crazy About You is really pretty - swanky, sophisticated, nice décor... and I loved the music track they had playing (goes with the ambiance - think Girl from Ipanema). They had ample seating at the bar, which is actually more like a lounge area with a mix of couches, short stools and tables.  We actually hung out there for about 30 minutes since we were told (upon arrival) that there would be outside seating, just not immediately - which was fine with me!Although the inside of the restaurant is a great place to sit, nothing beats sitting outside.  The view is great!  They have an \"upper level\" (this is where we sat - it's connected to the main level).  They also have a \"lower level\" (which is where I wish we would've sat!) and if I were you, I would ask to be escorted that-a-way for dinner because the view is nicer.  As our dinner choices, my husband chose the bacon pizza with the Serrano ham croquets as the appetizer.  And I chose the risotto with wild rice, shrimp, and mushroom in some decadent, awesome creamy sauce.  As my appetizer, I got the Chihuahua Cheese.  Verdict says... all of it was great!  Again, not mind blowing, but definitely satisfying and tasty. And the portions were perfect - we did not feel cheated at all!  And really, the prices weren't bad.  You have 3 price levels - $17, $21 and $25; and each entrée comes with an appetizer of your choice.  Seriously, a win-win situation.  That, coupled with the view, makes it a nice night out.  Ridiculously stuffed, we nixed the idea of dessert. As we walked out, hand in hand, we decided we could absolutely see ourselves coming back.  It's always exciting when you find a location that you can add to your list of places good enough to come back to.  It's usually hit or miss when you're venturing out and going somewhere new. It was a successful night for us, though! Yay. P.S. Valet $10.  Eh."], ["Yannelis G.", "I absolutely loved this place! The ambiance and the food were a perfect match my boyfriend and I celebrated our anniversary here, the waiter gave us complimentary champagne with our dessert it was so generous I definitely want to come back and try brunch!"], ["Alina V.", "So one of my friends held her baby shower at crazy about you by renting a space for the event. The place is absolutely gorgeous and they did a fantastic job organizing and setting up. We sat down and were immediately greeted with mimosas and given a brunch menu that included appetizer, entree and beverages. Our specific menu which was chosen by the host consisted of Serrano ham croquettes, scrambled eggs, croissant, strawberry & banana creamed waffles, bacon and patatas bravas. It seemed like this restaurant offered a variety of food ranging from American to Spanish to Mediterranean. The two items that stood out from this specific menu were the strawberry & banana waffles which were fantastic and the patatas bravas. The potatoes (patatas) were smothered with a sauce I believe was marinara which gave it an amazing kick to it that I've never had at any other Spanish place. Everything else was pretty simple, nothing out of the ordinary. I have to say though that the portions were very small, my guess is it might have been due to the fact that we had a selective menu for an entire party. Might not be the case if you come for regular brunch. Next time, I want to sit outside facing the water as they have an outstanding seating arrangement with a pretty awesome view of the ocean. (Huge plus)"]], "Daily Bread": [], "Shaddai Fine Lebanese Cuisine": [["Vicki T.", "This place is the real deal for excellent Lebanese food!Everything is fresh and very traditional , vegan friendly as wellThe owner John and his wife Elizabeth are so warm and welcoming!!We will be back real soon"], ["Anna C.", "Food was very salty and i couldn't eat it. Service was rude and didn't ask how the food was. I will not be back."], ["Sergio G.", "I had the lamb kabob.  It was excellent. Good service.  Nice decor.  I will be back here very soon.Elizabeth and Tony are great hosts."], ["Pablo G.", "Being raised in the  Middle Eastern, i know good quality food and in Miami, hands down, this is amongst the best Lebanese food and kabob.Reasonable prices, great selection and casual environment.A definite must try, and highly recommend meat combo for four platter w/ special meat hummus and tabouli.Meat tastes fresh, well cooked temperature and juicy flavorful.Great restaurant!!!!!"], ["Charlie S.", "We had an excellent dinner at Shaddai. The appetizer platter is the way to go here: we shared this between two of us for dinner and it would have been enough (we got ambitious and ordered the farmer's cheese also, which meant we had a good bit to take home). At $30, this meant the appetizer platter was a great deal. We picked five appetizers :- Foul madamas. Stellar. Blew away other any other foul madamas I've had. This is a must-order to me. - Hummus. Delicious and great texture.- Babaganoush. This was remarkably good babaganoush. I am usually disappointed by babaganoush, but not here. Great flavors and, again, great texture. - Falafel. I thought it was pretty standard actually. I was satisfied, but unlike  the a number of the dishes I tried at Shaddai, the falafel did not particularly stand out.- Grape leaves. These were above average. And interesting because, unlike many grape leaves I've had, these were warm.  I mentioned we got overly ambitious and ordered farmer's cheese too. These were fried cubes of really, really fresh cheese. With a vaguely mozzarella-like taste. I also thought this was a must-order. The cheese was fried perfectly (which is to say, lightly). Despite being fried, it felt light and tasted ultra fresh. Really fantastic. Service was good and the atmosphere was very nice. A bit of an upscale vibe inside actually, despite being in the corner of a shopping center. Can't wait to return."], ["Liliana E.", "Heard god things from someone and decided to try it out.  The food was delicious! I will definitely return. The parking lot can get full but there's more parking upstairs."], ["Lourdes S.", "OMG, is the way I would express my experience at SHADDAI.  From the friendly family  atmosphere, to the most authentic Mediterranean food I've had.  This place is truly a gem. In my many visits to SHADDAI I've eaten most of their dishes and never been disappointed.  Very fresh food with quality ingredients and oils. I don't even know how I can manage to stay away for more than a couple of days."], ["Jennifer S.", "I was starving and picked up some falafel and hummus with meat! They were both delicious...although, when I'm hungry it's hard for me to say it's bad. But don't fret, my friend who was NOT starving agrees with my review. The meat had a great flavor to it, not too salty...perfect. I'm writing as I eat because I'm going into a food coma soon..."], ["Stephani N.", "Absolutely amazing! We ordered the kabob combo, the meats were cooked perfectly. Tabouleh salad is the best I've had ever! This is my new favorite spot!!!!"], ["Morgan F.", "Lebanese food I found out is not for me. Sorry! Service was not the best."], ["Carolina M.", "Delicious Middle Eastern food, well prepared and good service.Came here on Mother's Day so it was busy but we were seated fast anyway.The service is friendly, fresh ingredients.The falafel is great, chicken and kefta kabobs delicious and well seasoned. The tzatziki and hummus are fresh and excellent.We over ordered and ended up taking a bunch of stuff home to eat later.Good neighborhood place. Highly recommend."], ["Stephanie E.", "Best lebanese / mediterranean food in Miami. The prices, the seasoning, decor and service all together just work. It's consistently excellent. Whether on a low key date night or a group lunch, just come!"], ["Ronette A.", "Absolutely wonderful!!! From the ambiance to the food to the hostess with the mostest this restaurant has it all!!! Chef Tony makes it all happen with his culinary touch on Mediterranean flair!!! Go for the  kabob platter with all the trimmings and you will keep coming back for more!!!"], ["A H.", "Crazy good! We had the appetizer sampler which was so flavorful & filling. We didn't need the entree & we stuffed in the dessert. We had the chicken wings, hummus w/ meat (ridiculous!), grape leaves (which I don't like but THESE were delicious & warm, which I think, makes the difference), a pita sandwich w/ meat & lamb, & balls filled w/ meat & spices that were unexpected & yummy! Couldn't pass up dessert since everything else was so delicious. So, we had something only offered every other week. A sweet cream w/ phyllo dough on top, baked & topped w/ sugar rose water. Whaaat?! Good! Now, our server, Savannah, is worth mentioning, too. Since I waited tables in my lifetime, I know what I want from a server. Savannah was knowledgeable, polite, helpful, bubbly & RIGHT about how good each selection would be! Since we'd never been to a Lebanese restaurant before, we needed recommendations. She was on the money (but, to be honest, I can't imagine anything here being bad)."], ["Maggie R.", "Great service, we shared kabob for four. Plenty of food and have a huge lunch for tommorow. The Turkish coffee was a really good finish."], ["Lauren M.", "Wonderful restaurant! The manager was so personable & kind. Friendly & timely service. The hummus & meat were delicious & they also have great Arabic coffee. Definitely felt like I was eating fresh, quality food. It is pricey so come prepared to spend a bit more. I think the price is worth it, though & it also feels worth it to leave a restaurant feeling good health wise."], ["Katrina B.", "I was really thrilled to find a delicious middle eastern food spot close to my house in Kendall. I suggest you have a reservation because this place fills up quick! We arrived on a Friday night around 5:30-6 and luckily got a seat before the first dinner rush. We only had less than an hour to eat before we caught a show, so the service being speedy was important to us, and it did not disappoint! Every server was on deck and prepared to refill waters, wine, and see if we needed anything throughout the meal. The food itself was delicious! Between two of us, we split both the raw and fried kibbeh and a mixed kabob platter which had beef and chicken. I cannot wait to return and try some of the other menu options!"], ["Cynthia H.", "Love this Place!!! Service is always great and the food is amazing! Their hummus is so delicious. The sharwma and chicken kabobs are seasoned so well.  The meat is savory and  the grape leaves are the best I have tasted!! I love the chicken wings that they call jawaneh. The lemon and parsley seasoning is seriously finger liking good!!!! A must order every time I dine."], ["Tiffany S.", "Took my mother here to celebrate her Birthday! Tony and the staff made us feel at home. The food was delicious, great service and best of all they sang her a special birthday song! The lambs, kababs, hummus, and falafel's are outstanding! If you are not sure on what to eat; ask Chef Tony, he will make a fantastic recommendations from appetizers, to entrees and specially their delicious wine. We will be back soon! Thank you for making It an amazing experience!!!"], ["Kari R.", "This place never disappoints. The devote and lighting makes you feel like you have been transported from Miami to the Middle East. It's a very friendly atmosphere. The food is amazing. The lentil soup is so flavorful and compares to none. It is a must have at every visit. The Jawaneh (chicken wings) are marinated in the most delicious light sauce. Chef Tony won't cough up the recipe, no matter how many times we ask. The Arayes are a quesadilla-like appetizer with a marinated ground beef grilled between fresh pita. Can't decide if you want grape leaves, tabbouleh, hummus, or any of the other appetizers?? To hard to chose? Well you don't have to!! Just select one of the many Samplers on the menu. Oh and the Shwarma!!!! Tender slices of marinated beef or chicken. We will definitely be back!"], ["Carolina M.", "Take-out today. Kafta kebabs are so good that we ordered 2. Delicious! An explosion of flavors. The meat is cooked to perfection. We ordered one with fries and one with rice. My favorite today was the dessert. I don't remember the name but it was spectacular. A cheesy custard baked with something else. Not too sweet, that's why I loved it. Shaddai never disappoints. Can't wait to go back to try something new."], ["Naty K.", "I was fortunate enough to be able to call on a friend to help me escape the boredom of sitting around at the dealership while my car was being serviced.  He came to fetch me on his motorcycle, and since he is Lebanese, I not only thought he'd like to eat the food that reminds him of his homeland, but would also be an accurate critic of the food served here.  After that very thrilling ride, we arrived.  Shaddai is easy to miss, considering the plaza with the sign does not even have it listed, nor do they have a sign above the locale.  The only hint of it is on the windows, where they have stickers with the restaurant's name.  I don't know how long they have been open, but my advice is to get signage in order to draw in patrons.  Were it not for Yelp, I would never have known this restaurant was there, and I drive by every weekend.As we entered, we found out that the waitress is actually the daughter of the owner (and chef), Tony.  It's a family-run business.  The other waiter is his son, and his wife works there as well.  My friend suggested ordering a bunch of appetizers and eat them, tapas-style.  We ordered the hummus with meat, falafel, kibbeh nayeh, vegetarian grape leaves and fatoush.  I had seen someone mention a belly dancer and inquired about this, and was told that sadly, they will no longer have a belly dancer.  What a shame, I would have loved to have a show while eating! Now, on to the food.Disclaimer: The order in which these arrived may be off, considering I went there a week ago.  The hummus with meat arrived, and it looked colorful.  Honestly, I had never seen hummus with ground meat in it.  If you ate the hummus with the meat, it had a nice flavor, but if you ate the hummus without the meat, it seemed to be lacking in flavor.  I could not taste the garlic or lemon juice that should be present in the hummus, and I think it could have used a bit more salt.  It's definitely not the best hummus I have had in my life.  Next were the grape leaves.  I was surprised to get these rather hot, I am used to having them at room temperature or cold, especially when they're the vegetarian type.  I like lemon juice on my grape leaves but these did not come with any.  Perhaps the Lebanese do not use lemon on their grape leaves, whereas the Greeks do? The falafel arrived and it was good, your standard falafel.I was a bit unsure about the next item, the kibbeh nayeh, considering it is raw meat and although I am quite adventurous, the only things I eat raw are oysters, veggies, and fish (sushi!).  Kibbeh nayeh is actually Lebanon's staple, and consists of raw meat. I was a bit worried, actually.  Luckily, it wasn't bloody or anything but I was unsure of how raw meat would taste and if this would now make me a zombie.  My friend demonstrated that you were supposed to tear off a piece of pita and scoop up the meat with it.  He also explained that the meat had to be extremely fresh and it's actually ground lamb...always.  It must be purchased from a butcher, you will not find ground lamb (or at least not extremely fresh ground lamb) from a place like Publix.  I probably looked loathsome as I took a bite but surprisingly, it was good, and found myself eating seconds, and thirds...who knew I'd like raw meat bathed in olive oil?Unfortunately, we did not have time for dessert as I had to get my car before closing time, but we did get to enjoy our fatoush, a Lebanese salad.  It's pretty large, in my photo, you're only seeing half of the salad, as my friend put the other half on his plate, so don't order one just for yourself, unless you plan to make that your entree.  The fatoush was good, though I would have preferred more tomato and dressing.  As we were wrapping up our meal, we were finally able to pull Tony away from the kitchen briefly, as the restaurant was starting to get busy.  My friend and Tony spoke in Arabic with Tony for some time until he had to go greet some other people and get back to the cooking.We enjoyed our meal, but because of the lack of a belly dancer and the comments I included in my review about the appetizers, I feel a 4-star rating is fair.  Perhaps as time goes by, they will be able to bring back the belly dancer and make other improvements."], ["Lorna B.", "Yum great food wonderful family. Love their food best in Miami!!! I try to go eat as often as possible. My son has a food allergy to Soy and he went as far as to change his oils. Now we can all go their as a family and enjoy. Thank you Tiny. Try their mint tea it's great!!!  Everything their is so good and tasty...."], ["Caroline M.", "Food was delicious! It was our first time eating Lebanese cuisine and can't wait to try it again! Yes, it was that good!  Service was good."], ["jen r.", "shaddai is an absolute winner for me!I had read all the rave reviews but I went in expecting to not be wow'd as it sounded too good to be true.  I was wrong... it was THAT good!our waitress was a total sweetheart (we later found out she was chef tonys daughter). we started with the appetizer sampler and for $30 we got meat hummus, kibbeh, falafel, fried cheese, and araya (which are ground beef grilled sandwiches). every single dish was absolutely delicious, seriously we cleaned the plates. we were 4 people and were feeling pretty satisfied so we decided to only order a kabob sampler and share that as well. the beef was my least favorite although it was really really good, the lamb and kafta were just sooooo great!the rice was out of this world, almost creamy in texture.the only downside was the dessert- I forgot what we ordered but it left a lot to be desired. and they were out of baklava that night.I have already recommended this place to several friends and I know we will be back!"], ["Jocey R.", "Visited Shaddai a couple of weeks ago on a Friday night. They were very busy but we were seated right away (granted, it was just the hubs and I). Everything about the food was delicious! Other reviews saying that the food is too acidic have no idea what authentic lebanese cuisine is. Yes, the grape leaves are acidic... they are supposed to be. A grape leaf that is not acidic is not good lebanese. The Kabob combo was absolutely delicious and big enough for 2 people.The only reason I didn't give them 5 stars is because of the slow service. Everyone is friendly buy they only had 2 waiters on staff plus a busser and Chef Tony's wife. They ALL came to our table, each taking a different order. It was a little confusing because we didn't know who our waiter was. As the night progressed, we just grabbed whoever was available if we needed something. Everyone was very nice but there is no way you can be attentive with such short staff.Chef Tony did come to our table with the main dish and asked us for feedback. I like when business owners care enough to ask."], ["Dayreem A.", "If I could give this place a negative star I would! Walked in and stood at the door waiting for what seemed like an eternity due to the rude stares, it was as if a unicorn and a centaur had walked in the door :/ talk about awkward .... Needles to say I walked right out, no one even followed us to try to get us a seat. I was really looking forward to trying their food but I have negative zero interest in ever setting foot in this place again!"], ["Liz K.", "Wow, great service, delicious and well-seasoned Middle Eastern food. The stuffed grape leaves,  hummus, kibbeh, and kabobs are so yummy!  Family run restaurant. I recommend reservations."], ["Maha R.", "The food here was very good. Everything tastes very home made. The staff is extremely nice and helpful. The venue is very nice and great for groups and families."], ["Vicky A.", "The atmosphere is nice . The lack of hostess needs improvement because you could be awkwardly standing if you don't know you just seat yourself .( Or at least , that's what I think .... there should have been a hostess to guide us ) .  The chef , Tony is very interactive and informative for the food . I went and ordered appetizers and one entree . There was a server who passed me the menus and I had asked if there was any specials or if there was anything she recommended ... her response was not so enthusiastic and bothered . She replied , it's there(referring to the menu )  that's all we have for dinners . No specials . Okay , I just said thanks . I had just hoped there was thiz amazing dish TODAY ONLY but the menu dyill had bountiful and delicious plates.I ordered simple known dishes such as the falafel , a salad , and a chicken entree . It was rich in flavor but the rice was too sticky. I don't recall the server coming back to check on us but to finalize our bill . Customer service needs work and hired help would help this merit . I know some are educated on meditterean food or middle eastern flavors but it would help to educate your clients so their experience is fulfilling and they are more likely to refer family and friends.Honestly , I would go back for the falafel and Chef Tony since he showed great compassion in his cooking and was very attentive . Pricing , some things are reasonable ..others are a bit steep but there a few more things I would try . I would recommend this resturant .Thanks !"], ["Fiona H.", "Let me tell you about this place...you MUST GO!great food, the staff are so friendly and if you can't decide let them help you...I'm telling everyone this is a must try place...once you go once you will keep coming back. If you can't get there for dinner check out the lunch menu...GREAT food and GREAT prices too.Enjoy!"], ["Zoila C.", "Amazing!!! We are already planning our next visit. It doesn't get any better. Family run. The chef gave us a lamb chop to try and whet our appetites for our next visit. Home made desserts that are beautiful and delicious. Definitely a great place to eat!"], ["Dee S.", "My favorite Lebanese restaurant.  Everything is fresh and delicious. Tony, the owner, is great and usually comes out to say hi and answer any questions we have.  Love this place."], ["Didi R.", "We went there last night for the first time and the food is, without a doubt, 5 stars! We love Lebanese/Mediterranean food &, having been to Greece, Crete, Turkey & Israel, can say that the chef(s) at Shadai clearly know what they're doing. We shared the \"Shadai Platter\" ($23) & the \"Kafta Kabob\" ($19) & each had a glass of wine ($8). It was delicious but we were just about full by the time the kabob came. We were absolutely stuffed when we left. The pita bread, the baba ganoush, dolmades, and the Kafta kabob were each the best I've ever had! Anywhere! The pita bread was so thin & delicate, served warm. The baba ganoush was smoky and so full-flavored. The dolmades were served warm, a delightful first for us and, in addition, the Kafta kabob were both uniquely flavored with mint? Cardamom? The mystery made this terrific meal all the more fabulous.To explain the \"missing 5th star\"...the service was a bit ragged & each item was over-priced.  Wait-staff can be friendly without being genuinely warm. I found this to be the case here at \"Shadai\".  In addition to the service being somewhat slow, no one of the 3 staff for the small dining room (nicely decorated, with great Mediterranean music) was consistently our \"assigned\" server, which seems to create confusion for guests and staff alike.The food seemed over-priced for this restaurant, given this location (in a strip mall). As former natives of Miami, now living outside Washington, D.C., we would pay no more than $20/$15/$5-$6 for the items listed above.  But I'll close by saying, for the food alone, we'd return for sure, just not as soon as we'd like!"], ["Kristin M.", "My first time trying Lebanese cuisine and I loved it! I came for lunch over the weekend and the place was packed with due extremely large groups. However since it was just my husband and I, we sat very quickly. We started off with hummus and meat which I absolutely LOVED!  My husband started with the Kibbeh Nayeh which reminded him of his Lebanese friend's home cooking which was definitely a good thing! I didn't care for it too much but since its the raw version of the Kibbeh it is definitely an acquired taste. I hate the lamb kabobs which were very tasty... a bit dry, but still a lot of flavor! My husband had the grape leaves entre which he loved. Portions are generous just like the service! Also, Chef Tony comes out and greets each of his patrons and asks how the food was - what a great touch! It really shows that they care about their customer satisfaction. The only reason why I gave this a 4 out of 5 stars is because I found it a bit expensive for a lunch for two without drinking any alcohol ($90 including tip).What a change from the typical restaurant chains!  We would def. come back again."], ["Suny R.", "The food in this place is simply amazing! Everything from the humus with meat, chicken wings, and kabob platters are to die for! Authentic middle eastern food. And chef Tony is very friendly and comes out to greet every table.I have been back several times since my initial visit and have enjoyed every dish. The friendly staff makes every visit enjoyable.  I LOVE the food so much that I decided to have my birthday dinner there.  I do hope people get to discover this small gem and experience the amazing food!"], ["Ibrahim S.", "We decided to go to shaddai for brunch in the afternoon. My wife and I have been to this place a number of times prior and have always found the food authentic and amazing.They are always prompt in getting you a table. The wait times are short. The servers are amazing and quick.Now as a person from the Middle East, chef Tony's food is as close to my mothers cooking as a restaurant can get. The food is plainly amazing.The kibbeh was tasty, the hummus and foul Medames were made that morning. The baba ghanoush is the best in Miami.Now this is the only place I would recommend for stuffed grape leaves in Miami.This is a family owned business and one of the places I love to go to in Miami. A home far away from home.Thanks chef tony for the amazing brunch today"], ["David S.", "Excellent. Every dish was great. Service was great. Reminds me of Maroosh on miracle mile. I'd say they are tied for awesome Lebanese cuisine.  Go in group to fully sample all their items. Hard to pick if only 2 people"], ["Elena A.", "Ok, I am from Israel so I know a good Mediterranean food when I see it. This place is outstanding. The food is amazing, people are so sweet and it's just a cozy place to come to. Beautiful middle eastern design and always plenty of parking, love this place and highly recommend it!"], ["Krys S.", "After reading reviews, I was excited to try this place out with two good girlfriends of mine since I live just a couple minutes away. What a disappointment!!! We arrived at 7:45pm on a Tuesday night and there was one lady working. She brought us dry, cold pieces of pita bread with no oil, hummus, nothing, after we had been waiting for a while to order. After several attempts to get her attention, she finally came and we requested some oil for the bread. About 10 minutes later, she slammed it on the table very rudely as if we had insulted her by requesting it. The portions were EXTREMELY small considering the $20-$30 plate price tag. The food came out separately, so my friend was waiting for a while before her plate of simple hummus, grape leaves and fried garbanzo came. My mahi mahi was tiny, dry and tasted as though they had made it weeks before. It looked so sad sitting on my plate, and luckily the lack of lighting in the restaurant masked its unappetizing appearance. We were so saddened by the service and quality of the food especially for paying so much!! It was definitely overpriced and we will not be going back. You are better off going to a local Mediterranean or Lebanese market and paying half the price for fresh food and decent service!!"]], "NOA Cafe": [], "Arabian Knife": [], "Shawarma Mediterranean Grill": [], "Crust": [], "Peacock Garden Cafe": [], "Oriental Bakery & Grocery Co": [["Rob L.", "Doesn't look like much from the outside, in fact I passed this place a million time and never gave it a thought. Someone at work finally recommended it so I gave it a try. Was pleasantly surprised to find an excellent and interesting menu. You can't find a better Falafel sandwich anywhere. Prices are good and there are a ton of unique items to buy in the market."], ["Jadine R.", "Hands down this is the place to go when it comes to authentic Middle Eastern food! Everything is home cooked! You seriously can't get any better than this. Oh and don't let the storefront of this place fool you. It may look sketchy and run down, but the owners are great and the food they serve is awesome. Don't know what to get? EVERYTHING IS GREAT HERE! The baklava is delicious and NOT overpriced here too! :)"], ["Ron S.", "I love this place. It just feels like home. The spicy smells, the service, and they make some of the best spinach pies, meat pies, chicken pies, zahtar, deli sandwiches, hot lunches ... I could go on and on but if you enjoy authentic middle eastern food, you will love this place too!"], ["Miryam H.", "Upon entering Oriental Bakery, visitors encounter flags from several Middle Eastern and North African countries on their right and spices on their left. Continue to sift through the aisles to find Greek and Lebanese cheeses, a variety of jams, teas from Sri Lanka, and the infamous..TURKISH DELIGHTS. The food is hearty, well-spiced, and fresh. The desserts are divine. Ingredients such as Syrian dates, cheeses, pistachios, coconut, almonds, filo dough, and honey are combined to produce a variety of delicious treats. There is absolutely NO RUSH. Customers do not pay until they are done exploring the store. Behind the deli area, merchandise similar to what I encountered in Israeli marketplaces when traveling through Palestinian quarters can be found there. From Azan clocks to prayer rugs, it is incredible ! There is no need to stress about parking, as there is a lot behind the store with plenty of spots. A falafel pita sandwich, 2 grapes leaves, a soda, and 3 desserts (including tip) will cost you about $11-$12....phenomenal."], ["Joseph C.", "I've been a loyal lunch-time customer of Oriental Bakery for quite a few years now. It's basically a small grocery store on the corner of the street that has a hidden gem of a lunch spot in the back. Every employee and I are on a first name basis and could probably take my order without me even saying a word. I love coming here because there is something new to try everyday. All of the food is made fresh the daily and is ready to go at about 11:30 each morning. Since the offerings change daily I'll go ahead and mention the items that you will find every day and are worth a try.The hummus is the best I've ever had anywhere. I like to add olive oil and paprika to it. It brings out the best flavors of the hummus. The red lentil soup (actually yellow) is amazing and super healthy. The kibeh, falafel, and grape leaves are also top notch. As for the meat offerings, the shawarma is great and they just started offering lamb (gyro style) as well. That was the only missing piece for me in my daily quest for a mediterranean fix. The pita is also made fresh in house and is the essential accompaniment to any meal here. Go ahead and grab a baklava at the counter on your way out as you pay for your meal and revel in your brief journey to the middle east without ever leaving coral way. Oh yeah...and it will probably all cost you less than $10! #WINNING!"], ["Ron S.", "Been going here for years, this place has expanded my food horizons. Awesome food - the shawarma (make sure to ask for lamb) rocks, and they have some of the best hummous and baba ghanoush I have ever tasted. They carry a wide variety of specialty grocery items from all over the Middle East and Greece and even non-grocery items like hookahs. More of a take-out joint than a dine-in place. A cultural learning experience. Good people. A neighborhood institution."], ["stephanie v.", "I hate to give this place such a low rating because I love small, local, family-owned eateries and adore Middle Eastern food, but unfortunately, I can't give it any more than two stars.  The hubby and I went on a Saturday for lunch and got tons of food from the little deli - falafel, shawarma, hummus, tabouli, some chickpea salad, cucumber and tomato salad, and some of the desserts (baklava, sweet dumplings).  Nothing was memorable!  The chickpea salad actually made me sick, it seemed a little too sour almost like it was rotten (I didn't have more than one bite).  It's such a shame that I just don't want to go into any more detail.  The service was excellent though, but I won't be coming back."], ["Jerry J.", "This is one of my favorite places to eat in Miami. Not only is the food spectacular but the family who owns it are the friendliest people I have met in a long time."], ["John K.", "All I can say is that they are \"Original\" and just serve good food and give you a breath of the \"Old Country\" in the \"New World\".  If you like it buy it, and if you don't, just stop by to say hello.  Take an adventure, and explore, just remember you don't have to go to the \"Middle East\" to enjoy the real-deal atmosphere."], ["Jorge P.", "This place has been around since I can remember.  I went there today for lunch.  If you want some good authentic middle eastern food this is the place.  I had the falafel sandwich, and I tell you this is the closest it's been to the ones I've had in the middle east.  the only difference that I could see was that here they microwave it to heat them up and over there they come straight out of the deep frier.  The pita bread was fresh and not dehydrated like some others I've had.  The tahini was amazing.  My wife had the lamb platter and said that the lamb was deliciously fresh. I also had a side order of tabbouleh salad, i have to say that even though it was fresh, I've had it better at other places (Zeitoun) comes to mind.  Overall I was not disappointed, but fair warning, if you are going there for lunch be aware that the place is small, however, the service is friendly so that makes up for it."], ["Rob C.", "not everything has high turnover (I looked closely), so you have to inspect what you're buying with a keen eye.  but in terms of middle eastern cuisine cooking items, this place would be a gold mine for miami.  also a small cafeteria in the back -- maybe to try things before you buy the frozen version.  i didn't try anything yet, just got some turkish delights."]], "Maria's Greek Restaurant": [["Damaris C.", "I love Greek food... I've been coming to Maria's for at least a decade, tracing back when they were in their other location. Authentic Greek family-run business in Coral Gables. Good pricing, good food, and good service. I totally support the locals :-)"], ["Camila L.", "We ordered from Maria's Greek Restaurant for an office lunch some time ago. The delivery service was great. The food was ok. I have definitely had better greek food.I ordered the gyro platter- it was tasty but not the best I have ever had.Other people ordered the Chicken Kebab Platter and it looked a lot better.Will give this place another try."], ["Laura R.", "We always pass this restaurant on our way to the grove and decided to give it a try. We both ordered the lamb gyro platter, one order of eggplant appetizer and one order of baklava. We drank tap water. The lamb gyro platter was good - but not amazing. The French fries were good. The pita bread left something to be desired. I didn't like the eggplant appetizer at all. My mom makes a killer version at home and this one had no flavor. Baklava was fantastic. We didn't try anything else - maybe other items on the menu are better. If the price was lower I would give this place 3 1/2- maybe 4 stars if the price was right. But for a meal that was more than $60 it simply wasn't worth it."], ["Betsy F.", "Our family has been enjoying this restaurant for many years!  It's alway good...we love the roasted chicken, greek salad is a must, gyro platter, and avgolemono (lemon-chicken) soup & Pastitsio (greek Lasagna).  Service is very friendly..We love!"], ["Steve T.", "I have always liked this restaurant but have not been in a while so after another good experience tonight I am getting around to writing a review. We started with the fried calamari appetizer which was expertly cooked and delicious, served with a side of cocktail sauce and lemons. The batter was light and crispy, an excellent offering.  For dinner the Gyro Platter which comes with gyro meat (the menu says lamb), greek salad, fries, and condiments. We finished with rice pudding and expresso.  Everything was delicious.  I noticed a lot of people were ording the hummus appetizer so it must be good.  The service was friendly and timed just right.  We enjoyed it and will return again soon."], ["Suzanne P.", "This review is based on delivery, not dine in. Our old go-to Greek restaurant has just been kicked to the curb!  Maria's Greek just took my #1 spot. The ordering process was smooth and I did not have to repeat myself in English and Spanish. Two thumbs up. He quickly informed me that delivery was taking up to an hour at the time, prior to placing my order.  Thank you. The hummus was \"scoop out that last bit\" good. No, it was amazing. Perfect balance of flavors and the pitas were still nice and hot.  Very generous portion Greek salad and they are not stingy with the Feta!  I ordered a side of grilled chicken kabob and it was perfect. This is my new go-to \"healthy\" takeout.  My husband had the Pastitsio and it was creamy and meaty and delicious!  As if all that wasn't enough, we had Baklava. Oh my, I was in Baklava heaven!!!!!!  Why did I only order 1?!?  My mouth is watering. I already know I want Maria's Greek tomorrow, and perhaps the next day too."], ["William C.", "This is truly a hidden gem.  For the locals it the secret place.for me as I think of wellness and great food this is my heart felt destination.  The Village salad is Mandatory for a great meal."], ["Bruce E.", "Best Greek food Ive had outside of Greece! Must say its the best lunch I've had since moving from NYC a year ago! Had the gyro platter which was HUGE for about $12! I could easily eat here several times a week if I didn't care about getting fat from the huge portions. It's just so good that you can't stop eating even when your full at about halfway through."], ["Wara R.", "Another amazing dining decision. My boyfriend and I are into for the weekend and not really interested in the whole south beach scene. We wanted to try something the locals would dine at. First, we talked with the concierge at our hotel who threw us so many ideas.. but still I didn't know exactly what I was craving! Gyro! I want some tasty gyro meat. We started looking on yelp what the area had to offer. Then we drove by Maria's. It looks welcoming and they sat us right away. It was about 20 min before closing. Right away the server was friendly and very helpful even offering the lunch menu. We ordered the fried cheese. It was good but I'd probably not have it again. My boyfriend loved it though. Then we ordered the gyro platter! Oh my! This was awesome! 3 large pieces of meat and french fries and a Greek salad. I turned mine into a giant gyro sandwich. I was a little messy but the taste made it so worth it. It was so filling. I just had to tell everyone how awesome it was. I wish we lived in miami. This would become a regular spot for us. If you want some tasty food for a good price! Check this place out."], ["Vanessa P.", "Was greeted warmly by owner Angela. And, yes, the tomatoes were nice..I had forgotten how great this little family run spot is! It has moved since I was last here-/ maybe 15 years ago? Wow! It's even better than I remember. So kind, real and delicious. Take out works great. Prices might seem high for take-out but absolutely fair.  We adored the light and puffy moussaka, tender kabobs and hearty village salad. Shrimp were tasty but could have used some more lemon. But those cookies buttery kourabiedes (walnut cookies) were so insane I actually his them from my own kids and ate them all. Am I a bad mom? Or just a Maria's fan! Now I just have to clean up all the powdered sugar evidence."], ["Sharon W.", "I came last night with 2 friends. I arrived first and was greeted immediately and offered a table. I opted to wait at the front because I wasn't sure if our entire group was going to show. Once my friends arrived, we were shown to our table and given waters and menus by the friendly server.Friend 1 ordered an entree, while Friend 2 and I both ordered two apps as a meal (we both had the spanikopita and the grape leaves). Warm pita was also brought to the table with our food. The food was good - the phyllo on the spanikopita was a little dry, but the filling was perfectly seasoned. The grape leaves were very good as well, with a creamy lemon sauce on the top. The service was really great; the restaurant was fairly empty and they didn't rush us  at all, but brought the check promptly when we were ready for it, along with a little sweet Greek cookie. We definitely felt the Mediterranian hospitality at Maria's!"], ["Dewey C.", "I came on their opening day and came so many times I had to shift to Mykanos down the street. Mykanos is ok but Maria's is really the best in this part of the world."], ["A P.", "Unfortunately the former owners of Egg and Dart have not carried the same quality here. The eggplant salad had a sour vinegar flavor as did the Greek meatballs. The calamari was over breaded. The chicken kebab lacked flavor. Wish we could go back to the great food at E&D."], ["Alessandra G.", "Tasty, affordable, authentic Greek food.Loved their lunch special of a double Greek salad with gyro. First time tasting lamb and I was SO impressed. It was delicious and they gave a hefty portion.Great hummus and pita as well. Ordered the fried cheese...it was delicious (I'm sure my hips won't thank me later!)."], ["Alex H.", "Terrible and irrational service. We went in about an hour and a half before they were closing and the young girl seated us at a tiny table (there were three of us). We asked to be seated at a larger table that had 4 chairs with it. The place was nearly empty and we wanted to try some greek food comfortably. The girl told us \"no, we need those tables available for larger parties\" and I let her know that with 1 1/2 hours left until closing that would be highly unlikely as there were 4 empty larger tables available and the restaurant was empty. She still said no -- I am not in the mood to have to request a manager in scenarios like these because I would assume the manager should coach them on being able to make educated decisions on their own. We got our stuff and began to walk out and all the waiters just sat and watched us go. Unfortunate."], ["Miguel S.", "Decent Greek food, and convenient delivery. I do not give it four stars because I have had much better Greek food. I would order again because of the convenience of delivery. In contrast to the main courses, which were only average, the baklava desert was excellent."], ["Steve C.", "A five star treat that just goes to show that with all of the fancy places to dine in Miami, Maria's is a fine example where the locals go for high quality, delicious Greek food food.  Wonderfully authentic, all the dish come out piping hot from the Greek kitchen.  Tonight we had the \"flaming cheese\" (although the Fire Marshall insists that the flaming be done in the kitchen), an several Greek apps.  The Moussaka was scrumpous.  Treat your palate to a bottle of the white Greek wine (Keloni?). super affordable and different than what you probably drink regularly. Baklava...homemade, war...amazing.  All of this, and a doggie bag, for under 75 bucks.  We will be back...hope to see you there."], ["Michael S.", "Miserable meal. Came here today for lunch with a co-worker. They had about 8 empty tables when we got there, but the manager refused to seat us for 10 minutes because they were somewhat busy.  We looked at the menu while we waited, so we were ready as soon as we were seated. However it took another ten minutes before the server got around to taking our order. I ordered the gyro platter with the greek salad and fries. My co-worker ordered the gyro platter with double greek salad. Finally 25 minutes later we got our food after I got back from feeding more change into the parking meter, as I had put 50 minutes on it and knew there was no way on Earth we would get out in the next 5 minutes. Now keep in mind that gyro meat is already cooked on a spit, so what took 25 minutes for two gyro platters.So the food finally comes and they brought us both gyro platters with double salad. He rushes off before I can say anything. A few minutes later I manage to catch him and tell him of the mistake. He acts very annoyed by my inconveniencing him. About 5 minutes later the manager plops down the plate of fries and walks away without any apology. No ketchup or any trace of a server to get some. If the service wasn't enough to keep me from coming back the food sure was. The gyro meat was average, but the greek salad was wretched. The lettuce edges had the orangish/brownish color of lettuce going bad and the feta was flat out disgusting. I love feta cheese and eat it regularly, so I know what reta tastes like. I don't know if it was rancid or what.Rude/slow service + bad food = never coming back."], ["Lissa B.", "The first time I ate Maria's I could almost hear the angelic choirs praising \"Aaaveeee Mariiiiaaaaa\". Is this why it's called Maria's? Anyhow, it is heaven sent. I confess, I've never even been to the restaurant. I was brought Maria's to-go one evening by my roomie, who happened to stumble upon it by foot on a stroll down Coral Way. I remember it clearly. It was a big lamb gyro, abundant with greens, boasting thick juicy strips of seasoned lamb, and glistening with delicious tzatziki sauce, all wrapped up in pita. As soon as my nose sniffed it, my palate skipped grace, and before I knew it, I was devouring this lamb gyro with all the gratitude I could muster. I've never been the same since, no other Greek restaurant satiates my craving the way Maria's does. I've tried Mykonos, Mylos, Maroosh, Opa but they pale in one way or the other. Maria's tastes of a mother's love. I suspect they are a family business. It is now my go-to Greek Food to-go. I hope to make it in to the actual restaurant one day. The grape leaves are nicely spiced and come with a delicious lemony sauce, the spreads are always perfect in consistency, they are very courteous in interactions and very fast with delivery. Their prices are great and portions are substantial. I have seen the light of Maria."], ["Lilly R.", "Looking for a healthy and quick lunch? Maria's is the place! Order the hummus to start. It's delicious! The Gyro platters are allDelish! And my personal favorite: the Chicken Kabob! Enjoy!"], ["jaelanne s.", "I'm gonna offend my Swissraeli roots here:  If I had to choose an ethnic food to eat for the rest of my life, I'd probably shoot myself rather than decide between my two faves, Greek and Mexican.  So I have fairly high standards when it come to Greek dishes.  Maria's serves it homestyle.  It's not as pretty as some other places, but it is damn good.  I hadn't been in for years, and decided recently to stop in with a friend.  A damn sight better than Mykanos down the road, or Daily Bread.  Our service during the late lunch hour was pretty good.  Extra pita bread brought before I had a chance to ask, soft warm with hummus that doesn't want to make me chuck a can of chickpeas at the chef."], ["Sal G.", "And again, I have returned to Maria's.  This is just a great little family owned gem with some great eye-candy.  I decided that one of the items in my order had to be something I had never tried before:Avgolemono (egg, lemon, and chicken soup)Saganaki -(flaming cheese)Gyro PlatterSpecial - Stuffed peppers and tomatoesThe chicken soup and the saganaki arrived within minutes of us ordering.  Talk about a little show, the server lights the cheese on fire at the table, lets it take hold and then puts it out with some liquids that augment the flavor of the cheese.  While it didn't come apart easily, it still tasted rather good.  Definitely something worth getting again.  The soup is always good.  My friend must have a soup with dinner and he doesn't care for lemon; but he loves this soup. The gyro platter was just as good this time as it has been on every previous visit.  I gotta say that they do right by gyros everywhere.  Never are the flavors out of balance.  I was glad to find that the balance in the flavors of the food was also present in the stuffed peppers and tomatoes.  Stuffed with ground beef and rice with a lemon zing, the flavor was just good.  Every time I come, I always leave quite pleased."], ["Elsie B.", "Authentic Greek!!"], ["Gina H.", "Oops...I was the late one in a gang of Yelpers for dinner at Maria's. But it seemed like nobody minded, it was like I was with family. The restaurant is very nice, not overwhelming in its decor but no way you could mistake it for anything other than a Greek restaurant. Hello's and cheek kissings made and I sat down to have a gander at the menu. Its not extensive but it covers enough. Its not cheap, but its not overly expensive when you see the portions. (OMG Adriana's and Aaron's Lamb Kebab was GINORMOUS!!!). I decided to forego an appetizer as I wasn't starving and by the sound of it, the Gyro platter I ordered was more than enough for one. A glass of Retsina to get the juices flowing and we were away! Carla and Gus had ordered their dinner in the form of several appetizers and they were so kind to share with us a taste of this and a taste of that. Everything that they ordered was TO.DIE.FOR!. Feta Cheese was great, not at all salty and with a lovely drizzle of green olive oil and some black olives (I ate my first olive in Corfu!). The eggplant salad made me so disappointed that I hadn't ordered it. It was divine. The grilled cheese was sweet and salty with a nice 'crunch'. The pita bread had a hint of herbs....brought to the table warm. The taste of it It brought back memories for Carla. My Gyro platter was good, not great. The Greek side salad was outa control yummy, the gyro was OK and I couldn't see where the french fries came in but I guess American's expect a starch. I wasn't disappointed though. I just thought I would play it the way I know it in order to get a feel for the place. Huge amount of food and all of it tasty. The service was EXCELLENT!!! God knows that Yelpers en masse are a demanding bunch of cranks and hey, we were no different than normal. But the separate check issue hardly phased our server. There was a wee mix up with a couple of checks but it all sorted itself out. What I loved the most about Maria's was the family atmosphere, the groups dining, the old couple in the corner (he looked SOOO Greek) sharing a couple of glasses of wine, smiling across the way at each other, the young couple sitting awkwardly by the front door, possibly on a first date. The staff were busy but focused. Maria's is \"A keeper\"."], ["Ana Cristina P.", "Maybe I just haven't been to enough Greek restaurants in Miami, but after my dining experience at Maria's this past weekend I have to say it is the BEST Greek food I've ever eaten here. EVER.My friend and I ordered the the Greek Appetizer Sampler Platter, which was basically Ouranon on a plate. It was a huge dish consisting of generous portions of Hummus, Stuffed Grape Leaves, Tzatziki, a couple of things I didn't catch the names of (eggplant goodness and mystery pink-ish dip which was also amazing), giant blocks of feta cheese (oh my god yes!), and greek olives....All of this was served with warm, toasty pita.  I have to say that Maria's has the BEST Tzatziki I have ever had in my whole life... I could just swim in a giant bowl of this  yogurt 'n cucumber garlicky perfection (while eating it I felt like Homer Simpson when he makes his drooling over duff 'n donuts noise).The service was excellent, and the atmosphere is cozy.  I never would have found this place on my own so I thank my lucky stars I've got friends who spread the word as well as they do!"], ["Nick K.", "Maria's stands for the best in Greek and Greek American cooking, combined with the warm and generous hospitality of a Greek home. Both their mezedes (small dishes) and traditional Greek entrees, like moussaka, pastitsio, and lamb, are delicious, hearty, and freshly prepared.Maria's is just as great for a night of mezedes (small dishes) as it is for hearty entrees. Be sure to try the Pikilia, an appetizer dish including taramosalata (roe spread), melitzanosalata (eggplant and garlic salad), hummus, and tzaziki. All of the spreads are homemade, flavorful, and a perfect complement to Maria's fresh, warm pita. The saganaki, another highlight among Maria's mezedes, is made with kefalograviera cheese, fried tableside, and served while sizziling. The keftedakia (little keftedes, or meatballs) are another personal favorite.My favorite entrees are the moussaka, pastitsio, and keftedes. I recommend ordering a few mezedes and a few entrees to share, so as not to miss out on anything!Maria's is also great for lunch! There is a different lunch special each day. My favorite lunch item at Maria's are the dolmades (stuffed grape leaves) filled with ground beef and topped with avgolemono (egg-lemon) sauce. The dolmades are available on Fridays and are delicious!If you have room for dessert, try the galactobouriko (custard in a phyllo pie drizzled with honey, cinnamon, and sugar) and the baklava, and enjoy them with a Greek coffee.My family has brought me to Maria's since as long as I can remember and we have gotten to know the family well over the years. Needless to say, Maria's is like a second home to me. I cannot stress enough how special this restaurant is, and I know you will feel the same way."], ["Carla L.", "I was looking forward to coming back as I had been here so long ago. Everyone kept on raving about it and I knew it was probably as good as they said. They were right. First let me tell you that it is family owned and run with the care that comes with it, they care and it shows. It was packed on a Saturday night, you usually get a good feel for a place depending on how full it is, and here good thing we came early because otherwise we wouldn't have gotten a table for 12 otherwise. I decided that instead of a dish I wanted to try a few things \"Tapas\" style with my hubby. The choices were: Avgolemono (lemon egg soup), Feta Cheese with Greek Olives, Melitzanosalata (eggplant salad), Spanakopita, Saganaki. The Avgolemono was absolutely insanely superb, it is LEMON soup so if you are a citrus freak like me it is something you must try. The soup has bits of chicken and a lot of rice with the broth, very lemony and I couldn't help but thinking this would be fantastic to have when you are getting over a cold. Melitzanosalata was also above expectations, I am so glad that this was a part of our meal, I could taste many flavors but couldn't put my finger on any one. Absolutely delicious to have with the amazing home made pita bread that I couldn't stop eating. Spanakopita: Thick, full of spinach and feta and by far the best I have ever had, usually the Spanakipita is a lot of phyllo and a little filling, here it was the opposite. Saganaki, flambeed cheese.. 'nuff said. Burnt cheese? My downfall - love it. The last time I had eaten here it was for some reason unmemorable but yesterday it was just perfect. Of course the feta and olives were good, all in all, it reminds me of my Greek friend (also Maria) and her papa's cooking. OPA!"], ["Alex B.", "Great place! The gyro platters is really good however the lamb portion are small. Mykonos just down the street give you a lot more lamb for your money. Service was excellent."], ["T K.", "I usually come here 4-6 times a month (for YEARS), but that's not going to be the case any longer. The last time I was there I had a new server, some guy who's name I didn't bother to ask since I knew I'd never be back again. He was SO rude, and so ready to say NO, or act like everything was a problem. My husband and I are very consistent, we always order the same dishes, cooked the same way. I don't care if he wants to charge 75 cents for the pita, just don't tell me it doesn't come with my hummus after I've been ordering it for over 5 years! Even then, maybe he should be given some customer service training so that he doesn't insist on scolding the customer. I'm not going there to argue, I'm going there to have dinner. I have NO interest in any exchange with the waiter beyond placing my order and asking for the check. When we walked in Nico wasn't at the front, and Costa wasn't working that night, so as far as we knew, maybe this guy was the manager that night. I was very disappointed with the service, and even the food tasted different. The food just isn't good enough for me to go back and risk the unpleasant experience. I order the chicken, I really can have it anywhere with great service. (Like Villagio! Where I usually go.)"], ["Guillermo R.", "Chicken gyros"], ["Jonathan f.", "If you like waiters who don't speak English and an empty wallet, the THIS is the place for you!! It only made a 2 star rating due to the food being half way decent.I have never played musical cars for so long in my life. Finding parking is nearly impossible and an accident just waiting to happen.Do yourselves a favor and drive to the nearest Scorpios."], ["Brian B.", "This is my favorite Greek restaurant in Miami. I could eat their tzatziki sauce straight. Their Gyro platter is legit. Saganaki is sick. Overall highly recommend."], ["Cliff F.", "It's difficult for me to express how amazing Maria's really is. I've been about 10 times over the past six weeks, and not once have I been let down. The service is immaculate, the food is addictive, and the prices are beyond reasonable.Maria's has been in Miami since 1982, and its easy to see why. My favorite thing to order is the pikilia, a collection of spreads including: hummus, tzatziki, taramosalata, and melitzanosalata. The hummus is exactly what one imagines hummus should taste like--the consistency is spot on and it is literally bursting with flavor. Their tzatziki is very creamy and spreadable, and especially fantastic when you combine it with the hummus. Taramosalata is a traditional cod roe spread, and in its Maria's iteration, it is pure perfection. You'll honestly have to try it to know what I mean, but as far as spreads, this taramosalata is perfection. The melitzanosalata is a great eggplant spread, but in this company it stands in the shadow, which is akin to being an Oscar nominee. Other platter components include feta cheese, tomatoes, radishes, olives, cucumbers, and pita to bring it all together. TIP: take pita, add feta, fold in half, apply spread of choice, and eat. Welcome to Maria's. Other apps -- I've tried the spanakopita, saganaki (famous flaming cheese!), keftedakia, dolmadakia, village salad---any of which are great to start a feast (I always stick with the platter though!) Entrees -- I've tried the moussaka, pastitsio, keftedes, and gyro platter---all of them are spectacular, but the pastitsio is astounding. Try it. Don't skip dessert either! The kourambiedes are great, and their galactobourico is worth a trip. Go. You won't be disappointed. I would turn down free dinners at some of Miami's best restaurants to go to Maria's. In fact, I have...and I will again. Its epic."], ["Rachel L.", "People often mispronounce the word gyro.  Unless you're Greek, it isn't really intuitive to read the word and think \"YEE-row\" rather than \"jye-ro.\"  But, when I was like 8, Angela - Maria's daughter - taught me how to properly order my favorite Greek sandwich.  You see, on days when I had the good fortune to accompany my Mommy (yes, I say Mommy at 28 years old!) to her Downtown Miami office, she would almost always take me to Maria's.  The amazing staff always turned lunch into a production, and continue to do so even now.  Because of Maria's restaurant, I was educated on the deliciousness of a well-prepared avgolemono soup, the balanced flavors of a perfect pastitsio, and the delight of nibbling on Kourambiede.  On the downside, Maria's turned me into a friggin' pita snob.Maria's has a lot of heart.  And shares its Mom & Pop goodness with all of its patrons.But, I never dine on nostalgia alone.  Likewise, Maria's does not rely solely on its family-oriented or deep rooted image to hook costumers.  The food is the best bait.So, come get hooked on the flavors of the Greek islands at Maria's.  Or, go on your own Odyssey and search the seas for something better.  If you find anything close though, please let me know.  I still haven't, and it's been 20+ years."], ["Joann J.", "Waited for 40 mins, and the kitchen has not started our dishes! Asked the waitress about the order, she said \"the dishes will be served when its ready!\". She did not even want to go to the kitchen to check until we asked for it several times! If you have 3 hours for meal, then u r welcome here!"], ["Seb W.", "Excellent Gyro.  I will go again.  Fries are delicious."], ["Paula E.", "I just remembered I had forgotten to review this place!! how could I? blasphemous! The day I turned in my thesis documentary to my committee for the final review, my dear friend Stretch L. decided to treat me to a late afternoon lunch/early celebratory dinner and as we were driving down Miracle Mile aimlessly looking for something exciting to try, we landed in front of Maria's.Yess! another cross-out from my \"to-eat\" list. The restaurant was pretty empty considering the random hours, which made the service very casual. Usually I'd be a bit annoyed about this but in this particular  occasion, it only further enhanced the meal. Alongside the food, it made for a very homey-feel experience.The food tasted like it was straight out of grandmas kitchen. We had the specials of the day which consisted of the hand-made meatballs and the oven-roasted stuffed peppers...so hearty!They wine selection was also pretty awesome, again with the homey/hearty feel and on the affordable side. Thumbs up, had a great lunch and definitely look forward to making this a go-to place when I'm in need of some TLC."], ["Angelica B.", "I really enjoyed Maria's. Their location is close to me and some friends and I were craving Greek food, so we looked on Yelp and ...ta da...there was Maria's with very good reviews.I have to agree with the great reviews. I had the gyro platter and it was delicious!!! I find that often people can mess Greek good up very easily, but this was perfect. The meat was just right. The fries were nice and crispy. The little Greek salad was great and the feta was nice and fresh. I only give them 4 stars because their parking situation kind of stinks. We had to park in the back in a sketchy alley way. Then we had to walk all the way around to get to the front door, as there was barely any parking up front.Otherwise, a great Greek restaurant."], ["Giancarlo B.", "Have you ever been to Mezes Greek Restaurant in Pembroke Pines? I have and its AMAZING!!! However, I don't live anywhere near Pines and went to Maria's in hopes of finding a great Greek restaurant that is a bit closer to home. Sadly, (in terms of food/flavor) Maria's just simply did not measure up. Their pita bread is pretty damn tasty though not to mention warm! But hey, food isn't everything and Maria's isn't completely horrible. There are other great things to boast about. Their service for example, is excellent! Ashely S. and I were seated quickly, our food was brought out promptly and our waitress was always around when we needed her without being too annoying. Additionally, this place is great for large groups. They have plenty space and long tables that can accommodate you if brought along an army of your friends. Their food portions are also pretty big which can help feed your crew. Lastly, if you can't find parking along coral way, fear not! They have plenty of parking in the rear. Will I come here again? Yes, but I'd like to check out other Greek places in the neighborhood and see how they all measure up."], ["Alex R.", "This is one of the office favorites for lunch! This is as good as Greek food gets! The chicken is perfectly seasoned, salad is fresh and tasty and lamb is amazing. I never liked Greek until i tried Maria's. You never have to wait to be seated and you can come in big groups! The service is fast and if you are on a healthy diet ...it doesn't get any better than this!Staff is polite but a little cold; given that they are foreign it's understandable. Oh and the best part is that you have all of this for an affordable price of less than $15.00 per person. I highly recommend this place and after you try it ...keep it as your best kept secret! Besides that ...Don't forget to pay your meter!"]], "Rice House of Kabob": [], "Gibraltar": [["Lisa G.", "Food was delicious... we took advantage of the Miami Spice menu and we all agreed every course was superb!The management however needs to get their act together. We made a reservation a week prior and were asked if there was any special occasion being celebrated. We said yes, a birthday.When we arrived last night and checked in at the desk, not only wasn't there a reservation noted for us, but we were told that there was a private party in the main dining room and were ushered into a side room *(probably used for parties) that had no windows, and approx 7 tables set -up for dining. The manager had no explanation for why our reservation was not listed or why we were not told about the private party. Despite, the mess-up and the fact that we were celebrating a birthday, management lacked the smarts to even offer us a drink!We will be back again... but will know to ask all the appropriate questions since no one representing the restaurant seemed \"with it\" enough to inform us"], ["Irene C.", "A-OK because the view is amazing and the food was very good. Our server was very nice however he was the ONLY server in the restaurant, therefore there his hands were tied, the service was slow, he forgot to bring us items we requested. We went for lunch this past Monday (Columbus Day Monday), around 12 pm. Although I know Columbus Day is not a big holiday/day off in South Florida, that's not the case in other parts of the US, i.e. people come down for a long weekend so maybe you should staff with more than a single server. Our party of 3 sat outside which has, like I said, an amazing view, but the place is obviously worn out, worn down, and needs a lot of TLC. The patio furniture is discolored, half of the fans above us were working, the landscaping/gardening obviously hasn't been tended to. I come from a hotel background and these things are usually obvious to me, however, I think the average person would have noticed how tired and un-maintained the place is. As we continued our lunch, additional tables came in (a couple of parties of 6-7 people), and, although we got our food in an average amount of time (and it was very good, might I add), the poor server was pulled in so many directions, there was nothing he could do to stay on top of the tables. There was, apparently, a restaurant manager, helping out (my husband, who is a restaurant manager, stated this woman was the restaurant manager. Apparently, he can eye them out), but I never would have guessed she was the manager from her manner and the lost look she had. They also had the pool bar attendant helping out with bringing out food. Eventually, the Director of Catering came down to help. Clearly, this place was not ready for any diners on this beautiful Monday at lunchtime! The food was very good - the guacamole, tuna, short rib sliders and Cuban shrimp. Everything tasted great - fresh, well seasoned, portions were average (not too small or big) and pricing was relative to what you'd find in a hotel restaurant. I wasn't surprised by the pricing - it's what I expect when I go to a restaurant in a hotel. After lunch (of which we received no discount despite the terrible service), we walked around the pool area, another space which is lovely (amazing view!!!) but needs TLC as well. The place looked a bit desolate. Finally, we walked over to the spa. Walking down the outside hallway towards the spa, it is so obvious that the place hasn't been touched/updated/some areas maybe even cleaned, in a while. The doors (guest room doors I'm assuming) needed a paint job, the gardening/landscaping was either overgrown or non-existent, with weeds growing in, the outdoor furniture looked so worn out, dust/dead ants/flies on it, and, alas, arriving at the spa, it was closed! Closed on a Monday? Never heard of this before. That, my friends was the determining factor (for us), that it will be quite sometime before we return to the Grove Isle Hotel and/or Gibraltar. Finally, (and I promise this is final), when we arrived at valet, the attendant was quick to receive us (and there was actually another group of 3 waiting for their car or a taxi). There was no one at the front desk when we entered or exited the hotel, however, on the way out, the valet attendant was again quick to get our car. And friendly. Those who do work at this property (and there seemed to be few of them), were all very nice and friendly. They just need to handle their staffing better. And update the hotel. That is all."], ["Gabriel T.", "I'm going to be as quick as possible despite it'll be hard.I made a reservation via OpenTable for a party of 4 last Saturday at 6:00PM. We arrived 10 minutes past 6, the place was empty and we choose to sit outside. The temps and humidity was hard, also a lot of mosquitos.We were treated very amicable and professional by our server \"Luis M.\", the view of this restaurant is great, and the live guitarist was an unexpected added bonus, but...The way they do math does NOT add up:Our server explained a few \"specials\" that were not on the menu, one of them was the filet mignon, called on the attached photo of the check \"LANDFOOD SPECIAL\", they never mentioned anything about prices on the 2 or 3 \"specials\".The filet mignon or LANDFOOD SPECIAL was small, with too much grease and bone. When we received the check I was shocked by seeing \"2 LANDFOOD SPECIAL $124.00\". This meant they charged me $62.00 per Filet Mignon with lower quality that Outback Victoria Filet which cost only $24...My main complaint is NOT even the $62.00 per filet, it's the obvious set-up of not including it on the regular menu and then offer it \"verbally omitting the prices\". That's a real and legal way to pickpocket people. I have gone to several great Steakhouses, some of them use to offer specials that are NOT in the menu and ALWAYS the server explain the specials with their prices. Below and with * are the ones I have personally gone and being offered specials with disclosed prices*. Last on the list is Outback which is not a top Steakhouse and does NOT use the specials strategy but their food is super cheap and delicious:      *Smith and Wollensky ($45 to $53 Filet Mignon 8oz)*Bern's Steakhouse ($39.70 Filet Mignon 8oz)*Capital Grill ($40 to $45 Filet Mignon 8oz)*Chicago Cut ($31 to $50 Filet Mignon 8oz-14oz)Outback ($24 Filet Mignon 8oz)Paying the $62.00 per filet mignon is not the only mathematic problem, they charge me a total of 320.40 from which Florida Taxes of 7% should be $22.42 but they charge $28.84 which is actually a 9%. This is letting them to include taxes on the pre-add 20% gratuity (which should not be taxed since it will be a double taxation because the server is responsible to paying his/her state and federal taxes).So the correct amount of Tax on the bill should have being: $18.69 instead of $28.84 (another $10.15 unearned money charged).Considering the amount I was charged for Florida Tax (7%) $28.84 versus the correct amount I should have be charged of $18.69 it give us a Tax Rate of around 11%.To close the remembrance; the next day I received an email from OpenTable saying that I didn't make it to the reservation... which indicate they didn't report our arrival to avoid paying the referral's' fees...People keep your eyes hide open if you still decided to give them a try, don't get too distracted by the nice waterfront views!"], ["Belinda B.", "Second visit proved to have many ups and downs. Miami Spice lunch at the invitation of a friend.  Noticed lack of attention to detail - spots on silverware, stains on menus, crumbs in chairs. A little confusion regarding wait staff. Nice and polite but limited knowledge of menu. Slow start. We enjoyed appetizers of lobster bisque and a shrimp dish.Entrees were overcooked, under seasoned,  lacking depth of flavor, fish and short ribs were tough and inedible. Desserts of brownie banana brûlée tasted like they came from a box. Sadly, manager came by (looking unkempt with unbuttoned shirt sleeves)...we shared out concerns but he just said thank you and moved on. The wait staff was nice, the view is wonderful, my mimosa was good, and the appetizers were good. Thank goodness it's Miami Spice."], ["Zenia R.", "Complete ripoff, they offer us filet mignon as \"special\" and when received the bill was $65 each. The quality was not even close to the inexpensive Outback."], ["Alisha R.", "The location is everything here. The view of the water is breath taking and many of the tables are nestled on their own little platform making it feel as if you are in your own backyard. If only my backyard came with servers, great food and a beautiful view, I digress. On to the food we had the octopus appetizer which was perfectly tender and flavorful. I have to admit when it first came out I was worried that it was on the small side but it's served along side tostones and was just perfect. Speaking of sizes the drinks surprised me. They were priced at about $12, but given the location I expected my mojito to be in a small glass, but no mine came out in a full glass and the margaritas were served in chile's style glass. For the main course I had the grilled jumbo shrimp it was delish. The shrimp were seasoned perfectly and were succulent and juicy. On the side it came with an herbed couscous  and slow braised kale. This sides were the only disappointment of the night as they were ok but lacked anything special. My husband had the lamb chops, which he devoured and then raced about all the way home. His sides were homemade chips that were tasty and some amazing Brussels sprouts with some sort of heavenly mashed creamy vegetable. Service was on point and really added to the wonderful experience. While enjoying dinner we watched the beautiful boats come in and it was just a very relaxing evening. To wrap things up stop by the fire pit and hang out by the water. Places like this are what making living in South Florida so special."], ["TamEra M.", "My husband took me here for our anniversary dinner. I love the scenery. Unfortunately, I was sick and couldn't sit outside this particular evening due to the wind and temperature.  But the manager sat us in a nice area inside that I could still enjoy the view.  I love sitting by the ocean and seeing the fire pit. Very beautiful even looking at it from indoors. The staff was nice and checked in at the right times. I did not order any drinks off of the menu, but had the bartender make my own martini concoction lol. The Fundido was really delicious!  I ordered the paella for dinner and did not enjoy it. I told my husband the next time I'll just stick to the appetizer. He had the truffle fries and the weren't great. Had to send it back for regular fries. Lol. He did have a steak and he enjoyed that. All in all, nice romantic place in the evening and stay away from entrees and stick with appetizers."], ["Nicole W.", "I had dinner this past Friday night at Gibraltar. I was a little hesitant to dine here after reading all the negative reviews regarding the service. However, I liked their Miami Spice offerings and decided to try it anyway. Our service was pretty good until the end of our meal. I will elaborate on this at the end of the review. We arrived a few minutes late for our 730 reservations. We were seated right away and noticed the dining room was pretty empty for a Friday night. There were only 3 other small parties in the room, so at this point we didn't have any service issues. I asked our waitress for a recommendation on the white wine. She knew nothing about the wine and stated she would have to ask the bartender! Wow! I've never experienced that before. They definitely need to educate their staff!!For starters, we ordered the Oaxaca cheese fundido. It had shrimp and chorizo sausage in it and was devine. I wish I could have licked the little skillet it came in! Unfortunately, this was as good as it gets. For the entree course, we ordered the Seared Scallop and Chorizo, and the Grilled Veal chop. The veal chop had a nice flavor, but it was overcooked and a little chewy. The hash browns that accompanied it were awful...awful...awful! I've had better hash browns at Denny's. I left them on the plate! My friends scallop entree consisted of 2 small scallops on the plate. Very stingy to serve 2 scallops and call it an entree. This was an appetizer sized portion, and she was rather disappointed. For dessert, we both ordered the banana cheesecake sundae and some cappuccinos. Dessert was underwhelming. The only thing that impressed me was the fundido and the view.  After dessert, we waited and waited for our check. I noticed the waitress was a bit overwhelmed as a large party and a party of 4 came in at the same time. It's as if she forgot us, so I had to flag down someone else and ask them for the check. After another wait, she finally brings the check. We waited again for approximately 10 minutes, but she never returned to pick it up, so I had to ask someone else to take it. At that point, I decided we would not be leaving any additional gratuity (they already add on 20%) and left. I'm not sure why they would have 1 waitress, and 2 assistants serving an entire dining room on a Friday night! I won't be back!"], ["Monica Q.", "Great environment, delicious food. The hog snapper deep fried is to die for. Fish tacos, guacamole, tuna tostada and ribs, everything have a perfect taste and if you ask for the manager Anibal he's the best and sweet person I've ever meet. Highly recommended."], ["Rashida C.", "Went here for dinner with my friends just as the sun was going down.  The view was SPECTACULAR from the 2 top tables out on the patio! This is the kind of setting that you propose to someone in.... Even if the girl doesn't like you, u guarantee that she'll wait until she gets in the car to decline! lol. Yes it's THAT beautiful! Staff was nice and the food was good. A+"], ["Helen C.", "A hidden gem. Beautiful view, great service! My husband and I came here for dinner with our dog. We sat outside and thoroughly enjoyed our experience. Since you are on the island you get that secluded \"not in Miami anymore\" vibe. We will definitely be back."], ["Nancy O.", "Place needs some music in the background during the daytime. Seems place is worn out and going out of business- manager was extremely friendly and attentive- but the environment itself seems flat! Beautiful location but no attention to detail! We were a large group and service was slow even though restaurant was empty for a Saturday lunch! Kudos on the manager though, he really tried to make us happy!"], ["Ecklar A.", "This place is so overpriced it's insulting.  The food is good, the service is friendly and the view is nice but the charge and need to pay for valet and the automatic 20% tip, even on the bar tab is silly stupid expensive.  No wonder they are usually empty except for parties when I've gone.   Won't be going back."], ["Ray H.", "Went there for Miami Spice the menu was great and the food was good. The lobster corn bisque soup could have been served hotter.  Only problem with this place was went to the bar ordered two drinks after waiting about 20 minutes to be served.  Got the bill a 20% gratuity was automatically included which is fine. However when the bill posted to my bank account the bartender had given himself an extra $4.00 tip on top of the automatic 20%! Seriously wouldn't go back to this place as the service is mediocre at best and they help themselves to your money.  Don't recommend it!!"], ["Yira T.", "Went here for lunch on a Sunday and was pretty disappointed. We ordered from the Miami Spice menu. I ordered a fish soup as my appetizer, didn't see any fish and the soup tasted as if it came out if a can. The other ladies I was with complained their ceviche was extremely salty. For my main course I ordered mahi mahi which must have been some other fish because it tasted nothing like mahi mahi! The service was mediocre because there is one waiter for the entire restaurant and there were 2 big parties at the same time. Nonetheless, he didn't need to worry about the tip because the automatically add a 20% gratuity to the bill. Obviously there will never be a need to  work hard for a great tip. The only positive this restaurant has is the view but this is Miami so great views can be found at many restaurants accompanied by great food!"], ["Natalia M.", "The view is amazing. Food was ok not great. Service was terrible. It's valet parking only FYI."], ["Julia R.", "Great views and food was delicious but that's where the good experience ends.  The service was below average...not sure if this is how it always is or because we were a large party the waiter knew he would be getting his 20% regardless.  He didn't deserve half of that.  Come time to pay the bill and waiter tells us he can only swipe 2 credits cards making the people in our party scramble to find cash and some even had to go to the atm. To top it all off I get home to find out my bank account was overcharged!  Horrible experience and it's too bad since the location and food was good but I will not return!  Management you need to make some changes quick!"], ["Cheryl K.", "Had a surprisingly amazing lunch here. Could be that my business associate lives in this building and frequents this restaurant nightly and personally knows the chef - but I don't care, it was great!Started with a great glass of pinot noir and they brought out an assortment of appetizers - home made burata, ceviche and beef carpaccio. Then the chef came out to tell us about the fresh fish that just arrived - red snapper - that he would like to prepare whole for each of us with a nice Mediterranean sauce and served with tostones and sautéed spinach. It was all really wonderful.To end this lunch, they brought us their homemade icecream which was really delicious. Great service too with a wonderful view of the bay.I don't normally drive this far south to eat but if I happen to be in the area again, I will definitely come back."], ["Alex B.", "The location is very nice. 5/5 the service is horrible and they do not deserve a 20% service charge. The receptionist asked if we have a reservation?!?! Seriously, the place is empty and have plenty of table available.They are very slow. There were 3 tables at the time we were there, it took them 45 mins to bring out out appetizer. The food is okay. Nothing wow!! 3/5."], ["Valentina L.", "Beautiful location! The food was ok, not the most delicious but it wasn't bad. I ordered a glass of wine and it was $16, expensive but it is a nice place to visit for the nice location."]], "Brasserie Azur": [["Laura C.", "This is on behalf of 12 people. The restaurant is amazing. The idea is awesome, the design and business concept is solid. The food is amazing, keeping portions smaller than other places - a pro. The waiters though, could use more training on proper customer service. Ours expected us to yell instead of trying to work with us. He also took forever serving my bf's beers. All 3 times. We had 2 birthdays going on and he basically hinted that it was too much work to get the other birthday surprise going. We didn't really care much but it was rude. We also asked him for the bill to be split from the beginning , and he joined all the orders up. Took us 15 mins to figure it all out. Music is also a tad too loud. But overall, a pleasant experience. I recommend it!"], ["Emily H.", "I'm impressed. I love the atmosphere, the food and the service. This great restaurant is sister to Villa Azure in Miami Beach. The restaurant specializes in Seafood and Rotisserie Chicken. For appetizer we started with the grilled Octopus and Steak Tartare which is prepared table side. Both were delicious. The Octopus was grilled to perfection and had a great citrus flavor. The entrees were amazing as well. The hanger steak was nice and tender and was seasoned perfectly. The red snapper was perfection. It was so fresh and simply prepared. It was served alongside a basmati saffron and peas rice. They had a great variety of home made desserts which were brought out table side which makes your decision even harder, but not to fear they offer the Chariot selection which allows you to choose any three desserts for the price of two. What can I say I was sold so I went with the Chariot. The tray that was brought table side included chocolate mousse, key lime pie, floating islands, Apple almond tart and flan. Of course I asked the waiter what he recommended and he said \"we have the best flan\" of course being the flan snob that I am I rolled my eyes and said next recommendation. He affirmed that hands down this was really the best flan. Of course I had to try. I wasn't too worried since I had two other choices just in case his flan recommendation was an exaggeration. I must say I stand corrected there are still some flans that give mine a run for the money. This was definitely one of them. This is a great addition to Midtown and I can't wait to return."], ["Cati B.", "Ok, this place blew me away.  From the decor, ambience, service and most importantly the food.  Boom!  We ordered the truffle pizette and seafood from the raw bar to start.  Delicious!  Then I had the steak frite as entree.  Fantastic.The cocktails and wine list are great too.  ]"], ["Silvio S.", "Stopped here for brunch. Great atmosphere, and  awesome food.  I had a bacon and mushroom omelette and my wife had the quiche with augratin potato. It was very good and worth the price.  Will return."], ["Larry P.", "Last Friday was my second visit.  Brasserie Azur was everything that I hoped it would be the first time.  The deficiencies from my earlier review have been cured.  Wine service was proper.  Service in general was much more competent, with no snafus and accurate, clear descriptions of menu items.The \"positives\" from my previous visit all remain, and the pastry chef still is my hero.  This time, I also tried the rotisserie chicken, which was as good as advertised; good char on the outside, tender and juicy on the inside.  Rosbeef with mashed potatoes, at $16 is a steal.  I plan to be back a lot, and to spread the word to others.  My first order of business is to run down the list of each Ricard-based drink on the cocktail menu."], ["Julie A.", "If you compare this spot to its sister restaurant in the beach you are doing yourself a disfavor.  Brasserie Azur is fun, the food delicious and the ambience very chic. - I had an excellent time!"], ["Jessica B.", "It was my first time here and I was pleasantly surprised. The restaurant Decore is beautiful especially the hanging flowers from the roof. The ambience was perfect. The staff was extremely friendly and well-versed with their menu. We were seated right away by the lovely hostess Victoria. The general manager Peter came by several times to check on our table to make sure all was well. We started off with the escargot which was delicious. Next we had the artichoke salad and tuna tartare. We ended with a truffle pizza that was to die for. I would highly recommend this restaurant and will definitely be coming again."], ["Paul R.", "Nothing too rave about.Service - needs adjustment. Hostess was lost trying to understand where to seat us (restaurant was barely busy)Servers and floor staff, somewhat uncoordinated, not polished when engaging in conversations, forgets menu items or doesn't understand the menu in general.Food - escargot/very plain, burratina/average, prawn brochette/good, but not amazing, lamb/served somewhat cold, had to be reheated, lacked flavor (although, potato gratin was tasty) Overall - nice decor, although missing some more conceptual direction. Staff not professional, nice and courteous, but professional looks different. MIAMI has many dining options nowadays; average performance is not enough anymore. Unfortunately I don't think this will be on my radar again in the future."], ["Adeline M.", "Iam french and i really found what was missing in miami .... Good food !!!!!!  Fresh, tasty ... Tuna tartare is very fresh and the chicken is the best chicken i ve eat in miami ... Hardly recomand this place  !"], ["Kat A.", "It's sad to say, but I was really disappointed.  The food was ok; they messed up our order; the place was empty (on a Saturday night) and just not worth the price."], ["didi w.", "Came here for lunch with two girlfriends and we loved the experience AND the food. The decor is outstanding and so inviting. Our wait staff was attentive and made sure our water glasses were always filled. The food came out at the right time, at the right speed. I had the warm goat cheese salad which was filling and nicely presented. The frisée was deliciously crunchy, a taste and a mouth feel that's hard to find in a salad in other restaurants. We also had a truffle pizette as an appetizer which was nicely cheese with a super thin crust. Oh and let me not forget the dessert! Pistachio raspberry macaroon, heavenly! I'll definitely be back for lunch or dinner to try out all their other delicious sounding menu items and enjoy the lovely uplifting atmosphere."], ["Carol M.", "I've been waiting for Brasserie Azur to open since I live in the neighborhood. Today I finally came to have lunch with my husband and I feel in love right away! The decor is beautiful, the food was amazing and the service was great! We had the burger sliders and the croque monsieur (one of my favorite French dishes) both were super tasty and delicious!! For dessert we decided to have the meringue floating island which was out of this world!! They bring some of the desserts in a dessert cart and it's very hard to resist, everything looks amazing! I will definitely come back!"], ["E D.", "I found this restaurant to be very pleasant with great food. Excellent atmosphere, beautiful decor, cute, friendly and helpful waitstaff, overall positive experience. Loved the truffle pizza!"], ["Walter M.", "We were there a few days after they open, the food was good, service was bad. We give it a second try last night since it has been open for a while now. Same thing, food was good but the service is horrendous, all servers run like a chicken without a head for no reason the restaurant was not even busy. Honestly service in this place is a joke, don't understand that concept but good luck with your business I'll never go back."], ["Victor C.", "Wow.  What more can be said of this superlative restaurant nestled nicely in one of the up and coming neighborhoods of Miami.  The gentleman from Villa Azur in Miami Beach (another amazing place) have hit it out of the ball park again.From the myriad of roses and flowers tucked into the ceiling, to the simple laid back ambiance, one wants for lunch, everything was exquisite,  We arrived about 2pm for Lunch and were greeted by smiling faces everywhere.  With friends seated around us at separate tables all telling me \"what I must try\" on my first visit, I knew Brasserie Azur would be a staple.  The beef tartare was made right at the table and was amazing.  The Croque Monsieur  was excellent, served with some side greens, it was a perfectly light yet enjoyable lunch.   Top it off with a bottle of ròse, and you have the perfect mid afternoon lunch on a warm Miami day!  Brasserie Azur is just a perfect complement to Villa Azur.  Subtle yet with an atmosphere and quality one would expect in a place substantially higher priced.  A place, where you know you can wander in on a hot Miami day, and enjoy an amazing meal, surrounded by an attentive staff (Eddie was awesome).  Can't wait to sample their brunch and dinner menu's!"], ["Joanna S.", "Place is very pretty, food was overall quite good! Latin music really doesn't make sense all night so I would change this to include more French/lounge type for a bit. I would recommend it! Lamb was fantastic!"], ["E J.", "Decided to check this place out for Miami spice. My friend had their lunch menu which included a salmon tartare, a meatpie, and coffee. I had their spice menu which included a salad in truffle oil, chicken with mashed potatoes, and for dessert a melon tarte. Service was great, staff seemed friendly, place has a nice ambience. Food was unfortunately not as expected. The salad was a bit too oily, the chicken with mashed potatoes was okay, and the melon tarte which was what I was anticipating most throughout the meal was underwhelming. I'm usually not particular with flavor and have tried some really great French restaurants, but this place didn't hit the spot for me. I came with a friend who is French and they were also disappointed.As for their lunch special, the salmon tartare my friend had was great and so was the coffee. Would still give this place a try though, if not for the food but for the bar and ambience."], ["Martin G.", "This is a new Restaurant at midtown. I went to eat during their first week opening. We were served at the bar the experience was very nice. We ordered burratina, truffle pizza, lamb chops and roast beef with mashed potatoes. Food was served promptly and delicious. The desserts are displayed on a show car. My girlfriend loved the experience because you get to pick 3 desserts out of 8 options. Portions are big enough that you can share. Cheesecake with raspberries coulis, lemon pie and flan were to die for. The cocktail list is fresh and unique in Miami with a classic French cocktails with Ricard(pastis) and others with beer. The bartender was super kind and knowledgeable!. In my opinion this place has a lot of potential and is a must go place when at midtown!!!"], ["Michel M.", "I went to eat at brasserie azur Saturday with my girlfriend and We really loved it. We were really excited because we were waiting for this venue for a long time.First, The restaurant is beautiful and the food was really good.We shared a truffle pizza as a appetizer and it was one of the best pizza I've ever had. Then my girlfriend took the branzino, and I get the lamb chops (yummy). Best part of the dinner : the dessert cart ! Service was very kind.I can say that I will definitevely come back."], ["Pedro S.", "Service was excellent my servers name was Cyrille he was very kind very attentive our glasses were never empty! Great attention to detail and the restaurant decor was just outstanding. As for the food I had a burratina with a side of pata negra as an appetizer  and for my main course I had the a whole branzino which was just delightful deboned and skinned at the table ugh just imagining this makes my mouth water. And finally the DESSERT omg I had the flan which is the best I've had ever and the pistachio macaroon to die for! Will definitely visit again"]], "Daily Bread Marketplace": [["Emilie G.", "The service and food here is deplorable. I arrived at 7:30 pm on a Friday night and was told that they close at 8 so I should have come in earlier. I proceeded to order and they didn't have half the things on their menu because (as they told me), I should come earlier. The guy was so rude. And the food they did have available was stale and just plain bad. If you are going to stay open until 8, then stay open until 8! Also, I asked the guy at the bakery if the baked goods were made there and he said no ... nothing is made there. Lovely."], ["Vivian L.", "I used to eat here often, but stop doing so because I would often order the Chicken but it was often pretty dry due to being overcooked. The tabule and the hummus is very good.I would have given this place a higher rating, but the service is super slow, and the servers can be rude. I visited there recently again, and was in line for about 15 minutes. When I was up for my order, a man standing in line behind me placed his order with one of the ladies there that knew him. She totally ignored the fact that I was before him. Even worse, when I protested that I was in line for a while and that they served someone who was after me in line, I had to repeat this as I was ignored! Then, they took my order- had me wait another ten minutes, to then advise me afterwards that they were out of chicken. They didn't even apologize! I was so upset- I ended up leaving and having lunch elsewhere."], ["Sarah M.", "I've been coming to Daily Bread 3-4 times a week for lunch or dinner take out. I've tried almost everything on the menu and am absolutely in love with the quality of the food and service. Not to mention that it's super healthy! As a chef and personal nutritionist in Miami I would recommend this place to all my clients. Also if you want to prepare any of these Middle Eastern dishes yourself their grocery market has everything you need, including great cheeses. It's a pleasure to support such a wonderful family run business.I definitely will be a customer for life."], ["Nicolay D.", "Food is good but staff is rude and lacking in basic serving skills and working English."], ["Steve H.", "Ordinarily this place would get three stars because of the problems with it, but they have stuff which is hard to find in this area, so I gave them four. I would give Wendy's three stars, just to give you a clue what three stars mean to me.First, the service is SLOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOWWWWWW­WWWWWWWWWWWWWW. Today is a Saturday, and I went to get takeout for lunch. During most of my visit there was no one present at the counter to take orders. Once the order was placed, my order, which consisted of stuff that was already prepared, took a long time to fill.There is no possible excuse for this. Other restaurants move quicker, so these people can do it if they try. They're harming their own business. The longer it takes to serve a guest, the fewer transactions there will be, and there goes your gross income. They could serve three times as many people if they were efficient.Second thing: bad location. They used to be in a place that was easier to see and get to. Now they're hidden in a weird building with a tiny parking lot. My truck is too big to fit in that lot, so I had to park on the street at an extremely expensive meter. I had to go out and put change in it while they fixed my food, because it only gave me two minutes per nickel.Third problem: they don't get the food to you in the best condition. It looks like they make the food from scratch, and it's very good, but they let it sit around. I lived in Israel, and I ate wonderful falafel there. It was fresh from the fryer. The Daily Bread served me a sandwich with room-temperature falafel which was a little soggy. It could have been excellent, had it been hot. They also gave me room-temperature pita with my hummus.The restaurant is simple but comfortable, and it looks really clean. It's quiet. These are pluses.They have a bakery and store in the same space. If you're a cook, and you want things like cardamom pods or semolina, the Daily Bread is a wonderful resource. They also have great Arab baked goods. You'll enjoy the Daily Bread, but it's a shame they're satisfied with such low standards. With a little effort, they could be really good."], ["Virginia M.", "As I'm currently taking a class at UM called 'Women in Ancient Greek', Mediterranean food is always on my mind. From falafels, shwarma's, gyro's, hummus, pita.. you get it. Anything and everything, I've been craving and this place delivers. Friendly service and there is a take-out option which one of the employees recommended as lunch hour is a bit crazy here. Just call, order and pick up when you're ready. Easy and pretty cheap for quality food. I'll be coming back here again and again (makes it easy it's on my way home from work hehe)."], ["Olga D.", "This food is yummy! So fresh and tasty! Stuff is friendly, mostly guys. Always stopping by when in the area. Baklava is awesome! If you like feta, they have huge bucket for $27."], ["Sue R.", "Slow and quite rude. Such a surprise, as I've been coming here for at least six years.I would have given The Daily Bread four stars, but I don't eat in, I always buy the food to go and it is great, so I can't critique service. But I can critique the people at the checkout and at the to go. There used to be a lot of super people working here, but no more. They made me feel like I was doing them a favor last week. The girl who took my order for a large, two pound-ish order of tabbouleh, some kibbeh and other stuff, was clearly very taken with the couple behind me and actually bypassed me to take their order (wraps) and do nothing at all about my tabbouleh, for which she had taken the order, which needed to be packed and added to my takeout, I had brought a whole lot of stuff like hummus etc. from the refrigerated area. I waited fifteen minutes, while this couple who were behind me chose their wraps, chatted, giggled, and the Daily Bread woman took no notice of me.Finally the manager came and said who is next and I said, \"I am\", and she said to the girl, \"What's going on\" and the girl just shrugged and got away with it!Anyway, of course I will still come here, but they seem to have amateurs who know nothing about the food or the ethnic origin of it, and that saddens me. The food is outstanding, but I wish the service was like it used to be and I wish the servers weren't rude. They never used to be. The lady manager was great, but she obviously has a lot to contend with.P.S. The kibbeh are a different shape and the crust is different from what it used to be, but maybe that's progress. The filling tasted the same."], ["Al Z.", "First of all, the reason I went out of my way to go to this place was because the great praise I had heard from people I know about a year ago. I had the Gyro Platter, and all I have to say is that I was not impressed. First of all the meat was burnt on the sides from seating in a hot Hotel Pan. I expected someone to cut the meat fresh from the Spin. The house salad look horrible. Just some pieces of lettuce, diced red onion and a piece of Old Tomato and a heavy taste of lemon juice....no other flavor.  The Rice Pilaf no taste at all. and the Hummus tasted like a paste with a heavy lemon flavor..that's it. I had heard only great things about this place but after tasting the food I was so disappointed. It reminded me of Hospital Food ."], ["Mia L.", "Twice we've bought Moldy Sucuk from them and twice they've given us a hard time about exchanging for a good one!!!! The woman at the register is EXTREMELY rude and throws attitude for the slightest things. She rudely told my boyfriend she wouldn't give him his money back so obviously she doesn't even listen because he only wanted to exchange!!!!! She also took about 7 minutes to bring a manager when asked. I wish they'd hire people who understand customer service!!"], ["Monica A.", "Only come to daily bread for your daily dose of rude servers. The food here is very good. But if you request taziki sauce with you gyro, it will be served with a roll of the eyes. The servers will make you feel like you are in a prison mess hall. Don't ask for anything extra."], ["Zeus A.", "Terrible service.  Workers were busy flirting with each other or otherwise occupied.  Did not acknowledge patrons.  After 10 minutes of waiting I gave up in frustration and left."], ["Tyrone J.", "Once was the best middle eastern food on US1 and I say that sarcastically. I first go in line and I'm served with an attitude! I want to but extra hummus in my plate and the just put on spoon on it! like a baby spoon for crying out loud! Falafel a were bad, I ordered a kafta to go my my wife and when she started eating it she spit it out! The KAFTA was spoiled! We both smelled the meat and it was obviously smelling nasty! So like I said there is a better place on US 1 better than this. Check it out on my past reviews!"], ["Juan G.", "Good portions, good prices and remarkably good food. Don't go for the ambiance or for the service cause there isn't much in that department. I've also read some reviews saying that the food was dry or bland, or nuked, but I haven't personally experienced that yet. Granted, I've only been here two or three times because I usually get my Middle Eastern fix at \"Middle East Best Food\", on Coral way and 17th ave, but they don't have as many menu items as this place does."], ["Patrick L.", "Referred to as \"the hippie place\" by some of my co-workers, there are indeed some beads, hookah pipes, CDs from Lebanese singers, and other trappings favored by our tie-dyed, hairy, smelly friends on display along the windows. There may even be a Buddha or two. This place isn't that visible or accessible, so many people overlook it or just don't know about it, instead crowding the more-obvious Grove-area lunch spots. The menu is basic Middle Eastern/Mediterranean - your kafta, shawarma, kibbeh, falafel, tabouleh, hummus. Most of these come in either a sandwich, or in platter form with the inclusion of a pita. I don't know enough to claim whether this is \"authentic, relevant\" Middle Eastern cuisine or not, but it stacks up well against other area falafel flophouses. My favorite is the shawarma pita, with its moist, flavorful slow-roasted beef. I'm going to subtract a star because I always end up paying just that little bit more than I feel my lunch here is worth. It should also be noted that if you need Middle Eastern grocery items that can't be found in conventional supermarkets, this is likely the best and most convenient option for a wide cross-section of Miami."], ["Elizabeth D.", "I'm having a serious Shawarma sandwich phase of my life right now. So naturally, when the craving hit while I was in the Grove, I decided to visit an old friend - the Daily Bread.We came in around five o'clock and ordered a Shawarma sandwich. The place was a little dead and more sad-looking than I had remembered, but my focus was on that delectable shawarma meat that was on a stick in the back.To my surprise, instead of slicing the meat, the lady behind the counter pulled out a small plastic container with shawarma inside of it from the glass encasing in the front. I thought to myself that this must be a more efficient way for them to serve a bunch of customers, but like I mentioned - the place was dead.To further my surprise, she stuck the plastic container with pre-filled shawarma meat inside the microwave and blasted it.With a sad, resigned face, I watch her make my sandwich with microwaved stuff.I paid, sat at a table and ate extremely dried out shawarma. If it weren't for the extra tahini I asked for, it would have been inedible.Why are you guys giving up on making excellent MIddle Eastern fare? I was so disappointed.   Please get your swagger back!"], ["Liz R.", "For years I been coming here ever so often when I get the \"KAFTA\" craving both the platter and wrap are far the best ones I've tasted."], ["William O.", "Walking through the doors of this place, it's like sliding down those pipes in the Super Mario series without the worry that you won't find Princess Toadstool before that sexual predator Bowser does something to her. You walk in to find that the place is just alive with the kind of little products and eats that are exclusive to small, family-owned, NON-CHAIN restaurants.Aisles full of varying breads and olive oils and various culinary sundries that I can't really pronounce.Your meal served on styrofoam plates, the cacophany of snapping plastic forks filling the air like some backyard barbecue sans your drunk uncle crying about Columbus' proclamation that Cuba was the most beautiful island he'd ever fixed his gaze upon (which he apparently said about EVERY Caribbean island).This place cemented my love of gyros.Behind the counter, beyond the door leading to the kitchen, every so often you'll catch a glimpse of a beautiful piece of lamb just waiting to be carved.And no, that's NOT a euphemism.Every time that door swings, it's like you're a ten-year-old boy again, and you know you're really not supposed to stop on the channels that should be blocked on your illegal cable box, but you do anyway.The tzatziki sauce is wonderful. Creamy without being too overbearing like tzatziki can sometimes be if the yogurt used is overly tangy. The lamb is forever fresh, which is an impossibility because you know they're not back there roasting lamb all the livelong day. I don't know what they do, but whether they just carved it or it's been sitting there for hours, it tastes like they just spilled the blood of the lamb all through the meadow.Too religious a reference?The only knock on this place, the knock that necessitated my giving it four stars and not five, is that I've often shown up to find that they weren't offering gyros. Now, that's not to say that there aren't copious other selections that will tickle your belly button, but when you go to a restaurant (or anywhere, really) for a certain something only to find that it's not being offered, you leave a little disappointed.Still, I'll keep coming back so long as that princess keeps getting in trouble."], ["Hugo B.", "As I work everday , as I struggle for my pursuit of happiness , I always enjoy the moment that I step into daily bread. I am from europe, origins from middle east and used to eat like a king. Daily bread brings me the flavor of my childhood ; kibbie , falafel , and of cours the hummus. Take a moment to enjoy Daily bread like me"], ["Jorge C.", "It's just okay.  They are amongst the many restaurants that are guilty of MICROWAVING EVERYTHING they can get their hands on.  I despise restaurants who employ the use of a microwave, big time.  If you are going to use it at least put it in the back where people can't see it.  I had the Gyro and it was just eh... I've had better."]], "Baklava Factory": [["Andres S.", "Shwarma was very well packed, good ingredients and made with loveService was outstandingFalafel is ok I'll come back"], ["Paul R.", "Ordered the Indian kabob platter this evening for delivery. While I began my meal eating the rice, I extracted a staple from my mouth!!! Called the restaurant and spoke to the so- called manager \"Jose Diaz\" who, after much urging, offered to reimburse me for the cost of the rice!! Are you kidding me? The owner, Patricia Diaz, no relation supposedly, was not available. Sent them a picture (staple prominent on the plate), and no response.This place is dangerous- and Jose Diaz is a joke!See the picture of the staple in my meal, posted!"], ["Michael S.", "While its outward appearance is that of a Chinese restaurant (aka Chinois Chinois), there is a hidden middle eastern gem inside with quite a varied menu.I tried the Rosto \"sandwich\"  - a pita wrap with roasted lamb, garlic spread and French fries.  It was fantastic - the lamb had good flavor and was super moist.  The fries add an interesting textural component to the wrap.I will be back to taste other items on the menu."], ["Ute L.", "Inexpensive and good Lebanese food with limited free parking in the attached private lot. The servers aren't as attentive as they could be but they make up for it in friendliness. For starters, the Italian salad is a nice size of mixed greens, fresh herbs, tomato, cucumber, gorgonzola and fresh walnuts. The honey balsamic dressing is great. It was so filling that I ended up bagging half. The vegetarian platter is a great deal and large enough to share. You get a big plate of tabouleh, five fresh hot falafels, three stuffed dolmades, hummus, baba ganoush and warm pita bread. I polished off all my baba ganoush, love that stuff. The falafel was also great. The dolmades were non-oily and had nice acidity. Overall, I'd order this again. To finish, I felt adventurous and ordered the Lebanese cheese knafeh, just because I wanted to know what it is. Imagine a bland soft stringy cheese topped with a buttery sweet semolina batter, baked, served warm and soaked in orange blossom syrup. Very sweet and floral tasting. It was certainly interesting but not sure I'd order it again. They have about five different kinds of homemade baklava, that is probably a safer bet."], ["Carolina C.", "I ordered for delivery through Eat24 and I never received my order. I called the restaurant and they said they would get back to me but they didn't. I had to call three times and eventually cancelled the order. I would not order for delivery ever again."], ["Juan G.", "I used to like their food and service. Regularly ordered delivery.Las couple of times, all the food has arrived scrambled up. The kibbeh and salad and rice and hummus, all scrambled up in the edge of the container. I will upload a picture of how my food arrived. Never ordering from this place again!"], ["Jose D.", "I ordered for delivery through eat24hours, after waiting 1h and a half, i contacted them to check what was going on and the response i got was the restaurant wasnt able to process the order due to internal issues. Thanks for waiting me wait 1h and a half for nothing."], ["Natalie T.", "I recently came to Baklava Factory for lunch with my boyfriend.  We should have left as soon as we saw they had combined forces with an adjoining Chinese restaurant, Chinois Chinois.  Mediterranean and Chinese don't exactly go together.We started with the grape leaves stuffed with meat as an appetizer.  They were very dry and bland.  Even though I was hungry I had one and declined any more.  We also had a side of tzatziki with pita bread.  The pita bread was served cold and was also bland.  The tzatziki was okay, nothing great and was very small.For an entrée I had the rosto sandwich, which was lamb with sauce, fries, and pickles in a pita wrap.  I ate it because I was starving but it was unimpressive.  Even less impressive were the 2 bone chunks I discovered as I was eating.  My boyfriend had some form of General Tso's chicken.  He had a few pieces but did not care for it so he  didn't finish.We came here with a Living Social deal and had about $10 left to spend so we ordered baklava to go.  This was the best food item we had and it was only okay.  I have had much better baklava.  This was very small and dry.I would avoid eating at this place for Mediterranean AND Chinese food.  It kind of blows my mind that other reviewers are raving about this place.The only positive I can point out is that the staff was nice."], ["Fina M.", "This is the one of the best places I have tried in Miami so far to get my Mediterranean, Armenian, Persian Fix; Shwarma, kabob, falafel, hummus, baba ganouj, Armenian coffee.Have ordered all of the above on separate occasions and all have been fantastic.On the pricier side than I am used to paying for in California, but they do give you large portions, and quality is good. And hey, I live in Miami now. Supply and Demand I suppose.People really should give this place a shot, if they know and love this type of food.  In California I was spoiled with so many options and have very high standards when it comes to this cousine.This is 1 of more than 7 of places I have tried in S Florida. And one of only 2 who have deserved a good review thus far.  4 stars because some of the favorites are not on menu that are staples and the pita seems to be store purchased, not made at location."], ["Laura G.", "Where do I start.  We ordered delivery and that was the only thing that went right.We ordered a greek salad and the following items were missing from the salad - calamata olives, pepperoncini, and citrus dressing.The Tzatziki was $2 for a dollop. The hummus was okay, nothing special.  Go to Mykonos for good hummus.  The Chicken Taouk Sandwich was okay, a bit dry.Overpriced for what we got."], ["Carson J.", "I was surprised that any resteraunt would try to serve mediterranean/middle eastern and chinese and sushi. I was hoping that if I ordered the mediterranean food it would be okay since the restaurant was probably originally mediterranean food. But unfortunately the food was really sub par and way overpriced. I got the veggie platter with hummus, babaganoush (sp.?), stuffed grape leaves, and falafel. All of which I usually love but at this place, it was pretty boring. My fiance got a beef shawarma pita wrap which was dry and tasteless. The baklava was probably the I've ever had."], ["Iris B.", "I go to this place at least once a month. The food is amazing! I recommend all of the platters. However, my favorite is the veggie platter and their lemonade is delicious! The staff is always pleasant and attentive. The restaurant is always nice & clean and the portions are big!"], ["Tina V.", "+review of delivery only+ 1/8/2014The food arrived in a mess, it was like they just threw everything in the bag and brought it to me.  The bag was even dripping... The delivery guy was really nice and apologetic so i let it go.  Now the food.... ehhh.... i think next time ill try it in the restaurant since it has so many good review.  For me the food i got delivered was a waste of money.Food: Grape leave with meat: (1/5) bland...Indian Beef kabobs with curry (1/5): overcooked, dry and bland.  The curry sauce could not save it.Armenian Sujuk kabob (0/5) it was not spicy as mention and hard to chew since it was really dryThe only good thing about the meal was the hummus but the pita bread was hard and stale... Faboush salad didnt try it i just threw everything away.  Overall (1/5) 1 for the hummus and delivery guy.  Other then that it was a waste of $30 for a platter with added Sujuk kabob and grape leave with meat."], ["Jamil S.", "So I order in from here a lot (only actually ate here at the resturant twice) and I do have to say that for a guy who loves Turkish/Mediterranean food-- I really like this place! I get the three kings and sambousik and wow are they great. The sambousik is spicy meat wrapped in a fried tortilla kinda thing. Totally reminds me of an Indian samosa: but different taste. This is absolute must for an appetizer and great to share w two people.The three kings comes w hummus, chicken, kafta kabob - and this Armenian kabob. Wow that Armenian kabob! Spicy tandoor kinda taste in a super well cooked kabob. The chicken and kafta are super well cooked all the time over a bed of almond rice. It's a great lunch or dinner that's not the same Peruvian food/ burger joint etc.check this place out tonight!"], ["Metin A.", "I really like this place they make good stuff for my taste,delivery is fast good is warm.I have never been there usually ordering to go and better than Pasha brickell period.They have a little bit of everything,rice is really good by the way.Recommended."], ["Vanessa O.", "I am a regular at this place. If you would like to indulge into REAL good Mediterranean food; this is the place. Fresh awesome fattoush salad, hummus, falafels EVERYTHING is good. Oh they also have Chinese food and sushi"], ["Hasan A.", "Halal pork lol? In what world...liars never succeed, especially when your service sucks to begin with"], ["Jose S.", "I loved eating food from here.. UNTIL TODAY! Placed an order for delivery through the Eat24 app at 6:58pm thinking that in about an hour, as they say (45-60min delivery estimate) I was going to be eating my usual Indian Beef Kabob.Well, an hour later I tried contacting them through the app since the time was up, they said delivery guy was on its way and should be there in about 5 mins or less! 1hour and 15min later, had to call directly to the restaurant to see what was going on and of course they were like \"I'm sorry about that, let me call the delivery guy and I'll call you back\". By this time I was getting mad.I waited 15 mins without a call back, so called them again.. \"I'm sorry, we've been pretty busy today but your food it's out for delivery and should be there any time soon\". At this point I'm already like \"Dude! That's not what I paid for, but still willing to wait maybe another 15mins\" (I'm such a nice guy), I was hungry and about to get Hangry.Oh and the lady after talking with her for the 4th time she pretty much said to me \"there's only one delivery guy for all the orders, it is what it is\"... :OLike if I HAD to wait because I've already paid with my CC.Anyways.. To make it short, waited a total amount of 2 and 1/2 hours for the food I ordered, called them to cancel it and the manager still has the balls to tell me \"I'm sorry for the delay blah blah blah I can give you 20% off for your next order\". No thanks, I already called Eat24 to cancel the order, this is unbelievable! And he goes \"I'll tell you something, if you don't like the food and if the food it's not warm (REALLY?!?!? After 2 hours) I will give you your money back.... Yeah, right! My answer was pretty calmed and educated: \"I understand how busy you can be but it's not my problem if you have only one guy for all the delivery orders, so please cancel it or I will have Eat24 do it for you\". OF COURSE, I had to make one last call to Eat24 since he wouldn't work with me.After I cancelled it, on my way to Mc Donald's (yeah, had to eat crap because of this BS) the manager calls me offering 50% off. Again, NO THANKS!And just before ordering my food at Mc Donald's, the delivery guy finally called \"hey I'm here with your food\". They were still trying to give me cold food that was cruising around Miami for TWO HOURS AND A HALF, just so they won't lose a sale.\"You can go back to the rest, I already cancelled. Thanks\"And then once again, the manager calls me back again saying that he gets me and he's very ashamed but \"threatening\" me that if I don't get my food, they can ask for my cc information to charge me because \"I did placed an order with them\"... And that's what they call \"Customer Service\"..For real man, learn how to manage your own business or if not, at least do not offer delivery service if you're short of employees and you're going to send the guy with 4+ orders I'm guessing, KNOWING that he won't get there on time... So then the poor guy won't get tips because of YOU! HONESTLY, Get your Sh*t back together...Ps: I'm rating only one (1) star because I have no choice .l."], ["Parita K.", "I bought a Groupon ($20 for $40 of food) a month or so ago and finally had the chance to try out The Baklava Factory this past weekend.  Overall, my husband and I loved it and will be back.  Don't let the outside of the restaurant fool you.  While it's not a 5 star place, the simplicity and casual ambiance make it just right for a fun meal out.Our server was very nice and gave us lots of suggestions.  He was super helpful when there was a mix up with our order and even offered to give us something else to make up for it.  The food was very good.  I ordered the vegetable platter and loved every bit of it.   One tip - if you are a vegetarian ordering this platter, ask for vegetarian grape leaves.  My husband ordered the 3 kings platter and said that the meat was very flavorful and moist.  We also ordered the potatoes to share and thought they were perfectly cooked and spiced."], ["John D.", "I've had two lunches there and one dinner.  Excellent food, and a great mix. Both lunches we ordered a Baklava appetizer plate and then a Chinese fish entre from Chinois/Chinois, which is in the same space -- Middle Eastern and Chinese together at last -- and why not? Free parking, which is an important plus in this part of town."], ["Jose G.", "Its good for what you buy. Really good but with a name like Baklava Factory do not expect made from scratch..."], ["Sureya S.", "I've been here a couple of times and have never been disappointed. The hummus is amazing. I recommend to start with a kibbeh. The kabob platter is my fav and the portion is plentiful. The prices are affordable and the staff are always attentive. I would recommend this place to anyone. You won't leave disappointed."], ["Luis G.", "Incredible food sow close to daily bread who every one talk about ant the food is terrible this place has the best hummus in town all the food was incredible and fresh not heated in steamer an bland people need to start eating beater in Miami try this place"], ["Shawn P.", "In an ever expanding effort to increase my food horizons, I decided to try Baklava Factory before it went out of business. This has no reflection on Baklava Factory but the location on the corner of the Coral Way Plaza has had no less than 6 businesses in 3 years.I hope BF will change that trend because it is good ! I tend to judge places more on service and atmosphere than food. What I liked right away is that employees - welcomed me and asked me had I been to here or their other location before - when I answered NO - but iI wanted to try something new - I was offered enough samples of things that I could have made a meal just from that.After my snacks, I settled on a Mediterranean Panini - strange mixed of name for a really great sandwich that was more like a juicy garlic chicken salad on sweet Pita bread - MMmmmm MMmmm good.I also had an assortment of cookies and snacks to share with my clients - just check out the pictures.And Bonus - the have outdoor seating and WIFI and being that they across from the BEST SPINNING Facility in All of Miami , I an see myself going there after class soon.They have Lebanese Soda and drinks too not sure how healthy they are but they looked tasty - even though one looked like it was wheat flavored ? but Maybe Shakira and Carla drink it and that's how they look so good ????"], ["Mona K.", "My dad and I were in the area and decided to stop by and try some delicious baklava. I was a bit dispointed that they didnt have much variety at the time we got there but they were more then happy to make some for us on the stop. Nevertheless, we did end up having some sweet cheese baklava and pistachios baklava. YUMMY!! We do plan on going back and trying the food!!"], ["Dan S.", "A little confusing to find this place as they are currently under construction and sharing a room with some sushi place. But, can't complain too much given the epic yelp deal that convinced us to dine here while on a road trip. It was our first experience with shawarma and we were asking ourselves why the hell we hadn't tried it before? Didn't realize it was basically a pita stuffed with all kinds of awesomeness including tasty meat! We went on Valentine's day and when we were first seated, it wasn't very busy but a hoard of people came in shortly after and our service suffered because of it. However, I think the manager noticed we had been waiting for some time and offered us free Baklava. Good move because we ended up buying more of it after we had tried it. Baklava is amazing no matter where you eat it, but this was exceptionally so."], ["Al K.", "The armenian Sujuk sandwich is good and I've been ordering it regularly for a couple of months.Unfortunately, my girlfriend just found a (used) metal staple in the beef sujuk platter today, which raises questions about the kitchen. We received a refund for the sandwiches.note: when I initially wrote this review, we had both vomited after eating the sandwiches that day, but I have reason to believe it was unrelated, so I've given a star back to the restaurant."], ["Abdul K.", "Ordered delivery from the Grove Isle Hotel and most of the food is pretty good. I am Middle Eastern, so of course it's nowhere near as good as my family's cooking ;)Kafta - 3 stars (a bit over cooked)Hummus - 3 stars (hard to mess up hummus)Chicken Shawarma - 2 stars (too sour and dry)Baba Ganoush - 2 Stars (no roasted flavor)Rice - 2 Stars (rice was shameful for Middle Eastern!)Garlic sauce - 4 stars (impressive!)Meat portions are kind of skippy too.OK.. the Knafeh was the ABSOLUTE WORST I'VE EVER HAD!It might be one of the worst things I ever put into my mouth! Super dry with rotten cheese. It should seriously be taken off the menu ASAP!"], ["Giselle C.", "their vegetarian platter was so-so to ok... a bit pricy compared to the quality. Their to-go service was extremely slow (40 minutes for a simple vegetarian platter). Friendly customer service. Not very likely I'd come back."], ["Canaan K.", "I'll keep it short. The place is nice, the beef shawerma is great, the best I've had in Miami actually, and if you get any of the platters it's a lot of food (choice of salad, choice of hummus or baba ghanoush, and bread and rice with all). I recommend the fatoush salad and hummus. Upon tasting the fatoush, I concluded the Arab food is authentic. I was a little worried it wouldn't be seeing that Chinese food is also served. I didn't try the so called \"Chinois Chinois\" menu. I used the Yelp deal which just made things sweeter. Good experience overall."], ["Jessica C.", "Mmmm.... Yummy pita. We came here because of the yelp deal, but were very happy with the place. It was tricky finding it since it is really part of chinois chinois. Service was amazing  and prompt. The food came out quickly. The lentil soup was great as was the hummus but I didn't have a chance to eat my falafel as I got full too fast. Great quick eats spot. Will def come back for late night falafel fix."], ["Miami Diva D.", "I love coming here to eat.  There is a great variety for every taste plus, it's consistently good."], ["Joeday D.", "The food is very good and I like to eat at the restaurant since they have Asian food besides the middle eastern but they really have to work on the delivery time since I have been waiting for 1 hour and a half now and still no food.  Very annoying when your in a hurry and they take your time like this.  This ruins they're reputation"], ["kim n.", "if it wasn't for the food (amazing beef swarma and rosto), I'd give this place 2 stars even 1. The rosto consisted of french fries, lamb and garlic sauce. Delicious!Now on to the service...The waitress only had one other party yet we sat there finished for nearly 20 minutes before we received our check.  Pickup orders were given priority as we sat there waiting for our payment to picked up. And then this conversation occurred between the waitress and I(keep in mind that I am Vietnamese American):Waitress: \"I thought you would have the chinese food next door\"Me:....And then there's more...W: Where are you from?Me: VietnamW: Oh, so are your parents chinese?*SMH*"], ["Kalyan V.", "Great food and good service. The Turkish coffee and bakhlava are must haves!"], ["Beatriz S.", "This is the BEST of it's kind I've found in Miami. My grandmother was Lebanese and a wonderful cook. I've searched far and wide for kibbeh like hers and the perfectly \"lemonized\" tabouleh she used to make. From the minute they brought out my chicken kebob platter at Baklava Factory, I knew I was home. The dish came with labna (soft Lebanese cheese), hummus, pita, sliced pickles, and some of the most wonderful tabouleh I've tasted outside of my grandmother's kitchen. All of the ingredients were on point and the chicken was seasoned and cooked beautifully. The presentation here is great too: hummus artistically smeared on the plate, topped with a little olive oil and sprinkles of parsley everywhere. All of this for $10! It was a gift. The restaurant has FREE parking in the lot beside it. The interior is decorated simply and contemporary: flat screens showing Egyptian music videos, wooden tables and chairs, a long bar for single diners, and an open bakery station where fresh baklava is being made. The service is good and generally speedy so it makes for a great lunch spot, if you work close by. Give this place a try, habibi!"], ["Ron S.", "OUTSTANDING Lebanese food AND among the best Chinese food in the area as well (I know - don't ask)! The owner is usually on premises and the food is always excellent. Very affordable and FREE PARKING!Mixing the best Middle Eastern AND great Chinese food seems kinda weird, but the food is always great, the service is friendly and it's easy to get in and out! Baklava Factory, Chinois Chinois - both are top recommendations."], ["S K.", "Good food and friendly staff.  Lentil soup very good and falafel was yum.  My friend who is moving out of town is planning ways to visit Miami just to return here."], ["David S.", "This place serves up some hits and some misses, but it's pretty decent overall.The Good:- Shish kabob - juicy and tender- Kibbeh - my first time having it. nice spices in the meaty filling.- Baklava - they were all tasty- Falafel - not badThe Not So Good:- Baba Ganoush - i second Abdul - where's the smoke?- Tabouleh - disappointing- Pita bread - cold and a bit stiff- Rice - a bit smushyI think that's all I had.I'd go back and try some other things on the menu, but one thing I'm wondering is why is lamb served only at dinner? Do they slaughter during the day? Odd."], ["Iamafoodie M.", "But for the price, the food , the place, the service, the surrounding area was just fabulous. Though I had a yelp deal $20 for $40, this is just a warning for people who go there without deals/coupons. The food was awesome and the waitress helped us choose the best possible dish (Stuffed Grape leaves,Grilled Chicken platter with hummus, garlic dip, Fatoush salad and rice)- my first time at Mediterranean food. The chicken kabob was delicious, which we ordered more for $3 per stick (5 pieces). We sat in the adjoining Chinese restaurant as this place had just 1 table! The dessert - Baklava was awesome! They had 6 varieties of baklava. It totaled out to be $33 and we added 10 more Baklavas for a to go!  The service by the lady was just so good. Will visit them if I get a chance in the future."]], "Miami Mediterranean Cuisine": [], "BarMeli": []}