{"Taqueria El Carnal": [["Ricardo D.", "This placed hit my taco craving right in the spot. Had the carnitas and pastor taco and they were both great. Friendly staff."], ["Lila W.", "-Great food and low prices - Not in the best area- Seating is on patio furniture - Service was friendly- It's far from my area but I'd definitely go back for another late night snack"], ["Mike M.", "This place is awesome. Good tacos at a great price. Cater asada are my favorite. They also hanger good service. Highly recommend this place."], ["P B.", "for the price, the food is OK.what is better are the excellent waitresses, the feel of the place (mexican music blaring) and the street-food feel. Good chips and guac. Recommended in a city with ZERO mexican options."], ["Juan Francisco C.", "We surely were the tastiest things there. And no, we were not drunk. You thank us later. They do accept credit cards, so it is still the USA."], ["Patrick L.", "It's pretty difficult to argue with cheap, simple Mexican food. I do mean simple - tacos here are really nothing but chopped marinated meat in a corn tortilla, with a little cilantro and onion if so desired. Very simple, but effective. I like the four tacos sampler for around $10 - as I recall, you get beef, carnitas, al pastor, and lengua. Of course, which one's my favorite? You should have guessed - the tongue taco. They're all great, but I feel the meat in that one has the superior texture and flavor.Don't come here expecting anything fancy, either regarding food or surroundings. There are other places in town that do gussied-up tacos - this is plain street food. No AC here, either, so be prepared to sweat it out, whether sitting inside or out. The perfect time to come here is when you're still hungry, on the way home after a night out. The 4-taco combo will set you straight."], ["Tania G.", "Great late night cheap mexican food! Sopes, Tostadas, Tacos & Tortas all delicious,  the spicy sauce (one in the clear ketchup container) is much Spicer than the one at their Flagler location. Give it a try better option than McDonald's or Taco Bell"], ["Jennifer M.", "Not bad, but it's not a 5 star. The 2 sopes I ordered were really tiny, but overall good and the price is not bad at all. Some guy next to us ordered the fajitas, and smelled delicious, maybe I'll try that next time."], ["Marc G.", "Eat here. Get the guacamole. I had the tacos. My dining companion had sopes de pollo. Chicken was really good.  Sit outside on the street, have some Mexican beers and enjoy the food."], ["Gabriel E.", "Great deal on beer, solid tacos and other fare, and fun sidewalk seating. Exactly what you want/expect from a taqueria."], ["George B.", "Maybe it was an off day (Saturday 7 pm) but this is not a 4.5 YELP restaurant. My carnitas tacos were really greasy, but still tasty. Wife had mole enchiladas that we're flavorful, but dry. I guess we can't complain having that and 2 Modelos for $20. We don't plan on returning."], ["Maggie V.", "The east strip of Calle Ocho claims a couple of authentic Mexican restaurants, El Carnal 2 looks particularly enticing. It reminds me a the taco stand and hole-in-the-wall-wall places that I miss from Los Angeles. But I was disappointed by the experience last night for dinner. The experience is authentic enough, but the food is mediocre. Ordered the taco platters with a combination of chicken, beef and flavored pork (pollo, carne asada, y al pastor). The taste was ok, but the quality seemed lacking. The meat was overdone and cut so small is almost seemed like ground meat. The menu is pretty limited, so I would have expected better quality dishes. Not bad for a quick fix, but I would recommend El Rinconcito a few blocks away as the best I ve had in Miami so far."], ["Danny F.", "What. Is. Going. On. Here. Being the only patron at the time, and taking my time to read the reviews and choosing what the majority says is good here, the food cannot possibly be any different from when you get it.  But I don't get it. I order the flautas and a Agua de Jamaica. The wait time was reasonable, and the only reason I mention this is because I had nothing else to do but count the minutes. The seating is very awkward and there is no A/C. Something I would experience in Nicaragua with mind blowing food to follow.That's not the case here. The food arrives, and it looks incredibly amateur. Alongside small portions. The taste itself? Meh. Now... Meh anywhere else would be passable, however when i'm sitting on a small bar stool and barely getting a breeze on a warm day... it sucks. The tea was also meh.No I won't be back."], ["Karla S.", "I was honestly left unimpressed with this restaurant. Maybe my taste buds have been spoiled by better options down the street, but I found the food rather lackluster. It isn't bad, there is just simply better Mexican food now in Miami."], ["Marie S.", "....MEX---ICAN!!!I have tried everything from the enchilada to tostadas, to burritos to quesadillas.. and tacos al pastor! The food is always hot and made to order. The man at the counter is really friendly, and he always explained everything to us clearly. I really enjoy the restaurant wall- decorated with mexican decor.I live a few blocks away.. so whenever I'm feeling Mexican.. this is my stop!!!TRY IT, YOULL LOVE IT!"], ["MICHELLE C.", "They have odd hours and one day we drove past and they were finally open.  This place is super small with a walk up counter.  We ordered off the small menu and took our food to go.  We ordered some taquito's and carne asada taco's.  The prices are super reasonable, be prepared to wait as they make each order fresh.Loved the soft corn tortilla's, they were small but so tasty and fresh without being to thick.  I prefer when they are more on the thin side.  They stuff a ton of meat, no skimpiness here.  The meat had good flavor and the taco's and taquito's were good.  Not the best I have had but tasty. One thing that was strange to me is all ingredients such as the sauce, onions, lime, etc...were all in separate little plastic bags to put on yourself.  Funny little balls wrapped in tiny plastic bags, very odd as I would have preferred it just being put on.All in all I would so stop here again and grab some taco's, it reminded me of a taco truck you would find on a corner in a neighborhood.  Service was OK and even better when you speak Spanish."], ["Rolando R.", "This is THE taco / mexi spot in Miami. Don't believe anything else.1) Service is ALWAYS warm & hospitable and quick. I've been here 20 + times (prior to discovering yelp check in on my phone!) and never had to wait long, not even during the drunk peak hours (not that I remember anyway) After a while, the dudes working there get to know you and will shoot the shit with ya. Once saw Titanic with the owner over some tacos. 2) Everything on the menu pretty much kicks ass. My favorite are the carne asada tostadas, I've had tostadas at some of the nearby competitor mexi spots and none of them compare to Carnal.3) SAUCE BOSSES. These guys have the best sauces and ALWAYS bring them out to you with a generous portion of a yummy pico de gallo to add to your tacos4) CHEAP prices"], ["Johnny T.", "I'm officially a Miamian now. I pay in cash. I have significant road rage. I'm late. I get my car fixed in parking lots by 'a guy.' And, now, I've been to El Carnal in the middle of the night to eat Mexican food and sit on the street.My story to get here began, as I suspect, many tales that end at El Carnal 2 does: productive work day, a text to join some folks for a couple of beers, a couple turns into [my mom may be reading this], speech starts to slur, bars are hopped, bad decisions are made, kidnappings from Rony Romances occur, food trucks in sketchy parts of town are visited, passion fruit juice at said truck is demanded, and before you know it, you're standing inside a taquiera on Calle Ocho, contemplating all manner of food and looking at foreign currency that you had no idea existed.Are you still in the States?Check yo'se'f, f00l: you've been kidnapped by one of the greats. Eat your food and beg to be driven home at some time in the coming weeks. Knowing that resistance was futile, I ordered a beer (why not?) and a chorizo huarache with cheese and green sauce. While not as life-changing as the huaraches I ate to the point of stomach ache back in Chicago, this Miami version was quite tasty. But, really. When are onions, pork, cheese, and salsa not a winning combo. I would have preferred a bit more depth to the corn base but, at that time, I also would have preferred to be in my bed. Neither was happening any time soon. I also took advantage of the other salsas and tried to change up every bite with a different one. I kept, though, coming back to the green. Since you're kidnapped and at the will of your captor, play along and shoot the breeze with other kidnapped/kidnappers. These are salt (or, drunks) of the earth. Case in point: one kidnapped/kidnappee screached to see a foot-long roach ambling about the street, poised to attack someone. I went still in an effort to utilize my chameleon-like abilities to blend in and, hopefully, be spared. One of the kidnappers, taco in hand, kicked it (because it was large enough to be kicked) into the sewer and kept on eating. This, ladies and gents, is my new home.Is a LeBron jersey next?"], ["Michael N.", "Tow words: Tongue TacosThis is a great place to go to when you want to eat something to take care of your drunk ass. It's cheap, the food is great, and I personally like the crowd that hangs around there. Just a bunch of people with their tacos, and talking trash.Only thing that I don't like is that all the condiments and extras for your tacos are put in little plastic bags. Normally I wouldn't have a problem with that, but when you're drunk, it'll get messy.Reminding all you yelpers out there. Get the tongue tacos! People get grossed out because it's tongue, but I'm sure that you'll love it the moment you try it. Tongue is probably the beefiest tasting part of the cow, and El Carnal is one of the few places that serves it and prepare it very well.Try to make El Carnal your last spot on your next Miami weekend. I'm positive you'll love it."], ["Naty S.", "El Carnal 2, and uninviting little door with \"La Virgen de Guadalupe\" in a cage over a colorful rock...once you pass the clear bags filled with water to scare the flies away ... you encounter a wonderland of authentic Mexican food (and not the Rosa Mexicano or Lime style) these people mean MEXICAN FOOD for less than $10 a plate.If not familiar with True Mexican food this is the spot.  You can try Tortas (famous meal for el Chavo del 8) Guraches, Tacos, Flautas, Carne Asada, Tostadas, and a few more Mexican dishes. Your meal must be paired with a Sidral (apple soda) or a Jarrito of any flavor Tamarindo, Mandarina, Lime, Fruit Punch  these Mexican Sodas are always available at el Carnal 2.Customer service is fantastic, owner is always behind the counter making sure you enjoy every detail of your visit to this very small restaurant with less than 10 stools and 2 tables outside.Opens late so it is a great option for an after party meal instead of the taco bell drive-thru or La Moon near by.Best Taqueria in the area...!!! Try it.."]], "El Rancho Grande Mexican Restaurant Kendall": [["Jorge L.", "Called ahead and tried to order my meal ahead. Attendant on phone asked for my name and phone number which I gave. When he totaled my order out it was approx 65.00 plus, at which time he told me that he needed my CC info which I explained I was driving in rush hour and it would be hard to do that. He then told me that he would not order it until I arrived there. I told him that he should Comp me a drink and he said he couldnt do that. I told him that what he was asking me to do was the same as walking off the street and ordering the least he could then was to comp me a drink. Question why did he ask for the cell number if he was going to require a CC number. Really terrible phone service wouldn't recommend this place to Anyone. Based on the experience, won't be eating here  again."], ["Beatriz A.", "Best burritos in Miami! Even though the place is quite pricey it is worth it. The service was ok. My server wasn't the nicest in the bunch. But the good was overall the best."], ["Jersey G.", "Plato Mexican! Holy Mole! So good, I ate everything and then was in pain lol. This place is close to us, and I can't believe we kept skipping it. It's always packed and I'm glad we finally got to try it out. It's not exactly inexpensive, but the food is good and plentiful, and our server was attentive. Having lived in Texas for many years, I'm always looking for good Mexican food and this place did not disappoint. Friday/Saturday/Sunday is pretty busy so be ready to wait a bit before you are seated. Will be back many times."], ["Eva C.", "Very friendly and helpful servers. Cute and quaint little Mexican place with a great selection of drinks and food. Great margaritas and amazing chillaquiles! Definitely planning on going back!"], ["Yisel A.", "Twice this place has stolen my credit card number..TWICE! I gave it the benefit of doubt the first time but the second time it would be impossible for it to not have been them. Never coming back again! BE CAREFUL if you pay with your debit card, better yet and to avoid a headache, pay cash!"], ["Johana H.", "I loved this place! My boyfriend is from Texas and he hasn't been back in a while so he was missing his authentic Mexican food so on his birthday I decided to bring him to this place, it was both our first time and we fell in love with it! He was very excited specially when we found out that our guacamole was going to be made right in front of us, so fresh and delicious! The rest of the food was amazing and the ambiance was very welcoming and fun. My boyfriend was super happy and that made my night plus the margaritas haha :) .. We will definitely go back soon!!"], ["Gabriel T.", "Very good burrito and service although restaurant was hot with the door being opened often on a scorching hot day. I'll be back though for sure."], ["Kalpna P.", "We were looking for a perfect place to have my fathers 80th. We had to find a place that was good for vegetarians also. They were amazing Taking care of a large party of 18. Service was impeccable. Good choices with all types of food and option for our special requests.  Would higher recommend this place if you're looking for great Mexican food. Miami has very few good Mexican restaurants.."], ["Mildre T.", "It was expensive and was not authentic.  The tacos didn't come with sauce and apparently I had to ask for it.  The Horchata was pretty amazing though--it was made with milk."], ["Jose Frank A.", "Authentic Mexican food! Great taste and very natural. Service and prices ok. Guacamole is amazing. Also Pastor Tacos."], ["Annette S.", "This is my new go-to for Mexican food.  The fondido de queso was served bubbly hot with fresh warm tortillas...the chimichanga was so yummy and enough for at least two meals, and don't forget to try the spicy quava margarita..OMG.  Great service and atmosphere also."], ["Soraya A.", "The service was excellent. As, soon as we were seated, a server brought us homemade chips and salsa, another brought water, and a third took our drink orders. Our server quickly came by to greet us and introduce herself. Four people waiting on us in a span of two minutes.Three adults shared the Mexican Parillada, which was absolutely delicious. Imagine a large fajita platter loaded with jumbo shrimp, chicken,  beef, Mahi - Mahi, onions, peppers and tomatoes,  accompanied by guacamole,  beans, yellow rice, sour cream and warm tortillas. For dessert we ordered the fried ice cream which was beautifully presented in a fried tortilla bowl and served with fresh strawberries, bananas, whip cream and drizzled with chocolate. The food, service, and ambient were all excellent. We will definitely return."], ["Michelle E.", "Came with co-workers for lunch. Food is absolutely delicious. The staff is so friendly and extremely attentive. The bathrooms are clean and well kept. Today was the cinco de mayo celebration and they had mariachis performing. Only complaint was that it was freezing so bring a sweater. Restaurant is small but definitely a must try."], ["Eric I.", "Amazing holy crap I love this place!!!!!!!!!!!!!!!!!!The best fajitas, and it's so authentically Mexican!!!"], ["Charity Z.", "No matter where the road takes me, I always end up here. I've been to many Mexican restaurants in the hopes of finding that \"greener\" place only to come right back to El Rancho Grande. I have to say that it's by far my fav spot for Mexican.  Hadn't been in a long while and today decided to come back for dinner with some friends. The place was packed. We were told that it would at least be a 30 min wait, but we were seated within minutes. Which is an automatic star. When you're with 4 hungry children time is of the essence.  The service is on point. We had at least 3 waiters tending to our needs,never leaving our basket of fresh chips and salsa empty. The margaritas where perfect, not to sweet and not to strong.  My favorite choice are the tacos al carbon. Perfectly seasoned and just right. The Burrito is huge and full of flavor. The fresh guacamole made right at your table has to be the best I've had. All in all this place does not disappoint.  They get it. Good service and good food."], ["Reina T.", "This place is as authentic as any place in Homestead. I had the most tastiest guava margarita in town, and delicious chicken tostadas. The guacamole is no longer table side and I was not wowed by it. Will definitely continue enjoying this little gem we discovered."], ["Ailyn Q.", "Best authentic Mexican restaurant in the Kendall area.They have a very good turn around going even on a busy Saturday night. They are very efficient at seating the guests. Anything you order is delicious! If you like guacamole, I think theirs is the best in town. They even make it right in front of you.The drinks are amazing! Margaritas are a must-have.They are also very up to date technologically. They have a small tablet where you swipe your own card and have the option of printing the receipt or e-mailing it to yourself."], ["G S.", "I dined as a solo female, wearing casual clothing running errands after work. I was handed a menu and sat in the very back where all the staff congregate so that the staff could see me and would not forget to take my order. I put the menu down and was looking around which indicated I was ready to order. Ignored for 30 minutes, staff waking all around me, including the blonde lady who sat me down in the beginning. I flagged someone down and she took my order, very polite. Disorganized as no one knew who was doing what and no one checked if anyone took my order. Or it could be that they ignore solo females because they think we tip badly. Overpriced and they use fillers. Pleased when these ginormous crunchy ground beef tacos arrived until I saw the filling. They were 90% lettuce. What they do is mix a few pieces of beef into the shredded lettuce, then they fill the taco with the lettuce mixture and top with minimal cheese. It was basically lettuce and shell. Same with the steak burrito, filled with 90% rice. I asked for no beans in it but still barely got any beef, only tiny bits, and it was not tasty, not for those prices. This place is pretentious, trying to present as a sophisticated high class restaurant with their black shirts and ties. NOT!! Probably trying to mimic the beach location who dresses for tourists. I've never tasted the food at the Miami Beach location but this Kendall location is tasteless low quality food and way overpriced. Obviously they have no quality control measures in place or they wouldn't be serving this stuff. I'll not return."], ["Miriana M.", "This place is always packed yet the service remains solid! Seems the staff is on top of everything without making the guest feel that way. Their guacamole is by far, one of the best ones I've tried in Miami! I ordered one of the underdog items (compared to others) on the menu, fish tacos and they were delicious!"], ["Barbara B.", "Growing up in Arizona I take Mexican food very seriously.  This has to be one of the best Mexican restaurants I have been to outside of Arizona. Tableside guacamole is a must have. This is a vegetarians dream restaurant my girlfriend had the vegetable chimichanga and it was stuffed with at least eight different vegetables not your typical onions mushrooms and peppers. I had the chili Rellenos and the flavors were outstanding. The inside is cute.  tThe server was great they have cold beer on tap and great margaritas. I'm just sorry I live too far away but if I'm passing through Kendall again I will definitely stop in."]], "Mi Rinconcito Mexicano": [["Sherry W.", "Awesome authentic Mexican food.  I found this place on yelp and was extremely pleased with the experience.  We went late on a Friday night.  There were a few parking spots open in their back lot for free.  They were about 50% full at 9:30pm.  The menu is in Spanish and English.  Some of the wait staff doesn't speak English, but they will get someone who does if you don't speak Spanish.  They brought us complimentary chips and salsa.  I was so excited to see the chips were made with fried flour tortillas like you find in Mexico.  The salsa is red and has a spice to it.  It taste more like a certain kind of pepper than tomato.  My friends started with the tortilla soup for $7.  The portion is HUGE.  It is topped with the fresh fried tortilla strips and chunks of white cheese that melts in the soup overtime.  The soup has great flavor.  It is enough to be a meal or split with 2 or 3 people.  We ordered the 3 way combination platter to share.  It is a great way to try a lot of stuff for $18.95.  It was a great deal!  It comes with three meat types of each: fried taco (like a taquito), tostatos, spope(fried thick semi soft tortilla), enchiladas with green sauce.  The meats include a shredded pork, chicken, and diced steak.  My least favorite was the chicken because it was dry.  My favorite was the pork...very juicy and full of flavor.  The steak was also excellent.  Not fatty and had good seasoning.  They use the white crumbling (cojita) cheese to top everything. I also ordered a side of refried beans for $2.  It is enough for 2 or 3 people to share.  It too was topped with the cojita cheese. The beans were very well flavored.  The service was good.  Our food came out quickly.  You may need to ask for items...spoons and refills.  The delicious food makes up for any lack of service.  I would definitely return to this restaurant.  I love Mexican and this was awesome! They also have a bakery area."], ["Sarai M.", "I'm not a taco fan I came because my mom wanted Mexican food. There food was great, as well as the drinks. The waitress was a little off I guessing since her shift was order. But overall was a nice lunch place."], ["Minerva M.", "What a nice surprise!! This place is awesomehad the margarita witch it was a big nice glass and heavy on the tequila!!The gorditaa are similar to an arepa. Tasty and full of white cheese . Try the sampler plater so you and feast  on all the great stuff the have. The panaderia has great dessert pastries and delicious bread. A must must try! And will come back for more"], ["David R.", "Food is good but Service is so bad and slow it doesn't make it worth to bother coming."], ["Francisco D.", "Hands down the most Authentic Mexican flavors you'll find in Miami. Take it from the pickiest of people when it comes to Mexican food. I hate when people try to reinvent something that's been good for centuries. This place sticks to traditional flavors. I guarantee you they have a Doña back there cooking. If you try nothing else, have the Barbacoa de Borrego tacos. Tastes just like Mexico!!! Oh, and you can't beat the prices!! You'll eat like a king and queen for under $40 for 2 people."], ["Olivia A.", "You look to the left of the door and there is a shrine of a large virgin mary, I knew I came to the right place. Let us talk about real mexican food. The nachos they have here is to die for. The salsa with the free appitizer tortilla chips is spicy and strangely addicting. Heard of the chipotle burritos? I forgot what chipotle even was, because the burrito here is the same price and double the size and packed with so much flavor.I had the chicken quesadilla, and its just chicken and cheese in a thin tortilla and it was still better than most that I have had. I was so impressed with the food, that when the bill came out to around 25 with 2 cokes, nachos, chicken quesadilla and a burrito, and two fat happy people, I left a generous tip. It's on a one way street so be sure to be on the left lane and get ready to turn into a small parking lot. If not, you'll have to go back around."], ["Suhey S.", "The food here is truly awesome, unfortunately the service here is TERRIBLE. Mainly the problem appears to be that they are short staffed ALL THE TIME. A table next to us ordered and had to leave because it was about 45 min later and they still hadn't been served. If you're okay with waiting several hours for what should be a quick dining experience then go for it, the food is great, but for me, it's not worth the aggravation."], ["Nathalie B.", "Mi Rinconcito is currently my favorite Mexican restaurant in town.   I find myself craving them all the time because the food is authentic and fantastic.  It's a small location on 8th street and if you drive by there too fast you might miss it.  We come here at least twice a month and always get the same thing (if it's not broken why fix it, right?).  I always get the 3 carne asada tacos and my boyfriend gets the carne asada platter.  Delicious!  The service is not the greatest but the food makes up for it.I always recommend this place when someone asks if I know a good Mexican place."], ["Jessica W.", "One of the best Mexican restaurants I've tried in Miami. The service is friendly and efficient. I tried the chicken enchiladas, which were delicious! Their portion sizes are generous and very reasonably priced."], ["Tatiana M.", "For the price, the quality of the food was wonderful! The place is a \"hole in the wall\" but definitely worth trying out if you're in the area and craving a Mexican meal! We had the beef and carnitas tacos (delicious!) their chips and guac were also really good, so we're the fajitas! The service was great and we'll definitely be returning!"], ["Arhlene A.", "we were here last night after closing night and going to the party afterwards (last year there was plenty of food at the party but nothing vegetarian friendly therefore we decided perfect let's go eat first) for GEMS Film Festival the pre Miami International Film Festival - The food is good actually and the vegetarian section on menu is what got us here, the staff is nice too..foodies know were to go!"], ["Bryan B.", "I had the lamb tacos and shrimp ceviche tostada. Both were outstanding, and the service was efficient and attentive. Its so refreshing to find simple food in am easy setting done right. 5/5. Ill be a regular here."], ["Iris C.", "Best Mexican food in Miami! Hands down. Fast service and very good prices. Again, the food is PHENOMENAL!"], ["Kristen P.", "Service is terrible but the food actually makes up for it. Seems like a little hole in the wall but yummmmm food. Prices aren't bad either. Very authentic Mexican"], ["Maria B.", "This place makes me want to move to Miami!!!!! so good and so authentic. I can't wait to go back. We had the combination platter and the torta. My favorite were the enchiladas and nachos.  Also their Jamaica water was on point. Really nice decorations. We got there an hour before closing and it was packed and stayed pack past closing time. good prices!!!"], ["Lucy F.", "Eating here is almost a sporting event - you want to eat everything and as fast as possible because it's sooooo good! We started with ceviche which was amazeballs! We got a cheese dip because they were out of guacamole. It was okay - just too firm for my taste but it was good. I'm just a picky person. Then we got the mixed fajitas, chicken floutas, and a steak dinner at the table and everyone was very happy with their food. I personally love their homemade chips  - they were the bomb! I would stop by and buy just those for a to-go order no joke! The service was spot on and I can't wait to go back!"], ["Patricia N.", "The carnitas were amazing as well as the queso fundido. I would definitely come back."], ["Gabriel R.", "Best authentic Mexican food I've ever had outside of Mexico, really good service as well and great prices!Very simple place but it's nice and very clean. I go at least twice a week since a friend recommend it to me.If you like Mexican food you won't be disappointed"], ["Edwin P.", "I came here last night after my return trip from the Food and Wine Festival with my girlfriend. She comes to this location once every week and suggested I should try it. This is a very small restaurant tucked along 8th Street. Parking, as it always is on 8th Street is an adventure but at the same time fun.Upon entering the restaurant we noticed how packed it was for it being 7pm on a Sunday (of course, I should have realized it was Dia de Los Muertos); we were able to snag a table on the corner and were immediately attended by a very polite waitress who promptly took our drink orders and delivered a plate of fresh tortilla chips with the spicy red saucse. The tortilla chips were very crispy and delicious.My gf suggested I should get the carnitas tacos and she got the enchilada platter (which consisted of three enchiladas smothered in the aforementioned red sauce and the mole sauce. The food was promptly delivered. Now I've had a lot of tacos before, but these tacos were probably the best I've ever tasted. The carnita was tender and full of flavor and with the sauce on top of it, oh boy it was heaven.My gf stole one of my tacos and I stole one of here enchiladas that was smothered in mole poblano. Now mole poblano is a traditional Mexican sauce which contains about 20 ingredients, including chili peppers and chocolate. From what I was told, this is not a simple sauce to make as it takes a lot of hard work, but if done right (as it was done here) then it is probably one of the best sauces you could ever have. You could tell everything that was served was made from scratch and not refried or recooked.All in all, for being a little hole in the wall this is probably the best Mexican restaurant you will find in Miami-Dade. Highly recommended"], ["Samantha G.", "Best little Mexican place in Miami! Apparently, Miami is not the place for Mexican cuisine. Cuban and Haitian, yes. But the closest you get to Mexican is Taco Hell. Sorry, I meant Taco Bell. I can't even remember how I found this place smack in the middle of Little Havana years ago, but finding it was one of the biggest accomplishments. This place is pretty cheap, especially when you're broke as a joke in college. They have these combination plates that have quesadillas with meat and cheese, sopes, gorditas, and flautas. It's a ton of food for one person so I usually share. They also put pieces of pineapple in the meat for extra flavor. Cons: parking might be tough to find in the back, so get there early!"]], "Barrio Latino Restaurant": [["Julio M.", "This was our first time here, but we will be coming back for sure. The vaca frita was great, as was the Milanesa steak my daughter had. The portions were enough to feed two people and included rice , beans and a side. Our waitress Mirna was excellent, she was very attentive and constantly checked on us. It's employees like her that make an establishment flourish. It was a great dining experience , and we will be coming back soon. We will definitively recommend this establishment to our friends and family."], ["Valerie M.", "The food is always good and consistent. Bean soup, hanger steak, yucca fries. .its all delicious!The only reason I gave this them 4 stars was because after receiving change from our bill we were shorted .51cents! We told the waiter and he responded that they always round off the bill (in their favor?!) He promotly adjusted our change and gave us a dollar..still shorting a penny in the end. *count your change*"], ["Luisger L.", "A superb fresh-cut salad (with a delicious vinagrette!) preceded a juicy, cooked-to-perfection \"asado de tira\" steak. Being from Colombia (Banana-land!), I found the plantains disappointing (i.e., not soft or sweet enough), but overall this was a very solid meal."], ["Aaron H.", "Visting on business and found Barrio on Yelp. It was a great find!Our server recommended calamari to start and it was great. Large portion as well.For dinner I had the grilled chicken with beans, rice, and broccoli and it was also great. Chicken had wonderful flavor. Generous portions for the priceMy buddy got the fajitas supreme which was also a very generous portion and he said they were awesome. Glad to have found this spot and will be going back on future trips to this area."], ["Swiss C.", "Yummy spot. Best empanadas in aventura, food is always fresh and delicious. The ropa Vieja is the bomb. Usually has fast delivery and friendly staff"], ["Gina H.", "I like this place, but it doesn't wow me.  It's a good place to go for lunch with co-workers because the service is smart and fast and you can get in and out within the hour.  It lacks ambiance however.  I'ts a standard built out restaurant with large screen TVs on the wall, outside and inside seating (sit inside, there's nothing to look at outside other than the parking lot).  It reminds me of any a chain restaurant in it's decor. The complimentary bread is delicious.  It is hard to leave it at one piece.  Nicely squished and garlic infused.The food I've had here is good, but like I said not memorable.  I would definitely eat here again.Service is excellent."], ["Leah T.", "Food is excellent. Sometimes service isnt the best but i eat there once a week!! Best soup and best chicken fajitas. I would recommend this place!! Can sit outside too"], ["Talia L.", "Lovely restaurant from the moment you walk in you'll love it! Not pricey at all, delicious food & menu is full of so many different options! Staff make the restaurant only better with friendly and quick service. Would recommend to anyone looking for a great fresh meal!"], ["Shari Lynn R.", "Wow. I am sad. I have been eating here for years. It's always been great...the food, the sangria, the environment and the service...until yesterday. My husband ordered Lechon Asado and I ordered Masas de Cerdo. Delish as always, but I thought that the dish needed a drop more avocado sauce - so I  asked the waiter for some. I saw the hesitation on his face but he brought over a tiny little plastic condiment cup (say 1/2 inch deep by 1 inch in diameter) filled with about a teaspoon of avocado - no questions asked. It helped. At the end of the meal, I used the ladies room and was surprised when I went to get a paper towel to dry my hands. The automatic dispenser spit out a piece of brown paper towel that was so small a child could not have successfully dried its hands. It had to be two inches tall by 6 inches across. Seriously? C'mon... I understand trying to save money but if it's so rough than install an air dryer. It's a total turnoff. I brought it back to the table to show  my husband, when the bill came. We were charged $1.99 for a bit of avocado. Really? Not okay.   We are not cheap people, but that's not cool.  There should have been more on the dish to begin with. If it were done properly the first time around, we wouldn't have had to ask for more. We are not greedy \"try to get something for nothing\" people and we are happy to pay for anything that should be paid for but we also do not like being nickeled and dimed to death.So we shared those exact thoughts with the waiter. He apologized and explained that it was not his decision- it was the managers. So asked to speak with the manager and when he did not come over we got up to speak with him. He was first unresponsive and then flat out nasty about the situation. He refused to hear our side and told us if it was on the bill we'd have to pay it. We were a bit shocked but decided to pay it. When we looked at the bill, we realized that they had charged our card twice. Talk about adding insult to injury! Two diet cokes and two meals -$67 at this inexpensive neighborhood  joint. They removed the double charge, we paid and left. We are saddened by this grossly negligent and unfortunate occurrence. It could have all been avoided if the manager had any knowledge of how to take care of customers.  We warn anyone who goes there from now on - check your bill and expect to be charged for everything."], ["Simon M.", "My favorite Latin restaurant. I have been to this place for the last 4 years and is always consistent. The Argentinian \"parrillada\" is amazing. Please try everything with \"chimichurri\", and please don't skip the black beans and the \"yuca con mojo\"."], ["Frank C.", "Came here thinking it was an Argentine BBQ place. It's more of a blendo Latino grill place. Food is good but a bit pricey."], ["Bill F.", "Empanadas very good. Flakey crust served hot. Cuban dishes good, plantains excellent. Steak in fajitas like rubber & is same steak on menu. A must to avoid. Better ambiance & service than other local Cuban but slightly higher priced. Worth the difference."], ["Yulia S.", "Excellent service. Great to have this place in neighborhood. Portions are huge and food always perfect."], ["Angie P.", "Hidden Cuban Restaurant in Aventura. The place was packed and now I see why! Lots of parking. Was pleasantly surprised... Everything I mean EVERYTHING we ordered was really good! Pollo Empanizado was fresh, crispy and not greasy ( huge portion also). My bf ordered Lechon asado and it was excellent... Just like on noche buena! We also ordered croquetas and fried melted cheese. For dessert we ordered flan de coco. I really loved this because they drenched it with coco flakes and like a yummy coco caramel sauce. I would totally recommend this place not only bc of the good food and low prices but also the service was great. Nestor our waiter was great! Amazing!!!!!"], ["Alexander A.", "Like many places that choose to go broad category like \"Latin\" or in this case \"Latino\" this place over promises and can easily under-deliver. Stick with what the servers suggest and you will likely enjoy your meal. They do Argentine cuisine quite well. Cuban food is spotty. The appetizers are pretty solid. Service is good. I've been here a lot and they are very consistent."], ["Mike M.", "I decided to try this place last night since we are moving close to the neighborhood. It was raining outside but we decided to sit outside since their awning protected the outside tables from the rain. We were met immediately with the host and then the waiter. We ordered 2 orders or Fajitas (Steak and Chicken Combo)The menu seemed a little on the pricy side. I believe fajitas were $16.99. The waiter told us the 2 orders are more then enough for 3 people; I'm glad he told us that, otherwise we would have ordered 3 orders. They provide extra hot tortillas and plenty of sides for the fajitas, and the waiter was correct, those orders were huge, suddenly $16.99 per order means it's a double order. The 3 of us ate and couldn't finish them off. They were excellent and very well prepared. We are definitely coming back."], ["Marcia S.", "This used to be the best Latin restaurant in the area. Lately, the French fries are soggy and the moros are not tasty anymore. However, it is still a decent restaurant."], ["Donna M.", "always delicious.  friendly wait staff."], ["Michelle Q.", "Located in a strip mall but the outdoor seating and quick stroll around the waterway and shoppes after dinner are very nice. My Argentinian friends found this and highly recommended. This is a hidden gem. The steak is cooked to perfection, seasoned but not overpowered. One of the best examples that food prepared with skill does not need fancy sauces or sides. Churrasco Entrana is amazing."], ["Daniel M.", "One of our fav local spots to hit up. Love the entrana with black beans and rice and fried plantains."]], "Taqueria Viva México": [["Ven H.", "Amazing tacos. 100% authentic Mexican restaurant. My 2 coworkers and I were the only people there whom do not speak Spanish. This place only sell tacos and guacamole. Nothing else. $2 taco. Your selections are taco with pork leg/stomach/skin/ear/tongue or steak. I tried all the pork tacos. Absolutely AMAZING, my favorite was the stomach, it has the richest taste and texture.If you are a vegetarian, your only choice would be guacamole with tortilla.No alcohol either!:'(Highly recommend!"], ["Pete P.", "While the place looks inviting as a divey hole in the wall, where you expect excellent food, I did not enjoy it. They only serve tacos, of all types, but the problem is they are dried out and blah. They are not served with lettuce, tomato or anything else, it's just dry meat, in my case, chicken, on the taco shell. That's it.There are sauces hot/mild on the table and you are to dress your tacos with that. Maybe I don't get the concept of being \"Real Mexican Tacos,\" but I assumed there would be veggies and something to keep the dry chicken from being a problem.Across the street is some car CD place that blasts music so loud that it ruined the whole experience. The tacos are tiny, $6.00 for three. I left one, I couldn't honestly finish it. Tasted terrible."], ["Zonnia L.", "If you are expecting some linens and an assortment of appetizers to peruse while you wait, go somewhere else.This place is no joke, authentic, no fuss, cash only, Mexican tacos.$2 a taco, have as many as you want. I recommend getting a variety. Great place for an easy, laid back lunch."], ["Jorge D.", "I think i was let down by the hype.  This place is very highly rated so i was excited to try it out. We get there and its definitely a no frills place with a small menu which is fine.  We ordred about 6 different tacos and the guac.  We liked the guac is was simple and nice, but the tacos were dry and even drenched in their sauces were just ok.  We ordered two more to go since we were fantastic and juicy, this must be what people have been raving about.  With such a small place with such a small menu 6/8 tacos should not be bad. Maybe ill swing by again, but ill see how other tacos are coming out before i order."], ["Jessica P.", "Checked this place out on a Friday night. We had a restaurant.com voucher someone had given us so we decided to give it a try! It's a small place with tables outside. We told the waiter this was our first time here and gave us the rundown. They are a legit taco place. Soft tacos, you pick whatever meat you want, and then they have toppings you can put on your tacos yourself at the table. I was very inexpensive. I think the tacos were only $2 each and the side of guacamole was $5. Okay, so I tried the chicken and steak tacos.  The meat was very flavorful. We ordered a side of guacamole. It was very fresh and tasty. No chips though. The toppings were a variety of salsas/sauces, onions, and cilantro. For dessert they have homemade Arroz con Leche (rice with milk) and they bring you cinnamon to sprinkle on top. Delicioso!This place seemed very authentic and we will definitely be coming back again!"], ["Marcus Z.", "This place is the BOMB! If you are in Miami, you HAVE to come here, NOW!!!I found this place after searching Mexican around me, and this place is the closest from Brickell/downtown area that also has good reviews.I immediately got excited after seeing pork skin/ear/stomach/tongue and beef tripes on the menu as these delicious ingredients are rarely used in restaurants in the States. Of course, if you feel uncomfortable with them, they also have traditional pork, chicken and beef tacos.I ordered 4 tacos with pork ear, stomach, tongue and beef tripes to go (they provide a few tables, but no a/c here). Instead of getting 4 individual tacos, they mixed all 4 ingredients together, which actually made the taco taste better. All ingredients are pre-marinated and the flavor is just perfect. And because they mix everything, I got to enjoy the brittle pig ear, stomach and tripes with distinctive flavor in one bite, which is like a heaven party in my mouth.However, I have to warn you that pork and beef stomach and tripes have a very distinctive flavor, and some of you may not like it. So if you want to try, I suggest you telling the chef not to mix the ingredients, just in case one wrong ingredient destroys everything."], ["Marcos R.", "Sometimes while in little Havana you want a little something different than Cuban food.  Don't get me wrong, I like Cuban food just as much as anyone else but I also crave other things too.Viva Mexico would get 5 stars from me if they sold beer.  I guess you could bring your own if you really wanted too.  Or maybe just go across the street to Little Bread and walk over one of their craft brews.The tacos are solid and pretty authentic.  It's nothing fancy, so probably not the best place to impress a date."], ["Caiti R.", "No frills or thrills, just good authentic tacos with fresh salsas and a very friendly staff!  I ordered the pastor and pollo tacos, pastor was my favorite.  Covered them in cilantro, salsas and fresh squeezed lime to my desire - serve yourself.Also a good sign that it was full of locals even on a cold night.5 bucks spent and I now have a nice base for happy hour down the street...this could become a typical routine :)"], ["Natasha R.", "$2 tacos!!!! Taste amazing!  Period. Very nice staff. It's more  like  a  dive  so seating  is limited  but overall it's more than  worth it"], ["JoCat R.", "I really did not find their tacos flavorful at all!! I much prefer the other taco hole in the wall on 8st and 12/11ave. We ordered the leg and skin, steak, tacos al pastor (which are not on the printed menu) and a mix of everything taco.  The only one that I liked was the mixed one. It was actually amazing. But everything else was just blah! The tacos are only the corn tortilla and meat. Too plain in my opinion. They did have the sauce bar but they didn't have any pico de gallo, which I'm always looking for. Also we got their guacamole for appetizer - $5!! For a tiny portion of over ripe guacamole and store bought chicharrones. Overall, not impressed and will not return."], ["Grant B.", "Similar to a Mexican taco bar, there's no air conditioning and almost no interior dining space, which should amount to very low maintenance and utility costs. However, the prices seem a little high when considering what appears to be a low overhead for this establishment. Anyhow, the tacos are good but the pricing kills the vibe of what's supposed to be a \"Good-n-Cheap\" dining experience. \"A\" for authenticity. \"C\" for pricing."], ["Gloria G.", "Authentic tacos, great prices $2. My favorite was the pork with the pork cracklings or chicharon. Fresh toppings and the guacamole was super fresh but no chips so make sure you get the guacamole to eat with the tacos. Will be back!!"], ["Sabrina L.", "very laid back and non pretentious Mexican restaurant with cheap prices and yummy food. My friend and I ordered the flautas and pupusas which were both very tasting and filling. Some of the plates come with rice and beans as well as individual sauces. Between the both of us our bill came to $16..including a soda and the complimentary chips and salsa. A great addition to lil havana."], ["German B.", "Absolutly love it!!! This is my kind of restaurants!!! Very very local, fresh, delicious and fairly priced!!!It's located in Little Habana, it's a small place with just enough sitting for 16 people, maybe, very simple but no more than the necessary.The menu it's pretty basic, you can only get tacos, but, a fair variaty of them. Either you like simple or you're more into new things, you will be able to have chicken or beef... Or... Tonge or ear tacos (among other not so usuall parts of the pig).My advise, get the mixed one with a tamarindo jarrito."], ["Maggie W.", "Craving cheap, delicious tacos served with authentic meat? Look no further than Viva Mexico in Little Havana. For $2 a taco, you can have your pick of pig parts served in a small tortilla. For those who are less adventurous, they also offer tacos al pastor and even with the regular chicken and beef. But I highly, highly recommend trying some of the different pork tacos!Raised by a Chinese family, I'm no stranger to eating strange parts of animals. I ordered the lengua (tongue), oreja (ear), maciza (leg), and buche (stomach). My favorites, by far, were the tongue and stomach. They're both very tender, and the stomach offers a great chewy consistency to go with the tacos. I didn't care much for the ear, since I'm not a fan of the unsuspecting crunch you get when you bite through cartilage. The pork leg is on the leaner side, so if you've had roast pig before, you'll know exactly how dry it can be. Thankfully, you can sauce those tacos up with your own personal salsa bar! Verdict: Chipotle's got nothing on Viva Mexico. Long live these tacos! Take my word. Be adventurous."], ["Jenny S.", "Authentic Mexican restaurant...amazing tacos!!! This is the best taco place I have been to in Miami!! Super casual..simple Menu and the staff is very cool."], ["Krys P.", "So, my GPS says that I have arrived, but I look at the building, and see only banners and signs advertising Western Union, computer repair, and other services that most certainly do not help with my hunger.  I park anyway, walk closer to the building, and finally notice the colorful lapel picado waving at one side of the building.It is a pleasant surprise to be greeted in fluent English and offered the simple, bilingual menu on a postcard.  Forget about enchilada, burrito or taco salad.  This place just does taco, in an authentic style. That is, you can also forget about your sour cream, cheese shreds and all that.  These little gems come underdressed, just some meat on a small soft corn tortilla.  It's up to you to add the tomatoes, onion, salsa (spicy or mild) and lime juice.  These are brought to you in a huge tray as you sit down. Ever since trying the authentic version, I've been on the out look for them in Miami.  So far, after some disappointment, I'd say this is the closet contender.  The meat can be juicier and more tender, and the salsa a bit more flavorful, but I'm happy enough to come back.  Also love the small size as I can get them as snacks at odd hours without filling myself too much."], ["Jason A.", "This place is as authentic as it gets. The best tacos I have ever had. Delicious food and cheap. The reviews are right. It doesn't get better than this. The waitress was very nice and attentive. The food was served literally 5 minutes after I ordered. My personal favorite was the steak taco but everything I tried was spectacular. The menu is small and simple. Good for people like me who don't know much about authentic mexican cuisine. This restaurant is a hole in the wall but I can assure you that you will love it."], ["Natalie T.", "Tiny little place right off of SW 8th street where all they serve is tacos and guacamole, which is enough to make me happy.  Started off with the guacamole, which is served with chicharones (no chips here).  For my meal I ordered 3 of the mixed carnitas.  They are served  plain but you are given your own \"salsa bar\" which includes onions, cilantro, and several different salsas.  Our server also told me they had an extra hot sauce if I wanted to try it and of course I did.  Definitely had more kick than the others, I recommend it if you are into spicy foods.Everything was delicious and our server was really nice and friendly.  It cost my boyfriend and I just $21 for 6 tacos, the guacamole, and one juice.  Great deal and will definitely be coming back here.*This place is CASH ONLY."], ["Ben F.", "Well, upon entry you are definitely disappointed that the place is tiny.  However, when you taste your tacos you immediately turn your frown upside down!  Everything from the meat seasoning to the sauces tastes wonderful!  My buddy even ate a tongue taco and loved it, and he is a total gringo!!!"]], "La Mexicana Cantina & Grill": [], "Zona Fresca": [], "Los Magueyes": [], "Lime Fresh Mexican Grill": [], "Las Cazuelas": [], "Tacos and Tattoos": [["Lauren R.", "When my husband and I try out a place for the first time, we go all in. So starting from the drinks, we each ordered a new beer/cider we had never heard of...this is something we rarely do because the liquor of choice has such an impact on how your food actually tastes. We were happily surprised to see that our choices paired perfectly with the food we tried.The patacon with fried cheese was our absolute favorite plate of the day. The tacos and burrito were fabulous-- and we made sure to try the chicken, churrasco, and beef. Everything was fresh and all of the flavors were really well-balanced.We went to sit down really early, and when we left there was a line all through the parking lot. I suggest dining early if you want to fully enjoy the experience."], ["Ralph G.", "Ive really enjoyed the two visits to this polace and plan to visit again in the future. .its a tiny spot with not alot of tables or seating so you may want to expect a wait and build that in.. ive been lucky enough to find counter space both times. The burrito was very good but a bit small - when compared to waht you are getting at Cantina or Chipotle... Tacos and Tattoos are freshr but also a bit pricier $10 as opposed to about $7. Deep fried oreo is also a nice little bonus. Try the craft beers - Miami Weiss on tap or Alley Cat in a bottle are my choices."], ["Risa S.", "Woooow, what an awesome find! The location itself was in a strip mall, close to a residential area. I wouldn't have known it existed without the suggestion of other yelpers so THANKS!  I was surprised with how busy it was with people buzzing around inside and out, but once you try their food you'll see why. Take a look at the attached picture to see what the restaurant itself looks like. Now... the food (and service) at this place was amazing. It all started with our server taking us through the menu and explaining the different options including drinks. I ordered 3 chicken tacos, while my friends ordered the patacon and quesadilla. First off, I ordered the tacos because I'm not very adventurous when it comes to new places and their food (I like to be able to compare!). When the server mentioned a red cabbage that came on the taco I was hesitant, but decided (based on other reviews) to try it. No joke, that stuff literally made the taco 5 stars. It had a tart taste that mixed well with a creamy, spicy sauce that topped off the chicken. I seriously can't wait to come back to try them again. I even decided to try my friend's patacon and yesssss, it was delicious. For dessert, we finished off the meal with some fried oreos topped with ice cream and caramel. Go, go, go.... you'll love it!"], ["Jennifer S.", "Service- great! We wanted an outside table since we were sweaty from OTF so we waited like 5-10 min. They brought us stools to sit on, offered water and chips&salsa. Andrew was our waiter and he was awesome! Gave us good suggestions. Nothing better than someone who is passionate about the food they serve. Food-outta this town. Seriously, no one in this town serves a better mix of Mexican and other Latin flavors. For example, the house burrito had puertorrican arroz mamposteao inside (I can tell bc I was raised there). Our appetizer was delicious. We had a patacón with fried cheese on top and deliciously seasoned churrasco. My beer was great and suggested by Andrew when I said l liked wheat beers like Blue Moon. I can't remember the name, but ask him.  And for dessert, we got free fried Oreos for tagging them on social media plus I couldn't resist but to order the T&T donut. It's a delicious Nutella filled donut and then they fry it. Yup! You need to use this place for a cheat day. Sooooooo good!Ambiance- super friendly, cute, trendy and hipstery place in the middle of Kendall. A nice surprise, if you ask me. They are expanding to a bigger spot in the same strip mall, so I'm looking forward to that."], ["Israel R.", "I really hate to be the one to break it to you but size DOES matter. Yeah, most places are growers not show-ers, but even after giving this place a few tries it just isn't doing it for me. If it somehow manages to grow another couple of sqft then I'll definitely give it another go.3 stars really isn't bad, but it hurts when you know a place has potential to be better. Biggest issue here is that it is too popular for a space that can only fit a handful of tables. This leaves you feeling claustrophobic / uncomfortable and leads to long waits for seats. There could be a wait anywhere, but i just don't think that this particular place would be worth the potential 1hr+ wait from time of arrival to the time you're served your food since it could take a while to craft a couple of tacos too.The wait staff always makes me feel like we're pals. Going with the tattoo culture theme most of the staff looks a little grungy and the decor almost makes it look like a little tattoo parlor - Cheesy ultra colorful skull painting and all. My one gripe about the service is that they don't seem to care so much for the suckers that sit outside. If you're sitting outside you have to ask for the complimentary chips since they won't automatically bring them or offer them to you. Food orders might be given less priority too. The one time i ate inside it took less than 10 min to get some tacos, compared to 25+ minutes for my outside orders. #ConspiracyFOOD: Don't expect a traditional Mexican menu. They don't offer much variety but the menu is definitely fun, especially the deserts. I can say that their regular tacos, quesadillas, tostones rellenos and deep fried oreos w/ vanilla ice cream are pretty delicious. What makes their tacos and quesadillas so good is the sauce. Don't blame me if your taste buds disagree though, blame your taste buds for being wrong. Talking about wrong, they have a couple of offerings for the VEGETARIANS too.The one thing I DON'T recommend is the $2 \"Taco Tuesday\" taco. It sounds like they are hooking you up with their regular delicious tacos on special, but it is actually a different taco. Smaller, no special sauce / purple cabbage / tomato chunks or cheese. If this is all you try from T&T then you are doing your mouth a great injustice. You're saving a couple of cents but losing all the flavor.Definitely not good for groups, not good for dates and barely OK for a casual sit down. Until they expand or work out the kinks (Just opened earlier this year), calling in your order for take-out is the way to go IMO."], ["Kimberly K.", "I came here for taco Tuesday with 4 friends and let me just start by saying if you wanna come get some $2 tacos rolling that deep on a Tuesday... Don't do it lol. But if you're here with just one or two friends, do come! We waited 40 min to get seated haha This place gets crowded and it's already super small so it's not meant for big groups BUT the tacos really are delish. They also serve free chips with a yellow salsa that's made from scratch every day!Tip: must specify you want $2 tacos or else they'll charge you for the regular taco, as it happened to two of my friends and I. No big deal though cause they're totally worth regular price. I only wish our server told us. Our sever was named yamir, and besides that little note, he was excellent. Very attentive to my big group and awesome personality. They fill their tacos with purple cabbage which is so much better than the nutrition-less iceberg lettuce most taco shops use. We finished with fried Oreos and a glorious fried Nutella donut! Don't skip out on the donut!"], ["Marla V.", "Tacos and tattoos - two of my favorite things!! I have heard about this place from numerous friends and knew I needed to see what I was missing out on. First, the service is super friendly and tends to the customers perfectly. The place is small and quaint on the inside but I hear they're looking to expand which is a definite plus! Plan on arriving early or waiting patiently because the whole place only seats about 20-25 people. I ordered a craft beer, churrasco taco, chicken taco, buffalo chicken taco, patacon with fried cheese and pico de gallo. I was addicted to the complimentary chips and salsa they brought to the table. The seasoning on the chips was spicy but not offensively spicy, and even as my lips burned with each bite, I just couldn't stop eating them!!! Everything I ordered was delicious but my hands down favorite was the patacon. Throw fried cheese on top of a fried plantain with some pico and it's straight up heaven any way you slice it. I sampled some of my friend's Cali love fries and they were equally as delectable. Their craft beer selection is pretty good and reasonably priced. They were also offering samples of beer before you purchased which was impressive! Finally, and most importantly, if you follow Tacos and Tattoos on Instagram and take a picture of you and the guests at your table and tag T&T, you will get a complimentary deep fried oreo, sprinkled with powdered sugar and drizzled with caramel. This was the perfect end to a delicious meal!"], ["Amanda M.", "This place is great. The food is fantastic!! I had a patacon with the fried cheese. Wow!! My tastebuds were certainly thanking me. I also had the churrasco taco and shrimp taco. Both were pretty good but my favorite by far was the patacon. It was even good the next day when I finished what I couldn't the night before. The fried Oreos were so delicious!!make sure to check in and post a pic to get a free fried Oreo."], ["Gaby B.", "Tacos & Tattoo's is oh so good. It's a small very homey feeling restaurant that is usually pretty packed.  I have tried basically everything on the menu ( with the exception of the burritos) and have yet to be disappointed.  Their patacon with fried cheese is simply delicious. Quesadillas are always extra cheesy, and the variety of tacos is great. One of my favorites is the portabella taco, I had never had a mushroom taco, but these are so good. I'm always sure to order one or two when I stop by.  Make sure you save room for dessert.  Nutella donut and fried oreos are to die for.  Lastly they have an awesome beer selection.  Definitely a place worth checking out, just try to go at a random hour so you don't have to wait long. Ps.  you have more of a chance of getting a table if you are a small group (2-3)."], ["Kayla R.", "The churrasco patacon was incredible. I love the way they cook the queso frito in honey.. All in all recipes and food is 100% on point. The only problem I have with this Place is that it's too small, and there's one really rude waitress there."], ["Mirielle C.", "Tacos & Tattoos is a small restaurant in west Kendall ish area. It's cute and hipster-y. I liked that they had vegetarian options because I went with my friend who is vegetarian. We liked their beer selection, we tried the pear cider and enjoyed it. It came in a mason jar which I also liked.I tried the vegetarian burrito which I liked but is on the small side. My friend did not like her crispy vegetarian tacos. She said she had a hard time chewing them, and did not find them palatable. Her fries were lacking salt. Chips were good though. I had the Nutella filled donut thing which was so rich and delicious. Ordered my daughter a cheese quesadilla too which was good. Guy that refills your water came by often and our waitress was nice. Music was reggae and very hipster too. Overall I'm willing to give this place another shot, I think my friend might not though."], ["Amy M.", "A (not so hidden) gem in Kendall near MDC, Tacos and Tattoos is a Mexican restaurant with a hipster vibe. It is located in a strip mall, and doesn't have a sign, so you may miss it if you don't know exactly where you're going.  T&T shares the shopping center with a veterinarian and a liquor store, so it seems out of place. However, the food definitely speaks for itself. One thing about T&T that you should know before you go: it is SMALL. There are probably about 20 seats, including the bar, so expect to get very cozy with your neighbors. With that in mind, we arrived on a Sunday 10 minutes before opening. In that ten minutes, we went from being the only ones waiting to be part of about 20 people waiting. Obviously, the restaurant filled immediately on opening (even the bar). The food is fresh cooked to order, so if you're timing is off, you may wait quite a while for a table. People walked in right after opening, and since the restaurant filled at opening, they had to wait a LONG time to sit down. It's obvious the establishment has already outgrown its location. The beer menu is quite extensive. Only two on draft, but plenty of craft beer in bottles and cans. T&T had a wide variety of local brews, as well. We've been twice, and the service has been pretty consistent. Not too over-the-top, but our water was full the entire time, and our servers were friendly enough.  Upon seating, you're immediately provided with chips and fresh salsa, which was quite tasty. We ordered three tacos: churrasco, shrimp, and chicken, all on corn tortillas. Delicious! I would go there just for the churrasco taco. It was divine. We also ordered three Tostones Rellenos: churrasco, shrimp, and chicken. They were also delicious! With the 6 menu items and one beer, our tab was $22. Not bad at all. Honestly, the only downfall is the size of the restaurant. We've wanted to go back a few times, but have been hesitant because we know how long the wait can be. Otherwise, definitely worth a try if you're a fan of Mexican food with a twist. Well done!"], ["Stephanie P.", "This place lives up to the hype and more! It's the definition of a hidden gem. It's located in a neighborhood strip mall that probably has never seen as much action prior to Tacos and Tattoos moving in.It's a very small space; I believe it had four tables inside for two and one for three, along with bar seating and some tables and benches outside. The ambience is very much what you'd expect from a place whose name includes the word \"tattoo.\" I'm sure they'll be expanding soon at this rate!Food. Food. Food. My favorite. The free chips and salsa are already enough reason to go again, so fresh! For my entree I had a Patacon, I'd make everyone order one just to pray they hated it so I could do 'em a solid and finish it on their behalf. It's about $10. I didn't think one Patacon con fill me up but it did! It's a huge tostone with everything that would come in your taco on top. Delicious. It has a kick but softens the blow with honey! Splurge on the queso Frito ($1 more) your taste buds deserve it. Don't leave without having fried Oreos - honestly don't, you gotta try 'em.Already planning my next visit."], ["Riza J.", "The beso tostones relleno With shrimpAND churrasco taco. If your want to try this place take out is the best way to go, until they expand ."], ["Elizabeth G.", "It feels like I little slice of our Wynwood neighborhood made its way to Kendall. The place is dimly lit with random rugged art from top to bottom. The servers are chill and talk to you Iike your buds. Wine and beer menu, though we didn't have either.. this time. Chips and salsa are brought to the table, as you would expect at a taco spot. Warm and homemade. We had the tostones with chicken first.. yum! Fortunately we split the surf and turf burrito.. yes, SURF AND TURF in a burrito. Good thing we split it too, otherwise it's one of those meals I could easily have over eaten. And there's. A secret.. if you post a photo on IG and tag @tacostattoos and show your server, fried oreo on the house. Omg it was worth every glare my husband gave me for being rude on my phone at the table. Mmm.. now I'm hungry."], ["Gabriel R.", "A hidden gem! Got there early for lunch and by the time dessert arrived there wasn't an empty chair in the place. The service was prompt and the people that work there are pleasant, polite and always have a smile in their face. They love what they do and it shows on their food..they take pride in their place and product. You would think that this is a young people's hang out spot but there were people from all ages eating and having a good time.. the food united the age gaps, a testament to the value and flavors and freshness of the food.Dessert is awesome as well had a fried Oreo and a Space Cake...whoa talk about deliciousness!  Definitely worth the extra calories!   We will definitely be back soon with friends..get there early though if you wanna grab a table without the wait.The food was incredibly good and well priced."], ["Kris V.", "Very cool spot. Some great dishes with good flavors. The service was a bit slow and inattentive but friendly nonetheless. Prices were also very reasonable. I would come back."], ["Christa T.", "Literally a hidden gem. Def not ur average taqueria. So much craft is put into their dishes. Such good food. Met the owner and he was super hospitable and explained the whole concept to us. They carry craft beers and the selection is great. They started us off with chips and salsa that we couldn't get enough of. We ordered the patacon with chicken and the California love fries with churasco. Ahmazing. The beer compliments their dishes so well.Will definitely come again when in the area."], ["Maria M.", "Very yummy place. The service is really good and the concept is awesome. The food was delicious all kinds of flavors coming together I loved every bite. The staff is also very friendly and we got our food pretty fast. LOVED IT"], ["Ciocio M.", "Visited Sunday afternoon, Great music, they were playing Steel Pulse for an hour, where else can you hear this out and about?!Funky Artistic and creative decor and comfortable quaint and casual setting.Good vibes!Solid craft beer list at moderate prices! I recommend the Miami Weiss on draft, only $5 for 16oz, nice glassware also, Pilsner glassesService is friendly and straight forward!Food was tasty hot and fast!Overall, a valuable addition to the neighborhood!!!I wish there were more places like this in Kendall....What are you waiting for??? GO!!!!!"]], "The Mexzican Gourmet": [["Elizabeth S.", "Ok, after 10 years in San Antonio- my family is quite snobbish about Mexican food. This is the only awesome Mexican in Miami!! The enchiladas suizas were fantastic as were the tacos and cerviche. The corn tortillas were fresh and perfect and the salsas were all delicious and different from one another. The food is absolutely 5 stars-- I removed a star because there is not a full bar and the valets for the \"gentlemen's club\" next door were loud and obnoxious and we were dining outside. We will absolutely return and highly recommend Mexzican to anyone seeking great authentic Mixicsn food. I'll keep hoping they get a liquor license so I can have a margarita or 4 sometime.... :)"], ["Youry T.", "The food was mediocre and a bit pricey for it's quality.  The waiter was attentive but when I asked for a small side of salsa \"Pico de Gallo\" for my 3 tacos he told me that they would have to charge me extra for it.  I was shocked since all Mexican restaurants that I have been to many of different salsas are complimentary and part of the meal.  It's almost like a burger joint would charge extra for ketchup or mayo.  This was not an order of $2.00 per taco.  The three tacos cost $15.00 and they were one of the worst I've had.  The beef was dried and tough and I'm sure it's because they have it cooked and chopped and then just reheat when you place the order.  The order of the three tacos can not be of different ones they have to be all of one kind. I've been to quite less expensive Mexican restaurants where they cook the beef to order.  Also the parking at this location is horrible you have to park at a meter and walk almost a block, I understand it's a busy location where parking is limited but if that is the case they should offer valet parking services.  Then at the end the receipt says that when you come back for the 10th time you'll receive 10% off.  Really! Are you kidding! Our bill for two people was $58.00 (without alcoholic drinks) so that means that I have to spend $600.00 in order to save six bucks...incredible!"], ["Marta R.", "Very cozy little restaurant nicely decorated and friendly! Staff is attentive and polite. Food is delish...loved it! Well seasoned and interesting combinations! Queso fundido- a must have!"], ["Rachel P.", "Good service-Weak $9 Margaritas-boooBasket for chips is very small, so you have to ask for refills a few times if you like chips and salsa (but it's free, so that's good). Pork tacos are pretty tasty.Guac is very good.You can sit outside and bring your pooch-always a + to meAnd for an added bonus: You can smell the hookah coming from next door and watch the girls go into work their shifts at the gentlemen's club next door."], ["Regina P.", "Came because I was craving Mexican breakfast. Being Mexican makes incredibly picky with Mexican food. I lived in Mexico for a while and grew up eating delicious homemade food everyday. So, it's rare to find a place that I like here in Miami.This is one of them.Chips and salsa ARE freshly made. They are thick and warm and are clearly not just poured out from a bag. The salsas were great, I just wish they had a spicier option.Chilaquiles is my favorite breakfast food ever. Switched the chicken to eggs bc I'm a vegetarian. Perfect amount of sauce, the chips were still slightly crunchy, the beans on the side were great, eggs were great. Overall it was a solid dish. Only thing it needed was to be a little spicier.My gf ordered the chorizo and eggs baguette. They had ran out of bread so they offered a wrap instead (gave us free espresso because of this). She liked it but she would've preferred the baguette. Not a big deal.Service was incredible. Food came out within 10-15 minutes. Waiters were super attentive and nice! The only thing i would change is a little less salt overall and a little more spice. That's it.Great place! Would definitely go again."], ["Elie H.", "Best mexican food in miami.  Authentic, delicioud, friendly, unassuming setting.... Must haves:  everything!!! But definitely the ceviche, cactus salad, fish tacos, chiles rellenos with steak......"], ["Alex J.", "Best Mexican food around. I'm not usually a fan of Mexican but  my wife and I went there on a whim and I left having the best burrito of my life. (Carne azada) now I go there almost every week. They always have excellent, quick and consistent costumer service. If you're in the mood for Mexican I suggest you give this place a shot. It's a little pricey but well worth the price!"], ["George S.", "Fantastic Mexican food--- not an easy thing to find in Miami.  Moved fr Texas -- as close as it gets here in the 305"], ["Glenda C.", "Luved the carne asada tacos and the margaritas.  The carne asade is seasoned just right........ it tastes fresh with that lime & cilantro flavor. Did not care for the chicken taco, I didn't like the shredded chicken they use on their chicken dishes. I got the 3 tacos, 2 carne asada & 1 chicken... Ended up leaving chicken & making a 3rd carne asada taco with the little tortilla and some carne asada left over from the other tacos... The queso fundido is delicous. It is a baked melted cheese that you can place inside a tortilla. Also, original flan is DELICIOUS , did not care for guava flan. I like the complimentary chips that they give you with the dipping sauces. The chips are made fresh and they come to the table nice and hot! Overall I liked the place, just would like portions to be a bit bigger or a cheaper price."], ["Carlos C.", "We just had dinner here and the food was the best REAL Mexican ever!!!Dania took care of us and the service was top notch!!! 100% recommended. We will def coming back soon."], ["Beatriz A.", "My girlfriends and I went last night and had a male server who was very arrogant to say the least.  On the other hand there was also a girl taking care of us that was a sweetheart.  The food was good but my ceviche was mostly lime juice....the portion was minimal....  They only had Margaritas, no other liquor....would not recommend..."], ["Y L.", "I came here with my mom and everything was great. The guacamole had so much flavor. Both our entrees were delicious. Our servicer was nice and attentive.   We will definitely be back."], ["Gabriela P.", "Read some great reviews and decided to eat here before the movies at Sunset. Service was fast and our server was friendly. The chips were hot and fresh with three sauces. I liked the spicy one and the other green one but there was a red sauce that I could do without. Ordered the guacamole as an appetizer and it had to have been made fresh because there were avocado halves thrown in there. Not the best mashing/mixing job of guac I've seen but it was good. I have to say that what lacked for me was flavor. The guacamole was missing something for sure and we ordered a mix of their tacos and while the meats were super tender and moist they just didn't have much flavor to them. Except for maybe salt. I definitely tasted salt in there. So I added a couple of their sauces and some gauc and voila...it helped. It was a good experience. Not sure it's really gourmet though and not sure I will be going back anytime soon unless they have some good happy hour deal going on or something. But I still say try it!"], ["Lily M.", "Service sucks. Waiter started talking to another table mid ordering my dinner. Been waiting for an hour, have yet to get my order of guacamole."], ["Nancy A.", "Ehhh not in love, sorry! Went on a saturday for the miami spice (i was craving some mexican) and by the end of the lunch i could not wait to get out of there! Lets start with the parking, its complicated to put it lightly. They have one valet guy for like 6 restaurants. I ended up parking on the streets. Fresh chips are always a plus and 3 different sauces were a nice touch.*the guacamole by itself got its own star in this review, its expensive but its good*i had the enchiladas de pollo and they come 4 and i didnt even finish two, they were bland, waterdown by the sauce and unimaginative.The guava flan was good but very very sweet (sugar coma)The worst thing? THE NOISE The music was super loud and very old fashioned and the acuatics are horrible. I could hear everything thar was happening in the kitchen and everybody's conversationOh and they took my water away before bringing the dessert."], ["Frank G.", "I looooooved the fish and shrimp tacos!!!!! Whoever said the food was tasteless must just not like it but I'm sure the rest of her party enjoyed the food.  I'm not sure what nutritious means when you're eating Mexican food ....for that just don't eat out. I am very pleased and didn't even know this place existed!!!! I wanted seconds with my meal!!!"], ["Linda B.", "Started great but went downhill.  Wonderful guacamole with large portion and cunks of avacado. When my mother went to ladies room there was no toilet paper anywhere.  Tough for anyone but especially so for a 93 year old. Then no decaf  coffee available. Our waiter was very nice but didn't make up for the food quality. Huevos rancheros were just eggs on top of fried tortillas and a little bit of a bland sauce. Nothing else was served with it. I has the scrambled egg tacos and they looked really dry so I asked for some kind of sauce for them and nothing was available only the stuff that was on my husbands hue so, no salsa verde or anything else in the kitchen? Hard to believe. I have never rated a place with one star before and I rarely say I won't go back to a restaurant but this time I have changed my mind. Sadly we won't go back,"], ["Michelle Z.", "I  had long given up my quest for delicious Mexican food in Miami. And I mean Mexican food- not Tex-Mex, not Taco Bell..not sour cream and lettuce on ground beef...MEXICAN. FRIJOLES. QUESO BLANCO. REAL TORTILLAS.My search ended abruptly upon discovering this corner spot, off on US1 and sunset ( and yes, right next to BT's- this shall be a point of reference) on a Saturday afternoon. Walking into the bright, but small restaurant, I was a bit worried about the lack of clientele there. Oh but my worries were put to rest and fast!I've gone back a few times since then, and I always start with the same thing : queso fundido. Don't want chorizo in it? The mushroom is just as good, if not better. And they don't serve this with any regular ol' tortilla chips, oh no- you get these small, warm, fresh corn tortillas, to make these little mini queso tacos with as you wait. I could stretch that cheese on that tortilla for hours. HOURS.My staples are normally the shrimp tacos and the carnitas. They're presented perfectly in corn tortillas,with just onion, cilantro..and that's pretty much it. That's all they need!I recently discovered their molcajete- which is an huge bowl of shrimp..stew is the best I can describe it, with queso fundido melted into it and a slew of veggies. You sop it all up with tortillas...it is glorious!There are plenty of places in Miami that claim to make tacos, or some sort of bastardized version of a burrito, enchilada or what have you. Forget all you ever knew about Mexican in Miami and head over to Chef Z's spot. You won't regret one bite!"], ["Daniel P.", "Yeah, food seems overpriced. Stingy with chips. Tacos average. Ehhhh"], ["A. S.", "Great spot for a light and fresh lunch.  I had no idea they also have a food truck. The food and service was great and the chips and dips were amazing.  I will be back for sure during my next visit."]], "El Taquito": [["Damian R.", "Hole in the wall but they are the Best Tacos in Miami!!!!! I have not yet found a place that sells better tacos!"], ["Dan B.", "I go here a lot and this is the first time I was disappointed. I always get tacos al pastor, but this time they didn't have the right meat. This place is great, and I love going there, but a little more consistency and professionalism would be great."], ["Alexis V.", "I'm so glad I went here instead of my go-to place (Bombay Dharbar -which is an excellent Indian restaurant). I was in the mood for something cheap and we decided to check Yelp before walking in. The service was fast! I wanted to get a veggie burrito but they didn't have any more of the tortillas. Instead, I got a vegetarian enchilada (verde sauce). It was SO good. It was light, you can taste the corn in the tortilla and they didn't make it with a lot of cheese. They filled it with peppers and onions and they put cilantro on top. I'm not a big fan of cilantro so I just took it off. It was excellent. My boyfriend got \"la Gringa\" and he said it was very good. It's very authentic for the area (the best area for Mexican is in Homestead). I'm sad they didn't have Horchata, but the service and the price made up for it. I think it was like 10.50 for two people in Coconut Grove (with 2 drinks). Overall, I would come here again."], ["Erik G.", "I had a steak taco. It was very salty and the tortilla was hard and old. My wife had the enchiladas. The sauce was very very old and the tortilla was also hard according to her. I was mad she didn't return it. I do not recommend."], ["Cathy C.", "Delicious, fast, and cheap! It doesn't get better than this! Make sure u try it if you are in the grove!"], ["Jo W.", "Inexpensive, quick and tastes good!"], ["Amanda A.", "Horrible. Would give them a 0 if I could. Super unaccommodating. Asked for a bean burrito and they told the only thing they would make was steak tacos. Awful food, awful service. DO NOT GO HERE."], ["Cristy D.", "The person handling the money was also helping the main cook add toppings to tacos using his dirty hands without washing prior to food handling. Should hire a third man for helpGross and unsafe."], ["Ellie E.", "Best tacos by far and I've never ordered anything I didn't love. My favorite are the el pastor tacos, though. I could eat those for daaayyys."], ["John P.", "I work in Coconut Grove so I get the chance to eat here a lot. This hole in the wall taco spot serves what seem to be authentic tacos...now I'm not Mexican so I don't know exactly what the real thing Is but for me this is my taco go to spot. I really love it!"], ["Christian J.", "This place is on point. Zero frills here. Just great super casual Mexican food, cheap, and fast. Easily a contender for best tacos in Miami.The 3 tacos (of steak and/or chicken) for $5 is an amazing deal. Individual tacos are also priced well if you're looking for more options (e.g. carnitas, de cecina, al pastor, churrasco). For a heftier meal, try a torta--it is out of control.They're open pretty late too. Wednesday through Saturday, they close at 3am."], ["Cory P.", "OMG!! My gays coming in me. This place you step in and that's as far as you go. It's a shack.And damn... The tacos are fresh meat and full of cheese. I had the crispy tacos (hopefully my trainer and doctor doesn't read this) I had three of them. If I had a choice between a hot muscle man and one of these meaty tasty crispy tacos...I'd be very indecisive. This place is good. Clean and genuine guys. The food is fantastic and inexpensive."], ["christina f.", "Mmmmm tacos! Yummy and super cheap right in the heart of the Grove. They also have a good selection of salsas. Don't forget the Mexican Coke (in the glass bottle)."], ["Patty G.", "Good tacos for a great price! The carnitas & steak tacos were delicious. They're on the small side so order an extra one because they are extra delicious!"], ["Steve W.", "Agree with everyone else's review.  Tacos are pretty small but it's fine with me instead of stuffing myself at lunch.  Only 5 stools so taking it to go might be the way to go."], ["Andrea B.", "Hidden gem in coconut grove. Small taqueria where 5 bucks will get you 3 delicious tacos! Make sure to add they green salsa because it's the BOMB :) **the chorizo quesadillas are great too** Love this place!"], ["Jose A.", "Great place for some authentic tacos, which  come topped with cilantro and onions. Only had two employees but service was very fast. The only drawback is that there is very limited seating space since the locale is super small. Nonetheless, very good option for a quick, informal, Mexican bite."], ["Shan H.", "I stopped by to eat up before a bike ride with a buddy.  I had three steak tacos,  seasoning them to taste with the provided two bits of lime and some sauce (your choice of mild or hot).  It is nice to see a place using real lime instead of lemon despite the increased global market cost of lime-- a finishing touch both noted and appreciated.    Great service-- friendly and fast.  I loved the tacos-- my only complaint was that they were eaten too quickly :)"], ["Drew H.", "Probably one of the better taco/mexican food placed in miami. The food is pretty cheap and comes out quick. The Tortas are the best."], ["Jeff D.", "This place is everything I like. Theres only seating for probably about 5 or 6 people. But the tacos are delicious and cheap too! Make sure you put the hot sauces they give you on the tacos too."]], "Antojitos Mexicanos Tenorio": [["Kristian M.", "Alright, I've become quite the regular here, and I've been hesitant to write a review. This is a hidden gem that you only know by stumbling upon it, or if you're a LEGIT Mexican. Since I'm a social butterfly, I've had conversations with everyone from here. So I know the all the info. LETS DO THIS.This is a family owned and ran business. The employees are a mom, dad, two sons, and a girlfriend of a son. I think the mom has a sister (an assumption based on the their facial similarities) who comes at night to help with cleaning and I believe prep for the following day.They have owned this location for 8 years, and they've been doing great. They're real Mexicans making real Mexican food. Their combos and daily specials are priced at $8 dollars each, so you shouldn't spend anymore than $10 per person. I've eaten their tacos, quesadillas, alambre, torta, sopes, burrito, enchiladas, rice, beans, chips, pico de gallo, flan, and tres leche. I have never once said, \"ehh the food was ok.\" That's because it's always GREAT! Everything is fresh, and you see them actually making everything FRESH. Yes FRESH. I've seen them make the refried beans FROM SCRATCH, carne al pastor, and chips. Whatever I didn't mention is made from scratch but I've never seen them doing it. I could keep going, but I think it's best to leave it at that. Stop thinking about it, and just go eat there. I've never taken someone who wasn't impressed by their food AND service.5 stars because this is the type of restaurant I use to compare ALL Mexican restaurants with. If they served alcohol, I'd give them 6 stars. Just saying..."], ["Enrique C.", "No need to go to Mexico or wait for taco fresh food truck to show up before getting cheap and authentic Mexican tacos.  Stop by this hole in the wall restaurant family owned and get that Mexican fix.  I used to work from Miami on the weekend and this was the place to go.   Less than $2 a taco, this is really worth it."], ["Luis G.", "...lets us pray; Dear Food God, thank you for this place. i've been living around this area for the good part of 3 years and i've always wanted a good mexican place. So there was that Catina place, blah. So my friends wife (who is mexican) told me about this whole in the wall. Mind you i've passed by this place a bazillion times, just never knew it was there. One day the wife and I go explore this location and as she stated; it was a whole in the wall. So we ordered, and BOOM BAMMM KAPLOW....freaking tasty, great food and a helping heap of heat which lead me to say \"Porfavor mas señorita\". yes its very small, yes its not that good looking if your on the outside. But you know what, its clean, I feel like i'm at a grandmothers house and the food has always been excellent. So if you have a chance and your driving down 137th and Bird, stop by order a #1 steak and enjoy it....."], ["Harold R.", "Not that tasty. But maybe it is authenticity I was recommended here by a friend who is Mexican. I was looking forward to it but was not impressed. Friendly staff and good portions tho."], ["B M.", "So excited to find this place!! I been searching for a mexican spot that has tongue tacos since I moved from homestead since over there we have taqueria Morelia (which is amazing ) but anyways I ordered 4 tongue tacos and my hubby ordered a chicken quesadilla . Everything was yummy . Very home made and fresh ! The only thing I would change is the fact that they don't have a little sauce bar so I kept having to ask the lady for more pico de gallo for my chips and then some like for my tacos . I felt like I was being a bit annoying going back and forth although she didn't seem to mind . I think it would be a little more convenient so everyone can just serve themselves as they wish . Other than that I love this little hole in the wall and I will definitely be back for some more !!!"], ["Hugo P.", "Small hole in the wall but as they say, great things come in small packages. Hands down, the best Mexican food in town! Staff is great and friendly! I've stopped by a few times and have had some menudo, tacos, burritos, and tortas. If I had to choose one for you, I would say you must try the volcan (volcano), a dish part of the secret menu; tons of flavor and authenticity. This place is just like eating at my grandmas back in mexico!"], ["Felipe Z.", "Hidden gem! Ok so I've past by this strip mall 10 thousand times and it wasn't until recently that I discovered this Taqueria owned by this older couple. They make everything in-house and ready for this!? They have tacos Al Pastor from the trompo like its served in Mexico. You know a place is good when you walk in you're transported to that country. The place is small with limited seating but if you're looking to satisfy a quick taco fix just walk up to the window and these guys will be sure to make quite possible some of the best Tacos West Dade has ever seen. I've tried other items on their menu that were great too but those Tacos are whats up."], ["Santos A.", "One of my favorites , the food is amazing, I love the chicken quesadilla and the nachos, the employees make you feel at home. Recommend it to any one ."], ["Dan F.", "What a great find thanks to Yelp.  Was driving to Kendall to see family and was hungry for some Tacos. Ended up ordering burrito, tacos, quesadilla, and tostadas.  Legit 100%!"], ["Chris R.", "If you're looking for authentic Mexican food check this place out. The combos they offer are sweet: I got a burrito and a taco PLUS a can of soda for like 8 bones and it was great."], ["Kimberly Z.", "This is an AMAZING hole in the wall authentic affordable Mexican restaurant. The seating is on a counter, but you watch them cook everything. No sketchy cooking in the back. Food was extremely well seasoned and flavorful. Chips were thick and crispy, freshly made.Ordered a guac that's made right at that moment. Perfect balance of ingredients.My regret is not having come to this gem sooner!! Can't wait to return."], ["Linda C.", "Been coming here for the past 5 years and it's absolutely the best! Our favorite thing to order is tortas al pastor and tacos al pastor. They are delicious! And the owner Tenorio is the nicest person u can encounter.  Hands down best place to eat authentic Mexican food."], ["Carlos M.", "Just tried the enchiladas..... This is truly a rare restaurant.... Delicious delicious delicious!!!!"], ["Andrew L.", "This place is as close as I can get to LA tacos in Miami. I love the way they make their tacos here it reminds me of back home having tacos from the Mexican taco trucks down the street. I wish I can say the same about their burritos though. I won't say they are bad as I only tried the burrito once, but the burrito sure didn't meet the potential the first bite into those tacos did."], ["Danny M.", "Ordered the Alambre and specifically told them with no pork. Guess what? They made it with pork... Now I'm home and hungry.. Looks like I'm ordering Chinese"], ["Claudia F.", "Very good authentic Mexican Food! From Taquitos al pastor to Sats they have posole!Heaven!"], ["Tania S.", "Truly authentic Mexican food, this restaurant is totally family owned and run. Their food is fresh, homemade, and very delicious. You can tell the beans are homemade, my partner said they reminded him of his grandma's (he is Mexican) Really delicious! They offer platos tipicos on a rotating basis and regularly have all sorts of antojitos. Definitely worth it."], ["Josiah B.", "Very great hole in the wall. Food is made fresh to order and the staff is friendly. Warning though the place is beyond small with only 13 bar stools. Worth the cramming though. I'd recommend the pork skin."], ["Mario R.", "I'm so glad that this excellent little mom and pop restaurant is close to home. The tacos al pastor are outstanding! They also have great priced combos and their homemade chips are addicting! The best part is that the food is prepared in front of you and ready in 5-10 minutes. Highly recommended if you're in the mood for authentic Mexican."], ["Cyn B.", "For the location this is the best Mexican food you will find.  Yes, some of their food is reheated but it's not frozen reheated food. You can tell from the taste that it was food that was Cooked in the morning to serve at lunch time.  And not all is reheated they cook plenty of food fresh in front of you. The 2 sometimes 3 person staff are super friendly and attentive.   I especially liked their beans and chips. It's a nice and humble tiny taqueria but the food is definitely worth going for. Will definitely be coming back again."]], "Rosa Mexicano": [], "Salsa Fiesta": [["Karolina M.", "Has takeout today.. Ordered ceviche and two steak tacos.. No impressed .. Americanized and not authentic ... Very blah"], ["John S.", "Better than lime, chipotle, and any fast t-mex competitor minus Rosa Mexicana. I was beyond impressed with my grilled chicken quesadilla and it was take-out I could only imagine fresh. I want to try the burrito when I canThe salsa's are on point I think it's one of the most important parts of a Mexican experience   Fast. Affordable. Fresh."], ["Carrie L.", "** awesome **We are staying overnight in Miami and looked for a nearby spot on Yelp. Thanks Yelpers! This place was great. Easy to order. Food comes to you. The dessert tortillas are a great treat and I wish I could bring this place back home with me. Free, plentiful parking. Do it. Go! We loved everything. Kid meal was pretty big. I had a chicken taco salad and loved it. When staying in Miami I will go out of my way to eat here."], ["Joe A.", "Sauce Party!Listen, obviously any Latin place is going to be heavily scrutinized in Miami. But, Salsa Fiesta has a nice little niche of clean n' fresh going for them. It also benefits by being the closest, consistently money Mexican grill to my humble abode on Biscayne. I go there way more than I check in and it's always satisfying. Go guac!"], ["Brittany K.", "I think 12 people wished us a good night. I felt like we were leaving friends haha, The quesadilla was great (steak) and we got a free drink for waiting our turn. Nicest place in midtown"], ["Jay T.", "Everything I have ordered from this place has been amazing. Definitely like the layout of the restaurant as well. Only down side is being constantly pessured  by the same homeless man asking for money. I have nothing against homeless people, but it's so annoying to eat outside and constantly get asked for money when you're trying to enjoy your food."], ["Matt M.", "Clean and friendly staff at night.  Remember the old commercial for Burger King, \"where's the beef!\"  Well, where is the chicken in my burrito. Day time crew packs the burrito a little much with rice. We want more Meat. And who doesn't? I mean we are in Miami.  Great fresh variety of salsa.  Good stuff overall."], ["juliana r.", "I ado lolly love this place the food is fresh health and good price what it bothers me is the service I used to come here a lot it was always my first option until last Monday I went and wanted to take something to go from salsa and the Peruvian restaurant next door so I called ahead to de Peruvian restuRant and my order was ready so I went to pick it up first and then go to salsa to my surprise when I was heading to salsa I did not saw my car that was parked on salsa spot well surprise the girl standing at the door called the towing company and they took my car they didn't care that even though I parked in their spot and I was going to buy something there as well! I don't think that something to do tonyourbcistumersband I'm a regular never again coming to this location I'll drive to aventura"], ["Sylvie O.", "Love love love this place !!!! Not only was it convenient  for me to eat there bc I live down the street, the food is always fresh and made in minutes ! The steak fajita is a go to! It's brought to you still cooking, I like to put the cheese on top so it can melt :) And you must try their \"jalapeño sauce\" (it's not that spicy ) with the chips !!!"], ["Erik C.", "It's alright but definitely not gourmet Mexican food. Nothing is super impressive. Salsa is bland. Margaritas are loaded with sugar and gave both of use stomach aches. Wouldn't go out of my way for this again. Wouldn't suggest just to save you time.  it's not bad but not good either."], ["Michael F.", "After eating their once I wasn't too impressed - the food was good but wasn't anything special. Then after making a return trip a few months later I've been going almost weekly. I'm not sure what changed but I love this place now. Both the burritos and burrito bowls are fantastic. The salsa bar offers a wide selection of flavors to add and the outdoor seating makes it easy to enjoy Miami's beautiful weather. When I moved to Miami I was bummed that there wasn't a Chipotle near by but after giving Salsa Fiesta a second chance I don't miss Chipotle at all."], ["ann s.", "Their guererro steak tacos and new rajas tacos are the bomb. Also love their tomale dipping sauce with chips.  I just wished they cooked the tortillas a bit more. Sometimes I get them under cooked and they fall apart. The crew is also very nice and attentive.So the tortilla issue has been solved, just request when ordering the tortilla be cooked longer."], ["Erica R.", "Always satisfied, I recommend the tostones nachos with carnitas it is one of my favorites. Fast customer service even with how busy it gets."], ["Jimmy N.", "5 stars everyday all day!!!!! I love salsa fiesta so much that if I wasn't afraid of needles I would get a tattoo of a taco on myself :) the food here is so incredible that if you have never been then shame on you! The nacho fiesta and the new taquitos are just amazing. The margaritas are amazing and strong. It's just the best place in Miami to eat!!!!!!! The best the best the best!!!! 10 stars!!!!"], ["Liliana E.", "Not sit and be served type place, you order at the register and the food will be delivered to your table. The food, is outstanding and the menu offers anything you could possibly want. They have a good variety of home made fresh salsas too. Beer, soft drinks, ice tea... They have it all. Even a large parking lot."], ["Daniel C.", "The tortas are all really good. My favorites are the zocalo and the Milanesa. Fantastic and fresh ingredients, cool space inside. Their tamale corn dip stuff is insane. Sometimes, we go there and get a huge thing of it - it's the highlight of the restaurant. They're open late and the food is ready fast. Love this place!"], ["Katrella S.", "My perfect lunch spot. I think I've tried everything on their menu and it's all delicious. Today was the tamale bowl with fish."], ["C P.", "Really nice restaurant. Quick service. Had Tostone. it was little dry but delicious. Finding a parking spot was little tedeous but food was worth the hassle."], ["Juan Pablo G.", "This place reminded me to Lime Restaurants. I simply can't take seriously a place that thinks that chips are a side dish and that thinks that by adding a ton of them justifies the size of the dish. Where are the traditional side dishes (rice, beans, guacamole??) I ordered a torta and it was kinda of flavorless until I added some salsa.Good - Fast serviceBad - Salsa bar, most of the salsas were gone (went there late by 9pm)Parking - There must be 20-25 spots for all the restaurants in the same spot. Crazy!"], ["William K.", "Great food for the price! The tostones loaded with extras are my favorite. The dips for the chips are pretty awesome as well. However, one entree is more than filling for one person. The only hassle is the limited parking."]], "Jacalito Taqueria Mexicana": [["Norma G.", "Definitely a gem. I have this good friend from Mexico, as is normal he was craving some real home cooked meals, and Yelp came to the rescue and we found this place. We decided to give it a chance and fell in love as soon as we walked in. Even though the place is T I N Y ! , when the service and the food are that great you totally forget about that! Second time we went there we tried the famous Pollo a la Basura, but I think I would stick to the tacos, it was too much for me. The rice and beans I must say are to die for. If you're in the mood for some yummy authentic Mexican food, head to Jacalito, you won't regret it."], ["Seyran C.", "3 tacos for $6?!?! And authentic at that!!! First off, as the other reviews have mentioned. Yes, this is a TINY little hole in the wall (my favorite places to discover when I move somewhere new). I believe I counted a grand total of 8 tables (with a  few more outside). Also, parking is tight and limited. But that being said, the food is so so good. This place has all of the usual suspects and downright awesome prices. El Hub went with a combination taco platter including the Chorizo, shredded beef, and chicken tacos, while I ordered three tacos Al Pastor. They were small (as they should be) and really just a couple of bites. But I found that it was the perfect lunchtime size as you did not feel like someone had to roll you out of the restaurant. English-only speakers may need to practice their Spanish to make ordering a bit easier. But that will be the least of my worries next time I head over there for some scrumptious eats!"], ["Israel R.", "I really want to give this place 3 stars but i can't bring myself to do it. I have a feeling that when i come back and try something else, it will totally redeem itself.Lets start off with the bad - the dining area is about the size of my tool shed. Even though i like my shed, i really don't want to feel like i'm eating in it. If it werent for my GPS i probably wouldn't have found this place because it's so small. Once YOU find this place i suggest you drive by and look for metered / street parking, if you like your car. Although there are over 10 spaces in the parking lot (which were actually full and double parked), the real drawback is the blind exit. In this neighborhood it is very likely to have to viejito rip your front bumper off as you creep out. I had noticed a few other review mention that the complimentary chips were stale - which was the case on my visit. I believe they prep a bunch of these to have them ready and they just happen to stay out longer than they should.On the upside - they make good use of the space on their dining area. The waitresses are really attentive... all of them... all 3 checked up on me. This could be because i forgot to turn the flash off of my camera though [oops, \"el yelpeh\" alert]. Food presentation is actaully nicer than most of the more expensive places i've eaten. They also had some really nice tasty cocktails.I went with the chicken flautas which come with mexican frijoles, guacamole and pico de gallo.  They nest the taquito missiles on top of some shredded lettuce, which i mixed with the frijoles and pico for a frijole salad. The taquitos were a bit overdone but they were still good - doesn't seem to be anything special in these (like a sweet secret sauce). I liked the frijoles a lot more than the flautas.It's an OK place with decent mex food. I wouldn't go out of the way for it but if you're in the area during lunch hours then it's worth checking out."], ["Geraldine A.", "Great service, great food. I tried the pollo, res and Mexiscan sausage. I liked the first two but wasn't a fan of the third, in all fairness though I'm not a huge fan but I went with that because they had run out of al pastor (my fave) and adobada. Definitely gonna come back just to try those."], ["Sherry W.", "Good authentic Mexican! Salsa is spicy! Chips are corn chips. When you order nachos they come with Great fresh  fried flour tortilla chips that are amazing. We got the combo 1 which is a lot of food for $12. Taco, enchilada, gordita, sope, nachos.... All very good. The queso fundidto is served with chorizo or beans. We chose chorizo. It was good cheese and served with warm corn tortillas (6). Overall, the service was good, great prices. And very clean restroom!  There is a parking lot but it was full so we paid meter on side street. Staff was friendly. There was a TV playing soccer. There are about 6 tables inside and many outside. No bar area. I would return!"], ["Shauna M.", "Nice little restaurant. Salsa dip is extremely spicy...... Pollo de basura is good and had orchata ---rice milk-- is awesome!!!"], ["Julio H.", "Jacalito is the type of place that poses a great problem to foodies, food lovers, gourmands, and people who like good food in general. Jacalito's food is so good, you don't need to look elsewhere, and that is a problem, because with so many new restaurants, chefs, trucks, and cuisines opening up every week in the Magic City, you are stuck eating at Jacalito. And you don't want to go anywhere else!One of my greatest frustrations, gastronomically, is that I have never been to Mexico. Actually, I have never even been to a state that borders Mexico. I don't know exactly what is \"authentic\" Mexican food, homestyle Mexican food, street taco culture, etc., and I can only rely on what people call Mexican food as my point of reference. But, here comes the but, I have been to almost every restaurant, hole on the wall, and truck, that deems itself worthy of calling their food \"Mexican food\".So, with that in mind, I can simply say that Jacalito is my favorites, if not one of my favorites.The difference here is that the ingredients are better than at the other restaurants. The steaks are better, they are still not NY strip or grass fed, but they are the best quality of the bunch. For sure. The same applies to the chicken, guacamole, salsa, sauces, etc., everything here is freshly made, the vegetables are cooked al dente, the ingredients are not murdered under the heat. In summary, they know how to cook.Two items are my favorites here: the Tampiqueña and the chuletas a la Mexicana. The Tampiqueña is a steak served with an enchilada, like for people who are hungry. It's a straightforward steak, and a straightforward enchilada, served with rice and beans. The chuletas a la Mexicana are pork chops that are topped with green peppers, onion and jalapeño, and they are served with rice, beans and tortillas. It is also a lot of food.Like I said before, everything here is very fresh. I sometimes order guacamole and salsa as an appetizer, and it always disappears. They also make queso, which is really good, specially the one that has chorizo on top.As far as the tacos go, this place is called a taqueria, and I have seen Mexican people come from other towns to eat them here. I don't know what they find in them, to me they are just good tacos, but I don't have that esteem for tacos like Mexicans do. I actually like fish tacos and shrimp tacos, but I won't say that at Jacalito, they may think I am a hippie, or worse, a hipster.Finally, there are dessert on the menu. They are good, but not the best. They also sell a margarita that is pretty good and made in-house, although I don't know how crafty it is. If you have had margaritas made with tequila reposado, these may not cut it for you, but they are still worth a try. Overall, if you stick to the specialties, the tacos, the apps and the quesadillas, you are going to love this place. I don't have a saying about the tortas, and like I said, the drinks are good and the desserts are OK.Jacalito sits on Flagler Street, and it is a very small establishment. Maybe eight tables inside and three outside, this place is quaint. Service is good always, there are hiccups here and there but those are rare and are followed by a million apologies. Again, this is not a gourmet destination, this is not homestyle Mexican food from \"la nana\", it is kind of middle of the road, but... it is extremely good food.By the way, if you like spicy hot sauce, you have to ask for it."], ["Coriana R.", "Take food was delicious just the customer service was kinda ok the waiter took forever to bring us chips & salsa we asked her to take a picture she rolled her eyes and walked up the mana her was very good and helpful other than all of that food was delicious so was the margaritas"], ["Jeanette R.", "This place is great and cheap. Authentic Mexican food. The tacos are small but good on soft corn tortillas. Try the carnitas, chicken, steak, and lamb. The flautas are a good and hearty appetizer that come w retried beans, guacamole, and pico de gallo."], ["Jeff R.", "Excelent place... By far one of my favorites... The pozole and the tacos de barbacoa... Delicious also a really nice welcoming atmosphere... Love the staff always friendly and attentive..."], ["Carol M.", "There are very few good Mexican restaurants in Miami and this is one you should try.I usually come here for lunch and order the tacos al pastor, this dish brings three soft-corn tortillas filled with the meat of your preference, in my case I love pork (carnitas) with pineapple. The flautas are also very good.The place is small and what would be considered a little -hole-in-the-wall. There is a parking lot that is shared with businesses from next door (and free).  The prices are good and the service is ok. I recommend it to placate your Mexican cravings."], ["Tiffany T.", "This is a little hidden gem on Flagler street. It's not a big restaurant,with seating in side and out but has a Bold taste . Authentic Mexican food , wide variety of menu and great prices. I go at least 1-2 times a month and typically get the combination #2 which brings a little bit of everything. Definitely recommend you check it -- you love it. !!!"], ["Peeyoosha H.", "We had lunch here when we visited Miami on Memorial day weekend. Food was just mouth watering & awesome, best beans ever! Salsa was super hot compared to other cities. Veggie Fajita had onions, peppers, rice and Veggie Quesadilla had mushrooms, onions, zucchini, peppers; both served with beans, pico de gallo and guacamole. Everything felt very authentic, at very much affordable prices. Service was really nice and caring. I haven't visited Mexico, but I would say this is the best Mexican food I have ever had!"], ["Alina V.", "Fantastic hole in the wall Mexican restaurant. Unpretentious, friendly staff and excellent food and drinks. The tropical margarita is perfect and it seems to be the most popular drink. The nachos for starter are so good! And they also give you complimentary beans and chips. Anything you order I am sure you will be satisfied with. The menu is extensive so there will be something for everyone. Go ahead and indulge in some authentic Mexican food and a great night out!"], ["Yanessa E.", "Jacalito is a hole in the wall Mexican place with real good eats. You may have driven by it a couple of times and not noticed it, if you like yummy mexican food, you won't want to miss it. I came for lunch on a Saturday with some friends. The chips and spicy red salsa dip (hot) that comes to the table as soon as you sit are highly addicting.  For entree I went with the nachos and added some al pastor (additional $1 charge.) The chips had a good ratio of beans, cheese, pico de gallo, sour cream and al pastor. They had mexican coke, so of course I had some. My friends went with the three tacos and they looked really good. I was told that their guacamole is delicious so I'll have to give that a try next time. My lunch including tip came to be less than $10 which made me extra happy with this place."], ["Yaili P.", "Delicious Mexican food! Enchiladas are the best! Better to take out because the place is so small."], ["Yesenia M.", "The chicken, Res, and pastor were a bit dry which sucks out flavor. The barbacoa de Cordero and carnitas de cerdo were juicy and tasty. We had tacos tostada and gorditas Varieties and our fave was the gordita which was crunchy outside soft doughy inside with delicious refried beans. The cream and queso and avocado on top of the tostada were Delish and fresh."], ["Laura G.", "Must try: frozen lemonade! I had the sopes with beef, sooo delicious! This is a cute, small restaurant with friendly staff. I was more than impressed!"], ["Jack B.", "Stopped by for lunch.  Hard to find authentic Mexican in South Florida but this place definitely comes close.  Had the al pastor, carne asada, and pollo tacos.  Delicious.  Salsa very spicy which is how I like.  Got a michelada made from Pacífico. Very refreshing on a hot afternoon.  Definitely recommend!"], ["Amanda T.", "My only complaint is that it's a very small place! This restaurant is amazing! The staff is friendly, food is delicious, and is very clean. I had the queso fundido with chorizo, and was in heaven. I'm not usually a guacamole person, but their guacamole was phenomenal! The lime juice is what gave it the kick it needed for me to love it. I ordered the sampler platter (combination #1) and was not disappointed. I definitely recommend this place to everyone who's looking for authentic and tasty Mexican food, for a good price. :)"]], "Coyo Taco": [["Jannely E.", "The burrito bowl is the best meal you'll ever taste here. I love the fact that the personnel are always cleaning the tables. The waiting is about ten minutes on busy nights but they always make sure to bring your order as quick as possible. They have update the outside tables and now it has more space. If you see the place full do not get discouraged as a seat always becomes available."], ["Marta G.", "I loved the Guacamole and Alambre salad !!!"], ["Cassandra C.", "I've heard great things about Coyo and was not disappointed with the food. I had two tacos and a side of quac... worth the $15. O ya, if you haven't found the small lounge in the back make sure to check it out! I've been a couple times and each time it's been fun."], ["MICHELLE C.", "Wowza!!  Love this place!  Of course I could eat Mexican food daily but we are so limited with any great Mexican restaurants here in South Florida.  We were in the area and hubby wanted to go to Proof because I have not been there yet.  Luckily I noticed they were closed (Monday)  when I looked them up with the yelp app, my best friend.So I noticed I had Coyo bookmarked and was excited to check it out.  Located right next door to Panther Coffee.  Parking is all street parking but we easily found a spot.  They have a few picnic type tables outside and a few tables inside.  You walk up place your order and they give you a number and bring your food out.  The taco's are creative with a good amount of options.  We so wanted to try the duck taco's but they were out of them.  Bummer, but I look so forward to going back to try them.We shared a guacamole and chips.  The guacamole was delicious, nice and fresh, and the chips were good as well.  Then we shared the carne asada taco's, pollo, and pork taco's.  The tortilla's are corn and taste homemade.  The meats were all excellent with such fabulous flavor.  The quality of these delicious taco's were visible.  They offer a few beers on draft and soft drinks. They have a small salsa area and oh my some of the sauces were either spicy hot, so good.  My favorite that I put on all my taco's was the Chipotle aioli. Yummy!!The staff were all super cool and friendly.  This is very authentic Mexican IMO, loved it so much.  Now, please open one in Broward, ha ha I look so forward to checking them out again and again.  Prices are on the high side for the type of food but so worth it.  Every single bite makes you want more."], ["Michael L.", "Yes - this is the one.  Extremely tasty tacos, and a wide selection of fun options, combined with well priced cuisine means that I will be back - and often.  The taco highlights for me are the Al Pastor, Camaron, and Pulpo (yes, octopus!)  The staff is friendly and helpful, helping to guide my menu selections.  The cashier also showed me that they were selling Jarritos Tutifruti (my fave), so that helped make it a good experience.  Next time I'm going to try the burrito, but I'm also going to sneak in the back.  Behind the kitchen there is a bar - I'm not sure if that is a secret or not (it looks like it is) - and I plan to spend some ill advised hours back there causing trouble.  Coyo all the way-o!"], ["Fernanda F.", "Oh, the tacos! So yummy! This place never disappoints. In fact, I would even say that Coyo Taco has THE BEST tacos in town!!! The Tacos Al Pastor are by far my favorite ones, but I recently tried the shrimp tacos and they might have taken the #1 spot! Regarding service, there's usually a long line and you have to stalk people to find a place to seat, but oooohhhh, the wait is definitely worth it!Coyo is taco heaven!"], ["German M.", "Came to Coyo Taco for dinner before hitting the bars and I have to say this place is doing great by how crowded it gets! I'm so glad Wynwood keeps on growing and adding great spots like Coyo.Ordering only took a few minutes and I got to try the pescado, pollo al carbón, and camarón tacos. The meats had a smoky flavor and the pescado taco had a very potent fish taste. Overall, the food is great if you want a quick bite.This is a very casual place with limited seating. In fact, we had to sit next door at Panther Cafe -- following the staff recommendations -- and were brought our food over there."], ["Alissa W.", "DISGUSTING !Wow has this place gone down hill from the past few times. I went in for lunch and there were flies everywhere to the point I was sick and should have taken that as the first sign. I ordered the pulpo tacos and shrimp. The pulpo tacos which is octopus was in a new sauce that had capers and tomatoes and wayyyyyyyyyyy to much salt ! To the point it just tasted like a swallowed a bottle of salt.  Everything tasted premade as if they knew there was a huge lunch rush. The tomato on top was shriveled and dried up. Like they were under the heater and the tomato just cooked to much. I will not be returning again between the flies and the food :("], ["Nate B.", "Overpriced Corner-CuttersWe went in expecting gourmet tacos (2 tiny tacos for $9.) we got the duck el pastor and the shrimp tacos. Each priced at $9 without a side. The portions were very small and the duck tacos were all cartilage as show in the image. When you charge so much for gourmet tacos.. you should not cut corners or write in the menu \"duck cartilage el pastor\"Stay away. You can probably find a better place around the block."], ["Melissa R.", "I love this place. More than chipotle, more than salsa fiesta- this place leaves all of the competition in the dust. Their chipotle mayo is to die for and their home made ice cream pops are great! The guacamole bowl is my favorite but really you can't go wrong with anything there. The staff is perfectly trained and they are all so very nice. I will forever come here at least twice a week. Yes, I love guac."], ["Krystal S.", "Yup, I'm in love with the Coyo!I am going to be visiting Coyo often (Note: VERY often). I had their Pollo al carbon burrito bowl with a small side of guac-- Can't forget the guac! I ordered a Jarrito of Tamarindo to drink. This meal was out of this world. It's one of those meals that you are so, so full but you don't want to stop eating because its so delicious! You can turn any of their tacos into a burrito bowl- score! My burrito bowl had cilantro rice, refried black beans, white cheese , very well-seasoned chicken, creme (this was like a sour cream), pico de gallo and cilantro. It was so delicious and... dare I say it?--- better than chipotle! They have a selection of sauces and me being a \"sauce person\", I tried them all. The chipotle sauce was my favorite and I poured it all over my bowl. Their guacamole is delicious and just the right amount of lime juice was used. All of this was washed down with a Jarritos.I am getting hungry just writing this. Ok, bye."], ["Stephanie L.", "After a full night exploring the galleries of Wynwood, or checking out some of the new breweries, hunger can hit fast and furious. Now as the area has become increasingly trendy, this can pose a real problem since the wait can be pretty substantial for any of the more formal sit down dining options.Coyo is definitely a convenient solution, offering more traditional tacos stuffed with an assortment of meat choices in the heart of the neighborhood.  While they are fairly basic (pretty much just seasoned protein in a tortilla), they definitely fit the bill.  Be warned, they are a bit on the pricey side relative to other taquerias in town, and the portions are fairly tiny. However, they do offer everything from octopus to al pastor and I definitely appreciate the variety. In addition, they make a great guacamole, they offer some delectable paletas, as well as a homemade horchata.Lately it seems to be increasingly popular, so don't expect to walk right up and get food - it can take a while. I also feel like the past few times I've gone, the quality seemed to have down a bit from where it had been (overcooked meats, smaller amounts of meat, etc.). While it isn't my favorite taco place in town, it is a decent choice when in the area."], ["Marla V.", "This is one of my go-to lunch stops during the week.  Let me start by saying this is not traditional Mexican food; it is gourmet Mexican fusion food.  My most recent visit was on national margarita day so I couldn't pass up their margarita and saying it was 90+ degrees out, it sure was refreshing!  I consistently order the same thing (I should probably venture out and try other things on the menu), but it so delicious.  I get the quinoa tacos with a side of guacamole and chips.  The quinoa tacos are corn soft tortillas with quinoa \"falafels\", queso blanco, tomatoes, and fresh cream.  I've had bites of the pork tacos and they are delicious too.  As a side note: this location is rather small and doesn't seat many people so go early or you may need to order your food to go."], ["Rachael B.", "I'm the toughest critic when it come to Mexican food.. because it's my FAVORITE!Coyo has good intentions but for me it falls a little short. I don't like that you have to wait in line forever to order and then seating is very limited. Also, if you want something else, you don't have a waiter so you'd have to wait in line all over again. The food was pretty good but not amazing, then again I'm the toughest Mexican critic. I won't be coming back here, but I can see why people like it."], ["Julio H.", "These days, Coyo Taco is like the place to be seen... in Wynwood anyway. It definitively is the Chipotle of Wynwood, except for better taste (I am not sure about the whole sustainability and social responsibility part). It is always full, there are lots of people inside and outside, and hundreds of eyes are looking at you. I had been trying to go to Coyo for the longest time, ever since they opened. I would always show up too late and my only Coyo Taco experience was a \"Close\" sign at the door. I guess that qualifies them for a one star review (I went there but they were closed: one star). I am just glad I kept trying because the food is pretty good.My favorite Coyo meat is the octopus, which is always well made, either in a burrito or a taco. Of the tacos, I like the shrimp tacos, which are crunchy and really good, and the duck tacos, which have a lot of duck fat and skin. I also like the grilled fish tacos, fresh and tasty. Sadly though, I think the cochinita, the staple of taco meats, is kind of an afterthought. Actually, many things run a little on the three star territory because even though the meats are cooked correctly, flavor may be lacking. Not always though, sometimes.But what I really enjoy here are the sides. The guacamole is tops, for example, and let me give a shout out to the Virgencita de Guadalupe. Thank you Virgencita, we have elevated our guacamole standards in Miami and we eat freshly made guacamole, with fresh lime and jalapeño peppers. I also really like the green rice and both types of beans (black and pinto). I could just get the green rice and my choice of beans, and drop the taco meat over. Coyo's ambiance is pretty cool also. I think tacos are meant to be eaten standing up, but I don't mind sitting inside, sharing the space with strangers in the humongous communal table. I get to meet strangers, talk about food, share stuff. It's always fun at Coyo.The assortment of spicy sauces is great. If you like some hot sauce on your tacos, this place won't let you down. They have some really spicy stuff.The service is pretty good, the cashiers are able to take orders correctly despite the heavy slurring of words, and the food comes out very fast and is delivered to the correct table. Coyo almost feels like a fast food restaurant because... that is exactly what it is: tacos are Mexican fast food!And don't forget to get some churros. Really good stuff. There are paletas available, but I haven't tried those yet.Overall, Coyo Taco is a cool place to grab a decent bite in Wynwood. If you don't want to have a sit down meal, and don't want to hit a food truck, Coyo is your go-to place. Plus, tacos are light and a great night snack. Burritos are the opposite.By the way, check out the Tequila bar. Actually, ask about it."], ["Sandra G.", "If you're looking for a variety of tacos you have to come here. There are so many options! The tacos were delicious! I had the Pastor de pollo and Alambre.The only bad thing was the line to order. (1st red flag this place was going to be good)"], ["Catherine L.", "Wow oh wow! Freakin deliciousness right here. I'm going to break it down really simply.PROS:Tapas style: go with company and order different tacos. Each order comes with two. One for you and the other for sharing Margaritas: reasonably priced, refreshing, perfectly spikedTacos & Guac: ridiculously tasty! We ordered 4 different kinds all were awesome!Beer: nice & cold bottle or draft CONS:Space: Tiny as hell. There is outdoor seating but can get unbearably uncomfortable. Please put a fan out there. Insects: lots of flies outside due to trash cans not having lids. An easy solution is get lids or set out glass or plastic clear pitchers of water away from seating to attract the flies. Cost: kinda pricey for two small tacos. We got 4 orders of tacos, a order of guacamole with chips, a margarita, Mexican coke, two beers, $63 ( ouch and that's with the 10% disc for checking in) We'll be back but just to snack to grab some refreshments"], ["Julie L.", "We're from out of town, but had heard great things. We came by for lunch. It was busy, but not too packed. We easily found a seat outside. We tried the duck, pork shoulder, and octupus. The duck was the clear winner, but the pork and octupus were great too. Octopus was a little chewy, but still unique. Great food, good outdoor seating, and delicious margaritas. I'd come back again and again!"], ["Indira M.", "Excellent tacos. The best are the carne asada and cochita. Definitely recommend the Churros too."], ["Chris M.", "That burrito was ****ing amazing. You get to choose the 4-starred word. It doesn't even need to be a cuss. Inspiration? Consider: Dilf.I got the Pastor al Pollo taco converted to a burrito, with jalapeños. Really delicious.I will confess that there was an eye roll and a bit of exasperation when I asked for the jalapeños, but that kind of service seems to just be a Miami thing, so, I'm not taking a star away. I mean it was hot, I wouldn't really want to be taking burrito orders either."]], "Cantina La Veinte Miami": []}