{"Rincon Escondido Tapas": [], "La Gamba Restaurant": [["Stephen W.", "Wow, what a find find! We were so fortunate to find this place thanks to Yelp reviews. Coconut Grove a really great area for restaurants. This restaurant has already won many awards in Miami and it is easy to see why. It is not cheap, but the food and service are definitely worth it. They start you with free bread that is warm and incredibly soft with great flavor. Maybe sour bread? They also give you some olive oil and some spicy olives. Next we ordered some razor clams which the server told us are not always available ($24). Really tasty. Next, we absolutely LOVED the artichoke hearts ($16). They were soft and flavorful beyond belief. Just stupendous. I could make a dinner of them. For the main course we had lobster paella which was not a real paella as the server explained because it came in a broth whereas a paella is drier. But I don't remember what it is called. Just look for the lobster dish that is $35 per person. You won't regret it. It's a huge bowl with wonderfully delicious broth and all sorts of seafood: shrimp, clams, mussels, calmari, and lobster. The calmari was the most tender I have had in my life. This dish was nothing short of spectacular. Our server was so helpful and caring, could not ask for more. We really could not ask for a more perfect meal. The dinner was not cheap by any means, but it is one of the most memorable meals I have had in my life and worth every penny."], ["Elena I.", "Came here with my fellow Yelpers on Sunday for a lovely lunch and I was NOT disappointed! I had their red sangria which was very good. It was not sweet (which I like) but I do wish it would have had more of a kick to it. Regardless, on a hot summer day it really hits the spot which is why I ordered another one! I had their tortilla española which was divine. it was very large and reasonably priced ($10). Other dishes that were ordered were the ham and cod croquettes, 7 seas paella, seafood with angel hair pasta, and tomato bread. They were all awesome. Super fresh, well prepared, and beautifully presented. For dessert we had the manchego tart with raspberry sauce and it was divine! Decadent and delicious - I highly recommend it. The owner makes it herself so you know it is very good. All their seafood is imported from Spain and it shows. They take great pride in the preparation and presentation of their dishes. The service was excellent and they had no problem giving us separate checks. This is a very small venue so I suggest making a reservation if you are going at night.  They have a small outdoor seating area with live music on Sundays.  A really great touch! Plentiful parking in lots, garages, and on the street as this is in the Grove. I will be back for sure."], ["Ian T.", "This is a 4.5 star review if it was possible to do partial star reviews on Yelp! Bottom line is that the food is great, the portion are generous, the seafood is fresh, the service is above and beyond. The reason it isn't a five is simple: price. It's a bit expensive relative to what you get.A group of friends had decided to come here, and what immediately popped out on the menu were the various paellas. The menu is somewhat limited but that's not a downside in my mind as experience has shown that it's better to specialize and focus on a few dishes and do them well than have tons of items.Service got off to a bit of a rough start, as both the server and I were frustrated in trying to understand and communicate the paella pricing. Afterward, once that was sorted, the service went to the outstanding range so this is able to be overlooked. However, I will say that the source of the issue is that the menu could be clearer. Essentially the various paella varieties required a minimum of two people to order and the price shows the cost for one person. However this wasn't noted. To make matters a bit more confusing, the two most pricey paellas were able to be ordered for one person only and/or split between two people. These exceptions likewise weren't clearly explained or noted. None of this ultimately was a huge issue (and again was more than compensated for by their outstanding service later), but I would suggest that La Gamba would be better off having this more clearly outlined on their menus.My wife and I, and two of our friends, decided to shoot the moon and order the Paella Siete Mare (Seven Seas Paella). It's their standard seafood paella with the addition of maine lobster claws as well as large scarlet prawns -- a variety that tastes a bit like lobster and is rich red even raw. It's served in a risotto-like rice cooked in broth. The presentation was amazing. It looked fantastic. They even displayed it to us before beginning to serve it (and let me take photos). The server then divided it up for everyone on individual plates.Another example of how accommodating they were is that they brought out the scarlet prawn on a plate to show us what we were getting -- and even brought another out later to let me take a photo when I'd forgotten to take the first picture earlier!All the seafood was super fresh -- including not only the shellfish but the clams. We also had croquettas of various types: ham, bacalao and shrimp. They were also very tasty and well executed versions. As a bonus, the owner of the restaurant, a nice lady, decided to eat next to our table (which is always a good sign), and was more than happy to talk with our companion about her approach to the food.The main downside is that the price of the high-end Paellas are somewhat high, even counting the scarlet prawns (which we've had before for less of a premium). This was $75 for the dish, although the fact we could split a single generously portioned serving helped. For their more standard paellas, it's still about $40 (aka $20/person). This isn't inexpensive, but less dear than the high-end. I will say however that it's exceptional paella and for anyone looking for quality renditions of these delicacies, this is a very good choice."], ["Caroline B.", "Super cute Spanish tapas restaurant! The food is delicious, the wine cellar superb & the staff is great - plus, the owner is the nicest! Perfect place for a quiet, wine-infused night with friends!"], ["Stephen M.", "Had an excellent dinner dining under the stars at this unpretentious but fun place last Friday night. While my son and I were treated to the music of SonCubano (and the dancing of passersby and diners), we were treated to Latin/Spanish tapas, sopa, and entrées. Though all the dishes were good, the only one I remember by name was LA Gamba alla planche (sp?), which had tasty prawns."], ["Rocio P.", "La Gamba's food is mostly good, but the service we had knocked down the 4th star for me. While my party and I enjoyed most of our food (I was lucky to have picked choices everybody loved, such as the branzino for entree and the poached pear with blue cheese ice cream for dessert), some other choices like the lomillo and the oaxtail received a \"good\" but not a \"wow\" remark. The appetizer was a crowd pleaser though. Everybody loved those croquetas: perfectly warm and flavorful; crispy on the outside and creamy inside; dipped in squid ink sauce, mmm...Our wine choice was a hit and miss among my group, but then again, wine to me is more of a personal taste affair, so unless a wine is beyond bad, opinions are meant to be varied. Now, while our server had a good demeanor by most service standards, the service was terribly slow. We were in conversation mode for the most part, so we didn't really drill the guy too much over this inconvenience; however, the folks at the two tables next to us were neither that talkative nor that carefree that night to forgive the poor guy. And I say \"poor\" because it looks like it was just him and another seemingly new guy handling the whole restaurant, which although small, was still packed to the last corner. On the plus side they had my favorite Miami flamenco guys (same ones that perform at La Taberna Giralda) playing outside. Judging by most reviews, seems like with better service this is actually not a bad choice for a dinner night at the Grove..."], ["Vivian R.", "Great little gem in the heart of the Grove!! Indoor/outdoor seating with live Cuban band playing outside! The croquettes and the bread with tomatoes were amazing! I had the fish with shrimp and clams in white wine sauce and it was perfect! Then to top it off had the Manchego tart with raspberry! I have never had it together like that and let me tell you, it reminded me of being back in Spain!   Parking is easy as well! Jeff takes care of your car while parked and no need to find parking on the street! Definitely will be back at least once a month for my Tapas and Spanish dishes! Loved it! The only reason didn't get the 5th star is they really need to work a little harder for their American customers! I am Cuban, but my gringo hubby had a hard time communicating! But, that can be remedied!"], ["Shahab K.", "SOOO BADDD!!!! Where do I begin. I went to the place in Saturday, October, 17, 2015 at 9:00 PM. There was an apparent \"manager\" who claimed to be the \"owner.\" He was white skinned and about 6'0\".First of all, he should be fired. My girlfriend walked to he bathroom and actually entered he bathroom and he knocked on the door and said \"if you're not a customer you need to leave.\" Like in all honesty, who do you think you are? You don't gel someone that. My girlfriend as a customer. That's how you run people out. My girlfriend comes to me crying and I get super mad. I confront the guy. Remember, this is a white skinned 6'0\" dude who says he's the \"owner.\" He basically gets too emotional because he knows he fucked up and says I need to leave. So he basically kicks me out for nothing. I asked him why and he has no reason.By the way, this \"owner\" is still obsessed with us and wants to call he cops. We even ordered food! So basically we're leaving and our food comes and I get the food and throw it on the floor towards him and he calls he cops.Shameful.I feel bad for him.No hospitality at all.The restaurant may do good for the next year or so, but I don't see it last any further than that with the \"owner\" they have."], ["Daniel A.", "Sat outside and enjoyed some live music durig dinner. We went with a big group and ordered alot of the tapas. Everything was decent but a bit pricy. I must say the croquetes were out of this world! I ate like 6 of them...we needed to order more. Service was good and food kept on coming considering we had a big group of 8."], ["Carlos N.", "Ever since my last review, I've been coming back to La Gamba to celebrate special occasions. It feels great to eat great food in a homey atmosphere. I went yesterday to celebrate my girlfriend's birthday and it was a wonderful night. The staff was extremely friendly and the food was superb, as always. I had the Paella Siete Mares, which is to die for (please make sure you try it)."], ["Mari M.", "Excellent! We had the bread drizzled with ripe tomato and olive oil.....the warm goat geese salad, the fried eggs with fried whitefish and the tortilla con patatas, which is made to order.  Topped it off with a Flan de manchego which was more like a cheesecake.  Really good food! Recommend."], ["Curtis L.", "The paella and all of the tapas were fantastic. Took me back to my time in Barcelona Spain. The baby squid and oxtail croquetas are amazing. The service was friendly and helpful with reccomendations. If you find yourself in Miami make sure you stop by here!"], ["Wendy J.", "Stopped here on vacation.  Great atmosphere, sangria, and tapas.   Would definitely come back!"], ["Jessica W.", "I stopped by La Gamba for a late lunch the other day & absolutely loved the food. Their menu is a bit limited, but they have most of the Spanish classics. The gazpacho was flavorful & refreshing. We ordered the arroz caldoso with lobster that was almost as good as what I used to eat when I lived in Barcelona. It ended up being an expensive lunch, but absolutely worth it!"], ["Titus V.", "Good size restaurant for personalized attention, good food, well presented and fair priced, we, a party of 4, had a good time and will call again.Titus"], ["Ana S.", "Food great, service sux, ambiance cute minus the AC not cooling the place - seriously? Miami and Summer hello heat and humidity."], ["Sally R.", "So we came to Coconut Grove on Friday memorial day weekend 2015 around 8pm.... Surprisingly, it was not that busy (as usually) and parking was very easy.  We usually go to the same places in the grove but decided to make plans for a movie and  thought that we could kill some time discovering other places  in the awesome coconut grove area.  After reading some reviews, we decide to stop by La Gamba. Spanish food is our favorite since we came back from our trip to Spain . Spain is absolutely beautiful and the people are even better. I guess that is why our expectations were high and maybe that is why we are so extremely disappointed with La Gamba, so, when we got there, we were honest with one of the waiters by telling him before he sat us that  we are thinking of going to the movies so we were probably going to get a few drinks.... he didn't know what to say so he went inside for a few minutes to get the \"manager or owner\" ( no idea who he was-- young gentleman) regardless, this is what happened...He told us that he will put two chairs on the sidewalk for us to have drinks because they have music tonight and they cant give us a table.  By the way, they were plenty of tables available at that time..... I did not think it was nice for us to be in this customers of this restaurant but  be seating in the middle of the sidewalk...like a street bar....so our first time in this place and we should have chairs int he middle of the sidewalk.... what kind of restaurant is this? we are better off going to Happy Wine, which also has music and they treat customers with more respect.'Anyway, at the end, I have to thank the \":manager/owner\" because after the weird experience with him,  we went to the place almost across the street called Le Bouchon (French place) and to my surprise they were super accommodating and gave us amazing service even though they were almost at full capacity.  Literally, one table will get up and other people will seat down. It was super busy but we had a  divine experience in this small but cozy place.  we even learn some French!!! Moreover,  we had such a good time that we decided to not go to the movies and actually have dinner.  We can't wait to tell our family and friends and already made plans to come again. By the way, we were not even hungry but we ate, service was that good, that we were convinced! Oh boy, good we did!Anyway, my point in this review for La Gamba is to be ready to tell them you are going to have a big check otherwise they wont give you a table but give you a chair in the middle of the sidewalk.. By the way, there is a wine bar down the street that probably would have treated us better.First impressions are the most important and ours with La Gamba  was terrible.  They seem to be so worried about having big bills that they forgot customer service 101. Needless to say that  when I told the \"manager/owner\" that i thought the chair on the sidewalk was not nice .. he said \"ok, good bye\"  and went right back inside. nice....We will not come again to this place but if you have better luck with them then good for you.  however, everything happens for a reason and now we have another favorite French place in Coconut Grove without music but excellent customer service. Buena suerte!"], ["Hortensia A.", "All I can say is that this 8 month old place has a ways to go before I return. The portions to price ratio is on the higher end and I left a little dissatisfied with service. I made reservations to eat here, and we were waiting for a good 3 minutes with no hostess. Finally an employee shows, and we are seated. As we seat, it takes less than 1 minute for her to ask us if we are ready to order. I ask her for some water and a minute to review menu. She returns with a bottle of water, instead of asking if we want bottled or tap ( which really gets under my skin ). I turn away to bottled water, ask for some tap water and a glass of wine. The selection of wines by the glass are limited, but I made due. She brings me a Rioja I requested, shows me the corked bottle, asks if it's ok, I nod, she pours the entire gala instead of allowing me to taste. It's not to sound like a snob of anything, but if by the glass, just either bring me the glass of wine, or allow me to taste. Don't give me mixed messages of high end service and then fall short. So literally one minute after the wine, she asked again if we want to order. I am already quite irritated because I've been here less than 5 minutes and she's asked twice! I explain I haven't gone through the entire menu to please give me a minute. She urges me to order because the kitchen is closing... I order 2 tapas and tell her to wait a moment for rest of order. Within the next minute another waiter asks but again to order because the kitchen closes at 11. So my boyfriend order 2 additional things and we give the menus back. My primary grievance here is : if you're going to allow 10:30 reservations, you can't rush your customers to choose their meals because you want to go home! Much less close the kitchen in 30 minutes when you should know that dining takes approx 1 hour from beginning to end. Ok, now that being said : the food. We order mixed croquettes that come with 2 types, shrimp and ham croquettes. They were mild in flavor but tasty. We also requested an assorted meat board that for 18 bucks was a complete rip off. I've seen more meat on a subway sandwich! Finally my boyfriend also ordered rack of lamb And a gazpacho. Gazpacho was flavorless and watery, lamb was tasty and juicy, but again a small portion for the money. In general, I won't be returning until they turn this place around. I was disappointed for the money spent, and the service rendered. A generous 3 stars."], ["Katie J.", "This review is way overdue. Went here with my friends and let me tell you this place is my new Miami favorite. I'm tired of places that are all about looks hype. La Gamba did not dissapointed. We had some of the best Paella I've had in the city, the fish was super fresh, the staff was very friendly (and good looking...) and the wine list although short was packed with great pick a very good prices for a Miami spot. The place is on the smaller side but they got a huge heart and its super cute/romantic/cozy/chic."], ["Ana S.", "Local gem. Genuine spanish food and flavors, seriously, only Spain can get more real. The service was wonderful, specially from the manager Miguel, who made great suggestions. Excelent flamenco band plays outside on weekend nights. Overall, really nice place for any ocassion!"], ["Francisco D.", "I had dinner at La Gamba last night and it was amazing! The location, the food and the service were spectacular. It is a welcomed addition to Coconut Grove and I will definitely be coming back. Try the Paella!"], ["Rosyan C.", "Went there on a thursday night and it was empty so we they were especially helpful. The chef even came out and checked in with us which was nice of him. The folks there were pleasant, especially Rosie. The gazpacho was ok but everything else was great. We had the 4 course chef sampler. The gorgonzola ice cream was wierd but awesome. Try it!"], ["Camilo V.", "Great service and enjoyed the flamenco trio outside. The tapas were really good. Got the croquettes and calamari. We got the black ink paella for five people. It was good, although I felt that for that kind of price, it had very little seafood and way too much rice.  we had enough to take a plate to go, and it was all rice. Nevertheless, it was good."], ["Ricardo D.", "The food is very good and well priced. I've tried most of the plates and have been pleasantly surprised by most. The rice and fish plates are great. Must get the croquetas and stuffed bacalao peppers as starters! Nice ambiance and newly renovated. Good date place."], ["Aileen G.", "Not good. Best thing we had was the bread. Food was definitely not made with authentic recipes. They don't serve just a glass of sangria (pitchers only). My Spanish omelet was more like a baked potato with an egg mixed into it. If you didn't know what authentic Spanish food was like you may find it to be mediocre at best. Not only is the food not good service was worse. Waiter was not pleasant and we had to ask for water three times before we actually got it. Won't be going back and won't be recommending this place."], ["Stephane D.", "Awesome place, great food and affordable .... The paella was great and the gazpacho awesome"], ["Susan S.", "Importantly, food here is good. Egg, potato and ham dish was yummy, as were clams and shrimp. Lentils were not as good. Downsides are the place is tiny and tables are way too close together inside.  Outside seating is much better.  Drinks are overpriced.  Our waiter was terrible.  I hope they get things together on the service side. This is a big improvement over Ludos, which previously occupied this space."]], "Zalameria": [], "Los Gallegos Restaurant": [], "Madrid Restaurant Tapas Y Vinos": [["Luis N.", "I've been here twice and enjoyed myself both times. Their food comes out quick and generous portions. Their sangria glasses are giant and I'm  not complaining. the garbanzo beans are awesomeness as well as their meat platter. The meat platter honestly feeds maybe 3-4 people. I went with a deal for living social on my second trip and they kindly accommodates us. However, I did have trouble reaching them on the phone for a couple days to make a reservation. Not a big deal but FYI."], ["Anthony C.", "One of many Spanish locales in Coral Gables. It's hard to keep them straight!!!Anyway, this one is definitely worth a try. After driving around a bit looking for a dining establishment, we stumbled upon Madrid. Props for being open on Sunday since It's tough finding a place that's not closed on said day in the Gables!Even though the restaurant was somewhat empty, we definitely enjoyed our meal! The menu consists of Spanish cuisine classics. We ordered some octopus styled \"a la gallega\" and marinated white anchovies done the Spanish way known known as \"boquerones\". We figured that after we finished these \"tapas\" we'd order more. But, boy, we were stuffed after just having these two dishes. From a sizing perspective, \"tapas\" they were not! The servings were huge!!! I was expecting smaller plating, but when comparing the plating to the pricing, I found the pricing to be on par!! We washed these two dishes down with some nice, fruity sangria. The sangria was decent, but not anything to go crazy about.All in all a decent option to satisfy that Spanish craving, but my recommendation is to go with a bigger party to take advantage of the array of oversized \"tapas\". Ole!!!"], ["Michael S.", "This new tapas restaurant takes the place of an older tapas restaurant that was in this same spot for many years. It closed about 1-2 years ago. The new owners have completely redecorated the room. It is much lighter, brighter and cleaner than it was before. The menu has also moved upscale. The dishes that I had were neuveau interpretations of Tapas classics. When you sit down they bring you a small complementary plate of manzanilla olives, jamon serrano and a basket of nice crusty sliced baguette. I ordered the Ensalada Rusa and the Salpicon De Mariscos. Both were out of the ordinary. The Ensalada had large pieces of potatoes and carrots along with lots of tuna. While it was not the best version that I have had it was excellent. The Salpicon was composed of lots of freshly prepared seafood including clams and mussels still in their shells, tail-on shrimp and cooked white fish, probably merluza with crunchy vegetables swimming in an olive oil broth. It also was excellent. For desert I had the classic Torta de Santiago an almond tort. This version was more cake like than I prefer but because of that it was lighter than the classic version. The espresso was good. This restaurant is a substantially better but slightly pricier replacement for the previous tapas restaurant at this location."], ["Julio E.", "We ordered two tapas and I really couldn't tell you which one was worst. I ordered pulpo and my wife ordered the papas brava they were horrible. For dinner I had a veal steak and my wife ordered the ham, cheese and chorizo sandwich, again the food was sub par. I will definitely will not be going there again."], ["Mike B.", "Definitely an interesting experience.  Went during an \"event\" night: spanish singer, flamenco dancing and karaoke.  Not the kind of place you would go for a quiet date but if you're into the whole dinner and show experience then this may be for you.  Food was ok, but extremely overpriced for the area and what you're actually getting.  They also ran out of a lot of ingredients so we had to select from the scraps.  Seriously, they ran out of tomato sauce and chorizo."], ["frank m.", "Great Spanish food.  El pulpo a la gallega is awesome,"], ["Jessica P.", "Great atmosphere, nice staff. They had so much to choose from for tapas and I regret not ordering just tapas. My bf and I ordered the sausage with cheese (not a healthy option) tapas and its was so delicious with their bread. I ordered some sangria which was very refreshing. My bf had the assorted meats platter which was seasoned so nicely. I had the cod with roasted potatoes and rice. The sauce on my fish was so good and the fish itself was just okay. The rice was just not fresh. I wish we would have just splurged on sangria and tapas and skip the entrees. I was so full because their portions are huge so we did not get dessert."], ["Andres S.", "Outstanding! A best kept secret in Miami. Small place, about 20 tables inside, 6 outside. Family-owned, and definitely keeping a family ambient.  You feel like a guest at their own house. I ordered mixed croquetas, tortilla con chorizo and a glass of red wine. They are made to order (nothing pre-made), and the portions were more than I could handle, so I recommend bringing a date or good friends. My chorizo tortilla would have been good to share with 1 or 2 more people. The flavor was just perfect."]], "Xixón Spanish Restaurant": [["Jessica W.", "Compared with the other Spanish restaurants in Miami, I think xixon has some great options for tapas & I love their outdoor patio. They serve dishes like angulas al ajillo that can be hard to find at other spots in the city. Service is usually friendly and efficient. Would recommend checking them out!"], ["Mr M.", "We have been following Xixon for many years and have always found them to be innovators and very consistent.We checked in for lunch yesterday afternoon for a quick glass of bubbles and some croquettes. My wife had the jamon serrano croquettes which were nice and tasty. I had the duck croquettes which were outstanding! The right amount of creamy béchamel and a nice crisp.Keep up the good work Bego!"], ["Charlotte B.", "I loved this place! The ambiance was really nice, I sat at the \"vinoteca\" next to where they had all of the wines! It was awesome.  We decided to just get several tapas and wine.  We had the cava sangria (really good) and for the tapas we ordered a cheese and meat board, the octopus, garlic shrimp, meatballs and the patatas (potatoes).  Everything was really good.  Next time I am in the mood for tapas and wine I will definitely come here."], ["Sabrina S.", "Almost perfect! All the way until the end when I asked for a coffee and the check.Waiter never brought the check and then spent 20 mins talking to another table while I waited.Ended up having to get another waitress to get me the bill and after giving her my card, she had to bring it to the original server and he STILL kept talking to the other table for another 5 mins while I waited Still tipped 18% but left aggravated because now I'm lateFood was great though"], ["Juli M.", "Food is ok!!!!!!   Be careful with the area my car got broken into right in front of the place!!   Never again!!!! They need someone outside looking for the safety of customer cars or they will lose business. Service was a little show....."], ["Hernan B.", "My new favorite restaurant. All locals, low key no Miami flash.The food us outstanding at all levels and service impeccable.Every dish we had was per-fect. New favorite..."], ["Ninja S.", "Almost Great .accepted The Manager .If you can't think or Make your own Decision for something .what else can you do ? Food and service are always Good !!!"], ["Lauren R.", "Amazing authentic Restaurant that I'm told transports you to Spain. The wine selection is extensive and tapas are amazing! Only down side for me is nearly everything had pork. It's a very popular spot, if you don't speak Spanish it might be difficult to communicate what you want. You will find street side parking,there is no designated lot."], ["Ron J.", "One of the great authentic outside of Spain restaurants I've been to. Amazing service and incredibly knowledgable staff. Excellent wine selection, we were delighted by the managers recommendation with the food pairing. I love dining tapas and they have a tremendous selection on their menu. I strongly recommend the lamb, it was done to perfection. They also have a great patio for an after dinner beer."], ["Talisha M.", "Saturday night ambiance 5 stars Food 4.75 starsService 3.5 starsI really loved this place. The market, the guitarist, the extensive menu, & the busy crowd on a Saturday night. Loved everything I had: gambas & gulas, jamon croquettas, veal chops, cheese, jamon, ensalada rusa, & arroz con leche. Oh and I had to try the Clara de verano which is beer with kas soda...yum!! Great place to take a group. Feels like spain!!"], ["Winnie W.", "Good tapas place, def. get the suckling pork, the lychee martini rocked, must try the shots of pumpkin and leek soup. The duck croquette was ok but nothing to rave about, pepper with garlic and spanish tortilla was very good! A good place to share and have good wine! A bit noisy and busy but worth it."], ["Jessica F.", "It was great! We were looking for tapas tonight and were lucky enough to find Xixon. There is no parking in the area, but they have complimentary valet, so no problems there. It's a nice, big place with three levels. Some of the other reviewers have complained about service, but our server was very attentive and yes, he spoke English. The food was really good, my favorites were the Croquetas de Jamon Serrano, the Datlies con Bacon, and the Tabla de Jamon, Manchego and Chorizo. We also had Gambas al Ajillo, Patatas Fritas 3 Salsas, Calamares Fritos, Tortilla Espanola and Tostas de Solomillo de Cerdo. Nothing was bad, but the Croquetas and the Datiles were the best! Apparently, they want you to have a reservation though because the hostess asked if we had one and when we said no, she told me we could make one on the website and gave me their card. It was 6:30 on a Saturday. It isn't like they had a lack of empty tables or anything, we were still able to sit immediately, so not sure what that was about but not a big deal."], ["Gaby L.", "Wow...just wowBest Spanish style ham croquettas in town hands down. Best thing I've eaten was the arroz negro (squid ink rice) in my opinion it's better than paella! It's an adventurous dish to try and very typical of Spain definitely suggest to try it if you're in the mood to try something new and exciting. The chocolate con churros are of the chain too! I've been three times and plan to keep coming."], ["Julie A.", "Loved the atmosphere and the food was great. The croquettes specially the cod ones were very tasty. We tried the pork tenderloins on small toasted breads and a slice of baked apple on top, super yummy. We had to drink the Cava Sangria and it was delicious,  highly recommend it...definitely will be back"], ["Alina V.", "Made reservations for 7 pm on a Friday night. We arrived a little earlier and we were seated immediately. I had requested to sit inside the vinoteca in English meaning wine cellar, it was so quaint and romantic and just the perfect setting. Monday- Friday they have happy hour until 8 pm. I decided to order the pitcher of sangria for half price! So good! Next, we had some calamares and gambas al ajillo which are sautéed garlic shrimps. Both tapas were fantastic! We also had a tabla with manchego cheese, Jamon Serrano and chorizo and a tortilla espanola. Yes, we did go a bit crazy with the tapas but everything was too darn good not to try! If you're looking for a wine and tapas spanish place, with a bit of romance and a guitarist, this is the perfect place to go! Will definitely be back for happy hour!"], ["Nakia O.", "Great service and delicious food. Also valet is complementary! Solomillo de buey is out of this world and the arroz con leche dessert is hands down the best in town! Must try this place and try to get a table downstairs by the wine room."], ["Eric N.", "Terrible service....I actually walked out after no one greeted me or asked me for my order."], ["Eva P.", "If I could give a zero, I would. I made a reservation and got called an hour and half before my dinner. It was my birthday and I had read all these wonderful reviews about the food. I convinced my friends to drive in from out of town weeks before. Then, less than two hours before my reservation I get a call. BAM!!! \"you're reservation was cancelled because we have an event\". Wow, thanks. I was excited about trying this place out, but whoever called me was so dry and uninterested. Had to call everyone to change routes. It's ok though because I managed to go to an amazing place that gained 6 new guests and a nice hefty check. Do yourself a favor and go to a place that is more considerate."], ["Rachel O.", "Oh so delicious. Love spanish tapas restaurants and this one did not disappoint! Tried so many delicious things on the menu. Highlights were the duck croquettes!"], ["Rigo R.", "I came with my family for lunch and they said it was 'simply the best'. And when this is coming from a Spanish family who cooks traditional Spanish dishes at home, you know it has to be really good. We tried: Fabada Asturiana, Pulpo a la Gallega, Tortilla con Chorizo, and Croquetas de Pollo. Outstanding! By the way, if you need to buy some cooking ingredients and supplies that are from Spain, this is your place!"]], "Delicias de España": [["Cassie G.", "With Madrid on the brain, this place jumped out at me when I was driving down Red Road. I pulled a U-Turn, scrounged up some quarters for the metered parking, and went to check it out. With wide-eyes I perused the shelves of food staples I had grown to love while living in Spain. From the market, I only grabbed some turron to bring home for the holidays but will definitely be back to stock up on more sweet treats, spreads, and Spanish ingredients when I'm back in town. Then my nose got the better of me. I could smell the tortillas sitting out and the bread toasting in the cafe. I couldn't resist a jamon y queso bocadillo. I didn't realize until after that you can get a variety of sizes, but I'm happy I got a big one. I definitely would have wanted more if I went for a downsize. They served it warm and with just one bite I was transported back to Europe where ham is actually ham and not that processed stuff from Oscar Meyer. The arrangement of cakes and empanadas in the cases, and the array of food people were enjoying in the seating area all looked delicious. They have an awesome catering menu that I'd definitely take advantage of when I need to bring something to a party."], ["Cristina G.", "I dream of returning to Spain, and everytime I get that little tickling urge, I go here and settle down a bit. I love the way it looks inside, I love the shop, I love hearing the spanish accents from some of the employees, and as far as the food  goes, it has been nothing but delicious! The service has always been pretty good regardless of how full they are. They can get pretty full.These are some of the items I have eaten here:-Slice of tortilla-ensalidilla rusa-some sort of seafood salad they have-paella-bocadillo (sandwich) with serrano ham, manchego, and chorizo. -potaje (bean stew)All have been really delcious. Then, I wash it all down with a yummy cidra (cider). My favorite thing to do is order a few tapas and share. If you want more, you order it, and they bring the cold tapas out fairly quickly. So pretty much you can eat as you go.They service is pretty chill. I like it like that. Its European. Thats they way they roll. If we are in a hurry we just let them know and they don't dilly dally.Worst part is the parking in back but you'll manage."], ["Alexandra A.", "Came here for a late lunch on a Saturday and had to wait for someone to approach me to seat me after standing awkwardly waiting for about 10 minutes only to be seated and receive no service. Literally got up and left. Thanks for the water !"], ["Rose A.", "I am from Spain and have to admit the food is genuine. I usually go for breakfast but on many occasions. Although I loved the food, the service fluctuates. Sometimes it is great and others... Let's just say it's a miracle I've been back. Even through these hiccups, the food is very well worth it though and the hot chocolate is super yummy."], ["Twila T.", "Yum! Food was great, service very polite and attentive, if a little slow, and the dessert - OMG. Thank you for making the lightest cheesecake I have ever had. Normally I detest cheesecake but it came with the \"Special\" meal and was delectable. Love the paella pans on the wall!"], ["Rose J.", "I have gone a few times and although the sandwiches are yummy they are a bit expensive for the tiny size. I enjoyed coming here but nothing to go out of my way for....if I am in the area then perhaps I'll stop by...."], ["Brian G.", "Delicias de Espana is the best tapas restaurant in South Florida.the restaurant also has a Spanish market, takeout counter,and dinning area. the fish, ham, lamb, seafood etc are as authentic as it gets,  and like itsname, delicious. this is a very casual restaurant on the edge ofCoral Gables and Miami."], ["Dennis R.", "Wow wow just freaking wow. Our waitress was not only courteous and friendly, but she also provided outstanding recommendations. The sangria is refreshing, the place is generous with their portions. I really enjoyed your medium size cured ham and chorizo plate. Definitely the best tortilla española."], ["Suzanne P.", "I've been coming to this place since it was just a tiny hole in the wall in the shadow of Allen's Drugstore. The manager is an amazing Spanish gentleman who, back when I was 10 or so would give me these tiny chocolate desserts covered in chocolate sprinkles. Really, the owners are just super nice and always treat the guests like...well, guest, honored guests.I love this place because it reminds me a little of Spain and since my roots extend all the way back to las Islas Canarias, the Basque country, and even Barcelona I find myself feeling at home surrounded by all things Spanish. (Then again I love all things Japanese but I'm not Japanese, not even close...eh, go figure). Anyways, the food is authentic Spanish cuisine, all of it. I csn't even begin to go through the menu since between my family and I we have probably eaten everything on the menu at least four or five times over since they first opened up. So let me just sum up my favorite foods: the tortilla española is amazing, yummy and with a flavor that is not too in your face; the bocadillos filled with chorizo (my favorite Spanish tapa, only second to jamon de Jabugo which they have actually had from time to time) and queso manchego are just such a great lunch treat; and finally the tarta de Santiago which is w classic Spanish dessert made with almonds, it's always perfectly sweet and just chewy enough.I know I've been using a lot of Spanish terms (sorry to the non Spanish speakers) but there really isn't any translation for the names of the foods. As such, I hope you don't get offend it.My advice is to go and try this little slice of Spain. Last time my family spoke to the owner he chuckled when we asked about his creeping domination of the whole block. Mind you he used to just have s tiny whole in the wall! Pretty amazing. Who knows, Allen's drugstore might just be conquered by the Spanish :)"], ["Sasha B.", "We have been patronizing Delicias de Espana for years and have breakfast there often on weekends.  We usually order the two egg breakfast which includes ham, fried potatoes, 1 or 2 rolls, butter and café con leche for $7.00 (Used to be less, recently went up.  What else is new??)  Depending on how full it is, service ranges from prompt to slow, bring something to read and you'll be OK.They also have Eggs Flamenco (I believe this now costs $11 and includes café con leche and rolls) which comes to the table piping hot and bubbly from the oven in red pottery with a layer of Serrano ham at the bottom, lots of tomato sauce, petit-pois and eggs.  Wait until this cools slightly and then dig in with the rolls.  Beware of light-colored shirts nearby, they're bound to be splattered with tomato sauce and ruined.Occasionally, I'll order their hot chocolate and (baguette) buttered toast.  The hot chocolate is not watery, it's made like in Spain, it's very thick and very filling even though the serving is small.  I heard a while back that all the dough for their breads comes from Spain, don't know if this is still the case.  They also sell churros, two pieces to an order, but I did not like them, they were not as I was expecting them, they were not crunchy as Cuban churros are and those are the ones to which I'm used.We rarely eat lunch or dinner there.  While they have a lunch special each weekday, the rest of their regular prices are extremely high.  Some could even be considered outrageous.This restaurant has grown tremendously through the owner's (Ernesto) hard work, dedication and business savvy.  It now consists of 3-4 spaces, they also have their offices  and an import company across the street.  There are parking meters all around, there are machines where one pays for parking.  Sometimes it might take a couple of drives around the block to find a parking spot.They also sell all sorts of products imported from Spain including a very large assortment of cheeses.  They also offer lots of take-out foods such as Spanish omelets, cold shrimp, potatoes aioli, ensaladilla Rusa, cold cuts, fish which I believe is flown in from Spain, sandwiches, cakes and excellent pastries.  Their Tres Leches is very good.  In the store section you will find lots of varied items from Spain such as pottery, saffron threads, oils, beans, rice, candies, cookies, crackers, even potato chips!  As with most imported goods, prices are not inexpensive but if you gotta have it, you'll just have to pay for it.At this time there's no obnoxious loud music playing to annoy one while eating.  There's no annoying TV on the premises.  Yey!!   If the restaurant is very full and everyone's talking the place can get quite loud."], ["Yanet A.", "great place ! it's a store, market and restaurant. The jewelry is beautiful and imported from Madrid.Food is great, the best chorizo tortilla i've ever tasted !The market/store is adorable, it has a huge wine selection, ham, cheeses, olive oils, turrones.ALL THINGS SPAIN here..."], ["Bryan Y.", "This place is like a restaurant/diner, supermarket, and liquor store ALL ROLLED INTO ONE.This was my last meal in Miami. My friend took me here before she dropped me off at the airport! Like all Miami restaurants, they gave us a solid service completely in Spanglish lol. There are some amazing dishes on the menu. I got \"Arroz con calamares\" which is rice with squid. At first when they brought it out, it looked kinda bland, but once I put that spoon in my mouth...the flavor EXPLODED in my mouth! Its really rich and the squid complements the flavor of the rice! I also had some Cafe con Leche afterward. It came in a small cup, but exploding in caffeinated bliss!We had a great conversation during our meal, about life and traveling. She wants to go to France and I want to go to Brazil! We also talked about our families and life on the east coast.This place has amazing Spanish wine and liquor varieties as well as specialty meats and lots and lots and lots of amazing cheeses. This HUGE calf's leg with the hoof still attached was $500. That is nuts lol.This is a great place to go for a great meal for lunch!!"], ["Andrew J.", "This place is as close to an authentic Spanish cafeteria as you will find in Miami... not a trendy reinterpretation.All the typical food you would expect...tortillas, jamon y queso, salpicon de marisco, etc. and Spanish wine and beer too.They also have a market where you can get fresh fish imported from Spain, even an entire Jamon Serrano.Not a sexy date spot at all, but if you enjoy Spanish delicacies you will like it here."], ["Christina F.", "Does anyone know if they sell Spanish liquors like Vodka Caramelizado or Ron Miel?"], ["Mike N.", "Exceptional food and service.  The best olives and cold cuts I've tasted.  This place is half restaurant and half grocery store.  It doesn't look like much on the outside but it is very upscale once inside.  We started with SERRANO HAM, MANCHEGO CHEESE, CANTIMPALO SAUSAGE AND OLIVES PLATTER  Followed by a fantastic sandwich: Serrano ham, Manchego cheese and Spanish sausage in baguette"], ["Carla L.", "MMMMMMM  tapas,  there is nothing like them.  I so prefer to eat meals this way.  If you like something you order another (Please miss, may I have some more?) and if you didn't love something else, you just don't order any more.  Sweet deal.  Add some sangria to the mix and its a perfect mix for a solid meal. Once you have that, add the best date a girl can have?  A fun time, a good laugh and a great meal. The best part is going to the store next door, so many delicious imported ingredients from Spain.  I come often to pick up Nora's (a type of dried red peppers) for my paellas.  So much more delicious with them.. mmmm."], ["Gustavo A. L.", "Really 3 stars for restaurant part and the extra star added to the mini market next door- This is definitely a good place to grab a quick bite and some coffee, just temper your expectations and figure you will be met with decent service and good basic food. The tortilla espanola and the chorizo were pretty good - Some basic Tapas to round up the experience, such as fried sardines or pulpo al ajillo (Octopus in garlic) will always suit my fancy. I must confess that this place will yield 3 or four different experiences, depending on how full or busy it is. We've been on a quiet weekend night and it is a very enjoyable evening definitely worth taking the time to enjoy the food and the company. If it is busier, however, it slides down the scale quite a few notches. If you have some time in the afternoon to enjoy a good conversation with good friends, stop by and have some hot chocolate with churros, it is definitely a great experience in an authentic place. We wouldn't order the Paella here because my wife makes the best Paella, so it is not fair to compare, by the same token, I cannot render an opinion on it. Finally, before you leave spend some time and money in the mini market next door, we always find the right ingredients to entertain, and also for our home made Paella - In the grand scheme of things, we are far better off with Delicias de Espana in Miami than without them ! I am a fan !"], ["Henry S.", "The food, especially breakfast, is very good. It's a pretty authentic Spanish restaurant, non-pretentious,and reasonably priced. Hard to go wrong here."], ["Irene L.", "Delicias de Espana is like a slice of Spanish heaven!  I work in the Blue Lagoon area, where good lunch locales are quite sparse. More than a year working in the area, my colleague took us here for lunch, and I immediately asked why we hadn't gone there earlier??!I've had the plates of jamon serrano, manchengo cheese, chorizo, tortillas and many other delicious dishes -- all of which were topped off with a jar of sangria!This definitely hits the spot if you're looking for some tasty Spanish cuisine!"], ["Spencer A.", "Confession: 1. I do not know Spanish food. 2. I do not eat pork which appears in virtually 95% of the menu items, so my choices are limited. But I find this place to be increasingly less enjoyable with each visit.  Service is \"slow\" and the food can be very expensive. But it is always crowded, has a large selection of \"delicacies\" and assorted Spanish chatchkees. Not a Spencer a favorite, anymore."], ["Betty M.", "I've been coming here for years. The food is amazing. The Caldo Gallego & Fabada  Asturiana are out of this world. The soufflé delicias is what desert fantasies are made of.  Their customer service needs some help but the food is worth it!"], ["Maria A.", "Stopped by this place recently and had a quick bite.I was in the middle of so much food and wine the minute I walked inthat I stepped into the deli to escape temptation and not buy everything in the store. I had a mini chorizo and cheese and sandwich. The crema catalana was alright however I would accommodate one of their other catalog looking foods. The mini sandwich was a filling bite, perfect fo a later afternoon snack. This place reminded me of my grandmother. As it is half restaurant/half shop. Now add vampires and it's Delicias. There were even espadrilles. I almost bought a magazine cover from Hola magazine. This is a quick go to for daily and/or special event festivities."], ["Jessica E.", "Great quick Spanish food. Excellent service."], ["Jorge P.", "The food is great, but it ain't cheap! They have authentic Spanish tapas and plates, served in a spacious dining room. The quality of the food is great, but there are 2 drawbacks: lack of parking and price (although not really expensive, it just seems like you can spend $15 for lunch and still might leave hungry).I recommend the Tortilla de Papa and the Croquetas.There is also a bodega selling all types of Spainsh items, from Jamón Serrano to shoes."], ["Tough C.", "I have a love-hate relationship with this place. Parking is always a nightmare. The wait staff is hit or miss. Although, it is safe to say that is mostly \"miss\" than \"hit.\" Service could definitely improve here. Also the tables are crammed into this place, hard to have a private conversation here. It can get really loud.Now for the good parts about this place. The food is delicious. Their paella is amazing and so is everything else on their menu. Try it."], ["Grace P.", "We have been coming to Delicias for at least twelve years.  Lately, we have been disappointed consistently.  Their prices have gone up and the quality down.  This time it was one of their \"Turron\" and \"Nata\" cakes, it was obviously at least a few days old, hard and dry, we wont be visiting them again anytime soon, hopefully they will get back to what they used to be when they started."], ["Alexis Y.", "Delicias de Espana, once a small restaurant and market has expanded and will soon take up half the strip of the strip mall. I ordered the special of the day Thursday 10-6 which was a potato and manchego cream soup, 4 large albondigas with white rice and an apple/cream tart. The food was great, I was only able to finish about half of each portion and the best thing about was.....the price...$8! The Market is full of meats, cheeses, wines, knick knacks and the \"impulse\" items at the register are zip lock bags of olives instead of gum or mints."], ["Rosey A.", "The terrible service makes this potentionally wonderful Spanish experience a downer.  I've been here several times, for many years, only because of its great breakfast but today I had my last taste.  There were 4 tables being attended to and it took 15min for our waitress to even acknowledge us. We ask for American coffee and after another 10m she places the coffee down, doesn't bother to take our order or even offer us creamer.  After attempting to get her attention from her casual conversation w coworker, we asks her to take our order and creamer.  The food arrives and is excellent, but for some reason, this girl just doesn't seem to care for customer service at all...not one question was asked as far as our needs being met.  I literally had to stand up, interrupt her flirtatious conversation and ask for refill cup of coffee.  When we asked for our check, she held her hand up as if to say \"wait\" and at the point I had had it.  The food is GREAT but what should have been a 30m meal turned into an hour long chase for service...in an almost empty restaurant.Do NOT go hungry to this restaurant because it might be an 45-1hr before you get food on the table w much effort.  You're better of ordering their tortillas to go and heating it up at home w a cafe con leche.A former loyal customer."], ["Julie J.", "This place is great! They serve trational Spanish food. All the plates are delicious and full of the authentic flavors you would encounter in real Spanish plates. The tortillas are amazing and their shrimp al ajillo is amazing. The market is also very unique giving you a feel of being at a real Spanish market. In this market you can find all the unique food that you can only find over seas such as squids and sardines. If you enjoy Spanish food, then there is o doubt that you will love this restaurant and its market."], ["Jay B.", "Wow. his is a great place. The Staff is really helpful in helping you figure it out if you're not Spanish or if you just have no clue about Spanish  food. Luckly we we there with good friends from the area, who guided us along. I also loved the market, it was filled with fun and interesting items.We had so many things to sample, manchengo cheese plate, chorizo, tortillas and many other delicious dishes that were awesome.A must when in Miami."], ["A S.", "Bahhh. It's ok. It depends on what you get, it's a hit or miss. Usually a miss. I used to go to the one by the airport. Same thing. They split years ago but neither one has improved the food. Not worth a trip unless you need some stuff from the deli.... Deli is nice."], ["Andie D.", "Excellent place. I felt like I suddenly landed in somebody's home in Spain. I also loved the market, they sell things you would not find anywhere else, like squid ink and Tarta de Santiago. The prices are very affordable and the catering is awesome. I once did my birthday party with all appetizers from there. Outstanding."], ["Christie A.", "Eh, the last two times I have been to Delecias de Espana their quality of food just wasn't the same as it had been in the past.Ex.) Paella plates were smaller, the paella was not individually cooked, and we just got some cold in some spots almost flavorless rice with a few pieces of chicken and seafood on top.  MehI'll give them another try, but not too soon....I've found some other excellent Spanish places to satiate my tapas craving for now."], ["John E.", "Im back in Spain. I feel like slurring my S and Z'sss. This place is extraordinary. Their Serano ham, freshly sliced is like pork Sashimi. SO delicate and delicious. I go for breakfast and I feel I may be addicted to the Huevos Ala Flamenco. If you haven't tried it go NOW! Just watch your meter they love writing tickets for even a few seconds expired."], ["Tania G.", "my ancestors are Spanish, so it's only fair that i eat Spanish food. i've come here on more than one occasion with the fab, lourdes c. (my restaurant partner & co-founder of 'la cruz roja')this is a cozy spot (attached to a Spanish market). it's got that European feel to it, which is lovely. their tortillas are pretty good and so are their croquettas."], ["Myner G.", "I love Spanish food and I feel like this is one of the few good Spaniard spots in Miami. It's a great place to hit during lunch and grab some tapas or even a full dish depending on your hunger. The best thing about this place is that they have daily specials. EVERYTHING is good especially the seafood. There is one dish that I usually plan my visit around which is the \"Lacon\" which is a massive ham hock with amazing fries. The set back to this dish is they make a limited amount so you have to get there before 2pm or they're usually out of it. You can even call and reserve a couple if you're going with a group.The Staff is really helpful in helping you figure it out if you're not Spanish or if you just have no clue about Spaniard food. PS there's no beans and rice here...Recommendations:Baby eelsMarinated OctopusWhite AnchoviesAny Cheese plateJamon Serano bocadillo and queso manchego (sandwich with good Spanish ham and cheese)Any of the deserts"], ["natty s.", "too expensive....too noisy...."], ["Chris A.", "Pretty good...stay away from their soups...gives me the runs.The time before I found hair in some Spanish version of corned beef and cabbage I had....or at least I thought that's what it was...They're popular with their \"tortas\"y \"tapas\" (hey let's open up another tapas bar on South Beach shall we!!)If there was a heaven and hell for waiters, that certain dining room at the corner of Red and Bird  (with the cheesy-assed port of call mural) would be ground zero for purgatory.    Add to this the fact that my waiter's breath smelt  like ass.   Some other review mentioned having to flag down water boys/food runners to get the waiters attention..this is 100% true and what makes the situation more unbearable is that you can see them in the back playing grab-ass/ shining up the paella pot, ignoring your hand signals all the while.....so word of warning snap & whistle unless you like the taste of lukewarm soupPAN is a different story....i was about to rename the God.   We all rejoiced upon eating it.They had these cookies called \"alfajores\" with dulce de leche filing and coconut flavored....I swear if deli's had those alongside of black & whites and hamentash...there would be no WTF (or frig you) stare....Did not try paella yet..you'd figure that'd be the first thing a gringo would try..right?  They had some lunch-special which I found out in English was soup..so no!That being said....just bypass the dining area (or I guess make a beeline if you already have sat down) for the bakery and/or their sweets section in the market.    Expansive wine selections and you get to educate yourself on Spanish appelations..and all the romantic-sounding names therein..."], ["George R.", "Not sure why, but I've never been tempted to sit down for lunch or dinner at this restaurant. Having said that, every time that I drive by I have to stop and bring home some of their specialties. Must try: -The empanadas. No relationship to the usual ones, none. These are large flat pies sliced into four rectangular servings. Try the chorizo, or the bacalao or the tuna, or whichever. All are delicious and vaguely reminiscent of caponata. I prefer eating them at room temperature- Tortillas. Spanish style potato omelets meant to be eaten room temperature as well. Even the plain ones are good but the chorizo flavored is my favorite After you've tried these you'll never be able to settle for the kind which is sold in supermarkets again-Salpicon de mariscos. People who love seafood but find the ceviche too raw for their taste (not my case) will find the Spanish version \"just right\" and quite tasty. Inexpensive as well, considering for $13/lb it's strictly sea food and condiments without lettuce or other fillers.-Imported Jamon Serrano and Manchego cheese sandwich is simple and tasty, so are most over sandwiches. I'm not crazy about the sausage cooked in Champagne, but that's just me. If you're in the mood for gourmet picnic this is a great place to fill up your basket.warning:parking at lunch time is tricky."], ["Laura M.", "I liked their breakfast but lunch is pretty good too. Better yet, try Vinisimo in Coral Gables (3000 SW 22nd St) for lunch. The prices are inexpensive and the food & Sangria are great. The cold cuts with the warm bread was perfect and they serve the Sangria in a tall glass. Another place is Plaza de Espana (10067 SW 72nd St) delicious hearty Galician soup (it has plenty of meat) and the paella is pretty good too."]], "Toro Toro Restaurant": [], "Las Tapas de Rosa": [["Stephanie G.", "My boyfriend and I drove by Las Tapas de Rosa on our way to La Baguette and chose to give them a try instead since we were in the mood to re-live some of our culinary encounters with Spanish food while in Spain.My boyfriend ordered the bocadillo paco and we also ordered patatas bravas and croquetas de jamón y pollo.Ever since our most recent trip to Spain throughout which we had patatas bravas many, many times, we've become devout fans of the dish. There's just something about crispy french fries with savory and spicy sauce dripping all over them. Unfortunately, the patatas bravas at Las Tapas de Rosa were unlike any patatas bravas we'd ever had. These were mushy and undercooked, and the sauce was a gross vomit color that tasted nothing like what it's supposed to taste like. I don't cook and even I could have churned out a better version. These folks should be ashamed for even daring to call that dish patatas bravas. I couldn't believe how bad it was.Sadly, the croquetas weren't much better. They were tasteless. What's the point of eating fried stuff sans the yummy flavor that's supposed to accompany it. I would have preferred Publix croquetas over these any day.My boyfriend said his sandwich \"wasn't bad,\" but with prices like Rosa's and  with La Baguette right next door, \"not bad\" just isn't good enough.Although he did finish his sandwich, the \"patatas bravas\" and croquetas ended up in the garbage. While looking at the menu before we ordering,  we'd decided that the food was pricey but as always we were willing to pay for good food. However, the pricey food ended up in the garbage; therefore, it really isn't worth the price or the calories.I will not EVER even THINK about going back to this place, and wouldn't wish such a bad experience on anyone."], ["Z H.", "A gem. Family owned and food is great. Had the roasted pork with mushrooms and potatoes - was the Wednesday special. I would recommend it . Worthy of 4 stars, nothing exotic just great home made style food, which is sometimes what one is looking for.Wasn't too crowded and service was good. Probably a great casual lunch/dinner spot. The location isn't great and there isn't wifi."], ["Candela A.", "The food is Great. The service is always Awesome. And Gloria, Rosa, and staff are always cheerfull and happy to greet you!"], ["Monica L.", "Delicious real spanish flavored food. Friendly service. Cozy atmosphere. Fair prices. Definetly coming back!"], ["Christina C.", "I've been wanting to try out this restaurant for quite some time, but had never gotten the chance. Thankfully, yesterday, I was in search for a great lunch time meal when I stumbled across Las Tapas de Roas. There were a few other guests visitng, but there was no wait and the service was very quick. I ordered a Gazpacho soup to start and then some scrumptious Bacalao (cod fish) croquettes. Then, I decided to get a little bocado de jamon serrano and mozarella. I think I probably ordered too much, but regardless I was able to take the rest home. It was amazing! Wil definitely be recommending this restaurant to everyone I know and going back as soon as possible."], ["Trish M.", "BRAVO for Las Tapas de Rosa!!  So far the best tasting tapas I have had in Miami!We were here on a Sunday afternoon. The service was great, they welcomed us with a smile and seated us quickly at the last available table. Our generously-sized pitcher of EXCELLENT SANGRIA came out right away along with some very good bread. The server (who spoke both English and Spanish) was friendly and helpful as we were ordering.We had the Spanish omelet which was cooked and seasoned perfectly. The shrimp with garlic came out sizzling and was so good you may end up in a fork fight for the last piece if you are sharing.The fried chick peas with chorizo and ham was so flavorful, and it was served with plenty of sauce so there was enough left on your plate to mop up with your bread if you are inclined to do so.  Flan for dessert was yummy.Everyone around us was enjoying their food.  The atmosphere is cozy and quaint, they have a few shelves of Spanish food items for sale.  It's located on 8th St in Little Havana.  We had no problem parking on the street a block away.  Can't wait to return and try the Paella!"], ["Markus W.", "The place is friendly and welcoming. The taste of the food is good to very good. The problem for us was that at the time we were there everything was heated up in a microwave oven, which impacted the taste negatively. Potatoes were so-so overall, the chickpeas were good, the mushrooms outstanding. Everything however was heated up in a microwave, we heard the bing and about 30 seconds later our food came. It's a problem that could be fixed easily enough. Portions are generous, staff is friendly. It's time to retire the microwave though."], ["Armando H.", "By far one of the BEST tapas restaurants in Miami! My GF and I went for Valentines dinner and it was delicious! The service was outstanding. Our reservation was for 8 PM and our table was ready even though the place was full and people were waiting outside. We ordered the Sangria, Boquerones en vinagre | Anchovies in vinegar, Entremeses (plato de jamón serrano, chorizo, queso manchego y salchichón)  |  Plate of cured ham, spanish sausage, manchego cheese & dried salami, Pulpo a la Gallega  |  Octopus w/ hot paprika & olive oil, Sepia a la plancha  |  Grilled \"sepia\" (large squid) & garlic, and the Patatas alioli | Boiled potatoes served in a garlic sauce frío o caliente (hot). It was all OUTSTANDING! The bread was also fantastic! We will definitely become regulars."], ["Mauricio V.", "This intimate family owned restaurant in calle ocho has some of the best Spanish food in town. There's a wide variety of options from the cold and hot tapas menu plus some amazing entrees. My wife is a huge fan of Saturday's Cocido a la Madrileña. The Paella, Lamb Stew, and Conejo en Salsa are some of my personal favorites. Fresh and unpretentious food is whats makes of this place one of my top 10 in town.After trying almost every single item on the menu i can point out some favorites but whatever you order you will be more than satisfied.Some other recommendations are:  \"Pulp a la Gallega, Navajas, Croquetas de Cocido, Cazuela de Mariscos, Lamb Chops and Tarta de Orujo for dessert\"The services is always amazing. They truly make you feel as part of the family. Don't be shy to ask for recommendations and the daily specials.A Must in Miami...!"], ["Justin F.", "Grab - Calamres a La Roma, Pimientos de piquillo rellons de atun and one of the kcik ass sandwich's you honestly can't go wrong.  This is the type of place you tell a friend who needs to tell a friend.  Its pretty good right? You're smiling?   That Quijote is where it's.  NOW SPREAD THE WORD!"], ["Cristina P.", "At first look, you would think this place was a dump.  It's located in an iffy section of Calle 8, near the highway.I've been here twice since a friend recommended it, and I've enjoyed it both times.  The service is good and the food is delicious.  All authentic flavors and the market is excellent.Definitely a great place to go for lunch from the downtown area."], ["Mike F.", "How this place got good reviews is beyond me. DING that's the noise of the microwave your food is done! Seriously they microwave everything 5 feet away from where you are sitting.. Left over reheated food does not work for me. I ordered a pork tenderloin ENTREE and it was smaller portion than the tapas.. The bland boring looking Chicken was again reheated and could barely be cut through absolutely terrible experience we left here and went somewhere else avoid at all costs. Oh yeah speaking of costs expensive as shit."], ["Jordan N.", "I've only been here once, but from what I've had - tortilla and sausage, as well as sangria, they were all good. I'll have to come back to update my review with more details.There's a small Spanish market on site, and it is a nice, well-kept tapas restaurant managed by Rosa Rodriguez, a woman from Madrid.They have ensalada rusa, seafood-mix plate, croquetas, fried chick peas, peppers, sandwiches, soups and more of the traditional Madrileno-styled tapas."], ["Lazaro M.", "Good service only thing u have to sit down to get order quick"], ["Alessandra A.", "Where should I start? I saw the dishwasher more than I saw our server. My dad and brother ordered a few tapas and when I went to tell the server what I wanted she said we ordered enough food and didn't take my order.. I sat staring at the microwave throughout my entire meal so I saw every single mistake as my brother sat right where they open the kitchen door as the dishwashers and cooks would come out to hand the servers the food. When my family finished eating our server came and said \"you see it was too much food\"... All of us still hungry. After it took 10 minutes to get the check, it had things that we didn't even order on it! Ridiculous place!"], ["Juan Jose D.", "A Spanish friend invite me here, it was great that time, the place serves food from Castilla (capital of Spain) traditional comfort food, owned by Rosa, she is actually all over the place, at the kitchen, etc, lovely lady.  The last time I went here I took my father who loves Spanish food, and unfortunately the service was not good, and the food was average, it seemed there was a lack of staff that day.  I truly recommend it, but still Rincon Asturiano is #1 for me in Miami."], ["A S.", "I could go back here and try other things.Service was very very slow. A few times we wanted the waitress to order more stuff or bread or somehting,and she was too busy with other tables, I guess. So not happy with service but food was above average. Considering all the Spanish restaurants in Miami, this one is good. It just can't be compared to Xixon, but it would be my next option. Xixon is the best.This is a little cheaper and they have a decent variety of tapas, sandwiches, main courses... I guess the food is hit or miss, depending on what you get.The wine selection is good and affordable. I liked that. We were literally kicked out. They close at 10PM and they want you gone fast, obviously. We tried a Torta de Santiago which was not very good (since it's imported frozen) and right after that, they dropped the check and asked us to leave because they had to clean up. Oh well, I guess I could try this place at a different time. Coffee not good, by the way.Not happy with a few things but I will give the food another try. And I will review it again when I do."], ["Alex C M.", "Wonderful spanish food and great service. Its a mom and pop restaurant except this one is a mom and daughter buss. Homemade and fresh..... I had the lenguado (fish ) grilled with asparagus and steamed potatoes! Excellent! Do not hesitate , its a must."], ["John T.", "Had a nice lunch here.  My sandwich was pretty good, and the menu looks great."], ["Olga A.", "This is a small Spanish restaurant on 8 Street, blink and you might miss this golden treasure. The food is to die for. If time allowed I would eat here everyday. They also have a small Spanish market on site so you may take some wonderful yummy treasures home. You must have the Tuna Piquillo which I order everytime I go. It is red peppers stuffed with tuna, a must have. Rosa, the owner and chef is from Spain so the food is truly authentic. Gloria, her daughter, keeps the place operating and sets the ambiance to make you feel at home. They have great daily specials which are very affordable, a fantastic wine selection, and I would be remiss if I didn't mention the very delicious Bonbon. This is an espresso coffee with condensed milk, YUMMY! Very friendly place and great wait staff. I highly recommend."]], "El Rincon Asturiano": [["Gabriel T.", "I was passing by the area close to lunch time and saw great reviews about this place. So I went in and was surprised for good. A Spanish cuisine in the heart of Little Havana with excellent, professional and friendly servers, plus good food and several Spanish wines moderate priced!It was really unexpected! I'll be back for more soon..."], ["Melissa M.", "Went to lunch with my grandfather and dad the other day.  Service isn't as good as I'd like it to be, but the food is worth the wait. That day, we shared various tapas - let's start with the croquetas.  Just get them - both the ham and cod croquetas.  They come with a garlic aioli that's thick and creamy.  They were served piping hot and crispy.  Delicious.We also got the piquillo peppers stuffed with shrimp.  I was craving the piquillo peppers stuffed with cod that I had in Spain years ago, and these nearly satisfied that craving.  They came in a creamy sauce that's perfect for mopping up using the crusty bread that's amazing. We also shared the pulpo a la gallega, which was great. It's so perfect in it's traditional ways.  My grandfather ordered the lunch special - he chose the eggplant to start and the 1/2 fabada.  I love eggplant, and it was served with cheese and tomatoes.  The eggplant was nice and crispy, but nothing out of this world.  The fabada was great - it's a perfect winter stew, real stick-to-your-ribs kind of stuff.  Overall, I would definitely recommend this place!  It's a perfect little gem in Little Havana."], ["Alex L.", "We were 4 adults with no reservations on a Sunday afternoon. They sat us down right away right next to a jewelry display case, weird, lol. The service was really good. They brought our water and bread right away and took our drink order as soon as we sat down. The bread was soooo yummy. So we ordered the almejas, croquetas, bacalao, mariscada, and pollo al limon, Everything was really really good and tasty. My only complaint is that the croquetas were tiny. Miniscule. Literally one inch long. It would be nice if they would be a tad larger. But still, they were tasty.We had the crema de catalana for dessert. Very good as well. They have their own parking lot you just have to pay the city for it. Total for all was $123. No drinks. We live pretty far away but if we're ever in the neighborhood again, I think we'll go back. Go check it out."], ["Maria P.", "We had been There so many times but last one was very very good. My husband had mariscos soup and bacalao a la vizcayna, I had busted de riñonada with vegetables and small fries potatoes the meat was delicious and tenter so big I took half home , good wine and for dessert Turin ice cream delicious . I recommended"], ["Maria B.", "The food was delicious,  we had huevos rotos and tortilla española, and the cheese platter. Wine selection  is limited but decent. Now the service  , it left a lot to be  desired, we had  ordered  another tapa it never  came,  the lady who  opened the wine didn't  let us see it beforehand,  we ordereda 2010 it was 2011,she completely  abandoned the table and when she was ready to close the tab she let us know,  that she was no longer our  waitress. I wanted to get the octopus but there was no one around for me to do so."], ["Guillermina W.", "The food was ok but they overcharged us for a dish that we ordered to share. / La comida está ok, el arroz con mariscos que ordenamos y nos sirvieron como paella (y no es) decía que era para dos y tenía un precio. Pues lo pedimos para compartir (1 para dos) y nos cobraron x dos. Ni siquiera era tan abundante y el arroz no estaba cocinado de una manera muy auténtica. La atención ok pero igual no vamos a volver."], ["Gabriel R.", "Excellent Spanish food and great service!Looks better once you are inside than from the outside and it's pretty small but cozy.100% recommended"], ["Alessandra C.", "Great service... Would have never thought of coming here had my mom not brought me. Excellent Gambas Al Ajillo, Patatas, aleioli was amazing..everything was excellent... Highly recommended. Great for any family or couples date. We will be back! Olè!"], ["Christina Z.", "Great restaurant! The food here is REALLY GOOD!! I had Spanish Fabada and Lemon Sole and loved every bite of it. They service is friendly and has a relaxed atmosphere. So happy to have found this gem."], ["Romi C.", "In the typical bon vibrant spirit we've grown accustomed to, we don't just pick on some tasty bits over some vino. We eat and drink till were practically wheeled out on some sort of wheeled device and told to never come back...ok not yet, but a girl can dream.  This hidden haven for Spanish cuisine must have known we were coming because the tapas were so big we couldn't order more. Don't get me wrong, I'm not complaining over getting a substantial meal... I'd love to try more!If you're into cuttlefish you're in for a treat. Squid's smarter and tastier cousin came grilled and lathered in garlic. I couldn't stop. He was probably flown in the same day and it wasn't a flimsy little portion, it was the gift that kept on giving. Incredibly succulent texture with bold garlicky goodness. This is why my guilt over eating one of the earth's most incredible creatures faded into sheer delight.  Sepia al ajillo is the way to go.The Callos a la asturiana was one of the best versions of Spanish tripe I've had. The paprika was spot on, the texture was perfect collageny goodness. I felt the telomeres in my clock genes rewind and make me look even younger. I now look 12. Eat your tripe and organ meat kids. You'll stay young.The pitcher of sangria didn't hurt either. By the time we had to go I was carried and put in my car seat like a sleepy toddler.My only reason for docking a star were the prices on the wine list. I should have left a kidney or some other organ as collateral for next time. Great little spot for delicious tapas."], ["Suzanne P.", "A piece of Spain in Little Havana.Don't judge this restaurant by it's location.  Once you're inside, you are instantly teleported to another place.  It is nice and dark and you can hear Castellano being spoken in the background  There is a cozy little spot (our favorite) nestled in between all the wines.  The table sits 4, but ideally just for 2.Don't miss out on their tablas, Lacon (Saturdays only) or Fideua with Monkfish!  You also have your basic Spanish staples of ensalada Rusa, Paella, etc."], ["Mari P.", "Simply delicious, not fancy but the service is awesome ask for Rodolfo and Toñi...so sweet and helpful when you can't decide which of the delicacies here you should eat. And the wine we had $$... but omg what it did to my palette.I can't speak of it highly enough. We had a wonderful dinner with a mix of amazing flavors and portions are generous as they should be in all restaurants. Ignore the neighborhood it's in, parking is right next door and they have a security for your cars. We love food from Spain and this became one of our favorites now."], ["Fernando D.", "The best you'll get outside of Spain (and even some parts of Spain at that!).  My favorite restaurant in Miami."], ["Karina G.", "Haven't been here for a few months and still think this is the best pulpo a la gallega. Service is great as well.  I had tortilla, pulpo and pote asturiano. Everything was outstanding!  Love this Spanish restaurant."], ["Mario N.", "Wonderful food and service. Authentic Spanish dishes from the region of Asturias mix with typical but good Spanish fare. The croquetas were delicious, the wine list surprisingly affordable with good choices of excellent quality. In the Miami Spanish food world, where there are myriads of so-called Spanish restaurants that serve Cuban versions of to the classics, Rincón Asturiano stands out."], ["Emily H.", "This is our second time there. This is great authentic Spanish dishes. Almejas con Jamon Serrano is a must have. The arroz negro is also delicious."], ["Jessica W.", "I have been here multiple times and have yet to be disappointed.  The food is consistently good quality and the service is friendly and attentive.  Some of my favorite tapas include the Pulpo a la Gallega y los Pimientos de Piquillo; the ingredients are fresh and the portion size is very generous for tapas.  They also serve an excellent arroz negro-order one for the table and add some of their delicious ali-oli and warm bread and you will not be disappointed! This place is also great to just sit outside on their porch and enjoy an ice cold Estrella while munching on some tapas."], ["Javier R.", "This is a hidden gem. Food and service is consistently good. My favorite are the paella, garlic shrimp and Thursday's the special is ox tail which is the best in Miami. Highly recommend this place!!"], ["Karen M.", "Que delicia. The wine ,the food, the service ,the music and the ambience. We ordered a delicious grilled pulpo con papas. My fish was perfect. Done my way. And the dessert was helado De turron. Perfect ending."], ["Emilio S.", "Went here while vacationing in Miami Beach with my parents and wife - they gushed about this place and their paella.  They could not have been more right!  Cozy small restaurant, attentive service, and a Paella (we had the classical seafood mix) to die for!!  Quite possible the best example of that dish I have ever tasted.   Also ordered their Asturian soup and ham/cod fish croquettes and both were just simply delicious.  Left with a full belly and dreams of coming back to this place again.  Highly recommended."], ["Jorge G.", "Heard great things but finally came in for dinner with family. Superb tapas. Best I have had In miami and reasonable. Will definitely be back soon."], ["Virginia M.", "This review is way overdue because I went a couple months ago but the experience sticks with me till this day. My boyfriend took me here to watch the Spain soccer game for the European equivalent to the World Cup..I apologize, soccer is so not my sport but I did grow an appreciation for it because since Spain won, the restaurant was rowdy with happiness. The food was delicious! I recommend the chorizo as an appetizer- you will not regret it, I promise. The service was great and whenever there is a Spain game, I suggest making reservations because the Spanish community definitely comes to this place to support their team! The parking could be a bit of a hassle so be prepared for that. I can't wait to go again..I wish it was closer to my area!"], ["Caro F.", "Having been here in a while but was always excellent. Great garlic shrimp, croquetas, good wines and lacon on Saturdays worth the trip. Time to go again."], ["Dolores Orqui G.", "We had gambas ala ajio which were very tasteful and the shrimps were a good size. Had the Merluza fish with baby clams which was moist and tender but not tasty it was served with patatas and vegies. Also tasted the Caldo Asturiano was a full of chorizo and ham but to fatty."], ["Alex R.", "We went just returning from Spain, and the Seafood Paella we had here was even better than the one we had in Barcelona the week before, and that has just been great, but this one won.We didn't order anything, so no opinion on other dishes, other than everything looked very appealing."], ["Naty K.", "Overcrowded, to the point that you're bumping into others who are eating, while you wait for your table.  The parking lot is small too, but honestly, I was not impressed.  I saw the reviews and expected something amazing, but Xixon still cannot be beat.  The food here is not bad, but it isn't to die for either.  I have definitely had better.  The salpicon de mariscos, which is a seafood dish, only contained one shrimp, which is a joke.  They are very deceitful also, by sticking clams and mussels in their shell, so as to make it appear as if you're getting a big appetizer. We got the wrong order and the waiter's response was to shrug, and nothing was done to satisfy us, nor was the correct order ever brought out.  My parents are diabetic, so getting stuck with a potato dish was something very upsetting to them, and to me.  At least apologize.  We had to end up paying for the incorrect dish too, as they would not produce the server who brought the wrong order out to admit he made a mistake.  The place is terribly disorganized; the servers are running around like headless chickens, and in the course of your meal, you will have been served by 6 different people, instead of having just one dedicated server.  It's confusing when you need something, as you do not know whom to ask.  They also brought out the wrong beer, and quoted us a different price on the wine glass and when we complained once we got the check, again, they shrugged.  I drove my parents all the way from Palmetto Bay, and I have to say, it was disappointing, after such a long drive, to be met with such cold people.  Oh! They also add an 18% gratuity on your check.  I guess this explains why they have such nasty attitudes, why bother being nice to you when they will be sucking out an 18% tip from you? Never coming back again.  The food is nothing special and the service leaves a lot to be desired."], ["Karla S.", "I've had the pleasure of visiting this restaurant a couple of times in the past 6 months. This place is fantastic. They have a great, tender and flavorful 'Pulpo a la Gallega' and/or 'a la vinagreta'. I normally don't like bacalao-- but their corquetas de bacalao are to die for. They are the best croquetas in Miami. The ham and chicken ones are phenomenal too. Their cheese and cold cut platters are a great way to start your meal.I've also been able to check our their catering services. A friend of mine ordered sandwiches and hors d'oeuvres for a gathering and EVERYTHING was sensational and very well made. It's cozy, the staff is friendly, decent wines, good sangria and excellent food. Highly recommend it."], ["Juan M.", "Great little Spanish spot in the heart of Little Havana near Marlins Park!  Great lentejas on Mondays and Fabada on Wednesdays.  Always solid meal with great daily specials."], ["Natalie S.", "First I must clarify, that I went to this restaurant with very high expectations, based on all the 5-star reviews and personal recommendations I have received. But my expectations were not completely met, which is why I gave a 3-star rating.Based on my dining experience, the tapas are far better than the actual dinner options. The croquetas, pulpo, and chorizo were delicious, but honestly not out of this world amazing. Our table of seven ordered varied main dishes such as the arroz negro paella, the bacalao, the fish \"a mi manera\" dish, among others and they were al sub-par. The torrejas for dessert were served cold. However, considering the amount of food we ordered, along with the bottle of wine and eight Mahou beers, I was impressed by the final bill. It was not as pricey as I thought it was going to be. All in all, I will return, just to see if the food is better the 2nd time around. In this case my first impression wasn't overwhelmingly negative, but it wasn't the mind-blowing experience I expected."], ["Jordan N.", "Great tapas place (but then again there's a lot of great tapas in Miami. There's a small market in the back. The service was good. The place gets packed later in the evening, so come in the earlier part of the evening to pick one of the better tables!PROS:+ reasonable prices+ bacalao with chickpeas are tasty+ grilled chorizo in cider is delicious and great with the bread they serve+ mixed seafood was light and okay.+ the veal in Spanish cheese is very authentic, but may be an acquired taste because of the cheese. I enjoyed it though.CONS:- torrejas - it was cold and served with a bunch of whipped cream and a dollup of ice cream - seemed very Cuban. Nothing gourmet or special about this dish as this one is more of a junk food. Try something else for dessertI'll definitely return!"], ["Matilde A.", "Wowww...ALWAYS the best. Got to try their lunch menu."], ["Ana Cristina P.", "If you're searching for authentic Spanish cuisine, El Rincon Asturiano is one of your best bets in the area.A friend introduced me to this place and now I'm itching for the day when I get to go back. The octopus and the croquetas were my favorite tapas.  So fresh it tastes like it was made by the Spanish mother I never had.  I wish I could remember the name of the bottle of wine we downed in one fell swoop, but I guess it was so good that I can't remember. The other thing I loved about this place was the service.  The friend I went with is a regular there and knows everyone inside the small establishment.  The owner promptly seated us and treated us like we were family.  I really can't find a thing to complain about when it comes to this restaurant."], ["Charlene O.", "I have referred El Rincon Asturiano to SOOOO many people because I think it is the best Spanish restaurant in Miami. There are many other great Spanish restuarants but this one is cozy and you feel that you are in tucked inside an intimate restaurant in Madrid when you are there.Anyway, the service is good, there's off-street parking and an excellent wine selection.I recommend the Tortilla Espanol, los Pimentas Padrons (small,green delicious peppers that are very seasonal), the chorizo, the croquettas de bacalao and everything on the menu pretty much.Excellent place!"], ["Remy L.", "I went there for dinner this week with two guests. I called in advance to make a reservation. I was a little bit annoyed by the fact that the host did not understand me at all when I addressed to him in English. He explained to me in Spanish that reservations were not necessary. We understood each other after a couple of tries. He was very much trying to understand my poor Spanish. When we arrived at 6.30pm, he recognized me immediately, probably my accent. I found that very nice and it showed a lot of attention on their end.  The server did some great recommendations. La seleccion de pepe was fantastic as a shared appetizer. Ham and cheese were just delicious. We ordered the lenguado and the mariscada. They were amazing. The waiter recommended that we add the shrimps with the lenguado. Perfect recommendation.The service was very good, although it was sometimes hard to catch a waiter. The food was great. The sole fish was particularly fresh and tender. I'll definitely recommend the place to my friends."], ["Alysa R.", "Best Spanish food in Miami. In little Havana but the inside is very nice and the food/experience is authentic!"], ["Miriam W.", "I feel so \"inspired 2 yelp\" about El Rincon Asturiano.  I loved every aspect of the meal set before me this evening, and I literally \"had to be delivered from\" their amazing bread which is imported from Spain by way of California (I know this because the bread was so good, that my inquiring mind had to know).I ordered my usual sparkling water which pairs wonderfully with delicious food and at El Rincon Asturiano, the deliciousness began with the chorizo appetizer cooked in Spanish cider. The sauce that the marriage of the pork fat drippings and cider made were a perfect match to be sopped up with that delicious bread.  On to the entree, I ordered the sole dish which included fried potatoes and mixed vegetables of asparagus, tomatoes, and more that were stewed to perfection.  I am at a loss for words to describe just how good it was. My boyfriend ordered the pork loin which had a nice addition of paprika and came with a side of fried potatoes and stewed vegetables.Alas, dessert. I couldn't resist. When I saw almond cake on the menu, the curiosity ensued and I had to have it.  For me, almond extract in anything makes me sing, and in this almond cake drizzled with chocolate, \"I sang a good song\". I will definitely be back for more and can't wait to sing the praises of El Rincon Asturiano to my beloveds and of course all of Yelp! I can't keep such a good thing to myself.  Visit this quaint, intimate restaurant for an excellent Spanish meal, and to discover why they were named the Miami New Times 2010 Best Spanish Restaurant (they couldn't be more right)."], ["Carlos G.", "Good place. Good and nice service. The food is good , not incredible but really good. I was there several times, is better for lunch."], ["William D.", "a customer took me here after a meeting for lunch, awesome old school spanish food, never could of found it on my own, another timeless place of the old school, no pretense, good food and service"], ["Cristina G.", "This place was a huge let down. I went with my family for a nice family dinner and more than one thing went wrong. Location- its not located in an area with a lot of life around it at night. Its pretty desolate after a certain time. It has pretty good parking, since you can also park in a lot across the way. They have a security guard, but when I went the guy was on his phone the whole time we were at dinner. Whats the point?Inside its really small and cramped. I dont like sitting so close to other people like that or in tight corners.Service- The service was pretty bad. The girl came and wrote down our whole order. She went one by one and wrote each one down. She did it right next to me on the table, so yes, I know she did. Our order was screwed up and not everything we ordered was brought out. We eventually canceled everything that wasn't borught out with the rest of our food. However, when the bill came, everything was still there and then some. We told our waitress about  the error and she proceeded to scratch off the mistakes off the receipt and redid it. Once it came back, yet again, it still had errors on it. This time she called the manager/owner. She literally made us all go,one by one, and tell her exactly what we ate and drank. She wrote it ALL down..I saw her. She came back a few minutes later with a pretty accurate receipt but said she didnt believe the # of cidras we told her. WTF? Are we really going to trick you on 2-3 cidras that are worth $3 each on such a hefty bill? We bitched and whined and she finally took them off, but not before we each had to retell her the amount of drinks we each had. We took 20-30 minutes just to get the check in order. Food- The food was good, I'll give them that much, but I know other great tapa places with good food and service.Would I go back?  Probably not. Would I recommend it to friends? Only after telling them of our experience and warning them that the food was good, but that not good enough to deal with the above negatives."], ["Naty B.", "OMG I love this place !  Location is not great but parking is easy and safe (they have a security person outside).The restaurant is not fancy and the service is not the best but the food is AMAZING !  I always start with some cheese and meat or/and  gambas al ajillo  (shrimp with  garlic) it  comes with fresh baguette bread and the gambas are so delicious and juicy.  I just got hungry :( It is family operated business and I always feel like at home, they are really nice people. Service is not that fast but overall is ok.If you go on weekends make sure to get there early because the restaurant is very small and you will have to wait a  long time for a table but believe me the long wait is worthed... food is great!"], ["A A.", "The food is good... We did find a discrepancy: one waiter explained that some of their Paellas (like Lobster, Rabbit) are made fresh upon ordering and other Paellas (like Seafood) are made in big quantities and just served hot. Later, since we were confused as to which one was fresh or not, we asked another waiter and he replied that all of their Paellas are freshly made.We ended up ordering the one that was already prepared and we liked it, yet the situation did make us second guess all the information given by the staff."], ["Andrea W.", "I had been recommended this place over and over again, and finally remembered the name of it one night that we were on the hunt for a new restaurant to try. We were greeted with smiles and heavy spaniard accents which made me instantly fall in love with the place without even taking my seat. The service was spot on. Although I've never been to Spain I did feel like I was there. The paella was the best i've had. The albariño that was recommended to us was so crisp and very easily found us ordering a second bottle."], ["Juan Jose D.", "Definitely the best Spanish restaurant I have been outside of Spain and of course the best in Miami.  This little gem offers a very authentic approach to the Spanish Cuisine with a very friendly staff, a most try if you love this food.  Recommend the clams in white wine and the Pata Negra Jabugo, and the chorizo en sidra, also let them suggest wine the have a fairly good selection."], ["Charlie B.", "what a great place!! never expected it in such a neighborhood. Cute quaint and cozy and the food...oh so good. Had tapas: octopus, garlic shrimp, chorizo all which were perfect. For dinner had the red snapper which was amazing. Also all for a great price. Next time I think i will just have many different tapas and lots of Spanish red wine..ole!!"], ["Miryam H.", "Authentic, classic, and dynamic...The baguette is warm and fresh, the olive oil is dark, and the sangria is tasty. They have a nice selection of tapas. Their croquettas de bacalao are phenomenal, let me repeat p h e n o m e n a l. I have eaten these croquettes in Madrid, Toledo, and Segovia, and theirs naturally, as the staff hails from Toledo, Malaga, Galicia, and Asturias, are definitely equal. Another good sign is that many of the patrons are Cubans whose parents or grandparents were Spaniards, and those patrons aren't easy to please. The tortilla espanola, (we call omelets tortillas, there is no bread in our tortillas) is another MUST-try. I have ordered from the sandwich selection. Try el Mallorquin- Crusty Spanish Baguette with \"Sobrasada\"- a raw sausage and Cabrales cheese or el Catalan-Crusty \"pantomaka\" with Serrano ham or el Asturiano- Crusty Spanish baguette Cabrales cheese, chorizo and olive oil...& you will not be disappointed. Their paellas are exquisite & definitely worth the wait. For dessert, their Torta de Santiago de Compostela, which is an almond-like cake, a bit dry, but very flavorful, is worth a try. The torejas are divine as well. There is a tiny store in the back with basic items, definitely worth a look. The prices are terribly reasonable, and I would say cheap, for tapas. The staff is kind, witty, and well-mannered.The parking situation is just fine, there is a free lot in the back, which you can access by turning into one-way-streets."], ["mireya v.", "My son took us to lunch today, and it was a great lunch.We ordered an appetizer of dif. Types of cheeses and the perfect bread I was a happy person.I had the executive lunch, my son told me to have the fish! He was rightMy husband had the seafood paella, fantastic.I'm glad he finally convinced me to go, since we live in west Miami,a 45 minute drive.Service was perfect.My son won't have to beg me anymore to meet him for lunch."], ["JOHN H.", "Worst Service ever.... FOOD was crap! service crap! never again."], ["JESSICA N.", "I truly love this place.  I have been coming here for a while and recommend it to everyone.  Everything is pretty wonderful beginning with the warm crusty bread with the wonderful olive oil from of course Spain.  The tapas here are really delicious and not  too expensive, the little white sauce they serve with the croquetas and tortilla is delicious, and the calamari are so fresh you just need your fork to  cut them. Oh and the wine is to die for and not expensive at all, they even sell bottles to take home.  The actual food I had the paella and was not too impressed, don't know about the other dishes. It's also really small so you might have to wait for a table sometimes, but also really intimate and romantic."], ["Pierre K.", "Finding a good Spanish/Tapas restaurant is not easy. Most of the time you get unreasonably expensive restaurants that give you less than average tapas. You order 5 of them and you end up with a $50 tab. Well this place is the complete opposite and you'd never expect such a wonderful experience in that part of the city. The restaurant sits in a horribly orange lit strip mall but once you get inside you get hit with a huge \"Viva Espana\" reality check.The food is amazing, from the hams (Jabugo, Serrano) to the wide selection of tapas to the excellent paella (made to order), you are in for a great experience. I will not go through the list of what we ate but you must try the Lagostinas a la plancha. Prices are more than reasonable and you will be shocked by the cost of a bottle of the house wines ($18) which are very good. The only complaint, could be that the service is very slow but that is clearly due to the fact that it is jam packed every time I go there. All in all if you have been to Spain and know the food and culture you will love this place."], ["G P.", "Went Friday night 9pm Oct 23. 8 in my party.....This place is so authentically Spanish they even give you that famous Spanish attitude, and I mean that in a GOOD WAY. It is a small place about 10 tables. The food was GREAT!! We had Gambas al Ajillo, (which were perfect the garlic not overpowering) Croquetas de pollo, jamón Serrano and de bacalao, Ibericos de Bellota Especial, Arroz Negro (Squid ink cooked rice with cuttlefish served with traditional alioli) Paella de Mariscos. It closes at 10 but we didn't leave until 1130pm but there was no pressure to leave. They also have plenty of parking with security. These small unassuming restaurants are always the best. Will absolutely go again and again."], ["Marc M.", "All my friends say it was so great and so authentic I went there last week for lunch. Awful.(1) The seating was awful. In a little corner next to the bar between the entrance to the bathroom and some storage, so the waiters kept interrupting us to get bottles and stuff(2) Food was mediocre; the ham and cheese board was four slices of cheese and some ham thrown in there, no art, same you can buy at Costco; the gambas al ajillo were OK. Four gambas, tasty, but, again, par for the course(3) The service was OK but it would vary all over the place; sometimes they would remember to fill our water, sometimes not, sometimes my lunch companion would have to literally shout to get a waiter's attentionNot going back"], ["Ana M.", "We went here not too long ago and it was really good. you will enjoy it. the service was very good."], ["frank m.", "Being from Spain this place is the best in Miami.  Pulpo is great they have specials everyday."], ["Michael M.", "The place is kind of small but has a very homey feeling that is pretty authentic of what you would find in a tapas bar in Spain. Decor is wonderful and nostalgic. An experience at this restaurant is pretty close to what you would experience in Spain and that is a major plus!We were seated by a woman who seemed to either be the owner or one of the owners. She was very respectful, attentive, and just overall made you feel at home.Since we went in mid-day and there were three of us, we decided to order some tapas instead of any main courses. First we started with a wooden tablet with Spanish cheese, serrano ham, and chorizo - all of which was drizzled with some great tasting olive oil. Great quality stuff. We then ordered some fried calamari which was pretty good but nothing special or out of the ordinary from the average good quality fried calamari you would find in a good restaurant. After the calamari we had some codfish croquettes which was some of the best codfish croquettes I have had in this city. Great flavor and not too salty. We finished with some Galician-style octopus. This was the best plate we had had that day. The octopus was cooked in true Galician style with potatoes, paprika, and some olive oil. Had a nice little kick and I am not a big fan of spicy food but I found this kick very tolerable. Definitely a must-order when you dine there!For drinks we ordered the Sangria which was one of the best sangrias I have ever had. It was absolutely delicious! Perfect balance of sweetness, fruitiness, wine and alcohol. I didn't get a chance to get a good look at the wine list, but unless there is some high quality wine on the menu (which I am sure there is) I would say definitely go for the Sangria. One of the best Spanish restaurants in town."]], "Casa Juancho Spanish Restaurant": [["Jose G.", "Absolutely terrible service. All of the waiters are over 50 and stopped giving a shit yeaaaars ago. I don't understand charging $50 for mediocre Paella and terrible service. Sure, the live music and atmosphere are one of a kind but when a waiter rolls his eyes at you and utters a total of three sentences and it's not McDonald's, there's a problem."], ["Jacqueline L.", "The food is good and the ambiance is nice.  The only issue is that on the weekends, it gets very loud because of the live music."], ["James M.", "Not at all what we were expecting. I guess since we have eaten all over Spain we were hoping for something along that line. The paella was typical \"cuban\" paella nothing you would get in Spain.  How can a true Spanish restaurant mess up fish?  The tapas were ok but overpriced. The wine was good but $10.00  for a cup of house brand is a little steep. The wait staff seemed to have trouble keeping up with the crowd. They seemed tired and bothered by a large group.  In other words  this is just another typical Spanish restaurant run by Cubans who have no idea what real Spanish cuisine is. Don't waste you time and money unless you like this type of place. Group of 8 and out ticket came to 495.00 before tip and we didn't waste money on the wine.  Look around I have had better for a fraction of the price."], ["Emma F.", "Food is made with true love and dedication here . I am a picky eater and I remember my meat being just perfect . Totally recommend this place ."], ["Rosi A.", "Ive been coming here for 25 years and as always excellent food and service."], ["Luis A.", "The stars are given because of the ambience am not for the taste of the food.although quality is acceptable not ALL dishes are great and specially the signature dish the Paella was to Comercial. The 5J charged at $50 is not a good para negra.Yes I will return because decent food good ambience music wine great time. I'm feeling like taking one star off."], ["Carlos C.", "This place is seriously the best Spanish restaurant you will find in Miami period.I came here with my family, and my 9 year old brother complained all the way till' we came here and then he ended up loving it.They have amazing food, service, they have a band going around playing requested songs around the restaurant, & the decoration is amazing. By the way to show the desserts they bring all the desserts on a giant tray in front of youRecommendations:*Chistoras A La Plancha*Fillet Mignon*Pimentones de Padron*Limonada Frappe*Jamon iberico de bellota 5Js I love that my first review is a place so good like this. Come if you love high quality Spanish Food."], ["Adriana C.", "My first and last time at this place. Overpriced with horrible food. Place has a nice atmosphere with valet parking. Sangri with no liquor in it was so ever just pure ice/water! For appetizer we had fried calamaris which were the only OK tasting thing we ate. Crema de langosta was HORRIBLE! Nasty! extremely SALTY! AND SO WAS MY Main course langoustinos al vega Cecilia. ANOTHER EXTREMELY SALTY DISH! Over all food was horrible and over priced!"], ["Hortensia A.", "A staple in my family get togethers and celebrations. It's old world Spanish style is still one of my favorite things about this place. It transports me to Spain and is authentic in many of its dishes. When arriving here you must order the cod croquettes as well as a mixed plate of cheese and Serrano ham. If you want paella, this is the place! My favorite dish here is langostino a la vega sicilia. It is rich and luxurious, but as a warning, you'll have to hot the gym after eating here. Not diet friendly"], ["Cary M.", "great for paella ! a little expensive for cuban food but the seafood paella is worth it"], ["Benigno P.", "This  was a come back. I had eaten here 15 years ago. It was a delightful dinner. My wife and I had the Paella marinera. It was one of my best culinary experiences I had in a long time.  The paella was just made, it had the right balance of seasoning , and contained plenty of seafood. We paid $62 for the dish. It was well worth it. Sangria was refreshing but at $7 a glass a bit expensive. The almond based dessert was exquisite.  I would definitely recommend and come back to eat here again. Almost forgot , service was attentative and always helpful even though it was full."], ["Dale M.", "Food is excellent, service is not. Too easy for them to forget about me, almost felt ignored at times. Staff are relaxed. Bathrooms are clean, though."], ["Helen C.", "We recently had our wedding reception at Casa Juancho. They have an entire party room in the back. We could not be happier with the service and food! The staff and coordinators were a delight to work with and they did EVERYTHING and ANYTHING we wanted. Many guests compliented the venue saying that they didn't feel like they were in Miami but in an old world Spanish restaurant in Madrid. We hired a salsa band and the speakers/audio equipment sounded great in the room. Everyone felt cozy and the food was aboslutely delicious. I would recommend this restaurant for any type of party or get together.....or just to eat there!"], ["Tal A.", "seriously overpriced for less than mediocre food. waste of money and time."], ["Vanessa S.", "This place is suppose to be romantic and cozy, in my opinion it's just cheesy. Extremely over priced. Parking is horrible. Sangria is pretty good, wouldn't go back."], ["Espicubi E.", "great place. If you want to get away and imagine you are in Spain... Go here. Plates are authentic and waiters are also from Spain. would recommend this restaurant to anyone who appreciates good food!"], ["Vanessa M.", "You know those kind of places you eat at once and it's the best meal you've ever had, but then you go a second time around and maybe a third and it's just never the same? Well, this is NOT that kind of place. I have been dining at Casa Juancho for about 10 years now and I have consistently had a perfect dining experience each time. The food is authentic and as close as you can get to real Spanish cuisine without crossing the Atlantic. You can never go wrong with La Paella Valenciana. Sure, it takes 45 minutes (sometimes longer on holidays) to prepare, but what better excuse to order calamares fritos, queso manchego, and a pitcher or two of sangria? Their wine selection is wonderfully curated, but if you're not into fussing about a wine list simply order, \"vino rojo de la casa\" (house red wine)--I'm not sure what the name of the wine is, but it's as good, or maybe even better than the stuff that's twice the price. The atmosphere is authentic and I truly feel like I'm in Spain when I go there. I recommend going after 9pm, though. The Spanish Tuna (musical group) come to every table to serenade you, the restaurant is full, and feels warm and cozy from the dim lighting. I can't say enough positive things about this place. Just do yourself a favor and go eat there with a group of your closest family and friends."], ["Daniel B. O.", "A bit pricey but hands down the best Paella in Miami! The sandria is also great. Although the area where its located is not that fancy the food is great. Doesn't get 5-stars because of the prices."], ["Monica C.", "So I returned to Casa Juancho recently with Jackie S and the boys.  Pros:Delicious MojitosGreat Wine MenuTapas are AMAZINGStill Love the DecorCons:The singers are a little pushy.  I WILL give you a tip.  Please do not put me on the spot.It's a little Expensive."], ["U. B.", "The European Financial Crisis has come to Miami!!!!!If Casa Juancho is a true representative of Spanish Cuisine in Miami, then it should serve as a good explanation as to why today Spain is a \"SUBMERGING\" economy and is the \"S\" in PIGS Let me start with the positives. The restaurant has a decent decor, reminiscent of old wooden basements and cellars. The menu listing, while others have found the labels obnoxious, I found to be quite entertaining. The \"bible of wine\" was sizeable and enjoyable. That said, our party of 4 opted to attempt a true Spanish experience and went for the Sangria. I like to take responsibility where it is due, and this was our first of many mistakes. If you like drinking turpentine, then this is the Sangria for you. One of us was smarter when she opted to change to white wine. I and my buddy were left to our devices to finish the pitcher we had foolishly ordered. In between our Robitussin Sangria and the appetizers we were accosted by an annoying band of gypsies, otherwise to be known as the guitar singers of the establishment. Mind you, we were trying to hold a conversation at our table but they surrounded us as if they were adding to the ambiance. Yes, they played \"sappy romantic\" songs. The best of this part of the evening was when they asked not once, but twice for a tip. The second guy saying \"If you want to tip us it is now or never\". How does \"never\" sound? We actually considered giving them money just so they would go away never to return. One of us did politely clap for them, bless her heart!The appetizers were actually good. We ordered scallops, razon clams, and shrimp. Since we were not eating at a tourist dump on Ocean Drive we reached the conclusion it would take a lot to ruin fresh seafood. In that regard they did a good job (or so we thought). That said, what came next should be added to the 7 Deadly Sins - Making BAD Paella. I really don't understand what other reviewers have been smoking when raving about this or even if they have traveled to Spain (I have a few times). The Paella Valenciana took 45 minutes as stated in the menu, but it was mediocre at best (that is a compliment given the seafood was SEVERELY overcooked). A tragedy of epic proportions, not even the Greeks in the middle of their crisis would serve anything like that. Hey, they may be in debt, but they must always eat and drink well. The best decision we made, skipping dessert!!!!!!Sadly this establishment gives Spain a bad reputation (given Spain is one of the places I have had the best food, ever). As we walked out we felt bad for other patrons. The place was full. This just goes to show that there are many people in this city and world with serious bad taste in food. Friends don't let friends eat bad food!!!Alas, we were willingly pickpocketed \"Barcelona Subway Style\" by Casa Juancho. Fortunately the Absolutely Awesome company made up for this tragic culinary experience. I will now going forward refer to \"Spanish\" Tragedies!!"]], "Jamon Iberico Pata Negra Restaurant Tapas & Wine Bar": [], "Casa Paco": [], "100 Montaditos": [["Adam L.", "I don't know why, i just love this place. I used to go to the other location (which may be closed now) right near the AAA on Biscayne. Anyways, i recently started working a few blocks away, and this has become my official lunch spot. The staff: Always on point, sometime i go in with a line to the door. No worry, they move people through quickly and never seem to have an issue processing orders quickly.The atmosphere; nice place to eat inside or out. Wednesday is $1 sandwiches so prepare for the place to be packed.  The food: Heres how it works, walk in, see a counter to the  left with menus, pencils and notepads. Scroll through the 100 montaditos (SO THATS HOW THEY GOT THE NAME) and write down which number sandwiches you want. 1-40 are your basic $2 sandwiches (these are my staple). 41-78 are your premium $2.50 montaditos (more flavors, different combos). 79-88 are your $3 gourmet montaditos (ciabatta bread). Do you boldly go where no man has gone before? i dont, because i have never ordered past an 88. That's foreign territory to me (11\" and dessert montaditos)?? Probably good, but never tried.SIZE: I usually eat 5 sandwiches at lunch, but I'm fat, so maybe smaller people can fill up on 3 or 4. They are between hor-d'oeuvres and double pack of twinkie size (do you love my units of measurement?). Just look at photos and youll get the gist.Go here, eat, enjoy."], ["Troy F.", "Yes, eat here (with moderate expectations)HMB and I were vacationing in Miami for a week and stopped here for lunch on a wed ($1 day). Sandwiches are small, but tasty.  Would recommend anything off the \"gourmet\" section of the menu - torero, cesar, club, etc -all of these have more complex flavors than the basic montaditos.  All come with basic potato chips.  Three sandwiches are plenty, unless you're starving to death or just want to try a bunch because, well - they're a dollar.  Place is a madhouse on Wed, but the line moves fast. HMB got the churros on the way out. Her words: \"solid, but not worth the calories\""], ["Leo D.", "Very good place!Became one of my favorites stops! :)The montaditos (little sandwiches) are amazing.. 100 different combinations! The idea is super cool and everything taste so good!Check it out!"], ["Gaby F.", "My first time here and it was on a wed so I got the $1 deal. I ordered 10 montaditos and tried 21 of them. Overall the best ones with the bbq pulled pork and the ones with smoked salmon. The ones with shrimp were my least favorite for they did not have that much flavor. The service was quicker than i expected it and the staff that helped me was actually nice.  Needless to say, at least on weds i'll be coming back. But, if I am close by any other day I might still go in for a couple of bites and a cold jar of sweet-almost-virgin sangria."], ["Mayra S.", "I loved this place! I felt like a pig for eating four sandwiches but they were small!! The place was clean, long line but the service was very fast. I had the hamburger and turkey montaditos & they were very yummy!!"], ["Angelo C.", "I usually enjoy 100 montaditos, and being in the area, I had to try this location. Service is good and moderately quick. The staff are all polite, but don't keep up entirely with what's posted on the door; specifically, deals. Still, wonderful interior to the restaurant, and good montaditos."], ["Natacha M.", "I'm share the picture of the food received I'm called the restaurant for know what's apen with mi sandwich is empty the guy on the phone told me the owner give a direction at the employed for put less chorizo inside the bread!!!  I'm client long time ago but now i never reoder again!!! 50$ just for bread !!!!VERY DESAPOINTED"], ["Phylicia K.", "I absolutely love this place and the concept! Really sad to see other locations close. The specials for $1 sandwiches on Wednesday was my go to lunch option! I even enjoyed going while in Spain! But back to the many, maybe even a 100, reasons why this place is great - so many options! The sandwiches are on mini baguettes so getting 3-4 is completely normal and encouraged. The bread is baked to perfection, I would enjoy it alone and you can with various platters they have, I recommend cheese! This tapas style tasting is great with a group of friends! My favorites are the meatball, turkey with arugula & aoli, guava cream cheese, and caprese. But let's be honest I'm all about the deserts and who can say no to chocolate bread with Nutella whip cream and Oreos. NO ONE! I could eat a bucketful of them. It's tasty just the right amount of sweet and is the perfect size to end your meal. And they have churros, sold!"], ["Alexandra L.", "The Quick: Go on Wednesdays for $1 sandwiches, $3 sangria, and a fun eating experience.The Details: Who doesn't love to try a little bit of everything? My one fault with eating at restaurants is I'm not rich enough to order everything on the menu, and just have a 'bite' (who am I kidding, eat it all!) 100 Montaditos gives you the opportunity to do just that. Whether you're in the mood for pork, chicken, chorizo, veggies, cheese, or Nutella (!!!!), you can have a bit of each for only $1 a pop. Other week day prices range from about $1-$3, so regardless you won't break the bank.Bottom Line: As far as I'm concerned, this is the best dinner deal in time. Putting those $5 foot longs to shame."], ["Kevin K.", "I have never been so disappointed. I ordered delivery from this restaurant and the order took over 2 hours and was incomplete. The order was faxed in from Eat 24 so I'm not sure how they could've messed up being that they have the order in writing. Needless to say, the food showed up cold and the pan tumaca was a complete joke. I called for updates on delivery and the people couldn't even get a hold of the driver to see what the ETA was. Never ordering from them again."], ["Andrew N.", "Best deal in town on a Wednesday! 100 different sandwiches to choose from, all for $1.  Salads are only $3. Great for groups because you order and pay at the counter. Fun atmosphere and cheap, delicious food.. What else could you want?"], ["Ivan D.", "Wednesday nights are a must at 100 montaditos, with reasonably timed service and of course, everything at $1. Sign me up every week!"], ["Ozzy M.", "Been here several times mostly following friends, and to watch some soccer games on their large screen tv on the outside seating area.This place is about small finger sandwiches, but in my opinion it's mostly bread Though after several beers with friend it's not bad for a quick  snack"], ["Deepan M.", "There will be a line if you come on Wednesday!  Well, every sandwich is $1!  There are drink specials, which I usually get a bucket of beers.  You can sit outside and enjoy Brickell. I am not surprised there is line!  The ingredients of the sandwiches are fresh, and high quality.  Don't forget to get a desert sandwich.....you will thank me!"], ["Sean B.", "$1 menu Wednesdays are of course a huge hit, no question.But this wouldn't be getting 4 stars if the only reason to eat there would be the $1 - regular pricing is still very good, and seems to fit the overall quality and experience.If you need a quick bite, and not in the mood to settle for a large single flavor, but rather a little bit of everything - this is the place to hit the spot."], ["Sabrina F.", "This place is great for quick tapas and claras. We went Friday night before a movie ordered 2 appetizer plates some fries and 2 dessert montaditos and it was a perfect meal. We are big fans of tapas and the quality of the meats is good the staff is friendly and a you can buy a pitcher of clara! Which is awesome. Only reason it doesn't get 5 stars is because I wish the platters came with a some more cheese!Check this place out for an inexpensive tapas experience!"], ["Elizabeth Y.", "Came here for their $1 montaditos and what a steal and rare find in Brickell where mostly you'll find expensive eateries. Definitely recommend to come on a Wednesday where you'll get the most bang for your buck. Every montadito is a $1. And I love their aioli sauce! Will be back for more!Only downside is that on Wednesdays, the line can get  really long."], ["Angelica K.", "Best Wednesday deal ! I always stop by when I'm near by in the Brickell area - great date night for us . Nice ambiance and location! Lots of choices for every individual as well as beers ."], ["Deanna H.", "My co-workers and I come here almost every Wednesday for the $1 Wednesday specials. It is a great place, with the true taste of Spain. We order the same sandwiches, salads and croquetas each week and were very happy with the flavor, quality and size of all the food items. Everything there was tasty, priced well and the workers were very friendly. A few months ago though, the prices started rising a lot on everything, the sizes got smaller and the quality lessened. We decided to still come, but less often. Now this week, the sangria glasses got smaller for the second time and the ham croquetas were horrible; they came out looking fairly burned on the outside and tasteless on the inside. Huge disappointment for something usually so tasty. The employee I asked said they changed the product they use to make the ham croquetas (the previous product they used was no longer available or something to that effect) and now they make them differently and they all come out looking a bit burnt. A change in product should not make a food item's presentation look that bad and basically eliminate the taste; unless you want to also eliminate your business. Lower quality and higher prices in the past few months are making my co-workers and I have second thoughts about continuing to come here; but at least the workers are still helpful and friendly."], ["Yenidey G.", "Came across this place on groupon! I decided to try it out, it was pretty good!! Fun to hang out and good location! The tapas were ok, the desserts were good and the montaditos were really tasty! Def going again in the future !"]], "Rincon Espanol": [], "Delicias de Espana 2": [], "Happy Wine in The Grove": [], "Bocaito Spanish Cuisine": [["Karen R.", "What has happened since my last review? This used to be one of our favorite restaurants and left there today sadly disappointed. Several of the items we ordered never showed, but alas, one did show up on our bill. Several of the dishes we ordered were fried and this was not told to us. They were greasy and no where near the quality of previous visits. We left without having dessert and coffee. Then to make matters even worse, when I got to my car there was a 8 1/2 x 11 sheet of paper saying that if we parked in Bocaito's parking spaces again, we would be towed.  I told my husband to go back with the note as I was too upset to be pleasant to the owner. Just because they didn't recognize the car (and didn't ask anyone in the restaurant if a patron's car was in their lot) they were going to have us towed?"], ["Alexander M.", "Quiet & relaxed place located on Coral Way near 17th Ave.  Occupies the old Xixon location (minus the loud hussle & bussle of the crowd).  Authentic, well made Spanish food for decent prices.  Good wine selection as well.  Owner is friendly, greats you at door and always stops by table to see how the food was.  If you don't like the usual long wait times of nearby Spanish restaurants, Xixon & El Carajo (great name though) ... check out Bocaito.You won't leave disappointed.  Buen Provecho"], ["Olman Q.", "I found this little gem driving down Coral Way, it has a picturesque ambience and definitely a Spanish feel. The owner (I think) comes by to greet you and offers his expert advice on wine based on your particular taste. My gf and I loved it and I will definitely be coming back."], ["Andrew S.", "I'm sure many of us know and love Xixon which, at the time of my writing, is opening a new location past further south down Coral Way.  My girlfriend and I thought we'd check this place here because we were in the area and I wanted to take her for some Tapas.The restuarant maintained the same set up as Xixon once had... a bit less 'stuff' ornamenting the entrance and seating area but the space still has character.  For a Brickell or Coral Gables employee, the restaurant is still a good spot for some refreshing Tapa or Sandwich Bocata selections.My gf and I had some good dishes.1. Garbanzos: Tasty, a bit oil... chickpeas with sausages.2. Gambas al pilpil:  Tasty garlicy shrimp... mmm.  Very traditional.3. Tabla Mixta:  Meat and Cheese platter... meh.4. Ensaladilla Russa:  Very good 'spin' on a traditional dish.  Tuna and potato salad."], ["Lester M.", "Let me open by saying that my favorite tapas/restaurant place in the world is located in Barcelona, Spain. In my search to find something similar, closer to home, I stumble upon Bocaito. I went with a group of friends and what didn't we order. Everything was delicious. The service was magnificent. I was a bit undecided on the wine and the owner came out to help me. He walk me through the entire place and gave me a note on every single bottle they had. When came time for desert, I told the waiter about the desert I had regularly at my favorite spot and although is not the way they do it, he made it the same for me. This is definitely a place to try. For me, it has become my favorite place closer to home. Cant wait o go back."], ["Antonio D.", "It's a great restaurant, it's not expensive they have $13.95 lunch special.. I recommended.."], ["tamy s.", "Love this place. Great cozy/sexy vibe and awesome tapas!! Loved the cod fritters here."], ["Bradshaw L.", "I really like this place a lot, it has the old intimacy of it's predecessor, Xixon, which yhe latter has rather lost in it's new and greatly expanded location (though their food is still excellent).The food here at Bocaito is quite good and authentic, the service is very attentive and the atmosphere is intimate and very pleasant.Give it a try, I recommend it highly ..."], ["ana m.", "Just had a wonderful dinner with my parents here. Everything was great, and very authentic. The owner and waiters are all from Andalucia and super friendly. We had the tortilla española, chickpeas, shrimp and artichokes in garlic sauce, and (not sure how to better describe this one) fried grouper chunks. The tortilla was surprisingly good, didn't have the dried out egg texture they sometimes have, and was served with an aioli. Chickpeas were also good, my parents loved them though I was too distracted by the other dishes. The shrimp and artichokes were awesome and I don't even really like artichokes. The artichokes were super tender, and I was tempted to lick the sauce off the plate. And the grouper....I didn't know bits of fried fish could taste so good. They practically melt in your mouth. We shared the trio of mousses for dessert and it was pretty tasty. My parents' taste in restaurants is usually pretty mediocre, but this place blew me away. Doesn't look like much from the outside, but I hope they stick around cuz I'd love to come back the next time I'm in town. The servings were large and the prices very reasonable."], ["A S.", "This restaurant is located where Xixon used to be before they moved to the bigger place in the corner. Food here is very very good. Service was great. A little expensive but good.The air conditioning was extremely high and that's what messed up a bit my experience here. I was freezing the whole time and I didn't even have a coffee after my meal because I wanted to leave asap. I will probably go back and try other things, though my one and only winner so far is Xixon."], ["Arlynes H.", "Another  alternative for good Spanish tapas at a reasonable price and excellent service. We order the croquetas de bacalao ( delicious) and the angulas with gambas another delicatessen, I also had the grilled Sepia with olive oil that was very tasty. The bottle of wine was at a very reasonable price but of a very good quality. The owner , came to the table to make sure that we were having a good time and that the food met our expectations. We had gone back a few more times and every time we leave very satisfied with the service and the food."], ["Steve N.", "I came to this place on accident because Xixon did not change their address on their website. But sometimes accidents are a good thing.The owner is so welcoming to me every time I go here. The tapas are delicious and since I've never had Spanish food before, it was a great introduction to the cuisine.I would recommend getting:- the black rice and squid- paella ( although it was kind of disappointing because it was little cold and the seafood was overcooked)- sausage cooked in cider (my fav)- cod fish- blood sausage- homemade flanGreat place and I'll miss it when I go back to the midwest!"], ["Yessy M.", "The location is not that big but the atmosphere is very cozy and the service is great, the owner is usually always there greeting everyone. The food is authentic and very tasty. Definately try the croquetas...the cheese and chorizo are delicious!! Chistorras al diablo and garbanzo frito...YUM!!"], ["Joed D.", "Excellent food and service. The wine selection needs an improvement. the place outstanding. Jose"], ["Image B.", "Excellent Food, great service, loyal customer"], ["Amanda F.", "Wow! We ate here because we were looking for Xixto...which apparently has moved. Anyway, no big deal. The tapas were fantastic. It was the best meal we've had in a while, and we eat out a lot. The shrimp in garlic sauce was excellent, the potato salads were perfect, and the service was prompt. We also had sausages with chickpeas, sausages in wine sauce (a little salty), and a sausage and cheese plate. The pitcher of sangria was HUGE three of us shared a pitcher and refilled at least three times each. The owner gave us a glass of complimentary port at the end of the meal. The four of us left full for about $100. Highly recommend."], ["Dave P.", "All you need to know is Bocaito is the best tapas and Spanish restaurant in Miami. They don't mess around there. I don't work for them or know them (I wish I did though!!)-  but their food freaks me out every time. I've also been to pretty much every Spanish/Tapas place in Miami, I've also been all over Spain several times.  I can tell you that the food at Bocaito is better than the majority of the restaurants in Spain - it's hard to believe, but it's true. Their whole crew there is Spanish - chef from Spain, waiters from Madrid, Barcelona, Andalucia etc. Bocaito is an under the radar secret in Miami - if you know Spanish food - this the superior place in Miami.  But please keep it a secret..... If you like El Carajo, as I love, you will like Bocaito even more.  Try the chef's specials any night, try their Garbanzos, etc. My wife and I just went there and the chef's special was a tapa of Tuna on the plancha, with a scallop in the middle of two fillets, with a wicked sauce on top.  It was insane.  But we've discovered that every time we head there their specials impress us - no matter what we get. My wife and I know and love Spanish food and have been just about every place in Miami - Bociato is the best.  You must go immediately!"], ["Erin S.", "Bocaito is a Spanish restaurant tucked away on Coral Way in the Grove.  I got a groupon and asked my (Spanish) boyfriend if he knew of the restaurant & he said he knew the owner, so we made a reservation for that evening & had a nice time.  We had 2 entrees that were available with the groupon, I had a baked tilapia & my boyfriend had a fried fish (native to Spain, or something) & truly the entrees were superb. We also had Ensalada Rusa for an appetizer which to me was bland and had little flavor, I NEVER salt anything but I put tons of salt & pepper on this dish & still was craving flavor (lemon? capers? paprika? red pepper flakes? anything).  I met Diego, the owner (from Spain) & the chef, Angel (from Cuba) & the wait staff was all very kind & friendly.  Overall, we had a very very nice evening with good food & affordable, tasty wine.Wellllllll, when more groupons became available for Bocaito, I jumped at the purchase & told my boyfriend & our 3 friends that were visiting from Spain that we had to go!  We went & again were greeted very warmly by Diego, who chatted with us frequently & was great company, as always.  We ordered lots of tapas & a bottle of wine for the table.  The tapas were only decent.  I ate, literally, a basket of warm bread because I was still so hungry afterwards.  We got the Ensalada Rusa again (Spanish classic) & it was still just as flavorless as the first time.  The shrimp were tasty but expensive and only came with 5 in a dish (so we ordered 2) and we got fried calamari which was greasy and all batter, no calamari.  On top of that, our server, from Madrid, was gossipy & rude.  We overheard her on at least 2 occasions speaking ill of our table, even though we were friendly and were racking up quite the bill.  The plate of jamon serrano, manchego cheese & chorizo was much anticipated & came with no more than 6 thin slices of jamon.  The chorizo tapa was flavorful & tasty & the sauce was perfect for dipping the 10 slices of bread that I consumed in.Ambiance is lacking (it is quite bright & reads more like an office space)Overall, I recommend Bocaito for a dinner with entrees, not for a tapas meal."], ["Leslie R.", "This is my first-ever yelp review, so I saved it for my FAVORITE restaurant in Miami. I'm a foodie: I moved here from New Orleans (Anthony Bourdain agrees with me that it's the best eating city in the country!) and I travel a lot. We've spent a lot of time in Spain, and most of that time was spent in restaurants--ha--so I think I know what I'm talking about, and this is the most consistently enjoyable food in Miami. They have all the classics, but they're innovative, too. I must've eaten there twenty times, and Bocaito never lets us down. The chocos (little squid, not always on the menu, but ask!) rock my world, with two kinds of sauce: ink and something green and herbal. The garbanzos fritos are by far the best in town (sorry El Carajo: I love you, but you don't compare); if they have pulpo it will be exquisite; any tapa du jour will blow your mind. Tonight we had goat cheese a la plancha, and it was fantastic. The special red tuna tapa with garlic and scallop was incredible... I could go on and on. Even Bocaito's bread is better than other spots'. How do they do this?? And the service is amazing, so friendly and attentive. The owner is the nicest guy, and he sure knows how to choose a chef. Pleeeeeeeease go to this spot and become loyal customers. Just don't make it so busy we can't get a reservation, okay?"], ["G A.", "Wow, great dinner reasonably priced. The chorizo tapas were to die for. Service was great, really made sure we were happy with dinner. Pride of ownership was clear from the jefe. I would go again and bring lots of friends."]], "El Carajo International Tapas & Wines": [["Jerhmey C.", "What a great find! Wouldn't know it from the outside but there is great wine and food behind those doors! We enjoyed a nice bottle of wine(they have it for sale but anything you buy there add $10 for corkage) Nd some wonderful tapas. The chorizo is great and service is awesome! Will be back to try more things on the menu ( and more wine of course)!"], ["Laura G.", "El carajo is el carajooooo said in the positive way .Nestled in a gas station on 17th and us1 that has an excellent wine selection. The food is tapas style so let's be read to spend some  but come out enjoying each one of tapa dishesBest deal is the tabla to share with the family .Beef one best dealAll seafood one kind of a rip offMixed one is an average good deal"], ["Gabriel R.", "Classic! I live right near it and I am so lucky I do.  Great wine selection and excellent price point. The tablas to share and garbanzos fritos are outstanding.  Great craft beer selection as well.  I love the look on my friends when I tell them I'm talking them out and I pull into a gas station and they look at me in desbelief.  A Miami classic."], ["Ali M.", "Second time going here! Very great rice with chorizo, the skirt steak entree was also A+, salmon a little under cooked for my liking, extremely small sides - 3 asparagus with an entree. Found a great wine Carmel road pinot noir for $16!"], ["Frank D.", "Reminds me of my visit to Madrid and Southern Spain in 2007; authentic Spanish food and wine;"], ["Henry A.", "NPS = 9I love this little hidden gem!  And when I mean hidden, I mean HIDDEN.El Carajo is established in a gas station.  However, once inside you would never believe it.I brought my family here for a nice dinner yesterday.  Their wine selection is impressive and their dining area is inviting.You can start the meal by ordering an assortment of tapas and selecting yourself a nice wine.  Let me tell you, the prices on the wine are amazing.  We got a bottle of Priorat and I one of the reasons I love this place is because I have had trouble finding this wine at any other place.  After you select your wine, there is a small corkage fee to drink it with your meal.I highly recommend coming to this place with friends, ordering a few tapas, and simply having yourselves a couple of glasses (or bottles!) of wine.The gambas al ajillo do not disappoint and the tabla mixta is good for large tables.  However, I must say you have to try the morcillas.  I have not had better morcillas than the ones I had here.The place offers great service as well.  Ask for Javier when you go and you will not be disappointed. A watch-out is that tip is included when you get your final bill (we had a party of 5 and the tip was already included even though the menu said it was for \"parties of 6 or more\" so I believe they just include the tip for everybody.)When you are done with your meal, do not forget to take a bottle of wine home."], ["Michael G.", "This small but trendy Tapas and wine Restaurant its excellent. Call in advance because they do get packed and there is not a lot of seating.. Tostones rellenos de camarones and their churrasco are excellent choice."], ["Jennifer L.", "Gas station tapas you ask? No way that can be good. I thought the same thing for years until one time my friend and I decided to check the place out. It's behind the gas station right I ask my friend? We go around-nope it is actually inside the gas station. Think a converted 7-Eleven turned dining establishment. Don't let that deter you away. I regret that it did for me for so long. El Carajo has an excellent selection of wines not only because they are a Spanish restaurant but because they are wine shop as well. You arrive and pick your bottle of wine and bring it to the table at which point the waiter will open it up for you. I also recommend checking out their Sangria which is delicious and strong. You will have a hard time picking up the jarra it comes in after a few refills. I have only had tapas here and never the bigger plates so I can't speak much to those. As for food I have had so far they get it right. A lobster bisque served piping hot and full of flavor; croquettss with filling so creamy; cheese and meat platters with the finest Spanish selections; bacon wrapped dates to die for and more. Everyone has their favorites when eating Spanish tapas and El Carajo has them all. I would say if you like Spanish food this is a must stop spot. Don't let the gas pumps fool you!"], ["Amber B.", "We had a nice time and left happy. We liked the shrimp and garlic in olive oil the best. The bacon wrapped dates were pretty good. Stuffed with chorizo instead of cheese. The sausage and mushrooms in wine reduction also tasted good. It needed salt, but the sauce was delicious with bread once it was salted. Olives were yum. The sangria for sure had canned fruit cocktail as the fruit :(   We had white, but it looked like the red at the next table had the same. The crab foo foo was not to my liking. The foo foo part was better than the crab part. The langosta empanada was the worst. bland and dry. The couple at the table on our other side were served a gorgeous seafood paella. It looked so good I wished we had ordered that. The service was slow and unfortunately I don't speak very much spanish. The ambiance (half gas station half tapas wine bar) was weird. It was a fun date all in all."], ["Luis E.", "Who would have thought El Carajo was in a gas station?If every time someone had told me \"vayase al carajo\" (go to el carajo) they had told me the food was so good and the ambiance was so cool I would have gone happily.Live and learn I guess....Great food, great beer/wine selection.. delicious sangria. Ok prices. Crap service.Yeah... crap service. You almost have to throw a bottle at the server for him/her to stop by. Run out of bread? C'est la vie... your gambas al ajillo will be long gone by the time you get a refill.However El Carajo is totally worth a visit and worth coming back. Great place to hang out."], ["Kim P.", "Yes, its attached to a gas station. Yes, their name is a curse word en espanol. If that bothers you, you're probably EL SOBRADOR and shouldn't be eating here anyway. Go to south beach then.That being said, the food is amazing. Both meat and seafood \"tablas\" (planks) are not to be missed. For soup, the Caldo Gallego (smoked pork, ham and white bean soup) is my fave, really rich and flavorful broth. The white beans break down and thicken the broth, its really awesome. You can get fried yucca almost anywhere in MIA, but here its especially good, crispy with a flavorful dipping sauce. The Pulpo al ajillo (sauteed octopus in garlic sauce) was tender and succulent. The crab crepe was so different, and the sauce was so rich and tasty. Best to go with a party of 4 so you can try a few dishes. When my husband and I go, we usually split a soup, one of the planks, and one main dish. The portions are a good size and you get a basket of bread. Americans love that free bread and cannot stay away from it, don't we lol.The wait can be a bit long, as they don't have a lot of tables. Its worth it though! Parking can be a little bitchy since its a gas station, so just be patient, someone will pull out of a spot shortly. Try to go early, it helps."], ["Katy P.", "When you drive into the BP gas station you would never expect to fine one of the best restaurants in Miami. Not only does El Carajo have delicious tapas, but they also have a great wine selection - and I am talking about the good stuff. They have wines like Cakebread Cellars Sauvignon Blanc, Numanthia and Duval-Leroy Brut. While you are sipping on your glass of wine make sure to try some of their tapas like their chorizo al vino and Suprema de Bacalo a la Vizcaína."], ["Francisco M.", "We visited El Carajo while in Miami over Labor Day weekend and we have found a new favorite in Miami. The restaurant is very small and I definitely recommend you make reservations. We got lucky when we arrived and got a table but our waiter did say we needed to be done by 8:30pm because the table was reserved for that time. The menu is extensive and you have a lot to choose from. It's mostly a Tapas restaurant but they do have some entrees to choose from. We ordered the Meat Platter (Tabla De Carnes) and it is enough to feed two people. It comes with steak, chicken, pork, sausage, potatoes and fried plantains. The pork ribs were very tender and tasted delicious. The steak is \"churrasco\" skirt steak and it was tender and cooked to perfection. We ended with Crema Catalana for dessert which is a Spanish Creme Brulee but the sugar on top is a bit harder and more caramelized. The service was top notch. Since its a small place, there is always someone around to help. We didn't have to wait around for anything. For the wine lovers like me, I will give you one tip. If you choose to buy a bottle off the menu, they charge you a corkage fee of $10.00. You are buying the wine from the store inside the gast station/restaurant so it's a bit strange but the prices of these bottles are reduced. I paid $49.00 for a 1994 Rioja which is cheap considering the year of the wine. They offer wine by the glass but I found buying the bottle is more economical. The restaurant is located inside the Food & Deli store at the BP Gast Station. We will definitely be back on our next trip to Miami. Gives new meaning to \"Me Voy Pal Carajo!\""], ["Erick R.", "\"El Carajo\" Normally used as a bad word in Spanish... Not in this case! This one joins my top 3 list Nationwide! This hidden Gem is literally hidden inside a gas station in Coral Gables. You have to park right by the pumps and walk in as if you were going to ask to put $50 on #10. Once you walk in, you will be surprised by a bakery filled with mouthwatering sweets. Continue in and you will be greeted to the best Tapas and Wines Restaurant in South Florida. You'll be seated within thousands of wines that cover the walls, wines from any side of the world, ranging from $3/ bottle to the exclusive wine cellar; that you can walk in at your own leisure with bottles that will run you $500, there is a $10 corking fee with every bottle. The menu which is actually a scroll, adding to their Spanish Pirate/Sailing theme, has the perfect amount of items at the right prices to try a little bit of everything. We came this time with two other friends (Yelpers). We ordered the Chorizo al Vino (knock you on your ace good!!!), the Lobster Bisque, and Ham Croquetas, accompanied with a bottle of Santa Margarita. When then continued with more Chorizo al Vino, Ribs, Fufu de Cangrejo, Ham Croquetas, and a platter of Hams and Cheeses, accompanied with another bottle of wine. If you have not tried this Restaurant you are in for a Grand Surprise! Get reservations on Fridays and Saturdays."], ["Peggy G.", "Had a great dinner last Saturday. My bf and I shared a seafood plank, along with garlic octopus, mushrooms and the gambas al ajillo. What a feast! The corvina was perfectly cooked and flavorful. The waiter and chef were careful to be respectful of my dietary restrictions and sauteed the calamari which were amazing too. The platter was huge and had an assortment of meats all cooked perfectly. It came with crispy tostones. The mushrooms were a bit sweet for my taste but flavorful. The prawn and octopus are a must! Wish there was a gluten free dessert option but didn't have the appetite anyway! Great option for a date night or dinner with friends."], ["Patty G.", "One Saturday night, my husband and I pondered about where to go for dinner. \"Let's go to El Carajo\" he says. \"Why would you say such a thing!\" I respond. To make a long story short... Nos fuimos para El Carajo. This is one of those places that you find mainly through word of mouth. My husband's boss had said many good things about this restaurant. I thought the idea was strange and quite different. It's a gem, kind of place. Not unlike the Greek restaurant we used to frequent in Edgewater, NJ where you would sit in a cave-like atmosphere and enjoy sweet Baklava. As we approached the gas station, I still did not understand how this could be. A restaurant inside a gas station. We apprehensively walked into the \"LA Food Store and Deli,\" not really sure we would actually find a restaurant inside and appearing to go pay for our gas. You enter and to the left is the typical gas-station counter, to the right is a pastry shop/cafe, and at the back you will find El Carajo. This tapas restaurant has a beautiful array of wines and even a wine cellar that smells distinctly of wood. There are beautiful murals on the walls and a mixture of high tops and regular dining tables. We didn't have a reservation and the place seemed somewhat empty when we arrived. We were sent to one of the high tops and were greeted by our waiter immediately. Service was on point all night, even as the place filled up. We were tended to all the time. Plates removed once we were done eating, waters filled, food arrived quickly, and we were asked how everything was several times. The food was simply delicious. We started with the cold cuts and cheese platter (Combinacion Meson) which was very tasty. We also had the Caldo Gallego-- which made me melt in my chair. And we ended up sharing three tapas: Fufu de Cangrejo, Gambas al Ajillo, and Garbanzos Fritos. We loved everything! Oh and lest we not forget the Guava Cheesecake. 10 times better than any Cheesecake Factory-cheesecake! I guess the only downside to this place is that (as other Yelpers have noted) they charge a $10 corking fee to have any of the wines they carry! I've never heard of a restaurant charging a corking fee for buying a bottle in their own restaurant. Its just a little bit ridiculous. Highly recommended. A real treat to eat here!"], ["Isabella R.", "First and Foremost I want to dedicate my YELP review to my dear friend Jessica Melo. As good Friend do Jessica got to work on a Monday eager to tell me about her first date with a new beau... Me: Where did he take you?Jess: A gas stationMe: ::Blank stare::  What?!Jess: A NICE gas stationMe: ::Blank Stare:: huh?Jess: Seriously. Wine, Tables and good foodMe: Yeah OK Jess.. Good luck with thatWhen my boyfriend parked at the LA Food store and Deli a asked that he pick up a pack of gum for me on his way out. He went on to explain that we had arrived at the spot we would be having dinner at. My initial thoughts\"Ok..so Twinkies and hot dogs for dinner? This is new.\" Well, nothing could have been further from the actual experience. El Carajo was a very fun experience. The fact that it is located inside a gas station literally just adds to its charm. The wine selection is extensive and the food was delicious. Definitely one of those MUST checkout spots to believe it. We ordered Serrano Ham Croquetas, Papas Brava, fried Garbanzos and a Tabla Mixta. Honestly the food did not disappoint. The service was a little slow but they also made accommodations for us given how packed the restaurant was and our lack of an accommodation. Overall it was a very Nice experience and FOR MY CRAFT BEER LOVER they have an AMAZING selection. Order there or take it home and enjoy. EL Carajo is undoubtedly a hidden gem in Miami"], ["Ann B.", "Such a cool place! Fantastic food! Been twice without a reservation and we were seated right away. I'm surprised that people still don't know this place exists. If you've found this review you need to go check it out! Can't beat the location ;)"], ["Jon L.", "This place is awesome make reservations order anything parking is a little tight but you can get garbanzos frito and a can of wd40 on the way out"], ["Dan P.", "Excellent French wine selection, especially if like Sancerres ! , Like I do ....  Very Dry & Delicate Delicious Tasting White Wine.Prices are very fair , the restaurant holds its own with good quality Spanish Food. It is a place to try and find out for yourself. I give it 5 stars for their low prices coupled with quality!  You will find the wine and champagne prices are typically 20% lower than the average competitors. Check and See For Yourself ! I dare you."]], "Lola's Gourmet": [["Sergio Q.", "Cozy little Spanish place. I came with a friend looking for a quiet place with good food. We found this place through Yelp based on star ratings. This place is amazing We ordered mainly \"tapas\" We started with croquetas de bacalao then fried garbanzos then huevos rotos. My favorite were the croquetas For dessert we had the crema catalana. It was ok ( skip it)The parking is small so come early ...Wait staff is very nice and I think the owner is always visible."], ["Jeanette R.", "Good Spanish spot. Best paella (only on Sunday's)The Spanish tortilla is good and so are their sandwiches. The place is small with limited seating, so try to go early. The paella is offered on all-you-can-eat terms for 12.99 and is one of the best I've had beyond homemade."], ["Christa R.", "Awesome experience! My amazing boyfriend Yelped this place and said it got great reviews. I went in to check it out and see if we could get seated and the server said yes and so we were in. We got very lucky because it has limited seating and gets packed! Thank you server!! Anyhow, we got seated and received the menu and it was a nice array of tapas and entrees. We then yelped and looked at the pics and reviews and then asked our server what to get. He suggested a lot of great things. We received the poblano peppers stuffed with manchego and chorizo with a side of potato. It was delicious !!!! We also got a paper stuffed with cod, I didn't like that. After that we got chorizo sausage, garbanzo beans, and a tortilla of egg and chorizo. All were really great especially with bread and sangria! The entertainment was great, I love flamenco music and dancing. You will get full, so don't order too much even if you are starving. We almost ordered the lamb chop, but glad we didn't. To sum it up, I had an awesome experience with food, drink, and entertainment! I can't wait to go back and bring people to experience it, and next time we will make reservations."], ["Jessica W.", "I had a good dinner at Lola's, but nothing was memorable enough to give it the 5-star rating that seems to be prevailing on here.  I ordered the sepia a la plancha, which was cooked perfectly and nicely seasoned.  However, the lackluster service and the tarta borracha de santiago that we ordered for dessert left much to be desired.  With all the other Spanish options in Miami, I don't think I would venture back to Lola's."], ["Flygurl C.", "This place is literally 3 blocks from my house. I drove past it for years and finally pulled in. Thank goodness for the duo of Lola and Ernesto and their delicious traditional Spanish fare. Wow. Intense homemade charcuterie, Fabada Asturiana and pate. Insane wine selection. Family owned and operated and you feel it the second you walk in the door."], ["Lyndenise B.", "Went on a Friday night where they have a trio and they were so great! Reservations are a must since it's a small location and the house is usually packed. You also have to reserve paella by the plate in advance since they only make it on Fridays.The ambience is great, the trio had great energy and very talented. I just wish the people next to us didn't drink so much that they thought it was ok to hit the fork on their wine bottle. Drove me crazy! The food was great. I was a little disappointed with the paella since it's a little mushy compared to other great parkas I've had. It also seemed a little oily which overpowered the taste of everything else. I still have it 4 stars because all the tapas were great and so was the service."], ["Sally R.", "Delicious Spanish food and great live flamenco show!We were pleasantly surprised with the food, the atmosphere, and the show.  It is a small cozy place but that made it fun for us. On the night we went (Friday), there was a live flamenco show. Spectacular! ¡Olé! I believe the show changes so if you want flamenco make sure to call first to find out the dates. Tapas were delicious. We had garbanzos, pimientos piquillo, chistorras caseras, and chorizo al vino. Very good chistorras!! For entree, we had some good paella.  Everything was perfectly paired with two nice bottles of Rioja. Prices are reasonable and everyone was very friendly. The owner came by the table to make sure everything was going well. This place is small and it gets busy quickly so my suggestion is to make reservations especially on show nights. Parking can also be difficult since the restaurant is inside a very small strip plaza but at night they are usually the only place open.   Overall, this is nice casual restaurant with good Spanish food and great entertainment. Very nice for a date night ;)"], ["Lidice L.", "We just finished having lunch at Lola's gourmet, had the bacalao croquettes, the garbanzos Fritos and the huevos rotos. The food was amazing, flavored on point, very nice staff, would definitely come back here"], ["Agaputo R.", "Not enough stars to review this small but cozy piece of Spain in Calle Ocho.Food is excellent. Parking is limited and could become a problem, especially if raining. Large parties should reserve ahead. WARNING, if you visit once, you'll become addicted."], ["Tony S.", "One of the nicest place for Spanish Food and Show in Miami.Excellent attention and reasonable prices."], ["Leonard G.", "This is a super cozy, intimate Spanish style restaurant, seems like you are in Spain, although I've never been to Spain it feels like we are in Madrid. Excellent choice of wines and countless typical Spanish plates. We enjoyed an excellent Paella. Would recommend to anyone in the Coral Gables area!"], ["Joe T.", "Wow what a hidden gem. Saw the reviews and stopped by at 11:15am. Of course it was empty so ordered tapas and glass of wine. Continue ordering tapas sibce the are delicious and homemade. More wine followed and glad that no entres were ordered Giving us the perfect excuse to come back."], ["Aleja O.", "Amazing and intimate environment!! If you like good music and good wine go every thursday, friday or saturday! Food is not unbelievable but it's good and worth it!! Buy Tapas \"chorizo al vino\" and Have a great night!!"], ["Morgan M.", "Last week I decided to go out of our comfort zone for date night and picked a restaurant we've never been to before. Lola's has great reviews and we could nearly walk there (next time we will). Lola's interior is a cute mix of dated European decor with a comfy hole in the wall feel. We felt a little intimidated being the only patrons there on a weds night, but hey we just decided to call it romantic. :)I ordered a glass of Rioja wine and my bf ordered a bottle of perfectly chilled mahou. We giggled over the video that goes along with the music and tried to adjust to the slower pace of the wait staff. It's an authentic Spanish place, they don't woof down food in 5 min, so they also don't rush about taking your order. Adjust, it's an American problem. Drink your drink, converse with your partner, pretend you're in Europe where 5 course meals are still the norm.We ordered the croquettes of bacalo and also of chorizo, as well as a slice of torta, and a Serrano and manchego sandwich. The croquettes arrived first. You get so used to the croquettes in most Cuban places in Miami, prepare to be spoiled cause these are by far the best. Super creamy and nice sized with great garlic/mayo dipping sauce. The torta slice was huge and our sandwich came around the same time. I've become so used to pricey tapas restaurants in Miami where you have to spend $40 - $50 just to get fed well. Not here, we actually ordered more than we could handle. The torta alone could fill up a person with an average appetite. Everything was great, they make their own bread, real lovely bread! They also make their own chorizo. This is not the place to come if you're on a low carb diet or if you're looking to impress your date with the decor, but if you're a true foodie that wants some authentic food for a great price, you can't go wrong here. We went away very happy and I'll be coming back as soon as I get tired of salads."], ["R B.", "Unexpected pleasant surprise. The food was full of flavor and authentic... Menu prices are fair and reflect the quality of the food. From the outside I wasn't quite sure what to expect but inside the vibe is chill- comfortable and easy. Overall- sweet find :) Thanks yelpers."], ["Lulu P.", "I visited this place for lunch with my mom on a Thursday afternoon just past noon. When we arrived, only one table had a customer waiting. But the restaurant quickly got a little more busy a few minutes later. There was only one waitress and she became somewhat overwhelmed and it took about twenty minutes to get our drinks, which she got wrong anyway. Then the owner came by our table to let us know that they were out of the lunch special fabada. I'm not sure how since we ordered it and got one plate, but all of a sudden it was sold out? The strange thing was that the two ladies behind us had ordered the same thing AFTER us and got their orders.  And it wasn't like it was later in the day and everyone had ordered this. But we weren't picky or anything so when she offers us the lentil stew, we say ok, bring that. Five minutes later, the same person (the owner) comes to tell us they're out of the special fabada. I tell her, \"yes, you mentioned this and said you were bringing the lentils instead\" well, she insists that she never told us this. Again, strange. So after what seemed like an eternity, we got our lomo with potatoes. And this is where I'm the most upset because up until now, I forgave the bad service and the overly salty stew/appetizer mix-up, but the food...the food just sucked! All these people on yelp giving it great reviews I expected great food. But when food is so so so salty that all you taste is salt, that's the mark of bad cooking. And that's exactly what this was. We both disliked it intensely, and then, to make matters worse, when it was time to pay, they short-changed us $10. Finally, the soap in the bathroom was watered down. If they can't afford a much needed extra waitress, soap for the restroom, and other ingredients besides salt, where else are they cutting corners? Gross, just gross."], ["Luis P.", "How in the world does ANYONE have the courage to rate this place? Every plate we ordered should not be served. Cold, improperly cooked and not seasoned. I cannot say anything positive other than if you have an urgent need to pee, stop and use the bathroom!"], ["Juls S.", "Made a reservation through Yelp and they didn't honor it. It took 3 waiters/waitresses walking by us before someone asking us if we needed help. Tiny little place and bad service right off the bat. Wouldn't go back to try it out."], ["Joseph N.", "My favorite place to eat in this city. Great atmosphere, great food. The chorizo, croquetas, and lacon are must-order items."], ["Sandra G.", "We made reservations for Saturday for 15 guest. The place is small but the atmosphere is unique. As a heads up there is a $5 cover fee but it was a fun Saturday night. The entertainment was excellent and diverse, there was never a doll moment. Talented singer, guitar player and the costumers played and dance too. The food was good and the sangria was very sweet. The total for two was $56 (food+beverage+entertainment)"], ["Danny T.", "I'm not much of yelper but this place was phenomenal!  I tried los callos and they were the best I have ever tried and then I saw the lacon and to have it...it was amazing!!  Thank you Lola!"], ["Robert K.", "Aaaaaaaaamazing- at anytime of day. Just make sure se hable español.The chorizos are to die for- id come to this place before I'd even come to miami- wish they had it in Los Angeles..."], ["Maria P.", "My husband brought me into Lola's restaurant based on their Yelp reviews and I'm very happy he did, the food was very good and the service excellent . On weekend they have a Flamenco show we enjoy very much"], ["Olivia P.", "Celebrated by grandpas 88th birthday party along with 18 of my family members, and not one person was disappointed. Service was great for such a large group. Very patient with my small nephews which is very important to me. They really made our night special, and most importantly my grandfathers."], ["Jessica R.", "Make a reservation if you want to eat here!Came here with hubby while on vacay for a romantic dinner. When we arrived at 8pm, the place was dead, and I was wondering if we even needed to make a reservation. We did. By the time we got our food, place was packed to the gills. We ordered three tapas (sorry I cannot remember the names because the whole menu is in Spanish) and a large pork plate. My hubby had to do all the ordering, but he made some good choices! The place itself is super tight, as well as the parking lot, but it makes for an intimate setting. The chairs were a little uncomfortable to sit on, I would recommend taking some of them out and putting in some comfy booths along the walls. Now... about reservations... make them!!! We saw countless people come in and then turned away because they did not have one, including a large group of teens (quince I think?) which would no doubt have made them a lot of money. They also had live music playing, but after a lot of squeaking from the mic during their sound check, and then seeing the singer chugging wine in the entrance, we left before he got started LOL. As far as authenticity of the food, I can't say for sure, but it was delicious & I would go there again."], ["James P.", "Not only \"just a Spanish restaurant\" but one of the most enjoyable places to have tapas enjoy flamenco and great dinners.  The staff are outstanding and very friendly.My favorite place in Miami"], ["Iker A.", "Great place! Best morcilla in Miami. Authentic Spanish food. Flamenco show adds to the authenticity and ambience of the place."], ["George H.", "Simply amazing. Our waiter was friendly to newbies, suggesting a good beer. The food was classic Spaniard fair with a delicious flair and style. I do recommend!"], ["Frank C.", "Authentic Southern Spain cuisine! I felt like I was in Córdoba!Ask Lola what she recommends. This place is really good, and absolutely no nonsense. Her homemade chorizo is phenomenal. The stuffed poblano (although Mexican) with Manchego and chistorras are delicious! Nice wine list too."], ["Lily B.", "I went to Lola's to celebrate my birthday with friends.  The restaurant is small so reservations are a must.  Parking is scarce because the restaurant is located in a small shopping mall but there is parking on the streets. They have a Flamenco show on Friday & Saturday. The show on Friday was great.  The guitarist and singers are awesome. The service was slow but our waitress was super nice.  We were glad that service was slow  because it gave us time to talk and relax.  Sometimes we live in such a fast pace that we forget that good conversation and good food should be enjoyed not rushed. Felt as if we were in Spain. All of the tapas were superb.The sangria delicious! We were so full that we could not order a main dish so will do so next time. I am a foodie and all of the plates that I saw come out of the kitchen looked amazing.  The food is fresh and well-prepared with good quality ingredients. The owner came to our table personally to apologize because they had run out of a dish.  What more can I say!  An applause to Lola for giving us a little bit of Spain in Miami.  Looking forward to eating there again."], ["Gianni D.", "If you watch Anthony Bourdain  and his Layover series, this place would probably be one of those hidden gems you would expect to find on a show like that. This place is small really small. A deli style glass fridge and a counter top with a couple mini table outcropping with maybe 8 bar stools. My mother of all people was the one who recommended this place to me. She mentioned that the owner was from Malaga and makes her own Chorizo, and  no set menu. I mentioned this place to a friend and coincidentally said his own mother also recommended the place and would be very upset if he did not go there with her first. So against her wishes and my curiosity we set out to find this Spanish eatery. I was born in Miami with Cuban parents so not to say, we were greeted by an older spanish lady, could be construed into any one of the many latin ethnicities we have in Miami, so to clarify we were greeted by a real Spaniard. The place as I mentioned, is small, but clean, appropriately decorated with different food products from spain, as many of these spanish places have a tendency to do, like Delicias De España. I specially loved the corky spanish  music (flamenco I believe) that gave the place an even more authentic feeling. Just make sure you face towards the inside, as looking out the window and seeing 8th street, could compromise this vibe of being somewhere in Spain.We had the de facto standard of Sautéed Chorizo in Wine. I had never tried \"homemade\" chorizo, it was fresh and the flavor vibrant,. For our entre we had the Friday special of her non-seafood Paella. I am allergic to seafood, so it had been a while since I had a paella I could eat. The owner mentioned that every friday they have paella and alternate between the seafood and meat versions. The paella was very flavorful, check out the image I uploaded. This particular recipe originated in Malaga which is influenced by the Moors, so maybe different than what you may have tasted otherwise.We had a very inexpensive, but delicious red wine and topped the meal off with a cuban coffee which was surprisingly good.This place is amazing, its hidden, but is being discovered by those whom are always on the look out for authentic spanish food. Make sure you check this place out before people get wind of how good it is. You heard it here first."], ["Ramsey C.", "Great food, warm atmosphere...highly recommended..... The Sangria & the flamingo music is a match made in heaven.The Tapas are out of this world ...."], ["Madeline M.", "Went on a Wednesday night, had the home chorizos appetizer... delicious and a great Sangria.  Went back on Friday and had the Lacon al vino which was very tasty.  Flamenco show at 9:30 pm with a very reasonable $5.00 cover charge.  Weekends they strongly recommend reservations.  The downside...parking is a little difficult and the place rather small.  I will go back with no hesitation.  Very friendly staff and great service."], ["Bee E.", "This place is legit. I've only been to Spain a couple of times, and am no expert, but Lola's had the best Spanish food I've had in Miami to date. They make their own chorizo, and it's awesome. Everything else we had was also very good, and reasonably priced. I would have to check again, but I believe that they may now be open a little later during the week than the Yelp info shows. It's worth noting that although she was very nice, I'm not sure our waitress spoke much English, and the menu is all in Spanish. I had the husband to translate for me, but if you don't speak Spanish, be prepared to point and smile. Which is probably a safe strategy anyway, since all the food was so good."], ["Martha F.", "I love this restaurant.  The food is excellent and the service is great.  Cannot wait to go back."], ["Amanda D.", "I can't believe I found a restaurant in Miami who serves Morcilla de Burgos!!!! Delicious food! And great prices. Make me actually feel like I'm in Spain!"], ["Alex A.", "Fantastic Spanish food"], ["SnapHappy P.", "Delicious paella! Warm hospitality! And VERY warm hosts!"]]}