{"Rock A Bangkok": [["Moe P.", "This little authentic restaurant is great.  The menu has a large selection of curry and anything and everything Thy.  The service was not perfect since they are packed.  We got our spring rolls which were extremely hot before getting water.  However our food was really good and the portions are large."], ["Miriam G.", "This little place has wonderful food service and prices - the shrimp curry was delicious - service was excellent - great place for a relaxed lunch"], ["Erika S.", "The Special Fried Rice is delicious. The service is fast & friendly. And the space is clean and cozy. Will definitely return."], ["Jessica B.", "Amazing food and service! Come here at least twice a week the coconut milk soup is spectacular lunch specials also"], ["Jorge R.", "The chicken pad thai was one of the best i've ever had. Its not drowned in sauce which is my preference. The little thai donut things were nothing special. It was a decent portion and the price was fair."], ["Tesoro C.", "Love this cute restaurant! The food is amazing I've gotta recommend the coconut seafood soup, amazing! Steak and chicken pad Thai diliaousness! Love this place"], ["Arturo W.", "Best thai food in Miami. Every thing is good. Try the fried rice or any of the curry dishes. Three Karat Chicken is amazing too."], ["Bonnie C.", "I soooo wanted to like this place.  I ordered the Chicken coconut soup and some steamed dumplings for lunch.  The soup was good, but the dumplings were dry and stale.  About 20 minutes after finishing my lunch this place literally sent me to the hospital with food poisoning!!! I hadn't eaten anything else that day except for lunch.  Suffice it to say... I will NEVER order from this place again!"], ["Patricia F.", "I've lived about 5 minutes from this place for 11 years and just now found it!!! Amazing food. I LOVE Thai food and this place is a hidden gem. Went for the first time with family. My daughter and uncle who are the picky eaters about licked their plates clean! Took home leftovers! Went back the next day only with my sister and tried two different dishes. Again amazing and took home leftovers which I ate for lunch yesterday so technically I've eaten from there three days in a row!!! Thinking about going for lunch today now! LOL!"], ["Julia S.", "I read the reviews before going, but not what I expected. The prices are too high for the quality of the food. My mom ordered a fried snapper and it was over fried, dry, and SUPER EXPENSIVE. Not impressed at all. I don't recommend it."], ["Nicho D.", "Quaint little hole in the wall place serving up some authentic thai food. My most recent visit I had the volcano chicken \"medium spice\". WOW that was some spicy chicken! But delicious! I usually get the curry chicken and its always good. Very affordable too, especially during lunch. Try the Thai Tea!"], ["Kim O.", "We stopped in just for a few appetizers but I really want to go back and try some curries here!  We got the coconut shrimp soup which was really tasty. Sour and savory at the same time and really good. Also got the satay. The chicken was really tender and nice but the sauces were just ok. Not my favorite peanut sauce for sure. The Thai tea was awesome as well. Can't wait to go for a full out dinner!"], ["Juan H.", "My wife and I loved it. Great food. Went for lunch and had a lot of different things to choose from. Must go. Btw the fried doughnuts... Omg."], ["Lauren C.", "Best Pad Thai in town HANDS DOWN! the staff is very professional, attentive and sweet. If you're looking for a good Thai restaurant, this is it."], ["Noelani J.", "Absolutely delicious!!! We went last night and it was awesome!!! My red curry chicken was perfection!!! My husbands basil seafood was amazing!! Our waitress was very kind and acknowledged my questions (gluten free) and answered them perfectly! I could not ask for a better dining experience! My kids loved their chicken fried rice and edamame! Ooooo and their Thai tea made me smile! Lol I definitely recommend to anyone looking for a delicious fresh meal!!"], ["Rosario P.", "Rock A Bangkok, you officially own my heart The hubby and I decided to make Tuesday our date night. and we headed out to have some Peruvian food. The establishment we had chosen, is very small and it had a wait time of 15 to 20 minutes. We were starving so we decided to use our yelp app to find a good restaurant nearby...and thats how we found Rock A Bangkok!We went inside to a surprisingly empty restaurant. We were seated right away by a very polite lady.  We were feeling adventurous and we were starving, so to START we ordered a Chicken Pad Thai. Im so glad we ordered this instead of dumplings. The Pad Thai was AMAZING! We then ordered Yellow Curry Chicken and Volcano Chicken to share. The portions are massive, so honestly we wouldve been fine with just one of the two, but I'm so glad we ordered both! They had very different flavors, both of them to die for!Even though we barely caused a dent in our meals, we decided we could not skip dessert, so we ordered Thai Doughtnuts. Im not big on fried desserts, but the doughnuts were amazing!I cant wait to go back and try different items on their menu. This place has definitely made it to my list of favorite eats. The food is cheap, the portions are huge and the service was very friendly."], ["James E.", "Three for three!   Great food on our third visit.  You can't beat this small restaurant for Thai food.  The friendly service is just icing on the cake.."], ["Ana P.", "I am starting to believe that I will never find a good Thai restaurant in Miami :( i had lunch here with my sister and the food left a lot to be desired. The pad Thai was greasy and bland, the tom yum soup was watery and had little flavor. It only earned two stars because the cute atmosphere was a redeeming quality. Will never eat here again."], ["Maria Y.", "This place is amazing, food us delicious and the service is wonderful.  Its a little hole in the wall but good eating. My favorite dish is the Garlic Chicken and Karat Chicken (which is better than any honey chicken youll eat anywhere else)."], ["Mayra S.", "This is my favorite Thai restaurant in the world. The restaurant is a small place in a strip mall. I feel like I am in a little NYC restaurant because it has this intimate feel. It is clean, and the food never disappoints. I love everything from their menu."]], "Kam Wah Restaurant": [["Roxie G.", "Hole in the wall but best sushi place in the area. The Florida gator roll and the awesome roll are delicious. Sushi is always fresh and I have never had a bad experience either dining in or ordering out."], ["Emily G.", "this restaurant was so nice it was clean and beautiful and the workers were really caring about your order that was my first time trying sushi and i am absolutely obsessed"], ["Dorby D.", "Awesome pad thai and great service."], ["Nathalie P.", "First time.when I came in I felt unsure. No one was inside of the restaurant. But it was only 30 minutes after they opened. Everything was delicious. I had the Florida Panther roll and red dragon. Perfect and fresh. I really liked that it wasn't those massive pieces, you get at other sushi spots. I definitely will come again."], ["Sandra N.", "I've been here a few times already. Every meal has been good. Nothing too out of this world but definitely good enough for me to keep coming back. This place is conveniently close by to my boyfriend's place which is why we keep stopping by here.They have Thai, Japanese and I believe Chinese food as well. I've had the Pad Woon Sen and then several sushi rolls and sashimi. The food has always been good, no complaints here. We always get really nice service too. We will definitely be back!"], ["Ralph P.", "Ok, so I've been on Yelp for probably 15 months now and when I first got on, I would see people check in to Kam Wah so I bookmarked to check out. Probably about 6 months ago is when I finally checked it out.  Kam Wah is kinda Asian fusion.  Thai, Chinese, and Sushi.  It's a small restaurant in the corner of a shopping center behind Don Fernando's seafood.  I highly recommend to check it out if you have a craving for Asian and your in the West Kendall Area ( Bird road west of turnpike and 127 ave).  I've had everything from the Sushi, rice and ramen noodles, it's all good.  You just have to remember it's a small mom/pop restaurant so sometimes they are slow especially if there are a few people there but it's well worth the wait!."], ["Chili P.", "No longer able to sit \"tatami\" style. Menu is much smaller and the fare is not what it once was."], ["Erika S.", "Great, fresh seafood without the craziness of the more popular franchise options! You can't go wrong with anything here!! Their egg drop soup and avocado salad are some of my faves. Kids love this place too, especially since they can sit on the floor and take off their shoes :)"], ["Odalys M.", "A little gem and very close to home.  We love their sushi rolls and their fried rice is the best in town.   The kids love the little section they have where you can sit on the mats.  Love this place."], ["Christina A.", "This is by far the BEST sushi I've ever had (and I've been eating sushi since I was 7 ) in Miami.  I've brought all my friends and family here and they all fall in love with the food. It truly is a hidden gem."], ["Jerrold O.", "Yay, me! A find in west, Westchester. All categories met or exceeded -and fun (70's) music, too!"], ["Debbie A.", "I really love this place! It has a very cozy and family friendly environment. Our waitress was very patient with us since this restaurant has Chinese, Thai and sushi! So it was hard to choose what to eat! We ordered an egg roll, special fried rice, hot and sour soup, and sweet and sour chicken.  The Thai tea was delicious! Everything was made fresh and it tasted amazing! Im definitely coming back!"], ["Liz C.", "Outstanding food and service. We had the crunchy tuna roll and dragon roll. The service was fast and very friendly.   Left very satisfied."], ["Luis C.", "Besides the obvious (great food), there is something about this place.... Very cozy and family oriented, I love it.Great chefs, friendly waiters and overall a great place."], ["Hany G.", "What an amazing little place. I've been coming to this restaurant for like a year now and what delicious good every single time. No disappointment. Very consistent like I said. You can't go wrong with any plate you order, literally. The place is family own and they are very nice and helpful people; extremely sweet. The food quality cannot be compare to this expensive sushi place; it's way better than other pricy place. Their crab is real crab meat not synthetic like most chick places. You have to try their Thai donuts, millennium roll, shrimp shumai, Florida Panther roll, amazing roll, any of their appetizers, their fried rice, etc. Give it a try, you won't regret it!!!"], ["C R.", "Good quality sushi/sashimi, very fresh. Customer service is very good. Will go back because it's the closest quality sushi place to my house. I also like that they are open late during the week. If it's late and you want something lite this is one if the few options in the neighborhood and they don't make you feel bad when you walk in late and there is no one there and they still give you high quality fresh food. I only wish they were open on Mondays."], ["Mary A.", "I had the lemongrass soup and the pad Thai. The food was great! It was flavorful and fresh. The staff was really friendly and the restaurant seemed clean. I can't wait to try other dishes."], ["Sasha F.", "LOVE LOVE LOVE!!!!! my favorite sushi spot. I love the service and how quick they are. My husband and I order from here all the time. Great price also. I just love this place."], ["Lauren Q.", "I've lived in the area for years and have driven by this whole in the wall countless times, but thanks to Yelp we ate there tonight. Our fellow Yelpers did not disappoint. The \"Awesome Roll\" was well- awesome but my husband and I both l agree that the Florida Gator Roll was the better choice. We also tried the pad Thai and it was very tasty. I am giving this restaurant 4 stars because for me the price per roll was a little ridiculous at about $14/ roll. The sushi was good but at that price we probably won't be regulars."], ["Keith P.", "This place is a treasure trove of authentic Vietnamese, Chinese, and Japanese cuisine rolled into one.My journey here took place because my friend and I needed a new place to satisfy her pad thai cravings, so we just hopped onto Yelp, entered a search, and saw this review boasting  4.5 stars. Let me tell you that it is hard to hold a 4.5 star ranking, especially with over 30 reviews, so my friend and I felt the urge to hop into her Corolla and drive here for dinner. What did we have to lose? We found out that the restaurant was located at the shopping center we also pass by on our way to the Turnpike, so as we parked, we wondered if we really wanted to eat here.Good thing we didn't listen to our instincts because although this place is located at a really random shopping center, the service is on-point, and the food is delicious. The servers welcomed us and sat us at the best seat available. They always made sure that we were satisfied and that our water glasses were always filled to the brim. I felt like a part of their family.For dinner, I ordered their duck pho. The meat was tender. The vegetables were aplenty. The soup was flavorful, and the noodles were the right portion. For those who don't know, pho is my favorite Vietnamese dish ever. It's a popular street dish in Vietnam that consists of broth, noodles, and meat. They give you a huge plate of veggies, and you can stick as much greens as you want. At Kam Wah, they offer you authentic and fresh veggies. Also, the sauces that are on the table are spicy, so beware because after a few pinches of chili pepper and a few drops of red sauce, your food might be unable to eat, but if you like spice go ahead! It is delicious and a culinary experience, after all.My friend ordered appetizers of pad thai and gyoza which were done in only 10 minutes. I wish they had brought everything together at once because they brought my food 10 minutes afterwards, and by the time I had my food, my friend was done. FYI, their appetizers looked good, taste good, and come in good portions.Overall, I would highly recommend anyone to eat here. Their prices are affordable (my pho was only $12), and everything is delicious."]], "Siam Rice Thai & Sushi Restaurant": [], "Atchana's East West Kitchen": [["Elissa M.", "Love this restaurant.Nice decor-checkLovely view of the pool area surrounded by palms.-checkQuiet-checkGreat service-checkAnd the food is absolutely delicious!All the boxes are checked for a wonderful experience.We've been for lunch twice, and can't wait to go back again.I don't know where her egg roll skins come from, but she should patent the recipe."], ["Carolyn B.", "I had the volcano shrimp. (20 Mar 2015)Shrimp laying on top of steamed veggies with rice on the side. Average shrimp and chili sauce out of the bootle (could have made at home). Veggies were cold and brown rice not cooked (still picking my teeth from raw rice). Ate poolside and great ambiance. Spouse had snapper which he loved. Not many people there which is typical of hotel restaurants. Slow delivery of food but with our group it did matter."], ["Gloria T.", "Atmosphere goodOnly one waiter, very niceBreakfast cold. Scramble Eggs with  cheese means to have a cold american cheese slide on top of cold eggs, no melting point at all.   Breakfast for 2 around $54.00"], ["Alfredo H.", "Where do I begin, the chili fish had about 2 bites of meat it must have been an Ethiopian variety, the fried rice had absolutely no flavor and the Pad tai was horrible. Only good thing was the egg rolls. You can find better thai food at Taco Bell. Horrible Horrible Horrible !!!!!!!!!!!!!!"], ["Jen B.", "I held  my wedding rehearsal dinner at the Mutiny hotel and catered by Atchana's kitchen and it was so lovely. Delicious and authentic Thai food! The buffet was set poolside and we had about 30 people there. Everyone in my party raved about how delicious it was. We had the pad Thai, teriyaki chicken, fish curry, white rice and egg rolls. The setting was great for our post rehearsal dinner. A private area with great food in a great location. We were staying at the Mutiny for my wedding at the Women's Club. The scenery around the pool was great. The hotel guests are very respectful of your event. There's a lovely waterfall and just a lovely place to host an event outside. Atchana and her team provided excellent service. There is a restaurant inside the hotel. I definitely recommend trying this place for delicious Asian cuisine."], ["Chris M.", "Hung out here early Saturday evening to meet up with friends who wanted to take a quick dip in the pool, the restaurant serves the Mutiny Hotel and Residences as well.Friendly bartender made a great John Daly - Arnold Palmer with half vodka."], ["Sarah P.", "Great little secret at the Munity hotel. They have the best Thai yellow curry in town. And if you happen to go there for breakfast, the Thai donuts are to die for!!  Many other items on the menu are delicious like their dumplings and pad thai and if you are lucky enough, Atchana herself might serve you."], ["John S.", "First off, this is a tiny restaurant in the hotel Mutiny.  Normally I wouldn't eat at a hotel restaurant, but the Yelp reviews were good so we risked it.Our native Chinese waiter spoke fluent Spanish.  Just an aside--I thought it indicative of how multi-cultural Miami has become.We had two appetizers: egg roll and spring roll.  They were both good.  For dinner I had Chicken Pad Thai.  It was fine, and prepared as ordered.  The highlight of the meal was the yellow curry.  It was delicious.  Definitely makes it worth going back.They have a full bar, but only bottle beer."], ["Fernando A.", "The food and drinks are terrific.  The customer service is great. Nice ambiance to top it off."], ["Dan R.", "I was told by a co-worker that this place was really good.  I decided to check it out with a friend and was pretty disappointed.  I came on a Friday night expecting a quick dinner around 8 o'clock and there was only one waiter serving the entire inside and outside eating areas.  After waiting for menus for awhile we put in drinks and appetizer order immediately.  It took awhile to get the drinks..I'm actually just gonna rate the food because the server was nice, just they were completely understaffed. We ordered:1.Dumplings-weird texture, almost like a meatball. Not good.2.Steak Satay-really good. Great presentation-comes with alittle grill with flames to cook.3. Pad Thai- eh...not the best. And for $15 it was a small portion. Will not be back."], ["Brenda W.", "I guess this is the source of all room service and drinks for the totally mediocre and almost defunct Mutiny hotel. So when I call at 9:55 to order a drink for pick up and I'm told they randomly decided to close early at 9:30 (instead of 10)  find it pretty annoying. We've had a beef curry hereon a different night that was decent but nothing special. This review is more on the Mutiny and their lack of acceptable service than it is on Atchana. But when an entire hotel depends on your room service and bar it's really lame to close early."], ["Samaa M.", "Great service, pretty good food, and lovely, casual setting.We got:Egg rolls- great!Edamame- well cooked, but lightly seasoned.Pad Woonsen- fantastic, get it!Pad Thai- Just ok.Vegetable (or Yellow Chicken) Curry- great sauce! Worth it.Vegetable fried rice- Just ok.Overall, good place which isn't over-priced. Good for a causal day out with friends or family."], ["Patrick R.", "I recently ate lunch here with a friend. This place is really an outdoor dining experience. The inside is small and very hotel bar like. When you step outside to the pool deck you get to bask in the warm Miami sun, take in the beautiful koi pond, and catch a glimpse of the boats in the bay across the street (I sat up next to the koi pond). My food was good. I ordered the volcanic tofu with white rice. Deliciously fried tofu in a hot sauce and a nice (albeit soggy) pile of rice. My only grip about the food was it was pricey at $13 for rice and tofu. The service was a bit inconsistent but it was too beautiful of a day to get upset about it. It was little things like a refill on the water or asking for a condiment that never came. I imagined the kitchen was busy because they were hosting some banquet/meeting. To their credit they made it right but offering a complimentary coffee/tea at the end so I'm not holding a grudge.If you're staying at the hotel, check out this place."], ["Tiffany K.", "On a recent trip in Miami, I stayed at the Mutiny Hotel, which houses Atchana's East West Kitchen. We decided to have breakfast here one morning since it was in our hotel, and was a convenient choice. The atmosphere and setup of the restaurant is something I liked a lot - simple, clean, semi upscale, overlooking the hotel's pool. The food here is expensive, but what can you expect when dining in a hotel. Most of us ordered breakfast, which ended up being very good. I ordered the omelet and I liked that you could choose as many toppings as you liked. Also, the breakfast plates were presented very nicely - it's rare that I get my eggs and hash browns so neatly and visually pleasing. One of my friend's did get fried rice, which is more relative to their Thai cuisine. I didn't get to try it, but she loved it.The only complaint we had towards the restaurant was the service. When we got down to the restaurant, there was only one person on staff. We stood at the front of the restaurant, and finally a couple minutes later, she popped out and told us to just grab some menus and sit down. After sitting, it took her awhile to come get our drink orders, and then even longer after that to take our food order. The entire time, she wasn't necessarily rude, but definitely not nice. We were shocked at the service considering we were the only table seated the entire duration that we dined."], ["Eric H.", "Very good, we really like the server Zeus. The spring rolls were incredible, second only to the Little Bee in Asheville. Massamon curry was incredible like Thai Beef Pot Roast in a Coconut sauce. The poolside atmosphere was quite lovely, except for the occasional smoker coming out to foul the air. Interior ambiance wasn't quite as nice, so we're glad we made our decision to dine poolside. Chicken Satay was tasty, but a bit overpriced. We will return on our next trip this way."], ["Vania K.", "This is a small restaurant inside the Mutiny hotel. It is very quiet and has most of it's seating in the bar area (looks like a full bar) and two tables that seat about 5 or 6 just behind the bar area that is more quiet. We were offered seating outside, which is next to the pool, with several more tables, however, we chose to sit inside. There was only one waiter, who I assume doubles as bartender as well. He was very nice and courteous the whole evening...inquiring if we needed service or time, but not too pushy. The food is more Thai than Asian fusion, but has choices like edamame and steamed dumplings as appetizers. The decor is minimal inside, with a bit of Thai flavor outside. We ordered the steam dumplings ($7) to start and a pad woonsen and massaman curry with beef as entrees. The entrees ranged from about $12 to $28 for a chili snapper. Our dishes were about $15 each. The food was good, not over the moon, but definitely good enough to come back, especially with a nice waiter, quiet atmosphere, and reasonable prices."], ["M M.", "If there was an option for no stars, this place would get it. I came here for lunch, and I should've ran out the door when I saw that I was the only one in the restaurant. There was no hostess to greet me. The one waiter on staff awkwardly told me to pick up a menu myself and to sit anywhere. This was strike 1. I sat outside in their outdoor patio. I ordered the steamed chicken dumplings to start, but 2 of the dumplings were ice cold inside. Strike 2. After I finished my lunch and having waited for a good 20 minutes for the lone waiter to come back (granted I was the only one eating there), I actually got up and brought my own plate of leftovers inside to the waiter and asked for my check. Strike 3. I'm not really sure why this place got a lot of positive reviews. The pad thai was mediocre and the spring rolls tasted like they were sitting in the freezer for some time. I've had better food and service at my local McDonald's, and I'm not exaggerating."], ["Tony G.", "They understand the words \"Thai spicy.\"  Best Thai food I've had so far in Miami.  To establish a little ethos, I've recently been to Thailand.  Love the quietness of the restaurant and friendly wait staff too."], ["Sandeep V.", "So after a long discussion of the usual  \"where to eat/what do we feel like eating\", me and my friends who are a couple living at a walking distance to this place (which I envy now) decided to go there. The outside seating area is surely which catches your attention first, clam and serene with open skies and a pool. The menu is small/one paged but they did bring out a soup on my friends request which wasn't on the menu, so it might help to ask them if they serve additional things which are not on menu. I ordered the beef dish, my friends got the yellow chicken and thai noodles. I ate mine and tried their dishes and WOW....I mean WOW ..like \"where have you been all my life\" kind of wow. Even the way rice was served in a common bowl to share was impressive. I think this place is definitely worth a shot if  a)You like food and b)you can get to coconut grove. It may see a little pricey but it wont be after you leave with a content heart. I hope this place stays as it is. Best Thai food till date in Miami."], ["Dino R.", "The food and service at Atchana's is fantastic! A definite must if you love great Thai cuisine. It's located at the beautiful Mutiny Hotel in Coconut Grove and sits right by the pool. The staff often host events that I've had the pleasure in attending. Best part is prices are reasonable. If you would like to sample their menu, head on out to Taste Of The Grove food festival today. Atchana's is one of the participating restaurants. Enjoy!"]], "Cake Thai Kitchen": [["Bev M.", "If you walk by Cake Thai Kitchen on an average night, chances are that you'll see people at tables, licking their fingers and moaning appreciatively. (This is Miami, but rest assured - Bang Bros. is not filming.) You're just witnessing the near-orgiastic delight of Miamians who have discovered Cake Thai Kitchen -  the best little hole-in-the-wall since Jacalito Taqueria. And because it's a hole-in-the-wall, you'll need to overlook several things: The circa 1976 air-conditioner, which barely cools the place, and drips on you as you walk in. The cheap-fluorescent lighting that highlights your clogged pores as you stare into the mirrored walls like you're in a fucked up horror funhouse. The decidedly eco-unfriendly styrofoam serving plates. The sacrilege of paying an extra $2 for white rice. The spotty-at-times service. But if you're willing to overlook all those things, whooo mama. You're in for a fucking feast. In my humble opinion (on which you should absolutely place an inordinate amount of weight, only because I'm one of like, 10 Asian people in Miami), the Baby Back Ribs with Crispy Garlic Pepper is Cake's crown jewel. It comes out perfectly seared on the outside, and is beautifully seasoned with (what else) garlic, pepper, and probably crack.  I'll make it even easier for you guys - it's No. 45 on the menu. See how nice I am?Other notable dishes include their Garlic Cabbage with its delicate balance of sweetness and umami; their Five Spice Rice Noodle Spicy Beef Flank Soup (also the name of Dumbfoundead's next hit single); and for those of you who were born unadventurous and just want the mac-and-cheese of Thai food, their Prawn Pad Thai will convince you to give up your first-born.Note:  Cake does not serve beer or liquor, but all is not lost. Two doors down, there's a little-ass craft beer brewery/store, run by a little-ass guy who is almost psychic in his beer recommendations. You can buy a single beer (or five, natch) and take it with you to Cake.In closing, this place is the shit. My only fear is that Cake will soon win a New Times award (if they haven't already), and move away from my 'hood and into Wynwood, the better to be overrun by hipsters on their way home from an Urban Outfitters shopping binge. (Don't worry, Cake. If you relocate, I'll still love you forever and ever. I'll just slightly resent your treacherous ass for leaving me alone with no good Thai food.)"], ["Kapture K.", "Food was amazing! Very small quaint dining area, service was awesome and professionalwill definitely be back!!"], ["Henry A.", "NPS = 10!Hands down best Thai in Miami!This shop is small and unpretentious.  The pad Thai?  Second to none.  Just make sure not to order it too spicy if you can't handle the heat!I don't think this place holds more than 15 people...  And that's one of the things I love about it.  Big things come in small packages.It is run by one of the nicest people you will ever meet and her son.  As I spoke to the owner, she mentioned that one of hardest things is finding someone that cooks very authentic Thai.  That shows she takes tremendous pride in her product.I've had the grilled tiger shrimp with lemon grass as well and it's one of my favorite dishes.The flavors are just so fresh that they make your mouth experience something it never has before.Whenever I am craving Thai, this is where I go.  Definitely check it out!"], ["Jeff G.", "I should start my review with biggest complaint because the food here is very good, but, if I'm paying $12 for crispy pork belly I think it wouldn't be too much to ask that it comes with a side of white rice to make it a meal.That being said, the crispy pork belly was hands down one of the best things I've tried here so far, the portion is quite small just so you know.Everything I've tried here so far has been really good to great, so don't let the location turn you off to trying it. Also don't confuse it with the Thai place literally next door which serves decent Thai as well but I think this place takes the Cake."], ["Sara H.", "OMG the best Thai food I've ever tasted and it's right around the corner. Get there, but don't expect super fast service. It's about chatting with the people at the table next to you and gosh darn good eats."], ["Bill B.", "Great little Thai place. There calamari was awesome! Super tender and in a great broth. As a note, they have no bathroom on premises."], ["Patrick H.", "Very disappointed after reading the slew of positive reviews and experiences this restaurant has. Everything from the experience to the food was a big swing and a miss. We went on a Friday night with a group of five people. Not too big of a group, you might think, but upon arrival, and realizing how small the place was, and seeing how packed it was, we decided, ok, we'll just get it to go and eat it at home. My girlfriend and I ordered Tom Kha chicken soup, pineapple fried rice and tiger prawn pad Thai. We were told 20 minutes, which is a perfectly acceptable waiting period. Minimum, it was 45 minutes, but I'm fairly certain it was closer to an hour. No, I never complained once, because I don't like to complain to people preparing my food. If we hadn't already paid for the food, we absolutely would have just left and gone somewhere else. Look, I know you want my business and you don't want me to go somewhere else, but if you're honest and tell me \"Look, just so you know, we're super busy and backed up, so it will be like an hour for your take out order,\" not only am I going to be impressed and appreciative you warned me, but the allure and desire to come back and try this in demand food becomes even higher. Finally getting our food home, the disappointment didn't stop.  First off, ALL of the food was lukewarm, making me question how long it sat around before we even picked it up and took it home. The Tom Kha soup was super acidic. The pineapple fried rice was not bad, besides just being tepid. But, the tiger prawn pad Thai was pretty unappealing. It came out of the container congealed together in big clumps, like it just came out of the refrigerator. The noodles were crunchy. I was nervous to even eat the shrimp at that point, but as it had been about 10 hours since I last ate, and my stomach was caving in on itself like a dying star, I inhaled everything before my brain could process how unappetizing the food actually was. You burned me, Cake Thai Kitchen. And not with your food's temperature or spiciness. With your false promises and lack of apologies for the insanely long wait. I'll never be back, and would much rather make the trek to Kendall to Rock A Bangkok, the best Thai in Miami."], ["Cassandra E.", "3 Food3 Customer Service4 Cleanliness3 AmbianceIn and out take out. I had Pad Thai (with tofu, which for some reason wasn't on the menu). I ordered Tom Kha Soup (with Chicken) for the bear (my boyfriend) along with beef in green curry. The food was okay, I ate it because I was hungry, not because it was out of this world. I'm not sure if I would come again. I had a few sips of the Tom Kha Soup and it had so many bones and lemon grass stalks in it that I could barely see any edible chicken or mushrooms that were supposed to be there. It was not the best Tom Kha I've had...The food preparation was quick. Once the delivery girl that got an attitude with me every time I asked a question about the menu left, the short wait was bearable and the restaurant seemed okay. There are not many seats inside, so my suggestion would be grab take out instead, especially if you have a big group."], ["Mariauxy C.", "Been meaning to eat at this place since its opening. Finally today we ordered and was amazed by the flavors of the three items we ordered. The Crispy Pork Belly and Chinese Broccoli was just right with the flavors of chili, garlic and oyster sauce. We ordered the plain padthai which was just simple enough to accompany the dishes we ordered. Our other dish was the Spicy Pork Shoulder and Roasted Rice, unfortunately we did not get the rice instead cabbage. The  lime and cilantro in the pork gave us a ceviche like taste. We really enjoyed our food and will definitely return to this little joint in the hood."], ["Andres S.", "Food is 5 stars, very authentic and creative Environment is very simple, not a first date place for sure; no bathroom in the restaurant (is that even legal?) We had pineapple fried rice, Green papaya salad, a shrimp dish and somn else.... Outstanding"], ["Melissa M.", "Long wait but the food is so good and authentic it's well worth it!  I am a addict. Love the papaya salad. This place is a must!"], ["Annaleah K.", "Oh cake.  I have to agree with my friend.  If you had just been honest and said its going to be a long wait instead of 20 mins we could have A. sat at the bar at the home brew place a few doors down (see that review) and gotten so tipsy we wouldn't have noticed it took over an hour B. Grabbed a table at Sushi Siam, also a couple of doors down and with enough seats for 5 and vowed to come back later.  I will say it was kind of our bad for listening to our friend who had eaten there before and failed to acknowledge that cake is more of a two and three seater affair.  Take out seemed like a good idea instead but we weren't the only ones waiting.  It's a typical take out set up but doesn't appear to be prepared for a high volume of orders.  Prices were fair, delivery is 3 bucks but when you get your noodle dish, it's going to come out of the tin like it's been in the fridge overnight; all stuck together.  I don't suggest the pad Thai tiger prawn but the pineapple rice was ok. Also, to the guy who told us we must get the soup. No. No we shouldn't. It was incredibly lemony and we didn't take more than a couple of spoonfuls before we said no more.  And we were starving by the time the food was up.  Seriously, we made a pact that night.  When the best Taco Bell in town is right there on 79th street, just go there.  In the end I have only myself to blame for this experience.  A Miami New Times review was taped to the window, which should have been my first clue that I should skip it.  Sorry MNT, but you guys ruin everything."], ["Gillian B.", "Best Thai food I've had since Thailand! If you want to feel like you're eating authentic Thai, COME HERE! From the outside it's not much to look at but I promise, once you taste the delicious food inside, you'll be back!"], ["Tiffany C.", "Came back for some take out and to try something new, I had the roasted chili paste squid with homemade salty egg. I enjoyed the mixture of flavors that this dish brought, salty with a touch of sweetness in the sauce and the salty egg wasn't overpowering which was one thing I was afraid of. The egg was pickled for the right amount of time. The chef was apologetic for the pad thai from my first visit and wanted me to try the pad thai again, he wasn't working in the kitchen the first time I went. I'm very satisfied with this Pad Thai it was flavorful and had the ground peanuts, something that was lacking with my first visit. Definitely give this place a try"], ["Gillian H.", "After waiting 1hr 30mins for the delivery. It arrived cold, under cooked and chewy.The only decent part was the sweetened condensed milk in a small container. The Baby Back Rib Crispy Garlic Pepper were chewy but not crispy and slightly undercooked. The southern style chicken was cold and greasy. The thai donuts were chewy. Definitely don't order delivery."], ["Ana T.", "Cake Thai is a hidden gem. The facade of the building does not inspire you go in but trust me once you do you can't stop coming back. I have tried the prawn pad thai and  musamum chicken, both are amazing! Only downside is they sell-out a lot and the wait times are sometimes excessive. For such a good thai kitchen can someone please invest some cash on bringing the services up to par with food. I recommend this place for take-out."], ["Melanie G.", "I'm no expert on what \"authentic Thai food\" should taste like... but this shit IS GOOOOOOD. As fuhh.I had the pork belly with basil and I just couldn't stop eating. I had told myself I would only eat half and save the rest for later, but no. I ate it all. I had to. It was not too fatty and the flavors and seasoning were absolutely delicious. Every bite tasted like a hot treasure in my mouth. I don't even know what that means. I also ordered the Thai omelet and rice (I added pork) out of curiosity. I'm not sure if its supposed to be that way, but the eggs were VERY salty. Also, they forgot the pork (but still charged me for it).If you do order the pork belly, I would recommend ordering a side or rice. I used mine from the omelet and it tasted so much better.Will def be eating here again."], ["Fred L.", "Finally the best authentic Thai Restaurant in America! The son is the head chef and his mother handles customer service. The son's name is Cake, so voila!They only opened in September 2014 and I know they will get bigger! Every dish has fresh ingredients. For example, their sauces are made from scratch using tamarind, the basil, chili and other rubs make it into their dishes that bring you back to Bangkok. Forget every Thai restaurant you've been in Miami. This is a tiny place so don't expect any seating for more than 15! They say the best food come from hole in the wall type places. Cake is no exception.I loved their pad Thai, and Pork Belly dish, Tom Yum...choose something from The Wok. They're all Delish!After your meal, the taste lingers on. There's no MSG used.You can also ask other dishes to be made that is not listed on the menu. For instance, bring any meat or fish and ask them to make you something. You'll be blown away with their home feel customer service!This is the passion, expertise and craft of CAKE - a honest to goodness chef that will cook the best ever Thai food and leave you an impression to go back every day!"], ["Joel C.", "If you love authentic Thai food then Cake is the place for you! Drove at least 40 miles to try them out and it was well worth it. My cousin and I ordered the Crab rice which had chunks of REAL CRAB which surprised me because I was expecting imitation crab. I also ordered ribeye which was grilled to perfection. The food was amazing, and the waitress was very patient and kind. Definitely making another trip to Cake."], ["Dahlia P.", "The best Thai food in Miami, and the most authentic one, every time I visit I so great full for having this place that I wish they will never close.I go there always with my friend Tami which lived in Bangkok for three years and knows what to order and how it should test, amazing to make a long story short , just make sure you do not show up on Tuesday, the place is close. Trust me it's the best on this side of the world."]], "East Thai & Noodle House": [["Susan S.", "Found this gem while shopping at another store in the shopping center. It's a tiny place but the portions are large and everything is cooked fresh so it takes time and  you need patients.  Usually Thai salad is made with iceberg lettuce but here at East Thai & Noodle, they use Spring Mix for their salad which was a pleasant surprise.  I had the Basil Sauce w/ tofu, green beans, peppers, onions and a chili sauce and my companion had the Pad Kee Mow. Veggies were done to perfection and and no grease. I can't wait to go back here again."], ["Nina K.", "I have been a big fan of Origin for years and when i heard about this restaurant I was so happy as I work very close. The food is awesome and the service is great. The owners are very nice and super friendly! This is a great neighborhood restaurant. Casual and cozy. Plus they deliver!!! A few of the items that I recommend are Hor mok, tom kah soup, roti, thai wraps, and many more. You just have to go and try them all!!!!"], ["judy b.", "was trolling hollywood nails and noticed the noodle house next door. we decided to have lunch there. ordered a pad thai to go for husband and my sister and i sat for lunch. i ordered the pad ke mow with chicken and it was delicious. my sister got a veggie dish with tofu that was outstanding. everything is fresh (and takes a while so be patient) and the people are very sweet and accommodating. highly recommend for take out. not sure they serve alcohol. i forgot to look. enjoy!"], ["Luis A.", "A bit pricey for asian street food. limited menu. any banh mi, char kway teo, curry laksa or prawn mee ?  a happy hour with reduced price on bar food  can be an attractive feature?  ( local brews pls. )"], ["Carola C.", "Do NOT order for delivery!  Waited for 1 hour and 1/2 and it was not worth it at all.  The pad thai, not good."], ["Hannah R.", "This place is small, but food is good. Pork dumplings were good and the glass noodles. The servers were very friendly. Only downside was we waited a bit long for our food, but it was pretty close to closing time, so that could explain that. Definitely worth a visit"], ["Colleen J.", "awesome family run restaurant. The chicken curry, chicken lo mein  and the cheese cake tempura was delicious.  We  will definitely be going back."], ["Marilus S.", "Food is excellent.  I had two noodle dishes.  Wonton soup was delicious and noodle dishes were made to order.  Service was good.  Great green tea"]], "Doral Thai Restaurant": [["Melvin M.", "Had the pad thai, it was pretty solid. It's good to know that the Doral Special menu is obsolete on weekends, so you have to order something else on those days.Staff is very friendly and my to-go order took less than 10 minutes."], ["Ximena G.", "This place is a sweet spot for Thai lovers! I was super impressed with the Tom Yum Noodle soup. My boyfriend ordered #106 - can't remember the name but the server told us it was a Thai favorite amongst Thai people. It had basil and onions and he ordered his with shrimp - the sauce was delicious with such herbal sweetness that delicately danced on your tongue! I will definitely be back and excited to try the one of the curries that everyone raves about!"], ["Christa R.", "We enjoyed the pad thai and chicken masaman curry. My boyfriend said the pad thai was authentic in taste and texture, I thought it was really good and the masaman curry was deliciously creamy and flavorful, nice chunks of avocado and I enjoyed the cashews and potato too. We couldn't stop eating it, soooo good!"], ["Alex R.", "LunchThe good: this the best Thai restaurant anywhere in the area not mention the lunch is a great deal that comes with soup, egg roll and an entree for $10. Had the duck and red curry which was awesome! Medium spice is just enough, I like spicy food I feel like hot would be too much.The bad: the hole in the wall is always slammed, better get take out"], ["Pedro S.", "This place is great!! Delicious food fast service reasonably priced. This is by far the best restaurant I have been too since I was in Thailand.  Hell what else can I say this place is worth a visit."], ["Ch H.", "We come here often. They now offer a mango curry. Absolutely awesome. We crave this place am the time. Can't wait to come back. The lady who works/runs the place is very nice. 5 stars all the way."], ["Donna W.", "Small, clean, peaceful restaurant with friendly staff.  Service was fast and the food was fresh, hot, and delicious!  I ordered Green Curry Chicken from the Lunch Special Menu.  This included a Spring Roll, and cup of soup.  Everything was tasty!  I cannot complain at all and this is quickly becoming one of my favorite Thai spots for lunch!"], ["Nisha R.", "Pros: good food and good portions Cons: waitress didn't understand English and messed up the order; table was not clean"], ["James R.", "First time tried this place great food. I had the duck and it was delicious. I would come back again. Great service. I would recommend to anyone in the area"], ["Antonio G.", "Lunch on weekdays is a reasonable deal. You get a main dish with soup and a spring roll. The padthai is adequate. With tip this is a $12 lunch. Reasonable."], ["Barbie G.", "Love Delivery from this place, always fast & Fresh!"], ["Chariss A.", "The pad Thai here is to die for.. DELICIOUSSSSSSSS!!!!!!!!!!! I have dined in and recieved delivery. Both were always on point."], ["Betsy D.", "I had about an hour to kill this afternoon before having to go back to work. I walked in to an empty restaurant at around 5pm and was helped immediately. I ordered the Tom Kha Gai and the chicken pad Thai. Both dishes were delicious and the serving size for the pad Thai was huge! Will definitely be returning."], ["Peter H.", "Great place with awesome lunch specials! I highly recommend the chicken in green curry sauce. And the thai donuts are a must!"], ["Diana S.", "Lunch specials come with soup and egg roll. Pad Thai and masaman curry were very good. Definitely recommend."], ["Matt H.", "Best Thai food I've had in a long time. I got the panang curry with crispy duck and it was epic!"], ["Kay Corri A.", "I have only had delivery service and never been to the actual location,  but the food is delicious, delivery is fast and I'm always pleased when I order from here.   The duck, noodles and chicken massaman are amazing!!!"], ["Samara M.", "So I was in the the mood for Thai food while on vacation in Miami. I was staying at the hyatt place and food that this place was 3 minutes from the hotel. When we first arrived it looked closed even with a florescent open sign in the window.  Our waitress was pleasant and attentive so that definitely gained them a star. The menu however was set up like a round the way Chinese spot... you know what I mean \"A-12\" style lol. That was unappealing to me especially since you consider your establishment a restaurant. I ordered the curry puffs (curry sweet potatoes and chicken ) and the coconut shrimp. They both were decent but no prize item. All in all the food was filling but I won't be coming back."], ["Steven W.", "Ordered delivery through yelp to my hotel. Came to my room in about 40 minutes and was satisfied with the food. I got the dream sticks, pad thai, and beef teriyaki. The pad thai was very good as was the teriyaki - the dream sticks were so so. You wont be disappointed with this place."], ["Richard F.", "Food is decent. I typically measure Thai restaurants by their Red Curry and this place is okay for that. Not the worst but okay. Service is decent now. It used to be horrible. So somewhat improved."]], "Royal Thai Restaurant": [["Lincoln M.", "Found this place because of yelp, what can I say it's tasty and quick. I've been here twice in one week around 8 pm there's not many people here but don't let that be a deciding factor with regards to the food .... It excellent and the prices are not a wallet killer"], ["Michelle S.", "Second time here and it is definitely a great Thai find.  The Ginger chicken was delicious.  So is the cashew beef.  The staff is nice and attentive. A little pricey for location and ambiance but I'm willing to pay for the quality of the food."], ["Jose S.", "It's no a fancy place but it's very clean. The Pad Thai was exelent and they serve very fast. The lady who receive you was very nice but the sr who take the order not"], ["Richard L.", "The food is absolutely amazing and tastes very authentic at a very affordable price, and the hostess is an absolute joy to talk to. I highly recommend checking this place out for some good Thai food."], ["Julien A.", "Great Thai restaurant, they have the best pad Thai in town. Their drunken noodles with beef is also amazing"], ["Camille F.", "The food here is amazing, especially when it comes down to the vegetarian options, as a fellow vegetarian the spices are to die for. Mouth watering food trust me on that. The customer care, and service is just as great as the food the waiters are polite and kind, and always there when you need them."], ["Glenda C.", "This is one of my favorite Thai restaurants. The food is delicious. If you like the taste of homemade authentic food, you will love this place. My favorite is their pad thai and their cashew chicken. Their vegetable fried rice is delicious. The soup from their lunch special is the best. Their dinner specials are good too, they bring fried wonton, shrimp rolls an crispy noodles and they are delicious! They only have the specials during a certain time, which I don't remember. The place is in an old shopping center, but this is one of those places that has great food, and you don't need the atmosphere to make your experience great."], ["Heydy S.", "The food is pretty good, but service is slow and its a bit overpriced for what you get really"], ["Jorge M.", "I use to go here alot in 2000-2001 but i went recently and was not impressed at all. It was empty inside when we got there which was not a shocker. Service was ok but it could have been much better. Started off with some Tiger Tear Salad which was Blahhhhhhhhhh. Over seasoned and to much cilantro for my taste. We also tried a Shrimp Tempura Roll from the sushi bar and it was Blahhhhhh. The shrimp tasted like it was sitting around for awhile and didn't have to much flavor to it.Then i got the Pad Thai. I remembered the Pad Thai from back then I loved it but the one I got was Blahhhh as well. The noodles were greasy and shrimp tasted fishy. The best thing I got that night was the Thai dough nuts. Will go again in a later date to try again."], ["Mary M.", "This restaurant is like second home. Best ginger fish fillet and pad thai in Miami so far in half decade. Ever since the new management has taken over the overall experience has improved a lot. We highly recommend this place. For a peaceful dinner."], ["Alexis T.", "Best pad Thai I have had in Miami. Great for lunch."], ["Ikam A.", "Love this place. Fresh herbs and spices, great service, quaint decor. You can't go wrong.The seafood pad thai was great, and so was the garlic beef and the mixed vegetable beef. I haven't been here since 2001 before last night, and I am glad to see it has maintained its quality, if not improved. I think the decor was nicer now too. I used to always go there for lunch when I was a student, so maybe it was the lighting-- this was my first time during dinner, but it was great.I went with my husband and his kids to celebrate my stepson's birthday, and everyone was pleasantly pleased. Great meal. Definitely will revisit."], ["Mandy G.", "If you can find this restaurant tucked away in the upstairs of a plaza, I think you will find that you enjoy the quaint atmosphere. The staff is very accommodating and welcoming. I wasn't a huge fan of what I ordered. I had a tofu bowl with vegetables. The tofu had the right consistency, but lacked flavor. The vegetables were overcooked making it difficult for me to enjoy them. I didn't finish my meal and that never happens.My coworker ordered the sushi and she said it was delicious. I would be willing to go back to try some."], ["The F.", "Tried this place based on all the positive reviews. Liked the ambiance, it's a small mom & pop place tucked away on the 2nd floor of a no-name strip mall. Their service was really good, they would keep filling our water every few minutes. However, the food was just ok. I tried the Pad Thai, and it was cloyingly SWEET!!! Yuck. Haven't had sweet Pad Thai anywhere before. Not sure why others rated it so highly, I have definitely had better. Also tried their veg fried rice and was underwhelmed. Btw, I found it strange that they included a 15% tip to our tab for two. I would've prolly given a bigger tip, but whatever...So 3 stars for the food, an extra star just for their great service."], ["Claudia G.", "Not impressed with the infamous Pad Thai here, it was meh, bland not enough seasoning... A little bit more seafood would be nice, the service wasn't the best I had to wait 10 minutes until somebody asked me what I needed plus the order took forever... I'll be back to try the curries, hoping some of these reviews make sense to me."], ["Felix J.", "Friendly service, check. We went on a Saturday night and it was empty. Not only empty, but it was uncomfortably quiet. The food was good. Not mind-blowing or anything. I had high expectations of the Pad Thai and was disappointed. Weird taste and a bit diluted. Sushi rolls and Thai soups were very good. Being equidistant to another Thai restaurant I really like, I probably won't be returning."], ["Michael H.", "First time here but a really strong showing. The red curry lunch special was great and the 3 star spicy was just the right level for me. Like others have said the water is always full.  Only downside was that the lunch special only came with a small soup compared to some other places that add a spring roll or Thai salad.  Coming back next week for the Pad Thai!"], ["Jackie H.", "Honestly, if I wasn't yelping for a Thai place to eat I don't think I would've ever seen this place or even considered going here. Hidden away in the second floor of a plaza is this jewel of a restaurant. The decor is lovely inside, very Thai themed, and very clean. Service was awesome and the food was absolutely delicious.Their menu has tons to choose from, and I had a hard time choosing what I wanted to eat. I ended up getting a Tofu Pad Woon Sen (stir-fried cellophane noodles). I seriously couldn't put my fork down even though I was super full. I was also excited to see the stir-fry wasn't smothered in oil. Also, the fried tofu was awesome, some places over-cook the tofu, but this one was crispy on the outside and silky inside. The portions are large and I was stoked I got to take some home so I could eat the next day. My boyfriend got the Royal Thai Special Fried Rice which comes with chicken, pork, beef, shrimp, and plenty other goodies. He couldn't stop eating either, but the only reason I'm giving Royal Thai 4 stars instead of 5 is because of the fried rice. He asked for no pork (this wasn't the problem), but only got two shrimps in his dish. You'd think they make up for not having gotten pork, and it was pretty sad that he only got two shrimps when it's such a large portion. Regardless, I can't wait to go back and try their pad thai! I absolutely recommend going here."], ["Josh W.", "Came here for a late lunch (1:30ish) and had a great time. The food was excellent and full of flavor. I ordered the Basil sauce with beef and my girlfriend had the sweet and sour chicken. Both we're delicious. My only complaint was the portion of beef in my entree. Even for a lunch portion, a little more beef could have made this that much more enjoyable. Aside from the food, the staff was very attentive and kind. We will most certainly be returning in the future."], ["Claudia J.", "First time here, the place is defenitely hidden in a mall second floor.  Once you go in, bamboo smell, not my cup of tea there.  We ordered pad thai (since it was so popular among yelpers), masamang curry and a fresh salad with peanut sauce.  Service is ok, some waiters are very friendly, some are not... seems that this place is managed by a family business.  It is true, glass of water is always filled.  The salad came and it was a bit depressing... like there was no liveness in the plate, it was not inviting at all.  The curry was meh... chicken did not have any taste - and the sauce of the curry seemed too bland.  Pad thai flavor was ok, but presentation was not very inviting.Sorry Royal Thai, I'll stick to other Thai places..."]], "Lotus Garden": [["Scott W.", "Been eating here a long time. They were even open last major hurricane we had and thankfully had gas left to cook the food. One of the only places in town that was open. That always stuck with me and my family and we've been loyal customers for many years since.Great food and friendly laid back service that makes you feel welcome and at home."], ["Charlie S.", "Lotus Garden seems like a pretty solid neighborhood Thai place. It looked like we were the only diners who weren't regulars. Easy to see why - service was good, and the staff was very friendly and had a great rapport with the customers. My volcano chicken hit the spot. The chicken was crisply fried and the vegetables nicely cooked as well. Nothing soggy or too oily here. Though the flavors didn't blow me away, the taste was still pretty solid. I would have liked the dish to be sauced a little more evenly: some chicken pieces lacked the sweet chili sauce. I'd return here."], ["Jer R.", "This place is great! Best Asian food I've had in Miami. Hands down. The location is easy to get to. The service is friendly and nonintrusive. A friend of mine brought a few of us here as he had been here with his wife a few times. He ordered the king of the sea soup for our table and it was filled with seafood and the broth was spiced perfectly and very flavorful the seafood was not undercooked and made the meal more dynamic. Everyone enjoyed it without complaint. For the main dish I ordered shrimp Panang curry. It was quite good but there is one other location that I've been to that did the Panang a bit better. Nonetheless it may have been my fault as the spice scale here was different from other places and I may have ordered it too spicy. Either way, it was fresh and you could tell that the shrimp was fresh and they were of very good size unlike other places that you have to search for the shrimp. The vegetable that were mixed in were crunchy and not soggy and you could tell were prepared separately and not soaked in the curry which made them perfect. Finally the tea was delicious and didn't require any additive and made the meal perfect! Definitely recommend."], ["Patty D.", "Been coming here for years, and will always be my favorite Thai food spot! I live nearby so whether it's popping in or ordering take out this place never disappoints. The service and staff are incredibly friendly and always remember me when I come in! Their lunch specials are crazy good deals, and their dinner meals are nice and big. My favorite thing on the menu is the Lotus Garden Delight; try it, you will not regret it!"], ["Michelle M.", "Really great experience at lotus. The service was pretty amazing, very accommodating and flexible when we asked for chicken teriyaki! And even went out of their way to get crayons and coloring book for our daughter! Oh yeah and the food was delicious! Definitely get the chicken fried rice! The wonton soup had lobster in it and was a delicious flavor!! Volcano chicken also recommended! Really great place and we will def be back!!"], ["Davy H.", "Hands down the best place in town!!!! This is a spot that you can't over look family owned business quality of food is amazing a must try is the Tigers tear also there fried rice is awesome everything comes out like if your eating at home. I can truly say this is my spot!!"], ["Jiten S.", "Fantastic eat! Miraculously seated on Miami's famous Miracle Mile, the Lotus Garden offers an exquisite Thai experience in the Coral Gables area. I came here with a dynamic group of colleagues at the recommendation of a Thai connoisseur (thanks Luke).  Our taste preferences were diverse, yet none of us struggled to find our golden vegetable from the Garden.Upon arrival, one friend demanded a Sake bomb. A delicious Tokyo-style Saporo beer complemented a delicious hot sake to create an explosive celebratory treat. The service here was spectacular as our friendly waiters made a special effort to accommodate our exorbitant party. My adventurous palate led me to try the firy volcano chicken. These guys don't joke around when it comes to spice. A deliciously marinated batch of boneless chicken breasts was served with roasted vegetables and brown rice. This was a superb meal and, I will be back here very soon to explore more Of the offered Thai cuisine!"], ["Stacy L.", "I hail from northern California, land of authentic and well-spiced Asian foods from all cultures. So I was pretty damn pleased to find this gem hiding walking distance from my house, on the quiet end of Miracle Mile.The staff are super friendly to talk to, and the selection is GREAT for South Florida. I had a take-out order of yum nua, pad thai, curry, and tom yum soup. I requested that two of those four dishes be made extra, thai-spicy, and yaass did Lotus Garden deliver on that promise!Food was super flavorful, not greasy in the slightest, and I would definitely come back again. My only downside was the pricing. This was take-out for 2 adults, and it came to about $45. Maybe I have different expectations than most, but I am learning to adjust. And my belly is pleased."], ["Bobby R.", "Not a bad place on the mile. The food was great.  I ordered the volcano chicken! The chicken to veggie to rice ratio was on point! OH! Also, the sauce is amazing. and staff was extra friendly. Also, try their pad thai. Highlight of my evening was their THAI TEA! Probably the best Thai Tea I've ever had in my life."], ["Elaine Z.", "I've learned not to have too high of expectations for Thai food in Miami, but even then Lotus Garden hardly met them. The service was decent, but the portions were small and flavor lacking. Although my dish was quite spicier than I anticipated (chose Medium), the spice did not mask the obvious blandness of the rest of the food. Definitely not authentic and a bit overpriced."], ["Ben V.", "Maybe an off day for us? I thought my Massaman Curry was executed poorly. It just tasted over-spiced (in the worst possible way), and heavy handed on the \"safe spice\" aka Curry Powder. Lotus Garden is Boring, uninspired \"Thai\" at its best. Skip."], ["Cecilia C.", "Based on other reviewers' recommendation, we ordered the Volcano tofu, which turned out to be the failure of our dinner. Tofu was fried pretty dry, also flavorless. If fried tofu is not your thing, I suggest you skip it.  Other than that, we had Pad Thai, not very impressive but it was okay... And just a reminder.,Tom yung soup here is sourer than normal."], ["Tony R.", "I have eaten here many times and most of the time it is pretty good but today really fell short. I might point out that usually I order from the dinner menu but today got the lunch. Perhaps the lunch portions are different but I found the portions very small and more importantly the meal was boxed cold and even though I had a 2 minute walk it tasted like it just came out of the refrigerator and was microwaved for too short a time. It certainly was not made to order."], ["Gisela R.", "Great food, good size portions and affordable portions. I always order for take out! Try their chicken with red curry and their basil beef... both are delicious!"], ["Mickey L.", "Great reviews on yelp so I decided to check it out. Lowered my expectations from California over all was disappointed. Had the Volcanic tofu, the Tom Yum Goong, and the Pad Thai. The Volcanic tofu was the most disappointing. It was fried tofu really dry served with vegetables on a hot plate, really dry and flavorless. The Pad Thai was small proportion but decent. The Tom Yum Goong was really sour and small proportion. Looks like will have to find a real Thai place in Miami."], ["Nicole G.", "I will give one star for good service. The food had no flavor. We love eating THAI food and have had great Meals in New York, Cape Cod, west Hartford, & DC.  As the major metropolitan city that Miami is, we expected a delicious meal. The food was bland & the Pad Thai was just terrible. It was bitter & rubbery. Even the brown rice was served up just thrown in a bowl. A real disappointment."], ["Rohit M.", "Do try the Tom Yum soup .. It is flavorful and packed with fresh veggies. A real delight. We also tried the veg and the egg spring rolls and they were delicious. The sweet and sour sauce accompanying the spring rolls was perfect. The fried rice was the best we have had in a really long time. Overall I think this place is underrated on the miracle mile. The quality of food, the fresh ingredients and the flavors, should have ensured a long waiting queue outside. If you are vegetarian this place has an amazing variety. Do try"], ["Viviana F.", "I love this place, absolutely the best. Must tries- Pot Thai and Green Curry Seafood  Also the environment is great for any occasion. I feel Very relaxed when I'm there and satisfied when I leave."], ["Nicole W.", "This place was a pleasant surprise. When I walked-in, wasn't expecting much as the place looks a bit on the worn-down side. But looks can be deceiving.The red and green curry dishes were highly enjoyable. While not your traditional spicy dish, I highly enjoyed the curry which was on the sweeter side. My husband and I are Vegan and they were more than accommodating. I would gladly visit this place again next time in town."], ["edward b.", "This restaurant is awesome.Best broths I have ever tasted.  Nuff said..."], ["Ruben H.", "One of my favorite places to eat. I been coming here for years now and the food is always consistent. The owner is very friendly and the staff is great as well."], ["Liliana E.", "This is my favorite Thai restaurant in the Gables."], ["Christopher C.", "Ready many of the other reviews made me laugh and I could relate to some of their comments, but overall it was decent food.  It was not your traditional Thai restaurant with the normally delightful teak carvings and decorations.  The menu and ambiance seemed safe, un-intimidating for the Miami crowd that may be inexperienced with Thai food...actually I did not realize it was a Thai restaurant for about 5 minutes.  I enjoyed by Garlic Pepper Beef.  The beef was tender and tasted pretty good.  My Thai wife ordered the Ma Puu??? near the bottom of the menu (\"egg noodles\") which with mixed vegetables.  We were expected the typical flat clear noodles that you would find in Pad Kee Mow, ext., but she received Chinese yellow noodles.  So overall, good food and a fair price for this white guy, but my Thai wife did not care for it...depends how authentic you want it, I guess."], ["Audrey K.", "Great service.  Not sure if it was because I came when it was not as busy, but this was probably the best service I have ever had in Miami.  That says a lot.Amazing prices, portions, and good food.  Took home enough for 2-3 days of leftovers."], ["Stacy M.", "I would give 0 stars but that option is not available. DO NOT WASTE YOUR TIME. My girlfriends and I decided to celebrate one of our birthdays here and it was the worst decision ever! We arrived at approximately 12:05pm and left at 1:10pm WITHOUT FOOD. When we arrived, there was 1 other table with customers. We were a group of 7. We placed our food orders and waited and waited. Then waited some more until about 1:05pm. At that time, we asked what was taking so long because from the moment we arrived until then, more than 10 tables were seated and served!!! The waiter simply shrugged his shoulders at us in dismissal. At the point, we got up and left. My one and only previous experience at Lotus Garden was not a good one either. I had ordered the crispy duck and it was so crispy that I could've rubbed it together and made powder out of it. Aside from the ridiculous wait time to get your food, the service and attitude of the staff is truly PATHETIC. Again, DON'T WASTE YOUR TIME! CRAPPY FOOD AND WORSE SERVICE."], ["Alex S.", "I work in the Gables and this is one of my go to lunch spots. The service is great. The waiters are very attentive and they are always super fast which is very important for lunch. I absolutely love the garlic and black pepper shrimp. I have probably ordered that dish about 15 times over the years. Today, I decided to change it up and went with the Volcano Chicken. I can say that it is equally as fantastic. Try out Lotus Garden. You won't regret it."], ["K D.", "I enjoy frequenting this place because of their price point, good food and good service. When in the Gables, my mom and i always pop in for a quick lunch. The food has always been good. As a creature of habit, i order the red curry-- on point."], ["Nadelia C.", "I've been living in Miami practically my entire life and had unfortunately never visited Lotus Garden prior to last week.  My cousin invited us there and I thank her for it. She has been eating there for years and told me it is a family run establishment (I love those).  I found the owner and wait staff to be very attentive and inviting and definitely made us feel at home.  We had the Spring rolls and Squid Rings for appetizer and they were the best I've had of either of these two dishes...and I've dined out a lot.  For our meal I had the Green Curry and it was deliciously flavorful!  My husband had the Pad Thai and it was also delicious.  Although we were stuffed my cousin insisted on the thai doughnuts for dessert and boy was I happy she did.  They were to die for.  I cannot wait to go back!"], ["Claudia J.", "Hidden gem in Coral Gables, from the outside it does not seem like a good place.  Once you come in you will be greeted by the owner.  Nice simple set up for the tables, I could have not imagined the restaurant had so many tables!!  We were seated quickly, that was around 12:30pm, and suddenly people started trickling in... good we came in \"early\".  Although service is fast, just 2-3 servers including the owner for the whole restaurant!!We ordered a curry and a pad thai.  I will definitely stick to the curry.  Pad thai, mehhh.... ok.  Lunch specials include a soup or salad.  Tried the soup, aka congee!!  a bit light on my taste but I eat it on the heavy side, but the soup was still good, good flavor.  The curry was super yummi, I love that the sauce is a bit liquidy, so it's great to have with rice.  They offer white rice or brown rice.  The white rice is not of the best quality, but it is ok.  Service is very fast, by the time we finished and did some sobremesa, some people had left the place.  Also saw some people ordered the satay chicken, that little grill had super flames, but it did not burnt the chicken!! the chicken got a bit charred but it was fine!!Definitely come by if you are craving for Thai are your'e in the Gables.Best for last, the thai donuts THE BEST IN TOWN!! My hats off to these doughtnuts!! crunchy, small, bite size, just perfect to finish such great meal with these small sweet bites!!!"], ["Maria T.", "Great service, amazing food. Family owned. Get the hot pot if you are with friends and want awesome soup. Pad Thai and RedCurry are solid. Cheers!"], ["Laura Jill S.", "Happily another surprise gem in the Gables. I used to eat here when I was an omnivore who lived down the street. Now I'm a vegan who lives in South Beach, and without a car, it's rare that I get to the Gables. But when I'm there, I still want to eat (c'mon, I ALWAYS want to eat!).I was asking questions about the menu (as we vegans are known to do) and the server actually said to me, \"You tell me you're vegan, I'll make your meal vegan.\" That simple. He was knowledgeable and friendly and I had some delicious vegan spring rolls and a phenomenal veggie curry.I'm always on the lookout for places I can eat with my non-vegan friends where we can ALL be happy. Lotus Garden is definitely a winner on that list."], ["Kitty K.", "It's like eating Thai food in a morgue.Not sure the staff or the owner had a pulse.Had the curry,clear noodles and shared a bottle of wine. All very tastey and priced fair.Would recommend for take out ONLY!!! Unless you want severe awkward ambience provided by weirdos."], ["Jose V.", "Some of the best thai food in town.  Beef with string beans and chili paste is my personal favorite!"], ["Jordan K.", "We went for lunch.  Good lunch specials. We found it odd that the waiter (who seemed to know little about the menu) said the soup of the day was \"chicken noodle\".  The lotus garden shrimp was pretty good and the massaman curry was good but not great.  The fried rce was not great.  Overall our experience was average."], ["Roberto B.", "Prior to an evening at the theater (I feel so chic just writing that!) my companion treated me to dinner at this lovely little botique Thai restaurant that graces a small section of the Miracle Mile.  It is a lovely jewel in the crown of stellar eating establishments that the lucky Gables residents are privy to.  We opted to begin with the jumping shrimp; who knew that my sassy and sexy WASP gal pal could down those little creatures of the sea with basically the hottest sauce the restaurant could offer - volcanic doesn't begin to describe the heat.  I was still happy to see her smile and chomp on the fiery shrimp while I basically inhaled water and cried in the corner.  My entree was sauteed veggies and tofu over brown rice - medium heat, thank you very much!!  The additions of jalapenos, crushed peanuts and yes, more little mean chili peppers that meant business were an added delight - that i used SPARINGLY!  This place serves up fantastic, healthy and truly delicious food - and surprisingly without a big bite to your wallet.  I look forward to returning."], ["Candice M.", "The food here is at least a hundred times better than the slop they serve at Red Koi. So if you're trying to decide between the two, it's no contest. The only thing that would push my review to 5 stars is if they delivered. Picking up takeout on the Mile is never fun."], ["Brady Y.", "Pad Thai was waaay too sweet. Curry was too heavy and not particularly tasty. Service was weird. The main dude seemed simultaneously super bored but also like it was his first day. Three different employees asked us how we liked everything. It was kind of annoying to keep getting interrupted. Ambience was meh."], ["Shay L.", "Absolutely love this place! I have dined in so many times! The service is great, they are tentative to the guests, there has never been a problem with anything, food is always served to perfection! Love all the curry dishes, padthai, dumplings, sweet & sour soup.... Ohhh I could go on and on! It's wonderful and I highly recommend eating there!"], ["Nery B.", "I have always enjoyed this restaurant's food but the food is not what I want to write about. The food has always been consistently good. For years, I have been ordering takeout and I have no complaints. My first time dining in however left much to be desired. The restaurant was busier than I have ever seen it before when picking up takeout. We all made the same observation but we got a table right away. So far so good. The bus boy took our drink order promptly only to come back a few minutes later to announce they had no sake. Okay, a little disappointed but no big deal, we had a beer instead. Shortly after the drinks were delivered, the owner himself came to take our order. We ordered an appetizer, a soup, and three entrees. The appetizer and the soup took an hour to arrive. I asked the server twice about it and twice she said it would only be two minutes. Longest two minutes ever!!! In the meantime, we were not asked if we cared for another drink and water glasses were never refilled until asked. When the owner took my order, I asked for brown rice yet over an hour later and no sign of entrees, he came back to ask me again. Really? You took my order well over an hour ago and now you are going to ask me which type of rice I ordered? The food might be consistently good but the service and attention to detail is well below average. I will never eat here again but I will continue to order takeout. They should also think about redecorating. The space is dated and it really takes away from the experience. Dining out should be an extraordinary experience for all of the senses, not just taste."], ["Alexandra W.", "I've been coming here all my life...literally. Honestly, super friendly staff and the BEST Thai food you can find. Their red curry is the best. The cook is also extremely flexible with customizing your order so don't be afraid to ask!! Love love love this place!!"], ["Rachael H.", "I went last saturday evening. It was empty, only one other group there. The egg rolls were good. We had ordered the the spicy panang curry, and it was rather bland. Service was okay though."], ["Vanessa S.", "Craving: Pad ThaiLunch Time: 1 HourOff to the Lotus Garden I went with an empty belly and one heck of a craving. We entered this simply decorated restaurant right at noon and were only the second set of patrons. We were greeted by two friendly waiters and proceeded to check out the menu. Unfortunately they were out of a couple of items, but what I wanted was right there waiting to be ordered. I decided to try something new and went with Pad Thai with Squid. It was served hot, fresh and delectable! We finished the meal with an order of Thai Donuts straight from the fryer! They were topped with powdered sugar and tasted like heaven!! Craving Satisfied! Time frame met!"], ["Shaun P.", "I love this place.  Very laid back atmosphere, with great food and awesome service.IMO this is one of the better kept secrets on the mile.  There are usually a ton of tables, so I've never waited to be seated and I usually have my pick of the table I want.I have not had a dish there that I did not like.  The Pad Thai is wonderful, though I've been on a curry kick lately.  The massaman curry is on of the best I've had, but I usually get the panang.  I treated myself to the scallop curry once and that was great too!  I will say that they babied me a bit with the spice the first couple of times I went.  If you really like spice, make sure you tell them explicitly that you want it \"spicy\"; they will knock your socks off.  They are def cautious though.Last point; the service is phenomenal.  I love the \"pick whatever table you want\", \"we'll get you anything\", \"keep your glass full\", but won't constantly ask \"how's everything?\" vibe they got going.  Kind of bohemian with a dash of NYC.  I could see how it might turn some off but IMO it is perfect.Summary:  if you are near the mile and you like Thai it's worth a try.  Of you like spice make sure you tell them.  Great service..."], ["Paula E.", "Whiz and I went to get some dinner but when we got to the place we wanted to try it was closed. We drove around Miracle Mile and found this quaint little joint. When we walked in, to our surprise there were only 4 other people dining there. We sat by the fish tank which provided really good ambiance. The place is really cute, and all the tables have small bouquets of orchids (I think they were fake but looked real enough) and nice table cloths. We ordered a dish from the house specials; Volcano Tofu and some Sweet and Sour Tofu from the stir fry selection. Surprisingly enough the later was a lot tastier. The volcano dish seemed like it was going to have more pizazz but it ended up lacking in flavor and spices, but was still tasty. The veggies could've been cooked in the sauce also. All and all good experience, and people starting showing up more and more throughout the meal, I guess its a late dinner kind of place. The dishes were more than enough for the both of us, so think about sharing them. The service was very attentive, and the host/owner came by and checked on us many times.Overall, a 3.5."], ["Gustavo A. L.", "Location and easy access make this restaurant a top choice in Miracle Mile. The menu is simple and easy to understand and the integrity of the Thai food is preserved in the flavors and plates they serve. Service can certainly be improved, the owner will greet and serve but his non chalant attitude gives the impression that he is not quite happy to have you patronize his business. Their food is very good and well prepared and a major bonus for allowing you to ask for extra ingredients or change the level of spiciness. Good Thai place on the mile, possibly the best."], ["Meli G.", "I was craving pad thai last night, so I went on a search for a Thai restaurant close to Downtown/Gables/S.Miami areas and found Lotus Garden.  I had seen a pad thai Throwdown with Bobby Flay about a month ago and knew I would absolutely love this dish!  Unfortunately, my first Pad Thai experience was not what I was expecting.  The restaurant is very clean and the service was great, contrary to what I read by some of our fellow yelpers.  But aside from these positive aspects, I did something I rarely do...I returned the dish!(gasp!)  The beef was not good - it didn't smell or taste right, so the host/owner (not sure) who was very attentative and concerned , offered a shrimp pad thai instead.  The taste was much better and it had a nice flavor, but it wasn't what I thought it would be --- maybe I hyped it up too much.  Our other dishes - the fried wontons and pork satay skewers were good, and you can't really go wrong with Thai donuts, although they were a bit too crispy for my taste.  Overall, the restaurant has decent food and a nice atmosphere.  I would like to return and try other dishes, but in the mean time, I'll continue my quest to find the best Pad Thai in Miami.  I'll keep you posted!"], ["Pablo M.", "MAN I LOVE THIS PLACE!!!!  You can find me here often and the owner here is MAD COOL including his staff. Feels like I have paid there rent for a month. Most of the people that visit are regulars.  The ingrediants they use are top notch and always FRESH.  MY FAVORITES  VOLCANO CHICKEN OR SHRIMP AND THE GARLIC CHICKEN. GREAT PLACE FOR HEALTH NUTS and PEOPLE who love FRESH FOOD! . There FRIED DONUTS ARE AWESOME!  MUST HAVE! Could you do SIX or take on the DOZEN.  Those WHO KNOW ME KNOW WHAT I CAN DO!  The atmosphere is very nice and relax. I can't really think of anything negative I can say about the LOTUS GARDEN. What I can say is that you MUST CHECK IT OUT!!!!!!!!!!"], ["Alexandra P.", "Ordered food for two people for  pickup and got the same thing as I did last time I went (it's just that good)! Only took 15 minutes, and it was as good as it would be eating in. The host was super friendly and fast about me getting in and out. Love you, Lotus Garden! Yay!"], ["Whitney R.", "I did go to dinner with Paula E!  I usually do not venture into Coral Gables, but this was a somewhat pleasant surprise. The restaurant was unassuming and quaint, the service was great and speedy. We did order the Volcano Tofu and the Sweet and Sour Tofu. I thought the vegetables were slightly undercooked, and the sauce really lacked flavor. The tofu was fried, and the texture was okay, not great. I think if they spiced up their dishes it could be really good. I started the meal with a bowl of Tom Yom soup with shrimp and mushrooms, that was my favorite.Over all not to bad, but could be better. It came out to about $36."], ["Eduardo L.", "Went to Lotus Garden for the first time last weekend.  I have been searching for great Thai in Miami for years.  Somehow, I missed this place.  The food was amazing and very authentic.  The service was exceptional.  I will definately be a regular!"], ["Gregory S.", "Very poor food not that anyone here asked."], ["Ken J.", "Great food.  My friends and I usually splurge here for lunch. The food is always fresh and hot. I caution if you are going for lunch they will b a few minutes late to open. But once they do you will not b disappointed."], ["Michael S.", "The best Thai food in Miami. Everything is fresh. There are 12 fresh vegetables in the spring roll. The stocks for the soups are made from scratch. The owner and her mother are cooking in the kitchen. They just added some Vietnamese items to the menu, a different Pan Asian than typical. The prices are cheep and the portions are large and the place is really clean. The flavors are subtle but excellent. What more can you ask?? Want something special that is not on the menu or different than described, just ask. The other reviewers comments about the waiters can be true at times, usually when it is a little slow. But again, just ask...."], ["YY P.", "This is hands down THE BEST Thai restaurant in Miami. AMAZING PLACE FOR VEGETARIANS.Food: always fresh ingredients and the taste is always on point. All the curries taste very different and as do all the specialty dishes. Yom Tofu is a must have tofu dish and this place does it right.Service: excellent always speedy and you get unlimited white / brown rice.Location: Ideal its on Miracle Mile so there is so much to do or walk aroundParking: There is parking in front of the restaurant on Miracle Mile but sometimes its hard to find, but behind the restaurant there is a great and easily accessible parking garage."], ["Matthew G.", "Arrived at 8 p.m. on a Friday and there were plenty of open tables. Food was great (spring rolls, egg noodles with veggies, volcano chicken, tea, Thai beer), service was perfect, food came out quickly.Overall a nice atmosphere in a cool location for moderate pricing. My wife and I enjoyed it and definitely recommend."], ["Lindsey R.", "Overall this place is a joke - the people were rude, they got our order wrong, the food was cold and it tasted all wrong. The soup tasted like it had some type of cleaning product in it and all of the sauces were watery and completely devoid of flavor. This is NOT Thai food - it is simply a rip off."], ["Andrea W.", "The wife came home with take out, pad thai and thai doughnuts yes please! I could have used more peanuts tossed with the noodles but other that it lacked nothing. Plenty of chicken,shrimp, and pork. The egg mixed in was so freash and flavorful. The doughnuts was a hefty portion aswell and gladly included a second condensed milk since i always catch my wife with the saucer over her mouth trying to get every last drop, so everyone was happy."], ["Nicole H.", "I came here for TAKE OUT-five different dishes- 3 appetizers and two soups; GREAT. I enjoyed every single meal and so did everyone else. I feel though, like I have said before-other Thai places do it a bit better for less money- That's the only thing I find wrong with this place. I think they should try just a bit harder on the GENERAL Thai food. The coconut soup is AMAZING... I have it each time I go... The staff was friendly and efficient. The Steak in the pad Thai (I usually have it with chicken or shrimp) was grilled to perfection (I was worried it would be rubbery) IT WAS GREAT! The pad Thai lacked a bit of that flavor I look for... I always ask for it a bit spicy so I was expecting that spicy sweet combo and it fell a bit short...The Lime shrimp appetizer was great-perfectly grilled shrimp-lime flavor with that spicy bite. VERY GOOD! (I didn't share those-Selfish I know but, I ate them in the car on the way home) I don't share FOOD. :)"], ["Gigi R.", "Love coming here with my husband for Thai food. The food is really good and all their dishes are quite affordable.  Plenty of food is always served in every dish and the best thing is that you always get the option of having brown rice instead of white  for ABSOLUTELY NO EXTRA CHARGE! (and you can have as many servings as you want with your meal free of charge). The owner is always there to greed you and the staff is quite friendly. Atmosphere is casual and the food is always GREAT!"], ["Allen K.", "Not only was the food excellent, their service was good too, which is hard to find in Miami.  We had the spring rolls, pad thai, and red curry.  We ordered everything vegetarian and our server asked if we were vegan.  While we are not vegan, it shows that the restaurant is willing to make adjustments and be vegan friendly.  Also, the entrees are big enough to share, so the food can be economical if you are willing to share food."]], "Jasmine Sushi & Thai Cuisine": [["Izayana C.", "Checked this place out for dinner since I'm always up for trying new sushi restaurants (you never know when you may find a hidden gem!). This place is located across FIU right next to the Publix. Tried the Key's Caterpillar Roll, Miami Heat Roll, and the Baby Octopus Nigiri. The Key's roll was yummy. The key lime sauce drizzled atop the roll is deliciously tart. I love anything key lime and I was pleasantly surprised at how well the tartness fit with the sushi. The Heat roll was okay. It was not spicy enough for my liking. The roll itself lacked much flavor and the spicy mayo drizzled on top only remotely added some of the described spiciness. The Baby Octopus was something I ordered on a whim since not a lot of places still offer it. It was alright. It was chewy, flavor was mediocre, not as special as I had hoped.I've definitely had better grade sushi so I am being critical in regards to the quality of the sushi. It's probably only one rung above the sushi that Publix sells next door. Considering that it's also pretty expensive, I was expecting something better. What I did really enjoy was the Thai Tea! Yummmmm!! I loved it. It's like milk tea. So good! I also liked that I was able to get 10% off my order for checking in through Yelp :D"], ["Angelica P.", "It is very good sushi. The place is clean. Just beware of getting caught during an FIU sorority happy hour lol"], ["Che M.", "I've had some good times here, the staff is personable and the food is ok. It's a little over-priced for what you get in return but it is what it is. The restaurant also closes for like a few weeks a couple times out of the year for vacation or holiday, but you wouldn't know it unless you drove to the place and saw the sign posted on the door.I'd eat here if I want to break out of the norm, and I would recommend it, just don't have overly-high expectations."], ["Monalisa M.", "Thai Tea in the area, and it taste pretty good. The Pad Thai was also nice and fresh, and the beef was tasty! Great lunch spot, near working offices and campus'. Tucked away in the corner, so you have to SEARCH for it, but it's a good Mom & Pop place, who cares for you when you walk in. I support you Jasmine Thai :)"], ["Suzette R.", "I have to say that this restaurant is excellent ! The owner is very friendly and is attentive to the customers. I had the tuna tartare, usuzikuri, gyoza, tarantula roll, firecracker roll, macadamian snapper roll, drunken noodles and pad thai. Everything was authentic and tasted amazing. This was hands down the best pad thai I have had in a long time. I would definitely recommend this restaurant and would definitely return."], ["Aly S.", "Fairly good despite grimy localtion. Quick service, generous portions, good prices. I ordered the miso soup and chicken teriyaki-- both very good. Bathrooms are kind of sketchy looking, and there was a leak literally in the middle of the restaurant. Aside from that, it's a good place to grab a quick bite to eat with friends if you're around the FIU area."], ["Abilene P.", "Great food, all sushi is great but my absolute favorite is the house fried rice (hibachi style) OMG just amazing.. It's also big enough to share.. I highly reccomend, this became my #1 sushi place"], ["Guy M.", "Highly over priced food!  The location is not that good, the restaurant is hidden, and the staff is rude.  They have a check-in offer that they don't even know how to use!  Why post a check-in offer if you don't know how to use it! I showed up with 3 friends and we heard the manager talking about us because she was like only 15 feet away. And she said how we should not be given the offer. Never going back here again and I definitely do not recommend it to anyone. Save time and money and go elsewhere."], ["Tiffany L.", "Been here numerous times and it's never disappointed. They're under new management now and it's almost like a brand new restaurant.My friend and I spent 3 months coming here for lunch once every other week and there's so many choices. The staff is super nice and the manager is the sweetest old man. Very attentive. Lunch specials are good portions, which also includes a miso soup or salad.Some recommendations: Tom Yum Goong, ANY meat/seafood of the thai fried rice, ANY meat/seafood of the pad thai, the gyoza, and oh, mongolian beef! For sushi, I've only ever tried their Jasmine Roll . . . which I loved! Fresh and lobster in it was yummy. I should try the sushi more often, hahaaa.Menu is posted on their website WITH prices!"], ["Heydy S.", "Ive been here about three times.. All a disappointment... Like $12 for lunch menu which means u just get a small bowl of curry chicken.. Not even white rice with it.. Ridiculous never going there again.. And it never takes my debit card"], ["Jess O.", "Favorite sushi place hands down if your by FIU the location is convenient. They have very friendly service, and my favorite item is a sushi roll called \"Heaven on a plate\" and it's no understatement to its name."], ["Raul M.", "This little hidden gem near FIU is the best kept secret in South Florida.  Fresh sushi, friendly service, and affordable. They will create custom rolls while you wait. The owners are very conscious of their customers and will dote on them. I recommend you come hungry."], ["Christy R.", "Have been coming here for years. Even though it's a little hidden it shouldn't stop you from coming!! By far the freshest sushi I have had anywhere. The house fried rice is beyond delicious and so fresh. Godzilla roll is amazing. So authentic. Great service. All around still as amazing as it was when I discovered it years ago."], ["Karley B.", "I absolutely love this place. As an FIU student I found it to be close to home, delicious, and though a little pricey (they use real blue crab instead of imitation crab meat), well worth it. Especially with the FIU student discount.Their lunch menu is fantastic because it has a few simple rolls and great prices. I'm an eel fan, so I always order their simple BBQ eel roll with another specialty roll. The best tempura roll ever lives up to it's name, though they rival it with their own crunchy roll, which is also fantastic. The Keys crab roll (I think) is super good. It has fried crab and is drizzled in a tangy key lime sauce. There is a roll there also, that is absolutely ridiculously amazing. It's expensive, like $17 or something, but if you're splitting the bill with a friend, it's worth it. It's loaded with all kinds of goodies. A must try!Every time I go I order a Thai Iced Tea, which is super yummy and really different than what I've had most places. I was going here so often last semester  (3 times a week) that the manager (who was always amazing) started giving me free refills on what is over $3 normally for each. The customer service is always great and the environment is cozy and relaxing.I always recommend this place to my friends because I've had nothing but good experiences there. I've worked for over a year at a Sushi restaurant and it has definitely caused me to be a little of a snob when it comes to my sushi. Honestly, Shibui on 102 and sunset, and this wonderful gem, are the ONLY places in Miami where I will eat sushi. Love them!"], ["Chris C.", "Delicious food. You have to THAI it now!I've been here many times and one thing I appreciate is consistency. One thing I like even more than consistency is when things get better! Pad Thai - Good, Great and then Addictive!Mongolian Beef: Tasty, Delicious and then Amazing!Awesome lunch specials with tasty food, who could ask for anything more? (^^^rhetorical question alert ^^^)"], ["Al C.", "This is an excellent place to go and get a quiet meal after classes or over the weekend.  The sushi is good, but the pad thai is now my favorite, and you get great portions, especially when ordering to-go.  Very courteous owners, nice and cold Singha beer to go with my meals, and even great dessert (both the ice cream and thai donuts are winners).  As an out-of-town student, I always miss this place when I'm home during breaks."], ["Ana M.", "Our favorite place to go for lunch my coworkers and I. Love the pad thai and best tuna tartar in town! Sake bombs are also at a great price!"], ["Sabrina L.", "I don't know why, but I guess it was notified as an error that this place was closed when in fact it has never closed, is just under new management. My friend and I were desperately craving  sushi and happened to pass by and saw the big sign saying OPEN! yay!! I had the steamed shrimp shumai and shrimp tempura roll. My friend ordered the spicy tuna roll and shrimp tempura roll. Overall, the ingredients are still very fresh, our waitress was nice and attentive! The manager  kept coming by and making sure we were happy and satisfied with our food!. Overall, a great experience!!"], ["Enbar C.", "Quick sushi, nothing too special, but tasty. Rolls a bit on the smaller side."], ["S H.", "Love this place! Every Friday my coworker and I have lunch waiting for us (we call ahead) because we're always in a hurry. We get veggie pad Thai, veggie rolls with brown rice, edamame to die for, and tons of extra spicy mayo because we pretty much drink it. And one of their delicious teas !"], ["Juju H.", "The food is so-so. Close to FIU and not bad for a small group of friends. Atmosphere is not that great, like being in someone's living room."], ["Tereza V.", "Their curry is phenomenal - the best thai curry I have tasted outside of Thailand! So I love this place! We have gone there for lunch and dinner on numerous occasions, and planning to do so again. It is a family run business and the owner is very friendly and welcoming, which is just one of the many reasons we like coming back so much. You will not be disappointed!"], ["jacky r.", "Amazing family owned place right across FIU. Great food and amazing service! Highly recommend to anyone looking for Thai food or sushi"], ["Vanessa R.", "I just moved to the neighborhood, and was craving Sushi. After living really close to a great Sushi place that delivered, i desperatelyneeded to find a Sushi place in this neighborhood ASAP! The first time I tried their food, i only picked up. I tried their Tuna Ta Taki, and it was really fresh and delicious! My girl friend tried their Shrimp Shumai. Second time, we went on a Sunday. We were the only ones in there, but I didnt mind. It was a stressful weekend after moving- and really liked that we had the place all to ourselves! The manager greeted us immediately, took our order, and when our order came out- I was beyond impressed! I ordered the Red Dragon Roll.... Deeeeeeeeeeeeeeeeeeelicious! If you dont like spicy, dont order it! It was fresh and very beautifully prepared. I dont remember what my girlfriend had, but it was also delicious! (Will update this review with what she ordered) We had some Saki and the bill was reasonable! I have paid way more at other chain restaurants, and have had OK food. I dont mind supporting local business when the food AND service is good!I definitely recommend this place! I can't wait to try something new from the menu next time I go!"], ["Damian B.", "This place was horrible.  I can't imagine how it has good reviews unless they are fake. My wife and I were both sick after eating the food (which may have been rotten)!"], ["Ziad B.", "Waste of money, far way over priced, I went to places in Mircale miles and Coral gables and they have cheaper prices than this louzy resturant, the decoration is old and depressing and the food is low quality and over priced, I had some sushi and the sushi was so poorly made. I don't advice anybody to go there!!!"], ["Veronica D.", "Stopped in for a quick bite with the hubby.  Restaurant is very close to my house, absolutely no wait.  Great service.  I ate the Tiger deluxe roll with brown rice, salad and shrimp shumai, it was very good.  My hubby had the pad thai which was also delish.  The only downside was the prices.  I am not cheap, but I thought it was a little pricey for a sushi restaurant in a strip mall,  The brown rice itself was 2.00.  But all in all it was very good.  I will be going back... yummy yummy in my tummy"], ["Jaclyn V.", "I lived very close to this place for years and never even knew it existed! I only came here because I was craving Pad Thai and didn't want to go too far or go to a chain, so I discovered this place. It is tiny, somewhat hard to find and a hole in the wall. The Paid Thai is incredible. Cooked to perfection every single time, and the Sushi is also excellent. I never liked Sushi until I came here. I actually was very picky about raw fish, seaweed, and even shrimp (I know, how could I like Sushi?) but the waiter who helped us was very patient with us, answering my every question even going so far as to offer us Soy paper instead of seaweed. My first time ordering Sushi here, my boyfriend and I shared the Godzilla's Meltdown roll (LITERALLY the best thing on the entire sushi menu, I order it EVERY time now). It has shrimp tempura inside, with cream cheese, crab, and avocado. Spread all over the top is cooked seafood (a mixure of crab and whatever fresh fish they have), eel sauce and spicy mustard. It is literally the best thing I've ever had. Recently, I also order a Key West roll which was also really delicious.The place is a little on the pricey side. However I do not by any means think its expensive for the quality of food I am getting. I don't mind waiting for my food here either because I know it is always fresh. The Chicken Pad Thai ran me about $14 (standard to any chain & much better quality) and the Godzilla's Meltdown is $18 (comes with 10 rolls & ridiculously filling). They have an entire menu of specialty rolls, as well as an entire thai menu & other rolls.All in all, I will continue to come here on a regular basis & recommend this place to anyone I know. If there's one thing I love, it's a \"mom & pop\" restaurant because these place always treat you better. I guarantee you will enjoy your food here!!"], ["Bayardo C.", "Yes! finally found the best Thai/sushi restaurant in miami.  Friendly service and the owners make you feel right at home. The food is out of this world! Home made sauces... if I have to describe this place it will be authentic flavors and fresh ingredients.I had ginger fried  snapper and my wife had sashimi and we were amazed about how fresh and delicious everything was. We are regulars now and have tried just about everything from the softshell crab to the curry duck to the sushi and we truly recommend it."], ["Ryan M.", "NOTE: this place is not closed.  It's just under new management.I've been coming to this place for almost two years and there have been, on occassion, some dud meals.  I've seen the place go through different transformations in decor and management.  Though, currently the management and quality of the place is a bit more refined and clean.  Not a huge fan of Bansai or Pei Wei, but Jasmine sorta looks like that now... but their food is just way better.  In terms of cleanliness, though, the place has improved.  I mean I'm all about the grime sometimes, but I like to eat at places that have clean bathrooms and stuff.Jasmine's sushi bar is a bit meh.  Had this sushi roll with cream cheese in it.  Usually if a sushi roll has cream cheese, it's a really subtle and minimal amount.  These people just splattered it all over the place.  It wasn't even solely cream cheese, but there was also like mayonnaise and shit, too.  Hate mayonnaise with a passion... so that turned me off.  So I would recommend just going somewhere else for sushi.I've only tried their Thai menu and I usually stick to the Pad Thai anytime I go out for Thai.  Well, Jasmine's Tofu Pad Thai is an intense-ass meal, especially since they have different spices (Mild, Medium, Spicy) for it.  I'm the asshole that wanted to try the Spicy and MAN.  IT. WAS. SPICY.  Practically inedible-Spicy.  I ate it all, but I crapped my guts out after.  With Thai food, you're not supposed to crap your guts out after-- that's sports bar fodder.Next time I went, I had it Medium, and it was perfect.  With a side of green salad and sake.   You got yourself a dinner.  I shared the plate with my girlfriend but we ate fine.  It was awesome.All in all: don't try their sushi but totes try the Thai."], ["Christopher M.", "Place has okay Thai food. Not the best. No one really comes here. Food is very overpriced plus the menu has different prices. When I asked about why am I getting overcharged they responded with the prices changed after January 1, 2012. Will not be back. I recommend Royal Thai which is a few blocks away. This place won't last long. Sorry Manager for exposing the truth"], ["Emme R.", "Is this place really closed?? Huh? I passed by it not to long ago. Oh well. I'll write this review for memories sake.I used to work at FIU and I'm currently a student there. I used to eat at Jasmine here and there after a hard days work with my coworkers. When I think of kick ass spicy tuna hand rolls (my absolute favorite) Jasmine Thai comes to mind. The tuna hand rolls were HUGE. I could see the sushi chef struggle to close the darn thing without all the little squares of tuna falling off one by one. Good lord, I still haven't seen a hand roll that stuffed. The pad thai was yummy but very small and a hefty $12.Yeah, the decor was a little slummy (is that the right term? well you get the idea). But that was a while back, and the food was great, so it I just shrugged it off."], ["Tricia G.", "Talk about customer service!  After the owner of Jasmine Thai and Sushi read my review about his restaurant, he stopped by my office (he's delivered here a couple of times) with a sushi combo (Califonia Roll and nigiri sushi)!!!  He mentioned that he read my Yelp and apologized that I wasn't satisfied with his restaurant as of late!  I was super embarrassed (didn't expect this at all!) - but I wrote my opinion, he read it, he is trying to improve and most of all, he went out of his way to bring a customer back!"], ["Bryan B.", "Very friendly staff... reasonable prices.. open for lunch.Very good Pad ThaiThey also serve sushi... my picky friend that never likes anything actually liked their sushi"], ["Sigrid L.", "We happened to stumble on Jasmine and thank goodness we did!  Fast and friendly service, really great food and HUGE sushi rolls - instead of the normal 8 slices, you are getting like 15!"], ["Chantelle M.", "I personally really like this place. The food is great, decently priced, great but small lunch menu, portions are good, sake bombs.. enough said. Mostly full of college students from FIU, this small place seems authentically Thai and offers great sushi selections! Oh! and get the Tempura Ice Cream.. to. die. for!"], ["Lindsay G.", "Review on Jasmine Thai and Sushi: meh. I could have made more exciting sushi rolls as a kid in the sandbox with nothing but my imagination. The pad thai was okay, nothing special. The seaweed salad was good but was six dollars for a 1/4 teaspoon. Other, fancier sushi restaurants, don't charge as much and give you more food. Overall, I say it was a mediocre experience."], ["Jai K.", "Stopped by here last night as we were driving by looking for a sushi place. We had the entire place to ourselves, not a single person there, which was fine, i guess. We ordered volcano roll and the red curry. Volcano roll was fantastic, super fresh and the spicy mayo is flavorful. The red curry was decent, nothing special, though we asked for mild spicey and i thought my mouth was on fire when i tried it, i can only imagine how spicey it is if you order it not mild. 1 star deduction for blasting hiphop, which was unusual considering the waitress was an older lady and the sushi chef was an older dude :)"], ["Lorena C.", "If I knew I had Thai donuts so close to home I would have visited earlier. If your in between going out to a fancy sushi rest. or just ordering in, this is the place. They have great sushi and are very laid back, a jeans and t shirt place. Not to fancy but great on the pocket and close to FIU."], ["Sal F.", "The food and service is good, but the interior atmosphere is funky - there's a moldy smell to the place."]], "Bonding": [], "Lung Yai Thai Tapas": [["Vachira P.", "Wow,  this is the real Thai foodMy wife is Thai so we knowThe food is truly amazing People outside waiting on lineThai music in background Friendly service and good prices"], ["Mike U.", "Who would've thought that a small joint like Lung Yai Thai packs so much punch and flavor?  Well, according to the number of Yelpers and constant foodie feeds on Instagram...This place does....and what does a Yelper do when they get enticed?  Join the fun and go check out the place for themselves!When arriving, first off, don't expect to come with a large group because you will just be separated and not find anywhere to sit as the place is small, with a counter across the kitchen area and some small tables outside, with only ONE large table to accommodate a larger group.  Trust me, it'll be more enjoyable in a smaller and more intimate number of people.The two-sided menu is plentiful and full of surprises.  From Thai street food to the most traditional, all in small quantities but the plate is still large enough to satisfy your tummy.Now on to what we are all wondering?  Taste - Tom Kha - One of the richer tasting Tom Kha's I've taste with lots of coconut milk making it nice and thick, perfect tartness of lime that opens up your palate to crave more food.Massaman Curry - Ordered it with shrimp, the shrimps were plump and succulent as they use extra large shrimps in their kitchen.  This is as they explain it, very mild curry, not spicy whatsoever, but it is extremely tasty.  So tasty that even the big bowl of rice that it comes with isn't enough to soak up all the goodness in that bowl.Khao Soi Gai - These egg noodles are loaded with so much flavor that you will just want to slurp away the whole bowl in a flash.  From the coriander to the curry, the flavors just knock your palate off the wall!  This has a hint of sweetness, along with a big coconut milk taste, perfectly balances and nice sized noodles to soak up the curry sauce.  Khao Man Gai - This wasn't particularly my favorite, as they used chicken breast.  I was expecting a boned-in piece of chicken with its skin to retain moisture.  It was particularly dry and I just didn't care for it as it is poached chicken, even though it brought its own chicken stock to moisten it.  I added a lot of the sauce and stock that it comes with in order to bring it to the consistency that was palatable...maybe others will like it, but it was mehhh to me.Nam Prik Ong - For those that like a little different sense to your palate, this is a must.  The ground pork is seasoned with a little fermented spice, not everyone will enjoy this, but the taste definitely brings out your senses live and on the spot.  There is a particularly fermented taste to this...couldn't quite make it out,  but for the ones that aren't too brave to try new stuff, try it from someone that orders it and enjoys it.Fried Rice with lump crab meat - What a tasty fried rice!  That well-seasoned wok is transferred into the rice!  That is what many Asians look for...taste from a well-seasoned wok!  You know that the Chef is good when all your food is well-seasoned directly from the amount of times that wok has been fired up and cooked up delectable dishes...it ALL transfers to all the dishes that is cooked with that wok.  This fried rice definitely brings it!  Perfectly cooked and seasoned grains with egg, onions, scallions, and veggies...YUMPad Thai - This is a MUST!!  This by far is one of the best Pad Thai's in South FL!  The extra large shrimps, the noodles and the well-balanced texture and taste, right out of the well-seasoned wok!  Not overly sweet in seasonings and not overly cooked where the noodles are soggy and sticky.  Each noodle is still individually separate from each other, but covered with seasoning on every end.Beef Noodles Soup - Well made beefy broth.  You definitely can tell that this was made with love and iron - beefy iron is what I mean.  Seafood Noodles Soup - Just like they suggest - Not recommended to novices...why, because it has a pink coloration when it comes out.  This pink color just doesn't seem appetizing, but it is because its a tomatoey, vinegary, pork broth with a touch of fermented tofu.  Doesn't bother me, maybe because I'm Chinese and my palate is accustomed to the different tastes.I am already planning my next visit to explore the rest of the menu.  So should YOU!"], ["Sophia R.", "This might be better than my favorite Thai place in Miami, (dare I say it), Cake Thai. We ordered  tom yum w/ chicken, green curry w/ chicken, and palo moo. The palo moo broth was nothing I've tasted before. If you love pork belly and the sweetness of Thai food, you will love this. But honestly, everything tasted amazing.Service was very friendly when I went on a late Monday night, but some people have said otherwise. Definitely coming back and back and back."], ["Raul M.", "Yes Miami, there's a Thai restaurant in Little Havana and it is packed to the rafters with people slurping soup and noodles until the cows come home. (Which according to Chef Bas, that's 2 a.m.)Nothing says trendy like a tight space, an open kitchen, and small plates. This little (and I do mean little) Thai place manages to impress the taste buds and the wallet.Lung Yai Thai Tapas is located on SW 8th Street in the heart of Little Havana just west of 17th avenue. It would be easy to miss if it weren't for the crowds waiting for a seat at the long counter. You'll see them milling along the sidewalk while glancing at the open kitchen as the cooks and Chef Bas fire up the big wok to make Thai food served tapas style.Each plate contains just enough to satisfy your curiosity and your hunger, without leaving you feeling overwhelmed and uncomfortably full. The dishes range from the more familiar Pad Thai to the more exotic Nam Prik Ong. It all smells amazing in here! My girlfriend and I didn't have to wait too long for seats at the counter. While we waited we perused the menu and made \"oooh and aaahh\" sounds as each dish was plated and served to the awaiting patrons. After sitting down and placing our order, it wasn't long before plates of shrimp and pork dumplings, crispy spring rolls, and shrimp pad thai, were placed in front of us. We asked the Chef to make a surprise dish and boy did he deliver! Thank you Chef Bas!!The experience was authentic, enjoyable and, well worth the wait. I am definitely coming back for more."], ["Puja B.", "So I'm downgrading my review by 1 star, although in actually I was thinking of downgrading it by two. When my hubby and I originally went to the location, the food was excellent, fresh hot and authentic. Not as spicy as we would've like but we were okay since they provided the thai chili powder. On the last two occasions that we have had delivery we have been disappointed. First of all, we sent our friends there, and they stated that there were a few dishes they were \" out of\". The last time we ordered delivery they stated they were out of the pork dumplings. Now I can understand this, because it's a popular item, and I'm assuming pre-prepared for the day.On saturday I decided to order in food at a decent hour, earlier than usual dinner time, around 5:15pm because I didn't want to run into the same problem. I had decided to order the north thai dish Prik. I got called back from postmates that they are\" out of it\". How can you be out of a dish that should be cooked fresh in the wok at 5pm on saturday and your restaurant is open until 2am???On top of that when asked to replace it, they gave soggy papaya salad, which was spicy, but definitely not the same price, nor meat!The shrimp dumpling and the chicken wings were cold and soggy.The Jungle rice did not taste like the last time at all, and we have eaten it twice, it had too much salt and did not have the jungle flavor and it was mild.The Khai Soi Gai- noodles were soggy, and it was sweet!Grilled pork skewer were okay, a bit chewy.I emphasized to make it extra extra thai spicy hot and even stated to let the restaurant know that we are Indian and can handle the heat!After paying $85 for very small portions, cold food not done spicy the way we wanted we were very disappointed.At this price point, I expect better quality, consistency in the dishes, and appropriate portions. You can't call it tapas, give tapas portions for family style cooking then charge this much! I never complain about pricing if it makes sense for the meal.After the last two middle of the line delivery attempts, We are definitely looking to try another thai place..very disappointed since we would have been regulars."], ["Vanessa J.", "This is so far one of my favorite Thai Food restaurants in Miami. Everything about it is perfect! There isn't a lot of seating and the bar stools are not exactly the most comfortable, but it is totally worth it. I absolutely love that you can watch the chefs cooking right in front of you. The staff is super nice and welcoming, and the prices and portions are just right. So far, everything we have tried has been ridiculously outstanding. The following is a list of everything we've had:Shrimp Pad ThaiKhao Soi GaiPad Woon SenCrab & Pork Dry NoodlesCrispy Springs RollsChicken WingsCrispy Mushrooms (surprisingly good)Fried Shrimp DumplingsSteamed Pork Dumplingsand my absolute favorite: Tom Kha Gai soup (literally the greatest soup I have ever consumed... coconut, ginger, chicken)Everyone needs to give this place a try. If you have to wait to be seated, do it. You won't regret it."], ["Fernanda F.", "Wow wow wow! Just wow! From the moment you get out of your car you can smell Lung Yai's delicious cooking! The smell, the music, the size of the restaurant, and the food make this the most authentic Thai place in Miami. This is supposed to be a \"tapas\" style restaurant but the portions are perfect for one meal. It's enough to satisfy the craving but not enough to leave you super full and uncomfortable. There's nothing worse than being served 3 portions of pad Thai in one plate, and Chef Bas understands that. My favorites so far have been the Pad Thai shrimp! The veggie spring rolls, and some pork belly broth my husband ordered. Everything is cooked to perfection and if you sit at the bar, it is done right in front of you. If you're a Thai food lover this place is a must!"], ["Mayli M.", "This is a tiny restaurant in the middle of Little Havana. You can park on the street. We went on a Wednesday night & I'm glad we did because the parking wasn't difficult & we didn't have to wait for seating. I'm sure it would be totally different on a Friday or Saturday night.The food:     We started with the Crispy Mushroom appetizer (per recommendations). It was like a tempura battered mushroom fritter. It was good although fried things aren't my favorite.     Next, we shared the chicken panang curry. This was delicious. It was much more flavorful and better quality than what I've had in other Thai places. I highly recommend this dish. We also shared the Jungle Fried Rice with chicken. They let you add spice to the fried rice, but other than that, it was what you would expect from fried rice. It was good..I just didn't get the \"jungle\" flavor or whatever inspired the name. I would have tried another dish, but they make you order everything at once when you sit down. I didn't know the portions would be a little smaller than I expected. The space:I docked a star because this place is tiny. I can't imagine what a pain it must be to have to wait for a seat because there really isn't anywhere to wait (stand around on the sidewalk?). They have some outdoor tables, but it's just too dang hot to eat spicy Thai & sit outside. Also, if you sit inside, you have to sit at the bar. There aren't any tables inside. At least they have purse hooks under the bar :)The verdict:I look forward to going back & trying more of their curry dishes.  I will definitely go on a week night & if the weather cools down, I will try an outside table."], ["Cary R.", "Great Thai food on the East coast, in the heart of 8th Street.. I would not believe it... Look for the clipboard and put your name on the list.. It will be worth it. I kid you not. The wait might be a bit long.. I waited 1 hour. You can sit outside if you spot a table. It was cloudy and I did not want to chance it. We waited for a table inside, great smile on our wait staff. Told her we love spicy and stick to chicken, beef and pork. What ensued was heaven in our mouths. Pork ribs and steamed pork dumplings.. Oh that sauce.. Then we had curry chicken be curry steak dish.. Fried rice was beyond words. I travel to Asia frequently and I can certainly say this is authentic. Chef is on site cooking away and a very busy wait staff. Going back!"], ["Adry G.", "Hidden gem in the heart of Miami. Driving down 8 street after a long day of work I saw this place was jam packed and saw some great reviews so I knew I must try it out!Came in, was seated immediately, service was quick and to the point, prices were reasonable for quality of food! What more can a girl ask for? Though the place was extremely tiny, I didn't have any space to move about, I did feel like I was at a friends house instead of a restaurant. Owner and the cooks are right in front of you so you see some nice food porn/action going on as you wait or eat! Definitely a rare experience that you can't find in many restaurants. Can't wait for my next visit!"], ["Chad J.", "Update: Must try the Palo Moo with the green vinegar topping the chef suggests- out of this world good, savory and sweet. Fantastic Thai cuisine! From here on out I'll be skipping ATK and Mr. Yum to visit Lung Yai for all my Thai cravings. Two of us shared the shrimp dumplings, Som Tam, and the Khao Man Gai. The Khao Man Gai is tasty and the rice alone is very flavorful; found it charming that the chef explained to season the dish with the fermented soy sauce and to taste the cucumber after a bite of the chicken and rice. The broth served with the dish is peppery but delicious! The Som Tam was also tasty- nice balance of sweet and spicy and a perfect serving to share. Can't wait to go back and explore more of the menu."], ["Jules G.", "This is the best Thai food I have found in Miami.  I have not found anything on the menu I haven't loved.  This place has been growing in popularity and is packed with limited seating now.  On the down side, they are not open on Monday night and they don't take online or phone orders.  You must actually go into the restaurant to order."], ["Yesenia M.", "Wow! Wow! Wow! Good things indeed come in small packages. Wednesday night 7pm right before the rush. Top quality flavor in every tapa.  My husband and I had the shrimp pad Thai, Pad See Ew with Beef, Khao Soi With chicken, fried pork dumplings and then just when we thought we had ordered enough we decided to order Khao Man Gai. Highly Advise to peek through the menu before arrival. Order all your desires at once to avoid a long wait between plates. Our original bulk order arrived fresh and quickly. Can't wait to go back to eat inside, outside or carry out. This is a true Hole In The Wall that you don't want to miss. Flavorful food, portioned just right at a reasonable price."], ["Sara N.", "I use to order $40-$80 in delivery from here about twice or three times a week. They no longer \"serve my address\". When I called the restaurant to ask why and order, the lady argued with me and told me to just order online. Then she passed the phone over to some man with out saying anything to me, and he told me the same thing. He argued with me so much (even saying it wasn't his problem.. Uh hello it is since it's basically your job..), along with the other lady, that by the time he said he would take my order  over the phone I was so disgusted I said no.I don't care how good the food is. That experience and \"customer service\" was the biggest turn off  ever. I'll spend my money else where. Thanks."], ["Matthew B.", "With Hy Vong closing this is probably the best Asian food in the area now. Authentic Thai food is hard to find. Great food, inexpensive, and good service."], ["Johann A.", "Thrilled to be able to try this place out after hearing so much. Totally lived up to expectations. FAB!! Tried the Palo Moo (braised pork belly), Pad Woon Sen (veggie), pad Woon salad (very spicy seafood salad), crab fried rice (scrumptious), crispy oyster mushrooms (yummy), and the pink seafood soup (not for the faint of heart and no refunds - absolutely delightful!!). So happy we came here on a whim. Great tiny spot!!!"], ["Eddie G.", "Terrible service owner is very rude cigar smoking allowed u can't even breathe.Food is ok portions are very small. Orders have to be placed all at the same time. If u don't want to be put in time out by the owner don't ask for anything extra after your order. Customer service does not exists."], ["Jorge M.", "This place is awesome. I rarely review anything. You can read this review which is like the cliff notes of a book. Food amazing. Feels like you went to Thailand. Small setting. If there is a wait, do it. Don't be prissy or picky. It's a little hard to find, but once you are in just kick back and enjoy the meal and experience."], ["Zuleika L.", "Loved the food. We were starving and a party of 5 (4 adults 1 child). We ordered 3 appetizers shrimp dumpling, fried mushrooms and spring rolls. 2 soups Pork noodle and Duck noodle soups,  pork fried rice, Khao Soi Gai and Pad See Ew with Beef. Everything was delicious and it was the right amount of food that we felt full. We shared everything. What I didn't like was that we could only order food one time that's why we originally thought we ordered too much food but the portions are not huge so it ended up working out. Another thing I didn't like was that they brought everything to the tiny table at once. But I will go there again because food was really good. The beer (Singha) was ice cold so that was a . Place is very small. We had to wait 30 mins to be seated on Sunday at 6pm. Totally recommend this place."], ["Albert T.", "Dishes amusingly creative albeit lacking taste. They say third time is a charm, not hear. They are always running out of the grilled pork and beef dishes. Restaurant managed by the cook who seems to be in an awful mood not willing to accommodate his patrons. Menu price point is perhaps the most appealing aspect certainly not the service. About the taste, there's just so much curry and cilantro your palate can embrace."], ["Maria T.", "Nice place! Nice food!  Nice people! Nice place! Nice food!  Nice people! Nice place! Nice food!  Nice people!"], ["Sergio C.", "Thai tapas? The name piqued my curiosity. Food is served with excellent presentation and has great flavor. The inside is small and gets full fast, but there is a nice outside dining area. Asian cuisine on Calle Ocho - that makes this place a little unique."], ["Wendy L.", "If you love authentic Thai food and you haven't been here, then you're totally missing out! I'm just going to echo the sentiments of all the other reviewers: this is great new spot that's serving up some fantastic, no-fuss food. Miami needs more \"gourmet fast food\" eateries that don't break the bank. This is the best Thai place I've been to in recent memory and it's run by the same team that runs Bonding. It's more reminiscent of somewhere you'd find in Wynwood rather than in Little Havana, but hey, anything's possible. It's small but inviting, with bar-style seating that gives you the pleasure of watching the chef cook all the dishes in front of you. Come for lunch when there's no wait (yet)!The food speaks for itself. I recommend everything I've tried here so far, including: crispy spring rolls, panang curry (great for those who prefer sweeter curries), pad kee moa with chicken, and steamed sticky rice with taro (a dessert wrapped in a fragrant lotus leaf, served warm. Must try!)Two thumbs up for Chef Bas and his team on an awesome new restaurant!!!"], ["M S.", "Literally the best Thai I've ever had and I've had Thai in almost every major city of the US. The Tom Kha amazing: so rich and creamy but yet light. The shrimp pad Thai was seared to perfection. Khao Sao Kai had the same creamy texture as the Tom Kha but with all the flavors of curry. Highly recommended to the Thai aficionado."], ["Sean D.", "Finally an authentic thai in Miami!We moved to Miami from London, and have travelled to Thailand on a few occasions. Since moving here we've been on the hunt for a thai which is not overly sweet or salty. THIS IS IT!!!Fresh ingredients, perfectly seasoned, simple and just how good wholesome thai food should be!The staff are very friendly, the kitchen is open and clean! Street parking is readily available on 8th street.Can't wait to go back and try more stuff on the menu!"], ["Luis G.", "Excellent food and service!!!!!! 5 stars easy!!!!!!Felt like I was back in Thailand again!!!! Try the Pad Thai!!!"], ["Adrian S.", "I was wondering what would become of this former cafeteria-turns-into-something-else-at-sundown-with-maquinitas-in-the-back-and-all-types-of-shady-shiftiness location. Finally stopped in last night to check it out and boy (and girl) am I glad I did. I've never been the \"OMG, Thai is my faaaaavorite!\" type. I mean, it's good, but no need to hyperventilate.That, my friends, is about to change...and it's all because of Lung Yai.Before I reach for my breathalyzer, let me go ahead and give you the conclusion. Get here before the masses discover it and there's a 2-hour wait. The space is cozy (code for small) with a counter that sits about 15 inside and an outdoor patio with another 18 seats? The appropriately-sized kitchen is open and exposed to the diners so you see can see the chef's sweat pouring down his forehead right onto your pad thai for added flavor. That's the secret sauce (no MSG). I'm kiddiiiiiiiing. The place is spotless and the best part is seeing your food prepared and handled. From stove to counter. F|_|(k farm to table! I had the pork dumplings, the Chef's Recommendation - Khao soi gai (freshest egg noodles in the history of mankind, balance of taste was perfect), and tried the complimentary pork jerky. Now I'm no foodie (who says that?), but let me tell you...everything was (hashtag) THE BOMB!I just texteded my cousin (my real one), who IS a food/travel snob and is always talking about how the Khao soi in Thailand is all esto y lo otro [sic]. I just let him know that Thailand ain't sh!t. He's all like \"WHAT?!!! They serve Khao soi in Miami? That's Northern Thai cuisine. It's not easy to find Thai restaurants that serve it let alone make it good\". Poor guy. But at least he knows Lung Yai is serving up that authentic fiyah in Little Havana.And now you do too!"], ["Nick Q.", "Came in late after work.  The food was prepared fresh, quickly, and ohh so deliciously!  AMAZING!  See you here soon!  So happy to have real Thai so close to my office!  Service was friendly and awesome at the open kitchen bar.  So far i had and loved the: Green Curry with ChickenPapaya Salad"], ["Cristina P.", "Miami was in need of authentic Asian cuisine. Lung Yai is absolutely amazing. The atmosphere is laid back and the people who work there are very kind and welcoming (not so common in miami.) The food.... Oh the food was delicious. The duck salad? Fuego. Spare ribs? Fuego. All of it. Every item comes out hot, quick, and amazing. I'm drooling writing this review. This is my new favorite Thai spot. I highly recommend this place to everyone."], ["Ozzy M.", "WOW,  this place is a MUST TRY!!The food is great, great service,  very small place but terrific atmosphere and again great service.The food portion is reasonable, pricing is very low in my opinion,  they also get 5 stars for food presentation low price but million dollar presentation  and taste Looking forward to my next visit.."], ["Maria T.", "You get here an experience here, not only food. I was here with my mom, my aunt and my brother. I brought them here. At the begging They were a little skeptical because the area looks weird. But it was amazing and the experience we made was unbelievable."], ["Danny P.", "Amazingly fresh Thai food!! This place is so great because you can sit at the counter and watch the chefs make every dish made to order. Chef Bas was friendly and wanted to make sure we were happy with what we ordered. Everything we ordered for lunch was so fresh and you could taste the difference. The Thai iced tea was perfect, not too sweet. The green curry with chicken was one of the best ones I've ever had. The vegetables were cooked perfectly, and Chef Bas said each bowl is made individually. We also had the shrimp pad thai which was also great. I already want to go back for dinner because the rest of the menu looks amazing!"], ["Carl L.", "The review says it all.  Wowed by the quality.  The price was really cheap.  Great place.  Fast service.  Nuff Said."], ["Mariel G.", "Thee absolute best restaurant I've ever been to in Miami. It's so inviting! I love the feel of this place. You can sit at the bar or outside and everything I ordered was delicious!! Thank you to the chefs for bringing culture to Miami! Can't wait to go again!!"], ["randy s.", "While the food here does look good, the attitude of the owner along with his staff is unacceptable. After a long work day, my wife and I were excited to give this place a try. When we got there all of the seats at the bar were taken. A line started to form at the door since there was no space inside. Seeing that there was a quaint area outside with over half a dozen tables, we asked the owner if we could be seated outside. Without barely acknowledging us, he said \"no\" and turned his back on us. Apparently they are understaffed and only open the outside area on weekends. This is perfectly understandable, but giving your back to new customers is not a great way to lure new business. Simply saying, \"I am sorry, but we do not offer outdoor seating on weekdays,\" would have sufficed. While I would have loved to sit down and have a meal at this establishment, I cannot overlook the subpar/rude customer service from both the owner and his staff. I will not be coming back."], ["Lissette V.", "It's a bold mold move to bring authentic Thai and small plates right smack to the middle of Calle Ocho.       Lung Yai is making moves on Calle Ocho as the street is breaking into a new era of diverse cuisine. Lung Yai is the place to go if you are looking for a new, cool place in Little Havana to hang out, get a drink, and have a delicious meal.  The staff is extremely attentive, welcoming and genuinely happy to share their menu with you. We started with the steamed shrimp shumai which was perfectly simple and tasty. The menu was a bit intimidating if you are not familiar with Thai cuisine, but if you just go with ingredients you already enjoy you won't go wrong. I had the Pad Woon Sen with vegetables plus shrimp and my boyfriend had the Pad See Ew with beef. Both were tasty, fresh, and a perfect portion. It's a straightforward and cozy restaurant tucked between 18th and 17th Ave on Calle Ocho. It's a casual place good for catching up with friends and then going for a nice walk to check out the new murals cropping up all over Little Havana. Check it while it's still a local secret. -LV"], ["Chris G.", "Amazing authentic Thai food! Excellent service. Very friendly and quick. The outdoor area has a very nice atmosphere."], ["David M.", "Great atmosphere, very welcoming staff. The food is excellent! I had the Fried rice curry chicken with a fried egg and I wanted to save half to take home but it was too delicious to not enjoy the entire dish while it was fresh. We also ordered apps: spring rolls, steamed pork dumplings and they were very fresh and tasty as well. If your looking for something different on the strip, this is the place!!"], ["Fran R.", "There is only one word to sum up the food and experience at Lung Yai Thai Tapes:FANTASTIC!I love this restaurant so much that I am planning to return again tonight (just 2 nights later) to bring another friend."], ["Zhiwei D.", "This is one of the very few Thai restaurants I ate in America is so close to the authentic Thai version!"]], "Asian Thai Kitchen 2": [["Kadra B.", "I give this restaurant a 5/5 because everything was fantastic. The woman that took my order was very warm and friendly,  the atmosphere was quaint and comfortable and the food was great! I ordered the drunken noodles (my favorite food on the planet) and was very pleased. Everything tastes fresh and they put the perfect amount of sauce and their media spicy was on point. I would highly recommend this restaurant!"], ["Meli S.", "Wow!Not only was I amazed by the speedy delivery, but the food is incredible! The panang curry is probably the best I have tried in Miami so far! So coconutty too! LolIt's definitely a big portion of food as well :) Would definitely recommend!"], ["Nathanael L.", "Staying at the Element Hotel. Worth the drive over here for some EXCELLENT Thai. Dined in at their one table. Don't come for the ambiance and don't be dismayed by the neighborhood.. Lol. All around, hit the spot!!!"], ["Karla T.", "Definitely as authentic as Thai food gets in Miami! My husband and I enjoyed the chicken pad thai and panang curry. Having spent our honeymoon in Thailand we are glad this place is just minutes away from home. We would be coming back to try other dishes."], ["Camilo D.", "Love it ! Excellent food great customer service prices not bad . Thai food from the kitchen , unique flavor and not standard tasteless restaurant like many others ."], ["Michael L.", "We were the first customers (at noon) at this very quaint restaurant in little Havana and we didnt mind it at all.  The food was tasty and authentic and the portions was the right size for us hungry guys.  They always gave us some complimentary Thai donuts.  I would go out of my way to come back here the next time I am in Miami."], ["Juliana P.", "BEST THAI FOOD I've had in Miami, EVER!!! This place is delivery or take out only (pretty much). The delivery time is standard, 45 min - 1 hr, but unlike other places that deliver, this place is well worth the wait! The prices are extremely fair, $10 for a main dish, and that includes decent size portions. I have ordered from here 4 times now and each time is better than the last. Below is a breakdown of what I have tried:- Green Curry (Chicken)- Red Curry (Chicken)- Panang Curry (Chicken)- Pad Thai (Chicken)- Pad Woon Sen (Chicken)- Drunken Noodles (Chicken)- Shrimp Shumai (Steamed)- Chicken Katsu (they have some Japanese entrees, no sushi)- Vegetable Spring Rolls - Chicken SatayThe lady that answers the phone is so sweet and is happy to give you recommendations. All of the curry's are absolutely delicious, the Green Curry is my favorite, but that is my personal preference. I love that is comes with eggplant. The Panang Curry is peanut-y, as it is supposed to be, but more times than not, it is missing the peanut flavor in other Thai restaurants I have tried in Miami. Five stars without question! This place is a staple in my home and I have been consistently ordering 1x per week for the last month. MMMM MMMM GOOD!!The pictures on Yelp are spot on. What you see is what you get here! Asian Thai Kitchen  2, I am so glad I found you!!"], ["George A.", "Best Thai food downtown. Truly a great , fresh experience.I wish you guys the best of luck!"], ["Christina H.", "Absolutely delicious! Incredibly fresh ingredients, bold flavors, cant go wrong when you come here. Pad Thai is very tasty, enjoyed it very much. I've also had the Crispy Duck Curry, so so so delicious. I've found my new go to when craving Thai!"], ["Claudia P.", "Small place, but very cozy and clean. Feels very authentic. Food is EXCELLENT. The service is also very good and fast. We will definitely come back soon."], ["Estrada D.", "I've had the pleasure of visiting some fine Thai restaurants around the world and made more than half a dozen trips to Thailand- so when I say I have high standards for fine Thai cuisine, I mean business.On my first (and hopefully not last) trip to Asian Thai Kitchen, I had a decent experience and to be sure, the food met all most of my expectations (the portion sizes were borderline ridiculous but at upscale Asian locales, c'est la vie). I certainly ate more than I could handle, and don't regret it a bit. I solemnly swear to one day memorize and differentiate all the wonderful dishes that begin 'k' ;  but this was not the day. One dish I'll never forget how to pronounce (I hate simply reading out the English translations to the waiter; I reckon it's near-sacrilegious with food so heavenly as thai cuisine) is the 'khao phat' - fried rice. I especially enjoyed the 'khao phat American ('American fried rice); I would've substituted the ketchup for BBQ, but it was tasty anyway. Overall grade: 4 stars; to be quite honest, I was shocked at the horrible service; usually the one wait staff that can rival the Japanese are the Thais, but Asian Thai Kitchen has room for improvement- yet it's not in the food.  But the food is what makes it a worthy of a place on your bucket list."], ["Tina V.", "Ok so i order delivery from here and the prices are decent for Miami.  Portion is small but omg i got to say it is one of the few asian restaurant to execute good spicy thai food.  I was soo amazed and it was good.  One dish was a little heavy on the sauce but it was still good and the apps were a miss but the others were delicious.  agedashi tofu (2/5) least favorite, tofu was bland and the true fried tofuBeef satay (2/5) another least favorite Drunken noodles w/beef - med spicy (5/5) its was on point, reminded me of good asian food back in CA. Thai basil leaves with beef  med spice (4/5) the sauce was a little too heavy but the favor was good.  Tom Yum Talay - spicy seafood soup - hot (5/5) it was super spicy which was really surprising.  I have not had a kick like that in a long time.  Soo good.Panang beef curry extra spicy (5/5) my favorite dish and a must order for me at any thai restaurant.  It was executed nicely.  My tongue was burning but so goodOverall if i am craving some good thai food delivery, this is the spot."], ["Megan B.", "I love the red curry! It tastes just like the curry in Thailand. This is my new go to Thai restaurant!"], ["EricAndEileen H.", "We went here for lunch and had the drunken noodles, green curry with rice, and gyoza.  For Miami standards however this is a 5 star tasting thai restaurant.  This place is a hole in the wall, as it seats 5 people max, but very authentic as it is managed by three very nice Thai women.  We will definitely be back here again, when around."], ["Faisal S.", "Awesome food and great price! Definitely try out the beef satay and shrimp dumplings! Our first time but not our last!"], ["Shawn B.", "Updated: ATK reached out and let me know that there was an emergency that left them with no cook, so they couldn't open that Sunday. They are open Sunday and that day they werr closed was an anomaly. Great follow up ATK! Original review: No stars for you, ATK... 5 stars for Yelp's online order system. Fix your hours of operation ATK! No hours listed on Yelp means you can place a delivery order through Yelp without knowing the restaurant is closed on Sunday. Luckily, 20 mins after we placed the order the order, we got a call letting us know they had been trying to call the restaurant to confirm the order and could not, so they were canceling the order and crediting the card.BTW, ATK in the Grove saved the day & delivered to us even though we are way outside their area!"], ["Ben S.", "The food here is excellent. For those of you who have had mofongo before, they make it with very green plantains. You can choose from different proteins to go with the mofongo. The appetizers are also very good. The mussles are well prepared. The cheese balls with guava sauce are also very nice. The chick pea fritters we a bit disappointing but not bad.  But the real serious business are the desserts. They are not too sweet. The guava cheesecake is incredible. And the vanilla flan and bread pudding were best in class."], ["Tere A.", "Everything I've tried so far has been delish. Chicken pad Thai (great taste & mild spicy still has a nice kick), Harumaki springs rolls and fried shumai were yummy (not as crispy but I picked up a bit late so that's prob my fault) & the Fresh Roll was unique with the flavors of basil leaves and the special house sauce added a nice touch. I've ordered for pick up and the food is done in the time they say it'll be done. Fresh food & excellent customer service."], ["Shelly L.", "One of the few Thai places in Miami that has mango sticky rice! I dont know why more restaurants dont have it when its practically a staple in Thailand. I do wish they would use the proper yellow mango though instead of the green/red mangos. And the coconut cream on top was missing. Still good however.The drunken noodles were ok. The eggs were missing and it was a wierd vegetable choice, just red peppers and crunchy green beans. But the flavor was good and I appreciate they used real basil. The people were very nice and part of the reason I will return. Some thai restaurants in miami treat you as though they're doing yoy a favor but the workers here were very gracious."], ["Sarah G.", "The pad thai is WAY too salty!! It makes me sad to waste food, but I couldn't take more than 3 bites and that was with gulping water after each bite."]], "Tani Thai Restaurant": [["Vanessa V.", "This is the best Thai food I've had so far. We had the Pad Thai and Duck Curry. Both of them were so good and so satisfying. It's a bit of a drive for us but we will definitely be visiting again. The servers are also very attentive and nice and held a conversation. It's a cute place."], ["Sabrina A.", "One of the best Thai foods in Miami in my opinion! I love the three flavors tofu it's yummy spicy and fried to perfection!"], ["Christine K.", "I've been coming here since I was 11 years old. They have had the same staff since! This place is just perfect. Everyone I bring here loves the food. The only reason for the missing star is the pricing. Soda is around $3 a glass! No free refills, and if you ask for extra chili sauce or rice it's extra too! Beyond the nickel and diming however, is an attentive and friendly staff, with delicious food! Order the volcano chicken, and the chicken coconut soup! They are MUSTS!!!"], ["Jessica S.", "Tani's has been my favorite Thai place in Miami sinceI was a kid! I am never disappointed with the food and the servers are very nice, remember me each time and are always very pleasant. Some of my favorite dishes- pad Thai, coconut curry soup, volcano chicken (I get it unbreaded), and the beef panang! The place can get busy sometimes so I'd recommend going on the earlier side."], ["Amy K.", "Our favorite Thai restaurant. We've been eating here for almost 15 years. Everyone knows us there and we are always welcomed and treated like family. There isn't anything on the menu that we don't like. The best spring rolls in town. We also love the Thai donut! The early bird specials are a great value if you can dine between 5-6 during the weekdays."], ["FreshFoodz ..", "By far my favorite Thai restaurant in Miami, very authentic. I have been coming here for years. I usually order the Volcano Chicken from here but everything is good. I have also tried the Pad Thai, Pineapple Curry, Earth Wind & Fire and the Cocky bob in the past and they have all been excellent. The seafood coco soup and the tom yum soup are absolutely delicious as well and full of flavor. Servers are very attentive and the service here is good."], ["Luis D.", "I've been to Tani a couple of times and the more I go, the less I like it.First of all, AC is freezing cold there.Service is efficient and that's about it.Food: portions are huge, but don't taste super good and it is very greasy.Pricing is a bit high for the food quality."], ["Corynn S.", "Thai food is my favorite, so I'm always eating it at every city I go to. Tani is by far my favorite. Their volcano chicken is amazing."], ["Sanket S.", "Great service, food consistently good. A little pricey but the portions are big. Favorite:Tani garlic fish and Tofu Masaman"], ["Ernest M.", "The best Pad Thai I have ever had.  The Volcano Chicken is also fantastic.  The service is fantastic during lunch.  Try the Fried Ice Cream it's like an ice cream ball covered in Thai Donut and covered with condensed milk.  MMMMMMMM"], ["Cordie C.", "I love this place and visit whenever I is in this area. The staff is always very friendly and the food is great. My favorite is the Ginger Chicken but  my bf the Earth Wind and Fire Beef. Visit this rest for some great food."], ["HeartNyc Y.", "Ordered a ton of food for take out for family members we were visiting. Everyone enjoyed their food and I thoroughly enjoyed my curry puffs,spicy tofu curry and Buddhist delight. While waiting for our food, the Thai manager/owner was genuinely friendly and attentive to our drinks orders. It was a pleasant experience and the food was good. The interior design is Thai-themed and quite well thought of."], ["Max T.", "I have been meaning to try this place out so i got some take out. I tried the shrimp pad woo sen and it didnt disappoint.It had huge shrimp and the clear noodles were good. The portion was large and the price was fair. I will go back, try more dishes, and review again."], ["Ian T.", "First, the staff at this restaurant was super nice and friendly and the service was great. However, the food is \"ok\" at best unfortunately. While the Tom Kha Gai (spicy coconut milk shrimp soup) was pretty good, the Pad Thai and the curry were mediocre and a bit bland. An issue is I think it's all very Americanized, to the point where a lot of the unique, special \"zing\" of true Thai food is lost. As an indication of just how westernized the cuisine is, I asked for Lard Nar; the first waiter didn't even know what that was. When I got to a very friendly person who did know, she was very frank in telling me that it was Thai for americans -- hence the lack of a common dish.I generally only review restaurants if I feel they were good, or really bad to warn people. This isn't really bad.But when a \"Thai\" restaurant is being presented as authentic, and isn't, diners should probably be given a heads-up. Likewise, when reviewing national cuisine-specific restaurants I feel that one criteria should be how true they are to that cuisine unless they are trying to do fusion, etc.  There are more authentic Thai places in Miami."], ["Byron L.", "Amazing food, highly recommend the pai tai or the masaman curry. Cocky bob was really good too. Highly recommend the place. Service was also great."], ["Jenny C.", "Great pad tai, one of the best tai food in south Miami area"], ["Jonathan N.", "4.5 stars on Yelp? I Want to Believe. Unfortunately, it appears my suspicions that Miami isn't known for its Asian food has been confirmed.The dishes titled Earth, Wind, and Fire, Cocky Bob, and Kiss Me Chicken should have clued me off. I should have went to Chipolte when the waitress looked at me with a blank stare after asking if they had any pad kee mao dishes. The last straw really should have been when I tried to order a simple basil chicken, and I was politely informed the dish was called simply, \"Basil.\"On to the food. We ordered a basil chicken and phad thai; both were just okay. The phad thai was bland, and the basil chicken was watery. There wasn't anything distinctly positive or negative about the dishes. Don't take that the wrong way, the service and staff were great. Unfortunately for them, great service and staff don't fill me up."], ["Trang T.", "My boyfriend and I have been here for lunch and for dinner.The lunch special comes with soup and list of lunch specials for a good price. I usually stick with Chicken pad thai or curry. My boyfriend loves the Kiss me Chicken, he gets it every single time. The volcano chicken is also delicious. Whatever we have gotten in the past, has been consistently delicious. They also make a great thai tea! Perfect for a hot day.  The early bird dinner specials run Mon- Fri until 6:30pm. You get delicious veggie spring rolls for an appetizer and soft, sweet, thai donuts for dessert. Everything here is delicious, they always refill your water, always attentive, and the food comes quick. I love coming here, I always leave satisfied!"], ["Romi C.", "I love the cocky bob and really love the presentation of the food.  This is one of the few places that give you an accurate wait time when you place a takeout order.The satay is spot on and so are their curries, that should say something in itself. If you love coconut then please order a bowl of tom kha gai... Pinecrest doesn't have many places worth dining in. Might i add that the Pad Thai is superb and one of those dishes you want to order to go 15 minutes before completeing your meal so you have an even tastier one the next day..only if you're fat like me. This is one of those rare finds."], ["Lady A.", "I ordered pad Thai, basil beef, masaman curry, tiger tear & cocky bob. Out of the 5 items, I only liked the pad Thai & curry. The beef was very chewy & would recommend ordering shrimp or chicken instead. Cocky bon was recommended by other helpers but it was too sweet for me & seemed like orange chicken to me. Although the food was not bad, I thought the food was too expensive & will probably not order fm here again."]], "Nikko By Sunshine": [["Maggie R.", "Food is very good. A bit out of the way location and the tv's in the restaurant didn't make for an inviting dinner atmosphere. Would recommend otherwise, though."], ["Lisa H.", "After our flight into Miami, my friend and I were really hungry and craving for some sushi.  We stumbled upon Nikko by Sunshine; a modern Thai and Japanese fusion restaurant.  There was barely anyone there around 6:00 pm on a Thursday evening, so there wasn't a problem getting seated.  The menu was pretty small and didn't offer a lot of options, but we didn't mind because we still spotted a lot of items we wanted to try.  We decided to get some sushi and a Thai dish:Rock Shrimp: shrimp wrapped in fried noodles on a bed of seaweed salad and carrots.  I have never seen rock shrimp served this way before.  The shrimps were succulent with a nice crunch from the noodles.  Add some spicy mayo for a creamy texture and a kick of spiciness.Volcano Roll: avocado, imitation crab meat, and cucumber topped off with spicy tuna.  The rice is a little bit mushier than I'm used to, but the freshness of the tuna and flavors made up for it. Three Musketeers: tuna, salmon, and hamachi.  Same problem with the rice, but still the freshness of the fish compensated for it.  Chicken Thai Noodles: chicken and angel hair like noodles stir fried with mixed veggies.  Overall, there is nothing too special about this dish.  It tasted like many other Asian stir fried noodles I've tried.  The chef even gave us another appetizer on the house.  I'm not too sure what the dish is called, but it has salmon, cucumber, and crunchy noodles in a sweet soy sauce.  A tad bit salty for my liking, but still good.  I enjoyed the different textures this dish offered and once again the salmon was fresh.  To top it off even more, complimentary ice cream shooters to end our meal.Overall, I definitely enjoyed the ambiance and service.  Did I mention the plating of each dish was very creative?  We had little egg penguins or veggie palm trees decorating each plate.  All edible, but just too cute to eat.  Nikko is really a hidden gem.  If you haven't tried this place before, don't hesitate and give this place a try."], ["Oded V.", "Been searching for an authentic thai restaurant in miami and finally found it.....great food, presentation, and service.  The only thai place in miami i would eat at....impressed. Sushi was also amazing."], ["Coby V.", "Great food, super attentive service - I tried the curry duck special and it was so tender and amazing.  Cool presentation.  Spoiler alert:  The complimentary salad was a nice surprise.  The whole staff went above and beyond to ensure a great experience.  Will definitely recommend to friends and return!  :-D"], ["Cody H.", "Sunshine the owner is awesome. Great food. Fire presentation. 5 star everything. Will eat here in the future"], ["Luis G.", "Absolutely atrocious.The rock shrimp was not rock shrimp. It was a normal size shrimp warmed up and covered and fried noodles. Totally not what it was advertised as.The tuna tartare was an abomination. It had canned fried potato chips Mixtown in order to lessen the amount of tuna for the customer.The place was so bad."], ["Dean D.", "Thankfully, I don't have to verbally dictate my review because my review because my mouth is on fire!! In a good way. Plus, I deserved it when I ordered extra curry slices with my spicy fish soup. That is a must try! I wish I could figure out the recipe for that since it was one of the best soups I've ever had. I've been here several times since it is within a stone's throw and I must say, this place is a real gem. The staff is attentive and friendly. Even with all the curry that I had to extinguish with ample amounts of green tea and water, I never had an empty glass. The sushi and sashimi is so fresh. They really do it right. If the rest of their menu is as good as their sushi and sashimi, you can't go wrong. It's a little on the pricier side but comparable for any top notch meal in Miami."], ["Martha A.", "Spectacular sushi! A must try:) the staff is awesome and have great attention to detail! Nice atmosphere."], ["Mike X.", "Awesome place , awesome food ! You have to try the chicken curry . Definitely well comeback . The owner visits your table too , great detail ."], ["Kaustubh B.", "Amazing food and amazing service. Went here for dinner for my friend's bachelor party. I asked the owner to help us out with something special for him. He gave us complementary salads and dessert. Food was excellent and on point with flavor. Although it was a bit on the pricey side I believe it was well worth it."], ["Jyotsna N.", "Extremely friendly and welcoming staff , served us free appetizers.   thanks to their vegetable carving skills, our plates looked amazing and the food very inviting ..the basil sautéed and pad thai that we ate was very tasty.. we definitely want to visit it the next time we go to miami .."], ["Gino S.", "Sunshine (the owner) came out to meet us. Awesome staff. The food and atmosphere was great."], ["Dan R.", "This place is top notch and despite its small space...packs a big punch.  The service was fantastic and they even brought out a complimentary app.  My wife and I got a few rolls (volcano and three muscateers) with red curry. Both were sizable and delicious...fresh and tasty.  My wife doesn't like a lot of spice so they were great and made the curry much more tame to our liking.  The pricing was on the higher side per roll but turned out to be a great value based on the size.  I'd definitely recommend this place for sushi or hot plates."], ["Rafael F.", "The sushi was priced in a range were I would've expected better taste and quality. Did not feel very fresh. The service was subpar."], ["A G.", "Although few little let downs it was a good experience overall. I had Pad Thai, the food was presented nicely and served quite quickly which is great for lunch breaks. There is wifi. Only thing is the staff does not speak perfect English or the music is too loud as I could understand only 50% of what they were saying. Also prices are on the high-end side. Basically with no drinks the Pad Thai will cost you over 18$ including gratuity. Average lunch is over 25$, I believe, so this can not be your daily canteen ;) next time will try sushi"], ["Diana F.", "I heard great things about this place from a ton of friends, so I went in with high expectations. The food was quite good, but not as good as Sushi Siam and quite a bit more expensive.All in all, it is a good place, but for the value for price, not worth it as much as Siam."], ["Alex K.", "I went here on a casual Saturday night with me and Ashley. Very well prepared sushi and great furnishing. Volcano and Spicy Tuna a great treat! Love every second and bite of this place! Very friendly staff. Love Nikko By Sunshine. Highly recommend!"], ["L S.", "Great customer service, interesting presentation for each meal. Tom Yum Kai (coconut chicken soup) is great, taste authentic. I would not order from the wine list, selection is subpar."], ["Jessie R.", "I love this place. It's a little small but the food, presentation, and service are always on point! Would recommend the shrimp Pad Thai!Dinner prices a little higher than expected - but a good little lunch spot."], ["Gigi V.", "Wow! Delicious!Excellent services and delicious plates!Very friendly and welcomed!First time in Brickell Bay Area! I would recommend it to any one who knows and loves sushi!"], ["Ashley C.", "The experience was perfect from the moment we walked in. The presentation was amazing !!! Ginger dressing best I've ever had , free refills for hot green tea , complimentary salmon crisp tartare ... The edamame wasn't drowned in salt like most places . The owner Sunshine is so nice . Besides the fact the good was to die for I think the customer service was even better! Can't wait to come back !"], ["Carolyn S.", "Not sure why we haven't gone here before tonight, but tonight was awesome!  The restaurant is cute and incredibly clean.  Service was spot on.  We loved the sushi, the new \"fried\" tuna and soup and the red curry with chicken.  The presentation was great.  This will definitely be our new sushi place."], ["MaryM M.", "Food is ok not the best and pricy. There are better places for Japanese food. Service is decent. However, an 18% gratuity is imposed to you without pre notice. Try another place"], ["Simon M.", "The staff was very friendly. I would not say that is traditional Japanese food, but taste great."], ["Cory P.", "Hands down. The food is supreme. Small menu. Good presentation and taste is outstanding."], ["Carolina M.", "Delicious!We went on saturday for an early dinner and were seated promptly. There was just another table beside us but like i said, it was very early . (around 7).Service was excellent! Very friendly and prompt. Our waitress gave us a few specials which we order the lobster roll. The presentation of the dishes is amazing with little hand carve decorations like a palm tree made of carrots and peppers, a penguin made of a hard boiled egg and an olive, etc...The lobster roll was AMAZING, the tuna, salmon and eel roll was out of control, the edamame, the sake, the thai doughnuts, ALL was solid. Great flavors that explode in your mouth, very well prepared, authentic thai cuisine.The place is small and cute. Nice thai decor all around. No fuss, just great culinary experience.Will be back, i am craving those rolls again. OMG."], ["W. S.", "The great food and very nice and attentive staff made my first visit extremely enjoyable. Pad Thai is on-point and dont miss the moji ice cream for dessert!  Great place for business lunch. Im looking forward to coming back and trying some other things on the menu."], ["Anne S.", "Really delicious and creative food. We tried three different kinds of sushi rolls and they were all very tasty. Also the duck was excellent. However, teriyaki fish was nothing special and lacked taste.Service was really friendly and efficient. We were a group of four adults and two small children. The staff took the kids into consideration and they even got free ice cream for dessert."], ["Imri Y.", "This is not the regular Miami asian food restaurant. Instead of the played-out FUSION theme that everyone does down here, This place manages to stay authentic and delicious. They want to make you happy and satisfied and then they'll accept payment (is how I felt here). I ate there twice but every time I passed by (at least once a week) they would smile and wave. Really nice people, great food, decent atmosphere."], ["Matt S.", "You ever see the Ronko commercial for Ginsu where the guy carves everything into palm trees, flowers and animals?   so did Nikko.  They bought the video.  Try not to say \"Holy Sh#t the guy on Yelp was right\" out loud when you get your order.Large screen TV with supermodels running around while nineteen genres if club music pumps out suggest they are really focused on cool factor, and while the decor is just fine, it won't be a stand out for you, just a nice clean and lively place that tries hard.Sushi offerings feature decent quality fish and simple selections,  just as Thai dishes are traditional favorites leaning more towards fashion food than authentic regional cuisine.  Spicy tuna roll, snowman and palm tree aside, was fresh tasting and satisfying. Chicken curry dish was heavy on sweet,  with two glaring problems,  one being the almost melted eggplant that had surrendered itself entirely to the syrupy curry,  while the mound of cold mashed potatoes used to hold the decorations together had leeched into the base. I wouldn't suggest that one.  Service couldn't be nicer. a bit more focus on menu development could help, I think they have the potential. now step away from the carrot people."], ["Star M.", "So delicious! Everything tasted so fresh! The owner personally brought over a complimentary dish which was amazing! The presentation was incredible as well! When I come back to Miami this is definitely going to be a destination!"], ["Jackie L.", "Good food! Fish were fresh. Presentation was very nice. Thai food were expensively priced. Sushi lunch combo appear to be the better value- delicious, comes with salad or soup & ice cream to finish!"], ["Filipe F.", "NOT ENTIRELY BECAUSE OF THE FOOD. Ordered carry out and the total of order was charged a lot more than normal. Pad Thai tofu was a little different and not that spicy for medium,(the did give me more chilly powder), order 2 veggie sushi rolls and a soft spring roll a Pad Thai and soup. I asked if there utensils chip sticks and spoon  for the soup. Spoon no where to be found:(Bad parking, sad service.  Sad to say thatI am not coming back"], ["Eli B.", "Excellent food! If you are looking for a no frills, clean, quaint restaurant with delicious sushi and thai food, you are at the right place. Beautiful presentation and amazing food! The pad Thai was delicious and the presentation of the sushi rolls was beautiful! Can't wait to come again!"], ["Jonathan P.", "Nikko and the owner Sunshine are a delight to have in brickell! Excellent food, excellent service, nikko deserves more credit than it gets!The thai food is very authentic.  The basil chicken is unreal.  Caution: it's very HOT!!  But you can ask for it very mild (which for them is still hot).  Nikko came over a sat with us and told us a story about how he used to cook privately for the governor once a month on Fischer Island.  The salad's are very good too! His drink prices could be better...that really hurt.  But other than that... this place is so good!!"], ["Kym S.", "Great place to go with friends! The staff is very friendly and attentive! The food has great portions and tastes great! I recommend the 3 musketeers roll and for desert the Thai Donuts!"], ["Mina K.", "I went in with high expectations, based on reviews, and while the food wasn't bad, I will go to other sushi restaurants in the future. I found the rolls overpriced, though they were beautifully presented. There wasn't anything exceptional or memorable about our meal."], ["Isabel H.", "Excellent service. Food is simple, but good. Great place for a light asian fusion lunch. Loved the Tuna Tartar!"], ["Paul D.", "This modest, modern restaurant might get overlooked in the glitzy Brickell dining scene- but it shouldn't. I've had some of the freshest and most flavorful food of any restaurant I've been to, Asian or otherwise. The Tom Yum Goong Two soup is incredible- the lemongrass flavor explodes in your mouth. All the vegetables and salads are crisp and fresh. Everything is great here, it just depends what you're in the mood for. Service is very friendly and attentive. Sunshine (the owner) is almost always at the restaurant, and he told me that his mom (who I met there as well) does most of the cooking- which explains why it's so good, like homemade. While I love walking in at any time and getting a table, more people need to know about this business to enjoy it for themselves."], ["Sof G.", "Delicious little find!! Had the shrimp sushami dumplings and the crab roll- so good!!!"]], "Siam Bistro": [["Nancy L.", "I love this restaurant. Food is authentic, fresh and delicious.They also have brown rice as an option. Owners are very friendly and make you feel special."], ["Faby P.", "yum yum yum!!! Ended up here looking for something new and fell in L-O-V-E! We had their lunch specials, which are pretty amazing for about $6-$8. The lunch special selection is huge and they offer it on Saturdays, which is rare. The spouse had the yellow curry (which he wasn't in love with, but oh well) and I had the pad thai w/ tofu, which was a little greasy but perfect. Both were served with a spring roll (YUM) and a soup - but being the picky pains in the ass that we are we upgraded for their wonton soup which was amazing. It had little chunks of roasted garlic in in and was so tasty and delicious. It gave our favorite thai place's wonton soup a run for their money, and we've been having a mental Bobby Flay Throwdown amongst ourselves searching for an adequate competitor. The owner was our server, he was so sweet and welcoming. The place is cozy and cute and definitely my new favorite hole in the wall in the area."], ["Suzen A.", "I am not sure how this restaurant get a 4.5 stars but it is very opinionated and the misinterpretation of what good authentic Thai food is very misleading. I had chicken and broccoli. They gave a total of 4 pieces of broccoli and the pad see EW was overly sweet after two bites you are overpowered by the sweetness you no longer desire for more. The fried rice that came with the meal was undercooked and the service was super slow. I have tried many different Thai restaurants and this is by far one of the worst Thai food I have ever had."], ["Val B.", "Great service and very friendly. They take real care in packing to go orders. Crispy duck, volcano fried fish, and papaya salad are fantastic. The sauces that come with the duck and fish are amazing. The papaya salad is fresh, crisp, and fresh. We had to end our meal with Thai doughnuts and Thai iced coffee which were also excellent."], ["Sergio P.", "This restaurant is located in a strip mall, but once you are inside, the décor is cozy and the staff is attentive.We eat here regularly and have never been disappointed. Their lunch specials are delicious and affordable. Dinner is also affordably priced. I love all the curries, but the green curry is my favorite. In addition to Thai, some Vietnamese dishes are served. I haven't sampled these but plan to in the near future."], ["Rudy C.", "This place gets better and better every time I eat here. The owner's are really nice and the service is top notch. The food is good. I've eaten here through three different owners, and the owners now are the best.The best part about Siam Bistro is that their lunch menu runs through Saturday. For a kid that plays basketball in the morning, I am extremely hungry afterwards. My friends and I came here one Saturday after playing a few games and we went to town. We each ordered soup. My favorite is their version of Bo Bun Hue, which is spicy lemongrass soup, with grilled steak. We also ordered a meal to go with the soup. The lunch menu comes with spring roll, and a small soup of the day. The three of as basically order two meals, so we got soup and two egg-rolls each.I have to mention the solid waitress because she is really good, very fast and consistent with asking if we need anything or refilling our drinks. The time my friends sat down there was only 1 table filled. As a few minutes past more and more groups came, but she was consistent and timely with water and the food for everyone.Siam Bistro is never packed but has constant regulars that pass through. So if you are looking for good food and if you are around the area, stop by because you will probably get a table as soon as you step through the door. They also make a very good fired ice cream.I'm always happy eating here."], ["Kenny L.", "Masaman curry duck is great."], ["Sandra S.", "Awesome place!!!We have been coming to this restaurant for years. Sam the owner is one of the nicest, most attentive and pleasant people I know. (hard to find in Miami) From the minute you walk in, he makes you feel welcome.This is a family run restaurant and everything is fresh  made and delicious. I have three children and we all LOVE to come back over and over. We have tried almost everything in the menu and we have never been disappointed. Some of  my favorites are the coconut milk/lemon soup,  the duck, the pad thai and all the curries are delish. Their food always, hot and great tasting. The  thai donughts are always the best to finish whatever you ordered.LOVE,LOVE, LOVE this place!!!!!"], ["Erik-Lizzie D.", "Its missing one star because they really need to update the decor! The old carpet, green and blue walls, wood paneling, curios, and best of the 90s cd have got to go! Besides that, great!I found this place on Yelp and decided to try it so that we wouldn't have to go all the way to our thai place on Bird Rd for thai food. We came on a saturday about an hour after they opened and the place was empty but by the time we left there were atleast 4 or 5 other groups there. Service was prompt and SUPER FRIENDLY!!We had the triple threat for appetizer, its spring rolls and 2 other crunchy things, I have no idea what those were but everything was delicious. Husband had the thai steak and jumbo shrimp. It came out on a sizzling skillet, big portion w/ brown rice. I had the teriyaki chicken with brown rice. Omg awesome! Thai donuts for dessert OFCOURSE! And the lemonade was strong as it should be! Total was about $60, sooo worth it, nice chill spot in one of my fave strip malls. I can't believe we never noticed this place before. Honestly just looking in from outside it doesn't look like a place we would frequent but thats why I go by the reviews!"], ["alex c.", "The must eat is the three friendship.  They also have the sticky rice with mango dessert.  This place is a must go for the straight Thai type food.  They do their rendition of Pho for beef and chicken.  Its not the authentic Vietnamese style but to save a trip to broward where the real deals are, it takes care of the urge to PHO.  ITs a family run business."], ["Michael C.", "My friends and I still make monthly treks to Siam Bistro, but we've been getting more creative. This helps since they have updated the menu, combining items together rather than the old Thai menu and Vietnamese menu.The food is still exceptional and I can now highly recommend the Pad King and the Pad Gratium for fans of stir fry, as well as the entertaining Volcano Chicken.I still recommend ordering your food medium, and then asking for the spice carousel to add the perfect amount of heat. We have one friend who gets things hot, pours on the extra spices, and then ends up sweating the whole meal."], ["Krystle C.", "I'll keep it simple..it's the best Thai food you'll ever have and it's family owned..I wish I could eat everything on the menu at once."], ["Brian L.", "Great food. Served in pretty good portion sizes too. Mostly Korean and some vietnamese dishes. Small, quiet and cozy restaurant. Service was bad, though. Came here on a Sunday afternoon and there was only one waiter/host. It was the same person. He couldn't keep up with all the tables and when someone at our table asked him something he doesn't give a proper response. My glass of water was empty for half the meal."], ["Vanessa J.", "I don't even know where to begin. I was in the area and searched on yelp for a place to eat, this came up and we just had to try it. My boyfriend had some sweet steak thing, I had the Volcano Chicken. One word=AWESOME. It was literally on fire when it got to the table, and it tasted like god took a holy dump in my mouth. Meaning it was epic, or Glorious, whatever you want to call it. Cannot wait to go back. Oh and the service was beyond perfect."], ["Eva U.", "This place is the best Thai I've had in Miami hands down. It's a family run restaurant,  and they are some of the nicest people I've ever met. The currys, all of them, are great. BUT THE GREEN CURRY, OH MY GOD. There is nothing quite like it it is seriously incredible.  The dumplings are also delicious, and although I haven't tried it (because I never stray away from the curry) my friends are all obsessed with how good the pad thai is here. Its a great atmosphere, great food, and a great restaurant experience. 5 stars across the board!"], ["Roy M.", "Amazing food. Always consistent and great. Beef Pho is my fav by far."], ["EJ P.", "This is the best Thai restaurant I have tried in Florida. If you live in Florida, it's worth a drive to come here. If you live in Miami, you're an idiot if you go anywhere else. Truly authentic and delicious Thai food. Try the summer rolls, the tom kha, the panang curry. I can't WAIT to go back to this place! LOVED IT!"], ["Michelle W.", "YUM!!!! I just literally walked out of this place from lunch and I'm so fat and happy I need a food coma. I recommend this place for lunch because they have awesome lunch specials!! You get soup, a spring roll and your meal. Prices start at $6.95. I ordered a Thai iced tea which was wonderful with all it's evaporated milk goodness (by the way, try this if you never have. It's a very unusual taste, but if you like spicy food it will put the fire out on your tongue so you can eat more!). The soup was your standard cabbage Thai soup with just the right amount of green onion, my spring roll was freshly deep fried, crispy, had a nice touch of black pepper & burnt my tongue in my zeal to eat it. My main dish I ordered the Masaman curry with tofu. It was excellent. The dish is a yellow curry with coconut milk, potato, onion, cashews & your choice of meat - I picked tofu. Everything was cooked to the perfect texture. I just wish I would have gotten it a little more spicy. I usually go for medium on my first try somewhere and go from there. Next time I'll go hot. The service was quick and their politeness reminded me of when I was in Thailand. I could only finish about half of my curry because of the soup & spring roll and they were so worried something was wrong. I had to assure 3 people that I was just full! So, I am happy to have my left overs in the fridge for lunch tomorrow. I can't wait to go back and try more things. With a few more visits and continued success I will probably upgrade this place to a 5 star, hard for me to do that from only one visit. I really did enjoy my food and service here!"], ["Danilo F.", "I eat here from time to time, and I keep coming back for 1 reason alone... Consistency!Every single time I have been to Siam Bistro the food is good. I've had a bunch of different things on the menu, and never a bad one.If you are in the area, it's worth checking out."], ["Jonathan P.", "This is a GREAT place to eat! I love love love the crispy duck and the pad tai. Also, one of the greatest things about this place? THE LEMONADE! The waiter is always very nice and they have a wonderfully cute little daughter that will come to you and ask if everything is alright. I enjoy taking new people here if they've never tried Thai or Vietnamese cuisine. Highly recommend. A little pricey but sometimes you have to splurge."]], "Bangkok Bangkok": [["Liane W.", "TL;DR: If you haven't been, try it out.  If you have, and didn't like it, come back and try a different dish!Between this and Rock a Bangkok, I always have difficulty choosing.  I love going to both!  :)  The dishes here, I have found, are more often than not very tasty.  I have had very few problems with the dishes here, and I have been coming here for the past 5+ years at least.  (Was a regular dating spot for my fiance and me.)Dishes I'd recommend:+ London Bridge (something or other): I LOVE this dish.  It's ribs and fried rice.  The ribs are amazing.  They're always super juicy, the sauce it comes with is DEE-LIH-SHUS.  lol!  I always ask for extra sauce so I can top it off on my rice.  (I probably have to run for another hour just to burn off 1/4th of what I eat here... lol!) Unfortunately, it is a little pricy at $16.95, I believe.  But, being a total foodie, I am happy to pay a few extra bucks for lick-my-fingers tasty food.  :)+ Pad Thai: One of the staples we tend to get here, although we've been coming here more (recently) for the London Bridge dish.  :'D+ Appetizer: Chicken Drumsticks (something like that): These are so good!  This is always super juicy, perfectly fried, deliciousness.  Love dunking it in the sauce it comes with and gobbling it up.  :)This is all I can think of off the top of my head.The customer service is always average, if not a bit better than average.  Don't have anything negative or super positive to say."], ["Julia C.", "This place was mediocre.  We ordered the tom kha khai soup, chicken red curry,  and the earth, wind, fire beef. The chicken had a bad taste and was fatty. The beef was good but I wasn't crazy about the really thick, sweet sauce it was in. This was my least favorite Thai restaurant, I've been to many."], ["Anthea P.", "Thai has got to be one of my favorite foods ever and I always come back to this place even after trying so many spots, this one is still my fav! The atmosphere is so cool when you walk in and very authentic, the staff is super sweet and actually talk and get to know you, unlike some restaurants where they just ask you what you want to eat and leave you be (which is nice sometimes lol). They have great portions and prices, I usually get the panang curry and every time I order, its always great. I also like VERY spicy food and its always made perfect for me."], ["Sandra C.", "One of the more expensive thai places I've been to. Got take out for dinner and food was ready in ten minutes. A bit fast, in my opinion but oh well..We got earth wind and fire, chicken panang curry, and a pad thai appetizer. Everything was blah. The best out of the three dishes was the earth wind and fire.. but it was a bit too sweet.The pad thai noodles were cut into really tiny pieces and were kind of mushy-- I feel like we got someone's leftovers.Chicken panang curry is my go-to dish at thai restaurants but I was really disappointed.. it lacked flavor and had no heat. It almost tasted like we were just eating watery cream.A bit after the meal, we felt nauseous and sick. My mind immediately went back to how quickly our food was ready..To recap: overpriced, underwhelming food and it made us sick. definitely not going back"], ["Stephanie B.", "I've been here a few times and I've never been disappointed. Their Pad Thai, beef satay, and Little Big Man is always great. I was a little surprised though, they've lost half their space-I wonder why. I hope they stick around!"], ["Mercy G.", "Restaurants in Miami come and go but this place has been here for YEARS and it's not going anywhere! They have  true Thai food, not your typical \"Thai restaurant\" they have truly authentic stuff on the menu! Everything is full of flavor and although the staff is not always super chatty the food trumps that small negative... The restaurant has dim lighting and a nice relaxed atmosphere for both lunch and dinner. This is an unexpected gem in a shopping center but do NOT be fooled... the food is quality food! Whatever you do, save room for the fried donuts!"], ["Jose A.", "Small space. Nicely decorated. Service was good we waited about 30 minutes because it was busy  after that the service was prompt as you are served by more than one person . Fair menu but not as many choices as I have seen in other Thai places for example other than pad Thai no other noodle dishes . prices are very reasonable no t even the house specials were more than $20.Highlights of the night were the fire and ice 2 non spicy and the sauce was heavenly plus they serve it light up on fire literally! Also the fried rice was probably the best I have ever had.. Kind of crowded but it was a Saturday night."], ["Jammie K.", "My favorite place for pad thai in Coral Gables."], ["Mark S.", "Lived in Thailand for 5 years, and let me tell you, this is legit Thai! Singha beer, Tom Yum soup, cashew chicken, and phad Thai made it a great experience, I'm going back for sure! Earth Wind & Fire 2 was amazing, get them to add pineapple! I could've stayed and ordered another round of food it was so delicious, only I was stuffed, and still had to get a to-go box. Great stopoff if you're heading back North after a long day at the zoo."], ["Hung D.", "Love this place.  It's another West Kendall institution. Been around longer than I can remember,  and for good reason.  The food has always been excellent and the prices are good for the amount of food you get.  Lots of textures and flavors with Thai food.  I really enjoy the crispy duck  and seafood platters. Lunch specials really hit the spot and is a much healthier alternative to anything else except a salad."], ["Michele L.", "The parking lot is under construction so you may end up at a dead end to find parking.  The mall is also very old and run down.  We were seated immediately and noticed not a wonderful Thai food aroma but the scent of ammonia or mildew.  Not a very good first smell inside a restaurant.We ordered the spring rolls which were a typical Thai/Chinese egg roll.  The beef satay was thin but very chewy with threads of fat throughout.  The sauces were very weak-the peanut was heavy and thick without flavor as was the cucumber sauce because it was without the vinegar and pepper flakes.  The Tom Khai Khai soup was watered down, it was not creamy and heavy with coconut milk.  The chicken and mushrooms in the soup were cut into chunks that were too big to fit on the spoon.All of the dinner entrees were very small in portions and lacked ingredients.  The Pad Thai had a few pieces of chicken, 5 small shrimp, bean sprouts and peanuts.  The red pepper chicken curry did not have a red paste and had only had a few pieces of red pepper ribbons, not strips.  The large prawn curry with broccoli had the same curry sauce as the red pepper chicken curry dish but it had a nice bed of steamed broccoli florets.  So, the highlights were the large grilled prawns with broccoli curry dish and the pear saki.  There are so many other quality Thai restaurants that this one just doesn't compare."], ["Alexander R.", "Great value.Cute little restaurant with delicious food and great presentation. London Golde Bridge was awesome! Also good was the shrimp in a blanket and the satay. Seemed like I couldn't go wrong with anything I chose of this menu."], ["Ivonne G.", "It has been years since I come here. I was at off the grill next door and it was way too packed for the wait. We stumbled in and were seated immediately and the service was really good. We placed or order and were served quite quickly so I'm not sure if some of their food is pre-made. Regardless the food was really good. They were very sweet to my little girl so that's always a bonus. It was a 30 minute outing. Not sure if we will be regulars but probably will go back if in the area."], ["Michelle L.", "Had never been to this Bangkok Bangkok but I was pleasantly surprised. My sister suggested it for a family dinner. The decor is traditional Thai, although I feel like it needs a little remodeling, it has its authenticity and charm. The food was nothing short of spectacular. We each tried a different curry dish, which the curry sauce was amazing, and the earth, wind, fire III dish. This dish had the best presentation, definitely got that wow effect. The sauce poured over was lit on fire! The food came out so fast and everything was perfect. Bangkok Bangkok made this family dinner great. I will not hesitate to return. Definitely a hidden gem in Kendall,"], ["Carla L.", "How does this restaurant get so many stars? I have been to almost every thai restaurant in Miami and this by far is te worst. The beed curry had no flavor plus the beef tasted like spoiledbeef. Disaapointed"], ["Jessica G.", "The hot and melty Pad Thai hit the spot."], ["Kate O.", "Food is nice but the staff can be rude and mean with you. So just FYI that if you are in nice mood to eat out then may be not here try other places where you are treated well and worth your hard earned money."], ["Elizabeth M.", "It's a relatively small restaurant, but the food was excellent. I had the pad Thai, and it was my first time eating Thai food but it was pretty good! I also had the Earth, Wind and Fire with chicken, two stars of heat, per other reviewers suggestions and it was delicious. Two stars of heat definitely gives it a kick, but the white rice balances it out nicely (there's a total option of six or seven stars of heat, I was told by my SO for the highest level of spicy you need to sign a waiver.... Not sure how true that is, but I imagine it's unbearably spicy if two stars have a definite kick to it). Service was definitely on point. This is a place I will definitely be visiting again."], ["B G.", "Still amazing as usual.  Went last night and left with a smile.  Ribs and fried rice everytime.  10/10"], ["Ellen H.", "Every single thing we ordered was delicious. Satay came out with a fun little grill and peanut sauce was delicious. Thai iced tea was heaven - ordered 2!"], ["Nicole W.", "I'm not sure what everyone loves about this place! We ordered an appetizer portion of chicken pad Thai. It wasn't anything special. The sauce was cloying...I didn't like it at all. For the main course, we ordered the Kiss Me Pork and Earth, Wind and Fire with chicken. I had to send the Kiss Me Pork back, as it was flavorless and chewy (overcooked)! The Earth, Wind, and Fire was edible, but I wasn't very fond of that sauce either as it was too sweet. I won't be back! I wish there was a Thai restaurant in Miami that is as good as the now defunct Thai Orchid on Sunset Drive! That place was awesome!"], ["Jorge M.", "Local Thai restaurant in Kendal.Located in a strip mall with plenty of parking. Has a Thai decor inside with plenty of tables and chairs. Staff and service is ok.Started off with a Thai tea. Just like any other Thai tea. Then I had the Tom Kai soup. That's made with coconut milk, shrimp, citrus juice,  and mushrooms. It was tasty but it had to many mushrooms and not enough shrimp. Then I had the Pad Thai with shrimp and chicken. It was ok but it had chicken that was chewy and some had veins running through it and not enough shrimp."], ["Jennifer R.", "One of most favorite spots in Miami. When I lived in south Florida I frequented so often that when I moved back to Orlando I went through withdraws of pad thai. I went on a quest to find a pad thai that would cure my Bangkok craving and I found NONE that could even come close. Every other dish I have had here is equally as awesome, this place does not disappoint!"], ["Scott G.", "I think I'm in a good mood to be giving this place even 3 stars. Mediocre Thai food which is way over priced for what you get in return. Have eaten some great thai in Miami, this unfortunately wouldn't even make the top 20. I paid 43.00 for 2 curry dishes and a fried rice. I was very dissatisfied after eating my meal."], ["Luis C.", "I am kind of a Thai-Food fanatic. So it comes with a heavy heart to say that this restaurant was a disappointment. I went with my girlfriend for the lunch special to get an awfully prepared, icy salad, subpar customer service & rather tasteless plate. The only salvation was that it has some variety & traditional decoration."], ["Chimichanga C.", "Chicken Pad Thai Gods live here. Literally. This place is heaven, and HEY it's a REAL Thai place. Not mixed with japense or other oriental foods. This is straight up yo'! LoL. The servers wear the authenic thailand dresses. My mom suggested this place. This was  my grandparents staple date spot for years ever since it opened up over 10 years ago. I dont know why I didnt come here earlier???! I was in Thai heaven and those flavors they mix the pad thai with( lime, peanut sauce and peanuts) is oh so incredible. They had a amazing special Mon-Thurs for two for only $25, an appetizer, two entrees and thai donuts. I went back last week and they said they are ending the bombdiggity heck of a special. Jan 2012 :(. It's okay prices are decent and when I want to hit that Thai craving this is my #1 spot!"], ["Virginia M.", "Lunch specials here are worthwhile...lunch portions here are very big for being 'lunch'. I loved the Pad Thai served here and my boyfriend loved his milk-based coconut soup. The service was excellent as it was quick and absolutely delicious! They were missing any really hot sauce but had some pepper flakes- but I love my Pad Thai HOT! :)"], ["Mary M.", "If only the management of this restaurant have paid attention how the customer is treated right under the nose of a manager I am sure We would have never turned our backs to this restaurant. Good food but extremely unfriendly staff. The whole experience becomes scary that how they are going to treat you. Never going back."], ["Pachuco K.", "Been here a couple of times and the food is always up to par. Not a big restaurant, can get crowded on weekends can feel like you are a little too close to your neighbor depending on wher eyou sit. My favorite dish is Earth,wind and fire up to a level 3 heat. ( they have different levels of heat 1being mild ) Be WARNED !!!!! when they say Spicy they MEAN SPICY, I can and do eat very spicy foods. THis was borderline hot for me, I did think of going to a 5 whewwww thank goodness i didn't,  the dish was flavorful even with the heat.  and a nice portion.I've gone to other places like the Thai on US1, their 5 is a mild !!!! and the food was not as good as this place, ( the owner swears by it , he kept reminding us he was rated by the Miami times as one of the best. Really ??!!! This place is the one one I recommend when asked about a good Thai restaurant; so far everyone that I've recommended to go there has been pleased."], ["Karla D.", "Amazing! Had the pad Thai n Tom yung goong soup and both surprised me w their taste, but had me hooked w the first bite. The floor seating adds to a unique and fun dining experience as well. Will definitely be going again!"], ["Fausto P.", "I have not been here for a while and it was great that the place has been remodeled and the food is still good, but the temperature inside was too cold. I felt uncomfortable the entire time I was eating. I guess I won't be back."], ["claudia l.", "I didn't see Pad See Ew in the menu, and the server asked the cook, and she said she could make it. It was delicious. I also had their Tom Kha Gai, and it was delicious too, although perhaps I remember it being less salty and less limey. Love the ambiance, and there seems to be a good feeling of harmony among the staff (unusual comment, I know). I'll update more as I come back, since this is going to be a regular spot now."], ["Katy S.", "Bangkok Bangkok . Why can't I eat you every day? Other than the fact I would be 5,000 lbs and broke, I would!!  Holy sh*t, this place rocks my socks! Here are some of my favs: -Coconut milk soup (O.M.G!!! mouthgasm!!)-The meat kabobs (they bring them out on this mini grill looking thing with some amazing sauces!)-Fried Rice (perfectly cooked and not greasy like Chinese)-Thai doughnuts (sooooooo good, with that dipping sauce!)MMM...Mr. Bangkok , I really love u!"], ["Yaneth Z.", "I went here for my first time tonight and it was awful... As app we had satay beef and it was chewy/rubbery tasted like liver...I couldn't bite into it had to use knife when it should be eaten as a skewer (one try was enough for me) ./.I had Pad Thai and I gave it to my bf as he eats anything it was supper sweet and again the quality of the chicken was bad ... Both meats tastes of very poor quality and it was very gross... Also the ambience was depressing and staff looked uninterested to be there... I'm from LA with many terrific Asian cuisine so maybe I have higher standards I'm still hungry!!!"], ["Stephanie L.", "Earth, Wind, Fire...is this an entree or the opening for a Captain Planet rerun?  The menu at Bangkok Bangkok boasts some unique options, my favorite of which is the Earth, Wind and Fire III, which comes with chicken breast, shrimp and perfectly tender beef with mixed vegetables and cashew nuts, swimming in a light and flavorful Thai sauce.  I've tried a few other entrees, but this is definitely my standout.       Going back a course, the mee grob is good but I've had better.  It comes with lots of stuff in it, but the flavor of the sauce is just not quite right to me, and the vermicelli noodles sometimes taste a bit soft (almost like they are stale).  The satay though is definitely a winner, with a cute little flambee grill for you to heat your skewers, and peanut and cucumber dipping sauces of fantastic-ness.     Full of charm, the atmosphere is dim and romantic.  The best part is, they have a seating area in the back where you can get the experience of sitting on mats on the floor.  Apart from the fact that it's always fun to show off your pedicure, it adds fun and authentic feeling to the meal.  Gives off the vibe of being a nice, family-owned place, the service is always wonderful.  Can't say everything is on the menu is worthwhile, but definitely the elemental named dishes are a hit!"], ["Kristin M.", "I've got three words for you: EARTH, WIND FIRE!Food: AThe most asked for plate at Bangkok Bangkok is in fact the Earth, Wind and Fire...Why? It is chicken, shrimp and steak with vegetables smothered in FIRE? Yes, the waitress  brings you the plate and then tops off the trio with a seasoning which is lit on fire which makes the Earth, Wind and Fire succulent in every bite!  Although I cannot speak for most of the appetizer menu,  I can speak to the \"deliciousness\" of the steak sautay!! Nicely presented, the steak sautay is brought to you on a heated, fired grill where you can cook the meat to your taste...the steak is mouth watering juicy! My personal favorites are the Lovely Ginger Steak and the Thai donuts!!  All of the other plates I have tried have also been very, very good!Ambiance: AI love it how you have the option to sit on the floor.  Take off your shoes and feel right at home. The small, short tables and pillows really enhances the \"Thai\" experience.  Although it isn't the most comfortable, it is always fun to sit on the floor.  Don't worry, if you would like to eat at a \"normal\" table, they do have \"normal\" seating options. Service: BService is okay and I have never been served  by someone who has exceeded my expectations. Sometimes they are slow, sometimes it's fast... its a roller coaster guessing game... I wonder what my next trip will be like? hMmMCons: No refills on sodas (Really?? Who doesn't give refills??)  Not kid friendly- leave your kids at home... there are no childrens menus and because it is a quiet restaurant a rambunctious , loud child will be constantly stared at. Overall, TERRIFIC THAI CUISINE!!"], ["Johnny L.", "This place is hidden in the middle of a shopping plaza (located in the back next to the cleaners). But despite being hidden, this place gets packed! We came on a Friday night around 8 and had no idea how packed this place could get. It looks like a small little place from the outside. On the inside, it's this nice, cozy, intimate place to be. There was an hour wait, so we decided to get takeout.We both ordered the roasted duck darling (14.95). The price is pretty good for half a duck and the portion was decent enough. The vegetables portion was large and really covered up the duck, making the duck portion look kind of small. Will definitely have to try and get a seat next time at this place. I would definitely come for lunch next time, because prices are better for the duck."], ["Lady A.", "Slow service & okay food. The only thing I liked was the duck. The pad thai was overly sweet & wet. The beef salad was chewy but the duck was good. It was however $25 for the duck. The meal came out to $70, which is a lot for 2 ppl eating Thai. I would not recommend this place nor would I ever return."], ["Emma J.", "Who knew?! Myself, the hubs, and our friends couldn't decide where to eat and didn't want to drive far either... load and behold this place is around the corner from my casa.. PERFECT! We get greeted right when we walk in, and seated asap. The service here is beyond wonderful! I was new to the menu but thanks to our wonderful waitress, and my Thai expert Tory sitting next to me we were all able to figure out exactly what we were craving... Side note: we all got a kick out of the name of this dish.. maybe it was because we were delirious from being hungry or maybe it is that we are all nerds but hey we got a kick out of it... Gang Phak. Food service super fast! Just the way I like it, and it shouldn't be any other way! ;) Any hulas, I ordered a curry dish with chicken shrimp and pineapple slices... I cannot remember the name of the dish just the number G2 haha... It is a spicy dish and boy do I love spicy dishes! It is rated from 1 to 5 stars 5 being the hottest... I ordered 3stars... both my Thai expert and the waitress suggested I do 2 stars because they thought I could not handle it... Uh hello! CHALLENGE ACCEPTED! Food came out quickly and as it came out quickly, it was gone quickly! So if you are wondering if my challenge was successful... I FINISHED it all, and without breaking a sweat unlike my dear friend... He had to wipe his forehead pfft and he calls himself a Thai expert who can eat anything, I LAUGH! HAHAHA Okay any ways back to the review... Dinner GREATNESS, FLAVORFUL, just packed with yumminess -- no such word to regular people but food reviewers such as myself (lol) you guys know what I mean! Dessert! I thought I couldn't handle any more but I made room for these \"donuts\" dipped in this heavy condensed coconut milk topped with nuts! What a way to finish the meal. The location is in a nice small shopping center, next to a CVS so if you guys go and end up having heartburn or any other stomach probs after having a spicy dish it is very convenient =] It is not brightly lit so it gives a cozy vibe, but decorating ehhh they can do better but hey the food is what counts, and again the staff is on top of you like white on rice!"], ["Vanessa J.", "I'm a huge fan of this place. I'm the type of person that always orders the same crap. I had some steak with (endless) rice, it was great. But this one time (I decided to be a risk taker), I ordered a whole fried snapper. It was AWESOME. It was made with some kind of sweet sauce?  I don't know, but it was AWESOMEEEEEEEEE. And I say endless rice, because you can have as much rice as you want. Service is excellent, oh and the THAI DOUGHNUTS are FANTASTIC!!!!!!"]], "Bangkok City Thai & Seafood Restaurant": [], "Sea Siam": [["S K.", "I order take out from here weekly. Fresh/delicious fish. 100% recommend- (take out is always quicker)!!!"], ["Javier G.", "I've been coming to this sea Siam location for over 7-8 years! I believe the management has changed in that time but the quality is still really good! The staff is very friendly and accommodating. The sushi is really good and fresh I haven't. However my all time favorite is the volcano chicken! It's delicious and it's plenty to share with another person! Don't hesitate to try it's amazing!"], ["Lia N.", "Best thai place in Miami!I've been coming to this place for years! The pad thai, the sushi, the chicken satay! Omg the home made peanut sauce....to die for... I drive miles just to eat here!"], ["Israel R.", "An Asian blend loch ness hidden amongst a plaza of delights. Ok so it isn't really elusive. The oriental lion statues guarding the entrance and huge blue sign make it easy to find. As far as aesthetics go, SS was as pleasing as it could be for being just another hole in a shopping plaza. It's fairly dark on the side with the bar due to a lack of lighting (the used all the bulbs from the roof to decorate the bar) and tinted windows. Not a bad thing necessarily, especially if it's a blind date and he/she isn't very appealing... which wasn't the case for me.I thought the menu was pretty interesting. First time at a thai spot for me - tossing in some Japanese bites in the menu definitely helps ease you into the experience. The prices were a little higher than i was expecting since it isnt in a hot or trendy location, but the moderations were filling so we can look passed the few extra bucks.Waitress was attentative and checked on us many times as we sifted through the endless menu for 15 minutes before finally deciding what to get. Once we ordered, the appetizer (seaweed salad) came out fairly quickly but the sushi and main dishes took quite a while. My date and I are bother pretty boring, so this was almost torturous. We started with a \"seaweed salad\" - what can anyone really say about seaweed salad in general? Salty grass. It definitely wasnt overdone though, we both thought it was done right.Next came an order of \"California eel rolls\". The rolls looked and tasted great, but seemed like they were losely wrapped and difficult to keep together - even with my karate kid style chop stick mastery.About 4 1/2 hours later the main dishes came. I had the \"Chicken pad king\" and i cant recall what my date had. The veggies in my dish were just right and the ginger sauce really made that chicken. My date's dish revolved around a sauce that looked like baby vomit, and it very well could have been, but after a few dips in that sauce it actually started to taste decent. Definitely go with the ginger over anything green though!Overall we thought it was all nicely done and tastey. Something i found odd is that my dish seemed to have a lot more meat in it than my date's, i almost wonder if they cater to size? If so then they got it right. If not then we got lucky. FYI sodas are $1.50 per tiny glass. It's 2014.. where them free refills at?"], ["Andrea A.", "We can call a Sea Siam 'the gateway' because its the restaurant that made me love Thai... And then venture into other Asian cuisines that I now love. So like any other gateways... It can be dangerous, like wanting to eat Thai and Vietnamese every day dangerous.Whenever I try other Thai places, I compare it to sea siam as being my gold standard. Yes, Bangkok Bangkok is good, tani Thai is good, moon is ok... But sea siam is still my número uno. I've ordered everything on the menu and their tom kha gai soup is so freaking good, I want some right now. Many times I get the ginger salad and gang dang curry chicken. Best curry I've ever had- aside from Thailand. Let me warn you, if you say Thai hot- they'll give it to you. And you'll be sweating, but it's a good sweat.Last time we sat at the bar with the owner (I think) and drank wine cracking jokes with him. Sometimes he's super dry and sometimes he's loose. That's humankind, can't fault him for it. I digress... So I ordered the Miami vice 2, which is salmon, asparagus and avocado wrapped in cucumber. It was so good, might be my new go-to. It's really light but enough protein to keep me full! Save yourself some time and sit at the bar! No kids there either-- dig it!"], ["Jackie H.", "Although I frequent this restaurant, I must say, it is not out of personal preference. It's more because the family always chooses it, and because it's so close to us. This location can be very loud if visited during busy hours, but at times it can be an enjoyable experience. It really is a \"luck of the draw\" type situation. The food experience has been so-so, mediocre at best. The combination fried rice tasted good, pretty flavorful, but unfortunately very oily to me. Yes, I realize it's fried rice, but it left me with a lip gloss sensation afterword. I'll let you think about that.I enjoyed the beef and chicken satay, it was tender and nicely seasoned with a good balance of curry and coconut milk. But I think for what we got, it was a bit overpriced. For my preference, the miso is too salty and the salad although  pretty fresh is overdressed, however, these are things that vary from person to person. Lastly, the pad thai was also pretty oily, barely tasted like anything, and the chicken was overcooked and rubbery.The last time I ate sushi there I was highly disappointed. We ordered a double for two, it's a lot of sushi and it takes four of us to finish it. The JB and California rolls were okay, even the Nigiri were okay, but when I reached out for a salmon sashimi*, it just felt and tasted terribly wrong. I was disgusted, and even got goose bumps, but thank goodness I had a napkin in my purse. I had to spit the sashimi out because I felt like if I swallowed it, I would've gotten sick. Ever since then, I've been scared to order sushi again. (*I've had ok tasting sashimi there on previous occasions, but this is not something I like to gamble about)Service Pros: I've had good experiences with service; they try to get to know you, service is quick, and they even try to remember our past orders. On an in between note, one of our waiters messed up our order, but she quickly and happily corrected it. {She picked up the sashimi from the boat, and exchanged it for what we had ordered. I hope they threw it away? *suspense!*}Cons: We have been victim to a random plate or silverware being dirty, but it's nothing that can't be fixed.  Extra: It might be time for new covers on the booth seats, they're looking a bit weathered down. and they may want to consider re-tiling or deep cleaning the tiles by the sink in the women's bathroom (maybe men's as well?) as they're covered in mildew."], ["Lucy D.", "My husband and I had a late lunch Sea Siam. The food was ok. The prices are reasonable, portion size are very good, and service was also very good. The restaurant is a bit run down and can use a bit of updating. My husband ordered the Pad Thai Beef and he thought it was pretty good. I am not making this up but to me it smell like my Yorkie's paws. Overall, I did enjoy the food and would probably return."], ["Liliana E.", "I don't like writing a disappointing review but I feel it's to help one way or another. I went today and ordered a lunch special which included a soup of the day (flavorless broth with noodles and pieces of chicken), an egg roll (smallest I've ever seen) and yellow curry with beef, with very good spice level but the flavor wasn't right. It was a $10 lunch special in which I got what I paid for."], ["Christina N.", "This is my family and I only favorite Thai restaurant, we go almost every other week or in the mood for some Thai or sushi..We come here every year on my birthday as well. The staff is so down to earth and polite and they always greet you warmly when you walk in, waiters/waitress checks up on you and never leave you stranded. The pad Thai is scrumptious and so savory. I often come her because of their sushi as well. It's always fresh and delicious, never a disappointment. The decor always gets me in a Thai mood, like I just been transported haha. Nothing bad to say about their customer service, food and decor, the only complaint is that almost ever time I go there, there is always a noisy customer. Other people are trying to have a nice quiet dinner so please shut up."], ["Max T.", "I have been coming here for many years.. The menu is good and the  people are friendly. I have been down at them at times, but i always go back because it is the best thai in the area. The sushi is good, the lunch menu is excellent, the gaNg dang is delicious"], ["Lyndsey W.", "Sea Siam has always been a favorite restaurant of my family. We have been going there for years. We always get an order of jumping squid. The last three times we ordered it, it has been really fishy and just not good at all. I don't know if there is a new cook or a recioe has changed, but it's pretty bad. Everything else is amazing, as usual. Best pad thai and pad king!"], ["Mickey L.", "I am  sucker for Sushi Thai, but I couldn't just enjoy this place. Feels like its much more expensive and mediocre taste than any other place I been to. By no means bad, but I don't see a reason to return. Basic Pad Thai was satisfactory. Tom Yum Goong was small but lots of shrimp. Sushi was fresh but definitely pricy."], ["April C.", "I was a bit skeptical of going to a Thai and Japanese restaurant.  We had dishes from both and were quite satisfied.Mee Krob:  2/5 - I would pass on this.  It's missing shrimp, or another savory flavor.Usuzuriuri (thinly sliced sashimi):  4/5 - We had it with yellowtail and salmon - both thinly sliced and so fresh.  The only thing missing was a paper-thin slice of jalapeno on each piece.  The ponzu sauce is great with it.  The portion is quite large.  When we order it at other restaurants, it's half the size for the same price.Fried Whole Red Snapper with Ginger sauce - 4/5 - only order this if you actually eat the whole fish.  I love ordering the whole fish, and I'm the type to pick it apart, head to tail.  You won't be disappointed if you're the same way.  It's a sweet ginger sauce, but not too sweet.  It's a bit pricey at $28, but so tasty.  Crazy Roll:  5/5 - salmon skin and unagi... delicious combination.  We would order this again."], ["Josette S.", "It was our first time at this restaurant. We started off with the shrimp in a blanket and the vegetable tempura as appetizers. They were delicious. The batter was perfect on the tempura and it was perfectly fried to a nice crisp. I will say though that for the first price, the shrimp in a blanket wasn't really worth it. For drinks we had Thai tea and that was delicious. For the  main course, I got something simply, I ordered the pad Thai with pork and my mom ordered the volcano roll. The pad Thai had a nice level of spice, which I liked, but overall I wouldn't order it again. The volcano roll was a disappointment. The topping was over cooked and there really wasn't anything volcano about it. It was actually more of like a really crispy pancake. The roll underneath was pretty good since their take one the roll was with salmon, but still it wasn't what I expected. As far as the service, our server was really nice and attentive, but the wait between the appetizer and the main course was too long. By the time the food arrived I was no longer really craving what I ordered. All in all it really isn't a place I would typically come back to. Maybe I just came on an off night."], ["Jennifer O.", "Great lunch specials, which include soup and salad. Highly recommend the volcano chicken, pad Thai, Dragon roll and the red rose roll. Fresh sushi, friendly service."], ["K D.", "I must preface by saying...i've been coming here for years! This is the usual spot where my bestfriend and I grab lunch. Over the years, i have recommended this place profusely to friends and co-workers. It is the perfect place for lunch because of the low price point of their lunch menu, the food is fantastic and the service is good. Dinner is good too...It has quickly become everyone's favorite lunch spot. The red curry and chili fish are some of my favorite dishes here. Give it a go if you enjoy thai food or if you want to try!"], ["S P.", "This is my favorite Thai and sushi place ever!!! I have been here a million times and food is great every time!"], ["Sean R.", "My family and I have been going to this restaurant for the last 10 years and we have never been disappointed. It's always consistent, very tasty great recipes, awesome sushi, awesome Thai food. The Decour is old-school but the food and service a wonderful. I highly recommend trying the butterfly role and the coconut milk Thai soup with shrimp."], ["C F.", "This makes me sad..We have been coming to this neighborhood restaurant for years & have been there so often that the waiters know us. The restaurant was sold and under new management in the last couple of years & there has been subtle cutbacks & changes & price increases but still we have always experienced good reliable food/service. Unfortunately, last night we ordered the Tom Ka Gai (chicken coconut milk lemongrass soup) & the Cashew Chicken. My husband & I both got VERY ill shortly after leaving. I called the restaurant & asked to speak to the manager to let them know about the incident & hopefully prevent anyone else getting sick. They took a message but no one ever called me back!  I called AGAIN & was told that the manager was off that day...so I asked to speak to whomever was in charge.  They actually told me that NO ONE was in charge!  REALLY?!? Maybe that could be the problem!We were really hoping that this was a one-time accident but this is totally unexceptable."], ["Naty K.", "Sushi Siam is one of those \"staple\" places -- a place that has been around forever and is still going strong.  I remember coming here for a date about 13 years ago but the place is even older than that, I believe my parents were coming here in the 80s.  Unfortunately, their webpage design is poor and any information about the restaurant is lacking.  Sometimes, it can impress people if you have a good story behind the restaurant, as well as a timetable of their history.  Maybe I'm weird for liking to read such things.They have a great lunch special deal, but I always seem to miss it, as I tend to be in the Pinecrest area in the evening, but if you're on a budget, try to get their lunch special.They have the standard Thai menu or Sushi menu, and everything is always fresh.  Prices are quite reasonable for Pinecrest, but because the place is almost always full, the service can be quite slow.  I think I waited a good 15-20 minutes before a server stopped by and said \"are you being helped?\".  Once the order was placed though, the food came out of the kitchen at a speedy pace. I wasn't particularly hungry so I ordered a Tom Yum Gai soup and a Jumping Squid.  The Jumping Squid was delicious, although I wish they had put in more lime juice, as it got lost between the leaves of lettuce on the bottom.  The Tom Yum Gai was also good, but it seems to be pretty comparable to every Thai restaurant's Tom Yum Gai.  I'd like to give 3.5 stars, just because service could be improved, but considering they have been around for so long and the food is tasty and fresh, 3 stars didn't seem like enough so I will be generous and provide a 4 star rating."]], "Hibachi Grill & Noodle Bar": [["Sean B.", "The review is for their newest location in Brickell (35 SE 6TH ST), right between 500 Brickell West and the MyBrickell buildings.It's the right sized restaurant, efficiently designed, sleek and clean look.Great for both takeout (pickup and delivery) but certainly inviting enough to dine in.The food was great, price appropriate (great value), and probably our new goto place for Asian food. I suspect it'll become both a great business lunch place for the office ilk across the street, as well as early (and late) dinners for us on-the-go yuppies.Owner is a very nice fellow, who clearly cares very much about his little oasis right smack of north Brickell.The fried cheesecake desert is awesome, and magically, doesn't feel heavy (which is kinda dangerous, and I may order them in pairs :))Good show!"], ["Charlie S.", "Had a decent though inauthentic tasting pad thai here. A bit on the plain side, and lacking the somewhat fermented 'back bite' that a really good pad thai would have (and which, I think, comes from the tamarind paste, normally?). But still, it hit the spot enough for me to give it three stars. Friendly and attentive service, plus very inexpensive."], ["Elliot G.", "Read about it in the Herald. They overlooked the setting: no tables inside, only outside. My orange chicken didn't taste like orange chicken. The curry noodles were overly seasoned. You could feel the grainy curry. My wife's Mongolian shrimp didn't taste like any Mongolian dish we ever had. Her noodles were also overly spiced. One and only good thing to say is that the waitresses were attentive and pleasant. Shame on the herald."], ["Sandra M.", "The food was great and a little it pricy. But the staff is very friendly. We had to eat outside because there's no seating on the inside. It was okay because there are fans outside so it was nice for a lunch date."], ["Matthew O.", "Decent pad Thai and fried selections. The menu is a bit on the boring side. It looks like narrowed version of a chinese take out place. Pad Thai is average but far from authentic. The clear noodle soup with shrimp was ok. It came out hot but not steaming. I wouldn't qualify this as a noodle bar considering they don't sell ramen, pho, or any of the most famous noodle soups presented in a traditional way."], ["Barby S.", "I have only had the chicken lettuce wraps from here and I must say they are pretty good  my only complaint is that sometimes they are a bit salty."], ["Freddy R.", "Súper delicious! It is a hibachi on the go smart concept without having The whole protocol preparation food is amazing!! Mad props this business I totally recommended."], ["Cristi G.", "They helped me pick out a vegan option. Friendly staff! Definitely am coming again! Right down the street from our hotel. Got a yakisoba with veggies. Bomb!"], ["Ch H.", "2 stars for management. Been coming here for a while. Feel a little scammed. Been collecting points and was ready to collect on those points. Instead they will not honor those points because they have decided to start their own new point system. It's not fair and of course the managers number can't be given out. I have been present in the restaurant and witnessed the manager berate his employees in front of customers. Was completely arrogant and had a table placed inside so he could eat his lunch in front of them and the customers. The employees are absolutely awesome and kind. I feel bad for them. Will definitely be looking for a new place to get noodles."], ["Johnny T.", "3.5You have to understand: there aren't many options in Downtown to eat 1.) quickly 2.) relatively inexpensively and 3.) without any fuss. Hibachi fills a void. Is it the most authentic, delicious Asian-style cuisine you've ever had? No. Is it decent enough that you'd come back when in need of something other than a sandwich or something greasy? Yes. Hibachi serves up better-than-decent AmericanizedMy go-to at Hibachi (usually later in the evening and, always, take out; the place is too small to sit and eat) was the Singapore noodles with chicken. (Vermicelli) Noodles, peppers, carrots, onion, snow peas, scallions, and egg served in curry sauce... with two packs of sriracha... for $10? Yes, ma'am. I did it. And I would do it again if I lived in Downtown Miami and wanted to eat solo after 10 pm. The noodles, despite the curry, tended to be in the dry side. The sriracha always gave the dish a necessary kick. BUT, no complaints, even despite the dry-ish chicken/noodles. Again, cheap. Accessible. Hot R&B playing every time I came in. Awesome employees who would call me 'baby' in the way that I miss from '90s era NYC/Philly. Realness. Hibachi gives you realness at all times. In the hot, wet swamps of Magic City, USA that's appreciated. You know what you're getting yourself into at Hibachi. Either you're in or you're out."], ["Ute L.", "Ordered a Thai peanut noodle salad and fried cheesecake for delivery. I asked for the peanut dressing on the side, what I got was a dry salad with NO dressing. Thankfully, I was home and able to whip up a quick dressing from rice vinegar, maple syrup and sesame oil. Otherwise, I might have choked on it. I did enjoy the cold rice noodles, which still had a nice bite. The greens were fresh and the chopped peanuts a nice addition. For a mere $3 they throw a 5-6 ounce filet of salmon on top. Unfortunately, my salmon had been cooked to death and was hard as a rock. I ate half of that sorry dry piece of brick, the rest will be re-purposed into some type of fish cake tonight. Hell, it's not like you can overcook it any more. Now, the fried cheesecake. What a positive surprise. Gooey cheesecake wrapped in crispy fried spring roll skins, topped with caramel or honey (?). Simple yet addictive.  Good enough to maybe give them another shot to see if they get it right next time."], ["Lesly R.", "There was a mix-up between our delivery. The girl answered us with no consolation of our concern and she was steadily finding ways to state it was our fault that our meals was not on time. However, the manager of the restaurant called us personally in order to fix our problem. I see this restaurant as a model of how businesses should behave when there is a problem concerning customer frustration and services."], ["Rene V.", "Beyond excellent...! ! Everything on the menu is outrageous, you cannot go wrong. I eat here with my co-workers at least twice per week."], ["Kirsten T.", "Wow, I can't believe I haven't written about this place before! I live downtown and am pretty familiar with Hibachi. After a long day at work this place is a go to for me because it fairly healthy, delicious and the prices are fabulous!!!! I love the spicy herb noodle and the clear noodle (you can pick your protein). The soups are good but a little small, FYI. The dumplings = awesomeness!!!! The vegetable egg rolls are the way to go, crunchy + warm inside! Plus you have the option of brown rice and they don't go overboard on grease. Score!"], ["Merrell T.", "Maybe we just ordered bad items.  I had the noodle soup and it was bland and the noodles seemed stale.  The Thai salad looked cool but seemed like a cafeteria item.  We also had the pass that which was OK.  I how the other items on their menu are better cause the soup was just sad"], ["Christina C.", "Service was terrible! My family and I went to have lunch, we were a party of 6 and I guess because gratuity is included they don't need to be polite or courteous. The waitress seemed like we were bothering her. They weren't even busy. She never came to check on us once. We had to flag her down every time. Food was just OK."], ["Justin S.", "After my review the owner called an apologized for the misunderstanding with my order. I thought this was a very nice personal touch. Upon return the food was prompt, hot and delicious."], ["Daniel M.", "Two stars just for the friendly staff. Otherwise, the food was awful."], ["Samuel S.", "I just ordered using the eat 24 app 20 minutes ago, I'm shocked at how fast my food came. Like jimmy johns fast. Delicious, hot, high quality pad Thai and Thai donuts too. Never ordering this cuisine elsewhere again."], ["Ed H.", "Quality of ingredients is very good but the overall consistency every time is what makes it great.  I live in Brickell and delivery is always fast.  This food is like benihana on a budget."], ["Jacqueline B.", "First time ordering delivery in downtown. Had the Tofu Pad Thai (my fav dish). Was not impressed. It was extremely dry and the \"thai dressing\" that was mentioned on the menu was very sweet. The noodles and the tofu were sweet. Not what I expected. My co-worker had Teriyaki Chicken with brown rice which was very tasty. The chicken was not dry (as I saw some complaints here), but grilled nicely.Mine was around $10, hers was $12. Pretty typical of downtown these days. Although if you want grilled chicken with rice, Pollo Tropical sells a delicious dish for under $6. Hibachi Grill isn't awful, but it isn't great. I think I'll stick to the Hong Kong Cafe for Chinese delivery."], ["Lory T.", "I work in Biscayne blvd and was in the mood for some Chinese food. This place definitely fulfilled my appetite. I had the orange chicken, fried rice and vegetables. Since I had it delivered, there was an extra $3.00 charge, but i didn't mind because it was delicious and there was enough to take home to my hungry boyfriend. The only reason it didn't get 5 stars from me, is because they took FOREVER to bring me the food. This fatty right here was about to faint of hunger!"], ["Alexa B.", "This is a fantastic restaurant hiding in plain sight as a mall hibachi joint.  The service is impeccable, the food delicious and quick, and its all for a very reasonable price.  Who knew you could find such a great place right downtown? I can't recommend it enough. Oh and I can't forget the portions - huge! My boyfriend and I split one meal usually because they're so big"], ["Jordan C.", "enjoyed my dinner, Pad See Iw (Shrimp) - great flavor! hopefully when I get back to Cali, I'll find something similar to it. #yummy4mytummy"], ["Charlie M.", "Very good. One of the few restaurants in all of Miami that I truly crave. They are spot on, have excellent customer service (Adriana is my favorite, one of the nicest people in miami) I go with my siberian husky twice a month and take all my friends there when we're in downtown."], ["Regina H.", "Mmmm the hibachi here is really good. I've had hibachi shrimp which was so good, it comes with rice, shrimp, zucchini and onions, and white sauce. Everything was good and their delivery is fast. Also just had the spicy herb noodles and they were really good. Good hangover food"], ["Erica L.", "None of the employees nor the customers were Asian, yet the owner has the audacity to tell me and my other two friends (all of us being Chinese or Taiwanese) that someone told him that he has the best Asian food outside of Asia. Are you kidding me?! We asked who told him that, and he said some Dutch people. Well, that's why! Do you really think Dutch people should be the judge of that? Dutch people are not the experts on Asian food. A true test would be to get the opinion of an Asian person. If Asians say it's good, then let's talk.We only came here because we had exhausted the other limited available options around our hotel in downtown Miami, and this was one of the few remaining open places. I ordered the chicken hibachi, and it was definitely not the best like he claimed. The hibachi chicken came with rice, a side of sauteed zucchini and onions, and two sauces. The white meat chicken was extremely dry, and the entire dish was extremely salty. One of the sauces was like a chipotle mayo, and the other was similar to a light, sweet sauce that you would typically eat with tempura. The latter was clumpy and did not complement the dish in any way.The only positive comment I can make about this place is that the portions were bigger than expected. That is all.This place definitely does not have the best Asian food outside of Asia. I would never come here again. The owner needs to stop bragging about the food that he is serving; instead, he should be embarrassed about how far from authentic it is. It was an extremely sad attempt at Asian food, and he should consult some real Asians to help him work on his menu."], ["J. S.", "There was a delay with writing this update, but it wasn't until I received a message from the owner a couple of weeks ago that I've decided to follow up on a negative experience.Two weeks after my negative review, I decided to give Hibachi a second shot. This time, I went and got brown rice/steamed vegetables with tofu -- which was surprisingly very, very good. However, I seemed to not go into following an update (I don't do much updates).That is until I checked my inbox and found a message from the owner of Hibachi. First, let it be known that this guy genuinely cares about his customers. He made it clear to me what his business stands for, and I really had to give the man where credit's due. He was generous to make a courteous remake of the pad thai, and I was thoroughly impressed this time around. I appreciate his business, and more importantly, his appreciation for customers."], ["Rolo T.", "I was pleasantly surprised by a great noodle soup with beef that I got here for lunch.  This place is a little on the small side (with outdoor seating only), but it seems like a great addition to the neighborhood.  Can't wait to try some other stuff here soon.  Location is SE corner of NE 3rd Ave. and NE 1st St."], ["Kshama T.", "Singapore noodles are yummy !"], ["Larry S.", "Not bad, not great.Disappointed by the Shrimp Shumai appetizer - only four small pieces for $3.95.  There should be six for that price.The Spicy Herb Noodles are not that spicy.I would go back but I would try other dishes and skip the appetizers."], ["Tania H.", "Being sick the last few days I was definitely wanting some nice spicy soup to help my flu like symptoms and I was in the neighborhood so I decided to give it a try. I am very happy with their soup selections. You choose what type of noodle you want and what protein you would like to add - it already comes with base of Cabbage, broccoli, snow peas, scallion, cilantro & lemon. I am definitely ordering from them more often!"], ["Chris C.", "The Wifi is free, and the food was edible.Not quite authentic, but decent. I came here during the late night after UMF. I feel that they did a good job on their take of how Chinese food should be."], ["Jennifer A.", "Customer service was good but the food was not."], ["Larry D.", "The current trend in downtown Miami is toward Asian noodle or Asian Fusion places. I think there are now about four new places that have opened this past year. Hibachi sits just down the road from Ceviche 105, which itself is a good place...but should help with you locating it. There's a tiny area inside to order, but you eat at the tables outside. This place is great for lunch, and I'd guess it's really good for a post-Heat game, being about a four block walk from AAA.It's cheap and the food comes out hot. I like their pad thai, and I've tried the hibachi chicken. This food works. It's filling, hot, spicy as you like and does the trick. During the cool months and cool nights in South Florida, this is one of the many open air places you can now find downtown. Enjoy!"], ["Grant B.", "A decent noodle joint that gets it right about 3 out of 4 times. I like the spicy herb noodles with beef added. I think the Pad Thai is decent, others disagree. As you may gather from the mixed reviews, it can be hit or miss... I live around the corner so they know me and tend to get my orders right. Great hangover food, BTW."], ["Roberto B.", "Just came back from a really fun lunch break with a co-worker and her gal pal who is loads of fun and a top Yelper too!  We dined and dished at Hibachi which holds its own pretty good in a snug little Avenue whose dance card is filling up pretty fast with new little boutiquey bistro type restaurants - I hope the Landlord(s) are generous so they can stay and really build up a strong clientele.  As far as Hibachi, it was my recommendation because I had been there before and I am so glad to introduce new faces (who also enjoy food!) to this charming grill and noodle bar.  Portions are abundant and could actually be shared. Veggies are so fresh you can hear the crispy crunch when you bite in and the soups (which I have yet to try) looked so yummy (maybe it's just the sexy way Natasha slurps a passel of wet noodles) I'm going to have to go back for a bowl myself - thankfully the Miami weather has dropped to the low 70's which requires we pull out our woolies and sweaters and dine on soups and stews so the timing is perfect.  Speaking of timing, Hibachi is open to midnight so I'm guessing post game time at the American Airlines Arena or a show at the Arsht, you could grab an economical bite of oriental goodness."], ["Mags M.", "I ordered the Chicken Pad Thai.  It took over an hour to be delivered.  I work across the street about 2 blocks.  Well, my order came up to $8.99 plus $3.00 for delivery which is fine (most places in Downtown Miami deliver for free but beside the point).  After 30 minutes I called to see the status of my order.  The lady sound confused so she put on the manager.  He took my information and said he will get in contact with the driver.  15 minutes passed I CALLED BACK (he never called back) and the manager said he still could not get a hold of him.  I was about to cancel my order but I gave the benefit of the doubt.  In the end I waited one and a half hours (1.5) for someone to walk 2 blocks I work on 2nd Avenue and they are on 3rd with one street difference.  I did the walk to see how long it would take. It took me 7 minutes, from door to door.  I am usually a great tipper.  But I tip based on service.  So, since I did not like the service I did not tip, plus I already paid $3 for the delivery.  The worst thing, when I looked at my bank statement they took an extra $3 so I paid $15 instead of $12.  I did not even bother to complain because that is the last $3 they will ever get from me.  I will never eat there again.  It is a shame because the food was really good.  I would have ordered again if I did not have to wait 1.5 hours and they did not over charge me for my order."], ["Lynn C.", "I came here about a month ago for lunch.  There isn't really seating inside (and you'd end up smelling like the grill) but there is some seating outside.  You get a huge portion for lunch and it's hot and fresh.  It's $8.95 for the chicken hibachi which comes with a portion of chicken, fried rice and grilled veggies (zucchini and onions).They are super fast and it's delicious!"], ["Lauren C.", "I really like the fact that they are so close to me.  It's nice to have a restaurant like this in the area.  I've been here many times and I've always enjoyed the food (the yakisoba SPICY is my favorite).  The staff is really nice too, and I feel well taken care of.I was told that they will be opening an indoor dining area soon.  That would be nice as well, especially on the windy days."]]}