{"The Capital Grille": [["Elio R.", "Capital Grill is always a safe choice. I went to the one in Memphis for the first time and I had a perfect dinner. I didn't even feel in Memphis. I had Oysters as appetizer and Dry Aged Porterhouse Steak -24 oz- as main course. Delicious food and outstanding service. Try the martinis I'll be back soon."], ["Wes L.", "Awesome! Great food, staff, atmosphere etc... When traveling everyone says check out the local places....been burned too many times!"], ["Don C.", "This place has a great atmosphere.  We came in for an early lunch - 11:30.  Not very crowded and we were seated on the enclosed patio - this should be awesome in good weather - windows open.I had clam chowder followed by filet mignon sliders.  Dyann had a salad and seared scallops.  She loved the mushroom risotto that was served with the scallops.  Food was very good.  Everything was fresh and tasty.Service here is over the top.  If you are in a hurry you need to let them know up front.  We were not and enjoyed the 1:15 lunch.They have a good wine selection but wines are over priced.  A bottle of Meomi Pinot Noir cost me $60 - ouch!  I would have been better off buying it by the glass.  Most area restaurants sell this wine between $29 and $42.This was a hard call between 4 & 5 stars.  I went with 4 on this visit.  If I pay $120 for lunch for 2, I have to be blown away to award five stars."], ["Jeff M.", "I have eaten here 3 times now. It is stellar. Great service. Great food. Excellent wine selection. None finer in the city. Il be back."], ["Joe C.", "When I attend a generous pour event. The wine serving you guys delivered were less than generous. You could change your event to The wine Sampler. 1/4 glasses (this was the already smaller glass) Oh and why are you guys aways just wanting to skip wines. auggg...be consistent please thru out your locations. The Frisco location knows how to entertain!! So you get the extra start because of them."], ["Kyle C.", "This is a review for bar service and the food that was ordered therein, as I have not had the full dining experience at this venue as of yet.The bar has a nice atmosphere and a good vibe, just as you would expect from any good steakhouse. The wood adorning the walls and the bar itself are dark and rich like a steakhouse should be. However, with any good restaurant, the focus should be on the quality of the food and drink, and the service that provides it.Unfortunately, at least as of this time, this restaurant is lacking in the service category. We waited for over 20 minutes before we got our first drink, notwithstanding the fact that we ordered it within five minutes of sitting down. The craft cocktail that I ordered was extremely good. It was exactly as described on the menu and they actually used top shelf alcohol in making it. The wine selection is very good, and there were numerous options to order by the glass, which is a very welcome discovery if you are planning to only sit in the bar or dine by yourself.Unfortunately, I must go back to the issue of service, or the lack thereof. We ordered two separate appetizers, as a group, and it took more than 40 minutes for them to come out. All that we ordered were parmesan fries with truffle oil, along with calamari. The quality of both the fries and calamari were outstanding. The fries, once again, were served with Parmesan cheese and truffle oil, which were outstanding. The calamari, as a nice surprise, had peppers that were included in it, and it was also outstanding. It is just sad that the quality and deliciousness of this food was overshadowed by the snail's pace of service and seeming lack of any type of immediate concern for getting both food and drink out to the waiting customers.Other friends who have dined at this restaurant lately have also noted that the dining experience takes an incredibly long time. I'm hoping that this is simply due to the newness of this restaurant, and that it will wear off very quickly within the near future. If this restaurant does not pick up the pace fairly quickly, it will lose its \"draw\" with the traditional steakhouse crowd, as there are plenty of good steak houses in Memphis that can serve the same great food at a quicker pace.For now, I will give this restaurant three stars in hopes that they will soon clean up their act, or should I say, quicken their pace. I will definitely give this restaurant a second try, but I will be looking for a much more impressive experience at that point."], ["J K.", "I would like to qualify this review by saying the Capital Grille as a whole is a very consistent and great restaurant. I travel and entertain clients regularly and often times at Capital Grilles around the nation. With that being said, I had the most horrible service by a general manager in a restaurant ever. Craig Patton was the most condescending, egotistical and pompous manager that I have ever met in the food industry. The food was horrible and all that he did was tell me that that was the way it was supposed to be. Absolutely not true. If you go to Atlanta they are wonderful, the food is amazing and everything about the experience is much different. I know they have only been open a year and a half but I promise you I will never go back there again!Oh yeah, if you ever have to go there because there are no other restaurants open in town ask for Merideth. She is an amazing server."], ["Elle S.", "I haven't had a satisfying meal in a long time and I had one tonight. To be honest I didn't have high expectations since it's a chain restaurant. Valet went and checked to see if they had any open tables since we stopped by last minute. My dirty martini was perfect. The calamari was dry and meh.Lobster Mac n cheese= holy shizzballs goodFilet sirloin w pepper au jus= filet part amazing, the sauce was holy crap good, sirloin I'm not a fan but I just don't like that kind of meat and I knew it when I got it. Bread basket= yummers. 4 types of bread my fave was the onion one.Josh was our server and he was great! Super expensive about the same as Folks F maybe even more.Our server got our valet ticket at the end and our car was ready when we were ready to leave. This was a Friday night."], ["Greg H.", "I've been a CG customer for many, many years and was very pleased that now that I've relocated to Memphis, two years later there's a CG two city blocks from my home. Such a pleasure to have a restaurant in this city that helps me forget I'm here. Yes, sometimes this town bites and this is my oasis. Thank you Capital Grille!!"], ["Rusty R.", "From our first date to subsequent date nights Capitol Grille has provided a 5 star experience every single time."], ["Trey B.", "Lobster mac is the best ever worth 17 bucks. The \"stolli dolli\" is the weakest ever with barely any vodka in it. I took a date there and she had 4 which I thought would be good enough to turn her into a \"freak in the sheets\" but instead I spent 60 on her drinks and she barely had a buzz. I still got some but could of just got her 2 shots. Also the crab stuffing in the lobster sucks."], ["Jennifer F.", "We held a working lunch meeting at the Capital Grille today and it exceeded all expectations. We had a party of 15 in one of the lovely private dining rooms they have available. The rooms come equipped with all the necessary A/V equipment. We had a preset menu (choice of soup or salad, one of 5 entrees, family style servings of the most delicious green beans and mashed potatoes and several desserts to share) which made ordering very easy and also kept the cost at a reasonable limit. Our server, Michael, spaced everything out perfectly and while he was very attentive, he also gave us space in order to work. He even helped us carry our to-go bags (which were necessary because the portions were huge!) and work equipment to the car.If you are need of private dining space or really just a good meal for lunch (which is more affordable than you may think) or dinner, I highly recommend Capital Grille."], ["Liza C.", "The food was decent but didn't really wow me. Our waiter was terrible though. He was totally mediocre. The music was a little too loud. I'd go to Flemings or seasons 52 or Houston's before here"], ["Meg D.", "Boyfriend and I went in without reservations on a Thursday and got immediately seated. Got the pineapple martini and it was fabulous. Highly recommend their dry aged steaks and sprouts smoked with bacon."], ["Vim I.", "Absolutely beautiful restaurant, and such a great addition to East Memphis. Ridgeway & Poplar seem to be getting overtaken by upscale, steakhouses: Ruth's Chris, Fleming's, and now Capital Grille. Our waiter was fantastic. Even though this was a work function, we were really laid-back and the waiter accommodated his service accordingly, i.e. not being overly stuffy or pretentious. Having said that, the entire staff was really nice--including the hostess and the guys at the valet stand. For the appetizers, I tried the lobster and crab cakes (2 on a plate--delicious). The calamari was good with the addition of the hot peppers. I also had the Stoli Doli which was pineapple martini--went down smooth.For the entree I had the sushi grade tuna steak with three different sauces and gingered rice. I was a little underwhelmed by the flavor--it didn't blow me away, so next time I come, I'll probably try something different. My coworkers who had the steak entrees were more than satisfied with their entrees--obviously that is Capital Grille's specialty. The desserts also looked great. I didn't partake, but the cheesecake got a lot of great compliments. All in all, a very good experience. Next time, I'm going to try the happy hour at the bar."], ["Emily R.", "This is a beautiful posh restaurant. The decor is very upscale. The servers are extremely attentive. The water glass and wine glasses are always kept full. I ordered the all natural herb roasted chicken served with chicken jus and baby carrots. My husband got the dry aged porterhouse steak which he really enjoyed. It is very expensive."], ["Vickie W.", "After receiving a gift card for $100 we decided to celebrate Sweetest Day early at Capital Grille.  We had reservation for 6 pm and received a friendly greeting from the valet parking.  Once inside and gave our name everyone was very friendly. Here is my first complaint, off white, huge menus with dim lighting and fine print. I had to use my phone to shine light on the menu and still had a hard time reading.The waiter was great and explained the dryed aged steaks. We ordered the filet with butter poached lobster and the porcini delmonico. Both were very delicious. Now my second complaint. The al la cart oscar potatoes were luke warm around the edge of the serving dish and cold in the middle. Had to send them back. Waiter came back three times to apologize and tell us they would be out soon.To end this review, our check with 2 beers, one glass wine, 2 entrees and one side was $150. No appetizer, salads or desserts.Will not be going back not good value for the dollars. Better restaurants for the money."], ["A L.", "When did this place show up, hmmm perfect place to bring someone special and great for business events. I had the Seared Tenderloin with Butter Poached Lobster Tails, it was amazing.. cooked to perfection.... very yummy.... It's true to what they say:\"The ultimate steak and seafood experience\"Also had the lobster crab cake, holy cow home run..I don't believe you can top this experience.... give it a try trust me."], ["Aaron S.", "I'm guessing we caught them on a very bad night. Saturday night reservation at 7:30. Arrived about 10 minutes early. We were offered to wait in the bar except their were no seats available. There are no seats available in the lobby waiting area to sit. So we stood for about 10 minutes. But we were sat promptly at our reservation time. The room where our table was a little humid and not very cool. Glasses of water were sweating. The wine menu was on an iPad which isnt a bad idea since the restaurant is very dark. Water glasses were rarely paid much attention. The restaurant seemed under staffed. My 10 Oz filet was a complete bust. Asked for it medium. It came out well done. Manager couldn't have been nicer. Next one came out rare. He couldn't believe it.  Came out the third time and it was still rare to med rare. He said it was on the house. He didn't wait to see if the 3rd time was a charm...I ate it because my party was long through eating and I was hungry but it was medium rare to rare. The side dishes were average. The waitress was nice but wasn't as attentive as you would expect in this kind of restaurant. So we gave it a shot. Will we come back, I don't know."], ["Mary M.", "Lovely atmosphere and excellent service. Unlike some reviewers reported, we found no fault with the service. Our server Jamie was thoroughly professional, very knowledgeable about the food and wine offerings. He discretely inquired if we were celebrating a special occasion and provided a complimentary dessert when informed we were celebrating a birthday. Probably not the top steakhouse in town, but an enjoyable meal in a tranquil atmosphere.  Five stars for the service."]], "The Blue Monkey": [], "Terrace At The River Inn": [["Lily W.", "Love this place, the food is great and the view is even more remarkable!!! This was my second or third visit and the consistency is there. They serve tapas and would recommend at least 2 however the portions are not so small that you would be disappointed. You would simply want to order more because it's so yummy!Recommend the lamb sliders, fries, shrimp dishes and pretty much everything!Great martinis as well! And let's not forget the VIEW!!! Oh yes, the view!!"], ["Ming Han C.", "Came in from out of town to visit my pregnant sister. Was really excited when they said they would take our rsvp if we \"promised\" that we would come. Once we got to the restaurant the first thing we were told is that they didnt take rsvps and it would be at least 20 minutes before we would get a table. A few minutes later a person that looked like a manager came over and said there was an opening? (He must have been the one i talked to). Well 35 minutes later no word from anyone... Just talked to manager again. Doesn't know how long it'll be. We're off"], ["Krystal S.", "My first visit and I enjoyed it! Husband and I went just before the sun started going down and was able to get a seat next to the window. It was a nice warm breeze. They had a nice variety of music playing as well as he game was on. It wasn't loud though. The wait staff was very attentive. I have the beef sliders and they were great! Will definitely be back and bringing friends with me."], ["Jennifer R.", ".....the view! Oh my the viewThat I all you have to say about this place.  It is a very romantic venue and a great place to take a date or to just have a glass of wine.    I ordered the cheese plate and a glass of the Cab.  The cheese plate was not the best I have ever had but it was ok. The Cab was just what I have wanted/needed however, I wish that they had red wine glasses.  They only had white wine glasses.  I love nothing more than drinking from a nice red wine glass.  Would I go back...? Of course! I would for sure go back here for a date or a chill night with the girls for a nice glass of wine and that view!"], ["Charity S.", "Love this place! The view is excellent and the food and drinks are tasty. The beef sliders, the cheese and charcuterie plate, and the chicken satay are all delicious and reasonably priced. I've tried other dishes, all from their previous menu, that were just as spectacular."], ["Jeannie M.", "Oh how I wanted to give it 5 stars.  The setting was perfect.  It was the warmest day of spring so far.  We were coming from a Yelp event nearby and we're looking forward to relaxing and enjoying a view and some noshes.  We arrived at the Terrace inn and clearly the view was intact.  It was crowded. Best day weather wise in a while so everyone flocked to cafes and terraces and patios.  There was no hostess. No sign that said \"wait to be seated\" or \"seat yourself\"  so we snagged the table on the railing with a view that hadn't been bused yet.  Score!!!But then...we sat.  And sat. And sat. And sat.  And sat.  And sat.  And sat. No one approached. No one welcomed is and said \"I'll be with you in a minute.\"  It became clear that they were understaffed and not prepared for this many people on a WednesdaY night. Maybe it is generally quiet on a Wednesday.   We looked over the Ledge at Tugs and saw wait staff working the outdoor tables and considered going there.  I didnt want to give up this amazing view and venue though.   Honestly, it took us flagging down a waitress at another table and letting her know we'd been there 20 minutes before we got any acknowledgement.   BUT....once we did,, our waitress was apologetic, sweet and attentive.  We ordered and had a wonderful dinner.  We ordered three small plates between the two of us:  the charcuterie plate, the bang bang shrimp and the beef sliders.  All was very good. My favorite was the charcuterie plate.  The sliders were delish too.  The shrimp was a little spicier than I like. Still, all in all, a wonderful dinner and a waitressWho redeemed the night for us."], ["Dean D.", "I was so pleasantly surprised by this place...been in the Memphis area for almost 17 years and never been here.  We recently moved from Collierville to Mud Island and have been exploring area restaurants.  After reading the reviews for this place I decided to give it a try and wow!  The afternoon was beautiful; windows were open and the view was spectacular!  The menu is more of an appetizer/small plate menu but everything looked so good.  I watched the cheese plate go out and I know what I'm getting next visit but this visit I decided to try the lamb sliders and their hand cut fries...outstanding!  The mini burgers were delicious and the presentation was spot on; a must try!  The fries...\"forget about it\"...NY slang for Damn good!  This is now my new favorite place...I'll be back!"], ["Amanda G.", "Had the \"pear-a-dise\" cocktail, truffle oil French fries, & a little beef appetizer on a baguette toast kind of thing (2 pieces) that was SO TENDER I was amazed. Sat at the window with a beautiful view of the river at sunset. They opened the windows wide open because it wasn't too hot. Very nice."], ["Taylor O.", "I had no idea this place existed until a friend of mine asked my girlfriend and I if we wanted to double there. But we love going to Harbor Town, so we obliged.It's not a big place. When we got to the 4th floor of the hotel the restaurant is in, we were told it'd be a 30-45 minute wait, which made me want to turn around and leave. But we were pointed to a couch with a fantastic view where we could sit down and order some drinks while we wait. So we did and it turned out to be a fun, relaxing and pretty quick wait.We sat down, had some more drinks and ordered our food. I had the Beef Sliders and my girlfriend had the Mojo Shrimp. We split some fries. All of it was great. They were both small plates and we left not very full. So I'd recommend ordering the big plates ($$) if you have have a big appetite. They had some unique cocktails on their menu and I noticed a lot of folks ordering them. I stuck to my whiskey drink but will try a cocktail next time. No draft beer here, unfortunately (that I noticed at least).We ended up spending over 2 hours here, but it didn't seem like it because it was such a great time. It's a casual atmosphere with a beautiful view of the Mississippi River & Hernando-Desoto Bridge. The food's great and the service is nice."], ["Molly P.", "The view from the Terrace at the River Inn is unparalleled in Memphis. The drink menu inventive, and the appetizer/dinner menu ever expanding. Though a rather intimate space, it can get loud when crowded. Service can be uneven - very attentive at times and MIA at others. When people ask for a fun place with a view, this is always one of my recommendations."], ["Ronika A.", "I've only been twice and I'm sure that I will come again.The Great- the view is amazing. Being able to enjoy the Mississippi River, the bridge, and the Pyramid while having drinks and good company just can't be surpassed.The Good-the cocktail menu isn't skimpy and the bartender, Jonathan, is very attentive and doesn't cheat you on the alcohol content. The caramel apple martinis are quite tasty. The boyfriend is a fan of their mojitos. While quite tiny and $7 for 2, the beef sliders are tender and seasoned just right.The Okay- The mojo shrimp are okay. I actually enjoyed them on the 1st trip better than the second time around. The not so good-I think they need a few more servers and bus men/women during their busy times especially the traditional happy hour. I truly believe they should stay open later on the weekends and when Memphis is having events like Memphis in May, Grizzlies playoffs, etc.Thanks to Jonathan for helping us cheer on the Grizzlies by getting permission to turn up the volume on the TV!"], ["Jeannine S.", "Let me start out by staying this place earns a solid 5 stars for the view.  One of the best things that The Terrace at the River Inn did recently was to fully cover and enclose this space so it could be used year round.  Also what gets 5 stars is the space itself.  The furniture looks new and the decor is contemporary.Now for the bad news...The food and cocktails get a solid 3 stars at most.  When The Terrace first opened, the cocktails were so bad.  I used to live in NYC, so when I think Rooftop bar, I think great cocktails.  ERR (insert sound effect from Family Feud when they get an answer wrong and the big red X shows up on the screen).  I went here several weeks ago and the cocktails got better, but were just OK.  I've had their dessert a few times and it used to be good, but for whatever reason, last time they just weren't great...but I'm going to give the kitchen the benefit of the doubt that it was just an off night.Now for the really bad news...The service gets negative 3 stars.  When I walked in, there was no one to greet me.  After waiting near the bar for a few minutes and getting ignored by every employee, I decided \"ok, I guess it's seat-yourself-and-grab-the-wet-menu-off-of-the-next-table night\".  And that's exactly what I did.  Eventually after sitting there for about 10 minutes, someone came over and asked if we had been helped.  I'm sure the empty table with no drinks on it was a dead giveaway.I honestly want to love this place.  Really, I do!!!  I'll continue to come back only because of the location, but the service and cocktails need major improvement.  If you're looking for a place to take your date where the wait staff won't bother you and you can have a nice conversation with a drink and a cheese plate, this IS the place for you and I highly recommend.  This is not a bad place, but the service and drinks need help."], ["Joelle P.", "@TerraceMemphis is without a doubt, my new favorite place in Memphis!!I was a fan of the Madison rooftop...until they started charging cover and not protecting their visitors from the elements (no shade or heat....whhhhaaaat?!). So when I heard about Terrace at the River Inn, I thought hmmmm gorgeous river view and cocktails...need to get myself there ASAP!And indeed I did. Indeed I did. I have only been there twice but I am bound to defend my Duchess title with at least 30 check-ins in the future. The first time I went it was still nice outside and I loved that the patio was open. But then when night fell and it got a bit chilly, they closed the windows to create an \"inside\" environment. Love! And the second time it was just closed in the entire time (it should be noted that I had called the Madison rooftop but they were closed due to the weather). We were nice and toasty even though it felt like we were outside (the walls are ceiling-to-floor windows). And they have a really cool grass wall keeping with the outdoorsy theme. OK so the Madison has a teensy bit of a better view of the river but the food (their cheese plate - swoon), cocktails (realllllllly yummy), service, adorable view overlooking Harbor Town makes the Terrace at River Inn win hands down ten times over in comparison. Girls night, date night, drinks with my mom, celebrations...pretty much any occasion is perfect for this place. FYI, they don't take reservations. First come, first serve."], ["Rachel W.", "Let me be the one millionth person to say this, but, you really cannot ask for a better view of the mighty Mississippi while dining. The restaurant is small and so are the plates (not a bad thing, just know this before ordering and expecting a huge meal). The beef sliders were tender and perfectly cooked. We also enjoyed the arancini. If you're looking for something sweet to sip on, let me suggest the candy pants cocktail - this chocolate lover was quite pleased."], ["Laura L.", "Terrace has a great view of the Mississippi River with a nice atmosphere. The space is fairly small with several tables, a few high tops and a bar with room for about 10 people. We dined at the bar on a Thursday evening. The weather was nice so the windows were open, making the place feel open and airy. Also, there is a huge TV behind the bar but there wasn't sound (luckily!). Marcel served us at the bar. His drinks and service were excellent! Between three of us, we ordered two appetizers, three small plates and two sides. Our favorites were the beef sliders and the fries with truffle aioli. Overall, the drinks and the food were a little on the pricy side but we will definitely be back."], ["Candace B.", "Can really only give this place 3 stars sine we never ate anything ...just had some drinks. But, I have to say their menu looks great and I want to go back and try something. The place is small, modern but cozy. They have an amazing view of the the river it would be an awesome place to watch a sunset. It would be a great place for a romantic sunset dinner . I will have to make Chris take me back for that!"], ["Brian B.", "The food was delicious, and the wait staff was wonderful. We really enjoyed the view!"], ["Corey S.", "Excellent view of the sunset.  When the windows are open and sun is glaring in they pass out sunglasses.  Excellent place to take a date for a cocktail and snacks."], ["A Kate H.", "The view + cocktail list = 5 stars I have to take one away because service is known to be horrendous, even from the regulars who admit they just deal with it because it's so convenient for Mud Island residents and the atmosphere is lovely. I'm taking away another star because the food is beautifully plated but the portions are so small you wonder what you're paying for... Our charcuterie plate came out lacking some key ingredients; which the server said she noticed it was missing but did not fix it. I will be back for drinks and a sunset. And of course will update if the food quality improves.  (If going in the summer wear big spray)"], ["Erika Z.", "The sunset view alone makes Terrace worthwhile. I love to bring out of town visitors here for sunset cocktails and small bites. Food is really tasty, though portions are small. One warning: they don't take back drinks at all. I once tried a new drink that didn't taste anything like the description and the server pretty much told me, \"tough luck.\""], ["Ashley C.", "I've given the a Terrace two tries with very poor service. Went back today with an out of town friend for the 4 pm open and was told that, regardless of the restaurant hours posted everywhere, they wouldn't be opening until 5 pm today. Why have posted hours if they're not real? We won't be back."], ["Amanda E.", "This place is delightful and the view is spectacular! I really enjoy the decor. Service is good and the food is delicious. I get that it's more of a lounge but I wish there were some regular entrees available. The only reason I'm not giving 5 stars is because of the prices, a bit high for a small amount of food. IMO two people would have to get at least 5 things to share to not be hungry , which puts this in a fine dining price point. The chairs at the regular tables are terribly uncomfortable which goes against the idea of hanging out grazing and drinking. However, the stools at the bar and high top tables are fine and if you're lucky you can grab a spot on the corner couch. Overall, a great spot to watch the sunset with a cocktail and appetizer. I think this would be a nice compliment to dinner at Paulettes downstairs."], ["Trey P.", "Went with a friend to watch a game and didn't feel like leaving the Mud Island area.  This place though built for the views has other good aspects.  The size is nice and small making you socialize with the other patrons, the bar was well stocked and the small plates were just daring enough to entertain but still be successful.  I had the lamp sliders and shrimp on toast points (can't remember name).  Both were just the right size to make a full meal without being too much.  The shrimp was nice and garlicky with a side spicy cajun style sauce.  The sliders were really well prepared with enough flavor to really make them enjoyable.  I'm sure the main draw is the view but on these long winter nights don't hesitate going up just to enjoy the food and drink."], ["Gary J.", "Valentine's was a disaster for dinner.  We arrived a little before 5pm, as we had already called to inquire about the menu, timing, and the fact they were not taking reservations.  Upon arrival, we were directed to the bar, and told the restaurant was not yet open. Although, there were already patrons seated in the dining area.  Marcelle,  the manager,  was not concerned as to whether or not we were dining in.  His servers were seating patrons as if we were not even sitting/waiting.  The main reason we came this particular occasion was because of the experience we had the prior night.  Because of their lack of organization and  the manager's lack of concern, we will not return.  His only recourse was to offer us a glass of wine...and that's after our $25 bar tab for two drinks while others were being seated ahead of us."], ["Jason S.", "This place is a great find. Food is Tapas type fair. Excellent quality and flavor. We surveyed several dishes. Lamb chops were excellent and cooked nice and medium rare, Mojo Shrimp came with an excellent tequila sauce.  If you like spicy this is the one for you. Not overly spicy but enough. Also had the charcuterie plate with meat and cheeses, Ahi tuna plate and Lamb sliders.  The Seared Ahi was a bit bland with little flavor.  It needed salt but was cooked nice and rare like it should be. Overall  tapas plates were well executed. Service was very good. Some of the reviews mentioned that they are known for poor service but our hostes was very attentive even though there was a Bachelorette party going on. The only reason this place isn't 5 stars is that they had the Terrace windows closed due to the heat that day. It was hot inside (AC wasn't very good) and that caused the noise to be unbearable. I was sitting across from my wife and I couldn't carry on a conversation. However, after about 45 minutes they opened the windows to make it an actual \"Terrace\" and the mood changed immediately. The cool river breeze blew through and the noise level dropped. 5 stars for the river view. Time it so that you dine as the sun sets.Wine and cocktails top off this great experience. Nice selection."], ["Justin L.", "Spectacular views, and a great drink menu!  We did not eat here, however their mojitos are spot on!"], ["Mario+Ashley P.", "Great place was with an awesome view but only good for appetizers and drinks definitely recommend it for a night out on the town -Mario"], ["Gloria C.", "I'm no geography buff, so don't hold this against me, but I had NO idea the Mississippi River was so wide!  Come here for sweeping views of the river and the bridge. Mud Island is an adorable little Truman Show-esque neighborhood with perfectly pretty pastel houses, shops, and places to eat and drink. We wanted to find a place to have a few pre-dinner drinks, and I think that's what Terrace is good for. The food items were underwhelming - kind of like an upscale Cheesecake Factory with less of a selection, thankfully. While I'm still on board with the truffle oil trend however many years later, that is about as exciting as their small plates menu gets. The wine list was plentiful, there were creative cocktails and although they weren't craft, still looked delicious. Service was perfectly fine, and the manager visits tables individually to make sure everything's going okay - nice touch!"], ["Christopher B.", "This place was nice to grab a drink and take in views of the river. We had beers and just hung out but there is nothing super amazing about this place otherwise. It's something different to do if you're in the area."], ["Kristin H.", "Great view, yummy drinks. I got the bartenders special and was very pleased. This place is a great addition to the Harbor Town area."], ["Shaina G.", "This place feels like home to me having spent the last 6 years in NYC! I LOVE this rooftop bar and the specialty cocktails and fun late night ambiance and beautiful views! The bartenders are great and they even order the liquors you request! Would make for a great girls night out, date night or even just a quick pre-game drink on your way off the island. Total Fan!"], ["Karen S.", "The best place to watch the sun set over the RIVER, get a drink and hang out with friends!The Terrace is on the rooftop of the River Inn, a magical boutique hotel situated in Harbor Town which is one of the best, coolest neighborhoods in the country (yes, really!) The rooftop now has enormous glass windows all around the perimeter that fold completely away so on lovely evenings  the fresh air can blow through- but on hot, cold or stormy evenings it can be made comfortable. The kitchen whips up tasty, tapas style treats. The ambiance is reminiscent of something you may find in Europe, with big comfy couches as well as plenty of tables. Personally, by walking into the Terrace I was transported back to a rooftop in Barcelona that I was impressed with when visiting there. Not bad, eh?It's dressy casual. It opens at 5 and closes at 10 weekdays and 11 on the weekends. This place is destined to become the place to see and be seen. I live in Harbor Town and it is things like this that make me realize just how lucky  I am that I do!"], ["Andrew B.", "Incredible panoramic views of the Mississippi River, delicious signature cocktails and in one of my favorite neighborhoods, Harbor Town / Mud Island."], ["Husni E.", "Love the view and service is great but can get backed up on the weekends. Food is good but the small plates are pricey.  I don't think they have a happy hour but they should at least on weekdays."], ["Lily B.", "If you are already on Mud Island and don't want to drive very far for a place for drinks this place is good.  If you're looking for real nightlife, I would not make  make the drive because I have found this place to be very laid back.  Thats not a bad thing,  it really just depends on what you are looking for I think.  I will say though, the view is great."], ["SouthernFoodie M.", "We met friends here for a drink and bite before hitting the MSO. It's an easy drive and park between both .... We arrived on a nice day at 5:40pm and there was one 4 top left! There was good - if not busy - service. The staff was really nice and helpful, just busy since it was crowded and full.  The view was amazing, sunset and all.  I liked the fact that as the sun went down, and it got cooler, the staff closed the windows. Classy.  Great drinks and a good menu.  They were out of the lamb sliders, husband went with beef (he said an additional slider would have been good as they are small) and fries (delish).  I had the lamb chops and grits.  They were delish and enough for a dinner for me. LOVED the ambience and good small plates menu. Not especially inexpensive - but it's a darn good price for the view."], ["Shahidah J.", "I had a good experience here. The view is amazing. The inside décor and atmosphere was more casual than I expected.  The food was ok. I had the Lamb sliders, and the onion really over powered the flavor of the lamb.  however the drinks were excellent and it was reasonably priced.  I will definitely visit again, preferably near sunset."], ["Susie B.", "Beautiful, good wine selection (Velvet Devil). The food is good but the small plate portions are a wee small for the pricing. (Compared to other local places.) Ordered a fantastic scallop plate and some bar fries. Scallops were well cooked and the plating was nice. It's sad you can't order k-pie up to the roof. The owners should work out a contract."], ["Lisa C.", "Love the sweeping views of the river... Depends on what you want to spend. Great for meeting friends before going out. They do have happy hour specials!"], ["Hugh W.", "Great place for drinks and small plates. Not very big so don't plan on bringing a ton op people. Great for 2. Service can be slow at times but has been noticeably better each time we come."]], "River Oaks Restaurant": [], "South of Beale": [["Tai B.", "This is a great late night spot. Stopped in around 11 with some friends after being disappointed with the offerings at another nearby spot. SOB late night has a real menu of options which was nice. I had the brownie with mint ice cream. It was pretty standard, though there were ice chunks in the ice cream. My friend got the Gouda Mac and cheese. It was really good! I wish I had got that. It was a drier Mac and cheese, not soupy, which I prefer.  So it worked for me. My friend thought it was just ok. Drink prices were reasonable. You get complimentary popcorn, instead of like bar nuts, but we didn't like the popcorn. Weird seasoning on it."], ["Kathy M.", "Fantastic food, I had the Duck fried rice and it was amazing. Also had the Waffles and chicken which I never had before and I really liked it. I had to save room for dessert and I had the bourbon and coke bread pudding which was to die for!"], ["Matthew P.", "I was told to check it out by a friend w/out instructions on what to order. The bartender steered me toward the duck patty melt w/a side of bacon maple brussel sprouts and my mind was blown. The sprouts were great, but the patty melt was stellar!"], ["Sammy E.", "I was able to try a few different dishes with a group of 5. The atmosphere is a bit before casual but the food isn't. The whiskey artisanal cocktails are flavorful and the food is tasty. It's not an everyday spot but take a few friends here, share a few plates and everyone will find something that they like. I believe it was the late great Genghis khan that said in the book 'Titanic':I\"ll be back"], ["Ashley F.", "I had a great experience visiting South of Beale. My BFF and I saw the restaurant featured on Triple D and had to try it out when we came back home. The funny thing was that we were no where near hungry when we got there because we had a late lunch but the food (that was supposed to be to go) looked so enticing we dived in. We chose to get a bunch of small bites since we couldn't frequent the place. We got: Drinks: I think I made a bad decision. I got a champagne margarita and it basically tasted like beer. Thinking back, this could have been a combo thing. Food:Reuben Egg Rolls- Way better than I thought they'd be. Deliciousness in every bite.Chicken and Waffle sliders- good flavor in the chicken. The waffle was ok. It's a sweet potato waffle and it tasted like there was syrup already in it?? It was either soggy from the syrup or too buttery. I ended up just eating the chicken. Duck fried rice- Eh, it was ok. I think it has been hyped up and I expected more.Gouda mac and cheese (because where there is mac and cheese, there are my taste buds :) )- HEAVEN!! Probably the best mac and cheese I've ever had. I am a fan of gouda in mac and cheese. I know a lot of people who are not. But this right here was oooey and goooey and cheesy and fantastic! I didn't want to share. Service:The service was fabulous. Everyone who worked there were genuinely friendly, I mean, it's Memphis. This is to be expected. Everything else: It was clean, not crowded, great ambiance and they give you free, uniquely seasoned popcorn. I'll take it. I recommend you give it a try!"], ["Justin T.", "On a recent road trip through the east coast, we stopped in Memphis to see Beale Street and to grab a bite to eat. While researching restaurants during our drive into Memphis, we found this little gem.  Parking was easy and there was not a wait at the time we got there. Everything we ordered was excellent and the service was great. Can't wait to drive through Memphis again!"], ["JaspalandAman H.", "We went in with a group on a weekday night for dinner. Its close to downtown/south main. We started off with the fried avocados and chicken and waffle sliders. I felt the avocados were ok- not exciting to my palate. I ordered the Duck patty melt, it was ok- its possible i may expected something else from that item on the menu. Other people at the table ordered the pork chop and grits; and they were not overly impressed either."], ["Matt S.", "I want to love SOB. I do.I've been 3x now and every time it's w middling experience. The menu LOOKS great but the food that lands on my table Always fails to come up a bit short. From the overly greasy duck patty melt (even for a party melt), the soggy flavorless fries, to the remarkably unremarkable \"pulled\" (looked chopped) chicken BBQ sandwich. It's not bad, but it's never great, which is a bit of a shame. I'll continue trying to give it a shot though.... Because I Want to love SOB"], ["Taylor O.", "I'm pretty neutral on this place from my limited experience.If you like an eclectic menu, this is definitely your place. I personally wasn't too impressed with the food, but I know people who love it. So maybe it's just me.It's on South Main, which is turning into one of my favorite areas in Memphis. And it's a fun place to go and catch a drink with some friends. I wouldn't recommend it for going and watching a game, because there are other bars close-by with bigger TVs.As far as drinks, they have a good local beer selection and neat cocktails. Try Tito's Moscow Mule!"], ["Seth N.", "We love the tuna app. The cauliflower and brussel sprout side are amazing.  Good quality food."], ["Kaylee C.", "My husband and I saw SOB on the food network and had to come during our visit to Memphis. It did not disappoint. We did have a table of 5 so we were able to order a variety. Suggestions: duck fried rice- super flavorful with a bit of kick. Reuben egg rolls- my favorite appetizer. If you buy the cheese plate it comes with deep fried deviled eggs ... Say what??? Yes, they are really good. For my meal I had the breaded catfish and with homemade tarter sauce and it was one of the best fried fish plates I have ever had. Service was friendly as well! It's a short walk off Beale and well worth the visit!"], ["Amanda W.", "WOW!! This place is really cool. My husband happened to see it on some TV food show, and talked about it for months before we moved to Memphis. I can't believe it took us so long to finally check it out. Now that we have, we've been back twice, both times for lunch, even though it is a 45 minute drive for us! You must try the duck fried rice and the mac and cheese. Also, the duck patty melt and the chicken and waffles are really good. Skip the fried avocados; they weren't that good, and actually was kind of odd with the olives. We did order cocktails the first visit, but not the second. They weren't very good, but it could be just an off day for the bartender (or no bartender), so I can't really judge completely. Their beer list looks extensive. The menu is seasonal, so always something new to try."], ["Madeline M.", "Great place, great prices. GF friendly. Unfortunately a lot of the gluten free items had dairy, but the Duck Fried Rice ok for me to eat and it was GOOD. So perfectly seasoned. The complimentary popcorn usually comes with butter but they made me a bowl without butter! It was seasoned with brown sugar and Cajun seasoning which sounds awesome except it didn't really stuck to the popcorn because I didn't have any butter. They had Gluten free drinks which I didn't partake in but they all looked yummy! Super awesome staff. So friendly. Was my first time to Tennessee!"], ["Lisa M J.", "Has been here a few years now and has a cool ambiance. Can be packed before Grizzlies games and probably a good spot for pre-event libations.Have had the opportunity to dine there a couple of times over the past few months and the food has been forgettable, even for bar food.   There is window that lets you see into the kitchen. At our last visit (which as late night menu)  it looked like they had a mini grease fire and my husband observed someone pour water on it (this makes it worse).   I was actually surprised it didn't set their Ansul system off.  Needless to say I think  it reflects a bit on the training/quality of the staff back there."], ["Dean D.", "Sorry Triple D...just not overly impressed with this place.  The menu is unique with several interesting items to choose from.  The free popcorn is cool and different.  Unfortunately the food just isn't all that good.  I held off on my review because I wanted to give the place another try and so far everything I've ordered has been average at best.  The humus was just not that good and that's kind of hard to screw up.  The muscle appetizer was overcooked, bland and somewhat fishy tasting...I also tried their burger, hoping that would be good but it was honestly less than average as burgers go.  My wife ordered one of their entree salad plates...not very good.  She left more than half.  Sorry SOB fans...not my cup of tea I guess."], ["Andrea G.", "Underwhelmed. Went here with a group of friends because was featured on the food network. The ONlY item we enjoyed was the fried avocado which was delicious. Everything else (5 entrees) we all tried something different -// just didn't taste good. It's like they tried too hard to make them original and missed the mark on flavor and food pairing that makes sense. Also seating is cramped AND I asked for the Humus plate and the server told me no because it was \"only available at dinner\" -// then as I'm walking out the door 30 minutes later / another table is enjoying the humus platter -- not cool!!!!! If you have the food In your kitchen and a customer wants it -- sell it!!!!"], ["Jeremey D.", "This \"breakaway casual\" is a perfect transition for those seeking their American favorites in a gourmet styling though their limited menu leans toward the pricey side.First things first: cinnamon popcorn gets served to your table.The menu is restrictive as there are only about 12 entrées and only two (i believe) of these are under $12 (the SOB burger and the duck patty melt). Also you can choose any of the top notch sides but substitution is an additional $1. Boo.On the upside there are house specials that rotate (presumably because they were not on the menu but on a chalk board) and they sound amazing but I wanted to review the menu so I didn't order a special.Portions here are not the crown jewel (as is typical of para-gourmet restaurants) but the quality of the food is. Pure and simple: the food is done so well I applaud the succulent flavor of the burger, the presentation of their plating of the fries and sriracha onion rings (which are not spicy but bold and smokey), the service staff (which are allowed respectful body art. Shout out to Will!) were awesome and the bar selection put this from a \"I would go back\" to a \"I can't wait to go back\"."], ["Catherine A.", "Meghan was an outstanding server!  Really enjoyed the dog friendly patio.  Lots of local brews on tap. The hotdog and Gouda Mac n cheese was great.  The salmon and maple syrup brussel sprouts with bacon were excellent.  Wished the outdoor patio had some fans."], ["Charles M.", "Cool atmosphere, it's loud for brunch, good drink menu, and outdoor seating which is a plus on nice days and nights. Brunch menu varies so check ahead of time if you're a picky eater."], ["Kevin S.", "Tried to give it a second shot, however never made it to order food. The staff as so rude I will never be back. Very disappointed in this restaurant ."], ["K T.", "Hubby and I went here for Sunday brunch.  It was pretty crowded, but we managed to get one of the last open spots.  Several groups that came in after us had to wait for a table, and there is not a \"hostess area\", so you are pretty much standing in the midst of the other diners.I thought the food was very good.  I had the fried chicken biscuit with jalapeño jam.  It was DELICIOUS.  The portion size was very generous.  The chicken was crispy and juicy, and the biscuit was fluffy and rich.  The jalapeño jam was a nice balance of spicy (but not overly spicy) and sweet.  My dish came with a side of slaw, which was also very good.Hubby had the burger special.  I can't remember what all was on it, but he said it was good except for he wished it would have had a different bun (a little dry, he said).The Bloody Marys were NOT GOOD.  They were way too SALTY.  I don't know if it was their mix or if they added salt or olive juice to it.  When I looked around, it looked like everyone else had gotten Mimosas, so that should have been a clue not to get the BMs.  I hope they make a change to how they make them because it was disappointing after having such a delicious meal.  I got a better Bloody Mary the night before at a walk-up bar on Beale St.The floor was also very slippery and greasy, so be careful if you make your way to the one-toilet bathroom.Bottom line:  GREAT FOOD.  TERRIBLE BLOODY MARYS.  Will probably go again, but next time get a Mimosa instead."], ["Melissa M.", "We first heard about SOB on Diners, Drive Ins and Dives and we finally ate here last night! First I was a little worried because they didn't have Dr. Pepper. (It's a hard world to live in when you only like one drink) The waitress then tells me they have a homemade lemonade (This is my go to when there's no Dr. Pepper) but there's no free refills for it?? Okay that's fine whatever. She brings it out and I take a drink and it's kinda weak. There's a lemon wedge on the rim so I squeeze it in then throw the whole thing in. That helps a lot. With the drinks out waitress brought a bowl of the popcorn they make and...oh my god...that stuff is amazing. I swear we devoured it so fast. I'm going to convince my mom to try and make it at home because I need it in my life always. Then on to the ordering. When I go somewhere new I want everyone with me to order something different so I can try it (I mean I'm with my parents, it isn't weird) We finally decide on the duck fried rice for appetizer, I get the chicken and waffle sliders, my mom orders the pork chop with the mac and cheese, and my dad gets the duck patty melt. For a family that doesn't eat duck, we sure did last night. It doesn't take long for the rice to come out. I dig right in because I am starving (which explains why I don't have a picture if the whole plate) I tried not to break the egg, but I did, so my first bite is covered in runny egg yolk. I'm the kind of girl who only eats egg whites so this was going to be different for me. It honestly wasn't as bad as I thought it would be. My mom takes control of the situation and cuts the egg up into the rice which is the thing to do. We proceed to devour the rice. I would defiantly order it again. Oh I forgot to mention in the short time we were waiting for the rice we finished the popcorn. We asked for another bowl and out waitress brought it out with no problem. Then our food comes out and it looks good. I'm cutting into my waffles and I notice something on my plate...sweet potato?? I wonder how it got on my plate but brush passed it but then..it's in the waffle..okay. I take a bite and it's a savory waffle?! Oh no. It was bad. I pushed the waffles aside and just ate the chicken and syrup. Everyone else enjoyed their food though. My mom's pork chop was delicious and I pretty much helped her eat the bowl of mac and cheese. The patty melt tasted pretty much like a hamburger. I will say overall it was a good experience but next time I'll order something else."], ["Carol M.", "We ordered a large take out for a small event we had planned at one of those painting party places that was close by.  The food was great but the service was the best.  The chef was super accommodating for the dietary needs for one of our girls.  It is so great to work with people that just plain get people!  Yep, I'm a fan."], ["John B.", "Have been here 3 times. By the third time I realized I'm not a fan of the gluten free ketchup! I need hienz."], ["Jessica H.", "This was an amazing stop. We ate and drank everything! Heard at our table-I forgot to breath!I don't want to swallow!The fried deviled eggs were my favorite. The Mac and cheese was made into a full meal by one of our party. The artwork was also intriguing and the staff was awesome. Win all the way around"], ["Shu J.", "Maybe I went on an off-day, but it was a very underwhelming experience. Three friends and I went here for a Sunday brunch. We were seated on the patio, which was nice and breezy that day. We shared 2 plates of the Fried Avocado appetizer, which was good, but our side got an avocado that was a little over-ripe. For my entree, I was interested in the pimento cheese burger, but they were out of pimento cheese. So, I asked if I could get a regular cheeseburger, but substitute the fries for a salad. They wouldn't allow substitutions. Annoyed with this, I ordered the Huevos Racheros instead, hold the fries. The entree was just okay. I would have preferred more of the black bean cakes instead of the overly generous helping of tortilla strips.Service was spotty and our waitress disappeared at the end of our meal, and we waited forever to pay. A different server ended up grabbing our checks. Both my SO and I agree that this place isn't worth a second visit."], ["Justin L.", "I have been waiting to try this place since I saw it on DDD, and also heard from friends how delicious it is.  Well....once again, the Food Network and public opinion was right! The duck fried rice....you must have this...no if's, ands, or buts.  It was absolutely delicious, and my wife will tell you that I turned into some sort of human vacuum and devoured this fried rice.    For dinner I had the Pimento Cheese Shrimp and Grits.  First, let me tell you that prior to coming to Memphis, the only grits I had were at a hotel buffet breakfast, and I did not like them.  I tried them once again at Sweetgrass, and fell in love with them, so I figured I would have them here at SOB for dinner.  I am so glad that I did.   I have never had pimento cheese\\, and you have already read my truncated \"grit epiphany\", so let me just say, that I highly recommend this dish.  It paired very nicely with the Tiny Bomb beer they had on tap from Wiseacre brewery.  My wife had the special burger of the night, and I tried a nibble (read: Humongous bite) of that, and it was spot on.  I cannot wait to return to this fantastic spot in Memphis!!!"], ["Erick H.", "Awesome little place to grab dinner. I am never disappointed when I visit. You need to try to duck fried rice!"], ["Christina N.", "There are so many wonderful things to say about SOB...I don't know why I haven't written a review before.  To me - when I think of decent bar atmosphere with good food and a casual setting...I think of SOB.  Think Bardog with no smoke and Local with more consistency.  The staff is always on top of things and the food is consistently delicious.  My favs are the chili, brussel sprouts and seared ahi.  I'd skip the chicken and waffles here....a little to oily tasting.They also tend to have a Yelp check-in deal - which always sweetens the deal!"], ["Megan V.", "We stopped in for dinner passing through Memphis, we saw that this place had been on triple d. Instead of your usual bread on the table, they give you a bowl of popcorn sprinkled with brown sugar. That was my favorite part. We got the seared tuna with fried rice balls, and the shrimp with grits. Tuna was good , shrimp was ok. It's not worth the 16 dollars iv had better. Overall it was a nice place to sit in downtown and enjoy dinner."], ["Craig W.", "This location is great. I love this new neighborhood. Parking is good with the adjacent lot. We came for the Street Dog function. Sadly, the rain pushed us inside. But the appetizer was amazing. We had the Chicken and Waffles sliders. I then had the Pork Chop for my meal. The Gouda Mac and Cheese was delicious. I recommend this restaurant to everyone. Come on by."], ["Brian W.", "Great atmosphere for brunch, lunch, happy hour, or dinner! Staff is friendly and conversational, food is good, drinks are stiff."], ["Garrett V.", "Great beer on tap. Solid service. The food is great. Go with the specials (pizza/burger) or the duck patty melt. Second visit just as good as the first."], ["Jane T.", "I loved this place! Always looking for new and different places to go. Food quality was excellent. Def not fast food. Food is cooked to order so it's not super fast but extremely good. I however, don't mind waiting for great food. It wasn't an annoyingly long wait, just don't expect it instantaneously like so many folks expect these days in our hurried up lives. The duck fried rice was to die for as well as the Jack and Coke dessert. And the Mac and cheese was probably the best I've ever had. Love this place."], ["Mariel D.", "Absolutely Amazing!  Visiting from Cali & stopped by.. Ate the Gouda mac n cheese, chicken and sweet potato waffles, reuben style egg rolls, and cheddar grit fries with tomato butter. Plus the complimentary popcorn. everything was so good & the service was amazing by Vera!"], ["Christina B.", "This was my second time at SOB and it didn't disappoint. My first time at SOB was for dinner. I ordered the shrimp and pimento cheese grits and my boyfriend ordered fried pork chops. Both entrees were delicious! Some of the best grits in Memphis in my opinion. The second time we came was yesterday for happy hour. They have a great happy hour selection! $5 for speciality cocktails,$5 wines, $3 beers and $6 appetizers. We ordered the  grit fries and fried chicken and waffle sliders, both very flavor but a little too heavy for my taste. Service was great both experiences! I would definitely come back next time I'm in town."], ["Tracyann B.", "Good brunch. Not an extensive menu but just right.  Had the crab cake Benedict and hubby had the shrimp and grits. ..both were great.  Will be back. Service was nice. Also their drinks are cool. We had the peach bellini...very nice. Not much to say, worth a try"], ["Elle S.", "Update 7/22/14... Duck rice was really good!yay! Not too much spice and edible this time! Thanks!They have good drinks. Foods good but not consistent. I love their Bellini, Brussels   sprouts, and if they would make these items like the first time I had them (they some how f***ed them up every time after the first time): Mac n cheese, tomato n cheese flat bread, and the duck rice."], ["The Irish S.", "I'm giving this restaurant three stars and it bums me out too. Love the vibe, the food was amazing but the service was really weird. The cooks were like goofing around in the back and we had to get up from our table twice for assistance. She helped us out by paying for our dessert that was like 45 minutes late because of cooks. If I was the business owner of such a nice place, I'd want to know that information."], ["Joelle P.", "Location, menu, coolness factor, drinks, atmosphere - SOB has it all. This is one of my favorite places to grab dinner downtown, especially before an event at the Orpheum. Exposed brick and by the trolley tracks gets me every time as far as charm goes, and the menu? Wowza! I am a huge fan of their filet and mashed potatoes for dinner...as well as their steak salad for lunch. It can get a little loud, but I love dining in groups here. And from what I hear from my dining partners, the beer selection is pretty good. Definitely a nice choice away from the main part of Main St."]], "Sweet Grass Next Door": [["Kathryn M.", "Next Door is really a hidden gem! The atmosphere is so laid back. I am a fan of sports bars. I like sports. I like bars. What is so great about next door is that it is all you could want in a sports bar. However, the food. Oh my gosh, the food. Forget your typical deep-fried everything you normally  get when you order bar food. This food is really really good. Don't get me wrong, they have french fries and corn dogs (neither of which I tried yet but will!). I had the meat/cheese appetizer and it was absolutely out of this world good. I sampled some of the food my compadres were eating and it was all equally as impressive. I had a couple of glasses of excellent wine as well. I can't wait to go back for brunch someday and dive into those bloody mary's I hear so much rave about.One warning, if you're on a budget, beware. The prices are really reasonable for what you get, but I racked up a healthy tab before I knew it!"], ["Gee W.", "Pimento Cheeseburger.  That's all I got and that's all you need.OK, maybe not ALL I got, but that's worth it in my mind.  But beyond that, everything that I have tried on the menu is great and definitely not run of the mill bar food.  Very high quality on all fronts.  I come here just for the food a lot of the time.  A number of TVs behind the bar and an overall good set up to watch a game or just to eat and drink.  Good beer selection and no smoking, which is HUGE for me.A great addition to Cooper Young, they needed something like this place for a long time!"], ["Joe S.", "I've eaten at Sweet Grass in the past, but had only been Next Door to grab a drink while waiting for our table.  On Wednesday night, we went to Next Door for the full experience with (and at the urging of) a couple whose food opinions have always been spot on.  We were not disappointed. Walking into Next Door, you will be convinced that you are in a bar that happens to serve food.  You would be incorrect.  Not the part about being a bar (because it definitely is -- complete with multiple TVs, excellent drink options, and more barstool seating than chairs -- but rather about the primacy of the food quality.  I'm gonna go ahead and say it:  all things considered, I'd rather eat at Next Door than Sweet Grass.  I wanted to try at least 70% of the items on the menu.  My wife approved of her standing rib roast sandwich with carmelized onions, and I was a big fan of my butternut squash bisque and fried oyster caeser salad (a special).  I've been on a sort of butternut squash soup pilgrimage since tasting what I consider the holy grail at a St. Louis tapas place called Mosaic.  My wife's homemade efforts aside, Next Door's bisque was as close as I've found to recreating that grail.  The fried oyster caeser was also on point.  I expected maybe 4 oysters, but was thrilled to see no less than 8 or 9 of the Gulf's finest teetering atop the Romaine lettuce.  Our companions each ordered the arugula salad -- a Next Door staple that has already been praised by other reviewers.  The best part?  Even after splitting a cheese plate with the table, a glass of red for my wife, and several Abita's for myself, the two of us managed to escape for less than $60 (tax and tip included). Why not 5 stars?  Even on a Wednesday night, it was difficult to talk at a normal level inside the restaurant, mostly due to the Tigers basketball game being pumped from the speakers.  Also, the service was a little off.  I had the impression that there may have only been one server for the entire restaurant.  I realize that these complaints make me sound like a d-bag because, after all, Next Door makes no bones about being a bar.  It just so happens that you might forget that once you start eating."], ["Chris M.", "My first trip in was not very good. Food wasn't very good, mediocre service, etc. Was a while back and they hadn't been open very long. Well, this trip was much better! We shared a butchers plate and it was really good! It actually looked much better than the one pictured and tasted every bit as good as it looked. ( $22 but well worth it for the variety and quality ) Judging by how many orders of the crab cakes were going out, I would think they would be worth a try. The staff was very attentive and I never went without a cold beer. For people who like the smaller craft beers they have a good selection and several on tap. ( I drank the foreign beer they call Bud Light ) Went to watch the Tigers ball game since the Deli didn't have it playing. They have a lot of TVs and a pretty good setup for game watching. We will go back soon and try some other items from the menu."], ["Vim I.", "After a dinner at Sweet Grass, my girlfriends and I stopped by Sweet Grass Next Door for after-dinner drinks. It was a pretty cold, rainy night so we were appreciative about walking a few feet to the bar without having to leave the building. I loved the atmosphere--classy, yet casual. The wait staff was quick and attentive. There are TVs to keep the sports fans happy and a pretty good beer list. Only downside--they didn't have Blue Moon which is my usual go-to beer."], ["Mahogany W.", "It was great. A friend and I went pretty late after the kitchen was closed but all and all it was a laid back setting. I enjoyed it very much. We ordered shots of Eagles Rare on something they called \"sexy ice\" which I thought was cute. The bartender with the shaved head actually paid great attention to us. We are going to make it a point to go back but earlier so we can try the food. I give them 2 thumbs up for the ambience and attentive bartender. Kudos guys!"], ["Twila R.", "Love this place!! We came here to watch football on a Sunday afternoon...great Bloody Mary, amazingly clean, local and delicious food, as well as an inviting, hip, comfy and laid back decor.  Will definitely be back often!!"], ["Stacie C.", "Good food, great service.  Sweet Grass Next Door is a casual/upscale hybrid.  On first arrival it has an upscale feel, but you soon find a very casual vibe (I think the big screen tv's and friendly staff help with that).  Our party shared the sausage and cheese tray (which I do not recommend...just not my thing - blue cheese, head cheese, pickles, etc), but the hand cut fries were awesome especially when dipped in ranch (possibly a house made ranch? very tasty!).  Others in my party raved about the pimento cheese burger and fried egg sandwhich. For sure on my list to go back and try the crabcakes and chicken n waffles. The only downside I could find (which is actually in the whole Cooper Young area) is lack of parking space."], ["John E.", "Yes, do come to watch the game or scope out the attractive patrons.  It is a bar. There are TVs where you need them, including a giant one at the far end of the bar.   But you will be blown away by the food.  Chef Trimm has elevated \"bar food\" to another level with this inspired, local ingredient heavy menu.  The pimento cheese burger is pure food porn.  Get it with bacon and a fried egg on top if you're feeling macho.  The butcher's platter is a more refined way to grub, but is equally satisfying.  Always check the chalkboard specials, there is usually something there for the adventurous (like beef heart with red sauce, amazing).  You like beer?  Good, because they have a large selection of high gravity beers and several on tap (I recommend the Delirium Tremens).  The cocktail list is eye catching (try the Green Fork) and oh, they have Pappy Van Winkle bourbon.  'Nuff said..."], ["Jen C.", "Sweet Grass Next Door is the type of bar that can accomodate any mood. Whether I'm looking for a place to start my evening, or I want to watch a game, or sit and chat with friends over cocktails, Next Door is always an option. I've had several items off both the food and drink menus and have been consistently impressed. The butcher's plate is outstanding, and the bartenders know what they're doing. One of the best bars in Midtown -- I hope it stays open for a long time."], ["Malcolm C.", "One of our favorite places in Cooper Young. Not to be confused with it's Hoity-Toity relative, Sweet Grass, SGND is an intimate bar that is quite laid back. There are many large screen TVs, and it is non smoking. This is a good place to hang out and to watch a Grizzlies game and drink a few high octane beers. In my opinion they have the best oysters on the half shell in town. They are very large and have some unique sauces to accompany them. Many claim the pimiento burger at Sweet Grass Next Door rates as the best burger in town. It is very, very, good and unique. We find the service is alway good and friendly and I can truly say I have never been disappointed with anything on their menu. I had the portabello mushroom recently and it was very good. My only suggestion for improvement  is work on your drinks. I ordered a martini and it was served in the wrong glass and was luke warm at best. Other than this, we always find ourselves coming back."]], "Cafe Society": [["Terence R.", "A great place to eat! The food is excellent, and the wait staff very friendly.  It is surprising to me that every time I come in to eat there is not a line around the corner waiting to come in (albeit we do eat late).  We have come for dinner and also go in just for dessert if the mood strikes us.  The chef will come to the table and talk with the patrons and make recommendations and you can sometimes see him looking in to see if all is well.  That shows me that he is also interested in what happens in the front of the house, and I find that comforting. My only suggestion is to turn the heat up a couple degrees in the winter as if borders on chilly at times."], ["Ron K.", "I was visiting my daughter in Memphis she said this place had a good reputation.  We were seated @ 7:30, served cold bread, salads fairly quickly after we ordered....then it ALL slowed down. FINALLY...the entrées @ 9:34 pm.  No special requests & two of the four of us ordered the special for the evening.  The food was good, but NOT worth a 2 hour wait."], ["Jack B.", "Been dining here for years and driving from East Memphis to get there, most recently on a rainy Friday evening. Place had a nice crowd and several small private parties. Greeted warmly and seated  promptly in a quiet corner, server was friendly and knowledgeable of the dishes and the wine list. Food was very good from appetizer to dessert. Chef/owner came over to visit and inquire about our satisfaction. We received what we expected from a restaurant top notch dining experience."], ["Veronica X.", "Walked in expecting this to be neighborhood hangout instead of a dining destination due to its location, we were a little taken back by the prices: all entrees are between $25 and $30. On our first visit, hubby ordered the special House Smoked Pork Chop with a cup of French onion soup, which came to $32. The soup was very good. He was blown away by the smoky, juicy pork chop, and still raved about it after a couple year. It was very substantial and more than necessary to make an enjoyable meal. I ordered the mussels appetizer as my entree. It was good but not the best I've ever had (not the freshest, I suspect). The table bread was cold and borderline stale. You can get better French bread from Kroger. On a second visit, we were both disappointed: the Roasted Sea Bass was overcooked, the potato puree underneath was boring, the overabundance of fatty pancetta was more of a distraction than a complement. The lamb chops were alright to me but he said he had better lamp chops at home and elsewhere. The complimentary bread was an improvement from our first visit. Portion sizes are larger than what you would expect from a white-linen restaurant. I personally would like to see a smaller portion size with a slightly lower price, which makes a more proper dining experience in my humble opinion, and may draw more people in. Plus, diners may be more inclined to order desserts after a delightful but not stuffy meal."], ["Andy S.", "Café Society was my group of friend's choice for our fancy food Monday for the month of March.  None of us had ever visited the restaurant before.For our appetizers, I chose the Fricasee of Escargot with wild mushrooms and chorizo.  It was delicious.  I haven't had escargot since I was in France several years ago, and Café Society's version did not disappoint.One friend ordered the Goat Cheese Croquettes with balsamic macerated cherries; spicy radish.  I love goat cheese, so this was perfect.  My other friend ordered Crab &amp; Shrimp Gallette with arugula, picked onion &amp; caper aioli.  It reminded us of a delicious crab cake.Our meals came with a salad, and I enjoyed mine with the best dressing ever... blue cheese.Unfortunately, I can't remember the name of what I ordered.  It was veal stuffed with goat cheese, topped with a thick red wine reduction, and sitting on a bed of potatoes.  It was delicious, but not my favorite of the evening.One friend ordered another special, which was seared scallops on a tomato and garlic lasagna.  This was my second favorite of the evening.  My absolute favorite was what Jefferic ordered, which was Pan Seared Black Grouper En Croute with leeks, turnips, rock shrimp &amp; crab.  It also had pieces of brie in it.  We were all stuffed after the meal, so we skipped dessert.  I definitely want to go again and try the filet with blue cheese potato gratin.  They had a groupon not too long ago.  Regretfully, I didn't buy it."], ["Rob B.", "This is a place I have been trying to experience for several months based on the chef's pedigree, and finally was able to enjoy yesterday evening.  I took my eldest daughter here for her 9th birthday; it didn't hurt that I had a $50 voucher from Living Social and love French cuisine, so you could say I went mostly for me under the guise of a special dinner with my daughter. I reserved the table through Open Table and made a request that they do something a little special for her. I didn't expect anything since I didn't follow up with a phone call, but was please to see that they had decorated the table in confetti and gave her special attention and acknowledgement from the Owner/chef to the wait staff throughout the evening. As mentioned in an earlier review, the menu prices are marginally expensive, though not too over the top if you come prepared knowing this; I think if the prices had been lower, they would be considered \"less than expected\" (which can be a nice surprise!) and so in that regard I didn't consider it off-putting.  The food: the Sea Bass was well prepared, but I concur with Veronica's review that there was maybe too much pancetta; mine wasn't overly fatty, but the flavor is much stronger than the fish and thus could be used with more restraint. The potato purée, while good, had an over abundance of butter. My daughter had a filet mignon, which was charred black on one side (maybe someone forgot to flip it), but otherwise was cooked per our order. The pommes frites, which is not what not what normally comes with the steak (maybe that's the issue) were sitting in the juices of the steak and thus soggy. My wife had the pan seared scallop special with spinach, pasta and a cream sauce was rich but balanced. For desert, we had the sorbet which was very good (reminded me a little of the sorbeto in Italy), and crime brûlée. The crime brûlée had a great light custard, though I believe they used too much sugar on the glaze as it was thick, hard to break, and instead of accenting the custard, took away from that delightful and light flavor. In summary: this is a place I want to love, maybe in great part due to the friendliness of the Owner and waitress, but there were some issues with the food that kept it from being REALLY good. I also felt the decor was \"tired\" and as such the atmosphere needs something....anything.....though there was very nice artwork in the dining room. On an upside, we shared all 3 dishes (steak, scallops and fish) with my 5-year old and she raved about it all night! If you want brutal honesty, ask a 5 year old girl!I'm giving the food 4 out 5 stars because I think that even the flaws were not so bad as to say it wasn't good and has the potential for something great. The dining experience gets 3 out of 5, because while both friendly and helpful, the waitress would leave for long spans of time leaving us unattended; to me, the experience is equally as important as the food quality. It can either elevate or ruin your feelings about a restaurant."], ["Amita H.", "We moved from LA to Memphis not too long ago and had been craving French food so we decided to give cafe society a shot. We were pleasantly surprised with the menu options and the wine list. We ordered escargot, which was pretty good. The entree my husband and I ordered very both excellent. For dessert we ordered cream brûlée which was average, have eaten better. Overall, I would definitely come back and highly recommend this place. Pros: good food, ambiance, nice wine listCons: little expensive for Memphis and smoking in bar area."], ["Jen M.", "We went for Valentine's Day.  Not the fanciest spot, but a nice quaint little place.  They had a problem in the restaurant with smoke when I was there, like something burned in the kitchen and it was super smoky.  I couldn't breathe, actually...had to step out for a bit to get some fresh air.  Eventually we asked about the smok and they turned on the big fan overhead...and then, everyone was cold.I had the scallop entree and it was yummy.  My husband had the chicken and he liked it.How's it rate on value?  Average.  Definitely not the cheapest place - we had a Groupon so it was worth it.  But it was good and I would probably go back again."], ["John P.", "Stopped in the other night for dinner. I had a roasted rib eye steak, smothered with caramelized onions and mushrooms. I've eaten at many steak houses in my time and this steak was the best I've ever had. It's not a regular menu item, it was the evening special but, ask for it."], ["Amanda G.", "Yes it is not cheap, but the owner is from Belgium and speaks French and therefore I am in love. The oyster appetizer is amazing."], ["M A.", "Only one visit. Restaurant only. Appetizer with undercooked bacon and blistering temperature. Ironic?! Arugula salad over dressed and with the arugula passed its prime youth...soup of the day ok, but pay 7-8 bucks for a swallow...scallops half of them undercooked and covered in half a ton of capers...lamb chops really poor quality, fatty which didn't go well with medium rare temp...only highlight was the creme brûlée which was excellent. Not going back...just did not enjoy food and spend 120 without wine. Your experience may be better, but the spotty nature of the food quality is not an attractive feature."], ["Jeff M.", "One of the best meals I have had in a while.  Friendly staff and great chef.  My dish was scallops on salmon on shrimp on pasta with spinach and cheese.  It was enough for two. Cocktails were great.  My wife's broccoli, salmon and clementine salad was also excellent.  We will be back."], ["Jeremy W.", "This was hands-down the one of the biggest disappointments in \"fine Memphis dining\" I've had in a very long time.  I don't frequent the scene often so when I do get out-and-about I have high expectations of which Cafe Society failed miserably on all.  Where do I begin?  It's tough I admit but here goes (everything in the nutshell version I assure you):  I called well in advance and placed a reservation for two and made it very clear it was to be a \"romantic\" dinner for two.  And I even gave a few specific examples to the reservation taker of no-go seating scenarios for me.  Simple enough.  Or so I thought -- okay so it's Valentine's eve and love is in the air, well everywhere BUT Cafe Society that is.  We arrived, in coats and gloves, and were welcomed with \"How's it going GUYS?\"  -- Seriously?  I expect this casual chatter from Buffalo Wild Wings (which I love) but not from a place like this... I expect \"sir\" \"ma'am\" or if they wanna go French like they claim \"monsieur\", etc... certainly not GUYS.  Okay, so we are seated and there are apparently no coat racks for coats.  Wha?  Again, I wouldn't EVER expect this from Applebee's but seriously, it's a $125/dinner restaurant that claims to be among the best in Memphis.  Not so my friends... So we drape our coats over our chairs and make do.  But guess what?  They've seated us by the door, the front door where all of the customers come in and wait & chat, and where the cold air makes it's way into the restaurant the most.  Is this their idea of \"romantic date\" seating?  So after I \"try\" to make the best of the front-row, cold, non-romantic seating where the servers and the horrible owner continue to talk about guests that haven't shown I decide I can't take it anymore.  I ask to be re-seated - annoying to those in the server profession I know - but again it's not O'Charley's it's $125+ Cafe Society and it's Feb 13.  This is when it was obvious to me that this hole in the wall, wanna be upscale establishment, had no idea about customer service.  Here's the answer to my \"can I be re-seated?\" question:  \"Sorry sir, we are all booked up, mostly regulars who want specific seats?\"  There's nothing I can do.\"  The restaurant was EMPTY and when we left at 7 there were plenty plenty plenty of seats open -- I looked!  I then mentioned specifically my requested for a location a little more private and she reiterated how important her \"regulars\" were and how \"nothing\" could be done.  Brilliant right?  So I sat back down and tried to make the most of it despite the constant business/server/owner chatter going on in the room, the guest passer-byers every 2 minutes, and the waitress that seemed to enjoy butting into every conversation we had.  At least in my experience with pro-restaurants, the server at least waits until you finish a sentence before barging in with questions about water/food/etc... Not so here folks :(  So then the icing on the stale, disappointing, dry cake: I was not allowed to use my Cafe Society gift card that I'd been saving for this specific occasion for over 4 months.  The short story is this:  I mistakenly placed my credit card in the holder and the server rang it up, I then realized what had been done, and then requested that transaction be cancelled and they set up a new transaction.  Believe it or not I've done this before at \"regular\" chainy restaurant and it's never been a problem, never!  Well because of a LivingSocial discount I'd used they said it couldn't be done.  Simply put: they refused to find a solution.  I told them that I wasn't in the habit of frequenting high-end (haha - they wish) establishments like this and that I really couldn't afford to pay for this meal without a gift card - and the owner himself, whom I'd asked for, just said to me that he couldn't do anything.  Furthermore, he never gave me his full attention, never -- his eyes were on his regulars and just about anyone else he could find.  He failed to solve my problem and definitely failed to show me he cared enough about my experience to give me a full 60 seconds of his time.  Owners like this don't deserve your business - don't give it to them!!  I, and the affluent patrons who gave me the gift card to begin with, will never frequent this establishment again.  Memphis French dining, a joke."], ["Sonnet B.", "One of the entire family's favorite places. The Family loves the patio! The restaurant menu is amazing. (I can eat an entire plate of just the vegetables that go with the corvina...).  It is kind of a special occasion place, if you're eating in the restaurant.  However,  the bar menu is why The Husband and I go entirely too often.  You have beautiful pommes frites and burgers, oysters, all the good stuff just on a higher level. But one of midtown's hidden gems is the chef's choice pizza. Throw caution to the wind and just go wherever the kitchen takes you...!"], ["Terry B.", "What can you say about great food and service.  The chef makes some of the greatest variety of tastes, from a Kobe Hot Dog with smothered onions and real bacon as well as super French fries to seafood or meat offers.  A great martini bar as well.  The bar food including their pizza is top shelf.  Love this place!"], ["Jennifer B.", "I really do like Cafe Society. My mom and I went on our own girls' night together. We had a lovely time - the service is great, the food is delicious, and the place is charming."], ["Shannon L.", "Cafe Society is an underrated French restaurant in Memphis.  It seems pretty bare every time I pass by it, and nobody really ever talks about it.  I cannot determine why this is either. I have always had nothing but great experiences there, and this past time was no different.Scott and I decided on a nice dinner out to Cafe Society not too long ago.  Though I have been several times, this was my first full meal here.  I have only gone in the past for either an appetizer or dessert only.Cafe Society has a wonderful quiet, romantic atmosphere, the kind that reminds you of a cafe actually in France.  The black table cloths and dark walls are balanced out by dim lights on every table.  The place was a good mix of couples and businessmen.  Our server, who was fantastic and over-cheerful the whole experience, presented us with a wine menu and bread basket almost immediately.  Cafe Society has a great wine list.  We chose to split a bottle of white wine.The bread was pretty average.  It was warm french bread, but there was not much special about it.  I ate a coupe of pieces.For an appetizer, we ordered Oysters Maurice, \"Topped with shrimp and cheese gratinee.\"  Our server recommended them, so we decided to go for it.  They were great! They had the richness that all French food had.  They were bursting with flavor, and the french bread to eat with them created a perfect texture contrast.For entrees, we both ordered the specials that day.  Scott got a steak with pommes frites.  It was a perfectly cooked, nice cut of steak.  The fries were shoestring and crunchy, with a unique but perfect blend of seasonings on them.I had a salmon filet, which was topped with scallops, shrimp, and vegetable medley.  It was served on a rice pilaf.I do not even know how to describe how amazing this entree was.  I ate the whole entree with my eyes closed, so I could concentrate on the flavor.  I was full about halfway through it, but I devoured every last bite.  The flavor combinations were perfect.  The dish was rich, but not too rich.  There is nothing the chef could do to make this taste any better.I am very pleased with Cafe Society and hope it does well.  The service was excellent, and the food was as well. It's a bit pricey for your average night out, but it is perfect for a celebration."], ["Barrett R.", "Nice decor...yes.  Tasty food...NO!  Pommes frites were almost burnt.  Oysters Maurice were pitiful.  The veal was like rubber...served with grapes and tarragon...Veal Veronique.  Terrible.  The waitress took soooooo long to ask for the entrée order, they were out of the specials we wanted.  The sea bass was lost in the oily mash with huge chunks of pancetta.  The fish could have been catfish and no one would have known.  The menu and food seem to target an older, less foodie-like audience.  Perhaps if your taste buds were shot, you might enjoy it.  Did I mention that the average entrée is $28?  Pass this one."], ["Jolynna M.", "Known by locals as simply Cafe \"S\", this darling little midtown bistro is a neighborhood treasure. The chef, Cullen Kent, is a graduate of Le Cordon Bleu in Paris, which is apparent as you sample the various dishes with international and French emphasis. There are several items on the menu that I love and highly recommend, the first being the French Onion Soup that Noelle P. already mentioned. It's packed with flavor and piping hot - a real treat on a cold day, or any day for that matter. For starters, another favorite of mine on the menu is the Oysters Maurice - topped with shrimp and a cheese \"gratinee\". Or if you're brave and adventurous, try the Frog Legs. Tastes like chicken. :) For entrees, I have a hard time deciding which is better - the Sea Scallops, pan seared with shrimp, sausage and roasted corn, or the Filet of Lamb with a spinach and goat cheese tart. It's divine. Really. But then so is Cafe S. Put it on your \"to do\" list. You'll be glad you did."], ["Beth S.", "We rediscovered this long-time favorite several months ago on the way to a party in the nearby neighborhood. We stopped in for a quick drink, fell in love with the bar and resolved to come back for dinner with friends. The bar is cozy and comfortable with wide-screen TVs and extremely friendly service. We've been twice in the past few months and both times have enjoyed our meal very much. I love the sea bass, my husband loves the steaks and most recently, the scallop special, over a shrimp risotto was rich, creamy and delicious.The two desserts ordered at our table, creme brulee and brandy alexander were yummy.Great place for a quiet dinner."]], "Cafe 1912": [["Ambuj A.", "We went for a Sunday Brunch and were impressed by the food. I ordered the Irish Breakfast and it was delectable. I did not give a 5 Star rating for the following reasons:1) The Mimosa's were below par and had staleness to the juice2) They don't accept American Express 3) Despite managing a smaller space well, they can do a better job."], ["Hattie J.", "We started off the morning with drinks....bellinis and mimosas, and well, you can't go wrong there! I ordered the Croque Madame, and my boyfriend had the Irish Breakfast.  The food was pretty good. The service so-so, as the waiter kind of disappeared once we got our food. Overall, I'd say its a good little breakfast spot."], ["Christina N.", "Visited with family for Sunday brunch. The food was very good! Between us we got the seafood crepe, French onion soup, burger and monte cristo. I'd recommend and eat again all of these except the French onion soup.  It wasn't bad just not amazing. Service was also ok. The atmosphere was romantic but small. Good for a date night but not if its a first date or good if you want space. I plan on coming again for dinner!"], ["Zachariah H.", "The food was fair although going out is also about service which was quite poor. Many obviously agree that the staff of servers does a less than mediocre job at basically anything that a great server should (promptness,  politeness, opinion on menu items, knowledge of restaurant). Was not given a single opinion on anything pertaining to the menu even after prying for information.  I was brought the wrong wine not even the same color, ha I thought it was a joke. The thing that makes it completely dissatisfying is the fact that it was 530 and the restaurant was empty. Maybe train your servers better also maybe some more French wine!"], ["Thuy N.", "This place is a little off the square on cooper. We got here early on Saturday at 5PM when they opened since we did not have a reservation. We were promptly seated near the entrance at a window seat. I liked the natural light and it was good for my photos. It has a very casual vibe inside with some interesting decor. Parking was a little confusing, but we parked at the fresh market and walked over. The food at this place was great. I really enjoyed everything I ordered, plus the complementary bread with balsamic and olive oil dip was delicious. So delicious that we got a second, no, a third basket! It's addicting. Food:Mussels - they were so savory and full of flavor. The white wine sauce was a perfect balance to the mussels, and the crispy croutons on top were a great pairing. $12.50Ham & Gruyere baked chicken - this entrée comes with a side of mash and gravy with asparagus. The potatoes were smooth and the gravy reminded me of thanksgiving. I really liked the add of the ham inside the chicken because it added a nice salty taste to the breast meat. $18.50Pan seared mahi mahi special - this dish was excellent. I would order this again if I could, since it was a special. The mahi was cooked well, and came out nice and flakey. It was filling and light. $24Cheesecake - definitely recommend this dessert. It is so creamy and thick. And the amaretto with fruit sauce is a great addition to break up the creaminess a bit. It's not too sweet either. Yum. $7Overall, 4 stars for great service and food. I'll be back again :)"], ["James H.", "The bartender sucks and has an attitude... He was waiting on our table and neglected us for 30 mins... Once I brought it to his attention he copped an attitude!"], ["Lee C.", "Love 1912! What can I say about it...hmm, the calamari is always crispy and tender. I usually get the scallops, another fish special, or the blue cheese burger, but I always have a great dinner here. I personally love the atmosphere even though there isn't much space. The dining area somewhat wraps around the kitchen and the bar so the staff are always moving about with haste. (I like it!)"], ["Gen M.", "I wanted to check this place out because of the dark & moody ambiance that I notice every time I drive by, as it seemed like the kind of place that the darker sort of folk (namely my always-clad-in-black self) would be comfortable sitting alone at a table. But luckily my partner was in town, which means more menu items to try. We sat at the bar, as all of the tables were already reserved. Usually I'm pretty uncomfortable eating at bars, but this was set up so that you're not bumping elbows with anyone.I have to say, this was definitely the best meal I've had since being in Memphis. To list:Crab Cake... When I saw it, I thought it was going to be 95% filler, but nope, so much yummy crab covered in a crunchy panko crumb. And the 'spicy' sauce, while not spicy, wasn't some abomination that super-trendy restaurants keep trying to pair with their poor little crab cakes. My partner got one bite.Mussels... Best broth I've had in years. I could have eaten a few orders of these.House Salad... Three ingredients. Nothing else needed.Filet with Truffled Mash, mid-rare... Perfectly seasoned and cooked. Not completely charred on one side like I've experienced at other restaurants here. AppleJack with Beurre Blanc, special... While I'm all about sushi, I can't stand cooked fish. So every time my partner and I go out, he orders s fish dish, I take a bite, make a face, and put yet another species on my list of fish that I can't stand cooked. So not the case with the AppleJack! While I probably couldn't eat the entire serving, this was the most texturally enjoyable fish I have tried. Partner wouldn't stop raving about the beurre blanc.Amaretto & Goat Cheese CheeseCake... The woman next to us saw the look on my face when I bit into it, ordered one for herself, which resulted in the same exact face. Get the cheesecake. Especially if you're going home alone.The service was perfect... Made you feel more than welcome while staying on top of things. And this is definitely the kind of place that you could go to alone and not feel at all awkward."], ["Matt S.", "Had read good reviews on this place and was excited to give it a shot. Called in at open at 3:30pm to arrange reservations for 4. The only slots were 5:30 or 8pm unless we wanted the table by the kitchen door. We opted for 5:30... Very early but we wanted to avoid being seated In a noisy high traffic area. We arrived at 5:25 to an empty restaurant. We tracked down the hostess who then pored over the list then walked is to the only other table in the hall by the kitchen. I explained we arrived early to avoid such a table. She acted very put out and spent 5-7 minutes between the list and the back room... Nearly every table is a 4 top and none were occupied. What the hell. We finally get a table by the door. Okay. Our server was nice but very slow and quickly was overwhelmed by his 2 tables. Drinks were slow. Food was slow. Table touches were few and far between. One of my favorites, French onion soup, was average at best. Scant onions and the cheese was exceptionally clumpy. The broth was lacking flavor. The mussels app was very good. Great broth/base and properly cooked. Entrees came out and my grouper was good but slightly overcooked so it was tough on the thinner ends of the filet. Overall it was good but not great. My date's scallops were quite undercooked. To the point we questioned if they were safe to eat. $25 for 3 scallops you'd think they could cook them properly. Have to add that we struggled to hear each other over the din. For the style of place it is, the noise was a bit much. Had to flag down the server to get our checks. Overall some highlights but overall a disappointing experience on the food and service front. I'd go 2.5 here for the mussels and the accompaniments to the grouper, but forced to round it's got to be down. We won't be back."], ["Tom E.", "French cuisine will always hold a special place in my heart.  No, I never ate it as a child, but it was the staple of my culinary upbringing in school.  It takes a lot of time, patience, and proper execution to get it right.  When done properly, the results are amazing.  So when I had the chance to go out to dinner last Sunday with awesome company, I had French food on my mind.Café 1912 is located in a block of 3 buildings (in between a salon and Barksdales) on Cooper.  The parking is very sparse (like 3 spots), but there is plenty of parking on the side street(s).  Upon entering, the first thing you see is the kitchen, and a few tables.  Looks very intimate, and then you realize there are more rooms, and even a patio.  I didn't do much exploring- but I had no need to, I was having such a great time.We had reservations for 7:15, and had no issues with that.  We got seated in the main room, with a perfect view of the kitchen.  It took a few minutes to get the ball rolling, but we finally got our drink orders in.  We got a bottle of wine (cannot remember which bottle), and a cheese plate too.  The menu is simple, with heavy French influences.  There were even 3-4 specials too.  It was tough to decide.  I may have looked at the menu for at least 10 minutes.  I finally decided on the duck special- which included shoestring garlic fries, greens, and a fried egg over medium.The cheese plate arrived, and it packed a punch.  A goat cheese, a bleu cheese, and a creamy brie, along with a cranberry/onion relish, toasted nuts, and thin sliced bread.  They did it right with the cheese being served at room temp, so it was easy to spread on the bread.  The cheese went really well with the relish and bread.  I didn't eat any of the nuts though (I later put them in my pocket for a later time).  I wish there was more bread though, with the amount of stuff on the plate.It was then time for the entrees.  2 of the plates came out, but we were waiting on the mussels to come out.  They came out about 3-4 minutes after.  So it was time to eat!The duck was cooked and seasoned pretty damn well. It was juicy, and I have not had duck like that in a while.  It was pleasant.  I mixed up the egg, fries, and greens together and ate them like a barbarian- went down like a champ!  It was worth the wait.  Dessert was offered, but we decided to go down the street for more drinks and dessert.This is a solid place to go out to eat.  It was relaxing, and I enjoyed it thoroughly, with the company I was with.  I will be sure to go back!  Be mindful though dinner here is slower paced, and they do not rush, so if you want something quick, this may not be for you!"], ["T S.", "Café 1912 is a very informal quaint French restaurant.  Nice wine list.  Great cuisine. Impressive menu"], ["Daniel B.", "Atmosphere: Eh...?Service: Uh..was ignored for long stretches, never asked if I wanted another beer. Maybe they assumed I'm a bad tipper because I look young?Food: Don't try to sell me an $18 chicken entree that comes with no sides, is tiny, unremarkable in terms of flavor, and is covered with canned mushrooms. Also, don't try to sell me $24 pasta plate that is identical to that of so many low-end 'italian' chains. The lobster-less lobster bisque is a bad look, too. In summary, the experience made me want to start writing positive reviews for all of the other restaurants in this price range that are actually doing good work, so I guess something good came out of it."], ["Brittney H.", "I love this place! It's such a secret place in Memphis... In my opinion! ;) I always order the grouper, so I couldn't tell you what other entrees are good, but my fiancé swears by the baked chicken. Make reservations! They get busy in the evenings and it's a pretty small restaurant!"], ["Velnest B.", "I ordered the burger with bacon and provolone cheese. The burger was just ok. I asked for fries for my ketchup and didn't get it until after I had finished my fries. I was told they had no spout for the ketchup dispenser.  The service was ok overall but a little slow. They did take car of our drinks because of these issues."], ["Mary Nell B.", "Always a pleasurable experience in this local restaurant. Cheese ravioli for appetizer was excellent as was the spinach salad, pork chop, beal and ricotta blueberry dessert. Service was friendly and right on the mark."], ["Joelle P.", "I hadn't been to Cafe 1912 in 8 years until last night. I don't know why I had completely forgotten about this place! It is extremely cute and very well located (Cooper across from Midtown Yoga). I am currently fighting a cold, and was thrilled with their hot tea selection. An odd thing to be raving about, I know, but it made my dinner. Also fantastic was the onion soup (also good for my cold and sore throat). But my absolutely favorite dish of the evening was the cheese plate. I am picky about my cheese but it was divine (especially the bleu cheese). I didn't get to try anything too fancy since I was sick but I can't wait to go back there. It is definitely on my radar now!"], ["Roman S.", "In short: Overpriced for what they offer. Service was friendly and great and didn't look at me funny when I asked for another helping of bread, which I clearly very much enjoyed. I had hoped that their pizza would benefit from those bread crust and flavor skills, but unfortunately, the bread was from a New York baker and the pizza turned out to be only so so. My wife's mussels were okay, the white wine sauce dominated but not in a good way (I preferred to soak up olive oil with the bread instead). The atmosphere was okay, fake bistro I suppose, but if you sat close to the kitchen, you could at least enjoy the show."], ["Jennifer B.", "Delicious food - a French bistro with lighting too high, freezing on a cold night when they leave the airlock drape open.It's sort of tacky and trashy (that's a bit of an exaggeration but not sure how to describe it - faux French?) looking but the food is excellent and the service is lovely.Mom & I shared an excellent filet, sis & daughter had a margarita pizza. Decent chard and different Caesar salad with olive tapenade instead of anchovy.Bourbon bread pudding was not well received by the group - pronounced a bit gummy but I found no fault with it - I voted yummy.Not what I expected but very good and definitely worth a try."], ["Brandi W.", "Wow thanks again yelp!! This restaurant is amazing we are here on a Sunday with our well behaved 7 year old. Otherwise I wouldn't recommend kids. The food is amazing!! We had the onion soup, it's the best I've ever had!! And the crab cakes Benedict was great also!!"], ["Sara R.", "The Crispy Chicken dish was AMAZING! It's like fancy chicken cordon blue, I could almost due without the ham and cheese the chicken was so good, but still a great dish! Sides with it were delicious, too. I had the calamari for appetizer, which was good. The dipping sauces didn't really add anything to it, though. Waiter wasn't the most personable person I've meet but the service so far as wait times between courses and drinks was satisfactory. Great little place in Memphis!"], ["Jolynna M.", "A simple French bistro with an open kitchen and sidewalk seating.  It's charming and the food is outstanding.One of my favorite items on the menu is the Seafood Crêpe with a petite green salad.  It's rich and decadent and I absolutely love it.  The portion size for this particular dish is a little small, so you might consider getting an appetizer or perhaps a side of something else if you're very hungry.  Such as the Onion Soup or the Goat Cheese Ravioli - both are excellent. One thing to note is this is a fairly small place and it's popular and crowded on the weekends.  It can be a little noisy too.  But if the weather is nice, you can sit out on the sidewalk.They have a decent wine list, and several selections available at only $24 per bottle or $6 by the glass."], ["Joey J.", "Great food and atmosphere!  Prices are just slightly high, but I will say its a classy joint for the area.While I did enjoy the Sunday brunch, I must say that Brother Junipers cooks up a better breakfast, albeit in a less refined atmosphere.Bread pudding is outrageous.I would come back here for dinner and would expect it to be very good, but probably nothing too special for the price."], ["Fina S.", "Shawn Iisley is the best thing about this place!  He is a fabulous bartender and server.  And when my husband and I go there, he always makes up feel like old friends! The reason that my husband and I go back and back and back there, is simply because of Shawn!  He has great customer service! We just heard that he is no longer here-so WE WILL NOT BE COMING BACK!  SHAWN IS THE ONLY REASON THAT WE WOULD GO THERE!  The food was not that good, and when Shawn did not take care of us, it was horrible! P.S. The five stars was ONLY for Shawn!  P.S.S. Please let me know where you wind up Shawn-WE WIL BE THERE!"], ["Lori M.", "Amazing food! Great prices! Love the service! Recommend the grouper and the salmon."], ["Mark D.", "Love the place - great prices and food - excellent staff - though sorry to hear Shawn the bartender just left - hard to go wrong at this place!"], ["don S.", "\"I was stunned to see the negative review on Shawn who in my opinion is the best restaurant manager and bartender in Memphis. The way he interacts with customers is always so pleasant, personal, and professional that I can not imagine his responding as indicated.  Shawn has definitely been a major draw for this restaurant and I must say that a lot of the charm of 1912 is lost with the absence of his personality."], ["chelsea l.", "I went here with a group of 3 without a reservation at 6pm.  At first, the hostess acted like it was going to be impossible to seat us because they had their first reservation coming in at 7pm.  After a few minutes, it finally dawned on her that we could eat at the bar.  The food was absolutely positively amazing! Definitely one of the best meals I have ever had!"], ["Ciara N.", "A french-themed, open-kitchen breakfast/lunch/dinner restaurant, 1912 has done well in Cooper-Young since it opened a couple of years ago. Tiny, cramped, and loud, the interior isn't that easy to love. Fortunately, the food is transcendent and you'll soon forget all about the 400-lb gentleman ramming his chair into the small of your back every three minutes.Though somewhat pricey ($8-$20 for entrees), 1912 remains affordable. Most dishes are just fine; some, though, knock it right out of the culinary park. Anything with their crisp-fried bacon lardons is worth getting, though the Salad Lyonnaise is particularly satisfying.Of particular note are their brunches. Every single egg dish is phenomenal. The lobster eggs benedict is worth committing at least second-degree murder. Mimosas with breakfast ensure everything will taste that much better."], ["Leila F.", "Had a really great brunch here.  Their crab eggs benedict was amazing I went with my mom loved their salmon spinach salad.  Really cute and cozy atmosphere.  Very unique little place.  I can't wait to go back for dinner."], ["Gayle A.", "This is an Amazing restaurant! From our cocktails through our desserts, everything,and I mean every thing was awesome! Ben waited on us and he was perfection. I have to recommend the mussels as an appetizer, and the ham and goat cheese stuffed scallops as an entree. until tonight, Flight was my number one dining choice in Memphis. Now it is number two. Thank you 1912 Cafe for a GREAT evening!"], ["Britton C.", "My wife and I went to Cafe 1912 for our 11th Anniversary. The food was great, the atmosphere was charming, and the service was terrific. I don't really have anything critical to say other than our table was too close to the door. We ordered the mussels for an appetizer, and it was as good as anything that I've ever eaten. The bread was very soft and was perfect for dipping. Our entrees were ample in size, but what was really nice was that they weren't too big. For dessert I ordered the goat cheese cheese cake. I'm not a fan of cheese cake ordinarily, but this one was a hit. It was very moist and seemed to be fluffier than regular cheese cake. Our total bill was just over $80, which included my Tanqueray  martini.  I was extremely pleased. I thought that my wife's filet was as good as Folk's Folly, and my bill was about 1/2 that price. Great restaurant, which I will be visiting again and recommending to others."], ["Joe S.", "Nice atmosphere.  Attentive wait staff.  Great food for the price.  We had our anniversary dinner here.  Started with steamed scallops.  This appetizer is large enough for a full meal.  Glad we split it.   I had the shrimp and grits, which really stood out among the many S & G offerings around Memphis - shrimp cooked to perfection, course ground grits, and a spicy sauce.  Katy had the salmon, which was adorned with cranberries (well that's all i remember)- the presentation was beautiful.  Our portions were generous - so generous we had to skip dessert.  BTW, if you are looking for real local flavor, most of the best restaurants in Memphis can be found along Cooper Street."], ["Loren S.", "Although we didn't have a reservation we got there and were seated on the patio (the word \"patio\" is kind of misleading, it's really just the sidewalk with 2 tables overlooking cooper) which is where the man seating us told us rudely was the only place to sit as if we were inconveniencing them. We understood since it was spontaneous of us so we didn't complain. They brought us water and we waited for 20 min and no one ever came back. We were easily about to spend $80 on dinner and didn't feel like they appreciated our business and that we shouldn't have to track them down, so we got up and left after giving them ample time. We went to another place in Cooper Young that was just as nice. I wish we could've tried this restaurant that seems to be so well liked but sadly will probably never go back. There are tons of other nice restaurants that will happily accommodate you without being rude. I think they're management needs to consider that when training their staff."], ["Jim A.", "I like this place.  The menu is simple and the food is good.  Every bottle of wine is priced at $24 (or something like that).  Service is a little spotty, especially when they are busy.  Parking is not great."], ["Scott F.", "excellent meal in a nice atmosphere.  The Steak and frites was outstanding."], ["Harvey Y.", "pretentious. average."], ["Lou S.", "Awesome Awesome Awesome!  I love this place.  The food is absolutely magnificent!  The prices are great!  It can be as cheap or as expensive as you want it to be.  I love the seafood crepe and I could die for any one of their desserts."], ["J Z.", "yayyy jadore cafe 1912! c'est tres delicieux. what i dislike about it... the slippery floor. my girlfriend fell on her fanny! apparently it happens a lot, so i dont know why they dont fix it. and obviously it isnt authentic. my french girlfriend gave her stamp of disapproval. but i love  cafe 1912 anyways :) a cute place for dates!"], ["J E.", "Very high value. Consistently good food. Refreshingly affordable, quality wine list by the glass. It's a favorite and old standby for us."], ["Bruce M.", "not really a review as my friend and i did not eat there.  when making a reservation for two,  ask to be seated at a window table, othewise you are likely to end up opposite the kitchen and bathroom. not very appetising. we did have reservations, but apparently others knew the secret.  the greeter did look around, but all she could recommend was to sit at the bar and as my friend has a bad back that was not an option."]], "Chez Philippe": [], "Restaurant Iris": [], "Erling Jensen The Restaurant": [], "Mollie Fontaine Lounge": [["Karen F.", "Loved this place!  It's an old house, converted into a bar/restaurant/lounge.  Apparently the Owner likes to play with it - it used to be fine dining, and then she converted it into the casual hipster-style bar & restaurant it currently is.  Make sure you walk around inside to see all the quirky art & furnishings.We made reservations by leaving a message on their answering machine, and then they called back to confirm.  When we arrived, they showed us to our 'table' which was really two lounge chairs with a small cocktail table in between.  Well, there is no way I would have kept dinner off of me that way, so we opted to eat at the upstairs bar with the fun and friendly Scott as our bartender.  Excellent decision on our part.  It was great people watching, and we had a good time swapping stories with him and the DJs that were going to be spinning the 80s and 90s music later.  Cocktails were interesting and delicious - loved my specialty gin drinks!Food was outstanding.  We split four items - in order of my favorites:  (1) French fries with truffle parmesan black pepper - I could have eaten about 2 pounds more of these (then died happy).(2) Fontaine Sliders - hamburger, arugula, benton's bacon, pickles, onion, mustard, mollie sauce, gruyere, warm buns - the combo of flavors made these melt-in-your-mouth crazy good.(3) Greek Salad - farmer's tomatoes, onion, kirby's, sweet peppers, torn herbs, feta, olives, sea salt - fresh and delicious to counteract the fry calories.(4) Steamed Mussels in a red curry coconut broth - these hadn't all opened and with no fuss they took them back and brought out another whole order!  Wish there had been more bread to dunk, because the curry broth was delicious.For dessert I had a rainbow cake special of the night, with some of the sweetest icing I have ever had - and it was awesome.I highly recommend Molly Fontaine's - it is a fun place to go where you will certainly have a memorable experience."], ["Danny H.", "This is a nice relaxed location. It is good to go to with friends or a large group. There is a bar upstairs and downstairs. It felt weird coming for the first time because it felt as though you were walking through someones private house."], ["Heli M.", "Memphis. Most folks think of incredible barbecue. And there's no shortage of it around this sweet Southern City, but if you're looking to see what other scenes it has to offer look no further. I left here thinking \"We definitely need a place like this in Dallas.\" Mollie Fontaine Lounge was single-handedly the highlight of my Memphis experience. One visit and I'm sure you'll see why. Not only is this old Victorian a historical landmark, it's just aesthetically beautiful. Remodeled rooms and secret nooks that maintain a unique vintage-y chic vibe on every level. On the weekday night we went, we entered to find a woman pianist singing a smooth Adele cover while some studied and others drank wine. I wanted to stay and listen more, but the group I was with had been there before and knew there was even more fun in store upstairs. We got to the second level and all the rooms were stunningly gorgeous. I mentioned that this venue has some history tied to it earlier. Apparently some of the very first Penthouse photoshoots were taken here. Earlier, it belonged to a woman named Mollie Fontaine whose spirit has been said to still playfully haunt the space.In any case, the music is good, the staff is excellent, the food and drinks are phenomenal... Basically just an all-around solid stop if you find yourself in Memphis. I'll be back for sure. It's like 4 venues in one: a chic cocktail lounge, an upscale nightclub, a great local restaurant, a cool live music venue...."], ["Ronnie J.", "My best friend and I came to this unique lounge  so different from NY. The drinks was so good and the appetizers was good as well. Its nice and relaxing good music and the pianist was great. Well definitely be coming back the next time we in Memphis Tennessee and Lauren was cool we have a Tennessee friend to look forward to. Lauren was a friendly, cool, host we met. Hi Lauren..... See you next time...."], ["Krystal S.", "One of my fav tapas spots! I love the character of the old home turned lounge/bar.  Good food, drinks and music makes this place a winner. Some of my fav menu items: Mac and cheese, fries, steak, and sliders. The crowd is diverse; atmosphere is cozy."], ["Amanda G.", "The best fries! I mean the best!! Decent service. It's cool when they have a DJ. Fun 90s music"], ["Joelle P.", "First, a little history lesson in my updated review! (My latest obsession has been researching Memphis's Victorian Village.) Noland Fontaine built this Queen Anne Victorian mansion as a wedding present for his daughter, Mollie, in 1886 (not to be confused with the Mollie that haunts the Woodruff-Fonatine house across the street). It has gingerbread ornamentation and is widely thought to be the best representation of 1880s architecture in Memphis - truly gorgeous! Fun fact? Supposedly (or rather, rumor has it) that this is the location for the first photo spread in Penthouse magazine (before Karen Carrier, the now owner, bought the house in 1985). Anyways, it was originally the location for Karen's catering business, Another Roadside Attraction, and then later became the restaurant, Cielo, in 1996. Finally in 2007 it became the Mollie Fontaine Lounge!This is still my favorite place in Memphis but after learning the history of the place I felt an update was warranted. Plus every person I bring here falls in love with this place and it instantly becomes their favorite lounge/restaurant/hangout/bar/you name it in Memphis too. And I've brought a lot of people here for their first time since my review last year...The decor is out of this world and actually inspired a lot of my own furnishings in my home. I didn't get hot pink Victorian furniture (although I haven't completely ruled that out yet) but my chandeliers and cowhide rugs are pretty similar to theirs...oops. Well, imitation is the sincerest form of flattery...And the food? I actually witnessed my friend kiss his steak last week (his first time there) and while I'm typically into sharing dishes...I am so not into that here. It is just that divine and I typically **politely** suggest people get their own plate instead of sharing mine. Mollie Fontaine is simply a home run across the board. Victorian Village is my absolutely favorite place in Memphis and this home is one of the few remaining originals from the time period. It is so well preserved and a step back in time. The only thing people can possibly complain about is that sometimes it can take too long for the waiter to bring you your drink. My suggestion? Enjoy the extra time with your friends and order your next drink ahead of time. Mollie's ghost is thought to wander here still so don't forget to \"Cheers to Mollie!\""], ["Ashley P.", "I usually love this place. We went last Friday before the Bruno Mars concert. We made a reservation and the service and food was just not up to par. The empanadas were awful, too much spice and puréed chicken. We mentioned that not one person out of 6 of us liked them and the waitress thanked us for our feedback. She did not volunteer to remove it from out bill.The food was extremely slow and when we arrived only one other couple was there.I want to love this place like before but the experience was just so awful with no excuse."], ["Katherine M.", "I love Mollie Fontaine's. It's a casual, cool atmosphere in a beautiful old house. The music is always eclectic and great. The majority of the seating is couches and chairs which gives it a real loungey vibe."], ["Joel L.", "If you are looking for a chilled out place to grab a drink and have a conversation with friends in which you don't have to scream this is your place. Fantastic drinks that are expertly crafted. The atmosphere is amazing. If you want a grown up sophisticated place to hang out... Here's your spot."], ["Cedahlia S.", "Little kid in a candy store is the only way to begin.  I felt enchanted just approaching this beautiful structure.  Before entering I almost felt the need to knock, like visiting an old friend and that feeling remained the entire time. Not only was the service great but people visiting love to talk about what they had to eat and drink. Totally felt like a trip back in time; lovely eclectic decor throughout, funky & seductive art which totally made me want to redecorate my own."], ["Cristina H.", "This Victorian house is my favorite place to go on a night out with a friend for a drink and some good ole dancing. Once a month they have local House Djs come out and the vibe is just great. I've danced til the lights came on upstairs!  Mollie Fontaine Lounge is definitely a lounge, not to be mistaken as a club just bc we boogey down upstairs. There is mostly lounging area. The couches are all vintage and antique styled to go with the ambiance of the entire place. The waitresses and bartenders are all very nice. I have seen people celebrate birthdays, coming out parties, bachelorette parties and more here. Young mature adults who just like to have some drinks and enjoy this place are what you will usually expect to see when you come inside. Its in a dark area but this place is full of life inside and it has a classy feel to it. I finally tried the macaroni and cheese and it was really good. Just enough cheese to sober me up and the bacon, well bacon is good anyday, anyway!!I've mostly been on Saturday nights but Fridays are more LGBT friendly. Either night has always been fun. You can easily hold conversations with your friends and catch up over some wine or dirty martinis. I will be back again hopefully next Saturday for OUR HOUSE. Of and I believe it's always a free cover unless it's a special event going on too! The door man is really nice. Just have your ID."], ["Craig W.", "I guess I just don't understand the generally allure of this place. The house is gorgeous and the cocktails are good. But the space is so cramped. The furniture is very old. I think this place is cool and there is definitely a solid place for it in this city. Keep up the good work. It just isn't my typical choice for a bar."], ["Bob V.", "The old house feel with an eclectic interior design makes this a special place to hang out for drinks and small plate meal.Apparently you have to be 21 to enter, however they did allow my wife and I along with our 18 yr old daughters to stay and enjoy some food.The desert we had was not of high quality- I don't recommend the grilled dark chocolate sandwich.  Everything else we had was wonderful."], ["Brittney H.", "I love this place for a girls night out!! Awesome old house and great drink menu!! I love their small plates!"], ["Richard A.", "Great place to start, continue, or end the night... The fries are a must get!  Dance upstairs, piano downstairs... A must go to spot in Memphis!"], ["Sam P.", "This place is very unique and is at least worth going to just to see. Went on Valentine's Day with a reservation thinking it was a restaurant. Would like to try it again on a normal night."], ["Tammy L.", "This place was found by accident.  We were in the neighborhood, hungry, and had about an hour to kill before we needed to be somewhere.  The staff was very friendly, the food fantastic, and the drinks were out of this world.  I highly recommend this to all travelers who enjoy a relaxed atmosphere and light, tasty dining."], ["Tina J.", "Perfect place for girls nite out for some soothing live piano music n when we went they also had someone very soft voice singer. After 11 it become hip-hop place up on the 2nd floor  didn't get to stay very long to experience it but next for sure trying that experience."], ["Emily Y.", "I am not cool enough to party here during the infamous late nights, but I will say the food is AMAZING. Hopped in for a quick bite before heading to the ballet at the Orpheum. When I initially called to make reservations, Doug said they were totally booked up but then recanted when I stopped short of begging for a table for just an hour to grab some grub. THANK YOU DOUG! We were not disappointed! Portions are of the small plate variety, so it's easy to share (or not share) if you cannot decide on what you want. We shared the tempura long beans (lightly battered and served with a delicious dipping sauce) and macaroni and cheese (fontinnnaaaaa) and then individually ordered the steak frites and fish club. And no, you may not have one of my truffle fries.  Drink menu looks delightful, though I stuck with my all-time fave: a caipirinha. So glad to see a bartender who understands the joy of cachaca! I will definitely be back and will be sure to reserve a table again!"], ["Amanda M.", "I don't quite get Mollie Fontaines. I made a reservation for 6 and went to Mollies with my hubby for dinner. When we got there the door was locked. Shortly thereafter someone let us in but they were not ready to seat us. They tried to seat us at a couch which would have been impossible to eat at. Long story short, even though the food was good it was overpriced and they were extremely disorganized.I've never been there for their late night parties, so that might be a different story altogether."], ["Jules M.", "I cant say enough about this place! My girlfriends and i loved it.  I made reservations here for a friend's bachelorette party dinner and the owner did everything he could to make sure we had our own private \"room\" and weren't paying an arm and a leg since i didn't know a lot of the girls attending(i'm from Chicago) and didn't know what they  could afford. The place is perfect for a girls night. Good food and even better drinks!"], ["Claudine S.", "As you all may or may not know -I just moved to the east coast via driving across the united states starting from San Diego. I really didn't spend much time in other cities, but Memphis and Nashville were to dos! Molly Fontaine's lounge was a stop to do as libations were calling us. This is a must. The house is amazing (of course) and the different rooms are really cute. The door guy wasn't that pleasant... but the bar staff made up for it. We only stayed for one cocktail as we had many a watering holes to drive by. Here is a brief run-down:\"The Mollie Fontaine Taylor House. Circa 1886. 679 Adams Avenue. Currently a bar/restaurant you can get up close to this very Victorian structure where the phrase: \"if one is good, two must be better, and three divine\" certainly is exhibited. This home was built as a wedding present for a daughter, finished about 1890 and could easily be compared to wedding cake! You can see the father's house across the street as it is a museum call the Fontaine House\" borrowed from Memphis Historic Homes website. I would have def gone back to mack down on some food, but the overall was/is a to do again."], ["Blake M.", "Amazing atmosphere, beautiful food and expertly crafted cocktails.  We joined friends and sat at the bar, but enjoyed conversations with everyone.  Intimate, eclectic, and a must for anyone looking for a setting where you feel a part of the scene and not separated from it!"], ["Zin M.", "Chic, upscale feeling lounge with cocktails that take you away to a special place even though the spot is as special as it gets.  I am from San Francisco and have been to my fair share of lounges and \"cool\" spots but this is a definitely place to get over the Beale Street cheese, relax and sip on something beautiful.  Drinks average between $11-14 but you know time has been put in making your drink.  Just a heads up, if you are not a smoker go upstairs and check it out and come down quick enough to find yourself a nice place to sit and enjoy the lovely pianist (should she be working the night you visit).  All in all..I'd say, come here, it's much hipper than what you'll find elsewhere."], ["Brandon B.", "Very nice atmosphere.  Good drinks. Did not try the food but it looked great.  Cool crowd."], ["Steve K.", "I love everything about this place. I've never eaten here but I here it's good. Be prepared for large crowds on the weekend."], ["Paige W.", "This is a very unique place, and I have been fascinated and enamored by it on multiple occasions! This restaurant/lounge is set up like a home would be. Another reviewer \"Sandy W.\" described it perfectly. It's so interesting, especially the art on the walls. I came here once for a little mixer/cocktail party type deal and it was a completely different option than what you would find elsewhere. It's pretty but not overwhelming for masculine counterparts. The fries are amazing, and so is the mac & cheese!!!"], ["Donna C.", "What an experience. Located in an old house. With all the old antebellum charm. Characters galore. Tapas style plates.  Take your time. Order a plate or 2 an move down the list. We sat in oversized chairs in the parlor room.  Loved it"], ["Jason B.", "Frenchy was rad, and the drinks were tasty.  Thanks for all the tips about Memphis. -Jay n JayDetroit"], ["Stacy E.", "Love the decor, the drinks are ok. Food is ok, but I have only tried a couple small plates. The piano bar downstairs is great if you more low key, and upstairs is good for a more club like atmosphere. The furniture is perfect, can sit and chat or wander in and out of the different rooms. Gets extremely crowded late at night so if you are claustrophobic, go early."], ["Vim I.", "Loved the ambiance of this place. The fact that it's in a Victorian house, has a loungey feel, and has interesting decor and paintings. My advice is to come a little early like 9:00ish to snag a good spot on the couches. The location is kind of in the middle of nowhere...it's not exactly a place you bar-hop from. So you have to venture out knowing that you'll spend some time there.The cocktail menu was not as extensive as I would have liked. They need freshen up their items. Even the \"special\" cocktail menu we received was kind of uninspiring. (They had St Germain's elderflower liqueur in most everything...and if you've had that before, you know how overpowering it is.)But Mollie Fontaine's is still a must see--it's probably one of Memphis' most unique nightspots."], ["Bryan L.", "I've been to Mollie Fontaine a few times and I've always enjoyed myself.  It's such a unique place to hang out in and drink.  They have multiple levels and more bars than you can shake a shot glass at, which I'm fine with because the service is excellent and that equals fast drinks.It's a great place for groups.  You can find your own little room or corner to set up fort and drink the night away.  The artwork throughout the building is a hodgepodge of classic pieces that fit the Victorian architecture as well as pieces that add to the quirkiness that is Mollie Fontaine. The specialty cocktails are excellent and even appealed to me, a solid whiskey drinker.  I have not tried the food, but some people in our group did and loved it.  The steak and/on fries looked very appealing.  I'll dive into that menu on my next visit."], ["Cory P.", "The service is so bad it ruins the cool atmosphere and ambience. Drinks take 20-30 minutes. Beer is usually luke warm by time you get it.If it was larger and had an efficient staff, this place would be quite cool. But, it doesn't and has been this way for freaking years"], ["Deen W.", "This place makes me wish I lived downtown. Or midtown. Or anywhere other than out here in the 'burbs where it's so far away. The place is totally cool. Very lounge-y. The fiance does not do a lot of frilly cocktails, so he enjoyed his Crown on the rocks. I, on the other hand, decided to try one of their signature drinks and ordered the Pretty in Pink made with Elderflower liqueur. It was delicious....have never had that before in a drink.The real stand-out is the food. My, oh my. The mussels were my favorite. (served in a red curry broth that I just want to pick up and DRINK)  Tempura avocado was absolutely wonderful and the spring rolls were enjoyed as well. Man....Norah Jones was a great concert, but dare I say that Mollie's stole the show!"], ["April S.", "This is going to sound silly.  Although I LOVE Mollie Fontaine's, I try not to visit very often.  Why?  Because Mollie's is too special. I like to dress up a bit when I come here.  Just walking in this place makes me feel trendy and attractive.  The old house turned lounge and restaurant maintains the old house feel.  The dimly lit rooms are filled with beautiful furniture.  The walls are adorned with interesting artwork.  On weekend nights they usually have a dj spinning house music.  The \"dance floor\" is a very tiny spot at the top of the stairs.   My favorite spot is the bar on the third floor.  If I'm there with a crowd we usually spend our time in the adjoined living room.  On cold nights the fireplaces are going which adds to the elegant ambiance."], ["Tookie T.", "What a hidden gem this place is.  My boyfriend and I decided to try Mollie's this past Saturday nite.  I had been wanting to go for about  a year now after reading about it here on Yelp.  I was pleasantly surprised by this place.  It was way more than what I expected it to be. A true lounge. Upon entering, we ventured into the first room which had someone singing jazz tunes on a piano (totally like something off of tv).  People were everywhere.  We then went straight to the bar to get the spirits flowing.  The drinks were good and strong. A bit pricey tho.A dj was playing upstairs, so we followed the music.  Again people were everywhere but we were lucky enough to find seating on a couch with another couple.  Everyone was so dressed up and mature, but not to old, stiff and stuck up.  A very diverse crowd.  We werent overdressed (and I admit, I usually am especially when going out in Memphis). Considering my boyfriend had on a full suit, so did alot of other guys so it was fine.All in all I loved this place, it was somewhat surreal, and aestetically pleasing. So much to look at.  this place is packed with great character.  I can't wait to go back."], ["Katherine M.", "Went here early before dinner for drinks. Drinks were good, but pricey. And, maybe because it was early, around 8:30, the place was pretty empty. We also tried the truffle fries, which were great, but when I asked for ketchup, they said they didn't carry ketchup. The atmosphere was really cool and we loved the old. Victorian home. Would be a great place for meeting friends."], ["Daniel M.", "What a great gem this is!  Located near downtown but close enough for midtowners.  If you are looking for a different kind of bar experience this is the place to be.  Really you just have to try it to understand it."], ["Micah W.", "Went here to kick off my 25th birthday celebrations. Love the space- it's a lounge/bar in an old Victorian house. Two levels- one bar downstairs, one bar upstairs. Each bar is in a small room, there are no doors but the spaces are still separated since it's an old home. The bars were pretty packed but we opted to sit in one of the lounge areas on the comfy sofas and someone soon came by to take our drink order. The drinks came out pretty quickly and were very reasonably priced- compared to Atlanta prices, cheap even. The night we went there was a DJ spinning upstairs. There was a good vibe, everyone was friendly. A really good mix of people- mostly it seemed like locals mixed with a few out of towners like ourselves."]], "Young Avenue Deli": [["Justin L.", "Stopped in here during the Cooper-Young festival and I was impressed with their beer selection.  Not only did they have my favorite Founders All Day IPA, but they also had the newest offer from Wiseacre (King Squirrel?).  I cannot wait to come back to this terrific bar."], ["Nathan N.", "Plastic cups for good beers and apps served with the main dish.....still lame. Travel people. Travel. You will be surprised at what you can find for much cheaper and higher quality."], ["Brittney H.", "Went here for lunch the other day with my fiancé and parents... Our service was amazing. I should have gotten our servers name. She was awesome! I suggest the sweet potato fries, chicken salad, veggie pita, and club. Everything is honestly good! They also deliver!"], ["Bailey P.", "I've been here twice now.  I didn't review the first time because I was grumpy (there was some sort of fight on and it was loud and I was hangry and I hate sporting things where everyone is screaming) so I figured reviewing then would be really unfair.  I went again last night and had a lovely experience.  I must admit I'm not a huge fan of the atmosphere, but the beer selection is good.  I had the veggie chili fries and they were absolutely fantastic.  I had a wrap with tofu the first time I came, and it was just ok.  Plenty of options for people who don't eat meat."], ["Matt G.", "This place is a staple in the history of cooper young.Staff here are great and if your not feelin the greasy bar food.. Then try the chicken salad sandwich here.It is on point. Plenty of great beers to try if you like a drink.If you have taste buds for a good IPA try the Dogfish head 90 or the Sweetwater Blue."], ["Tony O.", "Pretty slow service considering it was early on a weeknight. My sandwich was ok, nothing to write home about. Staff was helpful but gave me the wrong beer. Sweet potato fries were really good with cinnamon sugar."], ["Kevin R.", "Ashley C has been my server twice and she is awesome.  She's extremely friendly and makes everyone feel welcome.  I've come here many times and have not had a bad experience.  The food is not your typical deli food- it's different and unique.  Not to mention that the fries are delicious."], ["Craig W.", "I was thinking about giving three stars. I read a lot of reviews praising the beer list. I was stunned how inaccurate any of their menus were. This menu was different from that which was different than the board, which did not reflect what was actually on tap or in bottle. This was beyond frustrating. It nearly caused me to leave. I stuck it out and finally found one bottle to enjoy. The menu seems simple enough. They have some sandwiches and some things from the grill. I went with the Muffuletta. It was a nice sized sandwich. Sadly it did not come with mortadella. The olive spread had a good flavor. I also ordered some \"award-winning\" fries. These did not impress me. They should not have won any awards. The reason I give 4 stars is the great service I received. My server must have noticed my fristration with the beer list. She was very helpful in fixing this problem. The overall appearance of this place is absolutely disgusting. The bathrooms are terrible. They have loud pool tables right next to the dining area and the lighting is horrible. This place did get **** from me.... barely, but I don't recommend it over any other Midtown places. Literally, if you are in Memphis and you have tried EVERY other place in Midtown, then try YAD."], ["Cynthia S.", "We had a very sweet polite waitress named Amanda A saturday night and the burger and fries were wonderful. Great experience"], ["Reginald W.", "I went  for lunch and found the service to be extremely slow. Took about an hour and a half to have lunch. I saw one customer walk out. We ordered a club sandwich, a BBQ dip sandwich, a order of fries and two beers for $30.The fries tasted like they had been reheated. The sandwiches were just OK. If my waitress had come by more often I would have probably had a few more beers while I waited 30 min for my food.They didn't have the first two beers we requested from the menu. We felt like trying a beer from Asia but they didn't have any in stock."], ["Shenan A.", "Young Avenue Deli is one of my go to spots. Everything is just right about this place. From the atmosphere to the food, they just get it right. I love their food. They have a well rounded menu from sandwiches, salads, burgers, and more. Everything I have eaten from Young Ave has been perfection. Especially the mozzarella sticks. They are the end all be all of mozzarella sticks. The food is always fresh and always tasty. The vibe is always great here too. The wait staff is super helpful and always on top of their game. I will forever be Young Avenue loyal."], ["Arpana W.", "Haven't eaten here in a while...forgot how good the food is!  I only give it a three star rating because it can take FOREVER to get service and it is always hard to get a table (IMHO - they should get rid of one of the pool tables and add some more seating).  My recommendation for food: the hummus wrap + chicken and some sweet potato fries.  My husband loves the Politically Incorrect (bunch of meat, but evidently very tasty).  I got a cider they had on draught and it was AMAZING - thought I was in an apple orchard when I was drinking it. :-)Side note: If you're going for live music - this is a fun atmosphere."], ["Teresa F.", "Lots of interesting and yummy sandwiches.  Go for beer rather than mixed drinks."], ["Phillip L.", "The food and drinks are good but the service is terrible. It doesn't matter if you are the only one there it's super slow."], ["Jason F.", "The sandwiches are good. Can never go wrong with pastrami and beer. And the build your own quesadilla is best on date night (just a suggestion)."], ["Cherie C.", "Never had a bad experience at this place. Food, drink, and entertainment have always been on the up side. Every time Pretty Things Peepshow comes in town and plays at the bar, it makes my week! The patio is an excellent people watching area, as well."], ["Holly H.", "Ok, I went here for my birthday and it was the worse service I've ever had in my life - it took 45 minutes to get noticed, 30 minutes to get an appetizer and the waiter literally came by 3 times. We were going to get more than on drink (because we were celebrating) but after 2.5 hours the waitress decided we were done by bring our checks - didn't even ask. Their drinks are not even that great, very poorly presented. Everything about that place is just gross, theres no toilet paper in the bathroom, the floors are gross, the seats are broken... Our waiter sat at the bar on her phone flirting with the guy next to her. You're at work...rude. It was the worst. Once we got our food it was great! The food never disappoints, although the sandwiches should come with sides at that price. This was my fourth time there - service is always bad, food is always great. Drinks are ehh..."], ["J C.", "Great place for lunch. Lots of vegetarian options and a cool environment. I have been over 50 times and will continue to go. The french fries are hands down the best in town! Be very careful if you have to park behind the building. Try to stay near the street."], ["Frank R.", "Always a great place to meet friends for a beer or two and a plate of cheese fries.  We met there last night and after having not been there for a while I could see that havent changed. Great beer selection and wonderful bar food. My only negative was that my beer battered onion rings were too greasy to eat."], ["Rob B.", "I have been coming here for the last 7 years for one main reason -- the food is consistently good. Its solid. What you get today, you will get next year - and 3 years from now. Same goes with the service and the atmosphere. This place is (to me) like the anchor for the Cooper-Young community. Without it, this ship would drift aimlessly. It personifies the attitude and creativity of this oasis of good restaurants in the Mid-Town area.Young Ave Deli has a huge selection of hot & cold deli sandwiches, and an even larger selection of great beers - both on tap and in the bottle. They often have live entertainment or trivia, and the craft breweries periodically host give-away's here; in some ways it is more like a beer garden in the evenings and deli at mid-day. This is a great place to grab a beer and a sandwich....and maybe even stay a while. My personal favorite sandwich is the Yankee Club: pastrami with Swiss cheese, sour kraut, spicy mustard on a triple stack rye marble rye bread. Man is that good!"]], "The Second Line": [["Jen A.", "Ate on a date w/my daughter.  Nothing for kids so skip it if you have little ones with you.  She ordered the burger upon suggestion by our server.  It was good but being on a po boy bun made it huge for her.  I had gumbo, I think, it wasn't memorable, not a full body of flavors like I expected it to be from all the hype about the restaurant.  Our (pregnant) server seemed annoyed that we were there and it showed in our empty drinks.  It was good we were sitting so close to the host so she refilled our drinks.  I had to stop the server to ask for our food to be boxed and the check.....then again for the check.   Overall just a very OK experience not great or particularly memorable as I had hoped.  I left out that we were in a standard height table with a pub height at an uncomfortable distance.  We had dinner with the gentleman's butt crack."], ["Andy S.", "The Second Line is a relatively new bar in Overton Square.  It has the same owner as it's next door neighbor Restaurant Iris (This is one of my favorite restaurants in Memphis.  I haven't been there recently, and I have never written a review.)The restaurant is in a redesigned house.  It is always busy, especially the outside.  I have only been once (to the inside), but I have tried to go several times, but didn't feel like the long wait.  The type of food is New Orleans style.  I love the vibe.  It feels modern, nice, and kinda classy, but approachable.  They have plenty of locally brewed beers on tap.  They have a huge bar with tons of selections.  We started at the bar, but eventually sat down.  The best creation ever is the andouille, crawfish, and pimento cheese fries.  Second Line takes loaded cheese fries to a new level and sets a new bar.  One friend ordered a poboy.  I can't remember which type.  They have a lot.  My friend chose the side of hot potato salad.  It was good, with a kick.  Another friend also ordered a poboy, with a side of fancy ass cole slaw.  It was pretty good as well.                                               Another friend ordered the fried shrimp and fries.  That meal was also good.  Now back to the best items IMHO.  My friend and I ordered 4 things to share.  I think we pretty much won on the best food chosen.  We had the skillet cornbread.  It came out piping hot in a mini skillet.  I couldn't stop eating it; it was so good.  We also got the red beans and rice.  The portion was huge.  Besides the wonderful loaded fries, we shared the cheese grits, which were covered in cheese.  We also got a spinach casserole called the spinach madeline.  It was also one of the best things of the night.  They bring the checks in a cute metal cup.  This is my favorite new bar of 2014.  The food is awesome.  The service is awesome."], ["Cristina H.", "This place is hard to review. It's basically a place that has the name and rep to last. I wanted to loooooove this place being that I know I could probably never afford Iris. But honestly two things I did love was the bartender/drinks(from cortona bartender that I loved then too) and the pimento cheese fries. I received plenty crawfish and it was just DELISH and my dirty martini was friggin dangerously good. Chef English came by to all the tables to speak and honestly he did like they all do and said \"how is everything\" while continuing to walk which to me i would rather not even see you if you really wanna know. Bc no everything isn't okay but how can I tell you that? You're \"chef English\" I want to tell you that these red beans and rice are too bland for a CAJUN place and that my Enchilada must have been vegetarian bc there was literally no meat in one side of it but I'm so distracted by the bartenders awesome service and these fries that I just said \"everything's good thank you\" but hmmm maybe he will see my review. But anywho I say it's good but I'm in no need to return for a whole meal. Maybe get a martini and some fries though lol."], ["Jim H.", "Our first visit was on a Sunday at 2:30pm. The place is inviting and has great appeal when you walk in.  We were quickly greeted and requested the patio, which was not available/had a LONG wait, so we requested one of the front tables by the window, which the person was going to clean.  While waiting for the table to be cleaned, another couple came in (actually 3rd couple to come in behind us) and a different staffer took the couple directly to the table we were waiting on.  Well, yes, we were a little put off and did say something to the staff before the couple got seated.  It didn't matter, by golly!  They now had dibs on our table and that was that!  Obviously, I'm now, not in a pleasant mood (okay, I pouted, because I didn't get what I wanted).  Anyway, our new waitress was very pleasant (didn't offer to make amends, but was very attentive and pleasant) and she and my wife slowly worked me out of my funk! :-)Well, on to the food.  We ordered the fried oyster plate and the roast beef with gravy poboy, based on the waitress's recommendation and actually, the recommendation of a great couple we had struck up a conversation with, sitting at the bar by the front door.  They were both absolutely spot-on!  The food was really prepared well and had a great taste.  The poboy was so good that I decided then and there that I could and indeed would forgive the earlier oversight and will go back again for the food.  I want to give the place a 3-star for the airhead who seated a couple, arriving 3rd behind us at a table we had been waiting 10 minutes for, but our waitress and the food keeps it up higher.  I do think I could even give a 5-star rating with an overall great experience and consistent great food on follow-up visits. Overall, the food was outstanding and our waitress was great!"], ["Frank R.", "Not impressed at all. Excellent service. The chicken gumbo had no flavor,spinach dip was bad..what the hall,why was voted one of the best new restaurant in Memphis? I think ppl need to re-think about good food.that was fast food ."], ["Michele S.", "I've been twice now and both times was not disappointed. They don't take reservations so it's not good for large groups and I recommend getting there early in the weekend. Service has been good and has a good atmosphere. Must try appetizers are the pimento cheese fries and the BBQ shrimp. The po boys are some of the best I've had outside of the New Orleans with fresh French bread. I prefer the pulled pork po boy. And has  a fantastic bread pudding."], ["Laura H.", "I love cajun food but my meal was just okay. I was so excited to see the OG aka french fry po boy on the menu. When I was in New Orleans earlier this year eating my way through the city, this po boy was a life changer. One of the best things I've ever eaten!! I know chefs like to put their own spin on things, but the OG was a huge disappointment. The fries were obviously homemade, but a little bulky and overcooked, and with a tiny ramekin of  thin, brothy gravy it made for a very dry sandwich. The one I had in NO required 5 napkins due to the generous portion of thick brown gravy ladled over it. I also had a meat pie, good but a bit dry. The red beans and rice had a nice flavor, but again, a little dry. The best item I had was the deliciously creamy and cheesy spinach. The service was good and the restaurant has a nice ambience, I was just expecting so much more from the food."], ["Caroline V.", "The food was fine (if a bit heavy).  Our waiter was great, very friendly and helpful.  $5 margaritas on Tuesday seem like they should be a deal.  The hostess, however, was unapologetically rude.  I saw Kelly English wandering around, but he didn't stop by our particular table.  I e-mailed management that night and received a phone call the next day that was also not quite an apology.  It's been two months since then, and it just isn't at the top of my list of places to go.  There are similarly-priced, equally-yummy restaurants within walking distance of this one where I'm welcomed from the moment I walk in. I'll pick those any day over one where the reception is  chilly (and that's putting it kindly)."], ["Vim I.", "On a Saturday afternoon, my husband and two of our friends decided to try our luck at snagging a table at The Second Line. Knowing that it's one of the hottest restaurants in Memphis right now, we got there at 6:00 to put our name on the list. (They don't take reservations). Second Line is right next to Restaurant Iris (great spot in Overton Square)--and walking distance from the new-ish parking lot across Cooper. It's a small, intimate restaurant--not many tables--so plan ahead if you're coming with a large group. If the weather is nice, you could hangout on the front porch or the back porch while waiting on your table. We waited about 45 minutes for our table--enough to enjoy a cocktail. I had the Kudzu (which was similar to a mojito except made with cilantro instead of mint...it was crazy good!)Now for the food....We had the BBQ shrimp (which was a John Besh recipe) with a loaf of poboy bread--it was so good, words don't do it any justice. This is a bbq sauce unlike any other. Our friends had the andouille, crawfish, pimento cheese fries--which were heavy for a starter, but delicious nonetheless.  For the main course, I had the Chicken Verno--braised/shredded chicken thighs and swiss on a poboy. It was unbelievably mouthwatering. I could have it everyday and not be bored. Lots of well-developed flavor and the bread (which is imported from NOLA), was perfectly toasted on the outside but still spongy on the inside just like a good poboy should be.I tasted my husband's fried shrimp poboy which was authentic NOLA. Our friends had the roast beef poboy--which is more traditional in NOLA than a oyster or shrimp poboy, and they were very happy with it. To end this delicious meal, we had the bread pudding--it was a good end to the meal, but the po-boys are really the star of this restaurant.Not to mention Kelly English walked around the restaurant and said hi to everyone.I'll be back for sure...interested in trying lunch on the weekend."], ["Sally W.", "I believe the first step to treating an addiction is publicly acknowledging it as an overriding obsession and The Second Line's barbecue shrimp about meets that criteria.  The sauce is unforgettably complex and incredible to the point that we would not let the wait staff remove it until it transformed itself from shrimp sauce to a po boy dipping option!  It has oyster juice, shrimp stock, Worcestershire sauce, butter and pepper making for a decadent option.. The environment is festive with a New Orleans vibe to it.  Staff is attentive and quirky at times, but service is efficient.The Second Line's bread is shipped  in from New Orleans and this small effort makes a huge and authentic impression.All of the sides we tried from the red beans and rice to spinach madeline were healthy portions and delicious.It was great to see Owner and Chef Kelly English a consistent presence in the restaurant checking on various tables and clients.  We thoroughly enjoyed our fried catfish po boy and one made from chicken thighs.A second line band may follow the main band, but not in this case. At The Second Line, the food is the star!Overall fun atmosphere, excellent food and many reasons to keep going back!Sally"], ["Brad B.", "There's an important question you should ask yourself, to temper your expectations here: have you ever been to New Orleans? If not, you're in for a treat! The place certainly has a New Orleans-y look and feel to it. Everything from the art, the furniture, the menus, makes you feel like you're not in Memphis. The BBQ shrimp and gumbo taste like what you imagine good Cajun food must be. They even have Crystal and Louisiana hot sauces. If you've never been to New Orleans, this is a nice little bite. If you HAVE been to New Orleans, then you'll realize this little 'bite' is not the same as a taste. Those BBQ shrimp were half the size as you'd find in any respectable New Orleans restaurant. While tasty, the flavor was a bit off (too heavy on the Worcestershire sauce?). The bread, which should have been soft and sponge-like for sopping up the sauce, was far too crispy. And when the waitress read off the dessert menu and mentioned a root beer float with IBC instead of Abita (Louisiana's very own), that's when Second Line's credibility really tanked. Seriously, if you like root beer even a little, find some Abita. They know their bread pudding, though, I'll give them that. Top notch all the way, with candied pecans, caramel sauce, and a scoop of ice cream on top. For a few minutes, all was forgiven. So, yes, Second Line has the atmosphere and the trappings of a traditional New Orleans restaurant but lacks some of the authenticity. I could see myself coming here with friends to enjoy a few cocktails from their impressive drink list, maybe enjoying a snack. Not sure I would see myself coming back just to eat. I would like to sample a few more offerings from the menu, though, so I'll give them another chance."], ["Tom S.", "WTF.  This is much better than a 3 star.  Get off your high horse and enjoy some of the best grub in Memphis.    Love this place.  Chicago could use talent like this- my hometown"], ["Mandy H.", "I had no idea this place existed until a Louisiana native friend of mine insisted that we go a couple of months ago. She took me there as a treat for my birthday and it was so awesome I couldn't wait to go back. Both times that I have gone have been late evening...and, judging by the negative reviews for this place, I'm assuming day shift employees must not have their hospitality panties on like the evening shift staff. My friend and I ordered drinks off the cocktail menu...ridiculously expensive but sooo good. I don't remember what she got but it tasted like lemon merengue pie and was amazing. She ordered meat pies...unfortunately she didn't consider that they may use a mayo based sauce for them until after the order was put in and the staff were wonderful when she asked about it. She offered to scrape off the mayo sauce and they felt so bad they brought her a whole new batch! She loved them. I had the beef and gravy po boy and red beans and rice. I am a red beans and rice connoisseur, if I do say so myself...it is extremely hard to please me on that front, but these were delicious. Albeit, the second time I went, there was way too much sausage in it for my taste...but that's just my taste ;)The second time I went, my mother joined me and our server was a delight. She spent a fair amount of time explaining each item my mom asked about, and didn't seem even the slightest bit annoyed...EVEN AFTER HAVING TO RETURN THREE TIMES BECAUSE SHE COULDN'T DECIDE! Very positive attitude!Overall, I love the place. Kind of small, and the sidewalk outside is insanely dangerous. But the ambience is cozy and friendly. I'll have to swing by during the day once to see if the feel is the same!"], ["Linda M.", "We enjoyed our food, however we did not care for the slaw.  Way too vinegary.  Signature drink was interesting, wine selections were good.  I'm sure we will be back."], ["Melanie L.", "Terrific bar menu and fun atmosphere make The Second Line a great experience for a very reasonable price point. We shared starters of their famous BBQ shrimp and the marinated crab claws.  My entree was the fried oyster platter which came with fancy ass cole slaw and hush puppies and fries.  The gulf oysters were fresh and plentiful.  The slaw was full of Asian flavors and pickled veg the fries were crispy and hot.  The BBQ shrimp had a spicy flavor with lots of Worcestershire sauce and the crab claws while tiny were tasty with the lime citrus marinade.  The horseradish in the cocktail sauce was especially hot and yummy with the fried food.  Plates were clever mini cookie sheets and our server Jonathan made the night enjoyable.  I will return to taste other items such as the famous Poboy sandwiches and the enchiladas. Each entree $12-18 and each starter $7-10 not bad."], ["Sid P.", "Decent food and service, laser focus on turning tables over, annoying seating/hostess system, automatic assumption that their service is worth 20% for parties of 6 (no mention by server). Will avoid in future."], ["Ashtyn L.", "Atmosphere = fun, low key, staff makes you feel like friendsDrinks= still trying to make some of their drinks at home but can't bc they were so good and different! Prices weren't bad either! Food = just let the wait staff explain the items and you will understand why we ordered everything she recommended! They did an excellent job at describing every dish and it was spot on!"], ["Jenna B.", "Even though I have a shellfish allergy, I still had plenty of options for dinner! I went on a Monday night and the place was packed, although we did not have to wait. Our server was friendly, quick, and knowledgable. I had the beef poboy with spinach on the side and it was great! My only complaint is the pricing, it is a trendy restaurant, but $15 for a sandwich is slightly overpriced. Other than that, it was perfect."], ["Ebonye B.", "We were determined to try a new place.  Second Line...you're up! We ordered the enchiladas as an appetizer.  They were a tasty beginning.  Frankly, I expected a big cheesy mess, but it was not.  The sauce was nice- spicy, but not overwhelming.  Most of the appetizers appeared somewhat small- best shared by two or fewer people.  It is not a problem, but you should know up front.We both ordered the shrimp po boy.  The bread was perfect and the shrimp were big, fresh and well-seasoned.  The flavor was great. The bread was crusty on the outside and soft one the inside. I also ordered the greens and they were great. So with all these positive notes, you may wonder, \"why just three stars?\"  Well, the wait was excruciating. For more than 30 minutes we had to stand in a cramped space. The sever repeatedly reached over us to grab a water pitcher. Why she didn't relocate it, I'll never know. During this waiting period, we saw several dishes delivered to the bar near us. The fries were limp and small portion for the cost. I was concerned that I had chosen poorly because nothing that came out looked particularly appetizing. While my po boy and greens were great. I haven't been inspired to endure the cramped wait to enjoy them again. I noticed they appear to be working on a patio. Perhaps more capacity will allow me to stop by and give them a fourth star."], ["Brandon H.", "This is one of my favorite new restaurants in Memphis because it takes the kitchen from my absolute favorite restaurant in Memphis (Iris) and serves it in a more casual, less pricey fashion that fits in right alongside the other restaurants in Overton Square.I'm in love with the barbeque shrimp appetizer. Pro tip: If you want to feel good about the things you eat, though, do NOT look up the recipe. Nothing gross -- just an unholy amount of butter. Still, though, it's fantastic and I can't help but order it every time.Another advantage of this place -- the service is always second-to-none. I'm by no means a regular here. I have gone maybe once a month for the past six months. But I'm recognized and treated exceptionally well each time I come.I used to hear of some folks talking about how the Second Line was always too crowded, but I've never had that much of an issue. My wife and I went for dinner at 8 p.m. on a Friday night and were seated within five minutes. That may have been more the exception than the rule, but overall, getting seated has never been an issue.If you're looking for a place to begin a night out on the town, be it with a group or a date, I couldn't recommend the Second Line any higher."]], "Bar DKDC": [], "Kooky Canuck": [], "The Majestic Grille": [["Joy C.", "Downtown Dining Week continues....The husband and I went for a late bite to eat. Arrived was seated promptly. Waiter was OK. Got drinks....waited 15 min to order. The special was 3 green salad with feta, entree was bacon and spinach stuffed trout, soooooooo gooodddd! Omg, let me tell you. Best thing since crushed ice!!!!!! My husband had glazed salmon. He said it was good. Dessert was strawberry shortcake shooters, soooo good!! All in all, a good experience. Will return. Have to get to the brunch here. I have heard its AWESOME!!!"], ["Ron S.", "What a surprise!!! The young people at Sun Studio's recommended this restaurant.We had the most amazing chef's special recommended by Michael the \"waiter of all waiter's\". He mad the experience truly phenomenal. This just put the topper on our day in Memphis. Thanks Majestic Grille. If I could give you more Stars.... I would. Thank you for a wonderful evening."], ["Steph W.", "Brunch was ridiculous. Seriously. In the best possible way. Bar seating is a Battle Royale but if you're cool with making friends while you dine, do it. Being from Portland I couldn't help but immediately like the bartender with his thick TN accent and incredibly helpful, charming demeanor. The bloody mary was perfect. A little kick from some horseradish just the way I like it. But the food is where this place shines. Filet Mignon eggs benedict? Whaaat? Cheddar Grits?? Getitinme. Those grits...maan...they will be the benchmark for which all other cheddar grits will be based on. They even serve you cute little biscuits as an appetizer, gratis. If I ever come back to Memphis...this will be the first place I think of when I want brunch."], ["Valerie B.", "When I walked past tables for food people were eating looked amazing. But I wasn't overly thrilled with their desserts. I was here for a food tour and so we got to try six of their mini desserts. It's a super cute concept each dessert comes out in a little mini cup. So you get to try lots different things without being overwhelmed and flavor. And again you get to try different things.We tried carrot cake, Keylime pie, delicious chocolate mousse, strawberry shortcake, And a couple other things I don't remember. Obviously they don't stand out in my mind. Out of the six things the carrot cake was the best. But I've had way better carrot cake other places.Everything about this place screams money. So if you're looking to spend extra money then go here. But that's entirely up to you. If you're looking just for dessert I don't really recommend this place but there were worse places to go. It is clean and the staff is nice so that's definitely in its favor."], ["Jason D.", "Came with a group of 8. Wonderful atmosphere. The wait staff was wonderful and the food was better. Really enjoyed the steak and it was prepared wonderfully. My wife had the trout with shrimp. Well worth the time and money."], ["Kristina M.", "I was Downtown this week and I thought it would be nice to check out this restaurant since I had it bookmarked on Yelp. When we arrived it looked closed but the hours on the door said opened so we walked in. As we walked in, the hostess looked at us in confusion. She didn't greet us (minus a star!)  I said hello and asked her if they were open since I noticed that they were setting up, I suppose for dinner. She looked at us again with confusion and told us how can she help us. I said we would like to eat in if possible. She hesitated and told us to hold on for a moment. Now I looked at my husband and told him that maybe we should leave because the hostess was obviously confused LOL If they were closed or busy , she could of just told us or expressed that we needed a reservation. Either way communication would of been nice. She came back after a few minutes and told us to follow her. She seated us in the very back, which was cool because I was able to view the big screen that plays all the old movies.   However, after we were seated it took about 15 minutes before a waiter showed up (minus a star!). When our waiter finally got there, he was polite and courteous and recommended the seared tuna. My husband ordered the seared tuna while I ordered the Lemon Grilled Chicken. While we waited on our food, our waiter brought out our drinks and the complementary bread . Now the bread was delicious. It was seasoned and tasted great. My Lemon Grilled Chicken was so good. The chicken was moist and the roasted veggies tasted yummy. My husband greatly enjoyed his tuna, asparagus and jasmine rice. Overall, this place was great except for the hostess incident and the wait for a server.  I thought the restaurant had a really nice atmosphere, the food was delicious, and our server was great once he arrived. I will definitely be back. Also, now that I have read other reviews, I will make a reservation before I go next time maybe that was why she was so confused ;)"], ["Jacqui G.", "Today is a such a beautiful day to be outside enjoying this amazing sunlight - of course dining on the patio at Majestic Grille what a great view of the trolley,Main Street and tourism- Majestic grille lunch special today's turkey wrap & artichoke soup"], ["Debbie D.", "I loved the ambiance in this place, and the food was tasty (try the benedicts! Any of them!). Also, the service was wonderful. That said, I'd probably go to a little more \"mom and pop\" place for breakfast/brunch on my next trip. It was really good, just not memorable."], ["JaspalandAman H.", "Went here for a Saturday brunch. They don't open till 11am on Saturdays.We were 2nd couple to be seated. We ordered a bottle of champagne and OJ and made our own mimosas.We ordered the salmon hash and the eggs Benedict. We ordered a French toast to share. The hash and Benedict were delicious. The toast was a little too much- it's made of Texas toast and has 3 bacon strips on side.Overall, great experience, smack in the center of downtown Memphis. Parking is easy on street or garage.Love this place. Will be back."], ["Meghan C.", "One of the best of the many excellent aspects of Majestic is the range - casual to fancy & gourmet to sandwich & fries. Amazingly supplied bar, especially wines. Great location for special events - we had our wedding reception in the balcony, as they played Fred & Ginger movies for us. The wait staff is very welcoming to kids - start with the cheese & meat plate (appetizer) for them."], ["Karen B.", "Wow! We took a chance and came without reservations. And the food Angeles  smiled on us!Great ambiance. I'm talking A+++Front desk... EarnestBar staff - knowledgeable Drinks- strong but not tooFood- OMG I wish I could cook like this!Forget California Cuisine.  Tai - why Tacos? Ok if you have 15 minutes for lunch and a boss who hates you,I believe God means for us to eat shrimp and Grits fixed like this!!'I will be back next year with a bigger crew so we can try more things,Thank you yelp family! This  recommendation rocked'"], ["Deanna W.", "This place is ridiculously cool. It's like you've stepped back into old Hollywood. This two story venue is very open and has an upstairs balcony that allows you to do some great people watching. Palm trees line the middle and at the very back end of the restaurant there is a huge screen where they play old movies! To stay with the theme music played throughout is old 40s/50s. Now for the food. Wow. Not only was the complimentary bread basket yummy, but the spinach dip was on point as well. For an entree I got the smoked salmon. I love all things salmon and really did enjoy their Rosemary honey glaze. Along with the salmon, there was asparagus and white rice. I was shocked how much I liked the white rice. All in all, I think everyone was happy with their food. Definitely give this place a try!"], ["Paige A.", "I absolutely LOVE this place!!  As a local, I have eaten here several time and have never been disappointed.  The last time I ate here I got the salmon with asparagus and rice and it was devine!  My husband got the roasted chicken with broccoli and mashed potatoes...also perfection.  I am not sure which I liked more!"], ["Lucresha W.", "Take me to the moon, let me play among the stars...Classic! That's The Majestic Grille. I simply adore this Memphis treasure for a number of reasons, but service ranks at the very top. I've been entertained in all facets of the establishment and the staff never misses a beat. My favorite location would have to be the bar. Should I say that out loud? Hollering! Like seriously, you go and instantly you acquire a new best friend. Or is it just me? Hmm... Bring it back lady.  Oh yes, the attentiveness will make you blush because the chemistry is so natural. What about the food? You will not be disappointed. I've had the pleasure of all delish services (brunch, lunch, dinner, drinks, and dessert) and left with a smile every single time. Friends that accompany me that's never been are amazed just the same. And now, frequent flyers. Simply, experience this gem in person and you'll get properly turned on by its prismatic charm. I promise."], ["Dee Dee C.", "First off I'm rather salty there is no place in Atlanta like The Majestic Grille. For the the quality of food, service, and atmosphere this place would be price jacked if in the ATL. I'm a sucker for a nice plate setting and great interiors, and The Majestic Grille does both well. This place is much more larger inside than it appears on the outside. It is roomy, seductive, and has a fantastic bar. Food wise my husband was not impressed with his Artichoke Flatbread. Myself on the other hand enjoyed the Artichoke Eggs Benedict. The hollandaise was plentiful. The eggs poached perfectly, and the artichoke gave a nice vinegar taste to the dish. Also as I alluded to earlier, the prices on the menu are well under what I'm used to for brunch in Atlanta. I was more than satisfied. Our service was a little frazzled, because it looked like she had many tables to serve, and their was a hiccup with getting a booth bused, but other than that I had no complaints."], ["Ronika A.", "I know it's a Memphis staple but this restaurant is just okay in my opinion. Don't get me wrong I'm going to keep going but the food is average at best.The good--The ambience is beautiful and I do mean beautiful. If you have never been, please go for the history, the beauty, the atmosphere, and the silent movies. The bar has great service and the hostesses deliver great customer service. The drinks and shot glass desserts are rather delightful, too. The fact that it's close to the Orpheum makes it a natural choice before or after a show.The okay- The food and service. Not bad, but not great. Servers are usually nice but slow. The server kept forgetting my condiments. Food lacks enough seasoning for my taste. For dinner, I prefer to stick with appetizers and flatbreads. For brunch, I like to get the frittatas (one of my friends loves their brunch and enjoys several of their offerings).So while the Majestic isn't my favorite, it's a solid pick for dinner & a show, a date when you are unfamiliar with your companion's tastebuds, or brunch with friends."], ["Ashley F.", "This place was to die for. There was literally a line outside the door before they opened for Sunday brunch at 10:30am. (Def make a reservation) The service was much faster than restaurants I've been to on Beale St. Would 100% come back here, the food was uncomplicated and delicious. A necessary break from the fried crap in this city."], ["T D.", "I got the pork entree which was amazing. The sauce had a little too much maple in it for me but was still good. Our server Dakota was very attentive and friendly and got all our orders correct. The specialty cocktails were amazing I had the rum punch."], ["Callie M.", "My husband and I stopped in here for brunch before our flight home (we were in Tennessee for Thanksgiving and headed back to Tampa).We love brunch and enjoy finding the best brunch spots in a new city so we were excited to try The Majestic Grille. Right when we entered, we were impressed. The live music was classy and fun. The staff was welcoming and attentive. The place was crowded but not overwhelming. We were immediately seated and greeted by our server. When she brought out a basket of fresh mini biscuits for the table, I knew I was in love. I was so tempted to order the $15 bottle of champagne with OJ to make your own mimosas but my husband reminded me that we still had to get to the airport, so i settled on having just one mimosa for myself - and it was a delicious.I have the veggie frittata which came with a parmesan cream sauce that was so delicious and the perfect serving size. My husband, an eggs benedict addict, was very pleased when he described how the dish came out with just the right amount of english muffin, ham, egg and hollandaise. I have heard him say so many times that his eggs benedict was drowning in sauce or the muffin was too much, but this was just right. Simple and perfect.I would highly recommend this place for brunch!"], ["Heidi W.", "This is one of my favorite places in downtown Memphis. But to be honest, it's not because of the food. It's because I really, really like the venue, which is why I am sure I will go back there once in a while. I am a sucker for old, historical buildings with high ceilings and architectural details, what can I say. The 100+ year old two-story building was once a movie theater and is beautifully restored, making this place really special. The fact that they show old movies on a giant screen only adds to the ambience. Don't get me wrong, the food is not bad by any means. On par with places \"better\" chain restaurants like Seasons52, Firebirds, Bonefish Grill and the like. - I I sort of get it. It's a pretty big place, with a lot of seats, so they have to appeal to that. As a result, the menu is pretty broad."], ["Linda W.", "Went for brunch. Very reasonable food and drinks. Great atmosphere. Wish I had more time and would have gotten the $15 majestic mimosa w a whole bottle of champagne!"], ["Sheena T.", "I adore the Majestic Grille for the fantastic food and unique atmosphere!I have been for lunch during the week and at brunch. The brunch was divine. I had the shrimp and grits and they were amazing! We also got a basket of biscuits and butter, and I was tempted by a mimosa, but sadly had to drive home and could not partake in my favorite morning beverage. What really makes this restaurant stand out is the interior. It's very 20's with string lights running the length of the restaurant and old movies playing on a large projection screen at the back of the restaurant. This would be an excellent date spot as it is romantic and classy. The Majestic is a Memphis gem and I'd highly recommend you stop in for a meal."], ["Rose F.", "We had the company conference dinner here.  We had the entire upstairs over looking the restaurant to ourselves.  The Filet Mignon was very tender and juicy served with broccoli and mashed potato.  For dessert we they offered an assortment of Key Lime, Tiramisu, and Oreo Cookie.Very good service."], ["K D.", "Brunch biscuits are delish. Garlic shrimp and cheesy grits and breakfast sandwich are amazing. Service is great. Good wine and drink selection. Any seat in house is great."], ["Richard A.", "Great to sit at the bar and enjoy a hand-crafted cocktail or local brew before catching a show at The Orpheum.  The flatbreads are perfect to share with someone when you don't want something too heavy.  Nice and crisp, with great flavor!  I've enjoyed the mushroom and the artichoke flatbreads.I've been there a previous time for dinner, I can't quite remember it, but I don't remember it being terrible.  I still have go back for brunch as I heard it's one of the better ones in town."], ["Michael M.", "As a tribute to the Majestic Theater, this restaurant prominently features a huge movie screen at the back in full view of all diners on both the first and second levels. Classic drive-in cartoons fill the screen while diners enjoy a variety of delicious dishes.My wife and I went for dinner and enjoyed the cheese and sausage platter as our appetizer. Along with the stated imported and cured items, it also included dried cranberries, a variety of crackers, and bar-b-q'd walnuts. We continued our meal by splitting the filet mignon, which was well seasoned and cooked perfectly. Although the parmesan fries sounded better than they tasted, the accompanying broccolini was very nice. Our meal was completed with two desert shot glasses - the strawberry shortcake and chocolate mousse, both of which were delicious. Overall, it was a wonderful dining experience."], ["Emily Y.", "I can't believe I haven't already posted a review of this place! The Majestic Grille is arguably one of my favorite places to eat downtown, especially if I am going to something at the Orpheum. A major plus is that they will validate your parking for the Peabody Tower Garage. Their brunch menu is delightful- I'm a sucker for cheddar grits. The flatbread paired with a glass of wine is a perfect combo for a girls night out. I have also been very pleased with the burger and PARMESAN fries. If you love old movies, make sure to get a table where you can watch the ones they play on the massive back wall!"], ["Deen W.", "From the moment I walked through the doors of Majestic, I knew I was in for a treat. My husband ordered some biscuits and gravy for the table as a little snack while we perused the menu. I absolutely loved the gravy - - it has a \"zing\" to it and the color is slightly orange....not your typical sawmill white gravy. After a minute, it clicked - andouille sausage! SO good, I couldn't keep my hands out of the biscuits...and I don't even like bread that much!My daughter ordered the steak and eggs, my husband got the John D (basic breakfast fare) and I opted for the crab cakes benedict. Oh, and my husband got a Bloody Mary - - at $4 and touted by someone at the CA as \"the best Bloody Mary I've had\" then he kind of had to. I had one sip....it was good, strong, and spicy! A few sips of my sweet tea quelled the heat, thankfully.Everything was absolutely fantastic. My daughter liked my crab cake better than her steak, so we switched. The steak was nice - perfectly medium rare - and the soft scrambled eggs came just so. And when in doubt, just add some of that andouille gravy!  Our server, Marcus, was awesome and had a great, upbeat attitude. This was our first time to come to The Majestic Grille, but I see many return visits on the horizon!"], ["Jenny J.", "We had a great lunch at The Majestic yesterday. It was a rainy Saturday in Memphis, so there weren't too many people out. But The Majestic was still quite full. Even with the crowd, we got a table pretty quickly.  Our server, Eric, was super friendly and got all our orders (five of us all with various customizations) perfect. The burgers and the grilled cheese were yummy, but the flatbread that we got as an appetizer was my favorite part of the meal. And they also bring buttery biscuits to the table as a starter. And then they have dessert shooters that top everything off fantastically!"], ["Kara S.", "I went here with my husband for our anniversary. Our food and service were absolutely impeccable. I got the ravioli, and while it was a simple dish, the flavor combination was just perfect. I didn't get a chance to try the desserts this round, but a friend yelled at me for that later -- according to her they are among the most decadent tiny desserts. I was disappointed in one aspect of our visit: the much-promised silent movies were not screening that night! Regardless... I'm definitely a fan."], ["Karin G.", "This review is based on my experience with a private party in the Innovator's Room.  I have a feeling if I dined here in the restaurant, my review would have been much better.For our party, we were scheduled to eat at 6:30pm.  When we first arrived, we were informed the room was not ready and we may have to wait till 7pm.  5 minutes later, we were told the room was ready - so clearly there was some miscommunication right off the bat.  Once the rest of the party arrived, we were all ready to start eating right around 7pm.  We didn't get bread baskets until about 7:30.  We were starving and devoured the bread.  Then we waited another 15 minutes for our salads...the evening continued to be one big waiting game for each course.  The food was wonderful & plentiful when it finally came out!  But the service really hurt my impression of the restaurant.  I know we were a larger party with different menu selections, but I expected more from a top of the line restaurant.I would love to come back again and eat dinner out on the patio and give another review from the perspective of a guest ordering through the restaurant."], ["Trivedi A.", "It is a great place if you want to go with your colleagues and does not want to spend much money. They have a good selection of sandwiches and flat breads. They have about 5 entrees that includes salmon, filet mignon, pastas etc. They do not have many vegetarian options. They have vegetarian flat breads (with mushrooms), veggie burger and ravioli as an entree. The ambiance is very casual and the servers are very friendly. I went there for lunch and it was a good experience. I still have to go there for brunch."], ["Kirstin S.", "Went to the Majestic on Super Bowl Sunday before going to see some tourist sites.The bloody marys are phenomenal, the brunch was good.  We had a breakfast flatbread pizza with smoked pork, which was very good. The eggs benedict was really good, and I subbed the potatoes out for super yummy cheddar grits.  We would definitely return for brunch here."], ["Danielle Z.", "Everything was excellent. We were in Memphis for a few days and if we hadn't eaten here on out last night I would have gone back. I had the filet au poivre with mashed potatoes and he had the bacon-bleu burger with parm fries. Everything was outstanding, including the bread they give you to start, amazing! Service was good and the atmosphere was very cool with an old movie playing on silent on the big screen in back. I would definitely go back if I'm ever in Memphis again."], ["Paul L.", "What a great place with a very nice ambiance.  The service was excellent and the food was delicious  (roasted Mahi Mahi in artichoke butter on garlic mashed potatoes ).  Will be back to try more."], ["Valerie M.", "We tried the Seafood Flatbread and the Mushroom Flatbread. Very good!  Aside from wondering if we were ever going to be waited on, it was a very nice place to eat. Love the atmosphere. I will chalk the fact that we didn't see a server for about 20 minutes to the fact we were there for  very early dinner and most of the staff were still in prep mode. And I like to give second chances!"], ["Marissia W.", "I enjoyed the food and wine! I had the lunch combo, cheese ravioli and side salad (greens) it was very good. The only thing I did not enjoy was the small booths. So get a table if you have a party more than 2. It was very cramped and that is not a comfortable eating experience. Service was typical lunch rush but she was friendly. I would recommend to others"], ["Erica M.", "On a late Saturday morning, my fiance and I were looking for a place to have brunch since we were staying at a hotel downtown. Yelp has become my \"savior\" when looking for restaurants on vacation. This place had good reviews and was only a short walk from our hotel, so we decided to give it a try. We were not disappointed! We were actually pleasantly surprised.This place has a very nice atmosphere! We were greeted by staff and seated promptly. Being brunch time, I was looking to have a Mimosa. I was happy to see that the drink prices are very reasonable here. A single mimosa cost $4 or you can have the whole bottle and a carafe of orange juice for $15 dollars! The food prices are reasonable as well. Unless you're eating brunch at a diner or McDonald's the prices run the same with most restaurants serving brunch.I ordered the Artichoke Benedict and my fiance ordered the breakfast sandwich. I tasted his breakfast sandwich and it was very good, but my artichoke benedict was amazing! Even my fiance liked my entree better than his! I mean WOW! The egg was poached perfectly, the english muffin toasted nicely and the hollandaise sauce was on point! It is probably the best benedict I've ever had! The artichokes complemented the hollandise sauce very well. The service was nothing short of excellent as well.We are very glad stopped to have brunch here!"], ["Anita P.", "Good Upscale American food. I had the shrimp and grits, and that is a favorite dish of mine! The shrimp were tender and nicely seasoned. The grits were creamy and well seasoned. Together they were heaven in the bowl. Really enjoyed the dedicated service. We were seated away from the big screen, so I missed the cartoon that was showing until I went to the bathroom. Such a large space. Great restaurant in Downtown Memphis!"], ["John J.", "Great food, great location and great people watching if you sit outside.  Ordered the lemon grilled chicken w/sautéed veggies.  Excellent choice!"]], "Paulette's": [], "Tart": [["danielle v.", "visiting Memphis and stopped in for a coffee and email session before a flight. Great cold brew and service by a lovely barista who rocked a fun rocker style. Also had a raisin croissant, wanted to try their tarts teasing me from the case, but was pressed for time. Little light on the outlets, but this place is best done with book in hand or close friend.  thanks!"], ["Kella C.", "Yall just don't understand my love for this place, the thirst is sooo real people. The renovated house is really nice and I'm in love with their breakfast antipasto, you never know what you will find on your tray. Usually it's a boiled egg, brie, dried meat, fruit, a small baguette, great cheese, and a honeycomb. I always get a small french press and cream (which is good for about 3 cups of coffee). I never leave without my favorite honey almond pastry either. Even though it's French food, I'm always satisfied when I leave, not stuffed but satisfied. Their French onion soup is everything you want it to be, very addictive....and dangerous. During my first visit to Tart my mother asked the guy at the counter if they had anything low fat, he asked if she had ever seen a fat French woman....I would happily be the first. I love Cooper Young, and after eating at Tart its so nice to talk a little walk around the area. They are cool with you bringing your dog with you to eat on the patio too. I'm on the lookout for a beret for my mini schnauzer as I type."], ["Jay B.", "Stopped in here for breakfast with family while road tripping in TN. It wasn't terrible, but I don't think I'd be inclined to come back for breakfast if I lived nearby. The server mentioned that they were having trouble with the coffee machines as the coffee took a while to prepare. Unfortunately the coffee was bitter and the chai latte tasted like it had coffee in it. Food was ok. Brioche was a bit on the dry side and over-cooked but the ingredients themselves were good quality - sliced ham wasn't processed and the cheeses were fresh and tasty (wasn't regular grocery store mass produced cheese). Perhaps they were just having an off day...? Or maybe pastries are this place's specialty...?"], ["Gracie C.", "Delightful! Love this little bakery. The pastries are just great (mmm - that almond croissant) and the coffee delicious. I highly recommend the French press. Chairs aren't the most comfortable if you're planning for a few hours of work/study, but perfectly fine if just having a quick coffee date or breakfast. Highly highly recommend this lovely little place."], ["Ronika A.", "I definitely want to go back. I met a former colleague here for brunch. I got the hot chocolate, Croque Monsieur, and a chocolate almond croissant and something I can't remember for dessert to go. No, I didn't need dessert and yes, I ate both treats before I made it home.Back to what I actually consumed at the restaurant. The hot chocolate was rich and creamy AND quite delicious. The main event, the Croque Monsieur was better than I could imagine. Right amount of ham and gruyere- and the bread, ciabatta was fresh and just plain good. My colleague had quiche-can't remember what kind but she was equally in love with it-I like my quiche a little overdone (I know I'm weird) so if I ever order this I will have to request for them to put mine back in the oven. All in all great meal."], ["Mary G.", "Husband came on a business trip to Memphis and I tagged along. Had some work to do so I decided to try out a local cafe while he was in meetings all day, and I'm so glad I tried Tart! It's a cute little French cafe, with a very friendly staff. I tried their Croque Monsieur, which came with a side of black eyed peas salad, an iced tea with the meal, a hot Mocha Ganache beforehand and Tart Citron for dessert. Everything was delicious and I thoroughly enjoyed everything. The only downfall is I found it to be a bit on the expensive side ($30 after tip) but other than that, perfect. I would definitely come back again."], ["Mary Kate M.", "Tart is cute and totally 150,000,000,000,000,000,000,000% hipster approved.I can't say too much about the place other than I got an apricot tart for $4 without tax, and it tasted divine. I don't typically like apricots that much, but this hit the spot. As far as my friend goes -- she got the garlic leek soup which had a little more of a cream base than she or I cared for when I tasted it. Menu items are not cheap -- if you get a sandwich, you're looking at $10-13 per item. I am accustomed to paying this in DC, but in Cooper Young? The times are changing, I guess. The sandwich I did see one girl has sitting next to us while on the patio wasn't substantial. I am not saying the quality isn't there because she did relay to us it was pleasantly good. Personally though, I think I would rather spend my money elsewhere in the area with as many offerings as they are. I can't blame a place for prices if there is a market for people who will buy the product. Just saying I probably would use this more as a pastry/coffee/quiche place than sandwiches or salads. It is nice they have these additional features though.- They have local art on display throughout the restaurant. - Staff are friendly- Dog friendly place with room for your doggies to hang with you on the large patio in the front of the building.- Mommies, they have a changing table for your baby in the restroom.All around I think this is a quaint place -- worth visiting again for sure... just not for the sandwiches because I am cheap."], ["Caroline V.", "When it comes to Tart, I am torn.  The croissants and coddled eggs are where it's AT, but the service and the pricing are borderline ridiculous. At work, we have a joke that goes something like this: Person 1: I'm going to Tart to get coffee; want anything?Person 2: Nah, see you next week.It's really infuriatingly and ambivalently slow. The number of instances when I've stood by the register dumbfounded at the length of time it takes for the staff to put a pastry in a box to-go is ludicrous.On top of that, the prices are high for what you get, even if what you get is delicious and darling (I'm looking at you, four-cheese quiche with your side of the world's tiniest baked apple).Four stars for food (when you finally get it), 2 stars for service: 3 stars average."], ["Richard A.", "Cute French bistro in the Cooper Young district.  There was a slight mix up in our food order, and the chef came out personally to apologize and even brought us a little goodie to munch as a good gesture.  Food was delicious, a lot of cheese on the croque!  The onion soup could've used a tad bit more salt, but the cheese made up for it!   Why bother with ordering a small coffee press, get yourself a large!  Enjoy it all on their spacious patio.  Will definitely venture on back!"], ["Kontji A.", "Great service, great atmosphere, delectable food!Grab your laptop and enjoy the patio. The menu is mainly brunch-like. They even have Coke in the bottle. It's a great place for people with a sweet tooth.  Lots of pastries. I highly recommend the Croque Norwegian hot sandwich: Salmon, Gruyère cheese and Dijon mustard. Delicious!!#Yelp901"], ["Juliet D.", "A cute little place converted from a house, conveniently tucked away off Cooper. The decor is a little lacking; I was expecting some wall art. Maybe they're transitioning into a different collection. Food is scrumptious, portions adequate, and the coffee heavenly. I must come back to try the pastries next time."], ["Jennifer S.", "I had lunch with a college friend here since we both have been wanting to try it and it was close by.  I got the Brioche with baked eggs and a ganache hot chocolate.  The service was pretty good. The food was delicious and the hot chocolate was divine, but pretty small for the 9.50 it cost for the food, but the hot chocolate was reasonably priced compared to other places.  Also, it didn't seem like they had air conditioning at the time I visited because it was very hot inside.  Not sure if it was just on the fritz or if they do not have it all since it was my first visit.  We didn't feel rushed though during our meal and we were able to talk for a little while until our lunch hour ran out. I definitely want to come back and try some of their pastries another time because they looked wonderful."], ["John W.", "Very good croissant, shatteringly flakey crust.  Coffee was decent.  I got the citron tart which was incredible.  Like keylime pie only better.  I don't get the knocks on the service.  The guys were a little slow but it was a busy morning.  Besides, it takes time to make a good cuppa joe."], ["Amanda E.", "A nice relaxing spot and clearly where the memphis hipsters hang. The space is nice but a little barren, I thought there was supposed to be art on the walls? The food is very good and different from the typical memphis cuisine. On one hand I applaud them for authenticity on the on the other here in America I want a little more than a small sandwich for $11. If they added chips or a side salad I'd be perfectly pleased at the prices, but I do understand the French are not a chip eating people. The service is very slow, it's great that everything is made to order but only come here if you have the time to linger, not that chairs are super cozy, hard and small rather. Also, pastries sell out fast so come early if you want your pic of everything in the case. This review seems a little more whiney than I intended so here's why I'm giving four stars - yummy food. We split the croque Monsieur and the salmon roulette, very good! The butter cookies dipped in chocolate, omg delicious! And the French press coffee is nice - a small is two cups; the cup btw is brought to you warm which was a very nice touch. I'd consider coming here a treat but will be back to experience this little piece of France in memphis."], ["Andy S.", "I just went for the first time and I have to say that I LOVE it.  I had a croque monsieur, and it reminded me of what I have had in France.  The one at tart had a little bit more meat on it than I'm accustomed to, but I like extra meat.  I think the sandwich was around $10.  I also had a French press coffee that was delish.  I think it was about $3 for a small.  It's in a remodeled house, which adds to the charm.  There is plenty of outdoor seating on a super nice patio.  I will definitely be back.  I didn't get any desserts, but I did have a pain au chocolat in the past from there during the Cooper Young Festival.  It was also super yummy.This is a great place for sandwiches, coffee, and pastries!"], ["Fara C.", "Always good service. hubby got the chicken almond sandwich and I got two tarts! so good! Love the patio. dog friendly.  Not a large selection on their menu. but good food nonetheless!"], ["Christianne B.", "Friendly service and great coffee! I tried a quiche while my boyfriend had a bacon breakfast sandwich, both of which were delicious. We also split an almond croissant, which was worth going back for in itself! We will definitely be back."], ["Senwhaa L.", "The pastries here took me back to the days of studying abroad in Paris, where I only ate carbs and creme brûlée. Definitely check it out. The chocolate almond croissant can't even be explained. Just get it and don't make the mistake of sharing like I did. Jk. But really, it's that good. The French press coffee is more than enough for two and it's super strong."], ["Joelle P.", "Nice little place! Love the location on Cooper. It is in an old house (not sure what was here before) but the charm factor is through the roof. And they have a great little patio out front!One of the owners popped by our table to make sure everything was ok, which I appreciated. I had already scarfed down a chocolate croissant (delicious) before my steak salad arrived. I'm not sure why I ordered it...I even asked the cashier to recommend something (she suggested the croque monsieur or the salmon) and then I still went with something else. I wasn't really a fan. The steak was too cooked and really cold. And it was pretty much just served on a bed of lettuce. If I wasn't so hungry I wouldn't have touched it. I went back to get a cherry tart because I was still starving...and that was just like a party in my mouth. I'll be back, but next time listen to what they recommend. All of the pastries look divine so I don't think you can go wrong there. And they have free wifi! Perfect for a work breakfast or lunch."], ["Erick H.", "If you haven't been here you need to go ASAP! This is one of my new favorite places in Memphis. The staff was friendly & helpful. The food was fantastic. I don't believe that one could go wrong with any of the food options. The delicious french press coffee hit the spot."], ["Michelle W.", "I had the pleasure of dining at Tart for breakfast on a Saturday morning. The atmosphere is lovely and the service is great!The breakfast sandwich and coffee were delicious and the perfect size. The plates and cups are beautifully made by a local potter. I look forward to returning very soon."], ["Patti C.", "Oh my!!!!  We were visiting Memphis, TN when we stumbled upon Tart.  Our lunch of beet salad and quiche was delicious.  We returned at least two more times during the week for coffee and baked goods.  The last time we made it in the owner was behind the counter and offered us a free meringue which was quite nice.  Must devour the lemon tart and chocolate croissants.  If we return to Memphis, which we might, this will be our must visit spot."], ["Ashley P.", "This place is great. I went during the week for coffee with a work group of 7 and the place was pretty busy. We were able to pull together a table for 7 but it took some assistance from the staff.The coffee was excellent, I had the almond croissant and it was fabulous and the atmosphere is great. They even brought us some parties fresh out of the oven. Some of my coworkers ordered breakfast sandwiches that looked incredible.I definitely recommend this place."], ["Tina T.", "THIS PLACE ROCKS!! We went for brunch a week back and it was so worth every single cent. I got the Croquet Norwegian which is salmon and cheese and heaven between two pieces of fresh bread. My sister had the pear with yogurt and granola (I forgot the name, sorry) and it was super delicious and very fresh as well. The coffee is served in a presser for each order which gives you about 2 and a half cups, they offer a variety of creamers dairy and non (I had almond milk). Their apricot tart was what we shared for dessert and it was awesome--we asked them to warm it up and it was even better that way. They don't serve alcohol, but they do allow you to bring your own champagne without charging a corkage fee, which is amazing. They sell freshly pressed OJ to mix with your bubbly.  The atmosphere is cozy and quaint, with small tables and chairs and creaky wood floors. You order at the counter and get your utensils in a separate area and they bring the food to you. We absolute loved it and will be going back for sure! Enjoy :)"], ["Sharleen C.", "I took two of my kids and my mother in law from France just to see how authentic this place was.   None of us were super impressed.   The place is small and quaint but not a very comfortable atmosphere.   People were nice and the food they almost had accurate giving they have to give  little American adjustment.   Our biggest problem was attempting to cut into our food.  When of have to nearly stand up to get through the completely burnt bottoms of our bread makes the experience much less enjoyable.   I thought maybe that's the way it was supposed to be because all four of us had that problem,  but my mother in law said no.   It is supposed to be toasted but not that hard to wear we even had problems chewing.  The flavor was right on though.   I wouldn't recommend coming back.   I normally give every restaurant at least two visits but I can't see spending over $60 for another meal like this again.   Some of the good... Pressed coffee and green tea were very nice.   Once again... To drive from Collierville out here.. Wouldn't be worth the trip.   I was really hoping to take my mother in law someplace authentic for some tastes of home."], ["Ray G.", "Great spot. In town for work and found it by accident and so glad we did. Locally grown and home made. The Quiche was fantastic...coffee great and the sandwich...well what can I say. Do yourself a favor and stop by."], ["Amanda G.", "The food is not bad at all. But the service is horrible. They said they have a full menu, but there is no way to hold a menu and then they don't serve you at all. Obviously it is not the concept but the employees are just \"pretty boys\" working at a cafe with attitudes. Not impressed! The food is too salty as well."], ["Jeremy W.", "Still closed at 7:14am when hours posted say 7. Simple, open on time. The other time visited the line had 4 people in front of me, service was slow - I waited 6 minutes before going elsewhere. Line never moved."], ["Laura M.", "I have eaten at tart 3 times. The food was impeccably prepared and delicious each time. The coffee is rich, the quiche is so light it floats, the pastries addicting. The only shortcoming is the service--sometimes it takes along time to place your order at the counter.  The wait afterward is not bad, and the food is definitely worth it!"], ["Kelly P.", "So I regularly stop by Tart for a weekend coffee and pastry treat. I recently special ordered a dessert from here for a special event. The city was hit with freezing weather that caused Tart and other businesses to close for two days. They still managed to fill my order then contacted me to make arrangements to hand deliver it to my home the day I needed it. The staff is always smiling and friendly and I absolutely love the coffee and variety of sweet and savory foods. I was a regular customer but now I am a loyal customer."], ["Allison S.", "Passing through Memphis and saw the high ratings. Completely overrated and expensive. So disappointed. The quiche and breakfast sandwich were bland and the lattes mediocre. Not recommended sorry. Lower your prices"], ["cree l.", "Delicious! Amazing French press and croissants! Quiet and intimate! We had the muesli and with fresh fruit and a breakfast sandwich. The breakfast sandwich was on a deliciously fresh croissant and smoked salmon! Yum!!!"], ["Renetria D.", "Pricey but worth it. French butter and chocolate make the most pristine croissants I've ever seen, too pretty to eat.  Fresh espresso, buttery flaky  pastries. Great place to impress a date(hint hint for the fellas) or grab some for somebody for the ultimate full belly \"walk of not that much shame\"."], ["Liana N.", "Yum! This place is perfect for breakfast! Husband and I came here in a Friday at 10am to grab something quick. The location is in a old house located near cooper young. There's construction going on next door, however you can easily find it by their banner with their logo on the outside and front of the house. Walking in, the place is small and there mostly the same furniture but its an eclectic place so there's different funky chairs etc. with small intimate seating. We ordered a French press for coffee and the featured quiches of the day. It took a little longer than expected, but not too long. The staff was friendly and helpful (small tip the cream and sugar is on the right side of the house through a door) and we got an almond chocolate croissant to go. The quiches came with a small side of yogurt and fruit and was super delicious. We saved the croissant for later- it held up well and was incredible. They offered us to go cups for our coffee too! I'd like to take friends and family that visit here in the future."], ["Joe W.", "If you're looking for a relaxed, charming little coffee cafe, Tart should be on the list.I visited on the recommendation of a friend, who described it as fancy food without pretense.  For starters, it is a cool little place with old hardwood floors, cozy tables, and casual vibe.  Everything is set up for a relaxed experience enjoying coffee or food and conversation.The menu indeed has some fancy touches while remaining approachable, and the staff is great about explaining the dishes if you don't know them. Everything I've had here has been good, though it seems they specialize in pastries (weird, right, since their name is Tart?).I understand the press coffee is great but I haven't had it yet myself. Next time!"], ["MadewithSweets T.", "Always Amazing! I've been dozens of times and every experience is memorable. Literally nothing I wouldn't order again. Oh my goodness the bakery display is filled with magic!"], ["Jerry S.", "Not too shabby!   I went on a rainy day but I feel like the patio would be sweet... Inside they've got very trippy artwork--very cool...the paintings continue into sketches on the walls and the ceiling is made of chalk-board paint so you know how fun that can get, but anyways, THE FOOD:We got there a little too late to get the coddled eggs, and the quiche wasn't spectacular (I just think we were a little late to get the freshest out of the oven kinda quiche), but the breakfast antipasto was great!Seems like a wonderful place to get a pastry too.  It was cute--i liked the vibe... That gives it a star.  Definitely a good addition to the neighborhood!"], ["Patrick T.", "Very cool little coffee, tea, and bakery shop located in a house on Cooper street! Every time I'm in Memphis I usually go to Otherlands for Coffee but this morning we checked out Tart and it was a quaint little spot! There coffee was excellent and served FRENCH PRESS style!  You can order and ALL YOU CAN DRINK French Press for adding only 2 dollars on to the original LARGE Press order! That rules if you are there with a group of people or you plan on hanging out for awhile working!  My pal had breakfast, which looked amazing bakery goods and oatmeal cooked to perfection!  The barista's were cool and the art on the walls rules!  They even have a mug club for repeat coffee Offenders! Trust me I will be back!"], ["Sarah P.", "I'm always hesitant to try a new business without giving it some time to work out any kinks, but I went ahead to tart anyway.The decor is eclectic but still crisp and clean. The patio looked nice, but I'll try it out on a non-rainy day.I tried the tartine (toasted baguette) with herbed feta, delicately sliced radishes, salted pork, and mashed peas with a side of the tomato and leek bisque. Although the tartine I am used to (toasted baguette with preserves and butter) was not what I had, it was still excellent and very savory. The soup was not as light and bright as I expected, but still tasted good. The cute little salad had a nice and lightly lemony, acidic dressing that was perfect. My cafe au lait had the perfect amount of steamed milk, and I enjoyed the presentation of my meal. My only qualms that gave this place a four star review: I know that a French-inspired place is going to have smaller portions, so just be aware of that. I was fine with it because I was expecting this. I ate slowly and was satisfied. The lighting was not my favorite. Maybe because it was rainy, but I think more lighting would really help.There was no music playing! Everyone in here was sitting alone or with someone in basic silence...I think a little bar area with high tables/stools would be cool when their wine license is approved. $10 corking fee if you can't wait until that time.In other words, I'll be back and am excited to try breakfast.EDIT: forgot to write about the service: order at counter and sit. Very helpful and nice. Bonus that they can pronounce the menu items well. Everything is brought to you but flatware/napkins...which is fine, but if they're bringing you the food anyway and you also tip (ahem)... Tip: grab some utensils/napkins before you sit."], ["Mattie M.", "Yum! I love this place. Just like a little European cafe! I had the Croque Provençal, Croque Madam-style. I enjoyed the nice casual weekday lunch atmosphere. Delicious!"]], "Flight Restaurant & Wine Bar": [["Donna S.", "I was wandering around Memphis one afternoon in the cold and rain and decided to stop someplace to get out of the moisture and order a warm drink.  It was a little fancy lookin', like a nice date place,  but it was the afternoon and pretty empty, so I didn't feel weird seating myself solo at the bar.  I ordered an Irish Coffee with Hazelnut Bailys.  Perfect to thaw me out and warm me up.  While I sipped my warm beverage, I took at peek at the menu. The menu consisted of small plates and flights of food tastings which would explain the name. Oh, right up my alley!  I had already eaten a late breakfast, and had a dinner date that night, so I really shouldn't eat, but everything looked sooo good!  And when would this California girl be back in Memphis?  Okay, just ONE little plate.  And it was such a good little plate.  Scallop Benedict.  One scallop with black truffle potato rosti, Virginia ham, a fried quail egg, and lobster beurre blanc ($9). Ooooooo...  It was good and I wished I had more time to try a nice dinner here.  And of course there are wine flights to pair with the food flights. Small plates didn't really have small prices, but everything on the menu sounded creative and/or exotic, the atmosphere was classy, yet cozy, not stuffy, and from the small plate that tasted, worthy of the prices.  Best place I didn't get to eat at while I was in Memphis."], ["AM P.", "Amazing, unique, delicious and decadent.  What a concept for a restaurant.  This is the place to go when you can't decide on one thing for dinner.  Pick one of their flights for appetizers, salads, entrees, desserts and wine.  Everything we tried was fabulous.  Go with a group and try as much as possible !"], ["G M.", "Although the food was promising, it was served cold and congealed.  Flight had a lot of promise and with some basic kitchen upgrades or changes in procedure (I.e, plating practices and attention to food temperature), it could give other restaurants in Memphis a run for their money."], ["Karlescia B.", "My husband and I went to Flight tonight in celebration of our wedding anniversary. We were treated like celebrities!!We had a 7:30 reservation, but we arrived about 5 minutes early. Instead of seating is at one of the many available tables, they asked if we didn't mind waiting for a \"special seat\" they had for us. Initially I was slightly annoyed with the 8 minute wait...until we were escorted to our table and sat down. We were given a table for 2 on the balcony overlooking the main dining room--it was amazing! Our server immediately greeted us and we were given a glass of complimentary champagne. Our server was very attentive and made sure our every need was met before we could think about asking. Everyone from the hostesses to the wait staff made sure to wish us well and made our night special. This was our first time at Flight but my husband is already planning to return."], ["Bianca M.", "I can't describe in words how absolutely amazing this meal was. A nice twist on the usual small plates approach, this restaurant served superb flights of foods ranging from roasted lamb to braised elk. Paired with their recommended wine flights, this meal was to die for! Absolutely would come back here. Highly recommend. A little pricey but definitely worth it!!"], ["K D.", "Beautiful idea to have for a delicious selection of foods and wines! Must go!"], ["David Y.", "Reading reviews about the organization of the menu at Flight Restaurant, I was worried that it was going to be mostly gimmicky with so-so food. My worries proved unfounded. I love the concept and the food.Alot of people have commented on the ambiance and customer service and I would just reaffirm those who came away with very positive feelings about this aspect of the experience. From the maitre d', to the bartenders, to our server Chris (who looked so young I kept wanting to ask him when he was going to graduate from high school), to the runners and bussers -- everyone made us feel welcome, comfortable and special. That is something I really appreciate when i am going to spend $200 on a dinner for 2.When I eat at a nice restaurant that has a good, diverse menu, I am often frustrated if I have to choose one appetizer and one salad and one entree and one dessert. So I love the idea of small plates. Flight takes this concept one step further, so I like it that much more.I won't bore you with the gory details of our meal, but I will say that of 15 plates that came to our table, only the tuna tartare I would not eat again. MORE IMPRESSIVELY, the entree flight I designed had bison, elk, and quail and each of these three items were delivered to the table at exactly the proper temperature. I am not a chef, but I have had plenty of meals in which the kitchen could not prepare a single entree at the correct temperature, much less three at the same time. My compliments to the entire kitchen brigade.I recall glancing at one Yelp review that suggested the portions were not a good value for the money. I could not disagree more. Each item in each flight we had was at least 1/3 of a portion. We had an appetizer flight, a salad flight, and two entree flights, and we couldn't finish our dessert flight. It was more than enough food.The only misstep of the entire night was when I order the Tennessee whiskey flight to close the meal and the bar substituted one of the whiskies without asking me first.If I make it to Memphis again, I will definitely eat at Flight again, no question about that. I will also see if they won't comp me the whiskey they were missing the last time."], ["Shannon C.", "I stumbled across this restaurant while out walking. My friends and I decided to try some wine tasting. This place is awesome! You can get tiny portions of anything; appetizers, drinks, desert, whatever. Seeing that this was our first time here, our waiter Chris L., was extremely helpful when assisting us with our selections. We enjoyed the restaurant so much we are coming back tomorrow."], ["Amanda W.", "This is an amazing experience! New to the area, and not yet finding very many fine dining restaurants, we were ecstatic to discover Flight. I took my husband here for his birthday. Our initial impression is that it wasn't very fancy; the decor and atmosphere wasn't what I expected. However, the service was impeccable, and the food and menu choices were divine! They have a fabulous wine list, and everything you order is in \"flights.\" From the appetizers to the main course, wine, and even desert, you get to try three of each! So unique! It's not really tapas style, as 1) it's not Spanish cuisine, and 2) it's a flight (small samples of full dishes). We truly enjoyed ourselves and will be back."], ["Devon O.", "The idea is basically tapas for American food and wine tasting. Three mini meals or three types of wine for a round price  The wonders of the world wine flight was awesome, as was the lobster gravy and biscuits (all seafood, even the gravy). Veal was also awesome."], ["John Q.", "I pulled off the interstate in search of Memphis' best on a dinner away from home...the first barbeque joint that I selected was closed, so I rolled the dice searching for simply good food..what I found was an exquisite dinner for 1/3 the price if I were to be eating at one of Manhattan's finest.The restaurants approach to dining is to allow flights of food, along with flights of wine.  This allows for a robust portions across multiple entree's...for example, three preparations of fish, a variety of shellfish, or in my case bison ribeye, elk chop, and a succulent filet.Beyond the menu, I found the staff friendly, and fully engaged with ideas on how to craft a food and wine dining experience that was fun and superb.I look forward to a return with my family to show them what wonderful food, and attentive service is all about.Best- John"], ["Michael B.", "Let me just say I have never ate at Flight nor will I ever.  I called Flight to arrange for a dessert to be brought to some good friends of mine who were celebrating their anniversary.  They had already finished eating so I was unable to send anything to their table.  TWO MONTHS LATER I received a charge for $96 on my credit card, the original item I had ordered was in the $30 range and it was two months ago and they never received it.  I accidently noticed the charge on my credit card and called Matt at Flight who knew what I was talking about but offered no apology and indicated it was a mix up with Open Table which is weird since I called the restaurant and read my CC # over the phone.  I did get the credit 36 hours later and I get that mistakes happen but to be charged for non existent items is criminal.  I would definitely be wary of using my credit card at Flight."], ["Sara Y.", "Flight's food is practically unmatched. The small plates of intricate, different meals is so refreshing- definitely better than your run of the mill hunk of steak. The presentation of all of the food is simply exquisite to the point that you feel bad destroying the art by eating it. Their plate of cheeses and meats is absolutely phenomenal and has some interesting picks, though nothing offensive or risky. I don't really know where to start with the desserts... Oh, the desserts... They are so elegant and so tasty, but they never last long enough.The service here and the darkness could use some work. Other than that, Flight is my #1 pick if I'm willing to drop that kind of money on food. It is definitely worth what you pay, however."], ["Chealsy L.", "Oh my goodness. If you were a devout Catholic you may need to seek confession after eating here. It is all sinfully delicious! Cannot rave enough about it. The Ostrich and Bison are to die for.  Amazing! Must go at least once."], ["Richard L.", "I had a well travelled customer tell me Flight was the best restaurant in Memphis. I called to see if they served Sunday brunch and found it was their first day doing so. We were the first customers to experience the brunch menu. The \"Flight\" concept of mixing and matching small plate or entree portions is wonderful. We started with a Mimosa from the bar. We chose the Great with Syrup and Delta flights. The small portions gave us six items and two sides to share. Each was truly amazing. The Pork Tenderloin on Pumpkin Ravioli (topped with Apricot Chutney) was our favorite. Ghiradelli Chocolate Chip Pancakes, Cheese Grits, Chicken & Waffles were the best we ever had.  The coffee with a hint of chickory is not to be missed.  Prices very reasonable for such a quality menu.  Service from front door to table was exceptional. Brittany our waitress was informative and helpful. Management checked in to get feedback about brunch.  Take advantage of the outdoor patio seating on those pretty mornings. Flight is truly the best restaurant in Memphis."], ["Jeannine S.", "I can't say enough about this place.  I love food and wine, so how could I go wrong?  Well, it's possible, but not at Flight.I've been here a handful of times for a variety of occasions, from business dinners to personal celebrations to date nights.  If you're going with another person, try to request a table on the second floor either next to the window (for a great view and some privacy) or next to the railing overlooking the first floor tables/bar (for some good people watching).The food is delicious.  I don't eat seafood, so I can't comment on that, but I've had just about every non-seafood item on their menu.  My favorite I think would be the duck, or maybe the lamb, or whatever, it's all good.  The wine is great, and they will let you do a flight of high-end wines...and save room for the Port flight.TIP: When you order a flight, you do NOT have to order all three dishes!  You can order only one or two small plates and they will just charge you for each small portion.  It will help you save room for dessert.Foodies, put this place on your list.  Bookmark it on Yelp.  But make sure you make a reso in advance.  Same-day is near impossible and the bar is always packed."], ["F G.", "Great food, problematic service.Waiter shared  his entire life story with the table next to us. We waited for at least 5 minutes before we got a wine menu. No chance to order an aperitif. First fail, in my opinion. After getting a lecture of what a flight is (no question about if we know what a flight is... we do, doh) my wife ordered a glass of Prosecco with the Carpaccio starter.Carpaccio came, no Prosecco. After reminding the service that we were still waiting for a Prosecco, it eventually arrived (and I got my flight of wine with the starter, for whatever reason). After we barely finished the Carpaccio, literally 30 seconds later, our entree flights arrived, but my wife was then waiting for her flight of wine.The food was great, but way too much for a \"flight\" which is supposed to be a taster, not three heavy starter-sized plates. But please, just because we are not from Memphis, we aren't idiots."], ["Sofia M P.", "Yesterday my husband and I went on a date to celebrate our 11th anniversary* On the past we've heard awesome things about this restaurant So I went on Yelp to make sure this place was what we had in mind for our place to celebrate. The pictures showed a nice atmosphere and yummi food, and so I reserved online, we sure weren't dissapointed .  The place has a very romantic feeling, the service is profesional and inviting, and of course the menu has all good options for every taste. We went with the flights because we are foodies with a big appetite and we like to try all types of food . My husband got the soup flight and I got the appetizer flight and we shared both.  The appetizer flight has two huge shrimp, a crab cake that is Out of this world, and the Calamari in that awesome cilantro sauce.... oh the calamari! It's creamy, perfectly well cooked and that Sauce is the best partner for those pieces of heaven.  The soups are super creamy and delicious, my favorite being the acorn cream with caramelized almonds on top.Then, he got the meet flight ( ostritch, elk and steak )and I got the fish flight. Both were delish!  Probably the best on my trio was the fish filet On top of the Lobster rissoto, and on my husband's plate was the steak on top of the mashed potatoes.  That Sauce was amazing! Also the ostrich was very good, very well cooked . My father in law had ostriches a while back ago, so we have had try ostrich before, but never prepared as exquisite as it was yesterday. The price is fair because this type of meals are special and very well executed.  For a special date or a nice dinner this is a good place to go.  The price are worth it."], ["Brian R.", "Went on a double date about a week ago and absolutely loved it! A little pricey but you get what you pay for!"], ["John H.", "I love the food and the service more. One of our favorite stops in Memphis."]]}