{"Ciao Bella Italian Grill": [["Danielle D.", "The atmosphere in this place was nice and the Lasagna was great! Unfortunately the service was horrible. No refills and items asked for were never brought to us. This was not what I expected from this place especially on my anniversary."], ["Lily W.", "So I tried The Beef Brisket Stroganoff the first time....OH.MY.GOODNESS! It was amazing! Really it was the ultimate in comfort food! Disclaimer: grabbed the pic from the restaurant's page because I ate mine too quickly"], ["Mike S.", "Sat on the patio recently when the weather was nice, and it was delightful. I went a little unconventional, but really liked what I got. I went with a side salad with gorgonzola added to it, a bowl of their avgolemino soup, and the eggplant fries. Oh those fries! They alone will Insure my return. The bread pudding of the night was cherry, and I wish it were a regular on the menu. I would order it every time. Outstanding! Like Arnold used to say, \"I'll be back.\""], ["April S.", "Okay, Yelp!  Here's my update... I've been back three times and I can honestly say that the jump from two to four stars is well deserved!My boyfriend and I were invited to join two other couples at Ciao Bella and we accepted.  I was a little leery to try this place again, but I certainly didn't want to be rude, so I went.  Let me tell you, it was a great decision.  We ordered a few appetizers; calamari, tasted ravioli, and the antipasto.  The variety of cheeses, meats, and olives on the antipasto plate was impressive.  Not a large amount, but lots of different flavors to enjoy.  My boyfriend and I both ordered the special of the evening which was a hangar steak served over wilted spinach and finger potatoes.  I loved the steak.  It's too bad it was a special and not on the regular menu.  I would order the steak again.  I had coffee for dessert and when I asked for whipped cream the waiter said, \"no problem.\"  When he brought it out to me in a little dish he told me that the kitchen had just prepared it for me fresh.  It was awesome!!  Nothing like REAL, fresh whipped cream.  Overall everyone was really pleased with the food and the service.  The SO and I enjoyed ourselves so much that we went back a few weeks later.  I was sad to learn that there would be no steak because like I said, it had been a special and was not available.  I went with the Veal Picatta and enjoyed it.  Once again, I ordered coffee and the whipped cream put a huge smile on my face.Last week we went back AGAIN.  Still no steak but we did order the appetizer special of the evening.  I wish I could remember what it was called.  It was shrimp sauteed in a buttery sauce that was so incredible we ordered another one.  After the two of us polished off two generous servings of saucy, shrimp amazingness, I was hardly interested in ordering \"dinner,\" so I got the wedge salad."], ["Don C.", "Dyann and I went here for a late lunch.  Atmosphere is nice and service was good.  My eggplant was fresh and tasty as well as was the salad.  They had a Yelp coupon good for a half price lunch. So check in.This could have easily been 4 stars but their wine prices were some of the most expensive I have seen in Memphis.  I do enjoy wine but the extra 10 to 25 dollars a bottle makes me  feel like I'm getting ripped off.  If they would lower their pricing on wine they would see a lot more of my business."], ["Cedahlia S.", "Oh my goodness!! Very impressed with the super outgoing staff, comfortable atmosphere and last but not least the food!!!The Fired goat cheese polenta was amazing!! Slightly crispy and almost melted in my mouth!Cioppino was fanaminal!! Although, I do wish it would have been prepared with a smaller noodle but thats my own preference. The server, Lauren definately knows that menu and made the best suggestions!! She was very upbeat and funny!!! I had a wonderful time and cannot wait to visit again!!"], ["John F.", "This place is too legit to quit! I am from St. Louis, and when I moved to Memphis I was begging for a decent Italian place to eat. I believe I found it here. They got everything right, the lighting is dark, the pasta has perfect texture and there's even a chunky man in the back corner looking like the Godfather. Pizza and Pasta is on point and they also have great sandwiches for lunch. I think it's worth trying! ;-)"], ["Margie S.", "Everything I have tried is excellent, including the service. I've never been disappointed. Ask for Gene, he's great!"], ["Jeffrey R.", "In Memphis for work and found this excellent restaurant. Great food in the middle of a strip mall."], ["Jan W.", "The best creamy mushroom and chicken soup ever! The flavors explode in your mouth. My first thought was like Campbell's but how wrong I was for an upscale restaurant like this and Italian too oh my this soup is like soup nazi good! If you've seen Seinfeld soup nazi episode you know what I'm talking about! The heirloom capreese is the best. Presentation is everything and they know how to do it. I also ordered the Bella Donna (beautiful lady) sandwich with the homemade chips. The waitress said the chef made up this sandwich and that he was really good and talented, based on what I've tasted so far I would definitely agree with her. The sandwich has mortadella, mozzarella cheese, tomatoes, roasted red pepper heated and finished with fresh basil, shredded lettuce and baslamic mayo all on a wheat berry bread. The service was superb! All I can say is after this meal i wanted to lay down on the bench and curl up and take a little nap!"], ["Amelia K.", "After having a lovely dinner at Ciao Bella last night, I was compelled to write a review. Our server, Lee, was excellent! My husband and I are vegan and Lee made such great recommendations. We had the chopped salad sans mozz and pasta primavera with white wine sauce per Lee's suggestion and it was delicious! The service could not have been better and patio was beautiful. I look forward to returning to Ciao Bella and I hope that Lee is working when I do."], ["Hannah G.", "We LOVE Ciao Bella. It has great atmosphere, great service, and great food. We usually have our three-year-old with us, and they are very accommodating. Most of the time they come out with a dough ball for her to roll around on the table.Arrive with an empty stomach. They start you off with bread fresh from the ovens of heaven. When the server asks you, \"Would you like to start off with any appetizers?\" say, \"Yes, I would love the baked ravioli.\" Why should you say that, you ask? Because it is from the same ovens the bread comes from, I'm sure of it. It's so crispy and warm and has the most cheesy, delicious filling.When it comes to the main course, I am afraid my opinion isn't very extensive. Because I love it so much, I have only ever ordered the Pasta Primavera, sometimes with chicken, sometimes without. I always mooch off my husband, who is not afraid to try new things, and have never been disappointed in the various other dishes he's ordered. We always finish off Ciao Bella with a short walk down to Yolo for gelato, though I'm sure their desserts are great."], ["Ediza F.", "Let me start of by saying, that we called ahead and since they closed at 9:30 we asked if they could still accommodate us 15 mins before closing...they welcomed us with open arms!! Talk about souther hospitality!!! We immediately told chef Brandon that I was Vegan and my fiancé was vegetarian, and appetizers and meals were customized to our dietary needs. He made me a PHENOMENAL dish with vegan mozzarella and all the fresh produce from their local organic farmers!! It's the first meal I've had that was vegan that I felt was 100% gourmet. No lie. Remember not all dishes are the same it depends on what their farmers will offer, but honestly just \"let em cook\" and they'll make you a good vegan dish!!"], ["Tony M.", "There are so few good non-chain Italian restaurants in this area, and I believe this one ranks as one of the top 2 in the city. The service was as crisp as the house salad, and the entrees were wonderful. Between the four of us we each ordered a different style entree, and there was little talking during the meal as we each savored our meals. I HIGHLY recommend this restraint; we will definitely be going back!"], ["Beth S.", "We had to wait for about an hour as it was Friday night, but we waited in the bar, where  the bartender was friendly and attentive. After almost an hour, we were starting, so we decided to have appetizers in the bar.I had the Caprese Salad, which was fresh and delicious, but could have had more basil and I missed the capers. But the balsamic was tasty and the mozzarella was fresh and slices were generous. We didn't mind waiting, as the bar is lively and fun with a good wine selection.Dinner was excellent. My Grouper Alla Pesto was wonderful - I loved the fresh vegetables and the fish was flaky and tender. When I divided my portion in half and asked for a to-go box, the server was so impressed with my willpower she brought us a free slice of cheesecake. I took a small bite and it was creamy and delicious.This was our first visit, but it most certainly won't be our last. It's casual but upscale with a relaxed feel and a bar so cool you don't mind the wait."], ["Melody D.", "This is definitely one of the better Italian restaurants I've been to lately. We started with the Mozzarella and Parmigiana Garlic Bread. It was great--and the marinara that came with it was some of the best I've ever had. The house bread they brought out was very good too. My husband had the manicotti (full order) and ate it all--I didn't even get to try it! He said it was wonderful. I had the white pizza, which was amazing. I'll definitely be going back."], ["Katie P.", "Ciao Bella is a great place for a family dinner, date, dinner w/girlfriends, etc. It's in East Memphis in a shopping center, so you might not think it's really nice inside (with an awesome patio), but it is. I loved it before I was vegan, but I thought I'd pretty much have to just write it off afterward. But then they started offering vegan (and gluten-free) offerings. I have been several times and tried several different things and have been wowed every time.I usually just tell my server I'm vegan and ask the chef to make me something. I tell them what I don't like, and both times the chef has actually come out to my table to talk to me about it. They have awesome bread and oil and fountain drinks and coke products, which, if you know me, matters to me a lot!My only problem is that I wish they didn't serve veal. Along with foie gras, veal is one of the most cruel animal products there is. I wish Ciao Bella (and about a million other restaurants) would be more sensitive to that."], ["Nancy K.", "I've been away from Memphis for a while so when I had the chance to come back and eat a catch-up meal with a girlfriend, she suggested Ciao Bella since I've never been before.Ever since I started dating my now-fiance, I have rarely eaten Italian (aka 0 times). He's not a big fan of anything noodle-y so that means no Italian food and also no more pad thai (one of my favorite foods but that's another story). Anyways, I was pretty excited to go try out this Italian eatery.My friend and I started off by sharing the Caesar salad, which was very tasty and a good sharing size. We were also given a basket of fresh bread with olive oil and generously offered more bread when our basket emptied.For the entree, I had the half portion Penne Pesto. This is a great size for one person and left me very full. The pasta was super pesto-y, which I personally love, but the chicken was a little chewy.Overall, I loved the food here and would love to go again. Our waiter was very nice and kindly refilled our waters because we ended up chatting for almost 3 hours. We went on a weekday night so I'm not sure how the crowds are on busier nights."], ["Kerry C.", "There's a good reason that Memphians have loved Ciao Bella for the last 10 years. The casual East Memphis restaurant serves great Italian food. They also are great at curing extreme pasta cravings (like the one I had a few nights ago).We started with one of Ciao Bella's appetizer specials - seared scallops with blood oranges.Both scallops and blood oranges are on my shortlist of favorite foods, and these were excellent. They came dressed with a tangy, fruity sauce that complimented both. I'm pretty sure this isn't on the regular menu, but it should be.Speaking of the regular menu, it's pretty impressive. There are pizzas, pastas, Italian-inspired entrees and plenty of seafood.I couldn't decide between the pasta and seafood, so I went with the lobster ravioli ($18).The orange and white striped pasta was much spicier than I thought it would be. I think part of the spice came from the roasted red pepper cream sauce, but the pasta definitely had some flavor on its own.The raviolis were stuffed with chunks of lobster. It wasn't some lobster mash, either - there were big, visble hunks of meat.Atmospherically, Ciao Bella is cozy and intimate in a way that makes you forget that you're in a strip mall. The lights are dim, and when I was there for week day dinner, there were plenty of couples on dates. It's casual enough for a regular dinner but special enough for an important dinner.The restaurant is a also larger than it seems from the outside. There's plenty of seating in the dining room, bar and on the twinkle-lit patio."], ["David P.", "I enjoy pizza,  Ciao Bella has a damn good one.  I ordered the Piccante 12\"($15) and added jalapenos($1).   The Blue Moon beer went down well with this awesome pizza.  Too bad I live in Atlanta and can't enjoy this sweet find more often.  I sat outside on a beautiful day, the waiter Christopher was attentive but not annoying.  A well spent $21."]], "Marciano": [], "Carrabba's": [["J Penelope Walkininit S.", "We went to the wine tasting last week and it was fabulous, the Wulfe mahi was really good. It was a great value for the price; 4 courses paired with wine @ $40/person. Definitely looking forward to the next event."], ["James S.", "I truly love this place, never had a bad meal here and the service is great. Many different items on the menu and all I have tried were very good. I would certainly recommend this place and I only wish it was a little closer to the house."], ["Ramona P.", "The food is always pretty tasty here. The Caesar salad is a must...definielty try it!"], ["Brittney H.", "Decent chain restaurant! We've been here several times. I had the chicken parmesan the other night and it wasn't wonderful. My husband had the veal, but his was very good! If you're looking for a decent Italian restaurant, give it a try!"], ["Carlos S.", "You're out of PIZZA DOUGH already? And you wait 20 minutes to tell me? I'm not happy. Maybe I should've gone to Collierville...or to another place."], ["Mike J.", "Normally don't do chains, but we were nearby and we had liked Carrabba's in the past.Food was mediocre, service was poor. They were in a hurry to feed you and rush you out and you could tell.Learned my lesson, not again."], ["Melanie L.", "Review is for Carside Carryout only:  this is the ultimate take out!  You place an order online drive to the special parking spot behind the restaurant sit and wait and the food is brought to your car by a friendly server.  How convenient!  No need to drag the kids inside or wait at the bar.  Server was Amanda she was very nice she greeted me brought me check to pay brought me a drink while I waited and then brought out hot food and put in the car.  I ordered the salmon with steamed spinach and a side of chicken soup.  Everything was hot and tasted healthy and delicious.  The focaccia bread was delicious and they included the nice herb and olive oil dipping sauce for it.  Coupons for next time in the bag.  It was a Monday and I didn't have to do dishes so I'm coming back next week for this lazy Monday experience!"], ["Brenda R.", "I searched the poplar area in Memphis for a nice but not to pricey night out. After looking through all the yelp and tripadvisor listings and reviews, back to one of my favs, carabas. The service was amazing. They even made a special dish for my son that was not on the menu. Love their season drinks and it's very reasonable for the very yummy food."], ["Melissa M.", "This was our second time eating here and both times have been good. The first time I had crab cakes but I wasn't entirely crazy about it. Also I remember service being slow. Our past trip was an improvement. Our server greeted us quickly but gave us time to look over the menu. He took our drink orders and came back to say the Dr. Pepper machine was broken?? I ordered a lemonade instead. It needed sugar, which he brought me. The bread they bring before the meal was sooo good and soft. I could have eaten a loaf by myself. I ordered a small portion of Chicken Parmesan. It was amazing! I made the mistake of getting garlic mashed potatoes as my side instead of the pasta. The potatoes still had the skin which I can't stand. Luckily my mom had some noodles she was willing to share. I would totally recommend the chicken parm. I ate every bite!! Our server kinda started to lack around the time our food came out. We noticed him standing around talking to other servers. It wouldn't have been so bad if we weren't out of bread! He came back by though and brought us to go boxes and I asked for to go bread. Overall it was a great meal!"], ["Bailey P.", "\"Normally I don't do chains,\" says every \"foodie\" on the planet.  Well I do, most especially when it comes to Italian food.  Sorry, not sorry.  Carrabba's is just the bees knees.  The pasta sauce flavors (esp. tag pic pac) are in your face and I love it.  I also could eat 800 loaves of that fresh, warm bread dipped in yummy oil.  Not a huge fan of their remodel and will refuse to ever be sat at a high table again (if I'm not at a bar, my feet must touch the ground or I feel like I'm 8 years old)."], ["Kyla W.", "Drumroll please, prepare to hate on me! I don't love this place, who knew you could go wrong with pasta?!I give the ambiance and music 5 stars, the service is great and that free bread, yum. But that is about where my compliments end. The food is not great, it's not horrible, decent at best. I feel like for the prices they charge the food could be a bit tastier, it's a bit blah. The salads and drinks can be pretty delicious but for an Italian place that focuses  on pasta the pasta could be better."], ["Jen M.", "I love the blackberry sangria here, the delicious fresh warm bread, and the chicken dish i had was pretty doggone tasty.  My daughter enjoyed her shrimp and scallop linguine pasta, she enjoyed it with the shrimp but did not like the scallops, they were the small bay scallops and were rubbery and fishy tasting.I tried a steak at another location in Denver last time, it was delicious.I will return to this place."], ["Rich L.", "Stopped in with a work group this evening for a small Xmas get together. There were 7 of us. We arrived around 5:00pm so it wasn't crowded. It took approx 25 minutes to get drinks from the bar which arrived incomplete.  We ordered apps, and they were just ok.  As long as we had to wait for them, I expected them to at least come out hot - not just warm. The waitress was even assisted yet he was no help.  We ordered crab cakes, and split them to share upon arrival.  There were still pieces left when the waiter reached for them then asked if we were done.  I told him no, and he oddly replied \"Well, that's why I asked.\" To which I replied \"and that's why I answered.\"  Food gets one star, and service gets one star.  That's why I gave them a generous two."], ["Clinton S.", "Three - four - three - four - three stars, how many to give? So many of the things I disliked were specific to this one visit (excessively long wait, etc), but in balance Carrabba's is just not what I think of when I think four stars. So we went on Valentine's Day night, but got there at 5:30 PM and still had to wait over an hour! The place was absolutely packed - it's not that big to begin with, but then there were a lot of people who wanted to eat there that night, and we were behind many of them!! Once we got seated, our waiter was efficient, although we did have to remind him once about our wine/beer order. He brought out the fried cheese sticks, and they seemed a little over-done to me - almost bordering on burned. The side salads were as expected, but the dressing was really outstanding (the House vinaigrette). The meals everyone got seemed to please all - my pork tenderloin was a little crispy (sensing a theme here - a little to much heat in the kitchen)....but the sautéed spinach was cooked perfectly, great flavor and cooked just right. Other favorites at the table included the Chicken Brian (with extra lemon butter sauce) and Pollo Rosa Maria.  I think I would probably go back again, to give the place another shot - just not at one of the busiest times of the year!"], ["Loan L.", "The service was horrifically slow. Out of all of the things that we ordered, the bread was the best part. After finishing the bread and most of our water, the soup finally comes out and our waitress says the bread will be out shortly (never did). The Pic Pac chicken was soggy. The dessert (which was what I was looking forward to the most) was literally finished within 2 minutes, yet it took over 20 minutes to come out. This was my first time at any Carrabba's and needless to say, I won't be returning. The only reason why I'm not giving this review less stars is because our waitress was at least nice."], ["Chris C.", "Some pretty good food options here, but really odd and slow service and a disgusting pizza made the experience sub-par.Our waiter was....something else. He had a bunch of strange mannerisms and weird turns of phrase that often ended in an awkward silence. This would've been fine by itself, but we had a good 20 minute wait in between ordering drinks and seeing him again to order food and get the drinks. During this time, the oil was poured but the bread didn't come out for another 30 minutes and then, after another wait, the soup/salads came out at basically the same time. All told, we were there nearly two hours, not counting the wait after our ostensible reservation time. I enjoyed my food (the Marsala sauce was excellent and the vegetables and soup were surprisingly good), but my dining companions' orders were much less impressive. The calamari felt like someone had squeezed fried goo onto fish-flavored goo. The pizza was compared unfavorably to the cardboard box that a pizza might come in and was left mostly uneaten. This is really 2.5 stars, but I'm rounding down because with prices this high, you expect higher quality food and service."], ["Trevor T.", "I went to Carrabbas on the recommendation of my wife. So we went after church this past Sunday. There was no waiting to be seated, however, I did not like being placed by the door on a cool Sunday afternoon. I decided to try their Salmon instead of going with a pasta dish. A very bad mistake. The Salmon was not too bad, it was okay. But at the end of the day I was not impressed. My Dad would say that's what I get ordering Seafood at an Italian Restaurant. However, I must admit that the Salmon at my weekly Italian place (Old Venice) is terrific. I will give them another try and I am curious about trying their wheat pasta."], ["The Yelp-inator W.", "Excellent food can be found here.  Good service and a fairly nice atmosphere."], ["Samantha B.", "I do love what I get at this place but I only really like about one thing on the menu. I don't really want to experiment much because it costs quite a bit. I'd honestly rather just go to Olive Garden.Love: - Pollo Rosa Maria- Calimari- Dessert Rosa- Sogno di Cioccolata \"Chocolate Dream\" - Steak Marsala- Italian salad with balsamic vinaigrette Ok:- Chicken Trio- Chicken Marsala - Shrimp Diavolo- Italian Soda Raspberry- Caesar SaladEhh: - Pollo la Scala- Pollo Sorrento (didn't like the cheese)- Lobster Mac n Cheese- Mama Mandola's Sicilian Chicken Soup- Bryan Chicken- Tiramisu"], ["Don C.", "We eat here at least once a month - usually on Sunday after church.  My favorite is the Veal Piccata which no longer comes with capers - I ask for capers to be added.  Salads are always fresh and the wine list is well rounded - we usually get the Estancia Pinot Noir ($10 off on Wednesdays).On Sunday, ask you Brad, he provides excellent service."], ["Nicole B.", "Good service and relax experience. Dinner was great and prices were reasonable."], ["Stephanie M.", "This was my first visit. After a slow start, things picked up and got better. We first sat there for over 5 minutes before our server showed up and acknowledged us. There were only 2 other tables there. Our server appeared a bit \"shakey and unsteady\" at first and smelled of a strong smoke of some kind. Our server did get better as the night wore on and did better than I anticipated. The food was good."], ["J B.", "We went last weekend and were surprised at how much we enjoyed this!  We'd been before for lunch at the Collierville location and were not impressed.  But we had a gift card so we went to this location on a Sat. Nite. I was busy but the service was very good.  Salad to start were tasty and fresh.  Hubby had a very nice salmon entree with an exceptional pasta side dish and it as all good.  I had a rustica pasta dish with big chunks of yummy asst. veggies with olive oil and excellent spices....loved it!  We'll be back...and may order the very same things!"], ["Chris R.", "One of our favorite restaurants. I have fallen in love with the Linguine Pescatore and order it every time. The fresh baked bread is always a nice treat. I prefer the chicken soup over the salad and it never disappoints. We usually do a call ahead because on Fridays and Saturdays it can get busy. The wait staff is always friendly and quick with our refills and overall service."], ["Daniel H.", "As far as Italian chains go, I think Carrabba's is one of the best out there. That being said, the food is nothing to write home about, and the pricing is a bit steep for what it is. I do really like their bread, olive oil, and herb mix more than I like the bread and butter/oil at other places. I don't think you'll ever be disappointed by Carrabba's because they do a pretty good job on their quality control from corporate of keeping the restaurant run at a pretty high level. The atmosphere is also quite good here."], ["Shawn L.", "This is a nice place to eat. The food is always good and the service is excellent."], ["Frances A.", "I truly enjoyed my Sunday dinner Italian style today. Food was great and they have a 3 for 15.00 dollar special which was even greater. Service was good will be going back before the week is out especially at the price.Pasta is tops,Baked bread & shrimp dishes and a great chicken soup. We enjoyed it!"], ["Sherie C.", "When it comes to chain-reastaurant italian, this place is awesome..... although, I do have a confession....  The only thing I have ordered there for the past 6 years is the Chicken Marsala.... I can't help myself, I dream about the sauce... I could drink it!  I have had my husband drive 3 hours because I was pregnant and the \"baby\" had to have it.  Of course the food is frozen... IT IS A CHAIN!!  But, holy cow... that sauce!  My husband has stronger self control, and usually eats something different everytime, and hasn't complained (focusing on that it is a chain, and we feel comfortable taking the kids)... LONG WAITS THOUGH!"], ["Stephen O.", "I have read the other reviews, and they stand in stark contrast to my own experiences. It is true that I do not hate on chains as much as the next memphian, but before you disregard my opinions, please hear me out.Every time I go to Carraba's, I have excellent service. Not only that, but the managers stop by my table to greet me every time without fail. Everything they do at Carraba's is homemade. They do not use packet, they make everything from scratch. Please allow me to take you through a typical meal for me at Carraba's.For an appetizer, I usually get the fried Mozzarella which is delicious served with their homemade marinara sauce.  It is my favorite fried cheese in this city. For my food I get the off-menu Chicken Rosa Brian, which is a combination of the Pollo Rosa Maria and the Chicken Rosa Brian. It is something that the servers get, and I was tipped off to by one of the excellent servers that I usually get (Neal is amazing by the way) .  It is tender chicken breasts stuffed with Fontina cheese and prosciutto and topped with goat cheese and sun dried tomatoes. I get that with the cavatappi and the house salad with their scratch made creamy Parmesan dressing (takes 3 hours to make, if its not up to spec they toss it out).  It is absolutely amazing. I usually don't get desserts but their Desert Rosa is light and flavorful. Their mini desserts are great if you are into that kind of thing as well. Bottom line: go check this place out for yourself, and try my favorites, maybe you will find you like Carraba's after all."], ["Katie P.", "Hmm...This is another one of those Italian places with food a little fancier than I prefer (I prefer more of a Pete & Sam's or Bruno's approach)...however, like most other comparable places, the apps, salads, and desserts suit me fine.Went with a party of five for Father's Day lunch.  I called ahead and we were seated after about a ten minute wait...not bad.  It's one of those places where instead of bringing you a box, they take your plate to box up your food FOR you.  So you know service is going to be a step above what you'd get at a Huey's or Memphis Pizza Cafe...I've never experienced anything but great service at Carrabba's.Several people I was with ordered the shrimp scampi, and RAVED about it.  Like, wouldn't shut up about it.  And I don't care, because I don't like shrimp, but I assume you care, which is why I'm telling you.The dessert shots were not as good this time around as I remember them being...but still, I love that idea.  They are much better executed at Cafe Toscana though (across the parking lot from Whole Foods near Poplar/Mendenhall)."], ["Don S.", "Well I sorry to say our experience was absolutley terrible. First the waiter was to involved with selling some products he reps outside of his waiter job that all of our orders were messed up. My wife had ministrone soup that was served cold, I ordered a salad with ranch dressing - it came with oil and vinegar with blue cheese, our calimari didn't appear until it was time for dessert and all of our food was really bland. I was with my wife, daughter, son-in-law and two grandsons. It was tough to get someones attention when we received, first - no bread, second no pasta for the kids, third no appetier and last but not least someone to help us. We ate in shifts and not in the proper order. My food, the canolli, had a very fishy smell and was suppose to be topped with crabmeat. Well the crabmeat - I think - was cold and bland, the filling - lobster and shimp - was non existent. I looked real hard to find a trace of lobster somewhere in there, but to no avail. My daughter had the three piece chicken sampler and her's was good, my son-in-law had the steak and could only eat half since it was very bloody. The kids pasta came in a small portion and trying to get a refill was hard - no one would respond to our calls except a buss person who snapped at us and was truely in a very bad mood. Ok I know this is not suppose to be a gormet place but at least give us hot food and a smile once in a while and most of all please help us when we ask for it. It was a Sunday night and crowded but I somehow thought they could have done better. Sorry but we will have to pass in the future."], ["Erica D.", "Another restaurant that has overpriced pasta.  The salmon was awesome, so if anything get that!!! Their Margarita was great. Service was just ok. Went for ladies night on a friday and they forgot to put our reservation in. Luckily we did not have to wait but 5 minutes, compared to the 45 we were told."], ["James D.", "I have mixed feelings about Carabba's.  The service has always been good when I have been here, but the food is lackluster.Last night, we went there --- thinking Carabba's still offered a prix fixe menu (they had just stopped offering it) --- and I ordered something called the \"Johnny Plate,\" which included a sirloin steak, chicken marsala, and some sort of ravioli.  It was okay.  I ordered a glass of wine, the cheapest they sold, at it was good.I guess what bothers me about Carabba's is that it has a formulaic quality.  We enjoy ourselves much more at Amerigo."], ["Bruce M.", "if you don't like a crowd, prolly best to go on weeknights?  the food was good and the wait staff terrific."], ["cin f.", "Okay, I understand that Friday night is busy because of date nights.  We decided to call in advance because of that. The perky hostess put our names down and told us to show up at 8:30 pm.  We get there promptly at 8:30 pm and then are handed a beeper and told that it was going to be another 15 to 20 minutes. Okay, so if i am going to have to wait 45 minutes for the food, then it better be good.  I was sorely disappointed.  I was told by others that it was good.  Apparently, they told their friends because there was still a wait at 9 pm.  Sorry, i digress, back to the food.  The menu is extensive and they have daily specials also.  The more unusual items offered includes lamb chops with mint bourbon demi glaze and spiedino de mare (scallops and shrimp in italian breadcrumbs with lemon butter sauce).  They have wood fired pizzas also for about 10 bucks.  I chose on this night to try a special--veal and sage ravioli in a brown sage butter sauce.  As most entrees do here, it comes with a choice of soup or salad.  I chose an Italian salad.  It was sadly lacking.  It was devoid of any flavor except oil and the salt from the two olives.   There was no bite to the salad as far as flavor. The Caesar salad my fiance has was slightly better.  Again the Caesar dressing was on the thin side and had a hint of anchovy goodness.  I think if i go back that the soup would be a better option.  Honestly, the Olive Garden has better Italian salad.  As for the main entree, the veal ravioli special was favorful and almost too rich with the sage butter sauce.  My fiance had the linguine pescatore with mussels,shrimp, scallops in a marinara sauce  The menu said a spicy marinara.  I wouldn't say it was spicy.  It was just a simple tomato sauce, really spare maybe thinned out with a white white and some vinegar or lemon acid.   It has a bite but not a spicy one per se.   The complimentary bread was interesting.  it was a round crusted with lots of garlic. The crusty is slightly chewy and the inside was doughy and reminded me of a biscuit in texture.  It was okay.  If you are on a date and you eat the bread, you might want to grab some mints on your way out the door.  As for dessert, we didn't have room for any.  The tiramisu looked interesting as well as a butter cake with fruits.  The service was sufficient.  However, having now eaten there, i still don't understand why they have a wait because the food is overpriced and not that tasty."]], "Fratelli's In the Garden": [["Vim I.", "What a great place to have lunch when the weather is pretty! We sat on the patio which I wish was a little bigger. I had a delicious turkey sandwich and salad. The portions are very good. And there are plenty of options for such a small restaurant."], ["Kristina M.", "I thought this place was really cute. It was great that the botanic garden had a restaurant to eat in. I would have never thought it would be good. I was pleasantly surprised how great the panini's were. Me and my friend sat outside on the patio and enjoyed our lunch. It was definitely a great start to our day before exploring the garden."], ["David E.", "The group I was with planned an outing to the Memphis Botanic Gardens today and we decided to eat at Fratelli's for convenience sake. Well, that turned out to be a wonderful decision. I chose the Siena Chicken Panni with Potato Salad. Some in our group had Chicken Corden Bleu and other choices. Regardless, everyone enjoyed the dish they chose. My Siena Chicken was well seasoned and the fresh baked bread enhanced the taste of the sandwich. Each bite seemed to burst with flavor. Although some of the potatoes were crunchy, the dish itself was very good. Oh, and the Fratelli Tea with Raspberry and Peach flavoring was a compliment to the meal.There were so many intriguing choices that I was hard pressed - but extremely pleased - to choose the Siena Chicken Panni. In fact, I will likely go back again simply to try my other choices - Chicken Cordon Bleu, Cubana, Porcheria and more, including their fresh salads.The fact that they are also part of Project Green Fork was not only encouraging to see, but it also explained why the food was so fresh and delicious.Seriously, if you have not been to this \"hidden treasure\" of culinary delight you need to go and check them out. You might need to make a reservation due to the small seating availability, but they do offer outdoor seating with a view of the Rose Garden. Check it out - and enjoy your meal."], ["Joelle P.", "I've been visiting a lot of places that are the hangouts of the ladies who lunch lately...but there is an obvious reason they lunch here at Fratelli's In the Garden - it is lovely!!Located in the Memphis Botanic Gardens, this is an escape from the city. There are salads, paninis, cheese plates, sweet tea...recipe for the perfect southern lunch. And when the table of grandmothers pulled out their cards after lunch, I tried my best not to just stare. It was so cute!! There is a patio outside for pretty days overlooking the gardens and inside is right by the entrance of the building (great for people watching). Definitely take a walk in the gardens before or after your meal to get some fresh air. It is just so pretty and serene! Definitely a nice break from the hustle and bustle of city life...but still at the heart of the city!"], ["Zacnite F.", "Everything on the menu is delicious! Perfect place for lunch"], ["Jolynna M.", "The setting could not be lovelier and the food could not be better. Fratelli's is located just inside the lobby of the Memphis Botanical Gardens, against a backdrop of a peaceful water garden. I simply love the sandwiches here. My favorites are the Tuscan Chicken Panini (served hot with sun dried tomatoes and provolone with pesto mayonnaise) and the Balkan Focaccia (turkey, goat cheese and fig compot). But honestly, all the sandwiches are incredibly good. And all are served with your choice of pasta salad or potato salad. Fratelli's is just open for lunch, except for Wednesday and Thursday evenings when they offer a Tapas menu with items such as Seared salmon in pureed red pepper sauce, Meatballs in saffron sauce, mini greek salad and marinated crimini. A dessert selection is also offered as well as matching wines. Additionally, Fratelli's does catering. From small events to large, and picnic lunches for the Live in the Garden music venue in the summer."], ["Karla H.", "There wasn't anything I didn't like about this place.  All the food was excellent, the service was great, and the atmosphere is perfect for a Saturday afternoon.  I can't believe I've lived in Memphis for 4 years and no one has ever recommended this place to me!  The dishes were very filling but not too much.  I can't wait to go back here!"]], "Old Venice Pizza Company": [["Silvia Y.", "The pizza special was really good. I went with 8 other people and they all got sandwhiches with fries and whatsoever. Meh :-p it didnt look anything special lol."], ["Elle S.", "Their pizza is awesome. This review is based on the salmon I had here. Omg disgusting! My stomach feels weird. It is old frozen salmon. DO NOT GET THE SALMON HERE! Stick w their pizzas!!"], ["Katherine B.", "the food was great!!!!!!!! customer service so lovely!!! i built my own pasta with salad!"], ["Joel S.", "This was our second time to this place. Our first visit we got there at a decent time for dinner and shared some wine and flatbreads. The food is alright nothing to fan girl over. The wine is probably their most prized possession. They range from house wine which is only $5.00 to a $90.00 bottle. The best thing is that their house wine is 50% off on Wednesday nights. So we went last Wednesday and our service wasn't amazing. We got there at9 and they closed at 10:00 so we had a good hour to spend some quality time with each other. We had two glasses of wine each which only came out to like $16.00. The restaurant only had an hour left so I think the waiters were more focused on cleaning up the floors and tables than actually waiting on us. It seemed like we were being rushed out a little bit... I just expect a waiter to engage and have with you and really give that good quality service."], ["Keson N.", "My friend asked me where I want to go to eat for a quick bite before the movie for my birthday.. So I chose old Venice because it's close to where we work.. I was scared there will be a long wait so I was surprised when they seat us right away..  The service was awesome..  I ordered the lasagna and my friends ordered pasta.. Their foods came out first so the waitress said the manager took the lasagna of the check; which is really nice but really unnecessary because the lasagna came out literally like 2 minutes later.  The waitress was very sincere about me getting my foods later than my friends which made me feel really bad because I don't really mind. The foods and services were good as always.. I'm really glad I chose old Venice; made my rough day a lot better."], ["Christin Y.", "Old Venice  is one of my favorite places for girl's night in Memphis, especially on Wednesdays. You can't beat half price wine and pizza. Although, it's worth it to skip the 1/2 price one-topping deal and go for the Banscueccio specialty pizza. Cream cheese, jalapenos and chicken? To die for."], ["David D.", "What has happened to good customer service?  Our waiter didn't even speak to us. He spilled water on my phone. Reggie , standing at the omelette station proceeded to tell me he was just chillin and couldn't make one. Stay home. Not worth it."], ["Missy B.", "The deluxe pizza is to die for! Great ambiance and not loud to where you can't have a conversation. The bar area needs to be upgraded a bit, but not really a complaint. The pub tables in the area make it nice. Their happy hour half off drinks and personal pizzas is a steal! Love it!"], ["Tracy D.", "I was shocked to see the mediocre reviews of Old Venice. I love it there. The food is always consistently good. I ate there again tonight. The complimentary bread was fresh and wonderful. The service is great and the food is excellent. I like the pasta with lobster and crab. My daughter and husband love the fettuccini. They are usually busy, yet not so busy that I've ever had to wait for a table. And don't get me started on $5 wine bottle Saturday. That's a wonderful deal for great wine with dinner. And I can take the bottle home. Yummy!"], ["Vera G.", "I love this place. Every time I go, the service is attentive and the food is delicious. The daddy craw daddy pizza is amazing the godfather pasta is to die for. Daphne is the cutest bartender ever and makes delicious drinks, and the happy hour specials are awesome! Definitely an A+!!"], ["Joelle P.", "There is something to be said for location because that seems to be the only reason I ever come here.I'm constantly annoyed by how expensive the drinks are ($10 for a prosecco split?! Are you kidding me? Other places it is $5) and how uninteresting the food is. The fried cheese literally tastes like the ones you buy from the freezer section and so does everything else you order. Therefore, I hardly ever eat here...this is strictly a drinking spot for me and my friends even though they are \"known\" for their pizza. That being said, it is right by my house...you can get a high table by the bar 90% of the time...they stay open late all week...and one of my favorite bartenders works there. Therefore, they get 3 stars. I just wish I didn't want to scream every time I look at my bar tab. Definitely not a cheap drinking spot, but a safe bet."], ["Ashley H.", "Picture it:  Oxford, Mississippi, 2002. I was sitting in a quaint little Italian restaurant on the square, eating lasagna bolognese that rivals anything an old Italian lady would cook in her own kitchen, and enjoying some fresh baked rosemary bread with olive oil and herbs for dipping.  Seriously, the lasagna was the best Italian food I have ever put in my mouth. Sometimes I never even made it upstairs to the Burgundy Room. Back then, OVPC was a 5 star restaurant, without a doubt. Those were the good ole days. Unfortunately, it seems that when the additional locations opened, the quality of the food changed.  The lasagna definitely changed, and now the rosemary bread seems to be a thing of the past as well. If I had never had the original recipes, I might not be as disappointed every time I eat there. What do they have going for them?  They bring complimentary barely-leavened breadsticks to the table with the dipping oil. The new lasagna recipe is decent. The daddy crawdaddy pizza is still pretty good. They have a nice selection of unique pastas and sandwiches.  The crawfish soup is quite impressive.This place is still a good little lunch spot. Pizza and a salad, or sandwich and soup or salad, for less than $10, is hard to beat. The service is great, and they have a nice little patio. No, it's certainly not what it used to be, but hey, I'm a lot older, chubbier, and more wrinkled than I was back then. Who am I to judge??"], ["Jacquie G.", "So no bread offered at all which was a BIG disappointment for me, the service was slow, but there was only one girl working and she was manning all the tables, working the phones and being a hostess so that was understandable, but our food was cold and it just wasn't a great experience for us."], ["Kelly H.", "Loved the 1/2 price pizza & beer. Wish I lived closer and could make this a regular routine. Good service and beer selection. A weeknight treat for me"], ["David B.", "Eating here years ago, and then coming back recently in the last month or so, I've changed my mind on this place.1. Parking sucks, it's very dark in the back of the building, and if you drive a large vehicle, forget it.2. Music is just way too loud for a group of people at a large round table to have conversation while waiting on your meal.3. Service is questionable now. One person brings your drinks, someone else goes to refill, and you get the wrong drink.4. The pizza isn't as good anymore.  Their crusts are dry and overcooked, and the toppings are skimmed down so much it's not worth the cost.The overall feel of the place is not the same, and I used to recommend people try it out, but not anymore.  Marginally good pizza for an inflated price, and poor service, no thanks..."], ["Ashley P.", "What a great place!I visited Old Venice Pizza Company for the first time last week. 5 thing I love about this place...1. The location, East Memphis right off Perkins, it's convenient for many areas2. The Saturday wine special, $6.99 a bottle3. The decor/scenery. The bar is trendy and the dining area is cozy.4. The food. Everything I tried was amazing. The bread that comes with the meal, the flat bread appetizer, and the manicotti.5. The price. The food is all very reasonably priced, especially for the quality.Check it out, it's a great find."], ["Jen A.", "Not impressed.  The deluxe pizza tasted like a frozen or homemade pizza.  Nothing special.  The spinach dip was pretty good.  The very hot plate was placed in front of our small toddler.  (Bad bad bad). The salad I had was good but it would have been hard to mess up.  Waited for drinks to be refilled.  Asked for pepperoncini and the server did not know what that was.  We asked for a box for the left over pizza and got 2 for 2 small pieces of pizza.  When we finally got the check she didn't come to pick it up so we had to take it to a manager and didn't get a pen to sign and tip.   She came back oh sorry there was a lot of confusion....?.... Now the highchair situation!  This is a big one as I have 4 children.  The first chair the strap was broken the keeps the child from sliding out the front so we took it up and got a new one.  Instead of taking it out of circulation it was given to the next couple with a small under 1 child!  The chair we got had a broken buckle and had splits in The wood at the screws so it was structurally unsound in addition to having a broken buckle.  Both were dirty!"], ["Arpana W.", "I like going to Old Venice because it is: 1) Close to my home, 2)Has a patio and 3) has some good drink specials during the week.  The food is just OK, however.  If you're not getting a Pizza, you're pretty limited with the food selections.  I judge Italian food by the quality and taste of the Marinara sauce used.  If a restaurant can put out a tasty marinara, then you can be sure that most of the food will be good.  Unfortunately, OVPC doesn't have the best marinara.  I will say that they have some good salads and the new Flatbreads on their Appetizers list are gaining favor with me.  All in all a decent place with good atmosphere, just don't expect the most authentic Italian experience."], ["Ken G.", "Poor service and a manager that doesn't care. My wife and I ordered an appetizer, bread sticks, two salads, and a bowl of soup. The food was mixed, very good crawfish soup, so-so crawfish rolls,  mediocre cobb salad and decent walnut grove salad...but the bread sticks were doughy. I asked that he have them cooked longer. Over ten minutes later I called the waiter over and asked when we would get our breadsticks. He said the chef decided to just make us a new order and that it would be out soon. Nearly 15 minutes later I asked where the bread sticks were and he returned about two minutes later with them...slightly scorched and barely warm! By then we had finished eating and since my wife's cobb salad was less than appealing, she had boxed it up and was planning to eat the breadsticks to sustain her till we got home. Fat chance!  I asked him to send the manager over. When he arrived I explained the events and commented that the breadsticks (sitting there cold) were meant to accompany the meal, not arrive after it. He nodded and said I was right. He offered no apology, no compensatory breadsticks or desert to go, no commitment to counsel the staff (I didn't know if it was the waiter or the cooks fault, but now see it was the manager's fault...incompetence! I told him if this had been our first visit, it would have been our last. I was wrong, it was our LAST visit. Once management doesn't care about the customer, no one does....and as you can see by the yelp reviews, Old Venice has been on the decline for a while.Arrivederci Old Venice......."], ["Vim I.", "So I don't really get the bad reviews...I'm not saying Old Venice is authentic italian by any stretch of the imagination but it has a varitey of offerings. I'm a big fan of their pizzas...the individual pizza maybe too much for me to finish on my own in one sitting but it tastes great leftover. One I had recently was the Banscueccio--strange, unpronouncable name, but very tasty. It's a chicken pizza made with cream cheese and mozarrella so it's super creamy and they add red onions and jalapenos, with a swirl of tomato sauce--all those flavors together just work! They also have \"make your own\" option if you prefer to style a pizza yourself.  They have house wines on the list--and if they're running a special you can get a glass for just $3. Try to come during happy hour to make the most of it."]], "Andrew Michael Italian Kitchen": [], "High Point Pizza": [], "Dino's Grill": [], "Coletta's Italian Restaurant": [], "Movie & Pizza Company": [], "Little Italy Pizza": [["Daniel M.", "I'm a huge fan of Little Italys.  If it's your first time try the Sausage Stromboli. I've tried other things on the menu but keep coming back to the Stromboli for its green peppers and tasty sausage.  My only hesitation in giving 5 stars is that during lunch no one seems to understand that timely service is necessary during lunch hours.  I went on a lunch break and waited much longer than usual for the two staff to serve the entire place."], ["Katharyn B.", "One of the perks of being in the hospitality program at the University of Memphis is having a chef as a teacher. From her, we heard of several restaurants that she recommended. In one particular class, we decided to have a pizza day. At her recommendation we decided on Little Italy Pizza.The overall response from the class was that it was great pizza. For me, I was not a fan of the sauce. It was alright pizza - but I've had better. I wouldn't be opposed to trying Little Italy Pizza again if it was suggested while out with friends."], ["Craig R.", "Buonissimo!! I'm a pizza snob and this is the best pizza in Memphis! The crust is a nice thickness, the sauce is thin and delicious, and they have sfogliatelle (cool little pastry found in Naples)! Also, it appears they recently renovated nicely. Nothing fancy, just darn-good pizza."], ["Sofia M P.", "If you are in the area you should try it,  but if pizza is what you are looking for,  then there is competition out there for this place. Yes, it's good, but not outstanding.  There are other places my family and I enjoy more, but the location is good, the service was very good,  and looked clean."], ["Kevin D.", "This is by far the best pizza in Memphis. Greasy, cheesy, big, and wonderful. While the actual restaurant doesn't have much in the way of character, the food is amazing."], ["William M.", "Second time here. Even better than I remember. This place is at the top of my list of places to eat in Memphis."], ["Gloria L.", "I've had their calzone and told them to add pepperoni. Let me just say that Little Caesars has a better calzone than this place. Yes, I'll admit my shame just so I can explain to you all how bland and tiny that damn calzone was! I asked for a Tiramisu and they whipped out a store bought box and cut me a dry bland slice of grossness. I've had their tiramisu before when it came in little Bowles but this... This whole meal was an abomination of dry tiny blandness."], ["Perry M.", "I took the lead by some respected reviewers and tried this out on a day when I was jonesin' for pizza.Problem:  because Little Italy is miles from where I work or live, it's gonna cost me in gas money.  Need to find reasons to be in the neighborhood.  (Hmmmm, I do occasionally have to visit the MERI on Cleveland for work.)  Back to the review...This is New York pizza by the slice where you can fold it like a man!!  The inside of Little Italy reminds me of pizza places you find in NYC.  The booths reminded me of Ray's on Prince St. (which sadly closed forever on Oct. 30.)I had a slice with Italian sausage  It was just so right-on.  Crust perfect.  Cheese: correct amount and texture.  Sausage: as I remember it.Little Italy competes head-to-head with my other favorite outside-of-NY pizza place, Vinny Van Go-Gos in Savannah.Now looking for reasons to go back to try other offerings."], ["Tiffany S.", "This used to be a go-to once a week restaurant for me as a working Mom, but after the change in ownership, it has gone downhill, even after I tried three different visits to make sure my complaints were not isolated to a bad day.  The cheese pizza slices are now terribly greasy and require lots of blotting to be edible and the calzones (cheese or meatball) are now covered in a heavy layer of butter product that makes the meal terribly heavy, especially considering very little ricotta was used in the calzone, so the filling turned into one dense cheeseball.  The sauce is also now more oily and is blander. The new owners seem to be decreasing the quality of the ingredients and it got worse each time I came back recently. I even got food poisoning after one mushroom slice.  Not sure if I am coming back to try again. One more cheap, family-friendly place is gone in Midtown."], ["Erica B.", "I'm a Chicago gal, so trust me when I say I know pizza.  Little Italy is THE SHIT!  I wandered in here one night with the husband and after a good look at the menu and pizza case, we decided upon the Calzone (ricotta and mozzarella cheese) and the Chicken Stromboli Calzone (chicken, mushrooms, mozzarella cheese and sauce) and of course a cannoli to go. We had to wait for them to heat up everything, so we took a seat in one of their booths and watched as the magic happened.  It was a good 10 minutes before everything was ready, and we couldn't get it home fast enough.  Once we were able to start dining on these amazingly homemade creations, I about had a heart attack.  FINALLY!  Good pizza!  In Memphis!  I cannot even begin to describe to you the amazingness that resides in Little Italy's pizza creations.  The ricotta and mozzarella was warm and gooey and light all at the same time.  It was unbelievably delicious dipped into the marinara sauce.  The only thing better than the interior, was the crispy, fresh, crust.  Oh so freaking delicious.  The Chicken Stromboli was just as stellar.  Huge, juicy chunks of fresh chicken, mushrooms and mozzarella cheese.  Mmmmmm.  My mouth is seriously watering.  We were so disappointed that we didn't order a third calzone to split, that had they still been open, I am positive we would have made the 15 minute drive back to their store front.  Hey wait a minute!  What about that cannoli?  Oh. My. Cannoli. Heavens.  This is a gift, from the Italian Gods.  My husband hates cannoli, but I made him try it.  He looked up at me after his first bite and said, \"Is THIS what cannoli is supposed to taste like?!\"  Yes dear, yes it is.  So delicious, creamy and crunchy all at once.  There's even a hint of orange in the cream filling.  It was sweet, but then just when you thought it was going to be too sweet, it toned itself back down into the cheesy goodness.  Oh lordy was it amazing.Just to give you an idea of how great this place is, I have been back every day since this order.  Three days in a row of Little Italy pizza slices for lunch. And if the description of delicious foods doesn't get you through these doors, perhaps the price will.  A slice of stuffed pizza or a calzone and a soda will only cost you 6 bucks and some change.  Seriously amazing, and easy on the wallet. Please go here.  Frequently.  Make sure to let the guys behind the counter know what a good job they are doing.  They'll warm up to you at that point.  They absolutely love me now.  When I walk through the doors, I am greeted with \"HEeeeaya!  Hoooooo!  How you doing!\"  I heart that little piece of data."], ["Christian H.", "The first time I went here, I had only been living in Memphis for about 6 months. I grew up and went to college in the Northeast and I was complaining to a friend of mine that I couldn't find a good NY-style pizza here for the life of me. She took me to Memphis Pizza Cafe, and you're welcome to read my MPC review if you care to see how that turned out. It wasn't at all what I was looking for. She then suggested Little Italy. We went, but I wasn't getting my hopes up.When we walked in, I heard the owner calling out an order in a thick Brooklyn accent, and I let my hopes rise a little bit. I saw the big, foldable slices coming out of the oven, and I let them get up a little further. We ordered and I waited like a kid on Christmas Eve.When our order came out and I took my first bite, the heavens opened up and supermodel angels descended from the heavens on beams of light and lifted me skywards to a place of such beauty that to utter a single word that was spoken to me there would shatter the eardrums of any Earth-bound mortal. Jimi Hendrix was playing a harp, and Kurt Vonnegut said that he liked my poetry website. My grandfather was there, and he told me funny stories about my parents. There were puppies everywhere and they climbed all over me when I sat down. When I had finished my pizza, everyone gathered around and waved to me as the supermodel angels delicately returned me to my seat by the window, across from my friend. I waved back.Later that night, I asked my friend if she wanted to go on a proper date. She did. We kissed in her driveway afterwards, and we've been together for almost two years.Let's see any other pizza joint in Memphis do all that.Also, every time I go in there, the owner says, \"Hello, my friend! Large plain?\" and I love it. My girlfriend and I went the other day and I wasn't that hungry, so we just ordered a medium, but they brought us a large anyway. And, of course, I still ate most of it. Awesome place."], ["Sean M.", "I'm from NY. Pizza elsewhere usually tastes nothing like the real thing (the crust is all wrong, the cheese doesn't melt right--it's just not the same). But the pizza at Little Italy (in Memphis, of all places) somehow tastes exactly like NY pizza. And not like that awful glop at fake \"original\" pizzerias in Manhattan. This tastes like the pizza I bought by the slice at genuine neighborhood pizzerias, where locals eat.It's perfect pizza. And everyone I've recommended it to has thanked me. On top of that, the staff is great. One night, I ordered a pizza 20 minutes before close (I didn't realize it at the time). When I picked it up, the owner had closed out the credit card machine. I had no cash on me, so he said to bring the money by the next day! (Instead, I found a nearby ATM and tipped heavily for his kindness). The food is great, the prices are low, and the staff is friendly--Little Italy blows the competition out of the water."], ["Michelle W.", "My coworkers and I enjoyed lunch at Little Italy this week. I have only eaten there once before, as I always forget that it is there. I had two delicious slices of pizza. Being from New York, this is about as close as it gets to NYC pizza in Memphis. The prices are reasonable and the food comes out very quickly. I am glad Little Italy is back on my radar."], ["Keven Y.", "Great sub, decent prices. Want to try pizza in future."], ["Tanya T.", "Little Italy is the bomb-diggity- my second favorite pizza place in Memphis behind Garibaldi's. Some friends encouraged us to try the place a few months ago, and I can't believe that we have been missing out for so long. Probably the closest we might have here in Memphis to true NYC style pizza, Little Italy's pies consist of a delicious crispy crust, an excellent red sauce and fresh toppings of your choice. The crust totally makes this pizza. I like Garibaldi's sauce a tiny bit more so this is the only reason they still top my list over Little Italy. The place is really small, so we usually call in and order and my husband will pick up for us. Not sure if they have delivery, but it is definitely worth the drive."], ["Paul C.", "Tried it again, except this time I got pepperoni.  I still think the cheese and sauce need help, BUT the pepperoni was awesome!  Definitely more than made up for the taste deficiency in the rest of the ingredients.  Crust was still great.  I will definitely come back when I get a craving for decent NY style pizza, although I still think it's a bit steep that it's around 17.50 tax included for a large one topping."], ["Brendan G.", "Tried Little Italy last night for the first time. The food was excellent. As a NY native, I really know good pizza and the places that have \"actual pizza\" are far and few between anywhere in the South. Walking in, the place reminded me of the local pizzerias growing up in LI/Queens. I ordered a slice of meatballs and a calzone. Both were cooked and had excellent flavor. My only complaint about the meal was that they  used precooked meatballs and you could definitely taste that. However, they did not screw you on the amount they gave you. That was my only gripe and the only reason why I did not give them 5 stars. The staff was very friendly and I am going to be a frequent customer over there now. They have a carryout special on Mondays and Tuesdays, $10 for a LG Cheese Pizza or $12 LG 1 Topping"], ["Wesley K.", "The pizza here is really really good.  They do a great job!  It's delicious!The atmosphere is nice and the service is fine.  The only reason i give this 4 instead of 5 is the price.  The pizza is a little on the expensive side.  However, if you're willing to spend a tad more than normal, definitely do it here."], ["Brian C.", "Best in the city!  Family owned, the people are extremely friendly and make one hell of a pizza!  NY style pizza at its best!"], ["Libby M.", "We decided to forgo the usual chain pizza places and order from here. I wasn't sure if they deliver so we picked it up. It only took 15 minutes. I believe the owner gave us our order and was very nice. I loved how they packaged everything but the cannoli in one box instead of individual boxes. It cuts down on useless waste. Our food was great! My husband had the meatball stromboli and garlic knots. I had a slice of the veggie stuffed pizza. Also, we decided to splurge and order a cannoli for dessert. Of course this was my favorite part. Overall, we have found a new pizza place."]], "Capriccio Grill": [["Syd M.", "I decided to try this restaurant because of Downtown Dining Week 2015. I'm so pleased with my decision! I made reservations prior to my visit and when I arrived, I was seated promptly. Our server was very attentive and knowledgeable about the menu and wine list. The quality of the food was absolutely stellar! I had Minestrone for a starter, Lobster Ravioli for an entree, and a light cheesecake for dessert. The food was so delicious! The atmosphere was upscale yet not stuffy. All of the waitstaff was very professional and friendly. I will certainly return and I strongly encourage others to give this restaurant a try."], ["Katy W.", "Not to be snobbish, but the one star bad reviews based solely on the price of the items is pretty ridiculous. You're at the Peabody in one of the nicest hotels in Memphis; of corse you are going to pay a price premium. That being said, we did end up having a 50 dollar lunch (but we tipped 10 dollars because of the excellent service). Lunch: half a Reuben sand which with a salad and a cup of hot tea. The meat on the Reuben was very chewy and I couldn't cut my half sandwich in half without it going everywhere. They did pile it with meat and the bread was nice and toasty, served with lettuce, onion, tomato, and a pickle all on the side. The salad was actually an unlimited amount of trips through the salad bar. Salad bar: Incredibly clean and wonderfully fresh. Lots of veggies to choose from and a really amazing tuna salad. The salad bar was by far my favorite. Hot tea: The server brought out a tea basket of different assortments of flavors to choose from. Also came with a very cute bottle of honey. The hot tea was delicious!My lunch guest had the full ham and cheese sandwich plus a trip through the salad bar. His sand-which was big and came with fries. He very much enjoyed because it was all gone!! The service is what blew me away. They were wonderful and recommended dishes and asked about our day. Very prompt yet not too clingy. I gave them an extra star because of the above average service."], ["Shane S.", "The space is beautifully nestled in the famous Peabody Hotel. This is one of the places that I have been wanting to dine at for a while, but was never really motivated to go. Luckily, I was able to attend a Yelp Elite event to feed my curiosity. It was a five course buffet style menu that included salad, brisket with mashed potatoes, salmon croquettes, Fried green tomatoes and a great variety of \"finger\" desserts. Overall the food was good, but the main dish that really stood out was the brisket. The brisket was juicy, just fatty enough, and was not overpowered by a ton of sauce--paired with a delicious creamy mashed potato. Everything else was good, but not particularly special. The croquettes were good, but there wasn't much salmon or salmon flavor present. It was more like a really good hushpuppy. The dessert bar was a hit. The tiramisu was really good and I heard the carrot cake was amazing, but I missed it. This is a really nice restaurant and the staff was extremely friendly and professional. I say it is definitely worth a try and I would like to go back for the full dining experience."], ["Connie L.", "i sampled their lunch menu tonight at an event and was most pleased!  i will be visiting them very soon!!"], ["Martha C.", "Another disappointment in Memphis.  Our waitress was great but the food and wine selection was terrible.  It's a high rated steakhouse/italian restaurant but not in our opinion.  Not worth the $$$.  I won't go back."], ["Jerry C.", "Main restaurant within the Peabody.  Classic elegance. Of course you can't get away with spending less that $20 in a hotel of this type so if you understand that and can relax and enjoy it's quite nice.Came down for breakfast. The buffet is vast with a lot of choices but I wanted to be lazy so I orders the basic eggs and bacon from the menu.Service in this restaurant was as expected- pleasant, courteous and at a good pace.Wonderfully comfortable chairs.I hope they don't serve duck, that would be wrongI think I'll try dinner here tonight!"], ["Jacqui G.", "Always excellent service!! I have a great time and the staff is always personable the house salad is so tasty!!  and the crab cake is yummy!!!!"], ["Susan G.", "The best breakfast buffet I've ever had! Wonderful bacon, cheese grits, scrambled eggs! The most delicious biscuits and sausage gravy I've ever had! So so good!!! The pastries were incredible looking but I was too full! Excellent service."], ["Chris M.", "Good food, good service.  Perfect spot to sit and watch the ducks!!  If you're looking for some Memphis history, this is a great start."], ["Alan H.", "OK but nothing to write home about. Service was excellent ... Prompt and courteous. Food was average.  Convenient but there are plenty of other better choices."], ["Racquel C.", "Came here for breakfast and had the crab eggs Benedict. It was simply delicious.  Service was very personable."], ["Ashley S.", "My husband and I enjoyed 2 dinners here and the Sunday brunch recently. Service was consistent on all 3 occasions, with the exception of Saturday night. I believe it was due to a back up in the kitchen, but whatever the cause, the manager was quick to buy us a drink and some desserts for the longer than usual wait. Which was perfectly fine for a night with no kids!The Sunday brunch was amazing, the desserts were the superstars though. The pastry chef in-house really outdid herself. (See photo of the beauty) The breakfast portion was very tasty, and the lunch items looked just ok to me, but hubs enjoyed them all. If I had one suggestion to make things better, it would be to add chai to the hot tea selection that's available! Overall, excellent food and excellent service. We will definitely be back again and again!"], ["Matt R.", "Just average food at a very high price. Salad was simple, bread was cold, chicken cat was very oily.  Should have just went with one of the BBQ joints."], ["Sharon B.", "My husband surprised me for Valentine's, and scored us a table on Valentine's night! We had the special of the night, which consisted of a scrumptious Arugula, Beet, Goat Cheese , Raspberry and BlackBerry salad! The entrée consisted of a beautifully plated well done Filet Mignon, Large succulent Shrimp Kabob and delicious Mash Potato!  The Dessert was a decadent Raspberry Sorbet covered in dark chocolate with cute Heart shaped sugar cookies served in a Martini glass, along with an assortment of tiny desserts! Our waiter was very attentive as he apologized for the longer than normal wait due to all the hungry lovers in the house :) I would like to try their breakfast,  I here it is Great as well!"], ["Mike R.", "Outstanding Service!! Bobbie was excellent! The Scallops were cooked to perfection and the presentation was most pleasing. The Lobster Bisque was OK, lacked lobster, enough said. My wife had a fried Calamari and Shrimp, it was excellent as well. We were pleased.Ask for Bobbie to take care of you, she made the difference."], ["Christina R.", "Although the food was great, the wait was unbearably long, it took 2 hours to get our apps and another hour for our meal, the wait staff were great and really seemed concerned and apologized but we would not go back simply because the meal in total took about 4 hours. Really not worth the incredibly slow service."], ["Alan L.", "Great dinner here tonight. I had the Salmon and my wife had the Mahi special. They were both awesome. We shared the oyster appetizer and it was excellent as well. The kids enjoyed their meals as well. Service was top notch. Friendly and attentive. It was worth every penny. Five stars all the way."], ["Joedinho M.", "To this day, the best steak I have ever had, was the bone-in ribeye at the Capriccio Grill.Go Tigers!"], ["teena y.", "We tried this place bc the Rendezvous was completely packed, however, we were quite disappointed. The filet mignon was just average. I actually didn't finish my food and I was starving. The asparagus was drenched in butter and we didn't finish it (and there was only 5 or 6 pieces) The kids pizza was good, but then again we were all hungry and it came out first.  I'd rather try a different restaurant. Service was ok but the hostess was very nice."], ["Lynn M.", "Nice service. Friendly. Nice buffet for breakfast. The French toast off the menu is AMAZING! It's done with challah bread. Drizzled with a cinnamon syrup that is like cinnamon roll. Pretty good for hotel guests."], ["Chris H.", "I had dinner here this evening and had 8 oz filet with a side of 3 cheese risotto and it was spectacular. Steak cooked to perfection.  Service by Josh was spot-on and his recommendation for cabernet was delicious (a Memphis in May choice.) Honestly, I wouldn't have changed one thing. Excellent. Y'all need to try this place!Yes, it's a bit pricey, but you most definitely get what you pay for. Dinner was effortless and exceeded expectations. Yum!"], ["Ryan S.", "Great value and great food it's has all most everything you could want. But it's Sundays only. The Service is top notch. If they don't have something just ask they might be able to help. They did for us."], ["Kathleen M.", "Inside of a hotel which I adored was a restaurant that was just okay.  I thought it would be fabulous, I had such high hopes.We had dinner here after a full day of sight seeing, trampling around and walking off legs off.  It sounded terrific to just take the elevator down and have a great dinner.  We should have reved up and gone for a little walk because this was a pricey let down.  I had the lamb chops as I just adore lamb.  I ordered them medium rare and they came medium well with a bit of mint jelly.  Yes, mint jelly was considered really innovative back in the '60's when adding cream of chicken soup was also exciting and new.  I know there are better chefs out there who can perk up your kitchen!  The asparagus was also so pedestrian.  I finished with a chocolate shooter and I did like that concept.  For the money, I expected way more.  Yes, you have a captive audience with the hotel but why not reach their level of achievement instead of just recycling culinary ideas from Jr. High Home Ec?On our last morning we had breakfast and my omelet was very very good but the service was even spottier and more awkward than the night before.  I don't get how a hotel which was basically perfect has a restaurant that is so underwhelming.  Hey hotel management, lend the restaurant side a hand, they need some help on ramping this up to match your standards."], ["Clifford S.", "We had dinner here our last night in Memphis and breakfast here the last morning.  Too bad these were out last meals.I had the prime rib for dinner and it had the most bizarre kind of gravy sauce that ruined the meat completely.  For sides I had the asparagus because my wife ordered it and made me eat some, and the mac and lobster which was very good.  For dessert I had the strawberry shooter which was very good.  The service was a bit erratic but the main problem was the sauce on the prime rib.Our breakfast was included and was basically buffet which was OK but the omlet was outstanding.  Again, really erratic service, no explanation of what we could order and what to get from the buffet.Too bad that such a great hotel has such a mediocre restaurant."], ["Nancy K.", "I went here for Sunday Brunch with my fiance to celebrate our engagement. The service was friendly and the food was delicious. We enjoyed the prime rib, made-to-order omelets, waffles with strawberries and cream, smoked salmon, and dessert section (added a picture of my desserts before they got gobbled up).It's rather pricey but I'd love to go again to celebrate something special"], ["Ioana C.", "Overpriced for the quality of food (i.e. the food was not cooked to specifications). You can do better by trying the local cuisine!"], ["Sandra P.", "Located inside the Peabody Hotel its a good place for lunch meetings. Very quiet but that could mean that its not very busy? The portions were good sized and the service was attentive. I had the chopped salad with side of grilled chicken - the salad was better than the grilled chicken.  I had started with the gumbo bowl and that was much better.  It was pricey for the meal but the location was good as I mentioned above for a meeting over lunch."], ["Susannah H.", "The food here is excellent but the atmosphere isn't so much . I was pondering 3 stars because the atmosphere is a bit off for me. Remodeling could fix that ! Having such great food, being in a great hotel, you'd think the atmosphere was cozier . It has a family style restaurant feel. blah.The chefs salad dressing was fabulous ! So much so, that I called the next day to see if i could get some hints to make it myself :-) Scallops were cooked perfectly and so was the filet.  Overall really great food ! Remodel and  I will be back !!"], ["Olivia F.", "My first visit was during this years Downtown Dining Week. Like MacArthur, I will return. Food wonderful. Service professional. I went with 5 other people and the service was spot-on."], ["Julie J.", "The staff seemed really nice but not too prepared for us as we had our 17 month old daughter with us. We were placed at a booth which was set up very nicely with all the glasses you could possibly want for wine and water, along with plate for 4 people. We finally had to ask them to remove some of the extra glasses so our daughter wouldn't break anything. She's not that bad but one wrong move and we would have been covered with broken glass as the whole table was covered with place settings.  They brought us a high chair like you would expect to have at home but of course our daughter didn't want to sit in it as it was so much higher than we were. She did get colors which was great as this helped entertain her for a short time but in the end she was on our laps which was the main reason we were shocked they never removed any extra place settings.My husband ordered a bottle of wine which he said was the best part of his meal. I have to say mine was the bread they brought at first, which really wasn't that special.Our FOOD:A variety of breads are served with soft butter while you look at the menu.  Breads were ok. The sourdough had a nice strong flavor. I saw others had what looked like olives in their breads when we were leaving but sadly we didn't get a sample of that one. My daughter loved the crispy bread sticks.LOBSTER SHRIMP BISQUE...my husband said the bisque tasted burnt.  They brought the bowl out wiht the lobster and shrimp in the middle and used a gravy bowl to bring the bisque part and poured it in front of him. He said it would have been better to not do that due to the small portion of lobster in the middle of the bowl.TAGLIOLINI PESCATORE...my husband wasn't impressed but our daughter loved to check out the mussel shells.Shrimp, Crab,Clams, Mussels, Calamari, Sweet Pepper, Capers, Olives, Tomato in Wine, Lemon Butter Sauce$27CHICKEN PARMESAN--Chicken was very salty, huge chunks of tomatoes in pasta (I guess they were going for the rustic look)  About 1/2 inch of sauce between chicken and cheese....very bland tasting besides the saltiness.  I had my husband try it and he wasn't impressed. Of course my 17 month old loved the bland pasta. Over all it so was not worth the $27 and I have no reason to ever try this place again if their basic marinara sauce was so bland.Marinara Sauce and Mozzarella over Spaghetti  Pomodoro$27I would not recommend this place to anyone and speaking to a friend she has eaten at one in a different city and said she wasn't impressed either."], ["Jenna H.", "I came to Capriccio as I was staying at the Peabody for work. I arrived on a late flight and was starving when I checked in. I was so happy that they were open when I got there, and was welcomed with a warm greeting. I found the staff to all be friendly and on top of things. I loved my meal. I received a bread and cracker basket to start and had the chicken marsala for dinner. I would come back here for dinner again if I am ever staying at the Peabody again."], ["Tanya T.", "You know what I like about this place? The desserts. Sure, the brunch is good and I've been known to enjoy lunch there a few times. But the desserts are the reason I keep coming back. Cheesecake, chocolate mousse, and the like in a shooter glass? Awesomeness. These yummy confections come in the perfect size- just enough to keep you wanting more!Capriccio is a steakhouse, but I've never tried one. Maybe I should change that now."], ["David A.", "A quick breakfast at the Peabody before my 7 plus hour drive to Dallas did not disappoint. I had the vegetarian eggs benedict. Eggs were perfectly cooked. Tasty dish even though I skipped the sauce. Had to have a side of cheese grits for the Southern experience and they were great."], ["Adrienne R.", "I just finished having brunch here and I'm stunned by the stark contrast between the rave review my coworker gave this place and my actual experience. The food was good, but the place looks like a Holiday Inn and the service was nonexistent. The unlimited mimosas that are included in the brunch price are the size of a shot glass, literally, and you have to ask the server to come back to the table to refresh your drinks, clear your plates, and bring your bill.  The manager came by and spoke with us because she could tell we looked far less than pleased, and all she said was that she would talk to the server. For $50 we got the equivalent of a breakfast that we could've gotten down the street for $12 and the unlimited mimosas that were brought to our table probably added up to the volume of one wine glass. This was supposed to be my last great brunch before I move away from Memphis next week. Such a disappointment."], ["David B.", "One of my dining mates wanted to go to a 'fine' restaurant in Memphis. I'm not sure what made him select this place. It wasn't bad, really, but for a 'fine' dining experience, it wasn't that unusual or good.I had lamb chops; nicely grilled but one of the three was almost raw. The asparagus that cam with it was nice but a little too much butter. My dining mates had pizza and pasta. They seemed to like it.They have a decent wine list with an okay selection of wines by the glass. The surroundings are pleasant but nothing out of the ordinary.All in all, not a place I would go out of the way for, but if you are at the Peabody and don't want to head out too far, and don't want soul food or barbecue, this is the place for you."], ["Shawn H.", "I am only rating the Sunday brunch and cannot comment on the rest of the menu. The Sunday brunch is fantastic.  It is without a doubt the most extensive and most memorable Sunday brunch I've ever had.  Extensive meat, seafood, egg, pastry, and dessert options spread around the parameter of the large dining hall on the top floor.  Excellent service as well.  This is not one of those overpriced brunches with only a few items hidden behind a make shift omelet station in an attempt to impress you.  It's worth having at least once."], ["phyllis s.", "Salas was seeped in dressing.    Scallops 2 were tasteless.  Oslo bucco was tasteless.  48.00 ala carte.  Expensive and not good"], ["Timothy L.", "Great lunch menu, atmosphere, and service. The food wasn't overly exquisite, but it was filling and deserves an \"A.\""], ["Cedahlia S.", "I love this place!!! I've been going there for years and if you're looking for a nice place to relax, this is the place. It's very comfortable (try a window seat, Memphis people are very interesting) and the mussels are just wonderful. I've tried most of the menu and I have been satisfied with just about everything that they serve."], ["Jason K.", "Ugh, what do you get when you cross mediocre food, inattentive service, and exorbitant prices? An annoyed customer who won't be coming back! We had an 8pm show to catch on a Saturday night so we ate at 5pm. The staff knew we had to catch the show because we were doing their pre-show park/eat special. We only had TWO courses and we still almost missed the show! How does this happen in a half-empty dining room? Our waitress even had a \"helper\" she was training! Well, it took us 20 minutes to get our check after we asked for it...most of the wait staff was just standing around joking with each other. This might have been OK if the food were anything other than hopelessly mediocre, but it wasn't. A lobster bisque had decent flavor with nary a piece of lobster but would not have filled an espresso cup. So-called jumbo lump crab cakes was all filler with nary a lump of crab to be seen, and a Ceasar salad was full of limp, old chopped romaine straight out of a bag. My NY strip was prepared at the proper doneness (medium rare) but was inexplicably dry, gristly, and poorly marbled. An alleged Cioppino was perpetrated by the restaurant on my wife...its seafood (at least that's what we thought they once were) were akin to little blobs of dessicant, they were so overdone. By this time, we just wanted to leave to get to our show...but NO! They had to leave us twisting for 20 minutes! Wow, now I have absolutely no interest in trying out Chez Phillipe!"]], "Strano! Sicilian Kitchen & Bar": [["Dan Z.", "The Good: Salmon was wild caught by the chef/owner and delicious. Good wine selection. The Bad: It was all really good. I would say the cost of the salmon compared to the sea bass was a bit high; I opted for the Salmon and it was great! The Rest: I dinned with a party of five; the meals and service were exceptional. Chef runs a busy kitchen but is focused on guest satisfaction. We will be back and I anticipate this place will stand the test of time."], ["Julia W.", "My first dining experience at Strano was a lunch to remember. After pondering over good restaurants in Memphis for lunch, at last minute, as I was searching through places in Cooper Young, I came upon this little gem. I had seen it earlier by walking around and remembered the menu sparked an interest. So I thought, why not give it a try?I had in company my lovely mom who agreed to dine with me wherever of my choosing. When I told her I decided on Strano, she was definitely open to a new restaurant experience as well. However it was a sweltering saturday which left the restaurant dead empty except one other party of two, but that did not drive us away.Now onto the restaurant itself.We were greeted to what I assumed was  ust a person to show us to our table, but ended up to be our waiter for the day. He approached us with a smile but didn't quite warm up to us yet that is until we asked for lemon water. When he came back out with a dish of lemons, my mom commented on how big they were which happened to break the ice with him which then he seemed to be much more comfortable and discussed how they had just got them in and that they were too, the biggest lemons he'd seen. After I ordered a fennel salad with grilled shrimp, and my mom, the margarita pizza, he presented us a warm basket of complimentary bread and an infused olive oil with a variety of herbs and spices. Once we unfolded the napkin from the bread basket, I could already tell this was going to be great bread. I was right. It had the most wonderful charred, but not burnt crust to the outside and a soft hearty texture to the inside. When you dipped a piece of bread in the olive oil, this made the perfect moment when it just melts in your mouth. I have named this the best complimentary bread in town. Three pieces of bread later, (with no regrets) our food came out. My salad was very clean and organized looking, while my mom's pizza looked great, although a slight bigger than advertised as a \"personal pizza\" in both our opinions. The salad was so refreshing but a factor of choosing this salad was that it was presumed with more toppings and most I could see besides the shrimp was just oranges and onions. I would have appreciated more dates but I took what I got. Besides that, the shrimp were grilled to perfection and when you got a bite of everything, it was a taste sensation! My mom seemed to enjoy her pizza quite a bit although commenting on the portions a few times. The mozzarella tasted so fresh and we were notified by our waiter that both the tomato sauce and the pizza crust are homemade which was quite impressive. Overall it was a great meal, and we thought we had ended on a great meal...That is before he came out with the dessert menu!I honestly couldn't resist, there was a wide selection but after going back and forth on the vanilla gelato and the lemon sorbet, I fell for the lemon sorbet as a perfect ending to a hot day and a nice experience. When he came back, it was a beautiful presentation of the clean sorbet topped with chopped mint and an artistic rose shaved from the rind of a lemon all in a shell of frozen lemon skin itself. My, it was the most perfect blend of both tart and sweet and accompanied by the mint was a great addition. I just might have taken home the frozen rose too! He even offered to give us a cup of it to go! Since we had more than half of the pizza left, he got it boxed up for us, and we left. I must admit, I enjoyed the entire rest of the pizza that night and it was even Strano standards after being re-heated in the oven! I can't wait to go back for more! Bravo Strano!"], ["Greg H.", "When Strano's first opened, Wifey and I were in the door early. As an American who grew up in Italy, I rated the quality and authenticity of their food very high. To boot, Chef Josh and his staff are amazing.Then, I start to see a few lame reviews and I'm like, \"WTF?\" What do these people know about Italian? I kept questioning myself, \"Have I lived in BBQ Land so long that I've lost my taste buds?\"So tonight, I brought my friend Eddie from NYC to Strano's. Eddie's about as New York Italian as they get. He's a seasoned global traveler, his parents are both from the old country, and to top it off, his father, uncle and brother were all \"made men\" in the Genovese crime family. No joke! Think they've had a few good Italian meals? (shout out to the LGBT community...his old man owned the famous Stonewall Inn)How does Eddie rate Strano's? Outstanding! Ten stars! Yeah, for great authentic Italian in Memphis...it's Strano's. Anything less than a five star review? Fuhgeddaboudit!!"], ["Bailey P.", "Last night left me extremely disappointed. I don't often pay $18 for a pasta dish, but when I do I expect it to be nearly perfect. Mine was far from it. It was bland, in extreme need of seasoning. The mushrooms were undercooked. It will be a long time before I return."], ["Jennifer S.", "I bought a groupon for this place and had been wanting to give it a try for a while since it opened.  We went on a Sunday evening and as we walked in I couldn't help but notice the decor was simple but very pleasing.  For an appetizer we got Grandma's meatballs and they hit the spot.  For my entree I ordered the Rack of Lamb.  It was ok, but I have had better. For dessert I ordered the Italian cheesecake with berry sauce with oatmeal sprinkled on top of it.  That was very delicious. Overall, I think the entrees are a little overpriced for the quality, but the food was decent. Service was good and they take reservations which is also nice. I do think this is a wonderful addition to the cooper-young area and it is nice to now have an Italian option there."], ["Emily R.", "The Sunday Brunch is terrific. They offer design your own omelettes. I love to choose an array of ingredients. My omelette was perfectly cooked and seasoned beautifully. The menus has an array of unique options. The cappuccino is delicious. The bottomless mimosas are a bonus. The server is attentive and knowledgeable and friendly. The atmosphere is warm and inviting and old world. I have a new favorite brunch spot. The prices are very reasonable."], ["Deanna W.", "They were featured on Local Memphis Live on Friday, so I figured I'd give them a try for my dad's birthday dinner! I don't quite know how I feel. Our waitress was an absolute doll, but I definitely wasn't wowed by the overall experience. My mom and I both got the salmon. It's was delicious, but I'm not sure it was 30 dollars worth of delicious. Here's another biggie. The smoke. I'm not sure if something was going on in the kitchen, but I about gauged my eyes out. I noticed the smoke from the get-go, but it wasn't until the last 20 minutes that my eyes really started to burn. I would love to explore their menu a little more, but that smoke was a big drawback. I'm all about positivity, so I will brag a little more on the waitress. Not only was she very on top of our table, but she even gave us a scrumptious desert on the house for my dad's birthday! The food and complimentary bread was yummy, just not sure it was a good bang for the buck. I did, however, love the option of making a reservation on this app. Super easy and quick!"], ["Amanda M.", "Ugh, my first experience here was so goood!! But, alas, I returned and it was lackluster at best. We went back for happy hour, which is a great, affordable way to try their fun cocktails. However, the drink I ordered the first time tasted totally different than the last time. This also happened the last time I was there (first tasted different than the second), so I say with confidence the cocktails are a mixed bag...always good, but ordering the same drink doesn't mean it's going to taste the same.Food!: The ravioli - delish - always. It changes daily but we got it both times and yummm! We got the half order for an app. I ordered the branzino because the person at the adjacent table ordered it last time and it looked beautiful, and it was highly recommended by the server. It was full of bones - one that stabbed me quite heartily in my mouth, so I gave up half way and just ate the sides - risotto and asparagus were good. The skin wasn't crispy, the fish was alright...I just didn't get it. We also ordered the chicken parmesan ($17) but the waiter made a face when my date ordered it and said it was plain and \"meh.\" He then recommended either the tenderloin ($28) or the steak - it felt he was pushing for a tip... The chicken parmesan was good. The chicken was huge!! But I wasn't a fan of the spaghetti with it. I dunno, if I pay $75 for a meal plus tip, I just want a bit more. First time was good, second was a flop. Take your chances folks..."], ["Caroline V.", "When the food came out, we basically went for ten minutes without speaking -- because we were busy inhaling it!  Everything was really good.  The salmon was especially well-cooked, and the chef did something magical with the fried okra and scalloped potatoes served with my friend's (massive) pork chop.  Our plate of ravioli also disappeared -- the tomato sauce was very tangy, with large chunks of tomato in it.  All in all, what we ordered was not inexpensive -- but it was very tasty!  I would come back the next time I have a hankering for Italian!"], ["Shane S.", "We finally made it to this place because we were running out of new places to eat on our date night.The staff was friendly and our server was very nice and was good at suggestions; however, the service was very slow. We waited about 12 minutes just to get our caprese salad and there was another ridiculously long wait for our entree. The salad was fine and my shrimp scampi was a bit on the bland side, although the shrimp were perfectly cooked and seemed to be as fresh as one can expect here in Memphis. We were there on a Friday at prime time and it may have been half full. It was a nice atmosphere, but nothing gave us the urge to want to go back."], ["Randy C.", "We've been wanting to try Strano! for some time now and we finally made our way there on a beautiful Saturday night.We were taking some friends out for dinner so we made reservations earlier in the week. We were greeted and seated promptly and were excited to find out we made it just in time before Happy Hour ended! We started off with a nice bottle of wine, cocktails and a couple of appetizers. Grandma's Spinach Pie was wonderful and not at all what I expected.I ordered the Daily Cut which was a Ribeye this particular evening. It was sliced very thin and it worried me that it wouldn't be that good but the very first bite changed my mind quickly. It was served with grilled asparagus and mashed potatoes that were fantastic as well.My Wife had the Shrimp Scampi and she really enjoyed it.  Our friends had the Chicken Parmesan and the Wood Grilled Yellow Fin Tuna and they're still talking about how much they enjoyed it two weeks later.I love the atmosphere and the entire staff was incredible. Our friend left her coat behind and they called us just a few minutes after we left to let us know. Who does that?! Pretty nice of them to go above and beyond like that!"], ["Michael S.", "I went here for lunch. I was the only patron for most of my visit so the service was excellent. The server was friendly and we had a bit of conversation. I had the shrimp scampi with spaghetti. The food was good. It could've been great. I'm just not sure what was missing but the shrimp tasted a bit bland. I fully intend to return and I will update if I find the taste different. The main problem with this location is the lack of parking space. I was able to park on the street but the parking lot is down at the corner of Meda and Young. Parking is a problem with the whole Cooper-Young area though so I don't hold it against these folks. The host was very hospitable and nice. The place was clean and nicely prepared to serve customers. Wait time was minimal and the food was good as already noted."], ["Matt F.", "Great fish specials and try the ravioli stuffed with braised short ribs and a veal demi glacé. We felt we were in Taormina, Sicilia."], ["Joelle P.", "@stranoskitchen is a very cute place!I know, I know, this location is \"cursed\"...my dad even had a failed restaurant in this exact spot over 20 years ago. But I do believe this spunky new chef is going to give that ole curse a run for its money. For starters, I love what they have done with the decor - very warm and inviting. The exposed brick on the back wall is gorgeous. And the staff was so welcoming. The host chatted with me about Tunica while he showed us to our table and our waiter was a doll face who managed to put up with all 4 girls for 3 1/2 hours...and 3 bottles of wine. Just the fact that we didn't get kicked out was a shocker...kidding...kinda. But I do love a place that joins in on the fun instead of rolling their eyes at us. The chef/owner even came out to say hello and gave us frozen honey on a stick...we wanted seconds!I really enjoyed my food (especially the pasta) as did everyone at the table. Memphis needs a good Italian joint and this place does just the trick. Cooper-Young also needed a breath of fresh air...and this is certainly it! This may just be our new go-to girls night location...I promise we'll try to behave!"], ["Kontji A.", "I really hope this restaurant works.  I love this location!Mama's Meatballs are divine.  Everyone I've eaten with at this restaurant raved about the food.The chef is compelling.  Ask him to tell you about the family origins behind the restaurant concept.  Hint: Think Tony Soprano.  Fun!#Yelp901"], ["Jessica E.", "We came here after a disappointing meal downtown for a couple drinks. The bartender, Tara, wasn't familiar with a drink I requested, so instead of refusing me, she looked up how to make it and it was delicious! Every drink we had here tonight was phenomenal and the service was outstanding. Josh, the owner, is a great conversationalist and made us feel welcome in this neighborhood restaurant. We will definitely be back!"], ["Daniel B.", "I have no idea how rancid meat ever leaves a kitchen. I have even less of a clue how it then makes it to a customer's table. It smells, noticeably, like death, and the idea that you would present this to a patron is beyond me. Yet, on 9/24/2015 just such a thing happened. My girlfriend ordered the lamb and we immediately, before the plate was placed on the table, noticed. The waitress was apologetic, and my girlfriend's meal was comped. I just don't know how this even made it to our nostrils. It's such an obvious odor that it tells me you're trying to put one over on us and possibly make us sick. If you aren't selling enough lamb to keep it from spoiling, take it off the menu."], ["Stephanie N.", "Our Femfessionals group met here and Chef Josh Steiner prepared a several course price fix nosh that kept us tasting their menu throughout our time there.  Everything was so very fresh and very tasty including the presentation.  I'm a photographer and made everyone wait to try each dish while I shot it all!  Hehe.   If Italian is your thing it's Definitely worth dining there!  I've heard nothing but good things."], ["Happie H.", "My meal was delicious and genius. Really fun place to have Italian food. Started out with the meatball appetizer and fried olive and cheese appetizer. Both were delicious with really good portions. It was more than enough for two of us to eat with our cocktails.Our cocktails were fantastic. They were both served in an amazing ice sphere that id seen from their social media online. Both cocktails were great tasting and not too sweet. Definitely a really fun part of the experience since the creative tricks and presentation are part of Stranos unique charm. I ordered the Salmon special. It came out perfectly cooked: hot- perfect crisp on the outside and really tender inside. It came with a side tower of kale and risotto. Delicious. I would order it again.Dessert was a chocolate cheesecake with roasted marshmallows on top. It came out of the kitchen still roasting, and it tasted amazing. All of the flavors of a campfire on a plate, with strawberry garnish and some great sauces. Would definitely recommend ordering this.The service was fantastic, and I'm excited to come back."], ["Don C.", "We had lunch - I had tomato basil soup which seemed freshly made and was good - but at $8.00 I think most of you will think it was pricey.  Dyann had a panini and she really liked it - service was good and the place was clean.  We will be back."], ["Clark P.", "I'm so happy that this little corner of Cooper/Young is FINALLY is occupied by an excellent restaurant.  I enjoyed Cortona but only because I love lasagna; not much else ever appealed to me.  Something about this location has always been the corner from hell.  Nothing last here.  I don't know why (well I do, the food always sucks) but why the sucky places always occupy this place has to be more than coincidental.Strano! was an excellent surprise.  We made a reservation with family and wanted to try the new restaurant.  I had the Chicken Parmesan and the other 4 at the table had varying, non identical dishes.  Everyone was pleased and the price was reasonable.  While leaving I ran into a group of my friends, their report the next day was that all 7 of them were extremely satisfied with the food as well.My main complaint about this location has always been the acoustics. I don't know if the food heightened my sense of hearing but I swear the acoustics weren't as abysmal as previously. Good italian in Cooper/Young about time."], ["Kevin S.", "Loved the atmosphere and amazing food. Arancini rice balls and spinach pie soooo good. Came here with a big group and everything came out on time and perfect."], ["Brittney H.", "We had dinner here tonight. I wouldn't give it five stars just because several things irritated me. We waited awhile for drinks and being waited on. Our waitress was super sweet, but I feel like it may have been the bars problem. Unfortunately, we were headed to the movies after and we totally didn't make it to the movie because they were super slow. The food out shined the service, though. It DID need salt.. But everything we had was very fresh and delicious. I had the salmon special and my husband had the sea bass and loved it. I highly suggest the butternut squash soup & order the saffron appetizer. Great little place for a decent meal!"], ["Brian R.", "My girlfriend and myself came to Strano for a early dinner.  Neither of us has ever eaten here before and wanted to try something new.  As we first entered the restaurant, we were greeted by the manager promptly and taken to a table.  Even walking to our table, we could smell the amazing odor protruding from the kitchen!          Once we were seated, we were greeted by our server Ryan, who suggested a few cocktails for myself and several wines for my girl.  The atmosphere was very relaxing and comfortable.  We picked several items off the menu and told our server to pick for us.  Probably our best decision of the night.  We had the veggie cream soup, bruchetta, and pork tenderloin sous vied style.  Fantastic food!  As our night concluded, we ordered deserts that hit the spot perfectly.            My only regret is that we did not get the rack of lambs, but we will definitely return here to eat again."], ["Adam P.", "We have eaten at Strano! twice now and had wonderful experiences.  The food is delicious and service was very good.  Try the fried olives...SO GOOD!"], ["Marlin M.", "I don't know how the pizza is actually dining in, but I'm writing a review based on the slices sold during Cooper Young Festival. The slices were $5 for cheese and $6 for pepperoni or veggie, which is slightly steep but it's street food in this setting so it's sort of expected. I got a veggie slice, my wife got a pepperoni slice and we got our son a cheese slice. The cheese slice barely had any cheese on it, the pepperoni slice had dried and congealed cheese on it and the veggie slice was very soggy with chunks of artichoke heart weighing it down, and all the slices were cold.The size and style of the slice is like a New York slice, so you expect it to be foldable but still maintain its ability to stay intact. When I folded my slice, the bottom of it tore and flopped to the side, spilling artichoke hearts and olives off of the pizza. The crust was soggy, cold and flavorless. I hope this was just an off day for them and not a true representation of how their pizza normally is, because if so then this place will close like the 4 or 5 other places in its spot that have closed over the past 10 years.I would have given it a 2-star if the price of individual slices were a little bit lower."], ["Phil M.", "Amazing Italian fare. The quality is like no other. Homemade sauce and pasta makes the taste so authentic. The wine selection is huge, and the menu options are a good spread. Service was great. The server we had was very knowledgeable and helpful with the menu and explaining the specials and daily offerings."], ["Adriane W.", "Go to this restaurant. Just go.Here's why. The people who work there are delightful. From the moment I walked in, it was clear they were happy to see me. It was like I had been invited, and they were thrilled I accepted.Our server Kevin was patient, present just enough, and had a nice sense of humor.My friend ordered the rosemary chicken; I had the pork shank. Our entire meal conversation was peppered with exclamations about our food. She was particularly pleased with the brussel sprouts. I want a vat of those potatoes.And the desserts...many, many yeses.We made mental lists of what we have to order when we go back. Caramel gelato is at the top of my dessert list.Next meal? Rack of lamb maybe, but I may need to repeat the pork shank.Go to this restaurant."], ["Jim C.", "Great fine dining in Cooper-Young! My date and I had a marvelous time. The Service was wonderful. Our waiter was professional and very helpful. The wine list was long with a great selection but a bit pricy. The food was cook perfectly and was incredibly flavorful. I would recommend this to anyone looking for a romantic dinner."], ["Veronica J.", "We have been twice now and have received great customer service even with a large party. Brunch was FABULOUS! We had one of their breakfast pizzas and the steak Benedict which was delicious. Also, can't complain about bottomless mimosas thank you so much for such a great time!"], ["Danny H.", "This place has a great location and a wonderful outdoor seating bar. We went the day it was built and had a great time sitting on the patio listening to the live Music on Wednesday night in the circle. Being new from Memphis, this was a great find for us. I didn't try too much of the food, but the service was great. We also met the owner and he was very nice."], ["Shaina G.", "Strano is my new favorite Italian restaurant! Not only was the ambiance and decor lovely, but the service was impeccable and the chef even graced us with his presence to give us frozen honey on a stick! The food was delicious! I recommend the Sicilian salad to start (the dressing comes out frozen and melts in front of your eyes!) the angel hair pasta for an entree, and prosecco to drink! Outside we heard live music on Wednesday night! It was a truly amazing GNO and I cannot wait to take my man on a date here!"], ["S K.", "Polite and nice server, uncooked food, charged for items not provided, slow service, agreed to provide credit/gift card for mistakes that was never done, left at valet waiting in rain for 10 minutes while our car was left unlocked on young avenue during the whole dinner time.Never experienced a restaurant before where so many things went wrong. We placed an order to go and had a drink and appetizers while waiting. Some food items were actually good (ie bread & olive oil in the beginning). The arancini were ok, the salad also. Stay away from the grilled calamari, big disappointment, it was raw and inedible and was returned. The pizzas were average. The restaurant charged us for items we thought were in the order to-go, but they were not when we got home. We contacted the merchant who offered to provide credit/gift certificates, but the credit/gift certificate was never processed."], ["John Z.", "Appetizers: tried  Fried olivesWood grilled calimari. Both were phenomenal.   The calimari was the best calimari I've had in Memphis.Entrees tried:Pork shankSwordfishEggplant somethingDuck confitOf these the pork was by far the best.  the swordfish and eggplant were also absolutely great.   The duck was... ok.  Not bad but not as good.  Service was friendly and attentive.  Overall a great experience"], ["Mary Mac J.", "We had a great dinner at Strano! Service was very prompt, informative and attentive. The food was so indulgent and out of this world! We had the meat and cheese plate, which had a splendid variety of delicious cheese that paired beautifully with the salty, smoky, savory meats. The carrot soup was good, but I definitely had to pass it around to others at the table after a few bites because it was so creamy. Then I had chicken parm (I know...I'm boring) and it was cooked to perfection with the perfect amount of sauce and cheese. No part of the crust was soggy. My girlfriend's mushroom ravioli was spectacular and pleasantly rich, and I don't even like mushrooms! The red wine the server recommended and decanted at our table was totally on point. Will go again!"], ["J C.", "I have been here twice and as it just so happens it was two days in a row. Once alone and once with a group and both times for lunch. I had the spaghetti and the chicken parmesan. Both were excellent but the chicken parmesan was a little spicy for me. The service was perfect and I'm hoping it wasn't because there were so few people in the restaurant. This place is new and deserves a shot, especially for lunch."], ["Arthur K.", "1)  No evidence of anything Sicilian going on in the kitchen (or the decor)  2) second class ingredients made for an inedible bread/crostini offering (jarred garlic, even when baked, is awful) and the tuna was the frozen-and-gassed at sea, suspiciously pink and near flavor-free variety  3) grilled calamari was the cheaper version, ribbons only (the trunks have most of the flavor), obviously previously frozen.The portions were huge -- often a bad augur -- and my wife's plate was remarkably ugly, with a mishmash of non-Italian vegetables (a murky potato mash and -- what?? -- some corn on the cob) served with the gigantic cheap tuna.  We said on arrival that we were on a schedule to make an 8PM play in OSquare, duly noted by the pourer and the server, then forgotten as we overshot by 15 minutes (not, itself, a problem because we can go another night) but typical of the casual lack of professionalism so obvious in this Italian pretender."], ["Amanda H.", "I wanted to REALLY like this place but it's just okay. The food is good, but nothing to get excited about. My favorite part was their bread and olive oil (which they get locally from The Mighty Olive). They did mention that they have their own herb garden and grow what they can themselves, and get everything else locally. The service was good, and they do offer local beer.I really hope they do well in this space (considering the history). I just don't think an upscale italian restaurant is a good fit, as seen in previous closed attempts."], ["SouthernFoodie M.", "If I could give this place 3.5 I would. Nice atmosphere and totally nice hostess. For some reason we were shown to the corner table... Super dark and hard to get to the back seat. We asked for another table. Calamari as an app was good, but small portion. Fried olives sounded amazing but there were like 4 olives ... And the batter was off half of the 4. Quality kitchen control. We had wine fur the table and the waiter never filled out glasses!!! For the expensive price point I expected wine to be refilled, and higher quality food."], ["J.W. E.", "Heard great things about this place so tried it tonight, and I can only assume from reviewing the images on Yelp from last year, that it may have been good when it opened, but at a minimum the chef has changed. Ordered bacon wrapped tenderloin, and it had an overwhelming taste of badly smoked bacon, but was otherwise a decent piece of meat. The potatoes were WAY peppery, the asparagus was so-so. My guests had the same pasta dish, which had decent flavor, but the angel hair was so overcooked it crumbled in my mouth when I tried it, eww! We went out on a limb and ordered dessert- what a DISAPPOINTMENT- the cannoli was barely OK and the tiramisu and the chocolate cake were Sara Lee out of the freezer:( When the server came to check on us, and saw the desserts barely touched, he asked how they were, I said they were terrible, tasted like Sara Lee, he said he was disappointed to hear that, offered to clear the plates, then asked how we wanted the check, when I said we would split between 3 cards, he had the ticket ready and left it for us...no offer to comp even one of the desserts. Apparently my subconscious was listening, and I accidentally shorted his tip...he actually came out after us to question the tip and asked if he did something to piss us off...ballsy! I did feel bad, and was glad he asked us so that we could correct it, but WOW. Wine list is pathetic, martini with housemade Limoncello was not great, their Limoncello was the culprit, it was more like sour mix, emphasis on the tart. I will never come back here again, which is sad, because I really wanted to like it."]], "ECCO on Overton Park": [], "Hog & Hominy": [["Leslie S.", "In case you are not aware, lunch menu is different than dinner menu. Lunch menu is geared towards more pizza and sandwiches. Some breakfast item also present. Beer and alcohol seems to be the same though. $5 mimosa for Sunday. Food is good and tasty. They were cooked well. It is not super extra ordinary in taste for me. Good food but not one you have to revisit because it is so good. Oh price is about medium. $10 to $20 for most things, with few below $10."], ["Ken R.", "Hog and Hominy serves a hybrid of Italian and Southern dishes, specializing in pizza and small plates. In my opinion, the restaurant is a combination of a classic pizzeria like Aldo's Pizza Pies and a Southern eatery (McEwen's comes to mind). Hog & Hominy has a unique menu that demonstrates the creativity of the owners, such as beef heart with Vidalia kimchee, and biscuit gnocchi, something that sounds wacky (as in Foghorn Leghorn meeting the Mario Brothers) but is probably very good. In venturing into the menu, I got the Buffalo Pork Tails, which is an offshoot of traditional buffalo wings. Compared to them, the nuggets of pig tail are just as savory as wings from places like Kelvin's Hot Wings (which moved to Millington, news that should have been issued through its Twitter account). The sauce has a nice balance of peppery spices and vinegar for a moderately spicy taste that is very good. The pig tail is garnished with shreds of celery leaves and fried pig ears that has the same texture and taste of bacon. It seems like the guys at Hog and Hominy have some \"black\" in them when it comes to making the most out of what they have. Now before you accuse me of playing the dreaded \"race card,\" what I'm saying is that Hog and Hominy are adhering to the \"Soul Food\" tradition of using unconventional pieces of meat (as in scraps similar to what African-American slaves ate) to make dishes that are not only palatable, but delicious. It's this kind of creativity that separates Hog and Hominy from most restaurants and will probably be the foundation for its long-term success.After having the Buffalo Pork Tails, I moved on to the main course, the pizza. I didn't know what I wanted, even after reading reviews on Foursquare and Urbanspoon (it folded into Zomato, which isn't blogger-friendly). I was at a loss on what to order even though most recommended The Red Eye. In a leap of faith, I settled on The Prewitt because it had something that I never had before, boudin sausage. Generally, most boudin consists of pork (I know what you're thinking, \"duh\") but beyond that, other ingredients depend on where you get it. Assuming that the sausage was made in-house (or at Porcellino's, Andrew and Michael's butcher shop that's adjacent to the restaurant) with locally sourced ingredients, my guess is that the boudin has pork liver, rice and pork heart stuffed in it. Boudin in the United States (especially in Louisiana) has that combination along with seasoning for added flavor. Bottom line, the boudin (along with the Fortina cheese) stood out in the brick oven-cooked pizza that I enjoyed every bite of. The pizza also has scrambled eggs on it, but the boudin was so good that I barely noticed anything else on the pizza. Overall, The Prewitt is an outstanding pizza that I want to have again.After having a well-rounded meal at Hog and Hominy, I left with a great impression of the place. Given what I had, I'm confident in saying that the restaurant is excellent and I recommend it to anyone looking for an awesome culinary experience. The menu is creative and utilizes locally sourced meats and vegetables to provide high quality meals to its customers. To go along with the food, the restaurant has an extensive alcohol menu for those who enjoy their libations. That includes a beer selection that excludes domestics like Bud Light and Pabst Blue Ribbon in favor of premium craft brews (I started off with an Abita Andygator that gave me a really nice buzz). Overall, Hog and Hominy is an awesome restaurant and if you haven't been there yet, you are missing out. Go there!To read the entire review, including my thoughts about Hog and Hominy's delicious collard greens, go to kensfoodfind.com/2015/05…"], ["Craig W.", "This place... These guys... sheesh, they just keep getting better and more on point. I discovered that they had a \"late night menu\" offering the other day. I believe it is Friday and Saturday from 10-12. I knew I had to try it... and by try it, I mean a buddy and I went and ordered 3 items each. The burger, let's start there. This is as tasty of a burger as I have gotten. It isn't fancy. It is just greasy and cheesy and delicious. The fries are cooked to perfection. Next I had the ramen. Ramen is one of those dishes that I don't like to know everything in it until I have eaten it all. The flavours are so intoxicating. The textures are perfect. Fried rice was cooked well. The pizzas were delicious. and the drinks were top notch. The waitstaff is always attentive and polite. They know how to take care of tablesI believe that Andrew and Michael are the hottest thing in restaurants in Memphis right now. I hope this trend continues. Cheers!"], ["Candice L.", "Memphis is known for its barbecue (tons of delicious options)....BUT when you are ready for a break and want something different, GO TO HOG & HOMINY.  Just go.....IT. IS. DELICIOUS."], ["Rob K.", "This is a bizarre restaurant whose name does little to explain its fare. It's primarily a gourmet pizzeria, really, with some smaller appetizer/tapas-esque dishes to round things out. The pizzas are fine. They're more akin to the east coast thin-crust variety than the Chicagoan deep-dish type, although the crust is a little more chewy and bread-like than you'd find anywhere in the NY tristate area. We ordered the most peculiar-looking pizza we could identify and were pleasantly surprised by the combination of flavors. It's also clear that they cook these pizzas fairly quickly and at high heat, so you should go in expecting a little ash.We also had crab legs, which were swimming in butter and quite tasty.Dessert came as a peanut butter pie, which tasted like it came from a box, and some vanilla gelato which tasted like slightly melted ice cream.So nothing was really offensive other than the total price, which was gratuitously expensive for the quality of the meal.If the bartender could get his own review, however, he'd get a five. The man was a cyclone of activity, single handedly keeping the bar together (and seeming to organize his server colleagues as well) while taking our food orders and dispensing polite advice."], ["Cris W.", "A tad pricey, but you will leave here with a great case of happy-mouth. Also, service was great. One of the few places I have given five stars.We went for lunch and had the Calabrese (region of Italy) sausage as well as the 'Shroom pizza.The sausage was served atop a slab of sweet cornbread with layers of collard greens and black-eyed peas, then garnished with pickled red onion slivers.The pizza was great as was, however, I think I'd request extra mushrooms and sauce next time just to jack it up a notch.We almost ordered the Poutine as an appetizer, but figured it'd be a bit much for lunch. We were right. The next table did and the portion was huge. They also commented that it was delicious.We will return and want to try the burger (with pickled lettuce) and shrimp & grits."], ["Jim G.", "Friendly and very nice atmosphere.  Great local bear selection.  Started off with poutine  - LOVED!!! Gnocci and salad were also quite good.  A little full by the time the pizza got to us but very good - margherita.  Overall, fair pricing, very good environment and food.  Definitely going to return the next time in Memphis."], ["Courtney C.", "This is a good place to grab a meal with varied options. Their menu changes pretty frequently but they are consistently creative with all of the items. Visiting with a group of co-workers we started with a round of drinks (which actually took longer than it should have IMO) and then ordered a handful of apps, plates to share and a pizza. - snow crab claws x2- meatballs- hotdog/brat- pizza- pig tail- heirloom tomatoesWe were all happy when we finished up. The place is a little warm and can get pretty busy so either make reservations or bring your patience. Overall we are happy with our meals we've had and will continue coming back!"], ["Drew A.", "There's food and then there's Hog and Hominy.I go to this restaurant, not to just eat but to expand my palette of flavors. Had you brought me here when I was a kid, I'd have turned my nose up. Poutine? Oh it's got that AMAZING pork neckbone meat and gravy along with chili oil and cheese curds over freshly cut fries. Beer selection? Outstanding for such a small establishment. They have mainly Wiseacre on draft (as of 4/13) and a lot of bottled beer. Other food? I've had the John T Edge burger which, I'm not even joking, was a religious experience and now I'm considered a disciple. The Vito pizza is excellent and their crust is perfect. It has a great char with a near perfect chew. Bottom line: You must try this place as it's putting Memphis on the culinary map of the USA. It's Southern meets Italian meets the World. You NEED to go there NOW! What are you waiting for??"], ["Amy W.", "My favorite restaurant in Memphis. We were here for brunch and dinner. Pro: - Shrimp & grits was my favorite dish- Friendly servicesCon:- you should make your own Bloody Mary mix"], ["Jamie R.", "Hog & Hominy is a unique restaurant; it offers a diverse menu that changes often. On my visit, my friend and I had the Poutine, Red Eye pizza, oysters, and shrimp. The menu items aren't expensive, but it's assumed that guests will order multiple items and share them. However, you could have a pizza serve as a personal entree, and they're reasonably priced at $10-$12. H&H also has a great cocktail and drink menu; I had the Woodford Reserve on the rocks.In all, H&H has a great menu, and a great atmosphere. I can't ask for much more!"], ["Ash M.", "DELICIOUS & CREATIVE!!! Must try the pizzas & the leeks (omg, best thing I've eaten all year!)Super cute decor, friendly & efficient service, kinda \"hipster-farm-to-table\".....and if our table hadn't been the only non-White table in the restaurant, I would have thought we were transported back to a cool new restaurant in SF :) Only complaint is the parking situation"], ["Jacob R.", "It's difficult to find new things to say about such an up-&-coming locale as Hog & Hominy but I'll speak my piece. H&M is not for everyone...sure. Some individuals are not fans of tapas & the small plate method. My older brother was in town & didn't know what anything on the menu meant while the rest of us were smitten by the new seasonal changes. My recommendation is to mix it up. Get a few small plates, then a few pizzas, & then a few more small plates (depending on the size of your group of course).Our favorites include:Thunderbird & RedEye pizzasThe Brussel SproutsPoutineMeatballsPeanut butter pieHot brown if you're there for lunch!"], ["Riccardo S.", "After coming here 3 times for the Awesome pizza, I finally tried the Putine.  It was amazing.  Nice atmosphere with view of the cooks.  Good drinks and obviously great food.  They are doing it right.  Only down side is the price... a bit much for some of their pizzas and especially drinks."], ["Gary D.", "Had the John T. Burger and fries.  Both were excellent.  I had to negotiate to get a fried egg on the burger as the waitress said that the chef did not like to compromise his creation.  So, I had to get the egg on the side - on a separate plate - and had to put it on myself.  Geeze Louise - but it was worth it."], ["Laura H.", "A local recommended we start with the sweetbread, and wow, am I glad we did. Definitely one of the highlights of the meal. With a peanut and jalapeno-cilantro flavoring, it tasted like spicy chicken tenders. Also had the brussels sprouts (good but a little heavy on the bacon chili jam, which ironically, was what drew me to them) and octopus, which was chewy and not the best I have ever had (try City House in Nashville - Chef Tandy Wilson knows how to prepare octopus). However, the star of the night was the Inchio pizza with squid ink skordalia and sausage. This was my first time trying anything with squid ink, and I found the flavor to be rich and complimentary with the other flavors in the pizza. Reservations are highly recommended, as it's a small but warm and intimate space. We also had great, friendly service, and this is a place I'd return on another trip to the area."], ["Jay B.", "We sought out Hog & Hominy while visiting Memphis after hearing they had one of the top 10 rated burgers in the US presently - although the restaurant has a focus on wood fired oven pizzas. While I would have liked to try the burger, the server indicated that the kitchen wouldn't modify the burger to suit my dietary needs (something I've never had problems with at any other restaurant or burger place previously). The explanation was that it was an award winning burger and so it wouldn't be modified. What a load of outrageously arrogant bs. Last time I checked, I was the customer and the service of food in a restaurant is supposed to be about my satisfaction - not gratifying the chef's ego. Had I not been traveling with family I probably would have gone to another establishment - there are plenty to choose from nearby to Hog & Hominy. This issue aside, two in our party did get to try the burger and they did enjoy it. (They didn't, however, think it was the best burger they'd ever had.) The desserts really did steal the show - plapple crumble (a combination of plum and apple) and Carol's Delightful Smile (a chocolate mouse pie with Oreo crust topped with whopper pieces). They were outstanding! Based on food quality, taste, presentation, service and ambiance alone (setting aside the arrogant one-size-fits all approach of the kitchen in respect of the burger) I would be rating the restaurant as 4 stars. But obviously my rating has to reflect the entirety of the experience."], ["Renetria D.", "New menu new pizzas The Thunderbird 40 twice is delish.. Yummy pepperoni drizzled with honey it's divine... I always forgot to take a picture... They still have my beloved Shrooms. They also carry Wiseacres best brews I had some double IPA I can't recall the name but it was good strong."], ["Neek C.", "I wish I can give this place a 4.5 but a 4 will do. This place is amazing. Started with the poutine and it was the best poutine I have ever had. The neckbone gravy makes this poutine so wonderful. I want to drink it. LOL! That's how good it was. Then I had the legend known as the John T Edge Burger. Greatness. That's all I got to say. Overall, great food and service. However, the drink prices...yikes. Wish I can give this place a 4.5. We need a .5 system, Yelp."], ["Kyle W.", "Apparently, my taste buds are malfunctioning as I seem to be in the minority in terms of my opinion on this place. You can't play dinner roulette in Memphis without someone mentioning Hog and Hominy and everyone exploding with glittery and glowing comments about how great the food is. While the food is enjoyable, I just don't feel like I've ever had a meal here that would make me feel like a terrible Memphian if i didn't continuously shout that experience from the rooftops. The inside of the restaurant looks like Tom Sawyer just tricked the whole gang into whitewashing the the place. Everything is white and glass and covered in mass-produced corporate ornamentation of what people think \"fancy\" Southerners display in their homes. It seriously looks like Pier One threw up in here. It's also fairly small inside with enough room  for a handful of tables and only a few spots at the bar. It is cool, though,  to be able to look into the pizza baking area and the kitchen and see the chefs throwing together some unique dishes. To be fair, I've never had a bad meal at Hog and Hominy. I've had several of the dishes, and all of them have been tasty, if somewhat....underwhelming. The food isn't underwhelming because it's not good and (executed to perfection), but just because of the unrelenting hype you hear about this place. I do enjoy the fact that they have a significant cocktail menu and a rotating seasonal menu. The menu, the staff, and the restaurant all deserve most of the accolades they are receiving and I am glad that people love the place. I hope to watch the restaurant continue to get bigger and better and cant wait to see it on another list for one of the Best Restaurants in the South."]], "Spaghetti Warehouse": [], "Garibaldi's Pizza": [], "Amerigo Italian Restaurant": [], "Spindini": [["Paula W.", "I have heard over and over again how awesome Spindini's was so we finally made it there this weekend for a belated anniversary dinner.  Was so excited however so disappointed in the food.  The bartender was very nice however no \"white grape or sour apple martini\" mix so I settled for strawberry.  It was ok but too sweet.  He did try!Ordered the manicotti, way too much cheese melted on top, noodles did not seemed cooked, very 'watery\", meet only tasted like beef, no italian sausage.  I'm so mad at myself for not letting them and swapping it for something else.  Husband's pizza was just ok, thick crust and too much cheese.Not sure we will be back.  ;-(  So disappointed."], ["Erica B.", "I'm giving Spindini 2 stars for their brunch- and only for their brunch.  I will be back in the future to try their dinner options, as I can only hope that brunch is not their strong point.  Since we moved here everyone has been telling us, \"You've GOT to go to Spindini's brunch!  It is AMAZING!\"  So we went.  Cannot for the life of me figure out the hype behind this one. The brunch is described as a Sunday Jazz Brunch.  It says \"Enjoy the music of the incredibly talented pianist, Jon Felix.\"  It would have been nice to know this music would be enjoyed via CD.  I'm sorry but, in this gal's book, you cannot call your brunch a \"Jazz\" brunch if you are simply piping a CD of some performer through your loud speakers.  Onto the food.  We arrived at noon- the brunch starts at 11- and everything on the \"hot side\" of the buffet was luke warm at best.  I cannot imagine how irate my husband would have been had we gotten there any later, as that food had to have been downright cold.  At $12 bucks a head, that ain't okay.  The fruit salad was good, as was the bacon.  The only stand out item was the pasta with red sauce and sausage. It was the clear winner and makes me want to return for dinner options in the future. They serve up a lobster hash, which actually has huge chunks of fresh lobster and potatoes with various veggies sauteed into the mixture as well.  The potatoes were mealy and the lobster was rubbery.  It was a shame because this dish seemed as if it had been  prepared for one single person, it would have been delicious.  For the masses?  Not so much.  That is the problem with Spindini's Jazz Brunch.  They do not have the capability of serving a buffet.  There is no line of hot lights, there are only large, tin, mess-hall looking trays floating in hot water with tea lights underneath.  It seriously ruins the food.There are some ala carte options on the brunch menu, they will make them as you order.  Which is the way I suggest you go if you decide to partake in this brunch.  We were sorely disappointed in this place.  It was a Holiday Inn buffet, and the price was too high for what they were cooking up.  The service was great, our waiter was wonderful, attentive and friendly.  I will definitely be back to try the dinner menu.  There has to be something I missed given the rave reviews I've heard of Spindini."], ["Shauna M.", "I came here with a larger sized group on a Friday for a friend's birthday.  The place was pretty empty for a Friday after 7:30, but the inside is nice.  Our server was friendly, but we had to ask if there were specials, and that's when he told us the off the menu items.  We also had to ask for more silverware and plates, he'd leave quickly when some of us wanted drink refills and we had some dirty wine glasses.  I had the eggplant rollatini, which our server recommended.  When I was eating I thought this tastes good, but its still.  I wanted something lighter and it was breaded and fried, which it did not say on the menu and every other place I've had this dish it was baked with no breading.  I think the filling and the sauce were lacking on herbs (though I find myself saying this every place I go to since moving to Memphis).  Most of the group had pizza, especially the lobster one which they raved about the flavor combination of the chipotle sauce and lobster being unexpected, but good. Overall I would go back and maybe next time I'll try the lobster pizza."], ["Greg G.", "Stylish, hip style decor. People watching is great. I've been here a lot and I've watched the restaurant through ups and downs ever since its been open.This is a pretty recent acquisition for the Preston Lamm collection of establishments. While sitting at the bar, here is what I observed.Why is the Head/Executive Chef wandering around the front of the house. Then I see him expediting pizza?Good pizza that are so thin that they seem like flatbreads. Well executed. Far better than the quasi Southern Italian of the previous proprietor. Good bar staff. Why is the chef constantly \"on display\" while good, consistent, well executed food flows from the kitchen? Is it \"Good Italian\" - nope. Spindini wouldn't last a week in Chicago or NYC. Best in Memphis? Nope, that's Andrew Michael.I ordered a Caprese sa lad. Decent mozzarella, hard as nails tomatoes (early in the season, but really no excuse). Gigantic basil leaves (come on! Have you EVER heard of chiffonade? Its easy, looks elegant & doesn't overwhelm your palate and the other flavors. This is pretty damn basic).It's nice to have your own farm (and they do have one in Holly Springs, MS) but you can buy perfect heirloom tomatoes at the Memphis Farmers Market (two blocks away) that your customers would rave over for $5/lb retail (which is a ton compared to what they would pay wholesale) OR you can serve hard, unready tomatoes from ground you own in N Mississippi. Hummmm.Pizzas are consistently good. The Lobster Pizza is outstanding.The menu is good, not great. Does anyone really care about \"My Grandmothers Salad\"? Screw the \"Kissed By The Flame\" stuff on the menu. The oven is heated by burning natural wood. I like it. But it's not unique. It's been done in Peoria, IL for 25+ years for goodness sakes!I also tried something that is pretty scary outside of big time Italian restaurants in my experience...\"Parmesan Risotto\".Is it great? No. Reasonable? Absolutely! Worth $6 as a side? Yepper. It's wonderful just to get a pretty damn good risotto on Memphis.I keep comparing Italian cooking here in Memphis to the big times in NYC & Chicago- & that is not fair. Memphis, as much as I love it, doesn't understand big time Italian food. Love the bar, the staff is outstanding. Nice place to hang.That's all that's needed."], ["Paul K.", "Decor was nice inside, and the restaurant was actually pretty crowded for Memphis standards. Service was kinda slow though, when we were ready to pay the waiter walked by several times and ignored us. As for the food- pretty average, caesar salad was good but nothing exceptional, the veal piccata was pretty subpar- they must have had 100 capers on the thing, so it tasted way briny. Some of the other's food looked better, but I'm in no hurry to go back here."], ["A L.", "Food blows"], ["Frank M.", "We had a great experience!  I'd say it's our favorite Italian Restaurant in Memphis now that Bruno's is closed.  We got the Italian butter appetizer and it was beyond good.   I had the stuffed Manacotti which was mighty tasty and my wife said she enjoyed her salmon dish.  Our server has very helpful and proactive in making sure our stay was most enjoyable.  All of his suggestions were winners.  The manager dropped to see how things were going and even delivered our desert.  Very friendly.  As a disclaimer, my wife mandated that I mention that the restaurant was virtually empty (went late on a sunday night) which might explain the five star service.  Bottom line, ya'll should give it a whirl.  Oh, also wanted to add that, when crowded, the resaurant is probably pretty loud.  No boths and you'll be sitting pretty close to your neighbor.  Maybe not a great place for a romantic date... unless you go when it's empty... PEACE!"], ["Jolynna M.", "A sophisticated crowd, fantastic food and a chic atmosphere.  Go on a weekend night and sit at the bar or one of the bistro tables near the front for some great people watching.  Be sure and try the Tuscan Butter - a marscapone and goat cheese fondue with foccacia bread.  Oh my my.  What a super-excellent calorie splurge.  And it goes nicely with their house white wine,\"Caldora Pecorino\"."], ["Dana T.", "I am surprised there are not more reviews on Spindini, but then again, you never know in Memphis.Had a great trip to St. Jude Children's Hospital and CRAVED the lobster pizza (how some reviewers cannot crave this pizza is beyond me!).The chef is a local with Italian roots. The atmosphere is hip, dimly lit, modern yet comfortable. Have had decent service at the table and great service at the bar counter. There is a nice seating lounge at the front of this restaurant perfect for gathering with friends and a beautiful patio that I would love to visit in the summer or early fall.The wines by the glass leave something to be desired. No Orvieto, Soave etc but quite a few Pinot Grigios. The bartenders were more then willing to hunt down anything different that wasn't printed on the list though. Very thoughtful.My sea bass was excellent! A tad too much citrus flair on it but I enjoyed the whole plate! Portions are generous. The lasagne comes out in a casserole bubbling with delight as well. The beef carpaccio is very tender. I recommend it as a starter."], ["Catherine H.", "So, I've been going to Spindini since Judd first opened it. I've never had bad food there. However, the service this evening was horrendous! Jamie was our server, and at first I just thought that he wasn't the best (very limited knowledge of wine) but I thought that he was competent. However, my salad did not arrive with my parents. This would have been no biggie had he come to check on us, but he had not come by nor had my salad arrived by the time they were almost done. We flagged someone else down and they took care of it. However, when Jamie came back to clear their plates (he inexplicably did not take mine) he offered no excuse or apologies. He then began to cop an attitude, telling us that all we had to do was call for him...um, I've waited tables before and I'm pretty sure that it was my job to check on the tables not for them to yell out my name at a restaurant! The food was great; however, our server once again copped an attitude when we didn't buy into his \"upsale\" for dessert or coffee...he proceeded to tell us that it was in his job description. My parents and I are both exceedingly polite and forgiving or wait staff. I waited tables for years as did my sister; my parents know proper protocol and have heard every nightmare table story in the book. This type of service is never forgivable, but it is at least understandable if the place is packed or someone is covering multiple sections-not the case. In my book when I screw up, I apologize and make it right. I certainly don't cop an attitude with the table I've screwed up because they asked for what they ordered. On a complete side note, if it is Spindini's policy to instruct waiters to upsell desserts and coffee at the end of the meal, they should stop. This is the type of thing that I expect at Chili's, not a nice independent restaurant. Offer a dessert menu, if declined ask if the table is ready for a check. I am an adult...I will let you know if I want another glass of wine, dessert, or coffee."], ["marcus r.", "I read the the reviews.  Took everything into consideration, and decided to go. Every thing started great. We arrived an hour early to sit at the bar and have a cocktail and an appetizer. Kasey had the Spindini Martini, and highly recommends it. It's their twist on a pomegranate martini. Being a man of simple tastes, I had a Blantons, neat. The pour was shallow, hardly acceptable for $12. We also sampled the house sangria they have sitting on the bar. The red was palatable, Kasey loved the white. A little sweet for me, but far better than the red. We ordered the chicken pesto pizza. By far the highlight of the meal. We should have stopped there. We moved to a table and ordered dinner. The wedge salad was like everyone elses. Nothing special. The tomatoes and mozzarella could have been better for a place that claims to use their own organically grown vegetables. The vinaigrette is only salad oil and red wine vinegar. The server was slow and hardly attentive. We saw her when she  took the order, when she brought the food, and when she brought the check. The chicken parmesan was thin and very dry. Served atop overcooked angelhair. The halibut was dry, and the spinach, while plentiful, was overcooked. I don't know why the menu lists sides without the prices, most of the entrees do not come with a side. The mashed potatoes were old and the risotto was mushy. The server and the manager must have sensed all was not well, because at the end of the meal he brought the check over and expressed he sensed they dropped the ball. He comped the entire meal, except the halibut. I should mention that our reservation was at ten and they close at eleven for what its worth. Btw...they didn't even offer us dessert! That was a blessing. Read the reviews on The Cheesecake Corner."], ["Colette E.", "Great food with an elegant atmosphere.  Although the yelp description said it was not kid friendly, we took ours anyway and to our delight they had paper tablecloths that kids drew on all night.  The boys split pizza and my husband and I had wine, scallops, spinach salad, and pork chops - all delicious.  Our waiter was really nice too."], ["Rocky K.", "OK maybe I'm a smug mo' from San Francisco (we're spoiled in the food department over here), but I really don't understand what was so special about this place.Yeah the food was fine, but shit it was overpriced. I guess Italian food isn't the Memphis' strong suit (stick with the ribs and fried chicken.... FUCKIN DIVINE!). It was very busy the night we were here, and it seemed like half the city was here, all dressed up (though I didn't think place warranted any fancy attire). I only had a couple things on the menu, but from what I did have, it was just OK."], ["David M.", "An elegant bar with excellent service and fantastic food.The entrees are from a food fired oven and they bake their bread fresh daily. They have a good selection of Italian reds (big surprise) and some interesting sherry and port selections. A great place to stop on trolley night."], ["Cassandra C.", "If overpriced so-so food with rude waiters who never refill your glass... or pressure you into ordering food NOW is your thing, I have a place for you! The food made me sick, or maybe it was the overflowing toilet in the ladies room that no one cared to fix is what did it.  You know your in it when they can't even make a decent salad..... save your money folks, there are better choices."], ["Charles D.", "Yet again another over-hyped and overpriced Grisanti restaurant, this time masquerading as a trendy bar/restaurant.  Service was meh, not worthy of derision or note.  For a place that prides itself on its wine they sure like serving deep reds in the wrong type of glass and not particularly clean ones at that.  The food was passable at best and certainly not worth that price.  This is going to be brief because it doesn't merit more.  2 people $130 plus tip and not a whole lot of satisfaction."], ["Gale K.", "After Third visit I still hate it.  Food is okay but nothing special and service is very, very POOR!  Bartenders will get to you when they can"], ["Stephanie S.", "i would love to give 5 stars here for many reasons, but the service was seriously bad. i really am not one to be picky about these kinds of things... i just want my water, a small smile or nod of acknowledgment, and my food. all of these were hard to get. it was weird because the manager was super accomodating and friendly and came out multiple times to check on us, but our server messed up basically everything. we had no silverware for the a good ten minutes while our appetizers were out, we ordered a bottle of wine and were only given one glass for 3 people, and it took a hot minute to snag her attention to grab the check. she wasn't rude, just clueless and bad. but hey, i loved pizza and the mussels. the wine wasnt so fine, so good thing she didn't actually bring me a glass. the outdoor seating was perfect in april, but i can imagine that the mosquitoes would crash our party of three during the hotter months. indoor ambiance was beautiful too, but nothing can fix bad service."], ["Camron W.", "For a good meal at a good price this is a great choice. I was part of a large group that visited the restaurant and ALL of us enjoyed the meal and wine. The server was very attentive...which doesn't usually happen in Memphis.  It was a fun and tasty dinner."], ["Lindsey C.", "This is an amazing restaurant with stellar food and a great atmosphere. I have been several times and have really enjoyed each experience. The staff is knowledgeable and friendly and the crowd is always entertaining. If you don't ever try their lobster pizza, life just isn't worth living. The wine selection is superb, as well."]], "Bari Ristorante": []}