{"Marciano": [["Vikki K.", "The food at this restaurant is simply the best Italian food I've ever eaten.  The caprese for a starter had the most flavorful fresh mozzarella cheese and arugula topped with a sweet spicy sauce.The seafood risotto was simply to die for...  and had a generous amount of shrimp  (lightly grilled ) and scallops that were fresh and cooked to perfection. I would highly recommend Marciano's to anyone traveling to Memphis."], ["Amy P.", "The service was very good. Did not have to wait long for any of our items. The food was not very good, however. Both of our entrees were waaaaay too salty!"], ["Dawn S.", "The $ rating on this place is incorrect it is between $$$ and $$$$. The food is delicious, the atmosphere was nice, quiet and relaxed....until we come in with our three kids, so happy they were well behaved...our children are 6, 4, and 2. The waitstaff there is one of the best I have encountered in Memphis, Kevin was our waiter and he was awesome. All of the wait staff were sociable, kind, and they like kids. A lot of post talk about the chef/owner coming out to the tables, I would have to say that he only came out to one table while we were there and that was to say hi to patrons he knew. So don't go there expecting to meet the chef...you probably won't.Overall we would definitely go back there again but as a couple only not with our children. The had a four cheese pizza that we ordered for the kids because there is no kids menu, the pizza cost was $16 and it was the size of a dinner plate but it was delicious."], ["Samantha B.", "Hubby and I stopped by here on the recommendation of some friends who loved it. They have signs everywhere announcing that they are now open for Sunday Brunch from 11-3. I gotta say it was really just ok. We enjoyed the service, the bread, the decor, and the plates, but the food was honestly just not what we hoped for. Our waitress, Alex, was awesome and let us sub in angel hair pasta on both our dishes. And the bread and pesto was ridiculously awesome, but our meals were not. We got the Chicken Alfredo and the Pollo al Diablo. The alfredo was bland and the diablo was overpowered. We also got the cheesecake, which I thought actually tasted better without the fruit. Maybe this is how Italian food is supposed to taste. We are not sure and we don't know. But if so then I guess it's just not our thing. Loved:Bread and PestoOk: Cheesecake Disliked:Fettuccine Alfredo ChickenPollo al Diablo"], ["Chris R.", "Wife and I traveled to Memphis together and were interested in eating something other than chain food restaurant. Glad we found this place. We started with crab cakes and salad. Crab cakes were really good. Greek salad was good as well. Chefs Salad dressing was very tasty. Fresh bread was hot fresh and the bread dip was awesome. Wife had Seafood risotto shrimp and scallops. I had Veal Saltimboca.Both were fabulous. Rich but not overpowering. Delicate but very filling. Very nice balance of flavors and textures. Not what you would experience at a chain store for sure. Will definitely come back."], ["Jerry S.", "OOOOOOk. So yelp:this place is not bad at all.  Maybe they took your recommendations to heart!  Basically, I went in there assuming the worst--i waltzed in at 7pm (on a Tuesday) and the place only had the elderly locals as described, but they seemed like a bunch who would have good taste so i wasn't afraid to try stuff... But I did end up asking the server to double-check all my choices to make sure he liked them as well haha... Didn't want to risk the bland flavors and whatnot I'd heard described on here cause I was on a date!Anyways, the crab cakes are amazing--they're super creative and Mediterranean... it was so good.  And then we just went for some serious classics: shrimp fettuccine alfredo and veal saltimbocca.  A+The service was kind but a little confused.  However, he came around frequently to take good care of us.  And the atmosphere is very nice.  It's the kinda place you go for a hidden, off-the-beaten-path kinda chill experience.  Will definitely go back.Oh yeah, and wear whatever you want--it could be construed as a dressy place but wear casual if you feel like it--they're friendly and can use the business!  GO!"], ["Joelle P.", "A-OK sums it up pretty correctly. This place has been on my bookmark list forever so when my mom asked to meet Drew for the first time I thought this would be a cool place to do it. It is in East Memphis, has pretty good reviews, and most importantly - I hadn't been. Apparently that last reasoning did not sit well with them though. Drew was thinking Folk's Folly and my mom was thinking Erling Jensen's. They wanted a place they knew was dynamite - oops. I made a reservation for 3 at 7:00 for Sunday night but when we pulled up, we were the only car in the parking lot. And we remained the only people in the restaurant until an elderly couple walking around 8:00. I know this place has been open for a few years so I'm assuming they get more traffic on other nights...but it was kinda weird and awkward being the only ones in there. For appetizers, I ordered the antipasta plate that was bland and not all that good but my mom was obsessed with the mussels and Drew loved his lobster bisque. I just ate the cheese off my plate. And for dinner, they enjoyed their rack of lamb and quail. (Aren't they fancy? ha) while I liked my chicken parmesan but it wasn't anything to write home about. I didn't finish it so asked for a to go box and was annoyed when I came home to find my dinner and appetizer stuffed in the same box. (It didn't exactly go together.)I have to agree with Barrett R on the decor. The outside of the restaurant, which is nice, certainly didn't match the inside. The interior is extremely dark and what you would expect to find in a restaurant in a strip mall. When you see the building outside you immediately expect the interior to match and be new, upscale, even slightly pretentious (and two stories?). But the dining room is plain. There is no crown molding and it is just...blah. I keep trying to think of how to describe it but it is nondescript. That would actually be my biggest recommendation is to make the dining room more memorable. If you're paying over $20 for your entree, I think the restaurant should have some charm. It was OK but won't be entering my normal restaurant rotation."], ["Percy P.", "Love love love this place.  The food is always cooked to perfection and they have the best lamb in the city.  What other restaurant will the owner / chef come out to your table, personally greet you and ask how your meal was?  The owner, Mortez cares not only about the food but each customer in his restaurant.  Put this place on your radar - it's well worth it."], ["Stacy H.", "My husband and I have been going here for years! My absolute hands down favorite place to go for date night. it is quiet and romantic. sometimes they have a fab band. the dantones. You must try it. A lot of memphians don't know about it. I would say it is the best kept secret in Memphis!"], ["Melissa P.", "New Happy Hour find in East Memphis- yummy Italian food with Mediterranean flair- have loved full dinner here, glad to run across Happy Hour! We enjoyed antipasta and pizza- with warm Italian bread that is worth the stop alone! Pic of menu added"], ["Skip S.", "Food is fantastic!!!! Chef was friendly and personal... Came out to say hello... Staff was helpful and attentive... Not a great interior or decor... Could use updating..."], ["Amanda T.", "7:00pm on a Wednesday finds a pretty empty restaurant. Service was friendly and we got our Stella immediately. The pre-dinner bread and pesto were SO good. I'm told it's made with green olives. We split the antipasti platter which was also good--especially the ravioli. We didn't stay for dinner. It's a fairly limited menu and we were satisfied after our appetizer."], ["Cathleen B.", "Convenient East Memphis restaurant. We arrived at the restaurant and the hostess asked if we had reservations. We said no but we're quickly seated.even though it was a Friday night, the restaurant was not very full.Our waiter was very attentive. My husband order the grouper special and I chose chicken Marciano . My husband cleaned his plate.  I brought home a to go box. My dish was ok.Since this restaurant promotes Mediterranean and Italian dining, I wish they had more Italian dishes."], ["Kristi K.", "Love the atmosphere! Especially the curved windows. The waitress was excellent. Got to speak to the main cook himself. Had cinnamon gelato for the first time and it was delicious. The seafood was great! And the rolls and dip - I've never tasted anything so pure of olive oil!Will definitely be recommending this restaurant! I cannot wait to go back."], ["Channon W.", "The food, the atmosphere, the music....the staff..everything about this place was amazing!!!'I would drive another 11 hours to eat here again"], ["Chelsea H.", "Everything had a very homey mom-made taste :) The atmosphere is romantic and quaint, and the Italian server is a sweetheart. However the meals are fairly small and definitely pricey!Definitely make sure to give it a shot it's a great experience! :)Try the pizza and a bottle of wine."], ["Adam B.", "Impressed. The cuisine was excellent.  Quality of our meal was the best.  We had the pleasure of meeting the owner/chef/ server!  Nice to see someone taking the whole role of their venture.We will return.  Thank you for the exceptional meal."], ["Rachel H.", "After reading some good reviews, I was excited to try this (I had a $25 restaurant.com coupon), but I was incredibly underwhelmed. My boyfriend and I went here for a nice date night, and we got the chef's antipasti platter sampler, which was amazing. A great start! Then he ordered the crab cake appetizer along with a chicken ceaser salad for his dinner. I ordered the shrimp and lobster pasta. The crab cakes were really rather small, and they had a lot of tomatoes in them, which is unusual, I think. For $14, they were really tiny, and the breading was thin and kind of soggy. He said the salad was okay, and they did give a lot of chicken, which was nice. My meal was $23, and I got 7 shrimp, the meat of 3 lobster claws and a tiny helping of angel hair pasta. The shrimp were amazing, but the lobster was horrendously overcooked- near inedible. And I was incredibly disappointed with how little pasta I was given. I guess I had Olive Gardens generous helpings in my mind, and that's what I was expecting. It was barely a single serving of angel hair. Our bill was $70 ($45 with the 25 off), and it was really pretty disappointing. Absolutely not worth their high prices. The service was good, and the restaurant was pretty empty the whole time we were there, and we went at 7pm on a Saturday night, which was surprising to see only 3 other groups in the restaurant. Overall, I wouldn't go back, simply because their high prices do not match the quality or quantity of their food."], ["Charles F.", "I have been passing Marciano's for years. Tonight, I decided to stop. I could kick myself for not venturing in before now. The server Alice was absolutely adorable and professional, she also served as the bartender and mixes a very nice drink. The owner/chef Morteza came out and spoke and he could not have been more likeable. It sort of reminded me of restaurants in New York where if you want something just ask and they can probably do it. The ravioli was very good and I look forward to my next visit there. It has a romantic and cozy feel to it and Chef and Alice make you want to visit again soon. It is a great neighborhood restaurant, give it a try!"], ["Charity S.", "Husband and I ate there tonight, a Monday. We were only ones in restaurant other than a few folks at the bar.other than wishing to be asked about appetizers sooner (it took about 8 minutes), we enjoyed our dining experience. The food was very nice and we were happy to learn they make their yummy tiramisu in house, not delivered from a mass produced source.  Cappuccino was good, real Italian style so you sweeten yourself. Only other complaint is the bathroom was stifling hot and the toilet seat slid around! But a good place and we are full and happy."]], "Tannoor Grill": [], "Mediterranean Pita Sandwich & Grill": [["Peter G.", "I've seen Soviet Block Countries with better inventory. Arrived at noon on a Saturday, place was a ghost-town. Ordered baba app & Swarma Lunch plate (Chx & beef). Bread was stale & food lacked any zazz. Bottom line. If you love hole in the wall locals. You'll like this place. However over all experience was underwhelming."], ["Kerry C.", "This restaurant, which opened about two weeks ago on Summer Ave., is part Middle Eastern restaurant, part grocery store and part bakery.While the regular dinner menu is limited to some Middle Eastern basics - think shawarma, tekka, lamb and rice - there's a different, more exotic, special every day. I had the Wednesday fish and rice special. I'm not sure what I was expecting - maybe a tilapia fillet on a bed of rice - but what I got was way better: a halved, mostly-whole fish (it was headless and gutless) topped with tomatoes and onions and a giant plate of rice. It was seriously some of the best fish I've ever had. The meat, especially under the bones - was perfectly moist and tender. The plate of rice it came with was massive. And while I ate most of it, it would have been plenty of food for two not-quite-so-hungry people.I tried the hummus, too. It was excellent - fresh, dripping with olive oil, and a much larger portion than the $4.99 pricetag would suggest.After dinner, I spent about 10 minutes in front of the big bakery counter. The friendly woman behind the counter was incredibly patient with all of my questions about the treats. I wound up with two big pieces of baklava (the best I've had in the city), cream filled phyllo rolls, and a sweet cheese square covered in soft, shredded phyllo.Middle East Bakery is open daily until about 8 p.m. (we got there at 7:30, and they were closing up when we left). They take credit cards and cash and all of their meat is Halal."], ["Jennifer G.", "Okay. This place is hidden in a shopping center just off Summer near the Aldi Grocery Store. I have been here repeatedly for the fresh pastries and dolmas and on several dates. I love the food, but the service and the atmosphere is little to be desired, therefore, I would suggest getting your food to go."], ["Thomas G.", "To be honest, I was a little frustrated when reading the comments that gave minimal stars on this restaurant.  Why go to a Middle Eastern restaurant in the first place? Because, you want to try something different. You want to taste and experience Middle Eastern Cuisine/Culture.   Bottom-line: This is a really fantastic restaurant if you desire an \"authentic\" Middle Eastern experience and food.  How do you know it is \"authentic\"? Let me explain: I am in the military, active duty and have served in multiple deployments/tours to the Middle East and Afghanistan. During my service in the Middle East, I have sampled multiple dishes and cultural cuisine in the following countries: Saudi Arabia, Kuwait, Bahrain, Qatar, United Arab Emirates and Iraq. Because of this experience, I can honestly tell you if the restaurant is considered a great authentic Middle Eastern restaurant or not.Restaurant Cuisine: Flat Bread is an important part of the Middle Eastern meal. This restaurant has some of the best bread I have tasted this side of the ocean. It is made fresh weekly by a Middle Eastern lady who sells it to the store. You can also purchase 6-8 loaves in a package which I recommend. Humus (chick peas):  This restaurant makes it fresh and there is a certain amazing taste when humus is made fresh and olive oil is incorporated.  Speaking of olive oil, the restaurant owner uses Sultan Olive Oil which is a favorite in many Middle Eastern Restaurants.Falafels: Absolutely outstanding, some of the best falafels I have tried.  Because falafels are deep friend chick peas, it is served piping hot. Recommend caution before diving in. Baba Ghanoush (egg plant): Also very good. I recommend requesting half Humus/half baba ghanoush as an appetizer. Main Dish: Personally, I love the Chicken Kabobs. It is served with grilled tomatoes, raw onions, and a lemon. Please ask the restaurant owner to bring you some lemon juice. The main dish is a large portion size. If you want to enjoy it the way it is eaten overseas, recommend tearing off a piece of bread. Put a piece of chicken, some grill tomato and raw onion, wrapping it like a small pita. Then add some lemon juice to it and enjoy! This is traditionally how this is eaten.Restaurant Ambiance: This restaurant is simple and basic: chairs, tables, menus, and a few pictures of Iraq on the walls. As Americans, we are spoiled in our concept of what ambiance is supposed to look like. If you travel to the Middle East, you will find that this restaurant is pretty darn authentic. You don't have to travel thousands of miles to see what an authentic Middle Eastern restaurant is suppose to look like: it is here in Memphis!   Restaurant Service: Again, take off your American glasses and enjoy the Middle Eastern experience. It's a slow process because it is made fresh. We are so use to hurry up, give me service and food now. That is not the Middle Eastern culture.   Dessert: Recommend the walnut baklava which is really delicious with some Turkish coffee.  One final note, the owner and his family are from Baghdad, Iraq and escaped the tyranny of Saddam Hussein's rule."], ["Todd J.", "Went by here cause I bought a groupon, I was surprised !!The kabob w rice was good and the chicken was terrific. decent service, not too long wait time. I will go back for sure."], ["Vim I.", "It's not the best middle eastern food I've ever had but I really want to root for them because Memphis has so few options like this. I like the changes they're making to this place...it's becoming a bit more dine-in friendly and they just upgraded their menu. The first time we had the food, it was pretty good. Hummus and the kebabs are delicious. The bakery has some good options too--but some of the desserts can be hit or miss--depending on how long they let the food sit there. I like the filo dough dessert with the cream filling. I have faith that they're just going through their growing pains right now...I anticipate that it will just get better"], ["Mr K.", "I felt the craving for some Mediterranean food and walked in.  The prices are great and the portions are very large.  I had the salad, okra soup in a tomato base with half a chicken (perfectly cooked, not dry.  I hate dry chicken) on a bed of rice.  I did need some salsa to dress up the rice but the meal was outstanding and only $7.99.  The normal lunches like falafel or pita etc are only $4.99 or $5.99.  Anyway a lot of good food for the price.  I was really impressed when I was leaving and saw the owner or one of his friends giving a down on his luck wheelchair bound person pita bread and hummus out in the parking lot.  Good food, good price, good people."], ["Ellie P.", "I LOVE this place! I get takeout about once a week. The baba ghanoush, grape leaves, falafel, kebabs, and potato stew are all amazing. Additionally, the prices are very reasonable. The ambiance is lacking, but what do you expect on Summer ave?"], ["Abdullah A.", "I am here again. This place is awsome!"]], "Derae Restaurant": [], "Orr Restaurant": [], "Kwik Chek": [["Gen M.", "I'm used to being on the road, and convenience store food has always been the same thing... Maybe some chicken tenders, or a burger, but nothing you would actually want to eat (unless they have a major fast food joint attached). But then I move to Memphis and suddenly every single convenience store and gas station has a full-on legit kitchen with all kinds of food. I don't think I can properly explain just how strange this phenomenon is to me. So strange that any time I'm tempted to try food that really looks so good, the fact that it's coming from a convenience store stops me. But tonight I broke down. And I figured, after reading the reviews, this would be the place to break down at.I read through the entire menu, but settled on the regular muffaletta since it seemed like the sandwich to get here. I asked how big the sandwich was, since, even though everyone raves about how big this sandwich is, the photos always make it look so small, and I'm a pretty big eater. But believe me when say this thing is the largest sandwich you will ever eat, if you get the whole. I got the half and definitely could have downed another quarter, but there's no way I could have gotten through a whole.It took a while to cook, but by the time I got home and unwrapped it, it was so worth it. Ham, salami, provolone, olive goodness, tomatoes, and who knows what else, all surrounded by a toasted bread that, surprisingly, didn't turn to a soggy wet mess, which alone is worth five stars. Definitely one of the best sandwiches I've had in a few years.The staff was pretty great, too. The guy behind the kitchen counter was just generally nice, and the woman up front and I talked about making hummus for a few minutes.Not sure if I'm ready to venture out to other convenience store restaurants, but I'll definitely be back to this one."], ["Bonnie S.", "This is a place that would shock many people. From the outside most wouldn't believe that it served food. However, this is an excellent sandwich and food shop. First, service is slow. Just get over it. Now that we're past that, their Muffalatta and gyro sandwiches are awesome. Also love their vegetarian sandwich. We have friends come over and we all go here and pick up sandwiches. We then go home and sit on the porch and talk, listen to music, and  thoroughly enjoy ourselves. My friends like seeing me, but they love eating from here."], ["Julia W.", "Driving around midtown with an open mind, it lead me to this dive. From both the inside and outside it left me thinking the only thing that doesn't make this a gas station is the gas! Nevertheless, I was willing to try this Memphis famous \"Bi Bim Bap Bowl\". If I were to rate this just on the food, I would immediately give this a five star rating. However, the grumpy, and potentially hungover man, was behind the counter with a sketchy order on a receipt which deemed the service underwhelming. However the very Korean women that has to trusts that you say what you ordered at the cash register seemed fine, but again, very Korean. I see this place maybe better for to go? Anyway, we did find a nice seat at the counter out looking Madison Avenue. Also, it might have been just an off day for service. After a tediously long wait for our food, our falafel platter showed up. This included nicely seasoned pita bread, falafel pieces, hummus, and taziki dip. I did enjoy this very much meanwhile staying away from the taziki dip which isn't my favorite, but was informed it was tangy good. Then came out our steaming bowl of our chicken Bi Bim Bap bowl! It was really hot so don't even try touching the bowl which helps it to continue to cook while you're eating it! Even though it was hot in both spiciness and temperature, it was filled with depths of other flavor. I enjoyed how all of the components came together and found my cravings fulfilled. Since the rice is on the bottom of the hot bowl, it sort of chars and sticks to the bottom. However, I loved how the char gave it a slight crisp sweetness and found myself scraping the bottom for more! The hummus was great to eat in between to give the spice a break as well. I was surprised on how fulfilling it was, so don't worry about being hungry after you leave! I would either come back and try The Crazy Noodle next door, or find something new on the menu here, but I'm definitely glad to say I've gotten to try such a renowned dish!"], ["Kontji A.", "Kwik Chek is located on the outskirts of Overton Square. Put in your order, grab a Memphis Flyer newspaper, sit at the counter and people watch Madison Avenue passers by, as you munch on a tasty sandwich. I've been going to Kwik Chek for a decade.  It's one of my go-to sandwich shops. They don't just have sandwiches, they have grab-and-go items, and hot noodle/rice/veggie dishes. I hear their hot meals are incredible. However, I'm a sandwich girl so that's my main focus for this review.  Aside from the menu of specialty sandwiches, you can make your own. Dine in or get your food to-go. They have subs, rolls and sliced bread. You can keep your sandwich cold or have it toasted in what I think is a pizza oven. I order two sandwiches on the regular: The Veggie Delight or a turkey sandwich on sliced white toast.  The Veggie Delight is out of this world.  Vegetables mixed in a Greek yogurt-type sauce with hummus wrapped in a pita.  YUM!!!!!  The turkey sandwich is like I made it at home, only better.  A sandwich is but a lonely slab of layered fodder without tasty chips and a drink. Kwik Chek has a wall of chips with all kinds of varieties.  They also have a wide variety of drinks and sweets, from candy to baked cookies and cakes.  The cakes are so good. I also love the grab-and-go deviled eggs and salad, if I'm in a rush. FYI...Orders usually take 15-20 minutes. Parking is slim pickings.  If you're happy with your order, consider leaving a buck or two in the tip jar for the sandwich team.  A sandwich, chips and drink usually cost $10-$11. Kwik Chek is worth a try!"], ["Lee C.", "I have to admit that the first time I ate here I was a little confused.  They had gyro on the menu, I ordered it and loved it.  But what confused me was seeing the Korean food dishes.  I wasn't familiar with most of the dishes so it took me a few visits of eating only the gyros to try one of the Korean dishes (Bi Bim Bhap).  I actually enjoyed it.  The only thing that keeps me from giving this place a 5 rating is that the tables, counters and chairs appear dirty.  It definitely has a dive feel to it but the food is great."], ["Lily V.", "Great food, and good location! Service was decent, but nothing spectacular. BF and I ordered the bi bim bap to go, and we definitely got less than we would've if we ate there. For two orders plus a drink to go, we paid $25... Not super cheap, but it didn't break the bank!! Will be back to perhaps eat-in :)"], ["Jeff Y.", "This place has very good food. The ambiance is a bit awkward as it feels like you're walking into a normal convenience store, but the food is amazing. A \"must\" check out."], ["Srishti S.", "My favorite lunch spot in midtown. Period! Bi bim bop is heaven, kimchi fried rice are the best fried rice you'll ever have, bloody valentine sandwich is super flavorful . We went there for lunch 3 days in a row and still were craving  bi bim bop the next day.If you havent tried this place yet, you are missing on something. But remember, you go there only for the food. Its a precious hole in the wall."], ["Natalie H.", "The quality of this place has plummeted tremendously over the past month or so. Their sub sandwiches are okay now that I've tried them, but my heart will always be with the BBB. Unfortunately, they stopped cooking it for as long, stopped using as many and as fresh-seeming ingredients, and the people who come in to eat are increasingly rude and loud. Also, apparently this is a \"tipping necessary\" establishment. But this isn't a thing I've ever observed happen, or have done myself. But how did I find out they expect a tip? One of the regular cooks lives down the street from me and as I was walking my dog with my friend who always goes to Kwik Check with me, he yelled across the street (5:30 pm as everyone is in their yard or coming home) \"Hey I know you two, YOU GUYS DON'T TIP.\"Needless to say, who I thought was a regular midtowner is actually an aggressive jerk who may have done something to my food. I'm avoiding unless I need to order out."], ["Mario S.", "First of all: Bi Bim Bop. That is all. Yes this is the place I always get myself the humus plate and an order of Bi Bim Bop. Yes, they do have a burger version of it, but I still prefer the original since I'm always hungry and the burger isn't enough for me. I love that I can come and get this dish, consistently love it, and also try out some of my favorite Mediterranean urges too. Plus it's kind of a store so you can buy a pack of beer on your way out.What more can you ask for right?! Love this place."], ["Joelle P.", "There is a legitimate following of this place. Like cult following. It was good...but I guess I haven't drunk the kool aid yet. It is a little hole in the wall with tons and tons of sandwiches as well as Greek and Korean food. I had the Turk and my lunch partner had the Bi Bim Bop (which of course I tried). The Bi Bim Bop is the one that will keep me coming back...repeatedly. I mean, the Turk was delicious but given that I eat a lot of sandwiches, it didn't really register on my craving scale. Can't wait to try one of the gyros next!"], ["Isaac S.", "How have I not heard of this place before? So I was consulting my trusty Yelp app for dinner suggestions when I stumbled upon this gem. Supposedly this joint has been around for years. I have never heard of it before and have been loyally going to the Chinese Sub Shop every time I am back in Memphis. Not taking away the grandeur that is Chinese Sub Shop, but Kwik Check definitely holds a spot in the top sandwich shops in Memphis.The restaurant isn't much to look at. Imagine the inside of a gas station convenience store with all the shelves removed, but refrigerators with beer and drinks all intact. That is what the restaurant looks like. It is a no-frills, hole in the wall. My kind of place!The menu is mostly populated with muffaletta and hoagie style sandwiches, some gyros, and Mediterranean food. Then there is Korean Bi Bim Bap. Totally off the wall I know, but that's what makes this place special. There is even a Bulgogi Burger. I guess you could say this is the \"Korean\" Sub Shop.I tried the Ninja on wheat, a concoction of turkey, ham, sprouts, melted Swiss cheese, mushrooms, peppers, and \"oriental sauce\". Not sure what \"oriental sauce\" was, but it was delicious! Potato salad is my favorite anywhere I go so I got a side of that. Not really my favorite potato salad, a bit too salty for my taste. Plus at $2.99, it was expensive. To give you some perspective, the sandwich was only $6. Yikes!I highly recommend this joint if you are every in the Cooper-Young area and aren't feeling too rich or too posh. You won't regret it!"], ["Matthew P.", "I'm an old school NY sandwich / deli snob looking for a quick bite and this place nailed it. So delicious, I was told to get the Turk and it did not disappoint! Can't wait to come back and try others."], ["John S.", "2 words: Bibimbap Burger.Having been spoiled by good Korean places elsewhere (e.g. Atlanta), it's hard to find a good Korean place in Memphis. Well, no need to look any further, because I've found Kwik Check. They have a diverse enough menu and the prices are awesome. Can't wait to try their other dishes."], ["William P.", "This place looks to be what use to be a Kroger station but now converted into a restaurant. But don't let the looks fool you it's a pretty damn good place for subs. I haven't tried the other food yet but I will say that I will try that other stuff soon.Definitley a place for good lunch"], ["Andrew O.", "I was visiting a friend in Memphis. I arrived when she was at work, and she suggested that I go here for something to eat. She told me I had to get the Bibimbap Burger. I was tired and hungry after spending my morning in airports and planes. While I was waiting for my takeout order the staff made me feel welcome.This place is very unassuming. If you did not know any better you would just assume that it was a convenience store with a deli counter. It is so much more than that. A convenience store with some basic staples, and a top notch mediterranean takeout place. They do offer some tables for eating there food there but that is about it. I am going back to Memphis again shortly, and this is the first thing I plan on doing is going to Kwik Check."], ["Dan B.", "consistently great - especially if you eat the staples - the middle eastern staples as well as the Korean staples i love the BiBimBop and the noodle soup on the Korean side and the shwarma on the middle eastern side top notch"], ["Daurie S.", "I used to eat here frequently. Today I remember why I stopped going. While the food is good the attitude of the people running the place and working here was especially bad today! Not a thanks or a hi or anything. I was met with literally \"what do you want?\" After I ordered and went to pay the couple in front of me were paying with a credit card like I intended to but the phone line was down or something. I got tired of waiting and paid for both our orders and probably won't be back. Maybe an off day but I've heard outside of yelp that the palace has taken a dive. Too bad so sad."], ["Kelly M.", "The Bi Bim Bop is AMAZING. I went with some coworkers for lunch after reading some reviews; it did not dissappoint. It has become one of our new favorite lunch spots. The pita and hummus are also really good. But definitely try the Bi Bim Bop!"], ["Kyle C.", "The food is the reason that you go to this place, and the only reason. They offer several different sandwich options that are completely out of this world, not to mention the BEST muffaletta sandwich that you've ever put in your mouth.One of the main attractions, however, is the Bi Bim Bop, which is a Korean dish that is outstanding. You can get your Bi Bim Bop in three different iterations: beef, chicken, or tofu. I have always gone with the chicken option, because that's what I like. However, I don't think that you could go wrong with any selection. If you have not tried this dish before and you think that it is outside of your level of adventure, do yourself a favor, and try it. You will not be disappointed!You will not be impressed by the interior or exterior of this establishment, as it is an old convenience store/gas station. However, do not be dissuaded by the appearance of this place. You are about to eat one of the best sandwiches, Bi Bim Bop, or other Greek (yes I said Greek!) dishes that you have ever tasted.  While you're at it, feel free to grab a bag of chips, a cold beer, or one of the other assorted drinks and appetizers that are offered in one of the cold cases around the store.Do not sell yourself short. Eat here. Five stars."]], "Taziki's Mediterranean Cafe": [], "Castle Restaurant": [], "Casbah Restaurant": [], "Raffes Deli": [], "Boscos Squared": [], "McEwen's On Monroe": [], "Pita Café": [["Snow X.", "Honestly, this place has destroyed my ability to eat falafel anywhere else. I'm on a never-ending quest to find falafel that even compares to this place. The falafel here is fresh, light, crisp--everything falafel should be. I have searched restaurant after restaurant to find a place that even approaches the magic of this dude's pita--to no avail. Mo is a funny, personable guy. He's charming and always concerned that his customers are happy with their food. Try it before you pay, as he says. I love supporting this guy's business. I give this place my highest possible rating."], ["Rangi G.", "The place is closed.The place is closed.The place is closed.The place is closed.The place is closed."], ["Adam W.", "Mo's a weirdo. The place is hot and stuffy in the summer. Sometimes he gets the order wrong. There's occasionally a convict working the register. The food is great. The drinks are canned and limited. The neighborhood is seedy. The food is great. I caught Mo sleeping in a side-room once and I think he may be living there. Good luck with a special order, you're better off just getting whatever he wants you to have. Mo is passionate. The food is great. They charge 50 cents for credit card purchases. The ambiance isn't. It can smell bad at times. The food is great."], ["Candice C.", "The falafel wrap was pretty good although the freshness of the ingredients is questionable.  They use shredded iceberg lettuce from a huge bag and the tomatoes were pretty soggy.  I really wanted to LOVE this place but it was just ok.  I like Casablanca better-much fresher.  We also got the ethiopian veggies.  They were out of injera so we ate it with pita bread.  Ok, not great.  I prefer Abssynia for ethiopian.  If you're in the area and want to try something different, this place is ok.  I wouldn't go out of my way to recommend it though."], ["Mike D.", "The best pita store in town. It's run by the guy that owned the one at Poplar & Mendenhall area before he sold it. My favorites are the Chicken Shawarma wrap and the Gyro. If it's your first time, you have to try the Chicken Shawarma. By have to try, I mean, he is going to make you try it. Your pretty much not allowed to order anything else if you haven't tried that yet.What really makes this place are the sauces. If you don't like sauces on your food, this probably isn't the place for you. Unless your allergic to something, just let him make it with all the sauces and give it a shot. His offer is if you don't like it, you can throw it out, and he'll remake it your way."], ["Michael C.", "Great staff but food is horrible. The chicken shawerma was more like indian curry chicken kabob. Not authentic  mediterreanean."], ["Matt S.", "The staff was nice, but the food was not."], ["Thomas O.", "On my second visit I was not too impressed. I ordered a Gyros then looked at my choice of toppings, none of which looked very fresh, lettuce with brown edges, dry cucumbers etc. They don't use true Gyros meat only a cheap cut of beef done on a griddle I believe. At home with my sandwich a few minutes later suspicions confirmed, bread was not fresh and a poor example of a Gyros. Castle Restaurant less than one block east is a much better option. Review of Castle coming soon. I have learned not to post a review after only one visit."], ["Harrison W.", "The food is great, but whenever the owner is working he is rude and messes up the order."], ["Chris R.", "Good wraps. The only problem is the drinks; they have cans of soda or bottles so there are no refills. The store is pretty warm inside so the drink issue is a major factor in dropping a star from 4 to 3."]], "Zam Zamz Mediterranean Grill": [], "Jerusalem Market & Restaurant": [], "Al-Rayan": [], "Sean's Deli": [], "Pita Pit": [], "Casablanca Restaurant": [["Elisabeth T.", "Food is amazing! I always get the Chicken Shawerma platter, hummus, or a Greek salad and I've never been disappointed - it's always so good! The restaurant has also been recently renovated so it looks great."], ["Casey B.", "Ok, I have a confession. Last week was the first week I have eaten here in two years.  I don't know why (especially because I live 5 minutes away)....I remember it being good, but I just haven't been back in a while.  Anyways, I plan on making up for lost time. I got the kifta pita with a side of hummus this last time I went.  I enjoyed every bite immensely. The hummus was great as well.  I love the sauces they have out on the table.  I mixed the spicy one up with my hummus and that made for a nice and spicy dip for pita bread. I also split an order of the grape leaves with someone and we both were very pleased with that choice.  I tried a couple bites of the falafel pita and thought that was pretty freakin good too.  Lastly, they do have well made tea.  The tea is sweetened with honey, but it is not overly sweet.  I usually only get unsweetened tea and I like the tea here a lot. So in closing, I am vowing to be visiting this restaurant much more frequently so I can try all the other items on the menu.  Everything so far has been top notch!"], ["Ernesto C.", "I went there one Saturday, obviously the owner, the previous reviews talk about, wasn't there and the Staff did whatever they want. Maybe it is because Saturday is the \"rest\" day for Islam ? I don't know, but the thing is, that day, the service and food were horrible.The food looked and tasted more towards \"Soul Food\" than anything related to the Middle East, the being called waiter, didn't even brought us the traditional pita bread nor the Jocoque (or \"Greek Yogurt\"), something basic in Middle Eastern food, he had bad manners and got confused with our orders and to make things worst, that being, condescendingly, had the nerve to ask us if we had eaten Middle Eastern food before. That was a terrible sign. And sorry, I do know about Middle Eastern food since a good chunk of my family comes from Lebanon. And to makes things worst, the portions were on scarce side.Maybe, when the owner is there, maybe things work better, but for what I got and paid that day, sorry, I can cook better."], ["Jennifer C.", "Fantastic Mediterranean food!  Very accommodating to my no meat requests. Gave me carrots and cukes with my hummus and baba ganush. Can't say enough about how fabulous this food is! And the tea... Yummo."], ["Wayne R.", "I have been an avid goer to the Casablanca on Germantown Parkway, and I rather enjoy it. This one, although I was thinking it was going to be more of the same, is actually a little bit different. The food just didn't have that same quality as the other one. I ordered the Kabob in a Pita form (sandwich). It wasn't bad. Overall this not a bad place. If you have the option though, try the other Casablanca first."], ["Ōnglaí W.", "A 5-star dining place! Good food and good service! Good quality and perfect size! Good variety of choices! Highly recommended for dinning in Memphis!"], ["Michael G.", "Sat down,  ordered a water while I perused the menu, and the waiter just kept cleaning tables,  and seating new guests. And I could tell,  nothing else was happening for the seated guests. Sort of a weird stale mate. A little pricey for the cuisine. Never got my water.  Buh bye"], ["Carrie W.", "This place is a hidden gem, except it's been around for 17 years, and it's not exactly hidden. But it is very unassuming from the outside.Got there around 7, wasn't very busy, left around 8 and it was a full house on a Tuesday.  I'd have loved to have tried more, but I had the hummus with mixed grill shwarma. It didn't look that intimidating on the plate, but there's no way I could've finished it. It was delicious, and I think especially together - I've never seen that presentation elsewhere. Two of your favorites, better together! It's served with a couple pita breads and two sauces. The first is a jalapeno-feta sauce which the waitress admonished was very spicy so I should be careful. The second was a mango-something sauce. She said that I should \"have fun and make sandwiches\". cute...That jalapeno sauce was awesome. I got a little carried away with it, despite the warning, because it was that good. The mango sauce tasted mostly like mayonnaise, but was good for cooling my tongue after overdoing the hot sauce. I also had the \"best tea in memphis (iced)\". I couldn't decide if I really loved it or I really thought it tasted like dish soap, but I went ahead and had another glass anyway. Lastly, since I had read the reviews, I knew that I could not leave without trying the chocolate mousse. oh my word...for a mere $3, they bring you a bowl the size of a cereal bowl full of chocolate mousse. it's delicious. it's not overstated. you HAVE to try it. service was kind of slow, even when they weren't full, but very pleasant and prompt once you have their attention. the ambiance is lovely, especially the lighting. oh also the pricing is REALLY reasonable. especially for what you get. i actually felt like, compared to other dinners I've had in the area, like the prices were below average."], ["Gadafi A.", "They have excellent service even when they are busy and rushing themselves. Food in addition to the service was great!"], ["Arpana W.", "If a restaurant can get my husband' s attention (especially one that doesn't serve steak and potatoes), it MUST be good. My husband's palette aside, however, this really is an east memphis gem! Inconspicuously located in a mini-mall off of poplar, this restaurant has some of the best Mediterranean food you will ever have. From the perfectly cooked falafel to the tasty fresh lemonade, this place is a  gastronomic experience. I usually get the chicken kabab and a plate of hummus and go to town. If toure looking for a spicier experience, the special sauces are a must and really add some zest. The food, along with the super nice staff make this my go-to place for my Mediterranean food cravings!"], ["Amanda E.", "This is my favorite restaurant in Memphis. I go at least twice a month! The tea is amazing and served hot or cold and the Turkish coffee is no joke. I also really like the lemonade, sometimes I have a really hard time picking a beverage because they're all so good. I get the simple favorite appetizer and chicken Schwarma platter every time, so good!  The house sauce is what really makes it, it's delicious. In the winter I'll get the hot tea and cover my food in their spicy sauce - works wonders on the sinuses which is a frequent problem for us memphians. I've brought lots of people here over the years and every single one of them has either returned on their own or requested we go back. The owner is so nice and takes pride in his place. No alcohol allowed as its against the owners religious beliefs, fair enough. Besides, the tea and lemonade are too amazing to drink anything else anyway."], ["Veronica X.", "I fell in love with this Casablanca on my first visit. I had the vegetarian platter and hubby had the Moussaka, both of which were scrumptious. The honey sage tea was amazing served hot. I have since dined here a few times in the past two years. The beef & lamb Shawerma (Shawarma?) was tasty. The small mezza combo was a lot less impressive looking than the big one. I felt that the reduction in size and variety was more drastic than the price difference between the big ($19) and the small ($8). The hummus I had last time was very pasty. The baba ghanoush was not very smoky. The falafels were small and unremarkable.  On one occasion the pita bread served on the side was hard and dry. The chocolate mousse was ok but nothing special. Casablanca might still has some of the best Mediterranean food in Memphis and the ambiance is more romantic than others but I think I will avoid the small mezza combo next time."], ["Kathy B.", "Very inviting atmosphere, engaging and attentive staff, scrumptious food! The falafel is fantastic, the chicken shawerma amazing, salads are fresh and cool, the Casablanca chips are a family favorite! And of course, the cold ginger, sage, and honey tea!"], ["Jim S.", "My wife and I come at least once a month. Get the hot tea! Get the shawarma! If you really like pita, you may want to order extra..."], ["Khat S.", "Oh my lord!!! The Casablanca baba ghanoosh was amazing!!!!! I didn't know what to expect but ordered this as an appetizer and it was a large order that could easily feed 4. Delicious chicken on top of the baba ghosh made it so filling and delicious. I've never had anything like it. I'm not from Memphis and am so glad I stopped by this place while in town. If I ever come back I'll definitely visit this place again. Friendly staff, cute decor, amazing food for reasonable prices! Jackpot!"], ["Ian-Schuyler B.", "Went here for the first time for a friend's birthday dinner. I unfortunately arrived later than everyone else (as they ordered) but that is normal for me. :-) I quite liked the atmosphere and decor upon entering, though.After being given a few minutes to decide, a waiter came to take my order, different from the waitress who had taken those of the other guests. I have to say that I felt he was a bit condescending. I'd hate to think that it was because I was black man with a hi-top fade and clearly a first-timer in the restaurant (i.e. indecisive, asking questions). He chose the meat on my Egyptian Hawashi FOR ME and was off. A drink was soon brought, but a straw never was -- pet peeve and red flag number two.A few minutes later, the original waitress to my end of the table came with a dish saying \"Beef and lamb... sandwich?\". I raised my hand tentatively and commented that I didn't expect it to come out so soon. She said \"Well, everything's already ready back there.\" Um... red flag number three, but I started eating anyway.Just a few more minutes later, my waiter came saying \"beef and lamb? Egyptian Hawashi?\" I looked up horrified. It seemed that one of my friends had ordered the beef and lamb shewarma. Upon discovering this, they apologized and gave him the Hawashi, which was certainly understandable, but said nothing to the customer who was actually given the wrong meal -- me. BLACK FLAG.At the very least, I did get to try the Hawashi, and it was really good.Bottom line: cozy atmosphere, food is good, service is terrible. Don't hire someone if they can't keep guests' orders straight, don't know what the dishes are called (or, as I suspect, can't pronounce them), and can't even make new guests feel comfortable. And when a mistake is made, ALL of those affected should receive an apology. The next customer might not be as... composed as I decided to be, especially if they don't like when people \"fuck with their food\" as I don't. Won't be returning."], ["Aryo K.", "good mediterranean selection.the shawma was super nice and juicy...next time will try the couscous lamb...the lime juice with honey is awesome"], ["Ashley H.", "Staff is very friendly. I've been here multiple times and the food is always excellent. Occasionally they may even give you free chocolate mousse."], ["K L.", "Oh My- What can I say about Casablanca...My mouth exploded!! The different flavors literally took me on an exotic food venture..my tummy was satisfied! A friend introduced me and, I am hooked. The fresh olive oil is like 10x better than the extra virgin olive oil I purchase from Kroger or Wal-mart!  The chocolate mousse, the moussaka (pardon if spelling is off), the risotto, the beef& lamb, the fresh pita bread& various sauces....Since my brain has been expanded to local eating like this, I can never go back to Applebeas or TGI Fridays to spend my money.. I'd rather pay for authenticity and get my mouth& money's worth! The prices are cheap, the servings are generous portions, the service& atmosphere is so friendly, & the food is healthy! Excelente!"], ["Jessica M.", "I go here all the time!! The atmosphere is perfect for enjoying some quality or catch-up time with friends. The tea is unlimited refills and the best I've ever tasted. A favorite by memphis locals!"]], "Flight Restaurant & Wine Bar": []}