{"El Ranchito Restaurant": [], "Home Style Taco Shack": [], "J Alexander's": [["Kayla B.", "My most recent experience here was great! From the moment I stepped on, it was apparent that customer service is supposed to be at the forefront of the minds of the staff. Someone ged the door open for me, asked how my day was, and immediately led me to a nice booth even though I was eating alone. From there my waiter (Ryan Herd, I learned from my receipt), immediately came to get my drink order, then again to ask if I wanted an appetizer or salad to start. I opted-out. I explained that I hadn't been to this restaurant in quite some time and that I may need some help choosing my meal. Ryan was more than happy to go through the ingredients and preparations of the menu items I was interested in. With his help, I finally decided on the veggie burger. It was fantastic!!! It actually takes the cake as my new favorite veggie burger (followed by the oat burger at Otherlands). The thick, juicy burger was oat based and was comprised of a whole host of other veggies including beets (BEETS!!!!). It came with lettuce, cheese, red onion, tomato, and pickle on a delicious toasted bun. I chose broccoli (which came sprinkled with parmesan! Yum!) as my side. I finished held my meal, then got the rest wrapped to go. I decided to follow this up with the Creme brûlée, which was the special desert of the day. It was absolutely perfect. It was creamy and decadent, filled with vanilla beans, and topped with that perfectly crisp sugar crust that Creme brûlée is known for.  Then they put a dollop of whipped cream on top with berries and mint. It was a huge and heavenly; I went to bed dreaming of having it again. Other things to note: My waiter was so attentive. I can't remember a moment that my water glass had less than a sip missing from it. My mom has gone with a group of friends and had the same waiter. She had nothing but high praise for him! Other people brought out my creme brûlée and answered questions I had with a smile! I really enjoyed the customer service and the food. It was a fantastic overall experience!"], ["Lucresha W.", "A crowd favorite that never disappoints. An awesome experience that satisfies again and again. Perfect date atmosphere, in case you were wondering. Go and life is good. Ooh yeah...Chocolate cake. That. Is. All!"], ["Stefan K.", "Best Alexanders I've been too, regular Prime rib is excellent, Cajun Prime rib special was way too salty. Atlanta needs to step because I've this one puts them too shame. In other news I've gained 10 lbs since my special assignment too Tennessee. Thanks a lot Tennessee it's clearly your fault. And yes I'll have the crème brûlée. Duh... Why would you even ask?"], ["Kayler H.", "Great place for first timers! The menu is easy to read with much to choose from! I enjoyed my dinner! I had the rotisserie chicken and mash. The place is a bit on the dark side but romantic and cozy for an evening off with a date! Now time for the dessert! Chocolate cake with ice cream! Yesssssss"], ["Matt N.", "This place is awesome. I had steak sandwich and it was great. It had a good atmosphere and attitude when I went by the bar. All in all it had good service and was worth the money. I will be coming back."], ["Jason D.", "We were in town for the holidays and haven't been here in years so we remembered we liked it and thought we'd stop in and have a nice dinner. We called to check on the wait and were told 30 mins and that we could be put on call ahead to be seated. We arrived and had to wait another 45 mins. After getting seated we were rushed. We ordered an appetizer because we were starving but our salads came out before it, then our meal arrived after we were done with out Salads so we ate our steak. As we finished our steak our waitress came up and asked to box up our appetizer and we hadn't had any of it, so we were frustrated and annoyed so we said yes. When we got home we found less than half of our cheese dip and no salsa. We were at our table for 35 minutes with a $70+ check for 2. Extremely upset and warning everyone to stay away, try something else and spend your money on a place that respects you and takes good care of you.  Firebirds, Rafferty's, just about anywhere else at this price point. Paris our waitress seemed to be in another world, disconnected, and lost. I know they have to turn tables but my goodness!!I will say this, everything we had was really good. The Steak Maui and Side Salad and Queso (which we ate when we got home) was really good. No bread but... the sweet tea was good as well."], ["Tammy H.", "1. Food - always amazing, always fresh, always made as \"from scratch\" as possible(Seriously - they literally have a little herb garden out back)2. Service - always amazing, always courteous, always on point3. Price - a little high, but not prohibitively so - which is to be expected when you get 1 and 2 above.:-)PS - If you are a dessert person, try the KEY LIME PIE.  I don't like key lime pie. But I LOVE KEY LIME PIE at J's!"], ["Steven L.", "I haven't been to J Alexanders in awhile and decided to come here with a group of guys to just hang out.Our server was very attentive and made sure everyone got their food and if we needed a refill on our drinks.Majority of us ordered steak and prime rib. My filet was cooked just right  (med rare) while my other friends had the ribeye. One had a slightly overcooked ribeye (med well) and was offered an apology and a new steak. Even the manager came to apologize afterwards.Our table was rewarded with some chocolate cake and ice cream for the trouble afterwards. That just hit the spot at the end of our meal and was much appreciated."], ["Marcus B.", "I always sit at the bar!  The bar tenders are class act's!  Food has always been cooked properly!  Ahi Tuna Steak is great!  Get Wasbi mayo on the side!"], ["Deborah D.", "If I want a good meal in a relaxing atmosphere, J. Alexander's is a great place for lunch and dinner.   The first few years, the service was excellent, but inconsistent now.The food is still great and you can't beat the prime rib and the fried chicken salad!  (There is plenty for another meal."], ["Hoda A.", "Hailey was our server tonight, she was so attentive and polite and made excellent recommendations. I had the ahi tuna salad and an iced coffee, delicious! Don't leave without having the chocolate cake!"], ["Andrea G.", "They have changed their name to \"Redland's Grill\" -- per the staff nothing else has changed - ownership, menu ect. - still the same. Just new name."], ["Shannon A.", "Every time I come here I have the greatest experiences. The servers are polite and not overbearing. The food is well prepared and fresh. And, as I discovered today, they now serve Sushi! I enjoyed the sushi, but I do think that it could be better. It's fancy sushi, but to a trained palette, the rice is not exactly right and it's not put together correctly, in my opinion. I think sushi rolls should be tight and not fall apart when eaten. Otherwise, as usual, J. Alexander's is one of my favorite restaurants in this area of town. Try the Fire Grilled Artichokes!"], ["Ellen Q.", "I haven't been here in a few years and I was very disappointed tonight. I miss having the Cypress Salad on the menu even though some of the other salads are great. The Chicken Milanese had no flavor. The chicken tacos had so much cheese and lettuce that my niece couldn't find the chicken. The chicken fingers and fries were delicious; thank goodness something hasn't changed. It was my niece's birthday but they offered no special dessert and the waitress barely acknowledged it when we told her. I have been a J Alexander's fan since the beginning and I am not a fan of the switch by some of the locations to the Redlands style."], ["Angela C.", "We had a great dinner! Atmosphere makes for a nice date night.  Lemon drop martini was made to perfection. The chef got my filet just the way I like it. They have the best key lime pie ever!"], ["Dermesh M.", "The server was very nice & attentive, the food was awesome..I ordered steak & mac n cheese which tasted so good. Lemonade was refreshing also."], ["Rebecca C.", "I always love this place. The food is great, and the staff are excellent. I usually get the prime rib, will say that the staff needs to be trained to offer horseradish up front. Prime rib, in my mind, always comes with creamed horseradish so it's a but disappointing to get this awesome plate and then have to wait for your server to leave and come back with horseradish after you ask. If you are in the mood for dessert, do yourself a favor and order the carrot cake. It is seriously to die for, served hot, and can feed like four people for $6-$7. Love this place, will be back!"], ["Jackie K.", "They don't take to-go orders over the phone.  Ordering the food at the bar then waiting at the restaurant defeats the purpose of getting a portable quick meal.  How disappointing!  I'll call Firebirds next door.  They'll be happy to take my money."], ["Phil K.", "Stopped in here after 8 hours drive from Dallas.  What a great storke of luck finding this top shelf eatery.  I had the Filet Ctr Cut medium rare  cooked perfectly.  Wife had the Scottish Salmon just great - both entries are winners.  Seat at the bar and had very attentive service."], ["Raechel P.", "My colleagues and I were in town for a work training nearby. Since we are all from different states we relied on other yelp reviews to make our decision on where to dine. We were tired of bbq and wanted to try something else so we went to J Alexander's. They gave us a warm welcome and seated us right away. Our server was Mark and he was fantastic. He was knowledgable about the menu, gave great recommendations and was very patient with all of our questions and special requests. Not to mention he was very friendly and funny. The food was delicious!!!!! The Mac and cheese, chicken Milanese, coffee crusted rib eye and sushi rolls were some of the tables favorites! We had a great experience and would highly recommend it to anyone coming to town! Thanks Mark!!"]], "Babalu Tacos & Tapas": [], "East Tapas and Drinks": [], "Harmon Architectural Millwork": [], "Agave Maria": [], "Cafe Med": [], "Baleadas Express \"Almas\"": [], "Greencork": [["Kelsey J.", "The concept of this wine bar is fabulous. Don't want to pay $8-12 for a glass of wine you aren't sure you like? No problem. Pay $3 for a 3 oz pour instead.The owner of the bar, who calls herself the \"Fairy Wine Mother,\" is the sweetest woman. She welcomed 22 of us with open arms. Her small staff was able to handle the big group of us without coming off as overwhelmed or annoyed. They were very gracious, knowledgeable, and helpful. We had a fabulous time wining, dining, and mingling. The environment of the restaurant is also charming. You feel welcomed and valued from the second you walk in the door to the time you walk out. The food is on the expensive side, but if you splurge and try it out, you'll realize that it's worth every penny. As a self-proclaimed \"cheapskate,\" I would pay for the picnic basket, the butter-poached lobster, and whatever that amazing apple-cake-something dessert was all over again. Don't let the prices scare you away, give it a shot.Overall, I highly recommend Greencork.. for the wine, the food, but most of all, the impeccable service."], ["Bahn V.", "Greencork is located in the legendary Cooper-Young area of Memphis. We have been wanting to stop by for some time, and finally decided to take my Mom there for her birthday. She absolutely loved it! From the moment you walk through the door, the gentlemen kick into gear and explain how it works. You can start a tab, which is recommended, but be careful, the wine adds up quick! You receive a smart card and you put it into the machine of your choice (bold red, medium red, white, etc) then you select the wine of your choice and either 2, 4, or 6 oz. The prices are listed accordingly, and the least expensive I saw was for $3.50 for a 2 oz. That being said, the wine is delicious and it's fun to mix and match as you go. We also ordered the 'firm' cheese plate which was a great pairing, then she had the Butter Poached Lobster which she has now declared her favorite meal. It was very good and had a very rich, creamy sauce. Since it was her birthday, she received a slice of decadent chocolate cake, but the staff highly recommend the Fried Pound Cake, which she will probably try next visit.We were told the menu may change up a bit from time to time, so they recommend calling ahead if interested in anything in particular on the food menu.Greencork is run by a local family, owned by a Ms Robin, whom we met as we were leaving. Her son explained many of the wines to us while we browsed and her daughter is the chef. They were all very friendly and we should all strive to support local family-owned businesses. We highly recommend them. Greencork is great for couples, meetings, girl's nights out, etc."], ["Kontji A.", "Where to start?For one, I came here on my first date with my fiancé. He later proposed to me here.  The whole restaurant clapped, when I said, \"Yes!\"With that disclaimer on the table, let me count the ways in which I love this Memphis treasure. Oh, wait.  I should explain the concept first: Greencork is Memphis' first self-serve wine bar.  You stop at the front check-in area and get a wine card. Wine dispensers line the walls with description cards.  You slide your card in the machine and press one of three different ounce sizes of your choice. The amount you pay for each glass depends upon the size of your drink. They have 32 different wines nightly.  Yes!ATMOSPHERE:It's a casual and cozy place where you can have a romantic beef short rib dinner and wine by the fireplace or meet a group of gal pals to nosh on wine, cheese, grapes, olives and French bread over gossip.  Kidding.  I'd NEVER gossip about ANYTHING!The restaurant can serve as a picnic at a table.  There's even a picnic basket item on the menu. I suggest, if you're going to Levitt Shell or a Botanic Garden concert, that you get the Premium Picnic Basket to-go. You can also sit at the bar and watch the Grizzlies win the playoffs (fingers crossed).They have what they call \"Test Kitchen Tuesdays,\" when you sample FREE potential future menu items that could be put on the menu depending on how diners like the test dish. The pièce de résistance is ROBIN, A.K.A. \"Your Fairy  Wine Mother.\"She is actually the owner and literally makes you feel like you're eating and drinking at a friend's house. Her son is her trusty sidekick, who chose all the cheeses on the menu and will tell you what's most popular on the menu.If you visit Memphis, you're missing out, if you don't check out Greencork."], ["Bailey P.", "This place is awesome. Such a cool concept. Wine is a bit expensive, but there are many tasty items. The sorbet trio is delicious. Only thing I would change is maybe something for the vegans to nibble on."], ["Cristina H.", "So my first time at Greencork was absolutely wonderful!!! The whole self-serve concept is fun and different. While they do have a full bar as well I stuck with the wine this time and I did find one I really liked. They tell you the flavors to expect and the region of the wine so it's not too much of a mystery. Also you can get it in 2oz if you aren't sure about getting a bigger glass of it. I think that's my favorite part! Customer service here isn't lacking either, even though they don't have to serve you as much they are still very friendly and sociable. The owner is adorable and her daughter, the chef, is a genius. This is definitely my new spot!"], ["Marissia W.", "I love Test Kitchen Tuesday!! We met the owner our \"Fairy Wine Mother\" and she was just great!! The bartender definetly knows what he's doing. Each one of us had a different flavor craving for a drink and he had a specialty for it. The concept is cool because you can get up whenever your ready and get a glass of wine. Love that!! Go with friends and enjoy the cool vibe."], ["Stephanie H.", "I love the concept of this place! Very original idea and certainly not something you see every day which is why it's the perfect place to check out when you feel the need to try something new. Would make an excellent choice for date night. But be warned, it is a little pricy. You have options to choose from 2oz, 4oz, or 6oz wine pours. The wines vary in price depending on the quality. But they had wines from all over the world which turned our night into an adventure. We ended up going with a 2oz pour (varies in price from $3 to $9) and trying different types of wine. They also served some really good looking cheese platters and desserts. The lady who owns the place is very sweet. She called herself our \"fairy wine mother\" which was adorable. And she told us that they usually test out new menu items on Tuesday afternoon (for free!). The interior decor of the restaurant was also gorgeous and a little on the fancy side so dress  accordingly. I would definitely come back here."], ["Natalie W.", "The Fried Pound Cake is the best dessert I have had in eons!!  It has butter pecan ice cream, whipped cream and caramel on top. I did my happy dessert dance while eating it.    Our friend told us that 6 of us could share it. Luckily, I didn't listen to them and ordered two.  After eating it is enough for 2 or 3 to share.The atmosphere is great and everyone who works at Greencork is fantastic.  They are all very helpful and courteous.The concept of the restaurant is great. You can try a few reasonably priced (in relation to the coast of medium and large pours) small pours before deciding which wine you want to choose for a full glass. The appetizers and entrees are flavorful and unique. The goat cheese appetizer and fig appetizer are both excellent choices.We will definitely go here again. Reservations are recommended."], ["Camille W.", "This place I'm speechless I had such a nice time the food was very good and the wine they have a very nice variety the atmosphere is very laid back I definitely enjoyed myself."], ["Gwen D.", "Hotspots like Greencork make me wish I lived in Memphis! Home for the holidays, I arranged to meet a group of girlfriends at the Cooper-Young wine bar. (One point for the chance to make a reservation!)Like a YoLo for vino, Greencork bills itself as a self-serve wine-on-tap wine bar. With the swipe of a Greencork card, we could sample two-, four- or six-ounce pours of fine and finer wines that ranged from $3.50 to $20 for a two-ounce try. At the end of the night, we were charged for all the pours associated with our card. Brilliant!Although Greencork's wine selection could certainly stand alone, I'd recommend my dinner dish, as well: Diviiiiine Butter-Poached Lobster atop fresh scallion johnnycakes and served with semi-sweet lime butter. (I wasn't as impressed with my friends' gnocchi in a one-note tomato sauce.) And of course, who could resist a shared slice of Fried Pound Cake?!Since I'm merely a wino in training, I wish I could've learned more about wine pairings! Perhaps Greencork's menu could recommend the right kind of wine to go with each dish. (Bold Red or Sweet White?)"], ["Tina J.", "I been here couple of times and let me tell u this place is amazing! Its filled with fine wines..Last time I was here, we were celebrating of one my best friend bday. We didn't really get good experience last time. we had to wait for about hr. n half just for a table. we waited for our drinks to get to our table for an hr. would I go back to this place? yes, but on busy night like Saturday, cause I don't think they will provide good service..."], ["Richard A.", "Had a great time! As the others have noted, self serve wine!One of the servers took away a dish too soon accidentally, and it was replaced without question.The French fries and hummus are delish!!! Great for sharing! Staff is very friendly!  Get your card, drink all you like, pay at the end! Will be back for more..."], ["Vim I.", "Adorable wine bar in the heart of Cooper-Young. The atmosphere like the other Yelpers have said is very cozy and and the wine stations are setup throughout the restaurant so you don't have to deal with long lines. They're split up by types of wines, like \"Bold Reds\", \"Crisp Whites,\" etc, and they rotate the wines out intermittently so you can have plenty to taste. Upon entering for the wine tasting, they take your credit card and hand you another card that gives you access to the wines. Everything will get charged directly to your card, so hold on to your access card! This process makes the self-service fool-proof. You can also decide if you want 2 ounces, 4 ounces, or 8 ounces. The food was also good. We had the drunken figs, coconut shrimp, and lamb sandwich. All of them were delicious. The lamb sandwich could have used a little extra heat, but very good otherwise. I was disappointed that we didn't get an itemized receipt at the end, it's kind of hard to remember every tasting you just did. The servers were a little quirky and really talkative, which was fine because we were there to have fun. But at times we were wondering why they wouldn't leave us alone. There is that fine line after all of being friendly and overly friendly.I would definitely go back again."], ["Amanda E.", "I love this place! I met up with a friend on a Tuesday and there were about 5 tables of people and no wait to fill my card. Thanks to the reviews here I let the hostess know I knew what to do and handed her $20, they also have an option to hold your credit card and ring you out at the end for those wanting the exact amount. There are four wine dispensing machines with eight wines each - 2 whites and 2 reds although one of the whites has several rosés. I was able to try four different 2oz pours and spent $15.50 on wine. They do have beer and cocktails available and the cocktails sounded amazing. Tuesdays are taste kitchen days so with a minimum spend of $15 you get a free sample of what the kitchen is trying out - which was half of a chicken panini, very good. We got the picnic basket and it was great! I wish my phone hasn't died so I could take a picture as it was beautifully displayed. A nice variety of cheeses, meats and accompaniments. They have a mixture of high and low tables as well as a fireplace seating area, a small bar and a couch seating area. Very nice ambience! The owner came to talk to us and she was very nice, as is the staff. She was great to tell us about some of her favorite wines. The wines change out often so going back will always be a new experience. If you are eating be prepared to spend at least $25 per person for food and wine but you could easily spend $40 or more per person so this does have the potential to be a pricey night out. I'm super excited to return with my bf and some friends but I don't see this as becoming a super regular place but rather a nice place to meet up with friends or a fun date night."], ["Bridges K.", "This is a lovely quiet place to try a variety of wines. The picnic basket is a great accompaniment. The hosts are very attentive. The only reason I didn't give a 5 is because there isn't much variety in moderately priced entrees."], ["Syd M.", "I've been here several times and each time I come there is always a warm welcome and the hostess is happy to explain the concept of the self-serve wine bar. The atmosphere is really cozy and nice for small groups. There is a mixture of seating; tall tables, short tables and chairs by the fireplace and off in a corner. The seating is limited so if your party is larger than 2-3, I'd say make reservations. The owner/\"Fairy Wine Mother\" always makes her way around to greet guests at their tables and ask about their experience thus far. The waiters and the owner's son are very attentive, checking in and clearing empty wine glasses off of the table regularly. You can watch whatever popular sporting event on the tv over the bar, especially a Grizzlies game. The food and wine are amazing! The vegetarian options are limited but the menu has something for everyone. Also, the wine changes regularly and is organized by type. This is a lovely local spot. I love the concept, food and the great customer service."], ["Jerry S.", "It's a really chic new lounge where you can sit by the fire and drink from a nice selection of tasty wines you serve yourself and eat delicious American/Southern style tapas.  I thought the meatballs and pretzel buns were awesome but it all was really good!The staff were very friendly and we met the owner who was very nice!!  Literally the only negative thing was at the end of the evening when my friend was taking a little longer to finish her second glass of wine, one of the staff told us to leave in a very awkward/rude way: he showed us his phone with the time (and we didn't know they closed so early and there were plenty of other customers still there), and then when we caught on why he was showing us his phone, he was like \"yeah... I mean we don't have a bed in the back!\" ...which I thought was a little humorous but also quite rude.Otherwise great though! Lol"], ["Joelle P.", "*Sigh* I realllllly wanted to like this place. I adore the concept (self-serve wine...whhhhaaaat), I am obsessed with Cooper-Young, and the staff is friendly - makings of a complete win. But the loading of the card/intro is just absolutely ridiculous. It takes a good 10 minutes for them to explain the set-up and if you walk-in behind a group that is just getting started...you're looking at quite a wait before you get your glass of wine. \"Ain't nobody got time for that!\" I like to walk-in to a place and get my alcohol ASAP. Plus, how much do you load on the card? If you load too much you have to come back and use it...and you'll probably never hit it just right. And if you don't load enough, you have to go back to the front counter. It is just exasperating. And then the cheese plate...don't even get me started on the cheese plate. There are 4 cheese on the plate, 2 of which have nuts in them...like those disgusting cheese nut balls. 1. If they have nuts IN the cheese, I think they should warn their patrons on the menu. 2. It is gross cheese. 3. I live for cheese plates so I was pretty disappointed. It really is a great idea but it is lacking...mostly with the loading of the card. But I was also didn't enjoy their wine selection that much either. I'm giving it 3 stars because I'm hoping they'll fix a few things. It has the potential to be a baller place. Here's hoping!"], ["Arpana W.", "I was really excited to try this place out. Self serve wine?! Great concept. It is unfortunate,  however, that they only had one server (the bartender) on a Saturday night. Poor guy was slammed. That plus the fact that it was sweltering in there made the experience a bit less than pleasant.  The food, however, was great. The cheese plate was beautiful and the lobster was delicious. Great presentation, as well. The wine was decent. Not as many varieties as I would expect from a wine bar; but good nonetheless. Adding a few more servers and reducing the temp a bit on the AC would significantly improve the atmosphere and overall experience."], ["Jeannine S.", "I went to Greencork a few weeks ago and I was certainly happy I went!  This is a family-run business, where the daughter works the back of the house and the Mom/Son run the front, and they couldn't be a nicer group of people!  Aside from the family, let's start with the experience...When you first walk in, you have to check in at the counter.  The person at the front gave the full run-down on how the place was set up since I was a first timer.  I read a few reviews on the amount of time it takes to check in.  Yeah, it's not super quick, but I would say all-in-all it took about 5 min.  One great thing to report is they now accept credit cards!!!  I read in a few reviews that they were only doing debit at the time (which is pretty typical of the pay-per-pour wine bars), but you can now walk in, get a wine card and then just drink away without having to refill like a debit card.The ambiance was very casual and nice.  They have a few lounge chairs if you feel like doing a cute date night, or you can sit at a regular table if you're looking to order food.Speaking of food, I didn't get a meal here, just dessert, and it was awesome.  I had fried pound cake, OMG.  So one of the best things about moving to the South was seeing what someone will think of to fry next.  It's not good for my diet, but great for my taste buds.  It could have used a little less whipped cream, but whatever, it was absolutely delicious.The wine was overall pretty good.  I was hoping for some higher end wines, but I'm not sure that the Memphis market would support paying like $10 for a 2oz pour of Caymus or Joseph Phelps reserve Cabernet.  The great thing about the wines is you can pay for a taste or a full glass, because everything is poured out of electronic dispensers.  If the Son is there, he will walk around and help give you recommendations, too.I love wine, so I'll be back.  But even if I didn't love wine, I will certainly be back to try some of the food and eat more of that pound cake."]], "Mollie Fontaine Lounge": [], "Bar DKDC": [], "Sabrosura Mexican & Cuban Restaurant": [], "South of Beale": [], "Arepa and Salsa": [["Ashley H.", "It was a beautiful sunny day when I pulled into the only parking space left in front of Arepa and Salsa. The sunroof was back, the radio was turned up, and I was only 10 minutes late meeting everyone. It was a good day! This is not a place I would have just passed and thought to stop in. Partially because parking is in the rear of the building off of New Orleans St. and I would have been aggravated that I couldn't find a place to park, and gone somewhere else. By the way - \"thank you\" to the nice man I accidentally and unknowingly blocked in a private parking space for not having my car towed... Don't park in front of the restaurant people!When I walked in, no one was there yet for the UYE.  I just assumed that Veronica had told me to be there 30 minutes early hoping I would make it on time. That wasn't the case, everyone else was running late too. That was cool because I got a chance to look over the menu and take in the atmosphere a little. The inside of the restaurant is painted a somewhat bright colors with pictures of famous Venezuelans  covering the walls. The TVs are on Latino stations.  The comfy booths are upholstered in a trendy floral fabric.  There's also a little patio in the front that I can't wait to try out. They definitely get an A for the atmosphere. As soon as everyone else got there, we ordered our food.  Everything on the menu looked unusual and interesting. I'd really like to try it all, and I plan to do just that over several trips.  I started with the fried cheese sticks.  They were different from typical cheese sticks.  I'm not positive what kind if white cheese they use, but they are wrapped in dough and fried. They came with this great garlic cream sauce which is indescribable. When it came time to order an entree, I was a bit indecisive because everything on the menu looked and sounded so good.  I asked the sweet little waiter to just bring me his favorite thing off the menu. He brought two tostones - one with shredded chicken and one with shredded beef. They were both scrumptious!  I have to say that even though I'm a lover of chicken, I liked the beef tostone better. They were served on plantains, rather than bread, and topped with lettuce, tomato, avocado, and some sort of sweet slaw. I quickly scarfed mine down and made a happy plate! I even got a to-go order to take home to my son and he loved them. He has asked me several times to take him to there for dinner.  He's a little food connoisseur in the making. The service was great!  They little guy taking care of our table reminded me so much of my son that I wanted to hug his neck. (Spence thinks he's too big to hug his mamma now.) Don't worry, I didn't hug the waiter. That would have been a little creepy for the poor kid, and everyone else at my table for that matter. He was attentive and very helpful with suggestions when we had questions about the menu. I got the feeling this is a family owned and operated business.  The staff was very warm and personable. They give free salsa lessons on Friday nights. I'm thinking I should get in on that if anyone wants to tag along. I'm not exactly graceful or coordinated, but booze helps me think I am. Let's hope it's BYOB salsa dancing. I'm sure it will look like a Saturday Night Live skit of Dancing With The Stars, but in my head, it will be smokin hot.  My second visit was with my husband and other son. We had the shrimp tostones for an appetizer, and they were addicting. I had the DePabellon, hubby had the tostones, and the boy had a Venezuelan hamburger. We left with happy tummies.  Thank you Yelpers for turning me on to this cool little spot!  Can't wait to go back again and again!"], ["Elio R.", "Food is OK but not really 100% Venezuelan. The place was really clean and service was goog. Food is a little overpriced. $10 for an \"arepa\" when in Miami is $6. Nothing special, I don't think I'll be back."], ["Leo B.", "We live in Collierville, so this place is quite a hike.  The first time we tried to go we went on the wrong day and they were closed, and from the street it looked like well, not much.  Fortunately my wife forced me to try and go again.  This time they were open, and we were forced to find the ample parking at the rear of the building.In a place like Miami this would be a solid 4-star location.  In Memphis this is a 10 star option.  This is food you cannot get anywhere else in memphis, and it is very, very good.  We went with a group and got almost everything on the menu across the group, and there were no disappointments.I wish we lived closer, we would go more often."], ["Lauren W.", "SO GOOODDDDI dropped in to get some of the vegetarian tostones for take out.The vegetarian tostones are like two little sandwiches with the fried plantains as buns. The main filling is made of black beans, mushrooms, and caramelized onions. There was also lettuce, tomato, avocado, and some sort of aioli.First of all, the aroma was the absolute best. It took all of my willpower to not pull over after a minute because the food made the whole car smell delicious.And the wait was well worth it because the tostones tasted just as good as they smelled. The portion size was good for the price. I ate a little too much because I was way too into the food, but that's my fault."], ["Reggie W.", "Went here for the first time tonight. The food and service were good! I enjoyed the black beans and rice with the slow cooked beef. Great flavor and the plantain chips were awesome.My wife enjoyed the beef arepa. We will go back again the food and service are great reasons to go again. Great place to enjoy a relaxing evening."], ["Andy S.", "So... the other day, my dinner crew was going to a new restaurant that had a super long wait, so we made the change to try out Arepa and Salsa.  I had been wanting to try them for a while, but for some reason I hadn't.  This was right before Christmas, and they ended up having a Christmas special.  They had a typical Christmas Venezuelan meal.  Naturally, I had to order that.  I also had an order of their UFO's, which is basically fried cheese.  It was ok.  Another member of our crew ordered the tostones cups.  These were great.  Their were several different ones each with a different meat.  Another member ordered the empanadas which were also very good.  Now, back to that Christmas meal.  It was very tasty, but also unique.  I had never had some of the items quite like they were prepared.  The main dish was called Hallacas.  This was kind of like a tamale but it wasn't in a husk when it was served.  It had a variety of meats, raisins, and olives in a maize type substance.  It was tasty.  I wish it had been a little warmer.  It also had a pan de jamon.  It was like a mini sandwich that had ham, raisins and olives in a pastry type bread.  There was also a cup of chicken salad.  It was very heavy on the potatoes.  So, I googled the information after the meal and that is really what they eat.  It was different, but in a good way.  I need to go back and try an arepa.  I recommend this place!!"], ["Okwe O.", "The Tostones are excellent!! A perfectly fried plantain bun nicely compliments the meat, lettuce, avocado, and house salsa inside the sandwich. I had the shredded chicken the first time, but I had to come here again to try the shredded beef. Definitely wasn't disappointed!  I think my fav is the shredded beef, but they are both delicious. You can certainly try both since your order comes with 2 sandwiches. Service is.. meh...but they did have some friendly staff. The food gets 5 stars. The only real downfall is that they don't have a location in Texas!"], ["Husni E.", "First time eating at a Venezuelan restaurant....Arepa and Salsa was a good introduction I think!  Lets explain the 4 not 5 stars...service was great but slow especially since get weren't really busy! So it's really a 4.25! Can't wait until Yelp goes metric!!!Now the food, I had the tostones cups for the appetizer, it had chicken beef and shrimp: it was a bite-sized piece of heaven.  For my main meal I had the De Pabellón Arepa with beef and a side of their spiral chips...the food was very flavorful and filling, only issue was that the bottom half was soggy.  Again, the negatives were not unfixable so I'll definitely be coming back for more...gotta try the Tostones!!!"], ["Neal C.", "Man I wanted to love this place. Fills a totally unserved niche for Latin in Memphis, great service (really friendly and accommodating), unique and authentic atmosphere, etc. Unfortunately, the food just lacked distinct flavor. Cachapas had a decent sweetness combined with the salty pork and mozzarella but it had nothing excellent about it. The arepas were very subpar: not crispy at all on the exterior, and had less than three ounces of meat compared to gobs of mayonnaise-y sauce. Tostones were likely our favorite, as the fried plantain chips provide a unique addition to the baked beans and meat within, but still don't warrant another trip."], ["Manuel Z.", "Great food and nice service. Dishes are served with a very nice presentation. I had the arepas, which are similar to a pita sandwich, but the bread is corn. The dish was served with potato chips (not sure if home made though). The second time I visited I had the shredded beef cachapa, it looks like a crepe, but it is 10 times better. Lots of cheese in it. My wife had the pork tostones, which are two small plantain patties forming a sandwich. Very good, but loaded with a creamy sauce that can get messy :) Definitely recommend this restaurant."], ["Prashant M.", "I went there after reading such good reviews. Food was ok. Not to my taste though.The server I got was either lazy or not interested in working. I finished my ice tea and have to literally tell her for another one 10 min. after my glass was emptied. I couldn't do it again since I  don't want to be demanding and had to leave thirsty. It may be that I went there in the servers bad day. The UFO was crunchy but flavorless even with the dipping sauce. I ordered vegetarian arepa. The sausage was good and so the vegetables in it (black beans, mushroom, lettuce)  but the flour bread was very hard to bite. I had to leave the bread in the end and finished the filling. The plantain vegetables tostadas was good. Overall, i would have liked the place if the attitude of the server had been nice. I don't think I'll be going back. I don't want the food if it is costing me the service."], ["Leang C.", "Visited on a work trip. With the reviews, I was expecting a great dinner experience and great tasting food. The server was very nice but the food was bland and felt like it was all just thrown together. Most likely will not revisit."], ["Taylor W.", "Incredible food and service. I had the cachapa. My wife had the empanadas . The cachapa was one of the best dishes I've eaten in quite a while. The empanadas were great but small ( as there were supposed to be in the appetizer section) I wish they had a bigger version of it. Overall my experience was wonderful ."], ["Rob B.", "This is another place I tried this week on the basis of rave reviews from my Yelp! buddies. And while it was good, I wasn't blown out of my seat. Part of the problem was after reading the previous reviews, I had extremely high expectations -- so high that perhaps I was setting myself up for a let down. The food I ordered looked like a small sandwhich on flat bread -- it was actually a fried plantain with shredded beef, slaw, sheese, avacado, and ?? -- held together with a tooth pick (like a hamburger at Huey's). I tried to eat the first one by picking it up.....I don't think that was the proper method because by the end of the first one I had narrowly missed putting most of the \"sandwhich\" in my lap.  -- I used a knife and fork for the second one.My friend ordered an Arepa which came with homemade potato chips -- fried to order. While I didn't try the Arepa, the chips were soggy with grease. Not so much as to be inedible, but definately not the intent.So I feel like a traitor giving this place only 4-stars after seeing that so many others are smitten by this place. I'm going back...maybe even today...and hopefully I'll see what everyone else has experienced. To that end -- I would recommend going if for no other reason than to just try something different. It's a nice place -- simple, nicely decorated, clean and very friendly wait staff. It has all the right ingredients for a 5-star review if I can get on board with the food."], ["Eliza R.", "Totally drool-worthy food here at Arepa and Salsa!  I went mid-week around 5pm and I was the only person in the restaurant, so I was in and out pretty quickly.  I ordered a fresh mango juice which was like the nectar of the gods, and a tostones sandwich.  HOLY COW.  The plantains were fried to perfection, and the flavoring and sauce were amazing.  Choosing items from the menu was a little difficult, because everything looks so delicious!  I'm happy with what I ended up with, though.I liked that the space was a little divey, but still cute and clean.  My server was very sweet and attentive, as well.  This little gem in Memphis is highly recommended.  :)"], ["Andrea B.", "Yummy!!! Absolutely delicious Tostones.The owners are very friendly and service was good!!"], ["Elizabeth L.", "Unique and delicious food! My husband got the cheese cachapa which he devoured, but was a little rich for me. My vegetarian arepa was excellent and filling, although next time I might trade the homemade chips for another side, not because they weren't tasty, but because some of the others (like the 'salsa' that came with the cachapa) looked so good! The only reason I give 4 stars is that our 8 year old was harder to please. We got her shrimp and chicken tostones cups which I recommend (despite being a small serving for $6) but she wasn't a fan of the plantains or of our dishes. She ended up devouring my chips and eating a side dish of rice. Perhaps it's more accurate for me to say that Arepa and Salsa gets 5 stars unless going with picky eaters?"], ["Theos M.", "Great food, mid-high prices and the service is great. One thing for sure is that it is not smokey as the burger place that was here before.Am a visual person, so more pictures for plate reference would be sweet!"], ["Dan B.", "Loved it! Fresh and delicious !! Great plantains and arepas and even dessert was awesome !these guys figured it out hope the public catches on so these guys can thrive"], ["Liz J.", "This food is simply amazing! I have never had Venezuelan fare before, but it was flavorful without being too spicy or overwhelming. The quantity of food for the price also can't be beat. I had what I would call \"nachos\" as an appetizer, and then a \"plantain sandwich\" filled with beef, coleslaw and avocado as my meal.I'd definitely go back and recommend all my friends to dine there, too."]], "Flight Restaurant & Wine Bar": []}