{"Eat Well Sushi & Grill": [["Sierra M.", "I love this eclectic buffet. The atmosphere is soft and dark which gives a great illusion of privacy. The food is a wonderful mix of American cuisine,  traditional Japanese fare  and sushi that can (and does) make your mouth water. The only thing I truly dislike... the desserts. Or lack thereof. Chocolate dipped marshmallows and spongy cakes. That's it. They do offer to bring a bowl of ice cream. But that is all. And their salad bar leaves one lacking. Other than that, it's a great semi-upscale buffet to settle your sushi cravings."], ["Dawn M.", "Looks like people are moving things into restaurant and one dumpster is gone. Hopefully will open in a few months . If I had been driving I would have jumped out of the car and asked ."], ["Richard H.", "Food is good.  However they refused to honor 2015 Entertainment Coupon for 25% off entrees for up to 4 people.  They said they didn't know why the coupon appeared in the book!  Very poor way to handle.....  I won't be back."], ["Daniel K.", "Wow $10 for a lunch buffet is a steal.  I went in there thinking it's a sushi buffet but its a lot more than that. Most of the items are cooked on the grill and very lightly sauced.(Looks a lot healthier than your regular buffet)I absolutely fell in love with the grilled chicken breast which are grilled in big pieces. The sushi was super fresh and there were about 30 different rolls to pick from.You're getting grest value for a $10 lunch. Next time I'll stop by during dinner to see what $20 gets me."], ["Coral W.", "I am a regular customer of this restaurant. As a buffet setting, it is 5 stars for me for the overall quality, variety, and good dining ambience. The staff and servers are very friendly for sure. I call this buffet an \"upscale\" one for it is much better (and of course more expensive) than most of the cheap Chinese buffets you usually go to. This buffet provides a variety of really good gourmet entree items like Asian spiced stewed beef (my favorite), Vietnamese spiced salmon, Korean spiced pork, stir-fried seafood (real shrimps, scallops and squid!) with vegetables, tonkatsu (Japanese fried chicken cutlet), Thai curry chicken, Chinese spiced ribs (very delicious!) I tried all of them, and they are consistent and delicious! (Imagine you will probably have to pay $15 for any of those single entrees at a restaurant!). This buffet also offers good side dishes, such as spring roll, tempura (shrimp and a variey of vegetables), pot stickers, grilled veggies and seafood, fried rice and noodles. They are delicious as well. I am impressed with the tempura, especially. Though being in a buffet setting, they change foods quickly to keep every item fresh. Now, the sushi section. Most of the rolls are decent, though I would not compare them to the rolls made to order at a sushi bar. But still, those rolls are still good enough. Another great thing about this buffet is that they offer a variety of sashimi! They have salmon, tuna, yellow tail, octopus, etc and they are surprisingly fresh! Since sashimi is popular, they are out quickly but re-stocked very quickly too! Their mussel with mango salsa is very tasty too! I also like its salad section since it has my favorite seaweed salad! Their soup section is decent too (miso, seafood and Vietamese ). Seafood soup is a must try. :) As for the dessert, I usually only eat the creme brulee, which is good (and all you can eat!) I am not really impressed by the variety of the cake, though. (As another reviewer mentioned, I would rather they have fewer cake items but upgrade their dessert section as a whole.) They also offer green tea and azuki bean ice cream, and they are yummy! They also offer unlimited stir-fried clams and crawfish. Your server usually asks if you want some of them, and they will bring them to you. I am not a fan of crawfish, so I sometimes asked for clams, which are yummy!Overall, I think this buffet is a very good one. I usually left this place with satisfaction! Now I either go there once a week or at least every other week. :)"], ["Rick G.", "The pluses - friendly staff, yummi gyoza, and they even had creme brûlée cups for dessert.The negs: Their sushi (buffet) was just the typical buffet experience. Lotsa food, moderate quality/taste.Not a bad place, passable food, but not a \"first choice\".."], ["Kenus L.", "As much as I would love to give Eat's Well a \"5\" star, I cannot. Eats Well recently reopened a few months ago after being closed for a year or more.Before they closed, the food was amazing and delicious! However, when they reopened things were not the same. I have visited Eats Well twice since their reopening and both times I've left unsatisfied. The Customer Service is great, and I love the waiters and waitresses. However, the food isn't so amazing anymore. The sushi is fresh yet it's not the best, the desserts are disgusting and some of the meats on the buffet are dry. Also, the dinner buffet is over priced. Nice atmosphere yet, the food isn't that great. To say the least, it will get you full and satisfy your hunger. BUT, it won't completely satisfy your taste buds! Alternative Tip: Try Osaka; they have the BEST sushi and fried rice. Good Luck!Warm Regards, Kenus Lee"], ["Michael M.", "The service was actually excellent, everyone was super friendly.  I have been here before and the food was decent.They recently did a renovation it seems - place looks good but the food is now absolutely terrible.  Sushi is dry, cold, and tastes like it's been sitting for hours.The hot food was not hot, mildly warm at best and VERY low quality. Like grissley and dry and flavorless.My star rating is based on the food alone.  Like I said - service was excellent and always has been,  just found wish the food followed suit.EDIT:  Just got the check, drink and \"weekend dinner\" - $25 - I won't be coming back.  That's absurd."], ["Jeff M.", "Best sushi buffet in town, period. Just get there a little early. By noon, it's packed and they have a hard time keeping up with the hot buffet."], ["The Yelp-inator W.", "Decent sushi on a buffet!   Not the best sushi in Memphis, but it is good and they have several other dishes as well.Need I say more?"], ["Bill K.", "Great mixed Buffet.  Great place to go if someone in your group doesn't like fish since there is plenty of farm animal meat available.  Very high quality for an Asian buffet."], ["Amanda E.", "Yum! I am so glad this place has reopened. I love that its a \"high end\" buffet. Lunch is $13.95 and dinner is $19.95, IMO it's best to go at lunch. Very nice food options : steak, seafood, teriyaki chicken , tempura shrimp , ect. There's at least 20 different sushi rolls with a nice variety of ingredients. Good salad bar but I never waste tummy room on that. Desserts are ok but they will also bring you ice cream."], ["Brenda C.", "Awesome staff, great customer service, amazing food lots of variety, fresh buffet and actually clean, management is very kind, completely recommend this place :) we'll be coming back"], ["Jason C.", "Eat Well is a solid American Japanese buffet experience all around. As a Memphian, this is my favorite Asian & sushi buffet in the area.Wait time: There is usually no wait time, as the restaurant is considerably large. Atmosphere: Super clean and neat for the most part as well as a sort of a \"formal\" ambience feel to it.Service: Waiters/waitresses are very professional & do a good job topping off drinks & checking up on customers.Food: The food here is ALWAYS fresh & hot! The buffet line is also directly in front of the grill which is awesome. There is a lot of variety to pick & choose from & the food is pretty tasty unlike a lot of other buffets.Make sure you go for lunch, as the price doubles for dinner (with a couple more food options).Solid experience every time: 4/5"], ["Yuan Z.", "Really good! Love the sushi! Love the soup! Love the BBQ! Love the beef! Nearly every dish is great!"], ["Daniel M.", "Think Texas de Brazil for sushi.  They have redesigned the sushi bar a little and expanded the buffet as a whole.  Sushi good? Check. Great buffet options? Check. Prompt and attentive service? Check.  This place has got it all.  As a sushi and buffet lover, the two of these together is just about the best idea for a restaurant.  I seriously don't mind the higher price because I think they are coming out on the losing end here."], ["Viet T.", "Spaciously huge tables.Beautiful decor (no more fish tanks though)Delicious tom yum and that asian seafood soup i only get to have at asian wedding receptions.Those were the positives of my second visit.SteakServiceokaysushi selection.feeling extremely bloated after just 2 plates(and i mostly only had their assortment of kimchi and some meats)tempurathe badsI still do like the atmosphere of the place but overall the food needs a bit more work, the tempura for instance is a bit soggy and relies to heavily on the tempura sauce to give it flavor, spring rolls felt frozen cold inside.The sushi selection for lunch could also do with a complete overhaul, definitely less handrolls with cream cheese and cooked crawfish. Fresh fruit would also be a huge plus. (they do have chocolate covered strawberries but make sure to get that fast, they replaced it with a mini smores thing)Aside from the soup, pork skewers and flank steak, do yourself a favor and order a la carte from somewhere else.Hopefully dinner is more bang for your buck and they'll have a decent selection of sashima.Oh and food quality is just fine, they just don't know how to season or keep their hands light on the grease."], ["Gerald M.", "Its a good buffet for the price. The dinner meal is worth the extra $$ because of the crawfish and the thick sliced sashimi. The short-ribs are a must and also the tempura. Sushi rolls are average but will suffice your cravings. I would take my guest here when they visit."], ["Rhonda P.", "Pretty good for a buffet.  Expect to pay about 20 per person, but am lot of food.  Sushi is mostly fresh.  Just opened back up after a long renovation."], ["Stephen O.", "I used to love Eat Well. I really did. I was such a big fan of them in every way, from the giant fishtanks to the huge glasses of perfect sweet tea to the great sushi to the... well you get the point. Then, they closed... for a long time.I actually did not even realize that they were back open, but I went with some friends to check them out last weekend. First, let's talk about the good stuff: the sushi is pretty great. The key is, it's fresh! I would not pick it over a dedicated super expensive sushi joint but for the price you cannot beat their wide selection and unlimited nom nom nom... sorry, got carried away. The fried shrimp was still great, the spicy pork was good, and the dessert cakes looked as good as ever. The waitress kept me with plenty of that delicious sweet tea too, so that was good. Then Stephen, you say, why not four stars then if the sushi, service, and tea were great?Here is the problem: the hot items were not that great (except for a seafood dish, the shrimp, and the spicy pork). Also, about 1/5 of the buffet was tempura (where it used to have a lot more variety of foods available. That being said, I am not being critical. If everything was like that and the sushi, service, and tea were as good as they were, I would normally give four stars. There were two major problem areas: one, the table smelled. It smelled like it had been wiped down with a dirty rag. This kind of puts one off the food. Worse than that, however, was the heat. It was hot in there, the air was on 80 and they said it was not working right. I don't mind eating while I sweat, as long as it's from the spices! In this case, it was just hot. I don't do hot. Not when I am eating, not when I am NOT eating. So, three stars because I am deducting one for cleanliness and comfort issues. I will probably be back."]], "Edo Japanese Restaurant": [["Katzia R.", "The best Japanese food in town.If you are looking for fantastic authentic Japanese cuisine for a very fair price, Edo is going to soon be your favorite spot. I have never had a bad meal or bad service, everyone is friendly and everything is delicious. Fish is always very fresh and everything is clean.Try their Chirashi and the Banzai roll. To die for!"], ["Huyen T.", "I tried this place out of curiosity...at the end of it. I was not happy about it. I'm not saying the food was awful, it's just the service. The waitress actually requested me to give her more for her tip. She even pointed out that on the receipt that I need to give her more. Unbelievable....I mean I'm willing to try out this place again, but that incident last time keeps reminding me that I shouldn't go there."], ["N C.", "I love how quaint and tucked away this little joint is. The Japanese staff speak English with an accent, so I take that as a sign of authenticity. They have a great lunch special, and I usually get a nigiri combo to share. It's all fresh, and comes out quickly. I need to try the ramen next time -- pork and noodles in a soy based broth."], ["Art L.", "I have certainly had much much better Japanese, but for straight no frills, authentic sushi, Edo is a decent place to venture to. If you are from NY or LA, forget about this place unless you have a craving or you're into authenticity. The thing is, it has much more potential and could be 'on the map'. The chef is definitely trained and the fish was fresh when I was there. The problem is the dated slummy izikaya feel to the place. Seems like a dead vibe. No sake, tube based wasabi, Kikkoman soy sauce, red gari, add the location and I was generous giving this place 3 stars."], ["Sarah N.", "I am relentlessly picky when it comes to restaurants. It's official, this is my FAVORITE place to eat EVER. Three reasons #1 Consistently awesome service-there is an excellent work ethic here that is hard to find in the south. #2 Consistently awesome food-I have been to EVERY. SINGLE. JAPANESE place in Memphis and this is the best!!!  #3 Consistently awesome prices. I went there last night with a friend and we ordered whatever we wanted plus brought our own wine for 2 dollars each and the total without tip was only 45 dollars. Zero complaints from this picky diner!!! I LOVE THIS PLACE!!!"], ["Jennifer G.", "My family loves this place because it is in our neighborhood and the prices are affordable."], ["Alexandra P.", "I really rioted our lunch at Edo. I had Chicken Tokyo which was awesome. My husband had Yakatori which was also very good. I thought the restaurant was charming and the waitress was delightful. Our only complaint would be that there are only booths.  We really prefer a table with chairs but that is a small issue. A very nice visit."], ["Tiffany C.", "I was at a business on Summer today around lunch time and asked the workers to give me some suggestions on where to eat around there. The places thrown out there were La Guadalupena (been there), Babylon (Mediterranean food) and Edo. It was a close call between the last two, but Edo won out today. I saw it reviewed a while back in the CA, but it's kind of tucked away, so it escapes your mind when thinking of Japanese. This may be a bold claim, but so far, it's the best Japanese food I've ever had. The sushi was PERFECT and I absolutely loved the cucumber salad. My dining companion had the lunch chicken teryaki, which came with clear soup, salad & rice. My sushi combo & her teryaki were each $6.25. Not bad, considering what Backyard Burger charges for one of their crappy combos.My companion was kind enough to let me try their teryaki and it was good....but I just prefer sushi. We also shared an order of gyoza, which, in my opinion was nothing special. (I make better) The spicy dipping sauce that accompanied it was nice, and they brought out some ponzu as well.  I will absolutely, most definitely be back!!"], ["David M.", "Edo was a favorite of the Japanese punk rock band Guitar Wolf, when they visited Memphis.Hidden in a strip mall, behind Federal Equipment Dealers &  the strip mall that Taqueria Guadalupana is in, look for the white lighted 'geisha' sign.Edo is a small Mom-and-Pop Japanese restaurant without the usual sushi bar or grill area. They do serve very fresh sushi and good basic Japanese dishes at affordable prices.Service is always friendly and attentive."], ["Angie B.", "Best clear soup I've had at a restaurant. We went around 5 pm and had great service. The shogun special was delicious and the portion was big for the price. We will definitely be back."], ["Mike G.", "Okay I've decided to update this review.  My first one was pretty brief anyways.  I love this place.  I haven't found better sushi in Memphis.  It always seems very fresh and well crafted.  Plus their tempura is fantastic.  I usually either get the seaweed salad or the squid salad and both are wonderful.  Honestly, I haven't branched out and tried their entrees.  They look nice on the menu, but I just enjoy their sushi so much I never think to order them.  The service and atmosphere are both great."], ["Boga B.", "so so good, but they once scolded me for only coming in for dessert.  i still fantasize about the tempura soba, though"]], "Sekisui East": [], "Sekisui": [["Tony F.", "Always great service. Sushi is always spot on and the best fried rice in the city. It's a great place for hibachi also. It's a weekly thing. Lol"], ["Neek C.", "Good food but I had to give it 2 stars. Why? A big ass bug crawled on my guest. That bug was big. It would have ruined my appetite but I was done eating."], ["Tammy P.", "Tried the teriyaki burger tonight. O.M.G. Best burger in town! Beef was fat & tasty & juicy. Bun was a soft fresh roll. Teriyaki  on the  side wasn't  needed because  of the flavor cooked into the beef. Lettuce & tomato was very fresh as expected  from the owner. He only serves fresh seafood  & vegetables & meat. Something we take for granted & think we're getting  elsewhere  but we're not.  Sekisui Bartlett is an underrated  Japanese steakhouse!"], ["Chrystal F.", "I have been here before and had no complaints. Not great but not bad either. Went there today for my birthday lunch with co-workers who had never been there. It was awful! The food was not brought out on time. A couple of people in the group of 6 didn't even get their meal until we said something to the manager. The waitress forgot my soup and brought someone else the wrong soup. My boss said no sauce on her chicken and her food was drowning in sauce. I'm not sure if I will go back but I'm pretty sure the people with me won't ever go back. Pretty sad!"], ["Dawn M.", "I've been to other locations but will drive over to Bartlett for this one close to my husband's office.Always great service and good food. Love the wall fountain when you walk in and the basic sushi. I haven't been to the hibachi grill side....seems to be always empty when we go."], ["David T.", "My wife and I were regulars at the old Humphrey's location and were pretty bummed when it closed; though we welcomed the opening of this, more compact (space- and menu-wise) version a couple of years ago, we sorely missed the atmosphere and many menu items from the old location, and Sekisui quietly and sadly slipped from the forefront of our minds. On a whim, we returned last night and were pleasantly surprised at the changes implemented since our last visit--ambient (instead of harsh white) lighting, a more lived-in feel overall, and a somewhat expanded menu. Most of all, we were thrilled to once again have the Andy roll, which is a smoked seafood mouth party every time. The nigiri was fresh, service was pleasant, and the prices don't seem to have jumped up too much in the past year or two. We'll be back."], ["Angie Q.", "Can't seem to get \"to go\" orders right. ..Spicy means to add the spicy sauce.  The last time there was no katsu sauce for the chicken katsu."], ["Sandy J.", "Not that impressed. I had the steak, lobster and shrimp dish. I asked for my steak to be medium rare and it wasn't. The lobster was over cooked and the food needed seasoning. My husband had The steak and chicken which was just OK. The server was great but that was it. 63$ of just OK. Won't go back here."], ["Lisa S.", "I don't give praise lightly.  In fact, 5-star praise is almost unheard of.  BUT...Sekisui has given me cause to take to social media and dish out some well-deserved props.  The food is so, so, SO GOOD!  I took my mom and daughter two weeks ago, and it was the first time my mom had eaten hibachi style...ever.  The food was perfectly prepared by our chef, Hi (probably misspelled,  but that's how you pronounce his name) and he was an absolute delight!  She loved the whole experience.  So, tonight I took my husband...just to make sure I had an objective opinion.   I asked if Hi was working, and he was, so I requested him.  I had the filet and scallops.  My husband had the chicken and shrimp.  Our food was perfect.  And PLENTY!  And he was, again, just a delight.  Go eat here.  Ask for Hi if you do hibachi."], ["Tracie R.", "Love love love the service and the sushi!!! The lotus blossom drink is the best!! The bartender was so sweet to tell us the recipe."], ["Emily C.", "I eat here several times a month and my experience tonight beats any service I've ever received anywhere. Leslie was over the top amazing. She started us a reward card, which we had never been offered before. This will save us a ton of money at our favorite restaurant. Please make sure you ask for one if the server doesn't offer it to you. We had a total of 7 rolls, 1 being one we got to create ourselves - super fun & yummy! The owner/manager visited with is several times, as always. They are always very accommodating when we bring the children. Again, I highly recommend Leslie and can't wait for our next visit to dine with her!"], ["Jasmine L.", "Love this place! The ambience is great. We waited approximately 5 minutes to order. We were served our soup and salad within 5 minutes and our hibachi chef began preparing our meal within 5 minutes of our appetizer arrival. The food was great! I definitely recommend this place!"], ["Barrett R.", "I got ripped off.  Didn't want the edamame until check was added.  Charged for it anyway.  To be polite, I asked that it be taken off or other courtesy.  Clearly after another $6.50 beer or comp roll, my English was not received.I don't care for this entire family of restaurants for the simple fact that I have been burned with coupons EVERY time.  For God's sake, rolled rice with some fish is not worth the price.  I will NEVER patron this or any other of these sad excuses for fresh sushi.Every roll has either a fried component or mayo.  Blah!"], ["Carol M.", "Great food and awesome service!  Chef was great and very personable.  Fried rice is delicious and so much food you won't leave hungry, that's for sure."], ["Danielle M.", "Went here after scoring a great deal on restaurant.com certificates (Check it out! Save you some cash on the trip.) I wasn't expecting much after reading some of the reviews here but was pleasantly surprised!  *Our family can not do the Hibachi thing, as my 3yr old will see the fire and start screaming -crying, probably ruining everyone's quiet lunch Because of this I can only rate the dining room experience : ) We ordered some rolls  to start : Big Cheesy (salmon, cream cheese, tempura fried) and Jimmy Walker (Avocado,cucumber, assorted fish w/ wasabi roe) and enjoyed them. My 3 year old had Gyoza and loved it. For the main course I ordered the Seafood soba and shared with my son. Even with sharing we had enough to take home for another meal. My husband had the tuna tataki and his plate was clean soon after.   I have a second gift certificate available on the site I used to get the deal.  Guess what? These people are getting my money again."], ["Anthony S.", "I want to preface this review by saying that I believe this is a solid 2-star joint; but for us, the individual who was operating the hibachi on this night was absolutely fabulous.  He was funny, interactive, enjoyable to dine with, and sincere.  This is why it gets the automatic bump to a 3-star establishment.  My wife and I came here for Valentine's Day with our daughter. As all you parents may have already found out...after you have kids, holidays (even the ones that are meant for couples) are all about kids.Food: The food ranged from 'not-very-good' to 'good'.  The starting salad was not very good.  It was basically just iceberg lettuce and a soy-based dressing.  The starting soup was nice, hot, and flavorful though, so that was in the good category.  In addition, I ordered the 'Jumbo Shrimp and Ribeye'.  I am not particularly pleased with the size of the 'jumbo' shrimp though -- they were honestly the size of a normal shrimp you'd buy at Kroger.  Whereas the 'regular' shrimp were tiny.  In addition, the shrimp wasn't really seasoned to my liking.  I just didn't like them. The fried rice was o.k.  In my opinion it wasn't seasoned very well, and there were too many onions which sort of over-powered the rest of the dish.The high point was the ribeye.  It was cooked and seasoned exceptionally well, it was tender, and flavorful.  It was a nice way to end a relatively sub-par meal.  In fact, the meal was so underwhelming, we decided to go elsewhere for dessert.Food: 2 / 5Service: This is where the establishment made-up some of its points. Like I prefaced in the introduction, our hibachi attendant was super nice and very interactive.  There isn't much to be said besides he was fantastic.  On the other side, the regular server was o.k-at-best.  She seemed inconvenienced when I asked her to empty the gratuitous amount of ice in my Coke, and also seemed as if she didn't want to be working on V-Day.  I don't know, but I wasn't impressed with her level of service.Service: 4 / 5 (2 for regular server, and 5 for the hibachi operator)Atmosphere: It was a nice atmosphere.  I liked the waterfall right when you walk in, the furnishings were classy, and the rest of decor was very tasteful.  In addition, one thing I always look for is cleanliness, and this was a very cleanly dining room and restroom.  The one thing about the atmosphere that annoyed me was the music.  Sigh...call me weird, but I am not a fan of hearing Justin Bieber in the background while I am dining at a Japanese restaurant.  I would much prefer Japanese/Asian inspired music, Classical, or really anything other then Brittany Spears and Will.i.am or Bieber in the background.Atmosphere: 4 / 5Price: I thought it was a little over-priced for the overall quality of the meal;  however, we had a coupon from dine.com that we used, so it was 50% off.  I feel as if what we paid was a little more appropriate than the full price we would have paid.  Price: 2 / 5Final Impressions: We will not be back to Sekisui since there are so many other dining options in the area offering similar fare.  We figure that we might as well try something else since this was such an underwhelming experience.  I would recommend not coming here unless you have a coupon like we did."], ["Wayne R.", "Not very good.  The price is too expensive.  The taste is bad.  Stay away.  Stay far away!"], ["Drew A.", "One of my favorite sushi places in all of Memphis. This is one of the only locations (next to the new one at Poplar Plaza) that has hibachi. They have four hibachi tables. The good is spectacular and the atmosphere is great. Spicy tuna is not the cheapest at $5.50/roll but the quality is worth it. Definitely worth your time and money if you're looking for good sushi and hibachi."], ["Sandy G.", "The sushi is great and tasty. But what I like about this place is the drink specials. So come with your friends and relax."], ["Jake R.", "Decent sushi, but not the best in town. The ingredient are fresh enough and the rolls are mildly imaginative. However, you get smaller rolls here then you do at other sushi establishments in town. But in a pinch it's not bad and they do offer a hibachi grill which looks good, but I haven't tried it just yet."], ["Liz J.", "Their hibachi is pretty good, but we were disappointed in the sushi rolls we ate tonight. The flavors weren't quite right and the sushi itself wasn't as fresh as I think it needs to be.We are regulars at Red Fish (64 and Canada), and they, by far, have the best sushi in NE Shelby County and probably most of Memphis."], ["Scott P.", "Anyone who says this isn't one of the top three best sushi restaurants in this little landlocked town rarely ventures past California rolls or has no idea how to order sushi.  If you want fresh ridiculously tasty nigiri, sashimi, rolls or omikase (I really recommend Henry's omikase or his take on a fresh salad) this is the best place to get it without the 45 minute drive! A great big hint on this little jewel is to call ahead and make sure Henry is working. He is heads and tails above the rest and I have tried them all extensively. Next on the list is blue fin downtown, both have consistently fresh fish and highly competent chefs that cut generous portions... Kampai!"], ["Heather S.", "I have a soft spot in my heart for the various restaurants in this chain. The Sekisui in Bartlett is one of the newer Sekisuis, and it's rapidly becoming one of my favorite places to go for a quick bite or weekend meal. Aside from a few service and happy hour glitches (more on that momentarily), the food is consistently good and there are a lot of outstanding deals to be had.The restaurant is at the end of a strip mall near Kirby-Whitten and Stage Road. There's a Kroger, a Stevi-B's, and at the end, Sekisui. The space inside is not enormous, but they've done an exceptional job - there are hibachi tables, but also a sushi bar, regular tables, and small bar area. Warning for parents: Upon walking in, there is a large wall-sized glass fountain with running water. It's pretty, but I've seen kids trying to use it as a swimming pool or drinking fountain. Neither is advised. You'll be asked if you want a hibachi table, sushi bar, or regular table. You can order hibachi even if you sit at a regular table.Before I get to the food, I need address a few things. The service is good, and they have excellent happy hour deals on both drinks and food - however, there are a few things you need to know about these deals and in general.1. The happy hour runs until 7, and for the alcohol it includes specials on domestic beer, \"select\" wines, well cocktails, and 2 for 1 hot sake. All well and good, but the thing is that the \"select\" wine changes constantly. Sometimes the server will tell me that they don't have any wine specials at all - sometimes it's just one white, sometimes just one red, sometimes a selection of both. There was also one night where I ordered the white wine on special, and I could tell that my second glass was an entirely different white wine than the first. Perhaps having a pre-set and consistent wine special would make this easier on the staff and the customers - especially as wine special is ON the menu.2. There are excellent happy hour specials on sushi - you can pick from a limited number of rolls, plus soup and salad, at a price much cheaper than ordering a la carte.3. On the weekends, they have a hibachi special until 7pm - chicken and shrimp or steak and chicken for $13.95, or steak and shrimp for a dollar more. These meals come with vegetables, fried rice, soup and salad. It's a bargain considering the cost of non-happy hour hibachi.4. If you order off the regular hibachi menu (not happy hour), the meal is described as also coming with a \"shrimp appetizer\" - what is not mentioned is that they will not bring you this shrimp appetizer unless you are actually sitting at a hibachi table. If you're sitting at a regular table they just skip over it, and yet you pay the same price as the patrons who get the shrimp. I debated a bit about this with a server, and pointed out that it made no sense to charge me for something that the menu says I should get but I do not receive. She brought me the shrimp that night, but I shouldn't have to ask for something already written into the menu. I've ordered off the regular hibachi menu one time since then and did not receive the shrimp that night, either, but was too hungry to argue about it.5. If you order hibachi at a regular table, you will also have to ask for the dipping sauces to be brought to you, whereas they seem to be automatically produced at the hibachi tables. That all being said, the food here is, truthfully, quite good - and aside from the few glitches mentioned above, I'm happy with the service. The hibachi dinners are well seasoned and plentiful, the sushi is fresh and loaded with fish (more than I can say for a lot of places). If you decide to order off of the regular hibachi menu, I recommend the jumbo scallops - they're delicious and actually cooked correctly. So many places overcook scallops that these are a delight to eat. The soup and salad are fairly standard edition, but tasty and nicely sized. I have no complaints about the food here - it's not revolutionary by any means, but it is delicious. My biggest complaint is outlined above - the need for consistency. Either you offer wine specials or you don't - and if you do, have a pre-set white and red. Either you serve hibachi to regular tables or you don't - and if you do, the regular tables should get absolutely everything the hibachi tables receive, up to and including shrimp and sauce without having to ask. Give this Sekisui a try - as long as you keep a few things in mind, you'll enjoy your experience. I like this place quite a bit - if they'd just correct a few things, I'd probably love it."], ["Amanda J.", "We love Sekisui Bartlett.  The ambiance is great.  We've gone on Saturdays at lunch and they weren't very busy.  The servers were very friendly.  I recommend the Big Cheesy."], ["Misty R.", "I love sushi and all of the Sekisui locations in the area, there are several. They all have their own personalities. The one in Bartlett is the closest to my house, but for some reason I seem to forget it is there. It's tucked in a shopping center down from Schnuck's. They have a great sushi bar and a Japanese menu (tempura, chicken teriyaki, teriyaki shrimp etc.) Each Sekiusi offers different rolls, some are the same, some are unique to the location. My favorite here is Godzilla- shrimp tempura, crab, avocado, cucumber and eel sauce. Try the Tempura cheesecake, it's a nice splurge!"], ["Tracee C.", "This was my first time eating at this location. Everyone was so nice & the food was delicious! I will be returning."], ["Eric D.", "Great sushi. We took a large order to go and everything was great. Fresh and good portion size. Not too pricey. The only reason for 4 stars is fake crab stick only. No real crab mix available. They have tasty crawfish rolls. First time I tried crawfish and it is yummy!"], ["N. C.", "I like this location better than the rest.  And since I already have favorites, I feel like many pale in comparison to them.  Oh, picky picky.Anyway, a pretty good choice is the Philly cheese steak roll if/when they have it.  It's a big on the ridiculous side, but I have been craving it lately.  It's cream cheese, thinly sliced steak, and it's to die for dipped in some soy sauce.It's really hit-or-miss for me with this chain, but I will stop here in a pinch."], ["Amy P.", "I love this place. I try to frequent it at least once a week. The servers know my beverage of choice by heart (hot sake, yum!), but I always try to mix up what food I get each time. I love their basic rolls (Tuna, Salmon, Philly, Crunchy shrimp) and their specialty rolls (Hurricane is always good but the Arctic roll has become a new favorite of mine!). Their hibachi is always delicious too. The meat, veggies, and rice are always on point. And their clear soup and house salad always hits the spot as well. The number one reason I come here is their Happy Hour specials. From 5 pm to 7 pm every day (yes, even Friday and Saturday!) There are 2-1 hot sakes and specials on beer and wine as well. Then there are all the food specials...there are one, two, and three roll combos. You pick from a select menu and the sushi also comes with a salad and soup. They also have happy hour specials on hibachi meals and teriyaki meals! Their teriyaki burger is good as well. They have brunch specials on Sundays. I never have had a bad meal here! The only reason I gave it 4 out of 5 stars is because service can be a tad slow sometimes, although I haven't had a problem with service lately."]], "Genji Sushi Express": [], "Ryu Sushi Bar": [["Colin B.", "Ryu used to be our go-to quiet sushi spot.  We're on the prowl for another after our last visit.  It seems like the servings have gotten smaller while the prices have stayed the same.  The Sashimi is supposed to come with three pieces, but only two arrived on all but one.  We waited to tell the waitress, but she was the only server there, waiting on six tables. So we ate.  I told her at the end of the meal, and she said she'd tell the chefs for next time.  No other offers of any kind.  This all sounds a little petty, but we're the easiest customers of all time, it really doesn't take much to make us happy.  It's ok, I showed her, I only left her 18%.  =PThree stars because it really is well prepared sashimi and nigiri, but the rolls are tiny, Ask how many pieces of each come with the rolls, sashimi and nigiri, so you're not left with a $60 tab and a half-full belly.The atmosphere/decor are nice and inviting.  Usually quiet, younger couples."], ["Jakiah D.", "I love this place, but my experience is limited to takeout & eating at the sushi bar."], ["SueZ P.", "I'm in love with Ryu!  After having fairly mediocre sushi experiences in Memphis, I finally tried Ryu.  It reminded me of some of my favorite sushi places in Los Angeles = unpretentious, affordable, and most importantly - GOOD.  On my first visit to Ryu, I meant to order sushi (nigiri), but must have checked the wrong box because the server came with three orders of sashimi.  The cuts of yellow tail were melt-in-your-mouth delicious, but I was nervous about the bill.  To my pleasant surprise, my orders of sashimi were only $4 each!  Wah!  Unheard of in LA.  In addition to their sashimi, I recommend trying a rice-free roll.  I like the King Crab roll; instead of being wrapped in seaweed and rice, it is wrapped in cucumber.  It is a delicious and refreshing treat!"], ["Kerry C.", "Ryu oozes atmosphere. In addition to the disco balls, there's a long sushi bar, a few TVs, and several large Japanese paintings (the one we were sitting next to was a Lichtenstein-esque collage depicting people in the throes of what looked to be some rather serious ennui). The main dining room is cozy and dark in a way that makes you feel sort of like you're eating underground.I started with the spicy crab soup. It was a small, appetizer-sized bowl of spicy broth, mushrooms, green onions and lots of imitation crab meat. As far as soup goes, it was near perfection. The only improvement I would make would be to put it in a bigger bowl - after I finished, I sat there and had a little internal debate with myself on whether or not it would be OK to order seconds.The sushi was excellent. The deep-fried salmon roll was filled with salmon, masago and cream cheese. The Tokyo roll had tender raw tuna, avocado, crab and cream cheese. The Crazy roll wasn't too insane - it was stuffed with crab, avocado and masago and topped with raw whitefish and green onions. The rolls were a little heavy on the masago - it seemed like it was used like mortar anytime there was available space. That said, all of the ingredients were incredibly fresh and the presentation was lovely."], ["Huyen T.", "I went there for dinner with my mom, usually I order the sushi rolls to go but...that day I decided to eat there and try their Bento box. Since I was addicted to those served near my college. I ordered my mom and myself their bento special. Which came with rice, meat, salad, and half a California roll. I was completely disappointed. The rice was plain American rice, not true Japanese short gain rice. The salad's peanut sauce...wasn't what I would expect. It was some sort of brown sauce with bites of ginger in it. I couldn't even taste it with the salad. The meat was good, but without hood rice. It just ruin the whole meal. Then the sushi....was it even sushi? They didn't use Japanese sushi rice...and they surely did not try to make it into sushi rice because it was missing vinegar and it was falling apart in front of me. The box itself was expensive and not good...I also one sushi roll, the fire roll, it is a rip off! I've had better elsewhere. The sushi rice was falling apart, the sauce that topped the roll was the Vietnamese hot sauce. Uh...come again? I will never come back here again. FYI, this place is owned by Vietnamese. And the sushi chef....smh. You are better off going to grand buffet to get sushi. At least it taste better than this place."], ["Colleen G.", "I'm always on a quest for new and interesting sushi. Ryu was next on my list. I found it to be an average experience. Our server was fantastic. She was on the ball, and super friendly. Food was prepared quickly and tasted fresh. My favorite roll was the Fire roll, and I enjoyed the tempura vegetables too. My biggest disappointment was the masago that seemed to be everywhere up in my sushi. I can take a little bit, but man it was just too much for me. There seemed to be a lack of air conditioning while we were there. But it was also 100 degrees outside, so maybe I was just really overheated that day. I might go back, but it's not on my top 3 of sushi restaurants in Memphis."], ["Vim I.", "Casual sushi bar on Summer Ave. If I had to describe it in one word i'd probably say \"underwhelming.\" Although the sushi menu had some interesting options, the three rolls we had left us unsatisfied. We had the Crispy David (which is not really a roll but a small bite made with fried rice, fish, jalapeño, and spicy sauce). The next best was the Crazy Roll--although it was decent, I felt like it was lacking some punch to the flavor. We also had the Hanamaki--which was too bland. The Spicy Crab Soup was good but would have been so much better if it was made with real fresh crab instead of imitation crab. Maybe they were just having an off-day..."], ["Shanette P.", "One of my fave sushi bars in Memphis. Inexpensive, fulfilling hibachi & deliciously fresh rolls. Great fried rice. Awesome spicy crab soup! AND you can bring in your own bottle of wine...what more could you want?! The atmosphere is quaint & intimate, yet casual...Only gripe, too many gnats!!!!"], ["Catie W.", "i love this place. The building it self has character. I've been eating here for years and I've not had a bad experience every time I've gone. The food is great and the staff is wonderful. It's an added plus that's its reasonably priced too."], ["Jolynna M.", "It doesn't look like much from the outside, but don't be fooled. If you're into sushi, you will be very pleasantly surprised by what you find inside. The atmosphere is quaint, relaxed and comfortable and the service is first rate. All the servers are really friendly and appreciative of your business. Now let's talk about the food. The sushi is always good and the prices are even better. Most rolls are about 5 to 6 dollars. You won't find a better value than that in the area.. And they have an early bird special, offering a 3 roll combo for only $9 before 7 pm.  They have Hibachi here as well, priced better than anywhere in town, and also offer an early bird special of $12 for the whole Hitachi meal.  I so love a good deal."], ["Sheila D.", "Why the hell does everyone think this place is the shit? I think it's a hipster thing. After all, only white people like sushi. Everyone is probably just really excited to be eating in a sushi dive in a cautious part of Memphis.Their sushi is okay, but seriously, you can go anywhere and get better or equal. They also had shitty drinks, like only bud light or miller. WHAT! I got a lemonade which I did not enjoy.I'm not a total hater. I'm just saying."], ["Jerica B.", "Always good. Always. The Sashimi Bento Box is my stand-by, and I'm alway pleased with the sushi. The soup and salad is great. Price is right. I've been here over a dozen times. No complaints."], ["Andrew B.", "I came here on a Tuesday night at 7:00 pm.  It was very empty.  The decor is very traditional.  Very expansive cooked and fried roll options.  I ordered a ginger salad, fried calamari roll, and a spicy California type roll in a cucumber.  The salad was good, but nothing too creative.  The rolls arrived and were relatively sloppy, and lacked the precise creation usually found at a sushi bar.  Most that were labeled spicy were lacking spice.  The Cali/cuke roll lacked taste and tended to fall apart fast.  If I was to come back I wouldn't order any of the same rolls."], ["N. C.", "And, here I had thought that I had already found my favorite sushi bar.  I was wrong.This is a nice restaurant that manages to be open and cozy at the same time.  The menu is a fun surprise, with traditional and more American/Asian rolls to please your palate.Check out the Cowboy Roll -- which incorporates fried chicken, or show your local price with the Memphis roll -- a combo of salmon, cream cheese, and avocado.  On average, rolls ran about $5.95.With so many selections to choose from, one could spend a mint."], ["Heidi P.", "Nice atmosphere. Comfortable seating. Decent food."], ["Jennifer G.", "I would recommend all my sushi loving friends to this place and have :)  Friendly staff and very clean bathrooms.  The chef makes the best rolls in town and the sushi is always fresh, some of the biggest rolls in Memphis!  My favorite restaurant by far in Memphis."]], "Bangkok Alley": [["Sandy W.", "Ok, the first time I came here, i would have given it 3 stars, but that's because I didn't try the curry. Their coconut curry is seriously the best I've ever had. That dish I would give 5 stars. Overall, nothing I've ordered here was bad, just not too impressive except for the amazing curry. It would be nice if they had more Asian drinks and they could just tweak the other dishes to match the quality of their curry. They do have a lot of options though, and the service is great."], ["Nicole P.", "One night in Bangkok Alley ... It was good food. The ambience is nice. I liked the music that was playing. Our server was quiet but left us alone so we weren't always bothered. We ate sushi (alright), chicken pad Thai, pork tenderloin with shiitake mushrooms, wontons, and edamame. Everything was good."], ["Devin P.", "Was in Memphis this past weekend and wanted some Thai food. Looked this place up and since it was close decided to give it a go. Food- weak, hardly any veggies! The pannang curry I ordered didn't seem right,  I always go with \"native\" and all it was was pepper seeds. LAME! I sent it back becuase no way was I going to eat BS. Instead I opted for the red curry. A lot better. Pricing was a little steep and the atmosphere lacked a lot. I would try them again however, only because I live 188 milez away!"], ["Caz V.", "Mostly I review hole-in-the-wall smut shacks, and rarely would I ever rag on service, having once worked a service job myself and understanding all too well the perpetual class war between server and served. That said, this place was so hilariously egregious in its hostility that I figured it merited a sharp review, if only as customer feedback. The food itself was actually quite decent--mediocre Thai curry, but scrumptious sushi. And the waitstaff are not the target of my ire here; they acquitted themselves honorably. Instead, it was the young woman behind the bar who sank the place's fate for the sake of this review. On our way out, we decided to stop and catch some Olympics, so we grabbed a seat at the bar for a drink, and waited. And waited. And waited some more. As we waited, she handled other patrons, twiddled her thumbs, and went to truly lulzable lengths to avoid acknowledging our existence. We sat, she averted eye contact, we furrowed our brows, she whisked past, head meticulously unturned in our direction. It felt like being in a reality version of Mean Girls, stranded at the middle school dance. Probably, they were near closing--though as another reviewer points out, it's not as if the door reveals the secrets of their hours. But really, all it would take is a simple apologetic smile and an explanation, and with sheepish shrugs all around we'd have been on our merry way. As it is, well, we laughed anyway at the sheer ridiculousness of her obstinacy--which still fully justifies the one-star review, IMHO. I mean, when the clerk at a porn store at midnight is friendlier by far than a bartender, Bangkok Alley, you know you have a problem."], ["Kelly G.", "The phone number posted is wrong, DOWNTOWN MEMPHIS 121 Union Avenue Memphis, TN 38103 (901) 522-2010 Owners think the Union place is less important than the busier Collierville, especially on FB facebook.com/bangkokalle…At least the menu is updated on their website!"], ["Brian S.", "One of the best places in Memphis for Sushi. Noodles and Lettuce wraps are also superb. Friendly staff and good service."], ["Carla G.", "Hubby and I have been in Memphis a couple days now.  We had BBQ last night and beef the night before, so wanted something a bit different.  Bangkok Alley is not a far walk from our hotel so we opted to go there tonight.  It was a good decision.Hubby had the sushi special.  I tried the roll and it was really good.  I ordered the Yellow Curry and It was delicious.  It was the best Yellow Curry I can remember eating in a long time.  What I like is that you get brown rice rather than steamed white rice and I opted for the brown rice.  It too was a good decision.  It was perfect in texture and balanced out the curry well.Hubby was able to get the local Ghost River beer and I tried Sake for the first time in my life.For dessert we opted for the Molten Lava Cake.  Wow it was a perfect topper for our meal.  We split it and it was so melt in your mouth good.The ambiance was quite, we could talk about the conference we went to earlier in the day.  Our waiter Jake was attentive and answered our questions.I would go back if I wanted sushi or Thai food and was back in Memphis."], ["Mandy H.", "I can't say much about the whole menu, but they have great sushi and great drunken noodle.  It's not your typical American sushi menu, which I like...there's a little more to choose from than the dynamite or California rolls and whatever you choose is delicious.  Their staff is incredibly friendly and are always willing to go above and beyond to assist however they can.  I used to eat here 4-5 nights a week and they'd deliver to my job a block away!  Great place!"], ["Carolyn M.", "Solid selection, but probably more variety than any one restaurant should attempt. I had the Tom yum chicken soup and it was spicy and delicious. I was less impressed with my daughter's sushi roll. Good ambience, warm decor, and friendly service."], ["Jose M.", "Food was great, service was absolutely horrendous. They got a huge sushi to go order and decided to work on that and quit working on our food to get that order out!  We got half our meals and then the other half more than 30 minutes later. The sad thing was they were not apologetic and said \"yeah we had to get that sushi order out\". We were the only table in there and the workers were more interested in eating themselves in the open than waiting on us.  Our waitress, Lexxie, couldn't even talk to us because her mouth was full every time she came over! We ordered additional drinks and never got them and one of the things we ordered never even came out.  I don't want to discount the food because of the poor customer service, but it was good."], ["Teresa L.", "I don't think I would order sushi at a Thai restaurant, but I would order Thai food.  I had the pad thai and basil rolls.  The pad thai was the best that I've had since I visited Surin in Atlanta.  Well, it was the only pad thai that I've had since I've been to Surin.  It wasn't too sweet.  I asked for spice with heat at about 7 on a scale from 1 to 10.  It was perfectly spiced.  The atmosphere is nice and excellent for a date.  Service was also excellent."], ["Martie P.", "I work within walking distance to Bangkok Alley and have eaten lunch there a few times. Each time, I've been impressed with the service and quality of sushi. The restaurant is medium to small sized with a pretty small bar area. It's not fancy, but provides a casual to dressy-casual atmosphere. The staff are very friendly and the food is delicious. On my last visit, a friend of mine ordered the Thai Tea. It was an orange color with plenty of milk; very floral taste. If you want to try something different, this is definitely worth a try. I normally go for the sushi at Bangkok Alley. They have a creative sushi list, including: the Memphis, Collierville, Dynamite (I can't help but call it \"Dyno-mite\") and Russian Roulette, as well as, traditional favorites. Of course, their Thai plates - basil chicken, pad thai, and tom yum are equally delicious. All in all, I would highly recommend Bangkok Alley!"], ["Steve R.", "Very nice atmosphere that fits in well in historic downtown. We have used both delivery and eaten in the restaurant, and enjoyed both. The food is very good, and it's nice to have something a little different in downtown Memphis."], ["Aimee B.", "Hidden spot. Delicious!"], ["Comyar S.", "Sushi at a thai restaurant? Eh.Went here with a big group. But we were the only people in the restaurant and the service was still ridiculously slow. After an hour they brought out one of our sushi dishes. We thought they'd gone fishing to catch the sea critters but it wasn't even fresh."], ["Catherine S.", "the atmosphere is great at this little place!  My meal was quick and delicious. Being a vegetarian, I often have a hard time finding places I can go to eat- they make everything veggie friendly here!  What better?...half price BOTTLES of wine! I'm not sure how often they do this, but my fiance and I went on a Sunday night around 7PM and were able to get a bottle of moscato for $11!  That's a store price- not a restaurant one. Most importantly, service was great! Make sure to sit in Taylor's section if he's working when you are there. He was quick, attentive, and easy on the eyes ;)bon appetit!"], ["Karen C.", "Mmm thai food! I feel bad, 2 trips to Memphis, I still haven't had BBQ, and my favorte meal was at a thai restaurant!Anyways, the food at this place was fab. My coworker and I tried a bunch of appetizers...gyoza, spring rolls, edamame. The gyoza and spring rolls came out hot & crispy. For my entree I got the Pad See Ew with tofu and it was delicious! Lots of fresh veggies and a very flavorful sauce.My coworker got a sushi roll and some pad thai for entree, she said both were good.This hit the spot. Friendly service and reasonable prices...all that food was $65 with tip. Will definately be back when I go back to Memphis in January!"], ["Coco J.", "I order food from Bangkok Alley from time to time because I live so close to it, but lately I've been dissapointed in the inconsistency. Sometimes the food is great and other times it's very bland. I never know what to expect from them anymore."], ["Paul K.", "Was craving sushi, Yelp seemed to have this one as the best spot in downtown........honestly, it wasn't bad......the sushi was just average though. Had an ahi tuna salad, which was probably the best part of the meal, a rainbow roll and a paradise roll which were both pretty ho-hum, and the gyoza soup, which was spicy as a firecracker. The service was friendly and attentive though, and the decor was nice. I would probably come back and try the Thai food at some point."], ["Adonis S.", "I took my mom, gf and her mom to this location thinking it would have been a great way to end the weekend. I was wrong and here is my a 1 star if any was deserved.I have had better food at other similar locationBrown Rice was hard and did not come out at the same time with the entréeFor the quality and quantity of the food that was ordered this was overpriced.The service could have been better, items were received when requested, but had to get servers attention to get a knife, when asked about the rice, was told it was being cooked, and was brought out after.Asked for knife 2 members of the table were eating stake with a fork.Sushi was chewy, my GF got a stomach ach from it and was not happy at all. We both had better sushi for less.should have walked out right away when I noticed it was empty.When I showed the waiter how displeased we were with the food overall no attempt was made to justify the cost or quality.This was reflected in the tip along with  along note behind the receipt."]], "Osaka": [["Michelle M.", "I've been to Osaka on Poplar twice and both times were quite the unpleasant experience, so I will not be returning. Which is quite a shame, as the food is decent. DECOR:  Incredibly tacky, but also sorta fun. I felt like I was walking into a restaurant in Vegas, but I can appreciate that and even seek out that type of environment at times, so the decor did not bother me at all. The restaurant seemed clean to me, no obvious infractions in that respect. FOOD: I have ordered the house salad (LOVE the ginger dressing...has a subtle peppery-ness to it that I enjoy), miso soup (standard), edamame (also standard) and a couple of rolls. The cordova and orlando rolls were pretty dang good....fish tasted fresh, great flavor from the sauces. My only complaint was that some of the pieces would start to crumble apart in my soy sauce dish. SERVICE: Herein lies the one glaring problem with this restaurant. My first visit was early on a Friday evening, around 5:30. They weren't busy at all and were able to seat us immediately. Our waitress was a young girl who proceeded to spill an entire HUGE glass of ice water all over my lap and phone, which had been sitting on the table. Not only was she not apologetic AT ALL, but she actually looked like she found the entire situation humorous. While my boyfriend and I were frantically trying to clean up the mess with our TWO napkins, she just stood there and watched and appeared to be stifling giggles. She made no offer to assist in our cleaning efforts, no offer to go grab some more napkins or a towel and no offer to switch tables. Now, as someone who has had 6 years of serving experience in New York City, I am well aware that accidents happen. I can excuse that. HOWEVER. That being said, it is customary to offer some type of recompense...a complimentary beverage or appetizer perhaps. But no, all I got were smirks and a DRENCHED lap in an already-freezing-cold restaurant. On my second visit, which was this past Friday, the restaurant was much busier. Without even glancing up at me, the hostess abruptly and rudely asked \"how many\". To my knowledge, hostesses are actually supposed to WELCOME you to their restaurant. This young lady appeared to not even want to be bothered. I replied 'two' and she threw the seating device at me without even asking me for my name nor telling me how long the wait was. As I was about to inquire on this, a gentleman, who I can only presume was the manager, came up and interrupted me, commanding the hostesses to seat a particular party that had a reservation. All I can say is...if that really is the manager...now I can understand why the service here is so poor. Once we were seated, our waiter, who appeared confused and lost the entire evening, came over with waters (which he did NOT drop on me). I asked for a sake recommendation. He couldn't give one. Okaaaaaay. Fine, I guess just a glass of wine. When he finally got around to coming back to take our orders, he stared blank-faced at me when I concluded my order with asking for a salmon-avocado roll. When he read the order back to me, he said \"and a salmon roll and an avocado roll\". I say, \"No, not 2 separate rolls...one roll with salmon and avocado in it\". He says \"We don't have that.\" First of all, what kind of sushi restaurant does not have a simple salmon avocado roll? He offers to add avocado to a  plain salmon roll, but will have to charge me extra. Ridiculous, but fine. When the food arrives, we get the salmon-avocado roll as we requested, but also a separate avocado roll. At this point, i am just so exhausted from trying to communicate with this young man, that I just give up and accept that I will have to pay for an avocado roll that I did not ask for. In closing, if the managers happen to read this, which I am assuming from previous reviews that they don't, you really need to hire people that WANT to be servers. All your restaurant seems to offer are sniveling, bratty, young people who would rather be anywhere else."], ["Happie H.", "Was skeptical because of some previous yelp reviews, but it was great. Delicious food, great sushi, awesome atmosphere, great service from a waitress named Abby, and the host was extremely friendly and welcoming. Everything negative that previous reviewers complained about was not true with my family's experience. The food was awesome, and the restaurants decor is amazing. Impressed, and will come back."], ["Kevin D.", "First off, before I rant about Osaka, let me say that I enjoy their menu.  It's everything else that gets in the way.When you walk into Osaka, the first thing you see is the broken water feature in the foyer.  There are paper signs everywhere telling you the times, the takeout order policies, etc.  There are two hostess stands, one for takeouts and the other for dining, but the hostesses won't bother explaining that you and simply point to the other one while she texts.  Over the cool, underlit hostess stand, there are tacky paper signs, too.  The hostess may or may not acknowledge you, then sit there smacking her gum while she waits for another equally apathetic employee to come and seat you.  There will be a long conversation between the two about where to seat you, even if the entire place is empty.  When you get to your table, you'll wait a good ten minutes before you are greeted.  Don't bother asking about anything on the drink menu, because the waiter won't know.  They'll forget to bring you silverware, and you'll have to ask for it twice.  Your edamame appetizer will come out around the time that your entree comes out.  Most likely, there will be an error since the wait staff doesn't quite understand the menu as much as you do.  You won't get quick refills on your drinks, so don't order anything spicy.  When you try to pay your check, you'll wait another 15 minutes.  Hopefully there won't be any errors on your check (but most likely there will be.)The food, however, will be enjoyable.  The ambiance has great potential, as the renovations were obviously expensive and well thought out.  The lunch menu is reasonable.  Why doesn't the owner fire everyone and start over?  This may be the only way to save a potentially great restaurant.  Tabitha Takes Over from Bravo needs to come and knock some sense into people."], ["Daniel M.", "This place just exudes style. The interior is tastefully modern with great attention to details such as Oriental themed woodworking, Hibachi grills and even neon fluorescent lit tables (bar area) which all blends together nicely.  Extensive sushi menu that is reasonably priced.  Seriously good eats. The bar area plays music but not so loud enough as to carry to the Hibachi grill tables in the back of the restaurant where people are gathered for a more intimate meal. A great interior design. Top notch all around."], ["Kristen D.", "Osaka ruined a special day for my boyfriend and me. They always leave out part of the sauces for takeout. And, for whatever reason, it is the most difficult to get them to ever answer the phone. I have many complaints, but the foremost is what happened to my boyfriend and I while we were celebrating out dual graduations from college. We reserved a room for 20 people four months before. Four months!! In addition, I called multiple times. But, of course, when we arrived there was a 30 minute wait only to find that we would have to wait two more hours to get the room we reserved. Some group had been late and thrown the entire schedule off. The manager didn't offer any apologies or comps. He just sat us at a hibachi table, where we couldn't talk and that was it. In all, I cannot stand the way this place is run. While the food has been good, the experience has always been terrible"], ["Marvin S.", "I was never allowed in.  I saw that the establishment was open and teaming with people.  There was a short line and people were being seated.  When I was greeted,I was informed that I was not allowed to be there (in those words).  Only invited guests for their soft opening were allowed.  I was told to come back for lunch the next day.  I did not go.  I was willing to spend good money and was made to believe that Osaka was opened for business.  The man who informed me of their unposted soft opening even had the nerve to touch the small of my back as I was leaving, giving a slight push.  I have informed others and they are not patrons of this chain restaurant in a shopping center.  I was disgusted by their unwillingness to accept a paying customer.  I will not return.  Neither will others."], ["Kelly B.", "The food was excellent, but the hostesses we extremely rude and stupid, and need to be terminated. Instead of addressing people as they come in, they stand there gossiping and talking amongst themselves. My husband stood in front of them for 5 minutes before anyone even addressed him. There are 2 hostess stands, and you aren't sure when you walk in where to go.  If this place wants to make it seem like they are a classy place, they need to start with the first people their customers meet, since they give out the first impression."], ["Andy S.", "They recently opened a new Japanese restaurant on Poplar, and we decided to give it a try for dinner.  It's in Poplar Plaza where Bookstar used to be. Back in the day, it was even a movie theatre.The decor is very trendy feeling. It is a casual place, but it has a fancier feel. They have hibachi tables.  They have a sushi bar. And a liquor bar. They had a lot of different drinks. Garrett ordered the spring roles. I tasted one, and it was good.  I think an order was $4.I had the fried calamari as an appetizer. It was good, but if you want calamari, I wouldn't order it.  It was mostly vegetable tempura. I liked it, but it wasn't what I was expecting. It was only $6.We had hot sake to drink. The large was $12. The tables in the bar area were kind of cool.  They constantly change colors. It was rather psychedelic. We ordered the big boat of sushi. It was about $25. I'm not sure what everything was. It had several pieces of sushi, including salmon, tuna, and squid or octopus. It also had several nigiri rolls. I enjoyed the meal. I love seafood and sushi. I'm sure we'll go back. It looked like they have lunch specials and early bird dinner specials."], ["Diana K.", "Prefer the Shogun in Cordova. The food was alright but the service was horrible, and this was not the first time. It was not even that busy, but the waitress never came to refill our drinks. NEVER. Absolutely disapointed."], ["Chris G.", "Good food.  Terrible service.   We were waited on by what appeared to be an 18-20 year old boy who was clueless about everything.    We were seated and then it took an eternity for someone to come and take our order, and then a second eternity to get our food.  We ordered calimari as an entree and were given a plate of assorted fried fish and fried mushrooms - no squid to be found.    Then our entrees were brought out 5 minutes after the appetizer had been brought out.  We had hardly begun to eat it.  Two of our entrees were brought out and the 3rd person had to sit there a good  15 minutes before his food arrived.   Diet coke was poured into my iced tea when refills were finally brought around.  And then the refills were cut off when I was still enjoying extra spicy sushi and ran out of drink.  You would think that a nice new restaurant such as this one would have much better help and much better service."], ["Wayne R.", "I went during the grand opening back in October.  First off, the atmosphere was amazing.  They have great lighting, and the interior was constructed with amazing design and craftsmanship.The service was okay, but it wasn't anything to go home and call your mama about.The food, perhaps the most important part of any food service establishment, was not very good.  The soup was cold.  The food, once ordered, was not very plentiful, and was only okay.  Nothing special, and certaintly not worth the price.I advise everyone to try the other Osaka on Macon Road.  That one is FAR better than this one, and is my favorite sushi bar to eat at.  I will perhaps one day go back here to see if there has been any improvement, but you know what they say. . .The first impression is the last impression!"], ["Sara K.", "If you want sushi, done right (don't go to Blue Fin) - i would go here. Its kind of over priced because of the area and honestly, when you go to a sushi restaurant with this atmosphere, it's kind of expected to pay more because of the crowd. Cliff got the Shrimp and Steak Habachi and i got the half orders of 4 different kinds of sushi. I would go again but it's loud and the servers are drowning."], ["Ed W.", "Memphis, we have a bad one here.I went with my friend Jeff G. aka Griff to lunch here today, as we were giving a presentation near UM and did not have time to run further east for a bite. We thought this would be a nice time to check out a new restaurant. Here are brief opinions.1. The sign outside is extremely cheesy. Whoever designed it needs to refund the monies charged.2. The restaurant did a decent job on remodeling the inside. It does not seem at all like the old bookstore. This is, unfortunately, the only positive from the meal.3. The food is overpriced.4. The food is bland.5. We both found it odd there is an extraordinary amount of non-hibachi seating. In most Hibachi restaurants, there is Hibachi seating and a small bar. Here, there are 6 hibachi table areas, and then a ton of seating and a huge bar. Jeff G made the remark that the restaurant is having an identity crisis. I agree.6. In years of frequenting other hibachi restaurants, we collectively decided that the sauces served with the Hibachi meals were the worst ever. One tasted like a chemical. The other tasted like A-1. In a ramekin. With a trendy name. The waiter seemed shocked when we asked for sauced. \"You want sauced? With the meal?\" Uh, yes. We do. Because the meal is bland and overpriced.7. Griff decided that this would be a good restaurant for someone to choose for lunch if they had to walk to lunch and ate at Buffalo Wild Wings the day before. I reminded him El Porton is in that shopping center, too. I would choose a taco. Or hot wings. Or Picadilly across the street.2 stars."], ["Jen M.", "I would rate it a 4 for the fresh sushi rolls, but a 3 for the way they put them together (sloppy and didn't even give me ginger, soy sauce or a bowl), as well as the customer service.Went back a second time. The customer service and cleanliness was still lacking. Had some different rolls, they were just ok. I love the decor here, was great for a Friday evening out with the husband.  Will come back during happy hour for the specials."], ["Olivia F.", "Boring. Nothing special. While somewhat visually appealing the food is just okay. Had worse but have had tons better. Don't even think of going there with more than 3 people! (eye roll)If you ignore this advise make sure everyone orders the same thing whether it be sushi or teppanyaki because it seems the timing of when you are served is hit-or-miss."], ["Elle S.", "Like everyone said the decorations are great, but service sucks donkey b*lls. FIRST to the genius who put the to-go stand first and the hostess stand second... please fix this... EVERYone goes to the first hostess stand and once you are acknowledged (insert sarcasm here) they tell you to go to the next one so everyone looks like an idiot. I told them we can sit at the bar, it still took 30 minutes. then it look 30 minutes or longer for my seaweed salad... sushi i can understand but salad?!?!? I got sashimi so i cant say anything about the food, but i can say the sashimi was too tick.... it should be thin.... not a place i would crave to go back to..... i'm giving u three stars and not two since i didnt really eat food food. 2 is taken away because your teen staff is terrible."], ["Zachary P.", "Personally I love this place.  Good food, but better atmosphere. Being a Vegas kid this reminds me alot of that. #VegasAtmosphere"], ["Elizabeth C.", "As someone who absolutely adores the other locations, I was beyond excited when I moved deeper into Memphis and right down the road from this location. My family would drive from Oakland, TN to the Macon location on special occasions to eat at my favorite restaurant, so living so closely to this location was truly a blessing. Upon walking into Osaka, I was amazed by such attention to detail in the design. It offers quite a different vibe than the other locations and I really do enjoy it, but the decor can't make up for the poor service. Once placing your order with your server, who typically has an \"I don't care to be here\" attitude, you are left for a lengthy period of time to wait on your sushi. During this time you can do nothing but listen to the horrible playlist that the restaurant plays. I'm in love with the playlist from the Macon location and was hoping to find the same at the Poplar location, but I was sadly mistaken. So there you sit... listening to the countless melancholy ballads of Bruno Mars. I would say it took about 20 minutes to get my sushi on one very slow Sunday afternoon. The sushi is consistent with the other locations, but all things considered, I was disappointed. I only go back because of their heavenly sushi rolls. I wish the restaurant had paid less attention to details in interior design and more attention to the quality of service."], ["Lynda J.", "What a great experience.  Visiting and read the reviews, which were all good, and correct!  Hibachi was great as well as the service!!"], ["June F.", "I had never been overly impressed with the service here in my 6 or so visits, but the food was good so I just dealt with it. Until my birthday. Our waitress was visibly upset, extremely unfriendly, and made at least 2 mistakes with our order. We had to get the manager twice and had to ask for another server's help once. Toward the end of the evening she was audibly cursing about us from a few tables away. She was throwing dishes onto to the table, rolling her eyes, and scowling.After hours of feeling uncomfortable, unsatisfied, and unhappy, we were literally afraid to walk across the restaurant to exit in case we ran into her. I and my 3 fellow diners have all worked as servers and are usually very forgiving and kind diners. I really don't think we were to blame for her foul attitude.I am not only unwilling, but afraid to return to Osaka."]], "Sakura Japanese Restaurant": [["Vaish P.", "Yep, this is my favorite sushi place in Memphis, no question. I'm not so adventurous to eat sashimi so 5 stars for incredible speciality rolls, drinks and service. The menu is extensive but luckily they give a good description of the items so what you're eating is not a mystery. My go to rolls are Sexy Lady, Mexico and Mango roll. All the rolls are beautifully messy, fresh and delicious. Also the cool thing is that they have a lot of \"off menu rolls\" which you can ask your waiter about. I just discovered the Jungle roll and it's basically life altering. It's a spicy roll with an equally spicy noodle vegetable salad on top, perfection. If you like spice, order it asap!!Service is good but kinda depends on how busy they are. We usually go closer to closing time and the service is excellent and fast. Plus they give you hot towels when you are seated.!And don't forget to order a tall glass of Ichiban to complete the perfect meal."], ["Celeste R.", "I've had fresh sushi, sashimi, and nigiri all over the country and I know how hard it is to find a local place in a city not known for sushi. That being said, this is the best place I've been in Memphis. We've always experienced good service and attention. Maybe the busy weekend makes the service quality diminish, but I've enjoyed my experiences here. I really liked most of the rolls I have had here (haven't tried sashimi yet) and they are your typical Americanized sushi rolls with tons of dressings and add-ons. But they are delicious! I crave their sushi at least once a week. They do well on carry out orders too! The sunset roll is a go-to and we are always trying new things."], ["D W.", "Ended up here since our (former) favorite sushi restaurant did not open for another hour.  Everything about our experience was wonderful!  Service, as well as the food exceeded expectations.  We will  be back!"], ["Jim H.", "We had visited this Sakura several times before leaving this review. This visit was on a Thursday night around 7pm. It was steadily busy, but not packed. One of the great things here, is that you can almost always get seated as soon as you arrive. Our party ordered the chicken tempura entree, 2 pieces of albacore tuna nigiri, 2 crunchy shrimp sushi rolls, 2 vegetable rolls the Tofu Sukiyaki Don and a crunchy spicy tuna roll. The albacore tuna nigiri is usually outstanding, because of the quality and the size of the nigiri cut. My wife loves the seaweed salad. The chicken tempura is okay, but lacking a bit of flavor - definitely need the dipping sauce it comes with. The rolls are good. The Tofu Sukiyaki Don was just okay. The service is variable. I wouldn't go out of my way to come here and fortunately don't have to. But, I also wouldn't avoid it. I'll still come for the nigiri."], ["Jen M.", "Sakura is my favorite sushi spot, my family and I come here about once a week.  I definitely prefer this location over the one in Germantown.  Service is better at this one, however even the service here can be hit or miss.  Most of the time it is good, though.  Sometimes parking can be a pain, the lot gets crowded and you have to park on the side street and walk up a ways.Some of our usual meals are the Joyce roll, the Alaska roll, the Alfredo roll, Tuna roll.  Occasionally we get the plum wine, and sometimes I will get dessert - either green tea or red bean ice cream.  I've definitely had better ice cream, plus they are a little cheap on the amount.Unless I find something better, this will remain our favorite sushi spot."], ["Tom G.", "I've seen some reviews that say this is the best sushi in Memphis. I can only believe this might be the only sushi restaurant those people have been to. Placed an order to go last night for - 2 crunchy shrimp rolls, 2 Eel Sashimi's, 2 Ginger salads, Miso soup, and a Pork Tonkatsu bowl. The place was packed, so this had to be a goo sign, right? Not. The salads were pretty good. The ginger dressing had a different flavor to it, but it was good. And, my wife loved the eel. That's where it stopped, however. The Miso soup, not quite sure how to describe the taste, not good? She tasted, and pushed it my way, I tasted and pushed it to the sink. The Pork Tonkatsu said it was I think fried pork, onions, eggs over rice bowl. It looked like dog poo on top of rice, didn't taste much better. Again, after about 2 bites, it made its way to the garbage. So on to the crunchy shrimp. Not so fast. There were 2 sushi rolls, but they were not crunchy shrimp. See pic posted. They were like the sushi in Kroger. I swear, they had the texture and taste of Kroger premade sushi. There was no crunch, the shrimp were not fried, no flavor at all. Well, at least there were 3 pieces consumed before they made their way to, well, you know."], ["Tara K.", "I love this restaurant.  Whenever I go to Memphis or Jackson, I go out of my way to eat here.  Sakura has the best sushi in the mid-south, hands down."], ["Jinjah T.", "The Joyce sushi (fried crawfish) is a must try. It's really good and not too pricey. The staff is super friendly."], ["Logan H.", "Best sushi in Memphis!!! Can't go wrong with the Mexico roll or the Sakura roll. I try to go try something different each time and I haven't been disappointed yet."], ["Ashley F.", "My husband and I love Sakura. We have been regular visitors since before this much more convenient location opened. Service is always great, atmosphere is warm and inviting and the rolls are why we keep coming back.I noticed that the negative reviews mostly come from people that order the most basic sushi rolls. This place is about the deluxe, big portion, American style sushi rolls. Messy, saucy, crunchy, yummy. Sometimes we start by splitting the delightful mermaid salad. Wonderful chopped pieces of raw salmon, tuna, avocado, cucumber, flying fish roe and spicy mayo. My mouth is watering just thinking about it!The big raves are for the Joyce Roll, but I just don't like fried rolls. I'm sure it's great for those that love them. There are three rolls we consistently order, though we do occasionally omit one so we can try something new on the menu. So far, the same three rolls are still on top. The Mardi Gras, Mexico and Mother of All Rolls (the 3 M's). The Mardi Gras is sweet, crunchy with delicate pieces of tuna and salmon layered on top. The Mexico is creamy and crunchy and salty. And the Mother is difficult to describe because it has so many textures and flavors going on and a dipping sauce that complements it. These three have never failed us.And by the time the bill arrives, we are usually completely stuffed and have to take home leftovers. The cost is extremely reasonable considering we have in the past spent twice as much at Sekisui, with no leftovers and still a bit on the hungry side.If you visit Sakura, you won't really experience it unless you stray away from the rolls you know. It's all about their special rolls."], ["Andy S.", "The food is not too expensive, which is a plus.  It's Japanese food.  We pretty much all went with sushi.  I had the miso soup, which was what I expected.  i also had the edamame, which was also fine.  I ordered the sushi sampler which had several nigiri rolls.  My friends ordered specialty rolls.  They were amazing!  Unfortunately, I can't remember the names, but I would definitely go for the specialty rolls.  Of course, the specialty ones are more expensive, but well worth it.  They are also filling.  A person doesn't need to order very many.  The server was nice and asked my friend if she really wanted the amount of rolls that she ordered because there were so many."], ["Miss M.", "The mermaid salad....delicious! I  the Madison roll!!  I think ill be back.  The waitress was very helpful and nice helping with my handroll options!!  Great place!!This was take out.  Next time ill dine in!"], ["Corey E.", "Hey, what can I say, I'm a sushi guy. If you are a sushi person then I highly suggest you check out Sakura on Poplar Ave. This place is very nice. I haven't had one bad sushi roll entree here yet.The restaurant is very clean and neat and the staff are always pleasant and friendly. The sushi is some of the best in the city. My all-time favorite roll here is the Sexy Lady. And trust me she is one sexy roll! This roll is has shrimp tempura, snow crab mix, cajun tuna and avocado. My second favorite here is the Joyce Roll. The Joyce is deep fried with crawfish, shrimp tempura, fish eggs, avocado, and sauce. You can't go wrong with either roll."], ["Haven M.", "Only issue here is that it is not a buffet, the sushi is good and fresh. Joyce and Alfredo rolls are my favorite. I need to try other rolls. Nice cozy restaurant."], ["Lee C.", "Unfortunately there are a lot of places in Memphis that are starting to sneak some weird chopped fish-meal like substance in or on their sushi, it's disgusting! This place is great! The rolls are HUGE and oh so delicious! Let's see, we ordered the Mexico, the Joyce, and the Sexy Lady. The sexy lady was just okay but, oh my, the Mexico and the Joyce were amazing!!! The joyce was definitely the most original roll I've ever had and I will definitely be back for more. I'm usually a nigiri orderer but I only saw rolls and a sashimi appetizer. I didn't ask further, we just ordered rolls this time. I'd like to know about nigiri the next time I come here though because it seems odd that they'd have sashimi and rolls but not nigiri. Anyway, don't pass it up. For the size of these rolls the prices are very reasonable and you'll probably have left overs for a midnight snack!!"], ["Karen Y.", "Food is great but had a really bad experience with a waitress that was nowhere to be found. Manager needs to train the waiters/waitresses better. I will not be going back."], ["Manuel S.", "Hungry for sushi once more. Based on reviews this looked like a good option so I gave it a try. Service was friendly from the moment I walked in, beer cold with a cold glass, that is always a good start. I sat at the bar and promptly they brought me a hot towel that smelled of Clorox (well at least was clean) I ordered the big time roll and a couple of sushis.The cooks are all Mexican being led by a Japanese guy, I think it is a good sign, every time a Mexican has prepared my sushi has been outstanding.So sushi and roll arrived and looked good portions are big, above average but the roll they cut it in way too many pieces, it is easier to eat but they are too thin and come apart. It was fresh and flavor was ok, may be not the best option for my taste but I am sure they have other good rolls nevertheless the eel was kind of dry. Afterward to finish I ordered the Green Tea Ice cream, it had a good flavor and portion again was big, it was creamy but had bits of ice which makes it loose the flavor and texture in your mouth. Over all was a good experience, if you are around don't be fraud to stop by and try. As for me, I'm not local so when I'm visiting again I will try a different place.Be safe enjoy food!!"], ["Cris W.", "The food here is just as good as the offerings from their sister restaurant in Germantown. Excellent service, too. I highly recommend the Joyce and Alfredo rolls."], ["Joe A.", "Excellent sushi! The specialty rolls are very large and delicious.  Everyone I went with was very happy with their meal. One of the better if not best sushi places I have had in memphis yet."], ["Elle S.", "Sakura sushi is my favorite in the city even though they make up their own hours of operation. The rolls are bigger and tastier here. And their peanut dressing is amazing."]], "Friday Tuna": [], "Sekisui Pacific Rim": [], "Sushi Jimmi": [["Jonathan M.", "First of all I love the tuna nachos! The short ribs were killer! And tonight I picked up some pho that HIT DA SPOT! Now I can't wait for some Habachi Rice  to go with my Pho all winter long!! Great Job Jimmy! You guys have got to try Jimmy out! He's a tremendous family man trying to live his dream of serving up amazing sushi and Asian fashion! You won't be disappointed!!!"], ["Christina C.", "This is my favorite food truck in Memphis! Mostly because I love sushi more than anything, but also because it's pretty unique to this city. Sushi Jimmi updates his location on instagram and facebook, so make sure you're following one of those to know where he is! He will also post any new menu items that he'll have that day! I really like that he stays late at night (till 11pm!) on some days because if I'm craving my sushi food truck fix, I know exactly where to go.There is definitely a variety of items on the menu and it changes depending on what ingredients he has for the day. I've tried many of the rolls and can say that each one is HUGE and will definitely fill you up for a meal. If you've never tried a deep fried sushi roll, Sushi Jimmi does it pretty well! I've also tried the unagi don (barbecued eel over rice), spicy tuna hand roll, and the pork belly skewers. All were super yummy. One thing I wasn't a fan of - cream cheese in almost every sushi roll. But! You can ask for the roll without cream cheese which is great. Wait times can be long during lunch and dinner rush hour, but that is definitely to be expected because of how popular he is! Make sure to bring some cash if you don't want to spend extra on credit card fee (they use square). Service is great and Jimmi is always friendly!I'm knocking one star down for price (it's on the expensive side - a roll can be upwards of $14) and a too \"americanized\" sushi vibe. Sometimes I like my sushi traditional. I would enjoy it better if there were some simpler options. All in all, I don't have any hesitations about going to Sushi Jimmi when I'm super hungry and need some quick fix sushi!"], ["El J.", "I'm not gonna lie, the idea of food truck sushi spooks me.  But SJ makes a strong impression.  Their currently limited menu tends to combine an eclectic mix of sushi rolls with Japanese twists on Mexican staples.  The rolls tend to be large (I never fill up on one roll at the restaurants; I did here), complex, and will run you approximately $7-12.  The roll offerings have varied pretty widely in a handful of visits.  I suspect they're still working their menu out.  Besides their rolls, the Mexican dishes have been fun and work very well.  I've had sushi tuna tacos, crawfish nachos (served on Doritos!), and jalapeno poppers (highly recommended).Find Sushi Jimmi on Facebook."], ["Sabine N.", "Had lunch there while they were parked at the Craft and Brew event at Crosstown Arts. It was really good! I'll definitely eat there again."]], "Sekisui Midtown": [], "Tokyo Grill": [["Tim N.", "This restaurant quality is over the top; everything from  pickup to dine in. Food was quiet amazing, the fried rice is on point; not too much salt or oil.Try it your self!"], ["Ashley S.", "Convenient, affordable and incredibly yummy sushi!!! The east Memphis roll and the grizzly roll are my favorites but I would also recommend the fancy dragon roll! The food is made to order but still ready very quickly!"], ["T C.", "A friend and I ate here and I was very disappointed. The food was OK but I didn't like the fact that the food is served on styrofoam plates and plastic ware.  We dined in and rice was served in a surprise container . I could have dined in a home on styrofoam places.  The second thing is we asked for a to go container and she brought a small sushi container.  I then asked for a bigger to go container she said OK.  We then checked out and she charged me $1.50 for the to go container. She never said that we would be charged.  Who charges for a to go container???  I will never eat here again.  I passed by several restaurants that treat their customers as customers."], ["Cris W.", "Fried rice is good. Memphis roll is good. $3.50 for 3 nasty spring rolls...not so much."], ["Charles H.", "Good deal. Go there frequently. For cheaper sushi would highly recommend. The hibachi and cooked food is a good value as well."], ["Brian A.", "Fabulous, absolutely stunning! By far the best Japanese cuisine you will find in Memphis. Fuck all other options Tokyo grill is my main go to. Favorite menu items include; Steak and Shrimp Hibachi, House Fried Rice, and pick any 3 roll combo! These people are hard working and try and provide you with the best experience possible!"], ["Brad G.", "Hibachi, fried rice, 3 sushi rolls! This is what I always get and it's fresh and consistent every timeThe outside is deceiving, it looks like a run of the mill asian take- out place. This one is very nice a clean inside.  Oh and it's cheap!"], ["Deborah P.", "Ordered pork katsu. Overcooked and dry. Could have used it to resole my shoes. Do not think we'll be trying this place again."], ["Jennifer R.", "I have eaten at this place a couple times for lunch.  I work right around the corner and it is convent for a quick sushi fix during lunch. The only few times I have been to this place was because some work girls wanted to go. Like I have said in other sushi reviews, I am a bit of a sushi snob...the few rolls I have eaten here have been mehhhh.  If you do order the sushi I would stick to the specialty rolls.  The cheaper rolls are not the best.   I will say their fried rice was delishhhhh.  I would definitely go back and order that rice!"], ["Viet T.", "It's been awhile and several visits since this review.First let me say that this is the cheapest place anywhere to get decent sushi.Again a grade above supermarket sushi, which I have found that's how a lot of the chain sushi places are... if on par to that.My last review mentions the katsu and how it lacked flavor.Well I gave it another chance, this time making an actually bowl and I have to say that is one of the best things I have ever tasted. Can't compare it to other Japanese places because I usually get sushi, but even if those places taste better you can't go wrong ordering it from here.Pine nut tuna is also a thing to try... get a side of rice, as well as many of their special rolls.All of their other entrees are pretty decent, again nothing spectacular, but when you only have to wait 10 minutes vs the half hour or more at other restaurants (and honestly it's probably a lot longer than a half hour).I will say I don't like their soups, and while the salad is just a premix with cabbage and carrots the ginger dressing is actually pretty good(so if you order anything with soup or salad stick to the salad).So if you are in a hurry or don't want to dish out $100 bucks for dinner give this place a shot."], ["Katie M.", "My all-time favorite Japanese restaurant in Memphis. The fried rice is absolutely unbeatable. The sushi is fresh and very yummy. I've been going to Tokyo grill for about a year and have been hooked since. I order to go at least once a week because it's also very affordable for me, being a college student and all. If you order any of the fried rice meals you're 100% going to have leftovers, the amount they serve you is NUTS. Oh and if you order hibachi must ask for the two special sauces in little cups it compliments the meat and veggies so well! :) it's the best."], ["Cristina H.", "This place is the cheapest sushi, hibachi, teriyaki place in Memphis that still has decent quality. The owner has told us before that he doesnt care about being rich he just wants to broaden peoples palates to the wonderful taste of sushi and i think that is awesome! Seriously, thanks to Tokyo Grill I was able to throw a sushi party and my coworker loves it too bc it is more reasonable than say Blue Fin or Stix.  Its defeintely along the lines of a fast service restaurant even though you can dine in. At lunch its better to just get it to go bc it gets packed quick, I;ve posted our bill under pictures just to give you an idea of the prices and its really good. Im not a fan of the hibachi chicken but thats anywhere honestly. I love their sushi platters and I love their fried rice!! THAT YUMMY SAUCE is ahhhhhmazing."], ["Charlene A.", "I don't know what is going on with their lunch crew but service here has gotten terrible. The past couple of times I ordered take out I was told 10-15 minutes, I showed up after 15 minutes and had to wait an additional 15 on my food when the place was deserted. Today I dined in and I bit into a raw piece of chicken. Their response \"I'm sorry\", no offer to fix the problem. I won't be back."], ["Marvin S.", "You can not get better sushi for the price anywhere in Memphis! The food is fresh. The portions are big. The staff is so friendly. I will be going back very soon!  This is a great place!"], ["Halsey J.", "Called in a to-go order, salmon hibachi. I asked for it medium. Once I arrived home, I took one bite and noticed the salmon was over-cooked. Looked at the receipt to find that the lady that took my order had typed in 'medium-well'. Sad day. The flavors were good. Its definitely cheap quality but the prices are inexpensive. I will return but it will probably be a while."], ["Kerry C.", "Tokyo Grill is walking the same fast-casual line as places like Panera or Chipotle - better than fast food, but more casual and affordable than other Japanese restaurants in town. They've got a nice dining room, but their primary business seems to be take out. Several parts of my meal (but not all of it) were served in to-go containers, which seemed a little weird for dining in, but it made packing up the leftovers easy.And I had a lot of leftovers, mostly because I ordered way too much food. Tokyo Grill's menu is extensive for such a small restaurant, and my friend John and I had a hard time choosing. We were the only people in the restaurant, so the waitress came and took our order very quickly. When we weren't able to make any concrete decisions after asking for more time, I just started ordering things.We started with an order of crab rangoon. I know that crab rangoon is fairly standard, but whatever wrappers Tokyo Grill used were better than most. They were perfect little crispy fried triangles filled with sweet cream cheese and crabmeat.We also got sushi - a Spider Roll (on the server's recommendation) and a deep-fried Yummy Roll. Both rolls were good and fresh, but not spectacular. On the Memphis sushi spectrum, they fall somewhere between gas station sushi and Ryu.The best thing we ordered, though, was the Pine Nut Tuna. When I placed the order, I wasn't exactly sure what I was getting - it was listed as coming from the sushi bar, but didn't mention any kind of roll.What I got was a long dish of cubed raw tuna and chunks of fresh avocado, topped with a soy-based special sauce and sprinkled with pine nuts, sesame seeds and roe. It was sort of like Japanese ceviche.Pine Nut Tuna, Tokyo Grill, Memphis, Tenn.I ate it with chopsticks, but next time, I'll probably take it home, make some wonton chips and eat it like salsa.Tokyo Grill is open daily from 11 a.m. until 10 p.m."], ["Chris M.", "Pretty good food. As others have stated, if you eat there you still get plastic plates, forks, etc. Clear soup was not very good but over all the food was good enough I would try again. The sushi people were getting looked really good."], ["Sarah S.", "Tokyo Grill is just a short drive from where I work, and when I was still working in my previous position and had to work on Saturdays, I'd often meet my boyfriend here for lunch. It's a small place, with a few tables and a service counter, so you can dine in or carry out. The staff is very nice (and definitely had our orders memorized pretty quickly after our first few visits) and service is fast. I usually stick to the hibachi and combo meals because you get a ton of food for a great price: choice of meat (steak, chicken, shrimp, scallops, and salmon, with various combos), a side of vegetables (mushrooms, onion, and zucchini), and a big heaping of rice (fried or white). I've had their tempura chicken and vegetables before and they're quite nice and come with a tasty pot of sweet-and-salty dipping sauce. Their scallion pancakes and yakitori chicken are tasty appetizers, and they serve their salads with the best ginger-sesame dressing ever. Everything is served in carry-out containers, whether you dine in or carry out, but that just makes it easier to take any leftovers home.This is a great place to go for quick, tasty \"fast casual Japanese\"--perfect for lunch or a lazy weeknight dinner. It's cheap too, which is an added bonus!"], ["Wayne R.", "This is a pretty good place to go for lunch, which my girlfriend and I did.  I had the steak and jumbo shrimp, and they give you ample amounts.  Everything is placed in to go containers, even when eating in, but there is nothing wrong with that at all.  Recommended by me."], ["Gloria L.", "Terrible. My salmon hibachi was over cooked and dry which I know fish is fickle but when I told the chef. He told me \"it's not supposed to be sashimi\". I know what the hell a dry ass piece of salmon is. I've over cooked salmon plenty of times! Then it was attitude central. So he asked me what I wanted him to do so I asked if he can make me beef instead. When I got the beef, it was not only over cooked but really tough and dry! I was already ready to give up on life because of the shenanigans I've endured earlier that day. So my friend (which tried both proteins and felt the same way about the dryness) took my food up to the chef and told him my beef was over cooked. So then the chef began to tell my friend that it's not filet minion! I'm seriously over this place. Please don't come here. I liked the woman taking my order, she was apologetic and nice. The chef/ claims to be the owner, is a hard headed asshole. He wasn't going to give me a refund until my friend told me that he was going to tell the owner of the other store! SHEESH!"]], "South Main Sushi & Grill": [["Srishti S.", "It makes me super happy whenever a new place opens up in south main. I was super excited to try this dish place after Vaish told me about it, and m glad I did.We went there on a Saturday afternoon and it was pretty busy. Nice decor!We started with edamame, which were good, nothing special.The ginger salad was very fresh, the dressing very flavorful. Husband took veggie sushi which he said was nice, I took the fire roll and it was amazing!! Loved it. Though my favorite sushi place is Sakura, but it's cumbersome to drive all the from downtown all the time.South main sushi grill will for sure satisfy many of my sushi cravings when I do not have the time and patience to drive to Sakura"], ["Syd M.", "I love sushi and the convenience of walking to a restaurant, so I was thrilled about the addition of this restaurant to my neighborhood. A couple friends and I decided to have lunch here the day after thanksgiving. I arrived after my friends did and walked over to the table. The restaurant was pretty empty at this time- 2 at the bar and my friends. Several staff people were decorating near the door but I wasn't acknowledged at all when I entered. We were seated in a booth with wonky seat cushions and although it was raining and cold outside, for some reason, the staff wouldn't turn the fans off when asked by another customer. So the food...I got three different rolls and seaweed salad. Crunchy shrimp roll, fried salmon roll, and the philly salmon roll. The seaweed salad was a bit too salty and because of that I couldn't finish it. The sushi was okay- not bad not amazing, just okay. My friends had lunch entrees and were generally satisfied but again not amazed. If you like sushi, you know that there are some phenomenal sushi spots around the city. The sushi was fairly priced but you can find better tasting sushi for just as good of a price elsewhere in the city. I had high hopes for this restaurant but if I had to pick between convenience and quality, I'd pick quality and go elsewhere."], ["Vaish P.", "The location can't be beat! Such a great addition to the south main area. Oh course the food is great too!I came here the day after it opened so there were a few glitches I'm sure come with it being a new, hot and busy place. The decor is cool and trendy and trying to keep a minimalist theme, they put the soy sauce in these tiny tiny containers. Oh course the container on our table was empty as well has 3 others I stole from nearby tables. Not a big deal, but by the time I got some soy sauce, my husband had eaten most of my sushi...So on to the important stuff, food! We ordered the shrimp gyoza starter and 2 sushi rolls. The gyoza was fresh and the dipping sauce was perfectly sweet and salty. The sushi rolls were the island roll (tempura shrimp with lettuce which was amazing and different) and the Sriracha roll (shrimp tempura with tons of spice.) Sounds like a lot, but the portions are kinda small, so we ended up ordering the steak fried rice and fried ice cream which was a smart decision because both were even better than the sushi! Also the prices are pretty decent which is good so you can order can tons of different things to share...or not. Love that this is in my neighborhood and can't wait to become a regular."], ["Kontji A.", "A little backstory before I share my experience. The chef who took over this prime South Main Street location is the son of the chef who first brought Benihana's to East Memphis. You know, the restaurant that burned down a couple of years ago. He has a beautiful wife and adorable little boy and girl.  I spoke with him for a minute or two and he was so excited to put his 15 years of restaurant experience into this new sushi spot. I'm super excited for what's to come. I attended a party there to celebrate the opening of the restaurant in the old Grawemeyer's. I tried several different sushi rolls that were quite tasty.  The tempura was delish.  Had to stop myself - you know, fried food. My husband kept getting plates and plates of the shrimp fried rice.  He absolutely loved it. I have always loved the layout of this location.  It has an open feel to it and looks like the architects put a lot of work into it. The walls are decorated with tasteful Japanese art. This is a good casual date place or a spot to meet up and have a cocktail with friends.  I'm told they will have lunch specials. All restaurants take a period of time to get into their groove.  I really hope the neighborhood, once void of sushi, will give this restaurant a chance!"], ["Frank C.", "I went last night for a semi - private party, which was introducing the restaurant to the South Main community. The sushi was excellent, the wine selections were great, and service was superb. I sampled about eight or nine different sushi's, the tempura, and the fried rice. I have not eaten there during regular restaurant hours, but spoke with several locals who had. They raved about the service, saying that the staff was excellent and very attentive. I also had a chance to meet the owners, and they are a young couple who seem professional, dedicated, and eager to serve.I will definitely be back to eat there again."], ["April S.", "This place just opened up in the old Grawemeyer's location on South Main.  I like to give new businesses a fair chance to get up and running before writing a review, but since I didn't even know they were open, I figured I'd go ahead and post here to help get the word out.I like the atmosphere and decor... It looks exactly the same as it did when Grawemeyer's was here, but I think it works well.  It's a bit more elegant than you might expect for a restaurant featuring sushi but it's still casual enough to be comfortable and inviting. Besides sushi, the menu includes entrees of steak, chicken, seafood and noodle dishes. They also have a full bar.We popped in during South Main Trolley Night last Friday and the place was pretty busy. We decided to sit at the bar rather than wait for a table.  The bartender/server suggested I try the Japanese whiskey, and so I did.  It was good!  I did take a very long time to get our drinks, however.I'm not a huge fan of sushi since I don't enjoy rice.  I asked if they had any sushi rolls that did  not contain rice (some places do), but the answer was no.  I was tempted to order a steak entree, but I wasn't all that hungry so I settled on a sashimi sampler listed as an appetizer.  I also ordered miso soup.  My friend ordered two sushi rolls.  I don't remember which ones he ordered, and I didn't try either of them, but they certainly looked good! The miso soup was okay.  The sashimi was good.  The service was slow and there was some confusion as to who was actually supposed to be serving us.  We had to ask for napkins, soy sauce and wasabii.   I'm cutting them some slack on the service this time around since they are a new business.  I'll update my review after my second visit."], ["Anjum B.", "Average sushi, average price. We went by during the last Trolley Night and it was busy. Super busy. The staff all seemed flustered but were still pleasant We were told it'd be a 15 min wait which turned into a 30 min wait. Sushi was okay. Nothing special. But it was also on the lower end of pricing compared to other places in the area. Good place to get your sushi fix without breaking the bank but if you're picky about quality and want a lot of diverse options, go elsewhere."], ["Barry G.", "I live downtown and nearby this restaurant.  I've been several times since it recently opened and have been more than satisfied with the service and food quality.  The new owner is always present and the restaurant staff is attentive and I can tell they have been trained well.  The service is excellent, bottom line.  I've ordered the sushi, noodles and several other menu items.  All were prepared well and tasty.  If I understood why people write 5000 word essays here, perhaps I would...but since this is a restaurant review rather than a post doctorate dissertation of yelp eccentricity, and I only carry an honorary degree in food, I'll just say I'm completely satisfied with South Main Sushi.  The prices are good, the service and food are good. That can't be said for many new restaurants...so give it a try if you are in downtown Memphis.  Good eats."], ["Elle S.", "Sushi is poor quality. Rolls have lots of mushy rice. They don't have a lot of roll options and they had a lot of fried ones. I got the flower and soft shell crab roll. The server suggested flower roll when I asked and I knew it was fried. The crab roll had a weird flavor I had to kill with wasabi the fried roll I stopped eating after 2 rolls because i felt like I was eating rice pudding and didn't want to waste calories. I was sitting there and the bartender came and asked if everything was ok I said yes and he said looks like you like the food. I'm not sure if he was being a smart ass because he heard me say I was not impressed with the sushi but by then I had eaten 3 crab rolls and 2 fried rolls and for about 9-10$ a roll I hate wasting. But the SO ate the rest of my rolls which does not happen usually cause I'll eat them all. After about 5 minutes of watching my SO eat his fried rice I decided to give the fried roll one more chance and it still tasted like rice pudding. I really hope they add more rolls and improve quality because I was so excited to have a sushi place within walking distance. Now on to the Beef Julienne and Chicken. It was pretty good I have to say. Wish  they'd add more veggies to the fried rice but it was pretty good i would give that dish a four.I give them 2 stars because it's a sushi place and it was not impressive at all.Their entrees might be better.I'll give them another try in a few months when hopefully they have had time to improve."], ["Derrick N.", "Ive been to lots of sushi places and this has be one of the better ones. In memphis anyways. Menu is simple but very detailed. The bar is great. Pretty much anything you want they have! Live music on weekends. Sports on all the time. I just really enjoy the atmosphere there. One of my new favorites for sure"], ["Chelsea K.", "So happy to have another sushi joint downtown. Service was very friendly and accommodating. Food was delicious. Can't wait to see this place grow!"], ["A L.", "Don't eat here, low quality sushi , i ordered simple spicy tuna roll, it smelled like old fish and the color was light pink,  definitely not tuna, I didn't even attempt to eat it , I left... This was opening night. Eaters beware."], ["I V.", "Premium bar, sake varietals, simple menu, big tastes...every time."], ["Brian H.", "South Main Sushi is a welcomed addition to downtown.  It has a great atmosphere, friendly staff, good sushi and an extended menu. I'll definitely be back."]], "Mulan Bistro": [["James M.", "Excellent spicy tuna roll. Enjoyed the sizzling hot beef. Nice atmosphere. Prices were a good value. Will come back again."], ["grant p.", "The food is good for Chinese food. Simple and what you would expect. I also enjoy the sushi delivery. However. Be careful ordering for delivering,  today was the third time the order has been wrong. And they always ask \"do you still want it?\"  Yep I ordered it. Well this time they brought back what was wrong but it was still wrong. So yep it's Chinese food but their delivery needs work."], ["Viraj I.", "A value addition to the Cooper-Young's hip ambiance, Mulan Bistro is a great place for authentic Chinese cuisine (and Sushi!). I've dined here about 5 times now, and I've never disappointed. Beginning from the crunchy complimentary munchies to their mouth-waterin' entrees, vegetarians (me being one) will find a wide array of options to pick from. I must confess, their tofu is tender, juicy and delicious, as good as it can get. I've tried a few things here, namely vegetable spring rolls, eggplant in garlic sauce, Mapo tofu, Kung Pao tofu and Tofu with curry sauce and I'd definitely recommend the latter three, specially for somebody who enjoys the rich spicy flavor. I've always had white rice to go along, and it tastes good to me. My friend's tell me their duck is great too!Although finding a parking spot can easily escalate into being a pain, specially when you're dining there either on a Friday or on a Saturday and it sometimes being too loud for you to have a cozy conversation, overall it's a great place, not forgetting to mention their pleasant attempt at authentic Chinese restaurant decor."], ["Leah Beth B.", "I really want to love Mulan Bistro. As a matter of fact, I've eaten there four times just trying my darnedest to fall in love. But it's just not happenin'.I've dined in three times and ordered out once. Three of those times, I ordered Chinese from the menu; the typical General Tso's or Sesame Chicken. It's not that the food is terrible (although being a former NYC gal, I know a thing or two about Americanized Chinese food), but for the price I expected to have my mind blown. Paying $15 for the same thing I could have at the mall for half the price makes this place a bust. I went out on a limb last week and opted for the sushi, and once again, I was disappointed.I've had the same server every time I've been there and she always forgets my table. My drinks don't get filled, I won't have silverware, etc. I feel bad because she's so daggum happy, but when my thirty-minute-meal turns into an hour-and-a-half of waiting around, it gets a little ridiculous. I tried to love you, Mulan. I really did."], ["Vim I.", "Mulan made for an okay dining experience. The good stuff first....The restaurant is beautiful (definitely not a hole in the wall since they take up prime real estate on cooper/young). We had a super friendly waiter and the rest of the servers were accommodating and filled drinks as needed. The lunch menu was priced reasonably: choice of soup, spring roll, and entree with rice for just 8 bucks! The entrees are your basic choices such as Mongolian Beef, General Tsos, etc. If you venture off to the main menu, you'll get inundated with the amount of choices. It's everything and the kitchen sink including adventurous dishes and sushi. I know this is how most Chinese restaurants work (or most international cuisine restaurants in general)--but I would rather have one page of menu items to choose from that they do really well. I got the Mu Shu Pork which was supposed to come wrapped in \"chinese pancakes\" which in reality were just thin tortillas. (I'm sure this is considered authentic but it just felt like a missed opportunity for flavor). The filling was pretty bland and the huge bowl of hoison sauce on the side didn't help boost any of the flavor. The General Tso's was tasty--but it was pretty average to what I've had at other restaurants. Overall a pretty underwhelming experience."], ["Lauren B.", "Absolutely love the authentic Szechuan menu here! The pork belly cold dish is my favorite, closely followed by the spicy Szechuan beef dish. And the best part about it is their take-out, which only requires a $20 minimum purchase and $2 delivery fee. They deliver up to 5 miles away! Every single dish I've ever gotten from Mulan has been delicious."], ["Jacob J.", "Driving through the area we passed an Urban outfitters and I thought, YAY! real city folk.  Inquired as to what this area of town is considered and the reply I got was, \"where the hippies are\" and hippies there were.  Memorial Day was not the best day to find this area.  Most restaurants were closed and in all honesty we came this way to try either Beauty Shop or it's sister Noodle doodle do.  I did have a third in mind if the two were closed and that was Sweet Grass but this also was closed.  BUMMER!Mulan was one of few places open.  We happened to pass a threesome as they were exiting.  I asked for their take on their lunch experience.  This is what the old gentleman shared with us.\"Lunch special was a great, great deal.  (He was smiling.) You got a main meal, rice, a small appetizer too for $7.99\"  \"I got the chicken, it was good.\"  His wife also shared, \"I got the shrimp which was tasty\" though she hadn't any determining facial expression about it.  Both of them shared the same, that service stunk.  \"It's not busy, it's slow and so was everything.\"  \"Good luck\".What a solid review I thought.  In fact, service did stink, it stunk actually.  No good recommendations given.  What a putz.  Recommended this pepper dish but didn't say anything much about the flavors.  When we got the entree, think chicken pieces and a shit load of chilis and peppercorns.  The peppercorns had something on them, if you bit them it would coat your tongue in ginger and something else.  The feeling was off putting and made everything else taste the same.  As if my tongue was shocked and lost feeling.  We asked the waiter about it and to which he gave us an \"oh yeah I don't eat those, I like to separate them\" response.  Price wise it was too costly.  Not offering an appetizer platter sucks guys.  The pricing could be lower on a few items.  We got there as the lunch deal ended.  It seems the waiters haven't any control.  The cooks have more control of management.  Everything took its time.  Drink refills came much too late.  I started to get the overwhelming feeling to get up and pour my own drinks.  That late.  The bill was more time wasted, I got up to get it and again to have the CC run.  As far as food goes, some flavors were good and if I were in the area, I might get takeout to try more of their menu.  This isn't your typical Chinese fast food kind of place.  They have the standard dishes including General Tso's but also offer hot and hot pot dishes as well as sushi.  It's worth it to look at the menu online and take recommendations from other reviews.  If management is reading, yall need to hire waiters with personality.  People that can relate to their customers and feel comfortable having a conversation.  The waiter we had seemed anti-social, almost afraid of the next question.  Also, people with common sense.  If appetizers are ordered it makes sense to bring out dipping sauces.  Extra napkins, drink refills etc.  Don't people like good tips???"], ["Huyen T.", "I've had Mulan twice, I was going to go to Noodle Do...lol, but ended up going to Mulan instead because the parking lot we used was Mulan's. But anyways, the sushi bar was open and we were seated.They gave us wonton chips to chew on while we ordered (different lol)  The place is a mixture of Chinese cuisine and Japanese's sushi. Of course, I ordered sushi...because I'm just a die hard fan of sushi. (y so addicting?)So I ordered a few rolls, I don't remember the name because it was too long ago. I just remember that it was realllyyyy good! Sushi was fresh. They offered the usual rolls that every other restaurant BUT also, they own creative rolls.I remember what I had last time now! A jewelry box, it was interesting and good. lol Just too much rice.  ...but it was good, so i guess that's okay :)The atmosphere was dark, but we can see. lol So I would recommend here, go and enjoy it!"], ["Tom C.", "Good food. A little pricy but the portions are huge. Can easily share an entree, even if you're hungry. The hot and sour soup is amazing!!"], ["Ave P.", "The food is good. The service is horrible. I always go expecting that the poor service has been a fluke but then it happens again.  Your best bet is to order delivery. Otherwise your entrees will all come out at different times and your server will probably forget about you once or twice. I love the hot and sour soup and the bok choy is awesome. The sushi is decent but not the best that you can find in Memphis (head to Sakura for that). I would stick to the Chinese options, the Thai options have not been perfected."], ["Daniel M.", "Great sushi! Very creative rolls and good prices too. Excellent service!"], ["Don S.", "Excellent sushi and fresh Chinese menu plus they have brown rice available for a small premium!  Delivery is all I've ever used so I cannot comment on the decor but the staff is always friendly, delivery is quick and the food is alway made with the freshest ingredients."], ["Amanda B.", "Went for lunch with the work crew and was treated as a regular (alright the work crew is already a regular). Yummy sushi, plenty of options on the lunch menu. I'll be back to try dinner here soon."], ["Robin B.", "I had a lunch with a friend at Mulan Bistro recently, and enjoyed 2 sushi rolls plus a seaweed salad.  The seaweed salad was the cleanest tasting I've ever had in Memphis.  Light, not briney or fishy, and served in a martini glass.  The sushi rolls were very good, and the tuna was fresh and also clean and light in flavor.I recommend the outdoor seating, if possible, because the hustle and bustle of Cooper/Young definitely adds to the ambience!  The inside restaurant is dark but clean."], ["Frankie D.", "A little pricier than your typical Chinese takeout, but you get what you pay for. Authenticity, quality, and ambience is among the best of Memphis Chinese options. Plus they have an extensive Szechuan menu, which I think is the only one in Memphis. Oh, and fully stocked bar, so it fits right in with the Cooper Young feel."], ["Claire R.", "I've had several good experiences here, but the last one was bad enough that I won't go back.  I purchased a coupon for $40.00 worth of food from a local TV station for $20.00  1.  One of the meals was brought to the table incorrectly.  When it was pointed out, the server returned to the kitchen and came back stating, \"There was a miscommunication in the kitchen\" with no offer to make it right.  We kept the food they brought (which was less expensive) and carried on without complaints.2.  When we got the bill we asked for a refund on the incorrect food-not the whole amount, just the difference.  They gave us $1.00 off.3.  When we got the final check, it showed a credit of $20.00, not $40.00.  I pointed this out, and the server had to get a \"manager\" who came to the table and told us she was going to give us the $40.00 even though she \"wasn't supposed to because you're supposed to spend $80.00 with that coupon and I'm probably going to get in trouble.\"  Nowhere on the coupon or the website could I find that information.  I asked her with whom she was going to get in trouble, and could I get contact information for them so I could tell them it is not her fault that the coupon has insufficent information on it.  She declined.4.  She then denied the $1.00 refund against the incorrect meal.We paid, tipped 20% on the full bill, and left.Not. Going. Back."], ["Hannah G.", "The food is very good. It is above average for your usual take away places.The delivery is always fast and the drivers are always very friendly."], ["Olivia F.", "Another Asian restaurant in Memphis that could be better."], ["Ross G.", "I work in a research lab from time to time and have a fair number of colleagues from Southeast Asia.  This is where they go.  I probably don't need to say anymore than that.... But I will.  A great place for take out especially if you stick to the Szechuan menu.  We decided to go to dine in a Friday night not long ago.  In short, stick to take out.  The place was d-e-a-d and the waitstaff more interested in their smartphones and smoking in front of the restaurant than seating customers.  The menus look like they were printed 5 years ago and then attacked by a pack of wolves that just had a greasy meal.  The interiors sad and cheap appearing, everything a little crooked and dingy.  The fried wontons were  oil sponges.  The food, delicious and very fresh.  In fact I want some chicken and eggplant right now.  I apply the 4 stars to take out only.  If you make the mistake of eating there the rating drops off dramatically"], ["Amanda C.", "I FINALLY got to try Mulan. I have been wanting to go for weeks now, and stopped by with a friend on a Sunday for lunch.I got the lunch special of General Tso's chicken. It came with your choice of soup, a spring roll, fried or steamed rice and your meal. The plate was huge. I had more than enough food for lunch and got to take home some for dinner. The General Tso's was delicious. It wasn't too spicy, but had just enough spice to keep my taste buds happy. I also got the egg drop soup, which was awesome. I love egg drop soup (even though I don't really like eggs), and this was one of the better soups I have had. I wasn't impressed with the rice or the spring roll, but I am not holding it against them.My friend got sushi and told me how great it was. Had I not been so full, I would have tried hers to see for myself. My bill was less than $10 and we had exceptional service. Although their food was good, they actually got an extra star from me for their excellent customer service. I was entertained and delighted by our sweet waiter, who was attentive and helpful. The food was pretty darn tasty, and I will definitely be back!"]], "Red Koi Japanese Cuisine": [["Jason W.", "Just had lunch and wow, the sushi was great. 3 rolls, soup for 11.95.  Memphis maybe known for Bar B Q but this place is a safe stop for everyone.  I will be back."], ["Drew W.", "Hands down the best sushi place in Memphis. Huge selection, excellent service, and great prices make Red Koi an unparalleled sushi experience. The sheer number of astounding rolls and other delicious items blow the competition out of the water, especially in terms of the serving size they give you. The Tornado roll here is easily twice as big as the one at Sekisui and for $1 less! I've got a to go menu that I'm checking off each item as I try it and I hope to eat every single item at least once!"], ["Steven M.", "Me and the wife stopped in Saturday night for some sushi and hibachi. I've been here several times and the food is always delicious. My problem was not with the food, but the service. We ordered 2 rolls, hibachi dinner which comes with spring rolls app, clear soup, salad, and entree. Expecting to sit down and enjoy myself and my meal for a while I ordered some hot sake to go with. Less than 2 or 3 minutes after leaving our waiter arrived with our clear soup, spring rolls and salad all at the same time, i kinda scratched my head, then headed to wash in my hands in the restroom. When I returned my entree was on the table. I sit down to my whole meal being served all at the same time (before the rolls were even thought about being made). I have worked in the service industry in the past and I would never deliver app, salads, and entrees at the same, let alone before the other apps were served. This kind of upset me because I wanted to enjoy a hot meal, by the time I ate my salad, soup and spring roll it was not the steaming hibachi plate I had came for. I was forced to eat my meal in a timely manner, but the food was very good as always. On top of that, with all this food in front of me our server had the nerve to ask if I was ready for dessert, I almost died. I know now to order at my own pace next time unless you want 7 plates brought to you at once. I thought the server could have done his job better and coursed my meal out, no need to rush me out of the restaurant at 6 o'clock on a Saturday evening. Good food, bad service."], ["Rhonda P.", "Great place for lunch, and you can get hibachi at lunch.   Smaller place so it gets crowded sometimes.   You have to look for it as it's over by Staples."], ["Yuno G.", "The young lady at the host stand is very rude. The manager is amazing, the food isn't bad at a good price but JEEZUZ... that girl is always there at the front and her attitude is the worst, makes me not want to come in."], ["Shu J.", "We went here for our New Year's Eve dinner, and so glad we did. What a little gem, tucked away in strip mall land! Their sushi was wonderfully delicious, fresh tasting, and artfully presented. You can get regular, special, or premium rolls -- the more fancy ingredients, the higher the price. Frankly, you can get several $5.95 rolls and have a fairly cheap date. The New Orleans roll was especially divine. We're definitely going to go to this place again."], ["Hayes H.", "This is a great sushi place. The location is weird, but it really is worth it. Today was my second time, and I sat at the sushi bar. The sushi chef recommended the mummy roll, and said it was unique to this place. It was wrapped in rice noodles like a mummy and fried- it was delicious. Nice presentation. I've had great service and enjoyed the sushi both times I've been. I can't find anything wrong with this place except it is weird getting to it. I found it in a shopping area just wandering around after leaving target. I don't know if I would have seen it had I not been wandering the area!"], ["Laranda D.", "Food was good. Service was slow but good. Prices are great. Loved the sushi. Went for lunch which was really busy. Great decor. The bar is half sushi & half alcohol which was pretty neat."], ["Mike K.", "Good sushi is hard to come by. It's true. Take a food that puts a lot of people off, makes them uncomfortable, and then prepare it poorly and it is a recipe for trouble. I love sushi. I love raw fish. I've eaten fish raw straight out of the ocean and had a heavenly experience, and I've drunkenly bought sushi from the grocery store and regretted it forever. Red Koi is a step up from grocery store sushi. When you think of fresh fish, you think of it as being kept on ice at the market and smelling like the ocean, cold and crisp. The fish I got here was room temperature and limp. This is not appetizing. The fish at a sushi restaurant should be kept on ice as used, and kept very well wrapped and in the fridge when not being used. So, how did it become room temperature by the time it got to the table? On all 4 orders of rolls? Then, the rolls were only okay. I ate them since I paid for them, but wished I had just eaten somewhere else. I asked around the table when we were done eating, \"Do any of you guys think you'll come back here?\" and everyone answered the same: \"No, not really,\" \"Probably not,\" \"There's better sushi in town,\" and so on. My advice, skip it.Here is a review of the restaurant without thinking about the sushi. When I go to a japanese restaurant, I look for the large bottle of asahi or kirin to accompany my cheap house sake. This restaurant only has the standard sized bottles of beer. Speaking of cheap house sake, they only have the warm filtered sake, if you're looking for nigori here you're going to have to pay for a bottle of it. It's not terribly expensive, just not what I want in this type of establishment. I want the large beer to make my sake bombs with, and the nigori to wash it down with.I gave it a shot, but I'm not a fan. Oh well."], ["Angela G.", "Hands down the best miso soup in Memphis! Complimentary spring rolls to start are nothing to complain about, either! Love the crunchy shrimp and crunchy crab rolls. Blue Ocean, too. One of my favorites. Go early to beat the crowd."], ["Ceil G.", "The food was delicious! The edamame was some of the most flavorful we have ever had. Service was great too. Great service and sushi. Will definitely return if I'm in the area."], ["Jerome C.", "Not bad, not great. Staff was freindly though!"], ["James S.", "Bad experience and disappointed. My steak came out undercooked and I want it cook medium. They brought it back to re-cook then my vegetables and rice got cold which they suppose to heat them all. sushi was ok but nothing special, its like missing something that I don't know. My money not worthy spend here."], ["Steven H.", "Good flavor, American-ized sushi. Don't expect a ton of flavorful, fresh fish. But rather this is more of your typical American style sushi with sauces, creams, spices and other flavors to enhance the rolls. Overall rather affordable and quick service (especially for dinner). The rolls are an average size, not tiny but not too big to fit in your mouth. My rating is a solid 3.5 stars."], ["Mimi P.", "I really like Red Koi for a few reasons. The staff are always super friendly, the food is great and it is 5 minutes from my house.My favorite things to order are the Big Apple Roll and the Red Koi Fried Rice, Spicy Tuna salad and the Germantown Roll. Is it the most authentic Japanese food I have had in my life? No. Does it taste good? Absolutely."], ["Adrienne J.", "I've never reviewed a restaurant before but I had to take my time out to review this one. Why? Because I read the reviews on other sites and they were waaayyyy off.Also, I went for my birthday, so my expectations were high. I ordered simple rolls that you can get anywhere and they will be generally be the same: a Hurricane and Crunchy Shrimp roll as well as shrimp fried rice to go. $25.02 total.Sushi - The (albeit hard to read) online pdf menu said that a deep fried hurricane roll came with eel sauce. No sauce listed for the crunchy shrimp. Both descriptions are standard when it comes to these 2 types of rolls. I get the rolls and there's this white sauce on both rolls. Maybe you've heard of white eel sauce, but I haven't - ever. And it tasted like suped up Miracle Whip - yuk!Fried Rice - It was salty and nasty. The rice was stuck together and it just had an odd flavor overall like they didn't just use soy sauce but also some added flavor. I didn't try the Habachi grill but I'm assuming if the basic rolls and fried rice were bad, the Habachi won't be any better. It took me two days, but I ate both the sushi and rice. I did spend $25, afterall, and I shouldn't dove in head first - especially when it comes to sushi. All and all, if you're new to sushi - don't try it here and if you're not new to sushi - you won't like it."], ["Jenny J.", "I only visited this restaurant once after hearing a few good things about this place.  I was a bit disappointed.  The service was OK but the quality of fish was mediocre.  As I mostly eat nigiris, fish needs to be super fresh and of high quality and this is where I was not impressed."], ["B B.", "The food is about as close as Memphis can get to the Pacific coast.Watch out Sekisui and Osaka... there's a new Sushi place in town and it's Red Koi.Very good sushi rolls.  As someone who needs to avoid raw fish, there were plenty of tasty roll to choose from... although the combinations were the old standards and not really anything unique.My wife. a Californian, said the nigiri was \"excellent\".The staff was very knowledgeable and friendly.  The wait time was adequate.The prices were reasonable for the amount of food we devoured - abour 15%-20% less than what it would have been at Sekisui."], ["Kristen S.", "I love this place! I'm a big hibachi fan but let's be honest, you've seen the show once you've seen it a million times, and I don't want to politely pay attention or catch zucchini in my mouth anymore when I'd rather talk with my fellow diners. Here thankfully, there's no show but you get all the delicious hibachi brought to your table like a regular meal: your salad, your awesome clear soup, great veggies, rice and for me, steak. I won't say this is the top hibachi I've ever had, and I wish it came with noodles too, but it's very good and you get a good portion. I also love the Spicy Tuna Salad. It's delicious and seems like a generous portion to this sushi novice. My boyfriend the actual sushi fan has enjoyed his meals each time we've been here, and the price is just right. We both walk out full, me with leftovers, for about $50 before tip, and that includes a little alcohol. Servers and sushi bar folks are very friendly. I'm so glad we found this place while we're here in Memphis! The menu selection is impressive and I cannot wait to come back and try the udon soup!"], ["David A.", "This is a very nice place for sushi at lunch.  They open at 11:00, so you need to get there early.  They have some very nice lunch specials.  The service is very good, but gets a little slow the busier they get. The prices are some of the best around, and the sushi is always fresh.  I like the Cordova roll and I get them to add the spicy mayo.  The spicy yellowtail roll is good as well.  Actually, I haven't had a bad roll there at all.  I always get an order of fresh salmon nigiri as well. Love that stuff!"]], "Bluefin": [["Tom S.", "Plenty of seating and an outdoor area too. I had the fresh catch, it was one of the best meals I've ever had. The crab and pistachio ravioli was very rich and went perfect with the sauce and bacon greens."], ["Hillary G.", "Went here one evening after a cocktail party. I had a tequila sunrise, spicy salmon & spicy tuna rolls, and bread pudding. 1) The tequila sunrise was very good. They were not stingy with the tequila at all. Good, balanced drink. 2) The spicy salmon & spicy tuna rolls were both very much as advertised. If you're used to sushi bars that pay lip service to the term \"spicy\", these will be a shock. They were EXTREMELY spicy, so just be warned. I can't be sure they didn't crank up the heat to cover up the fact that the fish wasn't the best quality.3) Finally, the bread pudding was very \"meh\". I will not be getting it again. It was quite bland; not enough cinnamon, nutmeg, or really ANYTHING. Bread pudding should present the taste of the spices front & center, not as a hint. 4) The service was EXTREMELY slow, and it can't be blamed on the crowd, because it wasn't crowded at all.Overall: it wasn't bad, but it wasn't good either. There are certainly better sushi places in Memphis (I used to go to Sekisui Cordova a lot, but haven't been there in 3 or 4 years so I can't say), and we probably will be going to one of those for our sushi fix."], ["And W.", "Volcano roll was fantastic.  Good sushi in downtown Memphis right in the middle of the action."], ["Gary P.", "I walked in here by accident but decided some sushi would be great for lunch. They offer a variety of sushi rolls on there sushi bar offering. They bring the selections to you and you select what you want. All I tried were very good. I'll be back"], ["Christopher M.", "The ambiance and decor  is appealing to the eyes. The seafood ceviche was flavorless... I had to ask for lemon to give it some flavor and even add soy sauce which I've NEVER done to ceviche before. The plate also came with a mountain of fried wontons - too much. I also ordered a house salad with seared tuna that was just okay. I would have given this place two stars but the staff was friendly and the pricing was reasonable. Wouldn't go back though."], ["Muhammad M.", "Service sucks.. I don't knowWhy I pick this place.. Table was sticky and once again service sucked"], ["Lisa R.", "I love going to Bluefin because it's a cool place downtown with a fun atmosphere - and the sushi is good. However, the prices are just a little too high for the portion sizes (the sushi rolls aren't very big). My favorite time to eat here is at lunch during the week when they have half priced rolls, but then I miss out on the night-life atmosphere you get there at night. Overall it's a fun place to go when you're downtown at night and in the mood for sushi, but it costs a pretty penny."], ["Nicole C.", "Can someone please explain why the South is making sushi?? This place was gross. I ordered the spicy garlic shrimp which had no flavor on the shrimp. Only the rice had seasoning in my bowl. The crab rolls had imitation crab. Come on, we can see the compacted little strips of fake crab. Idk why I thought it was a good idea to have sushi in the south. Memphis needs to stick to what they know."], ["Vim I.", "How have I not written a review about Bluefin yet? it's definitely one of my all-time favorite memphis restaurants. It's a go-to spot that I like to take friends from out of town. I've pretty much sat in every lounge area in bluefin at this point. If you go with a big group, definitely ask ahead of time to get one of lounge areas or the rooms if you want to be more private. I love the blue lighting and swanky decor--it definitely makes you feel like you're going somewhere special.The service is always good. The sushi is even better. I've honestly had a lot of items off the menu and liked pretty much everything I've eaten. You can also ask for freshly grated wasabi if you don't mind paying a little extra--and yes it makes a difference than the green goop you get in most sushi restaurants for free. Only one downside is that the sushi's on the pricey end--you can get as good quality at Sakura in Germantown. But Bluefin beats out any other sushi place in memphis on sheer innovativeness and atmosphere. If you're downtown and want to do something extra special, go to Bluefin--you won't be disappointed."], ["Ian N.", "The decor is cool, but the sushi doesn't quite live up the hip and trendy vibe of the restaurant. I came here twice, once to dine in, the other for takeout.When I dined at Bluefin, I came with colleagues and tried a wide variety of their sushi, sashimi, and rolls. The quality of the the fish was... fine. Nothing special, but really not bad. I would stay away from their special rolls. I don't tend to enjoy rolls with cream cheese, but even the ones without this blasphemous ingredient were just ok. The seaweed salad, however, was excellent. I suggest ordering it with octopus.Both times I came, the service was slow slow slow. Took forever to order when I was there, despite the restaurant being almost empty. When I ordered takeout, and they said it would be twenty minutes, I showed up twenty minutes later, and waited twenty more minutes! Not great.Overall, Bluefin is a sushi joint that should focus a little less on their presentation and a little more on sushi and service."], ["Mike J.", "Went a couple of weeks ago for the first time. I had been wanting to try this place for quite a while. We were not disappointed, we both enjoyed it. It took a while to get the feel for how the restaurant works, you can order off a \"standard\" menu that includes sushi and asian dishes, or a sushi menu, and every now and then your server comes along and tempts you with fresh sushi of various types.  We ended up ordering off all the menus, and partaking in the fresh rolls. We ended up eating more than we should have and bringing home the last of our main course.Probably my biggest reservation is cost - I found it a bit pricey."], ["Ally J.", "If you need a break from the fried food an BBQ gluttony that is Memphis cuisine, definitely give Bluefin a chance. We ordered the miso soup, soup of the day(tomato basil), assorted sashimi, roll of the day, and the veggie flatbread. Everything was delicious! I have to say I was exceptionally impressed by the tomato soup and flatbread as I didn't expect non-sushi, non-Japanese dishes to be so great in this place. It is a perfect place to take a group of both sushi lover and less adventurous eaters. My mom doesn't like sushi and can be all around picky so it was great to eat some raw fish in a place she could also enjoy. Nice wine and beer selection too. And the restaurant is absolutely beautiful! Definitely recommended."], ["Fariha H.", "We discovered this place thanks to a friend's recommendation and had a perfectly pleasant experience all around. It was a nice large space, and even though there were just 3 people in our party you could easily come here with a much larger group. We ordered off the sushi menu, and just about everything was excellent. We tried the edamame, the blue fin tekka roll, the spicy shrimp roll, the kani kani and the rock and roll shrimp to name a few. Everything was delicious. The server was a little odd, but attentive and sweet nonetheless, and the prices were exactly on point to what you'd want to pay for the food and experience. We would definitely go back again."], ["Kevin W.", "I have not gone to a sushi place in Memphis and this one set the bar high. The food was great and I had a great time.  The good about this place is that we were allowed to bring our own bottles of wine. There is a $10 fee per bottle for bringing your own drinks. The pizza was ok and the sushi was great. The cheaper sushi was not that good but the specialty sushi was awesome. I believe it had more the do with the ingredients of the sushi and not the chefs. You get what you pay for so buy good sushi.The bad part is that the service was lame. It took forever for the waitress to bring us ice for the wine bottles. I hardly ever saw our waitress. We had a great time and everything went good."], ["Susannah H.", "Nice atmosphere. Not so good food.  crab dip fondue was fishy...call it drab dip. my chicken skewers were not cooked enough. terrible. Tasting all sorts of food around. Not impressed. Service slow. Waited 15 minutes for another glass of wine. Not to return."], ["Miriam S.", "The weekend at Ernie's roll is hands down my favorite sushi roll in Memphis, no contest.  The rest of the rolls do not disappoint and are always made expertly and presented beautifully.  Fresh ginger and quality wasabi are a nice complement that seem to be lacking in many Memphis sushi establishments.  The house ginger salad is another favorite.  Decent sake selection too.  They used to have THE best fish tacos I have ever had, but for some reason took them off the menu (despite lots of protests).  It is a shame that the exquisite attention to detail by the kitchen is not matched by the other side of the house.  The service is always predictably mediocre and quite slow (don't expect your water to be re-filled).  It often feels like the place is understaffed.  The atmosphere is trendy and upscale with a very clean feel.  Take advantage of the happy hour specials to make the experience more affordable."], ["Donna B.", "This place is special- best sushi in Memphis and cool atmosphere for out of town guests and special occasions! I wanna have a bada$$ party in one of the semi private areas. Great place for cocktails with the girls - the Memphis Rita - ay carumba! Go there. Love!!! Stevan will take good care of you and yours"], ["Mandy H.", "This place is hugely overrated and overpriced.  Their sushi is okay, but nothing to write home about.  Sadly, that's the only part of their menu even worth mentioning.  The ambiance of this place is what sells it.  It's hip, modern, cool...you'll find a lot of young Memphis here.  Their staff does their job, but, again, nothing to write home about...they do what they need to do and never go above and beyond.  And, as I said, the sushi is just meh.  Fun place to go though if you're looking for a certain atmosphere and clientele."], ["Walter E.", "Bluefin Memphis? I'm just not a fan. I've had REAL sushi from the masters in London and Vancouver. When you know what real sushi is supposed to taste like, you push the plate away when it's not top notch! For years, I thought sushi just made me sick, but then I realized that I hadn't really HAD SUSHI. When I did, I understood.  Just don't do it to yourself.  ---And let me TELL you about the bar...Oh boy, I saw the bartender open the gallon jar of olives, pour a MOUND of salt in the jar, fill it to the brim with water from the soda gun, RIGHT in front of me, shake it up (like he was really doing something), and put the bottle back in the fridge.  I'm a former bartender (in my previous lifetime), and I said, \"What are you doing?\"  He said, \"I'm 'reconstituting' the olives.  I'll do this like 5 times before I get another jar.\"  I was shocked.  He, in essence was 'making' new olive juice for the dirty martinis, but it was all a sham.  So, when customers order dirty martinis, they are getting gin or vodka, and salt water (NO OLIVE JUICE)...Yuck!!---And then...5 minutes later, a customer from the other side of the restaurant ordered gingo or sake.  I saw the bartender pour the sake out of the bottle into the sake porcelain jug.  And since the sake filled up maybe 50% of the jug, he used the soda gun again (you know, the soda gun from the olive reconstitution situation) to fill it all the way to the top with water.  That was such a horrible experience that I came for 2 for 1 happy hour sake, and I left after the 1st one.  I didn't even want the 2nd.  No thanks.  Never going there again."], ["John C.", "Went there prior to a concert to get some dinner. My buddy just wanted a burger, but the waiter told him they were sold out of the meat. Thinking to myself that would be because they did not order enough. Nope, they did not thaw enough out because they had a order foe 20 earlier. Hey Bluefin, how about fresh not frozen!"]]}