{"Jasmine Thai & Vegetarian Restaurant": [], "Thai Basil": [], "Sake": [], "Bhan Thai": [["Nick C.", "So happy we stumbled across Bhan Thai! I had the Spicy Old Man and it was great... The veggies were cooked perfectly; tender, but still full of life. Sauce was delicious and the eggplant was unreal! Our server was super friendly and helpful. Decor was nice and inviting. Sit in the bar for a more casual experience."], ["Kiki A.", "Not the best Thai I've had. I had the lemon grass soup with shrimp. It came out a clear broth I mistook for the clear broth with mushrooms that are sometimes served at Japanese restaurants. Lacked that spicy savory sweet punch from Tom yum(?) soup I've had other places.The entree I had was the spicy old man. It was good except could have been spicier and less rich with sauce. Atmosphere is nice but the food is just ok....we took a cab to get here from the hotel downtown. Worth meeting the awesome cab driver, Earnest, who advised us to be more cautious waking around Memphis...notWorth $38 for clear broth and stir fried and stewed veggies. Waiter and staff very nice."], ["Andrew L.", "Love the atmosphere of this beautiful Thai house! The employees are just wonderful, and don't miss out on meeting the owner molly what an awesome person, she always makes sure your experience is an excellent one!! Way to go bhan Thai, the restaurant is great, and you can't beat chef Alex's wonderful Thai food!! Gotta try it if you haven't already, and if you have...well the youuu knowwww!"], ["Lee C.", "After moving here from Atlanta a couple of years ago, I've been disappointed that I haven't been able to find a lot of good Thai restaurants in Memphis.  I've found more Vietnamese restaurants.  However, since I found Bhan Thai I love it.  Great food for take out or eating in.  It's situated in a house with a nice atmosphere.  I usually order pad thai but any of the curry dishes are great."], ["Gracie C.", "I generally judge Thai restaurants by their pad thai - it's really just 'okay' at this place. The curries are pretty good. But what keeps me coming back: the Chang Mai noodles. OH MY GOODNESS. So delicious. And love the outdoor seating at this place, I wish I could take this patio home."], ["Amanda G.", "They have awesome curry dishes! I like this restaurant---fine dining. I want to check out the patio some time soon."], ["Christine M.", "The ambience of Bhan Thai is great! Our waiters name was Zeuss and thanks to him, our dinner was phenomenal! My boyfriend had the Duck Curry, which was really good. I had the Eight Angels: it had Shrimp, Chicken, Beef, Pork, Shiitake mushrooms, baby corn, carrots, asparagus and brown sauce. I loved my meal! To drink, I had the Bhan Tini. My boyfriend had the Thai One On to drink, I preferred his drink over mine. It had puréed mango and lemon, I think. I really enjoyed our meal, if you come to Bhan Thai, ask for Zeuss!"], ["Shane S.", "It was surprisingly bland. I've eaten here multiple times and have been underwhelmed each visit. It was better the next day as leftovers. This place makes me miss Sawaddi. I'd much rather go to Jasmine Thai or drive to Thai basil in bartlett."], ["Natalia T.", "This place was really good! The veg egg rolls were delicious. The Chang Mai noodle is something holy, something above humanity. Also referred to as khao soi, this noodle dish is coveted, rare, and so good. My boyfriend just said \"I want to put my leftovers in a ziploc bag and sleep with it tonight.\" Come eat here"], ["Alan L.", "Came here for lunch.  Staff was friendly.  My waiter was knowledgable about the menu and made recommendations based on my requests.   I had the Thai spring roll for an appetizer.  It was really enough for two or three people and was tasty for sure... Fresh and crisp on the inside...  Well done!  I selected the \"Crazy Bowl\" with Beef.  When presented to the table... I have to admit I was pretty underwhelmed... I took a bite and my concerns were being validated..... Then after 1/4 way through the bowl, I finally mixed everything up... And all of a sudden, just like in chemistry class... That bowl just exploded in flavor and texture.  I was taken back by the crunchy nuts, smooth noodles, and the over all experience!  Great job!!"], ["Sara K.", "Expensive and honestly, extremely bland. I have no idea how this resturatnt could get everything right - location, atmosphere, menus and menu extensiveness but it was just missing that WOW flavor that all of us go to get at a thai restaurant. I got Tom Yum Soup (not spicy or sour enough and only 3 shrimp), panang curry (very watery with thin, hard, bitter chicken) with no zing and pad thai with almost no chicken. I was so disappointed. They even forgot to include hot sauce like most thai restaurant do. Maybe the area doesn't know what Thai is and they get away with a good review but not from me! I won't be returning! All of that cost $36 btw."], ["Eugene C.", "Great food but terrible service. It was really unfortunate since we had heard great things. We aren't sure what happened as we were only told there were large groups but we watched people sit down and eat and leave in the course of our two and half hour dinner. Put a damper on the whole evening but at least our server was kind enough to continue to check on us. By no means did we feel appreciated when we were told they had to take care of the large group instead of us. Disappointing."], ["Allie Y.", "I'm so glad we found this place, I only wish we had discovered it sooner!! We sat out on the patio and loved the atmosphere with the lights. The food was soo good, too. Can't wait to go back!"], ["Shawn L.", "This is a relaxing and trendy restaurant. The service was really good. The food is great. If you like spicy food this is your place. I don't eat a lot of spicy food myself. They have items on the menu that are not spicy. I would recommend this place to anyone."], ["Joelle P.", "Tonight was a great reminder that waiters can make or break a meal. Unfortunately, tonight that meant my meal was less than stellar because we got a bit of a sour puss...but I love Bhan Thai, so 4 stars it is. The restaurant is trendy, relaxing, and comfortable all wrapped into one. I have actually never had a bad waiter here so I was surprised tonight. Maybe he was just having an off night, but his less than enthusiastic attitude really put a damper on the evening. Then again, maybe I'm just spoiled because I've had rockin' waiters for the past couple of months. I recommend getting the appetizer sampler because everything on it was divine. And I can't get enough of the drunken seafood. Yummmmmm. Also noteworthy is the seafood soup. My mom devoured it in no time. The patio is simply gorgeous during the summer and I love the lights year round. Do yourself a favor, and check this place out!"], ["Brendan O.", "I've been going here for years, as the patio is excellent, and the service is usually decent.  This evening I noticed that the prices have gone up, so it'll now put you back 15.95 for the red curry (with tofu, which is super cheap).  There are other Thai options in town that are better value.  They're making you pay for the venue here.I asked for my dish spicy, and it wasn't spicy.   Even though they have symbols on the menu to indicate spicy dishes, it doesn't seem to translate to reality, as I've encountered the lack of spice issue before.The loud live music on the patio is not appropriate for the setting, or the price point of the food.  The music is fine and all, but the type of performers they chose would be more appropriate for a bar."], ["Meg D.", "Amazing food! Service was great. Definitely recommend the Iiiiiii know Cosmo and drunken seafood combo"], ["M R.", "Easily the biggest food disappointment I have had in Memphis, because I was so excited to eat here.Pad Thai, $16 as carry out, was so so bland and bare. It was essentially just noodles. No spice, scant amount of peanut, a couple thin slices of chicken. The worst part really was the lack of spice though. Cute interior with a fun looking patio and the staff was super sweet, but there's no way I could ever recommend a Thai place that can't do pad Thai."], ["Caroline V.", "I think that unfortunately, Bhan Thai has taken its lovely location and its position as the sole Thai restaurant in Midtown for granted and has just stopped caring.Based on my most recent experience, it seems to me that Bhan Thai is not a vegetarian-friendly restaurant, and that moreover, the staff of the restaurant does not take responsibility for ensuring that they have and communicate adequate information about the contents of their food to customers who choose not to eat meat.  It is disingenuous to offer curry dishes \"with tofu,\" implying that these are vegetarian dishes, when these dishes always include fish sauce, which is made from dead fish.  I have been assured by many servers on many separate occasions that my curry was being prepared \"vegetarian, no fish sauce\" - yet last night I was told that this is impossible.  If fish sauce is an ingredient in \"vegetarian\" dishes, then this should be clearly printed on the menu so that vegetarians do not eat those dishes, or patronize your establishment.  (And yes - it *is* possible to make Thai food without fish sauce, if you care to exert just a little bit of effort.  There are other restaurants in Memphis that do this).The manager(?) with whom I spoke claimed \"country boy ignorance\" (his actual words), which to me is completely unacceptable for anyone who works in food service, period.  Note to the staff: vegetarians don't eat meat.  Meat includes fish.  People who eat fish but no other meat are called pescatarians, and just because you know one doesn't mean that all people who do not eat meat will willingly eat fish.  YOUR sensibilities and choices do not dictate mine. Maybe you're a person who eats chicken a day or so past the sell-by date.  Does that mean that your customers should, too? Grow up, enter the twenty-first century, and act like you give two ships about your customer's preference.  I've eaten at Bhan Thai for YEARS (I remember when they opened), and gradually I've watched the prices go up ($14 for Thai fried rice?  Seriously?), and the quality go down, and the attitudes of the staff go from passable to apathetic at best (or downright snarky and obnoxious, such as the time when I called to place a takeout order on a busy night and they refused to take the order, stating, \"We're the most popular restaurant in town tonight, and if you want the food that much, you can come up here and wait for two hours like everyone else in the restaurant\").  I just kept giving this place the benefit of the doubt, but I'm done with that now.  So why two stars instead of one?  The patio is nice, if you can get a seat."], ["Lana M.", "The Salmon Panang is delicious.  Dine alfresco and have a relaxing experience while listening to great live music."], ["Stephen M.", "A pleasant surprise last Sunday night. We were from out of town and scared there were no decent places in the city to eat. But we were able to split an order of egg rolls, golden shrimp, and red curry beef with a glass of wine. All quite tasty in a quiet corner of the restaurant and reasonably priced. Only negatives were they were out of spring rolls and the service was a little sluggish."], ["Leigh F.", "I've been here at least 30 times and it's hit or miss. A few times this place has been outstanding! Many times it's been pretty good, most of the time is mediocre. For $15 the Pad Thai should be better. It's bland, dry and under seasoned. They've given me used limes before, it's absurd. Paying more doesn't always mean it's better. Bahn Thai can be disappointing or very delicious, it's up to you if you want to gamble with that."], ["Bill B.", "This is my second time there. I had the Lovely Ginger with tofu. It was so good. They let you decide on how hot you want it. I wanted to give the tofu a chance so I ordered not so hot. The veggies were cooked just right and the sauce was just right. The tofu was fried just right. When I saw the dish for the first time I thought there is no way I'm finishing this but to tell the truth I did. The staff was great, attentive but not overly so. The deck has TV and music. Inside is casual without the TV.I'm going back."], ["Ann-Marie T.", "This was my first time to ever try Thai food... I LOVED the food. I got to try multiple things since I was accompanied by a large group. I ordered the Pad Thai with chicken and it was delicious! I also tried Green Curry, Tiger Eye (by far the best), and Sweet and Sour Chicken. Everything was wonderful and the patio was beyond amazing! The drinks were also great... So where did it go wrong?The service was the worst I think I have ever had. We had a reservation for 7:30 and we sat at the bar waiting for our table until about 8:10. (The bartenders were great). So then we were FINALLY seated and wanted a bottle of wine. It took 30 minutes for her to take our drink order and even longer for us to ever receive it. Then we ordered our food and it took an hour to come. By this time it was past 10 and we were all starving!!! Finally the food came and it was great. I was just so disappointed in the wait and the service. Bhan Thai does have one of the best patios in Memphis! If it wasn't for the patio I probably would never give them another chance... Hopefully next time I will have a better experience!"], ["Kimberly Q.", "Best thai in memphis... The pad Thai is good I usually order spicy. Thai fried rice is very good and the appetizer sampler. I really like the Tom yum soup too."], ["Andy S.", "Bhan Thai is a good Thai restaurant in midtown Memphis. They have one of the best patios. The meals range between about $15 to $25. They have a full bar with some specialty cocktails. I had a Cigar Box Malbec. It was a nice red wine. Garrett had the Yum Tuna. It is a seared tuna that is spicy. It had a type of citrus salsa on top.  I tasted it and liked it.  Garrett loved it and has ordered it before. Both entrees came with steamed white rice. I had another one of the house specialties of garlic pork chops. They were cooked perfectly and served with grilled vegetables. The homemade sauce that accompanied my meal was my favorite. I would have liked to have had more of it. The only problem was that the food could have been hotter. It wasn't cold but it wasn't very heat hot. However, I like Bhan Thai and have been multiple times. I will definitely go back."], ["Amanda M.", "A certain gem of Midtown. The atmosphere is cozy and perfect for a date or a nice dinner out. The patio is soo verdant and inviting offering shade and ambiance. The portions are huge and the prices are quite reasonable. The beer selection is the only thing I might say is lacking, but there are plenty of drinks to choose from. It has been and continues to be one of my very favorite spots when I visit Memphis. I have had no problem with the service, but it's more or less no frills. Efficient but not overly friendly or accommodating. The price and atmosphere more than make up for it. :-)"], ["Vik K.", "As a weekly business traveler to Memphis downtown I have been restricted to downtown area restaurants due to long work hours. Last night some co-workers got together and decided to venture a bit further out and try Bahn Thai since it had a 4 star rating on yelp. The restaurant is in a residential neighborhood in an old house. The ambience was nice and restaurant was quite full on a Tuesday night around 8:30PM which was encouraging. There were 3 of us and we had the Tom yum soup for starters. The soup was very watery and fairly tasteless. Then we had the spinach delight with Tofu which was almost decent, the Green curry chicken was pretty much inedible and so was the Basil fried rice. There seemed to be no salt of seasoning in the food. We kept piling on the chilli paste to add some flavor. The service was below average, I had to summon the waiter from a distance to re-fill my water couple times.Bottom line, it seems like a decent spot if you don't care too much for the food. But the downtown thai restaurants have much better thai food than this place for sure"], ["Paul J.", "Best Thai food, service and patio in Memphis. Love the Spring Rolls (unique) and Pad Thai"], ["Valencia B.", "I recently ate here yesterday, 10/25. The did was OK however the service was beyond substandard.  Not to make this a racial issue but as an AA it was evident in the service we recieved.  First, upon arrival no one greeted us. As several other customers arrived they were given the option to go outside and wait at the bar as the bartender/host would get them when their seat was ready. I got offered nothing.   When we were given our seat, he simply pointed in the direction of our table.  No escort or anything.  As we were there, we only saw our server twice; once to bring out our food and to bring our check.  I most definetly left a note on the bill about my disappointment. Im hesitant to go back :( Heard a lot of good things about here but the way I was treated NOT!"], ["Amanda M.", "I can't believe I haven't written a review for this place until now. I LOVE Bhan Thai. The food is great, the atmosphere is nice, and the prices are reasonable. Plus, they give you a lot of food so I always get to have some delicious Pad Thai for lunch the next day too.They also have an upstairs room that's great for a big group."], ["Samantha B.", "I feel this place is more expensive that it is worth. I've been twice and wasn't really impressed. The food is just ok. I honestly like Bangkok Alley better. In fact, there's one close to this location."], ["kc a.", "Rarely thrilled but never disappointed."], ["Jennifer R.", "I just love this place. Every time I eat here I always get the same thing.  Yaya I know that is so boring.....but I just LOVE the pad thai noodles! I just can't get enough of them. I know I should branch out and try something new when I go next time but most likely I will end up getting the pad thai noodles again! And I just love the back patio! I feel like I am in a little forrest.  Summer times are the best for sitting outside on their patio with a nice cold drink in your hand!"], ["Larrie R.", "Seriously...not a better place in Memphis for Thai food.  (And I have been to Thailand!). So happy they are in my neighborhood of midtown!"], ["Kevin B.", "Went to Bhan Thai for a birthday dinner and I not only gave a gift but received one as well which was having the opportunity to eat here. I've often time drove past but never found the time to stop. The moment we arrived I was impressed with the timely seating of our group of 12 on the outside patio. After entering and walking through the inviting dinner area that made you feel as if you were peeking into to someone's private home, we made it to the outside area. Immediately hit with the music from a pretty good live band and the energy of people, friends and strangers interacting at the bar. We were tucked away in a lil corner to ourselves yet close enough to the action to feel totally involved. Our server came quickly and did a wonderful job despite me having the decide long than anyone of what I would have. I finally settled on broc and chicken because I love garlic and it was in a garlic soy sauce which I could have had in a glass it was sooo good. The chicken and broc was seasoned perfectly, the portion was spot on and the price was extremely good. We got to hear  live music, on an outside patio, eating great food with the awesome atmosphere they have created for a more than reasonable price. I would have expected to pay much more than what I did.. Also at one point the Chef came to our table and introduced himself to those he didn't already know and asked how was the food which is always a plus. Overall without a doubt you all should visit and frequent Bhan Thai.. We will definitely be back because I left trying to decide when to return....."], ["Abbey V.", "I should've taken the advice of previous yelp reviews, but instead, sadly went with the referral of friends. This is the neatest of locations, with such a cool patio, and seemingly very clean. The food however, was so sad, and ridiculously pricey. The Pad Thai was BLAND - no flavor whatsoever, and very little chicken. The drunkard's noodles was tasty, but the amount of excess oil was disgusting. Think of red oil pooling all over your plate and then continuing to drop off of your fork. Name the country, and I've had Thai food there - it's my favorite food on the planet, and I seek it wherever I go - this restaurant is poor. You're paying for a clean, neat place to have pseudo-Asian food. I'd take a franchise, like Pei Wei perhaps, any day over this."], ["Wayne R.", "This place is awesome.  The food is great.  The atmosphere is amazing.  They have an inside part and an outside part.  Their food is spicy, which I love.  Their portions are plentiful.  I love their Thai Tea; it is sweet as ice cream.  I ordered the red curry on both visits.  Don't skip this place, every dollar spent is worth it.  Bring your date here.  She will love you."], ["Liz G.", "Spent years in asia, so I've been a bit disappointed by the cuisine available in memphis.  Having said that, Bhan Thai makes a lovely NON-greasy pad thai.  Their other noodle dishes are delicious, but not as light and healthy as most \"real\" Thai noodle dishes are.The little ones love it too -- and they're pickier about their thai food than I am. We often pick up pad thai for take-out."], ["John H.", "Pretty darn good service!  Waiter and staff are happy and have great attitudes.  Good food too :) ...although not the best Thai we've had, it's probably the best in Memphis area.***They don't have chopsticks in the house so be prepared to shovel the food in ;) ..."]], "Mosa Asian Bistro": [["Melanie P.", "Ok so I'll admit I'm very picky and narrow minded when it comes to trying different food and from different cultures. I am beginning to want to explore more and step outside the box and yesterday after work I did. I got a recommendation alert from \"yelp\" as I was pulling off the bank lot. And oh boy my wheels began to spin after reading the reviews and scrolling through the pictures. I set my GPS and off I went.....I arrived and yum yum goodness followed."], ["Andrew B.", "The three seasoned shrimp on the new specials menu at Mosais so good! It comes with Chinese cabbage, brown or white rice and Asian slaw too. For $14 you can't beat good quality food prepared by Mr. Eddie.I've checked in over 30 times at this restaurant and I can't tell you enough how much I love this place. GO! You will not regret it."], ["Joelle P.", "Well, it seems I have found my new go-to spot!I have been meaning to try this place out for awhile now - it has been on my bookmark list forever! And last night, I finally made it there. When I walked in, the host immediately helped my grandmother and was incredibly friendly. I haven't had a greeting that nice at a restaurant in forever. It reminded me that we are in the south and chivalry isn't dead. Our waiter was a doll and so funny with great recommendations. Super glad he suggested the dumpling because those things were incredible - as was the sweet and sour chicken. My mother and grandmother also loved their salads. We didn't have room for dessert but I'm looking forward to trying it next time!The best part? Our tab was under $40 for the 3 of us and I even had wine."], ["Gina H.", "Visiting from Richmond. Pleasant surprise! We had the basil wraps.  The sauces were yummy.  General tso , shrimp was fresh light and sauce was great. Uncles noodles rocked. Med heat both"], ["Andrew C.", "A great place to dine in, sit on the patio, in the bar room, or to order food to go. There isn't a single item on the menu that isn't highly recommended. From the soups and apps to the homemade cupcakes you can't make a bad choice. The staff is friendly, knowledgeable, and will suggest their favorite item if you're simply undecided.Delicious fresh food at a reasonable price. If you haven't been to Mosa, you just might find a new favorite restaurant."], ["Steve I.", "I've been coming to this restaurant ever since they moved into the neighborhood.  I used to go to the location at Kirby as well.  I have never been let down by their service or quality.  Its a great value for the money.  You can also get take out!  Favorites include... Lettuce Wraps, Pot Stickers, Fried Rice, Pad Thai.... basically you can't go wrong."], ["Shay C.", "What an awesome place. I had the medium-spicy Chicken Pad Thai and it was delicious. Just the right amount of heat. I know that I will be returning. A little pricey for a fast casual type establishment, but definitely delicious. The fried potstickers were good."], ["Catherine T.", "Located in the same plaza as bed bath and beyond, it was easy to find parking on a Friday for dinner. Happy hour every weekend including Friday. Plenty of seating including a bar area with tv and outdoor seating. Ordered a thai tea and it was on point. Also had Singaporean noodle which was very good. The curry was flavorful and had lots of veggies so it went really well cooked with noodles. Definitely will be coming back."], ["Jack B.", "Family run operation. Met Mr. Eddie on our first visit. Went there again last night. Staff is friendly, service oriented and efficient. Food is well prepared, ingredients are fresh and food is prepared for you (no spring rolls sitting under a warmer). Served like a real restaurant in China, food is brought out when it is ready so it might come in waves. After having moved to a new neighborhood, this has become our go to Chinese food fix."], ["Lorne S.", "Great food, excellent service, perfect location... you can't ask for anything better!!"], ["Heather F.", "I love Mosa! Their food is just as good as P.F. Changs but cheaper! Their hot and sour soup is the best I've had and their lettuce wraps are soo good. The restaurant is casual and you order at the front and get a number. The restaurant was very clean and had a nice atmosphere. It's a great place for lunch."], ["Anthony T.", "This spot was recommend to me while visiting Memphis and you don't get the same old Asian food. It's really good and we had several different dishes. I will visit this spot while in Memphis and if I want some Asian food."], ["Natalie O.", "Mosa's is one of my favorite restaurants in Memphis. Every time I take out of town guests to try it, they are pleasantly surprised. Great food and service."], ["Jerry Y.", "While the food tasted great, but it did not stand out above some of the better Asian joints. However, the service and presentation is definitely better than most Asian restaurants."], ["Mike J.", "PD and I went one evening last week. WE enjoyed it very much. The food was really good. We had a lettuce wrap to start, and there was a generous supply of lettuce, perfectly shaped as if it was genetically modified for the task at hand. Big improvement over other places that don't give you enough lettuce or misshapen pieces. PD had a noodle dish and I had the Korean BBQ. we both remarked how good it was.The waitress was very friendly and helpful and she helped make the dining a good experience. My only so-so negative is the atmosphere. It could be made a little cozier or something."], ["Ben B.", "Hot and sour soup.....must I say more? (but I will)We usually order out here at Mosa, but have dined in a couple of times. The service has always been friendly and knowledgable so I can't complain. The food always seems fresh. That hot and sour soup though! I only order out soup with a side of wontons. I waited to long to give this place a try, don't make the same mistake."], ["Arpana W.", "I went to the Yelp elite event here last week and was really excited to make it back for a full meal. The samples we got at the event were great and the people were very professional.  Unfortunately, when I went back for dinner, it took an unusually long time to get our order.  We sat down, ordered, and watched two other couples sit down after us and get served and almost finished with their food before our meals were served.  I can't complain about the food, though, it was pretty good.  I definitely recommend giving this place a try.  I hope to go back and have a better experience next time!"], ["Shu J.", "This place was average. I thought the menu was rather limited. Service was good, but the food was not special, to be honest. Not the place for us, I'm afraid."], ["Trivedi A.", "Asian fusion restaurant. Nothing exceptional or mind blowing. They have regular menu. Food is good though with friendly service. Good number of options for vegetarians as well. It is worth trying once, if you have not. It won't hurt."], ["Wendy S.", "I've been frequenting this place when it was only one location open on Kirby Pkwy and Poplar. (Sad it's gone since it was so close to home.)  But will gladly pass right on by pfchangs, wangs, and whatever else to get to the White Station location for some very good and consistent Asian food. Consistency is key. The staff has always been chipper and friendly...be it when I do take out or dine in.  The first time I had the \"pad-thai with no peanuts, extra cilantro, tofu and medium-spiced, please\" has been the very same as the twenty-first time, thank you very much.  Oh and I like that they switch up their specials often and incorporate seasonal foods too."]], "The Emerald Thai Restaurant": [["Paul B.", "Ordered Guay Tiew to go and it was amazing.  Excellent flavor and wonderful fresh ingredients."], ["Michael H.", "This Thai place was just ok. Definitely not worth the price. I went to this place because it had a four star rating on Yelp but left disappointed."], ["Stuart J.", "The unassuming interior should not fool you; the food here is very good. The seasoning, based on my experiences, is spot on and the prices are very reasonable. We've done more takeout than eating in, but when we have eaten in we felt pretty comfortable and while the waitstaff were not hovering over us we were certainly not ignored."], ["Matt Q.", "Super good Thai food. I haven't had anything I didn't like from here. Friendly staff too."], ["Harry S.", "My wife has tried to get me to go here since it moved to Lakeland last year. Finally I've relented and in the past month we've went 3 times. The food is delicious, the atmosphere is cozy, and the owner & employees are very friendly. The Thai spring rolls are delicious and any of the pad thai dishes are excellent. But to really get a taste of authentic Thai, try the guy tiew. It's a soup with vermicelli noodles that is to die for. Makes me miss my mom's cooking, for sure.My only complaint is the bear selection is pretty sparse. Singha is usually available, and Chang (which is much better) is hardly ever in stock. This is by no means the restaurant's fault. But sometimes you want more than just a lemon water with your asian, if you know what I mean. Stop in and say 'Saw Wat Dee' get some good Thai cooking"], ["Jolynna M.", "A great little restaurant.  Go and go hungry.  But don't go if you're in a hurry.The prices are very reasonable and I really loved the food.  The service....well... not so much.  I went for lunch with family and even though there were just a couple of other occupied tables, it took forever for our food to come out.  I will say it was definitely worth the wait, but I was glad I didn't have anywhere I had to be.  The spring rolls were excellent and very fresh, and I simply LOVED the soup.  The prices were very reasonable too.  I plan to go back for dinner soon, and will take a bottle of wine with me.  They don't serve alcohol so it's BYOB,  I\"m all for that though since it's a great way to save a few bucks.  And at least I can sip on some nice vino while I settle in for the long wait.  Cheers!"], ["S S.", "I've tried the red curry, emerald curry, pepper steak, and spring rolls and all of it was really bad. The meat smelled like wet dog and curry had no flavor and way too much salt. The customer was bad. Our waitress looked confused every time we asked a question and snatched the too receipt soon as I was done and looked at how much I left her! I don't know how they have 4 stars."], ["Mike D.", "The food is delicious. I got the Steamed Dumplings and the Pad Prik with chicken. Both were very good and appropriately spicy. Note if you order something hot here, it will be hot.The one thing that keeps them from a 5 star review is the speed of service. I understand waiting for good food, but we had to wait 15 minutes to order our food. I watched one couple next to us give up and walk out. We were nearly at that point ourselves when she took our order.Overall I'd recommend them for good Thai good. Just wish they would have some more staff to help customers more efficiently."], ["Brent E.", "I am kinda of a Thai food snob. I eat at a lot of Thai restaurants and cook it all of the time at home.  I came here because it was close to my hotel. The garden rolls were good. The Tom Yum not so much. It had too much of a tomato taste and the mushrooms were not cooked. Then my red curry was grainy and the flavor was off.  Meh."], ["Alycia B.", "Best. Thai. Ever.I was in town just for the weekend and I'm so happy this was one of the places I visited. I want to go back even though its 9 hours from where I live just for this place! I had the Kao Soi Noodle and it was perfection!!! Large portion, just the right amount of flavor and spice, came with gret crispy noodles. It is definitely one of the best Thai places I've ever been.  Love Love Love Love Love"], ["Trivedi A.", "It is still the BEST restaurant for Thai food. The change in location has not changed anything except the menu card design, restaurant size and the distance. You can try anything from menu. Almost everything tastes wonderful. My favorites:1.) papaya pog pog (salad): Ask them to make it thai hot with fish sauce. It is awesomely hot and you will need thai tea to get rid of that heat. But it feels great to eat that. You can get it with medium hot or mild (but this is not as fun as Thai hot)2.) Tofu Pad prik3.) Chicken satay4.) Kao pun noodles5.) Kao Soi6.) Sticky rice with mango (dessert)7.)Pineapple fired riceYou MUST go here to eat VERY GOOD Thai food."], ["Srishti S.", "I had heard some amazing reviews about this place. So we decided to drive 20 miles for dinner. We were a group of five and everyone wanted to eat just vegetarian food that day( one of those rare occasions ). We tarted with veg Thai spring rolls an veg wontons. They were vey good. The wontons were like indian peas corn and cheese samosas. The plum sauce and chili paste were good too. I ordered the Thai ice tea which was very refreshing. Loved it. Them we ordered some vegetarian Tom Kha soup. It was hands down the show stealer, just so awesome. A friend of mine who once ate some amazing Thai food in California said the Tom Kha soup at Emerald was as good or even better. We all just loved it.Then we ordered one massaman curry and one spicy vegetarian fried rice. Both the dishes were very tasty. We gulped everything down. I was really keen on trying the papaya salad. That was the only thig that we were not a fan of. I had high hopes from the salad given all the amazing reviews. But overall it was an amazing experience. My husband says we will be back within a week or two to try their green curry. I would love to try their chicken satay and some appetizer with chicken patties. Our waitress told us that those two appetizers were pretty popular.I just can't wait to go back to Emerald Thai. I love going to family run places. They usually have pretty authentic food :)"], ["Deen W.", "The food gods were smiling upon me when Emerald Thai opened up near my house!!  I saw this past Friday that the long anticipated (at least by me) reopening of Emerald Thai had come to fruition. I felt a twinge of regret that I was on my way out of town, but resolved that Monday, by goodness, I would feast.And feast we did. We got an order of steamed dumplings and two lunch specials - Thai fried rice and Chicken Pad Prik (spicy red curry with onions and peppers). Lunch specials are all $7.50, served with steamed rice and come with your choice of soup (Tom Yum or Tom Kha) or fried spring roll. I got the Tom Kha, my daughter got the spring roll.Everything was just as tasty as I remembered them to be! As one would expect, inside is spartan, but very clean. Service was great and everyone was very friendly. If you'd like a glass of wine with your meal, bring your own - just a $5 service charge. Now, if you'll excuse me, I feel a nap coming on!"], ["Dan Z.", "This was a nice change of pace!  We stopped in at 7:00 pm and the place was full - always a good sign!  We ordered the dumplings, which had great flavor. The dumplings are not traditional dumplings, but rather stuffed wanton pockets.  I order one of the thick noodle dishes with chicken, which was fantastic - all kinds of flavor oozing out of it!  My wife ordered one of the chicken curry dishes and it was good to!  We also ordered the fried rice which was a little spicey!  The whole reason we went was because of the reviews, and they were spot on!"], ["April V.", "Very good! I'm a harsh judge since our last duty station was Hawaii and they gave authentic stuff, but I was impressed and will go again. Pad Thai is yummy"], ["Chris C.", "I've been here twice now. It's always incredible. If I had a complaint it'd be that the spicy curry dishes aren't available on their lunchtime special menu. But no worries, you can always order off the dinner menu even during lunch. Consistently some of the best Thai food in Memphis."], ["Lora F.", "Fantastic food and service!  We stopped in while traveling and all shared our dishes and many couldn't decide which was the best. Highly recommend this restaurant!  We wish they were closer to home."], ["Sara S.", "We came in one weekend when they first opened at the new location in Cordova, we ordered the Pad thai and the Pad Khing, amazing!  We came back the next weekend and got Panang curry and Pad Kaprao.  We were so happy with the food, service, and cost.  Wonderful experience, we will come back soon!"], ["Ethan B.", "Only in for lunch late last week but for the quality, authenticity, and price of my Pad Prik and the Tom Yum Hed this place can't be beat. My friends had the thai fried rice and a beef with ginger dish- everyone raved about it.  Being new to the area myself, this place is a welcome addition and a far better deal than the highly touted Bhan Thai in Midtown.  Of course you lose the decor and ambiance but for homestyle Thai dishes, you can't beat 'em."], ["Emily B.", "My husband can't have enough of their phad thai. I tried to order different stuff each time. They haven't failed me so far! The place is a lot smaller than where they used to be. Very busy when we arrived. The staff is very accomendating and friendly. Definitely a good eat!"]], "SAKE": [], "Bangkok Alley": [["Christan H.", "I love love love the location on Brookhaven Circle so I figured I'd try this one since it's closer to my house. The food did not disappoint. It was great. The service was a little on the slow side but the server was very friendly. I got the roast duck which is so flavorful and delicious. You have to try it!"], ["Jorge C.", "Loved the atmosphere, very relaxing and food is awesome. I got the grouper, scallops, and shrimp with fried rice.  Owener and staff are extremely polite and place is very clean.  Perfect Health score 100!"], ["Shonna W.", "Love their Pad Thai and appetizer sampler.  Fresh and tasty!  Can't wait to try more there."], ["Justin L.", "The food is way overpriced and as far as quality---disappointing.  We had the chicken larb (normally made with beef).  It was watery and not at all in-line with what we have eaten before.    The pad Thai----both the wife and I had the beef pad Thai.....they asked us how we wanted our meat cooked (never been asked that before).    The pad Thai was dry and under-seasoned.  The beef----they put a small sirloin sliced on the bias on top of our noodles instead of sautéing it with the other ingredients.  They also put the peanuts on the side instead of cooking them with the dish allowing the natural oils to come out.  I understand there are those with peanut allergies----don't order this dish then.  We will not be back...."], ["Brian M.", "I am a world traveler and Thai food is one of my favorites. I rely heavily on the curries and beef salads to judge a Thai restaurant. That being said, both their panang curry and namtok beef salad are outstanding. They can make them both to your standard of spice and can really bring the heat if asked for. We have always had great service as well. The ambiance is perfect for a date, and the price is far less than you would pay at a nice place equal to the caliber of this one.  I highly recommend this place. It's one of the best Thai restaurants in the country.  They also have sushi, which I have not yet tried."], ["Todd M.", "It always seems Bangkok Alley gets a bit of the 'meh' in the ratings.  It is just not deserved!  The Memphis area is just not resplendent with Thai restaurants.  While Bangkok Alley may not rank with the best around the nation, for a local chain, it does fine.  The Pad Thai is perfect and will light you up (both now and later) if you are not careful on the spice rating.  And be careful... You will be asked for a 1 to 10 rating on spice, but depending on who is in the kitchen, your 5 could become a 10, and 10 could become lave from hell.  Spice rating can be inconsistant to say the least.I will 'ding' the alley on service, but really, good service is getting hard to come by in most mid tier restaurants.  Bangkok Alley is no different from most in the area on the service aspect.The Collierville location does have a great bar and atmosphere - the Piano player is a good add if there.Here is the hidden gem - the Bomb sushi roll - don't miss that one.  If you are looking for a nice cheap night out - with an easy eye to the alcohol - you can be out on Date Night for under $30.  Of course, I am seldom easy on the alcohol..."], ["Brett P.", "Wow was that awesome!! Had the Pad Thai, Satay chicken and curry. Just found my favorite restaurant in Collierville. The flavors were outstanding!!"], ["Bryan M.", "Average Thai, what I would expect in Memphis."], ["Heath G.", "Good service and the curry is good. They will let you get the curry on a spicy scale of 1-10 and all ingredients are very fresh. They also have a very good sushi menu and the chef makes very flavorful rolls,  that look like art."], ["Chloe S.", "I love this place!! They have the best massaman curry and because I'm a vegetarian adding tofu just adds to the dishes epicness. The staff is very friendly and if you're new to Thai food they are super helpful in helping you pick out something delicious."], ["Amita H.", "There ain't many thai food options in Memphis and this one is the better of the lot. Good panang curry. Portion sizes are decent."], ["A L.", "Consistently great food and Service, tried most items on menu rarely disappointed..."], ["Courtney W.", "You can't go wrong! Pad see ew (sp) awesome!  Lots of flavor!"], ["Claire K.", "My family and I got takeout from here.  The food was good, but for the price, the portions were very skimpy.  I ordered Massaman with chicken and it was delicious, but there wasn't a lot of chicken.  Also, the are known to get parts of your takeout order wrong.  I made sure to check before leaving the restaurant and there was a missing order of spring rolls.All in all, it is good Thai food.  I would eat here again."], ["Jolynna M.", "I disagree with some of the reviewers below. I've been to several of the Bangkok Alley locations around town, and they are all very comparable on service. I have never had to wait long for my dinner and it's always been presented to me by an attentive waiter. I really enjoy the food here as well. It's not the best of the best in Memphis, in my opinion, but it's very good. I especially love their Pad Thai and Green Curry. The Collierville location has a pianist on some nights which is very nice and relaxing and the patio is nice as well."], ["Gary P.", "One word sums up this restaurant - \"BLAND.\" Thai food is supposed to have bright crisp flavors, the food here had none of this. The Potstickers (not really a Thai dish) are supposed to be steamed & then browned on the bottom of the dumpling. These were dropped in hot grease and deep fried. The Chef's fried rice with beef was boring. The Pad See Yeu had very little broccoli and no ground peanut. This was a real disappointment as this restaurant is close to our home."], ["Cris W.", "Food was good, but I wouldn't say \"great\". Small portions. Very pricey. For the cost, you'd expect more ambience and less nose rings/ear grommets."], ["Karlee K.", "What thai restaurant messes up Pad Thai?  Mediocre at best.  That is all."], ["Dewi S.", "A regular thai food, taste good. But the calamari appetizer that i ordered didnt taste like a real one,, make a reservation before u came, it was packed when i got there, and its not a large venue.."], ["Jill K.", "If I could give it a 2.5, I would.  3 seems generous, but 2 seems cruel.My Quest for Thai has brought me to Collierville, TN, just outside of Memphis.  Their website looked promising, as did the other review on Yelp, so I figured I'd try it.  Followed my typical \"order a million small things\" philosophy, I went with my old standards.The verdict:  A resounding \"meh.\"Sum Tom:  Meh.  Impressive that they serve it here, but the papaya isn't very crunchy, and it just doesn't have the depth of flavor I seek.  It's spicy and a little salty, and not much else.  Tom ka gai: Meh.  I was pleased not to find many mushrooms, but I imagine the reason most folks get this soup is for the fungus.  The soup base is decent, but there's nothing else in it to inspire me.  No veggies, no galangal; just a few pieces of chicken.  Meh.Larb chicken:  Less than meh.  Lovely presentation, but no flavor whatsoever... almost like they forgot to toss it in the dressing or something.  There were mint leaves in there, but they didn't taste minty at all, even when I ate them solo... not sure what that's all about.  If I licked the bottom of the take-out dish, I could taste the lime/chili goodness, but I'm not gonna work that hard, sorry.Fresh basil rolls with shrimp:  I asked for them without shrimp, and they said \"No problem!\" but alas, they came with shrimp.  After I deconstructed the rolls, I was saddened to find a few pieces of questionable basil in there... black spots, not very fresh (or flavorful, even).Chicken Pad Thai:  The only genuinely tasty thing I've had.   Can't really screw it up, though.Sticky rice with coconut cream:  Delicious by default, but again, it didn't move me.  Whatevah.Go to Jaja's instead."]], "China Dragon": [["Eric C.", "Great Thai food! Authentic Thai food with the added extra of having a Chinese menu too. Healthy options & friendly service. This used to be Chao Praya in Hickory Hill and the owners moved the restaurant here.I always go here when shopping nearby at Costco."], ["Brent D.", "They have a new location on Ridgeway."], ["Tom R.", "They failed their health inspection recently for the second time and were shut down for the day. They have scored below a 60% both times. Infested with roaches and other bugs and unsanitary conditions."], ["Ray L.", "Chao Praya, which used to be located at 3588 Ridgeway Road, is now located at 7960 Winchester Rd, where the China Dragon was previously located, next to the Wine Cellar.  The sign above the door says Thai China Dragon but it has the same owner and the same chef as the previous location on Ridgeway.  The menu has changed slightly but many menu items are the same.  My wife had the Chef Kra Pow, a favorite of hers from the previous location.  I tried the Tilapia Green Curry, which I believed replaced the Salmon Green Curry on the old menu.  We were both delighted with our meals.  I always thought that the biggest downside to Chao Praya was the Ridgeway location, which is almost across the street from the Hickory Ridge Mall.  Because the location wasn't convenient to where I live, I used to just order take out and pick it up on my way home from work.  Now that it is located just off Hacks Cross, I expect to dine-in more frequently instead.  I've eaten at several Thai restaurants in Memphis but I always thought that Chao Praya was by far the best."], ["Sam S.", "The food here wasn't what I'd call bad - more like extremely unimpressive. It was good but not that good, the prices were affordable for anyone on a lunch break from work. The service was polite if somewhat uninterested. One of the pluses was that the place was quiet, even if it looked a bit run down. I'd come back, but it's not a great first choice."]]}