{"Desert Jade": [["Crystal T.", "I enjoy coming for lunch, although I no longer work around the area, I still commute across Phoenix to eat here once in a while when the craving hits. I have never been here for dinner but the prices look steep for Chinese food. They have the best tangerine chicken and that's the only thing I have ever ordered. The have cut back on portions over time but there's still enough to get full but not enough for leftovers for dinner like before. You also get a free pot of hot tea with your order. My only complaint is the waitress. There seems to be only 2, a guy and a lady. The guy is always nice and attentive but unfortunately we always seem to get the lady. She is not too friendly so we always just brushed it off as a cultural thing but the last time we were there she didn't even take our drink order. I guess we were fine with that since we ended up drinking water but the whole situation was just awkward since it has never happened to us before. We just feel as if she wants us out as soon as possible. They also box your leftovers for you which I also find awkward but I can live with that. Yes, this place does look like a retirement center at lunch time and I took a picture to provoke it. (There were tons more seniors next to and behind us) We are always the youngest couple and can actually feel our youth being sucked out of us. This does not take away the fact they have delicious orange chicken and will continue to sacrifice my youth once in a while for its yummy crunchiness. P. s. I don't know if kids are allowed there, I have never seen them in there and they don't have a kids menu"], ["Andru R.", "Great old school Chinese place. The food and service is both outstanding. Try the Moo Shoo Pork and the orange chicken!"], ["Jennifer O.", "They're back! I have been a few times in the last few months and must say that Desert Jade is back to 5 stars in terms of food quality. The pan fried noodles are perfectly crispy and delicious. The sizzling rice soup (my new fave item) is flavorful and the veggies in it taste fresh. They still have the husband's favorite sweet and sour chicken (made with chicken that is fried and then sliced... that makes all the difference). The service is still great, in fact, we have been coming to Desert Jade for almost 10 years now and many of the staff members are the same, which is very cool. On top of that, they remember you, have personal conversations with you, and remember your order. You really can't beat the service. Additionally, the food never takes more than 15 minutes to come out. Other notable dishes are the pot stickers (made in house, not my fave in town, but a good solid effort), the spicy red sauce (yummm), and the lettuce wraps. Definitely check them out!PS They still provide hot tea to the table, a nice touch, but they stopped the almond cookies.... this is sort of heartbreaking... bring back the almond cookies pleeease!!!"], ["Jason B.", "lettuce wraps! their version is so on point that PF Chang's has nothing on them. the filling, the lettuce, and the sauce is so on point! It's so good that I can just feast on the 8-9 wraps served on the platter and not even bother ordering anything else. Oh and their hot tea is super flavorful. bravo Desert Jade for keeping it good! :)"], ["Mark H.", "My wife and I love the Desert Jade. The food is delicious and the service was good. We have taken friends there and have never been disappointed. There are at least 10 Chinese restaurants with in 2 miles of them, and none compare!  I would have given 5 stars but one dining room seemed a little loud. They may try some carpeting in there. Other than that, it is the best Chinese around."], ["Josh W.", "My first thought: This is expensive for American - Chinese food. My second thought: Who cares? Like many of the people on Yelp I am picky about pricing. This place, as noted, is a two dollar sign, but it is exactly that distinction that sets it apart from other restaurants like this. Like Mexican restaurants in the area, there are roughly four thousand places you could get American Chinese cuisine. They range in price and this is probably the high end as far as this type of cuisine goes, but the tangerine chicken will make you forget about the eleven bucks that it costs. This place was a nice reminder that spending an extra four bucks for your meal is usually worth it, especially when you are going to take to the Internet to tell others about it. Also the egg rolls was mad crispy."], ["Fernando M.", "Good food, great price! Good customer service."], ["Daniel S.", "This might just be my new favorite Chinese restaurant. From the pot of tea to the fortune cookies, everything was spot-on. It's a lovely restaurant with great decor and atmosphere (you can hardly tell you're on Indian School). The service was great; the waiters are friendly (they were happy to chat with patrons and make suggestions) and I have to say it: they speak English better than most places. Most important the food was just what you like about Chinese without the little faults it usually has. All the meat and vegetables were fresh and whole without being overlooked or drowned in sauce.  Tangerine chicken, for instance, is usually little balls of dark meat heavily breaded and soggy with sugary sauce. Here, it's nice cuts of breast lightly coated in a still-crispy shell with just enough of a very flavorful sauce that can be adjusted to your taste. Vegetables were crisp, tea was hot, and dinner was great. I highly recommend this place."], ["Jon S.", "I searched here for best Hot & Sour soup in Phoenix today because I am sick with flu. Was not disappointed!!! The soup is the best i've ever had... Big chunks of shrimp, mushrooms, and just the right amount of spicy. I imagine it's good when you're well, but if you're not... Get here for a delicious bowl of sweet relief"], ["David S.", "Food here is pretty good, definitely one of the best in this area of town. Never disappointed."], ["Diane H.", "We had take-out and loved the food!  We'd go again the next time we're in Phoenix!"], ["Ree S.", "Mushy pork, shrimp fried rice, sizzling rice soup all fresh hot and very good.  I was assured no msg in food.  Service very nice. Highly recommend."], ["Robin K.", "The food is great and the service is even better. The waitress accommodated my seafood allergy by checking with the chef before placing our order."], ["Lauren J.", "If you're craving Chinese (or good food for that matter), check out Desert Jade. I came here on my lunch hour. Service was attentive and food came out really fast. The crowd starting really coming in at noon so I just missed it by coming in a little after 11AM. I ordered the lunch portion of the chicken broccoli, which also came with a scoop or rice and an egg roll. Hot tea is also available at each table. I really enjoyed the food and my experience. I will be back!"], ["Shayna G.", "I have been in Arizona for 6 years now and have not been happy with any Chinese food that I have tried until last night. My boyfriend and I went for dinner and it was AMAZING! The food was great and the service was amazing. Everyone was very helpful and made the evening a good experience with good food. I would recommend the beef and broccoli."], ["B M.", "I order take out every time,. Always polite and order is to my liking. I love some Pepper Steak and theirs remind me of the one from a favorite of mine from Chicago restaurant.  I definitely recommend this place for good Chinese."], ["Tori W.", "It was the worst Chinese food I have ever had. I had the spicy beef with vegetables and my son had the Singapore noodles. My sauce was missing flavor as equally my veggies and beef were bland. Hospital food is better. The rice was cooked with too much water so it was mushy, so when I told the server he said he would get rice from a different pot. That means they have two types of rice and they serve the lowest quality first. The second bowl he brought was medium grade long grain rice. Don't eat here!"], ["Haley D.", "Best Chinese food in AZ!  Great atmosphere, wonderful staff, & delicious food! The mandarin style bean curd is my favorite!"], ["Ruben M.", "I am always up to try new Chinese places but most of times I have been disappointed.  My friend invited me to lunch and said this place was one of the best and despite the 118 Degree weather outside, this place was great.  We ordered fried wontons which were cooked to perfection, the crispiness of the chips was like nothing I had before.  The sauces and ingredients were above par too.  I ordered my usual sesame chicken and was blown away by  such a great dish.  The fried rice was not as impressive and might have just kept the visit from being perfect.  Definitely looking forward to their takeout soon!"], ["Kate B.", "I love this place! Great Hot & Sour soup, excellent fried wontons and the staff is so nice. My boyfriend and I get take out from here all the time and the front lady is always very welcoming."], ["D H.", "Who in the world and for what reason would any give this place less than 5 stars? We stopped here unplanned to pick up something to go for later. The woman at the front who took our order was so so polite. And I dont just mean polite, I mean GENUINELY polite. She explained how some items we ordered were made a bit different than other places, and brought a piece of the (orange) chicken out to taste. Id say 8 minutes later, barely enough time for me to catch up on Facebook, our food was ready to go. Nicely packaged to take out. She showed me how to eat the lettuce wraps since it was all packaged separately (I knew how but it was still nice of her). So...the food. BEST EGG DROP SOUP AWARD. EVER. Seriously. This may seem minor but I am a soup lover. and chicken lettuce wraps...amazing. The rest of the food we ordered between the 2 of us was all great. I foresee a problem here. This will turn into a weekly visit"], ["Colt L.", "My mom got a suggestion from one of her friends to come and eat at this place. We were feeling in a Chinese kind of mood, so we thought: what the heck?I've never been to this place before, but I've passed it several times. I was excited to try something new and review another place.As soon as we pulled into the parking lot, I noticed that there were a lot of people parked out front. I took that as a good sign.We walked in to the restaurant and I was surprised at how nice it looked inside! I've been to several Chinese restaurants where inside has pink wall paper, and an assortment of Chinese-type figures all over, and out-dated look, with a huge fish tank in the \"wait-to-be-seated\" area. No, this one was pretty snazzy! Another plus. We sit down and our waitress was very nice. She was very cordial, not too chatty. We ordered the honey dipped barbeque chicken and the cream cheese wontons for the appetizer. The chicken thing was good, but there was hardly any cream cheese in the wonton. It was almost just fried dough. We ordered our entrees. Sweet and sour pork, chicken and another chicken plate. I thought that it would have come with rice (the menu said it did) but only the plate of egg rice came out (which we ordered). The price was reasonable. Not too expensive. It was very filling too. The place was okay. It was better than a lot of other Chinese food places out there, but at the same time it was kind of the same. You know? Anyway, I wouldn't rush back to this place. But I would tell others that it's got \"OK\" Chinese food."], ["Nancy C.", "My spicy tofu and vegetable dish was very bland and I trashed most of it because it was a to go order (to eat at home). I had even asked for it to be a 7.5 out of 10 for the hot/spicy level and it wasn't spicy at all. I think my friend got a shrimp dish with fried rice and she thought it was all awful and she  trashed hers too. It was a total waste of our money and when I called the restaurant they said I had to bring it all back to get any kind of a credit. I wasn't about to dig through the trash. Needless to say, they've lost my business forever."], ["Kitty K.", "Was a little leery about trying Desert Jade for dinner last night. The building on the outside looks old and the half lit sign was not inspiring confidence, but I have been craving Chinese and my hubby and I always go past it it and stare curiously.Lets be clear here, this is NOT an authentic, or anywhere close Chinese restaurant. This is a good old fashioned American Chinese joint, keeping that in mind we tried the Sweet and Sour Pork, Singapore Rice Noodles and Sauteed Shrimp.The food came out FAST, I mean in 10 minutes after ordering we had our first dish on the table. It was hot and fresh, no rewarmed in the microwave junk. The pork was lovely, big chunks of tender battered pork in that great artificial red sauce which was tangy with just the right amount of sweet. The pork was accompanied by nice sized chunks of pineapple and green peppers that still had some crunch, not cooked to oblivion.The Singapore Rice Noodles came in a huge portion, probably enough to feed 4 people. Perfectly done thin rice noodles with lots of shrimp and pork tossed together with a wonderful curry sauce. Not at all greasy or over sauced. We took more than half of the dish home for delicious leftovers.The shrimp dish consisted of a good sized plate of very lightly battered shrimp sauteed with chili peppers and large cut green onions. It looks deceivingly simple but has wonderful flavor much light salt and pepper shrimp but with much less mess as they don't need to be peeled. The server asked us how hot we wanted the dish so we went with a 5/10, we ended up with a nice blend of flavor and heat that was a gentle medium for us. The service was fast and friendly, the restaurant itself is very clean, it looks like it recently got a new coat of paint. Overall for the price the food is quite a good deal.Oh yes in response to another Yelpers review in where he noted all the elderly in the restaurant and wondered if there was a retirement home in the area. Yes there are like 3 of them in very close proximity!"], ["Charles G.", "I went to Desert Jade for dinner after a day of baseball.  I have to be gluten free so that generally means that Chinese food is out for me (most soy sauce has wheat as the second ingredient listed).  Desert Jade made almost all of its dishes with gluten free soy sauce so I was able to order a wide variety.  It was really good food and excellent service.  The hot sour soup was some of the best I have ever had,and I have had it all over the country.  The sizzling rice shrimp was also superior.  I will definitely be adding this to my list of restaurants that I must visit on my next trip to Phoenix."], ["Synia M.", "always super fresh and fast... and gluten free!   great neighborhood find.  yay!!"], ["Corey M.", "Family of 4 dinning. Food is really good. The crab puffs are really weak, though. Other than that the couple of times we have been here the food is always good."], ["Mark B.", "This place is fantastic. Desert Jade Chow mein with pan fried noodles is my fav. Excellent service as well. Can't find many places like this out here."], ["Maria B.", "This is a hidden jem that is not to be missed.We were greeted quickly and with a smile when we walked through the door from a young lady in the bar.  Another lady greeted us and took us to our table.  A gentleman brought us hot tea and cold water to our table right away, and then we were greeted by our waitress Rose.  Good team work going on at this place.  I have never been to a nice Chinese place before.  This was a really nice one and I was super excited to see how the food would taste.  While enjoying my hot tea (BEST TEA EVER!  it was PERFECT), I glanced over the menu.  The prices are very decent and they have many different dishes to choose from.  We started with an order of fried wantons.  These were light, airy, slightly crispy, delicate and filled with a little bit of cream cheese.  They came with sweet and sour sauce, which was the best sweet and sour sauce I've ever had.  Nice bright red orange color, sweet and tangy and not thick or to thin, just right.  Very good start to a grand meal that I had no idea was about to come.Rose moved our fried wantons' plate out of the way and put two large plates in front of us.  She then started bringing out our food.  We had sweet and sour pork, pan fried noodles, fried rice, and sesame chicken.  Sesame chicken was at least two large oh so TENDER chicken breasts crisped to perfection in thick dark onion sauce that I soaked my rice and noodles in.  Pan fried noodles were lightly oiled and tasted like they were fried in a wok, very tasty.  The fried rice was fresh, soft and fluffy.  The sweet and sour pork was smothered (NOT soggy) in their yummy sweet and sour sauce.  It included large chunks of pineapples, green bell peppers and onions.Every portion was enough for two to three people to share or even save for the next day (see photos), BUT it is going to be so hard from stopping yourself enjoying your hot fresh food in such a romantic dark setting (music overhead was a love song station).  We had so much to pack up, Rose came by and put it all up for us in boxes.  She was awesome, very sweet, and always came by to check on us to see how we were doing.  For everything we got -not- including tip was ONLY $34.  Forget the buffets, this is the place to go.I highly recommend this place for large groups, couples, events, and anyone else who loves Chinese Food.  It's the BEST I EVER HAD!"], ["Eliza G.", "Desert Jade has become the only Chinese food we'll order! I have never dined in, only gotten take out, but they are extremely pleasant when you go in to pick up the food and the restaurant seems nice inside. Food is consistently delicious, fresh, with quality ingredients.  We've gotten past the no-delivery, but major downside is not being open on Sunday (our usual takeout night)! We broke down and tried our old place last Sunday and it was nowhere near as good... Until they change hours, we'll be forgoing Chinese Sundays! Desert Jade is the best!!"], ["Amber P.", "Over all, I will not be going back. The best apart of the whole dinner was that the entire staff was very kind, and friendly. But NOTHING else would bring me back. The prices are too high, since the food was NOT good. If the prices were lower, I would consider the old \"Well you get what you pay for!\" saying, but I paid $6 for a small bowl of egg drop soup, and it was very watered down and needed seasoning. Then I paid $11 for some chicken chow mien, it was ok, but the chicken was either old, or stringy (or something, it wasn't very good). The restraunt itself was clean, but freezing. I think they had the ac on.... but since the evenings lately have been in the 30's* everyone was already cold. I looked around and everyone was eating with there jackets, sweaters and hats still on. I was wearing my sweater & scarf! My waiter was a very nice guy, but over all, the food was sub par, and over priced, while the dinning room was uncomfortably cold.I could go on but I hate that my review is this negative already, since I think they really are good people."], ["Karen F.", "Seriously, where's the flavor?  I went there for the first time yesterday and, based on previous review,s I was expecting something wonderful.  NOT!  First, I ordered wor wonton soup.  I had to add so much salt to get any flavor out of the broth.  Yes, there were plenty of vegetables and shrimp, but nothing had any flavor.  The \"wontons\" were more like gnocchi.  Then came my chicken chow mein.  More bean sprouts than chicken and, again, needed so much salt.  UGH!  Needless to say I'll continue my search throughout the Valley for excellent Chinese food."], ["Meredith B.", "The best Chinese in town !!! I have been going here since I can remember. The food always tastes the same and friendly staff. They have the best Sizzling Rice Soup and Sesame Chicken!"], ["Monica L.", "Great!  Our favorite Chinese restaurant in Phoenix.  Staff is extremely courteous.  Try the jade chow mien and salt and pepper pork."], ["Joanne P.", "Loved the atmosphere.  Favorite thing lightly battered asparagus, but everything was delicious.  Very friendly staff.  Will return again and again."], ["Joel R.", "I read the awesome reviews on this site, therefore my expectations were high. After all, Phoenix is plagued with AWFUL Chinese restaurants. Our entire dinner was bland. The sauce that accompanied the Fried Wontons was insipid and flavorless. Red, thick sauce should be sweet. This was not. Unimpressed. The pot stickers were ok, but nothing special enough to write home about.I was leery about ordering the Tangerine Beef, because I had a rancid dish of the same name from a different Chinese restaurant a couple years ago. Thought I'd give it a go. Bland. Beef pounded into oblivion smothered with a sauce so faint that it cried for flavor. The Sesame Chicken, bland as well, was overcooked and nowhere near as sweet as one should like.The Kung Pao Chicken was the least amusing dish of all. No flavor, no heat, and no veggies. The Mu Shu Pork was ok, but the plum sauce was, again, bland!Now, the cleanliness and presentation of the restaurant was in face phenomenal. Very clean and the lit candles on the tables were a very nice touch.The service was legendary. Very chipper, friendly, and at times amusing. There was an older lady whose job apparently was to take dirty dishes from the tables and only says \"thank you!\" when she does anything near you.I noticed that a great many of the diners were very elderly. Is there a retirement village nearby? Do you not realize that the elderly LOVE buffets and bland food? This restaurant was full of both, and I think it was the army of elderly people with diminishing taste buds who wrote all those glowing reviews.I understand that people have varying opinions and tastes, but come on! Raise your standards and start asking yourself if the food you are tasting really deserves FOUR or FIVE stars? Fail."], ["Steven K.", "I cannot in good faith recommend this restaurant.   This is definitely the low end of Chinese food for Phoenix.   Normally I'd try a place more than once, but, in this case... Not going to happen."], ["Diana D.", "My first time there and the food was good!  We weren't super hungry so we just had an order of pepper beef, brown rice and bbq pork chow mein.Everything tasty but the chow mein was above average!  I expected a sauce noodle dish or a thicker lomein type dish because that's what it usually is in most Chinese restaurants... but here it is the very thin noodles and they are fried, with huge portions of pork and veggies spooned over it so the noodles soak up just enough without making them soggy.It's almost cliche to order pork chow mein when you go out to Chinese food, but here it's worth it.  I'll revisit them when I'm more hungry and try some other things!"], ["DJ P.", "This is our go-to \"quickie Chinese\" food for lunch.  You can order and have great food in less than 5 minutes during the work week and the lunch menu is pretty inexpensive.  Beef & Broccoli, Sweet & Sour Chicken, and Tangerine beef are all great!"], ["Gabi M.", "\"2 stars for disappointing food, one star for great service.\"Had I read Iain B's review prior to my dinner at Desert Jade the other night, I could've saved us $46.  Instead, my husband and future yelper sister Alexa M and I headed down Indian School road in search for some decent Chinese food.  We were all pretty hungry and it was my bright idea to try a new place.  We passed by Shanghai Chinese and actually pulled into the parking lot of another restaurant (maybe China Village?) but decided since the parking lot was close to empty, that was not a good sign.  So, somehow we ended up at Desert Jade.Ivan was our server and he was fantastic.  I just wish I could say the same about the food... Unfortunately, the egg drop soup, Kung Pao Vegetables, Spicy Chicken, and Beef and Asparagus dishes were nothing to write home about... all were mediocre.Next time, I'll go to one of our regular spots instead... or at the very least, I'll check the Yelp reviews before wasting time and money.  You live and learn... they cannot all compete with Tottie's or Jade Palace!"], ["Jenne L.", "We get take out here all the time! Great food and delightful service! The woman taking the card grabbed all the boxes of food and carried them out to the car for me too. Highly recommend."], ["Chris B.", "This is the best American Chinese food we have had in the valley. Anytime we want great Chinese food, we drive here. It's out of the way but we'll worth the drive. Today I ordered the Peking Pork & House fried rice. My GF had the sweet & sour chicken. Each dish was amazing and worth adding to your next dining experience. The service is always exceptional. This is our favorite place for American Chinese food."], ["Kensington W.", "I get the Singapore rice noodles takeout once in a while and I am always happy with my food.The Singapore noodles are good and they come with shrimp and pork. They are the drier version of this dish (not swimming in sauce), which I prefer. I also don't really like shrimp and they substitute the shrimp with chicken.I always get take out so i can't comment on a dining experience, but the take out is always fast and ready to go when they say it will be.Good food, fast friendly service."], ["Cookie M.", "This little restaurant is off the beaten path and worth going to!  In my opinion, it is the best American Chinese food in the Valley.  Great friendly service and the food is fantastic.  Tthe best beef & broccoli EVER with a fantastic satiny sauce.  The regular (not spicy) chicken with vegetables and the sesame chicken are also wonderful.  We iwll be back."], ["Robert T.", "Service excellent........then it goes downhill. The fried rice was at best poor, clumps of steamed, not fried, rice, with a touch of sauce, that was sauce? No veggies or meat, basically white rice. Ate three spoonfuls, toss. The egg foul yung was swimming in soy sauce and appeared to have been burnt. Two bites, toss. The egg drop soup was good, but again, how do you ruin egg drop soup? Go back? Slim and none.They should send their cook to MN, maybe he could become a chef.RTinAZ"], ["Jim M.", "Hot and sour soup is amazing!! I have eaten here many times and have never been disappointed. The food and service is excellent!!!!"], ["Ryan J.", "3 stars and that's being generous.  Mongolian beef and Sweet/Sour chicken were both soupy and swimming in some kind of MSG laden gelatin.  I really wish I could say better things about this place and I really wish I could find some dependable Chinese in Phoenix.  Suggestions anyone?"], ["Anthony K.", "I really like their food portions are a little small. My favorites are hong Kong steak, Singapore noodles chicken lettuce wrap"], ["Asina G.", "For some reason I was craving some hot and sour soup yesterday, so I turned to Yelp to guide me.  I found Desert Jade, which is near my office, and which I've driven past a thousand times, but which I've never tried.  So I called in an order for a hot and sour soup and an egg roll, and went to pick it up.  I walked up to the cashier (who was the only person in the front area) and stood there as she feverishly went about scanning credit cards.  I stood there for about 5 minutes with absolutely no acknowledgment from her that I was standing there.  It was like a game to me -- let's see how long I can stand here without being acknowledged.  Then an older white man who had dined in the restaurant steps up to the cashier and puts his check down to pay for it and -- I'm not kidding here -- she picks up his check and charges his card STILL without acknowledging that I was standing there.  It was not until after she finished checking him out that she turned to me with a smile on her face and asked how she could help me.  Really?  Hmm, let me think.  I wanted to say she could help me by not being completely rude and disrespectful, but I just simply told her that I had placed an order over the phone and was there to pick it up.  Once she actually acknowledged me, she was very pleasant, but everything before that was completely unacceptable.  The soup and egg roll were actually pretty good, but the service was beyond terrible, and actually entered into the world of being a tad bit racist.  I was offended, and for that reason, I won't be going back to Desert Jade anytime soon."], ["Sylvia C.", "This place has the best fried rice ever . not too dry , just perfect, I've only eaten inside once, and the workers are very nice. I order take out from here all of the time and they have fast service."], ["Andi P.", "Worst Chinese food I've ever eaten. The fried rice was squished together like steamed rice and flavorless. Moo shu beef  I could give 2.5/5. I ordered the Kung pao chicken with extra spice, I give it a 0/5. The chicken had no flavor. It was not spicy, and the dish had what tasted like a brown gravy on it. If you want unpalatable Chinese, save your money and go to Panda Express."], ["Brett B.", "AMBIANCE: We came here after we heard this place achieved the dean's list on dirty dining. I was going to only give this place 2 stars (see below) but because this place was not dumpy like other Chinese restaurants and actually was clean and comfortable, this was part of the reason why I raised my rating. It reminded me of when I was a kid in 80s and would go to Steak & Ale with my family. It was very dark inside, which I love when it's 110 degrees outside, with dark furniture and windows you can see out of, unlike other Chinese places where they have to keep their windows shaded or blocked out for some odd reason. But this place has nothing to hide. Upon entering it is nice to see a full bar and to be greeted right away. I believe this is a family restaurant, and you can see the pride in the way the place is kept up. It is super clean, not dusty or dingy, and the bathroom is immaculate. Nice touch, even though the sun had not set yet, was the placement of lit candles on EVERY table, and only a few were occupied. I also noticed a fireplace, which must be nice if they light it in the winter.FOOD: one word, BLAND! I just don't understand. From appetizer to entree, everything was missing either sweet, salt, or both. The fried wontons could have a used a lot more filling and the \"sweet\" orangey sauce was not even sweet. What?! The fried dumplings looked like they stuck to the pan, as they were slightly black and some were broken from when they tried to remove from the pan (probably not enough oil, or they walked away for too long). The familiar sauce that came with it was not salty enough so I just used soy sauce. The Kung Pao chicken was unlike any I've had before. Where were the red and green bell peppers? Missing. Where was the heat, even though it was in red to indicate spicy on the menu? Missing. It was just chicken, lots of green onion bottoms, peanuts, and those whole red chiles no one eats but is supposed to add heat. The sesame chicken, usually with a very sweet sauce, was not. The chicken was okay, but slightly overcooked, noticeable by the very dark brown fried coating. I didn't like the tangerine beef: when you have any meat sliced thin, hello, it must be cooked no more than a minute or two or tough, as it was in this case. Think beef jerky. I noticed that the restaurant kept filling up with old people and I thought that maybe a nursing home was nearby, but then it dawned on me; they like bland food so this place was like their mother ship!SERVICE: This also led me to raise a star as the service was stellar. More than a few people from a couple waitresses to several bussers, took great care of us. They even wrapped the pancakes for our mu shu pork dish for us. Everyone is so friendly and served with a smile, I so want this place to succeed. Yes, you are in Phoenix and the pickings are slim for the traditional, Americanized, Chinese restaurant that serves the freshest and tastiest food. Add some fresh spice, honey, turbinado sugar, fish sauce, whatever!, just turn it up a notch and watch those cooking temps (don't forget fresh meat and frying oil) and you'll have a winner. Add then add home delivery and you'll corner the market. In the meantime, I have found my current benchmark, Chou's Kitchen in Chandler, and I will have to trek it out there when I want the best, until I find something better."], ["Bailey S.", "My mom and I recently started on a quest for the best po po platter in Phoenix. So naturally we ended up here. With the amazing reviews and extremely high prices I was ready to be impressed. I was not. In fact, this was what my mom called \"the worst American Chinese food I've had in my life\". The food was bland and greasy, to the point where we felt so bad that we took the majority of our overpriced entrees to our house just to throw it out. The po po platter (which they called a Bo Bo platter?) was dry and the plum sauce accompanying it was watery. My sweet and sour chicken, was tough and cold. The meat, not covered in what would be a sweet red sauce, was snow White. My mothers 'Desert Jade Shrimp' was, as she said, \"only covered in butter\". The only two good things in this restaurant  was the Mai Tais and the service. I was appalled by this meal. It was not worth the trip."], ["Teri B.", "I'm on the constant hunt for good Chinese food in Phoenix. After many disappointing meals, I found Desert Jade and haven't looked back. The restaurant is super clean and quaint inside (even a big fireplace) and the service is great. Each of our servers have been super friendly and attentive. The food is really good. It's not going to blow you away, but it's fresh, portions are just right and I've never left unsatisfied. I really like the Kung Pao Chicken, the Mu Shu Pork, Spicy Chicken with Vegetables (lots of them), and my husband loooves the glazed walnut shrimp.If you're looking for an easy, casual Chinese meal in Phoenix - I promise you this is one of your best bets."], ["Cj N.", "Pleasantly surprised! Didn't expect the light atmosphere from the outside... Great fast service... Decent price great food"], ["Judy L.", "I have not been here in awhile, so I thought since I am in the area I will pick up a lunch togo.  I ordered the sesame chicken lunch special (chicken, rice, and an egg roll).  I bought it back to the office, it smelled good and the togo box was stuff with food.  I wished it tasted as good as it smelled.  The sauce was kind of bland.  I was so bummed.  I guess I need to find another chinese take out place."], ["John L.", "The food wasn't very good. My girlfriend and I could only eat like a quarter of meal before we asked for a boxes (just to be nice, we don't plan on eating them). We then drove across the street to McDonalds.  I would like to note the waiter was super nice but that doesn't really help later when your stomach hurting. I hope it was just the dishes we ordered (spicy chicken w/ red sauce and chicken with vegetables in spicy sauce) because ironically the restaurant ambiance was very cozy and all the staff was extremely nice."], ["C T.", "I've been searching for a decent take out Chinese place for awhile, and there are a few in this area. This hap pend to be the first one I tried, and maybe ordering the traditional take out dishes was the downfall, but I was disappointed. My girlfriend and I ordered beef with snow peas and water chestnuts, and a spicy vegetable kung pao type thing with fried rice. The flavor, quality, and freshness of the ingredients was very bland and seemed to be more of a public cafeteria type quality. The menu had a number of specialty dishes, so maybe we ordered the wrong items, but I don't think I'll be going back to find out."], ["Tattoo Trav P.", "This is hands down the best Chinese food in the valley. A true hidden gem. Fantastic food, great portions."], ["Steven P.", "This restaurant is not a place a tourist would find in the hotel travel books.  It is an older, somewhat edgy part of Phoenix.  The building was probably a Denny's in the 1970's.  But, don't let the location and appearance turn you off.This is a great place if you have a lot of friends who don't mind having \"family style\" Chinese food.  The sauces are very light and flavorful.  The portions are ample the lazy-susan helps get the food moving between your friends.  The staff and the owner had no problems handling a horde that wanted one of everything.  If you are looking for flavorful Chinese and a moderate price come here, if you are looking for skimpy and overpriced head to Scottsdale."]], "Szechwan Palace": [["Eric B.", "Very pleased!  Authentic menu, GREAT variety!  While I did not order from the Americanized menu, I appreciated the fact that they separated the items so I could ensure I had the authentic cuisine.  I ordered the lamb in spicy black bean sauce on sizzling platter and the pea leaf with garlic sauce...yummmm!!"], ["Ben M.", "Just outstanding. The water boiled fish and lamb ribs are especially recommended- just love that numbing pepper!"], ["Vera Y.", "For those actually from Szechuan like me, this is the most authentic taste I've ever tasted in Phoenix. And it deserves a higher rating."], ["Yu Z.", "Authentic Chinese food. Even better than most Chinese restaurants in LA. It's a must go place If you live around Phenix and love traditional Chinese food."], ["Becky R.", "Not very good, and the service is marginal. I ordered cashew chicken and hot tea for lunch. It comes with salad and soup and choice of rice, however the server said \"egg drop soup\" - not asking, but I figured a lucky guess, then he left. He never made eye contact, didn't ask what kind of rice or salad dressing. The soup came, still no eye contact or words. It tasted like canned. Then the food - again, just put there and the waiter disappeared before I could say anything.  The tea never showed up, nor did they check to see if I needed anything else before bringing the bill.      The \"salad\" was a micro bit of iceberg lettuce swimming in Ranch dressing (really? at a Chinese restaurant?) I did't want to use a soup spoon to eat a salad, so I didn't eat it. The entree was swimming in too salty of a brown sauce, and the egg roll was marginal. Find somewhere else to go."], ["Yi T.", "That is a great place to order some real Si Chuan food. I with my friends went to there lunch time, we all wants to try the hot pot next time. Good place to eat Chinese food."], ["Haiyuan S.", "Last night I go to the this restaurant with my girl friend , this place has pretty good good and staff are very nice. However I have to spend a little bit more time to waiting for food. But I think waiting for nice food like this are not bad and deserved. So I think give 5 star is right."], ["Raksha A.", "I love this place for lunch!! They have lunch combo for around $6 which includes choice of soup, veggie egg spring roll."], ["S W.", "If you are getting the lunch special to go, you don't get the salad!!!  What is up with that, the price wasn't any different.  When the menu says I will get salad, soup  and a choice of rice I expect exactly that.  I asked about it and was told that isn't for to  go.  Well it is not listed that way on the menu or on the web site.  I won't go back, was my first and last time.  Also the spring roll was just roll, bland.  I haven't tried anything else yet, but regardless I won't be back!!"], ["Wi H.", "Water boil beef and boneless chonquin chicken to die for. Thank you for not dumbing down the flavor for westerners. Over a dozen trips and not a single bad dish."], ["Georgeann G.", "So I'll admit, I actually thought Miu's in Tempe INVENTED this style of cuisine. I had never had it or even seen it anywhere besides there (probably because of that whole \"secret menu\" thing chinese restaurants like to do). So when I moved from the Tempe area a few months ago, not being a stones throw from Miu's was, quite honestly, the saddest part.When I found out the Szechwan Palace (Located about three blocks from where I used to live in Arcadia, BTW) also offered the spicy cucumbers, dan dan noodles, and spicy lamb ribs I had come to love, I was so excited to try it and PRAYED it would fill the void in my life that Miu's once filled.  Well, it didn't.That's not to say it's not like 1000x better than any other \"Americanized\" Chinese restaurant out there (Also, it's hilarious that they have a an actual section of the menu called \"Americanized Chinese\"), but when comparing Apple to Apples (which I always do when it comes to restaurants like this) Miu's is a 5 and Szechwan is about a 3. Here's my deal (and i ordered my exact order):1) Spicy cucumbers were warm  One of the most delightful aspects of this dish is the cool temperature combined with the heat.  Warm cucumber are gross.2) Dan Dan noodles were standard. Much cheaper than Miu's though so that got them a star3) Spicy Lamb Ribs were a little weak. I get that I'm a white girl drinking pinot grigio, but a can handle my heat.  Please don't coddle me. Basically, if you need szechwan in the area, which I do, I'm glad they are here.  But if you are looking for top notch food, go to miu's.  If you're looking for top notch service, don't get chinese, because it sucks everywhere."], ["O'Zandra F.", "I occasionally crave Chinese food, but we're in Phoenix...which isn't as culturally diverse as one my think. However! I've been to the Chinese Cultural Center (COFCO) for festivals and shopping.  Szechwan Palace is situation in the foremost corner of the Center.  One can dine in or take out.  Most of the patrons were Asian, which is a good indication that the place serves authentic food.  Don't come with high expectations though, this is not a posh place, by no means.  But the food is delicious! I was able to get a respectable glass of Riesling too.  Service is seriously lacking. The waitresses are in no rush to serve.  I waited over 10 minutes after I was seated for someone to take my drink order. I gave the order for drink and appetizer at the same time. The appetizer came out ten minutes before the drink finally came.  I thought to myself, \"this is going to be a loooong evening...\"  The good food justifies the long waits. ...I guess."], ["John Q.", "I have been here a few times and have really enjoyed the food. The chili fried green beans and ma la fish are excellent dishes that combine spicy, peppery flavors. The wontons were pretty good as well. However, I do not recommend the xiao long bao here (thick skin with no soup and too sweet of a flavor). The service tends to be a bit aimless and slow, so don't have great expectations there. The prices are quite good and it's easy to feed a group on a budget."], ["Arizona T.", "Horrible experience.We ordered 3 entrees. General Tsos, Chow Mein and the Warer boiled chicken.The Tsos and Mein were decent at best. The other dish which was recommended as their favorite and is supposed to be spicy came out and it was god awful. It was Water boiled spicy beef.We told the waitress it was unedible. It was barely spicy and had something in it that numbs your tongue and tasted like novacane. Our tongues were all numb.No Offer to exchange it for something else. And certainly they were not about to remove it from the tab. Bad customer service as far as I'm concerned. Tip for the owners this is America, not China. Work on your customer service skills"], ["Shira J.", "Yum! I got the lo mein and it was delicious! The restaurant was packed, for good reason.  My only complaint was that the person I went with got her food 10 minutes before me.  I'm not sure if they forgot about my meal, or if it just took longer to make, but it was kind of weird.  Anyways, overall it was a good experience and I would come back."], ["Hao Z.", "I think that this is the best Chinese restaurants in phoenix, the great taste like home. And not only delicious food, and the service is also very good."], ["Nicole L.", "We decided to try something new and said we wouldn't order anything from the Americanized menu. The place is cute and environment was nice. As previous reviewers have said, the service is a bit lacking because there's only about 3-5 servers working. We ordered xiao long bao (dumplings with soup inside), water boiled pork, and intestine dry hot pot. the xiao long bao was really good and flavorful, those are always a nice treat. the water boiled pork has a literal tongue numbing effect and I just couldn't enjoy that dish with a numb tongue. I'm not sure what kinda spices but it was spicy and I like that this place can make some spicy, flavorful dishes. the intestines were good but there were so many peppers. overall, good place and we'll probably be back to order from the Americanized menu and stick with that."], ["Tianwei S.", "Good food, one of the most authentic Chinese restaurant in Phoenix. Somehow I hope they have better service."], ["Aileen C.", "Okay, people. There are NOT a lot of good Chinese restaurants in the state of Arizona. I know this because I have tried almost all of them in search of finding something equivalent to the restaurants in California.Szechwan Palace is the best place I have eaten at in this entire state so hooray for them!! I LOVE LOVE their pickled cabbage. It is ridiculous spicy and that just makes me extremely happy. You MUST get their Chinese menu (I think they have a different Chinese and American menu for people who are not used to eating traditional Chinese food). Their spicy cumin lamb is soo good. Actually, I've gotten a lot of dishes there and haven't really been disappointed by anything during dinnertime.Warning - during lunch, I think their lunch specials are only American-Chinese food which consists of orange chicken and broccoli beef which really does not represent how good the food is. Go for dinner and experience the real Chinese food :)"], ["Tim P.", "I have lived in Phoenix for about 18 months now.  My first six months I had plenty of chances to eat out.  The whole time I was looking for more authentic Chinese food.  Not the overly sweet sauces of americanized Chinese food, but edgier stuff.While living in the Netherlands (where Chinese food is even worse than Phoenix) we learned that good Chinese restaurants have two menus, one for the casual Chinese eater looking for a step up from Panda Express and Chinese buffets and one menu for the die hards, native Chinese food eaters.  Often these menus are not even in English (or Dutch as it were).Well, my looking in Phoenix has come to an end.  Szechwan Palance has such a menu.  Granted, theirs is not so seret, they share the same menu, but in different sections.I have been here twice and I have found the food to be quite good.  there are some edgier dishes that we have not braved yet (i.e. kidney, brains, intestines, odd seafood etc.) but the ones we have tried have been quite tasty.  Dan Dan Noodle, simple and right on, small bowl, but rather cheap.Chinese egglplant in spicy bean sauce - very good, ordered it twice, and I do not even like eggplant.Beef boiled soup - I have grown to love this dish over the last few years (starting in netherlands),  There are so many flavors and interesting items included.  We love to get rice with it to sop up as much juice as we can.  though we have been told by friends that broth is simply there to cook the meat and veggies, not to eat as a soup.We have Chinese national friends and they all claim it is a great place for authentic Chinese Szechwan.  The Service - many comment on the service - OK it is only so so.  Last time we were there they never even asked us if we wanted anything to drink.  Had to ask them to clear dishes etc.  Not really rude, just not what we are used to in restaurants.  I wont let this curtain our dinning there, I count it as part of the experience."]], "Hong Kong Kitchen 3": [["H K.", "We have been here two times in the last couple months. The food is fantastic, the dining room is clean and tastefully decorated, and the staff is wonderful. Also, amazing value. For just $1 more than your entrée you will receive crab rangoons, spring roll, and delicious egg drop soup. This is my favorite Chinese place in the Laveen/south mtn area by far."], ["Ann T.", "This place was just okay to me. Food is good and the service is excellent. I had the kung pao chicken and the servings are HUGE!! Not satisfied enough to come back."], ["P B.", "It pains me to give these guys three stars, but it really is a perfectly good 3-star place. I'll probably come back for more, but our most recent visit was entirely mediocre (in an entirely comforting sort of way). Hong Kong Kitchen would likely remind you of similar restaurants in cities where casual Chinese-American places are more the norm, but I'm usually looking for something a little more exciting when I see the ratings that this place has received.In short, my egg rolls were a little burned on the outside and soggy on the inside, and most of our other dishes were quite average, but with generous portions and entirely edible. I'm pleased to have a pleasantly unspectacular Chinese takeout restaurant nearby and will come back for more, but my expectations will be lowered from what I had seen on yelp prior to my last visit, which was my first."], ["Kevin E.", "This is the second time I've been here this week...it's that good!! My partner loves the sesame chicken. I've had Kung Pao chicken and KP shrimp. Both were excellent. Hot & Sour soup is out of this world delicious. Service is great and we will be eating here frequently."], ["Emma W.", "Really good food and quick service!  I'll definitely come back.  This area is sort of a dead zone for decent restaurants, so this is definitely one to note.My favorite thing about this restaurant is that they give you what is presumably the Chinese equivalent of chips and salsa.  They set out a bowl of the little chip-like cracker things.  I am forgetting the name right now.  Wontons maybe?  With that pink sweet and sour type sauce normally served with egg rolls.  So good!  I hope this catches on everywhere, because it is a great idea!!Both of our meals were HUGE and really, really delicious.  I got the vegetable delight, and my date got the thing with egg chunks.  Both were really, really good!  Service was friendly and very fast.  I'll definitely be back here."], ["Michael J.", "Went here for my second time Friday. The food here is excellent and the staff is over the top.  Staff is very friendly and helpful, they offered me a glass of ice water while I waited for my togo order and were happy to answer any questions I had about what they have to offer. The food was really good and they gave me more than I could eat, which is ALOT.  I look forward to coming here with friends when I have time to sit down and fully enjoy what they have to offer."], ["Jim C.", "I\"m in agreement with the others here.  The food was so good here.  Our waitress could not have been more pleasant and helpful, constantly refilling drinks for a table of 6.  She even offered to give us new drinks in to go cups.  The food really is delicious here.  We tried everything from beef and snow peas, to orange chicken, to chow mien and lo mien.  It was all yummy.  We even liked the open and airy atmosphere.  It's not particularly inventive cuisine--hence the 4 instead of 5 stars--but it's really good and their customer care is warm and efficient."], ["Rebecca O.", "I tried this restaurant for the first time last week. Will definitely return. I ordered the house chow mien lunch special. My total was $7 and some change and my plate included a cup of soup, an eggroll and a crab Rangoon. I was pleased when I counted 4 shrimp within my noodles, that's usually around the amount I get when I order a large chow mien. The chow mien was was excellent. The fried items were ok, not bad and not best I've ever had. Sadly I was not impressed with my hot&sour soup, it could've used more flavor for sure. The fried rice on the side was very basic brownish looking without any veggies. I took my food home but the inside of the restaurant was very clean with awesome South Mountain views."], ["Denise S.", "Thanks to all the prior reviews for helping me find this gem.  Never would have thought such a flavorful clean oriental restaurant would be residing so close to home.  This what I have waited years for...good fresh take-out.  Added plus is the prices are great and variety amazing.  The curry chicken was the best I've found since it wasn't just 3 ingredients like most (chicken, onions and potatoes).  It had water chestnuts, bamboo shoots, carrots, mushrooms, green peppers, onions and plenty of super thin sliced chicken breast.The chicken teriyaki (which I requested the sauce on the side for my daughter) was amazing.  It was probably two chicken breast lightly battered and fried served over steamed cabbage, carrots and broccoli with white rice.  A super delicious healthy meal for a 7 year old.My husband really enjoyed the Kung Pao Broccoli.  It had a lot of chili peppers, peanuts and a ton of broccoli.The $1 to make a combo (egg roll, crab rangoons and soup) is great deal since I plan to eat my soup and leftover curry for lunch tomorrow.Can't wait to try more dishes."], ["Eric S.", "Great food, inexpensive prices, and good size portions... Walnut Shrimp was pretty good."], ["Dave B.", "Nice family atmosphere you would expect from a mom and pop operation (very friendly family staff) and they keep the place impeccably clean (which is in total contrast to not-always-so-friendly and mediocre buffets). These guys serve fresh and healthy dinners with great vegetable combinations at a fair price and if you are extra hungry you can add a couple of cream cheese rangoons, a spring roll, and hot egg drop or hot and sour soup for a mere buck. Their shrimp is phenomenal in every dish we have tried. We live walking distance to an Asian restaurant we still enjoy every now and then but I think we have found our new favorite in the neighborhood. They don't serve alcohol which is a good thing in a family restaurant. Treat yourself and give Hong Kong Kitchen III a try..."], ["Samson L.", "We dined recently and frequented their previous location in Gilbert. Fast, friendly service and great food."], ["Olya L.", "This place is fantastic! The food is very good and great portions! The service is good as well. Definitely go here for lunch..."], ["Jill A.", "First visit, very good service and their food is fresh. Lunch is only $6. Includes soup, egg roll, crab puff and entree. Kung pao beef was very good!"], ["Susana M.", "Great  authentic food & prices. Service is also fantastic; it's a family affair. Hurray for good restaurants in this area as they are scarcer than rain!"]], "The Prime Chinese Restaurant": [["Melissa T.", "Very good Chinese food. The egg rolls are our favorite in the valley. The rest of the food we've tried was good. But we felt they we're pricey."], ["Awesome P.", "By far the best Chinese food in the valley. Located in central PHX, on NW corner of Camelback and Central. Family owned for 20+ years. Open forlunch and then dinner. Closed 2-5.Can't go wrong here. Most of customers have been coming here 5+ years. Start with Cabbage Wraps with Jenny's special sauce and crab puffs. Next order anything over low mein, she will do it for you. Ask for desired hottnes :)Enjoy!"], ["Erica M.", "This place had great ratings so we decided to try it. We ordered 4 dishes for take out. We arrived and were in a hurry so we paid for our food and left without checking the bag assuming all was well. They ended up missing one of our orders. The rice was mushy, each dish had a weird overpowering flavor. When I called to let them know that our dish was missing they let me know someone else took the order and did inform them that it was missing but since they didn't charge for it try didn't mention it. In my opinion that is just bad service. I do not recommend this place and will not be back."], ["William M.", "I went to Great Wall and I thought they had good service good food I didn't have to wait long for my food and I felt safe to eat there because I noticed they were clean . I heard about Great Wall through a friend and they also felt the same way about their food and service thank you this all I wanna say."], ["Doreen J.", "I used to go to this restaurant with a friend many years ago.  I always loved their food.  Tonight I was in the neighborhood and decided to give them a try to see if my memories were justified.  They were.  Though it was a quiet night, the food was excellent.  I was treated as an old friend and felt very comfortable.  The ambiance is great.  They have a small dining room with all sizes of tables.  The tabletops are of brushed aluminum and are gorgeous.  There is original art displayed on the walls, all modern.  Some of it is for sale.  Upon entry there is a very nice divider that separates the dining room from view of the door.  I ordered Sing Chow Rice Noodles and they were delicious.This place is a little hard to find, but don't hesitate to stop in for either lunch or dinner.  You'll be glad you did!"], ["Tonye O.", "I had decent expectations for this place because of the reviews that it has, but I was sorely disappointed. I went there and ordered from the lunch special menu, which is very limited. My coworker got the sweet and sour chicken, she said that it was good, but the sauce was thick.I got the crispy house chicken, and the wor wonton soup. First, the wor wonton soup only comes in large, but I was willing to give it a chance. I shouldn't have. The soup lacked salt, and had barely anything in it. Canton Dragon still has the best wor wonton soup I have ever had. The chicken was far from crispy, as it was completely overwhelmed in sauce and soggy by the time I got it back to work to eat. The fried rice was mushy, and the egg roll was overcooked. Maybe this was just a bad day, but I won't be returning to the prime, as I've had much better Chinese food, at a much better price."], ["Taric W.", "I hate egg drop soup with a passion, so when I couldn't get enough of it at The Prime, I knew more good fare was coming my way. This place is spotless. They're real clean freaks. My eyes wandered from picture to picture of all the local art for sale. The lunch specials are affordable, and in portions that are just right for someone who doesn't want a food coma before 3PM. My house special chicken was pretty good, even though I just can't shake this feeling that the sauce tasted like something more suitable for Mongolian beef. They've got beer and wine, Thai iced tea, and your favorite sodas...which come in cans, not in fountain form!It's tough to find something downtown with this kind of charm. Or...maybe what I mistake for charm is a conspicuous lack of hipsters. Now you know where to hide from them. ;-)"], ["Alfie N.", "Do not be fooled by the exterior of this place! It's worth checking out.I live in the area and have frequented The Prime Chinese Restaurant many times. The place is great for lunch and dinner. The serving sized are very large. And the meals are delicious. I recommend the vegetable egg foo young. The service here is very good. You will most likely be greeted by an older Asian woman. She owns the place and is so friendly. I work in marketing and SEO so I offered to help them with getting some more exposure but she seemed doubtful that they would be in business come the new year. Please check this local business out! They treat their customers with the utmost appreciation and respect. It would be sad to see a business that has been there for 21 YEARS go out of business. Pros: - great food- large servings- awesome service- decent wait times- quiet atmosphereCons- not exactly cheap- needs better decorating touch"], ["Breanne M.", "Food was great--the Sweet and Sour shrimp was only lightly breaded (I dislike the heavy breading of other Chinese restaurants, but The Prime Chinese Restaurant had a perfect balance), and the Shrimp with Lobster sauce delicious.  The Shrimp Fried Rice was good as well.  However, for a dinner that my boyfriend and I assumed would be very filling (Shrimp with Lobster sauce, 2 egg rolls, Shrimp Fried Rice, and Sweet and Sour Shrimp), the portions were EXTREMELY tiny, while our bill came to $43.On the bright side, the lady working there was very nice, and the decor was lovely.  It was honestly the best Chinese food I've had yet in the Valley, however, for the small portions for over $20/person, I don't think it will take the spot as my go-to Chinese eatery."], ["Amanda R.", "The Prime is in a muted little strip mall, just west of Dutch Bros coffee.  Inside, you'd never know it's been here 20+ years; they've implemented a nice, modern facelift to the whole interior.  We grabbed a take out order for the first time last night, and it was hands down the best Chinese food I've had in this area of town.  We shared:House Special Chicken- spicy, peppery, not too much breading, not too over-fried, not too over-sauced.  Win.  Chicken Lo-Mein: really well-done.  Wok-fried but not overdone, veg (broccoli, cabbage, onion, shoots) still had crunch to it, garlicky, sweet, heady sauce.  House Special Fried Rice: bbq pork, shrimp, beef, chicken, egg, soy fried.  So good.You know how so many times at Chinese restaurants the flavors of each dish tend to blend together, due to over-frying in the same, old oil??  Not this place.  I'm delighted I found this little gem right down the street from my house. I'll be there often, come say hi."], ["Peace D.", "Another fabulous home style Chinese food at The Prime Chinese...... If you like combo fried rice, it is the best ever...."], ["Lenore B.", "Oh god, I went back here after having moved out of the neighborhood just for take out. Sorry, unhappy reviewers, this place is just great. Jenny runs a tight ship, and listen, if you think the service is slow, that's because it's cooked to order, not sitting in a steam table somewhere like a $5 Chinese buffet. Best Wor Won Ton soup in town. I love this place to bits. You'll see Chinese families eating there, the cops eat there, c'mon, try it!!"], ["M G.", "I've been here enough times to have an informed opinion. This place is okay but not great and it is a little expensive considering the portions are not that large. The first time I went for lunch I had the lemon chicken and thought it was delicious. It tasted like actual pieces of fried chicken with lemon sauce, not like the Mcnuggets a lot of places use. But I've since gone back twice for dinner and both times, I wasn't that crazy about the food. A month ago, I had some type of szechuan black pepper chicken. I finished it, but it was too salty and there was a slightly off putting burnt flavor.A few nights ago, I tried the Thai style Chicken curry. It was similar to Thai Curry but didn't have as many fragrant herbs and flavors of the real thing,  and again it was too salty. The $1.50 egg roll was good but small. I'd like this place better if it wasn't just a bit overpriced for a Chinese American restaurant of its status."], ["Raquel T.", "Prime is pretty hit-or-miss. We've had some of the dishes here multiple times, and what we've learned is this: if it's \"crispy\" on the menu, there's a 50% chance it'll be crispy and a 50% chance it's just going to be chewy. The Thai Style Pineapple Fried Rice and Mango Chicken are both great sometimes, and other times just bad. The Mongolian Beef & Beef with Broccoli seem to be sure bets.What keeps us coming back? Well, the portions are a good size, and sometimes it's just so damn good. Also, it's never overly greasy, it's so convenient, and the lady who always takes our orders and is there when we pick-up is just so sweet. As one of the other reviewers said, it's just so hard to find good Chinese in the valley... ultimately, this hits the spot."], ["Jaime S.", "The Prime lived up to its name.  The pevious reviewers have got it right about the great service, cleanliness and fantastic food.  I'm more just weighing in so that my rating is factored into the average.On my first visit (of what will likely be many to come) a group of us ordered:Kung Pao Beef and ChickenMongollion BeefSpicy ChickenYui Shan ChickenCrab PuffsEgg RollsAll of them were spot on, the best I've had in the valley and I've been frequenting valley Chinese restaurants for 30 years.  If there's better Chinese food in the greater Phoenix area, please let me know!  Stop reading and get to The Prime posthaste!"], ["Velika L.", "Wow, what a hidden gem!  Went on a Tuesday night at it was completely dead.  Don't judge a book by it's cover.  Despite being in a bad neighborhood, the interior is very modern and clean.  We ordered sizzling rice soup, bean curd with mushrooms and bok choy and egg fried rice.  Everything was delicious!  The bean curd dish was very unique.  You could tell it was very fresh, not slathered in MSG and microwaved (like some Chinese restaurants).  This is my new favorite go-to Chinese place!  Go to Prime people!  You won't regret it.  Service was very friendly too."], ["Kirstin E.", "Oh. My. YUM! Ive driven past this seedy strip mall a million and one times and never would have suspected a tasty Chinese place resided inside. Some friends from out of town were visiting, they wanted Chinese and jumped on Yelp. The Prime popped up...none of us had ever been so we figured we would give it a whirl. they get 5 stars for food. Every single dish was AMAZING and the egg drop soup was THE BEST I have ever had! The crab puffs were tasty, but had onions in them (which I loooove onions) just wasn't a fan of the onion in them. We had 4 dishes on the table and everyone enjoyed everything, there wasn't a scrap left on the plates, even the picky toddlers that were with us got down. Minus one star for service. There was one waitress and from what i could see, one cook. There were 4 tables of 2, a 3 top and then us 5 adults and 3 toddles. It took a very long time for food to come out and when it did it trickled out slowly.....BUT the food was soooo good we didn't care, everyone was excited for the next dish! We will FOR SURE be going back again regardless of staffing issues."], ["Victor M.", "Look, BEST freaking Chinese food Ever. Ever, ever ever, ya dig? I thought China Chilli was the poo, but this place is the truth. I loved it, my date loved it... she wanted food off of my plate, but as you know... \"Joey doesn't share food\""], ["Doreen H.", "This is a great Chinese restaurant - something extremely hard to find in the Phoenix area!!! As someone mentioned before - a hidden gem in a tiny, kind of run down strip mall. I love the Mongolian beef! I no longer live close by but will go out of my way sometimes on my way home from work to pick up an order to go."], ["Mike O.", "The Prime is my neighborhood Chinese choice. With the Camelback Light-rail construction all but finished, the City gave her a left-turn lane into the property for Eastbound traffic and the nearby Stargate (have to see it to believe it) for convenient access to diners from other times and dimensions. When the light-rail station arrives, the asshole landlord of this eyesore of a strip mail will no doubt double her rent again, but in the mean time, Jenny's place resides just blocks from home.Jenny (and her family) make you feel like you're sitting at her kitchen table, as she shares with you from the bounty of her generosity and love as your host. That being said, please do not expect a five-star dining experience. As Eric noted, the service can be a bit slow, but It's excellent food, prepared with the best ingredients.Among my favorites are the (1) wor wonton soup (normally an appetizer for two), made red with spoonfuls of hot chili sauce, (2) the chicken noodle soup (which has nursed me to health through many stomach bugs and influenzas over the years), (3) the bbq pork ribs, and (4) the shrimp and vermicelli clay pot dish.As of the writing of this article, her niece had just joined the staff as server and helper. She's a bit green, so cut her a little slack.The Prime is easily the cleanest and quietest Chinese restaurant you'll ever dine in. You can enjoy your food and company in peace among the artful collage art of another nearby restaurant owner and laminated \"brushed-steel\" tables. None of the bustling. Chinese-ranting lunatics nor assigned \"plate clanker\" of China Chili, nor the scurrying cockroaches and leaking sewage lines of Diamonds, the wandering hairs (3 in two different consecutive visits) of Super Dragon, the jarred, made-in-Texas sauces of corporate cookie-cutter Pei-Wei, nor the flickering fluorescents and cracked Formica of Gourmet House of Hong Kong. Just good eats.Don't miss it."]], "Great Wok": [["Nikki P.", "I tried this place for the first time today and I loved the food. It was a great deal for the lunch special and you get soup with it. I ordered the Cashew Chicken with Hot and Sour Soup and it by far was the best chinese food i have had for a while. I will go back again."], ["Steve F.", "I'm not going to go into detail here as it seems everyone else has already done so but I just want to say that this is probably the 10th time we've eaten here and it's great. I've never had Chinese food delivered that is consistently hot, fresh and as flavorful as Great Wok."], ["Ainee B.", "Great kungpao vegs!"], ["Robert M.", "We enjoy stopping here on our walk each Sunday from church. I like the Chicken Lo Mein (spicy). Nice quiet place with friendly owners. The water is filtered and very good. We have also had take out food which was excellent."], ["Thom S.", "I have been eating here regularly for several years.  This is my favorite place to get great Chinese food.  I have never had bad service.  My order is always freshly prepared and perfectly cooked.  I love Great Wok!"], ["Don S.", "I love this place! How am I just now discovering it?This is a traditional \"Chinatown\" Chinese food restaurant in a lot of ways -- a lot of GOOD ways. I had been missing the flavor of good \"San Francisco\" tasting Chinese food, but I hadn't been able to find it until now. Even better that it's right here in Ahwatukee too.I sampled a bunch of different items, and I was happy with every single thing. The pot stickers and egg rolls were good. The fried rice was tasty. And, the chicken and shrimp dish I had were all amazing.The staff was very helpful. And, even the ambiance of Great Wok felt like an old school Chinatown restaurant. Love it. This place is highly recommended."], ["Keri R.", "The other Yelp reviews didn't lie. We ordered delivery and it arrived within 20 MINUTES!!! The food was hot, fresh, not greasy, probably the best crab puffs I've ever had. We also ordered the Happy Family, Orange Chicken and House Lo Mein with fried rice. All were incredible. House-made hot mustard tops it off. So happy to have discovered my new favorite Chinese delivery place!"], ["Kaci G.", "This place has good food and great portions. I normally have to order 2 orders of potstickers elsewhere to fill up. Here one order is plenty. They don't skimp one the eggs in the egg fried rice. Many other places do. The food is good and fresh. It is reasonably priced especially for the quantity of food you are getting. My husband told me to try this place and I am not disappointed. This is or new favorite authentic Chinese food restaurant. They deliver too! The delivery guy was nice and accommodating as I had a toddler on my hip. This place is great! Thank you for wonderful food and service!"], ["Mary O.", "Ugggghhhh.... this place is so good! I'm always scared when ordering from a new place. I ordered from here when I was staying at a client's house, because they were in the delivery area. Was not disappointed. Their honey chicken is amazing. I love that they put their food in nice plastic containers as opposed to cramming it in little paper takeout boxes. I still eat here, but I live in Tempe so I'm out of the delivery area. I only get it when I feel like driving all the way to pick it up. Worth it though. So delicious."], ["Jill G.", "Went to the Great Wok for lunch the other day and it was well worth the money. I ordered orange chicken off their lunch special menu. It was very good. It wasn't your typical sweet orange chicken. It had a little spice to it and you could actually see the red chili flakes in the sauce. The lunch special also included soup and a side of fried rice. The service was fast and the waitress was nice. She was also quick to refill our drinks which is a plus!"], ["Tiff G.", "First time at great wok. The service was awesome we had our order taken and had it out within 15 minutes. Food is delicious I have no complaints!"], ["Jason L.", "When I get a chance to eat here the food is always great. The egg drop soup is very good. The general Tao chicken is awesome too. The sauce they use is great and chicken has nice crust on it."], ["Neka N.", "Good food that is always fresh.  Everyone is really nice at this establishment.  We usually order the sesame chicken.  This isn't a complaint, but merely a suggestion .  The decor is outdated and I think a little paint and new decor with the right ambience  would make this place awesome.  I've ate at the restaurant about two times but decided to only order take out going forward. Good food for the price! The only thing I don't like is that I always feel crappy after eating there. It's a tired, sluggish feeling which probably is brought on by the ingredients that they utilize."], ["Deanna H.", "Great Wok was delicious!! The staff was friendly. I will return."], ["Kate T.", "Four months later and I still haven't set the apartment gate up with my phone number. I am the bane of the delivery driver's existence.With that confession tossed out there, I ordered from Great Wok tonight. I came home after work, giddy with the thought of a three-day weekend ahead, and realized the only fish I had in the house was a very unappealing frozen piece of tilapia. The woes of Lent. I can't survive off of the wilted English cucumber chillin' in the veggie drawer, so I had to give in and order delivery (I have the horrible tendency of not leaving the house once I get inside and realize how comfortable the couch is. Unless something important is going on, like a hamster fashion show or Chumbawamba's reunion tour. You know. The big stuff), and it had to be either a) vegetables or b) seafood. Chinese clearly fit these categories beautifully.I did not want a repeat of my last Chinese order, so I reexamined Yelp and found Great Wok again. Score. Called them. ...No answer. Determined to have some delicious Diocese-approved dinner (alliteration FTW), I made the fat kid in me chill out and called them again 5 minutes later, spoke to a very nice young guy, and ordered crab puffs, fried tofu with vegetables, and shrimp with vegetables. I hung up and realized I ordered enough for a small army (damn delivery minimums), and as a newly single lady that meant a lot of leftovers.The time estimate I was given was 45 minutes, and the food showed up within half an hour AND the delivery guy did not call freaking out about my gate being closed. (Yesss...I don't have to feel like an asshole.) Gentleman shows up at my door and hands me my food, and I sign the receipt thinking \"This better be worth $26effing94...\"Oh, it was. Shrimp that looked (AND TASTED!) like shrimp and not something my ten pound dog craps out on a walk. Crisp vegetables. Flavorful sauce and not pools of grease. Crispy crab puffs. I would have taken a picture to show the deliciousness of it all, but I began inhaling it too fast to even think about it. I have died and gone to Chinese delivery heaven, y'all. You will not regret ordering from this place...!"], ["Charles S.", "Ate here on this past Thursday nite. I had spicy shrimp and an order of mix veggies. They have brown rice which gives them an automatic plus. The spicy shrimp was really good. They use whole dry red chilli peppers, which I like, I only wish they added more of them. The waittress said next time for me to just ask and they will add more. I had asked for black mushrooms in my mixed veggies and she said that she could add them on. But when I got the mixed vegies their was no black mushrooms. But the veg dish was very tastey and not over cooked. We wanted more brown rice and the waittress told us they were all out of it. So we had to settle for white rice. The bill for 3 of us was $56.00. I would definetly come back good food and very friendly customer service.They don't use MSG. +++"], ["Steve S.", "Lived in the area all these years and finally tried this place based on the Yelp reviews. Food was very good, fresh vegetables as everyone points out.  Take out was ready on time, friendly wait staff and will definitely go back again.  House fried rice was very good and had REAL life-sized shrimp, not rock shrimp.  Hot/sour soup was very good."], ["Neda B.", "I can see why this place has good ratings. The Kung Pao Chicken and Shrimp was delicious. It had just the right amount of spice and my father, who is a harsh food critic, enjoyed it very much. The egg rolls were crispy on the outside and not at all soggy on the inside. The fried rice was very well made and not at all greasy. Actually, none of the food was greasy at all. We also ordered the Vegetable Lo Mein and Moo Shu Pork. Both were good but not amazing. Overall, this is a pretty good place for your classic Chinese food and is very convenient for people in Ahwatukee."], ["Natasha L.", "My husband and I found Great Wok a few weeks ago while searching Yelp for Chinese food. Wow! The place is small, but the food is amazing and the price is right. It was a Friday evening and they must have been short staffed. While the service was friendly, it was slow. My orange chicken was the perfect balance of sweet and spicy. My husband ordered the Mongolian beef which was pretty tasty, even though it isn't on my list of top choices. My husband enjoyed it very much. :-) The dumplings were perfect and the wontons weren't at all greasy (as they can sometimes be). We'll be back!"], ["Jazmyn J.", "My original review complained about how there wasn't an online ordering system.  I stand by that still - but I need to add that ordering by phone is not terrible.  I always get fast friendly service, and that can't replace a computer. What hasn't changed: The food is fantastic, and this place deserves to be a neighborhood favorite.  I get delivery from Great Wok at least once a week, and I've gotta tell ya - its always super hot, super fresh, and the delivery guy is always so friendly.  I can't recommend this place enough.The staff is so great - polite, helpful, and friendly every time I order.  The food is served in fantastic portions, and to order.  ( I have a food allergy that can be a pain.)This is the Chinese restaurant that Ahwatukee has needed for years!"]], "King Wong Chinese Food": [], "Mu Shu Asian Grill": [], "The Clever Koi": [["S R.", "I'm at the Clever Koi at least once a month. It always seems to hit the spot. My favorite is the chow mein with loads of toppings including the kim chi. The shrimp is large and always grilled to perfection. The housemade siracha are delicious. The pig face dumplings are out of this world with the right amount of spicy, salty, and all around flavor. The chicken and waffle bun made my eyes roll in ecstasy. (yes!! It was that good) The service is always friendly, attentive, and professional.I love love love this restaurant!!"], ["Tori B.", "My Husband and I went for our last date night before baby at the Clever Koi back in August. In fact, it was the night before Baby Boy arrived (not due to the food I assure you). The inside of the restaurant is very modern, a bit tight, so the tables are somewhat close together, but it really is well done. The patio looked nice as well, but we opted to sit inside due to the heat and the fact I was carrying a fully \"cooked\" baby.Anyway, on to the food... everything was delicious and unique. I don't think I've ever had food quite like the Clever Koi. The Hubs and I shared a noodle bowl and some small plates. As I recall, the noodle bowl was very spicy, so that was slightly tough for me, but the Hubs thought it was amazing. The small plates we had were so good, pig face dumplings were top notch. Can't wait to get back to the Clever Koi at some point, hopefully soon. This is a \"hot spot\" and the food surely backs up the hype."], ["Lauren H.", "So disappointing! We started off with the calamari fries and steamers. The calamari fries were okay, but the batter didn't have much flavor/seasoning. There was also no lemon or dipping sauce with them. Some sauce was drizzled on top, but overall they tasted plain.The steamers looked incredible and i really wanted to like them but they were SO SALTY. All i could taste was salt. I wasn't able to get past the saltiness of the dish.We then ordered two steamed buns - pork belly and chicken and waffles. The first thing i noticed was how small they were! My boyfriend could finish one in two bites. And for $4 each you'd think you'd get just a little more. The pork belly one was decent, but the chicken and waffles wasn't so good. The chicken was dry and the waffle bun was soggy and fell apart while you were eating it. The most confusing part of the plate was that it came with a side of dipping sauce? It was way unnecessary and didn't fit with either steamed bun we ordered. Lastly, we thought we'd try the scallop dumplings. Also looked pretty good when they came out, but were also extremely disappointing. I don't know what was in them, but it did NOT taste like scallops, or even seafood. The filling was dry and the closest thing it tasted like was chicken. The sauce on it was confusing. Did not meld well at all. I don't know what kind of flavors they were shooting for, but it was a complete miss.Our meal after tip was over $60 (including drinks). We left hungry and unsatisfied. The atmosphere was awesome and we were excited to try someplace new, but unfortunately we will not be coming back."], ["Jet T.", "Went there directly from airport because I read a nice review in WSJ.  I'm a big ramen fan having eaten it for years throughout Asia and especially while living in Tokyo.Like most other Asian or ethnic food in AZ, it was run by the local hipsters.  I again was the only Asian in the place.  Not a knock, just always feels weird for me.  Alone, I chose the counter, and ordered the local IPA and was served my ramen with pork belly soon after.  It was hearty and good, albeit small.  The girl at the counter was very nice, as well as the bearded beer guy.  I would return again for lunch."], ["Kristina G.", "I love this place! The ambiance is always happy and fun. I have tried a few things on the menu by my favorite is the Duck curry, it's full of flavor and the perfect amount of spice. The service is great and the owners always walk around and talk to you. It's a great place for a dinner for 2-4 people. During the day if it's warm enough the patio is a great place to hang out and eat."], ["Thomas L.", "I'm a little torn on this place.  My fiancee really enjoyed it, but to me it was ok.  I am a little bias cause I do come from a Asian family and we owned a family restaurant, so this Asian fusion is a little confusing to me.  The place had a nice environment and \"trendy\" but it's still all about the food.  I thought for the prices of the food, they sure do give very small portions.  If I told my parent's I paid over 14.00 for ramen, they would probably slap me!  I much rather have a big bowl of Pho that costs me 8 bucks, than the ramen that I had at Clever Koi. I ordered the Pork Ramen, which had two peices of pork belly, an egg, and some veggies, with very little ramen. The good thing is most of the food was flavorful and delicious, but just very small portions. The service was good, we sat in the patio, cause inside seating was over 45 minutes long!  So we sat outside with another couple.  We split couple of appetizzers and buns, and each order a ramen dish.  With couple of drinks, the bill came out to over 120.00.The sad part is when we left, I told my lady I am still hungry, not just a little but a lot.  I felt I could eat another meal, so on the way home we stopped and picked up a Sonoran Dog and called it a night.Overall, this place was pretty good and had flavorful food, but for those prices, I rather go somewhere else."], ["Lanni R.", "One of the reasons we couldn't give five stars is the price of the drinks- $9 for a well vodka water! The lemon chicken ramen was delicious! The seasonal veggie panang was good, but my personal preference would have had it with a little more sauce. The burrata appetizer was to die for! Our waiter recommended it to us and we would recommend it to anyone! The banana fritter dessert was really good too- different but tasty! The martinis were very well made but as mentioned, pricey. Cool atmosphere and attentive service."], ["Stacy M.", "Fab lunch here this week. Started with the chicken & Waffle (steamed bun style/taco) hot, fresh right off the stove. Also I sampled the pork belly bun--YUM Lunch was a bowl of ramen $5 then you add your add-ins egg, pork belly, Bok Choy w/many other options as well. Overall everything from the service to the food was very good. I want to try some cocktails one evening in the near future."], ["Kelvin H.", "Well fed and slightly buzzed...I have given this place three times to disappoint me and they have failed, miserably, all three times. This place just rocks. I have had the seafood pot which was out of this world, the chicken pot which killed it with the jelly, and tonight I found my signature dish and cocktail the kimchi rice bowl with chicken and shrimp with the \"word is bond\" martini...kicked my ass in flavor, portion, and buzz potential. All thanks to Alexandria with the on point recommendations. This place is a great date night or a cool spot to come chill with that special someone.  You simply must go and go again. #newloyalcustomer"], ["Erica G.", "Coming from a woman to loves Asian fusion and ramen, I thoroughly enjoyed this spot. Only problem was the service which was VERY slow! Read my pro and con list for more info: Pros:-The Asian-fusion food is delicious and healthy for the most part. I got vegetarian ramen noodles with tofu, which I loved and would order again! -Very modern and trendy atmosphere-Wonderful feng shui - the light, decorations, and greenery uplift me -Convenient parking  -Reasonable prices Cons:-Service was slow and unapproachable  -Food took very long-Very busy during lunch -- was hard to get a table, be served, and get our food"], ["Donna B.", "Excellent meal and very nice ambiance.  My fiance and I ate on the patio.  We started with a special grilled octopus appetizer which was good.  He had the wood grilled octopus.  That was amazing!  Such a wonderful broth, and the seasonings were delicious.  He also had an old fashioned which was made well.  For dinner I had the seasonal vegetable plate.  The yams were perfect.  He had the pork ramen with gluten free noodles.  This is wonderful for him with his gluten allergy.For dessert I had the chocolate pudding.  I really did not care for it at all, too sweet and not much flavor.Overall, a wonderful place.  We will go back!"], ["Michael D.", "For those of you that think Friday is too busy you should come out on Monday. It was comfortably packed and the ambiance was nice and calm. We had all of the happy hour specials and they were fantastic. The green beans with the duck tongue was an interesting experiment but we thoroughly enjoyed it. The burger with the kimchi and cabbage was tasteful. The pork udon soup was flavorful. Another review said the noodles were packaged like, but they were fresh and toothsome, which is al dente or semi firm the way noodles should be. Chicken wings were just the right amount of spice. All the waitstaff were pleasant and helpful. Enjoyed watching the wood grill being worked and the bartender looked skilled."], ["Christina N.", "Great little spot on Central!  My husband and I have been meaning to try it for a while now and we finally made it in last night.  It was 8pm on a Saturday so needless to say they were busy.  But we were seated right away at the bar so we didn't have a wait.  Our bartender/server was awesome and I'm glad we made the choice to be seated at the bar.I had the \"hey bartender\" and my drink ended up being a tasty concoction of gin, basil, and lemony goodness.My husband had the grapefruit soda and that was really refreshing with the right balance of tart and sweet.We loved our shrimp and chive dumplings so much that we ordered another round of dumplings and tried the pig face dumplings.  Also good!We split the pork ramen and it was pretty good, as well.  A little salty but I'd prefer the broth be a little savory instead of bland.Overall the service, food and energy were great.  Can't wait to go back for more."], ["Eileen G.", "Good but not good enough for us to want to return. My husband and I had been scouring yelp to find an amazing restaurant for our anniversary and stumbled upon this place due to the reviews. Located in a really cool building with lots of rustic wood and glass displaying the kitchen and dining area. I loved the \"sushi bar-esque\" seating in front of the kitchen where you could literally watch them making your food. I had such high hopes upon reading rave reviews and arriving at this place but the food and service did not back up the aesthetics.We were told to wait upon arrival because they needed to \"reorganize\", even though there were plenty of open tables. We waited about 10 minutes to be seated without being offered a menu or drinks. When another couple came in and was immediately seated I asked why we were skipped and she said they had a reservation and she was just about to seat us anyways, coincidentally. Would be nice if their website advertised/allotted reservations so I could have done the same. Not one time while we were waiting though did I see any \"reorganizing\", or moving of tables in the dining room.Upon being seated we were handed menus and I have to say there was a great variety of dishes on the menu that you don't see often. Pig face dumplings and steamed bun assortments.  That was exciting. I ordered the Tofu soft bun and my husband ordered the Softshell Crab and the Pork Belly buns. As we went to pick our buns up from their holders, the outsides of the buns were stuck! Most of it was torn and stuck to the holders which was disappointing. Maybe lightly oiling the holders or having non stick holders in the future would prevent losing some of your bun. Overall good flavor and definitely the highlight of the whole meal. I would almost suggest ordering a variety of those as your meal, asian taco style.Main entrees consisted of the Roasted corn Ramen for myself and the Seafood Hot Pot for my husband along with plenty of their handcrafted cocktails. 2 bartenders for the whole restaurant was probably not the best idea. We waited a long time for drinks, 15 minutes or more sometimes and thats only because we had to flag down our waitress whom looked a bit lost. It was confusing as well because almost every item was brought by a different waiter/waitress which made it hard to connect with our own server.Roasted Corn Ramen was rich and creamy with great extraction of corn flavor.Just wish they had either allowed me to add the tempura corn on my own or left it to be plated on top last minute because it was really mushy in the ramen once it reached me and lost all of its crispy crunch. Seafood Hot Pot was lacking in seafood. You can't call something seafood and only put out 2 types of seafood. They should call it shrimp and octopus ramen. Thats what it was. Flavor was there though and the homemade srirachas were a great touch. All in all it was good, not great, no hard feelings but they should focus more on the basics than what will look cool and different."], ["Connie L.", "Missed happy hour by five minutes, but food was still good. The portion size was okkkk...and you can tell something technical was done to simple foods to bring out the flavors. Soft crab bun was tasty but I couldn't get over the appearance of the crab in the bun... Duck bun was good. Would come again just for that.Veggie plate was well seasoned but... $10!Ramen was flavorful."], ["Cindy C.", "I hardly EVER give 5 stars but this place knocked it out of the park  :)I met up with a good friend recently to catch up over cocktails and try the bao.  I love those things and was excited to try them We started out with the chicken wings and they were super tasty ..sticky, meaty, and sweet & spicy.  We polished them off quickly, saving room for the next course There are several versions of bao.  We took the plunge and decided to order them ALL!  All were delicious and many were vegetarian.  My favorite is the crispy tofu.   Soooooo yummy!We couldn't leave without dessert....We ordered the bananas foster, Asian style   Again, completely delicious!The cocktails were nicely crafted and fairly priced.  The building and actual restaurant are nicely lit and make great use of space The bottom line is that the food is cravable, the service is great, and  the location is close by  so try it, you'll like it!!"], ["John S.", "Has ANYONE eating here heard of chef David Chang? Out of those folks who has actually eaten @ Momofuku? I dare to say (as a chef myself) that the vast majority of technique and flavor development are straight out of David's MOMOFUKU cookbook. From the ramen to the (specifically) pork buns. I am never critical of using other chef's techniques, but in this case its a straight rip off without so much as a simple credit being given. I've made the argument a million times that \"fusion\" is nothing more than \"CONfusion\". Its not so much about the flavors themselves, but their composition  in regards to the overall dish. Does a bowl of soup really benefit from 4 techniques and 6 flavor profiles spanning 4 continents? Here you get very confused and anorexic portioning coupled with muddled and unclear flavors. The presentation is good enough but for the price I was left wanting. The service was exactly where it should be on the \"hipster\" index. I'm confused as to when exactly in our time service became a luxury... but I digress. Food was dropped off with no explanation of technique or procurement... nor were pairings offered for the food in regard to drink or appetizers. When prices exceed 100 for a pair to eat a normal amount of food the gold standard should'nt be a suggestion, it should be the rule. I doubt this place will be vying for a Michelin star any time soon based on what I saw. I doubt they will even receive accolades in the form of diamonds or stars.I love seeing the community stepping up in Phoenix, but I despise seeing \"straw men\". It's probably the potential being wasted on the talent employed here that has me so worked up... I expect more. Phoenix is a wasteland of food. Too long have the corporate ass-hats peddled their mass produced wares without allowing for any options. The landscape is pallid and bleak... soaked in the beige homogeny that has come to define this area. I was hoping we had a chance at something unique and wonderful. Instead I got disappointment and a bad taste in my mouth. These guys had a real opportunity but I don't see it being developed by the shot callers @ Clever Koi.This review is simply about the food and my suspicions of plagiarism on behalf of the leadership @ Clever Koi. Its just my opinion based on experience, nothing more."], ["Anthony N.", "This place was great! We actually were hesitant to come for a very long time because my sister said she wasn't a fan at all. On a whim my wife and I decided to give it a shot and really enjoyed it!We came on a Saturday night around 8pm. It was full but since we were just two, we sat at the bar which has full service. The bartender who helped us was very nice and helpful. He made some suggestions for us but wasn't pushy about it. My wife ordered a \"Hey Bartender\" which is a custom drink based on your preferences which the bartender asked her about. It was tasty. I ordered their house grapefruit soda. Also awesome and refreshing! For appetizers we ordered the shrimp and chive dumplings as well as the pig face dumplings. The shrimp and chive were our favorite of the two but the pig face was definitely unique and tasty as well. For dinner we ordered the Pork Ramen to split. This is where I could see where my sister thought it was salty. However, I like salty so I'm not a good gauge. My wife really enjoyed it as well and said she'd rather it be slightly salty than bland. Overall a great experience! We will be back for sure."], ["Jon H.", "I don't know how to classify the food at Clever Koi... Chinese? Japanese? Dirty knees, look at these? I don't know... but what I do know is that what ever they're doing, they're doing it right. I first came to CK about a month ago and it nearly, instantaneously became one of my favorite restaurants in PHX.The Food: The first thing that stood out were the Steamed Buns. I love steam buns and the ones here are very good. I think I've now tried all of them. The chicken and Waffle as well as the Duck stick out in my mind the most so I would say try those but none have disappointed. As far as entree's go, I've had the Sweet & Sour (Chicken?) Rice Bowl... I thought I had pork but the menu on their website says it's chicken so whateve's, either way it was delicious. The next time we came, I had the Mongolian Beef rice Bowl... I think the website menu is wrong because I don't see it on there but I know that's what I got because it was just last night. It was great but what sticks out in my mind is the thin slices of something... some kind of garnish perhaps, but either way this stuff was wriggling like they were alive... it was freaky and kind of cool at the same time. PS... it wasn't alive... The Dranks:They make Great cocktails.... The first time I tried the Guns N Rose' because... yeah GNR is the greatest band ever... A nod to CK on the naming... ya got me. It was very good. Not something I'd drink all the time but good. I think the other drink I got was the Rye & Rum Old Fashioned... again, very good. I could have drank these all night long and then later made very questionable life choices.They also have a very good craft beer selection. On my second visit I went with the THAT Brewery Road Rash IPA. I like when restaurants have local beer offerings and there were quite a few the night we went.Let's Wrap it Up: I didn't mention above but the presentation of the food and drink are very nicely done. Attractive without feeling pretentious. I love that. It's a cool place... the atmosphere is very chill and the service has been excellent both times we've been here. All that said, I guess it doesn't really matter how you classify Clever Koi. At the end of the day, the only box they fit in for me is the box labeled awesome places to eat and drink in Phoenix. Cheers!"], ["Megan P.", "The Clever Koi will reel you in with its soul satisfying ramen, cleverly named and crafted cocktails, and modern decor.Walking up to the restaurant, past the artful logo painted on the facade, you'll find large glass windows through which you see trendy Asian inspired interiors abustle with activity. Whether you are in a group or on a date, find yourself a seat and ready yourself for delicious food and drink. The menu has an array of choices from small bites like steamed buns or Brussels sprouts to bowls of piping hot ramen. I settled on the cauliflower ramen with picked persimmon, cashews, and a soft boiled egg, which came on the side in a small bamboo dish. Oh lawd- the silky coconut milk broth, tang of pickled persimmon, tender crunch of cauliflower, and rich egg yolk came together in harmony in each bite. Let's just say there were zero leftovers. The experience was made complete by the excellent bar program with drinks like the Enabler- a delightfully rustic sipper with hickory smoked whiskey, grilled lemon, bitters and maple syrup. The sweetness from the maple played off the smoky whiskey in perfect balance. There are wines and beer too for the those not fancying the hard stuff.By all means, when in Phoenix, step into the Clever Koi for an enjoyable and satisfying  evening"], ["Janet N.", "Trendy, modern type of restaurant that serves Asian fusion.I had a hankering for some ramen and saw that TCK did a version all their own and decided to try it out. Luckily, it was also happy hour so I got to go for their Pork Ramen priced at $8. I sat at the bar and it was pretty empty, even for happy hour.The Pork Ramen came out with roasted palm hearts, kimchi, roasted pork belly, green onions and a soft boiled egg garnished with Togarashi. The broth is not Tonkotsu, but pretty simple. I enjoyed the ramen noodles as they were thick with a good chew. The pork belly was good, a bit tough but had this great roasted texture on the outside- almost crispy. Soft boiled egg was good! Perfect portion for ramen as well! Service seemed lacking, but I was checked up on. Probably due to the place being a bit slow at the time, I mean I did seat myself since nobody was at the store front. Haha!Decent food, would've wanted a more complex broth but interested to see what else they have to offer. Their drinks look pretty awesome too!"], ["Amanda L.", "There was a phase in my life where I came here basically every week, because I've never had ramen like what I found at Clever Koi.Whenever I tell my friends that there's a place where I'm willing to pay $13 for a bowl of ramen, I get weird looks. Probably because they think I'm talking about the twenty-five cent college stuff. But no--this is a large bowl of pork broth with pork belly (I swear, it's just giant chunks of bacon. Don't be scared of the word \"belly\"), amazingly boiled noodles, a soft boiled egg, spices, crunchy veggies and deliciousness. And don't get me started on their chicken and waffle steam buns. Or their pork belly steam buns. Or their rotation of tap beers. Or the steaming seafood hot pot. Literally ALL of it is delicious.If you're looking for somewhere to go on a date night, or for happy hour, or lunch--look no further. Go to Clever Koi and understand what I'm talking about."], ["Larissa W.", "I like to research a restaurant before trying it and I was super excited to eat here. I went there tonight with my bf and all in all, I found it disappointing.They cram the people in like sardines, with tables literally having maybe a foot in between one another. It was also incredibly loud. So much so that we had to ask our server repeatedly to reiterate what he was saying while also hearing the conversations, word for word, of everyone in a ten foot perimeter. How romantic.Now to the food. I got the Kung Pao Wings and what I received was...odd. Here I was thinking they'd be like every other chicken wing that I've had at a restaurant. Nope. They serve you the ENTIRE wing: tip, joints, and all. So you get this big, awkward, boney wing with sticky sauce all over. So as I'm trying to figure out how to eat this thing, the sauce gets everywhere; only part of the wing itself is crispy and the other part is fatty and mushy, and overall it was the biggest letdown of the night. I love chicken wings and this was a big disappointment. Staff of Clever Koi: warn people when ordering this dish! My server saw my struggles but clearly did not care or try to make things easier. Thanks man.Next I got the Pork Belly ramen and my bf got the broccolini and beef. The ramen was okay. In my opinion there were too many flavors trying to vie for attention and not all of them were good. The broccolini and beef was delicious, although there were maybe only 3 pieces of beef in the entire bowl. Being a foodie, I hate expecting good things from a restaurant only to be severely let down and out a good chunk of change. Not sure if I'll be back."], ["Victoria S.", "Wow this is the best chicken broth I've ever had ! Seriously I don't know how they do itIt's magical.  I took my little 92 year old grandpa and all he could say was wow this is delicious so fresh & beautiful.  The lunch bowl was pretty large we couldn't finish it, they will charge you for extra broth but it's worth every dime.  The broccoli was fresh and defiantly al dente I can't stand when veggies are limp and loose color that indicates to me that they at are over cooked. The bathroom was clean and Nicely decorated.  We tried the banana fritters which were very tasty ! Crunchy on the outside rolled in a light sugar nice warm and fluffy on the inside filled with fragrant bananaFive little balls come in a servingI live kind of far from there but I will most certainly be back"], ["Justin C.", "I love The Clever Koi.  They have a killer lunch special - a $5.00 bowl of ramen.  After putting all the fancy stuff in it (meat, egg, bok choi, etc) - it comes out to a still-acceptable 10 or 11 bucks. Delicious. Also, the pork belly bun is also excellent.Every time we've been there, we were greeted warmly by the owner and had good service at the bar. The bartenders are also excellent there. I really like the French 95(?) cocktail - a mix of champagne and whiskey. Weird but mighty good.  They have a good discount on cocktails at happy hour, too.  Hands down, the Clever Koi is great stuff. I go there as often as I can!"], ["Millie H.", "Been in here three times now. The service is always good and the food is phenomenal! You can tell the owners really put a lot of work into creating great food and a fun vibe."], ["Lana H.", "I love the Clever Koi. We normally get the lemongrass chicken ramen, which is my favorite, and my boyfriend loves the salt and pepper soft shell crab. Normally we pair those with some small dish items (sticky buns, dumplings etc.). The make incredible cocktails that take some time to make, but are worth the wait. The staff is really good at recommending drinks based on your likes. Everything we have ever had is delicious. Most the time we would get irritated at the price per portion for some of the items, but the flavor makes up for it. They also have some awesome weekly specials - two entrees and drinks for $45+. Was worth it for us."], ["Dri N.", "This place is descent but not really if you are Asian or have an Asian taste pallet. The best was the pork belly bun the only... Only reason I'm giving this place 3 stars...    Granit this place does get packed but to get your food takes some time.   Id say this place is fun hang out spot if you can hear well and talk loudly"], ["Courtney P.", "The service is so good here. Beautiful drinks and beautiful bar. And beautiful food! Edamame corn fritters were amazing, loved the sauce. Avocado and tofu bao were great. Wish there was a peanut sauce! Liked the flavor of the corn ramen but don't love the consistency, I wish they had a vegan/vegetarian clear broth rather than a purée type broth. Tofu chow mien was off the charts. Our server Bryce was so helpful. so veggie friendly it's almost overwhelming! Coming back always"], ["Carlos C.", "Amazing first experience at Clever Koi.  I ended up ordering a brandy and blackberry cocktail named the Little Sheba...pretty delicious. I had the roasted corn dumplings to start and then dug into the shrimp and steak chow mein. I was stuffed but felt a review would not be complete without an amazing dessert. So I went for the bananas foster fritters.  Let's just say they didn't disappoint and I'll be starting my new diet in the morning.  As a matter of fact I may come back just for those fritters. All in all a great new spot for me.  A little far from home but I am starting to venture out and check out new places. I highly recommend this spot and ask for David at the bar.  Great recommendations."], ["Teresa S.", "This is a cute little place that has not been here too long. But, I am happy they are here. For so long Phoenix downtown has had nothing. So it is great to now have some cool choices around town.First off the Restrooms in here are delightful. There are 2, they are large, and nice and clean.The parking is a little tricky if you don't know the neighborhood. Best parking is around the back. You have to turn down a side street to get to it. Follow the parking for George and Dragon, that makes it easier.I met a friend here for lunch. While I had parked around the back, she does not know the area that well and ended up parking far away.  But, we came after the lunch crowd, I think it was around 2 so it was not very busy.However ,we did wait a long time for our check and such. Anyway, when I first arrived there was a delightful young man who was so helpful and friendly. I told him I had never been before. So he was kind enough to explain everything to me. About ordering ,where did I want to sit, the food, etc.However, he was through with his shift so we had a different waiter. Still good though.Lunch is a reasonable price. However, I do not recommend if you are in a hurry. Such as your lunch break. It takes a long time to get your food.For lunch all you can get is Noodle bowls. Though you have many noodles types to choose from , as well as different meats or Shrimp. As well as you may add vegetables to it as well as your own type of broth.It was very good, and everything tasted extremely fresh!I am really looking forward to checking them out for dinner. Very beautiful inside as well. Simple ,yet stunning. I liked it a lot!"], ["Mark C.", "Peer pressure can be a powerful thing.  Particularly when a peer keeps prodding you to pay of a visit to one of their culinary favorites.  Despite such efforts by her and other peers in the past, I've learned to always temper my expectations and go in with an open mind.  Oh, I do my homework in advance of course, but I've learned that everyone can have a favorite that might not mesh with my palette the same way it does with theirs.  In the case of Clever Koi however, there's more than enough great food and drink (as well as great vibes) to satisfy me and all of my peers.Clever Koi occupies one of a pair of newly constructed modern commercial spaces along Central Ave just a few blocks north of Indian School.  In one building lies Central Wine Bar and Model Citizen Hair Salon.  In the other lies a beautifully outfitted restaurant with windows galore, a picturesque outdoor patio overlooking Central Ave, and modern furniture throughout.  But if you really wanna see be where the action is, do yourself a favor and sit at the bar like I did.  Besides the bartending staff mixing up drinks and commiserating with the customers, the owners (yes, the actual owners) are cooking up all of the restaurant's signature dishes in an open cooking area right up front complete with a smoker, a grill, and full prep area.  All of it right there to see, smell, and tickle your senses.I came during happy hour when a number of their drinks and signature dishes are discounted.  I actually tried a couple of their cocktails including the Fish House Punch and the Old Fashioned.  The Punch included rum, cognac, lemon juice and peach schnapps and had what looked like a little spice blend on top and was served in a clear tea cup.  Odd presentation, but a very refreshing drink.  The Old Fashioned was a pretty typical rendition, though I think there was a hint of brandy to go with the bourbon that gave it an extra kick.The Asian steamed bun dishes aren't discounted for happy hour unfortunately, but past experiences at places like Nobuo and Adobo Dragon have taught me that good Asian steamed bun dishes are not to be missed.  After struggling to pick two I took the bartenders advice and ordered three (I might've been a little buzzed at the time, but I digress).  I went with the duck confit, chicken & waffles, and soft shell crab buns.  The chicken & waffles one is actually a piece of syrup covered chicken inside a waffle with kimchi flavoring, so not a true Asian steamed bun in the purest sense.  It was weird to gaze upon at first, but pretty tasty.  The soft shell crab also has an odd appearance as the entire crab (claws and all) is there in front of you topped with aioli and cucumber, but that crab was delicious and I loved the fish sauce they put on it.  But my favorite byfar of the three was the duck confit.  Ridiculously tender duck and plenty of it complimented by a lightly sweetened plum sauce.  If you're coming here for the steamed buns, by all means be sure to include the duck confit.For the main event, it was time for a noodle dish since that appears to be Clever Koi's main calling card.  On their Happy Hour menu is arguably the one noodle dish that probably gets more Yelp mentions and more compliments than any other.  The Pork Ramen.  Pork Belly, Kimchi, Hearts of Palm, a hard boiled egg all topping a bevy of noodles.  First and most importantly, the broth for this dish is out of this world.  I could've slurped the broth and been completely happy with this dish.  Seriously, the tender pork, soft noodles, and other cast of characters were a bonus, but the broth is what makes this dish.  To complete the evening (despite being completely full), I shared an order of their banana foster fritters.  Basically cinnamon covered donut holes with banana filling inside and a caramel sauce to dip them in.  Yup, they're as good as they sound.  I only had two since I was already full beyond belief, but it solidified the experience for me at this CenPho gem.It would be safe to classify Clever Koi as Asian Fusion, but aside from that there's no one description that encapsulates the theme of this place.  From their vast bar selection of drink and mixed drink choices, to their innovative take on Asian steamed buns, to the complex flavor combinations of their noodle bowls, Clever Koi is unconstrained while still being authentic.  And the modern aesthetics make this a great place for a date, a group outing, or just hanging out with friends at the bar.  Total tab for me this night including the two cocktails, 3 steamed buns, ramen bowl, fritters, tax and tip came to about $50.  The prices for the pork ramen and cocktails were discounted quite a bit for happy hour so I would certainly recommend coming here around then.  But as I said earlier, even if its not happy hour, I recommend sitting at the bar.  And let owners Joe, Josh, Jared and Nick make your experience as memorable as it was for me."], ["Karla K.", "Ok...now I am and will remain, out of my comfort zone.  We had the most fantastic, knowledgeable (and major hottie) server, David, who just took us there. The driver on the journey to food utopia.Every single thing he recommended, we went with and OMG. Just wonderful flavors, excellent drinks...aaaah!We started with the Pig Face dumplings...sweet baby Jesus! Sooo amazing. Followed by the Shrimp and Chive dumpling...speechless. We just sat there, floored. Then was the Pork Belly steamed bun...Man oh man...not one thing wrong with it. Just perfect.The one mediocre choice was the one that I came up with and, well, we won't talk about it.  Moving on, we topped it off the with Kimchi Fried Rice...with shrimp and...(wait for it).....pork belly! My date was being so fancy with his chop sticks. He all but threw those things on the floor and grabbed the fork for more efficient rice shoving...heh heh heh. Very, very necessary.  Probably the best fried rice EVER.Please see David (he has a man-bun) as your driver to paradise. This guy knows his stuff.Go here. Eat here. Get uncomfortable. It will be the best thing you do all year."], ["Andrew S.", "Amazing cocktails....sloe burn a real winner.Delicious appies too!Service very friendly, professional, yet super fun!"], ["Leslie M.", "I've been wanting to try Clever Koi in forever and finally decided to go for happy hour. The parking lot is tiny, but looks like there is valet later in the day. The restaurant is next to some type of salon and wine place. We got sat at the patio and I love the decor - trendy, earthy, and very relaxing. Our waitress wasn't the sweetest by any means, but we made due. We ordered the pork belly and duck steamed buns, the wood fired grill plate with steak, and the shrimp toasts. The pork belly steamed buns were good, the duck was not - way too dry and lacked flavor. The wood fired grill plate took forever to get to our table, but it was just ok. The shrimp toasts were ok too. We were full and had not left much on the plates for a doggie bag.All in all - I definitely am happy that I came to try it out, but this whole Asian fusion trend is not working for me. Yes, I get the \"trendy\" ambiance, but I guess I expect what I grew up with at asian restaurants - big portions, lots of flavor and sauce, reasonably priced, and you leave with a doggie bag!"], ["Isla B.", "Clever Koi is best!!! I've been here once a week for the past couple weeks and I can honestly say it gets better every time. Everything is amazing...ambience, service, food. I recommend sitting at the bar where the chefs are preparing the food rather than a table. What an awesome interactive experience. We order something different every time and I've never had anything that wasn't incredible, both in presentation and taste. I love this place because of how unique and fun the experience is and I leave feeling beyond satisfied. Always a pleasure, already looking forward to next time!"], ["Daniel L.", "This Asian fusion restaurant has created quite a buzz with their steamed buns and happy hour menu. The frontal open patio can be a great place for hanging out and people watching during the not-so-hot seasons. By extension, the modern, immaculate interior encompasses large see-through glass windows, full bar, rows of tables, and touches of Asian artifacts. The atmosphere is completely hipsterish. Fellow Yelper Tony Y. Jr was in town for a visit, so we stopped by for happy hour and a light meal.The Roasted Pork Belly Steamed Bun ($4.50) was served with hoisin, cilantro, and peanuts. The soft and fluffy steamed buns were addictive, but they were also pre-packaged and not made from scratch. The pork belly was tasty, but could be steeped in seasoning and roasted for a longer period of time. The touches of sauce and garnishes added some depth. It was a decent option, but the taste of the pork belly has to be more striking than it appeared. The Peking Duck Steamed Bun ($4.50) was put together with bacon, mizuna, and charred plum jam. The dry spots on the duck tasted oven baked with confit-like textures. The depth of seasoning was lacking the deep star anise flavors. The sauce and garnishes gave a nice savory and sweet contrast. Again, the duck should be a lot more robust and flavorful to add twists to the soft fluffy buns.The Pork Ramen ($7) comes with braised pork belly, ribs, scallion, mustard green, kimchi, hearts of palm, and poached egg. They recently raised the happy hour prices but should really kept it at $5. The pork belly had a good fatty to meat ratio, but the broth was steeped with mustard green flavor that prevented the pork fat and shoyu to anchor the chewy egg noodles. The runny poached egg was a Western cop out on what is supposed to be soft-boiled egg. For what it is worth, I would only pay $5 for it. I've been here on many other occasions and service was attentive on most of my visits. I didn't get to review their other menu items, but there was overall a breadth of originality that did not translate into the kinds of sharp flavors, depth, refinement, and wow factors expected in the execution. 2.5 stars, I will only return when I'm invited to come hang out with friends."], ["Allen W.", "It's not just about amazing food - The Clever Koi has become an important spot for midtown & for Phoenix. The chefs and owners came from The Parlor, another institution but the Clever Koi also sources local produce and adjusts the menu by season. The food & cocktails are highly inventive, to say it is Asian Fusion\" isn't really right - they do their own thing. Being on the lightrail and next to the repurposed community Park, The Clever Koi is on the map & so is midtown."], ["Amanda K.", "What isn't great about this place, really? I've been here 3 times now and I have yet to be disappointed. The food is delicious, they have a wooden grill inside that you can observe them cooking on. The specials of the day are so great, but they go fast! There are so many different routes to go down to experience the flavors of their menus, so I recommend going with some friends so you can try a little bit of everything!"], ["Francesca M.", "The Clever Koi is it. The true 5 star restaurant. My husband and I have been here twice and we both agree it is truly our favorite restaurant in the Valley.Location is awesome. While parking is not the best (most spaces are \"reserved\" for George and Dragon patrons only), we always have managed to find a spot fairly easily. If not, they always have valet available. Ambiance is fantastic. Love how it's decorated, the interior design and lighting are great.Service? Some of the best I've ever experienced. David has been our server both times and I cannot say enough wonderful things about him. He's so friendly, attentive, and incredibly knowledgeable about not only the food menu, but the drinks as well. He can explain every single ingredient of the drink menu to you, from chartreuse to Pimm's to anything else you may not know. If I've had a sweeter, more genuine server, I cannot remember when it was. He remembered us from our first foray in and made sure to say goodnight to us as we left (and let us know the new menu would be coming out soon, yes!). The general manager (who has been there both times we have) is always super friendly as well, running food and always making sure everyone's happy. The bussers are great too (waters were always kept full) and the place runs like a well oiled machine.Drinks were awesome. My husband ordered one that ended up being fairly strong, so David came by and did a few revisions to it, making it absolutely delicious. I had the Temperance Trap (awesome), one of my girlfriends had the Paloma (also awesome), and another friend had the homemade Green Apple soda (a special for the night), which he loved.Okay, so now onto the food.Ohhhh, the food.Blue Lake Green Beans. Every person at the table said the same thing (both times): \"how can you make green beans taste THIS good?\" Answer from David: the woodfire grill, of course. Apparently in the winter there are brussel sprouts instead of green beans, so I can't wait for it to get chilly again!Things I didn't eat but was told were amazing: the chicken and waffles and  pork belly steamed buns, pork ramen, chicken ramen, and chicken chow mein. All six of us last night were \"mmmm\"ing through the meal. Both times, I've ordered the vegetable chow mein with tofu. So. So. So good. The tofu is cooked on the woodfire grill, the vegetables (especially the mushrooms) are marinated in some blend of spices that are so delicious that one of my fellow diners had to try some out of another's bowl. For dessert... well, we went a bit dessert crazy. David let us know there were a few new desserts: a chocolate pudding with a cashew nougat and a citrus soft serve, in addition to the bananas foster fritters. It was my husband's birthday so we thought \"what the hell\" and ordered all three. And I am so glad we did, because they were all delicious. Throughout the meal David came by to ask us how everything was, to chit chat with us and make sure we knew he was available. We absolutely loved talking with him and appreciated so much that we knew he wasn't too busy for us (even though he was definitely busy!). I can't say enough good things about Clever Koi. Now I can't wait for the new menu to come out, so we have another excuse to go visit!"], ["Han H.", "It is kind of Japanese fusion food. If you expected to try authentic Japanese food, you will be very disappointed. I tried the pork ramen noodle. It tastes really weird-- a combination of bitter and sour."], ["Robert G.", "The food is excellent but the price you have to pay and i think you dont get much which was a litrle disappointing, the drinks are great but a litrle on the high side.Noise level is high, not a romatic ave, but its like a football game is going on,.but its ok.Over all, i ordered the kimchi with rice, if i am going to pay 13.50, i need the bowl at least half full, just have been to mant places.and they just dont give you enough, the bowl was 1/3 full! Not!!"], ["Nicki E.", "Despite what its name implies, at least what I thought I'd be getting, The Clever Koi in downtown Phoenix does not serve sushi. It does, however, serve really tasty Asian noodle and rice dishes, and I was pleasantly surprised to love my meal even though I usually am only a Thai and sushi fan when it comes to Asian eats.The hip spot has a patio overlooking Central Avenue, with the \"dings\" of the light rail creating the soundtrack to your dining experience if you choose to sit outside - which I love doing. Inside, an open kitchen and bar complements a bustling atmosphere with tables in cozy confines that make neighboring diners your friends.My pal and I took advantage of the $30 special, which came with a jug of spiked punch, a fruity concoction made with Japanese rice wine, pineapple juice and other fruit flavors. I could tell by my buzz it was strong, but you wouldn't be able to tell by the sweet flavor of the drink, which was refreshing and delicious.It was the perfect way to cool off the palate during my meal of vegetable chow mein, which was very filling with a ton of noodles and veggies. I loved the house-made sriracha sauce and also added soy sauce. I cleaned up my bowl, no problem. My only disappointment was I wasn't able to take advantage of the gluten-free noodles in my dish - our server said with the veggie chow mein, that wasn't an option.My pal got tofu fried rice, which he also enjoyed and ended up taking half of it home - his portion was also very generous, so I guess I was just hungrier. Our server said the tofu is marinated, which makes it extra flavorful, and my pal agreed.The staff was really friendly, but it was a bummer it took about 10 minutes to get hot sauce and soy sauce after our food was delivered. Other than that, the happening spot had an energizing atmosphere and made me like Asian food more than I ever thought I would."], ["Felipe M.", "I don't know why this place has only 4 stars!It's the real deal. Drinks were awesome! Prices reasonable. And food was \"WOW\" factor. Like literally every bite was great! Must taste for yourself."], ["Rachel R.", "So I'm trying to be a douche and park at George & Dragon, because I hate all things valet (it's complimentary, you just have to pay for it!) The valet sees me and is all, \"Hey, are you going to Clever Koi? You can't park there.\" And I'm like, \"Oh, you just assumed I'm going to Clever Koi?* Where do you get off, buddy?\"** But yeah, those sneaky buggers will totally corner you into valeting, tail betwixt legs.*I said literally none of this.**I silently complied. Moving on, it's happy hour. I order only full-priced drinks because I don't understand money. Fill Collins and Slippin' Jimmy are both exceptional, and I would've drank more if I didn't have to go to another thing to drink more after. The server, noticing our enthusiasm (and dashing good looks) recommended we sit at the bar and get creative with the bartender, which is 100% on for next time.Edible portion: - Highlight was also not an HH offering - chicken and waffles, featuring taco'd waffle filled with saucy chicken.  - Blood orange chicken wangs: sounds more creative than it is. Saltier than expected and served with ranch, you get three full bird arms in an artsy little stack. A great option for your friend who wishes you were at Pei Wei and a sports bar.- Yams o'brien: cubes of Japanese sweet potato with sriracha aoli, also much more normal than I had in mind. It's a fun and easy activity to mindlessly eat the whole bowl, but not essential. - Seasonal vegetable plate with steak: maybe I hate Spring, or vegetables, but the asparagus, beets, and kimchi didn't really do it for me. I liked the yams, but I'd already eaten like, 14 cups of yam by this point. I would pass on this in favor of several more chicken waffles next time. - Honorable mention: server candy! Man buns, septum piercings, gauges, and tattoos galore. The waiters were 104% more fun to look at than the guests.5 stars cocktailery & server candy, 3.5 star food. Come for happy hour, stay for the other stuff."], ["Alfredo S.", "This place is one of the few that I have been to that serves great ramen, along with other amazing menu items.  I had a chicken ramen, with lemon grass broth, the flavor was amazing!  My most recent visit I was accompanied by a friend who happens to be vegetarian, their menu had more than enough options for him which was great!  They also off Gluten-free options. Will definitely continue to stop by!"], ["KK G.", "Food is amazing! Great place, we defintely will  be coming back."], ["Jason S.", "From the time we walked in until we left I was 100% impressed. The simple yet broad lunch menu was perfect for a casual Friday lunch. My guest had never explored this type of menu and David gave him a proper tour. Cheers to an amazing spot that I will be returning to!"], ["Kevin H.", "On a recent visit for lunch I left quite underwhelmed. In fairness, the lunch menu differs from the dinner menu, and I used some persuasion to get a taste of two of the items off the dinner menu. Having said that, I feel like my critique is not quite fair, since they did make these dishes while not technically available. I suppose if they could not execute them, they could have just refused my request. They did draw the line at these two dishes.Anyway, I thought the pig face dumplings were a great concept. I really dug the smoky flavor as it is something quite unique in terms of this type of dumpling.The pickled veggies and hot sauce were a nice touch to play off the smoky filling. Could have used a bit more crunch to the pickle.  The edges however were quite dry and brittle. Also sampled the duck bun. I found the bun to be a bit dry as well, the filling had a nice flavor if not a bit shy.From the lunch menu we sampled the crispy pork bahn mi. Nicely fried piece of pork, on what reminded me more of a pretzel bun than typical french baguette. The pickle served on this sandwich was quite limp and lacked flavor as well. The star for me this day was the hot and sour soup. Quite a nice balance of flavors and textures, and truly one of the better versions if not the best version I have had here in the valley. Washed it all down with a Lumberyard red ale. Quite a nice pairing with all of the smoky spicy situation going on. Smoky burps ftw!Cool space, service rocked. Shout out to Daisy who took great care of us and helped make the dinner small plates happen at lunch.Solid 3.5 and I would return for dinner to check out more of the small plate offerings."], ["Jerry B.", "I've been here enough to know I love it.  Picture a place opened by hipsters that love Asian food and reaaaalllllly know how to cook and blend flavors.  The tables and setting are nice and not overdone.  But still quality and comfortable. The music is good and just loud enough so you can have a private conversation at your table without anyone else overhearing it even though the tables are close.  The food is outstanding and the menu is unique.  I really enjoy the soft boiled egg on just about every meal. Lunch is a smaller menu but quick and wonderful.   Dinner is even better.  The quality of the ingredients and the final product are really that good!Service is very attentive and follows the anyone can help you mantra.  Come for lunch or dinner, but get here before you cannot get in without a wait."], ["Bao H.", "(Lyrics - Rihanna - We Found Love)The Clever Koi's in my sightAnd we're attending for a biteAs the Udon noodles passes byHow it makes my senses come alive.....!It's the way it's tasting I just can't deny....!Bo Bites gotta have a goWe found buns in The Clever KoiWe found buns in The Clever KoiWe found buns in The Clever KoiWe found buns in The Clever KoiThis place definitely drew my interest!  Very Clever indeed!  I attended with my foodie group so a lot of sharing.We ordered a bunch of stuff, but I only remember what we ordered on my side of the table were the Peking duck and octopus bun, the katsui rice, gluten free and regular massamen udon noodles. To start my Peking duck was very good except I didn't care much for the charred plum jam.  It just overpowered everything in the bun.  The octopus bun was okay too, I rather eat it nigiri style.  The chicken katsui rice was very good again, but again I thought the teriyaki sauce was just doused over too much.  I like to taste the other ingredients sorry.  My favorite which was not my main dish was the massamen udon noodles. The red curry broth really made this dish pop while the crunch of the nuts gave it texture.  The roast duck and potatoes just melted on your palates while the cilantro gave it a welcoming aroma! - Enjoy!The place itself had an Asian flare with a modern gastropub feel.  Nice to hangout for a quick bite or to check out their specialty drinks, which they have plenty!  Service can be spotty, but every waiter/waitress has their day! - Enjoy!"], ["Thao P.", "We ate outside. They have high fans outside that are quiet but keeps nice breezes coming along. It was very nice. Inside looked great, too. Very streamlined with tasteful decorations. It was hard to pick what to eat. A lot of yelpers posted great pictures but they change the menu every few months so a lot of the pictures weren't being served. However they have a small menu so it's focused and makes your choice easier. We had the duck curry. It was pretty spicy but it's a nice thickened curry with big udon noodles. As I figured with most dishes here, it didn't have a lot of meat. You can probably see that in various dishes in the photos posted. The roasted potatoes in there were great. We had the tea-a-misu which I didn't care for. The texture was off. I wanted to try the steamed bun sandwiches but I couldn't justify the price for just one. They have an eclectic drink menu that is certainly fun to try. Happy Hour covers some drinks and some appetizers and it's 3-6pm everyday. What upped this rating was the service. We were treated by probably three different people but they were all friendly and not just with the standard recited lines too. We had questions and they were all informative and all of them checked up on us at some point to make sure we were doing okay."], ["Lisa F.", "If you're ever in Phoenix for whatever reason, this is a must try.  I am a huge fan of pork so of course I got the pork belly ramen bowl and it was amazing!  However, my first choice would have been the duck curry bowl, but my stomach was at odds with me that evening. I must add everyone at our table felt the same way with their choices on the menu.  Didn't have a problem getting seated on a Saturday evening and we even sat outside with the heat but that was even a pleasant experience with the misters outside and no we didn't get doused with water;-)"], ["Tony K.", "Several  of my friends  recommended  this place  so  we finally  tried the place . It was very quiet  when we got there. The place allows for customized  orders . We started  with the pork dumping.  The meat was not seasoned well  and was mushy . The pork bun had a lot of flavor but the pork belly was too  fatty.  We tried  the Ramen noodles with the pork broth . It was a little  bitter and too salty. We tried  the duck fried rice which was OK . The best dish was the shrimp  chow mein. The food was below average . I think I am too used to eating Chinese.  Service was good . Don't think the I will be back . The price was a little  high for lunch"], ["Chelsea G.", "Update : every time we come back out original waiter remembers us and comes by to say hi! :)"], ["Pepper T.", "I like the energetic atmosphere. The drinks are good and reasonably priced. Some things I tried were down right CLEVER and other things I tried I was left underwhelmed with. The Caesar Salad is a delicate symphony of classic infused with the most delicate of Asian Flavors and even though I only had a small bite of it I thought it was delightful. I was expecting the Szechuan Crouton to be something special either spicy or full of flavor but it was just a hard lump of something I couldn't determine.The Roast Corn Dumplings were another one of the very goods. The dumplings were tender and dressed with finely cut scallions. The Tomato Broth was multi-dimential with changing flavors of sofrito, ginger and Thai Basil with a building but not too hot heat.I thought both appetizers were very good and will forget about the Szechuan Croutons.I had the Salmon Bibimpap. I do note I am more sensitive than most people about smoke flavor and some smoke flavors are hard for me to tolerate. My first bite of the salmon was delicious with a charcoal kind of flavor that I enjoy but most of the salmon had a strong smoke flavor that took over. My vegetables were fresh and they gave me lots of brown rice. I didn't really taste any Korean Chili Glaze in my dish so I don't know if it had any or not. People who don't mind a smokey taste will like this dish.My husband had the Kung Pao Fried Chicken. He was a little disappointed because the chicken was very soft and in his words \"squishy\" He was also disappointed because the spice and flavor level was \"Old White People from Sun City\".I thought the Tea-a-misu was exactly the way it was described on the menu.The Roasted Peach Fritters were really Donuts with a little bit of Peach in them. They were made fresh to order and were tasty with the Cream Cheese Dip.Service was friendly but a little odd. My husband expressed his opinions to the management about the food. Our bill arrives and one dinner was removed. My husband pulled out his card to pay and tells the waitress it wasn't necessary to remove his dinner. So she comes back and ADDS the dinner back on.That was odd wasn't it?Good Drinks and Good Appetizers in an energetic atmosphere. I note you have to valet park behind the building to dine here."], ["Rick R.", "A very unique  place, a terrific experience!  Bartenders are top-notch, personable, helpful, and friendly!David & Alex are terrific, and the drinks are a special experience, as well as the food!"], ["Belle C.", "The Clever Koi has my heart! Came here on a Saturday for happy hour (4pm - 6pm). What can I say... I was impressed by every detail of this restaurant. No wait. The modern Asian decor. The friendly and attentive service. I can go on. Their happy hour menu features so many great dishes AND drinks which to me says a lot because I feel that some restaurants are so minimal on their happy hour menus. I came here with my family, a party of 5. We ordered everything on the happy hour food menu to share (5 dishes, minus the wood grilled veggies). The pork ramen was so good, we ordered 2! We all were fighting for the last bit. We added a kimchi fried rice with pork belly which was so good, I want to try it again with the other proteins. From rave reviews, we ordered each steamed bun (5) for each one of us and WOW! Just wow. So full of flavor like all the other dishes. And the greatest part, is that all of these dishes plus 3-4 drink orders came out to exactly $100. I was expecting much more! I am surprised that Clever Koi isn't swamped for happy hour on a Saturday! I won't accept coming here any other way. And I will definitely be back for more.I enjoyed this restaurant experience from start to finish! Can't wait for the next."], ["Amanda D.", "Amazing! From the food to the service to the ambiance. A great local spot to check out. The food is delish, but the drinks are better. We met one of the owners and fell even more in love with the place. They truly care about your dining experience. A must go to!"], ["Tracy V.", "To be honest, I was very skeptical when this place opened because it had very mediocre reviews at first.We went on a Wednesday night, and it turns out 90% of the menu has changed since it opened. They transitioned to a summer menu and for the most part, it's incredible food.The steamed buns I would pass on. The Peking duck and the pork belly inside were good, but the bun itself is a bit dry. Also, it's very filling and I wish I had saved my stomach to eat our main course.We ordered the steak Bibimbap and the seafood hotpot, with the special ($30 for 2 entrees, $5 more to get it with 4 specialty cocktails). The steak in the bibimbap had perfectly crispy edges and tender on the inside. The hotpot is to die for. I don't usually care for thick noodles, but these soak up so much flavor. My boyfriend also does not care for catfish-- except what was in this hot pot. Definitely squeeze some lime into it (comes on the side).Those cocktails-- amazing. I had the Pimm Jong Il and boyfriend got a tasty canned beer from Nebraska. We also had the drink with sriracha-something in it. You've gotta try it, it's light but with an edge. Also made by a well-dressed man.What I really admired was the co-owner working the kitchen (we sat at the bar, where there's an open kitchen). He knows so much about the food without being a pretentious jerk. Very friendly and very invested in the food. Wait staff was mostly on point and knew the menu in detail as far as taste/what to expect, so if you're not sure, they can probably give you a good recommendation.A great place to impress friends, or enjoy a nice dinner on a week day."]], "Dragon Palace": [], "George and Son's": [], "Noodle & Rice": [["Sarah O.", "Excellent food for the price!We tried Noodles and Rice because a friend recommended it and I'm glad we did.  Everything we are was amazing (except for the fried tofu- it was too gooey) and the portions are huge!My family of 4 was able to order drinks, appetizers, main course, and dessert, for less than $40."], ["Martha P.", "Found this place on yelp and due to the reviews decided to order take out. Big mistake! Food was less than tasty and unappealing to the eye. We ordered orange chicken for the kids, which was just battered (in a not so good batter) and had the \"sauce\" on the side-a but weird. My kids love orange chicken! But not this one they barely had a bite or two and we ended up throwing it all away. I ordered the kungpao chicken and \"fried rice\" it was edible but I can't say I enjoyed it.   The chicken was okay but not your traditional kungpao and the \"fried rice\" was merely steamed rice with soy sauce and a little fried egg, - no flavor, no veggies, no bueno! My husband ordered the drunken noodles, they were DRY, definitely missing sauce and flavor. In a nutshell we won't be coming back. Not sure where people get all these positive reviews???  Panda Express is 10 times better. Sorry guys we like to support local and small business but I like to enjoy my dinner as well!!"], ["Nicki M.", "Tasty food and great prices!I won't say the food was quick, because we waited about 20 mins after ordering, BUT it was definitely some of the best chinese/thai I've had in the valley AND its cheap!!As a first timer, first impressions are a must and I will definitely be back. We were greeted right away and the lady at the counter was prompt to take our orders.I got the Panang curry with rice, small wonton soup, and gyoza, while my husband ordered the fried rice & mongolian beef. All of our food was great tasting and the portions were not skimpy.If you're looking for asian food (because they have chinese, thai, & japanese dishes) this is a great place to go! Just make sure to call in your order first! :)"], ["Lauren D.", "First time ordering from here! Arrived within half an hour for delivery, had too wait to eat because it was still hot!! Very big servings for the price!! Delicious too! I had the baby egg rolls and the thai boat noodle soup! I will definitely be ordering from here again!"], ["John G.", "Noodle & Rice is a cool local 'hole in the wall' place - the kids and I were looking for something quick and tasty tonight - I suggested N&R and we headed over.  It's a modest, but cozy place.  They were about half full when we got there - got seated right away.We started off with the pot stickers - they were very good!I ordered the Panang Beef (almost always do here) - tasty as always - a little sweeter than the Panang at some other places, but the sauce/soup is creamy (coconut milk) and a good reason to eat all the rice (to soak up the sauce)! The kids got Tempura Udon (soup style - with Naruto, and with shrimp tempura on the side) and Yaki Udon (plate full of noodles with meat and all the goodies.Quick, cheap, tasty - what's not to love?"], ["Art B.", "Love this little spot. Love the prices. Love the food. I am guilty on occasion of being a bit of a cheapskate, so I'm tempted to just emphasize the low cost of dining at Noodle and Rice. That would be an injustice, however, since the food is great and equivalent to a much more expensive restaurant. I guess there's a lot to be said for low overhead, the benefit of an odd location facing a Quik Trip convenience store.N & R is cozy. Not small. That would imply it's a problem. Cozy. There are just eight tables, each seating four, and a couple of stools. That's it. The décor is fun. And the restaurant seems to do a thriving carryout and delivery business. Our recent visit was kind of late, just an hour before their 9:00 p.m. closing time. No problem getting a table, but it can be an issue at other times.We love the Thai Iced Tea. The 99 cent chicken eggs rolls with sweet and sour sauce are tasty. We ordered and shared both Thai and Chinese offerings. I'm sure this is a violation of foodie purist code, but it works well for our taste buds. The Panang Curry is especially delicious. Despite the low prices, N & R is generous with the chicken in the dishes we ordered. And the menu is surprisingly diverse for such a tiny establishment.The kids meals are amazingly affordable, just $2.95 including drink.  Yes, I know I ended up emphasizing the restaurant's low prices, which I promised I wouldn't do. Oh well. If you are across the street at Carolina's and the crowd there is a hassle, try wandering over to Noodle & Rice. Whether you are a fan of Thai or Chinese food, you won't be disappointed."], ["Crowded B.", "The service here is excellent.  The food is awesome and the portions are large for a great price.  It's a small business and has limited seating but serving is fast and well worth the wait."], ["Rafaella Z.", "Very good ! My boyfriend got the sesame chicken which was delicious and I got the yakisoba !!! Cheap and fast !"], ["Norm R.", "It's easy to see why this small eatery is so popular: the food is inexpensive and tasty, the servings are more than ample, and the range of choices run the gamut of popular Asian cooking styes: Chinese, Japanese, Thai, Mongolian. It's great to be able to order tonkatsu, pad thai, and General Tsao all in one place. While the place could use more light and perhaps a bit of touching up, you come here for the inexpensive, delicious food and not for the decor. I noticed while dining here that they have a very brisk take-out business so don't be surprised if there's a bit of a delay in getting your food if you dine here at peak hours."], ["Caitlyn C.", "Will not be going back. The food itself wasn't bad, I liked the drunken noodles but my boyfriend had a curry dish with fried noodles that were clumped together, greasy and uncooked in the middle. What was bad was the actual running of the place.After ordering our food we heard loud throat clearing and hacking coughing coming from the kitchen. I'm convinced the person cooking our food was back their spitting out phlegm, my boyfriend thinks it was the delivery guy in the restroom. Regardless, we were the only guests in the restaurant so it was definitely one of the employees which is disgusting- if you need to make those noises go out back where no one can hear you or better yet stay home, rest and come back well- you are working with food.The other disappointing thing is that we were the only ones in the restaurant and it took almost a full hour to get two noodle dishes. So although the drunken noodles was good, we both agreed it was the better of the two; I felt uneasy eating it due to the phlegm noises coming from somewhere. We won't be coming back."], ["Chelsea W.", "I was sick and was craving miso soup,and it was almost as good as the one there servant  hibachi restaurant, Fixed my food Poisoning.also got a kids meal it of  teriyaki chicken and was delious had the right amount of food for me to be stuffed on."], ["Chelsea W.", "Have you ever eaten a dish so delicious that you didn't make the time to even Yelp it? I have = )So we decided to call in an order, they closed in about an hour so we opted to pick up our food rather than have it delivered. We ordered the green curry, which is my favorite...Using noodles, hot and sour soup, a new spicy street styled basil chicken (which was recommended when I called). The wait time was 25 minutes,  which I didn't think was bad at all.So I went to pick up our meal, and they were nice as usual and I brought it home. The food was still at a perfect temperature and after we had our first bites, it was silence until our plates were cleaned. We've probably discussed over 5 times now how our new choices turned out to be the best choices. Everything was delicious and spicy just like we like =)"], ["Kassandra B.", "On a whim, a few of us ordered lunch here last week.  With the prices of the lunch specials, we were not sure what to expect. And to our delight, the food was great! Definitely plan to eat here again. My only regret is that it took me so long to try their food."], ["Thomas L.", "This place is pretty good.  They have a pretty diverse menu and really reasonable prices.  I have never eaten there, but usually get the food to go.  They have some really good noodle dishes and really good curry.  My girlfriend loves the Thai Ice tea.  I usually go to Nee house, but have been coming here alot more now."], ["Amanda J.", "Got one of the soup dishes. Super yummy!!"], ["Philip D.", "Let me start by saying this is a review for me and for another guest whom I do not know.First this was my first and will be my only order placed. At 11:45 AM I placed and order for Chicken Fried Rice. This is always my first order when going to a new place for lunch. I was told my order would take 30 minutes. Thirty minutes for a simple dish at lunchtime on a Monday? When I arrived 30 minutes later the girl out front asked who I was and went to the kitchen. When she came back she said he had just started preparing it for me.Before arriving I was expecting a well oiled machine that could just not keep up with the volume because their food was just so good. But I was wrong, it's a very small place and seems quite dysfunctional. There were only two other to-go orders packed and ready and a total of ten people dining inside.While I was waiting a previous lunchtime customer came back in and was obviously very disappointed. She had had to wait 20 minutes to come pick up her order and when she got home it was cold. Cold enough to bring back the meal and ask for a refund.She had ordered the $6.95 lunch special but had told them she didn't want the drink which was included in the price. But the counter girl wanted to refund her $3.95 and not the $6.95 she had paid. This was a quite bizarre ordeal to witness. The girl behind the counter arguing with the customer and trying to short change her refund.Needless to say I will not be going back. My meal was plentiful but not well prepared nor flavorful."], ["Ben K.", "This is the best Thai restaurant in town, flavorful and spicy. It's Bangkok style (or in the U.S., \"Chicago style\") so ignore the whining about the curries being thickened with coconut milk: that's how it's supposed to be. Curries and pad ka prow are fantastic here. Try the egg rolls too."], ["Michael W.", "Took quite a while to get served, only had one person doing everything but cooking. They were backed up with delivery and take out orders."], ["X X.", "I ordered delivery, they get the order right all the time and the lady who delivers is really nice. The food taste good enough when you need some food delivered. I only order veggie meals now because I'm not a fan on their chicken it has a funny after taste and is chewy."], ["Whodat 1.", "This was a new try for us. Ordered delivery and it took the normal amount of time (abt an hour). WOW!!!  I was pleasantly pleased (even though I hoped I would be based on the great reviews). The food was great! We normally order from another place but wanted to try something new and this will definitely become our go to spot! Great flavor and portions for leftovers or a late snack. When you ask for spicy they deliver! While we expect to try their other dishes, for this first time the General Toa was a standout!  We also got the Basil rice dish with beef, mini egg rolls and potstickers all of which were great! But the boyfriend would've like a fortune cookie ;/ all in all I would recommend this place above all!"], ["Jeff H.", "Terrific food! Bountiful! Perhaps the best Chinese food we've eaten in the valley. My wife and I had read previous postings and walked in with great expectations which were not disappointed. With our vegetarian preference, we ordered the fried tofu -- crispy yet delicate with a peanut sauce that satisfied.  The vegetable platter with brown sauce was also satisfying as the vegetables were fresh and delicious.    We plan to return often."], ["Dee P.", "FYI, I'm trying to broaden my flavor horizons and order food I usual wouldn't, and I must say, the Panang Noodles (extra spicy) are delicious! The Tom Yum noodles are great as well. I'm honestly never disappointed with this place (there was actually only 1 time when they were out of crab rangoons, I opted for the fried won tons instead and was disappointed at the tiny amount of meat in there). Other than that one-off time, I really love this place. Their delivery time is pretty accurate as well.P. S. They state no MSG on their menu, and indeed I have not found there to be any! Sooooo relieving. I'd have a horrible headache if there was any hint of it. So eat easy folks! ;)"], ["Megan S.", "I've been here twice with great service and food! It's been hard trying to find a great Asian restaurant and this place meets all 5 stars!"], ["Maria E.", "This small hidden place is amazing! The great pricing and bold flavors really hit the spot. I have gotten great service while both dining there and grabbing to go. I absolutely love this place!"], ["Tonya M.", "Best Chicken Wontons EVER!!We stopped in on a whim last weekend. It was raining and we were hungry. We weren't sure at first if we are to just have a seat, go to the counter to order or just stand by the door and wait. (You just seat yourself). We started off with chicken wontons which were fan-freaking-tastic. I wish there was more of a \"filling\" though. We both ordered the garlic chicken extra spicy...wow, spicy indeed. Often times we'll ask for something hot or thai hot and it's medium at best. But, they weren't messing around. I would suggest ordering medium and going from there if you don't want it over the top hot. It was served with rice and cucumbers/tomatoes on the side. I loved the side of raw veggies. This was the best Asian food I've had in quite sometime and we'll definitely be back."], ["Christina M.", "Good food, service Ok, jasmine tea is good too. Thai tea good and ginger chicken is good."], ["HoyMay P.", "After reading the mostly positive reviews, we tried Noodle and Rice.  We were greeted with the question, eat here or take out?  A little odd.  Nevertheless, we sat for dinner.  I ordered Pad Ki Mao and my husband had Garlic Noodles.  My dish was large and medium heat.  I added more chili peppers to mine as I like heat.  The flavor with basil was very good and a distinctively different taste from the Garlic Noodles.  Lots of breast of chicken in the dish along with veggies.  The garlic noodles had a nice flavor with lots of chicken as well.   Service was quick and these Thai people know what they're doing in the kitchen.  Prices are very reasonable.  Visit them, you won't be sorry.  We will be back."], ["Breanna E.", "Love it! Friendly service, great prices and delicious food!!! I love Thai food and it's so hard to find any good places in az! I love the curry, pad Thai and egg rolls! Actually, I love everything I've tried!"], ["Ron D.", "This place has the best General Tao &  Pad See Eiw."], ["Jay D.", "Lazy day today, woke up at 9ish, didn't hit the shower until 11ish, struggled out the door at around 12ish, wandering (driving) aimlessly in NoPho famished.  Yelped for lunch places and Noodle & Rice popped up on the list, so N&R it ish.  I'm not quite certain what to make of this restaurant because I was expecting an order-up type, but it turned out to be a sit-down place. Inside, the place is small with no more than 30 in occupancy tops.  A little cozy I might say if it was packed.  Fortunately, I was a little latish for lunch so hardly anyone was there.  The decor is a mishmash of ?!?!? which you'll have to see for yourself.  Nothing earth-shattering or trendy, but I just couldn't quite describe it so I'll leave it at that.I ordered the Pepper Steak from the lunch special in the Rice Entrees group.  It comes with egg roll, soup  and a drink for an unbelievable price of $5.95.  The egg roll (chicken) came first - which came first - followed by the soup (hot & sour).  The egg roll was really good but the soup was just ok.  Soon after, I got my entree which looked appetizing as I took its picture.  It was definitely fresh because the mushrooms and peppers were crunchy, however, I felt it lacked spice.  Condiments were nowhere to be seen on my table nor the table next to me, so I couldn't flavor it to my liking.  It wasn't bad but I was not blown away.  Next time, I will try the entrees from other yelpers who gave this place 4 stars.Overall, it's worth a trip back when I'm feeling ish."], ["celeste c.", "I was in the mood for Chinese food and didn't want to leave the house. Chinese food has been pretty bad in this area so when i saw Noodles & Rice, I was skeptical. When my food arrived at my doorstep, I was pleasantly surprised!I tried the Garlic Noodles, Crab Rangoons, and Spring Rolls. The food looks like it came from a fusion type of restaurant. It was arranged in a way that looked very appetizing. The veggies were very fresh. The crab Rangoons were impressive and had a spicy kick to them. Loved it! Good eggrolls! They even cut a hole in the top of the box so the Rangoons and Rolls didn't get soggy from the steam (since they're fried) I feel as if I've gotten lucky. There is a badass asian food restaurant near my house and they deliver! Can't beat that!"], ["Rob E.", "Looks a little sketchy from outside but nice little place. Really good prices! We tried the veggie spring rolls, hot and sour soup (like 4 bowls in the reg size order), garlic noodles, and basil fried rice. Everything was really good. Fried rice was very spicy! Pics on yelp threw us off a little as I think people had incorrectly labelled some items."], ["Erika M.", "A couple of friends of mine took me here for the first time a couple of days ago.It's a small restaurant, it may be seen as even a hole in the wall. But Seriously. This place is on my list of top favorite restaurants. Not only is the food freshly made and just ridiculously delicious.It's also cheap! The first time I went here, my boyfriend and I ordered two appetizers, two entrees, and three drinks, and the total still came out to approximately $30 (not including tip).  Whereas other places would have charged us at least $40, for the the same quality of food.They also practice wonderful customer service, and they're friendly. So that's always a plus as well!"], ["Jane H.", "Absolutely delicious Thai food offered by a pleasant server.  Ordered green curry with extra veggies and tofu and it was so yummy I ate the rest for dinner. My friend had the broccoli chicken and spring roll and she was really impressed. Ambiance is very hole-in-the-wall and kitschy, but that's not why you go. You go for the delicious food and good service, and you won't be disappointed."], ["Christina B.", "My family and I love this place ! Always start with the baby egg rolls, my husband gets orange chicken and fried rice but my personal favorite is the chicken noodle soup. Delicious!"], ["Gretchen L.", "I feel weird about giving five stars to this tiny joint, but I can't give it 'only' four stars in good conscience. We live pretty close to this place, and have eaten here, easily, 30+ times over the past two years... possibly 40+. Not one time have we been less than happy as clams. The woman who runs the front (phone and restaurant... it's pretty impressive) always remembers us, is always nice and courteous, and super helpful. My favorites: - Thai Basil Beef with extra beef and medium spice. This is a dinner, a lunch and a midnight snack, easily. So, so much food, even without rice. I love that I can order as spicy (or not) as I want. When we followed paleo, this was my takeout go-to, and still is today. - Egg drop soup. It is so yummy! No weird stuff going on, either; fresh veggies and super-tasty broth, served piping hot. This is a great value, at $2.95 for a large. This easily serves four people as an appetizer... orrrr one really, really hungry person who is craving some comfort food. - Sweet & sour chicken. This is not your average S&S ck. The meat is completely identifiable and the breading is light enough to not weigh down the whole dish. Good sauce, too. - No longer on the menu, but the Thai roll with peanut sauce. I really wish they would bring sexy back. - BBQ pork fried rice, extra pork. Um. Yeah. Extra pork, because pork. Duh. This is a massive serving, too. - Online ordering. - The kid menu has pretty large servings, too. - Clean. - Great service, even if there may be a wait. (There's a wait for damn good reason, so relax.) - It's been a while since we have done it, but this place was BYOB. Suggest calling ahead to make sure this is still allowed. We quit bringing our own because beer just takes up room that is better filled with tasty, tasty food. My husband's list is undoubtedly even longer. We just love this place. Give it a try. DO IT!"], ["Britt C.", "After complaining to my friend about the lack of decent Thai restaurants in the valley, he had told me about Noodle & Rice. After visiting Thailand this past spring, I thought that Thai food was forever ruined for me in the states, as it would never be as good. Noodle & Rice comes really close to the flavors I experienced in Thailand. They have some of the best Panang Curry, it's creamy and delicious and they use authentic flavors that include kaffir lime, Thai chilies, and galangal. The portions sizes are huge for the price, and the service is always friendly and attentive. If you're looking for authentic Thai food, I highly recommend Noodle & Rice."], ["S. S.", "Other than the little drink incident, food was great. You really get a lot of food too!!! I was surprised how much they packed in those styrofoam boxes. Thanks yelpers! Will eat here again for sure!"], ["Kate R.", "After reading the reviews my colleague and I decided to give it a try. Excellent food especially for the price! Bonus....if you order online they give you 10% off your first order. Defiantly will be back!"], ["Margeaux K.", "I read all the great reviews from this place so I was excited to try it. I ordered it online and it said it'll be ready in 30 minutes. When we got there 20 minutes later they said that they had technical difficulties with their printer apparently and it didn't print out so we had to wait another half an hour for the food. Finally an hour later we got home to eat it and honestly I wasn't impressed. The yakisomi noodles were very dry, there were very little vegetables and the beef was not good. The drunken noodles were also dry and not very hot although we did order medium so that could've been our part but they were still dry. The dumplings were over fried and very dry as well. The crab rangoons were okay. I'm not sure I will be returning but I guess I should've guessed with the low prices."]], "China Village": [["Sam W.", "We were visiting from Los Angeles and craving some authentic Chinese food and the China Village did not disappoint us. The food was delicious!Highlights:- The roast duck was succulent, the skin was light and crispy and the meat very tender. - Lychee martinis were a blast.- Food service was quick and staff was friendly"], ["Reece R.", "I went to China Village for the first time today.  I was going to order my regular Mongolian Beef from Pei Wei, but I had a hankerin' for an egg roll and some egg drop soup, too.  It was lunchtime during the week, so I figured I could find a place with a lunch special which included all of those things.  I came across great reviews for China Village on Yelp, and did not feel compelled to look elsewhere.I couldn't find a comprehensive (or solely take-out) menu online, so I ordered carry-out inside the restaurant.  The building is lilac, and boasts 2 signs out front.  The aroma once stepping inside was delicious!  I was greeted immediately upon my entrance, and asked the hostess for a takeout menu.  She was very kind, warm, didn't rush me, but waited at the register while I decided what to order.  I did not find exactly what I was looking for.  The lunch menu had 20 entrée possibilities, ranging in price from $6.50 to $7.75, which included a vegetable egg roll, fried wonton, and fried rice.  No soup.  There was a rather comprehensive soup section in the menu (sizzling rice, wor wonton, hot & sour, egg flower, corn & cream, vegetables & bean curd, seafood), ranging in price from $6.25 to $7.95: one size only.  I asked the hostess if they had a smaller size soup - as I wasn't about to pay $7 for my lunch and another $7 for a gallon of soup - and she said that the smaller size is $5 and that it's better to get the larger size (demonstrating the difference in sizes with her hands).  To me, $5.00 was still too much, so I abandoned the soup idea at that point.  I settled on the Mongolian Beef lunch special, and it was ready in no time.  Seriously, I read one email on my phone, and was in mid-response when my order was ready!  It also smelled heavenly.  Upon returning to the office, I opened up the package, and actually laughed.  From reading other reviews on Yelp, I was expecting a feast of sorts.  Instead, I could barely see the egg roll, and the rice serving was a firm scoop.  One of the compartments in the serving tray was dedicated to sauces and fortune cookies (which I don't consider food).  I felt cheated, but the aroma was so inviting that I did not lose hope.  I tried the egg roll first.  It was light, juicy, and so so so flavorful!  I had never tasted one like this before.  My perspective began to change.  I am, traditionally, one who goes for cheap food, which frequently runs the risk of being nasty and/or dry.  So, it was very possible I was out of my element with China Village.  After finishing the egg roll, I wished that they had included an entire compartment of them!  (Or just made them 12 times larger.)Next up was the main entrée.  It had onions and green things (sorry, that's the best I can do) in it, which I quarantined to the non-food compartment.  The beef was thinly sliced and perfectly tender.  I felt ashamed eating it out of a Styrofoam container with a plastic fork.  The sauce was a savory, slightly sweet, gravy.  The fried rice had little highlights of egg in it, nothing else.  It, too, was perfectly moist.  After I had finished all of the beef, there still was ample sauce and rice left.  Until I ate it all, of course.  :-)So, bottom line?  Although it was not what I was expecting (or looking for, to be honest), I would not hesitate to go there again.  It provided a level of pure food-eating-pleasure which I had never experienced with Chinese cuisine before.  I would highly recommend!"], ["Chaz V.", "Love this place. I've been coming here since the womb. You can't go wrong with ordering anything off the menu but my top favorites are sizzling rice soup, general chicken & mu shu pork."], ["Old T.", "Excellent and courteous Service, Eat in, Take out or Delivery, (I've tried all Three).  Excellent Food_ I Will Be A Regular Here. xie xie"], ["Farzana S.", "I can't believe I've never reviewed China Village on here. My family and I have been coming to China Village for the past 23 years - they've had locations further north and we found this one a few years ago. The food is authentic, people are good and it's all around a great experience. It's a real charm and one of Phoenix's best."], ["Kirk S.", "My girlfriend and I went there on our lunch break. The lunch specials were so reasonably priced i wasn't expecting all too much. In addition to hot tea I received two fried wontons, an egg roll, fried rice, and egg drop soup with my generals chicken. Our server made the experience though. Roger was super attentive and super hilarious. If you go make sure to request the mini-chopsticks!"], ["Casey K.", "Last Friday, I wanted some Chinese food (american-for those who want to know) so me and my bf decided to hit this place up due to it having a high rating. Boy, was it good!When they seated us, we were served promptly with hot tea and water (I asked for hot tea but she told me they automatically give it to us) the tea was delicious. I ordered the house special chicken and bf ordered Thai chicken which was the special of the day. Mine was really tasty and he enjoyed his too. Very well portioned for lunch. Didn't leave us hungry or bloated. We will come back! Also, our waiter was very nice and funny."], ["Liz L.", "Really enjoyed this place. Great food and friendly staff. Food was great! The sweet and sour pork was crispy and the sauce was delightful! My favorite part of the night was devouring the Ragoons. They had such an amazing flavor to them! Good price, Good food, Good people!"], ["Victoria F.", "Excellent food and service. They stay open till 9:30 pm and are very accommodating. We had almond chicken, chicken fried rice, beef broccoli, and sweet & sour chicken. We all enjoyed our meal. I recommend this place to eat."], ["Molly I.", "Best Chinese (American style) food that I have had in Phoenix. I live in Tempe, but I find myself driving out here to have some spare ribs, sweet and sour pork, chow mein, and hunan chicken. Such a delight in this desert where Chinese food is... not great. It's a bit of a wait sometimes once you order, but definitely worth the wait."], ["Beth K.", "I am loving my new neighborhood Chinese joint, China Garden. I am giving them 5 stars for tasty food at a great price with very excellent accomodating service (not grading for ambiance- just be aware that the dining roomis pretty outdated but still comfortable). Where else can you go for Chinese food for dinner and get a dinner special for $12 or less that includes soup and three appetizers. While we were there our waiter also brought out some little extras to try including the special of the day as well as a fresh baked macaroon. Yum!Update 9/2013 Ok, Chaina Village is still pretty cool but after trying a few more items on the menu I am less impressed by the ingredients as time goes on. Pretty sure they are using canned rather than fresh veggies and their meat is eh. Still tasty but not ideal."], ["Nancy H.", "Stay away.  It is dreadful.  Starting with the greasy apps and on to the Thai Chicken made with frozen French fries.   when I asked the manager he said because fresh potatoes take to long to cook.  Really??"], ["Adam B.", "Trust these good reviews, my fellow yelpers and yelpees.  China Village is an excellent restaurant.  I rarely give a restaurant 5 stars based on a single visit, but everything about my visit was fantabulous.  From the moment I walked in until the moment I walked out, they made me feel like a valued customer.  The service was PHENOMINAL.  The waiters and waitresses here CARE about you, and they are very social and entertaining as well.  On to the food!  My waiter gave me several samples throughout my meal.  The first one was the special of the day, which I did like but did not order.  It was mongolian lamb, and if I wasn't totally in the mood for something else, I definitely would have given it a shot.  The other sample he gave me later on was peking duck wrapped in a mooshoo pancake.  I'm not usually a big fan of duck and, honestly, I had no idea what it was until he told me.  But when I took a bite out of it, it was like biting into heaven!  I think I might have to start eating duck now!!What I actually ordered was a bowl of the Wor Wonton soup, an egg roll and hunan chicken.  Let's start with the Wor Wonton soup.  When I saw the price on the menu I was a bit surprised.  It's over $5.00 for a small order of soup and $1.00 more for the large.  I wonder why they do this?  The soup is supposed to be an appetizer, not a MEAL... and that's essentially what it was.   The small soup was in a LARGE transparent bowl.  Transparent so that you could see all the good meat and vegetables they throw in there.  I'm glad it was, too, because I saw shrimp in there and I don't like shrimp.. he had no problem taking it back to remove the shrimp.  When he returned, and I tried this soup, I almost soupgasmed right there.  There's only one other place where I've ever had wonton soup this good.  The flavor of the broth was just absolutely AMAZING and the wontons were the perfect texture. On top of that there was plenty of cabbage and other roast pork floating around in there, carrots, scallions, the works.  I had to force myself to stop eating it so that I would have room for the rest of my meal.The egg roll was average.  It was definitely nice and crispy, but it was thin and it almost like eating just fried batter.  I can't really reduce my review because of one egg roll though.The hunan chicken was perfect.  The sauce was deliciously spicy and the whole dish was tasty.  The only thing I DIDNT like about it, was the amount of those bamboo shoots they put in it.  I would much rather have something crunchier like bok choy and/or water chestnuts but there were none in there.  I suppose I could have asked him to make it with them, but I'm not the type of person to ask for substitutes.Overall my experience there was excellent.  I was totally happy and satisfied when I left.  The decor is not bad.  It's not the Taj Mahal.  It just a local Chinese restaurant."], ["Lori W.", "I was in town -- will be moving there soon -- and looking for some good Chinese food. I haven't had any in years. Anyway, I spotted China Village and decided to give it a try, and am so happy I did. Hot tea is brought without having to ask for it (just like they all used to do!), and the food was great. Plus, the people were absolutely delightful! Wonderful service and so friendly. I can't wait to go back!"], ["Patricia B.", "The food is delicious!!!! My family and I all got a dinner special it  comes with soup spring rolls chicken wings... a lot of food for like 13 bucks a person! Everyone is so friendly very chill atmosphere. I am definitely coming back."], ["Sarah J.", "My all-time favorite Chinese place in Phoenix. Been here over 20 times and never had a bad experience. The food is always spot on. The staff is friendly. Just a great place to go for lunch/dinner or even to go. Get the Schezuan Eggplant my favorite. I am a vegetarian so I get it without pork, which they have no problem modifying. Unlike Autumn Court down the street that threw a fit when I wanted no pork, something about it being a chef special! LOL. They also have AWESOME mai tais."], ["Jr O.", "We drove very far (per recommendation of our fellow YELPERS)  The people are very niceThe people took our order quicklyThe food came out quicklyHowever it WAS AVERAGE-PAR Chinese food.I'm pretty sure we passed about 10 Chinese places on the way here that would've done the trick..We are full & we are satisfied. Family of four ate for $32 bucks..(I had water to drink) We won't be going out of our way again:)"], ["Yvonne G.", "I am giving 3 Stars  solely because the \"waiter with the bow tie\" helped us get through the ordeal of a meal at China Village.I regret to say that fellow Yelpers misled me into thinking I was going to get a good meal here.  Made hubby travel quite a distance to try this well reviewed restaurant.  Here's the scoop:They charge 1.50 for the noodles that every other restaurant routinely puts on the table.  They charge 1.50 for brown rice per person.  Ordered the PHO (a vietnamese soup) which is on the menu although it is a chinese restaurant. The soup which consisted of noodles, chicken and broth was accompanied by very, very fresh basil, cilantro, jalapeños, bean sprouts and lime.  Ample and fresh.  The soup broth, although it was chicken PHO, had a fishy backdrop taste.  Can't explain it but it was there.  Hubby gave it a 7 on a scale of 1 to 10.Ordered the Walnut shrimp which was fried so much so that the batter had totally adhered to the shrimp. The crust outside the shrimp was much too thick.  The sauce was nothing more than mayonnaise.  The General Chicken which we had asked for extra spicy was not spicy at all.  When we told the waiter about it, he brought over some \"spicy oil\" to add to the dish to make it spicy.  Who wants to add oil to your food to make it spicy? Why not add chilies to the food while it is being sautéed as other restaurants do?  When the orders came out, the server only brought out one brown rice and that we should share it until we  get another one later.  The order of brown rice was small enough to fit in the palm of my small hand and the rice was as hard as a rock.  My culinary savvy told me that the rice had been overly microwaved and that's why it harden so much so that it was inedible. Don't restaurants keep rice in rice cookers to keep it warm??? We showed the waiter to which he said he would bring another rice, but by then we had already finished eating.  I also told him  that I hoped that he wasn't charging us  for that rice.  He said he would go back and modify the bill.  I was stupefied that the reduction was not done immediately considering that I showed him that the rice could bounce off a wall.  The straws I requested at the beginning of our meal never arrived and napkins were in short supplyAll in all the meal was second rate and I apologize to my hubby for sending him on a wild goose chase 15 miles away from our home thinking we were going to have a lovely Saturday night meal.  And by the way... this is no East Coast type restaurant... FAR from it!"], ["Jeff T.", "I gave this place a great review a few years ago. I'm here tonight and things have changed. Horrible service. Only 2 people working. Same guy and woman who have been here for years. He's nice, she's rude. Good food but won't be back anytime soon. I like to see the rude lady's face when she sees my tip. Owners take note."], ["Daniel M.", "Delicious food, great little place off the 51 (good place to stop off on the way home). I actually ate with the early birds at 5:00pm and so the waitress seemed preoccupied with the regulars (which was fine--I got everything I needed without being constantly pestered with questions and such).The waitress has a personality to herself---quite funny (and greatly dislikes highways), and has a bit of an accent but that just shows the authenticity of the place.For a meal, I had the veggie egg rolls and Mongolian beef---both of which were good (not the greatest but far from the worst). For the price, it's hard to beat.Highly recommended!!"]], "Hao Bao": [], "Wong's Chinese Dining": [["Alex Z.", "Huge fan of Wong's. If you look at this place from the outside, it looks like it's condemned, but it's really good. Normally I go there on the lunch hour and it fills up pretty quickly. Despite how it looks, it's very clean and safe. They have great lunch specials and I normally get the Orange Chicken, #15. With the lunch special, you get a cup of Egg Drop soup. Great service too. Even when they're busy I normally get my food very quickly and the staff is very attentive to their customers. They offer takeout - just call and tell them what you want. Since they have limited seating takeout is always a good option."], ["Joshua D.", "Ehh this place is OK. The food I got was sub par and was kinda cold. felt like they gave me reheated food. Inside is not that clean and is jam packed. OK if there is no other food around"], ["Jessika G.", "Lunch or dinner, Wongs always delivers. Love this place! Has always been great and fast. It's kind of a dive place, but I do love my dive places."], ["Zachary O.", "Funny looking building,awesome tasting food. Great food, cheap prices, and lots and lots of food."], ["Andy H.", "Best Chinese food in Phoenix I'm from San  Francisco and I know real Chinese food ans this is it!"], ["Rebecca K.", "Complete garbage, along with the rudest \"hostess\" that I've ever encountered.  The one star is for my waitress, who was pleasant and efficient."], ["Geoffrey D.", "The joint itself is run down. The food is out of this world though. I get this every friday for lunch."], ["Carl S.", "Never judge a restaurant from its storefront or design.  This place is best in Phoenix"], ["Kevin H.", "The food is amazing, but you might want to consider carrying a weapon when you come. You might end up getting shanked."], ["Steve B.", "Good food not the nicest atmosphere but if you're looking for good Chinese food at lunch this is a good choice. Know what you want and don't ask anything about making a change to how a dish is served and you will be fine."], ["Eric R.", "I have to say that I was a bit worried when I drove up. The place is a complete hole in the wall. It just looks really bad but I looked in the windows as we drive by and my partner and I gathered up the courage to go in. Once I was in I was committed even though the inside was just as bad as the outside. I came cause I read the reviews and wanted to give it shot. We walked to the register area and the lady was really friendly asked for our order and even had the patience to make some suggestions. She made us feel welcome. I ordered a mild version of the pineapple chicken and the boyfriend ordered orange chicken. While we waited I read the negative review about the donut smelling food. I got worried again. The server brought our food out and told us she hoped we enjoyed our meal. She was very pleasant. We got home we ate our food an my plate was bland but I actually like it that way cause u don't like a lot of spice so for me it was good. The veggies were fresh and not over steamed just a light crisp which was nice. My boyfriends orange chicken did smell like donuts but that actually added to the sweet orange smell which was very pleasant. The chicken pieces were individually cut and friend unlike most places that fry the whole breast and then cut slices. I like this place.  Just afraid to go in.  :)"], ["Jennifer O.", "After coming home from work not feeling so good, the husband graciously offered to pick up some Chinese food for us! Go him. Wong's happens to be fairly close to the house and we'd never tried it (due to its scary exterior), so we figured we'd go for it. I ordered the sizzling rice soup (which only comes in a large size for 7.50) and he ordered the sweet and sour chicken (about 8.50). My soup was steaming hot when it got to our house, so that was great, but the rice didn't really sizzle....weird for sizzling rice soup. It should be noted that the soup broth was more of a wonton broth (as opposed to other places that have more of an egg drop broth base) and contained large vegetables (that were fresh and tasty and included celery, broccoli, carrots, snow peas, etc), different meats and shrimp. The soup was sort of layered indicating (to me) that they cook the meat and veg separately from the broth and add it in later. All of the shrimp was at the bottom, followed by pork and chicken (and green onions), with veg on top. This was fine and probably wouldn't be the case if you ate the food at the restaurant. Overall it was a solid bowl of soup, better than a lot of restaurants, but still nothing I would really think about later. The husband's sweet and sour chicken was on the bland side... not very sweet... and the chicken was the typical fried puff balls of unknown chicken parts... he though it was ok, and I didn't care for it. For the prices, I would consider going back, but it wouldn't be first on my list."], ["Nadya F.", "I've been coming here since I was a kid! Wong's is such a great place, very noticeable from the street with its bright red exterior. The interior hasn't changed at all! I remember their huge refrigerator off to the side as a kid and that thing is still alive and kickin! It's definitely outdated but it's totally the charm of the place. Now for the food. I'm not gonna lie, I used to be extremely picky as a kid and would only get the teriyaki chicken or the house chicken. Now as an adult I've ventured off and tried new things. I think I've had everything on the menu at least once throughout my lifetime. My favorite dish currently is the Emperor's Favorite, chicken and shrimp with mixed veggies in a spicy white sauce. Yum! The soups are also amazing. I'm a huge fan of egg drop soup and Wong's just knows how to do it. If I were you I would also try the egg rolls, so good! and only $1 per egg roll! I'll always be a fan of Wong's and it will always be my go to Chinese restaurant."], ["Lauren R.", "Was apprehensive after looking at the pictures of the building and address. More than pleasantly surprised! Best Chinese I've experienced anywhere."], ["Juan M.", "Love this place ... For my experience an I know really good Chinese food from Mexicali ... This place is good !!!"], ["Kris R.", "I have never eaten in Wong's, only to go orders.  It is a Phoenix institution in a sea of Mexican restaurants.  When working in Phoenix, I on occasion have ordered take out for my staff on their advice.  It is really okay Chinese food.  If I was craving Chinese food, this wouldn't be it, but there is no Chinese food I have had in the Phoenix-Scottsdale area that would make me want to go back; including Flo's, Jade Palace, and Joyful Chinese.  They are all a 3 star, okay but not great."], ["Michael J.", "Stopped here tonight and got an order of curry shrimp to go. The place looks like a dive but the food is really awesome. The sauce was really delicious and there was plenty of food for me to have all I could eat and share a bit with a friend. I will definitely be going back to try some more items!"], ["Mary C.", "I have to tell you the place inside is a little dark, and really needs paint. But the food is so good the atmosphere fades. We ordered the sizzling rice soup and I could take this intravenously its that good. I will definitely be back, they have take out or dine in. Make sure you try this place."], ["Jim C.", "For a very inexpensive Chinese restaurant this place really is good.  The delightful family who serves everyone goes out of their way to make their customers happy and well fed.  The food is excellently fresh and very tasty.  Also while the atmosphere is divey, it's adorable."], ["Brian P.", "This was by far the WORST chinese food I have ever tried. I'd rather eat sand paper with teriyaki sauce on it. The waitress was a complete jerk as well. I would NEVER recommend this place."]], "Little Peking": [["Dallin G.", "Great Chinese food for a great price. Didn't give five stars only because it isn't the best Chinese food I've ever had. I always order takeout as it is super fast. Never have had to wait longer than 30 min."], ["Chloe L.", "We love the dumplings, Mu Shu, General Tso's nd Yui Shan Spicy Chicken. Fresh veggies, tender meat and no-so-mushy dumplings!"], ["Sandy C.", "We stopped by here for some lunch after some running around next door (Imagination Avenue), it was fairly busy so that must be a good sign since it was a Tuesday afternoon. We had the almond chicken (came with egg soup, egg roll & *fried* rice), for $6.00, it wasn't bad, but it is your typical run-of-the-mill, Americanized, plain Chinese restaurant.They said it came with fried rice, but it looks nothing like fried rice. It just looked like steamed brown rice. There wasn't that much flavor or anything  memorable about the food, but it is very very well priced."], ["Thomas A.", "I really enjoy coming here for the lunch specials. My two favorites are the house special chicken, and the twice cooked chicken, very tasty. This spot might be overlooked but I am glad I gave Little Peking a chance. I have been coming back frequently for the great food."], ["Robert O.", "All the debate on Chinese food in the valley gets tiring. Sure we may not have the options some bigger more culturally astute metropolis' offer, but we have a plethora of little spots like this, sequestered away in the seas of stripmalls that dominate the vast swathes of phoenix's urban sprawl. I came here on Xmas day with my brother, sister, mother and sister-in-law and I would say we were all pleasantly surprised. Little Peking is your standard American style Chinese fare, you'll see all the usual suspects; almond chicken, kung pao, lo mein, moo goo gai pan, sweet and sour, twice cooked, well you get the picture. Despite the lack of \"authenticity\" (and I say that in quotes because who the hell am I, a white dude, to question whether or not a dish made by some one of Chinese descent is authentic) everything we ordered was darn good. Not overly greasy, the fried items being lightly breaded with only white meat used; I genuinely liked Little Peking's version of twice cooked chicken more than the Chinese delivery place I regularly order from in my hood. Whats more is that their lunch menu was insanely cheap, we paid about $20 for a party of four. Little Peking is a solid option for those in the area, give them a shot."], ["Brianna S.", "My family has been dining at Little Peking for years. It's not much to look at - a bit of a hole in the wall, but the food is delicious! Not to mention very well priced. Lunch specials come with a cup of soup, an egg roll, rice, and a generous serving of the entrée. Take out is great as well. If you're ok with a little less ambiance I would recommend."], ["Jerry D.", "They have all the typical chinese/American dishes.  Great service.  It's my go to when I have a craving for chinese food.  Love the generals beef, house lo mien, house special chicken and my son loves the Mongolian beef.  Staff is really friendly, as well."], ["Dan S.", "I love small hole-in-the-wall family restaurants, and this is one of those gems. Wonderful old restaurant with good food and the staff was delightful."], ["Phyllis K.", "On a very rainy Saturday, and took 2 out of 3 kids to lunch here.  This is an ol'fashioned type of Chinese restaurant.  Those of you who grew up with the 60's and 70's variety of dine-in location can envision the interior.  Somewhat ornate, lots of red, banquette style seating, Chinese Horoscope paper placements.It's very clean, and the staff is über friendly.  They were fast with a pot of hot tea, and brought our soups out before we ordered.  Yet there was no rushed feeling, just the sense that they wanted us to be happy.  Nice!There is nothing nouveau about the food,  just good standard fare.  I had almond chicken which was as familiar as you can remember or imagine, one daughter had sweet-n-sour pork, which was a good balance of meat chunks and veggies/pineapple.  The other had House Special chicken, very crunchy and appetizing.We found the sweet/sour sauce VERY sweet, almost too sweet, but maybe that's because we don't use lots of sweet condiments(?).  Or maybe it was just prepared too sweet.Food was served nice and hot, and we all enjoyed it, even the one kid who was resistant to trying this new place.  We all agree that we will be back for more.  Prices are great- about $6 each for lunch which includes soup. wonton and eggroll as well as entree."], ["Grace K.", "I love this hole in the wall place!!!!!!! Their sizzling rice soup is amazing! But be sure to get $2 extra rice with it."], ["Chris G.", "Great food- It looks a little sketchy from the outside but the meal I had was really good. Everything was fresh and hot."], ["Vance Z.", "I was in the area and hungry for Chibese. This place looked a little basic on the outside so I read some yelp reviews which were pretty good. Excellent orange chicken , plus delicious meat dumplings, plus good service. Pretty fair prices too. Glad I stopped here."], ["Ashley B.", "Big bummer since we live nearby. The food is pretty good, BUT, it was lukewarm. I really wanted to microwave it. We had 6 entrees, so maybe that was part of it? The orange chicken was tasty but barely any spice (and it had an asterisk warning). I was  so glad that the chicken was well cut so it didn't have any fatty parts or grossness. Staff is friendly, place is clean. I'll try the food again."], ["Mike B.", "Stopped in for lunch. Nothing fancy about the dining room, but it was clean and the service was prompt and friendly.  Daughter had chicken fried rice and I had the kung pao chicken and shrimp. Very tasty, nice big shrimp, for a lunch portion, and not to much oil used in the prep. Very good flavor. No upcharge for white meat in either of our meals. The only thing I'd say was a wee bit of a disappointment, the fried rice didnt have the usual peas and carrots. Some maybe would like that, we would have preferred them to be included.Overall a good meal and a reasonable price."], ["Dana B.", "I really don't know how this place has such great reviews. I walked in on Friday night to order takeout. I waited at the bar/counter area for about 10 minutes with maybe 5 other people all waiting to order take out or pick up. It seemed very chaotic for the one woman behind the counter taking orders, fetching them, and ringing them out. It looked like she was even serving on the floor at times. The food took about 20-25 minutes once my order was placed. Prices were okay, but the food wasn't anything to write home about. I got Hot & Sour Soup (nice and spicy) and Mongolian Beef (a weird light brown color...).As for ambiance, it definitely has that feel of chinese restaurants from the 90's."], ["Co S.", "Great service, food is consistently good and prices are right.  The best Hot & Sour Soup, House Special Chicken and Shrimp Egg Foo Yung.  Love this place!!!"], ["Whitney H.", "Came in for lunch here yesterday.  I ordered the House Special chicken.  The egg drop soup was gross ( I am not a fan of that stuff anyway though, everyone else there was eating theirs and seemed to like it), but they give you the little wonton strips with it and some sweet and sour sauce for dipping so that was a plus.  The House Special chicken was dark meat that is breaded and then sliced and served with the thin soy/garlic sauce.  Even though it was breaded then sliced (not my preference), I found myself really enjoying the chicken.  The egg roll was ok, nothing to write home about.  The fried rice was kind of a joke - no veggies in it, just some sad-looking egg.  The House Special was good enough to make me come back for it though."], ["Shirley S.", "Little Peking is a terrific little mom-and-pop Chinese restaurant. The decor reminds me of family restaurants that were popular in the late 1970s and early 1980s. It's definitely outdated, yet comfortable and appropriate for families, at the same time. The service was quick and as friendly as it could be considering the language barrier. The lunch plates are filled with more than ample portions and include an egg drop soup appetizer and fried won tons. My friend's vegetable plate was good and my house chicken special was moist and flavorful. We both enjoyed the rice but the egg rolls had an odd tasting spice that neither of us could identify. The price was right, for sure!  Lunch for two was just under $12 (plus tax and tip.)  I will definitely consider visiting Little Peking again in the future. I love that it's a locally owned business and my dollars are going to help support a local family."], ["GrayArea S.", "Exceptional Chinese restaurant because they will listen, accomodate and remember your needs. I've seen them serve Spicy dishes with no spice, take sugar and salt out of their dishes, remove and substitute vegetables, change sauces, and more to accomodate various people I have brought here. Superb Wor Wonton and Hot & Sour soup, also highly recommend the Mongolian Beef, Sauteed Three Seas, Moo Shu whatever, Bell Pepper Steak and any Lo Mein."], ["Christina L.", "This place used to be one of my favorite lunch spots when I lived in the area. Last night, a friend and I decided to revisit Little Peking for dinner. Unfortunately, it might have been an off night. The garlic chicken was lackluster (and a bit chewy) and her shrimp in lobster sauce was overcooked. The Wonton Soup is all of the wonton ingredients dumped into broth, rather than the delightful packets of fun I've come to expect when I order this. It seemed a bit half-hearted.Service was minimal, but it was polite. Prices at dinner are about $9-$14 a dish."], ["Jon Jon G.", "Fried rice and duck is awesome!"], ["James N.", "I love this place..... cheap quality chinese food... everything i've had there is good. When they label an item as spicy, it is actually spicy! There lunch specials are an awesome deal. 5 or 6 bucks for a plate of food, soup and fried wonton chips.love it!"], ["Alec P.", "My favorite Chinese food in the valley! I may be a little bias because I've been coming here for almost 9 years, it's right next to my barbershop as well. The sun devil chicken is my favorite dish hands down. I love spicy! So delicious chicken soaked in jalapenos and various other flavors. I could eat it everyday for the rest of my life. I'm also a huge fan of the Mongolian beef, but you really can't go wrong with any dish at this place. Sometimes it's nice to go in and grab a table or sit at the bar. Very quiet nice atmosphere. The staff will remember you if you go in frequently! Great people, great food, great service."], ["Sydney N.", "Had this last night for dinner. It was pretty good! The rice was nice and fluffy unlike some places you get slightly hard rice from it being overcooked or old. I live right next door so I look forward to becoming a repeat customer. Only thing is that no one delivers around here!"], ["Mary M.", "The restaurant is in our neighborhood. Good food and I pretty sure it is MSG free. I usually get ill after eating MSG laced foods, but not a prob here. The food is good. I love the veggie fried rice."], ["Arnie K.", "This is just a great local restaurant. Been going here for almost 20 years and have never been disappointed.  Lunches are the best deal in NE Phoenix."], ["Jennifer U.", "Yum! My husband picked this up for  dinner tonight, so I didn't see the place on the inside.  But the food was fantastic.  Chicken Lo Mein, wonderful with fresh vegetables.  Vegetable fried rice was also full of fresh vegetables, broccoli, snap peas, yum!  My husband loved the Kung Pao Chicken, his favorite dish.  But the best was the spicy shrimp, absolutely divine!  The best chinese food I have had in a long time."], ["Steve L.", "My family and I have been eating here for at least the last decade. We always order the \"house special dinner.\" This includes soup, egg rolls, chicken wings and several entrees depending on the size of your group. I can't speak for the other dishes but the ones we get with this are always superb. The restaurant doesn't look like much from the outside but I would recommend this place to anyone."], ["Janice W.", "I had lunch there today.  The food was WONDERFUL!  I ordered the shrimp with vegetables in garlic sauce.  The shrimp were very large and lots of them!  The food is very cheap.  This is my new favorite Chinese restaurant!"]], "China Chili": [], "Li's Bowl": [["Sabrina C.", "I absolutely love to eat here. It is close to my neighborhood and is actually  pretty clean. The girl in the front is always very friendly and the food is super tasty. There is a lot of variety  and I as a cook myself do recommend this place to anyone that has a craving for sushi or chinese!!!"], ["Monique I.", "The service is great. It's fast food sushi so don't expect a fancy restaurant. Even though its fast food, it's good. They're very nice and friendly."], ["Sai P.", "I love Li's Bowl!"], ["Bryan W.", "I've been getting the Kung Pao Beef or the Pepper Steak lately and both of these are really dang good as well. The dishes are fairly not-spicy by default. I always have them add extra (whatever it is) to make them a bit spicier. They taste just as good either way though.Three years later, I'm still going here. And damn it's still as tasty as ever."], ["Claire K.", "I should start with the caveat that I'm giving it four stars considering its location.  Anywhere else (San Francisco, Seattle, etc.) I think it would be just average Chinese food and sushi, but for Arizona I think it's definitely four stars.  The sushi is decent--nothing amazing but it's not bad either.  I've been pleased with the entrees I've tried and the servings are generous.  My family of four usually gets three entrees and a large soup, and we have plenty of leftovers for the next day."], ["Todd G.", "I have lived all over the world....so I won't compare this to places like the Palace Hotel in San Francisco. What I will say is that if you live in the area you won't find better sushi anywhere. The prices are amazing and for those of you who are used to $10 sushi you know what I mean 16 piece California rolls for under $5 bucks.....try the shrimp tempura roll...but only get the half size or you will be too full. Overall the best values for the money anywhere in the area"], ["Kyle B.", "The price was unbelievable, the portions are HUGE and the food was truly great. There's not much more to say than that. I don't give out 5 stars lightly and I was shocked to find food that good at this small, order at the counter, hole-in-the-wall.Try the orange chicken, it's the best I've had at anywhere besides a couple of very upscale restaurants.I will absolutely eat here again next time I'm on this side of town."], ["Adrian S.", "One of my favorite take out sushi spots.  I even bring my friends from work here to eat lunch.  The sushi is very cheap but the quality is great.  The food is definitely fresh.  Sushi rolls that normally costs $16 for a 18 roll only costs around $7 here.  Fried rice is also good, but i normally pick this up on the way home to eat sushi."], ["Jen B.", "We liked Li's Bowl, but were not wow'ed by our experience.  It is a nice local take out joint, with decent food and good portions/pricing.  The service was fast and friendly. We had some sushi rolls and a couple of their combo meals.  Again, good but not great.    It wasn't anything super-spectacular, but we enjoyed it enough and would probably go there again if we had an immediate Chinese food take out craving."], ["Heidi W.", "This place is decent. I enjoyed the shrimp tempura roll. I think the sesame chicken is way too sweet. I do go from time to time, but not too often."], ["Ebony W.", "This place sucks!! I moved to the valley and have yet to find that \"go to \" chinese spot, sooo I decided to give this spot a try. I called my order in and was assured by the employee that all the food is cooked to order, always fresh. So I picked up my food, and what do you know, I got some old azz fried rice with some microwaved shrimp. WTF??!! I give this place 2 thumbs down and I would not eat here if I was hungry as a hostage :("], ["Gerald G.", "I've tried a lot of their chicken. I love their fried chicken wings. I've checked a lot of places in AZ and is hard to find some. I would take Li's chicken over Churchs anyday."], ["J Ann D.", "We frequent Li's bowl fairly regularly. Not a lot of options in Laveen, and Li's doesn't disappoint.As vegetarians, there are a good amount of choices. Avocado salad, veggie lo mein, veggie fried rice, tofu and vegetables and avocado/cucumber rolls are our most frequent choices. Always fast service too."], ["Tawny W.", "Yes I love this place.....cheap, fast, and good lol....I eat here bout 2 times a week...my favorite is the lo mein"], ["Deanna H.", "Great General Taos Chicken and AMAZING SUSHI!! Will will not go to any of the other so called chinese places down near Laveen but Li's Bowl. Their prices are very reasonable and they servings are resonable as well. Would definately recomend to everyone in the area!! And they are open till 11pm can't beat that!!"], ["P B.", "Our favorite neighborhood Chinese restaurant.  They really need to expand their veggie menu, although I still haven't gotten tired of the House Tofu dish.  I think we've gotten that every time we've gone to Li's Bowl, but have also tried the House Shrimp and a couple other dishes.  All in all, this is some of the better takeout in our part of town."], ["Fernando P.", "Huge portions, way cheaper than other Chinese restaurants. Recommended!"], ["Angela E.", "Li's Bowl has become the neighborhood favorite of my husband and me.  We both LOVE their teriyaki pork and I LOVE their california rolls.  Their prices are very reasonable and they are always very friendly.  The one thing that we had that isn't so great is the egg rolls but finding a really good egg roll has eluded us for a very long time.  If anyone has any suggestions please let me know!!  Anyway, I highly recommend Li's Bowl for large portions at a very good price with a smile!!"], ["Cjfj W.", "Best Orange Chicken I ever had. I normally go there every Tuesday or at least once a week. The Sesame chicken, Lo mein and fried rice is good, too. The Sushi rolls, especially the Hawaii Roll is very tasty, but more expensive than the other food."], ["Erika T.", "When we're by his house, the boyfriend and I go here for our Chinese fix.  I'm a big fan of their sweet and sour chicken.  I've tried a couple other menu items, but always come back to the chicken.  The breading has a great flavor to it; the chicken is nice and tender white meat.  Boyfriend usually goes for the teriyaki beef or the General Tsos.  It is always fresh, and you can taste the quality of the oil they fry the s/s chicken in.I would not recommend the sushi here; I wasn't feeling hungry one time, and just got a California roll.  Decidedly mediocre.  As others have mentioned, the portions are HUGE.  My chicken is always overflowing in the container - usually they have to force the lid on.  Two large meals is generally $20, and translates into dinner + two more meals of leftovers.If you're looking for some yummy, American-style Chinese take-out in Laveen... Lis Bowl is the way to go."]], "Pacific Gardens": [["L A.", "I had looked up a sushi place on yelp that was close to me, and found Pacific Gardens on top of the list so I gave them a try. I am so very happy I did! Pleasant layout inside, courteous staff. Their prices are very reasonable and they don't skimp on portions for anything. If you order the lo mein, be prepared to take leftovers!The sushi is fresh, and presented simply. Their Caterpillar Roll is excellent. So was the salmon roll. Their sashimi slices are hearty and satisfying. The rice is cooked just right! I've also had their tempura and it was tasty and not over-breaded at all.I say if you're looking for a nice quiet sushi place that isn't all about the atmosphere, try this one. You won't find thumping music or harried waitstaff here. Just a perfect place to be."], ["Phil B.", "I am usually skeptical of places that feature \"Asian fusion,\" but Pacific Gardens did not disappoint! There were only a few tables seated for lunch on a marvelous Ahwatukee Saturday, but nevertheless the service was outstanding. The waiter (Ken) made sure we were ok and that our beverages were topped off. I find most decor at Asian restaurants to be tacky, but this place was appropriately furnished; definitely an upgrade from the old Abacus Inn.The lunch menu comes with soup, a delectable ginger-dressing salad, rice, and choice of entree. Mongolian beef was the dish I chose, and it was quite tasty! It could have been a tad spicier, but rectifiable by asking for more peppers. I managed to steal a couple bites of sweet and sour chicken from my dining partner's plate/tray, and that was also delicious! Even though it was lunch time, I must say the portions were pretty generous. We will definitely be coming back to try the sushi and dinner menu. Who knows, maybe I will try their spicy-sushi-bonsai challenge next time!"], ["C J D.", "Overall a good value for the price. Average Sushi, very good happy hour prices. They do offer a great variety of sushi for a all you can eat deal for $23. I tries their New York roll (good) Crunch roll (okay) and the Chandler roll (good). Tried the Quail eggs, because why not, right? Not very good. Causal dress, average ambiance.  They have several TVs around the restaurant."], ["Nicki G.", "We've been here before and it's great. But tonight we sat down and weren't acknowledged for over 5 min. Just really bad service. Maybe we'll try again in the future."], ["Micaela W.", "I love this place! Not only do they deliver but they have amazing food. I always get some form of sushi, my husband gets the pacific honey chicken (which is amazing) and we share the crab wontons. It's so yummy and so much food that it makes a good lunch the next day."], ["Bre T.", "I love the staff and the food! They are always super nice and the food is ready in a timely manner."], ["natasha n.", "Great value and great food in Ahwatukee! I was so sad when Abacus Inn closed, but I'm happy that a chinese/japanese place opened in it's location. The owner said he is from Burma, I wish he would add some Burmese dishes to the menu like tea leaf salad, samosa soup, etc.The chinese chicken fried rice is a great value! It's delicious and a great portion for under 8 bucks! I get like 4 meals out of it. I always ask for them to make it extra spicy for me...so yum!Their lunch specials are good value too, huge portions for under 9 bucks. Mongolian chicken is great! Sushi specials are good too. I've tried a few rolls and they were tasty. I always order for pick up, I have never actually dined in. I basically order here cuz it's great food for a good price."], ["Scott B.", "I love the happy hour  the owner John is very nice.   Love his other other restaurant in Gilbert.   Great service.   Great sushi for the price"], ["Nilsa M.", "I like their Chinese food selection more than the sushi. But if your into their sushi...they have amazing happy hour specials."], ["Kelly B.", "I came in because I received a flyer in the mail. So glad I did!! Great lunch specials and absolutely delicious. And great music. Love me some Jack Johnson:)"], ["Shay B.", "BEST AVOCADO ROLL EVER!! I'm always in search of a good avocado roll & this place has it!! (See photo) So fresh & yummy!! Miso is SO good too!!! We've been to dinner here too & all their specialty rolls are huge and well priced--my sweetie LOVES it!! Tuna appy is so fresh & good too!! Highly recommend!! Good atmosphere, super fresh sushi & good deals--- rare combo!! BOGO for $1 beers too!!"], ["Jay M.", "Okay, I have been to Pacific Gardens twice now and enjoyed both experiences.  On both visits, it was during lunch so my review is for their lunch service only.On both visits I ordered from their lunch special menu.  The first visit I had the sashimi lunch special and it was excellent quality.  The portion was very generous and I left stuffed, which is saying a lot when you only ate sashimi.  My dining partner ordered off the Chinese lunch menu and received a huge bowl of Orange Peel Chicken.  I did not try her lunch, but it looked and smelled very good.On my second excursion, I ordered the lunch special Mongollion Beef.  While it was not as amazing as the quality of the fish, it was still a solid preparation.  Also, the serving size was huge for $5.99.  The Mongollion Beef alone would fill you up, but it also come with rice, choice of soup & salad!Definitely worth checking out (for lunch at least!)."], ["Darryl Y.", "We ended up here based on the reviews. Went about 1 hour prior to closing on a Saturday night and we were the only ones there. Needless to say I was skeptical. My wife and I got the all you can eat, and my kids ordered off the menu. The food came fast (we were the only ones there) and the portions were huge. All of the sushi we ordered was great, but the tuna tataki was excellent. Hope to visit there again."], ["Larry S.", "Finally, a great place for sushi.  My wife is very particular about where she will eat sushi and it was very hard for her to go in here.  Finally, after turn down and turn down I just said we are going!  Guess what, she LOVED it.  The amount of food you get for the price is super reasonable and the freshness of everything was superb.  I walked out of there so full that I told my wife, \"I'm good for a while!\"...lol.  We spend $57 including tip and probably could have spent a little less and been more than satisfied.  The one and only thing that we really didn't care for was the soft shell crab app.  It was nothing more than a soft shell crab breaded and deep fried, but it was very fishy.  Anyway, this place was a great find and the best part was my wife saying, \"We can go back.\""], ["Joel H.", "Loove this place. Beer is always really cold and the sushi is great!!! Oh, the beer is buy one second one is. 99 cents."], ["Derek M.", "The service seems to always be sluggish around dinner time, ordered 3 rolls and didn't get my first roll until 45 minutes later. Looks like they only use one sushi maker at its busiest time, their staff looks very annoyed at any request, but dammit the price is great and the servings are more that proportionate."], ["Kristin H.", "I can't believe I haven't reviewed this place before! We eat here at least once a week - sometimes twice. Staff is incredibly friendly. Fast delivery...where else can you have sushi delivered??? The sushi rolls are huge and inexpensive compared to Kona Grill and those alike. We love this place! .99 beer, $7 Las Vegas rolls...can you beat that? Love!!!"], ["Troy J.", "Walked in the front door and it smelled so fishy my wife and I left.  It was a Friday night and no one was there except one couple, I wasn't impressed.  The reviews indicated great sushi but we couldn't get past the fishy smell and the lack of people.  It's also very stark inside with no atmosphere. Not really sure about the food but not my cup of tea.   Hope this helps someone else make a decision it seems like the other reviews are plants."], ["Jamie M.", "This is my go to for Asian cuisine in Ahwatukee.  The service is very quick and friendly and the food is delicious.  The beer special is buy 1 and get the second for a $1.  My favorite is the Mongolian beef great taste with a little heat.  I highly recommend Pacific Gardens."], ["Olga A.", "I like this place, may be not so beautiful inside, but food is really fresh and good. Normal prices like everywhere."], ["Chi H.", "Came here twice during our stay out in Phoenix. Food and service was great. Lunch specials were a great deal and lots of food! Hubby had Mongolian Beef dish and he absolutely loved it. Would come eat here again when I come out next time."], ["Nathan M.", "Hands down, best sushi and Asian food I've ever had and I'm obsessed with sushi!The prices are unbeatable for the quality."], ["Tylar H.", "Service was good, interior was nice, and our chinese food lunch specials were good. The mongolian beef was tasty.. BUT...Me and my gf gave their sushi a shot. We got albacore and yellowtail nigiri. It was HORRIBLE. To the point that we opted to throw our money away rather than finish it. On top of that the price for the sushi was way too high. My egg flower soup was bland, but her hot and sour was tasty."], ["Darek S.", "The new happy hour menu is awesome. I just had the sashimi deluxe and it was incredibly delicious! I can't get enough of this place!!!!!"], ["Mike O.", "I don't eat sushi and still go here.  They have many options for those that do and don't like sushi."], ["Sweet P.", "Been to lunch here about 5 times and each time I am delighted with the service and food.  The egg drop soup as well as the Miso soup are some of the best soups I've ever had.  I am not an inexperienced Asian food eater.  I know this is not San Francisco quality, but certainly some of Phoenix's best quality.  The combo lunch specials are really nice and plenty to eat.   Please ignore the one star negatives.   They are missing the point of Pacific Gardens.   It's good stuff."], ["Eliana V.", "I came here for lunch with a friend one afternoon during the week and the place wasn't very busy. We were seated right away but the waitress took so long to take our order, fill our drinks and bring us our check. My 1 hour lunch ended up being 1.5 hours. The food was very disappointing. I ordered the chicken teriyaki. I figured that's such a staple dish at sushi restaurants and no one could mess it up. Boy was I wrong. The chicken was a weird texture and it's was overly seasoned. I didn't eat more than a few pieces. I just pushed it to the side and ate the brown rice. Although the waitress and other staff was nice I won't be going back."], ["Chris L.", "I decided to try a new place for sushi last afternoon and really I wish I hadn'tI don't understand where all these 4-5 star review came from. I'm guessing the 99 cent draft beers are the main attraction of this place. It seems like the bar was the only thing with a crowd of people. Walking in I was confused was I supposed to seat myself or what? There didn't seem to be much organization with this place. The guy at the sushi bar took my order since I sat there, but another guy gave me my plate and utensils. They forgot to bring out the miso soup included in my meal, and when I asked about it later the bowl they brought out was lukewarm and not very tasty. It had seaweed and tofu, but no flavor and a strange consistency. The ginger included with the sushi had a strange taste to me. I eat a lot of sushi, and this ginger was the artificially pink kind (which usually means mass produced). It had a strange taste which I could only associate with cheap alcohol. I understood why some of my friends don't like ginger if this is the stuff you try your first time. The chirashi bowl I got was sort of small, but acceptable for the price. The one thing that makes me never want to come back is on the back of a piece of albacore the fish was turning GREEN... Now I've never seen anyone present a piece of fish to me that was already turning green.  I can't understand how as a chef you could miss that before putting it on the plate. Then have the audacity to hide it by putting that side facing the other way. I worry about what about the other pieces that I didn't turn around (that piece was probably on the end). Even more, the guy taking away my plate didn't notice that I had otherwise finished my plate but left that single green piece there for him to see. Doesn't that seem a little strange that someone would finish their meal but leave a single untouched piece of fish on a plate separate from what it was presented on? Honestly, the sushi rice was decent and I've had worse before. Their cooked food might even be ok, but I'm afraid they aren't going to get another chance from me."], ["Randy W.", "Service lousy- ignored at door. Tuna app nothing special. \"Curry\" wasn't curry, nor was it particularly good. Save your money."], ["Marie E.", "I love the food and prices at this joint. The food is always fresh and the service is fast. To top it off, prices are so inexpensive. Even though I'm not crazy about the decor, who cares. As long as I'm fed good, fresh, and inexpensive food, it's all good! I'm happy and my pocket is happy too :-). It's definitely a 'must go' place."], ["joe i.", "Been here twice and both times were great.Had the seaweed salad, and several servings of sushi.The sushi was extremely fresh and tasted excellent. The service was prompt and the beers were cheap. I'll be returning in the future for sure!"], ["Michael T.", "We were super impressed by their great service, friendly folks at the sushi bar, and the really fresh items. Definitely worth a trip to the other side of town. You won't be disappointed. Even though this is a new place, I sincerely hope they're able to keep up this level of service and quality."], ["Jason W.", "I have been here twice with a large group of friends from work. Both times were during the lunch hour. I love that their menu has a great selection of things other than sushi so we can gather with people who do not like sushi.The sushi chef Jason (I think he is the owner) has a great personality and sets the tone in the restaurant for excellent service. I have some dietary restrictions of no dairy and no meat other than fish and eggs. They were very accommodating and even custom built a dish for me. The food quality is really good and everything was fresh. I have tried the curry shrimp(normally chicken), Pad Thai with tofu and vegetables, the California roll, and tasted about 5 other rolls. The curry shrimp was a yellow curry and was portioned perfectly. Delicious!On our most recent visit one of my friends did their sushi challenge which consists of eating a roll covered in a ghost chili sauce. It was a lot of fun and made the dining experience even more sociable."], ["Vi M.", "I don't know where the negative reviews are coming from, but this place is great. I am suspecting it is from the competitors.     There are four other sushi places in the area, so one would think there is no need for another one, but i am really glad this place opened up.  They serve delicious food, have really nice staff  and very reasonable prices.  I have been here numerous times, and everyone I took here loves the place.  The food is that good.  The vibe is different from the other two popular spots, really peaceful.    They also offer Chinese dishes, the few items I tried, I liked them.  I am hooked on their rolls and the raw salmon. .  Their nigiri was great for the dishes I've tried.  Their lunch specials are super and you have to appreciate the happy hour special.I highly recommend them.  Try them, you won't be sorry."], ["Allison L.", "So im really skeptical when ordering Pad Thai. Alot of times its really dry and over  cooked, but i got it from here a few nights ago and it was incredible!! the only thing that i didnt like was that there was  just too much chicken and hardly any noodles, but it was still delicious! I also got the crab puffs which were also very very delicious, i lived in ahwatukee my whole life and never tried this place. Ive been missing out! I do not know what the restaurant  was really like because i got take out. I WILL be back and will bring some friends as well! Thanks for another good Thai restaurant around here!"], ["Tiffany T.", "The miso soup was probably the best I've ever had! The salmon sashimi was awesome, great temp, good size slices, totally enjoyed it! ***original visit date 4/3/13***"], ["Michael H.", "Once again Pacific Garden quenches my ancestral urge for raw fish. I would go as far to mention this is the best place in AZ for fresh sushi with a reasonable price. Ice cold sake!!!"], ["Chris D.", "This is a great Asian food place. Great sushi, great soup, good service."], ["Niko P.", "Went here tonight for the first time after my friend told me about the insanely spicy sushi roll challenge. First off, it was 10 minutes until close so we offered to leave, but the owner insisted that we stay anyway. So he makes us the Caterpillar roll, which was outstanding and then he prepared the insanely spicy roll for me. I finished it in under two minutes, (I dare you to try and beat that!), and my goodness, it was spicier than anything I have ever eaten, but it was more than just spicy because it had great flavor to it as well! I recommend this place to anyone who enjoys good sushi and great service. I will be going back for a long time to come! TL:DR This place is amazing. The owner is a great guy, and try to beat my time, (less than two minutes), on the spicy sushi challenge!"], ["Ayla M.", "Great lunch specials!!  always get full for about $7. Only complaint is that it is .50 cents extra per roll for brown rice, and no fortune cookies :("]], "Great Wall Cuisine": [["Joey H.", "Some of the best dimsum around. I have been stopping here for nearly ten years off and on!  The same people working here as ten years ago. It's crowded everytime I come with a great diversity of clients. A must stop if you love authentic dimsum. I would recommend this place to my family and friends."], ["Chanelle R.", "Last night was my first time going in to this restaurant and i based on the area it was located in i wasn't sure what the inside would look like. To my surprise once i walked in, the place was pretty nice. It was clean, and the bathroom was exceptionally clean as well. The guy who took my order was a little bit grumpy but he wasn't THAT rude for me to walk out. Once the food was ready, he came outside to get me to let me know, which i thought was pretty kind of him. Now let me begin on the food....... AMAZINGI ordered the kung-po chicken and i have to say it has been the best kung po chicken i have ever had.. filled with flavor, seasonings, and tasteMy mother got the fried tofu and the sauce that came with that was delicious. I am not a fan of tufu, but this one was really good and the sauce made a good combination. She also ordered an eggplant, i forgot which one it was but it was eggplants in a semi sweet sauce, she had no complains on this either. I was very pleased with the food, the portion size, and the price. I will be going back to try their dim sum.overall this place was really good, I don't care too much about the attitudes of the employees, i mean as long as they were'nt obnoxiously rude I think i'd be okay with that."], ["Vance M.", "So there is not much I can say here. Went here because I was told they had Dim Sum and I was in the mood. So to start the place was about half full so maybe that's considered busy to them. We were immediately seated in a booth but that's where the service ended. The first food cart came by and the waitress or server pushing it was immediately demanding and pushy that we just pick and not look. Personally I was just waiting for someone to ask what I wanted to drink. So after making some selections I realize the food had hair on it so I showed her and she took at. The issue is she didn't adjust our ticket and I had to tell her. Instead of her removing it from the ticket she said she would find more food to replace it. My stomach was not feeling that I wanted more food but I let it go. So three more carts come by and we get food items. Each time I'm asking for sriracha  or sweet and sour sauce and each time they tell me to ask my waiter. Wish I knew who that was because no one has showed and I still haven't gotten a drink. Finally I grab someone running by and they bring us some water. Still no sauces. In fact one girl I grab has no clue what sriracha even is. Finally someone brings some hot sauce and some other sweet and sour. At this point I get a work call on the cell so I walk out the door to take the call. Luckily my work date paid for the food and took it to go or I probably wouldn't have gone back in.End of story, do not go to this place under any circumstance. Horrible service won't even let you get to the point if the food is any good. First and last visit in one."], ["Randy B.", "Haha. I come here to eat all the time but for some reason why I never write a review until today. I usually go here with my friends and finally for dim sum. Dim Sum here are pretty good. I've tried their foods from the menu too and it alright too. The only problem I have are the workers here. They are not attentive at all. Waters are never refilled after the first time, the plates and dim sum holders are nasty. They need to wash their dishes better. I am not Chinese, so it's hard to communicate with the ladies their who doesn't really speak English. (Not trying to be rude). But not everyone who comes here are Chinese so it is very hard to talk with the workers here sometimes. The cashier lady is just a no no. She is always asking for tips. I understand you work for tip but let the customers handle it themselves, you don't need to tell the customers to tip.The food is good. Mainly go for dim sum."], ["Iris L.", "Leaving hungry. Waited 45 min and barely saw any cart come around. We used to love coming here, but last few times it seems to have gone down hill. Less selection, most food are cold by the time it gets to the table. Today was worst. Very rude attendant and no food available makes very unhappy customer."], ["B V.", "Dim sum - Excellent choice, fresh ingredients. Be adventurous, try the rice noodle - beef, pork, or shrimp. The coconut bun is stab-your-neighbor good. Good price as well. The staff is hit or miss, friendly one visit, rude the next. I do not always care about that, though, as long as the food is good.Menu - Noodles are great. House chow fun with gravy and e-fu noodle are great. Otherwise, go wild. Pick your favorite choice and then try everything around it for fun.(5 stars on good staff days. 3 stars on really bad staff days. Average is 4 stars)"], ["Francis S.", "Since I came to phx this place has been my family's choice of dimsum but recently flavor have become a bit stale maybe because we might too much there now that the flavor seems to bit  \"missing\" something. The only thing we get now is the BBQ bun and even that one is fading. Maybe just our taste buds but pls try it out. They really had us for more than 4 yrs. Might need to stay away for awhile and then come back after few months. :) still like there dimsum. A bit pricey but its the only dim sum I know near phx area.Update: the flavor is degrading a bit. Their usual spicy pork chop just got erased from our to go. It's so salty now. Also this came to my mind the pink slip. I think it would be nice if they put a English version of that paper that they come and check every time you order something. Wouldn't that be nice?"], ["Mike O.", "Legit Chinese for the pros. Umami flavors that pack a wallop that will leave your tongue swoll up and barely usable for speech. Win! When you walk in, the aromas are already piquing your palate. We were the only non-Asians in the place. It's a sign that you're in the right spot. Legit like China Doll on dim sum Sunday used to be. When you get the menu, skip to the back page where the real food begins:-- shark fin soup-- salty fish fried rice-- clams with spicy basil-- Hong Kong style noodle dishes-- lobster or oysters or both!-- crispy fried intestines-- golden mushroom with spicy fried tofu-- the list goes on!Don't let the cafeteria feel of the dining room put you off. You're here for the best goddam Chinese food you've had in a while!!*** the best jasmine tea at $0.50 per person for unlimited pours*** clams with spicy basil. Epic.  Take it with a glass of plum wine for perfect balance.  * sticky white rice that goes perfectly with every dish. Save for last after your plate is full of sauce. Devour.  ***** golden mushroom with spicy fried tofu. Leaves you gasping for air as your tongue goes into overload with umami. * delectable plateful of orange wedges to finish. Wow. Just wow. The neighborhood may be a bit ghetto west of 19rh avenue but this one is worth the trip. Don't miss!!!!"], ["T F.", "Used to be better. They've gone from okay to really meh. Went for dimsum one Saturday at 12:30pm and the restaurant was packed. After we were seated, we chose the fried squid, fried shrimp with sugar cane, and sticky rice from the dimsum cart. They were stone cold and hard. The manager's response was \"it is dimsum; it goes around the room.\" It only told me that the turnover was not high on certain foods and yet they chose to prepare them anyway and serve them after they are past acceptable. I have had dimsum in other cities and have NEVER had cold food that was supposed to be hot, dimsum cart or not. Just to be fair, the siomai, gai lan and jellyfish were okay. They were tasty and were the acceptable temperature for food going around a large room in a cart. That's the one star you earned. The noodles? It would have been nice if you added a few vegetables aside from the onions.As for the service, it was fine. Our server was a sweet older lady who was very helpful and attentive. That is the second and final star you are getting from me.Sad. Where else do we go for dimsum in Arizona? I suppose I will wait until I am out of town where they have real dimsum fare as I will be hardpressed to return here."], ["Janet N.", "With a hankering for Peking duck and those fluffy pancakes- the struggle is very much real here in PHX. Great Wall does a good job, but my roomie and I were fooled to think two small Asian girls could eat a plate of Peking Duck & an order of Hot & Sour Soup in one sitting. Nonetheless, the meal was good, crisp duck skin, good sauce but the soup was mediocre at most. Just remember, it's family style here.If you come here, you should be for their Dim Sum! They get pretty crowded, but it's worth it. I always get the basics when it comes to Dim Sum so I get the Ha Cao, Siu Mai, BBQ Pork Buns, Soft Tofu dessert, shrimp noodle. I got the chinese broccoli to try last time, but the oyster sauce was way too salty- so pass on that one. Other than that there's not much to it, just point to something or ask for what it is. A word of advice, drink tons of tea! I must've drank a whole tea pot to myself while dining here.Pretty good service, carts rotate quickly and are friendly. Love those old Asian women willing to have small conversation either about food on their cart or their business."], ["Carmella D.", "Amazing! As a New Yorker used to the best we were so happily impressed and service was great but the food was the best part. Every dish was cooked to perfection it was like eating in china town. We are alreadyplanning coming back and what we can take home. Don't hesitate to take a chance on Sat or Sunday dim sum-this is the place."], ["Ash D.", "This our first time here, waited 45 min for \"water & food\".... Asked the manager about the food... He replied, don't get panic food will be ready, there are lot of people (!!!!!!!)... I was speechless. Waited too long for OKAY kind of food & they messed up our order. LOLNever coming back again....."], ["Jennifer S.", "Went here with friends for lunch.   The cracklings rice soup is fun and yum to eat.  The other dishes are classic so come over for whatever Chinese food cravings you have."], ["Elizabeth S.", "Ahhhhh. The great hangover destination. Great Wall is probably one of the only times I've ever been to dim sum, which I know isn't saying much, because there are many connoisseurs of dim sum, that all agree this place is just so so, it's not SF or NYC. I think it's in a bit of a rough area. I've also been to quite a few dinners here, which I prefer.... For hot pots and salt and pepper crab. Also, the walnut shrimp, that is extra heavy on mayo, and well..... I could eat that for days. They also have good tea. I remember some weird white flower tea that I really like.They have a lot of events here (wedding receptions) I've been once or twice on Saturdays when they don't allow the public in, so try and call before hand or waste a drive all the way over there!"], ["Brian M.", "Mediocre at best. Previous reviewers must have been confused that they were somewhere good.  Hong Kong noodle soup with duck was a decently cooked portion of duck with a brick of egg noodles. The noodles were so over cooked or reheated that they wouldn't come apart and gave up after of few minutes of fighting them.Fried rice was decent, egg flower soup was decent but I think most people prefer it a bit thicker and not watery.   Sweet and sour pork was good but the dinner combo only has five pieces.  Chicken chow me in was alright, just wish they didn't use so much MSG you can taste it more than the protein in the dish.Might go back if I was stranded in the hood with no where else to go during a civil uprising."], ["Corabelle G.", "If I could give them zero stars I would. The service is absolutely horrid. I don't even think that word truly defines the service. A lady straight up came to our table asked us \"what do you want\".. We told them and she shoke her head and walked away. We had to ask for food multiple times and only once were we actually listened to. Fair disclosure we actually frequent this place a lot for dim sum but this one visit was absolutely the worst. I am sure we would go somewhere else of there was any other place that served dim sum in the phoenix area but choices are very slim."], ["Tiffany T.", "Food is alright, but Serivce is horrible! I went there with my family. After we Seated down for like 10min no server come up to take  beverage ordered. All the server just standing there and hangout. We told one female waitress  we need hot tea and she was rude answered \"just wait \". Rude rude rude, actually I don't know why a lot of time they were just look like mad.no smiles.no hi no bye !"], ["Belle C.", "THE BEST dim sum in Phoenix in my opinion. And they get 5 stars for being open 365 days a year. They were my saving grace on Christmas Day. And mark my words, my family will never stop coming here. Ever. We've spent birthdays and holidays dim summing here. The sometimes long waits and groups of people gathered outside waiting anxiously to be called is a testament to the quality and authenticity of the restaurant. The weekday dim sum options aren't as vast and great as the weekend but dim sum is really a good idea any day of the week for lunch before it ends at 2 pm. I can't speak for their regular menu because I've never had it but I wouldn't hesitate to try anything family style. Everything is so good. Please don't ever close down!"], ["Mia N.", "The outside of this place seems real sketchy. Actually the inside too.  But it's always packed on the weekends (with people waiting outside the door to get a table)!  So you know they must be doing something right.Personally, it's not my favorite place for dim sum.  Their chinese broccoli was better than at other places, but some of their other dishes like shumai, sesame balls with fig filling, were not as good as I've had elsewhere.Also, the inside is crammed!  Table are jam packed next to each other and I had to squeeeeeze in to get to my seat.  Yikes, you won't want to come here if you're claustrophobic and pretty sure the arrangement of their tables breaks some kind of fire code bc if I had wanted to get out of there fast, I couldn't have.But, this place will still hit the spot if you're craving dim sum so I wish them the best and hope they stay in business so I can visit if I'm ever on that side of town again!Note, we came at 10 am on a Saturday and there was no wait. but by 11 there was a long line!  so get there early."], ["H J.", "I have eaten at Great Wall since they first opened and I must report that the food and service are sorely lacking as to be not recognizable from the past. The overall rudeness of the wait staff beyond belief. Sad to see and will never return after going for 30 yrs."], ["Harrison W.", "The girlfriend and I love getting dim sum here. Honestly, it's really busy on weekends unless you go early in the morning (right after they open), so I wouldn't even bother coming here then. The service is about 10 times better if you go with someone who speaks Mandarin, as we did one time.Sometimes you genuinely feel like you're being discriminated against if you're not Asian, but I think it's just the poor service. One time when we went during the summer, it was incredibly hot, and we all drank our waters incredibly quickly, and the service was so bad that servers never came by again to give us anymore. After a while, it feels like carts avoided us and we were not sure if we made sort of faux pas. Just don't expect great service. The food is generally worth it though. If you've been to other dim sum, you'll know they don't have the most variety in the world, but hey, it's cheap delicious dim sum."], ["Tony K.", "We stopped by for dim sum. . The restaurant  was very busy. So I expected  to get fresh food. Several  items were cold . Very disappointing."], ["Whitney P.", "Every time I have come here for dim sum on the weekends they never have anything left. The cart takes forever to get to my table, I usually have to wait ten minutes. The cart people always look unhappy. I went today and they didn't even have shu mai and the shrimp dumplings which is the most popular. The server didn't even care, all he said was that they don't have anymore at all. If they don't have anymore then why don't they make it?! It was only 1pm and dim sum ends at 3pm. I also asked for turnip cake and they said there's no more too. I came hungry and left hungry. Their BBQ pork buns were barely filled with any pork. What a disappointing experience. Since I've moved to the west side of Arizona, this is the only place nearby. If you live on the west side I would highly recommend Phoenix palace instead located in Chandler even though it's further away. Their customer service and dim sum is far better in quality. I will never go to Great Wall again for dim sum."], ["Larry B.", "Best Chinese food I've had in Phoenix so far.  I can't wait to go back this weekend foranother Dim Sum fix!  I used to live in Honolulu's China town and this place is just as good!  What a find.  I'll be back twice a month fosho!"], ["Wendy W.", "Almost best Chinese restaurant in Phoenix. Served morning tea during lunch time and my favorite is chives dumpling. Whenever I went there it was sold out... But it deserved waiting 10 min! Soup is only served on weekends."], ["Jennifer O.", "Let me start by saying I'm really glad I came here with people who knew what they were doing and could communicate effectively with the staff. Had I come here alone, I think I would have been lost. Anyway, I came with a meetup group of about 10 people. We packed in around the table and ordered tons of different food items. The best items, in my opinion, were the fresh wide noodles with the meat inside, the bok choy, the shu mai, the pork bao and the custard dessert. The bok choy was especially delicious, sautéed in some savory sauce, yet still a little crunchy. The rest of the food was highly fishy and not so awesome. I tried to be adventurous and eat all of the food on the table, so maybe that was my problem. Anyway, I would like to give it another shot, as there were some tasty looking items on others' tables that I would like to try, but it isn't quite at the 4 star level yet in my mind. PS because of the big group, we had a lot of food for only 8$ each, not bad. I think if you came here with 2 people your bill would be significantly higher."], ["Astaldo T.", "Only good dinsum place here in Phoenix.  Staff us friendly even though most of them don't speak English if you need help there is always someone coming to help and understand English,  Chinese or Vietnamese.  Price is Standart for this kind of food.  If you want to to eat here do not come during holidays..  I remember we had to wait for A hours last time we went here on mothers day..  Never do it again!  On the weekend this place is also packed.  Expect to wait 15-30 min.  But the food is much better on weekend.  They have much more choice.  So up to you.  If you don't mind waiting than come weekend. Else come during the week.  No waiting time!"], ["Blue W.", "This place gets very crowded on the weekends: many Asians come here so for me that's a sign the food is authentic. I'm only talking a out the Dim Sum as I haven't tried any of their other offerings.We were 10 at the table so quite a few, but the food carts passed by often enough to keep us all well fed.I have a passion for the Siu Mai and the shrimp, the chicken in banana leaves and the new to me horseradish squares, These are really tasty and not at all 'horseradish-y' so even though I don't like spicy foods these are now a fave of mine. What I also liked is that after finishing our meal we were satiated but not feeling 'heavy', and I did eat quite a lot: you know how it is when you pick from a lot of different plates.....you eat way more than planned !!There are several dim sum plates and baskets we didn't try, so that means we will just 'have' ! to come back again and then again......."], ["Bianca L.", "I wanted to try Dim Sum but it ended at 1500 :-/I came a few mins too late- ended up getting orange chicken & Mongolian beef. Chicken had a perfect crispiness to it"], ["Liz J.", "Pros and con's as follows.Pros:  overall variety of food is good.Shrimp sushi roll then deep fried-goodSome funky sticky rice -too thick and sticky-,not goodShrimp noodles, good. A texture I'm not particularly fond of, but flavor good.Lo mein type noodles--goodDuck-good, despite not a lot of meatTwice fried pork, really good.Chicken wings-really good ( not really Asian or Chinese but I really like crispy wings)Shrimp shumai really goodGreens-i think they were some sort of asian broccoli.My favorite things were the tea, sesame ball with sweet filling and shumai.Con's,:  way too busy and crowded but there's nothing you can do about that. That's just the way dim sum isI don't like getting passed up by anyone with the carts. Some don't speak any English so you don't know what they are offering and combine that with the din and the language barrier, it got a little frustrating. Prices- no clue.I love Asian food and rarely get anything good in the valley so this is quite good. I will go again"], ["Frank D.", "Much different experience the second time around. The second time reveals a disturbing issue. Well this is absolutely disappointing to write. Especially after writing a favorable review of Great Wall the first time around. But our experience here was not good during our last visit.First, we were not acknowledged when we came in the door. We had to pardon an employee (who appeared to be doing nothing) to take us in. He then proceeded to take us to a booth after we requested a table and chairs. We asked again to be seated at a table and chairs and he finally obliged. We were given menus and that's when the real trouble began in terms of service. First, we ordered a lot of food. 2 main dishes, 2 appetizers, 2 drinks, and an extra side dish to split. It was my last night in Phoenix so I wanted to go all out and sample some different things. Besides, we have the money so who cares right? Well, the drinks came and when we ordered the server let us know there were no BBQ pork ribs, but didn't offer an alternative. When I picked something else, he rolled his eyes and said \"So you really want pork?\". Yes. I do. So we waited for our appetizers, only one of which came out before the main dishes. The others came out with the dinners. Now the food was good, I have no complaints there. But when the person bringing us the food came out, she would't even look at us. The feeling I was getting was that they were either disgusted with our presence or just didn't care to talk to their non-Asian customers. I say that because the servers were \"chatting up\" the Chinese folks at their tables (it wasn't a busy night only a few small families), but they were literally ignoring us and a hispanic family sitting adjacent to us. I wouldn't normally write about that but it was so egregious I have to say how it appeared to look. I wish I could say it had something to do with language barriers and being comfortable with your native tongue maybe, but they spoke English fine from what I saw and it just didn't feel good to be ignored. Anyway, no refills on tea, water, or our main drinks were given. When we were done, we were ignored for 20 minutes until I glared at another server who was having banter with an Asian couple near us. I guess he told our server to bring us a check. So we pull out the Amex and what do you know? For the first time all night our server immediately comes over and says in perfect English \"we don't take American Express\" (even though the tray the bill was on says \"Amex Preferred\", but that's neither here nor there.Wow. Once it was time to pay, he's on my shoulder like a parrot. Prior to that, he wanted nothing to do with us. Finally, the woman who came out to put the food in 'to-go' bags literally ignored us even after I smiled and tried to talk to her. She turned her head away when my date tried to thank her for putting everything in bags for us. And our sending off? Waiting another 10 minutes for someone to come take the card before giving up and walking to front and giving the bill to someone who appeared to be a manager. No tip given. You've got to be kidding me. In the end this experience wrecked what was supposed to be my new Chinese food place. The service ruined what was great food. The feeling I got while there was that they didn't particularly care if we (non-Chinese customers) were there. And that is really sad. Needless to say, we won't be coming back."], ["John F.", "Very busy on the Weekends even as early as 10AM.  On Sunday,  I was alone and wanted Dim Sum but didn't want to sit by myself.   I called Great Wall and they said that they do offer \"Dim Sum TO GO\".   I wrote down my favorites to avoid a mix up.  Upon arrival,  I went directly to the Cashier to avoid the long line waiting for a Table.  The Cashier quickly wrote up my order and the wait was about 10 minutes.  The Order was 100% Accurate.  ***While waiting, I did pick up a Pink \"Dim Sum TO GO\" Order Form for future Dim Sum's TO GO.  They had them on the side of the Cashier Stand.***   My favorites include: Baked Custard Bun, Baked BBQ Bun, Roast Duck, Shrimp and Pork Dumplings & Shrimp Spring/Egg Roll."], ["Phisit P.", "I've been here probably about 5 times. Some of the occasions were for lunch, dinner, or for a wedding. Great Wall looks small outside, but when you walk in it is a pretty big restaurant. When I came here for a wedding it was very decorative and the menu if already set up for you. It was an Asian wedding and some of the food that came out for the guests included soup, seafood, fried rice, and dessert. Coming here for lunch is much different. It is not as busy as a wedding would be of course and mostly you see big groups there such as a family. Every entree is family style so we basically all just ordered and shared the food within our party. Food is always delicious and tasty there. I think I just barely come here because I live on the other side of town. Now, for that Saturday we came here for dim sum. It was my first time here for dim sum, but I heard great things about Great Wall. As we drove into the parking lot it was already full. The wait was maybe about 20-30 minutes for us and looking inside it was pretty packed. So, I thought wow, maybe this place is all the hype. Once we got seated we got shumai (I think that's how you spell it). It's a pork dumpling. We also ordered chicken wings, shrimp dumplings, chow mein noodles, and chicken feet! I know a lot of people that may be unappealing, but the chicken feet was very good. I loved it! Overall, I can always recommend this place because I basically enjoy the food they have here. I would say when I had the best tasting of  food was during the time I came here for a wedding. The next best is during the time they serve dim sum, but as stated above it does get busy so coming here early would be the best thing if you do not want to wait. Staff was good, but we did keep seeing the same person with the same cart of food like 5 times. It sucks that its a pretty far drive for me to get here or else I'd be over here all the time for dim sum. So, on that note I will definitely be back here again for dim sum and if you NEVER tried or experience it, mine as well get to Great Wall and try it!"], ["Diana H.", "For dim sum in the north valley of Phoenix, it's the best we have!  Get there early - we were seated (party of 7) immediately at 1020am on a Sunday.  Shortly thereafter, the wait was very long.  Dim sum is very good - some dishes hot and some warm.."], ["Joyce W.", "Like most west valley Asians would say, Great Wall is a staple.  I've been to Great Wall a hundred times for dim sum and banquet-dinners since I was  kid --- heck, maybe even since I was born!   It's hard for me to even imagine how my childhood would be like without Great Wall.From before their renovations to days before the kitchen fire, Great Wall has always served up delicious food.  As it is the only major Chinese restaurant in the west valley, Great Wall is always busy with a flurry of customers at any given time of day.  They have delicious hot dim sum and they have an even more amazing 10-course dinner.  If you don't understand Chinese customs, this place will always be LOUD!  Chinese people are loud.  We like to hear ourselves talk over other people's voices.  I think it adds to the charm of the restaurant.  ;)Great Wall specializes in a lot of authentic off-the-menu dishes like duck tongues, fried pork intestines with sweet & sour sauce, fried fish heads with eyeballs the size of golf balls, and all the other stuff probably not palatable to people who didn't grow up around these kinds of foods but it's all reminiscent of  majestic China.  *wistful sigh*Anyways, Great Wall will always hold a soft spot in my heart.  From sweet karaoke-infused memories to visions of old people dancing to terrible Chinese music.  Cheers!"], ["Chris H.", "Fantastic authentic place for Dim Sum. The prices are reasonable and the food fresh. Lots of choices and they have a standard menu.Theses one of those places thats tucked away in a shopping plaza that looks slightly questionable, but you know the food will be good. Everything checked out good as I looked around and it seemed like I was one of the only non-Asian persons there, which is a very good sign that I am in the right place! When they have live fish tanks in the back where you can pick or buy your seafood you know its the real deal!Service was a bit slow, but they were fairly busy when I was there for lunch, overall everything was good.I would go back again next time I get the Dim Sum craving."], ["Dwayne O.", "Have been here mainly for large celebrations such as wedding receptions, Chinese baby red egg, funeral memorial meal and Chinese New years. So we have never eaten here ala carte. When you eat there for a large celebration it is generally between a 8 to 10 course meal. When eating this way you eat \"family\" style so you get to try multiple dishes and get a little of each dish and then spin the dishes around on a lazy Susan to share with the others at your table. The servers were okay but the restaurant itself is good when they have a banquet style.Nothing to bring you back because of the decor or service, would probably only come here for the banquet."], ["Mary N.", "The food was decent, but I just didn't like how packed it was for dim sum. It would be nice if the cart came into our section often. So we didn't get much food and variety."], ["Saul S.", "Having toured Hong Kong and China are times and moving from New York this is the only place I have found in the Phoenix area that holds a candle to the authentic flavored you would get over seas. Must tries are the roast suckling pig, Peking duck, any of the dim sum is superb, and the noodle dishes are always fantastic. Also having live prawns, crabs and geoduck is a real treat I. The dessert"], ["Bob D.", "Poor quality Dim Sum. You will get slightly better at C-Fu Gormet or Phoenix Palace in Chandler (both at Warner and Dobson). That said, none of these restaurants compares to the quality of many large city Dim Sum restaurants like Yang Sing in San Francisco. The Great Wall clams would be much better without the horribly bitter sauce dripped over them. And someone needs to teach them how to make sesame balls which should have a sweet yellow bean purée without a bitter after taste. We had several other dishes -- none up to par.This was our third and last visit."]], "Maxim Restaurant": []}