{"Zinc Brasserie": [["Steve S.", "I really enjoyed my dinner and the atmosphere at Zinc. The crumbled chicken salad was filling and freshly made. My only complaint would be that there was a little too much dressing. However, it was delicious. A respectable wine selection that was pricy but expected sincere it's the airport. Definitely with checking out!"], ["Alan J V.", "It's not often you find airport food that doesn't bother you on your flight. It's almost impossible to find absolutely fantastic food in the airport like this food.     Since none in my travel party had eaten, we walked in here for something small to eat before our flight. To our utter surprise the menu looked extremely appetizing. We all had breakfast items. I had the granola and they had egg dishes. The granola was yummy though a faster meal might be better if your in a hurry. It took me sometime to eat it all. It was a big bowl.    My friends Omelet was probably the best of all of our meals. The little bite I tried was nothing like you'd expect at an airport but fit the expectations you'd have at a french bistro.     If your in Terminal 4 for a layover and have time to eat, try this spot.I'm going to go to the one in Scottsdale and hope they are just as good. I'd love to eat the same food without having to fly our of town."], ["Christie S.", "How does one arrive at PHX three hours early for a flight and miss it? Well, you stop into Zinc Brasserie with your love, order up charcuterie, salad, sammies and Champagne and lose track of time. What do you do when this happens? Stop at US Airways service desk and get booked for next flight, call your love to meet you at Zinc again, and laugh! This Scottsdale institution has a surprisingly lovely  -- tin ceilings; cool lighting -- outpost in the airport, serving up some of their signature dishes and beverages with the same hospitality and flair as the original location. You can take away food for your flight, but I'd definitely dine in with time or a layover. Anything but typical airport food and dining experience. * extensive wine list, including by the glass * ** salads are super fresh and creative ** *** delicious onion soup ******* many dishes feature high quality cheeses, for fellow turophiles ;) **** ***** our server was super, from the OG location: he has sabred more than 100bottles of Champagne! *****"], ["Arti S.", "At the airport ready to take off.. We had an hour before boarding.. We ordered breakfast  and got done in a half hour.. With another half hour to spare.. Loved the food, the ambiance and the service was great!!!  Thanks Tarry for making it a fun start of our journey back home!  Happy Halloween."], ["Michael M.", "The five stars are remembering that this is an AIRPORT RESTAURANT.Man, what is there not to love. I was having a stressful trip and the last thing I wanted was another soggy pizza from Sbarro or a food-court burrito that rips apart as soon as you unwrap the foil.This little French bistro had a relaxing ambiance. They had a great selection of food that you don't see at airports (as in, you can actually find new dishes to try that you haven't had before). And the food is good! Its relatively decently priced. I mean its expensive, but considering its in an airport...The service was great and quick (important during a layover).Maybe not quite 5 stars in the real world simply due to price but awesome for an airport."], ["Angela H.", "I decided to have the crepes for breakfast during a long layover this morning. The food was good, but not my favorite. The crepes weren't super sweet, but just sweet enough.Service could use a little work... I had my order taken by the manager, then water brought by one waiter, my drink brought by another waiter, the crepes brought by a third waitress, and then a fourth waitress took care of my check. Wow!"], ["Marissa W.", "Very great place to be airport food! Came here for breakfast and enjoyed every moment of it. It makes me want to fly to Phoenix just for a meal! I had the Zinc Omelette along with some coffee. The omelette was superb! Coffee wasn't bad. The star here was the croissant! I had a bite of my mom's and it was great! Buttery and toasted to perfection. I didn't have any add-ons or substitutions so I can't speak on that aspect but the prices here are a little steep, I think it's worth it though. The staff was very friendly and we didn't have to wait to be seated. Overall, a good spot if you have a little time for breakfast before 10am."], ["Rick Y.", "The place is nice and let's face it, we're in the airport so anything beyond grab and go is certainly welcome.  So my flight was delayed and wanted an old fashioned and was recommended the rye direction which for a knockoff of an old fashion is pretty damn good.  The food is a bit on the pricey side though.. Fries are like 7 bucks and I went for the flat iron steak which was cooked good but lacked in flavor.  As I'm writing this the waiter comes over to notify that I gave him too much money for a tip... So originally this place got 3 stars but now it gained another two for the waiter being honest.  Food is good but pricey, drinks are good but hell I'd pay 20 for a good drink."], ["Weon L.", "I visited Zinc Brasserie at Phoenix Airportto eat dinner because my original flightwas cancelled and I had to wait a few hours inthe airport.I ordered Grilled Chicken Paillard and my colleague ordered Flat Iron Steak Salad.Both were delicious.Grilled Chicken Paillard was mixed ofPomme Puree,Haricot Verts ,ChickenShiitakes Mushroom, Tomato,Garlic basil Jus etc.unexpectedly, Grilled Chicken Paillard was delicious because restaurants in the airportare usually not delicious.Steak Salad was made of five pieces of steak,Lettues, Roquefort, walnut etc.It was also delicious.I was tired to wait airplane but I was refreshedby these delicious food."], ["Elisabeth E.", "Stopped by during my layover in Phoenix hoping for a place to enjoy a drink and charge my phone. I was seated quickly and the server came over right away. He was very gluten free aware and helped me navigate to the steak salad with the mustard champagne, instead of blue cheese dressing. I enjoyed a couple of 11.00 house glasses of wine while I charged my phone and ate. There are chargers all around the restaurant, pretty much at every table, which was awesome. The salad was ok, iceberg lettuce can only be so appetizing. The steak and dressing were tasty, it wasn't till I was almost done with the salad that I realized they hadn't put the crumbled blue cheese on it. Apparently they assumed if I couldn't have the dressing the cheese itself was also off limits. They brought me a little and I enjoyed it with the remainder of my salad.Salad was a good portion and about 16.00. Overall portions were good on both wine and food. Service good and very prompt. Price expensive, but hey, it's airport food. Atmosphere is nice with comfortable booths, high top tables and a bar with tv. Also lovely windows overlooking the runway. I'd certainly stop in here again on another layover."], ["Joe C.", "During a 2+ hour layover in PHX, we were headed to La Madeleine to get soup for the wife when we saw the French Onion Soup on the menu here.  Since we can do \"La Mad\" back home, we said what the heck and stopped in to Zinc.Now, as everyone knows, French Onion Soup is general served with a \"crouton\" on top, on which the cheese melts.  But if you're gluten free like the wife, they'll just melt the Gruyère cheese right on the top of the soup-filled crock.  Even though it would probably have been more fun to be able to have the cheese on toasted bread on top (poor wife), she was pleased with the soup.And speaking of Gruyère...  The truffled Gruyère Zinc Burger was as amazing as it looked.  Five stars right there.The dessert we chose was some sort of chocolate bread pudding/cake situation, with a side of ice cream with \"house made caramel sauce on top\".  Eh.... Fairly forgettable (we didn't finish it, even splitting it between the two of us... well, wife could only have the ice cream).  Maybe pastry isn't their strong suit.  Overall, it's pricy because of the airport premium, and it's trying a bit too hard to be a \"bistro\" (which for some reason, makes people think they should charge 10% more).  And we didn't have to wait very long for our food, which is necessary in an airport.  I was pretty happy with my burger, \"frites\", and beer, and there were plugs available between the tables to top off the devices. 3.86 stars.  Which for an airport dining stop, is pretty darn good."], ["Josh H.", "This place is extremely over priced. I expect a $17 burger to be cooked to order, it wasn't. And there's nothing about the burger that justifies such a ridiculous price. The staff are clearly bored and have better places to be. Save your money and eat ANYWHERE else when at PHX."], ["Samantha G.", "What is up with everything closing so early at this airport? Food service ended by 7:30pm. Last call was at 8pm. Bartender was irritated with al who arrived after 7:45pm. Not friendly at all. Apparently, it was quite irritating that I ordered a water and a coke to go with my wine. He was not pleased indeed. Wish I had gotten to try the food. Menu looked promising for an airport location."], ["Gracie A.", "A buddy of mine and I stopped here on a layover in July. We both had a beer and shared a burger (came out to $50) and then jumped on our flight. 40 minutes later we were both puking our guts out. I left a comment on their FB page, and their actual response was \"maybe it was elsewhere. It's an airport bitch. Maybe something you touched. dumbass Bitch\". Just wow!"], ["lisa h.", "Meh. Food was ok but way over priced for what you get. 4$ for avocado is a little extreme. But, this is the airport so you're swindled no matter where you go."], ["Matt C.", "My favorite stop for a few preflight sips of wine. Great selection of wines and the food is fantastic as well.  I always try to get to the airport a few minutes early to make sure I have time to stop by.  I even stop here when arriving in Phoenix sometimes lol.The service is always speedy (great if you are trying to catch a flight) and the staff are all very friendly. Best restaurant experience at Sky Harbor."], ["Andrea S.", "For an airport restaurant where people actually have somewhere to go, the service is painfully slow! No water refills even though I drained mine in the first 30 seconds, no asking if we need anything else, It was a slow and painful experience. We had omelette, crepes, and zinc croissant. I am a fairly light eater but found myself still hungry after my zinc croissant (even after including the offensive FOUR DOLLAR upcharge for a single tomato slice). My husband was still hungry after his omelette and so both of us foraged on the ample remainder of our kids' crepes. The crepes were not good, but we were still hungry. Way too strong cinnamon flavor and just a funky taste with the creme fraiche. Will I be back next time I'm wasting time in terminal four at Sky Harbor? Sorry, no, this restaurant is a huge fat fail."], ["Cheryl R.", "Horrible sexism experienced in Zinc this evening when manager on duty refused to play women's FIFA and instead changed bar televisions to basketball regardless of several customer requests. He called me \"little lady\" and \"girl\" several times. I'm 40.Women are the main consumers of wine in America. Not in Phoenix. Phoenix: the friendliest airport. Not for women."], ["Scott P.", "This place is a great alternative to the options at Sky Harbor. Yeah, the food is pricey. Yeah, it's heavy on the belly. Yeah, it takes awhile for your order to be ready. But in the end, it's worth it. I've had their sandwiches several times, and they're always top-notch. The pork belly is a bit heavy, but if you have someone to split it with then it's just about perfect. And their fries will knock yours socks off... but chances are you have a spare pair in your luggage, so that shouldn't be a problem. If you have a bit of time between flights or before you take off, then you'd definitely do well to pay this place a visit. Sky Harbor has gotten some great places to dine in the past year, and this is definitely one worth a visit!!"], ["Joy M.", "2 hour layover. Guess I'll findsomething to eat!I was going to try Humble Pie, but ended up here instead. Frites, fries... Whatever, they were just okay. I broke the cardinal rule by eating them last. They got cold and squishy quick! Not much crunch, but loved the aoili dipping sauce.The pork belly sandwich was okay. The fig jam paired with green apple, little pieces of arugula gave it a nice sweet savory balance. I was a little indifferent about the bread. On one hand it was stable and didn't get soggy with all the sauce and junk..... Then it got to a point where it was just too much to handle. I started taking the contents out of my sandwich and ate it piece by piece. My waitress was great and even made a comment 'bout the picture of my husband and I on my debit card. Kudos for that ;) Otherwise.... I thought the food was mediocre for the price."], ["Cawan S.", "Review based on the food only******Don't come here for the anticipated service and fine dinning atmosphere. Come here for the fine wines, cold beer and the red wine braised pork belly. It's simply amazing. Don't be tempted to order anything else but a nice glass of wine and the pork belly. The pork belly here is some of the best I have had. You wouldn't expect this type of food in the middle of an airport in phx. I have many choices were I can spend my money but when I am stuck in the phx airport I choose to spend it here. Simply awesome."], ["Jon P.", "OMG - I don't normally review unless I've had a complete experience - however what's giving them 2 stars is total price gouging. My wife and I were going to purchase two ready made chicken sandwiches on wheat bread - nothing special - sure they looked good enough to eat... but for $12 each - $24 for 2 sandwiches that were plastic wrapped, made who knows when, refrigerated... $24 really??? That's totally crazy! We ended up just a few doors down at Cartel Coffee Lab where for $7 each ($14) we bought two made to order sandwiches on ciabatta bread. That's more like it..."], ["Brian O.", "We had a 2 and one half hour layover in Phoenix on our way to Seattle.  Since we had lots of time, we decided to eat at Zinc Brasserie for lunch.  My wife had the basil chicken baguette with brie cheese and I had the French ham and guyere cheese baguette.  Both sandwiches came with French fries.  The fries were sprinkled with paprika and were served with chunky ketchup.  Definitely a notch above most airport food.  Service was excellent.  Cost of meal a little pricey."], ["David L.", "I got 2 perfectly made drinks (double jack and coke!) while sitting at the bar and the pork belly starter was REALLY delicious!  It came with sliced green apples on top, arugula(I think?), and some fig spread that made the pork belly dish perfect.  Went great with a whiskey drink!I will return!  It's worth the walk away from your own concourse if you have the time."], ["Nicole G.", "Basil grilled chicken baguette...... AmazingExpresso martini.... Amazing!And.... Service from Beth behind the bar who I have encountered twice now flying out.... So personable and down to earth.I myself work in the industry and it's hard going out because I pick things out constantly about what is wrong.  There was nothing wrong about my experience today.Next time I fly out hopefully it's in the C terminal of southwest and I get to come back!"], ["Jessica C.", "Did I land in Scotsdale... Or Paris?! It's not often that you find a restaurant that can capture the essences of Paris... Let alone at the airport. But kudos to Zinc! The Creme Brûlée French toast with fresh berries was excellent and everything from the staff attire to the decor and soft French music pleasantly captured the charm of a French Brasserie."], ["G U.", "Service is fine, wait for the upsell, it comes every time. Menu is small and the food is overpriced even for an airport. $16 gets you a big salad with $3 worth of meat and a giant pile of iceburg lettuce (which adults know has almost zero nutrition). This is place is all about profit margin. Aside from the bloody mary I ordered, I actually regret not going to McDonald's instead (and I hate mcds)."], ["Rahsaan B.", "If you like inattentive service than this joint is for you. You want your burger to look like it got into a brawl in the back than this joint is for you.You want to wait  10 minutes after you sit down for your drink order to be taken then this joint is for you?Oh no? run away then and hope the other resturants opening up in terminal 4 open soon."], ["Matt T.", "Exceptional dining option for an airport.  Lunch was excellent, and it was hard to believe I was eating in an airport, and not a stand alone restaurant."], ["Patrick G.", "Expensive but great!  Nearly all menu items are above-good, but their omelette will force you to reconsider that Paris trip in favor of going to Terminal 4. I actually kinda look forward to Southwest 4506 being delayed... AS MORE OFTEN THAN NOT... boo, Southwest!    But I eat here all the time.  Would agree with Lee though about the pate being a being bologna.  I've had only good service at the bar and at the tables, but less luck at the \"high tops\" in the bar area.  Omelette and salad again tonight.  Can hardly wait!!"], ["J B.", "Sitting at airport for breakfast, had to oatmeal, huge bowl of steel cut and few berries. It's good but way too sweet and runny!!!! Too much vanilla in it.There are only a very few customers at bar and service is awful.  She keeps seeing my coffee cup is empty and not once asked to refill it, very annoyed! So if you want more coffee, you have to get her attention or just grab it yourself. She's a mean one!!!!!"], ["David M.", "Save your time and money. Very overpriced for such small portions. My wife ordered a breakfast sandwich and was still hungry afterwards so we stopped at Paradise Bakery, also because I had ordered oatmeal and they were out of it. My wife liked her sandwich, it was just small and overpriced. Service was extremely slow, even though it was not very busy."], ["Ryan C.", "Very expensive and painfully slow service. We stopped in here while waiting for our flight this past Friday. It was towards the end of the night and you could tell everyone was more interested in getting out of here than serving customers.  We waited a solid seven minutes from my wife's glass of champagne, followed up by another five minute wait for me to get my drink. This is inexcusable at an airport bar.  We have no intentions of ever returning here."], ["Eliana V.", "This place was awesome! I only ordered a beer and a side of french fries but it was enough to want to rate them 5 stars. The beer was good as it always is and the fries were delicious as well. They were crispy and had this delicious cheese crumble on top. Love it!This is not what you think of when you think of \"airport food\"!"], ["Dexter Y.", "Walking the entire airport looking for good food my last hope was this one, and let me tell you that there is no other option like Zinc inside the airport. Food exceeds my expectations. Service was very good as well. Would love to eat again next time being there."], ["Brandon T.", "Well the atmosphere is pleasant and our waitress was sweet. But the food and drinks aren't worth the price and not good quality. Burger overcooked and food bland and drinks weak."], ["Miss H.", "I ordered the red wine pork belly & it was good. Next, I tried the Duck Pate & it was ok. I played with the fig that was served with the pork belly & put some on the pate since I'm not too crazy about the mustard & it complemented the pate somehow. The toasted slice of bread was good and toasted the way I liked it. Service was good.  If I'm Phoenix bound again, I will return to sample the other food in their menu. I give this place 3.5 stars for now"], ["Jenny L.", "I will admit, I do not have high expectations for airport food, but I've had much better food at other airports restaurants. The pork belly baguette was mediocre. The pork belly was so overdone, tough and chewy. The fries came out lukewarm and were overly salted with a heavy hand on the paprika as well. No bueno. The service was at least quick and friendly, but I'd pass on the food. Maybe the drinks at the bar are better. :/"], ["Jessica B.", "Bottom line is that it's still airport food. I had a chicken baguette and the bread came out tough and chewy as well as my pieces of weird looking chicken. The place has potential and I would probably enjoy a few drinks here but I don't think I could come back strictly for the food."], ["Gloria C.", "Between my delicious and gigantic omelette, and my fiancé's french toast, we had quite a pleasant breakfast surprise while enjoying an extended layover in the Phoenix airport. I always like having the option of sitting down and eating in a comfy banquette setting as opposed to being shuttled through a cafeteria line then searching for an open space to sit and eat somewhere three terminals away...The coffee tasted freshly pressed, the service was just attentive enough, and I definitely look forward to spending a meal here again!"]], "Vincent Market Bistro": [], "Merci French Cafe & Patisserie": [["Ali C.", "This place is a hidden gem in Old Town!!! The owner and chef is French. And he makes everything from scratch!! Even the ice cream!! Literally everything on the menu is always cooked just right with so much flavor. You can tell the owner takes pride in his work and his food. He always comes out to greet me and say thank you for coming in too! Try the Croque Madame, the French Onion soup, and the macarons! There's also sometimes a special on the special board with chicken and a mushroom sauce that is to die for. :) But my ultimate fave is the Tripe Chocolate pudding dessert. I love supporting local places and this place is one of my faves to support because of how great the owner and the food are!!"], ["Tammy K.", "what a hidden gem. The food was really good and loved their decor incorporating a little bit of Mexican flavor. I had the cranberry Brie open face sandwich, florentine eggs Benedict and the hot chocolate which tastes like chocolate syrup. The milk and foam was amazinggg. will be back for sure!"], ["Nicole S.", "Went here for a linner (lunch/dinner) and it was great! The shopping plaza Merci is located at is undergoing construction-- and has been for awhile. It's right next to a Subway... You're being fair warned... Just prepare your nose for Subway stench assault before you walk into Merci since it sneakily creeps over to their front entrance.  The cafe is \"cutely\" decorated. I love their bright colored placemats. Menu is to die for. There's something for everyone's different taste buds. I got the asparagus, salmon and mozzarella quiche with side salad. It was delicious and just the right size. Their pastries also looked super delicious in the cold case but my tummy was too full. They have a square card reader so when you're done eating just head to the front and pay then you're on your way."], ["Sam A.", "Best croissant outside Europe - flaky and buttery Latte was perfectYogurt for once was plain - thank you for not ruining it by sugarifying it ;) lots of yummy berries on top"], ["O'Zandra F.", "Very quaint little French bistro. We went for brunch one Saturday. Alexi was our waitress; friendly...definitely a people-person. I ordered the delicious ham, bacon, and cheese quiche,which came with a garden salad and fried potatoes. Mr. O'Zandra had the smoked salmon open-faced sandwich. He's still talking about it! Great experience! We'll return for dinner for sure!"], ["Ashley M.", "What a quaint little gem! Enjoyed a nice relaxing lunch on the patio with my pooch; my friendly server Alexis even brought out chilled water for my pup. I started with the vegan asparagus soup- holy cow- asparagus soup?! Delish! The dirty chai I had was on point as well as the open faced club. I wrapped up the lunch with a creme' puff with raspberries and the most amazing blueberry lavender infused icecream! They offer free wifi and were ok with me sitting on the computer for a while. Chill place. Cutest place mats and interior decor. I'll be back for sure!"], ["Judy L.", "I hate to give 1 star but I just couldn't even like the place.  I was so disappointed by the service and food.  The server did not know the menu or how to make drinks.1.  Ice coffee:  first cup of coffee:  salt was in the sugar container.  second time:  lots of coffee grinds in the cup.  third time:  the coffee was watered down.  2.  They were out of spinach, out of croissants, & the eggs were under cooked.3.  Lorriane quiche was bland and super smallWe got the last chocolate croissant.  That was the best from the whole experience.  I hope it was an off day, but I am going to pass and try another place before coming back."], ["Jeanette K.", "I was going to write a scathing review of this place but I changed my mind when the chef personally came out to diffuse the situation. All has been forgiven and my review score has been based 100% on just the food.Before I explain what happened, let's first talk about the food.Their croissants are really quite a special little treasure of Scottsdale. Buttery, crisp perfection. I could have easily gobbled up three of these golden babies.The breakfast sandwich was a tad salty for my taste but is still a great choice.The eggs benedict were cooked very well but I thought the hollandaise was slightly lacking. I think it needs a tad bit more tanginess and a little bit more in portion. I actually had to ask for little bit extra on the side. I can see why locals love coming here. It's a really cozy and quaint place with super solid food.So why were we so incredibly upset at first?The group arrived at 10:30 am. We were not asked for our order till 11:00 am. The restaurant was NOT full. There was no line out there. They simply forgot about us. By 11:40 am (over an hour had passed since we were seated), we never received our food and tables that came just 15 mins ago (11:25 am) received their food. At that point, I was furious and the first server I approached had the utmost terrible response to me. There was no apology at all. Rather, she merely responded, \"Well, maybe you ordered something really special that took a long time to make.\" That response made no sense. I ordered a smoked salmon benedict. And timing of the gods couldn't have been better because right when she said this, I turned around and pointed to another patron ---she came in about 45 mins after us -- just got the exact dish I ordered. I pointed to the dish and said, \"My dish was not special. Oh look. There's the smoked salmon benedict that I ordered. That lady is already eating it and she came in 45 mins after us.\" I was floored. No apology. Nothing.As it turned out....our order was never put in and we'd already been patiently waiting for over an hour.The rest of the staff was really wonderful in trying to make up for the situation. They profusely apologized and even brought some free croissants. The chef even came out and apologized--not once--but twice! He even brought us out some homemade jam. We gladly accepted his sincere apology and forgave very quickly. I have to commend the chef and his staff (with the exception of that single server) for taking the time to make it up to us. In the end, it all worked out and I decided to give a review based 100% on the food, as opposed to the experience (which would have resulted in a 1 star review). I hope management seeks to contact me so that she/he may work with that single server that failed the business. That server needs to be better trained on problem solving and customer service."], ["Jennie W.", "Second time I wanted to make Merci work.  One server so service was none.  After sitting at the table  (which I had to seat myself) for ten minutes, I found the server in the back, placed my order.  Went back for coffee and water after another ten minutes.  Had to ask for a refill.  No Service!  Now the food!  I had Quiche Lorraine.  I will let the picture speak for itself.  Yes....that's the bacon in the Quiche.  Not cooked at all!Matter of time before their doors are CLOSED for good!"], ["Jessica H.", "I've been wanting to try this place for a while and before I officially made my move to NY I got to stop in for breakfast. Long story short, their breakfast food was great and the service was so-so. I love French food and all of their breakfast items were on point. I also loved the dessert items that they offered. All of their menu items seemed to be very authentic. I would've liked a chance to go there for lunch but unfortunately I was unable to before I left. I look forward to try it out again once I return to Scottsdale."], ["Mike G.", "Something has happened to this restaurant, which has ruined my total attitude toward this establishment. They have changed to a pay before you eat, no table service, no menu's at the tables. My friend and I went there yesterday and were totally disappointed, our food was cold, side of hashbrowns were overcooked and greasy. Had to ask for refund. Lost a customer. Kind of sad, was really hip at first."], ["matthew s.", "Great home made and hand made French food. Everything is amazing. Such a great find. The deserts are to die for, but the dinners are delicious. I've had most menu items at this point and haven't found anything that isn't fantastic."], ["Brad W.", "This croissant is very flaky, but in my long history of eating chocolate croissants this one cannot crack the top ten. The price is reasonable at about three bucks, but there was a clear lack of chocolate. It doesn't need to be like  a fudge sundae, but some more of the signature chocolate would have been n ice. A fairly regular, just fine, not great pastry."], ["Patherine C.", "Merci? Thank you? Well, actually no thank you and we'll be taking our money elsewhere moving forward. Here's why:We arrived at Merci around 1:00pm to enjoy some lunch. In arriving to the cute little French cafe, the decor is bright and lively. So far so good. So naturally we would have such high hopes for the meal and service. Service: Horrendous. It started off okay, the waitress mentioned all of the specials from mussels to ahi sandwich etc. I ordered mussels with fries as it sounds divine while the boyfriend ordered a prosciutto sandwich. It takes her a few minutes to run back and state that their mussels ran out. That's fine, it happens. I went ahead and ordered the other special, Ahi sandwich. Which the waitress disappeared to put my order in. After about 15 minutes of waiting for our food, a different waitress came back and first states \"don't hate us, but we don't have that either.\" At this point, it was ridiculous. Why would it take you so long to realize there wasn't enough to Tuna?? Secondly, why would you include that in your special when you spoke with us if you're OUT? The communication from the kitchen to the wait staff was obviously lacking. Disappointing. Meal: Finally our sandwiches arrived. We both were starving and hoping for the food to at least be better than the service. NOPE. We both opt out of the salad for the fries. First off, the fries were cold. Like it was fried this morning and they were even too lazy to reheat. The sandwiches were SAD! It's was like a reheated school lunch! Come on!! I thought this is a French cafe....what happened? Oh and while we try to eat our lackluster sandwiches, nothing from the waitress to see how we're doing. ZERO. NOT A PEEP. No care at all. They stood there chatting away. Overall, don't waste your time. We stopped here for pastries in the past and that was fairly good. But obviously the food and service sucked."], ["A A.", "Only been here for breakfast but let me tell you this place is amazing! If you looking for a big plate, greasy breakfast to help with your hangover this is not the place for you. If you looking for a lighter, healthier meal to give you energy to start your day then go here!They have a small, limited menu but don't let that turn you off. With a small menu they are able to perfect everything on it. I never left disappointed. The egg Benedict is one of the best that I ever tasted. I also love their breakfast sandwich. I want to try their dinner options."], ["Jon P.", "Was referred to this restaurant by a friend who raved about it.  We went in a few weeks ago on a Sunday and the place was just starting to fill up.  Wife loved the decor and it was quaint in a cool french cafe kind of way.  Had the egg sandwich on a croissant. Was absolutely delicious.  Served with a small size salad and some hash browns, it was a lot more food than I was expecting.  Wipe had the eggs Benedict, and they were good as well served with the same salad and hash browns.Croissants were amazing.  Only tried the butter,  but they had chocolate and another flavor or two which I can't recall right now. Word to the wise: get there early to get croissants as when we were there,  they sold out.  Also, it looks like it pays to know the owner and be a regular. Witnessed a customer come in, order croissants to go, followed by a regular who knew the owner and ordered those same croissants.  Since there was only a limited amount,  the person who had ordered to go and had already paid was denied half his order and the reasoning was someone had \"reserved\" the croissants before.  Sounds a little shady to me.Service could have been a bit quicker as we sat there for a good 5 minutes waiting to be served,  and then another 15 minutes waiting for our dishes to be cleared and for the bill. Will be back!"], ["Michelle M.", "I don't even know what makes the food so good here, but even the simple items are amazing. My husband and I had dinner and brunch here and both of us are continually blown away by the rich flavors of our dishes. The ice cream for dessert and again, the flavors! It isn't just chocolate, but a rich chocolate with cinnamon and a bergamot ice cream.  Just amazing. I highly recommend this place for any meal, I've never been disappointed!"], ["Lexy K.", "We received a gift certificate as a wedding present, and we are so thankful we did. The food was simply amazing. The chef, Duc, is from France, & his French cooking is wonderful. Everything from the French onion soup, our steak & lamb entrees, and our dessert of merengue & macaroons were totally delicious. Plus, it's BYOB, so we enjoyed our favorite wine with dinner. We cannot wait to return & try their breakfast menu!"], ["Jacob E. G.", "This is a very nice cafe. The atmosphere really sets to this French setting and makes in style. Chandeliers, a big sign and very nice pictures around the place. The employees really do take care of the customers. Always trying to help out and are very kind. Beef with carrots and it was very delicious. For dessert had the salted caramel ice cream which was fantastic. The coffee was great. I loved everything that was going on in this cafe. Well done!"], ["N C.", "I absolutely loved this place. I fell in love with it--everything about it. Turkey club open face and the side salad is what I got, absolutely delicious. The service was amazing and the decorations were so cute. I posted pictures all over my social media, I fell inlove."], ["David H.", "If you've been to France, then you have a higher standard for what French food should taste like.  This place and only one other place in the Valley fits the bill.  Spot on execution!!!  Yum and bon appetit!"], ["Purity L.", "The perfect little French cafe; the ambiance is great, charming and small with eclectic decor to tie in the cute quirkiness of the restaurant. Don't get turned off by the older strip mall its in, its worth the stop.I am fortunate enough to live about 20 steps away from this restaurant. So I try and make it down at least once a week.My favorite dishes include:Mussels con frites- Enough to feed a family- no exaggeration. Literally, I shared with my family, ate it as my main course, and boxed up the rest for another meal. The broth is fantastic; I personally prefer a baguette over the fries, but overall an excellent dish.The almond croissant- INCREDIBLE, they make only a set amount in the morning so you get 'em while they're hot or until they're sold out. Its flaky and light with the perfect amount of sweetness- they truly melt in your mouth. Quiche with Spinach and goat cheese- simplistic and savory, my only wish was that it was larger. The crust on it was killer- served with a salad with house dressing (homemade ranch)Eggs Florentine- One of my favorite benedicts of all time, perfectly sized potions that won't leave you hungry or regretting your last few bites.French Toast - this was good, but definitely sweet- Its a bruleed version so it has a nice crust to it.Give this place a try, you won't regret. Perfect for a Sunday morning brunch!"], ["Ari A.", "Great small restaurant with an intimate setting. Everything is made to order and delicious"], ["Christina T.", "A bit of french heaven in the middle of the desert. We have been twice and both times food was delicious! The comments below on how service can be a bit slow makes me laugh - slow down, enjoy your food. It is typical in France for people to sit at a table for over 2 hours. We had a great experience however with the wait staff. The chef came out personally both times to greet us and ask about our orders. I am addicted to their crab cake burger, and I really want to try the boeuf bourguignon. The amount of food we received with our orders (most of us had sandwichs/ burgers and they were served with fries and a side salad) was very plentiful and I was unable to finish each time. They also have mussels and fries fresh in every Thursday - but he only orders a few so call in if you want to reserve an order! The deserts are all delicious and takes me right back to a real french boulangerie. I love that this little gem, it offers a tranquil ambience that you will not find in other typical restaurants. Great find on our part and so happy it is in our neighborhood!"], ["Byron T.", "Stopped by this nice little neighborhood cafe for Mother's Day Brunch.  Comfortable atmosphere, very authentic, and the food and service were AMAZING!  I've been to France and this cafe makes me feel like I'm there again. The Croissants are flaky, light and delicious, the omlettes and Eggs Benedict were great, and the breakfast sandwich combined their fresh omlettes with a delicious croissant for a breakfast you can't miss.  They use farm fresh ingredients (cage free eggs, organic produce) and focus on quality at very reasonable prices. Also, try their Chai tea latte and expresso, both very good as well!"], ["Stefani F.", "YUM! I got the eggs florentine, boyfriend got the smoked salmon Benedict and friend got breakfast sandwich. All delicious and beautifully presented. Only downfall was wait time... Felt like it should've been quicker.. But worth the wait overall."], ["Lindsay M.", "I'm so happy Merci (formerly known as Scratch) is back in business. The service is better than ever and the menu has been slightly revamped. Great for a croissant and espresso or a full meal. The open-faced Brie sandwich is like heaven on French bread. Don't forget a macaroon for the road!"], ["Lindsey S.", "Four stars for taste of food.Three stars for service and not selling the items listed on the menu.Three stars for price of certain menu items.The food here is great and reasonably priced for the quality; however, the beverages, specifically coffee (espresso, cappuccino, latte, etc...) are very pricey.  My boyfriend ordered a hot chocolate which was almost $5.00 my coffee was about $4.00.  The hot chocolate was good, my cappuccino mediocre, not worth $4.00.  I feel like I could have had a happy hour glass of wine for that price.  We wanted a QUICK snack after shopping at Fry's in the same plaza, and I wanted to sample their homemade ice creams, which were delicious.  I will return to purchase a pint or a gallon of the lavender-blueberry -- I highly recommend.I dislike the fact that the last two times I've been here they are not serving crepes.  Crepes have been a menu item for months and have not been available.  Clearly the French know crepes best, so why are they not selling them and why are they still on the menu if they are not selling them?  Please take them off your menu, Merci!!!I stop to eat here on occasion looking for a little something special and low-key in Scottsdale.  This place is quaint and classy, just disappointed about the crepes situation.One other comment:  The service is very slow too.  I don't know if this is intended since a lot of European's eat later in the evenings and spend several hours at the dinner table, but if you're looking for a quick bite, THIS IS NOT THE PLACE TO GO!  We were there almost and hour this evening and ordered a cappuccino, hot chocolate and their ice cream sampler.  Most of that time was spent waiting on the waitress and waiting on the items to be prepared.I will return when I have more time to kill.  Bring your iPad or laptop while you are waiting, they have WiFi."], ["Mimi C.", "Review is only for the baked goods in take out. Service was pleasant, choco croissant was good , macarons were great, price is lil over $3 but size is big.       Rum cake tasted dry and like the fridge :(  maybe it was old?  Opera cake was pretty good but had different flavor than most French opera cake .   Very cute place , it's hidden too . Will come back for their food and give review after that again but for take out pastries and cakes ( which I don't mind spending 5-8$ per French cakes as I love them) I got 2 cakes, 2 macaron , and 2 croissant plus tip was 28$, which isn't bad but would have expected a little more freshness in $5 cakes.       Still love that we have little French bakery here in scottsdale .    Maybe it was a bad day today .Ohhh main thing, little sad that merci logo on cakes weren't edible (~_~) I like it when they make it chocolate lol I almost ate the paper haha"], ["Paige S.", "WOW! That's all I have to say about Merci. Never have I been to a place where absolutely everything is homemade! From the bread that your sandwiches are on, to the yogurt that's is in your yogurt/fruit cups. I simply cannot get over how cute / cozy this place is. The chef Duc is bringing Paris to the valley!!!! Believe me, 5 stars just isn't sufficient! And how about the service! Spot on ladies!!!"], ["Annie P.", "Wow... All I can say is wow. I got the French toast and have never had anything like it before. It completely melts in your mouth and the banana flavor is superb. Great service and the chef even walked the floor and made sure to speak with everyone personally. It really made the experience feel personal and authentic. Will definitely come back!"], ["Candace B.", "This is a gem! I love this place it is a quaint and cozy place the wait staff is always friendly and they know the menu, always describe the items so well my favorites are the Eggs Benedict, escargot and the last time I was there the server recommended the Quiche. It was fantastic! I have also purchased their baked goods wow what an assortment of goodies! Always fresh and delicious. They also have gift cards I have gotten a few and gave as gifts now my friends love this place too! Oh and the prices are very reasonable for an authentic French meal. I will be back real soon!"], ["Nasha W.", "I guess I must've had high expectations  of fruit  tarts and lots of yummy french food. My experience was nothing remarkable  but just pretty average for the most part. I was surprised that for a patisserie  there was not a big variety of desserts or pastries. Regardlesd, the best part of this little place is the customer  service. Our waitress  was just wonderful and so attentive to everything. I ordered the quiche Lorraine  but I was not too impressed  by it and the eggs were a bit runny in it. It came with a little side of spring mix  salad and some hash browns. The side of hash brown was nice and crunchy but maybe too crunchy and greasy for my taste. Everything  was meh but their customer service makes up for it, those ladies are fantastic."], ["Tony M.", "Went in for brunch. When you walk in you are ignored. The servers are unemotional and don't acknowledge that you are even there. Needs new management."], ["Al W.", "A friend introduced me to Merci. I had their croissants at his office. It was the real deal. Based on that alone I booked our Belgian club's holiday dinner there. Noel, the owner's wife was incredibly helpful in setting up the dinner for the group of about 23. The group had high praise for the food, and the desserts were especially amazing. The restaurant is charming and decorated much like the old patisseries in Europe. The chef has an eye for presentation that is reflected in how the food and desserts are presented. The staff was super friendly and allowed us to finish up our gathering post closing time. Merci is conveniently located in Old Town Scottsdale with ample free parking. and although in a dated strip mall, once inside you are transported to a charming cafe straight out of Paris."], ["Sarah B.", "This has quickly become one of my favorite breakfast spots! A small restaurant in an unsuspecting shopping mall, Merci has made a great name for themselves. The staff always has a smile on their face, and genuinely seem like they have a passion for what they do. That passion is translated into a menu that is unique and delicious. My go to, the eggs royale, is one of the best eggs Benedict I've had. Only thing is they could add a little more of the sauce that comes on top. Also, the salad that comes on the plate is super yummy, but I wish it came on a separate plate. Too much going on in one space! But all in all I love this place, it is definitely worth a try."], ["Brian R.", "Came here on a Saturday for breakfast and the wait was about 15 minutes so we went elsewhere. The hostess was very courteous about it and we returned on Sunday morning for breakfast...what a hidden gem in Scottsdale! The food was excellent and the staff was very knowledgeable in their recommendations for breakfast. I personally had the French toast and it was some of the best I've had. Fresh bread and it was presented very well on the plate.The ambiance of Merci is just like a small Parisian Caffè and the patio is excellent with the choice of music.I strongly recommend visiting if you are in the area. I will be back for lunch and dinner for sure!"], ["Joe L.", "This is a cute little place in the space that used to be a bakery.  I came in for lunch because of the excellent reviews on yelp.That a special board outside and most of the specials average between $15-$18. I thought that was a little pricey for lunch but went on in. There were a few people there (not crowded, not empty).  I was seated right away and offered the choice of ice tea or lemonade. They had green or black ice tea of which I got the black.I looked over the menu and settled on the black truffle burger for $14.  The burger was small, but served with fries and a side salad. The burger was kind of bland and the mushrooms didn't taste like truffle or truffle oil.  The bun was interesting, but the bottom was soggy.  The truffled fries didn't taste of truffle at all. The small salad of greens and tomatoes was good. Unfortunately nothing about my burger with black truffles or my truffle fries tasted like truffle.My bill was over $18 with tax and over $22 with tip.  My food was not bad and the service was good, but lunch failed on a price-performance basis.I doubt I will be back."], ["Matthew S.", "Very quaint and cute.  Great place to get brunch on a Sunday.  The food was amazing, the pumpkin pancakes were the best pancakes I've ever had, seriously."], ["Kevin A.", "Cannot say enough good things about Merci. Duc the owner and master chef is the creative mind behind every meal served and his love of food comes across in every bite! All of their beef comes from grass - fed, antibiotic free growers and from local farms whenever possible, as a health and humanitarian conscious diner it is such a relief to find a restaraunt where the chef cares about the quality of the dining experience as much as we do. Great atmosphere, friendly staff,  do yourself a favor and stop by Merci today!"]], "Voila French Bistro and Wine Bar": [["Hyman S.", "We are fortunate to live just a couple moments away, but now that I have experienced it I would gladly drive across town for the food. My wife and I stopped in on a Saturday afternoon for a glass of wine and we hoped some small bites of appetizers. The kitchen hadn't opened yet but we decided to enjoy our wine at the bar and learn about the place. After a few moments, there are some wonderful olives that the chef brought out to us.  We asked for some bread and then the owner sat at a chair and we had a wonderful hour. We made reservations to come back on Monday night for dinner.  We are so glad that we did.  The salad was superb.  My wife got the mussels in an excellent wine sauce. The garlic butter for the bread was just as appealing as it had been on Saturday.  I ordered Steak Poivre, one of my favorites and truly one of the tenderest and most flavorful steaks I have eaten.  My wife had the rack of lamb.  Charred perfectly, tender and the bite she was willing to share with me was incredible.  I agree with one of the earlier reviewers, you may be lucky to get a reservation in this place in three months.  Go now."], ["Marci S.", "Love the food.  Great to have an authentic French restaurant nearby.  The ambiance is relaxed and feels like a French bistro.  As to the service, it is typically French, meant to be leisure.  We've eaten there several times and enjoyed every one of our meals.  My husband loved the mussels, I am partial to their escargot.  The duck and coq-au-vin are excellent and to be recommended.  We're going again this evening and intend to order dishes we haven't tried before."]], "Zinc Bistro": [["Brian N.", "I. loved. this. place.my favorite spot I tried while in AZ this week. it was so good I was longing for my favorite Uptown girl to be there dining with me.i started off with a cocktail called rye direction. that was definitely a step in the...I had the Scottish salmon with onion ravioli. every last bite had more flavor than Public Enemy. I was blown away and damn near licked the plate clean. and then to follow it up with the bread pudding - which is such an understatement, because it is so, so much more. I forget how it is referred to in French; please accept my apologies.my colleague ordered the chocolate soufflé that was oooooowee goodie good. (I finish off all of her desserts after she has a couple bites.)this would be a great date spot. I would definitely come here again if ever in the area.*rubs magic lamp*"], ["Andrew K.", "The food was very impressive. My table got a dozen oysters (Price Edward Island) and the presentation was done to perfection and the flavor was great. I got the French Onion Soup and the Pate and it was as good as I have had. We were seated on the outside patio and the weather was in the low 90's and it was really nice. The people watching is great because it is part of the outdoor mall... Kierland Commons."], ["Paul N.", "This may be the best kept secret in North Scottsdale.  It's petite location and dining area is easy to miss.  Located within a outdoor mall, it's easy to drive this place and never visit.  I finally gave it a try, after meeting one of it's chefs at a Baseball game.   Boy, I'm glad that I did. The food was amazing, and for not having a children's menu, the waitstaff was uber attentive to my children's wants.  Everything we ordered was fantastic.  One of my kids ordered the Mussels.  I tried one.  The mussels were divine, and the broth flavorful.  The grilled shrimp were of hearty size, and the side of mac and cheese was awesome.  My other child ordered the pork-chop, and I'm not a pork guy, but my wife said is was the best she ever tasted.Many dishes you'll find elsewhere, but the play with unusual ingredients really works.  I ordered a wedge salad to start, and thought that the added toppings would take away from the overall wedge experience.  But I was wrong.  The toppings really worked and it was the best wedge salad that I've ever had. The filet topped with foie gras was simply to die for.  My wife said that her chicken dish was great.  Frankie, our server, was simply the best, and I would recommend that you ask for him.  He knew the menu well, and knew what our children would enjoy.  Thanks, Frankie, if you read this.The overall experience was a 10 out of 10.  We will be back.A special thanks to Chef Martin.   Had I not run into him at that baseball game, I wouldn't have known about this little gem of a restaurant.  Highly recommend."], ["Diana B.", "Lovely!!! Great little French spot! i enjoyed all the appetizers and sat outside. great service. the"], ["Abby S.", "The truffle fries are delish. I also ate the flank steak salad. It was fresh and tender. We sat on the back patio and it was adorable. This was a great little lunch bistro."], ["Nancy S.", "Love this bistro because of the food.  It seems quite authentic, too - sort of like being in France except the service is faster than it would be in France.  My favorite item is the duck confit sandwich - it is not always on the menu.  You can also get a great glass of wine here.  I've eaten at the bar and that's a fun experience - you can talk to other customers and the bartender.  It's a friendly place with nice customers.When I want to treat myself, I come here."], ["Georgie M.", "Over the seven years since we've been coming to Zinc Bistro, we have never had anything less than a Five Star experienceWhether it's lunch, dinner, drinks, or just a quiet Valentine's Day night out, it's always been great.  Beef, seafood or chicken, it doesn't matter because everything is delicious. Zinc is modeled after a Paris bistro. The prices are inline and appropriate, with such a wonderful fine dinning experience.  So sit back and enjoy, because you are in for a treat.We made reservations for Valentines's Day for about five-thirty.  The bar area was packed and all the tables along the window were full.  There was a small line outside, but we were seated immediately.  Our server Frankie introduced himself and we knew the night would be special.  He was from North Bergen, NJ and to say he was character, would be an understatement.  He was warm and funny, occasionally touching shoulders while making a point.  He seemed to know instinctively what we wanted. We would come back just for him.  Amazing! We started off with a glass of New Zealand Pinot and a glass of French...and finished sharing a petite Chocolate Grand Marnier Soufflé and some decaf expresso. Wonderful meal, wonderful Valentine's Day night out. Expect to pay $55 to $85 each, depending on how many courses you try or bottles/ glasses you drink. Enjoy!"], ["Yuko H.", "I've been here so many times and I didn't realize until yesterday when I was uploading pictures.Ever since I had my oysters here six or seven years ago, I fell in love with this place and dine here several times a year.First thing I always order is a bottle of pink lemonade. Lorina Sparkling Pink Lemonade is well made sparkling drink nicely complement my meals whatever i might have that day.I like their oysters, and other seafood appetizers. Everything I had has been very good.  I also like to order cheese trays.  They normally have about 10 different cheeses to choose from and I like to try different cheese, and eat with olives, nuts, apples, and some bread.For main course, I tried everything on the menu... Omelette is always good, they do cook with my favorite gruyere, of course it has to be good. Another my favorite is risotto. When I can't think of anything else, I order this risotto.  Sauce they serve is very tasty.  They rotate some menu from time to time and yesterday, I tried their salmon, and was very pleased with my choice.For desert, if you want to order their signature chocolate souffle, order 15 mins before you finish your meal as it takes time for them to cook.  Whatever you order from the desert menu, don't forget to order French press coffee. It sure complements the sweets.Service and ambiance is always good. I like they way they decorate the inside with many books. Server and other staff are very attentive and they know how to take care of the guests.Always happy after my visit here."], ["Anthony N.", "Just brought some friends from out of town (NY) and their only request was to sit outside to enjoy the weather before going back to the snow. Told the 1st host we had 7 people but forgot to mention \"outside\" but she had left to check out the table already so we followed up with the 2nd host (Asian girl) and asked if we could be sat outside and she said \"We'll see what we can do\". Ok. 1st host comes back and our table is ready and 2nd host (Asian girl) who we've been with the whole time walks us back to the table inside which prompts me to ask \"So I take it this means we can't get a table outside?\" To which she says \"No\". She didn't even try! We were with her the entire time! I look out on the patio to find that there was indeed plenty of seating so I just asked the busser who was about to set down our drinks if we could sit outside and he took the initiative to go find if we could. Sure enough, it was no problem and 1st host made it happen (who was never informed of it in the first place). So long story short, thank you to the busser and host #1 but Zinc Bistro, please tell Asian host lady that ignoring and blatantly lying about patron requests is no way to treat frequent diners. All that said, after many times here, this was the first time we've ever experienced anything close to poor service. The rest of the meal with our friends was great. Don't let lazy Asian host lady ruin your rep.I'm keeping a high rating because the food is great and the service is TYPICALLY good. It wouldn't be fair to let one lazy person ruin the overall experience."], ["Erin H.", "Bloody. Hell. Total #mindblowing eatery, here. For realz, yo.Great location, nestled at Kierland in N. Scottsdale. Decor and ambience breathed quaint (but not pretentious or stiff) cafe in rural town somewhere in France.Two, yes two, patios that patrons may dine. There's a pation to the left of the front entrance that is pretty practical and allows ample ppl watching, or there's an \"atrium\" like patio that's to the left of the inside dining area which looked amazing. Lush greens and shaded area. *swoon*Tried the 3 cheese sampler plate (a Blue Cheese, an uber creamy Brie-type, and another hard Havarti like one). Cheeses were paired w/variety of breads (rye, wheat, etc), along w/walnuts, fruit spread, and warm (yes, warm) green olives. NOTE - this is a bit naughty... I thought I was gonna jizz in my pants, it was so good. Yes, I went there. I had the mac-n-cheese and it was an epic moment. The shizz was served piping hot w/ham slices and homemade cheese chunks.Service was attentive and helpful. OMG, Zinc, you are so it for me. I'll be back soon.-"], ["Sara M.", "Fantastic meal, great service and very relaxing despite the uppity area and restaurant type.The grilled chicken Caesar is perfect and recently I enjoyed the tomato bisque paired with a crostini LOADED with crap tossed in a light vinaigrette that was seriously OUT OF THIS WORLD!!!We'll be back for sure!"], ["ViVi S.", "If I had to get lost in a corner spot, this is it. I have a thing for the French and Zinc Bistro makes my top 3 places here in Scottsdale. Whether it's lounging on the terrace with my girlfriends or determining the compatibility of flirtations, you'll find me happily sipping on wine and soaking up sunshine. Otherwise, plant yourself in the darken room or back terrace for mysterious adventure.I don't think their menu items have escaped my insatiable appetite. My favorites are the beignets, pork belly, and truffle fries for starters. Trust me, you will perk up instantly with these. I never pass up the mussels because they know how to seduce me with the leeks, rosemary and garlic fries. I will almost loose my ladylike composure and pick up the hot pot to drink up the sauce. It's that frickin fantastic. My fave dinner item is the duck breast. Fatty goodness with black truffle. How does one go wrong with that? Your wallet might cringe but then I guess that depends on how you value self investment. I'm all about the return and this place is a sure thing for me. Service is always attentive and friendly with top notch quality food. Bartenders are fun and lively so you are never short of conversation or company. Seriously, you instantly become a Parisian dining here."], ["Ron D.", "Been here many times and food is always excellent. Prices have skyrocketed on some menu items. Example... Flat iron steak. Their web menu shows $28 but we were charged $34. That's a lot for flat iron steak, I don't care how good it is. And what's with the Mexican music in a French Bistro? I enjoy Mexican music but not in a French Bistro.Service was excellent until our serve disappeared for a while (must have been break time).I have always given Zinc 5 stars but this experience was far from worthy of 5 stars. The only reason I gave 3 is the food was very good. Don't miss the chocolate soufflé."], ["Scott S.", "Pass this one by. Not worth it.$14 for French Onion Soup! Sean, the bartender, only pays attention to people he knows, don't expect much service at the bar. $10 for a small draft. Guess their rent is high, so they have to over price everything!"], ["Holly M.", "I really am a fan of this place. In a city full of restaurants and relatively high turnover, Zinc has proven its staying power. It can get crazy around lunch time (and the evening for that matter) but if you don't mind getting there soon after they open at 11 you won't need a reservation. I've never had anything bad there but I can definitely recommend the grilled basil chicken sandwich. This thing is heaven on earth. Their burgers are also good with a really thick patty of beef and the tuna salad sandwich actually comes out as four miniature open-face sandwiches. Points for presentation and taste. Get an order of fries for the table. They are definitely worth the splurge. If you have time to hang out, grab a stool at the big center table. Order some charcuterie and fromage, accompany it with some wine and enjoy the people watching."], ["Linh F.", "We were staying at the Westin Kierland next door and came to the Commons to get our grub on.  We decided to go with Zinc Bistro because we saw some beignets on their menu!  What we ordered: - Grilled Curry Chicken Salad Sandwich - Dungeness Crab Salad - Crab, lime, pickle, iceberg lettuce, tomato- Basil Grilled Chicken, Arugula, Mushroom Sandwich- Truffle Fries- BeignetsFood:  Everything we ordered was delicious.  Our one comment is that the basil chicken mushroom sandwich... had one or two mushrooms.  We were a little disappointed.  The beignet weren't really beignets.  They were like mini donuts.  Still good.  We were just expecting something a little different. Service:  Very nice.  Water service was good as well. Ambience:  Casual.  Outdoor seating is the way to go if it is nice and sunny outside. Overall:  Great lunch spot.  I would recommend it if you are looking for a good sandwich at a decent price."], ["Jen S.", "Get the mussels. Really, be sure you get the mussels. Oh, and I dare you not to pick up the bowl and drink the white wine/butter/garlic broth. Amazing.I recently had a great business dinner here. Everyone was happy. I enjoyed their flat iron steak, which was recommended by our waiter. My guests had the filet mignon and the scallops. All of this, plus some great wine ... it was a good night out!If the weather is nice, sit on the back patio. It's gorgeous and will make that Bistro name come to life!"], ["Beth B.", "Love this place!  Bar is cool!  Great chocolate soufflé! Wonderful ambiance.  The soufflé is huge so nice to share with someone. The sauce You can add orange grand marnier .  The sparkling Eiffel Tower so beautiful and elegant.   Wine and Chocolate, doesn't get much better."], ["Crystal P.", "the truffle fries are amazing, the pink lemonade too, the service, just everything. this place was so great we came here twice on our trip! once just the two of us, then again when my mom finally came in. I also loved the dipping sauces."], ["Steve M.", "Incredible meal, service and atmosphere!!!Our server Frankie was outstanding....his recommendations were perfect for every course and his warm personality was wonderful.My scallops were a highlight and my wife said the French onion soup was the best she has ever had.  We finished w/ the beignets....better than Cafe Du Monde and paired w/ 3 incredible dipping sauces."], ["Donna K.", "This place was better than expected. It is small but nicely done. The prices are not too high, and I could see myself coming back to sit at their tables outside.This inside is dark and very bar like, yet hip & comfortable enough. The outside patio is nice, lush and well done, but both areas are very small. We had to play musical plates, glasses (well everything that was on the table) as we were being served our main course. There is just not enough room on the tables and they have gigantic plates - not much thought put into that one.But in general it was nice, the food was good (not great) and the prices were not too crazy - although paying $10 for a \"large\" avian water is totally ridiculous!If you go, sit on the patio. It is a pleasant experience. They have mirrors, plants, misters/heaters and candles everywhere - really nicely done and has a romantic ambiance."], ["Chris B.", "Very happy with our dinner. Food was delicious and the service was superb. Loved the atmosphere. It was a memorable meal. Thank you."], ["Karen C.", "This was a treat. I had the mussels as recommended by another reviewer. I didn't even think I liked mussels but the sauce was incredible. Followed by the Dungeness crab crepes and finished with a green salad. Service was lovely. I was so happy to find this gem amongst the expected high end chain restaurants found in every city. I will definitely be back if I visit Phoenix again."], ["George C.", "On so many levels, this is THE place to go when in the neighborhood.Why?  Because it is always sincerely friendly, has a great French atmosphere, has wonderful food, and a really good bar.Then add to that they can make excellent espresso drinks to go with their superb deserts.  (I find that very few places can make espresso to rival that found in Europe)The street-side patio is also well designed and comfortable.Another comment seems appropriate here.My wife and I have been regulars at Zinc Bistro for about four years.  Yes, we did have one incredibly clueless waitress one time out of all the times we have dined there.  But we also have had occasion to observe some of the best customer service in town, as was the case when we met our son's family of four there for dinner, but arrived 40 minutes late due to a freeway accident.  I apologized profusely upon arrival. But they said everything was OK, and that our grandchildren had been given Shirley Temples, and that my usual Saphire martini was just taken to our table (prompted by my son).Of all the very good restaurants in Scottsdale, I put Zinc Bistro up there with the very best.  What are the other best places in town?  Please see my other reviews."], ["Nancy D.", "Dropped in late after a disappointing stop at another restaurant and we were pleasantly welcomed by Jesse the bartender and although it was late and the kitchen was closed he managed to get us a cheese and meat board .  He created a drink based on our tastes- nailed it and had a genuineness that is refreshing.  We were fortunate to have walked by and discovered this gem.  Can't wait to comeback."], ["Salil G.", "Now this place has a great menu! Came for lunch and was very happy with the food. Sat at the bar and had a nice beer and sandwich. Food was seasoned well, prepared with care and tasted dang good. It's not somewhere most people will want to go for lunch every day. It'll probably cost you around 20 bucks and that's a bit much for most. I do think that their food is worth the money. Fries were great and so was my salad. Bartender was nice and the place was full in the middle of the day with a pleasant afternoon crowd. It's a fun place."], ["Marcy L.", "If you haven't caught on yet, get the mussels! I was very hesitant at first because all I had heard about mussels were that they were generally slimy and hard to swallow. Not here! They were AMAZING! The broth that they are in is easily THE best broth I have ever had! I ate at least two of their bowls of bread dipped in the broth alone! Absolutely delicious."], ["Mossie L.", "My favorite restaurant in Scottsdale for a few years now. Charming French atmosphere makes it an intimate dinner setting! Really interesting mix of ingredients that you won't find anywhere else. A must-have: the truffle fries. They come w/ 3 different sauces, all to die for. The prices make it more of a special occasion spot for me, but I would highly recommend Zinc Bistro. Well worth the cost. The wait staff is superb, and they are attentive even when the restaurant is packed."], ["Jacqueline S.", "Loved the crab and truffle omelette. Was a little bad and got the truffle and Parmesan frites which were amazing. They come with three sauces and those were a great addition. Definitely will go again"], ["Gary H.", "Love this place. I've been going to Zinc for several years and look forward to going for years to come. It's dark?  Well yeah, that's the point! Those who are uncomfortable in the \"beautiful people\" world of North Scottsdale will not be happy. BTW they have someone the best bartenders in town. Go on a Friday afternoon/evening, sit at the corner of the bar and have fun."], ["Takuya K.", "A week old review but nonetheless we must give Zinc their props for A+ quality ingredients in traditional recipes and mostly an extra half a star for keeping my mobile that I left at the dinner table and realized was misplaced over an hour after my departure...Oops, kudos to the front of the house and we'll be back for a late nite snack of truffle fries for sure! Hubby enjoyed his protein & foie combo, however the Madeira sauce was a bit too prevalent in the dish for me, but I was quite content with my own selection. The broth was divine and quality of mussels sourced from the great Washington coast added points to the dish for nostalgia (having called the Puget Sound area home for some years.)Reservations are a must for weekends and be prepared for intimate seating as I've enjoyed in many a Parisien bistros. I miss the selection along the rue Saint Martin but if I can't have Alain Ducasse in AZ, I'll continue to be a beggar and not a chooser!"], ["Edison O.", "You gotta give credit to those who deserves it and Zinc Bistro definitely deserves all the 5 stars. If I could, I would even rate them higher.My AZ restaurant week adventure took me and my wife to our second upscale restaurant in 3 days. Our taste buds took us to Zinc Bistro on a rainy Saturday night.From the outside, the bistro looked very ordinary. A simple restaurant sign, glass and wooden door, and some patio seating for the romantics. Nothing intimidating and nothing too fancy.Inside the bistro, it was different. You are immediately transported from AZ to NY. The place turns from ordinary to exciting. The vibe becomes alive. Unlike other upscale restaurants, this one is upscale but not a stuck-up. In fact, this one is quite inviting. I felt like I can laugh around my friends while enjoying my wine and enjoy some stories while not rushing my meals.Ambience... CHECK!We were greeted at the door, then the receptionist led us to our corner table. The usual. Nothing extra ordinary. Soon as we settled at our table and our server (Dylan) greeted us and gave us the menu, from there on, the service was quick, efficient and VERY attentive. I can't even remember when and who filled our glasses with water. I usually measure service by how attentive the staff is, if your glass of water is always full and ice cold, that means someone is always looking after your table. At Zinc, my glass was never empty. For me, that says a lot about their service. Our server (Dylan) was also at the top of his game. He made sure we our enjoying our food and also made sure we enjoy our experience by offering the best that they have. You always feel comfortable when servers approach your table with a smile. Service was simply EXCEPTIONAL...Service... CHECK!Ever had a meal that made you nod your head every time you take a bite? As if telling yourself that you made the right choice and you did a good job choosing the right meal. That's Zinc bistro food for you. You know you made right choice on every bite. We ordered the Smoked Duck Terrine and Pastrami Cured Salmon Burrata. The smoke duck terrine filled my mouth with all the texture you would look for. It had both a crunch and velvety bite from the terrine and pistachio. Also gave the salty flavor from the duck while balancing it out with the apricot and vinaigrette. You also get the freshness from the carrot and arugula as you mix all the component in one bite. The pastrami cured salmon on a burrata did not fall short as well. There perfect balance of texture with the burrata and salmon while you get the freshness from the roast beet and butter leaf salad. The appetizers alone made me nod on every bite. The main course was just CRAZY GOOD! The flat iron steak was perfectly cooked. The crust from the outside complimented the tender and juicy medium rare center. Make sure though that every slice you take has some caramelized shallot or else it might be too salty for your taste. The caramelized shallots balances the flavor to the sweet, salty and partly tangy perfect bite. My wife had the confit lamb shank. The lamb was so tender and the meat falls off the bone easily. It was perfectly complimented by the Beluga lentils, medjool dates, roasted turnips and crushed almonds. Again, the texture and flavor was well balanced. We also loved the slight touch of the crema fresca that cut through the gaminess of the lamb. If you hate lamb, this meal might just change your mind.Lastly, the dessert. I alway want my dessert to be sweet but not overly sweet. I want it to make me feel like it satisfied my sweet tooth without making me like I ate a whole box of cake. We had the brown butter cookie w/ peanut butter nougat and salted caramel. It was a very sexy Snickers bar on a plate. When eaten w/ small bites of mint leaves, it takes the sexy snickers over the top. We also had the grilled pineapple tarte tatin w/ toasted tahini and cardamon ice cream. The cardamon ice cream cuts through the tanginess of the pineapple. Since the pineapple was grilled, the natural sweetness of the pineapple comes out. Oh and the chocolate soufflé ( their top dessert ) is a must have. How was it? It was so good that only tasting it on your own can explain the experience.Food... CHECK!Overall, it was a perfect experience. Which is worth the money you are shelling out. The food was awesome. The service was exceptional. The place was alive and inviting. Truly deserving of a 5 star.more reviews at themealexperience.blogsp…"], ["Jaclyn M.", "Wow. Just happened by this place with my friends. We were seated quickly right in the middle by a cool lit up eifel tower. Loved the ambiance and the food was AMAZING!!! A little pricey with small portions but so elegantly prepared. We waited a little longer than usual between appetizers, main course, and dessert, but it was worth it, and it was also a busy Saturday night. Everyone was friendly, the food was to die for, and the decor and atmosphere was so very nice."], ["MariaElena H.", "I thoroughly enjoyed my Scottish salmon and oysters; however, I felt really bad for my hubby. He had the ravioli, and it was not cooked long enough. My hubby was so hungry he ate it, which I felt bad. The ravioli was chewy. We came for our 5th wedding anniversary, and expected decent food. I'm appreciative for my food, but wish the money spent was well worth all the food."], ["S F.", "This was my second visit to Zinc and it was wonderful!  The service was great and my only complaint is that the seating is not very comfortable (too close to the neighboring tables and the chairs are slightly awkward).....but I will overlook this discomfort for great food and service!"], ["Richard R.", "Just got done with lunch and service was horrible. Julienne my server was very inattentive. She came around to check on things hardly at all. When I finished she took my credit card and ran it and then slapped the check down on my table with a \"here you go\" remark and off she went. If Julienne worked for me she would have been FIRED!"], ["Anne M.", "This is a favorite spot for us in Scottsdale, both for an intimate dinner or a family meal (teens to my elderly mom.) I wouldn't bring small children here.  Service is excellent and the menu is dependably French. Love the cheese board and charcuterie: great way to start a meal with a crowd."], ["Susan D.", "We have been going to Zinc Bistro for years....went there April 23 and as always had a wonderful meal...HOWEVER...they have raised their price of a cheap cut of meat called Flat Iron Steak by $8 in just a few short weeks. Even the internet  menu (as of yesterday) still shows the price at $26.  AND...here we were in a French restaurant and they were playing Spanish music! What's with that?!?! That was a first. I have nothing against Spanish music when it's playing in a Mexican restaurant...NOT a French Bistro!! Very disappointed to say the least! I'm sure it will be awhile before we can bring ourselves to go back"], ["Marisa S.", "The only reason I come to this place is the little patio, I love sitting on the patio while grabbing a bite with a friend.  I think the menu needs updating.  It feels a little dated.  Last time I had the chicken salad sandwich, because nothing else seemed appetizing.  My friend had the same.  Kierland is one of my favorite malls and this spot can offer some good people watching."], ["Libbi J.", "OMG.This was amazing. I hardly remember what I ate in specifics (it was the day we made a transatlantic move) but my mouth is salivating just thinking about my return when we visit for a family wedding in the fall.It was a Thursday for lunch. The restaurant was rather quiet, the service a little slow and it was HOT outside. I had a glass of wine to sip and enjoy and my husband decided to go with the onion soup just because. It's a French bistro, you have to. It was by far the best onion soup we've tasted. And we went to Paris last year for our anniversary.Croquet monsieur was definitely the pick of the afternoon and amazing. The chocolate soufflé was to die for and all I want to do is take that restaurant and relocate it to my new city in England."]], "Cafe Paris French Bistro & Catering": [], "La Petite France": [["Jane S.", "I'm still dreaming of my spinach and mushroom omelette and fresh croissant. The service was friendly, and extra points from this Wisconsinite for using the term \"bubbler\" for the drinking fountain!"], ["Laura P.", "This was our first time here.  We ate brunch on the patio.  My husband ordered the ham and cheese crepe, and loved it.  I had the Quiche Lorraine, which was just as wonderful.  Both were served with a side salad.  For dessert, we ordered the belle-helene crepe (pear, honey, cinnamon, whipped creme) -fabulous!  The service was the best, very personable.  We are so glad we stumbled across La Petite France.  We will definitely be back (soon) and can't wait to explore more of the menu!  C'etait incroyable!"], ["Megan C.", "I chose La Petite France for a special brunch to celebrate completing a certification program with my family. The husband and wife team did an supreme job. While the wife was in the back cooking (amazingly delicious food, by the way), the husband was out with us. He is an extremely funny guy. He even sang and danced for us. I could tell they aren't used to having large groups come in, but we had the most relaxing brunch with lots of great laughs. There were never any dull moments and he handled a large group very well. Later, as our brunch was winding down, Samir, the husband, came out to the table to thank us for being such a great group for their Sunday morning. He gave the kids little key chains with the Eiffel Tower on them. All three children thought that was the greatest thing in the world. They really had personalized service. Without a doubt, I will be going back!"], ["Catherine I.", "This restaurant is a hidden gem of Scottsdale/Phoenix!   A must for anyone looking for great French food or just a charming atmosphere.The restaurant is located in the courtyard of the Seville Shopping Center.   It's located in the back, behind the parking lot. We had dinner on the patio where there is a lighted Eifel Tower. The Eifel Tower adds warmth and charm to the restaurant.  Makes you want to book your next trip to France.When we sat down we greeted by the owner of the restaurant who is very ingratiating and told us about their specials.  We started with the Escargot and the Brie served with salad.  The appetizers were fantastic! The main courses were exceptional as well.  We ordered the Boeuf Bourguignon, Veal liver and the Chicken roulade.  All the dishes were fantastic!  At the end of the meal we had the opportunity to meet the chef, who is from France!!!  How cool is that!He told us that he also makes all the desserts.We were so full at that point but since they were home made we order a few and loved everyone.You must visit this restaurant!"], ["Patrick H.", "Wow.  This place is really a find off the beaten path.  Family owned and lots of charm at a great price.I've been here three times for breakfast and can't wait to come back.  My favorites are the provencal omelette and the chocolate croissants."], ["Sarah S.", "Went here for after-dinner crepes and coffee the other night. I was thrilled to be greeted by such a friendly and hospitable host and owner-- Samir. He paid attention to all of the details and made sure we were very well taken care of. We ordered the Belle-Helene to split, which ended up being more than enough crepe. My fiance and I absolutely loved it. It had pears, cinnamon and honey. It was sweet, but not overpowering or heavy-- the perfect after-dinner dessert. My fiance, who's not the biggest fan of sweets, was blown away-- he absolutely loved it!My mocha was very good as well. I was so worried about this little restaurant when the previous owner left. I was delighted to see that it has been reinvigorated by these new owners. I will be back for breakfast soon-- La Petite France has the most amazing breakfast. I'd have to say this is my favorite restaurant in Scottsdale."], ["V Monique M.", "Always great food!!! It doesn't matter what meal, breakfast, lunch or dinner... Phenomenal crepes!! Wonderful atmosphere! The owners are very personable!! Love, love, love this place!! Great gem I wanna keep to myself!!"], ["John H.", "I haven't been all Gung-Ho on writing reviews recently but something just has to be said about La Petite France.  This nestled away little French spot off of Indian Bend and Scottsdale road (Northeast corner) is a spot you must stop in at.  I went today for Brunch and had a most enjoyable experience.  The Modest Brother-Sister (Server-Chef) combo was such a change-up from your usual cocky male chef situation happening all over town.  The food quality, taste, originality, and presentation was well above the price point....and the vibe you get from the staff is unique.  ***Chef Joanne even gave up some pastries for the road as a bonus. I will definitely be going back here."], ["Cynthia W.", "If there were a sixth star, La Petite France would have earned it!  Excellent food and excellent service!  This gem  is my very favorite dining spot since moving to Arizona three years ago.  My sister and I both had the Savoyarde crepe with crème fraîche, onions, potatoes,bacon, blue cheese, chives.  It was magnificent! Tender handmade crepe and the veggies were perfectly cooked.  French music and the impeccable attention to detail makes you feel like you are in Paris.  The owners are highly customer focused and their customers are pampered.  We had to try the desserts..I had the banana split crepe with vanilla ice cream, it was extraordinary!!  My sister had the bread pudding which she said was rich without being too sweet, a fabulous dessert that she would highly recommend.  There was no room for another morsel, but we were captivated by the outstanding array of beautiful macaroons and got a dozen to go!  Everything here is made by hand and is of the  highest quality, using fresh ingredients and is worth every penny!  The dining experience is casual and relaxing.  Can't wait to come back to sample the other wonderful offerings!"], ["Amy S.", "Fabulous!  Went for brunch for our first visit and were not disappointed.  Wonderful food and very reasonably priced, especially for Scottsdale.   Everyone in our party had omelettes which were light and delicious.  The homemade frites were fabulous and the croissants?!  Let's just say the chef de patisserie is a wizard to make them so magnifique using Phoenix's horrible water.  The crêpe Hélène for dessert was a hit with everyone, perfect match of pears, honey, cinnamon, and the slightest touch of whipped cream.  Didn't try any of the wines but the list looks fabulous - I'm a sommelier and they have some wonderful choices.  We will return!PS: The patio is lovely, facing north, and completely shaded.  Also, our 3 yr-old loved it but it is definitely upscale.  Save the large groups of children for chain restaurants."], ["Jen L.", "La Petite France is a homely, small french cafe with a nice outdoor patio. I started with the onion soup which was very different from any other onion soup I have had before. It was light and had a slight sour taste to it. I then had the special which was mussels and frites, both which were well seasoned with garlic and herbs. For dessert I had the creme brûlée which unfortunately the glaze was over torched and on the burnt side."], ["Aliya F.", "They offer GLUTEN FREE CREPES!!!!! Absolutely recommend this place. Just got back from Paris a couple months ago. This place is VERY authentic & fabulous. The crepes are incredibly good. Staff is very nice. Restaurant is very clean. It's more casual than formal, so I would recommend for breakfast or lunch more than a nice dinner. Very impressed."], ["Ron D.", "OK, back again... this time we had the Salmon Flammekeuche and our favorite house wine, the Heritages Cotes Du Rhone. Excellent!!!I really have a hard time with some of the negative comments about this place, especially about the service. We don't come here for the service, we come here for the food. It is wonderful and both times we have come here it has made us want to go back to France for another visit. We absolutely love this place. If you are concerned about fast service and expect the owners to understand your English perfectly don't bother coming here. If you have traveled France, enjoyed it and like French food you won't be disappointed. Yes, you may have to remind the waiter if you are missing something and yes, you may have to ask for your check (L'addition, s'il vous plait).We will return!"], ["Michael H.", "I went to La Petite France Saturday night with my family for the first time (party of 6). I am personally not a huge fan of French cuisine however my experience at La Petite France was nothing short of spectacular! The food was amazing, and the employees were all so warm and inviting. Several times throughout our meal the chef along with the manager and owners came out to check on us to make sure we all enjoyed our food and made sure we had everything. For an appetizer we all shared a bowl of oysters which were wonderful. I had one of their specials the Red Snapper for my entrée. It was perfectly cooked, flakey and flavorful. As for their deserts, they could not have been more perfect, everything was light and very decedent. I could not recommend La Petite France more highly as my family and I are going to become quite regular patrons to this establishment!"], ["Patricia R.", "I went today with a french friend that explained the place have new owners; we were 6 adults and 3 babies. They only have 2 high chairs and 1 booster, that was ok. The orders came in different time and mine was the last one, because apparently they got confuse, so I had to eat fast. I ordered a crepe with ham, cheese and tomatoes, it was very good though. At the end the waiter came to apologize, he was very kind and explained that they are still in a process of organize everything. I will come back."], ["Jeff B.", "IF YOU HAVE NOT BEEN HERE SINCE THE NEW OWNER AND CHEF TOOK OVER, TRY IT AGAIN, IT'S A COMPLETELY DIFFERENT PLACE!!  We ate here once 4-5 months ago and were just so-so on it:  the food was good, but the service was painfully slow.  Then maybe 2 months ago we did a double-date with some friends who wanted to try it, and by strange luck we showed up on the day the new owner took over.  BOOM!  It was so much better!  We have now been back at least a half dozen times.  We've done dinners, breakfasts, or sometimes just a quick stop for a coffee and crepe or croissant.  Every time we walk away amazed!"], ["John Eric P.", "My worries of the sometimes small French portion size was quickly unfounded when the food arrived. The food was excellent. The French onion soup was a super reduction and was even served with a small bowl of extra cheese and slice of bread on the side!  My daughter's Nutella, banana, and chocolate crepe was a dish of gluttony. My sons Hawaiian crepe was an interesting combo of turkey, Brie cheese and pineapple.  I was pleased to see that they didn't skimp on the amount of Brie.  The food was 5 stars, service was 4 stars due to some slowness."], ["Doug T.", "I go to France quite a bit and ironically, just arriving from Paris on Friday night, the wife suggested we go to La Petite France to try out their \"Arizona Restaurant Week\" menu.Having just dined out in Paris, I figured \"Well, what the heck\".The food that I had that evening at this restaurant was far and above better than the meals I've had at bistros throughout France.Excellent, rustic French cuisine -- the type that you can find in a small neighborhood where the French actually eat.   A job well done and now my \"Go To\" place for French food!If you like French cuisine, do yourself a favor and visit La Petite France.  What you get here is better than you will find in France."], ["Marc G.", "If I was blindfolded, seated and my blindfold was taken off, I would have sworn I was in France!  The decor and ambiance is very French.  I went in to meet someone for coffee and Croissant.  The croissant came fresh out of the oven, so delicate and the coffee was magnificent, perfect! The food that came by our table to other patrons looked and smelled deeeeeeelish as well! The owners and chef were all so gracious and service oriented and most of all, so passionate about what they do.  Their French accents added to the experience, so authentic...wonderful!!!  Truly a little part of France right here in Scottsdale!"], ["Jay L.", "You have to look for it but when you find it, La Petite France is a wonderful place to eat.  I was traveling alone for work when I found La Petite France in the middle of a retail center at Indian Bend/Scottsdale road.  At first I was going to order a Crepes, but then I saw Flammekueche on the menu!  I have never seen Flammekueche here the states and love having it when in France.  I ordered the Classical and loved it.  In addition, I saved room for a dessert crepe.  It was wonderful.The owner is very friendly and I hope I make it back to Scottsdale soon because I want to try a few other items on the menu."]], "La Madeline": [], "Delux": [], "Postino Central": [["Janet N.", "Love, love, love. There's no way good bread, cheese and wine could ever make me sad- maybe put a few pounds on me or a dent in my wallet, but hey- live a little!Their bruschetta is a must here which I typically share as well as the salads (which they're willing to split in the kitchen), good wine list- local even.For bruschetta you can't go wrong with smoked salmon with pesto, fig and marscapone, brie and apples, bacon and burrata.The fig and marscapone is to die for~For salads, I like the Hannah's field and the Raspberry Chicken. These are good choices if you're a fan of a tart or fruitier/sweeter type of salad.Wine wise, I go with anything as they all have been good though I do try to do wines from France or from states known for their wines. I've had the Boomtown from Washington which is a rich red, strong berry flavors like cherry and blackberry as well has a good kick of spice and acidic. Little James is a wine from France, easier to drink and more simple. It's peppery all the while having strong strawberry and vanilla hints to it.Service is great, refilled waters, lovely waiters/waitresses who know what to recommend. And the interior of Postino is dim, not too loud and comforting."], ["Victoria W.", "Only got to have one drink since my reservation next door was ready, but overall it was good. I liked our bartender but the hostess had an attitude and was very short towards us."], ["Mimi T.", "Food is amazing and excellent flavor combinations. Can be crowded in the evenings. And you need to be in the mood for bread."], ["Tina M.", "Hannah's Salad with a plate of bruschetta shared between two makes for more than enough food! This was my 1st time to try the kale salad and it was absolutely delicious! Who knew pickled onions and kale could be so good?! It was a wonderful combination of greens and fruit with a perfectly balanced dressing. Great service and I love all the Postino locations."], ["Andrew W.", "For my first meal in Arizona, I wanted to stop by a popular restaurant. Postino Central had great reviews and it did not disappoint. For a party of 2, I was stuffed after eating the bruschetta and a Mixed Green salad.Bruschetta ($14 for 4) ordered:- Brie and Apples with Fig Spread- Prosciutto with Figs and Mascarpone -- my favorite of the night- Tomato Jam and Fresh Sheeps Milk Cheese- Smoked Salmon with PestoPostino is a great restaurant for a casual dinner with friends or a date night. Service was outstanding. I just wish I was hungrier or was with a larger party so I could try everything on the menu."], ["Ray D.", "My fellow yelper's and I are in agreement. You won't be disappointed by partaking of the great eats, drinks and treats this establishment offers."], ["Jason V.", "Amazing food! Chicken & Mozzarella Panini was insane!!! Even when I was stuffed I had to keep eating! Artichoke and hummus app was so good I took leftovers home! Waitress was very nice. Saw I was torn on what bread to pick so she surprised me! I was to go back today and tomorrow just to try everything else! Open a store on the west side! In Litchfield park please!!!!"], ["My N.", "I REALLY DON'T KNOW what the hype is all about. I came here with my husband expecting good food, good service, and a clean restaurant. I'm very OCD when it comes to cleanliness of a restaurant. I always inspect my cups, plates, and forks before I ever use it at a restaurant.STRIKE 1- My husband's water cup had a very visible and distinct LIPSTICK stain on it. The outline of the person's lip was still there! We informed the waiter, he looked embarrassed, and gave us a 'new' cup.STRIKE 2- The 'new' cup the waiter gave us still had lipstick stains on it... but it was much smaller. We're not sure if he just wiped off the first one, or if many of the cups are this disgusting.STRIKE 3- My OWN cup had food debris on the inside portion where my lips would have been. I flicked it off with my nail and finger.. and was so disgusted. Both of us didn't drink a sip of water the whole time there.STRIKE 4- My plate had visible and distinct food debris on it. I wiped it off with the napkin... my husband gave me his plate to use. I had enough of this 'yucky-ness', so when my food came, I literally ate over my napkin.Now for the food, we ordered the Bruschetta and Nine Iron Panini. You get to choose 4 flavors for the Bruschetta. We tried Smoked Salmon with Pesto.... Burrata, Bacon, Arugula & Tomato... Salami with Pesto... and something else I don't remember. Visibly appealing. Too bad it doesn't taste as good as it looks. I'm not saying its nasty, it is just not 'all that.' The bread wasn't as crunchy as I thought it should be. The bread was more... chewy than anything else. My favorite out of the 4 we got was the Bacon one.The Nine Iron Panini was just okay. Thick bread, nice portion, but nothing I would get again.CONCLUSION- If they were more clean, I would maybe give them a 3 out of 5 tops. But seriously, who wants to eat that dirty? WILL NOT BE GOING BACK."], ["Ricky D.", "In the distant past, when the dinosaurs roamed the earth, I disliked bruschetta: it was a difficult-to-eat food, heavy on the bread carbs, with nothing but watery tomatoes on top. Postino's has enlightened me: their bruschetta is absolutely amazing! The ingredients are so fresh! It's delicious! It's easy to eat! But I'm getting ahead of myself...My mom and I came here, lured by the rave Yelp reviews, while on a road trip through Phoenix. My mom ordered a glass of cava, which she liked, and we started off with a plate of bruschetta (four flavors for $14). My favorite was the salmon, pesto, and capers - the pesto is fresh and exciting, and the whole combination makes for the perfect mix of savory flavors! My mom's favorite was the mascarpone, fig, and prosciutto, which was both sweet and a little bit savory. We also got the artichoke bruschetta (great depth of flavor- absolutely delicious!), and the traditional tomato-basil-mozzarella bruschetta (the tomatoes were fresh and to die for). Everything was amazing. Each bruschetta is cut into four pieces, so they're non-messy to eat and easy to trade. The ingredients were so fresh, and so capably combined! I absolutely loved everything. I almost wish I lived in Phoenix.After we had the bruschetta we realized we were hungrier than we thought, so we got the white bean and artichoke dip plate as well as a bowl of chicken dumpling soup. I got to have more of the artichoke dip, and the white bean dip was very good as well. What I loved even more than the bruschetta (I know, how is that possible!) was the atmosphere. We sat on the 'outside' part of the restaurant, and it was just perfect for relaxing, talking, and sharing the finger food. The whole atmosphere is relaxed and fun. DON'T MISS!"], ["Steve R.", "First Timer. What a great experience.The food was delicious. More on the light weight side, Paninis and items like that. Had lunch there today. The service was right on target. The place was nice and full, but not overflowing. The lemonade I had was the best lemonade on the planet. Had a Cucumber taste to it. Pricewise, I believe was fair. This was just an overall pleasant experience, worthy of repeat visits. Can't wait to come again. Very nice job folks. Keep up the greate work..."], ["Jennifer N.", "Food: - Bruschetta: 4 half slices of gluten-free bread with a choice of 4 selections. We chose Brie & Apples with Fig Spread, Fresh Mozzarella with Tomato & Basil, Prosciutto with Figs & Mascarpone, and Smoked Salmon with Pesto. My favorite by far was the Brie & Apples. My second favorite was the Smoked Salmon with Pesto. 5/5- Banyan wine: good but doesn't pair well with the bruschetta. 4/5Service: Fast and friendly. 4/5Final thoughts: The bruschetta was really good. This is a great place for girl's night or date night!. They're open late and has cool vibe."], ["David M.", "As always... The staff here is amazingly friendly creating a warm and inviting environment.  I love this place!"], ["Ashley N.", "Bruschetta, wine, more bruschetta and more wine! What more do you need in life? If you come here on a Monday or Tuesday after 8pm, you can get a bottle of wine and four bruschettas for $20. Total steal!!! The bruschetta board is normally $14 and I'm sure the wine is way more than $20. You'll want to plan to come a tad early because this place is always busy, even on non-$20 days. As for the bruschetta, we had the fig and asparagus with mascarpone which was my second favorite. First fave was the salmon with capers! Salmon was perfectly smoked and melted in my mouth. Yum! Others to try that were delish, the white bean (packs a little punch), artichoke spread, Brie with apples and one with tomatoes and bacon. I'm sure we had more than this but I can't remember exactly. All I can say is this place is so good and you won't regret it!!! Perfect place for girls night, date night or just hanging with some friends and family. I wish this restaurant was on the East Coast!"], ["Kerri O.", "Last time I stopped in for a late lunch, my server was great and as was the food.  I saw a lot of new faces-- a good thing. The server was attentive and kept busy. I'm hoping on my upcoming date, the service is consistent."], ["Glenda C.", "Find me here on Mondays and Tuesday's for their $20 wine and bruschetta special! Not to the forget the excellent customer service. This location really knows how to treat its customers."], ["Chris M.", "I've been to this restaurant twice now. I found it during a trip to Phoenix and made certain to return on the next trip. Food:Excellent. I've tried a few paninis, chicken salad, cheese plate, chicken chili soup, and a few desserts.   Drinks:Good selection of beers (a few draft and many bottles), wine, and mixed drinks. Service:Excellent both times. Fast, polite, and knowledgeable about the menu. Atmosphere:I've only eaten on the patio. They have sun sails and water misters, and a fire pit which probably runs only on cooler nights. I will definitely be back here on future trips to Phoenix."], ["Anna K.", "Went here for Valentine's Day around 7ish - 8ish. Forgot what time we arrived. The entrance is in the back with a bright yellow arrow pointing down! So you can't miss that. Walked in, and this lady greeted us right away and seated us at a high top. Well she asked if we wanted a low or high! Anyways , started our night with some wine ! Then ordered some bruschetta . My favorite was the mascarpone with figs! SO GOOD. Then ordered a salad and fiancé had some type of sandwich with a salad on then side. I prefer his salad over mines . Food was just okay, nothing special. Especially there menu is very small. I gave it a 3 because it took awhile to get refills or even more wine . But our server was nice and didn't forget anything we ordered ."], ["Jocelyn Y.", "I am in love with this place. My sister took me here when I visited and she says she comes weekly! They have the best deal on Monday & Tuesday after 8 pm. A bottle of wine & bruschetta for $20! SO good and such a good deal! My fave was the burrata, bacon, arugula & tomato bruschetta. And we tried the tempranillo cause it was one of the more expensive bottles but I loved it! My sister usually gets a whole bruschetta and bottle of wine to herself but I think sharing was fine for us. I like how they let you get your bottle of wine first and drink it while you wait to be seated. They told us it was an hour wait and it does get super crowded  but if I have my bottle of wine while I wait I'm happy."], ["Kate H.", "Life was delicious when I worked near this location. Loved to stop for lunch or grab to-go for the office. I remember the chili (when I was lucky enough to get it as soup of the day) was to die for. Food comes local, so its fresh and good. This location is the sole reason I have learned of my love for moscoto! As someone who couldn't find a wine, the bartender listened to what I like and suggested I try this. Well, now I'm addicted- and Postinos has THE. BEST. MOSCOTO. EVER."], ["Jessica Y.", "I've eaten bruschetta all my life, but never had it in a form of a sampler.. pure genius!yelp.com/biz_photos/post…1. brie & apples with fig spread2. smoked salmon & pesto3. prosciutto, figs, and mascarpone cheese4. burrata (love), bacon, tomatoAll this, cut into smaller bite sizes, and $14; a steal. The concept of bite-sized bread+toppings remind me of Fig & Olive in LA. But, I do think that Postino's just tastes better.We also got the Butcher plate with different meats, cheese, hummus, and olives. And the raspberry chicken salad. It was all very good.JY got the cucumber honey lemonade - SO refreshing and has a strong cucumber flavorI got a glass of Malbec. $11 for a mini carafe and it was great.Probably one of the best things I ate in Arizona!"]], "Coup Des Tartes": [], "The Arrogant Butcher": [["Giovana R.", "I came here a while back, the food was good and the service was great. I cannot remember my waitresses name but she was awesome she checked on us a few times and she was also very funny. I would recommend this place to anyone! The service is what made me give the five stars because now days it's had to find places with good service."], ["Mike F.", "- Very entertaining space.  We sat in the seats that overlooked the kitchen right in front of the charcuterie/salad station.   It's always interesting to see the kitchen at work.  One guy was the mushroom guy for the night.  Giant delicious looking mushrooms.  His attention to detail as he was cleaning and inspecting them was admirable- The charcuterie board was ok.  We had the chef's board and it had two meats (a prosciutto and a dried sausage), bacon wrapped sweet potatoes, and a bunch of pickled vegetables and one cheese.  Nothing spectacular, but it was a decent start.- The scallops were delicious.  Perfectly tender and a nice savory preparation- Service was solid"], ["Mandy C.", "Terrible. Save your money and eat somewhere else. Oysters were full of shell fragments, they served with a nasty green sauce... Cocktail sauce is the gold standard guys, don't get creative. Had the beef stew which was very average, and my friend had the crab stuffed chicken which was dry and boring. Even the drinks were boring. After school special is a nasty ass drink, it's like a nasty version of a michelada, I didn't think it was possible to make modelo taste bad, but this place found a way to do it. Worse of all, they saw that I only took one sip out of the drink, and didn't offer to take it back or exchange for something that didn't taste like garbage... Seriously 90 dollar bill for a place that has slightly above average buffet quality food.... No thanks"], ["Regina W.", "You just can't go wrong with a Fox restaurant!  It is always crowded and full of life, seems like.  The last time I was here I had their Wednesday special of meatloaf with mashed potatoes and green beans.  Great portion size and enough to bring leftovers for lunch the next day!  I had the pleasure of enjoying this place again!  I didn't know there an additional room towards the back!  So we sat there and began with some chit chat, but unfortunately waited longer than usual for someone to acknowledge our party of 4 to even get us water.  Luckily, that did change and we were compensated with 2 servings of their delicious and popular appetizer:  pretzel (freshly baked) and cheese fondue.I ordered the pork carnitas nestled on top of a sweet corn cake, drizzled with tomatillo salsa and avocado chunks (also with cabbage and cilantro) ($14).  I loved the combination of sweet and savory!  It really was a lot for me to try to finish after all that pretzel and cheese.  Not complaining!  I also ordered and enjoyed their Moscow Mule.  I also sampled some of the scallops entree, which was enhanced with bacon and bacon flavoring, snap peas, and other bits and pieces of garnish.  This was a nice lighter dish to follow after an appetizer.  Our waiter was very friendly and pleasant to have.  We all enjoyed our dinner!  I would definitely come back here again to try more of their tasty dishes."], ["Deni G.", "Never DisappointsThe Arrogant Butcher was recommended by a friend and is a Fox Restaurant Concept, generally known for more upscale type establishments.  The atmosphere at Arrogant Butcher is  trendy and has a relaxing vibe.As we arrived we were greeted by a very friendly hostess who made us feel genuinely welcome. Then a few minutes later our server, added to that feeling. All our questions were answered about the menu, and our server made suggestions based on our perferences.We started our dining expeirence with appetizers, which were delicious.  I highly recommend the freshly made pretzel balls served with provolone cheese fondue. The pretzels are so fresh and fluffy, our server told us the pretzels are made on site every day. On this visit we also sampled the roasted peppers toast, smoked salmon toast, and the prosciutto deviled eggs.  All which I would order again.  For dinner I had the sea bass with creamy barley.  My entree  was absolutely delicious.  My dinner companions had the crab stuffed chicken which he said was the best he ever had. The portions were the perfect size and cooked to perfection. As good as the entrees were, they were matched by the dessert selections.  We split the salted caramel pudding (my favorite), the peanut butter cup, and the pumpkin cheesecake, you couldn't go wrong with any of those. The desert were fantastic.The service was perfect and our server was friendly and there at the right time every time.  We will definitely come back again."], ["Jonathan E.", "This is our go-to restaurant for comfort food. We live in downtown Phoenix and have visited this place in excess of 6 times in the last 9 months. SERVICE ---- consistently poor, increasingly careless (used to be OK, now it's pathetic)-- latest visit saw our steak overdone and crab cold-- the service was inattentive at best, horrid at worst-- server forgot to place an order for an appetizer (and then delivered the wrong appetizer)FOOD ---- food is consistently good, if served warm (last 2 visits, food was cold)-- drinks are consistently good, if delivered promptly (which seldom happens)-- food quality has drastically plummeted over the past 9 monthsAMBIANCE:-- pretty good-- outside seating / patio seating is very nice-- location is centralVERDICT:-- unlikely to visit anytime soon-- for a typical check of $110 or more (see photos), I would go elsewhere-- save yourself time, money, hassle and headache and go to a myriad of different places in the area.-- Have seen similar deterioration in service and food quality at other Fox restaurants in the area (looking at you, North and Olive + Ivy)."], ["Sean B.", "I only went here for an appetizer and a couple of cocktails before seeing a Phoenix Suns game at Talking Stick Resort Arena. The drinks were potent - had a Moscow Mule and it was made well. Staff was friendly, service was prompt. Will be back!"], ["Matthew S.", "Well the arrogant butcher lives up to its name. I think they are very proud of their food and the prices show that. I went with a co worker and we both left with sorta of a meh  feeling. Swevice: While our server did nothing wrong he seemed to have a very fake attitude. Like he did not enjoy his job but is pretending to. Drinks: This was our biggest complaint we both had Titos with Juice and Coke respectively. At 8.00 this was the weakest drink I have ever had. Food: Chicken Stroganoff and Short rib stew. Both entrees were fine but I would not go out of my way to come back for either. I also had 2 oysters that honestly seemed a little shy of fresh. Desserts. This is where they shine. I had a wonderful chocolate cake and the other dessert was a peanut butter cup with 2 cookies and a kinda if peanut butter soup. 5 out of 5. If I was downtown I would go grab some meat and cheese but skip the entrees and drinks."], ["Brenda L.", "I tried the zucchini fritters with aioli as an appetizer and thought they tasted like hush puppies. I tried the crab stuffed chicken (with capers, lemon jus and spinach) and sampled some of my brothers filet mignon (Boursin Creamed Spinach, Crispy Potato for $36) and his gf's beef short rib stew with a side of corn bread (Green Chile, Fried Egg). The stuffed chicken was great because there was a lot of crab meat. The lemon added a great zesty and fresh flavor to the moist chicken. The filet mignon was very tender and was cooked perfectly medium rare as ordered. The stew was a bit bland but the cornbread made a nice accompaniment. I also ordered a pineapple pisco sour (Pineapple Infused Mistral Pisco, Snap Molasses, Giffard Orgeat, Orange & Peychaud's Bitters) and tried my brother's butcher's blood and sand scotch cocktail (Pig's Nose Scotch, Cherry Heering,Carpano Antica, Orange Juice, Clove & Orange Bitters) and his gf's Modelo beer cocktail (after school special: Raspberry Tea Infused Jose Cuervo, Ginger Agave, Lime, Modelo Especial). The after school special cocktail was my favorite one because you got the side of beer in a can so it was the most bang for your buck. It was also the most refreshing to me The cocktails were about $10-12 each. Our waiter was extremely friendly, helpful and awesome. They have \"daily specials\" that aren't actually daily (only Thursday-Sunday). The decor here is really awesome and trendy. They have private rooms that you can rent out and also a larger dining area that has plaid booths. They have cool chalk art on the wall and a pretty snazzy bathroom with nice tiles (if anyone cares). The waiter said all of the appetizers, particularly the pretzel fondue were really good so I'd be interested in ordering more appetizers in the future."], ["Thomas L.", "This place is ok, nothing special.  I have been here 4 times, 3 times for lunch and recently for dinner.  I know this place is always busy and can get pretty crowded, but I'm baffled on why.  The location is awesome, its literally across the street from the US Airways arena, and there's alot going on in this block.  The ambiance is really nice, and they have some really cool photo's around the place, but as you know what I say, It's all about the food.  The prices are pretty high and the food and portions are nothing to brag about.  We arrived on a Saturday night, it was 10 of us.  We made a reservation at 6:00 and we're seated right away.  The service was pretty poor, but since we had a big group, figured there would be more than one waiter for our table.  We ordered some appetizers which we split and my lady ordered the Chicken stuffed with crab with a side of potatoes.  I ordered the Fish and Chips.  I hear some really positive reviews about their pretzels and fondue, but I thought it was gross.  We were all talking and chatting, and by the time we dived in the fondue, it developed a thick layer on top, which you commonly see from processed cheese like Velveeta, and when I dipped the pretzel it pulled the thick layer with it. That's why its under a fire, cause soon when it gets room temperature, it hardened up.  Not impressed at all, but if you like Velveeta, you might like their fondue.  The meat and cheese board was a joke, and the hummus was bland.  The main course arrived.  Since I had a horrible experience with my last fish and Chips (The Codfather) I felt I needed something to redeem my last experience.  The fish and chips were pretty good.  I requested some tartar sauce, not this ranch cr*p they gave me and malt vinegar, but it never arrived.  So I just ate it plain. My lady ordered the Chicken stuff with crab dish.  Like I read in a previous post, I have no clue what it was stuffed with, cause it sure wasn't crab.  It was like minced crab if anything else.  Really disappointing dish, especially for that price.Food=C.  Very mediocre.  Portions are small and very little creativity.  Appetizers were terrible and quality of the ingredients are poor.  I have no clue what that chicken was stuffed with.  If I had to bet, it was minced crab out of a can.  Terrible.Service=D.  I'll give him the benefit of the doubt.  We had 10 people in our group and he tried to accommodate everybody, but clearly couldn't handle the group.  I had to request my drink to be refilled several times and it took a while to get it filled.  I asked for lemons for my lady, it never arrived.  I asked for Tartar sauce and Malt Vinegar, that never arrived either.Not impressed with The Arrogant Butcher.  I've been to several FOX concepts restaurants but this one is probably the worst.  Culinary Dropout is a close second.   I do like North a lot though.  Maybe I'll just stick to that one.I do not recommend this place at all."], ["Lisa Monique C.", "I went to The Arrogant Butcher for the first time on a Saturday evening. Our wait for three people was 45 minutes. We finally sat down. Our server greeted us. Answered questions for us. We ordered or meals which were:-Slow roasted prime rib. Comes with scalloped potatoes and juice from the meat on the side. -Chicken stroganoff-Fish & chips with coleslawThe slow roasted prime rib was probably the best piece of meat I've ever tasted. I almost died with the explosion of flavor and tenderness. It was a huge think piece of meat, too. The scalloped potatoes were decent. I tried my dad's stroganoff and it tasted a little off to me. It also needed salt aka flavor. Lastly, the fish & chips with coleslaw were delicious but EXTREMELY greasy. I personally think they should strain the grease off a little better. The decorations are nice and the bathrooms are huge and cool! This place is a bit expensive for what it's worth. Our bill was $75 for three meals and two glasses of tea."], ["Peter K.", "I had the mussels and chopped salad. Mussels good not spectacular  chopped salad didn't arrive \" chopped\" but nonetheless very tasty. champagne vinaigrette dressing was the star No desert but had the pretzel fondue. Not worth the caloriesGood vibe but perhaps I'm too old to embrace the ambient noise and chatter"], ["Cyn V.", "Pretty darn good for a company lunch spot.We had a big group of about 14 employees come here during the busy lunch hours. Our server was quick, witty, and definitely knew how to describe everything on the menu. Must have aps are pretzels and cheese fondue plus the crispy shrimp.I ordered the butternut squash tortellini. Wow! It's was so flavorful and buttery! I am still dreaming of this dish.I highly recommend on coming back here to try their happy hour specials. Thanks Mr. Fox for another restaurant concept that I highly enjoyed."], ["Diane M.", "From Sam Fox's Restaurant Concept group that brought us Culinary Dropout, Arrogant Butcher lived up to their name.  Long wait times, even with a reservation; self important wait staff; and prices higher than the food warranted- good, but not amazing.After waiting at the bar for about 25 minutes past our reservation time, we were seated in a comfortable booth, but waited another 10 minutes to see any wait staff.  We also waited almost a half hour between courses.  It was a good tactic if the goal is to keep you ordering drinks.We started with the Tabbouleh Salad $8 and the Crispy Shrimp $13.  The Tabbouleh Salad was good, but not exactly what we expected.  It was more akin to a dinner salad than Tabbouleh you would expect at a Mediterranean restaurant.  The shrimp were drenched in oil and not something I would recommend.For entrées, three of us ordered the special- a 5 oz filet and 3 scallops with creamed spinach.  The entrée was good, but given the menu prices, we were surprised when we received our bill that it was $56.  The fourth in our group ordered the Sweet Potato Tortelli for $15.  She seemed the happiest about her meal.For dessert we picked the warm peanut butter cup chocolate gelato and the salted caramel pudding for $6 each.  Both had a cloying sweetness where you could only eat a few bites.  However the peanut butter cup was pretty tasty if you dipped a piece of the cookie in the gelato."], ["Victoria J.", "The first impression was remarkably bad due to the unfortunate actions/attitude of one hostess, but thankfully the evening took a dramatic turn around. The manager, Rachel, was fantastic and made great effort to ensure our experience improved. Our waitress, Celcile, was extremely knowledgeable, friendly, and never let a drink go dry. I was extremely impressed with them both. Even the lady who sat us,  Sarah, was very kind and helpful. The food is on a level of its own. As a party of five we shared the Butchers Choice platter n it was delicious. Id recommend ordering two for a party of six or more. All of our entres were cooked perfectly (chicken stuffed crab highly recommended). The salted caramel pudding was to die for. Thank you Rachel and Cecile for turning the night around, we will definitely be back! Victoria"], ["K D.", "OMG...... Let's start with the desserts first. Heaven!!!! Warm peanut butter cup is to die for and a must try. The salted caramel is amazing as well and full of flavor and worth the awards. We indulged and had be chocolate cake as well and it was rich and good but a little dry for a molten. Let's pause on all that for a minute. Ok going back to the food. We had the butchers plate which had some great choices on the charcuterie and then followed it up with dinner. For the table of three we had the fried chicken and biscuit, the sweet potato tortellini and the short rib stew. All three were good and well flavored. I could have taken a little more spice but it was seasoned well. Drinks special we had the polish and the old fashioned and both were on points Overall a great pick for dtown Phoenix with good service and a great fun atmosphere. Highly recommend"], ["Amy B.", "I thought this place was just ok. We have been to several of the Fox restaurants and this one just didn't seem to meet up to the expectations of the others. I felt like it was really high priced for food that didn't seem special. The ribs were really good, but not much different than others that I have had. The Chicken with crab was not bursting with flavor. Service was great. Good drink options, really fun atmosphere, just not a favorite overall."], ["Shane F.", "Terrible experience here today. Overpriced crap in a cool location. To start off Our waitress was obnoxious and pushy. She kept coming up and bothering us and interrupting conversations when we hadn't even had a chance to look at the tiny little menu. I got the special corned beef sandwich which was not good at all, cold caramelized onions and stale bread that was completely soggy in the middle when it came out. My girlfriend had some sweet potato ravioli which I didn't even want to try, it had no sauce and a few gross looking mushrooms. After food the waitress kept bothering us, it was clear she wanted us to leave so we did without getting any more drinks."], ["AnneMarie W.", "The filet mignon was absolutely delicious!!!  It was cooked just right (I ordered medium to medium-rare) and was so entirely tasty! The veggies were really good too! Last night I got the kids burger and that was totally good too. I have two more days here and I think I'm going to eat as much meat from the Arrogant Butcher as I can.  Oh yeah, baby!Also, I totally love the vibe here.  Good music and decor. The cooks look like they have fun. And the servers are hot."], ["K C.", "The Arrogant Butcher has a good vibe and friendly staff, however, the food was just mediocre. It was an exceptionally long wait for food as well, not at a rush time for food might I add. I ordered a burger--hard to get wrong--and it was okay. The predominate flavor in their house sauce on the burger and sandwiches is horse radish. If that's your thing you'll love the place. I prefer a blend of flavor instead of one dominate flavor--but that's just me.All in all, the food was okay, restaurant is a fun location, and the prices are fair."], ["Samantha G.", "This is a great restaurant in the downtown area. Easily walkable from hotels and the convention center. We waited about 10 minutes for a table on a busy night. It was a little loud, but once seated it was ok - easy enough to carry on a convo with each other. The menu was tiny - not tiny in terms of offerings, but literally tiny. One of the smallest menus I've seen. There were several offerings that sparked my interest. And I wish I was hungrier so I could've tried more. In the end, I just had the grilled salmon. It was great - wonderful veggies and perfectly cooked. Our server was friendly, attentive, and knowledgable. She checked on us often and had good menu suggestions. There are several beer, wine, and cocktail offerings as well. Portions were pretty sizable. Good quality and quantity for the price. Nice ambiance and decor. Good overall vibe. In short, I'd readily dine here again."], ["Anna P.", "A nice fun place for a gathering, I had the salmon and the pudding as dessert. I loved it. And it was conveniently right next to out hotel. Perfect for a fun night."], ["Noel C.", "Visiting Phoenix for a convention, we found a site per yummy antipasto appetizer followed by delicious salmon with oyster mushrooms, tiny baby potatoes, green beans and tiny pearl onions. Very fresh and just the right amount of food! Our waiter Adam was fabulous. Lucky find!"], ["Dana W.", "I had the tortellini.  It was ok.  The flavor was a little flat.  Prime rib was chewy and iver priced.  Waitress took my plate twice before I was finished.  I had to ask her for it back.  It was obvious she was rushing us.  Overall I'm like \"meh\"."], ["Greg G.", "Good food. Overpriced. Overrated. Snobbish service. Typical Fox concepts. Elitist/Hipster employees. Unimpressed."], ["Jo G.", "What can I say...great service by Andrew, good selection of beers...loved the fresh squeezed ipa, charcuterie of smoked ham and  sharp aged cheddar yum, and entrees delish.  We will be back to try more!"], ["Jill H.", "(Review is based on my experience as a diner at large private dinner here in early January 2015.)Regardless of my party size, I think the most important take away from my review that follows is that my taste buds are actually still reminiscing about the meal a week & a half later.We were sat in the cozy private room to the right corner of the restaurant for our company dinner. Upon finding our seats, we were immediately greeted by our friendly server who brought an unexpected starter basket of warm hot pretzels with cheese and a basket of fried shrimp w/fried peppers and a zesty dipping sauce. We had a preset menu choice of salmon w/veggies (Brussel sprouts); beef; or chicken stuffed with crab & a veggie side. For dessert, we had the choice of salted caramel pudding or pumpkin cheesecake w/compote.I went with the salmon and pumpkin cheesecake and SO glad I did. I really hope this is available to any of you on the main menu because it's something worth coming here for. Also, don't expect to overeat as the portions were typical of a high end dining experience. I didn't think seafood in the desert could ever be so good. The glaze and char marks were perfect to my pallette. I'm a huge fan of brussel sprouts, especially ones with a little char and was happy to see halves in the vegetable mix under the salmon (I only wish there was a little more). The pumpkin cheesecake was served in a mini jam-like jar with the cheesecake part on the bottom, fruit on top and crumbled crust on top. Needless to say, it was love at first bite. I kindly shared in exchange for a bite of the salted caramel pudding which was also good but nothing in comparison from my point of view.The restaurant was packed of what seemed like diners happy to be enjoying the experience there. I only wish I lived closer so that I could return sooner!"], ["Cheryl W.", "My husband and I had our wedding reception for our small wedding of 15 guests.  It was the perfect spot for an intimate occasion.  Everybody loved the food and everybody was full!  The staff were amazing, and Kristy was so helpful with the planning.  I highly recommend this place for the private dining experience."], ["Matthew H.", "Perfect patio to people watch while enjoying a 4 star meal.  The jambalaya was great but a little too spicy.  (And I love spicy.) Good service on a very busy Friday night.  The prices were very reasonable for a nice restaurant."], ["Joseph H.", "Culinary Dropout and Arrogant Butcher are the best that Fox Concepts has to offer.  Between the mussels (if you are in to that sort of thing), and steak entrees, you're guaranteed to have a great meal.  Side note, double up on the beverages if you plan to drink.  A double at $14-16 is better than $10 each."], ["Susanne C.", "Fabulous sushi at the amazing Stingray! Great music...indoor..outdoor dining...wonderful service. A great time for a Friday night celebration!!! It's Friday! Love this spot!"], ["Celine J.", "Came in for a day of bar and food hopping around phoenix. It was during comicon so there was a 40 minute wait for tables but we found a few chairs at the bar, which is open seating, right away. We got the short rib stew with cornbread and a couple beers. The stew was very decadent with the perfect amount of spice to it from the chiles. The egg added that extra oomph to it and the cornbread with it was the perfect bite. Happy hour is only Monday - Friday."], ["Rebecca S.", "Freaking delicious! Great service too. Ate and drank here several times over the week. Definitely recommend!"], ["Nicole N.", "My husband and I went to the Arrogant butcher for our 1 year wedding anniversary! We had never been there before and we truly wouldn't have wished anything different about our evening. Our server Gino was absolutely amazing, he was informative, nice, (Not arrogant like tons of the other comments) and check on us regularly. We got everything he recommended other than an old fashion because im pregnant and every item of food we received was just amazing. Another server by the name Kelley overheard us talking about our anniversary and went out of her way to inform Gino, he then took the liberty to go the extra mile and offer us a desert on the house to share. My husband and I are always hesitant to go to \"expensive\" restaurants because he never leaves full and its just never worth the 100 dollar tab including tip but Arrogant Butcher WAS ABSOLUTELY WORTH IT!We share aged cheddar and Cobba meat? I believe that was the nameI got the ribs and my husband got the New York Steak and both were top notch. My husband said the best steak he has had at a restaurant including the keg.Thanks Arrogant Butcher, Gino, and Kelley for making our 1 year anniversary awesome."], ["Veronica E.", "Perfect spot for a draft beer or well drink for happy hour.  I like the fact that these are one of the few spots that start happy hour at 3pm in case you're antsy for an afternoon beverage.  Great atmosphere and patio area.  It is in the heart of downtown Phoenix so it brings in a solid crowd of professionals."], ["W Z.", "Good spot if you are going to any event downtown. I highly recommend the butchers plate if you like food variety. I have been here a few times and each time I say man that was good. It is a tad pricey but I never feel like they ripped me off when I leave. Our most recent sever Xavier was great. Friendly, prompt while offering good recommendations. Give this place a stop for lunch downtown or a pregame/ event meal."], ["David S.", "I have only one thing to say about this place:They have a pretzel fondu. Get that as your appetizer, and don't order your meal until you've tried it. The discerning palette will, after tasting the pretzel fondu, decide to place a second order of pretzel fondu for the main meal. Nothing quiet finishes off a meal like a desert of pretzel fondu, so I recommend that for desert as well. Each course of pretzel fondu can be paired with a different beer from their ample selection.Follow these instructions and you will not be disappointed. I can not speak to any of their other food since I have not wasted my time trying it."], ["Erica C.", "We had been wanting to try this place for a while. We've been to several of the other Fox restaurants. All have delicious food. This one is the exception. First when you walk in you are overwhelmed by the size and magnitude of the place. It's is huge, cold, very warehouse like. It reminded us of a Cheesecake Factory or TGI Friday's. Big cookie cutter chain restaurants. Second, the food was nothing spectacular. We had the salmon dish which we could get anywhere else. We also tried the beef short rib stew. I counted 4 small chunks of beef in the whole pot. It's more of a vegetable stew.  The blueberry cheesecake was yummy. Third, the service was rushed and robot like. \"Get'm in. Get'm out\". All in all, we will NOT be coming back. Not worth the money, time, or experience."], ["Gail R.", "Love this pace and look forward to dining here whenever I am in Phoenix. How I wish there was an AB in Los Angeles (hello can someone help me with this). Love their charcuterie selection and you can't go wrong with the pretzels and fondue. Tonight' I also tried the wedge salad with Kalbi short rib. To die for!!!! So many flavors, so delicious. Our server Janelle was great. Can't wait to come to Phoenix again....."], ["Sierra S.", "We came in with a party of twenty and the team was great! Shout out to Tiffany especially :) they were kind, polite, and efficient. And best of all - calm! Food was excellent from appetizers to desserts. Particularly recommend scallops."], ["Michele G.", "I was excited to dine at this place with friends because it received such great reviews. Unfortunately, both my husband and I thought the food was okay - not amazing. I ordered off of the Restaurant Week menu so my meal came with an appetizer, entree and dessert. The tabbouli salad was nothing like typical middle eastern tabbouli (still not sure why they called it that) but it was good and flavorful. The portion of the salad was huge and I was able to share it with the entire table. For entree, I ordered the crab stuffed chicken. To me, it was a little dry and the flavors weren't amazing. My husband ordered the scallops on the regular menu and although the portion was a nice size, he didn't care for the flavor. His dish came with bacon wrapped sweet potatoes and green beans, which I thought were the best part. The salted caramel pudding dessert was by far my favorite part of the dining experience and I would definitely come back for that again. Apparently it has won awards over the years.Overall, I thought this place was just okay. I know this is a Fox restaurant but I prefer the food and upbeat environment at Culinary Dropout (Tempe)."], ["April R.", "Came here for lunch and drinks and left with an overall feeling of average.  It was a weekday afternoon and the restaurant was not very busy.  We sat at the bar and felt the service was ok at best.  The bartender did't really seem to care or want to be at work.  The beer list isn't that great and I was underwhelmed with my cocktail of choice, \"The Polish Fix\".  Not bad but not delicious like I expect a good quality (expensive) mixed drink to be.  For food we shared the Butcher's Platter.  It was a large size, plenty for two people to share.  The platter consisted of meats, cheeses, bread, and other extras.  The platter was tasty, I enjoyed the majority of items  provided."], ["Pamela B.", "Ahhh I absolutely love the Arrogant Butcher. I go around Phoenix and Scottsdale and try other restaurants (e.g.: Citizen Public House, St Francis, The Mission etc) but I keep coming back to my first love (The Arrogant Butcher) ;) This is definitely in my top three favorite restaurants of all time, and my favorite American restaurant,no doubt. Appetizers: I LOVE their cheese and meat plate. The cherry marmalade that comes with it pairs up perfectly with the cheeses and the meat. My favorite cheese are the cypress grove and the prairie breeze (I found both of these at AJs and can't be happier). The Black mussels are my favorite as well. The butterly/garlic sauce it comes with is so so so so good. I could eat it with absolutely anything.Entrees: I used to order the NY strip but unfortunately, they have gotten rid of it so the next best thing is the grilled ribeye. The succotash and creamy horseradish is what makes this dish AMAZING. My boyfriend always gets the burger which he said is the best burger he has ever had. I've had the jambalaya for lunch before which I thought was just okay, but maybe that's because I was never really a fan of jambalaya.Dessert: Their award winning salted caramel pudding. Out of this world. They have a great selection of drinks. I always get the pink drink as I like girly/sweet tasting drinks.I am getting hungry as I am writing this review. Can't wait to be back here again!"], ["Bryan F.", "The food here is very good, the service is decent.  I would come back, but would not go out of my way to come here."], ["Mark C.", "If you've read up on any of my Yelp reviews on Sam Fox's restaurant concepts, you probably know that I pretty much repeat the same story like its a broken record.  High prices, average food.  I've actually been to Arrogant Butcher before for a light happy hour, but today was my first time dining during non-happy hour business hours.  As with other Fox restaurants, each concept has its own unique twist on classic fare.  But for all the creativity, there's simply no getting around the fact that the terms \"Sam Fox\" and \"value\" are in no way synonymous.I came here with a couple of college friends to watch the NCAA basketball tournament around lunchtime on a Saturday.  Arrogant Butcher's bar is a good spot for such an occasion with ample TVs and ample seating at the bar and the perimeter booths.  There's also plenty of seating out on the patio and in the main restaurant area.  Its the perfect location for a meal before a big event as Chase Field and Talking Stick Arena are both just steps away.  It was pretty busy for a Saturday lunch despite no big events going on Downtown that day.  We started out by splitting their famous cheese fondue & pretzel bread appetizer.  Great for sharing and pairs great with a nice cold beer.  Unfortunately they charge twice as much for it when its not happy hour.  Still, $10 isn't completely out of line.  I had read all the Yelp reviews raving about their Short Rib Stew so I went with that.  The dish came in a little pot and a side of cornbread (see my photo).  The stew was certainly spicy thanks to an ample amount of green chiles, but overall I wasn't too impressed with the dish.  I tasted the chiles far more than I tasted the meat.  And the portion of the dish was certainly not in line with the $15 price.  I also got a pair of 16 oz beers on tap which were a ridiculous $7 each.  Really?  On the plus side, our bartender was excellent.  Kept tabs on our glasses at all times and got our food orders out to us in impressively quick fashion.  I gave him a generous tip for his efforts.  But in terms of the overall food & drink bill, you could probably get the same quality food and the same portions of it for about 20-30% less at comparable establishments.Overall, we had a good time watching the game and the aesthetics of Arrogant Butcher (as with pretty much all Fox concepts) are very pleasant with great views of the outside and a hip modern feel inside.  But as with all Fox concepts, be aware that you'll pay extra for the privilege of taking in those aesthetics (sometimes a lot extra).  I would certainly come back here for happy hour as the prices are actually quite reasonable then and the happy hour menu includes a lot of their biggest hits (both food and drink).  But as a regular everyday sit-down restaurant, you can find a myriad of places in Downtown Phoenix that give you a better bang for your buck.  After all, Sam Fox isn't the only restaurant genius in town."], ["Kathy W.", "We were a large group on a busy Saturday night. They didn't have a reservation available for our group, but some smooth talking and a tip got us a table.We had a personable (and cute) waiter who was happy to go through the menu and make recommendations. He also wanted to make sure that we weren't in a hurry. We weren't (which turned out to be a good thing).I started with the \"Old Old Fashioned\" cocktail ($11), a very traditional blend of Angel's Envy Reserve bourbon and angostura with orange and lemon peel. Other tried \"The Pink Drink\" ($9) -- vodka, grand mariner, lemon sour, and cranberry bitters -- which was pronounced \"quite sweet.\" The Arrogant 85 ($9) was a surprisingly refreshing combination of gin, aperol, St. Germain, and sparkling wine, served in a champagne glass. It was a nice combination for a warm Phoenix evening.On the appetizers menu, we tried the house soft pretzels and provolone fondue ($10)  -- round-shaped pretzel bread to dip into the smooth, rich cheese sauce that were a hit with everyone at the table. The zucchini fritters ($8) were light and fluffy and the parmesan aioli was a perfect salty/creamy addition.My entree was the beef short rib stew ($18), made with plenty of green chiles and white beans, served with a knob of cornbread for crumbling into the spicy, flavorful broth. The stew was topped with a fried egg which added creaminess and texture into the stew.My sweetie got the Sweet Potato Tortelli ($15), made with mushrooms, spinach, and hazelnuts in a butter sauce. He added a blacked chicken breast to make it a hearty, rich meal.Other favorites at the table were the scallops ($25), served with bacon-wrapped sweet potato, peas, and marcona almonds in a brown butter vinaigrette, a petite portion but full of flavor. The steaks ($36 for the filet and $35 for the New York Strip) were prepared traditionally and given a thumbs-up.The warm peanut butter cup dessert ($6) was almost a sweet peanut butter soup, served with a scoop of chocolate gelato in the center of the bowl with two cookies alongside. The Salted Caramel pudding ($6) was ridiculously rich and delicious...and tasted of nothing but salted caramel. Fabulous.The service was friendly throughout and our waiter was even able to handle separate checks on the big group. That said, it was an hour from the time we were seated until our entrees came out -- clearly the kitchen was having some difficulties. But our waiter did warn us of this up front...and when our food did arrive, it was all warm and delicious.I'm happy to recommend this as a great spot in downtown Phoenix. Just don't go if you're in a hurry."], ["Jet T.", "Expensive and very tiny portions of steak or fish.  A party of four, we were served no vegetable on any of our dishes  - just some raw leaves sprinkled atop my Mahi-mahi, which was the size of a medium stick of butter. On the upside, the wait staff was very young and attractive. Oh, you have to wait nearly forever for the wine because it has to be apportioned out from the bar into a tiny carafe  - very lame!  You do get an empty stem glass right away. (Probably due to the underage wait staff).  Be sure to say to the waiter while pointing to your glass after 20 minutes of waiting, \"that wine was good, can I have another?''  They will love you for it.And then when we finished off our food,  this homeless looking older guy in jeans and plaid shirt came to our table to ask how things were going.  I assumed he wanted my leftovers.  We gave him a strange look and asked who he was. Turns out he was the manager.  No he didn't seem arrogant! Unless you count making your staff wear a white shirt, black slacks, apron and tie while you dress  like you just stepped off a big-rig :)."], ["Lizeth M.", "I LOVE THIS PLACE!!! Amazing food, great and beautiful people all over this place, a server with the same Birthday as mine! What else could I possibly ask for??!Lovely inside or patio seating. Great mix of dishes and drinks! LOVE the Polish fix as a refreshing unwinding drink!!! Try the rock shrimp w/ shishito peppers or the Pretzel bits with fondue for your appetizer! Yum Yum!!! Nom nom!! Oh and the Cubano, and especially the Turkey Pastrami are a must for lunch!! Bon appétit!!!!"], ["Brent W.", "Like a shiny new car, you still need to look under the hood before you choose to buy.  I love all the exterior bells and whistles of The Arrogant Butcher including the hostess that greets you, the pleasant and hip music and the well thought out interior design.  Our waiter even kept the good vibe going with decent service.However, our lunch choice of steak Cobb salad tells a different story.  The $14 dollar salads were lacking on more then one account.  First, the waiter confirmed our good choice and added \"I hope you like blue cheese...\"  Well the salad came with no 'blue cheese' so hence the awkward (and unnecessary) conversation pursued \"I don't see any blue cheese, is it supposed to be on there?\"  Second, the portion size was small, particularly the measly steak portions.  Consider yourself lucky to get a couple bites of the needed protein to survive.  It's weird but I was actually considering asking for the menu again so I could order another meal.  And that shouldn't be your thought process as you drop $50 for 2 salads and 2 beers...So in conclusion, before you buy the car, be sure you look under the hood and past all the bells and whistles..."], ["Bernard F.", "Good food nasty attitude by hostesses . One person doesn't communicate what the other is doing . Upon arriving on a Saturday pm we were told 15-20 minute Wait. Then someone else told us we are being seated now only to be told by hostess 3 there is a 45  minute wait. These girls are possibly movie stars in dumb and dumber. We ordered a round of drinks only to be told we can't sit On the bench in the bar because that bench is reserved. The people next to us didn't have this issue. I read the hostess the riot act and called over the manager who was apologetic for the rude treatment  although our drinks and appetizer were given to us no charge and the waitress bringing our meal delivered good service . This is not the place to go because of a captive audience and non caring attitude ."], ["GQ R.", "It's coo. Kinda expensive. . Nice ambiance. ... does smell like sea food though.... (I don't like seafood lol). . Fish.. super nice staff this far"], ["Jamie A.", "Our menu so far: house made pretzels and provolone fondue, sweet potato tortelli, roasted beet salad, montchevre (goat Brie), chicken stroganoff, smoked pork Cubano, turkey pastrami, French fries, a kids grilled ham and cheese sandwich, a kids chicken tenders, the \"hot chocolate\" cake, and pumpkin cheesecake with pomegranate compote. Pretzels: yes, just get them. Perfectly cooked and brined, and that provolone has a flavor something of magic. If you can't go for some German bread paired with Swiss/Italian/French melted cheese, well, that's just un-American. Montchevre: still not a fan of goat cheese. My friend liked it quite well, however. Roasted beet salad: surprisingly amazing!  I'm not a huge food risk taker, but I do consider myself a foodie, and I'm trying to take more risks with my palette. This was just perfectly combined: roasted beet for a base (first time eating beets, do it here. It was mine, too), Brussel sprouts for depth, pistachios for crunch, prosciutto and accompany sauce for flavor and pomegranates for balance. Seriously, so well dreamed up. I'll definitely be getting it again. Sweet potato tortelli: not usually a huge sweet potato fan, but I also really loved this. The mushroom and spinach balanced the sweet potato along with the lemon butter type sauce.  The hazelnuts added a touch of flare and texture. So good!Cubano: such an interesting sandwich with deli thin ham slices alongside smoked pork, topped in a cheddar cheese, (usually Swiss), and had a bit of a kick in flavor. Served in a sturdy folded bread like a panini, I'd say. It was good, but compared to the other items we've had, it's a little forgettable. Turkey pastrami: that's what good turkey tastes like. First time trying it as a pastrami, but had same flavoring without feeling heavy. The coleslaw was crunchy and had a great sauce inside. The pretzel bun was perfectly portioned not to overwhelm the sandwich. Suggest eating it upside down to allow the ingredients to soak into the top bun as well. Supposedly their best selling sandwich, and I'd have to say, I'm not surprised and would definitely order it again. Stroganoff: the handmade egg noodles were brilliantly made and perfectly cooked al dente.  The peas tasted fresh and added a little sweetness to a savory dish. The chicken was so tender and flavorful. Never had a chicken stroganoff, but once again the bird made it feel like a lighter meal without sacrificing the savory element you expect from a stroganoff. Just enough sauce, not swimming. Filled with mushrooms - great flavor. Grilled ham and cheese and chicken tenders - predictable, but well received by the kiddos. Fries: sandwiches both came with it - wasn't expecting that. Awesome crisp with soft and airy interior. Cooked in truffle oil?  Something, because they had a different, but yummy flavor. \"Hot chocolate\" cake: made Swiss miss hot cocoa. Pictures something sweet, but it was more of a rich chocolate cake. Almost a brownie flavor with more of a lighter texture (oddly enough, like a soggy cake texture, but in a good way). Cheesecake: who would have thought pumpkin with pomegranate, but that should just be a permanent thing, since it works so darn well. The cheesecake was lighter and fluffier than a traditional cheesecake, but still good. Topped with a pomegranate seed compote - so good. Finished with some granola style crumble - again, so good. Winter seasonal dessert - switches to blueberry in the summer months. Desserts are $6 and are on the smaller side, but still enough to share and portioned in a size that even after a meal, you can make room to share one or a couple. Will be trying the warm peanut butter cup (should have fought harder to try that) and salted caramel pudding in a few weeks (voted best dessert in Phoenix recently). Definitely a new favorite for when we find ourselves in town."], ["Marianne S.", "Fantastic service, but the food is nothing special. The highlight was the Butchers Platter charcuterie- a delicious variety of meats, cheeses, and accompaniments. It was also a good value for the amount of food provided. Our cocktails and entrees were fine, but lacked sophistication and overpriced.  The service was prompt and friendly, but I'll likely not be back since I can get more interesting and higher quality for this price point elsewhere."], ["Cameryn H.", "Only been here once for a birthday lunch but tried a decent amount. There is only one important thing you must know. Best BLT EVER. I have had my fair share in my day and this one will always stand out as best. Tomato jam paired with the smokiest bacon I've ever had? Genius. Cuban sandwich was also ridiculously delicious but it was hard to follow up the amazing BLT."], ["Megan C.", "From start to finish, The Arrogant Butcher was the perfect choice for our small group. There were about 8 of us, and we were lucky enough to be seated in the semi-private booth/banquette area in the back, and fortunate enough to be treated to lovely service throughout our visit. The atmosphere is so cool and definitely not what an out-of-towner who is clearly out-of-touch with how downtown Phoenix has changed was expecting. Our local person, who brought us here, explained that all of the Fox Restaurant Concepts locations have a slick vibe without coming across as contrived.While the name \"Arrogant Butcher\" might imply an overabundance of cured meats on the menu, I was happy to see that there were many fresh options as well, for both the vegetarians as well as the non-salami eaters. We overlooked the appetizer menu (although I've heard the pretzels with provolone fondue are amazing) and went right for the cheese and charcuterie boards, passing those around the table as we enjoyed our drinks. There's a healthy selection of hosue-crafted cocktails and a nice wine selection, but the on-draught beers are lacking a bit. To accompany your meats-and-cheese boards, there are many \"Extras\" you can add for a well-rounded experience, such as Marcona almonds, cornichons, peppers, etc. It's a great way to have a more social appetizer with your group as you wait for entrees.While meat-based mains range from seafood to ribs to chicken to New Zealand Sea Bass, there's also a nice selection of vegetarian items, such as Sweet Potato Tortelli. Personally, I opted for one of their big entree salads, and was really happy with the Tabbouleh Salad. My coworkers raved about the NZ Sea Bass, the Short Ribs, the Pork Carnitas, and the signature AB Cheeseburger.Their desserts are also worth the cost of admission and the calories. We shared one of each of the 4 desserts; each item is $6 and a nice portion. My personal favorite was the Warm Peanut Butter Cup with chocolate gelato.Definitely a cool, hip spot for small groups with varying tastes and varying budget per diems, but also a nice spot for when someone else is footing the bill!"], ["Rene A.", "Yes!  I think most people eat out for food alone. However, I look for the total package, wrapped  up with a pretty bow.  This was our experience today.  A day that we needed it. Celebrating my daughters debut at Symphony Hall I made reservations for a party of 9 which included 3 under 14.  They were very accommodating, tho I was put on hold twice to make sure it was okay to take the 9 top reservation.  They didn't wait to have us all there before we were seated.  A plus as we had my 99 year old grandfather with us and also had to wait for my daughter to change and arrive.  The food was from good to stellar, as we all ordered very different things.  Well three of us ordered the chicken stroganoff, which sounded fantastic but seemed to be missing something.  Still quite edible.  We also had the beef stew (I don't know how good it was because my grandfather wouldn't share), meatloaf (delicious) the smashed potatoes and gravy were perfect. I had the scallops, which were exactly what I needed as they were light and complemented my Arrogant 75(s) perfectly.We ordered each of the desserts to taste them all.  The peanut butter mouse (aka melted peanut butter cup) went VERY well with the hot chocolate cake. I don't know how the blueberry cheesecake was as my grandfather, again, didn't share.  But the salted caramel pudding was hands down MY FAVORITE!!! I'd come back just for that.You know what else I'd come back for? The service!! Tony was amazing!!! I love to ask questions, and he never once hesitated. His recommendations were spot on. He listened and was so much fun.  I eat out for the total package and Tony was the the perfectly tied bow on top!Can NOT wait to come back."], ["Rhyan B.", "I have always looked at this joint and thought, \" meh one day \" well today was that day... They had my favorite brew on tap, and as I walked in seen oysters sitting on ice, on display. I thought \" I'm gonna like this place\". The wait staff is the definition of customer service (Amanda was my server). Then the food came, papadeux's was my favorite place in town. Tonight that changed. Arrogant butcher! You win. Job well done. Will be back shortly"], ["Shane M.", "Service was great and friendly. The food was ok. I was expecting better tasting food since it was a fox restaurant. I guess I just have high expectations because I go the Henry a lot and their food is always awesome."], ["Brian R.", "I had the wedge salad with the braised beef and it was really very tasty.  Didn't look like a wedge salad though.  Colleague wanted the smoked salmon salad but they were out of the smoked salmon.  They were accommodating and used grilled salmon instead.  But I have to ask, how does a restaurant run out of food.  Called ill planning.  They got the four starts because the service was great and our waitress made sure my colleague got the salmon.  When asked for the substitution. She didn't say no, but said let me check."], ["Justin B.", "Me and my dad stopped in for the first time to eat here on our way to Texas. The atmosphere was electric, the service spot on, and the food was excellent. I had the New York steak and crab. It was perfectly cooked and one of the best tasting steaks I've had in a while. Our server Adam was not only pleasant and attentive but also engaged with us as if we were old friends. All in all it was an awesome dining experience. I would definitely eat here again and would recommend it to anyone passing through Phoenix. Thank you arrogant butcher you definitely lived up to your name."], ["Ambyr F.", "So I crushed this food! I got the fish and chips. The fish could've been seasoned better but the tartar sauce and vinegar made it great! I've never had vinegar on fish but the waiter told me to try it and it was worth it! I usually don't like coleslaw but this coleslaw was perfectly crispy and not too vinegary. The service was fast and friendly."], ["Mo B.", "At happy hour on a Tuesday. Food and drinks are a bit limited but that's typical  for HH. Loving the artichoke hummus accompanied with the Fix cocktail. Hummus is warm with a tinge of sweetness. Goes well with the Fix which is a bit tart. Happy crowd, bartender not very attentive."], ["Cosmo W.", "Had a great visit here with some friends- the staff were awesome, the food tasty and the beer COLD- how can you go wrong?There is lots to choose from on the menu, were ordered several appetizers just to share, all good. Short Rib Stew was great!I will definitely be back!"], ["Roxanne Y.", "Love this place. Was super crowded due to Garth Brooks concert but staff was very friendly always smiling, very attentive and great service. Food was delicious and hot. Staff worked very well together."], ["Fanchon E.", "This was my first time at The Arrogant Butcher and I know it will not be my last. Excellent food and perfect service. Thank you, Brent, for taking such great care my friend and me.  The scallops were (wait for it) perfect!"], ["Sarah F.", "Chose this place because of good yelp reviews. They are very busy but walk in wait times were reasonable. The ambience is welcoming! The food was excellent! My daughter had steak, was perfect. I had the tortellini, absolutely amazing! Service was above par! Had a great time! Suggest a reservation if you do not want to wait!!"], ["Glitzyriver Z.", "This place has a cool and easy vibe, the customer service is top-notch and the menu has a great mix of items. We decided to check this place out for lunch based on all the yummy looking photos on yelp, however, we didn't realize there was a different menu for lunch. Though the lunch menu items looked good, we had our eyes set on the Crab Stuffed Chicken dish on the dinner menu, and our waiter made I happen for us! I'm so glad he went above and beyond to ask the kitchen to accommodate us, because we were not disappointed! The chicken had a crisp breading and was stuffed with just the right amount of crab in the center. The cream sauce with capers was light and tasty, though next time I'd ask for some extra sauce. Also, most restaurants don't have Super Tuscan wines by the glass, especially for $10. Huge plus!"], ["Daniel R.", "NY Strip and Prime Rib were done right. Service was good. Great location if your going to arena."], ["Randy J.", "I was in town for a business lunch in which we took our clients here.  The food was great and the staff was great.  The menu had lots of options and they had a nice drink menu too.  The next time that I am in town we will definitely be coming back to this place."], ["Kathrine R.", "We had lunch on National Oyster Day, where they had a great deal of $1 oysters. They were fresh and served with a variety of delectable sauces. If you have a sweet tooth, you definitely need to save room for the peanut butter cup. It's light bs just the right amount to finish off a good meal. Service was fast and attentive even during lunch rush hour"], ["Jeanne J.", "The food is the best. Charcuterie board you can't go wrong. The raw oysters are huge and amazing. The salmon and the prime rib are divine. The servers are all very dedicated."], ["Leah R.", "We went for lunch on Saturday afternoon and sat at the chef's counter. Service was great all around, but Nick was exceptional. He was friendly and helpful. We ordered the Butcher's Platter and cheesecake for dessert. Yum! Will definitely be back!"], ["Gia M.", "In town for business and had heard great things about this place. Decided to try the happy hour after work and was severely disappointed. I am a huge fan of the Moscow mule and was happy to see it on the happy hour bar menu. However, watching the bartender make it I knew it wouldn't be very good. They use a cocktail mix and add vodka. It was very heavy on lime juice an almost undrinkable. I ordered the short rib stew for dinner and it was decent, not much short rib in it. Maybe I just ordered the wrong thing. Other people seemed to be enjoying their food. Maybe I will give it another try next time I make it to town."], ["Jennifer B.", "The food and drinks are fantastic. And the happy hour deals are phenomenal. Unfortunately, our server, Meagan, certainly put the \"arrogant\" in Arrogant Butcher. She was nasty to our whole party from the moment we sat down. A table for 14 people, and when asked for more than one happy hour menu, it was a huge inconvenience to her. She was unfriendly the whole time, and specifically told us we couldn't move seats if we wanted our checks to be correct. It was a social visit with people getting up throughout the evening! And when it came time to pay our individual bills, she refused to take my credit card TWICE because she would only take EVERYONE'S payments at one time. Finally I told her I was wanting to leave and she begrudgingly took my payment. If it weren't for her, I'd be returning soon."], ["Jill H.", "Went here for Happy Hour and they have some really good deals! Check out the HH menu on their site. Tried several of the apps (get the pretzel bites!) and had two of their HH cocktails. All good. Had a pretty rude bartender and an inattentive waitress, but they seemed like isolated bad eggs."], ["Lance Z.", "Visited the restaurant for the first time before a midweek Dbacks baseball game at Chase Field. Happy hour ends at 6pm, so I enjoyed two $5 mules after we were seated at 5:15pm. Great start. Absolutely loved the outstanding beef short rib green chile stew with the fried egg on top and the side of olives. The chopped salad was okay and the roasted peppers were bland. Received terrific service from Meagan and the rest of the staff. We made a reservation for 5:15pm and it was beneficial. I would advise others to call ahead and reserve."], ["Jack S.", "Updating my review because the management staff of Arrogant Butcher reached out and apologized, and did so in an extremely professional way.  Way to be attentive and responsive to your clients' feedback.  Hope to return at some point to give it another shot, hopefully the experience will be superior to the last."], ["Dayna B.", "I have to admit that I only had charcuterie, mussels and cocktails on the patio here.  However, it was still a STRONG showing.  The patio has a great view in downtown near a lot of hotels, the staff was awesome and the only disappointing thing of the night was that they had run out of oysters... oh, tear! The cocktails were also tasty and if I were this butcher... I would be arrogant too.. for good reason!  I would absolutely come back here again and would love to try a main course!"], ["Vicki N.", "Went to the arrogant butcher last night as a belated birthday dinner with my love. Had a somewhat difficult time getting there, its on a one way street, we parked at the garage underneath the location. Thankfully they validated parking. Inside is decorated like TGI Fridays, looks very casual dining to me, but the prices don't reflect the casual atmosphere. He ordered the Thursday special which was fried chicken and biscuit. He seemed to like it although he didn't eat it all, he ate all the coleslaw but there was half a chicken breast and a chicken leg leftover as well as half the biscuit. I personally didn't love the honey drizzled over the lightly battered chicken skin. I guess that's an acquired taste.I had the filet mignon which for $36 should not have been dry like it was . I did order it medium well, but that usually leaves me with a little moistness. Despite being dry it was very tasty. I liked the potatoes and creamed spinach that came with it. I absolutely loved the cocktail that I ordered called Butchers Blood and Sand. The waitress asked me what kind of drinks I usually like and I told her that lately I've been drinking Manhattans. She said I would probably like this drink and she was correct. It came like a martini and it had a wonderful unique creamy and sweet flavor, not as strong as a Manhattan but delicious none the less. It includes pigs nosed scotch, cherry heering, Carpano Antica, orange juice, clove and orange bitters. We had no room in our belly for dessert. My server was very good about checking up on us and making sure we enjoyed our dinner. Overall I would give this place a 3.5 maybe cause I was looking for something a little more formal and partly because my meat was dry.This was not a cheap meal it came to $96 including tip for 2 people."], ["Misty F.", "I had always seen the sign for this place when I was in Phoenix and I loved the name. Finally got a chance to stop in for a bite. It was a Friday night and it took about 15 minutes to get a seat but the hostesses were great at getting everybody's name entered in to receive a text when a table was ready. The atmosphere and decor is super warm with all of the candles on the tables. We ended up eating on the patio area because it was a nice evening and an event was just letting out which allowed for some great people watching.The waiter recommended the pretzel fondue which I was totally ok with because I adore pretzels and cheese. It came out ridiculously fast which almost made me wonder if someone had cancelled their order of the pretzels and cheese because the cheese had a touch of a skin on it and the waiter kind of stuttered a weird little apology about how sometimes they have them right there and ready to go.We enjoyed a couple of local beers that were on tap and dove right in to the pretzel fondue. The pretzel bites were delicious while the cheese was just merely satisfactory. The only thing is, as I was eating the pretzels, I was still perusing the menu and started to become full. I was debating whether or not to even get an entree. When the waiter came back, I asked him about entrees that were on the small side but I also told him I was considering the pork carnitas or maybe just ordered a side or a salad. He ensured me that the carnitas were on the small side so I would be just fine. I realize in retrospect that a waiter is always going to have you go for the more expensive option to have your bill increase (along with their tip). When the carnitas came out, they were actually a decent sized entree. Some of the bulk did come from the cabbage slaw that was piled about 3 inches high on the two corn cakes. I was so full that I only took about two bites and had to ask for a to-go box. My review on my entree was eating it the next day. My next-day pork carnitas were delicious. I really enjoyed the slight sweetness of the corn cake and I felt like I could eat just those by themselves. I liked the combinations of all of the flavors although the cabbage slaw was on the excessive side. I also had a weird bite where I swear that there was an errant walnut, which must have fallen in. My dining partner had a burger and I believe that he was sufficiently satisfied with his burger for the evening. Overall, the food was decent and the staff were very efficient and friendly in all of their interactions. I enjoyed the atmosphere and the location of this place."]], "Province Urban Kitchen & Bar": [["Jenni I.", "A couple of friends and I came here to meet up with a couple of people from a conference we just went to. We ended up missing those people but we had a great lunch instead! They serve breakfast all day here :) perfect.Our server was a very sweet lady who made sure that we were taken care of. I ended up ordering the A.M. Pork Carnitas. The meat was cooked very well and was a bit salty but still very tasty. It came with eggs (buttery but still delicious) as well as a colorful array of potatoes that were soft on the inside but crispy on the outside. I appreciated that the food came out quickly as I was very hungry! The portions were quite big as well so come hungry.All in all, my group was happy with their meals and we would come back again if we were in the area!"], ["Diana B.", "The best.  Raquel is a great server, The manager is amazing, she Looks like actress Shani smith.  The Caesar is real, the Hamburger served the way it is suppose to on real toasted bread.  This place is not for kids!!!!!Yeah!!!Valet Parking. Take the Light rail!!!"], ["Middle Sister T.", "Sunday Morning.Stopped in here for breakfast after another nearby establishment was closed. Found it on Yelp, but didn't pay attention that it was in the Hotel Westin. Thought about bailing, but it was now our second stop, so we stayed.Corned beef hash and sourdough toast was plentiful and delicious.Superfood Scramble - egg whites, over grilled vegetables, topped with avocados - nice flavors - good portion.Bagel Sandwich - pretty good - lots of ham. Side of fruit was very good.Blueberry Pancakes - Fluffy and sweet.BEST part of the morning was the 4-piece jazz group that set up and began to play - remarkable! They played one song - an original composition that got patrons out of their seats standing around to watch them. Asked them if they had a card, were they on social media? Sheepishly, \"No\". Well, random Jazz Dudes, you were Amazing!The hotel restaurant experience panned out after all!"], ["Tiffany P.", "Came here, with a classmate, during our lunch break at ASU. Really nice place. I had the P.B.L.T. served with sea salt fries. It was really good."], ["Erin C.", "Chose this dining experience based on ratings in Yelp. Food was mediocre and so was the service. The White Sangria however was delicious and a steal at $5 during happy hour. Was dining alone and sat at one of the bar tables. 10min later the bartender came over with my water and took order. Where the heck was the rest of the staff, the remainder of the restaurant was empty.  Had the pork shank, which was unusual and tasted good. Nothing spectacular with the favors though. Finally more staff came to the bar, someone took my plate, I asked for the check and waited another 10min. Seriously only a dozen customers in the place... I'm suppose 6pm was too early in the evening to expect decent service."], ["Lynn D.", "I came here with my family for thanksgiving brunch. The staff was helpful and on top of their game. The food was great! They had breakfast food and the traditional turkey dinner. Decor is contemporary and they have a beautiful patio. They had a live jazz band playing on the patio."], ["Jonathan T.", "The food and atmosphere are great here. It's located on the bottom floor of the very nice Westin Hotel in downtown Phoenix, AZ. I would recommend this place to friends and family."], ["Mary S.", "The avocado cheese toast was amazing and even free with a Yelp Check in. Gotta love that. The Veggie Skillet and house salad were Delish! The service was outstanding. Thank you Oliver and staff."], ["Frank G.", "Great lunch Spectacular sweet potato fries.a great surprise for a \"hotel\" eatery.  Good service and the manager was very nice and explained that they also have wine dinners periodically, at a very good price.worth a stop if you are in town."], ["Janelle E.", "Came here for breakfast.  It was our first time here.  Decided that we wanted to enjoy the good whether are having so we sat outside.  It was a good idea because a band set up to play music half way through our meal, which was nice and relaxing.  Staff were very nice and personable.  Also, our server was very attentive.  Food was okay.  I ordered the breakfast tacos.  And my two companions ordered typical breakfast items that I can't actually remember so that's telling you something about how memorable the food was.For a typical eggs and breakfast meats meal we had a 60 dollar tab.  Now, I understand that we chose to eat at a hotel restaurant so we should expect premium prices.  However, there wasn't anything premium about the food.  I have always wanted to try Province since it looks like such a pretty place, so I'm glad we can say we tried it.  However, it may be a while until we return for breakfast."], ["Debbie L.", "Had the Pad Thai tonight. The flavor was good with some spice which was just right. The location is great with ASU nearby and lots to do. I'm just here for the evening but I see this restaurant as a great addition to the attached hotel and not necessarily a place that would come to mind normally when I'm in Phoenix.  I would however recommend it if someone was staying nearby."], ["Phil Y.", "I usually don't have much expectation when going to hotel restaurants and order in-room dining services, especially alone on a business trip. Just grab something to fill teh stomach and time. But I realize my eyes and appetite open my mind at Province. Here are two specialties I like the most. For breakfast, try Superfood Skillet - [Scrambled egg whites, spinach, tomatoes, mushrooms, peppers, onion & avocadoserved over sweet potato hash] I haven't seen any skillet is so prepared with wellness in mind. Simple materials cook hot inside but nothing burnt outside. Adding a bit Tabasco, it's my welcoming breakfast for an energetic day to go.Second recommendation is their Smoothie - [Kale, spinach, banana, mango, and cinnamon] This is really what I call power food that boost your morning drill. Creamy, thick, zesty, and green literally. Nice vibe in the evening for one or two mixed drinks and some chats with interesting souls."], ["Lia W.", "The food is good and the staff is very professional.  A perfect place to eat that is close to downtown.  I recommend the lounge and the restaurant."], ["Debbie H.", "Looking for a place to try for lunch near work in the downtown area. Little to no lunch time crowd which is great if you want quietness & no rush. I ordered the Ultimate PBLT w/shoe string fries-it was delicious! My co-worker ordered \"The Big Rooster.\" She said it was very tasty & flavorful. I was expecting the chicken breast to be a bit bigger since it is \"The Big Rooster\" the tomatoes were bigger...Service was very nice & attentive, but it felt a bit slow when returning w/extra condiments...noticed that side chatter w/employees were more important...granted it was slow, but still...willing to go back to try other times on the menu."], ["Alexis F.", "Stopped in for breakfast when staying downtown. The place wasn't busy (only one other table) but the service was not good. The menu options sounded great, but the dishes were not well cooked. Both breakfast entrees came out very oily. Pools of oil on all the eggs, and potatoes were soaked. I ordered the breakfast pot pie and the gravy was almost inedible it was so oily and greasy. Next time going to take some more time to seek out s better breakfast place downtown."], ["Rich N.", "Only had drinks.  Seemed overpriced but typical for a hotel bar.  Nice patio outside for enjoying nice warm Phoenix evening"], ["Hedda F.", "Great service and awesome food.  Our waitress is fabulous.  My omelette was cooked to perfection. My husband devoured the French toast with the caramelized apples.  Coffee is outstanding and the atmosphere is great."], ["Lisa J.", "I have to say this was one of the most amazing meals that I've had since I've been here. Wasn't particulary hungry but wanted something fairly light.  Scott B, who was my server, was very accommodating and knowledgeable about the menu.  The chef, Martin Scott, prepared the most amazing shrimp pasta meal that was light and filling at the same time. They changed  pasta type from fettucini to angel hair pasta which made the meal a little lighter for me,  which I thought was flavorful and wonderful.  I come to Phoenix about every 6 weeks and rarely eat at the hotel but I will change my ways after this visit.  Thanks for being so accommodating and welcoming!"], ["Dave T.", "My fiance and I had a great brunch at Province.Like a lot of people, we had the Travelzoo deal, which came with tasty mimosas, some delicious granola, coffee, and 2 amazing entrees.  I loved the Superfood Skillet.  The menu overall is pretty limited, but everything is great.Service is excellent.  Everyone was very kind.  Plus, valet is free with validation.If I lived in Downtown Phoenix, I would for sure return.  For people who live outside the immediate area, I'm not completely sure it's worth the trip.Enjoy!"], ["Nita M.", "I had a work lunch here during the work week and the overall experience was fine. This is a great place for \"work\" type meals because it's upscale and the service is quick and professional. The acoustics are good, so while the restaurant was pretty full, it still seemed quiet and it was easy to converse. The restaurant is quite pretty, with natural and modern elements well fused, big floor to ceiling windows which let in light, and a nice little patio with a fire feature. I had the black bean burger which just...wasn't that good. The house made patty was very thick but also very dry and flavorless. Yes, it tasted like black beans, but I think some cumin, garlic, and spices would have gone a long way. The menu mentioned it was served with chipotle aioli, but mine was missing, and I didn't want to interrupt my conversation with flagging down a waiter and getting it fixed. I'm sure the overall taste would have been better with the punch and moistness of an aioli. On the lunch menu there was another vegetarian entree (tofu) and two pizzas that were vegetarian as well."]], "Vogue Bistro": [["Lauren A.", "My husband and I love Vogue, we've been many times. Its our go-to place for bringing friends and out-of-towners since everything else on the westside seems to be chain restaurants. The food is delicious and perfectly prepared which make the prices seem really reasonable. The music is loungey and ambient which makes for a really cool space, and the staff are top-notch servers whom you can tell are held to a high standard. I don't know if I would bring small kids or babies here; I know they're welcome (they have highchairs and I've seen them there) but the vibe is really laid back so small children might be a bit out of place.What I've had and would most recommend:The Meatloaf is probably my favorite menu item, and the au gratin potatoes are the best I've had.The French Onion Soup is awesome and flavorful!The salmon is delicious as wellThey have awesome cocktails too!Definitely check out Vogue if you're in the mood for something nicer on the west side :)"], ["Kevin M.", "Had to try again this year... but again disappointed with thier take on the traditional turkey meal...Way to much dark meat..the soup was cold...the deserts were pretty to look at but lacked the taste u loved from its presentation.. coffee exceptional again.. wait staff outstanding.. The ambience was perfection (fire place...music...romantic....5 star)...Im sure other courses are much better but this was 2 yrs in a row and it's the same dry turkey dish sorry to say...I would not try thanksgiving here again but during the week... I would hope could be more flavorful.This place should be 5 stars every day simply by thier staff alone... more seasoning please... I still have faith.."], ["Glen G.", "Food was very good, had Lasagna. Perfect! That said, I did not know it was a self service drink bar...not what we were looking for.Our waitress, a blond lady on the outdoor patio the night of 10/10/15, who was pleasant, seemed out of it or in another world (don't want to make any accusations). The wine by the glass were short pours.  She never came back to check on us.  No refill on water, had to go to the bar and get my own refills (mind you, our server was standing next to me at bar but, could care less...I was pretty peeved at this.Finally, server took check as soon as we signed credit card bill. Just a low class move and makes what could be a great place, seem like McDonald's, No offense to McDonald's. We were having drinks and were going to order more. Just no excuse for it.Shame because the host was very nice and the other patio waitress (she had long black hair) was smart enough to come up and be nice to us. I think she was skilled enough to know her co worker was making a train wreck of our meal.Bottom line, great food, pretty decor, some of the staff are very poorly trained. If I hear back from the owners I'll be happy to update this review....It's 4 days later and I see not response from the company....just saying'"], ["Yvonne E.", "Chef Aurora, Created an Amazing dish for the PBS Food Fest in Peoria today it truly was sublime... Organic,  Sustainable...  layer's of flavors and yum yum yum Goodness...soooo Dear..!!!   Loved being a part of it.. !!"], ["Raquel M.", "My husband and I had A nice Friday night dinner date night. The dinner was delicious and worth every penny. Not very many west valley Bistros like this. The Martinis are on point and you have to try their stuffed blue cheese olives!!!!"], ["Pepper T.", "This little restaurant with a big patio serves of an assortment of dishes that are made with French Taught Techniques. Chef Aurore has trained in France. We placed our order and waited around a half hour for our lunches. I do have to give our waiter credit for spotting that my husband's request to omit the aioli for his sandwich was ignored by the cook. The waiter gives my husband the choice of eating it anyway or getting a new one made with his request of no aioli. My husband wanted a new one so we waited maybe another half hour while my salad is sitting in the window all this time getting warm and wilted.Our plates arrive and as warm and slightly wilted as my salad is the salad was masterfully made and very layered with flavors. The creamy shallot vinaigrette was so delicious I could drink it and I never tasted walnuts that were so complex before. I also need to add that the house smoked salmon might have been the most delicious buttery fresh salmon I've ever had anywhere. However the house baked bread that came with it came out and seemed stale and not so tasty. Unfortunately the cooks that were on don't take to re-fires very well and inflicted something on the pork in my husband's sandwich. The pork was very dry and was drier than dog food jerky. The pork suffered something like rigor mortis it was deader than dead.Our waiter seemed busy and didn't ask how our meals were but offered us a complimentary dessert because of the aioli mess up and how long we waited for everything. (he didn't even know about the pork)I picked the house made chocolate collection. It was an assortment of chocolates that were obviously very high quality. They were extremely good.This should have been a five star review but lunch shouldn't take two hours, meal request should be honored and I have nothing more to say about the pork as I said enough. I do note I didn't see Chef Aurore in the building. Also the 4 star rating seems high after everything mentioned but some of the food was so masterfully done I can't give a lower than 4 star rating and chalk this up to them having a bad day.PHENOMENAL and ABOMINABLE"], ["Bill H.", "We love Vogue Bistro. The service is always good, and the food is delicious. They have the best burger in town, or you can't go wrong with any of their other menu items. The ambiance is a little upscale, but still comfortable for everyone."], ["Bill K.", "Bonjour Surprise!Vogue Bistro is a French/European/American delight to visit for us west side desert dwellers. This mid to higher priced establishment offers the best cocktails we can get over here in Surprise. We have been there several times and always enjoy the delicious French and American dishes from the menu and nightly specials offered by the chef. We always feel welcome as the staff remembers our favorites each time we come in."], ["Kim S.", "I bought the Groupon offered earlier this year.  It is a very nice restaurant, a bit crowded inside.  I'm not sure the price warrants the food.  I think even with the coupon we still spent over $60 for two people with beer and one mixed drink.  Waitress wasn't very attentive especially after the meal was delivered.  I will probably go again but it won't be a weekly thing.  My husband and I eat out about 3 times a week so Vogue Bistro would be a twice a year thing maybe."], ["Elizabeth B.", "I wanted to wait to write a review until after the second time I dined at Vogue Bistro. Both times I sat outside in the evening but next time I would prefer to sit inside. The only problem I had sitting outside is that it was very dim and hard to see with the minimal lighting. The constant flashes of lights from cars coming into the plaza bothered me as well. Starting off with the menu they have quite the variety of options.First with the drinks.  I enjoy fruity alcoholic drinks so I would suggest The Escada Martini. They had a great wine list as well as beer and mixed drink options. For appetizers I would suggest the stuffed mushrooms, the cheese plate or the beef skewers. For the entree I suggest the filet mignon. It was perfectly cooked and came in a tasty wine sauce. I have also tried the Alaskan salmon. The portion size was perfect and the salmon also came in an amazing champagne cream sauce. I had a taste of the roasted chicken and it was so moist and perfectly seasoned. Don't pass up the sweet potato fries the dipping sauce is to die for! Also don't forget dessert. The have a chocolate assortment that is very good! Overall I would come back if I was in the area."], ["Matt W.", "Mighty fine little establishment here! You can spend a couple hundred on some select food and cocktails. Or, you could get the best burger in the west valley for $11. There are some deals to be had at Vogue. They have a choice beer bottle selection, most ranging from $6-$10, and some hidden gems of which you can't find at Total Wine for twice their asking price. Also, dig deep for some discount offers floating around. They throw some half-offers out there once in a while."], ["Joel R.", "Always good. Been here perhaps 30 times. Nothing bad to say.Love Heather at the bar, always eat at the counter!"], ["Paloma V.", "Dinner was excellent. Service was very attentive! Had the peach and arugula bruschetta as an appetizer, my friends liked it, me not so much but after that everything was delicious. Caprese salad with heirloom tomatoes and salmon was delicious. The tomatoes were peeled and tasted fresh, basil was also very fragrant and delicious. The salmon was cooked perfectly moist and the whole salad was served with a balsamic vinaigrette that complemented it perfectly. The chocolate cake was really rich but perfect for sharing since 2-3 bites is probably enough for anyone. Wine and beer selection is pretty extensive and the server seemed very knowledgeable as to what was a good wine pairing. Service was absolutely outstanding. Will definitely come again."], ["Stephen C.", "In a nutshell,  food tasted good, but not worth the price. Definitely not a place for kids; the staff was kind of rude when my child was only being a kid. Will not go back voluntarily."], ["John Y.", "This is an A+ quality dinning experience and can easily compete with any midtown New York restaurant."], ["Sandy S.", "Bummer! I have been wanting to try this place for a few years. First off, there were available tables all over the place yet it took them 10 minutes to clean a table...Service was a tad slow but okay. The waitress was friendly. I noticed that all of the other tables had bread. I was never asked if I wanted bread so I just assumed that they took a look at my weight and decided I didnt need bread!  Sigh...I ordered the Filet Mignon (not cheap by any means) there is no way this was a filet.  This was a sirloin trimmed to look like a filet. In addition to the weird texture and flavor of the meat there was zero seasoning on this thing.  It needed salt and pepper badly, the wine sauce on the plate wasnt enough to make up for the lack of seasoning. Looking around I noticed that none of the tables had salt and pepper. I found that really odd. The sides were just okay. 1 Person, 1 meal, 1 glass of wine (tiny pour), $48 with tip, never again!"], ["Brian B.", "Upon arrival, we had no idea where the front door was located. The patios are drapped with sun shades, causing the front of the restaurant to be blocked. After the discovery, we located the front door and greeted by the hostess. We had a reservation for 730, however, we had to wait 35 minutes for a table to become available. The restaurant is small and not sure what the hype is. The food is mediocre at best. Over powered with sauces and balsamic dressings that kill the nose and palette. The bread and butter that initially came to the table tasted of freezer burn. We each took a bite and left the bread alone. I ordered the meatloaf. Not sure where the meat was in this meat loaf. Tasted more of a filler then meat. It was just mushy and did not require a knife to cut. The sherry sauce is a killer. Too much. The potatoes it comes with were very bland. Service is ok. The waitress was either not around, or all in our face. BTW - the restaurant is advertised as a French restaurant. The only item I noticed that was remotely close to being French was the snails. Other than that - it's not a French restaurant. Just an American grill. Don't get your hopes up. All in all - we will not be back."], ["Kerry L.", "This is my new favorite !!!  Ahaaaaaa. Place to stop by !!!!! Food is quick , such good appetizers to pick from , vast array of specialty drinks, wines, beers of all kind ... No not as many as BevMo... But fantastic atmosphere !!!!"], ["Annette C.", "Great food to enjoy with friends and family. Nice to have an upscale restaurant so close to home."], ["Charlynne C.", "This was my second time at Vogue Bistro. The first time we stopped in for cocktails, last night we stopped in for dinner and drinks. Both times, I hate to say, were mediocre at best. On an impromptu date night, my beau and dressed up and headed to the fanciest place in Surprise, Vogue Bistro. We arrived around 7pm and were seated immediately. Our waitress was wonderful and the service was great. However the drinks were OKAY.My beau got an Old Fashion while I indulged in a Prada Martini. The Old Fashion was watered down and not very good. The Prada Martini was good but nothing spectacular.For dinner we order the Steak Vogue and the Roasted Chicken. The chicken seasoned well and not dry. The carrots and potatoes were nicely roasted and complimented nicely. However, the steak was not good. It was bland and cooked medium rare, while he had asked for it to be medium. Beau barely ate a quarter of it. The fries that came with it however were very good. I'd hate to give this place a 3 star review since it's so well received in the community, but it just didn't live up to expectations. Better luck next time."]], "Cuisine and Wine Bistro": [["David L.", "Wow what a place! The service is great and friendly! The food is reasonably priced for the portions and the quality. Everything tastes great and nothing is over the top.The beer and wine selection is great! Bistros often  offer fewer drink options than this place!The escargot was amazing! And the molten chocolate soufflé is beyond delicious."], ["Jim O.", "Well maybe we had an unlucky experience, but my wife and I were just not impressed. After reading other reviews, we were very excited to try the Bistro. It's close to home, has a nice atmosphere with live music and friendly servers. All great, but unfortunately the food just missed the mark for us. The Ribeye with chipotle butter (authentic french cuisine?) was flavorless, fatty and looked large, but thin on the plate. The Filet de Porc, Sauce Bleu et Bacon sounded amazing, but lacked the rich complex flavor you would expect. My wife did not eat more than 1/3 of the ribeye and we commented to the server she did not like it and the server replied \"Oh, I'm very sorry, would you like a box?\" Not the response I was expecting.Anyways we really wanted to like the Bistro, but it just wasn't the dining experience we had hoped for."], ["Paul M.", "A wonderful experience. A throwback to what dining should be. Outstanding service, owner touching the tables and interactive, small kitchen with attention to detail to producing outstanding cuisine. Really loved it and cannot wait to go back again and again!  Very authentic French cuisine and delicious and delicate. We loved it!!!"], ["Karen B.", "Had a fabulous meal with my family and cannot wait to go back! This French family owned restaurant has it all... Ambiance, service, and amazing food!! Karen Barnes"], ["Lisa H.", "The wine was great! We tried 4 different reds- the bottom 2 Cabs on the menu, H3 and the F. All were very good. Bruchetta: the ham and chicken are good. Salmon salad was delicious- the feta cheese contrasts well with the sweet strawberry. The salmon was tender & juicy. Yum! They had live music: Josh West, a father & son duo. They were perfect for the venue. Talented, smooth & we could still hear conversation at our table. We'll be back! Live music every Friday & Saturday."], ["Vincent H.", "This is a family owned wine bistro with a very laid back atmosphere with live entertainment on Friday and Saturday evenings.Authentic French cuisine from family recipe's and the food in excellent!While the wine list is extensive I personally am not a wine drinker but everyone I take here loves the many options.I can't wait for the cooler weather so we may bring our dogs and sit on the patio!"], ["Steven B.", "One Word: Awesome !Great service, nice decoration!The food was great, have to try the \"terrine de chevre\" as appetizer, my friends and I tried the Filet Mignon with the black pepper sauce, so tasty!!!They also do a Crème brûlée !!!! Delicious !!!!I'll be back for sure !!!!!"], ["Heather S.", "How do you say, I've died and gone to heaven in French...Cuisine and Wine Bistro...that's how!!! Everything we had was phenomenal, from Champagne to Porte, Chorizo Croquettes to Chocolate Soufflé, Fried Brie Salad to perfectly grilled Ribeye...every morsel melted in our mouth leaving our taste buds begging for more and stomachs crying for relief! The service was impeccable, we felt like the only table there. Live music Friday and Saturday was the icing on the cake! Seriously couldn't have had a better 40th birthday anywhere!"], ["D C.", "Enjoyed the atmosphere, service and food.  Escargo for the first time and it was great!  Reasonable prices!"], ["Sensei M.", "I am usually a fast eater. But I love the food here so much that I have to taste every bite."], ["Felicia W.", "Good food, great service, great atmosphere! I would recommend to anyone!"], ["Lisa A.", "First time visit last night ... loved it!!  This place is the ultimate wine bistro.  The atmosphere is heavenly, the music is lovely and the food & wine delicious!  The staff was very pleasant and helpful.  I love this place, will definitely go back again and again."], ["Adrien G.", "My favorite restaurant in the valley!!I am from France, so the Bistro reminds me so much of my country!You have to try the escargot appetizer it was delicious. And their \"seafood au gratin\" was a blast. I asked and the chef is French with a lot of experience, Staff is super nice and they can always recommend a good wine.Overall, it is a fantastic place for having dinner!"], ["Stephen O.", "Really enjoyed a wonderful evening here. My husband and I were looking for a new, romantic, chill place to try and this restaurant fully delivered.  Our waitress was very friendly and helpful (with a delightful French accent), we took her recommendations and split the goat cheese salad and the filet mignon and they were both very satisfying.  The bread that came with the salad, combined with the warm goat cheese and lemon-honey sauce, was very delicious.  The steak was very tender & cooked perfectly, however I found the flavor to be slightly less bold than I'm used to in filet mignon.  It was still very edible though, and came with delicious fries and a warm, bread-crumb encrusted tomato.  My husband enjoyed their Chilean Pinot Noir, I decided to pass on the wine  (mostly out of budget consideration, not for lack of selection).  We also very much enjoyed the live music which was a female vocalist with a beautiful voice who seemed to mostly be doing covers but was very talented (& it was not too loud or distracting but fit the atmosphere perfectly).  This has definitely made one of our new favorites!"], ["Jim S.", "In a word, sublime...it's one of those rare gems.  This place is French-family-owned, and it shows.  From the greeting and excellent service, to the incredible depth of flavor and attention to detail on every food item, this place hits the mark consistently.  Having lived in New York most of my life and eaten in many French restaurants, and having visited France and eaten French food from several different regions of the country, this is the real deal.  If you don't like the food here, you don't like French food."], ["Pat J.", "LOVE this new place! The escargot appetizer was succulent and rich, the meatballs were light and tasty with the mint yogurt sauce. For the entrees, too often salmon in the valley is plain, this was complex, with a wonderful sauce and sautéed onions and peppers. The quiche Lorraine had a wonderful, flakey crust and rich flavor, complemented by a mixed green salad with light balsamic dressing. The Belgian chocolate soufflé was heaven on earth. All complemented with excellent wines. A BIG upgrade over the former MWC, this is a MUST stop for wine and foodies in the Valley!"], ["Louise V.", "We discovered Cuisine and Wine Bistro over the weekend.  The owners moved from France about 3 years ago and took over this restaurant in March.  Fabrice the owner and chef has been in the business since his late teens and has owned several establishments.  This is a family affair with his wife and children working there.  The food is delicious and reasonably priced.  They have a great selection of wines.  The service is what you expect in any restaurant in France: attentive, the courses arriving in a timely manner and our waiter Killian knowledgeable about the menu.The offerings change often and they also have daily specials, a great way to keep one's interest piqued.  They have live music several nights a week.  This is definitely a must if you want a great meal in a bistro environment without having to trek all the way to Scottsdale.  Try it!"], ["Jen L.", "Wow... When I read the other reviews I thought maybe all of the other reviews were being kind but nope. This place is truly amazing.  Let's start with the service it was phenomenal.  She was attentive, had good recommendations on wine and refilled water all night. I love when you don't have to ask for a refill on water. The food... sigh I'm going to dream of the beignets de fromage... light, fluffy and not greasy.  Perfect cheesy bite.  We also had the chorizo croquettes warm, slightly spicy and had a great sauce over them.  The three of us shared a meat/cheese platter which was also excellent. The chef chooses the cheese for the board and selects complimentary meats.  YUMMY.... prices were average to a bit high but for the quality well worth it.  Finished with the chocolate soufflé.... if you like chocolate (and who doesn't) ice cream and strawberries this dessert is for you.... this place is a repeat and I mean a weekly repeat. we all LOVED it... ambiance was good not too loud, and just enough business to make it fun."], ["Michael S.", "This place is amazing... Great food and great service. They have live music on the weekends thats actually pretty good and not so loud that you cant have a conversation. If you are looking for a new place with great prices and great food, check it out!"], ["Ken S.", "It's our second time here and both have been very good! We came with a group on Saturday, and were so impressed we came back today for happy hour to sample some more wines and appetizers.  No disappoints her for sure!  I had escargots that rivaled a French restaurant in Maui I went to last week! And it was a heck of a lot cheaper.  The waiter was very attentive and courteous."], ["Beas A.", "First time here and wow what a great find! My husband and I wanted a quiet laid back place to have a glass of wine and this place was perfect for that. The food was great, the wine was great, and really great service. Can't wait to have a date here again!"], ["Jared B.", "Great wine bar with excellent service from an eclectic, international staff. They have live music at certain times and the atmosphere is great even when they don't. This is in the heart of Chandler, where places like this are few and far between.Excellent wine and beer selection and amazing food. Their fried cheese croquettes are absolutely to die for and their meat and cheese board is solid.Please visit again and again. We want this place to stick around :-)"], ["Yuchen L.", "Nice place, Elegant environment， great service! The food was awesome! I did ask about the chef, he comes from France! Omg! Can u imagine real French chef! For the wine and drinks, you have many of choice price and taste was so good! Have to try this place and then you will come back!"], ["Amanda R.", "Everything was so great! My sister picked this restaurant for her birthday dinner and it was above and beyond what I expected. They reserved an area for us next to the live music being played (which he was really talented!) and it was so cute with the couches and pillows! We ordered a meat and cheese board; excellent! The chorizo croquettes is something I have been telling friends to go try! I also ordered the chicken cordon bleu and fries and it was defiantly enough to share! We had such a great time and the owners and family are such great people to my sister we will not forget their kindness :)"], ["Fred S.", "Whatever initial problems the staff of Cusine and Wine Bistro might have had when first opened, they have progressed past that, and we were impressed by our first time visit. Family run, personable staff, and great food and drink.Compared to Postinos, you experience an atmosphere that isn't so overly loud that it is hard to carry on a conversation. The food and the restaurant has a French influence, but this is not just a French restaurant/bistro. We had three of their appetizers, so we had to skip the main course. Two of the current main courses, a ribeye dinner and grilled salmon salad looked wonderful.Our bruschetta was one of the best I have ever had, with the bread very light and perfectly toasted to allow all the toppings to come through. Another appetizer, the goat cheese with toasted bread had a very generous serving of tasty goat cheese. The only thing not cooked to 100% of my liking was the meatballs and mint sauce. The mint sauce was wonderful, but the meatballs seemed a bit overcooked for my taste.They frequently have live music, although we left before they started (we came in early during the happy hour pricing)We will return."], ["Tony L.", "We truly enjoyed this place and will definitely be back. The escargot was absolutely the best I've ever had. The charcuterie was fantastic and gigantic - we actually couldn't eat it all. Our waitress Clementine was delightful - she's quite French with a marvelous French accent.  This place is tucked inside a corner shopping center in Gilbert and you could drive by here a hundred times and never know this place existed -- it's worth looking for."], ["W J.", "This is absolutely amazing. Relaxing music, friendly staff, whatever we want. I'm enjoying a delicious French sparkler with my appetizers which are enough for a meal and listening to a terrific live artist. As an international traveler I can confidently say this is authentic French as only the French can do. Attention to detail is perfect. Please come and keep them in business. On second thought, stay away. This is my treasure...don't ruin it."], ["Gina M.", "Food and ambiance is fantastic. So nice to walk into a Gilbert restaurant with no wait. This is a family run restaurant that features French food. The chef is French has has cooked and had restaurants for many year and his expertise shows. Had the Escargot special that was amazing, hint of garlicky with pesto and tomatoes. Just melted in your mouth. The Fromage Board with a chef selection of cheeses was ample and had excellent cheeses. This place is a 10!"], ["Chris H.", "Came here five months ago and had a very mediocre evening ...... I'm always willing to give a place a second chance, so I came here tonight and it is under new ownership ...French family ( two families I believe ) And WOW, a world of difference!!!... Fantastic service, amazing wine, delightful ambiance , fantastic menu.   Perfect date place!!... No doubt I shall return,  and soon...and often ."], ["Laurel N.", "If you haven't been here before, you need to try it! Such great people, yummy food and good atmosphere.  These folks know how to make you feel welcomed and appreciated. The food is fantastic...seriously one of the most amazing cheese boards ever! Live music almost every night, but don't worry its not overwhelming,  it only enhances the vibe. So glad they've figured it out and we have a great wine bar in Gilbert once again."], ["Carolyn W.", "Just opened a month ago. Adorable French bistro and wonderful French, Italian, New Zealand and some California wines! Great outdoor patio."], ["Mandalee G.", "Fantastic! My fiance and I have been coming to this location since it was operated as MWC. We hadn't been here for a few months, but we noticed that the name had changed. We decided to come in for date night and COULD NOT be happier with the ownership change. The food is exquisite, the atmosphere is comfortable, and the friendly staff is made up of the French family who now owns the bistro. Excellent wine selection! They even serve cappacino/espresso, which pairs nicely with their delicious chocolate souffle :-) We are so happy to live nearby and will be back often!"], ["Ron P.", "Great service all around,  my wife and I had plans to go to a Scottsdale restaurant for our 32nd Anniversary and our plans got spoiled. So I remembered driving by the restaurant and thought it would be nice to try and after reading all the great reviews from Yelp we went.  I knew we were in the right place when we walked in the door.  We were greeted and seated right away and served our wine promptly.  Being from Northern California originally we are a bit on the snobby side when it comes to wine.  We weren't disappointed the wine selection was very extensive and well rounded.  We ordered the Rib Eyes and they were cooked to perfection with a nice sized portion of salad and potatoes.  We probably should have shared one as the portion was pretty good size.  Our waitress was very attentive and recommend the chocolate soufflé wish I highly recommend, it was not too sweet and the presentation was nice."], ["Annadine L.", "Absolutely love this place! I have been to a few wine bistros around the valley and this one definately made an impression. Good wine list, Awesome service and FANTASTIC FOOD! The price is reasonable, they have a good happy hour selection... I so enjoyed the French accents of the staff. I highly recommend this establishment. I will definately be back."], ["Stephen K.", "Wife had her favorite dish (fish,shrimp, scallops and mussels } in a white cream sauce  and it more than lived up to her expectations . I had the Filet Mignon and it was cooked to perfection and it was so tender it melted in your palate .  We finished the meal with a delicious Creme brulee. Family run business and you feel like they invited you into their home with their hospitality.  We will surely be eating more meals there . Everyone come on over on St Patty's day March 17 and have some Irish Stew and support this family run business in Gilbert .  Everyone is Irish on St. Patrick day so treat yourself to a delicious meal and we will see you there ."], ["Felicia H.", "Fantastic! !!! Everything is delicious and service is great.  Will be back many times :)"], ["Alaina M.", "So sad this has changed owners. The food is mediocre and the service spotty. What once was an amazing wine bar is now staffed by inept staff. Our waiter couldn't pronounce Bordeaux!! And the red wine is not at temperature. I love the patio and atmosphere but everything else is a miss."], ["Sylvia M.", "Everything is perfect:  the ambiance, the food's quality, the service, the wine and the friendly staff.  I will definitely will be a regular customer!  It is my 3rd visit now and I am enjoying it each time."], ["Jason G.", "Our absolute new favorite dining spot.  Family operated.  Outstanding food.  Fantastic wine list and even better service.  We come here at east once a week.  A true gem in Gilbert.  Love, love, love this place!  .....and they have live acoustic music on the weekend."], ["Nely O.", "Really nice place, great food, great wine list!  Loved the appetizers during happy hour, so tasty and very generous portions.  Can't wait to come back, you gotta try it, too."]], "Le Sans Souci French Restaurant": [["Anthony Z.", "Not a very busy or attractive restaurant but don't let that fool you.  The dinner experience didn't start off so well, but it got really good later on. My wife and I ordered a glass of pinot grigio and it was very cloudy and tasted watered down. So I asked the waiter to bring out the bottle and it was a bottle of House Pinot Grigio that I've had before,but the wine in the bottle was much clearer than what was in our glasses. Not really sure what  was all about.I started off with a wilted spinach salad. It was delicious. The preparation for the salad takes place table side where they saute the bacon in a pan then cover the spinach with the hot pan so that the spinach becomes wilted.My main course was Eastern scallops. The scallops look to be flashed in a little bit of flower and they were delicious. The homemade au gratin potatoes came along with it as a side and the steamed vegetables were perfect. My wife had the petite filet that was cooked to perfection. Surprisingly , the petite filet was much larger than any of the other steak houses in the Phoenix area . Hands down it's one of the best filets that I've ever hadTo close the night out we went with banana fosters made tableside for all four of us. I haven't had it in a long time and man was it good!I give this restaurant 4 stars not because of the drink situation earlier, but I'm not a real big fan of live keyboard singer music during dinner. You have to be really really really good to pull that off."], ["Jamie S.", "My fiancée and I visited this restaurant a few weeks ago. I was a little worried, as the place was completely empty at 7:00pm on a Friday night. We were greeted by two sweet servers and the chef himself. While one server was obviously new and inexperienced with the menu, the other was right there to guide her through. The chef came to our table and introduced himself and we talked for a few minutes .We ordered from the back page of the menu where you can get a soup, salad, entree and dessert for under $50 per person. I also ordered the escargot, which was the best I have ever had in my life. As was my filet mignon. Perfectly cooked. Everything we ordered was absolutely delicious,  perfectly prepared with great attention to detail. The onion soup was very good - despite what others have said in their reviews. We ordered the chocolate truffle dessert which was LARGE and exquisite! The service was great, the food was perfect, my vodka drink was actually too strong for me! Fresh flowers on every table and a charming atmosphere. Would I recommend this place?  Absolutely!  We are going back in 2 weeks, and we hope to see you there."], ["Kristin D.", "Maryanne IS right. Same experience here. Lukewarm thinned out onion soup with Kraft Parmesan cheese!! French onion soup should be served with fresh grated Gruyere cheese slightly browned and melted. We asked for a Rose wine and he had only a Zinfandel: Beringer, the cheapest wine possible. This for a a 4 or 5 star rated restaurant? The server/busboy, all in one was not an asset to the restaurant. Fellow diners had the veal and the sole and we're happy with it. I was ok with my brook trout. The potatoes were very good. The place and the menu need updates. It was a disappointment overall. We live close by and wanted to find a great restaurant."], ["H J.", "Perfectly cooked roast beef dinners with potatoes and other legumes along with wonderful French onion and clam chowder soups for $25. Bread excellent as well. Ask for the sauce to come on the side for your roast beef as some may not want it on their meat. You cannot beat this deal for price portion or quality. Service awesome. I have eaten my way thru France and was brought up eating this kind of food. I recommend this charming little place!"], ["Donna C.", "My husband and I came here for my birthday and had a wonderful dinner. I had the escargot and he had the onion soup. Both were wonderful! I had the Veal Oscar, very well prepared. My husband had the Beef Bernaise. Wonderful. The perfect ending to our perfect meal was the Grand Marnier Soufflé. The soufflé was fabulous. Highly recommend it."], ["Beryl Z.", "I like this restaurant, especially the lovely and courteous young ladies who were our servers. The smiles never left their faces from the time we arrived until the time we left two hours later. They were so accommodating, so eager to please, without ever being intrusive. I could not have felt more welcomed which is so rare in so many restaurants where servers can sometimes make you feel as though you are an inconvenience .Now about the decor and ambiance. Though largely outdated, the decor is a bit country French and was probably quite attractive when it was first done. Now it looks a little tired. But the ambiance is nice with soft music in the background, which allows for easy conversation.My husband and I both thought that the food was excellent. I had the frog legs which were delicious. My husband had the duck and cleaned his plate. For dessert we had the Grand Marnier soufflé and OMG! It was out of this world delicious and the best ever. We have had soufflés in France as well as in some of the top French restaurants in the country and the soufflé at Le San Souci tops them all!The menu prices range from moderate to slightly higher but you get what you pay for and the quality of the food is worth the price. We are looking forward to our next meal there. Give it a try and enjoy!"], ["Jennifer A.", "We have been coming to Sans Souci for about 5 years since we moved here. It is in the  quirky town of Cave Creek, and has views of the mountains. The place feels like you are in someone's home getting a delicious home cooked meal. The place is charming and is not your typical sanitized chain restaurant. They actually make a table-side ceasar salad. The Escargot is perfectly done. The service is always friendly and efficient. We always enjoy coming here."], ["Kait D.", "We've lived up in cave creek for almost 15 years and always drive by. We finally tried it and it is by far the best restaurant in town! The food is honestly better than Mastros and Dominic's. This place is a hidden gem! The only thing we are disappointed in is that we didn't try it sooner.If you look at the people giving the bad reviews below...they don't look like they know what gormet is!"], ["maryanne S.", "I read some of the other reviews and I don't we think ate at the same restaurant.  5 stars?  Are you kidding me?Some friends took us to this dump.  On a Saturday evening the place was jumping!  I ordered onion soup to start.  When it arrived it was luke-warm instead of pipping hot.  The taste was nonexistent.  Then a server, who turned to to be a busboy, said to me, \"chez\".  It was loud, I couldn't really hear him and I didn't know what he said.  \"Chez\", like, Chev?\"Chez?\"  He was saying \"cheese\" and in his hand he had a bowl of Kraft pre-grated, cheap-ass imitation parmesan cheese.  Not freshly-grated, canned cheese on an onion soup that was weaker than consume'.I refused to order an entrée.1 star is one too many for this place.  I don't know who Louis is or why he left but DO NOT GO TO THIS DUMP!"], ["Jorn B.", "They also won't honor the $100 Restaurant.com Certificate that supposedly NEVER expires!"], ["Chris P.", "The most bizzare dining experience of my life. It looked from the outside like a cheap place, almost a diner, so me and my brother went half from curiosity as to what a dumpy looking French restaurant was doing in Cave Creek and were surprised inside by a very fancy, very nice atmosphere and insanely expensive food. It was a Friday night and we were literally the only ones there. I asked the guy if he had anything to recommend, he just said everything is good. The waitresses were really great, kind, pretty, professional high school/college girls. Strangely they were a Hispanic family and I don't think they spoke much French, I'm not even sure the guy spoke much English. We ordered only simple and cheap relative to the $70 entrees, but it was really nothing special...I could have cooked that for half the price easy and I can't cook. But the relatively cheaper salad was amazing.An extremely mysterious place."], ["Michael B.", "The food was ok and the service was great, until it was time to pay. I paid the tab with a Restaurant.com certificate along with cash. When they brought my change, the certificate had strangely disappeared and no credit was given towards the tab. No one would acknowledge the missing certificate and all of a sudden, no one spoke English. I told the waitress that once you find the certificate, you'll have your $25 tip. As we were driving out of the parking lot, we could see them validating the certificate by phone, at the front desk. How stupid do they think people are?  Crooks!  I had been waiting to go here for years, but I will never return."], ["Greg G.", "Outrageous prices!Slow ass service!Bland food!Are you over 90 and some wealthy Scottsdale Snow Bird?  Hate food with flavor?  Want to sit around and complain all dinner long?  This is the place for you!"], ["Michael M.", "The food was good, but do not expect a fine French experience. It is Cave Creek after all. A French speaking server would be a nice touch, and a better wine selection would really be appreciated. Still, it's a unique menu for the area and a very quaint ambience."], ["Scott L.", "Great food, wonderful flavors and the perfect place to splurge on a special date for two.  Pricey but worth it.I saw Wayne's tip about the coupon at restaurant.com/le-sans-s… and bought one too.  Seated nearly immediately in a restaurant that was just over half full.We heeded fellow Yelpers' advice and got Escargo, Ceasar salad, brochette and duck l'orange for our dinner selection.  Portions were on par or larger with great flavors that were wonderful.  Ms. D is a Francophile and was very impressed which made me happy.Dessert was Creme Brulee for her and Chocolate Mousse for I with great coffee.  Desserts were far too big for us as was the after dinner drink.  My Grand Marnier must have been a double!Excellent food, proper service and a great selection lends this an easy 5 star review"], ["Sandi E.", "i agree with maryanne...i have no idea where the people giving this dump 4 and 5 stars are eating, or possibly they work there!  i hae lived in cave creek for over a decade and this place has great ambiance inside, but the food is $$$$ and i could have made it better.  i understand louie at one time this place was great, but you need to retire and get an updated chef in your kitchen!  it is ashame to see this restaurant go away but that is what is happening due to the poor caliber of food!"], ["Abigail P.", "My husband and I recently visited this little gem in celebration of our anniversary following suggestions for special occasion restaurants from another Yelper.  We took a chance as there were some mixed reviews and not a lot of commentary (a no-go in my husband's book).We were pleased we did.  A bit of an adventure just in getting there, this quiet, out-of-the way place presented us with delightful treats.  We had the place entirely to ourselves - it was a Tuesday - and thus the complete and full attention of Chef Louis and our waiter.  While the decor is absolutely out of date and not at all \"in the moment\"  the history and nostalgia of the place were alluring and memorable.  They lit the fire for us and left us to enjoy each other's company.Others have gushed about the amazing Caesar salad which we tried and enjoyed but perhaps more for the experience of it being made table-side than for taste or value.  Over $20 for a salad is a bit much.Our main courses were excellent.  Hubs ordered the scallops cooked well but not perfect and I had beef tenderloin with mushrooms, which in my opinion, turned out to be the better choice.  The sides were nutritious with just a hint of flair.Sadly, expecting my third child I was unable to sample the wine, though our creme brulee was DE-lish and they also graced us with a complimentary, candle-lit Napoleon in honor of our special day.  Very tasty and seemed very French.A lovely experience for the patient and adventurous.  Would have been even better with music, but happily used our discount coupon via Yelp!"], ["Julie G.", "We had been here a few years ago and enjoyed the food and service. Something has obviously changed, as they were both quite bad this past Valentine's Day. The Caesar was not made at table and was limp and overdressed. The oysters were served with cocktail sauce and not mignonette or even a lemon wedge. The entrees were bland- each of the four our party reached for the salt immediately. Not a good sign! The waitstaff were terribly clumsy with the geridon, slamming into our chairs and blocking one of our party from his seat when he returned from the restroom. The menus are held together with scotch tape and the decor is reminiscent of someone's rec room. The music was on a short forty five minute loop. We were not offered coffee even though we had ordered soufflés with dinner. We had to flag a server down and ended up asking twice for our simple two coffee order. It's painfully obvious that no one has trained the staff. What may have once boasted fine French service and cuisine is now an incredibly overpriced, mediocre, sad and old restaurant. I can't possibly recommend this establishment to anyone."], ["Alejandra T.", "The food is excellent!...nice private place. Servers are so polite and friendly..:-)...If you want to have an unforgivable experience you have to visit Le Sans Souci...French food specialty. ..."], ["I M.", "We dined here for my hubbys birthday last night and it was wonderful!We had some friends from out of town with a baby and a kid, and yelp info said not good for kids, but we really wanted to try it, so I called ahead and ask, the very nice gentlemen said no problem bring kids and babies along, it's a family restaurant, they even have kids menu, your kids may enjoy a nice dinner with you.Yes, the server plays host as well, but it was a quiet Wednesday night and it didn't bother us at all. The food took a while to get to our table, but they are coking your food WHEN you order it, good food takes time, i say plan for at least couple of hours when you are here, to us the company was so nice we didn't even noticed the wait, get a nice glass (or bottle) of wine and enjoy the company...The decor is somewhat dated, but it adds charm to the place, made me feel like I was visiting my aunt's house for a special occasion. to start we ordered the Caesar salad and it was prepared at our table I had a little taste and it was very good, but I had to have the onion soup (Soupe A L'oignon Gratinee) it was perfect, not too salty with some color, not black,  the cheese perfectly melted and not overpowering the onion.For the main course we shared the Filet Mignon for two ordered medium and that is what we got, melt in your mouth good, it came with a delicious tomato stuffed with a mushroom cap, scalloped potatos were creamy but not cheesy and best of all was a Béarnaise Sauce it completed the meal perfectly.Our friends got Sole De Dover Belle Meuniere, with the spines taken out by our table he absolutely loved it and she got the Petit Poulet best chicken she's ever had.And for the grand finale we had ordered the Grand Marnier souffle when we started (thanks to the yelp reviews) absolutely worth the wait...The chef was with us for a few minutes and told us the place was rented for about a year to somebody who made changes people didnt like and Louis got it back. So if you are doubtful to try this place because of the reviews, go ahead and give it a try, it;s worth it!"]], "Chez Vous Crepes": [["Amber S.", "Super yummy! This was my first time here,  it was very cute and quaint inside, they also had a patio.  I originally went here for the crepes, but ended up getting French Toast and the Brassiere Omelet. The French Toast was to die for! The service was excellent as well. I can't wait to go back!"], ["Stephy D.", "\"i love really thin pancakes\" I made sure to try both sweet & savory because Im just that person who wants the best of both worlds ;) I want to try the creme brulee next time. Chez vous , thanks for making me buy my first crepe maker !"], ["Cindy B.", "Yum yum yum!!! The food here is so good! Quiches, crepes in a variety of flavored both savory and sweet made fresh to order. Small and sometimes you may need to wait for a table onSunday morning, but it's worth it!"], ["David G.", "Chez Vous Crepes can either be rated 5* or 3*, depending on your expectations.  I choose 5* because I look at Chez Vous as a casual creperie, as indicated by its business hours which do not include dinner.  If you are looking for fine French dining, with each dish packing \"WOW\" power, you will probably find it modestly disappointing.But as a destination for a thoroughly enjoyable breakfast or lunch, Chez Vous can scarcely be topped.  The room is bright, clean, inviting, and comfortable, and there is an outdoor patio as well if the weather is fine.  The look, feel, and service would not be out of place in France.  The menu contains a good selection of both sweet and savory crepes, some French-inspired sandwiches such as Croque Monsieur, quiche, and a few salads.  The food is flawlessly executed and does not disappoint in any way except perhaps in inventiveness.For example, I had a crepe \"overstruffed\" (no complaint) with ham, Swiss cheese, mushrooms, and creme fraiche.  Whether by design or not, the four ingredients were not completely mixed, so each bite was different, one dominated by salty ham, one by mushrooms, etc., but each having some of the other flavors in it as well.  Delicious!By all means, give Chez Vous Crepes a try, leave your fine dining expectations in your car, and just enjoy living in Paris for a few minutes.HINTS:1.  It gets crowded - try slightly off hours.  If the day is too hot to eat outside, there are only about six or seven tables available.2.  The dessert crepes do not appear to be as good as the savory ones.  We had a pear crepe and it had no complexity of flavors.  They have other deserts too, such as lemon pie the day we were there - might be worth a try.  Save room.3.  The salads looked pedestrian but we didn't try one."], ["Geet M.", "If I only gave one piece of advice, I'd say: get the hot chocolate!!! Mmm, it's delectableThe crepes didn't really do it for me but the service/ambience was stellar. I would  go back and try a sweet crepe instead."], ["Lindsey M.", "I'm a French fanatic so I was stoked to find this place on a recent trip to Scottsdale. The place is adorable and the staff speak French!! I'm so glad my husband doesn't mind me translating the conversations I hear around me :) After being twitterpated we ordered food which was amazing-authentic and delicious. I can say authentic having been to France several times at length now. The staff was very friendly and accommodating to getting us out on time for our flight home. I even ordered a croissant to go so I could have a little taste of France on the plane although it didn't make it that far..."], ["Rich H.", "Rude staff the lady working today walked up to us and turn and walked away. The guy took 3 orders from other tables that came in after us.  No one said anything to acknowledge us. We had been sitting for about 15mins. We ended up walking out and informing the staff."], ["Michael Q.", "Nice menu. Close to Scottsdale resort.  French staff.  Unfortunately mediocre food.  Cappuccino had great foamy milk but lousy bitter coffee.  Hot chocolate was dilute and lacking rich coca flavor. Crepes were tough instead of light and fluffy.  Tried the Nutella crepe with strawberry, exotic crepe, and crepe with raspberry jam.  All uniformly disappointing. Chocolate croissant was ok but not what you would expect from true French patisserrie.  We ordered the mushroom omelet and it had hair on top.  We returned gross omelet and they gave us a free chocolate croissant instead.  Croque Monsieur was tasty.  In sum, nice looking place with nice menu listings but subpar food. A bit pricey for what you get."], ["Kathy G.", "What a quaint little place tucked into the Shops at Gainey Ranch. It really makes you feel like you are transported to France.  Take a bite into a chocolate filled croissant while sitting on their front patio with a latte.      Their savory crepes are delicious with an egg added on top.  I had the chicken and Brie with Caramelized onions. Bring fido too-their patio isn't enclosed so it is dog friendly. The staff is super friendly and will let you know all the specials-great place to brush up on your French skills if you have them :)"], ["Irina H.", "Wow! This place is adorable. The food is sumptuous but light - perfection. We tried the printemps savory crepe - the cheese was warm and melty, the vegetable were light, the crepe was smooth and thin. Melts in your mouth. Even the croutons in the little side salad were delicious. We also ordered a chocolate croissant - delicate inside, a little bit crispy outside, amazing chocolate...just wow.The atmosphere is incredibly cute and French, and the people who own/run it are delightful. We are coming back tomorrow!"], ["Teri D.", "Took a chance on this place and glad I did.  The seating outside (earlier in the morning mind you) was nice but there is seating inside as well.  I had the Lorraine omelet with potato chunks and a small salad and even though there wasn't enough bacon in it for me (bacon fiend here) the Swiss that was in there? C'est magnifique! Not the speediest service on the block but it was good enough.  Just had to make them take notice that more water was necessary.  I mean it is Scottsdale during 100+ degree weather.  The prices are very reasonable - my omelet was only $8.75 - and an OJ was less than $2.  I saw another table get their French toast order and was determined to try it the next time I'm in town."], ["NM Z.", "Best crepes I've had so far in the valley. This restaurant is a cute little French cafe, and I knew the food would be good when I noticed all the French customers surrounding our table. The service, coffee, and crepes were all outstanding. My group ordered both sweet and savory crepes and every dish was delicious. Can't wait to go back!"], ["Allison L.", "Amazing crepes in a cute little place! Visiting in Arizona and was craving Nutella, banana and strawberry crepes. Found this place and was so ecstatic it was great! Can't wait to go back for a savory crepe."], ["Angela S.", "Very disappointed with the service. We were seated and then no one came by to provide water or take our order! In fact, 3 tables that were seated after us were attended to first. We waited for quite some time but were completely ignored; we finally just left.  I understand they were busy but don't flat out ignore customers!"], ["Scott L.", "Wonderful location, splendid food, extremely fast and VERY attentive service.  This would be an easy 5 star rating in anyone else's book but I hold those for super special ratings.HIGHLY RECOMMENDED!Our group of 8 arrived after the monthly Cars N Coffee event and as we strolled in we changed our group size from 6 to 8 within minutes yet were warmly greeted and the change was no problem.  The setting was wonderful and beverage orders were quickly taken as we were given options for the daily specials.  I spied the Crepes Tutti Frutti and at $7.25 was pleasantly greeted with a large crepe of abundant fresh blueberries, strawberries, raspberries covered with whip cream and almonds then drizzled with honey.  Sacre bleu!  I will be back - Thank you."], ["Victoria W.", "Took my daughter to lunch here--or at least that was my intent. We were told to sit anywhere and we did. An older couple with a small dog (licensed as a service dog--don't get me started on that) came in after we did and sat one table away. They were acknowledged and their order was taken. I mistakenly believed a waiter or waitress would soon, at least, acknowledge we were there. Nothing. The table next to us was cleared and cleaned. Still nothing. This is a teeny restaurant so I know they knew we were there. After 15 to 20 minutes of being assiduously ignored, we got up and left and we won't be returning."], ["Sami C.", "I absolutely love this little restaurant! The crepes are spectacular and so freshly made. The service is tres bien! :) delicious coffee, fresh mimosas and cocktails, and just great ambiance. I hope this restaurant continues to do well and can expand into a larger space. I highly recommend and always leave this restaurant smiling because of the wonderful service and food!"], ["Laura R.", "My family and I absolutely adore this French-owned and operated crêperie in Scottsdale and we come whenever we are in town. On a mild day, we adore sitting outside and catching some sunshine while indulging in Chez Vous' wonderful crêpes and omelettes. After all this time, we have tried everything on the menu at least once, and you can't go wrong. Everything is heavenly! The staff is French-speaking from western France (I believe Breton) and they very much enjoy chatting in French with their patrons. Children and groups are welcome (whenever we come as a family, en masse, we check both of these boxes and the owners are happy to accommodate us). 'Chez Vous' is the perfect name for this place, as you will immediately feel at home here."], ["Andrew K.", "My favorite coffee ever is served here! I've come multiple times just for a couple cups of their delicious French press. I have also had some food here and most of the dishes have impressed me. This is a crepe restaurant, but I do not love the texture of their buckwheat crepes. They do have some excellent pastries, which go really well with their coffee. It's a small eatery, but I've never had issues with finding a table and their staff remains consistent and very friendly."], ["A B.", "Some of the friendliest staff I've ever encountered. The food at Chez Vous is sublime especially the crepes, but also their salads, sandwiches and other deserts. One of my favourite items on their menus is the croque monsieur, a sandwich made with ham, cheese and creme fraiche and then toasted in the oven. I love the atmosphere of the place but its really the terrific staff that makes it special including the owners Isabelle and Richard and their son Romain.Recently, they have added fruit tarts, made in house fresh and they are to die for.Also do not miss their coffee, espresso, cappucinos or lattes..."], ["Karine K.", "Yes, quiche, yes, salads, yes, service, yes, croissants! I love this place, the service is parfait, the space is great, so is the outdoor seating. I came a few times with the kids, and they are so great, they bring little baskets of toys for the table. Just so thoughtful. They are great and I can't wait for my next lunch there! Merci!"], ["Lance W.", "Went there for Mother's Day, They were very busy but the staff did a good job of accommodating everyone. The food was as good as usual and we had two of the specials for that day,We eat by here often and find it a pleasant place to be with good food. The only bad thing on this past sunday was an arrogant and demanding woman who made a scene because she didn't hear het number being called."], ["Hasti E.", "Great place for crepes..delicioussss!!! Very nice French owners! Highly recommended :-) ......,,......"], ["BB M.", "A very good place to get authentic French cafe experience in this area.  I tried the sweet crepes (strawberry/nutella), the savory crepes (coquilles St Jacques), the quiche lorraine and the salmon omelet.  All were cooked perfectly and served pleasantly.  The hot chocolate was great.  The coffee was fine.I will return again to try the croissants."], ["Ann S.", "I had the specials (salmon and shrimp in curry crepe and raspberry tiramisu). OMG. I felt like I was back in Europe. The food was so REAL. When you eat this type of food, you do not need much. One bite and you want it to linger there because the texture, the smell, the taste . . . it is perfect. My friend who went with me is a chef and enjoyed it all, too. Also, the cappuccino was amazing. It is just a quaint place that delivers a little bit of Paris right to your palate.Je voudrais manger ici tous les jours si je pouvais me le permettre . Croyez-moi. Donnez-vous le don de manger ici. Excellente. Magnifique. Belle. Divine."], ["Jeanne P.", "The service is incredibly poor. I wAs told my table would be ready in 30-44 minutes. I set my timer,sat in the shade because there was inadequate waiting room outside or inside. I came back in 20 minutes. The rude,discourteous ,arrogant hostess informed me that since he had already called my name and I didn't show up I would have to be put at the bottom of the wait list. Then the manager had no time to speak with me to remedy the situation. NEVER GOING BaCK THRre but they don't appear to care about there customers."], ["Ashok K.", "Excellent ambiance and food. Money well spent. The crepes were healthy but awesome. Would visit often"], ["Matt S.", "My wife and I had a late breakfast here during our \"staycation\".  We chose to sit inside the small restaurant, but the patio seating would be lovely earlier in the morning or during a more temperate month.   Service was excellent, it felt like being a guest in this family's home and they wanted to share the food that they were proud of with others.  My wife had the croque Madame which came with a small side salad and I had the nutella & banana crepe.  All were phenomenal.  We are already planning on the next time we can be in the area, so we can come back and try more from the menu."], ["Claudina G.", "These are delicious authentic crêpes bretonnes. The best crêpes in the Phoenix area. I had the Forestière and every bite was splendid and full of flavor. The coffee is really good as well. I will be going back to try some more very soon. The service is good, atmosphere is very nice but be prepared to wait for a table since the place has only a couple of tables. Worth the wait."], ["Reza S.", "The service was outstanding, Romain is probably the nicest and happiest people on this planet!!!  Good it's outstanding!!!! A must have if in Scottsdale"], ["Tyger L.", "I wish I had a picture to post of my lunch today...but I eated it. I plan to eated more in the very near future. As I sit here typing my review, I have Nutella all over my face. *money shot* SCORE!So my coworker and I were fiending for some crepes, so of course I grabbed my Yelp app and looked for something near work...up pops Chez Vous. VOILA!!! We ordered (to-go) a croque monsieur to split, she had the classic crepe for dessert and I looked through the menu looking for the perfect fix for me sweet tooth. After hemming and hawing for a while, I located the tutti frutti...but it was missing something...something crucial to my dream of the perfect sweet crepe...NUTELLA! Lucky for me, they were very accommodating and added it to my beautiful buckwheat (or is it regular wheat? Bah! WHO CARES?!)  treasure.The croque monsieur was THE BEST I've ever had, here or abroad. (So very sorry La Grande Orange, but since you are in my neighborhood I am sure I'll return to you eventually...when I can find a parking spot.) The bread was baked (golden as promised on the menu), but soft and doughy and covered with melted cheese and shmeared with creme fraiche...why oh why did I agree to split you my dear little sammich?! I may have to stop back on my way home to have it for dinner. It was decadent. It was sinful. It was perfection!My Nutella, banana & strawberry crepe didn't even get a chance to scream for mercy. If it had fresh cream on it I probably would've tried to inhale the damn thing and drowned. So I guess I should thank them for holding back on that...drowning is a terrible way to go, even if it's done while asphyxiated with hazelnut spread and fresh fruit. C'était délicieux, merci bien, à bientôt."], ["John C.", "Outstanding crepes and quiches, etc.And with truly wonderful real French coffee.Great Service too."], ["Lori L.", "Absolutely love the food, atmosphere and service of this little French gem in Scottsdale. Whether it's lunch with the girls, or a late snack with my husband, Chez Vous doesn't disappoint. Go when the weather's nicest and enjoy the charming patio. You won't regret time or money spent here!"], ["Aileen B.", "Arrived around 7:30 am to find CV closed and not due to open for another 30 minutes, so I drove further down to Wildflower Bread Co. to check out its breakfast selections.  Perhaps it was the few bites of the two scones I purchased to-go there that caused me not to thoroughly enjoy my staple selection of a raisin croissant ($2.75) today. yelp.com/biz_photos/chez…  (I agree with an article I'd read years ago that only the first few bites (four, I seem to recall) are the most pleasurable, and succeeding portions lose their potential to cause excitation of the sensory nerves.)  I also ordered a Moka ($3.50) yelp.com/biz_photos/chez… and tried a new (to me!) crepe, a savory one called French Favorite (shaved ham, Swiss, and sunny-side egg in a Sarazin buckwheat crepe, $9.50).The Moka was delicious- it came unsweetened, which was OK with, since the bites of scones and croissant had enough sugar to sweeten the occasional sips I took of it.  The crepe was very tasty!  I forgot to inquire how the fried egg would be presented, and I wasn't asked, so I'm assuming the kitchen cooks it sunny-side up.  If you like your eggs cooked differently, make sure to speak up!  Today's version wasn't so bad, and it made for the \"money shot,\" anyway. (Or maybe not!) yelp.com/biz_photos/chez…Isabelle was sweet and accommodating, as always, as she did not rush anyone out of the cafe, switched out the salads when I asked if the vinaigrette contained mustard (it did), and brought me regular coffee when my Moka ran out.  Tip- order the Moka when you are with a friend, as you will garner not only two cups of delicious mocha coffee, but a pot containing about three extra servings!  Then again, the first and last time I did order this coffee selection, I was with my younger, and ultra-sexy cousin (guys NEVER fail to look twice when she's around!  My Mom and sisters also have the same effect on men, I swear!), so maybe it was a one-time deal...  I won't name names, but I think someone had a crush on my beautiful cousin!  ;)  In any case, I enjoyed my delightful Moka and savory crepe, and, at a lesser extent, the raisin croissant, so thank you Chez Vous!"], ["Lisa G.", "I love, love this place! The savory crepes are a great meal w salad. The regular coffee is one of my favorites and the cappuccino is even better. The creme brûlée is the soo amazing. This place gets really busy on weekends and I find going close to 2p on Sunday is the best time .one hour before closing..great little place run by some great friendly people"], ["Erich B.", "Great place for crepes, although not as good as the crepe bar. The chocolate croissant was very good. The French toast amazing. The iced tea very good. However maybe we are more used to the crepe bar's crepes which are much more flavorful and the crepe itself much more light and crispy which my wife and I prefer. Here the crepes are made with buckwheat which may be more authentic but are a but too thick and heavy for the inside ingredients to shine thru like at the crepe bar. We will be back but for crepes we prefer the crepe bar."], ["Audrey C.", "My friend and I tried this place when we were in town for the day. It was a great place for a girls day. The staff was friendly and laid back. The patio was shaded enough to be comfortable on a record breaking hot day at lunch time. And the crepes were delicious. My friend had the Brittany and I had something very rich the name of which I cannot remember but it was recommended and delicious. We split a pear crepe and left full, satisfied, and happy.  The savory crepes were served with just enough side salad with a delicious dressing to make me feel like I had eaten something healthy. Ha!  Well worth who knows how many calories. The restroom was clean too and well stocked with a variety of luxury soaps and lotions. Ooooh la la. It's the little things."], ["Luisa B.", "Worse owner EVER, I returned my eggs because the salmon tasted wrong, smelled bad, the owner cam me to me furious to argue that there was nothing wrong with it, I told him that my friend also tasted it and she thought he same as me and he kept arguing, incredible, I don't normally return food unless something is really wrong but definetely this is the first time the owner comes to me upset to argue otherwise, very rude , I'm never coming back here again unless there's a change of owner."], ["Elaine H.", "The brie savory crepe is the best (haven't liked the others I have tried nearly as much). A mango cocktail is lovely, and so is the coffee.  They offer Harney teas, which I love.Atmosphere is quaint. Service is prompt. Tables can be rather small.I will be back...I want to try their chocolate croissants..."], ["D J.", "Two more recent visits, post morning mountain runs :) delicioso!Lovely crepes for the whole bunch ! Many \"Thank you!\" 's from our little ASU bunch -- ciao :)"]], "Carlo & Emilie's Gourmet Deli": [["Melissa M.", "Uhhhh Eggplant Sandwich!! The BEST!! Huge and so inexpensive, definitely good for two people! The eggplant is sliced thin, breaded, layered between a toasted baguette and the marinara sauce is delicious! My husband always gets the Chicken Parm Sandwich and loves it! They are quick and quality of food and service and great!"], ["Melissa H.", "This place kicks butt! We tried the chicken salad and the turkey sandwich on a roll and both were out of this world! Plus a great value we split a half Sandwich and it was perfect size for lunch! The mustard vinaigrette was so amazing I could put that stuff on everything!! I want to try so much more there and I bet it's all good! Like I've said before can always use more cheese but I likes my cheese;) oh and Carlo is sooo sooo sooo nice... Great experience for my first try and it definitely won't be my last!"], ["Arthur Y.", "Had lunch on Friday and ordered a full capocollo, salame, and asiago cheese sandwich.  The full is a pretty good deal with the amount of meat that they give and so is the half sandwich.  The sandwich was very tasty.  I ate half and brought the other half for my family and they gobbled it up.  Lunchtime was busy so we had to wait a couple of minutes for a table to leave as the deli doesn't have too many tables.  There were tables outside, but I didn't want to sweat to death outside during summer.  Highly recommend this place."], ["Howard D.", "This is a great restaurant.  They use the highest quality ingredients and know how to cook with them.  I had soup, a hot beef sandwich and the apple pie.  My Wife had the Salami and asiago and a cannoli.  The bread was a fresh homemade french baguette.  It was the kind you would get in New York.  The meats were high quality and piled high.  The apple pie was the best I have ever had and the cannoli was very good.  I would highly recommend this restaurant.  Next time I want to try the pastas."], ["Jeff M.", "Carlo the owner is amazing and hospitable. He really makes this place what is 5 stars. The complimentary Stromboli on Saturdays is terrific. I yet to try anything that didn't have me wanting to come back for more."], ["S L.", "Stopped by casually after seeing the other reviews on yelp and i wasn't disappointed.My wife and I shared a whole sandwich and it was more than enough.  We also really enjoyed the cream of potato soup.  You could definitely tell it was homemade.The highlight of the trip may have been the chocolate mouse.  Service was great.  They'll pretty much make you whatever you want if they have the ingredients.  I wish i lived closer so i could go back more often."], ["L O.", "We are SAD to have found this place just weeks before we move out of town. If you know the difference between chain Italian and really quality Italian; if your bar is higher than almost any place you can find in the Phoenix metro area because you know better--this is the place for you. This is not fine dining atmosphere, but deli with a friendly European bistro vibe. We met Emilie, one of the owners, who took our order and delivered the food. She was charming, authentic, passionate and, well, European. A delight! Sandwiches were best we have had in maybe 20 years (both lived in NJ/NY), lasagna was sublime, not as heavy as we have been led to believe it has to be and with a simple, rustic, yet uniquely balanced flavor profile. My wife claimed the tiramisu was as good as she has ever had. A complete gem of a find in an otherwise desert (get it?) of good food."], ["Andrew F.", "Tried this little place out that's located in the Fry's shopping center. Nice, super clean family owned deli restaurant. Staff was very friendly and attentive. Food was okay. The Chicken Pesto I had was a little over cooked and the bread was a little hard. We got there about 10 minutes before closing and didn't realize that they close early so that may be why the food was over cooked. The dessert's look awesome, but didn't have a chance to try them as they were putting those away for closing. Limited seating inside, but plenty of seating outside. My wife had the Chicken Parmigiana and it was okay too. Not bad, not great. Maybe another day I'll try it out and see if I like it better."], ["James F.", "This place is bomb. I had a number 9 sub and a side salad. Both were delicious. It looks like they offer pastas which sound tempting. Finally, the desserts look incredible. I will be back here again."], ["Peter M.", "A buddy of mine took me here for lunch a couple of weeks ago and I am really glad he did. It is  a fantastic little spot for lunch/dinner/desserts. You order at the counter and they'll bring your food out to you. I tried the chicken parm (italian deli/restaurant litmus test) and it passed. Definitely a strong showing. A half a sandwich is enough for most folks and a whole one is good if you are trying to take a nap afterwards. It is a bit more expensive than other places around it, but you are paying for quality, this isn't a chain. In fact, it is family owned and you may want to call ahead if you are traveling more than 20 minutes to get here...the first time we went they were closed for a week while they were on vacation."], ["Diona B.", "Every neighborhood needs a deli like this. Mine doesn't have one but I gladly make the drive because this spot is definitely worth it. A great selection of cold cuts, freshly baked breads and a simple yet delicious variety of authentic Italian staples to choose from on the menu. Make sure to save some room for a cannoli or some of Carlo's famous tiramisu.Large portions made in house with quality ingredients and reasonably priced. One of my favorites is the Beef Braciola but you can never go wrong with the meatballs either...Carlo and his crew are amazing. A great place to keep in mind for catering small parties or corporate luncheons."], ["Amy B.", "Everything I've had here has been delicious!  So glad it's located close to my house. Love the butternut squash ravioli. Also love chatting with Carlo!  Highly recommend"], ["E. V.", "The meatball sandwhich and italian sausage sandwhich were outstanding!! The portions are spot on."], ["Steff S.", "Great little Italian deli owned and operated by real genuine folks.  Friendly and very helpful service at the counter. Short waiting time for lunch and the food was amazing! Absolutely loved the eggplant parmesan (recommended by the gal behind the counter) the antipasto salad is must try too! Generous servings and homemade bread, sauce, and more! Don't pass by this little gem!"], ["Brooke R.", "The food was incredible! We had the #9 cold sandwich and the Hunter Style Chicken special. The entire staff including the owner Carlo were so friendly. We went there for lunch and loved it so much that we ordered take out for dinner tonight. I will be eating her frequently. Highly recommend!"], ["Donata C.", "What can I say - pretty amazing. Nice service, the food was soooo good. Everything is fresh, homemade - a true little European sandwich shop in the heart of Chandler. Highly recommend!! Oh wait - have I mentioned the fresh amazing homemade desserts? And cheeses, smoked meats that you can buy to take home? Love it, absolutely love it! :)"], ["Ron R.", "New place.  What a pleasant surprise!  Great chow and very friendly people.  Pasta and hot and cold sandwiches.  Licked my plate.  Try the pastrami with sautéed onions on rye.  Guarantee will put a smile on your face.  My new favorite place."], ["Maria B.", "Love the food everything is delicious!!! We had the chicken burgers is perfection the meatballs sandwich so great the have for dessert chocolate mousse tiramisu mmmm great"], ["Jan H.", "Question: where is the French stuff? This all looks good, but the menus is almost all Italian."], ["Brian M.", "My wife raved about the lemoncello cake, the pecan pie was good and the chocolate cannoli was very good."]], "L'Ecole": [], "Vincent's On Camelback": [["Jill M.", "I ordered the lobster and hand crafted pasta...doesn't get any better than this!"], ["Rochelle J.", "This place is a joke. Under cooked steak and when it was sent back they recooked the same piece of meat and charred it to death. Totally inedible.  That happened to two of us at the same time. Dessert was barely mediocre.   No one ever came to discuss our issue with our meals. We had to fight to get any of our uneaten meals comped. They said because we are dessert (we ate 1/4 of one of 3) we should pay for the entrees that were inedible. The server had to do all the dirty work as far as trying to get anything taken off the bill. I'd never come back here and will make sure no one else I know does either. What a waste."], ["Georgene C.", "Very disappointing.  We should have known when we arrived on a Friday night and we were only one of 2 tables that it wasn't going to be good. I hadn't been to dinner there in years and the quality has really declined.  4 of us dined and everyone of us had a bad meal.  I ordered the fish special, halibut/sea bass duo - fish was dry.  My husband had the lobster tail, it too was over cooked and the other couple we dined with did not enjoy their meal either.  I will say that although the food was terrible, our server was outstanding.   Hopefully, he will find a new restaurant that is busy and he can make some real money."], ["Maria H.", "We went here for Mother's Day today. It was one of the worst meals I have had, especially for the price. The food was bland, precooked and uninspired.Also, the atmosphere is very stuffy and there are literally no children there (unless you count 60 year olds). Will never go here again.I tried not to let it ruin my day but unfortunately it did (at least for a few hours)."], ["E D.", "Food was great, high quality. Ordered the beef Wellington and it was done right. Service was attentive and friendly. It was Valentine's Day and they offered some lovely sweets at the end. The decor was \"classic\" but the blue tufted booth seat was uncomfortable. Lighting was a little off, maybe a little spotty. Overall, nice place and would recommend it."], ["Soo Jin M.", "We'd been meaning to try this restaurant for years so we finally went for restaurant week this year.  The bread basket with mini croissants and a few pieces of grilled bread was delicious.  The lobster and corn fritters were edible, but I probably wouldn't order it again.  The salmon quesadilla was much better.  The tenderloin was decent but a bit overcooked and not inspired.  The prawn dish was pretty good.  The portion sizes of these plates were underwhelming.  Dessert could have been better..  I had the crepes - they were a bit dry without a little bit of chocolate in the folds...  They were much better with some cream from the pots de creme that came for the table on the house (everyone gets this and its actually very good).  The chocolate tart was the best dessert on the prix fixe menu.  The cheesecake had a weird crust that didn't taste or feel good.All in all, I may try the bistro next door but probably won't come to the restaurant again."], ["Brad M.", "My wife and I went to Vincent's tonight for her Mother's Day dinner (a day early).  I had read the reviews online and decided to go to Vincent's.  We were not disappointed.  It is a very quaint place with a terrific ambiance.  You can hear others talking at the tables around you but the acoustics are very good so you can still carry on a quiet conversation at your table.  No shouting needed.  Our waiter was Howie and he did a great job of explaining the wine list and menu items.  We started with the macadamia nut crusted scallops.  Melted in our mouths.  Then we had the lobster bisque.  Not quite as good as the scallops but still outstanding.  For our entree we both ordered the rack of lamb, medium well done.  It was divine.  It came with a portion of scalloped potatoes that were the best I have ever eaten.  The lamb was cooked perfectly and seasoned to excite any palate.  For dessert I ordered the profiteroles.  Delicious.  We were also give a chocolate tart compliments of the chef.  Again, absolutely delicious.  My wife and I eat out quite a bit and we are very adventurous when it comes to food so we have tried many things in many countries.  We both agreed that our meal at Vincent's was the best we have had in years.  We will definitely be back."], ["Frank S.", "Love Phoenix restaurant week!  Fantastic meal.  Great service.  Wonderful atmosphere.  We will be back."], ["Matt M.", "We reserved the private dining room for a business group meeting. Room is quite small but enough for a table of 12 or so. Vincent's has a small-ish valet parking area outside. If you want to park yourself you could do so at the 7-11 next door. Vincent's is classy, dark, and ambient. It feels European with its small wood tables and chairs, paintings and prints, and emphasis on quality over quantity, both in regards of food as well as service. Our server was extremely nice and accommodating. She hooked us up with Wifi (worked very well) because for some reason there is virtually zero T-mobile signal there. She and her colleague were always there to make sure we had everything we needed and our glasses always full, but never pestering or overbearing. She even recommended AGAINST a menu item one of us was considering, something I've very rarely experienced. Usually servers sugar coat everything. The food was very good, high quality and clearly made with love. I had the lamb chops which were perfect. They came with  small sides of potato gratin and asparagus. Very simple, classy, and delicious. The portions were very small which is to be expected from a French-inspired place like Vincent's but maybe they could give patrons just a little bit more. The wild boar one of my colleagues ordered looked equally delicious and she said she loved it. For desert we tried the Grand Marnier creme brulee which was basically just creme brulee on top of 2 shots of Grand Marnier (pass unless you really, really love Grand Marnier). Overall a nice, quiet, classy experience. I never saw the bill but I imagine it was pretty lofty. Would definitely go there again. I can't give it 5 stars because while the food was good, it simply wasn't outstanding, and the portion sizes bordered a bit on stingy."], ["Mike M.", "Vincent's has been a go to restaurant for years for our family. If you love classic french dishes you will not be disappointed. Over the holidays the goose is a must order! They are happy to accommodate a special request if you give them advance notice (Hint hint duck a'orange lovers.) P.s. The makers Manhattan is a good addition to any rich and flavorful entree."], ["Jessica V.", "One of my favorite brunch places of all time. It has a very cute Italian home feel, very cheap and I love the complimentary croissants with jam. Also the past few times my boyfriend and I have gone, we have each gotten a complimentary small sample of a dessert they have. The dessert is brought out like the regular desert just petite sized so we still get presentation; Just mini sized."], ["Sandy S.", "The atmosphere is quaint. I was seated on a leather booth and was comfortable. Excellent service. The sommelier gave us a great suggestion. I think the menu changes almost daily. We shared duck tamales that were great. I had a spinach salad. My husband had lobster bisque. Both were excellent. For entrées he had rack of lamb that was very good. I chose elk tenderloin. It was ok but the sauce was a little strong. We ordered profiteroles to share, excellent and plenty for 2. We were almost done with them a d they brought flourless chocolate cake, complements of the chef, I was full but had to taste. It was very good. I saw someone commented on the bread basket. We thought it was stale . Entree portions are small but the other dishes were quite large.Overall a nice experience ."], ["Kat S.", "Went here for Valentine's Day dinner with my  husband and had a very unpleasant experience. We walked in and waited 10 minutes for someone to even notice us and we had a reservation ahead of time. Their wine list was extensive but grossly over priced. (30+ a glass) The food was prompt yet lacked flavor and quality for the price. (40+ entree) The structure was pretty but the chairs cushions were dated and looked like my grandmas lawn chair cushions. Needless to say I will not be returning nor suggesting this place to anyone."], ["Christina P.", "Talkin' about Happy Hour here... You really can't beat the selection or price on the 1/2 off champagne cocktails and wine. Food is quality also. It seems an undiscovered gem as we were the only ones there for quite some time, only to be joined by 2 small groups. I had the mini brioche sliders ($8). You get to choose 3. I went with the crab cake, lamb and beef. I don't think I would get the lamb again, but the other two were adorable, satisfactory nuggets! (They are indeed mini.) As for my cocktail selection, I started with the champagne with  bigarade liqueur (Orange liqueur from Provence: it tasted like a perfectly balanced mimosa with no calories wasted on juice! ;)) but also enjoyed the malbec and tried the cava (it was too sweet for me).Hands down, this place is in the top 5 best happy hours in the Valley!   (vincentsoncamelback.com/…)"], ["Kim K.", "We had a gathering of 16 people for a special event, reserved months in advance.  They don't tolerate menu questions for special events.  They seem to attract only those who let the chef do as he pleases.  The chef had his wait-staff clear plates before everyone was finished.  He rushed us out to avoid paying staff overtime. The food was simply average, and in some instances below:  Lox appetizers appeared with the black part of the lox, disguised with cheese.  It appears Mr. Vincent takes the cheap way out!"], ["Ryan J.", "Once you properly adjust your expectations and assuming you don't show up at the same time that the gray hairs are showing up for their 'Early Bird'' meals you will find find out why this is one the long standing dining landmarks in Phoenix.  French food is a lot tastier and less pretentious when it has spent a little time in the Southwest."], ["John C.", "Great food served in a French ambiance by attentive servers.Expensive, but good for special occasions.  Good selection of wines but limited beer choices."], ["Caroline C.", "After spending Christmas in France, I was excited to spend my Valentine's Day dinner at a place with duck confit. Vincent's did not disappoint! My boyfriend and I loved the cozy bistro decor and the atmosphere was not too stuffy to make someone feel uncomfortable. For drinks, I had the sparking pinot noir. it was on special for Vday for $13. little pricey, but was nice. For the appetizer, we had the scallops to share. They were served to us on our own little plate so we didn't have to scoop them ourselves. really nice touch. but, most important, they were delicious! I've never had better scallops in my life. for dinner, my boyfriend had the lamb and loved it. of course, I ordered the duck confit and it brought me right back to France! so so so good. Finally we had the cobbler for dessert and it was excellent. we also got our own dark chocolate cake compliments of the chef. it was not the usual crap restaurants offer for a free vday dessert. they were incredible! light and airy on the outside, but very rich in the middle. overall, the service was prompt without feeling rushed and the food was well worth the price. we will definitely be back again."], ["Jenny C.", "Lovely little restaurant. We came here for brunch on a Sunday and spent about $50.- Warm Brie salad was simple but great- Lobster quiche was well cooked, but filled mostly with claw meat - not a lot of lobster flavor- Smoked salmon quesadilla with capers and cream cheese was delicious. Looked like a lot of smoked salmon, but it was very thinly sliced, so it didn't fill me up.- Complimentary mini-croissants and homemade jam were spectacular- Our meal came with a tiny little creme bruleeOverall, Vincent's is a nice restaurant. The food isn't terribly exciting or well thought out, but it's good, light brunch fare. A lot of the patrons there seemed to be regulars. We might stop back again if we're in the area."], ["Melodie C.", "Such a charming place, but blink and you'll drive right past it. The menu changes daily I think, so you'll always get something new with each visit.The croissants are to die for! They also have a crème brulee sampler that includes vanilla bean, passion fruit, mocha, Grand Marnier and chocolate. Awesome. Loved every bite."], ["Becca C.", "Thank you for being the only place I could find with a vegetarian and gluten free menu during resturaunt week. The food was amazing!"], ["Darren S.", "My experience with Vincents is a solid nine out of ten every time. There duck tamales are incredible and you still can even find Vincent himself in the kitchen cooking on many nights. Nice to see success hasn't changed the work ethic for this restaurateur's dream. Im sure it was a hard road, but there are few, if any, French restaurants in town that offer such splendidly sinful food choices. Overall I love the old world look, the service is usually top knotch and for fine dining, the price is no more or less than other similar quality restaurants."], ["Anna S.", "Great food and atmosphere. It is small and personal and reminds me of restaurants actually in France. The waitstaff works hard and is pleasant. I have had salmon, ravioli, and most of the appetizers. I have gone twice with large groups and everyone loved their food. The wine is also great and the menu is reasonably priced. When I went with vegetarian friends, the kitchen and staff offered alterations to the menu so they could enjoy a meat-free meal."], ["Robert T.", "Ok...First off I have to say I don't usually judge a place off the reviews and like to give it a shot. Well this was a bad idea... especially on an anniversary dinner celebration. Please be advised that the bad reviews are indeed true. We have eaten the food through their catering and it is delicious, so this makes me think all the energy is expelled here alone? Like the other reviews had said this is a creepy outdated awkward place that doesn't have any background music playing at all. So yes the tables are very close together with no music so imagine how uncomfortable that will be. We immediately ordered martinis to try and ease the mood. My dirty martini was garnished with tiny olives on a sandwich pick for an upscale price. The server also spilled most of my wife's martini during her trip to the table saying how it was \"overfilled.\" We received a basket of bread that was burnt and unappealing which ended our idea of a maybe hopeful outcome. We were both confused because the dinner menu was nothing like we had eaten through catering. The server informed us that we had probably meant to dine at the \"bistro,\" and was happy to transfer us over next door. Feeling questionable that it would be any better we paid our tab and agreed to go take a table they were holding for us. We then walked over to the bistro side of the restaurant only to be disappointed once again.  Packed in like a meat house and sat there for 15 minutes without being asked if we'd like a drink we decided to walk out. They have again an awkward system of seat yourself and apparently serve yourself as well? We were so confused by all the groups of people lining outside to get in this place. We were more than willing to give up our table to the next unfortunate guest. The parking lot is also a joke like a previous person had reviewed. It is only valet and gets backed up by the cars coming in and the one attendant trying to run the place. Some lady thought I was a valet driver and proceeded to yell at me because I was standing around not helping her. We are in our late 20's and knew we were in \"Snotsdale\" all the way."], ["Robert D.", "Let me start by writing that the service was good, the waitress was prompt and attentive to the two of us. We were seated in a small room with 5 tables which was fine except that it was stuffy and a good look around the outdated room revealed a great deal of dust on rails etc. this of course makes you ask . What is the cleanliness in the kitchen? We had the tamales which was  dry and the fois gras which was good. The squash was excellent and the spinach salad was excellent but way overdressed. We also had the lobster and basil pasta, the lobster was chewy and the pasta had good flavor but vastly overdressed with oil or butter. My lamb was very good, except that lighting a rosemary twig for no purpose except to fill the room with smoke, is very unappealing and choking , especially when most diners have that dish. How is it a good idea to smoke people out? I think it takes away from he dish. Just put fresh rosemary on the plate , would be much more aromatic. The wine list is extensive and way overpriced( 300% mark up on some wines is unacceptable). I also think a water bottle should be opened at the table and not brought open to the table , makes me wonder .I would also note that the food plates arrived quickly( which is good) although spending $360.00 and being out of there in 90 minutes can leave one wondering what just happened.Overall, it is not on my return list."], ["Chrysty C.", "We came here on a Saturday during Restaurant Week.The service was excellent and very professional.  We received our orders quickly and everything was prepared exactly how we ordered it.I ordered the salad with goat cheese and pears.  It was good.  Not great, but I ate the whole thing so I definitely can't complain!  The goat cheese was delicious and creamy.For my entree, I ordered the beef tenderloin.  It was also delicious!  It came with a small portion of scalloped potatoes, a few green beans, and a few asparagus.  For me it was a perfect portion size, but for anyone else I think it may have been a bit small.  But since it's on the special \"Restaurant Week\" menu, I'm sure the portions are meant to be smaller.For dessert, I ordered the creme brulee.  It was delicious as well!  The waiter also brought out a chocolate cake/lava cake?  Not sure what it was but it was yummy and served with an ice cream that was very light.  Almost seemed like whipped cream, but it was definitely ice cream.OHHH!!  I almost forgot about the bread!  I loved, loved, loved it!  The butter is the best!  I couldn't quite figure out what is in the butter.  It almost tastes like a cream cheese.  It was wonderful!Overall, everything was good but I don't know if I'd ever rush back.  I have other places I like more, but this was a good restaurant.  I would definitely recommend it to others!"], ["Stephanie K.", "I'm stuffed!  No please, no more food!  Wait, it's free?  You just want to give me extra food because you feel like it?  Alright, I guess I could sacrifice and eat this delicious chocolate cake and free cookies you put in my valeted car!I swear that is how it is every time I dine at Vincent's.  They love providing extra treats which is why this place exceeds five stars.  The food alone is divine!  I love every item on their menu!  The souffles are to die for as well.  But they always seem to go above and beyond every meal.  If only every restaurant had the same level of customer service!"], ["Stephanie P.", "Restaurant week strikes again!!!  Ok, first impressions....valet puts all the expensive cars up front for looks. We get it guys. Decor, it looks like a classic French restaurant that's been there a while. So that's fitting. We were seated in a little two-top against the wall though, with no view, no window. Kind of boring.Food was delicious though, can't lie. Between the two of us we ordered the tomato-leek tart, the brie and fig pastry, the lobster, the white bean ravioli, the flourless chocolate cake, and the hazelnut ganache. Both got a glass of chardonnay and devoured the bread basket. Everything was very tasty and cooked beautifully, no complaints.  It was also very rich, decadent, and buttery.  Post meal make an appointment with your cardiologist.Service was fine throughout the meal once things got started, but we sat for a good while without anyone taking our drink order or introducing themselves as our server to acknowledge our existence. They passed the water glass test with flying colors, but servers had no personality, so warmth. Is it part of the French attitude? Discuss....."], ["CurryFavor E.", "If you're looking for vastly overpriced, underwhelming, unbalanced dishes in a beat-up, oppressive and dated environment, Vincent's just might be for you. If you like dining in a hot box because the owner is too cheap to crank the AC, this place might be for you. If you enjoy a kitchen that won't make the dishes you want and runs out of things, this really might be for you. If the prospect of 3 scallops for $18 sounds like a screaming deal, get down there right now. I felt like I was \"playing\" at fine dining as we sat whispering in this awful room with 4 other tables with those can lights shining right in our faces. Ugh. And the food, so heavy and old-fashioned. The waiters seem so beaten down and miserable in their tuxes. Throw in an unnecessary $2 valet, and the picture is complete."], ["Lara H.", "I have no idea why people are raving about this place. It is extremely over-priced for what you get out of it. There are so many better restaurants in this area that are less expensive.Let's start from the beginning, shall we? The croissants. People rave about their croissants. Yes they were tasty, no they were not amazing. Go buy Pilsbury croissants in those tubes at the grocery store and throw them in the oven, it'll taste the same.Next for our meal, I ordered the rack of lamb which I asked for medium rare. When it came out, I didn't even see a hint of pink. I didn't want to send it back because how can you uncook meat?? Do I want to take the chance of someone spitting in my food? I think not. So I figured oh well, maybe it's medium and I'll just eat it as is. I take my knife and cut into the meat, and I'm literally sawing the meat because it's so tough. The sauce was good, but I eat a lot of rack of lamb and I'd say this one fell way below average.My date on the other hand asked for the chef to create something special. We were both surprised when the dish came out and it was just simple garden salad with a filet of steak. That was it. That was the chef's SPECIAL creation. I'm giving this place 2 stars because the atmosphere is romantic, service was great, and the wine was delish. Sure there are dirty restaurants that I would give 1 or 2 stars to, so is it fair? I don't know. I think 2-stars are just about right since I would never go back to Vincent's."], ["Scout S.", "I feel sad to write this...but Vincent needs to improve things or his place will be only a past memory.  I'm ok with that based on the dinner I had there recently.The restaurant was packed...but with people who had Groupons...I only wish I had because my dinner would not have been 177.00.  Too much for a weak and sad plate of out of date food.We had the Foi Gras, small portion and so/so:(...Duck chimichangas they were decent. The wild boar was a tiny serving...we were fine with that because it was tough and difficult to chew.  It was accompanied with a hospital style vegetable medly of green beans with carrot shreds and minute white rice.  We also had trout..it was covered in a heavy white sauce (French) and had the same veg medly and white rice...seriously like the hospital food...or a big banquet service.  It was edible...but not great...We each had a glass of wine.  No dessert for us...it was hot in there and the arches and decor reminded me of a taco bell.  I wouldn't even go back if it was a free meal:("], ["Liz D.", "Oh my! Restaurant week 2011 .  This meal was a disaster! Terrible service...totally non existent  service. No beverages offered and we had to ask for them . There was a 25 minute wait for a reserved table, whilst 10 empty tables needed to be cleared. Food incredibly lacking in flavor . Lobster was NOT served....it was langoustine.  Steaks mediochre to be kind.  Excessively salty salad...could not eat it. Pecan pie smothered in caramel sauce. Honestly good pie ruined!  ONE WAITER HUMMED LOUDLY FOR THE ENTIRE EVENING. He wasn't part of the entertainment. Will never waste money there again. So many great restaurants in town.....THIS IS NOT ONE OF THEM."], ["Tracey C.", "Shared a wonderful 4 course dinner last night.  Two of us shared the salmon quesedilla ..... excellent!   The beet and goat cheese salad .... deelish!      The lobster bisque ...... so creamy and tasty!    And finally the rack of lamb .....M m m m .The lamb was totally amazing, as was the accompanying potatoes Au Gratin!!     Service was friendly, professional and attentive.   Thank you to Jennifer and especially Nick for a wonderful experience!     And thanks for \"splitting\" everything without any attitude!     Can't wait to return"], ["Maribeth E.", "My friend had a Groupon ready to expire and was awesome enough to share it with me.  I've lived here all my life and always thought of Vincent's as a place our grandparents would all hang out at.  The decor looks like it, but that's ok.  It's a French restaurant and definitely not geared toward yup's.  The food and service were still fantastic.We started with the foie gras and duck tamales.  Duck tamales at a French restaurant seemed a little strange on the menu; so we were intrigued to order.  They tasted like duck tamales.  They were good.  The foie gras was awesome.  We were also brought the most delicious croissants I have ever had.For our main courses, I had the lamb and my friend had the wild boar.  My lamb was fantastic and came with yummy potatoes and green beans.  The wild boar was good.  If you are curious what while boar tastes like; it tastes like pork.  Lamb is one of my favorite meats and this was definitely one of my favorite times eating lamb.  We finished off with desserts.  I ordered the profiteroles and my friend had a grand marnier souffle.  You really only need to order one dessert per four people.  They are large.  The profiteroles were tasty and very rich.  I couldn't come close to finishing them.  The souffle was actually two souffles.  I've never had a souffle before so can not really say if it was a good souffle or not.  It tasted like eggs.  My friend said they are supposed to.  The chef brought us out complimentary flour less chocolate cake.  That was delicious.  It would have been amazing with some vanilla ice cream on top.The food was amazing and I will definitely be back when in the mood for some French cuisine or even just for some wine and desserts.  I would recommend as a great place to take your mom for her birthday too."], ["Lauren E.", "Wonderful service and delicious food!! Our waiter was very knowledgeable about each item we asked about, and our water glasses were always filled without asking. We ordered the lobster bisque, beet & goat cheese salad, rack of lamb, lobster w/basil pasta, pumpkin creme brulee, and chocolate hazelnut cake. Everything we ate was delicious and fresh and very carefully prepared. Loved the complimentary flourless chocolate cake at the end. Yum! This place is somewhat pricey ($32+ for entrees), but it's a great place for a special night out! Make sure to ask for the original room - very cozy!"], ["Chip P.", "My sister mentioned this place was always busy when she drove by so we figured it must be great.  Wrong.  We went for Sunday brunch this past weekend it was about 50% full.  We sat down, got our drinks and food orders in right away and so began the 35 minute wait for our food.  I had the salmon with capers and my girlfriend the salmon, eggs, cream cheese.  Both dishes were tasty but there was hardly anything on the plate.  If it wasn't for the delicious croissants and jam to start us off, I would have been just as hungry as when I arrived.  Luckily they threw in some complimentary deserts in at the end for our party and that made things a little better.  Still, I won't be going back.  There are better brunch places out there for the money."], ["Barb H.", "celebrated 21st wedding anniversary at Vincent's. bit of a rocky start when we got there....thought that our table wasn't great, with kitchen noise (we got there about 615 and TV or radio in kitchen was too loud) but as the restaurant filled, we realized that our corner table was the most isolated from other diners. Howie showed us our table and was very friendly. Some confusion on other waiters stopping by to take our orders throughout the evening. Duck tamales were outstanding -- lots of duck...much more than expected. lobster bisque had wonderful flavor...needed a final strain to remove a few bits of tomato and the chiffonade of basil could have been smaller. heirloom/avocado salad was outstanding. roasted lamb and all its accoutramaints was excellent and cooked perfectly. seared foie gras with peaches was a bit small, overcooked and too much sweet sauce. chocolate fondue was a bit undercooked but very tasty...chocolate tart was even better. Service was great (though confusing once or twice) and they truly treated us well knowing it was an anniversary celebration. Would definitely make reservations a bit later so that we weren't one of three tables that early at the restaurant."], ["Dave E.", "This is one of my favorite restaurants in the Phoenix-metro area.  Have tried just about everything on the menu and have never been disappointed.  The service is excellent and the food is even better.  The souffles are awesome and a must!"], ["Kelsey M.", "I knew it was going to be a good wedding party when I saw the Vincent's Van Go parked outside my cousin's house. I didn't know anything about Vincent's, having never heard of it, but the cleverness of a Vincent's Van Go and the cute little van tickled my funny bone. The meal consisted of salads and gourmet pizzas being passed around by wait staff. At first we were confused - no real meal? it turned out that the tray-passed pizzas and buffet salads were plentiful enough so that no one would go hungry. they weren't just standard pizzas - BBQ chicken, ratatouille, margherita, sun dried tomato and avocado, and pepperoni. quite a variation, right? they were good! very good. one of the vincent's people said that they made oer 100 pizzas for the evening, fresh right from their catering van. tasty! likewise, the salads were wonderful. the Cesar salad was right up among the best I've ever had - wonderful delicate flavors, nothing was overpowering but all of the garlic, anchovy, Parmesan could be tasted. nicely balanced, fresh lettuce, wonderful croutons in good proportion to the rest of the salad (don't you hate it when the lettuce-to-crout ratio is off?) it was a very nice meal. very satisfying, very enjoyable. I'd like to visit the actual restaurant to try some other menu items. next time!"], ["Charlie G.", "Food's good, but I've always considered Vincent's over-rated & over-priced.There are too many excellent restaurants for me to consider it.  If I want that kinda deal, I'll go to Christo's."]]}