{"Bawarchi Indian Cuisine": [], "Flavors of India": [], "Mayuri Palace": [], "Madras Ananda Bhavan": [["Srikanth K.", "Very very good place for ppl who like vegetarian!! Rava dosa and sambar are my favourates..Lunch will be served along with dosa which eveyone should definitely try:)"], ["T. H.", "Who knows? Maybe we caught them on a bad day. Or maybe on their worst day. Service: Host/server/cashier greeted us and told us to sit wherever we wanted. He then proceeded to sit at a table with (presumably) his friends and focus on his phone for the duration of our entire meal. He finally brought us a warmer-than-room-temperature bottle of water when we were finished with everything. Food: Nothing noteworthy or memorable. 3 soups and a dal dish that had the consistency of a soup, corn masala, a paneer dish, rice, a few desserts for good measure and boom! you have a $10.50 buffet ticket. This was my second visit. The first was a takeout order -- also not very memorable, but decent. I don't think I'll be going back."], ["Jesse G.", "Great food. Owners work hard to keep customers happy."], ["Charada G.", "I had the lunch buffet. Best sambar I've ever had anywhere, including India. The serve yourself masala tea is perfect. No sugar so you can sweeten to your own taste, and perfectly spiced with masala. I love that they don't sugar it because I have my own birch sugar, which has the consistency and taste of sugar but is not run through animal bone ash like regular sugar, so I can adhere to my vegetarian ethics.The potato masala, which I smothered with the dal Tarka, was so good I had to test each individually to see which tasted better.  A dead tie--equally delicious.The coconut chutney was subtle, & mixed with a little curd rice, I found it the perfect complement to the dosa. I went back to the buffet for a few extra mushroom 65 for an excuse to get some more chutney! I tried the curd rice & the chutney individually also, and while they were both excellent, it wasn't until their flavors mingled that an ecstatic explosion happened across my taste buds.Living in Houston, with its plethora of excellent Indian vegetarian restaurants serving our large south Asian population, I am more than a little spoiled by the variety and have come to appreciate and recognize excellence when I taste it. If this restaurant were in Houston, the owners would become wealthy very quickly, while setting a new standard in a town already known and appreciated for its fantastic variety and quality of Indian fare."], ["Nai W.", "Fix your damn website. It says you are open on Mondays which you aren't. Fix your damn website. It says you are open on Mondays which you aren't. Fix your damn website. It says you are open on Mondays which you aren't. Fix your damn website. It says you are open on Mondays which you aren't."], ["Katey H.", "At lunch it's the buffet only. No service. I had lots of questions and nobody to answer them. It might be better after 5pm."], ["Saurav C.", "Went for evening snacks time .. Dosa was good . I tried pav masala dosa.. Chole bhature wasnt worth the price and wasnt tat good"], ["Subodh N.", "The food is average comparatively. South Indian dishes are good, but the North dishes are not up to the mark. Friendly staff and decent place to visit."], ["Dan K.", "Apparently this restaurant has been open for years, and I just now became aware of it.Boy, am I sure glad I am!The food sure is a delight to feast upon!I love that it's all vegetarian. And it's fun for me that it's South Indian, because I'm more familiar with North Indian. Favorites on the buffet today for me are the masala paneer, tomato rice dish, lentil daal, raita, the dosas served at each table, the paper-thin \"crunchy circles\" whose name escapes me (though I'm not sure it was really ever \"captured\" by me!), the mango fruit salad, eggplant dish - and chai, on the buffet just the way I love it!I read some reviews commenting on the bottles of water at each table. To me it may not seem as classy as a nice pitcher of water, with ice. Although, in Phoenix, knowing the water tastes just fine is a bonus.The service was attentive, to me. Although I've seen comments from others suggesting that was not the same for them. Patrons may sit wherever they want. I just happened to sit in the half of the restaurant well-traveled by staff. I was between a curtain-covered door, and the kitchen door. That might be the secret to friendly attention; although I did not notice the level of service people on the other side of the middle divider received.I received warm and friendly service. In fact, I was pleased when the hostess/server offered me a second dosa. She seemed appreciative when I complimented her/them on how great everything is.This is very exciting for me, because I feel I've discovered another excellent Indian buffet near the places I usually frequent. That makes three near North Scottsdale, and one on the West Side.So I'm loving it!The only thing that wasn't great was the atmosphere itself. The floor I walked on was sticky. I noticed on the other side of the half I was dining at, the tables had a glass pane over the table cloth. My table at least did not. It was kind of dingy; not elegant, certainly.That's not a drawback for me. I choose a place based on the food, first, and secondly on the service. Anything else is \"gravy\". So no worries for me.This place is now near the top of my \"Best Indian Buffet\" list!"], ["Nishi S.", "I drove all for 45 mins to come check this place out, and it was closed.  There was a sign that said closed on Mondays. And yelp shows their business hours as open. Very disappointed."], ["Tigra C.", "I love Indian cuisine, and being still fairly new to the valley, I'm trying to find the best places in town for Indian food.  I bought a Groupon for Madras Ananda Bhavan a few months ago and decided to go for dinner last night.As we approached I saw a sign on their front door warning/ advising customers that if they use a Groupon gratuity will be automatically added to their bill.  I found that to be an odd and ostracizing thing to do, but at least they were upfront about it.We arrived before 6pm and it was pretty quiet, with only a few tables present. Nice. I enjoy quiet dining.  The sign said to wait to be seated. We only had to wait a few seconds before we were seated and the menus were brought. I informed them right away that I'd be using a Groupon.  I advised the waiter that I was vegan and inquired about the menu items in which I was interested. He was knowledgeable, helpful, and very friendly (awesome smiles!).We ordered vegetable samosas ($3.50). They were huge and very good. Crunchy & golden on the outside; savory and spicy on the inside. Their tamarind sauce is stronger and more tart than to what I am accustomed, but it was ok.  I prefer the sweeter based tamarind sauces though. I ordered the Gobi Manchurian ($8.99). It was absolutely AMAZING! The cauliflower was so perfectly crisp and that red sauce (not spicy) is so flavorful. Outstanding vegan dish!I ordered plain puri/poori ($2.99 for 2 pieces), which is a light vegan bread.  Plain puri/poori is not on the menu (the menu offers stuffed puris), but just ask for it. It was very good. My dinner mate ordered naan ($2), and the server advised me not to eat it because it contains dairy.  (Good looking out!) She thought her naan was a little too burnt for her liking. Here's where things go badly...My non-vegan dinner mate wanted Aloo Saag, which is not on the menu.  The waiter advised that she could order Saag Paneer ($10.99) and add aloo (potatoes), so that's what she did.  (Note to vegan's who are not familiar with Indian cuisine: saag = spinach, & paneer = cheese, so this is not a vegan dish.  If you'd like a spinach dish, inquire about them making a vegan version, like Aloo Saag with no dairy.) She really enjoyed her dish until.... she noticed a long piece of hair in her spoonful of saag.  Process of elimination: she has very long, naturally curly/wavy hair, so it was definitely not her own hair.  I was sitting across the table and never came near her food, but for s&g let's just add that I have extremely curly hair, so it most certainly was not my hair. I examined it closely to ensure that it wasn't an herb of some sort, but it was indeed a hair follicle.  Despite my OCD-ness screaming on the inside, I was very calm and maintained a smile as I called over the owner and pointed out the snafu. He apologized profusely, promptly took away the tainted food, and brought her a new dish with new naan.Our dishes were served with a small helping of rice. What is up with the instant white rice?? You get @ 2 spoonfuls of this plain and dry rice. Where is the moist, fluffy, herb-infused, flavor-bursting basmati rice?  Very disappointing!Pitchers of water were sitting on each table, even the unoccupied ones. Having a pitcher of water at your table is definitely a plus for me because I drink a lot of water.  However, with that pesky nat (it drove me crazy!) and any other germs flying around, I did not like that the water had just been sitting there for who knows how long (long enough that the ice had melted). And it's a waste of water when you get an OCD customer like myself, who will ask you to bring a fresh pitcher of water with ice in it.  Just bring out the pitcher once the customer arrives. The bill came and there were 0 concessions for the hair situation. Yes, you brought out a new dish. That's expected. No, I did not appear to be angry, but I was livid and disgusted. There was HAIR in my baby's food! Department of Health &/or Public Safety, hello?! I just chose to behave in a civil and professional manner.  Wrong is wrong, and one should not have to rant and rave or throw a hissy fit to be accommodated in such circumstances.  I did not ask, but as a customer service gesture, that dish should've been removed from my bill.  Despite the excellent Gobi Manchurian and puri/ poori, or the friendly smiles, that was a deal-breaker, so sadly, I have no plans to return."], ["Ízandro M.", "This place is amazing! It has become my new favorite Indian restaurant and I love the fact that it is vegetarian. Not my favorite palak, but the paneer butter masala (add potatoes) and the gobi manchurian are PHENOMENAL! Just had the gobi manchurian for the first time this evening and I think I'm in love. It is now my favorite dish! The only thing two things I have noticed about this place is that the rice they provide is not very flavorful or fragrant. Very plain. I also have to request for everything to be extra extra spicy because they tend to make dishes far too mild for my taste. Other than that, it is perfect!"], ["Crit T.", "Food is excellent, but service is PAINFULLY slow...even with me being the only diner present. Also, they did not have rice at the time I ordered because the chef was \"off\". Ummmm. However, the rice was brought out mid meal and I was given extra naan to compensate. It is a great place, very clean, and the servers are very polite. I just am hesitant to come back unless I have time for a leisurely meal. Perhaps they could invest in hiring an extra server to have the overall customer experience a five star?"], ["Donna M.", "Went there for the first time recently, with a carnivore, but we both truly enjoyed the buffet, which was vegetarian. The selection was good and the food was very tasty. The Dosas were really fabulous and I really liked the tea! There was a lentil dish I really enjoyed, I don't recall what it was called (I'm new to Indian cuisine.) I am looking forward to going again."], ["Pawan K.", "Delicious food and awesome service. The people who work there are very nice and friendly. Been there for like 3 times and every time got the same kind of service."], ["Rohit M.", "Had rice idli and sada dosa both were good, sambar and coconut chutney were delicious.Somewhat slow service."], ["Linh L.", "I am so happy they opened in North Phoenix, closer to my home! They recently opened about 1.5 years ago and the food is amazing. I recommend the Gobi Manchurin! I get it ALL THE TIME! The curries are good too. The Indian spices are so yummy and flavorful too. I have to mention that I am \"VEGAN\", because some dishes have milk or dairy. So, they customize it for me a little, which is nice. The only small thing I would say is that there is a server that never smiles and hard to approach.  The flip side is that there is another server that is super nice and we always hope he will be our server. Another small thing that bothers me is that all their appetizers are deep-fried, so I usually don't get them. I wish they had some more fresh choices. The pricing is pretty good too. I highly recommend this location if you are looking for tasty traditional Indian Food. I am a fan and will be going again."], ["B L.", "I saw this place and wanted to take my partner there, we both try to eat vegetarian as much as possible. Showing up on a weekday morning at 11am in order to get the freshest off the buffet, we were NON-greeted by the host talking on the phone. He talked on the phone at least a good 6 minutes before coming to seat us. We never saw him again.But we give it four stars because the food was well worth it. It was delicious, fresh and 100% vegetarian with vegan choices as well. The paneer was FABulous! We will be returning but whoever that rude man is needs to find another job...the DMV comes to mind."], ["Tia H.", "Horrible service. The people who work there are just very rude.There is stale water sitting on the tables, it is not iced down and they don't seem to re-fill any of them when they run out.The food is very bland and that is saying a lot because I ordered a curry."], ["Priyanka B.", "Went to this place with high expectations as we got to taste some good food on our previous visit . This time we ordered veg briyani, the rice was too dry and didn't taste fresh, then we odered rava onion masala dosa , dosa itself was good but sambar tasted odd , so we called up the waitress and asked . we were surprised to hear her say that no one else has complained.after this incident we decided not to come here again."]], "Pastries N Chaat": [["Sean S.", "This is nice place, it's a corner shop for some Indian snacks, pastry and sweets. Like it, it is small but good food. Price is reasonable"], ["Munit M.", "This place is bad! 2 piece samosa chaat is 6.99 + tax. The pani puri is all pani, there was one piece of potato in each one the size of a dime. If you are new to Indian food, I guess you could try this place. But for those of us with a more refined Indian palate, food is tasteless and expensive."], ["Natasha L.", "My daughter and I were in the area after an appointment. We checked out Yelp to see what was nearby and this popped up.   Sometimes it's a risk listening to the reviews of fellow Yelpers. Not this time!  Pastries and Chaat is a tiny little place tucked in a strip mall. Walking in, you are greeted by a clean, minimally decorated dining area. The pastry display is like a slice of heaven! A wide array of cakes and mousses are beautifully displayed.   My daughter ordered the chicken tikka pizza. It was unexpectedly delicious! I ordered the samosa chaat. It was very tasty. I'm normally not a big fan of chutney, but the spices were spot on and the yogurt sauce helped cut the tang of the green chutney down a bit. The chickpeas were plentiful.     We decided to try some dessert. Oh. My. Gosh! I wanted to just bury my face in the slice of cake I ordered.   The next time we're in the area we plan on stopping in and trying more of their chaat selections as well as their amazing sweets!"], ["Abhi P.", "Okay so this is the only place that has the real Indian taste to it Very clean and excellent dining area To make it short only Indian place that's worth going"], ["X X.", "Great food, I tried many things and that all had decent flavor with the right consistency.... Only thing that sucks is the service and wait times between how your meals come out... They hardly ever come out together and you'll wait forever... Go if you have time... The foods worth a try."], ["Sam S.", "worst Indian food , I ordered samosa and Biryani , both were super spicy and the whole restaurant was crowded and smelly. The place is so small  you can barely walk between the chairs. Waste of money don't go there."], ["Nidah C.", "My first visit won't be my last because that's how impressed I am with this new business. They have redefined freshness while offering a variety of popular Indian street food and desserts. It's the next \"NEW THING\" and everyone must try. I wish your team the very best AND see you soon!"], ["Anoop N.", "Having been to a few places where they supposedly serve  Indian delicacies in and around Phoenix, Scottsdale and Tempe, I had lost all hope that I'd be able to have good Indian snacks and chats in AZ. Until I walked into Pastries N Chaat that is...A friend took me there after one work one evening. I was circumspect because I did not want to be disappointed yet again. However, as I walked in, I could sense something positively different about this place. It had a pleasant, uncluttered, calm and soothing ambiance. They give you a slip where you can mark your order and take a seat. We ordered papdi chat, dahi batata puri, egg puffs, samosas and chai. The presentation of the food was excellent. The chats were fabulous with most of the flavors growing on you after every bite. The chai had great consistency and the samosas were hot and crispy too. The puffs had carrot in its filling which I personally did not like, but that wasn't really a put off. The price is pretty reasonable for the quantities that the serve. Mostly in the $3.00-$4.50 range. They have take outs too.The service was excellent, the people were very courteous, friendly and polite. They have English pastries for those who'd like a bit of both. On the whole, I can't recommend this place enough. I'm sure to make many more visits."], ["R R.", "i went  again and i ordered pav bhaji and  biriyani was amazing taste.and the pineapple pastry also mind blowing.keep it up ."], ["Karthik R.", "We stayed over with our kids and four of their friends for the July 4th weekend when their parents were off to LA. Stumbled upon this small Chaat place for a evening bite when driving on Bell rd. First thing caught our kids attention was their caption \"Match Made in India\".  The inside is so much more inviting than any Indian Chaat place in Phoenix, Service is very good but a little stuffy. Highly  recommended for their Chicken Tikka pizza, Egg puffs and their Kali Miri Sabji & Chicken Karahi special with paratha... On a side-note my wife does catering from home, and knowing the costs and quality- not sure how this place is providing this good quality food with so cheap prices Kudos. Will visit again with my friends."], ["Ravi R.", "Average food joint with average food. Ordered twice from here and I didn't find anything special to go gaga about. The pastries are good... Combo meal chicken curry is something from out of space and wasn't that good. Rice and roti in combo were ok and kind of revived my taste buds a bit. Chicken puff is good, but a bit expensive @ 2.99 a piece! Chaat - vada pav (good) but no sauce or anything was provided, pav bhaji - the curry was not that tasty .. A bit bland. Pizza - chilling chicken pizza - I was kind of expecting Indian style chilli chicken, but it was different with a ton of American greasy cheese and a hint of green chilli sauce as a base with capsicum and cucumbers I think. It had good amount of chicken pieces though! Needs to improve taste in the food items and less greasy cheese please."], ["Chetna M.", "This is a newly opened shop around bell road area.I am from India so I usually expect a lot when it comes to authenticity,however this place has some nack for giving you a snacks flairs of India.Things which I liked are Vada pav,Samosa.They can improve on their Veg Puff and veg Biryani.Chai needs to be instructed the way one wants otherwise one usally gets it with loads of milk and less boiled."], ["Arun M.", "This is an amazing place for an evening tea and snacks... My and my better half come here quite often, almost every week... Its a fun little place and the guys there are very customer friendly.. Not to mention, the place is very clean n tidy... OK now coming to the food, the chaats are delicious, helps us from missing home too much... Good tea and vada paav... Pastries are indian style which you cannot find anywhere else in phoenix...Summary for the lazy to read - good place, nice food."], ["Umesh M.", "Went this afternoon with family. Place is still new and they still seem to be figuring out the operational stuff in the meanwhile expect quite a bit of chaos,  possibly spoilt food and confusing serviceWe ordered Paav bhaaji, sev puri and paani puri.  Paav bhaaji was ok and paani puri potatoes were spoilt. Ok, have to leave now.  The fire alarm just went off accidentally and chaos rules. In the meanwhile i get 10% off as an apology for the rotten potatoes in the paani puri. Doubt this place will be around in 6 months and will not miss it either."], ["Priya R.", "Good place for some snacks and a light dinner. You get the Indian kind of pastries and also a couple of Indian sodas. Egg puffs are the best. Chai came in a huge cup would have probably enjoyed it better if the quantity was less ."], ["Sonila K.", "I have been here 3 times.First time the Pav Bhaaji was really good. But second time it was too hot and spicy. The pastries were good both the times.I also tried the chicken burger... somehow the combination of mint chutney with lettuce isnt that great in the burger. I would say get rid of either the mint chutney or the lettuce in the burgers. But overall the burgers tasted very good... I also had lunch here once and it was okay.Overall... I feel the place is good but they need to be more consistent."], ["Robert H.", "Great food and staff. I highly recommend this place. The staff was very nice and friendly. I will definitely be coming back."], ["John R.", "Ordered an array of chaat and a pizza to share. Had a chocolate croissant and samples of cake. Don't be afraid to just order. Only complaint is I need a translation to know what I am ordering but with everything tastes so good it really doesn't matter."], ["Lia T.", "Just had a wonderful lunch here. Ordered the samoas chaat and the vindaloo curry special.  Both were excellent,  full of flavor!  Vindaloo was spicy like we like it but owner was nice enough to warn us if we were not spicy people. Our boys were acting up while waiting for the food and they brought us little pieces of cake to help occupy them. I appreciated that greatly. We ordered a chicken tikki pizza for the kids and we both loved it. Prices are right and it's the perfect fit for when I'm craving indian food. A neighborhood gem."], ["A H.", "Well decorated and clean self serve restaurant. We filled out a card with our order and handed it in and found a table to sit at. The people who work here are polite and efficient. The chaat is the best I have had in Arizona in a very long time.We had: Irani Samosas - NiceDahi Batata Puri - Amazing! The yogurt is creamy, the puris are crunchy and fresh and the chtunies have the perfect flavor.House Special #3 - Very nice. The Kheema was flavorful, the puris were just right and not greasyPineapple pastry - Very nice. Moist and just the right level of sweetness.We are planning on coming here often."]], "India Oven": [], "Chennai Chettinaad Palace": [], "Indian Delhi Palace": [["Allen V.", "The worst service ever :( They messed up our food and we complained we go yield at. I will take my money some were else. There are plenty of Indian restaurants in the valley, and you just lost a customer :("], ["Starla L.", "We were here for their lunch buffet. The chicken tendori? was very tender. Coconut dessert was good. Everything was bit too salty."], ["K R.", "AWESOME...! The place was clean Food was greatGood selection of foodService was friendlyBathrooms were cleanIt doesn't get much better than this"], ["Tyger L.", "One word... CHICKEN TIKKA MASALA!Ok...it's one word if you say it like I do. I like to say it fast so I can hurry up and get past the ordering part and on to the eating part.This place is awesome. I ordered samosas, garlic naan, mixed grill (tandoori oven cooked variety of meats) and chickentikkamasala *giggle*. The mixed grill was good, but the naan and the masala was the highlight. I had to slap the hubby's hands to keep him from eating the whole thing...ok...by 'slap' I mean I may or may not have skewered his fingers with the fork, pinned them to the table and gleefully devoured the tender saucy piece of chicken as he sniffled something about needing an ambulance...we're so playful. DISCLAIMER: *No hubbies were actually harmed or manhandled before, during, or after the consumption of the delicious items procured from I.D.P. The improvised narrative describing the dinner-eating portion is fictional...the tastiness of the items we ordered is factual."], ["Joshua J.", "Stopped in for lunch on a weekday.  Service was excellent in giving advice on what is popular and what we might enjoy, they were spot on. Food was delicious and timely. I'll gladly be going back."], ["Matthew M.", "Yes I would say this place is good. Service a little slow maybe but the quality of the food was very good. Nice atmosphere."], ["Bhumi T.", "Awesome vegetarian food here. We tried shahi paneer and dum aloo . Both were awesome and naan was fantastic!!.though mango lassi was disappointing!!!"], ["Carl d.", "Needed a spot close to the airport. After reading reviews was skeptical but since we were going early gave it a shot. The food was fabulous and the big shocker was the service was excellent! Many reviews found the service horrible. We were very happy with our meal here and would return."], ["Daniel G.", "I've been here twice on trips to Scottsdale and the food is pretty good, but the service is terrible! The waitstaff is not attentive or helpful in the slightest! For the price, I would expect better service. The lunch buffet is better than dinner because you don't have to rely in the waitstaff.They seem to have a fly problem, flies kept landing on my food, my face, and one got stuck in my water.If you've got endless time to wait for you food and can handle a waitstaff that acts like they have better things to do, then this is the spot for you!Otherwise, go elsewhere."], ["Robert H.", "The food is delicious, but the prices are WAY TOO HIGH for the small portion sizes. I feel robbed when I spend $50 on dinner for two people and probably $7 of that was their actual food cost, if that. Look at it this way... for $10 you get their lunch buffet that has naan, rice and an assortment of foods (all you can eat). But when you order food to go, they charge for every single item... $10 for each entry, $2.5 for naan, $3 for rice, etc. It adds up quick and all of that is at cheap cost for them, so their margins are huge! It's a ripoff, but the food is -like I said- delicious."], ["Russ T.", "Great food. Great service. Give it a shot!"], ["Preeti M.", "As I'm crusin' from PHX airport to my hotel, I randomly see a sign for this Indian restaurant and immediately hit the brakes and make a U-turn to stop in for lunch!  I had my doubts, really I did.  I don't ever do Indian buffets because its guaranteed to disappoint me so I opted for the regular menu.  Delicious shrimp madras is what I got (extra spicy) and garlic naan...yummy, yum, YUM!"], ["Jennifer S.", "Food is still good, but their service is pretty bad.  Our waiter kept on making bad faces at us ever since my friend ordered something to go and the waiter thought she wanted it in addition to her buffet ( weird right?) Then the manager and waiter tried to hurry us out and made us pay when we were still eating and when the place wasn't full. It was very rude!  I don't know if they changed managers, but you can tell it was no longer a happy and friendly place at this restaurant based on all the worker's faces."], ["Cathryn H.", "B day party here Sunday buffet and they really tended to our table. We never had to wait for refills or naan they kept our table clear. The food is the best in town and I'll be back soon."], ["Susan S.", "I'm not a huge fan of Indian food, but I do believe that's because I was probably eating at bad places. This place has converted me! I had the Lamb Korma and my hubby had the Butter Chicken. Everything was very flavorful! The establishment is very clean and very authentic. Our service lacked, slow and didn't ask us for drinks etc, but they were very friendly regardless. We will definitely be going back to try more!"], ["Brinda J.", "While leaving Scottsdale to drive home, the hubby and I found this place randomly without me Yelping. (Which I never do now that Yelp and I have such a deep and intimate relationship.) But lo and behold, it wasn't so bad! It wasn't the best or varied Indian lunch buffet ever, but the food was right on, the veggies were good, the mango lassi was yummy, and the naan was spot on. My only  complaint was that I was cold the whole time. But that was probably just me. Good place for a lunch buffet here in Phoenix."], ["Harish B.", "Based on the reviews went here for Lunch, they had Buffet with one Meat and 3-4 vegetarian dishes for around $10. Tried palak paneer but the paneer(cheese) itself  was missing the dish, it was like having chicken curry without chicken. Long story short the food lacked the taste that you find in good Indian cuisine..."], ["Ara M.", "Cockroach on table (and a neighboring table). Lamb super mealy. Wine bottle \"opened\" in back and then brought to table with cork from another bottle. No apologies. Just arguments. You've been warned."], ["Hardeep J.", "Amazing food and even better service. Also has a great atmosphere where they take good care of you and do not rush you. Really nice place to sit down and have a great meal."], ["Jonathan K.", "I believe this is probably the best Indian food in the valley."]], "Marigold Maison- Paradise Valley": [["Jovanka G.", "I wanted to give it 4 stars because they got rid of my favorite Macedonian wine on their wine list, but I am not that type of a person, this place is legit.Great food and atmosphere, came down here on a Wednesday night around 7-8PM and it was packed. We shared a couple of aps and some small plates, they were all really good. You won't make a mistake by choosing whatever from the menu."], ["Roxy H.", "I am a sucker for some good Indian food.... well really, any kind of ethnic food! I have always heard some amazing things about Marigold Maison and when I finally had the opportunity to try this place I knew I had to go!A few must trys! Their Samosa Chaat - which is a samosa with chickpea, onion, tomato, mint, yogurt, & tamarind. It's delicious and almost a deconstructed Samosa! The chicken tikka was delicious, as was their lamb Goan Vindaloo, made with wine, red chilis, curry leaves, and mustard seeds! Their naan was a knock out as well!Highly recommend Marigold Maison"], ["Priyanka B.", "We ordered masala dosa and vegetable thali both were not good . 1.dosa was not crispy and potato curry inside dosa was too dry .Coconut chutney was not fresh and not tasty at all and sambar was ok.2.vegetable thali - naan was not fresh and chole dint taste like indian curry , dal was bad."], ["Jackie B.", "I had high hopes for Marigold Maison.  First, they are on Open Table which is always a plus for getting reservations.  We came in on a weeknight and the place was busy which is also a great sign.  That being said, the food fell below expectations.  Everything was OK, but just OK.  The prices seemed a little steep - $50+ for two people (no alcohol) seems pricey for a weeknight meal!"], ["Gayl B.", "The best Indian food, hands down, anywhere. It is important to have reservations, which we had. There was an Indian couple sitting at the table next to us, and even though I have had Indian food in London, where it is the national dish, we watched what they were eating and at least for one dish, we said \"we'll have what that is.\" Good thing because as we were leaving, we found out that the place is their \"family restaurant.\" I would venture to guess that translates as they owned the place.Like spicy? The lamb vindaloo was three alarm in my mouth and very good. Glad we had a couple of orders of naan to cool off. Don't drink water with a mouth fire, tap it down with naan! I also had spoonfuls of some other great dishes and tried to get close to the names on my photos. Next time, I am definitely taking a photo of the menu.I also had a few bites of two of the desserts, the mango kulfi and the kala jamun, which also cooled down my mouth and were excellent."], ["John G.", "Wow!  This place  (was Bombay Spice) has pivoted twice (and moved once) from an Indian Fusion concept to an Indian Chipotle concept to just a darned good Indian restaurant.That's the history, but all that matters is the present.  Really great food.  Good service.  Real Tandoor oven.  Start with samosas, then get the lamb vindaloo and an order of naan.  You'll be a happy camper (and you'll have enough to take home for lunch tomorrow - but get another order of naan to take home!)There's a really good 'sampler' on the lunch menu, give that a go sometime, too!"], ["Jim K.", "I have to tell you from the moment I walked in the smell was just amazing and I could not wait to taste the food. Bathrooms were family style and very clean.Our waitress was very nice! She got the water no ice rught the first try and the water was filtered and cold, perfect for a hot day.  We ordered the Hyderabad and Tikka Masada and they were the perfect temperature, spice and we're very tasty.Overall one of the best dinner adventures we have had. Stop what your doing and makes reservations if you want to impress your someone with a great meal for a great price."], ["John B.", "Not far off perfection!A meal fit for a king and all his minions.For starters:Masala dosaSamosa chaatMain course:Lamb vindalooChicken biryani hyderabadiChaat masalaNaanFor dessert:Kala JamunMango kulfiEvery dish was perfect.Could the lamb vindaloo have been a little hotter? Well, maybe if you are used to a really spicy dish. However, if you are just a recreational Indian food eater, then it was just right.The waiter was attentive and reacted speedily to every one of our requests. Awesome job, dude.The people at the next table were really helpful, allowing us to ask about the dishes they had ordered. Little did we know that they were relatives of the owner. Lucky us!The meal we ate here was a resounding success. We will definitely return."], ["Greg W.", "Love this place. You don't expect to the get authentic, quality Indian food in Phoenix but this place pulls it off.First of all the service was impeccable. Our server gave us excellent and honest suggestions on which items to order and how to structure our dinner (some street food options to start then sauced and tandoori entrees to follow). He was knowledgable about the menu and extremely attentive. All of our questions were answered and our water glasses remained filled. I recently traveled to South India and I haven't seen Dosa done so true to the authentic way. The coconut chutney was exactly like I had it in India and the Dosa itself was perfectly cooked. I rarely have good shrimp so I was skeptical of the Tandoor shrimp but I was totally wrong. It was tender and teeming with flavor. This is the \"must-get\" item on the menu (another server admitted he eats it every night) We also ordered the Punjabi Bharta (a great vegetarian option) and the eggplant had a perfect smoky flavor to it. The Goan Vindaloo was spicy and very tasty.This place is awesome and we will certainly be back to explore the rest of the menu."], ["Life Z.", "Went for dinner and ordered idli & samosa- they served 2 small sized frozen idli & samosa not even completed heated!! Feels like an over prized place for under quality food. Very very bad quality. Never going to come back here at all."], ["Dwayne O.", "Decided to try this restaurant mainly because of the Yelp reviews and it did not disappoint. Our server - David was excellent,  he recommended and told us what were the popular dishes since this was our first time having Indian Food. We started with the Masala Dosa, a potato and onion crepe which looked like a huge burrito which came with 2 different sauces which was exceptional. Also got the Gol  Guppa which was a whole wheat puff that you break a hole to stuff which was fun and tasty. We ordered the following entrees - Lamb Chops, Tandoori Salmon and Classic Curry Chicken which all were excellent. We tried the Garlic Naan and the Hot Chai Tea.We were asked about dessert but we were so stuffed we could not eat another bite.Was a great new adventure and everything was perfect. Will recommend this restaurant and also be back."], ["Mindy M.", "Great vegetarian selection. This place asked if me and my friend had a reservation... It gets pretty packed. It's a swanky restaurant with amazing food!"], ["Nicole H.", "Absolutely incredible Indian food.  Definitely recommend the masala dosa, which is slightly cooler than most of the other spicy food and is good to have around to temper your mouth-fire.  We also had the samosa chaat, lamb vindaloo (FIRE!!!), chicken biryani hyderabadi, and chaat masala.  Make sure you order naan - you'll need it to sop up the awesome curry sauces and to put on your burning tongue like an ice-pack.  For dessert, we had the kala jamun and mango kulfi, both of which were icy in sensation and great after the burning meal.  Song of Fire and Ice, anyone?They also serve cocktails, which will shore up your courage and make it so you're slightly less apprehensive about eating what you know is going to be authentic Indian spiciness.I'm not even sure of the ingredients of half of what we ate, but it was all delicious, and we devoured it.  I recommend coming here with friends as you can order family-style and try even more dishes. This is now one of my favorite restaurants in Phoenix.  We'll definitely return!"], ["Angie M.", "So happy I tried his place. I now pick up dinner Togo every weekend. Every item I try is so full of flavor, and cooked to perfection. My favorite item is the Chicken Saag."], ["Donna B.", "I got some takeout there last weekend. Chicken tikka masala, garlic naan,  and it came with rice. I was happy enough with the chicken tikka masala and the naan, but It wasn't amazing, and I found the rice to be a bit dry and not particularly great. If I could give them 3 1/2 stars I think that would be more accurate. I did not have a five star experience, and I am confused why it is rated so highly. It looked like a cute place, but I prefer others."], ["Jen R.", "Came here for dinner the other night, and will most definitely return again! It was a Tuesday night and the place was packed...that's always a good sign! We could smell the delicious food as soon as we got out of the car. We had the lamb vindaloo and it was perfect. They also sell their own hot sauce for $6 a bottle.Very clean, very friendly staff, great food!"], ["Deepak S.", "I wonder what the hype about this place is. To sum it up - There are far better restaurants serving much more \"authentic Indian\", not worth your money and travel time, especially if your driving up from the South.Now a bit more deeper into what a family of four  ordered here -A Veg Platter  , Lamb Platter and Chicken Platter - it was a lunch special (so much for the special-ness )Platter all combined -The Bad :1)The Platter had a standard Yellow Dal - which was Bland utterly Bland.2)The Paneer was overcooked in the saag paneer,3)The Chicken Masala was Sweet - soo much for the masala4)The Cold Jeer Rice served with it5) The Priceand the quantity - @14$ per platter you are better off having a sumptuous buffet at some decent Indian Restaurant and eating to your fill rather than being limited by their sub-par quality of foodThe good :1) The Lamb vindaloo was the only highlight2) The Jamoon had a good texture and was well doneThe Ugly :SERVICE - the Server we had was possibly the worst we have encountered ever , we had to keep mentioning everything twice and keep reminding him we had an order we placed.Here you are \"required\" to tip even if you had a bad service experience, well we did. Can you believe he had the audacity to come up and say he cant accept such a Low tip (which could have been better off had it been a ZERO) ?Bravo !!And yeah, they serve you Half a Naan in the platter - soo much for cost cutting!Ambiance:     2.0/5Food taste:    2.0/5 Service:         0.0/5Price:             2.0/5Overall:          1.0/5This place stands as a testimony of mocking Indian Food by all standardsSub Par non-authentic Food, unmetered prices and topped with horrendous Service - welcome to MariGoldAVOID IT!!"], ["Jonathan L.", "Still serving delicious Indian food at a good price. Try the combo lunch platter for a taste of many great selections."], ["LA D.", "From the second I walked in the door I was amazed at the service and atmosphere. The manager was so kind and helpful with making sure we were having a great experience. Our waitress was very sweet. The place smelt incredible and normally I can't eat in an Indian restaurant best of the smells being so strong. The food- If your looking for the perfect family style night out this is the place. We tried three different chicken dishes and all were beyond any Indian food I've ever had. The spices tasted fresh and full of the perfect flavor. It was honestly hard to stop eating because the portion sizes are large.Cocktails- whom ever their bar tender is they make one amazing martini!  Will be returning here again!"], ["Karen S.", "Yes! I'm giving this 5 stars and here's why....Exceptional Service, Great Tasting Food, and Nice Atmosphere.  Just to show you how exceptional our service was, I've numbered every time someone attended to us during our time there.My husband and I went here for our 15th wedding anniversary.  We always go to an Indian restaurant for our anniversary.  We usually have Indian food at an all-vegetarian Indian restaurant in Phoenix, but the food quality has become very inconsistent over the past year. So we searched online for a new restaurant and found Marigold Maison.  We were greeted immediately by (1) Mirnes Mehic, Director of Marketing, as soon as we walked in the door.  I know his name because he stopped by our table and chatted with us after our meal, talking about the restaurant, the chef, the food. He gave us his card.  We were in a corner table which was very cozy even though just about every table was filled.  The décor is lovely.  Shortly after we were seated another (2) gentleman came over to let us know that our waitress would be with us soon but he could get our drinks.  Our (3) waitress soon arrived, was very friendly and took our order.  Before we really noticed that our food seemed to be taking a little longer than would be expected, our waitress came to tell us it would be out soon and placed a basket of complimentary papadums on the table.We are vegetarians so we had: Dal Makhani, Saag Paneer, Masala Dosa, Garlic Naan, and Mango Lassi.   The food was excellent!!  Saag Paneer was some of the best we've had.  Masala Dosa was LOADED with potato, Dal Makhani was very flavorful, and the Garlic Naan was fantastic.  We had the leftover Dal and Saag the next day and it was even tastier.   A little warning, the hot sauce that's on the tables is not for the faint of heart. HOT, HOT but very flavorful and you can buy a bottle to take home.During our meal a (4) gentleman came over the refill our drinks and take away any used dishes.  Another (5) lady came over later to remove any more dishes we were finished with.  Our waitress stopped by often to check on us.  Mirnes Mehic stopped by the table and spoke with us.  He stopped by again later to present us with a complementary Mango Kulfi for our anniversary!  As if we hadn't already received enough excellent service, (6) The Chef stopped by our table!  He talked about the ingredients he puts in the foods like olive oil, as well as those he leaves out like ghee, heavy cream, and cashew giving the food a less 'heavy' feeling on the body.Great Experience and Great Food to be had at Marigold Maison!"], ["Monica A.", "I would love for this place to be a go-to Indian place for me, but unfortunately I have to pass. I really, really love the idea and I love its intimate size, but it just seems to be a little too impressed with itself.Firstly, the prices are too high. I know you're doing \"something new and funsion-y\" with Indian food, but please. $20 for a dish just because it has fish? It certainly doesn't warrant that, nor do the other dishes whose prices increase as you add meat selections like chicken, etc.The last time I was here my husband and I ordered an eggplant dish and the chicken tikka masala.I must say the chicken tikka sauce's flavor was OUTSTANDING. Definitely the best I've tasted - very robust and wonderful. The eggplant however, was terribly overpowered by chipotle. Yuck. I've not had those two paired together and I think there's a reason for that. Eggplant is so delicate and its flavor is best supported by the herbs and spices in the dish so its butteriness can be savored - not drowned out by an overly bold spice. Not a well constructed dish at all.Also, both dishes were supposed to be mildly spiced. Our server asked for the spice level, we told her mild (husband doesn't do well with too much spice), and the food came out *at least* medium spiced or hotter. The eggplant was so spicy we had to send it back. My guess is that the chipotle had a lot to do with that, as its inherent heat certainly added to the additional spice used to give the spice gradient to the dishes. Again - chipotle - BAD IDEA.The service that night also was not up to par and certainly didn't support the $46 bill we had at the end. The server *meandered* over to our table after we'd been sitting there for a little too long and kind of looked at us askance WAITING for us to tell her what we wanted. Like she couldn't be bothered too much to let more than just a few words out of her mouth. It was very strange. And the restaurant was NOT busy; no one was in the weeds.All in all, I'm not really impressed enough to make this a regular place. For the prices I expect excellent professional service, well-crafted dishes, and chefs that understand mild, medium, and hot as it relates to Indian food."], ["Hydro W.", "I can't believe I haven't left a review yet. This place is LEGIT! Best Indian food in Arizona. Usually Indian kitchens are not the cleanest and some concern what's going on \"back there\". These guys have an open kitchen so you can see your food being prepared.The food is always fresh and so flavorful. Usually Indian food doesn't sit well with my stomach but this food I can all the time. We eat marigolds on average at least once or twice a week for lunch. So sad we are moving away since we will miss Marigolds. Super friendly staff and a very organized restaurant operation they are running here."], ["Olivia K.", "Marigold Maison is a very good Indian Cuisine restaurant. The service is great, and the food is really good. They have many types of different naan( the Indian flatbread ), and they have many different kinds of spices. The one thing I would recommend is to make a reservation. Can get packed very quickly sometimes."], ["Casey K.", "The lentil cakes are BOMBBB!!! This place is delish, and now we foUnd one more thing that we love. We order out and eat leftovers for a couple nights- samosas (yum!), korma, saag, naan, raiita  and I love how they put a couple peas on the rice as a garnish. When calling in our order, the connection was a bit difficult because of the loudness in restaurant, but all good!"], ["Spoiled K.", "This place really surpassed our expectations. We had been wanting to stop by, and I'm so happy we finally did. We were greeted really fast and very friendly as soon as we walked in, and we got our choice to sit anywhere that was available. I'm thinking the manager or maybe even owner is the one who greeted us and seated us. He was really nice. It was pretty full. We went on a Tuesday evening, and they offer a couples' special for 69.00. The prices are decent, and the food is beyond delicious! The menu has a lot of options, and is very complete; from appetizers, entrees, sides, drinks, cocktails, and desserts. Everything was better than we expected! We really wanted to try a dessert, but we were stuffed.Our waitress was really good! She was nice, gave us recommendations, and checked on us just the right amount of time. The overall experience was superb. Can't wait to go back. Glad this authentic Indian Cuisine little gem exists in my neighborhood!"], ["Precious J.", "I'm a New Yorker and I loved the food here!  Very delicious.  Service was amazing.  The tandoori chicken was superb!  My son couldn't hang with his vindaloo veggie dish because it was too spicy for his taste however, they did warn him .  We will be back when visiting Arizona!"], ["Tim S.", "I learned about this place when they offered a \"lunch only\" Groupon.  When I looked them up I realized they were located at the same address Bombay Spice had recently relocated to in 2014, which means Bombay didn't even last a year.  I went there for lunch yesterday.  Both the waiter and General Manager were very nice and answered several questions.  I learned that Marigold is owned by the same corporation (JNK Concepts) that owned Bombay.  They have the same chef, but completely different food, menu and pricing.  JNK has multiple restaurants primarily in Phoenix and Chicago.  They also own Roka Akor and Nobuo here in the Phoenix area and still have one Bombay Spice in downtown Chicago.The restaurant has been upgraded slightly.  You no longer order your food at the counter; they have wait staff.  The prices are considerably higher.I told both the waiter and GM that I'd not been there before and wanted to be impressed, so asked them what they would suggest, indicating that I was thinking of ordering one of their Thali dishes.  They recommended that I try one of two other dishes which weren't on the lunch menu, but their dinner menu.  I seldom order Dosa because they are usually vegetarian, which I'm not, but I decided to give it a try.  In addition, I specifically wanted to taste their Naan.There Dosa is called \"Masala Dosa\" which is a crepe filled with potato and onion.  It is served with two sides; Coconut Chutney (the larger bowl) and Sambar.  The crepe looked massive on the plate when it was served, however half of it was filled - the rest was just empty crepe.  The Coconut Chutney was very good, but I wished it had been spicier and there had been more of it.  The filling was OK, but not terrific, however you have to keep in mind, I'm not a vegetarian.  There was very little spice, and in my opinion, taste, in the filling.  There Naan bread was very good, but not the best I've had at some nearby Indian restaurants.Their service was excellent and the GM was very helpful.  I left with mixed emotions.  The food was good, but I was not as blown away as others appear to be.  I'm sure they use good ingredients and it was well prepared, but to me lacked the kick and taste I would have preferred.  The killer was their prices; considerably higher than most Indian restaurants.  This Dosa and Naan came to $14.  I'm not a big eater, but the Dosa without the Naan would not have filled me.  Without a coupon I wouldn't go back and pay $14 for what I had.  It probably isn't fair to compare their prices with other places because they claim their meat and fish are a far better quality, and I haven't tried them, but I frequently get either a meat or seafood masala/curry, and Marigold's prices are 25-70% more.  Without additional coupons it is unlikely I'd return, based on price alone.  Their food to me wasn't \"that\" special.I'm giving them a 3-star overall, but believe their food probably deserves a 4-star, although not for me based on what I had."], ["Greg G.", "WOWZERS! I'm always cautious of Indian Food but this place is LEGIT! Great clean and fresh flavors. Everything is bursting with a complex flavor that makes it fun to eat. Go here!Eat the food!Be amazed!"], ["Sagar K.", "I went to this restaurant today with my colleagues at office. I liked the vegetable thali, it was delicious. Moreover I got the authentic Indian taste in daal; something I had been longing for since I came to U.S. With food being excellent and service being good, I felt the price is higher..All went well until I was in for a ride shock- gratuity! Yes they collect gratuity for large groups and they didn't mention it in the beginning..I was disappointed with this. Won't rule out visiting again but definitely not in a large group."], ["Gena M.", "Wonderful food, excellent service, a real treat if you are fond of Indian food.  The staff is very good about making sure that you are clear on the different levels of \"hot curry.\"  The lunch \"sampler\" is really good and gives one a great idea of the variety of this cuisine.  A definte \"keeper\""], ["Amber M.", "It was pretty busy for a late lunch on a Monday. I absolutely loved the food - when I heard same ownership as Roka, I knew we had to check it out, as Roka was always a favorite of mine when I lived I'm AZ. Don't expect anything like Roka though! This is a totally different concept, in the side of a strip mall, and much more casual.I went with my bf and his family, we tried just about everything we could from a couple of the street food options to the lunch platter with chicken tikka and another chicken with a spinach curry (thali's?).  The chickpea dip with potatoes was super good and unique, the sauteed rice with vegetables and curry was fantastic as was the garlic naan.  I loved the quinoa salad on the lunch platter, it was a lot of food and fun to share between four of us. The chickpea flour battered chicken was a good option for very picky kids - although we loved the spicier options! Our server was good about describing the preparations and we asked him to ask the chef to order for us (a good way to get to try the best items I think). We ended up with four dishes that I had never had before and I loved them all!  If I were local, I would def make it a fun lunch or date night spot."], ["Suzan I.", "I work across the at so I've been here many times for take out, tonight we decided to dine in for a date night and it was absolutely HORRIBLE!! The food is great, except I wouldn't order the chicken tandoori, not the usual and was on the dry side. Customer service sucked. No greeting, no water, no salt, no checking in to see how anything was, no sorry for the delay, nothing. I had to go inside and ask for a box and the check because they were taking so long, everything all together was just a disappointment tonight. Chicken Tikka is good here though. Stick to takeout."], ["Taylor A.", "Marigold Maison has anchored me down with this amazing Indian cuisine. I started out my dinning experience with a robust red wine called liberated and a delicious seared eggplant. It paired really well together. I was pleasantly surprised with the knowledge and service Abraham gave me, introducing me to the delicious tandoori chicken. I ordered a side of mixed veggies as well. Abraham recommended that I get a garlic naan which was very tasty. Two other lady servers were also very attentive as well. I think their names were Gena and Amber. The manager Steve stopped by my table and checked on me, too. A very nice touch! Could not be more excited to have this Indian restaurant in my neighborhood!"], ["Juliana K.", "If you're looking for good Indian food that cooked with soul, this is the place to go. Everything about our experience here tonight was fabulous. We ordered the Lamb chops and a Chicken Saag Spinach. A great combo to share with two. They provided a complimentary papadum basket for a apparently standard 15 min wait to make the chops. The mint chutney was delicious, and who am I to complain about complimentary papadum?The chef also went out of his way to make an off-the-menu-dish when I described a particular roti I have eaten elsewhere in the past. This was spectacular - even better than the naan I'd say and perfect for eating with the saag spinach. Our waitress, Gena, was very friendly and helpful to select our dishes. The rest of the staff was courteous and attentive. I'm really glad to find this gem in my neighborhood. The waitress spoke the absolutely truth when we initially arrived and discovered it was our first visit to the restaurant, saying \"You will definitely come back again\"."], ["Saurav C.", "Went today for lunch with wife .. I always love the thali here, but in chicken thali today the daal wasnt well prepared.. Took chicken biriyani and was dissapointed wth it as it was not at all close to authentic hyderbad chicken biriyani.. But still i willl say tey serve the best thali in phoenix"], ["Glenda E.", "Food was great, portions were larger than I expected!! Overall very pleased and would definitely go back! My only complaints was the looooong wait to get our food and the service wasn't the best. It wasn't busy when we arrived at 7:55pm but the waitress seemed very frazzled. It took her a long time just to do simple task."], ["Hillary R.", "OMG this place is amazing!  Be sure to make a reservation though, they are super busy!"], ["Jennifer S.", "We came here with high hopes of finding our \"go to\" Indian place.  Definitely a nice atmosphere, friendly staff and decent food, but they couldn't seem to get the timing and details of our order right.  We ordered an appetizer, but it came out after our entrees - we ended up sending it back.  It took us over 5 minutes to get silverware even though our entrees had been served...they were getting cold since we had to wait so long to get silverware to start eating.  I am hopeful that our experience was the exception instead of the rule."], ["Sara M.", "Best Indian food! Fantastic service. The scallops melted in my mouth. If you haven't been here, stop in immediately."], ["Bally L.", "I cannot say enough good things about this place. The food is very much northern Indian style and the quality is excellent. Chief Jayvian has a special for me and it is known to him as Bally's Chicken Vindaloo and for those who like to live on the hotter side of things I promise you that you will not be disappointed. The owners wife (Pushpa) calls me her Punjabi British Friend and she understand the VIP request mentioned above. Would recommend to all to try this place. Staff are A++++ and the food rocks."], ["Sarah Z.", "First word that comes to mind is WOW. They created a really cool restaurant and the food is INCREDIBLE. Abraham waited on us and he was really great. We ordered gol guppa as an app, which was delicious- it's pani puri that's tastes just like you would get in India- for my entree I got chicken tikka masala which was perfect (and I always order chicken tikka masala when I go to an Indian restaurant and this is hands down the best) The bread was totally different from anything I had in an Indian restaurant- we had onion naan with chili flakes which was like \"why didn't I think of this???\" It's so good you can just eat it all by itself.For dessert, rice pudding and gulab jamun- I don't like rice pudding, but I tasted it from my boyfriends plate and ended up eating the whole thing.Seriously a great find. I asked Abraham for the lunch menu and it looked really promising- they have khati rolls and thalis! We will definitely be back!"], ["Nicholas C.", "Had heard some good things about Marigold Maison and decided to check it out on a Sunday evening. We had a reservation at 6 and were able to get seated right as the place was about to get slammed. First thing you walk in, there is no host station and you have to just hope one of the staff members will approach you to get your table. Once we sat down it was roughly a 10-15 minute wait until we were greeted. They gave us our menus and then after about another 10 minutes they dropped off 2 waters for 3 people. Eventually everyone was able to get their own beverage and we ordered appetizers. We started off with the Garlic Naan and Chicken Dip. The Garlic Nan was light and airy with a crisp finish. Really enjoyed it with the Chicken Dip. The dip itself was flavorful and the chicken was prepared nicely. It was a really good start to the meal from a food perspective.For our entrees we had the Saag Spinach with shrimp, Chicken Curry and Chicken Tikka. The Saag Spinach had a nice spice to it and a velvety texture. It combined savory flavor with the spice and went well with the rice they provided. The shrimp were cooked perfectly, big and juicy. The naan also went well with this dish as the saag has a stew-like consistency. Chicken Curry is one of the first dishes I picture when thinking about Indian food and we were not disappointed. This was also a very spicy dish as we requested but the spice did not overwhelm the other flavors. The chicken fit in perfectly and was also accompanied by rice. The dish as a whole was very impressive and the spice blend was second to none. The Chicken Tikka is essentially a whole roasted chicken with dark and white meat. We got a side of hot sauce for the chicken which was laid upon a bed of sautéed vegetables. The hot sauce lived up to its name and was a great compliment to the chicken which was dusted in an array of spices. The chicken was juicy on the inside and had crispy skin. It is also a good sized portion. The food was really good and it was ashame that the service was so bad. Drink refills were not done without multiple requests, and while they were busy, its not an excuse to just ignore your tables. But it wasn't reserved just for us, the table directly next to us did not see a server for at least 20 minutes and had to actually grab their own menus. With the food being so good I was willing to overlook the bad service but things got even worse. Upon paying the bill, the server hovered over us as we attempted to sign the check. Right as we set the pen down after signing the check, we were told to leave. The quote I believe was \"we are really busy and need you to leave right now.\" It took me a moment to process that we were being kicked out of the restaurant due to their inability to handle good business. I grew up in the restaurant business and have held a variety of roles and had never seen nor heard of guests being told to leave the moment they sign the bill in order to get another table sat. At most we just wanted to take a moment to relax and finish our beverages but we obliged as I knew if I stayed any longer I would have had to say something about being treated like that. I can forgive inattentiveness when a restaurant is busy, but blatant disrespect is another thing. Its a shame as the entire party enjoyed the food but we all agreed that that was our first and last visit to the Marigold Maison if you are kicked out of the restaurant the moment you pay your bill. The two stars is out of respect to the efforts of the kitchen staff which were impressive."], ["Mrs B.", "Great restaurant! I got a thali for lunch with chicken tikka masala and saag paneer, my favorite! The chicken tikka was delicious and the naan was really, really good. I ordered a mango lassi to drink and it was really good, not too watery not too thick...just perfect.Service was great. We were waited on by a young man named Nick. He was awesome! Really great personality, with good knowledge of menu. The chef came out to see if everything was good, and we were happy to share our delight. Awesome find for a very reasonable price. Our check was like $25 for wine and thalis. We will be back, and we will request Nick again!"], ["Barbara B.", "This place has the best Indian food in Arizona! I've been trying so many different locations and finally found my favorite! You can watch them make your dish from scratch through the open kitchen and get a house made chai or mango lassie to go with it. Definitely eating here again soon! Yum"], ["Joanie V.", "After a day of shopping, my sister and I stopped at Marigold Maison for dinner. We were starving and excited to see all the options available.Starting off with wine, we sat down and tried not order the whole menu. Our waiter, Nick, suggested the Gol Guppa so we ordered that along with some Samosa Chaat, Bhel Puri, and Eggplant. Eggplant and Bhel Puri were great and the Samosa Chaat had a blast of flavors--- we LOVED the Gol Guppa. For our entrees we got the Onion Naan Chicken Tikka and the Tandori Shrimp. Again, oh so yummy!!! I have never had Naan with onion before and after having this, I am not sure I ever will eat it any other way!! We ended up boxing up at least half of each dinner to take home. Guess we over did it little on the apps!So even though we were pretty full, I really had to try the rice pudding. A friend of mine was there a week earlier and she could not stop talking about how amazing it was. My sister was a little apprehensive as she is not really a rice pudding kind of girl. However, it was a hit! I think she even ate more of it than I did.So glad we stopped in! Can't wait to go again."], ["Christina W.", "Let me start by saying, I love Indian food.  I generally prefer lunch buffets because of all the variety.  However, I do know what I like so going out for Indian dinner is just fine, too.My husband and our baby boy decided last minute to try out Marigold Maison. In terms of the food- it was ok.  The garlic naan was delicious. We had the paneer pakora for an appetizer- it was pretty good.  Most Indian restaurants that I have been to for dinner bring the condiments (tamarind, onion chutney, and mint chutney) on the side. The pakoras came with the sauces drizzled on the plate- an attempt to be fancy, I think. I prefer the sauces on the side because I like to eat them with the bread and my entree.My entree, the vegetable korma, was ok- it was a little bland in comparison to other Indian restaurants.  My husband thought the lamb chops were really good.We enjoy going out to eat and while great food is number one on the priority list for choosing restaurants, we also appreciate a nice ambiance, as well as excellent service.  I have been a waitress many times, so I tend to be more on the empathetic side of servers.  Tonight, I was digging deep and, really, the only thing I have nice to say is that the people working there seemed kind.  They were really terrible at time management and knowing how to take care of their tables, however.We sat down on the patio and it took about 10-15 minutes to take our drink order. The table who sat down after us got their drinks, ordered an appetizer, and received their appetizer all before the 2nd waiter came to take care of us.  Waiter #1 was so flustered with what appeared to be a few tables, so he passed us on to Waiter #2.  We thought it was going to get better from there, but we were wrong.  It took our new waiter forever to bring us our check.  We never even got refills on water.  Bottom line- it's a small restaurant and we were forgotten about from the point of entry.  The food was just average, so due to the terrible service, we will not return."], ["Joshua W.", "I was amazed with my experience here. My girlfriend orders the lamb chicken Marsala and I had the chicken Vindaloo. Well her lamb was delicious and my chicken was sub par, so naturally I ate all of hers. The waitress noticed my untouched plate and comped it off the bill and offered to make me something else. I will definitely give this place another chance"], ["WMT W.", "I hesitated in writing a review because this place is soooo good and I did want my little secret spot to get out but it has. You just  can't keep food this good and service this friendly secret for too long. Only negative is if you are going for dinner you probably should call ahead for a table."], ["Tim W.", "Marigold Maison is a wonderful magical place.  A small little patch of heaven in an area that is far to commercialized, strip mall laden, and devoid of unique mom and pop operations.There are quite a few options for Indian food in the valley and I am sure there are some that are as good as this wonderful establishment, but I haven't found them yet.The staff is courteous and professional all while having an air of casual friendliness.  I found the manager (perhaps owner) to be very nice and obviously concerned with the dining experience and the quality of the food.  The restaurant has various specials and events such as their weekly Tuesday \"Date Night\" where you can get a three course meal and a bottle of wine for a very reasonable price.Let us discuss the food... oh the food.The tikka masala I had was the best I have had in phoenix.  It was euphoric and could not have been tastier.  For people who understand and love food, there is an ecstasy that certain foods can give you.  A natural high that takes you to a mental place where all the difficulties of the world fade away and all the is left is joy, peace, and deliciousness in your mouth.  I get this feeling with Thai food, Korean BBQ, and the tikka masala from Marigold Maison.The garlic non was delicious (though our had one edge that was a little burned) and so good.  The rice didn't have saffron but that is understandable given the price range.  But these are small things; things that do nothing to tarnish the luster of excellence that permeates this establishment.If you love Indian food, love a good deal, and are a hunter of that euphoric food experience, you owe it to yourself to try out Marigold Maison.I would say that we need to do our best to keep this place in business but from the times I have eaten here they are always busy as it is =)  Maybe make a reservation before coming."], ["Anvesh Reddy S.", "First review on Yelp!I've been here a few times since it opened and I absolutely loved the place, food and service.The decor, the music and the food is something I really connect to and hence the rating.The chicken Thali is what I've ordered when I've been here.They give you a paapad, 2 curries, one naan, a small bowl of rice and a sweet.I love the fact that the quantity fills me just about right and I leave feeling not heavy but content.The first time I ordered the Thali, the entrees (curries) were fantastic and the second time, one of them was alright.I will be visiting this place again and recommend it to friends who like Indian food."], ["John P.", "The Goan vindaloo , finally I've left a new restaurant in the Phoenix area happy that , no one tried to warn me about the heat and two wasreally the best rendition of this dish I've had in years that I didn't make myself.  Sour, spicy with a great texture that sticks to the naan and rice which, at least for me, is just the perfect size for an evening curry.Add in Naan a cut above those poor thin uniform excuses that are the feature of most valley buffets  and a decent appetizer section  and I can no longer claim there's not a decent Indian restaurant within 10 miles of the house.  Again this is just based on one dish but that's really all I need. I really wanted to try a bunch of the appetizers but I could see $40 lunch occurring and  that just wasn't a today thing.Great service, bit pricey for  solo lunch dining and the tables for 2 , tiny,wee bit cramped, though not relevant at the time I was there. The lunch menu is too restrictive ,the leap from lunch price to dinner will limit how much I could spend, but don't get me wrong this dish is worth the price,  but 1/2 the serving and a 1/2 naan for $10-12 would hit the sweet spot and make this a regular rather than occasional thing."], ["Tracy G.", "I work in the area and have been meaning to pop in and try Marigold Maison for lunch for quite some time now.  This place had always seemed to slip my mind when trying to decide where to go.  However, I assure you that will not happen again.  We stopped in today and were blown away.  The food was SO good... great flavors, perfect textures and good portions.  The wait staff was very attentive, helpful and friendly - as was the Manager.  I understand there can be quite a wait for dinner - so you'll need to be smart and make a reservation or plan well ahead to order take out -  but the wait will be well worth it.  This will be my Go To when I'm in the PV area from here forward!"], ["Mirza D.", "I love the food and used to frequent this place quite often. This all changed last Friday when I ran into the manager Steven. He turned us away due to the fact that we didn't have reservations. When I suggested that we could sit outside his response was that it was too hot. Upon telling him that we don't mind he replied that he only had one bus boy. I will never understand why Steven was so adamant about turning us away but Marigold Maison has lost a loyal customer. Steven should not deal with customers as he does not have a single customer service bone in his body."], ["RM K.", "Oh my!! Really wonderful food. Some of the most attentive servers around. Smells wonderful as you enter. Lamb korma is incredible. Order family style and share. Indian beer available, good wine list- a bit pricey. If you want to secure a seat call for reservations as seating is slim esp. During summer when outdoor seating is not an option"], ["Jennifer B.", "I love this place! The food is delicious but the customer service makes this place really special. Abraham and Gina are so nice and knowledgeable. I haven't tried their lunch menu yet but dinner is outstanding."], ["Elaine W.", "I just got home from the most fantastic dinner tonight at Marigold Maison. Normally, I don't feel the need to write a review so fast, but I AM STILL THINKING ABOUT THIS AMAZING RESTAURANT I found the Marigold on yelp, and my parents and I decided we would try it out tonight. Our waitress Gina was absolutely wonderful. She went into detail about the menu, telling us what was her favorites as well as the chef's and recommended different meat combinations. Let me tell you, as a lover of Indian food, I have NEVER had better indian food in my life. The tandoori chicken came out perfectly moist where at most places it is dry. The Saag was so flavorful and had the perfect amount of spice. We also had the BIryani, which was so different and tasty. As an appetizer, order the seared eggplant it was OUTSTANDING! However, besides the food, I was moved by just the general kindness of the staff at the Marigold. Gina was so kind, and was constantly checking on us to make sure we were enjoying our food. The chef came out while we were eating to see if we liked the food, and to tell us about his cooking. You can tell that he takes great pride in his work, and rightly so.  I will most definitely be returning when I am in the Scottsdale area!! Thank you Marigold for a wonderful dinner!"], ["Tyler K.", "Lunch with friends was great. The service was spectacular and food delicious. Servings are generous, so ask how big the plate will be if you aren't super hungry. The Mango Bellini is awesome, and the lamb roll is tasty, very much like a gyro."], ["Tamra W.", "I love this place a little too much! I crave it! So delicious! I love the chicken korma and the samosa! Everything really. Just writing about it makes me want to eat there. I will be eating my lunch there tomorrow! Literally, we fight over the left overs! So so so good!"], ["Genevieve H.", "Great Indian food and excellent service. Everyone in the restaurant really cared about our experience. A small restaurant with a staff that cares. This is definitely a neighborhood gem."], ["Kirk V.", "So nice to see the old (Tatum & Shea) Bombay spice concept back. Granted I did not give the Cactus Rd. buffet a shot thanks to Yelp Reviews, I did want to see what Marigold Maison was about. Great ambiance and open kitchen, Sunil the head chef is always welcoming. Andy was a great host that kept our kids thoroughly entertained the entire evening. My kids now say let's go eat at \"Andy's Place\", not a name change suggestion just pointing out the impression he made. And as parents know entertaining the kids while out to eat can be a challenge. Lentil cakes and my standard chicken tikka masala were our choice that evening and they were as good as ever. I would recommend trying it out and will go again to see if they can edge up to 5 stars like the Bombay Spice of yore...A side note, as I was leaving the restaurant, a couple mentioned to Andy how their \"dinner was good but they miss the buffet\". Andy pointed out that reviews for the buffet were not favorable on Yelp, at which point the couple proceeded to say Yelp reviews are a fraud, bla bla bla...I couldn't bare listening to it and felt like I needed to stand up for Yelp as someone that really finds value from it. It's no fraud! You can quickly figure out which reviews are \"fraudulent\" and which are not, so I'm glad to see Bombay/Marigold Maison is in touch with reality and Yelp's value add to restaurant owners. Ok off my soapbox. Go to Marigold Maison and tell them a Yelper sent you!"], ["Nora K.", "Stopped here on a whim and happy I did. Sat outside because the weather was beautiful and the inside seemed small and hot. The wait staff was super friendly and attentive and, because the menu is slightly different from some more traditional places, the server explained how things come out and portion sizes, which was helpful.Lentil soup was pretty bland and came out warm, not hot. Samosas were great and came out extremely hot. Chicken tikka masala was the entree and it was really good, but not the best I've ever had. This place is worth trying."], ["Christina M.", "I have had better and the Chicken Korma tasted more like Curry chicle the lentil soup was like paste. It was expensive and not very good. I have had better Indian."], ["Jennifer O.", "I love Indian food. There, I said it. The problem? There just aren't that many great places here in Phoenix to get it. So when I saw a new Indian place open and get such rave reviews, I was excited. My mom and I decided to meet here for lunch last week. This place was a little hard to find, but it is on the NE corner of Tatum and Cactus (I went to like every other shopping center first... *palm to forehead*) and it faces cactus (by the Olive Garden sort of). When we entered, my first thought was, oh cute... my second thought was... this place is owned by Roka Akor's restaurant group... that's...weird. Anyway, the owner greeted us and that is when things started to get weird. The owner is a talker... he said so himself... and the things he talked about were a little off putting for a restaurant owner... he talked about politics... people walking by the restaurant.... his old chef who stole from him.... karma...you name the awkward conversation topic to have with a stranger, he probably talked about it. I would say this isn't advisable for a restaurant owner... it's not like we came here to hang out with him, we came here to eat. Speaking of eating, my mom and I shared a Thali and an order of samosas. I was excited they had Thalis (not many places that I've been here do). The thali is like going to an Indian buffet when you are on a serious diet... you get to taste many items, but just a small amount of each. The Thali consists of 3 'main' dishes - you pick the protein for 2 of them and the third is a mixed veggie curry. They allowed us to mix the lamb vindaloo with the chicken masala (after a little nudging from me and agreeing to pay the higher price - 14$). The lamb was very good, tender, just the right amount of spice. The chicken was also tender, but kind of bland for Indian food.... I guess at dinner you can choose your spice level, but not the case at lunch. The veggies were alright... nothing great, nothing bad. It also came with salad (meh.. salad is salad), two scrawny pieces of plain naan (again... nothing special), rice, and a fried dough ball soaked in sweet syrup (I was kind of sad since reports on here said it used to come with rice pudding... I love rice pudding, the dough ball is just ok). The real star of our meal were the samosas... these things were hot, crispy, and well seasoned. Will I be back? Eh, maybe if I were in the area, my mom really enjoyed it, but overall I thought it was just ok and far more expensive (and less delicious) than some of the lunch buffets out there."], ["Sheryl V.", "Disappointing...both my husband's vindaloo (ordered spicey) and my aloo gobi were insipid.  The chai was not hot and not very tasty. The naan was dry. It was noisey and not the place to dine if you want to enjoy dinner conversation. They automatically added 20% tip to tab. Service was fair .. The pappadam were good.  No kheer on the menu.  Won't go back."], ["Crystallynn S.", "If there's anything I love as much as coffee... it's indian food. This place is beyond legit. The food is authentic, amazing, and just so damn good. I'm a huge paneer fan, and omg. It's just really, really good here. Did I mention that it's good? lol I'll def be back"], ["Neeti S.", "Taste is okay.. Not real Indian flavor and the quantity served is less... Not worth it..."], ["Aaron G.", "Just took some take-out lunch from here and can say with sincerity that I am now a fan of Marigold Maison.  I was the only person there which I hope is due to the fact that I came unknowingly just as they opened, because I really want this place to succeed.  Ordered Chicken Tikka Masala and Garlic Naan (my go-to at all Indian restaurants because I love it ok?) and while I didn't find them the best I've ever had I can say they were really good.  My one nit picky pseudo complaint is that the masala sauce was a little more liquidy than I'm used too, but that was a minor issue considering that the flavor was there.   It is a bit pricey but I knew that ahead of time and dont really blame the place because the portions are quite large (please dont change that!).  This is without question the best Indian food in this area.  I repeat in this area because there is of course better in the city, but I mean within a 5 mile radius.  I will return for my garlic naan and tikka cravings."], ["Patricia H.", "Delicious. What else can I say. The vegetarian Tikka Masala with cheese was incredible. If I could I would lick the sauce off that bowl. All the dishes we tried had incredible seasoning and flavor. Thanks you to Abraham for the great recommendations. we will be back soon for sure."], ["Angela M.", "The best Indian food I've had in a long time! Definitely will be coming back for more :)"], ["Jeff Y.", "I have finally found very good Indian cuisine in Phoenix. The food and service were excellent. The portion sizes are very substantial. I have had the Samosas and Chicken Korma two times and would recommend them."], ["Chris B.", "Good food, decently fast service.  Big selection, the lunch specials are well worth it and you get a great selection."], ["Jesus L.", "Incredible Indian food. My waiter Rohit was great explaining the menu. I had the chicken tica and the lamb with rice and a garlic naan.  Exllent dinning experience."], ["Ed S.", "Accommodating. Friendly. Professional. Delicious. This was a wonderful experience in true Indian cuisine. A must try and an asset to Scottsdale."], ["Jay W.", "Do not go without a reservation We had enjoyed good food at this restaurant so today we reached at 5 30 at the restaurant and the restaurant was very empty so they had like 5 tables empty and 2 occupied we asked for a seat and they told us that all the tables are reserved and although we had a baby they suggested us a seat outside which was cramped even for 2 persons . On top of it they said they we would give u a seat but u may eat very slow and then the reservation people would have to wait . I would have understood the situation if all the tables are full but there is only 1 couple having food inside and they let us goI had some good food in past but this situation has really got me thinking"], ["Rosemary A.", "Excellent Indian! Just tried Marigold Maison for the first time and the was very happy to think that this may be my go-to Indian. The quality of the food is very good--although my dishes could have been hotter, but I was told just to request that next time. I didn't give 5 stars because service was a bit off, although everyone was apologetic and I do have the impression they are committed to getting it right. We'll be back."], ["Alan H.", "Wow!  Such great traditional and fusion Indian Cuisine in one place.  The curry and tandoori dishes are fantastic, and the Chicken Pea Ceviche makes me come back for more.   For a great Indian dining experience that will not disappoint."], ["Leanne L.", "Rikan was AWESOME - great service! Delicious food! Clean restaurant.  Kid friendly. My kids got the kid menu items & after tasting our meals wanted to come again so they could have mom & dad's food. Definitely coming back & bringing friend!"], ["Gregory D.", "One of the best indian restaurants I've ever been to, and likely the best in Phoenix. Seating is very limited and only good for small parties. Really liked the bharta and garlic naan."], ["Logan B.", "Unbelievable food, service, and a great experience. Highly highly recommend coming by marigold ASAP. Even if you don't have time, grab food to go."], ["Veronica G.", "Delicious more upscale Indian cuisine. Had a shrimp dish that was fantastic - shrimp was huge and fresh! It's a little pricier than we are used to, but the quality of ingredients seemed really good."]], "The Dhaba": [["Rina H.", "First off the food is fantastic and soo delicious. However, they fall short on a few areas I'm not happy with. First, with all the spices they are cooking with, they have extremely poor air circulation hence you smelling like what you and the restaurant order by the time you walk out. And that scent is so strong that I couldn't even cover it with perfume and I always put my hair up prior entering knowing I'd smell after! Secondly, they skimped me on the rice. I usually go in by myself and order one entree, that's fine. BUT! I was really hungry one day and ordered two entrees to myself both were supposed to come with white rice. They came out with both entrees and the SAME amount of rice as when I usually order one entree with rice. When asked they said I could pay extra which I found inconsiderate because I ordered a SECOND dish that is supposed to come with its own side of rice. They generally serve the rice in one bowl, which is fine, but they did not put any more rice in that rice bowl than they did when I came and ordered one entree! I was extremely disappointed when I left that day. I had to go to trader joes to buy some extra naan for the second entree... :( I also cannot say the two women always working there were the nicest or most hospitable of servers."], ["Adrienne E.", "Terrible Customer Service! Two hours late delivering my food and they refused to cancel the order.  The person who answered the phone kept telling me the food would be there in 45 minutes after I waited for an hour even though I was asking to cancel the order. They refused to give me their name and they refused to give me my money back. Then! Worse! They refused to let me pick up my order instead!! I am furious! There are dozens and dozens of Indian restaurants in the Tempe/Phoenix area. The Dhaba will not be seeing me again, and I will tell everyone this story. Spend your money at one of the courteous Indian restaurants instead."], ["Tzarina W.", "I've been here a few times and always enjoy each visit. First of all, when you walk in you get an inviting feeling from the smiles  and courteousness of the staff. You get to experience a bit of the culture with the lovely dining set they have and by the look of the decor. And of course, the many flavorful dishes that they offer! Their staff pays attention to the water level of your cup and ensures it is filled. That's an A+ :)This time around I tried papadum which is a  starter. It looks like a tortilla but the texture is a light tortilla chip made of lentil powder, rice powder and some different spices. You can practically eat these non-stop! Favorites/Chicken/Tandoors/Bread/Dessert:- Rahon dal tarka which is yellow lentils mixed with different herbs and spices. You can eat this with their saffron cumin rice. - Gudaspuri Mutter Paneer which is blended mix of peas and cheese along with the dhaba herbs and spices. Great for trying to fulfill the veggie part of your daily food intake! ;) palak paneer (spinach and cheese) is also good. - Gazab Ka Kadahi Murgh which is a BBQ boneless chicken marinated in a spicy yogurt. This is my new favorite dish because it's baked in their clay oven. Once cooked then its marinated in the yogurt sauce and mixed with onions, bell peppers and tomato to create a wonderful sauce. - Tandoori Murgh (chicken) cooked in the clay oven paired with onions and a squeeze of lemon. - Pani Puri which is small finger foods. \"Street food\"  Little chip-like texture cups filled with potatoes and chick peas. Pour the mint water in the filled cups and add an optional taramind sauce or mint sauce. - Garlic Naan is hands down my favorite garlic naan I have tasted!! If you're wanting garlic naan then come here to eat it. It's soft  ,airy, fluffy with the right amount of crispness on the edges and amount of garlic shavings on top! - Ras Malai (sweet condensed milk cheese circular chunks) homemade dessert. Think of fresh mozzarella cheese texture. Really soft clean texture mixed in with the condensed milk cream sauce. - Halwa which is a Carrot fudge (sweet cooked carrot shavings boiled in condensed milk mixed with hints of pistachios, cashews, and golden raisins. Really innovative for a homemade dessert! Overall I loved this place because I can always select new dishes as well as favorite dishes to eat and I can always expect great friendly service from their staff. Gotta come check this place out! Mmm mmm gooddd! Only thing I regret was not taking pics of the delicious foods!! Next time. ;)"], ["Joni L.", "The Dhaba is well known in the area for their Indian cuisine, as evidenced by their wall of awards. I was happy to find a Groupon to try it out and they were nice enough to let us use it on a carry-out order, once I explained our situation over the phone. For that accommodation, I added a star :) The location is in a rather \"scruffy\" side of town (not sure I'd want to hang out there after dark). When I arrived to pick up our food at 6pm, there was only one table occupied in the restaurant. We ordered two chicken tikka masala dinners--one mild and one medium in spice level. However, both looked and tasted exactly the same...very bland. Each meal consisted of about 4-5 small pieces of chicken with a cup of basmati rice. We also split an order of garlic naan, which was good. Now, we've eaten at a few other Indian restaurants before, and never once have we been able to finish our meal in one sitting; we always have leftovers. But we were left still feeling hungry. $35 for 2 dinners and an order of naan. Small portions, overpriced and not impressed."], ["Kira A.", "Although the food is delicious, as always, we were upset to be told after the meal that because we made a reservation we could not use our groupon on dinner.  In general, that does not make sense. We can only use groupons if we are walk-ins? This is a groupon that expires in two days and we will not be able to get the value out of it now. I feel that a business should honor the deals they offer and/or make any caveats known up front."], ["Ashish V.", "The food was mediocre.  Nothing that great. We ordered Thalis. The biryani they served was nothing close what is biryani, it tastes like tomato paste. Chole was bland too. The tea that they served with thali was more water than tea.In a nutshell don't even think about ordering a thali here."], ["Andre M.", "the chicken massala was good but the portion didnt actually have enoigh chicken... also thought the menu was confusingthe food tasted very good though"], ["Nick J.", "This place is Amazerling as the kids say...This is my #1 choice thus far for Indian cuisine. The Naan is sooooo good and all dishes have fantastic sauces. I'm was pleasantly surprised that they also serve baby coconut water in the coconut... Really great place A++"], ["Vamsi A.", "Do not recommend, poor quality and pricey. Not authentic Indian. The tandoori chicken was not cooked well, the biryani tasted like sambar rice and curry chicken had to be sent back."], ["Lisa K.", "I am spoiled for Indian food now. This place is the best. It smells awesome and the decor is nice. I've eaten here twice, once for lunch when it was slow and it was very quiet and once on Friday when it was busy and it was a little on the loud side. No matter, I love the food. The Lamb Korma is to die for and the Tikka Masala is awesome. The Kashmiri Naan is so good. I love this place."], ["Chanelle C.", "I love this restaurant! I feel like this is what Indian dining should be like. The setting and the service are great. And the food!! I feel like this is the best I've come across in Arizona. It might be a little more than other Indian restaurants but I think it's worth it. The food is delicious and I would recommend this place to anyone."], ["Doug H.", "Excellent food.. excellent presentation.. I can tell the food is a labor of love. The flavor of the food pops in your mouth... good for lunch or dinner.. suggestion... take their advice on a reservation.. they are a small but busy restaurant on the outskirts of Tempe."], ["Miriam H.", "Came here for a valentine's dinner with the hubby. Small space but the food's flavor makes up for it immensely. We ordered the Kolkata pani puri for starters. Little hollowed out puffed pastries stuffed with potatoes and chick peas, which you pour tamarind flavored water on. Although the flavors were there, they didn't work well together. For the main course we got the Dhaba chicken curry with aromatic basmati rice and some garlic naan. This dish was delicious. The chicken was boneless and tender, the curry was rich with spices and heat. The garlic naan was fresh and pillowy and worked great with the curry. The serving size was perfect for two to share, and we even had enough to take home!Great atmosphere, they even had a guy playing a sitar in the front of the restaurant! This restaurant is located in the India Plaza, next to a Indian grocery store, parking seems really scarce though, and make sure you make a reservation, they get booked!"], ["A A.", "Best Indian food in Tempe and I tried most places. Friendly service, clean and when you ask for spicy they give you spicy unlike some other places where they determine the spice level it should be by your ethnicity."], ["Janet J.", "You guys. The tikka masala. The spice. Perfection. Amazing. Weird bathroom sitch, so close to the sitting area and a urinal, bleck.  But doesnt matter, food trumps any building logistics."], ["MacItaly X.", "Just ate here last night, wonderful experience...let me tell you about it!I use OpenTable to make reservations, in order to build up points and get free stuff, but that's another story. The Dhaba is OpenTable friendly, so I made a reservation and we were sat immediately. We also found a Groupon, $18 for $30, so dinner was already $12 off before we walked in the door. It was a Saturday night, around 7pm, and the place was practically full. My wife and I noticed that there were a lot of Indians eating here as well, which is always a good sign of authenticity! We couldn't help but notice the numerous placards and \"Best of...\" awards hung all around the entryway. While this place was new to us, it certainly wasn't new to the area and has won many prestigious awards. There was one hostess who also took orders while 3-4 other servers brought out food, refilled water, and pre-bussed the tables. We never needed a refill, never had dirty plates, and were always taken care of. This was a wonderful aspect of our dinner. My wife and I decided to try our favorite Indian staples: Samosas, Chicken Tikka Masala (Heat index - 6), Tandoori Chicken, Saffron Biryani Rice, and Garlic Naan. The food was wonderful. My wife enjoys a milder heat so we settled with a 6 on all our dishes (out of 10). The heat was calm with just enough *umph* for her. The flavors were delightful as I mixed them together. Tandoori Chicken in Tikka Masala sauce with garlic Naan bites. Yummerz! The presentation of the dishes looked beautiful and the servers were attending to our every need. We were very impressed with the customer service.If you are in the Tempe neighborhood and looking for a wonderful Indian food restaurant, please check this place out. They are outstanding. My wife and I prefer this restaurant to the many other Indian restaurants within the area, and will definitely find our way here again!"], ["Ayyad K.", "Only Indian restaurant i tried in the PHX area, I liked the food and the ambiance. Owners/managers seem very friendly tood.Would definitely come here again."], ["Sukh D.", "Came here for the first time. The food was good however what lacked was the service. I'm glad I got an appetizer because the food took almost 30 minutes. Also, the servers just tend to their own things rather then asking the customers if they need anything. I found myself getting up to ask for things. Giving it a 3 stars only because of the service. Otherwise the food is good. Would recommend It to others."], ["Sandnya D.", "This place has terrible food, people that is not Punjabi food! It is bland and does not have flavors. Even the Rotis were mediocre. Do not be mislead by the awards, this place is not authentic at all. The worst was the tandoori chicken, could they had added more color! Never going back and you should neither. Service is not great either, they did not change the plates after the starters and looked shocked when we asked them to. We needed to ask for water so many times! Not worth the four stars!"], ["Julie U.", "The Dhaba is by far my favorite Indian food restaurant! I always get the vegetarian or seafood dishes and they never disappoint. The korma and saag dishes are my favorites. I've taken many people to this restaurant and everyone has been very happy with it. The staff is friendly and the service is always good. I think they have some of the best naan around."]], "India Palace": [["Jr. B.", "We had lunch buffet for $8.99/person - and it was awesome!Everything we had was delicious and perfectly prepared. The tandoori chicken was moist and had a smokiness to it. The Lamb Curry was very meaty and tender, but my favorites on this visit were the Vegetable Pakora [sp?] - some of the best I've every had - and the Chicken Tikka Masala. I think they were making the naan fresh as we ordered it. Service was good and attentive - they kept our glasses full and were very friendly.Highly recommended and we will definitely visit them again."], ["Rand H.", "= = = = = =  WEEKDAY LUNCH BUFFET!  = = = = = =Made it back up here for the Lunch Buffet, this time joined by Mike C. and Jackie R.  I'm not sure if they offer a buffet on weekends, so I'll just speak for how it was today, a Monday.This is a nice restaurant with comfortable booth seating, and tables are also available.  For today's buffet I counted up 19 main items, including hot Chai (Indian tea).  I didn't note the exact dishes, but know that these folks vary the selection some daily anyway, and I do want to note that there were two lamb selections.  YAY LAMB!  Everything else was good too.While some of my top favorite Indian Buffet treats were missing such as Mango Lassi to drink and garlic flavored Naan bread (we were served plain with a little butter on it), everything was fine with the restaurant, the taste and temperature of the food and the table service so it's 4 Stars this time for India Palace where the Lunch Buffet went for $9.75.     :-)"], ["Daniel L.", "We visited this Indian restaurant for their lunch buffet ($9), and came away with a positive experience. The yellow and red interior was large, dim lit, and good for groups. The buffet items were stacked in the back, followed by a bar area, TVs, booths along the perimeter, and tables located from front to back. Rice and vegetarian items, the meat dishes, chai, and a small salad and dessert bar culminated the buffet line. Both the White and Vegetarian Biryani were disappointing. The rice was overcooked, soggy, and had an unusual flavor. The Sagg was creamy, flavorful, could come with less grease, but still worthwhile. The Turka Dall came with a nice kick, and I really enjoyed the firm delicious Paneer that was worth the repeat. The Tandoori Chicken had a very pleasant smoke, and the meaty pieces came with great temperature without it being dried out. The Lamb Curry was also outstanding. The bulky pieces of Lamb were moist, flavorful, and of quality. The same could be said about the Chicken Tikka Masala. I loved the centrality of charred and smoky flavors that coupled with my vegetarian options to round out the taste buds. The Naan were not greasy, and the spongy textures were addictive. The dessert options were really lacking, and the Chai Tea was diluted without much flavor. For those looking for a spicy fare, I used cilantro chutney to add some unrelenting flavors to supplement the lack of heat across these dishes.Despite the hits and misses, it was a nice discovery. Service was warm, friendly, and these practices were underscored by occasional drop off of fresh naan, and taking away our used dishes in a timely manner. Overall, the food was delicious and the quality of the meat met our expectations. The few limitations were the overcooked soggy Biryani, lackluster Chai, and options and flavors that catered to the conventional Western taste buds. Based on my experiences with other Indian restaurants in the area, this is one place that is worth of returning."], ["Melissa P.", "We have eaten here several times and never disappointed. We took the kids, one of which is very picky. She ate an entire order of chicken tandoori. I was a little disappointed with the palak paneer, which is my favorite. Just didn't seem the same as usual. Service is always great. We will definitely be back."], ["Christine P.", "I seriously had no what to order when I came here. My friend and I just stared at the menu for the longest time!! Haha. Of course at the vegetarian menu. Great selection, so much to choose from. Just didn't know what to order. So I LITERALLY close my eyes and pointed to one.I got the chili vegetables. And the palak paneer. And....I forgot the other name of the dish. But oh my gosh. I love all my dishes. Different texture for sure, not use to it. But i like it. :DThe staff was great, slow with our drinks, but overall it was a good place for dinner."], ["Geoff P.", "As far as Indian goes this is by far the best I have had this side of the Atlantic Ocean.  My mum makes good Indian but I think this is great indian.  Very filling, just the right spices and curry to make the meal taste just right."], ["Alice H.", "Tips:Ask for garlic naan!$8 for lunch buffet. Super cheap!-------------------------------------------------------------------------The lunch buffet is pretty limited to about 3 curries and a bunch of sides, but overall I think everything tasted very good and very filling. The curry was a bit more liquid-y than I expected, but that didn't take away from the taste.The naan is brought fresh to your table and you can even order garlic naan!Overall it's a very good place for some cheap indian food to curb your cravings!"], ["Gstr 4.", "Nothing great to say about this restaurant.. I felt okay with the food... Only thing I liked is, they serve water and lassi in bronze utensils.."], ["Jeremy S.", "By far one of the best Indian cuisine in Phoenix! Authentic, Service is great! Defiantly coming back."], ["Donna M.", "I have been here twice for dinner recently and the food is insanely delicious. They start you off at dinner with Papadom, these wafers that are simple yet tasty. They have an onion appetizer, onion Bhaji, that is deep fried with garbanzo flour, which is gluten free, and it was almost like eating onion rings, something I really miss being GF. The onions have a wonderful flavor. The Chicken Tikka Masala has to be my favorite dish but the Lamb Vindaloo is a close second. I went there for lunch the other day since I work close by and it was a buffet with a good variety of dishes. There was also a hot chai tea that was very flavorful and spicy plus a rice dessert that was pretty yummy. The buffet was just under $10, a very reasonable price for a buffet.The service is attentive, the food comes out pretty quickly and it's a good experience all around. This place gets two thumbs up in my opinion."], ["Jennifer M.", "How's their food? Who knows, they wouldn't give us any. We were seated. The place didn't have many customers as the whole center of the restaurant was empty. Our order was taken, and then we waited. And waited. 50 minutes after being seated, a waitress came out with a tray and headed for us, but then turned and gave our order to another table, who started eating. We got up, tried to pay for our drinks, which was declined, and went down the street to \"Touch of Thai\" where we had our food 15 minutes after sitting down."], ["Jyothi Reddy K.", "Better avoid. Worst restaurant in Phoenix. Last I ordered chily chicken and they gave chicken curry. Chicken biryani was very bad."], ["Chris K.", "The buffet has all the staples of Indian food. My fav lamb and chicken tiki. They also have garlic nan. Food was freshly prepared and tasty. Was not overly spicy. Restaurant it self was clean and decorated nicely. Will definitely come again. The owner stated they have a better buffet on weekends for same price."], ["Kay K.", "Passed by here a thousand times before I decided to try it out.In the corner of a pretty average strip mall, the interior of this joint was super decorated. Service was professional.I had the naan bread, chicken tikka massala, and tandoori chicken. All were great. Very tasty."], ["Michael W.", "The place is clean, the staff if very attentive and the food is tasty. They'll spice it up or down to suit your desire. I'll stop there whenever I'm on the west side."], ["Adam M.", "Visited the Indian Palace for the first time on Sunday- I'm an expat Britt constantly looking for my new Indian local. This may be it! The food was the best I've had state side. I've been searching for a place that would make me a lamb tikka korma- and nowhere has it listed or ever tried until now. The chef whipped one up and it tasted amazing. They even have onion bhaji too, and my minimum requirement a keema naan. My friend has the vegetable korma which was also easily one of the best I've tried.The staff were very friendly, very accommodating and the food tasted excellent. I will be visiting again and I highly recommend it to anyone looking for a down to earth place that's serves delicious food."], ["Connie L.", "Come here for Indian buffet. Food is flavorful. Somewhat cold.... So I recommend stirring the food a bit before putting it on your plate. About twelve different items. Very common dishes you see at most Indian buffets. Half vegetarian section, half meat section with lamb and chicken options. Complimentary naan is offered."], ["Ben S.", "Dang. This was exactly what the West Valley needed. It is well priced, food was good, and service was very much on point. They visited our table constantly to refill drinks, and food was pretty good.The Tandoori chicken was a bit smokier than I'm used too, and the smoke tasted slightly artificial, but everything else was delicious and as expected. The chai on the buffet was a really nice touch, and helped break up my normal water and lemon.And 8.99 for a weekend lunch buffet? You don't see that much anymore."], ["Shelly G.", "My new favorite go to Indian restaurant. They offer papadom, Indian crackers which are gluten free. The madrasi lamb was delicious but I should have asked for a spice level of hot. The basmati rice had good flavor. They offer more of the authentic Indian dishes. The staff was very friendly and offered good customer service."], ["Francine C.", "Love love this place, great food, great price and wonderful service. The lunch buffet is $9.50 comes with naan bread. We went in for the chicken tiki marsala, it wasn't on the buffet, the server asked if we would be staying, I said we really wanted the chicken, he went to owner, he said no problem we will make for you. GREAT customer service! We enjoyed the lamb curry, and tandoori chicken, lentils and spinach(I forget what the actual names are) the garlic naan is fresh and hot! We go at least 2 times a month."], ["Ninja Q.", "Service deserves 4 stars. The food deserves 3 stars. Price deserves 4 stars. I would go back to this place if I was in the area, but other than that, I can't really say if I would travel that far to this India Palace. Food was decent, but not as flavorful as I would like it. It's not bad for $9"], ["K S.", "I have  been visting this place  from couple of years after I moved to  phoenix. Very good place for indian food. Options in the buffet for the price of 9$  are very good nd selective  . Food is delicious. Every time  I visit here I'll have buffet( chicken tikka Masala,  nan ,tandoori chicken,  malai  kofta , pulaf  rice, end up vth gulab  jamun ) vth side of pakoras  nd mango lassi (served  in bronze cup) .  Service is awesome  ( they serve water in timely manner nd always they remove used plates from the table vth in no time) people who  work there are very friendly  to the customers.  I love this place . People who visit phoenix  nd looks for indian food can try this place ."], ["Kim B.", "This place is soooo tasty and good variety! Def one of the better Indian food places I've been to."], ["amparo a.", "This is my go to spot for delicious Indian food. They have amazing sauces and tons of options. One dish I have never encountered at any other place is malai kofta. These are a veggie meatball in a yellow sauce. I feel it's important to mention that I am not a vegetarian. These things are amazing, I order them every time I go. Whether you eat meat or veggies I highly recommend you give this a try. In addition the service is great. The staff are always helpful and courteous. As a bonus they play great Indian soap operas that are fascinating. The only reason they don't get 5 stars is because I do feel the biriyani could improve."], ["Andrea H.", "I have been eating here regularly since I discovered how amazing their food is a few years ago. It has been one of the few Indian food places I've found in Arizona that compares to my favorite place from Seattle.I cannot speak highly enough about their food and I love the staff.My favorite dish is the malai kofta."], ["Hungry F.", "We went for the lunch buffet. After reading reviews we thought this was our place.  After eating there I suggest you try some of the other places of try a different food.  Our party of 4 all experienced Indian food eaters had stomach issues. I also had the MSG dry mouth and head ache I get from Asian buffets.  The selection on the buffet was smaller than the place I eat at in Arkansas.  And the spices were bland. Not what I have come to expect from Indian offerings.  The service was good and the restaurant was clean.   My friends that live here said they would not be back.  Overall a big disappointment."], ["Varsha R.", "Perfect place for Indian food. Great service,affordable price nd amazing food. Love this place."], ["Jacob E. G.", "This is a nice atmosphere representing the country of India. Reasonable pricing for the food. I went with a few friends and was able to have a satisfying meal. It was good food as agreed upon by all three of us. The staff although friendly and courteous, didn't know what was in some of the dishes. Not sure if she is new to the restaurant but it seemed like a question that should be answered by every employee. Nonetheless it was a good find."], ["Brooke H.", "Great Indian food! The Baingan Bharta is sooo delicious!  The have some really excellent meat dishes as well---the Tandoori chicken is marinated wonderfully.  The staff is super friendly and the prices are very reasonable.  Love it! I will definitely be going back."], ["Valeena L.", "Their food reminds me of my childhood. Grew up eating Indian food daily and I love it all. I've been on a curry binge lately and late night or lunch time at work I'll come to them and get reminded why I come back everytime. Thank you for the great service."], ["Darlene P.", "Really great lunch buffet experience every time!  The place is clean and the people are friendly.  Food is awesome.  You get fresh, hot naan to go with your meal.  The buffet selection (about 8-10 main items, not including salad/dessert) is different every visit and never disappoints.  They have both vegetarian and meat options.  They even have self serve hot chai.  My husband and I try to grab lunch here every few weeks, and every time we're always exclaiming to each other how delicious the food is and how much we love it there.  After trying a few other indian restaurants in the area over the years, we've agreed that this one is the best by far.  Can't wait to go back.  Highly recommended."], ["Leslie B.", "Fresh, prompt just good!"], ["J N.", "Terrific food, good service, nice menu selection make for an outstanding experience at this restaurant. My new favorite Indian food restaurant in the Phoenix area! The selection of naan breads is particularly good. Also impressed with the wait staff who were always refilling our drinks and checking on us. Will be back again and again..."], ["M G.", "I had the lunch buffet today and was thoroughly satisfied. I've been here before but it's been a while. It was among the best Indian buffet meals I've had recently. I've given a few other Indian buffets 4 stars but this one is a notch above. All of the entrees were flavorful. They had curry lamb, you don't see that often on a buffet. The curry chicken was unique and delicious. The Tandoori chicken was moist. I liked all of the assorted vegetable entrees. The lentils were great, and I liked the sauteed cabbage and their version of spinach. They also have a small fresh salad bar. I especially liked the dessert. The gulab juman was on point. It was nicely chilled and cooked perfectly like a cake doughnut soaked in syrup. Some places make them too dense and serve them warm ! Craziness. I sampled the rice pudding too and it was excellent. I only drank water but I noticed they have a full bar. I might try them for dinner some time.When I was done eating, I washed my hands in the bathroom and it was immaculate inside. That's always nice to see."], ["Mia D.", "Amazing. I keep going back for more. I'm in love! The ladies are so sweet and always give us a small dessert sample after our meal. One of my favorite restaurants EVER!"], ["Gem V.", "I've been eating here regularly for a few months now and I absolutely love it! The food here (I've tried quite a few dishes) is phenomenal! Some of the best I've ever had. The staff are welcoming and it's a nice quiet atmosphere, at least when I've gone. I would recommend this place to anyone looking to try some authentic, delicious Indian food."], ["Emily Y.", "Tried this place today for the first time, lured by the positive reviews of their lunch buffet. I am extremely happy we went. Good price, authentic atmosphere, attentive service, comfortable seating - and the food - YUM. More than half of the dishes were vegetarian. All were delicious. Not overly spicy, seasoned and cooked well and not, like some Indian food I've had before, layered in grease and oil. We will be back again."], ["Varun S.", "Wasn't great by any means. Three stars at most. Tandoori chicken tasted like it was from a day before. Burnt smell. Was a little disappointed. Not too many choices for buffet compared to other competitors."], ["Lady C.", "Was craving buffet but the asian ones in the area are horrible. Never really had Indian food so I thought I would try it. The buffet didn't look appetizing at all but I felt bad leaving so I thought I would suck it up and just try it. To be honest I don't know the names of any of the things I tried lol the chicken with the red sauce over rice was really good. The tikka chicken? Something like that.Tiny buffet with very limited selections. They had the Indian names of the foods but to someone who doesn't know, that means nothing. I think putting an English description would definitely help.The dessert which was little dough balls or some sort covered in syrup was good. Something different.Truth be told, had I known ahead of time what the buffet consisted of, I probably wouldn't have come. But the food turned out to be good and the staff was very nice.I do have to add that their tap water was actually pretty good! Which is rare when it comes to restaurants in the valley."], ["Mia W.", "I got there right before they closed not realizing it. Not only did they stay open, they were super friendly and welcoming. The food, awesome! Super flavorful and full of spice like I'm used to. They brought a large basket of naan to the table as well. Will definitely go back again!"], ["Jamie A.", "I haven't had the pleasure of sitting in but have ordered food to go from this place. It's become a reliable \"order out\" restaurant in my book (considering the many places we've tried so far) I always order Chicken Tikka Masala along wtih Basmati Rice and Plain Naan (What can I say? It's my favorite and what I use as a comparison for Indian restaurants) Their Vegetable Biryani and Garlic Naan are also worth considering although the garlic naan may be too flavorful."], ["Michele K.", "Heaven on earth if you like Indian food.Been going here 5 years for lunch and dinner.Buffet is super, ask for garlic naan.Tandoori chicken is the best around.  They've been consistent in their food since I\"ve been coming here.  Not worried if the buffet is going to be cold (other Indian buffets I've had have been cold or cool, the food hasn't been completely heated)INdia Palace is Amazing, fresh, yummy, a kaleidascope of flavors.  These guys get 6 STARS.The anise seeds at the bar/cash register is to aid in digestion and/or bad breath, and yes, it tastes like black licorice. It's very strong."], ["Nikki H.", "The lunch buffet is the best. You can try a variety of foods and everything is fabulous! My favorite is the chicken Tikka Masada, Naan, and the rice pudding/gulab jaman (that's probably spelled wrong). Best Indian food around!"], ["Victor R.", "This place offers the best Indian food I have tried in Phoenix. Food is always fresh, service is top notch, naan is made fresh to order with your choice of garlic or regular and the buffet price is great at 8.99! They have good options for vegetarians and meat eaters alike. We have been coming here for the buffet at least once a month since we first discovered India Palace a few years ago."], ["Vicky L.", "I like Indian curry a lot so I was excited to find a lunch buffet nearby, with good Yelp feedbacks and inexpensive price $8.99 per adult.  But...I was pretty disappointed to see this lunch buffet is so small and very limited items. Only 3 meat dishes (2 chicken dishes and minced lamb), 6 vegetarian choices, served with plain seasoned rice and plain naan, plus a mini salad bar.  Comes with hot tea (self-serve).Food taste OK, some are good, but I don't expect excellent food for buffet though.  2 star for the buffet selection. 4 star for good service and dining environment. I might go back for a quick lunch if I'm craving for curry and naan, and hope to find lamb cubes in buffet too.  I was expecting some lamb cube dishes (as seen in other Yelper's lunch buffet photos) but I only found minced lamb. Will probably try their dinner menu in future, hoping that dinner entrees taste better. But for now I continue my search for good Indian buffets in town. Btw,  buffet price for little kids is $5.99 which I think it's kind of expensive for a 4-6 year old, since most dishes are spicy, so kids are mostly eating rice and naan.  I guess it's OK for bigger kids who like spicy food."], ["Aaron T.", "Really good for this type of Indian buffet. Plenty of selection, they keep the naan coming, and there are enough people eating there to turn the food over. We actually walked into another local place offering a buffet, just to try it, but after taking a look we turned around and came here. There's no need to try and upgrade!"], ["Jeremy J.", "India Palace has great food. I've tried many of their dishes and they're all very flavorsome. I like much spice and it took them a few times to get the spice to a heat I was happy with but I wouldn't count that as a negative. Their samosas are fairly nice. Sometimes a little too well done but tasty nonetheless. Their chicken is fairly consistent as far as tenderness goes in their masala and Makhani dishes. Their lamb is a little overdone when I've ordered vindaloo but the spice, taste and service makes up for these minor things (which may not even be an issue to others.) Overall the food, service and price are fantastic. My only complaint would be that the location is not so great and it is easy to miss if you're not sure where you're looking for it. I really like this place and the setting is ambient and service is always happy. Our boys love the food too - especially to gulab jamun and chicken makhani.I've also had their buffets recently and I have to say that the buffet is fantastic. It was about an hour before lunch closing and I was a little skeptical that I'd get the last of the food with it being dry and crusty. I was pleasantly surprised to see that even then they were still bringing out fresh hot food. Tandoori Chicken was great, their chai tea was great and their tikka masala was awesome. This restaurant is my favorite Indian restaurant in the Valley at this point."], ["Alyssa M.", "I love this place! Seriously can't get enough of the customer service ,hospitality, and most importantly the food!!"], ["J. J.", "Been here for dinner a few times and lunch once. The service is good. It taste amazing. You can pick how spicy you like. I personally love the chicken saag. I am addicted. Before coming here I never know that you could change the spice level of Indian food and hated it because I can't do spicy. After this I know why so many people love it. One of the best on this side of town."], ["Matthew D.", "I wasn't a huge fan of Indian food, but the Chicken Tikka Masala here made me a believer.  It's so creamy and buttery, and is perfect when paired with their delectable garlic naan.  We also enjoy their fried vegetable samosas.  Great place to go for dinner, especially because it's never crowded.  Give it a try!"], ["Anupam G.", "One of the best Indian restaurants I've been to in Arizona. Love there buffet. We travel over 40 miles to go to this restaurant. I would definitely recommend this to anyone living/coming to AZ."], ["Leia N.", "This restaurant was delicious. I can't recall the food I ordered, but I know that I ordered an appetizer, main dish, and tea. I was able to taste all the spices that was in the dishes. I would eat here again."], ["Jenn P.", "Great lunch buffet at a very reasonable price. It is very clean in my opinion compared to all the other Asian buffets. I also really like the taste of their Indian food. Very delicious. Very impressed by how friendly their staff is and attentive they are, even during lunch buffet (filling waters, refilling naan, remove used plates).Some people address that there is not enough variety. I think ~6 different curries (and this is just curries, they have other dishes) that they have at one time is a lot but to others it is not. I somewhat understand that but this is not Las Vegas and it is $8.99. I still give it 5/5 because I am one of those people who go to a buffet and eat platefuls of what I like. They have all the essentials so I am a very satisfied, happy, person. They rotate the curries out but have not been able to really see a pattern."], ["Brooke T.", "I've eaten Indian food all over the world including the famous curry mile in Manchester, England and India Palace is some of the best I've ever had. My mom and I shared the  onion naan (slightly spicy?), paneer masala, Murgh makhani (butter chicken) and the vegetable pulao rice. Tons of food, even took home leftovers, and very reasonably priced which is great as Indian food tends to be pretty pricey generally. I had a glass of Malbec and she had lemonade. We walked out for $22/ea and they even brought us a couple of small complimentary deserts to share! Service was exceptional, I think our server was one of the owners. She checked several times to make sure we were enjoying the food. I told her it was some of the best I had ever had and she said \"if there is ever anything not to your liking please just let us know and we will fix it\"! The only drawback for them is they are in the corner of a strip mall and a bit hidden. Well worth the \"hunt\" though! Also the restaurant was very clean, including the restrooms (way important to me), and had lovely colorful decor. They even show Bollywood movies on the very unobtrusive tv :-)I live in Charlotte, NC but my family is in AZ, I will have a hard time not making them take me to India Palace every time I visit!"], ["Kenny R.", "Eat here about once a week, service is good and the food is great. Do yourself a favor and get the madrasi chicken, you can thank me later."], ["Matt C.", "First time here for lunch today.  Definitely coming back.  Great buffet.   Good food. Not greasy or oily at all.  Nice selection.  Clean.  Just wish I'd found this place ages ago."], ["Kenneth Z.", "This place is open pretty late. Tucked in the corner of the center, India palace is a good place to go to for Indian food. I ordered the chicken tikka masala plate with a side of rice. The rice is well cooked and the spice in it is very fresh. The chicken tikka masala is different from the usual ones I've had. It's sweeter and the part of the chicken is different than the chunks you get elsewhere. It's very soft and retains the taste of the chicken well. The sweetness is kind of odd but it is interesting. I don't have a big sweet tooth so I would prefer it to have had a stronger spice taste instead. That being said, the sweetness did complement the sauce well. Pros: - They give you a lot of rice. - You can choose how spicy the dishes are. I love that. - It has a really good Indian feel to it. It doesn't feel fake or a front. Cons:- The fans!!!! Holy Molly.  The ceiling fans spin around under the lights. So you have a shadow of the moving fan moving in a strobe like effect. Gave me a headache. - Not really a con but could be annoying to some: the TV was quite loud and distracting with Indian music videos. I don't mind myself. I feels like it gives it a homey vibe. Bottom line:Good food and wonderful service. They came up to my table just enough time to show me that they were attentive without feel like I was being smothered. Honestly it would be a five star if it weren't for the strobe light effect. It's not just good you have to take into account but the surroundings as well!"], ["Kaitlyn W.", "Good food, good buffet.  I'd come here more often if the lunch buffet had chicken tikka masala.  The service is very nice and friendly.  Everything look clean and well kept up."], ["Ron S.", "I needed spicy food after returning from some travel to a location with bland food.I went back to India Palace upon my return two weeks ago and was impressed by the improvement from solid good to very good across our favorite dishes (chicken tikka masala, lamb biryani, lamb vindaloo and chicken curry).Today I picked up carry out expecting a similar experience but was surprised that what had been good to very good now was great to amazing.  The chicken tikka masala was the best I have had in years.   My lips are still burning from the spiciness of the lamb vindaloo which was just the way I love it; very, very spicy and flavorful.I do not know what the difference is but India Palace has impressed me, a long time customer. While the biryani was not as spicy as the lamb vindaloo, it was the most flavorful biryani I have had in probably ten years.All in all a splendid experience."], ["Michael A.", "India Palace has an authentic atmosphere that never feels too loud or cramped. The food is fantastic, portion appropriate and deliciousness renditions of all types of cuisine from India. Though it is a simple gesture, I absolutely love getting complimentary papadom and sauces with every meal, and then their rice is amazing (I don't even like rice) with a refreshing touch of cumin. The staff and hostess are always incredibly friendly and personable."], ["Justin M.", "First time - won't be the last!I like to rate businesses according to their competition, what you would expect there, or other comparable businesses. We decided to try India Palace because of the Yelp reviews (don't know how I didn't find this place sooner) and I was REALLY in the mood for some Indian food and (thankfully) my boyfriend has begun to appreciate it more and more so we decided to try a new place. I had only been to 2 or 3 other restaurants in the Valley since I moved here and I thought I had found my go-to...well, turns out, I have a new one. We learned that this was a new location for the business, that they had moved recently from a location they had been in for years. We thought it was decent, well decorated, we were comfortable there. It was really slow and we wondered why, but whatever - better service for us eh?And it was! Besides the food being SPOT ON - the service was so attentive, personal and friendly we not only had our tummys warmed by the culinary loving but also our spirits by just having some nice conversation with our server (whom we didn't get her name but she had just moved to Phoenix from Flagstaff where she worked for their location there which we are definitely making note to try next time we go up North!). For our visit, we stuck with some of my usual Indian faves - Shrimp Curry (medium heat) w/ Garlic Naan and Basmati rice and then the MIXED TANDOORI GRILL (OMG, best I have had, served on a sizzling plate with vegetables and onions, tender and not dry). We had a little RICE PUDDING with some INDIAN TEA to finish which was a perfect combination. (Sorry, I CAPITALIZE the food I had/recommend for the skim-readers.)We cannot wait to go back and bring some other family and friends who want to try Indian food, probably try the buffet!"], ["Randy B.", "I love this place. I have a habit of ordering the same thing because its so good. We order the Lamb Korma. Its tender an flavorful. Then the bread called garlic naan. It has lots of fresh herbs on top. Its close to pita bread but much better. I come here a few times a month and its always a hit."], ["Angelo T.", "The food is amazing. It feel like in India and the best part is that you can order the meal mild, spicy or super spicy and they will do it for you. Totally worthy and succulent"], ["Blaine B.", "We finally found some good Indian food in the North Phoenix area!  The staff is so pleasant and helpful.  We enjoyed the samosas, chicken tikka masala, chicken saag and garlic naan."], ["Katie E.", "When I tell you this is the best most authentic Indian restaurant I mean it. Best part is it is a family run place and they truly go out of their way to make sure your experience is amazing.  Now let's talk about the food.... Aaaaammmaazzzinnngg!!!! I crave it when I am not here, and bring everyone I know!!! Great environment and good portion sizes... Let's not forget the chai iced tea!!! I love all the employees in here!"], ["Jimmy F.", "While they do have a few meat dishes I have to say as a vegetarian this place is awesome. I've been to Indian buffets in the surrounding area that have a larger selection but this is quality vs quantity. I do enjoy the occasional dish that sets my tongue ablaze but this place uses the flames in moderation. Great customer service, atmosphere and most importantly the food was delightful. A pleasant experience that will have me coming back for more."], ["Mariano G.", "This place was Amazing! This was our first time and we were so pleased. The food was flavorful and unique. The beef and chicken was so tender and so well cooked. The sizzling plates of food make you taste buds water. This is a place we will come over and over again. The staff was so helpful and kind. Great experience!"], ["Cemone K.", "4.5 stars!SO FAR (I've been living here two months now) this is the best indian food place I've tried. Makes me wonder why the reviews are so average for this place? The service is so-so but the food was great! Had the tadoori chicken plate on a bed of onions and bell peppers, lamb curry, and garlic naan. Chicken was perfect, moist on the inside and had a nice grilled flavor. Lamb curry was perfectly spiced with tender pieces of lamb, and the potatoes were a nice touch. Naan came out hot, crispy and garlicky, great for dipping into the curry. Mango Lassi was not watered down and was the real deal. I actually had to ask for extra ice to dilute it because it was so thick, yay more lassi for me!Price is pretty standard for a indian restaurant, but I'd want to come for the lunch buffet and try out some other dishes (chicken tikka masala, biryani).Can't wait to come back!"], ["Tai Vati B.", "Great food here! I enjoyed the Lamb Korma and of course a cup of Mango Lassi. This place is a good place for groups. They also have a lunch buffet 7 days a week. Oh, and great customer service!"], ["Sean G.", "Love love the food, the services super nice and the favors right on.  I suggest you guys try it out."], ["Ízandro M.", "I love this restaurant! It is my absolute favorite Indian restaurant in the Valley and I've been coming here for years! Very friendly and always accommodate my crazy requests. They have the best naan in town and I haven't had a dish that I wasn't crazy about. It is a little far for me, but well worth the drive!"], ["Jafar M.", "Food still good, however I feel like it's quality declining gradually... Maybe update and change the buffet menu sometime?"], ["Jenny N.", "Best indian food on this side, not greasy and authentic with the flavoring and the service was great. My water was never empty."], ["Sal S.", "Best Indian food ever the friendly environment you should try the lamb korma and garlic naan deal will get addicted to it"], ["Zath S.", "My wife and I ate here today and the food was amazing the service was great. they serve chai tea and naan with the meal. I'm heading back soon!  Thanks for a great meal."], ["Vishi B.", "The food was alright. I went in for lunch buffet. Service was great but food not so much. Being an indian i guess i am more aware of the flavors and thats exactly what was missing. Desserts were terrible their gulab jamun was hard as a rock and the kheer was missing its main ingredient SUGAR. I give this an average go."], ["Heather W.", "Amazing food!!!! We had the chicken misala, butter chicken, and beef curry. We will definitely be back for more."], ["B L.", "Went for dinner rather than the lunch buffet.  Service was a little slow but they were pretty busy (Valentine's Day) so it made sense.  The lamb curry and chicken vindaloo were very good.  The basmati rice was delicious.  Both the garlic and plain naan were excellent.  The portions are large.  One entree and one rice dish would have been plenty for two.  Otherwise, there's enough left to take home for lunch the next day!"], ["Amber M.", "We go here at least once a week & have always been welcomed by a great staff serving the best Indian food in town. Highly recommended by my whole family ranging from food allergies to extremely picky eaters, everyone always leaves here happy!"], ["D K.", "Pleasing and gentle people serving delicious food in a relaxing setting.  This place is worth checking out."]], "New India Bazaar": [["Joe R.", "Indian buffet for $7.99...How can you go wrong?This small restaurant is tucked away in a well stocked Indian market on 7th Ave, south of Virginia Avenue.  The buffet is small, and the food is well prepared and tasty.   Most of the main dishes have been the same the few times we have been here, but on the other hand, you can count on your favorites being there next time you go, and being sure that you can get your fix.The Chicken Tikka Marsala is my favorite, along with the vegetable pakoras, and of course, the freshly cooked naan brought to your table.  I have never been a fan of samosas, however my vegetarian friend tells me they are the best around. My only complaint would be that the gulab jamun are not served warm.If you are looking for a classy Indian restaurant to bring a date, this is not it.  It is simple place with the most basic of tables and decor.If you are looking for a good Indian food at a very good price, then you need to try this hideaway."], ["Terry C.", "Friendly staff, good nan, but limited selection and food was not very fresh, probably because I was there late... may be better earlier in the lunch day."], ["Evan B.", "Chatt, Tea and Pizza three of the surprised I found on my last trip. Most buffets have the usual suspects garnished with rice naan and some condiments. But to have a Chatt available?  Chai Tea (included) and even pizza (yes Indian style veggie pizza and its good)This is why I am so in love with this place, 1 Great Flavor, you can beat the unmuted flavors that sing in your mouth. 2. variety, there is more to Indian the palak paneer and tandori chicken and pakora. 3. Value great price for a wide range of options. Next time you are in take a look at the left end of the buffet first and see if you can find a Chaat."], ["Aja C.", "Buffet is the best. We used to order out for dinner all the time, but now we enjoy the buffet so much we almost only go for lunch.Try the bakery items in the little store. Ask someone who looks like they know what they are talking about to explain what they all are. I like the little cashew diamonds!We have even purchased the music videos from here after being so entertained during dinner and lunch!"], ["Butters U.", "The food is so delicious and makes my belly extremely happy! The flavor is literally like a punch in the mouth. The desserts are also awesome and fun to pick out: )  the chicken tikka masala is my favorite. And this is my favorite place to get the masala!"], ["Liz S.", "Lunch buffet is so good!  And the staff really couldn't be nicer.My husband and I have been twice, once for take-out and once for lunch.  The friendly man at the counter took the time to explain the difference between northern and southern indian cuisine to us, which was very helpful.  Everything we have had has tasted great, but I especially love their samosas, which are also included in the lunch buffet.  We are happy to make this our new indian food spot!"], ["Kritika S.", "Food is average, service is poor. We ordered thalis and the quantity was too much for a single person."], ["Cherry G.", "They do a different rendition of the Gobi 65 that is quite tasty. Wish they had a vegetarian price on the buffet though, the current price is okay for meat items but kind of pricy for spinach and potatoes. I visit the grocery next door quite often to grab good heat and serve foods and yogurt drinks to carry to work."], ["Alena M.", "Last night was our first time at New India. I came in with four other friends. One of us is gluten-intolerant, and the rest are vegetarians. This is a WONDERLAND for anyone with vegetarian tendencies, though they also have a meat menu for the carnivores.I had the palak paneer. The dinner ($12) comes with rice, curried vegetables, salad, raiti (yogurt), naan and a pickled side and a dessert. It's enough to have 2-3x leftovers. The food is delicious. If you love Indian food, but only can afford the buffet during lunch at most places... you'll love it here. It's affordable, genuine, and ridiculously good. I'm coming back!"], ["Diana W.", "Let me first say that I have no problem with the food here. The food is great. Absolutely delicious. That said, it takes some pretty dang atrocious service to get me to give a restaurant that delicious only two stars.My boyfriend is lactose intolerant. The first time we went here, we had no issues with that. The second time we went, he ordered something that didn't say it included dairy on the menu, and it came covered in yogurt sauce. Fair enough, we should have asked. When we brought it up with the waitress that he couldn't eat this, the first thing she said was \"You still have to pay for it.\"We decided to try it again because it was so tasty. This time, before we ordered, we asked which menu items were dairy-free. The same waitress, this sullen older lady who clearly doesn't want to be there, just said, \"I have no idea.\" And stood there. We had to bludgeon her into getting the chef to come out and talk to us about dairy content because she had no interest in knowing or finding out. Classy. At least the chef was friendly enough. Like I said, the food was great, but I'm not going to keep going to a restaurant where the staff treats us like crap."], ["Edward W.", "Great, tasty Indian food. I love this little buffet. It is hard to find better in the Phoenix metro area,."], ["Chuck B.", "Have been here a couple of times. The food is great and so is the service. Love this place."], ["Christopher B.", "The lunch buffet is a good value at $7.99.  There was a standard selection of typical dishes, from tasty samosas to tandoori chicken and chicken tikka.  I appreciated that some of the dishes had a little kick and weren't dumbed-down to cater toward an uncultured American palate.  The buffet also came with some very plain but fresh and warm naan.The service was average and the decor is very basic.  A small Indian grocery store is also located within the building."], ["Taylor Marie B.", "The buffet is delicious! Hard to find Indian food such as this around phx. The service is a little funky but it's a store and a restaurant, I think if I were Indian I would have probably had better service"], ["Jeremy P.", "I've been looking for a decent Indian option in Central Phoenix, and this place seemed to be getting the best reviews.The good?  The naan was at the table when we were ready to eat, which is nice.  The service really was pretty decent here.  They had veggie samosas, and a couple of different daal dishes.  The paneer tikka or whatever it was called was good, and something I don't typically see on Indian buffets.Unfortunately, the curries seemed a little too soupy for my taste, and there were only two options (Curry Chicken and Butter Chicken, booooooring).I guess I'm now spoiled after so many excellent trips to Kabab Palace in Tempe.  Oh well, I guess I still don't have a good Indian option for Central Phoenix.  At least the price was reasonable."], ["Al MonRok A.", "This will be my go-to place for Indian in central Phoenix. I am pleasantly delighted with the flavors and textures- the chicken in the butter chicken is tender and the samosa's outer shell is firm yet flaky to hold the mildly spiced vegetables, namely potatoes and peas. I have identified that one of my guilty pleasures in the carb family is garlic naan. Man, it's good here. The dining room is bright and colorful- it backs up to the classy Bandaids club. I suppose it adds to the \"exotic ness\" of the experience. All in all, I would love to come back and try ordering off the menu. The buffet is $8.99 on weekends and I got to try lots of wonderful things."], ["Laura R.", "I've been going to this place since it was a handful of tables inside the grocery store. For a while, I was there almost weekly. Not only is their thali dinner the best value for Indian food in Phoenix, but I have received the warmest service most of the time. I moved out of Phoenix last year and had not been back in quite a while, but when I returned I was still recognized. When the server discovered my friend had never tried Indian, she insisted on bringing a variety of food for her to try so that she would know what she liked. Try the butter chicken - it's the best!"], ["Peter M.", "Good variety, and very high quality food. I come by for the all-you-can-eat buffet just about every weekend and I am in love with the Chicken Tikki Masala. Good selection of imported ingredients from India in the store next to the restaurant shows that these people know their stuff!"], ["Katy F.", "Loved coming to New India Bazzar for the first time! All of the buffet food was fresh and hot! The tandoori chicken is to die for!"], ["Gene G.", "I really enjoy this place. With a new addition to my family, my wife and I are looking for less formal and less expensive places to eat. We started eating here because the Phoenix Community Acupuncture was across the parking lot. We really feel as if we've found a gem in our part of town. Informal, connected to a store and there are places where Baliwood videos could be turned down...but well worth it. We have gone for the buffet each time we have gone. The price is very reasonable and they don't mind that our one year old picks off of our plates. Everything is good, but the Tika Masala was very tender and delicious."]], "Nandini Indian Cuisine": [["Alan W.", "By far the best Indian buffet around. The only place I've tried where the \"spicy\" actually has some kick. The Chicken Vindaloo was wonderful. Plenty of vegetarian options and they are also tastier than average buffet offerings. This place is really under appreciated... It should have been packed but before Noon on a Sunday very few were there. Highly recommend if you like Indian cuisine.  Don't overlook this great tasting food!"], ["Surendra R.", "Okay, I read the reviews here and was so excited (as I was craving for the Indian food and Mimosa in the lunch price) that I drove for half an hour. to their credit I will give1) They might have great dinner as the items maybe made little, fresh. 2) I arrived for Saturday brunch at 1:30 (an hour before the close.) so they might not feel like providing fresh items.But I was so disappointed that I almost threw up.1) Food items were sitting there, stale. Samosa sitting on dripping oil pan,2) Tandoori chicken was not from tandoor but from a frying pan, probably after they did their first round, for the second round they just deep fried them again in oil. And boy that red color is going to cause cancer.3) There were no meat pieces in lamb curry, nothing had the flavor though the ingredients were there. 4) Tea in the cattle was also probably sitting there for an hour or two.5) Saw carrot halwa again loaded with food color so passed it.6) Rice pudding was just boiled rice dropped in milk, I passed that too.7) Naan was to come to table I thought that maybe made fresh. but nope they had already cooked them so I asked him to touch and see how flat and cold it was.8) The guy behind the bar had his laptop playing some hindi news video loud while some sad song was going on On desi TV (so cacophony did not help either.)9) I almost fell as there is a floor drop after the buffet counter and no warning signs.Finally I had to tell the owner that this is horrible, he offered to bring more naan (hot) but I did not want to microwave the stale food so left. My suggestion, Go withing first thirty min of lunch opening and Check out the buffet items before you sit down, else go elsewhere if they are not looking fresh."], ["J B.", "Great service, great flavors. WOW!  can't wait to go back.  My co-workers visiting from India put this at the top of the list for authentic flavors of home. Good for all-veggie/vegan options.  We had the buffet, which was good variety and really good quality.The place is clean, but very simple décor."], ["Leanna A.", "I came here for an early lunch with a friend, and boy was I surprised. Fellow Yelpers, you did me well. They have a lunch buffet that lasts until 2:30, and they even offered us champagne or mimosas included in the buffet price. A little early for alcohol, I declined; though a very nice touch. Their lunch buffet is very thorough for Indian cuisine. Although I'm not the Indian food expert, I know they had dishes like tandoori chicken, samosas, a few different curries, lamb and plenty of other options including fresh fruit and if I can remember correctly a salad. They also have spiced rice available and garlic naan that is served hot to your table. Make sure to ask for the naan though, as it is made to order versus being out at the buffet. My favorite of their items was one of the yellow curries, the samosas, and the spiced rice. Their tandoori chicken was also really good, but I feel like I've had better at similar mom and pop Indian restaurants. The service was stellar. You could tell that the gentleman serving us really did care about the/his business. And that's what really goes far in the restaurant industry. I will most definitely return for unlimited Indian food at around $11 or so a plate."], ["Thomas T.", "WOW! This place is amazing!! When I came in there was only one guy working. But that guy was busting his ass off! He was working hard and served 3 familys, 1 women, and a couple, us. And our food arrived at our table at a reasonable time! Enough about the hard working guy though and on with the food.We ordered -Chicken tikki masala (spicy)-lamb vindaloo(spicy)-basmati rice-plain nann-garlic nann-waterEverything we ordered was great, besides the water, that was a little plain.But really the food was soooooo freakin good. The first bite I took sent me into an orgasmic state and my toes started to curl. The second bite made my eyes roll back and my back arch. By the fourth bite my wife was starting to question if some other woman was giving me a bj under the table! Well, unfortunately there wasn't any women under the table but the food sure was great!!!"], ["Gemma N.", "Excellent little buffet. Very filling. And a variation of flavors. Almost hard to eat more than one plate because the cuisine is so filling with the rice. Super nice staff. A must try"], ["Patrick B.", "Delicious food but the place has a roach problem. While eating, I saw a baby roach crawling on the wall next to me. I killed it and continued eating thinking he might have just snuck in. As we were finishing our meal another one crawled onto the table. We paid our bill and decided it would be our first and last visit. Too bad too, they had some really good food."], ["Wei Y.", "I've visited Nandini's lunch buffets for approximately 5 times over the last year. Initially, I was really impressed with the spread and the price (i twas 7.99 a year ago). The mango lassi, was good, although sweet. Their tandoori chicken was delicious, better than most other Indian buffets. They also had lamb curry when it was 7.99.Now, the price is 9.99, and a lot of things changed. I was expecting the food to get better when they raised the price, but they did not. During my most recent visit, there's no longer lamb, the naan was over-charred, and the tandoori chicken doesn't taste as good anymore.What happened here? Nandini used to be cheaper and better! Now, it's just decent and priced same as other Indian Buffets. It's still worth a try for yourself, but I will stop frequenting Nandini."], ["Stone Z.", "I'm a big fan of indian food. I don't think I have ever had \"bad\" indian food. It's probably because they put so many spices in their food. I lived really close to this place so it was my go to Indian Spot. I spent a lot of money on Delivery and even though I lived about 5 minutes from this place, one time it took them 2+ hours to get to my place. However, dinning in is pretty nice. I would recommend this place. :D"], ["Wendy C.", "Nandini's serves superb Indian cuisine!!! I couldn't eat as much as I usually can because the food was SO EXCELLENT!!! I have been there two times this week!!! I Love Indian food and This restaurant is particularly good!!! Wendy"], ["Danielle L.", "We were looking for Indian cuisine following our evening at the Botanical Garden. I have not had good Indian cuisine since moving back to the States in 2009 and this restaurant was hands down incredible! Everything was traditional, traditionally made in the clay oven, exquisite flavors in every bite. I highly recommend this place. This will be our go to now for Indian cuisine from here on out. We had the papadums with chutney which I couldn't stop eating. The garlic and buttered naan were absolutely perfect in flavor and texture. We shared the traditional chais, the Chicken Korma, the Chicken Vindaloo and the Basmati  rice and all of it was cooked to perfection and tasted amazing. Can't believe we were so lucky to find such an incredibly hospitable and excellent restaurant to include the owners and we hope to pass it on to everyone we know. Do not allow the one or two bad reviews to convince you to miss out on this awesome food and service."], ["Alycia S.", "The food is definitely amazing. And i would absolutely eat here again.BUT, just a little upset. I ordered for a to go, and had someone else pick it up. When I got to it I realized they ADDED items to my order, and I was CHARGED for them. Also, to go food  was HALF what you get in the restaurant, yet not half the price you pay..."], ["Julia L.", "Nandinis is hands down the best Indian Buffett in the valley. the rice is perfect, mango lassi and chai come with the meal (and they are both delicious), and all the food is spectacular. I love the tandoori chicken, spinach (paneer I think?) and the paneer masala. Oh an the naan, it is uncomparable. So hot and so garlicky, it might be worth the trip just for the naan. The buffet also has dessert. I am a massive fan of their rice pudding. So food is 5 stars. Service is also 5 stars. We were given plenty of attention and rarely had a dirty dish on the table. The Buffett has a nice ambience and is very clean. At around $11-12 for weekends and $9-10 on weekdays, this place it is affordable but I wish it were a bit cheaper so I could come more often. That being said it is probably some of the best Indian food you will ever eat in Arizona."], ["Joseph A.", "Finally!! Spicy and legit Indian. Good sized portions and excellent service. So glad we found this place."], ["Jess W.", "This is the best Indian food I've found in the Valley, by far.Seriously. Anyone who says vegetarian food is boring needs to try this place! My favorite is the Malai Kofta, which is CRAZY DELICIOUS ground veggie and Indian cottage dumplings simmered in nuts and a creamy sauce. I've also enjoyed the garlic naan, Samosa Chaat, Mutter Paneer and Palak Paneer here. If you like your Indian food spicy, as I do, emphasize spicy/very spicy when you order. I happen to agree with others that you really shouldn't have to pay for rice with your entree...but I've found that one order of rice is plenty for two people to share, so that helps. As for those that complain about portion size, they are right, you don't get a huge portion, but then again this isn't Applebee's. Neither of these things are big enough issues for me to deduct a star or stop coming here.I can't wait for the next time I'm in Tempe as this is an obvious choice for delicious food with efficient and friendly service!"], ["William L.", "Went today with the family as we were craving indian food. Ending up doing their lunch buffet. They had a great selection of the usual lamb, chicken, and vegetarian dishes. My personal favorites of all the ones I tried was the Paneer Shahi and the Chicken Tikka Masala. These two dishes accompanied by their Garlic Naan was delicious. Very garlicky and not too oily (some other restaurants make their Naan with quite a bit of lard).The only thing that I could really ding this place on was the cleanliness. The linens looked like they hadn't been laundered in years (and were quite dirty) and some of the \"clean\" dishes I grabbed for on going to the buffet table wasn't actually clean.Overall, I would definitely say give this place a chance based on the Indian cuisine but would really recommend you bring some wet wipes to clean your table beforehand."], ["Masta' C.", "I was contacted by the owners after posting my initial review a few months ago, where I had rated Nandini a much deserved 2 stars.  The owners asked me to return and even offered me a free meal, which is more than most restaurants will concede these days and was greatly appreciated, but I wanted any future visits to be on my terms, so I cordially declined their free food and promised I would return on a day of my choosing.  Well, today was that day.  I returned to give Nandini a second chance and took both friends and family with me to gather their opinions, as well.  The consensus?  In some ways, the experience was better than last time.  In other ways, it was largely the same.Compared to my first visit, the food was somewhat better tonight.  The Paneer was in cubes, rather than the ground up curds we received the first time.  The Makhani, although still seriously lacking in spice and flavor, was far less overbearing on the butter and cream elements, which made it easier to eat and easier on the stomach afterwards.  The Tikka Masala was still only \"ok\", also lacking in spice, but was far better seasoned than the Makhani and one of the better dishes we tried this evening.  The chicken in the Tikka Masala was cooked well and there was plenty of it to go around.  Additionally, the Naan was made much, much better than before and it wasn't burned.  The Garlic Naan had no hint of Garlic seasoning, but the Paneer Naan and plain Naans were as expected.The Samosas Chaat tasted great, possibly the best dish we received, but it was far from perfect.  The Samosas themselves were very hard and there was so much sauce on the plate (and so few chickpeas) that it was more like Samosa soup!  Nonetheless, the taste was there and the extra sauce, though a bit unattractive and messy in appearance, tasted great on the extra Naan and rice we had left over.Service was slightly better this time, as well.  As before, only a few tables came in while we ate and one server was tending to everyone, but the pace was perfectly acceptable and we never felt neglected by our server. Food arrived rather quickly and the atmosphere was much as it was before...plain and casual, but reasonably comfortable.My conclusion...Overall, the prices at Nandini are still quite high for the quality of food and while the dishes were generally more palatable then before, they weren't without flaws.  The curries, which were among the most expensive items on the menu, remained very \"one-dimensional\" in flavor compared to most Indian food I have eaten here and in India.Still, there were enough improvements to the overall experience that I feel I can increase the star rating from 2 to 3 stars, meaning Nandini is \"good\" in my book, but not \"great\" and certainly not \"excellent\".I appreciate the owners reaching out and expressing their concern after my initial review.  That meant a lot to me and is largely why I gave them a second chance.  As for the likelihood that I will return again...only time will tell.  There are certainly better Indian restaurants around, especially for the price.  However, Nandini is far from the worst.  Perhaps I will return later this year to see if things continue to progress at Nandini.  Until then, I hope the owners will take my words to heart and continue to improve the quality, flavor and overall value of their food."], ["Marcie B.", "Love their lunch time buffet for just $10.  The bread is awesome too.  Environment is casual, very simple and clean.   Highly recommend this place."], ["Kelvin O.", "I had the Entertainment coupon and had to try their dinners. It was amazing. The garlic naan was good and not dried up like others. The lunch buffet was tasty without overly pricey. Good place for Indian food."], ["Jodie Crawford C.", "The lunch buffet was amazing! The most delicious curry I personally have ever had and the assortment of dishes was fantastic. Highly recommend this place and the mango/coconut tea for dessert magnificent!"], ["Kayla M.", "If I could give this place a zero star then I would! The staff are misleading, rude and the food is ok but way too $$$$ for food that looks like what I feed my dog. We wanted to try a new restaurant and what a bad mistake this restaurant is. The staff treats women with less respect, the employees walk around with poor hygiene and like they hate their job. They let a homeless man walk around while people are eating. I am fine with the man getting water but at least don't have him come in every five minutes and make the guests feel out of place. When we ordered our food the server asked what bread we would like. I asked if it was included and didn't tell us how much it was extra. So when I got my bill they not only forgot about taking off the groupons but also pointed out rudely to me (a woman) that the fine print said one per table. I used to be a server and you never are rude to a customer nor do you charge them something without them knowing about it first. So the groupons were never used or given back. So a $20 dinner turned into a $50. WOSRT RESTAURANT EXPERIENCE EVER!!!!WATCH OUT FOR THEM CHARGING YOU WITHOUT YOUR KNOWLEDGE!!!!!!"], ["Tovah R.", "Growing up, I always ate at Indian restaurants with my family, so I have a pretty good idea of what good, fresh Indian food tastes like. I am so glad that I moved right down the street from Nandini because they bring great, delicious food to the table.I first tried this restaurant on August 28th for dinner with my boyfriend. When we were seated we got complimentary pink lemonade and some papadum to share. We ordered the Chicken tikka masala, baingan bharta, naan, and rice. Everything came out in a timely fashion and was nice and hot. The naan tasted like it had just come out of the tandoori oven. The flavors were delicious and right on target. As we finished up, we got some complimentary gulab jamun for dessert. I walked out that night one happy girl.Finally, on September 14th I got to come back to try the lunch buffet. They had all of the classic favorites out plus a few other dishes. Expect to see chicken tikka masala, shahi paneer, palak paneer, chicken vindaloo, dal makhani, among others. You can choose either basmati rice or vegetable biryani. They also have some desserts such as gulab jamnu, rice kheer and carrot halwa. Another plus of the buffet is that they have self-serve mango lassi and give every table garlic naan! What more could you ask for, for only $6.99 a person?!? So inexpensive for such a great deal of food and drink.I have already been there 4 times (3 times in 2 weeks) and don't plan on stopping anytime soon. The owner recognizes my boyfriend and I every time we walk in the door, he is such a nice gentleman. The wait staff are also good, keeping drinks filled and always asking if we need anything. This is definitely my new favorite lunch spot! Recommend to any Indian cuisine connoisseur."], ["Robert D.", "This place is superb and my girlfriend and I have made it our regular spot. Simply the best indian food outside of the subcontinent. Popular with the Tempe crowd and the local indian community. Their lunch Buffett is so good i felt guilty for eating so much, but the bill was so cheap! Its also the only place that gives you complementary mango lassi and garlic Naan."], ["Christopher H.", "Absolutely loved it. Great pricing and big portions. Service was a little slow but all around a great place to have a dinner. The ticket time was 12 minutes so the kitchen was very quick , always a plus!"], ["Tiffany T.", "My friend and I came here on a whim. It was pretty empty, though we did arrive a little late, and overall has a diner feel. The service is really awesome though; we were greeted right away and sat in a cozy booth. My friend did notice that the ceiling fan caused the lights above to have a strobe effect, but upon request, they turned off the fans. The food is great. I've never been much into Indian food, so when I asked for recommendations, they suggested the Chicken Tikka Masala. Now I keep thinking about going back to have it again! We also shared a garlic naan, which is also really good. Highly recommend this place!"], ["CaveatEmptor E.", "My family and I were in Tempe area and looking for a place to eat. As with everything, I like to research recommendations through Yelp. Nandini Indian Cuisine is highly rated so we decided to give it a try. The Sunday champagne buffet brunch was very reasonably priced. We thoroughly enjoyed the flavorful varieties of dishes. The curries, naan bread, and samosas were delicious and perfectly seasoned. I highly recommend this restaurant if you are craving great Indian food and attentive service. My family and I will definitely be repeat customers."], ["Tawnie O.", "Food was good, but super pricey. Also service was SUPER slow. Not coming back because it's expensive. Update: got an upset stomach after."], ["Albert H.", "After hearing there was some atmosphere improvements over the last place in this location I was disappointed to see the McDonald's style tile floor still there, and the booths were quite retro and old looking, but not in a good way.  My server was not Indian and had trouble with the menu names, which is a rare occurrence for an Indian restaurant.  My spirits turned around when I saw some modest prices on the menu, especially vegetable entrees.  However when they came out, the portions were noticeably smaller than what I normally receive.  They used the same or similar serving dishes, but the amount of potatoes, peas, and then chickpeas in the other were just not very full.  To make things worse, they entrees were nowhere near the correct spice level (way too mild) to the point where I wondered if they confused my order with someone else's.  Bread was tasty though."], ["Joseph G.", "Delicious. Friendly. Authentic. The owner is extremely kind. He gave great recommendations and mentioned an affordable lunch buffet. I will definitely be coming back to try that."], ["+TheGeneralofHope +.", "This place may be having an, \"off night.\" The service was good - the appetizer was fantastic! The Vegetable Biryani rice had shavings of carrots and a few peas but lacked vegetables. It was basically seasoned rice with a light sprinkling of vegetable matter. When we first arrived, the white paper place mats had food stains, the silverware was spotted as were our glasses. The server we had, a cool small-built man with a mustache, switched everything up for us. He couldn't have been better. He gets 5 stars!2 stars for the main dish, dirty table settings and 4 stars for the service and appetizer."], ["Usaf V.", "I visited this restaurant during lunch for the first time and had the buffet. The mango lassie was super delicious and the food here was very good, hot, and affordable. The selection at the buffet was decent but I would have liked for lamb to have been available. Overall the experience was very nice, the waiters were pleasant, and the dining area was very spacious. I will definitely be going back!"], ["Amrit S.", "I was just crossing from the streets and came across the place.Good is average. Only Panner was yummy as per me.Sweets were really good. I wouldn't want to come back but wouldn't avoid if I was near by."], ["Cata R.", "This place is incredibly amazing, The Food was Great and the service awesome..I will come back for sure!!!! BEST Indian Food in Tempe.."], ["Lucy Y.", "When trying a new restaurant we like order the same thing. We started withSamosa great flavor and the shell was thin and not doughy. Then we had the Alogobi  baggan barta , chicken tikki marshala . All delicious and excellent flavor.We plan to return . And enjoy some of their tandoori. Friendly and fastService. Worth a visit"], ["Mohammed A.", "Upon walking in the restaurant,  we were a bit put off. There was a strong sewage smell and the interior looked like it had seen its best days in the early 80's. HOWEVER, we stuck it out and ordered.The food was worth enduring the smell. We ordered chicken biriyani and chicken tikka masala. Both were some of the best we've ever tried. A little disappointed that rice didnt come with the chicken dish and cost extra...but even so, it didnt dampen the experience.Like others we were given a complimentary drink (pink lemonade) and dessert (donut holes in syrup), which was a nice add-on.Service was very good. The gentleman that waited on us was very friendly and quick to help us."], ["Patricia M.", "As we pulled up in the parking lot I was skeptical about whether or not I would be the 44th five star review for this restaurant. But the food was delicious, the service was friendly, and we rolled out of there with really full bellies. The naan was spectacular, the tamarind sauce and mint chutney were perfect, I loved the palak paneer, and the tandoori chicken. The owner said they've only been open for two months and my guess is they will be around for a long time."], ["Denise H.", "Omg great good food.. and excellent service and nice people..We went when they had buffet syle which I normally dont do!! but this was top notch.. Cannot wait to come for dinner.. Manager was very nice and gave of tips what to try next time.. Will definitely come back again. And there bread.. OMG.( best)  I could not stop eating.."], ["Joseph S.", "Just as good as it's always been!  Started with the vegetable samosas.  Perfectly prepared, crispy on the outside, soft, warm, and tasty on the inside. Then the Lamb Tikka Masala, the Chicken Korma, and of course the Garlic Naan!The sauces of each dish were perfectly spiced and the perfect size for two to share. So good, you can't stop eating  Oh, and the Naan.  Oh the Naan!!  The perfect compliment to a fine time. Not to be missed."], ["Nathaniel P.", "I've never had anyone come after me for posting my experience on here, but it won't stop with this guy, he's abusive if you get on his bad side, everyone can make up their own mind. Here's his latest message to me:\"Please be ready to get attacked if you try to be unreasonable.We also do not want to serve you if you are mistaking our hospitality our weakness or an olive branch. In fact customers like you hardly matters to any business as you do not want solution but your own ego satisfactionWe dispatch more than ten to go orders everyday and have never received any such complaints.so your feedback is highly exaggeration and ridiculous.and now GOODBYE cry baby.\" -Satnam S."], ["Al M.", "-Wide variety and selection of tasty Nan Breads-In-site fully stocked bar (must try the excellent King Fisher beer)-Attentive yet non-obtrusive service-Great Buffet and A La Carte-Friendly service (they really appreciate their customers)-All you can drink Lassi with the buffet-In my opinion Food is very good yet not spiced up to extra-hot original Indian standards, which I appreciate-Brought a friend and he insisted on coming back here-I have made it a point to come back more regularly myself -Positive experience all around, thank you!"]], "Ruchi Vegetarian South Indian Cuisine": [["Erika D.", "This is absolutely delicious, fresh, quality Indian food.  My husband and I had the buffet. A generous spread of variety for exploration.  Perfectly seasoned food. Love the heat!  Just enough spice to pleasantly warm your mouth and lips. Mango lassies are freshly blended & fabulous.  A great compliment to the curries and spices. The service was gracious and attentive. Wonderful restaurant for vegans and vegetarians who enjoy large selections. Ruchi is a real treat!  Superior preparation of South Indian Food. This gem is tucked on the corner of Warner & Dobson."], ["Alexandre T.", "Every little detail is carefully mastered here, papa dams, teas, dishes, service. Hands down best indian spot I've eaten at for the longest time, and trust me I've had few."], ["R K.", "Went for buffet on a Sunday. Great food, a tad bit on the spicy side but no complains. Favorite was the dosa and the potato filling. Only the vada was not good,  everything was up to the mark. Will be back for sure"], ["Anupam G.", "I've been in Arizona for 2 years now and I can't believe I hadn't heard about this place. It's amazing. I love how warm their staff is. We ordered Mysore Masala Dosa's which were delicious. Way better than any others I've tried in AZ. Vadda was good and their Gobi Manchurian was amazing! Try their halwa ice cream and you won't be disappointed. I'm definitely going back next weekend for their lunch buffet."], ["Ryan D.", "Awesome thaili. Authentic vegetarian food from Tamilnadu. The idlis, dosas and vadas are really good too. Try the platter for appetizer. Was in Chandler for a week and ate dinner at this place 3 days. Did not feel like trying out other indian places in the area since i was more interested to try different dishes on their menu :D"], ["S Wilson W.", "I found this wonderful Indian place while I was out with my wife promoting our business. It has the best menu I have seen for a buffet. It changes daily and I just love eating Southern Indian cuisine . The owner and staff are super personable and friendly and the food is always fresh even up to close at 3;00 I  am sure the dinner menu is just as wonderful and will comeback some evening for dosai Happy Hour!  I cannot wait to try everything. BTW the mango lassi are to die for."], ["Chanelle C.", "This place was amazing. I've been transitioning into a vegetarian lifestyle and this place is god sent. It was so delicious. There were so many choices. Who needs meat?? It was clean and the service was wonderful. I will definitely be back and would recommend this place to anyone."], ["Mandy B.", "My first time here and after trying so many places- I think we finally found the one. This place is amazing and both my husband and I loved it! We had the samosas, dosa, mutter paneer, naan and they were delicious (even my meat-loving husband loved it). When we walked in we were greeted and seated immediately and the owner was super friendly."], ["Paul V.", "I'm a big fan of Indian food, so I was glad to see a new Indian restaurant open up so close to where I work.  I went in for lunch today, the food was delicious!  I'm not a vegetarian, but with flavors this good I did not miss the meat at all.  I had the vegetable vindaloo which was really good, the spice level was pefect and they give you plenty of food.  I also had a garlic Naan bread which was excellent.  I'm not normally a buffet guy, but I had a look at what they had on offer and it looked really fresh with plenty to choose from.  I will be trying the buffet next time I go.  This is easily the best Indian food I've had in Arizona. Woodlands is good and I love India Oven and Guru Palace but I think this place beats them all."], ["Aparna P.", "We ordered Chettinad curry and masala dosa. Delicious food ! Probably one of the best South Indian food in the valley! I really hope they do not reduce their quality like most of the other Indian restaurants around here."], ["Stephanie G.", "Amazing food, service, and I love that they have so many options to eat there for vegetarians.  They fill their crepes with much more food than many other restaurants. We always end up with lots of delicious leftovers to take home and eat the next day.  They also serve kingfisher beer which I highly recommend as well!"], ["sss b.", "Finally an Indian restaurant I like. As a rule, we run from Indian buffets as if they were the plague. So I was dreading lunch when my husband oddly declared he was craving indian and insisted on weekend buffet lunch. We'd never heard of Ruchi before but decided to try it as it was on our way home. We walked in to see a familiar face - turns out that it is the ex-owner of Udupi. They were friendly and attentive, the place was tastefully decorated (no placemat that looked like it had been through the wringer since 1649) and clean. We walked in at 11 and were surprised to see the buffet ready! (Granted, I haven't been to an Indian place in ages, so the habit of setting up the buffet 1/2 hour after open time and staring at you while you wait uncomfortably might have died along with the recession). Good sign. Also catered food was ready to go when those people turned up, which was also a good thing.We were surprised to see the variety in the buffet. There was a generous mix of north and south Indian, and best of all, none of them tasted like they had made up volume with corn starch. My husband who had declared he could eat a whole bear for lunch was full before he could even sample all the items. Again, my attitude could be ancient, but we were impressed by quality and quantity.Finally an Indian restaurant I like."], ["Srikar D.", "A few word to describe this place: Excellent food, plenty of options on the menu, just the right blend of spice, prompt service.I have rarely come across an Indian restaurant that serves good North Indian and South Indian food - this one is on the top of my list here.We tried Gobi manchuri, avial,  masala dosa, uthappam, masala vada ... All of them were very tasty!Tip: try their cold coffee :)"], ["Dee R.", "Excellent. We're new to Chandler and being vegetarian have been looking for something like this. Had the extensive delicious buffet. Owner helped my husband choose dishes that weren't too spicy. We will be back."], ["Melissa W.", "My husband & I found this place totally by accident one day. We came in for lunch with our son and have been back 4 times in less than a week! Each day the lunch buffet is totally different, so you will never get bored. The owner is very personable & kind; and most imprtantly, he loves his craft! The food is exceptional, and even though I am full when I leave I never feel bloated or comfortable.  I am so glad we found this place so close to our house. It is my absolute new favorite Indian place and the best Indian food I have had."], ["Rebekah H.", "This is becoming one of my favorite restaurants. I have been here for dinner and the lunch buffet. Both lunch and dinner were excellent. The service has been great."], ["Janet M.", "Another great dinner"], ["Raviteja B.", "It's a new restaurant in town. A month old may be. They serve good food. It misses out a 4 star from me as they don't change their menu regularly. I like to see at least a few different dishes when I go back."], ["Kimberly W.", "My boyfriend took me here and I completely loved it. We got the Gobi Cauliflower and Thiruneiveli Spinach Dosai both were delicious. Gobi is amazing though and I could of just made that as a meal for myself. The service is amazing and everyone is so nice and polite. Can't wait to go back and to recommend my friends to eat here."], ["Sean P.", "Great service and great food! Owner checked on us a lot during our dinner. Chole bhature and the dosa were great!"]], "India Garden": [], "OM Indian Bistro": [], "Saffron Indian Bistro": [["Jacob S.", "I am a big fan of Indian food and was very excited to find a new small shop in my neighborhood.The samosa was piping hot on the outside and cold on the inside... was told it was made fresh so it would take 13 minutes, something was frozen so the word fresh may be subjective.Saag Panir was... incredibly, thick. I think thick is the word. The puree was so incredible fine that it was close to being a mush. The seasoning was on point, but texture... not so much.The lamb vindaloo was underwhelming. The vindaloo was perfect but the lamb was so tough it couldn't be cut with a fork.There was no ice in the restaurant so we waited 20 minutes for our drinks while a waitress ran to the store to buy a bag of ice.Pricing is steep compared to the quality of the dish. Service is good. Food is not at all what I would consider restaurant quality.I won't be back."], ["Noreen Q.", "I was in town for the weekend with a friend and found this place on yelp, amazing desi food!! Papri chaat was excellent, imli ki chutney exactly how my mom makes it! Paneer that tastes just like chicken! Definitely a place to try if you're in the mood for bomb butter chicken and paneer tikka masala!!"], ["Nicole T.", "The buffet was a little small, but what they lacked in quantity, they made up for in quality - delicious! Plus they deliver, perfect for a student."], ["Arian D.", "3rd time,  never disappointed! !!! Chicken Vindaloo was amazing.  If you haven't gone here yet,  it is a must do in the west valley!"], ["Tyler M.", "So pleased to find this little spot! Food was delicious,  great service and clean restaurant! Definitely will be back!"], ["J. J.", "I would rather never go to a restaurant again than this place. It took fifteen minutes to get a drink and appetizer and they wanted everything is to order the main chooses at the same time but asked for more time. Took another ten minutes to get the drinks and five for the apps to start trickling out. There is only one server but there are only three tables with people. I expect faster service in a packed restaurant. At this point we are over a half hour in and I still haven't ordered dinner and gotten one of the three naan bread and the fries. They were out of samosa. Fourth minutes to order dinner. If it wasn't for the fact that the people I was dining with refusal to pay for what we got and leave I wouldn't have had dinner here. They don't bring out the entrées at the same time and don't indicate why there is a delay or  when it it is coming. As it stands the food tasted good. But the place should not try and act like a restaurant. It should be call in orders for pick up and delivery only. Avoid if you aren't doing one of those if you don't have hours to spend waiting for food."], ["Vengy R.", "The best place to have the WORST Indian food in AZ. Absolute waste of money."], ["Rosie r.", "Just had dinner here. Have to say it was VERY good!!  I will for sure return and dine here again!  Totally would recommend to anyone."], ["Sivaraman G.", "Today went for buffet lunch,feel like should never go again to this place.Nothing tasted good including Naan. Not worth for the money."], ["Aboobucker M.", "Not coming back. This is worst Indian food I had in AZ. All you can eat buffet was so bad and the food was very bland."], ["Fulla A.", "Late night \"I want something different\" meal per my girlfriend.Food was OK, the menu is all a'la carte. The ambiance is modern decor. Ordered the samosa as an appetizer and it was fabulous and cheap ($2). My girlfriend ordered the chicken tikka masala (as always when trying a new Indian restaurant) and our waitress courteously inquired how spicy she wanted it. I was surprised the receipt actually reads \"spice level: mild\". However, I ordered lamb vindaloo and ended up with chicken vindaloo instead and not nearly as spicy as requested. I attribute this to the fact that the co-owner's daughter, aged 2, was acting up inside the restaurant which made it difficult for her to take down our order correctly. Cute kid, but this is not the place to be an evening day care.Close enough to get an ethnic cuisine fix if necessary, but not wildly impressed."], ["Melissa D.", "Off to order another delicious Samosa Chatt. $6.50 for a filling/ tasty lunch. Love this place! Fresh food finally here on the north side."], ["Aayush S.", "I would have given this restaurant 4 stars but I am giving an extra one because this is the ONLY GOOD Indian restaurant in the area. I tried pretty much all the indian restaurants in the Glendale/Phoenix area ever since I have moved here and all I have experienced is disappointment! Finally came across this oasis in the desert. We tried the signature paneer tikka masala and channa masala. Both the dishes were prepared as per the north Indian standards and were absolutely toothsome! They serve legit quantity for the price they charge you. I would recommend this restaurant to everybody. Go try it! My only lil piece of criticism would be on mango lassi.  It was a lil too thick. If the thickness of the shake is right then it would make a great mango lassi. And please serve lacha paratha or roti. It will be a huge hit!!Good luck!"], ["Amber T.", "Specifically crafted to the level of spicy we requested.   Loved the Chana masala.  However my daughter did not like the orange chicken"], ["Gueu S.", "Small but excellent place. Service is good and food is tasty. Would love to come again."], ["Yarin P.", "Good food , fast !!!! I am lahri food taste kinda a guy , and this place has the correct spices to make it exactly that way. So hands down one of the better paneer sabzis I have had in Phoenix. Try paneer jalfrizi, good stuff even the mild version has the perfect flavor. Keep p the good work !!!"], ["Sarah K.", "AMAZING food. It's fresh, super flavorful, creative, and filling. The flavors are well balanced and addicting. I do not usually like Indian food but this is something much better. I cannot say enough about the chef specialty items and the Indian Chinese fusion. The French fries that come with the wrap are like a funnel cake french fry. Try try try!!! The restaurant is clean and modern. We will be back very soon!"], ["Muriel D.", "We ate there today for lunch! The food was wonderful. Perfectly seasoned and prepared. A definite return is in order."], ["Angie S.", "Very good food! I am not an expert on Indian food, I couldn't tell you the name of what I ordered, but it was delish!  The flavor is full and the spice (if you want it) is perfect!  If you are wondering about trying this place, GO FOR IT!  You will be pleasantly surprised.  I've eaten at a few other indian food places, and this one is at the top of my list. With that said, dont expect too much in service if you dine-in.  During our first visit, we had to wait 10-15 minutes for our drinks because they had to get ice (huh??!?!).  And, the wait staff didn't communicate too clearly the reason why or that our food would not come out together.  It was kind of a mystery, but we left with full stomachs and have returned since.  If you don't want to deal with poor service, they do have take-out."], ["Jeff L.", "I picked up carry out on a Sunday afternoon. I was craving Indian food Saturday night and found this place on Yelp. It was the closest Indian restaurant to my house and had good reviews. I was very happy I found them.The staff was very friendly, but I was there for take out and was not waited on. But she seemed attentive to the other seated customers.I ordered the Chicken Tikka Masala and Hakka, Garlic Naan, Mango Lassi, and the onion and ratta \"condiments?\"I thought the food was excellent. I ordered medium hot, but next time will go for hot. I got the eye sweats but not to the levels I seek.The chicken was moist and the Tikka as tasty.Just a little light on the seasonings compared to what I would have made at home. Bottom line is that I really liked the food and will be back."]], "Tahoora Grill": [["Rachel C.", "This place follows all of the rules of how to find exceptional ethnic food. You'll find this sneaky little spot in an unassuming building with very little signage. Inside, you'll find the floorplan modestly but tastefully decorated and packed with Benghali, Pakistani and Afghani Phonecians.The buffet is amazing. The vegetarian dishes have more robust flavors than I typically encounter, even within East Indian and Middle Eastern cuisines. The saag paneer is a total winner. I'm typically turned off by saag and palak paneer dishes because they're too soupy and creamy, but here it's completely different. The same goes for the chana masala. If you're a meat eater, you won't be disappointed. They have chicken tikka as well as a great selection of goat, chicken and beef simmered in characteristic sauces. The price for the dinner buffet is also exceptionally reasonable. While it seems only regular-reasonable at first blush, your drink and naan are included.I wrote this review, and now I want to go to there..."], ["Pratishruti M.", "Ah! Finally a restaurant that does not serve you the same curry base with different names.The Handi Chicken and Chicken tikka masala were spot on, boneless pieces of chicken in gravies that were near perfection.The gravy reminds one of authentic Pakistani cuisine.The garlic Naan was fresh and full of Flavor(All gravies are served with plain Naan).The restaurant is very basic and ambiance is just about adequate.It's definitely not a place where one goes for a date night.I would recommend getting the food to-go.Also i was very impressed that the food was first boxed in containers and then sealed with poly sheets to avoid any spillage(which is very common when you box curries).The Staff is friendly and was happy to substitute the Naan for rice.Free Samosa when you check-in on Yelp.Cheers!"], ["Evan B.", "To settle any confusion this place is next to Zam Zam world foods, they even share an internal door. For lunch it is a sit down place with a waitress and a menu. The Menu has many familiar Indian items, a few Mediterranean items and the more exotic Afgan items. I was hungry and went with my Afghan fall back the Gulpi (7.50) A Cauliflower dish with a slightly creamy flavorful sauce. It comes served with Tandor bread which in this case they use Naan and for $1 you can get rice which I did. The rice is pretty intresting in itself long grain and colors varry a bit. Over all a great dish but a bit more acidic than I am used to.My friend had a intresting dish that is hard to describe other than it had meat inside dough and lots of sauce. He liked it.Most items will break the $10 mark with tip and tax so I may not be doing this place for lunch too often."], ["Trent K.", "I am a huge fan of the boneless chicken handi.  I have never seen it offered anywhere but here and it is delicious.  The naan bread is also the best around.  The chicken tikka (grilled chicken) is awesome too, anyone even less adventurous boring eaters would love this.The chicken tikka masala was below average IMO.The sunday buffet was not worth the price the one time I checked it out.  Stick with the menu options."], ["Ariel D.", "Went for dinner and got vegetable samosas, paneer Tikka masala, aloo gobi, rice and garlic naan.  At most Indian restaurants that would set you back at least 40$ but it only cost us 25$!!The samosas were awesome. The pastry was light and airy and the filling was delicious, but the best part was the green dipping sauce it came with. So. Good.I was a bit disappointed with the tikka masala it was pretty oily and very tomatoey.  I like it to be creamier and a little sweet. The aloo gobi was good but could have used a bit more spice."], ["Fazle H.", "This place was pretty good,  service was great,  and atmosphere was loud (minot detail), but it was very hot inside.  I mean it was sweaty hot. The food itself was pretty good,  but nothing to rave over.  It was pretty close to authentic paki and afghan food. The nehari want really nehari, it was more like beef curry. The goat paya (hoof) was more like what nehari is supposed to be.  There was one major flaw that stuck out but it was quickly corrected.  Let's be real mistakes happen.  If I came back,  it out be for take out. It's just too damn hot inside"], ["Rand H.", "= = = =  SUNDAY LUNCH & DINNER BUFFET!  = = = =Ever since the great Kabab Palace Buffet in Tempe changed over from Afghan to Indian food we have had such a dearth of Afghani Buffet here in the Valley!  Yes there was Pak Afghan right here for a while, but when I dined with them the menu leaned toward Pakistani...  good food, but not quite the real deal to me.  Well, today all that has changed!  Hitch your camel out front and step into Tahoori Grill here for the real Kabul experience!  Today I started with some hot tea and Puri, a deepfried bread with which to wrap in some warm Halwa (Khoa) paste and a super tasty chick pea dish.  Yum!  Next it was on to some typical South Asian salad Raita, and then to a seasoned rice dish with goat meat, Beef Nihari, Chicken Curry (different than the Pakistani/Indian version), Beef Keema, Chicken Hamdi (Yum!), Chicken Tikka, a great scalloped potato dish and more, plus Phirni pudding for dessert.  Both the dining room and the service here are a little odd, but that just adds to the authentic vibe of the place and now much of the food is distinctly Afghan here, making this is a special place...  and don't let me forget to say that everything I ate here today was DELICIOUS!     :-))Sunday Lunch & Dinner Buffet:  $12.99 including hot tea and soft drinks."], ["Steve R.", "This place is amazing! The variety of food is excellent with every dish having its own powerful unique flavor. Not only that, but the family that runs this restaurant makes you feel right at home. Definitely recommend this restaurant and have even turned all my Co workers to it! Word is quickly spreading about this place in my own circle. Try it out and continue to spread the word! P.s. Sundays they have a buffet!"], ["Erika B.", "A colleague introduced me to this gem of a restaurant.  This is our 3rd time coming and we are always pleased with the food and service.  I love the channa masala and gulpi here, and I'm a meat lover, so these veggie dishes are very satisfying. I have tried masala closer to me in Mesa and I have yet to find anything better.  Worth the trip to Phoenix.  It's close to the airport so if you're visiting and have had your fill of Mexican food, stop in and delight your taste buds."], ["Hussein A.", "If I was king of the world tahoora Grill would be my favorite place in the world, their food is the best I have ever had.  I love the Nihari, chicken tikka, and Afghani food the \"Bolanee\" Phirini, is perfect tasted dessert I ever had every thing is almost perfect..  The buffet on Sunday's wow wow wow amazing: The service is also spectacular. The waiters are Very respectful to elders and anyone else and they're  cool..    The most important is to know that whatever is so good; that whatever always got haters the most haters you have the more better you are so never give up on your food; you guys are the Gods of foods. Looks like I said a lot but truly that's what I feel about Tahoora Grill. And I can't wait for your live BBQ which is starting soon. Keep it up guys !!!"], ["Gwen O.", "If you love Indian food, but you're looking to change it up, this is your place.  Everything we had was delicious.  It may sound boring, but order the samosas... the pastry is so perfect on these.  Loved the vegetarian options. Only negative I'd say is that the grease level was a little too much for me, but not enough to dock any stars. The flavor of their dishes is spot on... so well seasoned, and that's what counts for me. This place is definitely going to be in our regular rotation."], ["Julie T.", "One star knocked off for a lack of ambiance and no liquor license, but don't get me wrong ... this is five star food, promptly served by nice people!"], ["Danielle S.", "A very welcoming and family owned restaurant! The staff made sure you understood how the meal was prepared and made it to your liking. The atmosphere was perfect and the food exceptional!"], ["Kyle S.", "Our office goes to Tahoora at least once a week and it's not hard to see why: the amazing food and excellent customer service. I've tried, at this point, almost everything on the menu, and everything is always fresh, delicious, and authentic.Some of my favorites are the Bandanjan Eggplant, Goat Karahi, and the Chicken Byrani, but the menu is solid all-around.We've gotten to know the owners just because of the sheer amount of times we go and they are really delightful and always incredibly friendly."], ["Catch Me If You Can M.", "Customer ServiceThe greeter at the front desk (didn't meet minimum labor age) failed to greet us, but simply just stood there expecting me to understand what and how to do. In other words, I wasn't sure if this was a sit down place or an order and bring to your table place, or order and come get it place. After an awkward moment, I grabbed a menu and all of a sudden, another employee flew in and said \"I got it\" and he seated us and asked for our order. We ordered after a lot of questions and unhelpful responses. Our food came and the order was incorrect. I explained this to him and he told me that what they had brought out was what I had ordered. Incorrect, and even if I am wrong, remember the customer is always right and he should have gotten it right. I didn't want to cause a scene, so I ate what he had claimed I ordered.False ClaimsThis place should make no affiliation to Afghan food. Yelp should remove the 'Afghan' tag and the restaurant should remove calling certain dishes Afghan. That being said, I asked about the Afghan dish: Kabuley Palaw, which is traditionally a dish of rice with carrots and raisins featuring lamb or sometimes beef/chicken, cooked and served with the rice. The waiter suggested their version of that dish is a Pakistani skew of ground beef with rice that included carrots and raisins. This is analogous to a pizza and a pizza with no cheese but plenty on the side.Summary and ConclusionAverage Pakistani (strictly speaking) food with confusing service and false claiming Afghan dishes."], ["shelina m.", "Best food ever! There chicken handi is to die for... among other awesome dishes. The husband and wife duo are amazing cooks and very sweet people. When ever my dad comes into town it's the first thing he brings up, when are we going to tahoora?"], ["Maria Q.", "Based on such nice comments through yelpers, me n my family decided to give it a try. We went for the dinner. Ordered nihari, mixed grilled platter and the chicken karahi. It was not a busy day but still twice they brought us someone else's order. They were not sure who ordered it. Shows lack of good customer's service skills. Well not a big deal. When our order came out........it was not what we excepted. The chicken karahi was more like curry chicken, chicken boti was inedible bcoz of being toooo salty, rice was bland, and nihari had 5 to 6 hard & tiny pieces which seemed like been boiled & put in the curry. Only thing we liked was seekh kabob. The taste of food was average. It might be just a bad day I hope. Will give it another try. What we really enjoyed was a nice chat with the young guy who was so helpful n friendly."], ["Alyssa M.", "Frequently come here on Sunday for the buffet. Great options, fresh food, and authentic. If there in Sunday also ask for an order of puri which goes great with the Chana. Enjoy!"], ["Patty B.", "This restaurant is located in a very low key, unassuming neighborhood.  I would not have ventured there except for the fact that there were many good reviews.  What an amazing experience.  The food was unique (for me), flavorful and incredibly delicious.  I wish I could list the food by their names, but as an appetizer we shared a dumpling-like dish with wonderful tomato / yogurt like sauces.  We also had a chicken stew (in a red sauce) and the beef kabob.  Even the rice was perfectly prepared and seasoned.  This restaurant made my week!"], ["Tom W.", "Total ripoff. Ordered nihari beef and got a bowl of broth with three tiny pieces of meat in it. When I asked where is the meat I was told that is all you get and that is what everyone does. I have had nihari at many places but never with so little meat in it. Worst food deal I ever had."]], "Star of India": [], "Nawaz Indian Cuisine": []}