{"North Italia": [["James F.", "Went for happy hour Sunday, ordered a Sangria. It was so bitter I couldn't drink it. The waiter didn't charge me for it when I said I just couldn't stand it. Thanks for that..Ordered a plain vodka martini instead. \"Well\" nothing fancy, $10.00 !!During happy hour?Ordered a Cezar Salad, very very ho hum.. Won't do that again. Finished with a $6.00 dessert. It was like something I could have picked up at the 2nd day bakery at Safeway.$32.00 by the time I finished. Outrageous for a so so experience. You can keep that Fox disaster. Won't be back."], ["Brittany W.", "Somehow I didn't even know this place existed, and then my boyfriend's dad asked us to join him there one night for dinner and OH MY GOODNESS, we left feeling full and extremely happy.First of all, the decor and look of this place is really cool. The ceilings are very high and the patio is relaxing, especially during these beautiful AZ nights in the spring. To start, I had the Red Sangria. I don't know what it is with me and sangria but there's was super yummy! The rest of the table had different glasses of wine and no one complained. For the appetizers, we went with the Crisp Calamari and the Steamed Pei Mussels. The Calamari is more like half salad half calamari but nonetheless delicious! The arugula pairs so well with the calamari, my boyfriend doesn't particularly like arugula but he loved the way it tasted with the calamari. The mussels were perfect and the white wine butter garlic sauce is so good. TIP: If there's extra at the end, save the bowl and order a side of bread to dip in it, you won't regret it!!For the entrees, my boyfriend and I ordered two dishes and split them both, I highly suggest sharing with a friend so you get to try multiple items!! We went with the Ricotta Gnocchi and Prosciutto Wrapped Pork Tenderloin. The flavors that came from both of these dishes...WOW, just wow. The Gnocchi might be the best gnocchi I've had in AZ. It's so creamy and delicious. I don't even like horseradish but it works to beautifully in this dish. The pork tenderloin was cooked perfectly and sat on a bed of great northern beans. Everything just paired perfectly with each other. Zach's dad ordered the Margherita Pizza and luckily I got to have a couple bites! Their dough and pasta is made fresh daily and you can really tell that it is, it's so fresh!! The pizza tasted refreshing, like they went out back hand picked the tomatoes and basil, and then made a pizza. Lastly, the desserts. I don't even know where to begin. The Salted Caramel Budino and the Tiramisu. I would take one bit of one, and then have a bite of the other, then repeat. The flavor from each was so unique and vibrant that it did not overpower the flavor of the other dessert, making the one bite repeat possible and successful. The Salted Caramel Budino has me lost for words when it comes to flavor. The sweetness of the caramel paired with the salt is like unicorns prancing on rainbows on your tongue. The Tiramisu is also heavenly delicious. You can't go wrong no matter what you choose!To sum it up for anyone who doesn't feel like reading the novel I just wrote, check out this restaurant and be prepared to spend some money if you want the full experience. The staff is super friendly and on point. I can't wait to go back to try more dishes!!"], ["Mitch P.", "6 people seated at 515pm on Monday. Fantastic service and even as it became packed by 7pm our server was on point. Steak, pesto pasta, pizza and salads super fresh and tasty. The open kitchen was warm and inviting with people scurrying around but not loud or annoying. Worth the experience."], ["Danyel M.", "North in Arcadia is one of my favorite FRCs by far. Every time we visit we really enjoy ourselves. If you haven't tried their happy hours, you're missing out- especially on Sunday =  ALL DAY! To start things off, I had the phenomenal cinnamon roll (only 3 bucks!) paired with their delicious coffee served in their adorable red mugs. The roll is big enough for sharing, but you probably won't want to. I took the rest of mine home to enjoy with my coffee the next day. :) Next, I enjoyed a few mimosas and their HH pizza of the day (only 8 bucks!). The pizza that day had pepperoni, tomatoes, zucchini, fresh mozzarella, and balsamic. The dough was very fresh and it's just right - not too thick & not too thin. This is definitely enough for sharing as well. Also, they have a great deal on Sunday- a pizza and bottle of wine = $20! Not only is the food good, but the atmosphere is spot on. This place is pretty spacious so the wait is never really long AND if there is no outside seating, sitting inside is just as nice. The restaurant is open with lots of natural light and fresh air. PLUS, the service is great! We'll definitely be back again and I'm looking forward! Thanks North, Arcadia!"], ["April S.", "Location: restaurant is well decorated. Parking lot is small, but they do have valet parking available. Service: We were here for a birthday celebration. It started out wonderfully. The waitress was super friendly and I believe the manager dropped by to say hi too. All parties on the table were here for the first time. The food was great and I was looking forward to write a 5 star review. I even took photos of all the food waiting to upload on yelp as soon as i get home.....until I realized the things they did when the check was paid. We ordered an appetizer, 4 entrees, 4 desserts and total of 4 drinks. We all tips generously. However, as soon as the bills were paid, the waitress started by cleaning up the plates (understandable). Next stop was to clean up whatever else she could find (napkins etc). Last stop was to take away our water glasses so that we were sitting on an empty table. We didn't expect refill or bother her at all after the bills...but must they do that to kick us out? We were there to celebrate a birthday and wants to spend a little more time together before we all see each other again. Is that too much to ask? Food: food was great but I am in no mood talking about their food right after the service we got. Rating: I still give it 2 stars for the food....I am not sure if I want to come back and experience it again. My warning to yelpers: if u don't want them to clean the table and kick u out, don't pay until you are ready to walk out. So disappointed."], ["Omari D.", "Large party for dinner with friends (just make sure to call ahead) but it worked out great. Despite being a growing chain this spot makes you feel like it's it own mom and pop restaurant. The Milano mule is one my fav drinks.  Had the bruschetta to start & followed up with The Pig Pizza as my main course. Pizza was good but need some more flavoring to the sauce and maybe some oregano to give it that pop. Only downside, the AC was pumpin so hard everyone was cold and I think it cooled off my pizza before I could get half way thru it. Would still return!"], ["J. Kristian G.", "This was our 2nd attempt at this restaurant. The place has a good ambiance, our server was friendly and there is absolutely no issue with that. The environment and staff suffers though from a lack of training - on relationship management and courtesy. All the interactions were brief and as if our server was too busy to take any time and explain the menu to us, or interact because I had taken out my brother-in-law, his wife and my wife there.In addition, the meals were tasty and I had a great Moscow mule for $10 and the short ribs for $25. My wife ordered the bolognese dish with a Petit Syrah which she liked. Prior to that, we had a trio of bruschetta which wasn't bad but may have had slightly undercooked ingredients. The other two in our family  ordered pasta dishes. Needless to say, my wife and I were not very impressed with the size and portions for the price- $178 for 4 people(nearly $50 total per head) after the tip!"], ["Jacque R.", "Happy Hour = winning! Maybe, it was the great friendly service, $4 local brews, or the great menu for happy hour prices! Either way, winner winner chicken dinner. They make their own bread, pasta, dough. And it is fantastic! Cheese pizza $8Meat & cheese board $10 Zucca Chips $3 { MUST TRY }"], ["Amber G.", "North is by far one of my absolute favorite restaurants. Every year I have my birthday dinner here and love bringing new people in to experience the amazing food! The ambiance at North in Arcadia is more relaxed than its sister location at Kierland with a charming and rustic barn feel. It's a great place for couples, groups or meeting your girlfriends for drinks. As for the food, I would recommend starting with a bowl of their Zucca Chips or the Arancini (fried mushroom risotto stuffed with scamorza cheese and served with red sauce). If these don't get your appetite going then I don't know what else will!  For an entree my favorite dish is the Ricotta Gnocchi (braised beef short rib, horseradish crema and wilted arugula)...yumm! The Fall Lasagna is also a great go to dish however keep in mind that this is a seasonal item. I would highly suggest saving room for dessert as their Affogato is not only super delicious (vanilla gelato and espresso) but the presentation is fun as well.  North is a must try if you've never been.  Once you go I'm sure you'll become a regular whenever the mood for great Italian food, drinks with the ladies or date night hits you!"], ["Jaime L.", "Driving over 2300 miles in three days wears. It also wears when you have your father in the car and in order to have a conversation, you have to constantly repeat yourself because he refuses to admit he needs to get hearing aids.Phoenix was our last stop before home: Los Angeles. I was determined to treat ourselves, since New Orleans and the McDonald's in Fort Stockton were terrible disappointments, so I picked North Italia. I'm not even one for Italian food, to be honest. Why should I pay $15 for a tomato smashed into a pasta, made of flour and eggs? I mean, seriously. Not that hard, not terribly flavorful.Until, of course, I found this place. There was one instance where I actually liked italian food, and it was at Michael Chiarello's restaurant up in Yountville, where you have to secure a reservation two months early along with the Keller restaurant group.Obviously, I'm going to start with a drink. I believe it was called the Julietta, a vodka, elderflower, and prosecco mixed drink that came with a pretty flower as a garnish. It became my new favorite in all the ones I've had between the pacific and east coast. Yelp told me to get the zucca chips, so I did, because I am a sheep. Baaah. That's sheep for, \"You should get it. They're flash fried zucchini chips that taste like a slightly salty cloud, and are the perfect appetizer that won't fill you up before your meal.\"Deciding on an entree was difficult. You see, the short rib and ricotta gnocchi looked good but - let's be real here - gnocchi is one of the easiest pastas to screw up. I went to a michelin star rated restaurant and ordered gnocchi thinking, \"How could they?\" and ended up getting an answer. So my expectations were certainly low. Instead, I was given pillowy pasta, with deep hints of ricotta, and some of the most amazing braised short rib I've ever had. Anywhere else usually makes their short rib saltier than the lick the cows get as a treat - but this, oh no. This was heaven. I could taste the beef in this spectacular sauce, and it was so good and simple. Never underestimate the power of simplicity. Good lord.My dad had the strozzapretti, which I was not expecting to be good for some reason. I don't know, I have a crazy relationship with pasta. They hand-make it all in house, and just like the gnocchi, I felt as if I could eat it forever. Chicken, mushroom, fresh al dente pasta in a parmesan cream sauce. Amazing.For dessert we had italian donuts with a vanilla marscapone sauce, and their nutella budino. The budino, topped with toasted hazelnuts, was great, but my favorite were the donuts. Airy things, dusted with granulated sugar and swept up with sauce, were the perfect way to end the evening. I was humbled, to be honest, and actually contemplated coming back out there with my boyfriend just to take him to the restaurant. It's still up for consideration, actually.Make a reservation well in advance, I have a feeling this place isn't going to have slow nights anytime soon."], ["Irene V.", "The first time I tried to GPS \"North\" Google Maps laughed at me. \"Really Irene? There are hundreds of streets that start with North.\" Despite my lack of inherent navigational guidance I found my way there. Dinner was a joy with a large group of people. I enjoyed the spinach pasta. Absolutely no feeling of guilt as it was so heavenly. I *did* regret missing Happy Hour. (It runs until 6pm. Wine is $4 a glass! Sangria and beer too!) I loved the ambiance and the incredible space. It was perfectly loud for new friends to have a good time. With gusto!Fast forward to breakfast and I fell in love with the \"Short Rib Hash\". Eggs are involved. (Mom was doing it wrong all these years.) I forked my way through a gluttonous serving. Then I hoover'd down my neighbor's french toast. (The joys of communal eating.) The Red Rooster drink had just the kick of spice. I might have had two. (Shhh!)Tonight I enjoyed a true Happy Hour. Vanessa at the bar is just *wonderful*. Full of energy she worked the bar. By that I mean she sprinkled her magic fairy dust and created smiles. (I didn't want to leave! Neither did any of my bar stool neighbors:) Hearing how much I enjoyed dark beers Vanessa offered  a Moretti by La Rossa. Vanessa is amazing at what she does. North Italia provides excellent fare. Be sure to sample the pizzas! I had the special of the day. The crust is right up there with New York style crisp. Heaven. (And a steal at $8!)Save me a bar stool during HH. (Two can share a bottle of wine *and* pizza for $20!) I can't wait to go again!"], ["Alex K.", "Excellent Italian cooking. Pastas were homemade- so tender!  We are here the night before doing the Ironman. Great options for pre race meals.  Fresh, healthy and great flavor.  I had the pasta bolognese and my husband had the braised beef short ribs with gnocchi. Also very pleasant decor and atmosphere."], ["Joan G.", "My daughter picked this for her birthday meal. We had been to a Yelp event here in the past and have been wanting to go back and try it. Boy am I glad she picked this place. We started with the grilled artichoke for an appetizer. WOW! I had no clue how much I would love this. It has truffle oil lemon aioli and was amazing. I didn't want to share but did! For my meal, I had an italian salad with Sopressetta and added chicken. The dressing was light and refreshing and the flavor combination was amazing. I love that it was served on a board like the Charcuteri platters. Our server was great. She even showed us how eat the artichoke properly. She kept our drinks full, was attentive and answered all my questions. I loved watching the kitchen prepare all the food, and the atmosphere is great, nice and open and bright. Can't wait to go back and I am not sharing my artichoke next time!"], ["Kevin L.", "Work offsites can be hit or miss, especially when it comes to after-conference activities and food, but North Italia delivered on expectations. We had a group of about sixty (60) people attend, and there was never a moment where my wine glass was empty. However, when it came to the \"serve yourself\" salad and pizza during the middle of the gathering, there were moments where most had to wait for new pizzas to be made (I understand quality control), but once we waited, we ended up walking away with a single piece of pizza and one scoop of salad (little food, a ton of booze - you do the math.)However, the staff themselves were incredibly friendly and personable, and service can make up for sub-par food delivery.I will visit again, possibly on an actual dinner reservation."], ["Thought C.", "I wish I could give this place a 5 star review, but I can't. The truth is I never ate here. One of my customers spoke highly of North. As I do every Monday evening, I try a restaurant that is new to me. The young lady told me she would be expecting Monday evening anytime after 6pm. Great, see you there, I told her. I arrived a bit after 7pm. I was greeted by a very nice young man. This young man is one of their Valet's. Um... right, I don't do valet. I'll just self park. To which he replied, \"There is no self park, we only do valet, 7 days a week and right now the parking lot is full.\" From a business perspective, a full parking lot is fantastic. On a Monday night to be full is certainly a testimony of how popular this restaurant is. However, from a guest perspective, this is not good. I then told the young man, I would just park next door or across the street. He then warned me that my car would be towed. Great! Since my car is my livelihood, I can't afford that, so what's my solution? I find the local McDonalds and have a $2.50 double cheese burger and well done fries, because at this point I'm pretty pissed. I moved here from California. If your parking lot hasn't enough parking, typically your establishment works a deal with the neighboring businesses for your overflow. Especially when their businesses doesn't operate in the evening. I'm not sure If I'll be back."], ["Amy Q.", "Visited North Italia recently for a business lunch (there were 10 of us). I haven't been to this location yet so I was looking forward to visiting. I had the Fig and Prosciutto pizza and we all started with the Zucca Chips (VERY YUMMY) and my co-workers had pasta, sandwiches or salads. All of our food came out at the same time and my pizza was great (like always). Service was great as well!!!"], ["Michael B.", "The F&B here is 4 to 5 stars. The restaurant itself and the service  is what brought my review to a 3 stars and here is why...The food here is made from scratch and delicious. The homemade pasta has an excellent texture and the sauces are up to the same standard. The wine selection is diverse and well priced and the cocktails are unique and presented well.   The service is a little lack luster. I believe it to be because of the high level of business, not because of some low level of standards. With that aside, the table to space ratio is off. You are either sitting right on top of one another or you are bumping into others trying to get to your table. This can be quite annoying on the other end because people are also bumping into you while you are trying to enjoy your meal.        The 3 star review will not deter me from coming here again. The food, the wine, and the sense of passion behind them is what makes this place stand out. I hope to receive better service next time and perhaps a little more space to breath."], ["Phoenix A.", "Good food and nice atmosphere! One of our family's favorite restaurants. Zucca chips, pasta and pizzas are all delicious. We have always had good service and very friendly wait staff.  Another great Fox restaurant!"], ["Alex I.", "We came here tonight as a little bit of a bigger party  during prime time so I understand that things may not happen \"picture perfect\". I had dined at the restaurant before and it was my Mom's birthday and she had heard good things so she decided to come here, though she had never tried it before. This is one of the many reasons that I love Fox restaurants... If anything is ever not right, they will fix it... Always so hospitable. Even though there was just a slight misunderstanding, management was so apologetic and compensating. Food was amazing & we will definitely be returning and will highly recommend this restaurant!"], ["Ike O.", "Highly recommend the mussels and the cauliflower! The gnocchi was great and their dessert was also phenomenal. There was not 1 thing on the menu I tried that wasn't fantastic!"]], "Fired Pie": [], "Postino Arcadia": [], "Pizzeria Bianco": [], "Pomo Pizzeria - Downtown Phoenix": [["Jon H.", "There's no place like Pomo.Take a ride from the farm and walk down the shimmering yellow road, it will lead you to a magical kingdom like none other, the Kingdom of Pomo, ruled by David the bartender. Enter the door, belly up to the bar and let David take care of your every knead.I promise, this trip is worth dodging flying monkeys and battling the wicked witch of the west (side) where her tastiest pizza is akin to mall food court. Not that it's all bad, but in comparison, it's mall food court; they all fall short.In the battle of phoenix pizzerias, Pomo takes too billing for me these days, delicious, fresh, oh man, it's soo good. When you're finished with your meal, don't forget to ask them about their limoncello; the best anywhere and best yet, this is a complimentary after dinner drink. Tell them your friends say they serve the best limoncello in all the land and they'll promptly and proudly serve one up in a flash.Happy yelping Phoenix, if you're going for Pomo later, don't forget to invite me along ;-)"], ["Edwin N.", "Giving this place a two star.Reason why.I never eaten here, definitely a first time. A friend  was thoughtful to bring me along to have dinner with him. Seats were limited and had no choice to eat at corner of the bar. The place had a good vibe. And the food was great. At the end of finishing my meal i was cashing out to pay my bill, the dude with the long hair who works at Pomo knocked my drink over and my drink spilled on the counter top and all over my shorts and t-shift. Of course I kept my cool and behaved well and took it easy. The guy got a little annoying when he kept apologizing to me. A great way to make good impression to a place you'll never will come back to.Felt embarrassed with my clothes wet was not something I had in mind."], ["Justin V.", "\"Top notch\" ~Dinner partner\"Best pizza in Phoenix\" ~couple next to us at barThis place was great. We're in town from Ohio for the bengals-cardinals game. We were looking for good pie and that's what we found. Pair that with excellent service and it makes for a great night.David was inviting, professional and sincere. He offered advice on what to see around time. Discussed football with us (he's a Bears fan.) And went above the level of attention one would expect at a pizza bar/restaurant that offers such great food at such a good price.All in all, stop in if you get the chance. You won't be disappointed."], ["Jess J.", "Never thought I'd ever say or admit this but the pizza here is better than any I've had in New York City and that says a lot considering I grew up on pizza. Typically you'll see coal oven pizza, this uses wood....good wood (that's what she said - I know.)This place has legitimate Napoli (Neapolitan) pizza! The owner is from Napoli and as Italian as it gets. Ingredients are fresh and high quality. There are three other locations in the nearby Phoenix area, I've only tried this location but assume they're all wonderful. The owner is sweet and attentive, I've seen him pass by every table in there and the bar and talk to patrons as well as offer them shots of Limoncello, that says a lot about him as a person and a business owner.Go now."], ["Shanel S.", "Solid three stars.It seems to me that Phoenix has a good thing going with Pizza. The last time I visited, I had a fantastic experience at Grimaldi's. I think this place comes pretty close. It's all better than Isola in San Diego, but that's just my opinion.I shared their Romana salad which is easily in my top five favorite salads. I can probably drink the dressing they put over it. The perfect lemon/olive oil ratio.Their Margherita is also so fresh and delicious. Generous portion of sauce and mozz. Yum!They also provide a decent complimentary desert. Fried dough I assume with powdered sugar.Why three stars? The service is horrible. We wanted to sit inside since it was so hot out and we were promised to be seated inside next. Then all of a sudden came this list of other people who got inside before us because of an imaginary list. We also had to waive down our waitress a few times when needing service. Lastly, she wasn't up to date on their beer selection so she came back and forth about three different times with different answers about the beer they had to offer."], ["Timothy B.", "I love this place. There, I said it. Right at the very start of my review! I love Pomo Pizzeria for its DELICIOUS food. I love it for its location right there on 1st St in downtown Phoenix (although other locations are available for those of you in Glendale, Scottsdale, or Gilbert!). And I love it for its consistently outstanding service.I've been to Pomo Pizzeria many times, but will never forget my first visit ever. It was as if the owner could sniff out a newbie! Honestly, the quality personal engagement of the total team there was (and has continued to be) truly outstanding.I was introduced to Pomo by one of my very closest friends, who \"dragged\" me along because she was THAT excited to have me experience the high level of service and delicious food she had come to expect from this location. I was not disappointed. The owner even treated us to a special little dessert drink of his own making after our meal completely free of charge!I will admit that I am a bit of a pizza snob. Having grown up in New Jersey, I have that special brand of condescension found only in east coasters whereby we refer to New York pizza as the \"only real pizza\" to be found on this earth.Pomo hasn't COMPLETELY cured me from this admittedly arrogant folly; however, I will say that I have tasted pizza at every pizzeria I can find in the Valley and Pomo Pizzeria continues to remain the easy #1 Top Choice for Best Pizza in or around Phoenix.Pomo - you should know that I'm still searching for that one little out-of-the-way pizza shop to topple your reign, so you'd better keep up the amazing work!If you haven't yet experienced the Pomo difference, you need to. Go do that sooner rather than later. You won't be disappointed! And Pomo - thank you, thank you, thank you for being so wonderful and delicious. I love you, and I'll see you again soon!  ;)"], ["Alana B.", "My new favorite pizza place! Pomo is going to rank high on my personal list! The ambiance, service and don't forget about the food, was all amazing. I came here for lunch so next will be out on the town for dinner and boy I can't wait. The pizza, oh the pizza, is just delectable. The mixed trio bruschetta appetizer is also just splendid! Ending the meal with a cappuccino felt like I was in a small town in Italy. Way to go Pomo!I have nothing but great things to say about this place and cannot wait to return! Whose in?! Ciao!"], ["Nick H.", "I stumbled upon this place last Sunday night as an out of towner. That can I say, pizza was great. The service was great. Sat at the bar, the gentleman with the long pony tail took care of me. Can't remember the name of this pizza but it had prosciutto and arugula. Tasted Amazing. I have two more work visits to Phoenix and will definitely stop by."], ["Wayne B.", "Pizza! Good Italian Pizza and fresh local ale on tap, sitting outside watching playoff basketball. Does it get any better than that? Well, yes it could, if the Suns were in the playoff, it definitely would be better (there's always next year).I've wanted to check out this place for awhile, as it was recommended by a few fellow yelpers and since I had it bookmarked, was in the area, and I joyfully discovered their Happy Hour was still going on until 7pm...Score, as it was just 6pm, and most HH were over! So, I strolled in, and was promptly greeted, but all the bar seating was occupied, and since I was flying solo, they were going to toss me outside, but David, my capable host offered the outdoor bar seating, where he would be more than happy to open up the overhead, and allow me to enjoy the outdoors, and still feel a part of the indoor scene and catch the game. I accepted his offer as he promptly brought me menus galore...hey I just need pizza, \"what's popular\"?, I asked.The \"meat lovers\" David identified as his go-to, and also a house favorite, so it's what I went with. The standard fare of silverware, a napkin, plate and acumens were brought out while I waited, and a wonderful tall glass of water was delivered without me having to even ask. The Toto Sapore had a load of flavor, not too cheesy, crunchy, not too thin, flavorful crust, and it came out quick, too! I also ordered a pint of the Devil's Ale, and I'm usually half way done with a brew before my pizza arrives, but not here, Wow!! Only a few swigs and I was being served...this, my first visit I just hope they're not spoiling this pizza/beer lover, but I think not.I tend to equalize my beer consumption with beer intake, and usually polish off two pints, but because my pie came out so quickly, I almost finished it off before the first ale was consumed. Good thing, too, for I didn't want to stay for a second round, but was really enjoying the atmosphere and late spring weather. By the time I finished over two-thirds of my Toto Sapore, my glass was empty, my belly full, and I was a happy guy, and very satisfied customer. I will be back for more very soon."], ["Brian E.", "Mauricio is delicious! Oh...and so is the pizza!  Always amazing and scrumptious and the special limoncello after dinner shot is better than dessert."], ["Drew M.", "Hand made, quick fire pizzas that can be customized with a respectable array of artisanal ingredients.   I had the TIROLESE with Brie' Cheese, Smoked Speck Alto Adige IGP.  This type of pizza is not my personal favorite, but what I do know is that it was cooked perfectly, and the ingredients used made it feel like I was sitting in a small village, eating cured meats and chesse from someone who had made it all themselves.  The fact that the owner was in the store cooking my pizza created that feeling of authenticity, that when paired with my italian wine (great choices from all over Italy on the menu), made it feel for just a moment like I was not in sizzling Phoenix.  To be transported away, if but only for a moment by the experience of eating food, is one of the greatest pleasures of dining, and Pomo Pizzeria gave me that experience.  A happy 4 stars."], ["Brian B.", "Stumbled onto Pomo Pizzeria by accident late on a Saturday night and was more than pleasantly surprised.I was very impressed with their food and attentive wait staff. After having lived in Chicago for 15 years, I'm hesitant to compare pizza/pasta against restaurants back \"home\", but Pomo was excellent and I'd highly recommend it.Prices were fair and we really enjoyed the food and the atmosphere. I will continue to go back."], ["Pete J.", "I had eaten Pomo's pizza a bunch of times in the past, but for one reason or another, someone else had always gone to pick it up. So it wasn't until this time that I actually ventured inside.The food itself warrants 5-stars. It is authentic and delicious. There will be endless debates the world over about what is the best pizza, what is the best style, what is the best crust. We all have our own opinions, but for me Neapolitan wins every time. The crisp, slightly chewy crust is amazing. The toppings are always fresh and plentiful. Now, it's not the cheapest pizza you will ever get, but, trust me, it is worth every penny. I'm sure it's not cheap to build an oven made from bricks and volcanic sand from Southern Italy.Everyone here is so nice! From the greeters to the servers to the bartender. Even the cooks look happy in their work. My order wasn't quite ready when I arrived, but the greeter was quick, efficient and welcoming. When I sat at the bar and had a Peroni while waiting, the bartender was engaging and friendly.I heard they have opened another two locations, so wherever you live, you are probably close to a Pomo Pizzeria. Do yourself a favor and go visit!"], ["Jay C.", "Pomo was delicious!  Great atmosphere, great food, and excellent service!  And the men of Pomo are delicious!  Handsome staff starting with the Manager!  And the owner has a sex appeal to him as well!  Great job Pomo!  I definitely will be back for more food!"], ["Rebecca H.", "I am going to give POMOs a five star rating. The pizza was delizioso and the wait staff was just friendly and delightful.  But then to my wandering eyes should appear, at the bar, but a lovely custom whereby the owner was pouring limoncello!! That just sealed my 5 stars-it was tasty, refreshing and as lovely as the owner himself. I will be back next time I am in town!"], ["Miranda S.", "As we all know, Yelp occasionally throws us a surprise restaurant as number one in a particular city. Luckily, Pomo was only a five minute walk from the Sheraton Downtown. This mid range pizzeria looks OK from the outside. The place was half full on a Sunday evening and we were seated immediately. The menu is short and dominated by Pizza. You could choose a salad or a swordfish steak but the oven in the corner of the main dining area gives you a big hint on what you should be ordering. The drinks menu is dominated by Italian wine. There is also the pleasant addition of six draft beers.We all stuck with pizza - a 12\" thin crust individual serving. Bellissimo! The base was almost as good as you would find in Naples, itself; the tomato sauce was natually sweet and the salami picante. We had made the most of Pheonix's dining options and had expected to be taking home doggy bags but, blink and the last slice was long gone.The service is as you would expect from a place that is $25 a head. Our waitress kept an eye on us without being overbearing. The manager came out after the meal and gave us two rounds of home made shots.Is it the best restaurant in Phoenix? Not sure about it, but Pomo is correctly highly rated. It gives you relaxed dining and great Pizza in Downtown Phoenix."], ["Sherry B.", "We really enjoyed the food, service was excellent, and we will be coming back. Have come here for a romantic dinner, birthday dinner, and just for lunch. Great times but a little pricey."], ["Cathy C.", "A nice sunny day in Downtown Phoenix. I had a list of places I wanted to eat at and one of them was this place. I love me a good pizza every once in a while. They were pretty busy. We sat at a table outside with a view of a Vespa. The place smells so good...pizza baking in the oven...mmmmm...We tried half Toto Sapore and half Pomo pizza. Excellent toppings and ingredients. The crust was light and crisp but eat quick as the fresh tomatoes will make your pie soggy.The service was alright."], ["Georgie M.", "Pomo Phoenix is near perfect in every way. We came here last weekend before a play at Herberger Theater and it reminded us sooo much of their original on Scottsdale Road. Great ambiance, with the owner hovering around, making sure everyone was having a good time. Nice!We started off with some bruschetta and plate of Carpaccio. Both were delicious. We shared a Regina Margarita and it just took us back to their old location. Wonderful. They say you cannot go back, well this Pomo's is pretty darn close to the original. Four and a half Stars rounded up to Five. Expect to pay $45 for two, including taxes but not gratuities. Enjoy!!"], ["Harrison W.", "I don't know what I can say that hasn't already been said. My family and I have gone here for many special occasions. It has a classy ambience some of the best Neapolitan pizza in Phoenix. I normally get the Margherita pizza for fear that the other pizzas might not be as perfect. My family gets different pizzas, and they always love it, so I'm probably wrong, but I still don't want to take the chance.I've since moved to Seattle and have developed cravings for this pizza. I imagine this will be one of my first visits upon returning to the area."], ["Melanie P.", "\"Quick pizza that tasted yum\", said my son Ethan!  We loved it.  Definitely would come back."], ["Janelle E.", "Pomo, I  you.  Came in for lunch on a Saturday.  Ordered the Regina Margherita and the panna cotta for dessert.  Every single bite was perfect!  The people are nice, the restaurant is clean.  The Regina Margherita is one of the best I tried.  They provide a bottle of olive oil on the table which I did use to drizzle on each slice.  It made my pizza extra juicy.  The pizza is fantastic on its own though.I ordered the panna cotta, something I always wanted to try.  It came out plated beautifully with fruits and fried bread with powdered sugar.  Amazing!!I would give Pomo 10 stars if I could."], ["Daniel C.", "Maybe my review is biased towards the fact that my expectations were too high. How can an establishment that have hundreds of reviews and border 5 stars get away with such a below average food? Taken into account that I have been to a countless amount of top Italian restaurants, I do not feel guilty at all to give them two stars. The only reason why it has got an extra one war sure to staff hospitality and good service. Otherwise they would surely have got only one star. Presentation was ok, but taste was way below average. Caprese salad cheese did not taste as fresh as it should. Pizzas tasted way below average. Borders weren't crunchy, but really doughy. Desserts were way too sweet. None of the Desserts were finished, and that's never a good sign. I end this review stating that restaurant owners should revisit the formula of the restaurants one in a while. Maybe this pizza place was once a decent Italian restaurant. It is definitely not the case anymore."], ["Rich N.", "Nice caprese good pizza.   Great atmosphere.  A short walk from downtown Phoenix.  Open late.  I would come back"], ["Jake C.", "When I first was pulling up to Pomo's, I was a little mislead. It was fairly close to Arizona State University and was close to the center of downtown Phoenix so I didn't expect it to be as good as it was. The restaurant was not as big as I thought it was going to be, however, that did not change the fact that the food was amazing. The only negative part about going to this Pomo's is you have to be prepared to pay $5 for parking unless you want to park far away. Nonetheless, the parking is right outside of the restaurant so it is not a far walk at all. As soon as I walked into the restaurant, I was immediately seated. There was a fantastic Italian smell there that really gives you the full experience of the food. The menu was quite confusing if I'm being completely honest. It took my friend and I only a few minutes to decide what we wanted to eat but the waitress checked up on us a few times to make sure we were still doing alright. When it came to ordering, I had to ask the waitress to help me understand the menu but she was very nice and helpful.The food was delivered within 10 minutes of ordering it and when it came out, it looked fantastic. I ordered pizza and if definitely looked professionally made. They did not have ranch which was kind of disappointing but I guess with a place as good as Pomo's you don't need the ranch. When I needed a refill, the waitress literally came over as soon as I set my cup down to come refill my drink. All in all, the service was great, the food was great, and the overall environment was great."], ["Apryl P.", "Hey Yall...I would have given this joint 5 stars and posted this amazing picture of this lasagna, but because  I am all about  free...I didn't receive fried dough nor my free limoncello...I'm not even pissed that I had to send my cool temperature lasagna back because it taste awesome. However the lack of my free ness cost this is amazing picture of this amazing food. Then I ordered the Panna Cotto and my life changed...INSERTS ANGEL...the joint is totally freakin awesome. Oh with my dessert arrived my limoncello this limoncello...it sinfully disrespectfully delicious I felt like I was stealing something while I was drinking it never a good sign, truly an orgasmic experience..even though there are 17 waitresses they work and move in sync like a Olympic  Swim Team...kudos ladies!!!Asking me if I will come again is not the question... the question is how soon will I return...ASAP"], ["Marcy L.", "*NOTE TO WARY FOODIES : GREAT PIZZA COMES WITH  A PRICE*Sometimes you just need a good slice (...or eight). Slowrise sourdough crust cooked in a wood burning oven (\"This gives the pizza a soft and digestible crust\", says the menu...thank goodness, it's digestible!).We decided to order one \"Classica\" (thin crust) and one Focaccia (yummy puffy focaccia crust!):Classica Contadina (Red Bell Pepper * Onions * Gaeta Olive * Artichoke * Mushroom $14)Focaccia Carbonara (Fior di Latte * Eggs * Pancetta (Bacon) * Onion * Panna * Pecorino Romano $15).  Trying to stick to my Veg-kick, I requested that the chef remove the Pancetta from half of 'za.  The waitress confirmed that this request was fine, but the Pancetta + onion were mixed together...leaving me with a pretty bare pizza.  \"Could I have sliced tomato +olives instead of the onion+Pancetta?\" - \"Sure!\" - \"Excellent!\"When the 12-inchers arrived - piping hot and smelling like discs of heaven - We dug RIGHT in.  Let me tell you - - - some of the BEST pizza I've had; that Carbonara was right up my crooked alley.  Eggs on a pizza, sprinkled with freshly grated Peccorino, prepare for flavor explosion.  SO good, in fact, thaaaaattttt maybe (just perhaps) I umm....are one square foot of the stuff. *belch*  NOTE: *one* of the olives had a pit which I almost cracked my tooth on...As the evening waned on, we sat back and relaxed and just enjoyed the conversation.  After about 20 minutes, the owner delivered crispy dough pieces dusted with powdered sugar (then slipped away without a word).  These were delicious, and I cannot believe that I could consume more food!  More time, more conversation, and the owner returned again, this time delivering two chilled shot glasses which he topped off with Crema di Limoncello!!  He bowed slightly, and whispered \"Salute\" (then slipped away).   We were left to enjoy our crisps and 'cello under the evening protection of heat lamps - - - it was pretty great!*IF YOU ENJOY DRIFTING IN THE REALM OF THE BLISSFULLY UNINFORMED FOODIE, YOU MAY WANT TO STOP READING NOW....*  Because this is here's where it got hairy...The check stated \"1/2 Roma Tomatoes $3\" and \"Open FOOD $3\" (I've added an image of this).  When our waitress returned for payment.  I asked her, \"What is this charge for 'Open FOOD $3'?\" - she shook her head, took the check, and returned back to her manager to ask.  Moments later, we were visited by the GM.\"I'm so sorry, but my hands are tied!\"  He was charming, and kind, and seemed like the kind of person whom  would be really fun to grab a drink with! ....but he essentially said that he wouldn't void the charge, because then *he'd* be in hot water (not really a \"good\" reason to deny this request).This meant that our $15 12\" pizza was really a **$21** 12\" pizza...just because I'm a vegetarian who didn't want Pancetta and was not informed that the addition of sliced tomato & olives would result in a RIDICULOUS markup...  INSANELY good pizza.....but, sheesh...what a womper."], ["Josh S.", "Fresh ingredients, helpful staff, and fantastic drinks make this a Phoenix staple for me. Great spot for lunch, dinner, or a date.My \"usual\" is the Margherita pizza and a Peroni to sip. Simple, but it really allows the ingredients to shine. It's always a good sign to see an owner as involved as Matteo is. Keep an eye out for him when you're finished with your meal--he'll likely be heading your way with a bottle of Limoncello. Will be coming back for a long time."], ["Eileen G.", "Best pizza I've ever had! comfy hipster vibe with Vespa permanently stationed in front and cozy open seating inside and out. The grand ah factor is there massive handmade charcoal brick oven they cook their pizza in. They are certified by VPN and APN of Napoli Italy, meaning their dough recipe adheres to strict standards and damn if you don't taste the hard work that goes into each pizza.Very fresh toppings and tons of variety in the menu to choose from. Only con was that my mushrooms were slightly overcooked/soggy. The crispy but soft and slightly charred crust was heaven and you could tell the cheese was high quality because it was not over oily like most cheap quality pizza. I was very pleased.The cherry on top was the homemade tiramisu. 2 Best I ever hads in one place...wow! The owner also tends to come around the tables and offer homemade limoncello shots and thank you for coming to his restaurant. Very hospitable and omg the limoncello is so good I was using a spoon to get the last few drops out of the shotglass lol my husband was so embarassed. Will be back, arivaderci!!"], ["Emily C.", "I had been wanting to try this place because of all the great reviews. My friends rave about it too! So of course I went in with pretty high expectations. Someone had mentioned this below, but I do agree that this seems to be one of those places that gets a lot of hype so people may convince themselves that it's better than it actually is. The pizza was just 'good' in my opinion. I ordered a cappuccino too and when it came out I was like what the heck is this? Haha. There was no foam whatsoever. It just looked like chocolate milk. Still tasted decent, but was really weird. An Italian thing? Maybe? Who knows... I also ordered a salad. Nothing too special about it either. Though the mangoes on the salad were so ripe and delicious!!While we are there they started to clean the brick oven and man it was a super powerful smell. Whatever chemicals they were using. Luckily we were done eating, but some people were getting nauseous. Something I could easily overlook if the food was amaze-balls but unfortunately it was just average. I did go there with some people who have been there before and said they really liked it the first time, but agreed that it wasn't as good this time. So maybe an off day for them? I have to admit that might make me come back and try it one more time.Hard to pass up some great (and MUCH better) pizza at Cibo, North, and Bianco in order to come back though. But maybe if I am desperate, I'll give it another shot."], ["Red J.", "Ate at the restaurant today to compare pizza with other restaurants in Phoenix.Ordered the Contadina pizza, Donna Rosa pizza, Caesar salad, and the antipasto meat tray. The service was good. The pizza was okay. Having lived in Italy for 3 years we know what authentic Italian pizza taste like. What is somewhat ironic is that the word Pomo is the name brand of an Italian tomato puree that is used on most of the pizza in northern Italy. The restaurant didn't seem to use as much of that authentic puree than might be indicated by its name. The middle of the crust was a bit soggy, but it did have slightly scorched crust that you would expect on real Italian pizza. The meat cheese and olive antipasto platter was a bit disappointing. It may be that I am spoiled by the butcher's block at  il Postino restaurant.  Variety of meat was good but only one type of cheese and one type of olive were part of the platter.The pizza at Pizza a Metro is much more authentic to northern Italy then Pomo and is far less expensive."], ["R B.", "Very dope restaurant. This pizza was absolutely amazing. I got the margherita and it was pretty life changing. I also had the romana salad and it might be the best salad I ever ate. The cheese and croutons are so fresh.  I loved the italian sodas. The mallofogie(sp) was probably the best dessert I ever had.The staff was very friendly and provided great service and recommendations.Everything about this place oozes authenticity, from all of the italian the staff was speakign to the little scooters out front to the compliementary powdered dough with sugar and limoncellos after the meal.If this isn't the best pizza in AZ, its right behind pizzicletta.. but it is definitely above Cibo and Bianco in my books."], ["Susan P.", "My friend is a huge pizza lover and this is one of her favorite places that she wanted to take me and I see why!! Everything was amazing. I ordered the  Capricciosa pizza. This comes with Prosciutto Cotto, Gaeta Olives, Artichoke, and  Mushroom. I loved it! Everything was amazing except I wasn't a big fan of the olives. I washed it down with the Pinot Noir wine which was delicious. Not only was the pizza delicious but what makes the place is the customer service. Maurizio did such a great job. He always made sure that we got everything we needed and was so friendly and funny! Ask for him when you come here! So you got good food, good drinks and good customer service right? What else can top that? How about the owner coming around with free shots that he made! Um what!? What restaurant do you know that comes around your table giving you free shots!!?? Not to mention we also got free desert! This place was such a cute little spot for a date or even with friends for a great night of pizza and wine. =)"], ["Kelly V.", "Delish!  The lasagna and the pizzas were devoured nearly immediately.  The complimentary post-meal limoncello is TO DIE FOR.  It's reason enough to come here.  Cocktails were tasty and service was good."], ["Eric R.", "Mio Dio, this review is LONG overdue. I am so lucky that these guys are so close. This is one of the places I like to go when I am missing Europe. These charming little spot oozes Neapolitan charm from the atmosphere to the mouthwatering pizza, salads and pasta.These guys are definite top contenders for best pizza joint in The Valley in my opinion. Don't get me wrong: I LOVE Bianco, The Parlor and my beloved Bocce up in Cottonwood, but there is something about this place that really stands out for me and I think it is the European atmosphere.Lisa E. dragged me in here one weekend and I am eternally indebted to her for that. The first thing I noticed it that I heard a LOT of Italian being spoken-ALWAYS a good sign!I had the Pomo, what can I say, I'm simple and predictable. It was like having fresh meat and veggies, fresh cheese and savory sauce on a fresh baked crust sent from heaven. I'm not a pizza guy, I will NEVER suggest going out for pizza but these guys are an exception. Their pizza is not too heavy which is how a lot of pizza places utterly fail and the freshness and quality of ingredients is what really sets Pomo apart. I've also had the lasagne bolognese. Again, I'm not a huge fan of lasagne again because it is often so damned rich and heavy. Pomo pulls it off brilliantly AND they give you so much that you have lunch for tomorrow!They have amazing salads which are huge and full of lush, fresh veggies and their bruschetta is to die for.Lastly, their coffee kicks ass. This is what really takes me back to Europe: amazing, AUTHENTIC Italian Espresso. I WISH these guys were open in the morning because I would come here for coffee EVERY DAY!The space is great: they have an awesome little bar and a patio for the months when it's nice outdoors and some counter seating where you can watch your meal being prepared.If you haven't been here, put Pomo on your 2015 list to check out. If you're from out of town, these guys are not to be missed!"], ["Cc C.", "We stop in at least once when we come to Phoenix. The ambience is cool. Food is always good."], ["Fernando M.", "Great food, kickback atmosphere, and very down to earth employees.  Pizza comes in one size accompanied with fresh ingredients and a shot of lemon cello with fried flour covered with powdered sugar and honey after every meal.  If you haven't been, it is a must!"], ["Jocy C.", "This restaurant is authentic.  Really authentic.Their pizza oven is imported from Naples!  Success.Their pizza kitchen is open with modern decor.  As a customer, I can watch them make the pizza.  Success!Their Arugula and Bufala pizzas are really good.Along with their Lemon Drop drink.I would drive back to Phoenix, Arizona just to eat the pizza here.Yes, it is that serious."], ["S S.", "My sister and i tried this pizza joint yesterday for the first time! Excellent service and the food was delectable!!!! Margerita pizza did not disappoint!! Very fresh ingredients! I will definitely be back at the first opportunity!!"], ["Deborah J.", "Delicious and fresh salad and pizza ! We shared the mista salad. Fresh greens, cucumber and grape tomatoes with thinly sliced Parmesan cheese. Then we ordered a pizza 1/2 and 1/2 the Pomo and the contadina.Service was excellent!"]], "Cibo": [["Bill H.", "Great restaurant experience. The food was fantastic and the server was absolutely first class. We brought the kids and had an excellent night out. We were all raving about every aspect when we left. This place is great for all ages and tastes!"], ["Diane N.", "After receiving recommendations from locals and looking this place up online, I was super excited to check this place out.Dined here on a Tuesday evening, it was rather busy and we were in a larger group of 7. We ended up dining outside on the patio, which I loved!"], ["Kayla P.", "This place was alright. I took my bf here for a surprise dinner for his birthday. When I called I asked if they do anything special for birthdays and they said they could bring out a dessert for him. I also asked if we could reserve a table outside, and they said no problem. I called an hour before our reservation and was told everything was good to go. When we arrived, the waiter almost said \"everyone is seated back here\" and I kind of had to shush him, being that it was a big surprise for my bf... So he walked us to our table, which was inside even though we reserved an outside table. Everything went well, the food was okay but no dessert was ever brought out. I wasn't too impressed with my first visit but I think I'd return for a casual dinner date or something."], ["Hoa L.", "Came for dinner and there was live music outside. We chose the outdoor dining despite worries (and an eventual) mosquito bite. The outdoor seating is super romantic and pretty. It's large and comfortable, plus not near a busy street so it feels private. We tried one pizza (split into two types), pear salad, and a bolognese pasta. Everything was delicious. We spent a long time reviewing the menu since there were so many options and combinations. Eventually, we did ask for recommendations. First pick for pizza was the mushrooms and the second was one with sliced Italian bacon. The pear salad added some additional sweet flavor so we ended up not even choosing a dessert to try. This place is great for small groups or even an intimate evening for two. We didn't have a wait, but I would recommend a person to go early to get better seating. We were not right in front of the musicians, but close enough to hear each other speak and enjoy the music."], ["Charles C.", "Wow! My friends had been raving about this place for over a year so had to check it out on my recent visit. The pizzas are super thin crust which is just how I like it. I definitely recommend the spicy pepperoni pie, but they had so many options to choose from that you really can't go wrong. Cibo is an old house right in the heart of Phoenix, so the place has tons of charm if you are looking for a great date spot. I thought the service was excellent as well."], ["Lora D.", "This is an old 1913 bungalow in downtown Phoenix and has a great patio. I can't say enough about this place, the food is amazing and so is the service.    The fresh burrata is so light and creamy, the fresh savory zeppole OMG, lets just say I could just eat those and burrata and be happy.  The homemade pasta and pizza are very tasty with great sauces and toppings.  Make sure you are prepared for on street metered parking or using the complimentary valet as long as its not full."], ["Doreen N.", "We came here for a double date night and as we stepped in, I absolutely adored the design of the restaurant. It was as though it was someone's house with multiple rooms, diverse paintings, and a beautiful outdoor patio. We all ordered pizza to share. They also let you do half and half on your pizza so you don't have to be stuck with one type. We ordered half Genova and half La Noce. Super delicious!!"], ["Dallas M.", "Seriously one of my favorite places to eat for date night. Very romantic vibe and excellent food. The service is paced for a dining experience, so don't expect to go in rushing to eat. Great wine, food, ambiance and service. Nothing but great things happening here!"], ["Shannon B.", "Amazing little pizza joint in downtown Phoenix. I cannot believe I just found this place, though I've lived up the street for over five years. Location: 5th Ave, downtown Phoenix.  There's street parking here and there, but I can walk!Food:  Pizza, salads, sandwiches, bread, Nutella-based desserts, wine.  We ordered a pear salad that was tasty; it included arugula, pear, and cheese. The bread delivered with the salad was a white chewy bread.  My friend wanted meat on his pizza, and I didn't. They allowed us to get half and half; I got my veggie pizza on one side, and his sausage was on the other. Perfect!   The dessert we ordered was kind of like a delicious deconstructed funnel cake with Nutella for dipping sauce - delicious!  Service: The servers were efficient and brought us water throughout and were helpful and quick.  I wouldn't say the employees were overly friendly, though. While walking in, a female employee opened the door but just kind of stood there, not saying anything. No, \"welcome\" or \"hello\" - nothing.  Strange to me, but that's my Texan roots craving some more friendliness! For reservations, one must have a group of six or more to make reservations.  We just had two but easily found a table on a Saturday evening at 5:30pm."], ["Gabrielle S.", "My favorite gluten free pizza ever! They have a spicy sausage that's fantastic. Service has always been great. Be sure to sit outside and get their iced tea...so yum! They have a live jazz band that does radiohead covers, which is the perfect cherry on top!"], ["Noor B.", "I love Cibo. Whether it's brunch, dinner, or a random meal, it's always so good here.After trying a few pizzas, I can't pick a favorite. Each one is made so well, with such delicious and fresh ingredients, that it's hard to go wrong. I guess if you pick a pizza with ingredients you hate, it won't be good, but probably not any fault of Cibo.Happy hour is really nice. Cheap house wine and Italian beer, plus a sample of food items. The gnocchi is fantastic - really wonderful and great to split with a couple people. In terms of appetizers, it's so hard to beat the caprese. The seasoning on the tomatoes is out of this world. It's my favorite caprese in Phoenix.Again, if you aren't huge on Nutella, dessert might be a bit challenging. That being said, I love sharing a strawberry and Nutella crepe with my husband at the end of a meal at Cibo. It's so good... so good.  Can't really describe it any other way."], ["Rami H.", "I stopped there on my way back to San Diego. I have that their Pizzas are very delicious. Me and my friend ordered four half of different pizzas and they all tasted good. The restaurant setting is very nice too. They had live musician playing on the night we went. Service was good. I will diffidently give it another visit next time i am in AZ."], ["Karina H.", "Perfect place for a date. It is very romantic and II actually like their patio seating more than the inside. We went on a Saturday and they had live music. It was perfect.I ordered the Diavola pizza and it was spicy, just as promised. My husband ordered one with sausage and he really enjoyed it. We ordered a bottle of wine and everything was just dandy.Make sure you make reservations, it get pretty packed, especially this time of year. The only thing that I wish were a little different is their bar. It gets very crowded and it's tough to get through to order something if you're waiting to be seated and it's hard to wait in line because their space is small and people need to wal;k by. So, like I said, make reservations for the evening."], ["Beth K.", "Cibo is my go-to restaurant for anything from a quick tasty salad for lunch to a romantic dinner under the stars. The food and service are consistently excellent and their pricing is reasonable. It also doesn't hurt that it is located in  super cute old house downtown with an awesome shaded tree-filled yard perfect for outdoor dining during the milder months."], ["Arizona T.", "Tried again because 2 people in our group insisted on trying it. Sat outside as a party of 6. Birthday for 2 of the people.Its OK. The pizza that has pears and arugula on it was good the very first time we went but this time was just LOADED with arugula and they put it on right before bringing it out vs right after it came out of the oven. So it never wilted. The pizza just didn't seem very fresh and was fairly dry.We also had the antipasto and it was fairly lackluster with unripened olives all over. Huge ratio of olives to everything else. A bit stingy with the meat.Service was sterile. Still not sure who our server was. We probably had 3-4 diff people come by from time to time. Had to get up and find someone to ask for a check. Being seated outside here you really feel like you're fairly forgotten about.Hopefully won't be back. Too many better offerings now in the valley for pizza."], ["Dwayne O.", "In an old house on 5th Ave North of Van Buren where you can sit inside or outside where there is live entertainment.This is the 2nd time I have been there and enjoyed it more the 2nd time than the first.Ordered pizza both times and this time had the Funghi Pizza with Italian Sausage. Good thickness with the crust and a good amount of mushrooms and Sausage.The Capricciosa was tasty with the black olives and artichokes with the black olives on the strong side.The service was excellent with our server (Kul) who made sure we were taken care of.The parking is along the street with a small amount in the back.I like that it is far enough from downtown to avoid the crowd yet close enough if you have an event downtown.Will be back again to try other items on the menu."], ["Shane B.", "Food 5Service 5 Atmosphere 5 FOOD:Cibo has elevated my expectations of good pizza. The crust was crisp and the flavor combinations were expert! I had a half and half combination of Diavola and Genova. The Diavola is slightly spicy and though I don't like spice, the flavor was excellent! I highly recommend the Genova pizza! An entirely unique flavor experience! SERVICE:We had a fantastic service team, Yasmin and Brittany were kind and welcoming and had such a genuine approachability. They wanted us to have a great experience and gave us passionate recommendations! They are great! ATMOSPHERE:This place is so warm and inviting! The restaurant is within what used to be a house, it's clean and the tables are well spaced. Patio dining looks great! This could be a great romantic stop."], ["Mo B.", "Talk about \"This Old House,\" - Cibo is definitely a place to try at least once.  I have to say that I was not impressed by their menu.  I happen to have a colorful palette and the food just didn't do it for me.  I did enjoy a few glasses of their house wines.  The atmosphere is nice if you're sitting closer to the front.  There's not much ambiance in the back room.  We felt a bit isolated."], ["Kate M.", "The day after Christmas, Mr. M and I met up with Tim S. to give Cibo a try.  We got there a little early to get a table and right away I was taken with how the restaurant looks as we walked up to it.  With all the white lights, outdoor seating, and the pretty bungalow, it felt very welcoming and a much appreciated respite from the typical strip mall setting.  We were greeted and seated right away by the host, and our server, Jessica, was there right away to take our drink and app orders.  Since it was still happy hour I took advantage of those great deals and ordered the Straccetti ($4) and the Polpette ($6).  We also ordered a glass of house red, which I think is a montepulciano, or maybe a sangiovese...I don't know.  Both are fun to say and it was only four bucks.Those apps are both 5 star!  I aspire to make a meatball that good.  Flavorful, moist, and accompanied by a nice red sauce and some crusty bread.  The Straccetti are completely addictive and I highly recommend those as well.  The little touches of fresh basil ribbons and slivers of fresh parmigiano just made that one even more perfect.  I would order both of those again anytime.  Delicious!My husband ordered the calzone and I thought, for almost 15 bucks, that better be one damn good calzone, and it was!  Absolutely excellent blending of flavors and it's huge.  It made for some great leftovers the next day.  The best item we ordered.  Tim and I decided to order 2 pizzas to share and the pizza margherita disappeared in a hurry.  Simple, and perfectly done.  Now, the pizza rustica on the other hand was better as leftovers because it was underdone when it was brought to us.  I am familiar with the fork and knife style of pizza, but as I tried to take a slice of this one, the crust just kind of smeared across the pan and was almost gooey even though it was very thin.  The prosciutto was good quality, but because it was underdone as well, its flavors really didn't come alive.  An edge of crust was burnt, which is fine if the rest of the pizza is done, but the middle and the overall pizza was not completely finished.  I warmed it up the next day in a hot oven on a stone, and then it still had that chewy crust consistency, but the great flavor of the prosciutto was there.  The arugula was wonderful.  Fresh and peppery as it should be.  They were extremely busy, which was expected, and I think they took that one out of the oven just a minute or two too soon.  No complaints, but it was noticeable that it was undercooked.  I am a big fan of leftovers so it was not a big deal.  Jessica took good care of us and we had a great time.  I would most definitely make a return trip to Cibo."], ["Adrianna N.", "My boyfriend took me here as a surprise last weekend, so I pretended to like it, but I was pretty darn displeased.We got the tartufata (?) pizza, the one with mushrooms and drizzled truffle oil, because we're suckers for truffle anything. The taste and aftertaste were awful, the texture was kind of slippery and sloppy, and the pizza (though cooked in true stone pizza-oven fashion, so kinda expected) had a lot of black char dust on the bottom, which tasted very bitter. Our waiter didn't seem to care about our needs much; he didn't stop by a single time while we ate and it took forever to receive the check. But he DID keep trying to sell us extra stuff while we were ordering, which was annoying. Are the waiters here paid on commission, or what?I was considering ordering the fried dough with nutella for dessert, but the service was so bad, and we were sitting outside so there were tons of flies around our food. We left. Would not go back."], ["Claybirdie R.", "I've been meaning to update this since my last update. After posting my last update, I received a bit of a nasty email from someone affiliated with the restaurant, scolding me for not notifying them of the burnt pizza and saying they *probably* would have given a free dessert if I had (\"probably\"?! Wth?). So, whoever you are who wrote to me - first of all, it's not my job to do YOUR job. There were enough people involved in the making of my burnt pizza that it should have been noticed before making it to me. Second off, the waiter initially forgot to put the pizza order in, so he had to come back and ask me what I had ordered. So I wasn't too keen on complaining considering it was difficult to get the d*mn pizza to begin with. Thirdly, my toddler was eating it and I certainly would not have ever considered taking it away from her. Anyone who has ever eaten with toddlers would know this. Which leads me to my last point. Eating with a toddler at a restaurant is not easy to do. The last thing I would ever do is make the experience longer than I needed it to be. WTF. So, thanks for your nasty email. And here's some advice to you: the next time you receive a less than stellar review from someone whose hard-earned money pays your salary, respond like this: \"Dear customer, we are so sorry your experience was below our standards. Please see the manager the next time you visit so we can take care of you.\"If I had received an email like that, you better believe I would have been back just for the customer service. As it is, I will never spend another dime there."], ["Deni G.", "..... And there's a new winner in town.I really enjoy a good pie, as most of us do.  Lately, I've been finding myself at Cibo.  I use to fequent another spot in the Phoenix area for my pizza cravings however, that has all changed. So if your searching for  authentic Italian food, at  a reasonable price.  Look no further Cibo is the place for you. Every pizza on the menu at Cibo looks amazing. I cant wait to try them all.  So far my favorotes are the Salsiccia and and Diavola.  However, I would be neglectful if I  didn't' mention the calzones which are absolutely delicious, the best I ever had.You have to start your meal with one  of Cibo's aperterisers.  Try the Arancini or Burrata, its more than enough for two people.  Cibo offers a modest  wine list at prices that  won't make you cringe  when you see them.  The serving sizes at Cibo are very generous, however that didn't stop us from ending the night with a fruit crepe which was more than enough for two people.The service at Cibo is second to none. The staff is friendly, knowledgeable, and accommodating. If your looking for amazing food and service, stop by you won't be disappointed."], ["Caitlin S.", "I've been going to Cibo for about three years now and it still takes the title as my favorite pizza stop in all of Arizona. The ingredients in every salad, pizza, and calzone are top quality. The patio, live music, and actual restaurant add to the wonderful experience as well. I will say I do prefer their simpler pizzas on the menu and think they do a better job executing those but I've never had a bad experience here from the service to the food. Best pizza in Arizona by far!"], ["Rickey H.", "Great romantic spot and you can't beat the wine list.  Pizza is fantastic and well with it.  We split the pesto salad and it was excellent.  We also loved the outdoor music on Friday night.Can't wait to go back."], ["Juan L.", "To start off, were from Cali so going to a 4.5 star place, I def expected a lot more. The place seemed really cool but the food & the brew were ok. I felt like it doesn't justify its stars. It's safe to say, Yelp kinda let me down on this one. The potential is there but they need to step their selection of brews (more craft beers please) and the pizza needs better taste. All in all, I would try another pizza spot if you're from outta town, L.A. area to be exact."], ["Rick H.", "Originally we had another pizza spot picked but a change in plans put us here.   Cute atmosphere, quaint little restaurant in a converted local house.   Friendly staff, nice outside seating and decorations.  Food wise pretty good.   We started with the fried calamari.  It was tasty except it comes with a homemade like sauce and not marinara.  Overall a bit spicy but not ghost chili hot.  Then got 2 pizzas, the prosciutto and then an artichoke with olive and ham.   Tasty, crust had some nice burned/charred flavor, pizza cooked well.  Enjoyed it overall and if in the area we'd return but wouldn't go out of our way."], ["Christine B.", "Ohhhh Cibo  The atmosphere of this restaurant is definitely 5 stars. The patio is gorgeous. The inside of the restaurant is a house. Being from New York originally, Cibo gives me that historic vibe that I might get in an old little Italian restaurant in NY. I guess I should comment on the food as well...DELICIOUS! I have only gotten pizza here and that is because I can't justify getting something else because the pizza is so good. One pizza is large enough to split between two people with an appetizer or some bread. Highly recommended."], ["Jessica L.", "Some of the best GF pizza I've had in PHX! Would definitely recommend this place. Cannot wait to come back to sit on the patio once it cools down  *misting system is on point*. Upon entering, we were immediately greeted and sat at a table, service was prompt, and friendly. Unfortunately,  our waitress seemed to not be in a great mood, she was short in response,  and maybe seemed to be in a bad mood or having a bad day. Either way,  this will only encourage me more to come back, try more food, enjoy the patio. I give the food 5 stars, but the service could have been a little more friendlier."], ["Ashley S.", "I think all that can be said has been said about this awesome place! I can't wait to go back! Funghi pizza (Tomato sauce, mushrooms, and mozzarella) we added sausage, and arugula! It was so perfect! The wood fired gluten free crust was devine. Everything you want in a wood fired pizza. Our friends let us try some of their house salad. That was also perfection. With its grape tomatoes, pin nuts, red, peppers, onions and more with balsamic and mixed greens. For dessert we had the Crepes filled with marsclpon, blueberries, raspberries, and strawberries, sprinkled with powdered sugar! So yummy. To top it all off we had a nice Cappuccino, so foamy and warm! I think I had already fallen in love the second we turned the corner and all you could see was this beautiful place draped with lights and vines. As you walk up through the beautiful patio setting there were misters and a live band playing. Then the waitress took us through the little maze of what use to be a house to our cozy little table. I don't have one bad thing to say! I will be back very soon to try some pasta and wine! I can't wait!"], ["E Paul L.", "A few friends from the Owatonna, MN Class of 1963,  got together recently at Cibo for a mini reunion. We shared wine, pasta, LAUGHS and good memories under the twinkling lights of their outdoor patio. Cibo can accommodate groups from two to thirty-two with ease. Their talented one man band provides just the right ambiance.HIGHLY RECOMMENDED !!"], ["Michelle J.", "Great experience! Drove up with worries about where to park but luckily they had complementary parking! Saved my husband and I the parallel park argument! Was then greeted by the owners and sat in the front room. Our waitress was adorable and super friendly offering suggestions but not being pushy. The food came fast. Large portions and delicious! I would love to return when the weather gets cooler so we can sit outside!"], ["Kyle L.", "Hands down the best pizza in Phoenix. I've been to Pomo, Pizzeria Bianco, Andreoli, Parlor, you name it. Cibo just tastes... fresher? Might be something in the water (which is surprisingly not shitty compared to a lot of Phoenix venues, good job) but I just can't get enough of this place.Atmosphere is nice, cozy and not pretentious. Wine selection is above average. Staff is generally personable and helpful (Meagan is the best though). Cleanliness is never an issue.  But the pizza, that's what we come for."], ["Mean D.", "Yay Cibo!1. We dream of their handmade pasta/bolognese;2. We're not vegetarian, but veggie panini rocketh;3. BEST fries ever, until you try the4. *Truffle fries* (you can swoon me later;)5. Of course, the pizza is wonderfulThank you for getting rid of the rudest valets in the valley, continually parking cash tippers in the few handicapped spots available, making needy elderly/disabled/vets etc scramble due to lack of spaces. Boss man called the picks out on it: BAD ASS!"], ["Eric S.", "Food is fine, valet is terrible. Meeting my girlfriend and a colleague of hers for lunch. Plenty of space in the parking lot for the valet to run an efficient operation. They turned away me and the 2 cars in front of my saying they were \"full\". Really guys? Isn't this the idea behind having a valet??? So then I go park miles away. Good job Cibo, good job."], ["Josh L.", "Everything was perfect from the happy hour meatball appetizer to the house salad, to the bruschetta, the the bolognase pasta!!!! Amazing flavor!"], ["Chris T.", "So this place did a lot right, and only miss steeped a few times-plus very good food. The servos was great! Very good recommendations and follow through. Server even suggested a change to my pizza that the staff enjoys-it really made it nice. The problem with it was once she checked on my beer choice that was the lady time I saw her until I was completely finished. Small mistake to an almost perfect meal.The food was insane-very tasty!! The pizza combined typical Flavors of fresh sauce and cheese with pepperoni with less used ingredients of blue cheese and raw garlic. Crust had a perfect chewiness. Very good.There beer selection was ok-really would have preferred a draft selection but they did have great selection of local bottled beers.All in all a nice meal"], ["Sasha G.", "I came here for my birthday, we are outside and the lights and candles at night were very pretty!  When we first got there I was a little confused who would be helping us. The hostesses were dressed very casually, I thought they were guests. We got a little table and ordered a starter (fried rice and cheese). These were good. Then we ordered our food, and eventually dessert. The dessert was my favorite part. I got a Nutella and Marscapone crepe and added ice cream. It was the perfect amount of sweetness. The restaurant wasn't very busy but the service was very slow. We arrived at 7 and left at 9."], ["Jared R.", "Tom, our waiter made the night... very knowledgeable and competent, always there yet never hovering. Almost like Magic.First of all, though;If you are on a gluten free diet and want pizza YOU HAVE TO GO HERE!And now:The staff was brilliant, up to and including making sure our water never ran out.The atmosphere outside was festive without being overwhelming. The inside was cramped and too loud... but if you line the party atmosphere it's 199-% you.The food was perfectly done and arrived at the table right on time. The beer was wonderful (I had an oatmeal around from a brewery in Tucson). At one point Ton thought he had served me the wrong beer, so he was going to buy me what I had ordered. I checked and it was what I had ordered... but he bought me another round anyway.My girl ordered the calzone - which was huge, fillings in a perfect balance and perfectly done.I ordered the Diavolo, I believe - gluten free.If you are on a gluten free diet and want pizza YOU HAVE TO GO HERE! I would t have known it was GF. It was incredible. Damn near miraculous.Not cheap, but worth every penny. 2 people with all the trimmings will hit you for a Benjamin... but when the prosciutto and tomatoes are imported from Italy you know it's an awesome value.EASY 5 stars. Good job, Tom! :)"], ["Deb S.", "The food is absolutely delicious!  And there's a great outside seating area.  You will not be disappointed"], ["Donnie Mac M.", "I'd say this restaurant has it all: food, service and ambiance.  We stopped by here on the way to the airport...only about a 10 minute drive to the car rental drop-off.We were looking for a comfortable place that would work for three generations: 2 boys, my wife and I, and the grandparents.  This place met the mark: we all really enjoyed the experience.  It was unseasonably cold, so we ate inside--if the weather is warm, I'd recommend eating outside under the lights.  There were plenty of people outside braving the 50 degree weather, as there are heat lamps there.  We were told the house that holds the restaurant is 100 years old!We had three pizzas: Rustica, Vegetarina, and the Funghi.  Our six year old had the individual margarita pizza.  We also had two of the house garden salads; a large is good for two people.  Started with the risotto balls and the meatballs.  Everything was excellent, although the risotto balls were a bit bland.  Pizza crust was perfect--crunchy on the outside with a bit of char from the wood fired oven.Like othe reviewers, we loved the Nutella and banana crepe with ice cream.  We had two scoops, and it was plenty to share among six of us...very rich.  Our waiter was really attentive, and the hostesses were nice.  We will definitely go back."]], "Postino Central": [["Mj D.", "Came in here recovering from the disaster over at Sushiholics and this place saved us. Beautiful atmosphere,  and everyone was inviting and warm. We both split a panini, and it was delicious. The wine list was also impressive. I'll definitely be returning for brunch!"], ["Liz J.", "Pub board was lousyBruschetta is fabulous$5.00 Bellini, can't be beat!Nice place. Panini's very good."], ["Kameran M.", "Listen I like this place as much as the next person but In my opinion La Bocca has it beat. Better wine selection and food. Postino Happy Hour is great as well as the bottle of wine specials. Their service is always on point though and the patio is adorable so I do enjoy that about it. Now, I think it's a 3.5 star not just 3 but or quite 4."], ["Hee Y.", "I had early dinner (5pm) here today with my parents, and we had such a good time!Parking wasn't a problem at 5 and also not a problem when we left around 6:40pm on a Thursday night. While the inside tables were full as we were leaving, the outside seating was very much available.The waitress who served us throughout the night was a sweet lady who called me and even my dad \"honey.\"The brushetta ($14) was delicious - esp. the brie and apple, bacon & arugula. The tomato, basil & mozzarella was okay, but not stellar. My parents and I all had the split two ($10). The salads are pretty similar. My mom couldn't really tell them apart.The prosciutto with brie was great as was the soup of the moment (kale & sausage). After dinner, we shared a creme brulee ($7) that was not overly sweet - it was just right! The ambience of the restaurant was amazing - as the sun went down, servers placed candles on each table.Cons:1. No reservations (only for 8 ppl and larger)"], ["Sarah S.", "The BEST BEST service I ever received! We had a big party and they accommodated us and gave us outstanding service! We All work in the restaurant industry and the way we were treated was like the golden rule! Treat those how you would want to be treated. I already love this place but tonight was the icing on the cake! They helped us with putting elastic on our party hats, gave us apps, was over accommodating! Ian, David, and Andy are rockstars and should get all the good shifts because they make their customers feel like gold! Not to mention the food is amazing and the Monday Tuesday deal is bomb.com!  Thanks postinos Ian, Andy and David for making our night great and treating us like company in your homeOn thanksgiving day!"], ["Noor B.", "Gotta love Postino!!! Seriously, this place is amazing. I finally tried this location, which is funny because it's the closest to where I live, but it's small and parking can be a pain, even with the wonderful lot that's next to Windsor. That being said, it's worth digging up a spot and waiting in line to get in.Wonderful wine... what can I say? You will easily find something you like on the menu. There's plenty of beer to go around if that's your thing. Also, the bellinis are really yummy!For food, I usually stick to the bruschetta. Mix and match to your heart's desire. My favorites are fresh tomato with mozzarella and basil, roasted peppers with goat cheese, and smoked salmon with pesto.Sit outside if the weather is nice. You will not be disappointed!"], ["Jen T.", "I absolutely LOVE their special. Mondays & Tuesdays after 8pm, you can get 4 types of bruscheta plus a bottle of wine all for the price of $20. The bottle of wine is normally a value of $20 +, so this deal is sweet. I enjoyed the Tomato Jam & Fresh Sheeps Milk Cheese the most - I highly recommend it being one of your bruschetta. If you want to go for something new, there is always the seasonal bruschetta (ask your server for details). We went on a Tuesday night, and arrived around 7pmish. Requested a table for 6. We were fine with sitting either outside or inside. It's a little hot to be outside even with the misting system, so ideally I wanted to have indoor seating. Surprisingly, we only had a 30 minute wait to get a big table inside. Service was fast and efficient. Our waitress did an excellent job. We were 15 minutes early before the special started, but she still granted it to us. She also split the group bill correctly. The ambiance was perfect. Drinking wine with dim light and candles all around - definitely keeping me in a classy mood. I love the food and service. If you're going for the special, plan to arrive early. The wait can get up to more than one hour in a matter of minutes."], ["Jonathan E.", "3.5* would be more appropriate here. However, the affordable drinks and consistently above-average food quality pushes this over to 4*.What it is:A nice, casual spot for brunch, happy hour or just a quick bite. Good stuff:-- Great selection of both beers and wines -- Must try their bruschetta board (we've yet to be disappointed by this)-- Brunch mimosas are delicious-- Try the affogato for dessert - they surprisingly know how to make a good one-- Check the menu for a $20 Uber promo code - y'know, in case you get carried awayNot-so-good stuff:-- Might want to stay away from entrees - this is more of a casual place-- Service can be spotty if they're busy, especially tables in the patioOverall, likely to return for quick bites and good selection of beers & wines."], ["Tricia C.", "I am so happy that my friend chose this place for us to meet and catch up. The weather was nice so we sat outside and I thought it was very beautifully lit. There were also a few fireplaces going. We had amazing service the entire time we were there and the staff was very attentive. I ordered bellinis to drink and they were delicious with a great peachy flavor that was very strong but not overpowering or overly sweet. We decided to split the mix greens salad and two orders of the bruschetta. For the bruschetta, we picked the brie and apples, prosciutto  with fig, warm artichoke, buratta bacon arugala, ricotta with dates, and smoked salmon with pesto. I honestly loved every bite of everything I ate here. Everything was well thought out to make sure each bite was splendid. I loved how each bruschetta had textural and flavor contrasts. The salad was also very delicious.  The pears and grapes were perfectly crisp and fresh. The candied pecans were a nice touch to the salad. The poppyseed vinaigrette was super tasty and very light. I loved it! I loved it here so much I went the following day to the annex location to have brunch!! No shame. If you haven't been here before, go. You are missing out!!!"], ["Sophia S.", "Can't go wrong with eating here, every single time I come it is absolutely delicious. Not to mention that the prices are all reasonable. I highly recommend the tuna on focaccia. LOVE IT!!!"], ["Jacob E. G.", "Very nice looking place both outdoor and indoor. Had the nine iron which is bacon turkey and veggies. It was delicious along with the honey cucumber lemonade. People dress well here. It's not so much for dinner but more for a social place to drink wine."], ["Kyle S.", "I've stopped in twice to this location. First time was slightly lack luster. It was a Monday and they had a wait for what we found out was a poppin special. 20$ for bruschetta and a bottle.  The choices that we were guided to were good but the wine was ho-hum.  Either way it was a good date night not great. Fast forward a month to the most recent time. We had a blast, we found seats at the bar top and the bartender was engaging and fun and made great suggestions. The food and wine were on point and the vibe was completely different.  If definitely recommend this location for dates and finishing up the night."], ["Kay T.", "I really loved this place. I went here for brunch and ordered bruschetta, the prosciutto panini and the chicken mozzarella panini with a bellini drink.The bruschetta was awesome. I had the salmon, bacon, proscuitto and something else I can't remember at the moment. Highly delicious. Especially the salmon and the proscuitto. Equally amazing were the two panini. So worth it because I was had to take some home too! Too much food.The atmosphere was nice with lots of light during the day and the server was attentive. It's a good place to bring a date, friends or family. I'm so glad there's one in Tempe now too. I gotta go try that one! I'm going to try going at night too and see how it feels. :)"], ["Tinela I.", "I come to Postinos on Central at least once a week. The staff is always friendly and the atmosphere is amazing. Love coming to this place. I also bring out-of-towners here and they absolutely love it."], ["Bryan P.", "This place is absolutely perfect, the assortment of tapas is out of this world. The ingredients are the freshest available and the price is right on point. We sat outside and even on a hot day felt very comfortable. The service is team service so from time to time can get confusing but you always get what you need. The team is smart, urban and classy. Im a restaurant manager  from San Francisco & considering a move to PHX this may be the first place that I will deliver my resume'. Great job kids, your doin' Good...."], ["Luci W.", "I took my friend here for a birthday lunch and we loved it! The setting is so cute and in a way romantic. Food and service was amazing! I recommend the butcher's plate (I believe that's the name of it)."], ["Beth H.", "Visit was 02/10/15Service was much improved on this visit.  Food is still fantastic as before.  Bruchetta boards are unmatched, anywhere.  I make this a must-stop with my mom when I am in town, now.  They have specials each day, so check the website.  Great place to relax, nosh and socialize.  The atmosphere and decor is open yet shaded.  Great wine, and beer list.  I am not sure if they have cocktails, but I cannot say I care, as I always look forward to the wine.  Very trendy and fun place for 21+."], ["Damaris B.", "Super good food and very beautiful scenery outside. Love that it's dark and very romantic. If you're looking for a place like a first date or just a nice night out with your friends. This is the place to go. Good food, and I'm pretty positive the plates go with wine."], ["Tracy D.", "This place is great! I love the Mixed Greens. I order it at least once a week."], ["Hooti P.", "Oh holy deliciousness!This place is amazing!!!!!!Affogato is my favorite dessert, BUT,  they are all so tasty"], ["Brittany W.", "This place is Amazing!!! Such a cute place and food is good. Definitely recommend the bruschetta , great places to go for girls night and have a glass of wine and appetizers. It does get busy so make sure to get there early or go on weekdays! And you can go across the street to there partner for amazing home made cream! (:"], ["Rich Y.", "Was buying some suits down the way and hot this with a friend.  We walked in at noon and some how we got a seat.  Service was good.  Good was better!  I did the chicken panini and my friend did the roast beef.  Both were good."], ["Bradley E.", "Wonderful, wonderful place. Extremely low-key, wine-bar vibe. Vaguely upscale, but still young, cool and trendy. A great spot for a romantic date night out, or just to chill with friends.The food was delicious. We had one of the paninis and bruschetta- both were simple, well prepared, with no whistles and bells. They really do a great job of letting the freshness of the ingredients shine. Particularly noteworthy were the bruschettas. Definitely get the burrata one (over the caprese one, they sound similar, but the burrata one is better) and the prosciutto and fig- those were my favorites. Four is plenty to share between three people, and almost too many for two people to share. We had the creme brulee for dessert. Like everything else, it was low-key, unsurprising food that just really speaks for itself. Great spot for dinner or a late night. I would definitely return."], ["Katie E.", "Updated review- I received a personal email from the general manager offering a solution to the service problems we experienced and an exceptionally nice apology. 5 starts for that level of service! In any case, the food was 5 stars as well- truly delicious with unusual but scrumptious food combinations and absolutely one of the best brunches I've had in the last few years. Somewhere I will now highly recommend!"], ["Harmoni P.", "I recently went back for the \"happy hour\" - 20 dollars for a bottle and bruschetta. It's a great deal and as always the bruschetta was delicious! It's packed, I recommend getting there early and having a glass before 8"], ["Jennifer J.", "Delicious! Had the walnut toast with brie and fruit preserves......Yummy!!!Also had the toast with gruyere cheese and sunny side up eggs, also very good. Nice atmosphere too!"], ["Emily S.", "A. Ma. Zing. Although I've sadly moved from Arizona, anytime any friends or family go to visit, Postino is always one of my top recommendations. The wine list is hard to beat, but they've also got a great variety of beers on tap. But really... If you're going to Postino, it's for the life-changing bruschetta. Yes, that is every bit as ridiculous as it sounds, but also equally true. Your moth will leave very happy and proud of your for choosing such an excellent restaurant at which to dine. My favorites were always the brie and apples with fig spread, prosciutto with figs and mascarpone, warm artichoke spread, and roasted peppers with goat cheese.If you happen to be coming by Postino at an earlier hour, the brunch menu is equally as delectable. Whether you want the savory Country Toast or sweet Ciabatta French Toast, you really can't go wrong.Oh, yeah, and the beaded, flannel-wearing bar tenders are pretty easy on the eyes, too."], ["Jaqueline J.", "Amazing brunch menu and always good for happy hour. The staff here is extremely nice! And this location has an awesome patio! Wish they had a few more choices in beers on tap but other than that absolutely no complaints!! Best place to come for meeting a friend to catch up!"], ["Rick B.", "Met friends Sunday for brunch. What a cozy place. Great lighting and seating. Mimosas were on top. The meal was very light and filling. Chef Nicole took time out to share with us the flavor choices in pairing the dishes. We were very impressed at the quality of professionalism and knowledge of Chef Nicole."], ["Susan D.", "Great place to go with friends and chillHappy hour is phenomenal food isDelicious .   Highly recommend"], ["Lauren F.", "I had a lovely evening catching up with friends at Postino last week. It was my first time ever going and I was excited because I had heard so many good things! We went on a Tuesday night right in time for the wine and bruschetta special. We must have good timing. Mmmm! I love bruschetta and wine, it was like I came to my happy place and they knew what I wanted to order! My favorite was the Brie & Apples with Fig Spread. It's the perfect mix of sweet and savory. I could eat that everyday - no problem!The restaurant was crazy busy, but they offered valet parking, which was a nice touch. There isn't much available parking so I rather leave it to the professionals and take the stress out of my night! I think the wait staff was a little overwhelmed because it took awhile for our food and drinks and our server seemed in the weeds, but I can be patient when enjoying time with good friends! I'll definitely be back!"], ["Amanda M.", "I'm just realizing that I have WAY too many 5 star reviews but maybe it's just because I go to some amazing places.  This is one of those places.  To save whoever is reading this to consider going or not....  just go. Now.  You might want to consider making a reservation.  Stop reading this.  Run.  I effing love this place.  They do bruschetta like no one else does and their service and drinks are awesome too.  They are the rare triple threat- like if this restaurant were your girlfriend that you've been dating for only 6 months your mom would love her and all of your buddies would tell you to \"lock it down\".  Seriously that good. My favorite bruschetta are the apple and brie and the \"classic\" tomato and mozzarella.  I generally get a pino grigio (house) or pino nior (house) depending on my mood.  I really need to try more of their menu but their bruschetta is so freaking good that I never get past it.  The normal every day deal is $14 for 4 different types of bruschetta.  It's a pretty big order- each bruschetta is about 4-5 inches long and it's cut into roughly 1 inch pieces so it's sharable and not messy.  I personally can fill up on just that but if you've got 3 people with bigger appetites you might want to order 2 orders.  You might want to consider making a reservation or be prepared to wait- in the evenings they get packed.  I moved from Phoenix to Reno this past year and this is the number 1 place I miss the most.  If they ever want to consider opening up a place here we have a superb foodie community and I know they would be welcome.  GO TO THIS PLACE NOW."], ["April M.", "I have been coming here for years and recently returned for brunch. I have no idea what happened. From start to finish it was nothing like it used to be. Maybe since they have opened the other locations the owners and partner's just seem to have forgotten about the first one. The hostess was completely rude after telling us there was going to be a 30 minute wait for a table inside she refused to let us take a table out side on the patio when there where 4 open tables and I explained we would just have drinks and one  appetizer there because I needed to feed my child why we waited, and when the table was ready we would move inside . She refused to take our name for the inside table and said, if we take an outside table we could not move inside because it's too confusing for the server to have to move us.  I didn't realise its the severs job to move and reseat guests. After we were seated outside in the 104° we were brought 3 waters for a party of 4 about 7 minutes later a fourth finally arrived and our drink order was taken.  Those took 15 minutes to come. Then a different person whom I believe was our actual server walks up to the table and says ,\"  What do you want brunch is about to end!\"Not even,  Hello, Do you have any questions? We ordered and the food did come out fairly fast! The food was good and that was consistent. My daughter enjoyed her Granola.  I was the last one still eating and clearly I am no where near done and still eating starts to reach across me from my right side to my mother, who is sitting to my left and why reaching asks her,  \"can I take that?\"  He started to take the plate before she could even answer!  With his smelly arm pit in my face why I am still eating . The fact that his serving etiquette was rude to start but that its summer and we are in Arizona and he's sweating to cross over my plate and put his open arm pit in my face is appalling.  At that point I couldn't finish eating. Requested the check immediately. Too bad the owners have let the customer service go down hill. This place really used to be a great place were the servers took pride in their job and it was considered a great spot. Won't be going back."], ["Tamara Y.", "Love this place. Great food! Great environment! The bruschetta is to die for... Tomato jam and sheep milk cheese is my favorite as well as the smoked salmon with pesto!"], ["Kevin D.", "Why would I go anywhere else for wine and bruschetta?Tuesday. You. Me. And all the wine and cheesy & bread goodness you can imagine. Postinos is the place to be during the week. This place offers a great ambience that is perfect for any celebration or casual evening out with good friends. The wine is selection is great and the food even better. On Tuesday evenings the deal is $20 for a board of 4 types of bruschetta and a bottle of wine. The deal equates to huge savings over any other night of the week. You will not be disappointed!Postinos is a must try for anyone is the Central or downtown Phoenix area."], ["Steven P.", "Always a good time, especially during happy hour.  Love the bruschetta, soup and sammies.  Beer options never really change but they are refreshing drinks.  Inside bar is choice to sit unless its georgous outside, then the patio is a great option."], ["Cait H.", "I had the privilege of stopping by this place after a business meeting a few weeks ago. As I was traveling alone, I figured I'd just sit at the bar, little did I know I'd get the company of the fantastic and charismatic bartender. It was some of the best service I'd received because I wasn't being rushed, but was allowed to just sit and relax. I ordered the bruschetta, as most people do, but I certainly was not disappointed. The flavors were fresh, and the portions were more than filling. Needless to say, I would HIGHLY recommend stopping by here."], ["Amanda M.", "This place is me and my boyfriends favorite place to eat and talk! They have the best mimosas and wine and have the best bruschetta ever! I love being outdoors when it's cooler weather and I will always keep coming back to this place service is great the only issue I have is that the place is small and crowded."], ["Maria D.", "Not a fan of this location. I was so excited to go in as I love the arcadia postino. I experienced really slow service and so-so bruschetta.  I will return, as it is a great location, and perhaps just having an off day...."], ["Jo P.", "I love postinos food, drink , and patio but the last two times we've been there the service has been horrible. Waited over 20 minutes to order a second round of drinks and in order to do that had to flag him down and ask if it was ok to order more. The time we were there before this we were seated and ignored for about 15 minutes before asking a manager if we would be helped. I've gone to postino for years and the last two experiences being ignored by the server are putting a stop to that. Perhaps it's lack of employees and being there at busy times but for a place like this you'd think they'd be staffed appropriately on busy weekends."]], "Pane Bianco": [], "Anzios Italian Restaurant": [], "SOLO Trattoria": [], "Crudo": [["Tom D.", "Sweet, Sour, Salty, Spicy, Smokey, Savory or wait was that Salty, Spicy, Savory, Sweet, Smokey, Sour? Crudo is a restaurant that is a carnival for your mouth. I'm not talking about clown carnival, I am talking about Carnival in Brazil kinda Carnival! Thankfully I had the perfect martini cleansing my sinning tongue as the show went on. Starting with the Antipasta Pig Ears (These strips of perfection play spice with sweet and sour), Ahi Crudo (Unreal, just unreal how good this was), Squid Ink Risotto (Savory with bits of pepper and tuna hiding in darkness), Beef Brisket (A smoked strip of beef that breaks away with the slightest tug of the fork) and to finish that parade of debauchery a strawberry balsamic creation placed perfectly in a shortbread crust.  Kudos to Crudo! So excited to come back and taste the rest of the parade of flavors."], ["C L.", "Delicious. Came here for a happy hour after work and all of the apps were amazing. I wish I could remember the name of these doughy balls with butter and herbs. So good. Amazing cocktail selection and I definitely plan on returning."], ["John C.", "Very friendly...warm organization. They want you to come back !!!!!The food is very inventive ..well prepared and with excellent ingredients. When the chef doesn't get too carried away...the food is outstanding.Yes Yes !!"], ["Irene V.", "A little challenging to find but so, so worth it! I was itching to get out and went on the recommendation of a foodie friend. I'm so glad I did! This is a truly wonderful place to go with friends, family or on a date. You should definitely go! *Everyone* should go!Tucked around the back of the Gaslight Shopping center (really tucked around the far back) is a nondescript entrance.* Upon opening the doors you are greeted with the main dining area, to the right. There is ample seating for groups which looked super comfy. My friend and I ambled over to the bar area on the left side. The bar ambience is super chill. The mood lighting had been turned down and we headed towards the back, where there are low side chairs. I was immediately struck by the menu written on the wall in chalk. Drinks! We scored big time and managed to grab one set of drinks before happy hour ended. (T-Sa, 5-7pm). A bartender quickly greeted us (even though much of the bar was full) and took an order. I figured we'd have to hustle up to the bar, but no! Very nice! Happy Hour:$5 small bites. $5 cocktails. $5 Red wine. $5 White wine. $3 Four Peaks Sunbru & Hopknot. I was a BIG fan of the red. Big!I was overwhelmed by the amount of food options on the menu. There was quite a bit of stuff to look at and we had been gabbing. So I asked the very nice bartender to sum it up for us. A \"Crudo\" / Raw option (yellowtail) provided the delightfully light sashimi thing I'd been yammering I'd wanted in forever. (Sushi used to be a weekly staple back in NYC for me.) As described by the bartender the yellowtail delivered with a nice bit of spice. Yum! (It's worth noting the price of a crudo plate offers much more than what you'd get at a sushi restaurant.)We followed that with a heartier option from the \"Cotto\" / Cooked side. The texture of the butternut squash dumplings was a complete surprise to me. For some reason I was expecting an asian style dumpling to come out. Instead the outside layer was a rich, soft layer, almost like mashed potatoes. Different but in a very delish way.This is a definite must to check out! Just be sure to give yourself enough time. You won't want to leave.* It's quicker to enter from 36th street vs. the E Indian School street entrance. There isn't a sign but it's the first business when you pull into behind the buildings.UPDATE: The service is a little spotty. I'm not changing the stars. I'm just updating to reflect that it's unfortunate when your drink order gets forgotten. Tonight I had the pleasure of sitting in the alcove tables (in the bar area). These are wonderful if you want to have a quiet spot to talk. There's a point in the evening when a cocktail server takes over the outside tables in the bar area. (This happened last time.) However, as I was on a date I noticed the gap in service a bit more. Also, my date was the one to point out that our drinks had not been placed. When the bartender came out to check on us, I explained our drink order had been placed. (We then watched our server come out awhiiiilllle later to ask the same bartender where our drinks were. OOps.)Also, it's incredibly (to the point of distracting) loud when the bartenders make drinks. I'm the first to appreciate a good show. (Thank you Tom Cruise.) But simmer down up front. Yes, I'm getting old. But it's hard to hear!"], ["Floyd C.", "Yes I can drive all the way from LA to Arizona just to eat here....Well not everyday, but when I visit Arizona again this will be on my must dine list.Enjoyed several drinks, outdoor patio with heat lamps, and plenty of food.  We opted for the 5 items for $55.  Yes it is per person, but that ended up being 10 different dishes to enjoy.  Great to be able to pick several dishes and be able to sample the culinary items here.  I also enjoyed the fried pig ears and would put that on a must try list for first timers.On a side note this place is located on the backside of the shopping area it is located in.  So if you cannot find it, go around back.  I did not notice the large banner strung across the front since it was dark.  Last time I was at Crudo it was in Scottsdale.  I do not think you will find an item to not like, but I do recommend the short rib, squid ink risotto, and crispy pork ears.Enjoy guys, I hope to be back in a few months to dine out at Crudo."], ["Gabi M.", "Crudo is the definition of a hidden gem.  This incredible bar/restaurant is literally hiding in the back of a shopping center, but easy to find once you know where to look... and for those that find it, you'll likely feel like you hit the jackpot!Chef Cullen Campbell is known internationally and for good reason.  His creative menus along with cocktail creations from mixologist bartender Micah Olson are the talk of the Valley.  Now that I've been, I can say with confidence, that the Crudo experience exceeds expectations.  These local celebrities, along with Maureen McGrath Campbell (Chef's Wife) who runs the front of the house with ease, and the rest of the Crudo team have done a fabulous job with the space they are in.  I dined with a large group at Crudo last night and they took amazing care of us.  We had a cocktail paired dinner with three courses:1st Course was Albacore Crudo with Green Apples, Black Garlic and Truffle Oil*paired with Hophead Vodka, Damrack Gin, Celery Juice, Lime and Pierre Ferrand Dry Curacao2nd Course was Burrata with Marinated Tomatoes, Pimentos, and Garlic*paired with Maison Rouge VS Cognac, Cocchi Vermouth di Torino, Cardamaro Amaro, Grapefruit, Lemon, Luxardo Maraschino3rd Course was Beef Brisket with Pork Sugo, Fonduta and Creamy Polenta*paired with Buffalo Trace bourbon, Cointreau, Reagan's Orange Bitters, Sweet VermouthAll of the courses were divine - I couldn't pick a favorite when asked because I loved them all!  The first cocktail was my favorite.The atmosphere is welcoming and the space is gorgeous.  The staff is extremely attentive without being annoying: spot-on all around.  They also did a really wonderful job catering to the dietary restrictions that certain members of our group had.  We sat on the restaurant side, but the bar was pretty happening for a Wednesday night.I cannot believe it took me so long to get to Crudo, but it's definitely going to be a \"go-to\" moving forward.  If you're considering going, make a reservation asap and enjoy!"], ["Jon P.", "Crudo has been one of our favorite Phoenix restaurants for several years. We dined there again last Saturday evening.  The food was typically quite good and the waiter was good, too, until we received our bill. Despite his representation twice that we could select the chef's special as part of a $35, 45 or 55 tasting dinner (the menu recited that any item could be included), our bill reflected a $6 up-charge for including the chef's special in my tasting dinner. He had not mentioned the up-charge previously. Despite my inquiry about the charge, no adjustment was offered."], ["John S.", "The bar menu and care for detail in the mixology makes this a special stop. The staff is very interested in offering a quality product---high quality does not mean high brow. Down to earth and accessible: am I in Seattle or SF. Nice!Restaurant next...expecting to find more of the same quality."], ["Bacon B.", "Their inaugural brunch was a fantastic success!Terry T and I met 3 of her friends here Sunday morning. We were among the first to be seated. Almost immediately after being handed the menu, I spied three items with bacon. It's one of my few talents: being able to spot \"bacon\". Anyway, while we were waiting for the rest of the group to show up, Terry and I split the bacon jar. What's a bacon jar? Glad you asked. It's a short Mason jar layered with caramelized bacon, with just the perfect amount of balsamic vinegar to give it a kick, topped with avocados and sprinkled with cheese. I might have omitted an ingredient, but the bacon is what's important here. It's served with grilled bread, but only two slices so Terry and I had no choice but to eat the rest of the jar--that didn't fit on the grilled bread--with spoons. Life can be so tough some times.I ordered the bacon risotto with two sunny-side up eggs on top. Huge cubes of bacon, tender creamy risotto. It was grand. Generally, I prefer my eggs over easy and only the yolks runny. So it was a different experience. But it worked smartly and was delicious!The prices, as I understand, are considerably lower for brunch."], ["Jeff H.", "This is the best restaurant in Phoenix.  The cocktails are especially great and unparalleled in Phoenix.  Their cocktail program is world class. The food is unique and delicious."], ["Blake B.", "The food was amazing. Not one to give out 5s but I thought they deserved better then 4. Price was very reasonable compared to other high end places. Gnocchi,ravioli, yellowtail and of course the amazing butterfish. The owner even gave us a card and said the chef could personalize a meal for us. Best place I've ate at since  I moved to az even better then Kai!"], ["Alana B.", "I immediately fell in love with this restaurant. From the secluded and hidden outside to the wonderful decor inside, this is a one-of-a-kind Phoenix place. Food is exquisite. I can't wait to come back and try more of the menu. Started with the Fresh Mozzarella, bacon relish and caramelized onion (portion is small), but extremely tasty and the balsamic is delicious. Time to dip the bread! Next was the crispy pig ears, I was doubtful but after all the reviews about them, I just ordered. Glad I did. It's hard to get my head around of what they are, but the chef puts an excellent twist on these. Try them.Pork belly, risotto, yellowtail and grilled mozzarella are on the list to order the next go around, which is going to be very soon! Happy hour is great here, such a variety on their drink menu. If you're looking for something strong, I suggest a Manhattan :)"], ["Jeremy J.", "Best bar in Phoenix hands down!! Andrew and Keefer on a Tuesday night is like going to bar college... Most knowledgeable and caring bar experience I've had... Great drinks fare price and awesome staff.... Give them a try!!"], ["Paige G.", "I really, really, really have been and was looking forward to coming to this restaurant.  It didnt necessarily disappoint, but wasnt what i thought it would be based on opinions of others. Drinks were okay, the food menu was a bit hard to understand for a 1st timer, but the food was good. Definitely recommend the pig ears for a starter and the short rib for main course. Both amazing."], ["Julie S.", "We had a wonderful meal at Crudo last week, which was a set menu with cocktail pairings. The decor and the staff were pitch perfect, once we found the place tucked in the back of the shopping center. Ours was a set menu for a special event, which it seems to me they must to on the regular as they had it down pat. The first course was an albacore crudo with green apples and black garlic, which was paired with a vodka cocktail with celery juice and lime. I loved the crisp drink against the buttery albacore, and black garlic is a new one for me! The second course was my favorite, both food and drink.  Burratta with marinated tomatoes, pimentos and garlic, served inside a mason jar, with grilled french bread on the side. This was served with a cognac cocktail with cardamom, grapefruit and lemon. I love burratta, and there aren't many places in Oklahoma who serve it, so I only get to have it when I'm traveling. The third course was beef brisket with pork sugo in a creamy polenta, paired with Buffalo Trace bourbon with Cointreau and orange bitters. I loved the cocktail, and I enjoyed the dish. My only concern with the dish was my brisket seemed to have even more fat than brisket normally has. But there was so much food, and the dish was so rich, I wasn't unhappy at all to simply side those pieces over to the side and not eat them. If that had been my main entree, I might have taken exception to it. I'd love to come back here and check out the full menu and see it full of beautiful people on a busy Friday or Saturday night."], ["Travis H.", "Beautiful inside... I wish they could separate themselves from the rest of the shopping center. It deserves to stand alone. Unique flavoring and wonderful mixology/fusion. I had pasta with squid ink and it was fantastic. You must stop by!"], ["Mia K.", "I have been to Crudo twice - once for restaurant week and another for drinks and appetizers.  The food was amazing!  We ordered the albacore, yellowtail, squid ink risotto, gnocchi and the salted orange and caramel budino with cream for dessert.  Everything was wonderful however the gnocchi was overcooked.  The cocktails were also quite good.  The ambiance is somewhat comparable to Searsucker minus the frills.  Quite surprising considering the location.  The waitress was also very helpful and opinionated with her favorite dishes and drinks.  As far as the appetizers, I don't remember what we ordered as 2 drinks had already kicked in at the time.  However, they were both $10 dishes with toasted bread which was probably not worth the carbs at the time as it was fairly meh and flavorless."], ["Cody H.", "One of my favs!! The yellowtail is pure perfection. The barata covered in a pancetta vinaigrette melts in your mouth. I highly recommend this place. Great wine selections too. Food took a little long but that is okay cause then you can have more wine;)!"], ["Asina G.", "Wow, wow, wow!  The food here is fantastic!  My two friends and I each did the 4 courses for $45, which turned out to be a great way to try a lot of food!  We started out with the Crispy Pig Ears.  We didn't know if we were going to be gnawing on pig ears like my dog gnaws on his, but wow, they were not what we expected!  The flavor of the pig ears coupled with the crispy texture was amazing.  I also ordered the Square Garden from their bar menu, which was really light and refreshing, with a little kick.  Not what I would have expected given that it contains celery juice, but it was really good!Now, on to the regular menu.  From the Raw menu we had the Yellowtail, Ahi Tuna and Albacore -- these were the stars of the evening, by far!  They are served sashimi-style, but each has its own treatment and light seasoning.  Very simple and clean, and very delicious!  From the Cheese menu we had the Burrata and Fresh Mozzarella.  I loved the bacon relish and caramelized onion together with the mozzarella!  Although my friend liked the Burrata (I liked it too when I tasted it), she said it was a little too rich to eat it all.  From the Cooked menu, we had the Risotto and the Salmon in Fata.  The Risotto is a signature dish for Crudo, and had great flavor!  It was really good!  Likewise, the Salmon was delish.  It's cooked inside of a plastic bag and they bring it to the table in the plastic bag and cut the top off.  It is very light, fluffy and has great flavor.  From the Grilled menu we had the Short Rib, Brisket and Pork Belly.  The Short Rib (sans the bone marrow) was very tender -- no knife needed!  The Brisket and Pork Belly were also really good, but the Short Rib was the star in that group to me.  The food here is phenomenal and the service is very attentive.  I definitely want to come back to enjoy more!"], ["Michael J.", "Had a great dinner at Crudo last night, while in Phoenix.  Amazing food, service and tasty cocktails.  Would recommend the Squid Ink Risotto and Buratta Cheese plate.  Our waiter was great and the bartenders made our happy hour very fun and entertaining.  Highly recommend giving it a try."]], "Nook Kitchen": [], "The Parlor": [["Lilie N.", "I'm pretty obsessed with pizza, especially unique personal pizzas.My boyfriend and I made a stop here on the way to Sedona - Thanks to the help of my fellow yelpers.Unlike many of the businesses we saw in the area, this restaurant was busy!I really liked the modern design, decor, and classy feel of the Parlor.  We ordered the Duck club and made our own pizza.The pizza was really delicious!  The ingredients were so fresh, and I love the rich taste of the oils and cheesy crust.  I almost ordered one for take out!5 stars for food, but 4 stars for service. The waitress gave us attitude when we tried redeeming our free yelp desserts, and wasn't too friendly to us throughout our visit.  Luckily the food was superb!  I would definitely come back if I'm ever back in the area."], ["Nadya E.", "Love this place! I have not had one thing that I didn't like. Favorites are the cauliflower gratinata, beet salad, pesto chiatarra. Service is great and they can usually get you in and out for a quick weekday lunch."], ["Jim V.", "Pizzeria Delfina, Mozza, and The Parlor. All pretty amazing restaurants!!! 3 of Americas greatest spots for the tastiest pizzas I have ever had, and I live in the town of Pizzaria Bianco and Humble Pie.I have made thousands of pizzas so I feel qualified to say that The Pizzas I had tonight and other times at The Parlor are the very best!!!Not only are the pies amazing but the Creamy Cheesy Cauliflower, The Panzenalla Steak Salad and any of the Fresh house made Pastas are always spot on.Tonight I dined with my favorite out of town foodies, 2 of which have never been to The Parlor, and I must say that once again everything we ate, touched, drank or spoke to was perfect.I was informed Alice was on her first day of vacation and I must say she left the place in capable hands.The only draw back was half way home we had buyers remorse that we didn't order the Olive Oil Cake or Tiramisu.I hate to raise anyone's expectations this high but I always expect excellent and have always received it.This is still my favorite restaurant in the world."], ["Nicole T.", "I give The Parlor a hesitant 4 stars, and I only do so because I wish I could give it the 3.5 stars it deserves.The food is pretty hit or miss. We started with the Chef's Board, a create-you-own and pay-as-you-order charcuterie plate. We ordered the Spanish \"drunken goat\" cheese, a soft brie, some kind of ham, and olives. The meat was overpriced; four slices of meat for $4? Sliced thinner than paper, I felt pretty ripped off. Let me tell you, as an avid goat cheese fan, I was really looking forward to some nice chevre infused with red wine. My disappointment was partly my fault, partly false advertising. Be warned: a Spanish goat cheese has more the consistency of a cheddar than a true soft, spreadable, slightly crumbly goat cheese. I could forgive my own ineptitude if my \"drunken goat cheese\" hadn't been sober as a judge. The flavor was most definitely \"eh\" for $4 for a measly little slice. The brie was good, but still not worth the $4 you pay for the serving. The plate came with pita bread that was unevenly cooked (inedibly crisp in places and delightfully soft in others), a slightly sweet salsa, a hot pepper dip, and (the highlight of the plate) a garlic pesto that was amazing. However, as amazing as the pesto was, it wasn't worth the price of its mediocre companions.Next, we had the \"small\" Caesar salad for $8 that was decent, but nothing special. I'm really not sure I can say anything else about it because it was simply a Caesar salad.The pepperoni pizza. Big, tasty slices of pepperoni on soft crust with torn basil on top? Delicious. Worth the money, absolutely. Add some red pepper flakes because, trust me, it makes it 100x better.The service was slow, admittedly. We waited a half hour to get our Chef's Board, then another 15 minutes or so between the salad and the pizza. However before I imply any resentment toward the waitress, she did, at the end of our meal, recognize that service was slow and that we were dissatisfied with the Chef's Board, so she offered to buy us dessert. We declined, but the gesture was all we needed to feel better about the meal.Absolutely go and check out The Parlor, but be aware you may have to wait (for both table and service) and keep one eye on your wallet, as they might try to steal more of your hard-earned wages with their overpriced food."], ["Jess H.", "Amazing pizza, drinks and salad. Very affordable. And high quality ingredients. Our pizza was super fresh. And the drinks were strong. Highly recommended."], ["Ali B.", "This restaurant was truly excellent. Loved just about everything about it. Came here once months ago, do not know why I have not been back yet!Our server was very nice, it was my first time there and she took time to answer my questions fully and such. I ordered a pizza that seems to no longer be on the menu? Wondering if maybe the stuff on it is just out of season or something, because I'd be so sad if it is permanently gone! I got a pizza with butternut squash, marcona almonds, goat cheese, some sort of leafy green, a swirl of balsamic, and marcona almonda. I am completely obsessed with pizza, especially unique pizzas, and The Parlor makes a mean pizza. I inhaled the whole thing in what felt like minutes.Planning on coming back and introducing The Parlor to my pizza-loving family members to see what they think!"], ["Justin S.", "Well having tried a lot of the other places that serve artisan type pizza, this was on our list and oh how I wished we hadn't waited so long!  Morgan our server was awesome, and the pizza was awesome as well!  My 4 year old LOVED the pepperoni kids pizza and it was perfect size!  I'm very picky about crust, some other places I have gone have had it too doughy, or burnt, too crisp or event too tough.  This place had some of the best crust.  We will definitely be back!"], ["Jaime G.", "I love this place.  I always get a meat and cheese board (they rotate through offerings such as prosciutto, genoa salami, goat cheese, brie, etc.). Boards come with pita bread, pesto, and my favorite the peperonata sauce.  I also get the spinach salad- with avocado, egg, bacon, cherry tomato, and a tangy dressing.  I have occasionally added chicken to the salad, but I prefer not to- chicken is not their strong suit.  They have a decent selection of wines and I opt to get a white by the glass.  The atmosphere is fun, with remnants of the building's former life as a beauty parlor.  Great patio and bar as well.  Limited parking-valet available during busy times."], ["Jacob L.", "These five stars are for the food, the setting and the awesome sixties music played!!! The pizza was exceptionally good. My only complaint (and this may just be today) but the service did not match the quality of the food and setting. Again, this just may have been today and I will return as will my mother because the quality of the food is excellent and while I'm here writing this review they are playing the Isley brothers and it's awesome! However, there seems to be a full staff and the service is lacking a bit :("], ["PhoenixMom 1.", "I wish I could review the food, unfortunately was seated, had water & waited for 15 mins. Everyone else was getting their food, didn't even get to order. Pretty disappointed."], ["Margaret L.", "I try to come here every time I am in town on business. The food is great and I love the vibe. I've had Courtney as a server a few times and she is so fun! I will be back!"], ["Kati S.", "My husband and I always choose The Parlor whenever we want to go out and we've never had a bad experience. The staff is always friendly and helpful. We love sitting in the bar area where it's always clean and the bartenders are very knowledgeable about the seasonal beers they have. AMAZING food especially the wide variety of pizzas to choose from and other great dishes."], ["Todd S.", "We tried this place when I dropped my car off for service at a nearby dealership.  We figured it would be a decent spot for lunch, let me tell you we greatly underestimated this place (but now I estimate it, I guess)!It is not fancy on the outside, in fact it is easy to miss.  It is also overshadowed in the neighborhood by the Camelback location of Pizza Bianco, but I find The Parlor every bit as good, without the wait and far cheaper.This is thin and crispy pizza so don't count on the crust to absorb all the oils, they are front and center and allow the toppings to shine.  I would recommend getting one 'regular' topiing (pepperoni or thier excellent sausage) and one of their unique creations.The prices are decent and the happy hour special makes it a steal."], ["Patricia M.", "I love it when the server smiles so much you feel like you walk out of the restaurant a better person. That happened tonight. I am partial to The Parlor especially since I am partial to the Nello's in Ahwatukee where Eric Mei got his start. We adore Eric and adore The Parlor. Tonight we got frito mixto, cauliflower, and cavatappi. So worth the drive!"], ["Debra C.", "I have had many gourmet type pizza's but am hard pressed to think of a better one than what I had at The Parlor. The Fungi Pizza is an amazing mix of a variety of sautéed mushrooms, garlic and truffle oil on a fantastic wood fired crust. No red sauce for this beauty!  The staff is very friendly and knowledgable,  able to make great wine pairing recommendations. The beat salad and the cheese board selections are amazing as well as the pasta selections. The Parlor is my new favorite for a memorable lunch or dinner. Something for everyone's palate so stop by and make your own special memory!"], ["Kitty M.", "This place has been our go-to for a few years. Food is consistently fresh, tasty and filling. The best part is the happy hour menu. The staff is always spot on with service. Cleanliness abounds, including the bathroom. Cold beer, tasty personal pizzas, fresh local veggies for garden board and homemade tiramisu with a twist of piñon brittle. Overall you get good food, historic atmosphere and wallet friendly prices. What else can you ask for?"], ["Kevin C.", "I was not duly impressed with the server.  She seemed to be abrasive when I asked questions about some of the items on the menu, as if I should know what they are.  The barbecue pizza was good & the dessert was okay.  However, I don't think I will return - the service was a big turn off."], ["Shannon T.", "I haven't tried Pizzeria Bianco yet, so I can't compare yet.... so I was torn between that place and The Parlor Pizza...but ultimately I am very glad I chose this place!My boyfriend and I were celebrating our 1 year anniversary, and this place helped to complete a romantic and delicious date night for us.The food here is just superb. The service we received was great, and we got our free dessert with no problems through Yelp by checking-in. We are pizza lovers so I highly recommend this place! The ambiance,  the food, just everything...loved loved loved :) def goin back again"], ["Joe J.", "not a fan.pretentious servers.BULLsh*t parking. (it's all valet unless you drop biz-y around Monday or Tuesday.)OVERsalted OVERseasoned gastro-pub food appealing to the 21-31 age/$55,000/year demo. if the Valley Ho pool were a restaurant, it would be The Par-leezy.been here several times over the years, from around 2010 - Present. ain't nothing done changed, as far as quality of food and experience.you want your water re-filled during a dinner? GOOD luck, boss! cuz your server MMMMMMight swing by once or twice after initially half-heartedly introducing him- or herself. i despise bad-attitude, lazy don't-give-a-sh*t food servers and they run rampant at The Parlor, son. bad training? bad floor manager? don't care, never going back. too many wasted dollars here.bar/drinks/wine decent enough blah blah bleezy...come ON, you can find booze a-n-y-w-h-e-r-e...so if you want to make a dent in the scene, focus on your food, atmosphere and service.to re-cap:food: bad. (mmm - burnt overcooked matzo crust pizza!) service: worseatmosphere: dark/depressoverall: super-duper hippy dippy place for scenesters who don't know what good food is."], ["Robin M.", "The cauliflower was to die for but the fungi pizza with carmelized onions was perfection!"]], "Amano Pizza Bistro": [["Marc A.", "This place is so awesome !  I want to sing their praises but hate to think I couldn't always walk in and get some perfect food - no matter my mood. Love, Love, Love this little joint!"], ["Rebecca P.", "I am not sure why there are some really negative reviews of this place...Sure, its not a super fancy 5 star place, sure its a bit more expensive than Applebees, but the quality is unmatched in South Phoenix.Great wine options, many of which are reasonably priced between 6.5-8 bucks for a generous pour.  I don't think they have a draft beer system though, which is unfortunate.I would also add that there is almost too much on the menu with the normal menu AND a lengthily list of specials.When we first sat down, the waitress brought us \"a taste from the kitchen\" of focaccia (great taste, nice customer service!). Ordered the antipasto platter for a table of 4 (again, great service, we were about to order the large platter when the waitress recommended the medium platter for a party out size.) Nice selection of olives, pickles, cheese, and the best artichoke hearts I ever had.  I liked the green chimichurri.  My only complaint is the plate would be better suited with crusty bread instead of dinner rolls.Ordered 2 pizzas to share for the table.  Both were very good and had a great crunchy thin crust.Skipped dessert this time, but again we got a \"a taste from the kitchen\" of the most AMAZING caramels with a salted cookie crumble on top.  If this is any indication of how awesome the other desserts are, we totally missed out.The bill came out to about 22 bucks a person including the appetizer, 2 pizzas, and 3 drinks and tip and tax.  Looking forward to coming again to try the entrees and dessert."], ["Jeremy N.", "Won't go back...between the 4 of us, we got the bruschetta, the fried cauliflower, 3 pizzas, (the sausage one, the salame one, and the artichoke one), the pork tenderloin dish, the creme brûlée, and the chocolate dessert. The bruschetta topping was good, but the bread was way too hard and crispy...when you bite it all the toppings come flying off and the toast cuts up your mouth, as opposed to the nice grilled bread it should be. The cauliflower had a burnt taste about it...the pies looked like they would be nice n crispy, but instead were doughy n chewy :/ the salame one had good toppings, the other two not so much. My friend said he enjoyed the pork dish, I did not try it. The chocolate dessert was good, but the creme brûlée was not set, it was custard on top and soup underneath :/ probably because of the deep coffee mug it was cooked in...cute, but not practical. I would not have bothered writing this review had the bill been about $50 less...feel kinda ripped off. All this being said, the waitress was very nice and bubbly, the food is just an unfortunate let down."], ["Ms N.", "Always have a great time!! Staff is friendly the food is amazing and a perfect date night spot or hang out with the girls!"], ["Gladys Y.", "The waitress was nice but she brought out the wrong salad. The plates are basic in size but they give you VERY LITTLE FOOD. This is not a place to come to if you're real hungry. Be prepared to spend some money. The food is VERY rich. I don't think I'll come here again"], ["Andres R.", "The crème brule is to die for....portions could be a little larger"], ["Bryant L.", "Amano's is really very good. We had a lovely dinner and glass of wine. Excellent service and food."], ["Chris S.", "A good place to go!  I have found they have good food and good service.  Tonight I had the linguini in a red cream sauce with prosciutto.  It was a littlI would recommend that you give this place a try because I think you will enjoy it.When you go in - tell them that Chris from Yelp recommended you go there.  They will have no idea who the hell I am but it might provide some interesting entertainment and a good laugh or two!Enjoy!"], ["Mechaela A.", "Best pizza in south Phoenix!  We frequently visit Cibo and Pizzeria Bianco and this is a great alternative not to mention closer to home. No beers on tap which is disappointing but good beer selection nonetheless. Had the prosciutto and artichoke pizza which was delicious. Tiramisu for dessert was a perfect end to the meal."], ["Megan O.", "Love it. Hubby & I always hit this place up for date night. Small, intimate, no rush, excellent food & wines. And a bonus-great prices. Specials are always delicious and employees are extremely friendly."], ["Aggie G.", "We went for date night. I liked how small and quaint the location is. You don't feel the restaurant chain or corporate vibe. As soon as as walked in we were greeted by the a staff and the waitress sat us. The tables had diverse group of people and there was a duo playing live music. The waitress suggested a specialty beer for my husband and he went with it although it was a bit different than what he normally gets. The food was delicious and have no complaints on the fake or quality.  Biggest issue was and seems to be the trend is that the wait staff is very very slow to refill you'd drinks. My mouth was dry and I really do good they fix this as I would have given them a higher rating if it wasn't for that."], ["Jean A.", "My son and I had dinner here last night.  I love it that it is less than ten minutes from our house, it seems to be family owned and run, and we had tried it once before and I remembered it as being good.  We started with an antipasto that had a nice selection of olives, some artichoke heart slivers, a few small pickles, two tiny fingers of cheese, a slice of some processed meat, a few sliced cherry tomatoes. and some thinly sliced prosciutto.  The prosciutto was so tough it was inedible and slimy, rather like chewing a thin slab of heavily salted, cold, old flesh.  The entire arrangement was dribbled with a green sauce that smelled and tasted of anchovies.  I thought I had read that it was meant to be a pesto and did mention to our server that it tasted bad and that I made pesto frequently and had never used anchovies.  She seemed mildly taken aback and returned to tell me it was a sauce verde and did include anchovies and greens.  I guess the fact that I had presumed it was a \"pesto\" when in fact it was a \"sauce verde\" excused it from being foul tasting.  When it arrived I had asked our server, wasn't there some nice, crusty bread to go with it?  Our server seemed utterly perplexed and after some discussion did return with three cold, dried pieces of bread that they use for their bruschettas.  Really?  The bread they use comes in packages of pre-toasted slices??  They don't have ANY bread they can serve with an antipasto??I only wanted a salad for my entrée and I ordered one from the specials menu that sounded inviting.  It arrived on a smallish oval dish and was mainly pre-packaged field greens with a reddish tomato based dressing that was not at all complementary in appearance or flavor.  There were little clumps of seeds on the top that reminded me alarmingly of the bottom of our love birds' cage that turned out to be \"marinated mustard seeds\".  There were a few slices of palm hearts and at the bottom of the dish buried under the greens, a smattering of dried cranberries.  There was not a thing to recommend in this salad.  It was such an unpleasant eating experience!  Really, unusual combinations are great, but they are supposed to TASTE good!!My overall feeling about this restaurant is that the chef and/or owner wants a European feel and for people who come there to experience a fresh and unusual approach to dining.  But really, the bottom line in preparing food is that it should TASTE good, not just be unusual.  I lived in Europe for four years, two in Germany and two in France.  My husband and I love to prepare and cook food.  The last salad I made used red leaf, romaine, parsley, thinly sliced red and yellow peppers, scallions, papayas, radishes, toasted pepitas, crumbled raw, organic goat cheese, crumbled smoked maple bacon and a dressing of braised garlic saturated EVOO, red wine vinegar and splashes of lemon juice.  It was delicious.  The salad at Amano was - awful."], ["Xavier C.", "Let's keep this simple. I purchased a LivingSocial voucher. The intention was to invite my best friend, Tamra. I waited until that last day to use it and Tamra couldn't make it. So I decided to head to Amano Pizza Bistro on my own. It was busy but luckily for me, I took the seat by the corner wall at the bar. Ordered a glass of Malbec and took in the atmosphere until it was time to place my order. Salad was delish and the Italian Sausage pizza was amazing. I also ordered pasta (like that last thing I need is more food!) -- delish as well. The restaurant was completely busy and staff were kept on their toes --- yet I received such great service and attention. First time here but it won't be the last. I look forward to my next visit. Cheers***"], ["P. D.", "Another great dinner at Amano, this time with my wife's parents visiting from Minnesota. Both enjoyed the meal and the ambiance of the place and wondered how we find places like this.They had a split dish of the Chicken Masala and a split Caesar Salad, my wife had the angel hair pasta and cherry tomatoes. I opted for the sausage pizza and we a enjoyed it immensely. Great spot and with 5 check-ins here I guess you could say we like it a lot."], ["EN K.", "Surprise SurpriseAttention: Tuesday 1/2 price bottles of wineIf you just look from the outside you will drive right byIt is next to a vacant lot and is very small but it is excellentIt is not for kids and not very big, only about 20 people fit but it is family run and great food.They have a regular menu and a daily menu.The cauliflower fritters were outstandingWe had the salmon and shrimp pasta and prosciutto with herb crusted chicken and both were very good. The pasta sauce with the salmon and shrimp was special.Definitely a great place for date night or small get together.See my pictures"], ["Stan J.", "Ok for our first visit. Extremely crowded so service was slower than normal according to our friends who were with us and are regulars. Want to come back and get a pizza. Got a chicken pasta dish that was delicious. Potential to wow me next time."], ["Catherine C.", "The menu is so creative and fresh. The staff is extremely knowledgeable and they always pair a perfect wine with whatever we choose. We always have fun here and the kitchen is extremely accommodating. To say my husband is a picky eater is putting it mildly. And they will prepare anything to accommodate him.Just an all around great place."], ["Vaughn K.", "Diamond in the rough!  No one would ever think that this type of restaurant existed in south phoenix.  On 16th Street and baseline to be specific.  I am a phoenix native and grew up on the south side and put it this way, if this spot was located anywhere it would do amazing.  Not saying that they aren't doing fine now (which they probably are because they been in the same location for a number of years) I am simply saying you would expect the service and the food items to be in another location of the valley.  You really wouldn't think too much of this place driving by it, however once you go inside it feels very \"homey\" and warm/welcoming.  They have a nice wine list to choose from, their pizzas are delicious  and shrimp pasta was top 5.  You can also purchase art that is hanging on their walls, not to mention that it is kid friendly.  I hate to use mom and pops verbiage when describing a personally owned restaurant, but I feel as if these are the most authentic!  I will always love this spot, down the street from my house but makes you feel like you're in another state when you're inside."], ["Daniel V.", "Absolutely a hidden gem.  Thanks for the amazing food and service! Lovely wine selection!"], ["Allison M.", "I love Amano! Small, local, pizza wine bar with great food, service, and ambiance. The fact this establishment doesn't advertise and is found based on word of mouth is my type of place! I have tried the pizza (amazing), pasta, and special of the night (a white fish). Closed Monday's, half price bottle of wine on Tuesdays--can't go wrong!"], ["Gregory W.", "Haven't been back here for a while. Went on Friday, horrendous service, no silverware, no water, no order taking, no one brought our check to the table, when they finally did, no one came to pick it up. Seemed like they were too busy with other things. Food was decent, but after the service we got, seemed horrible. No management whatsoever! What a shame!"], ["Eric W.", "We absolutely love this place!  The food is fantastic and the treat us like family"], ["Chad B.", "This is a tough review, but I'll keep it short. The food was great! Great pizza and pasta. BEST roasted veggies I've EVER had. It's a bit on the pricy side. The bad... It smelled like a porta-potty in the dining area. It was almost unbearable. Could have been an unfortunate plumbing issue... Good thing the food was great. We'll try it again, but if it smells when we come back, we will turn around and walk out. Two other tables complained about the smell as well. With such an offensive smell, the staff should have either sprayed the air, or simply closed for the evening. Just my. 02"], ["Monique P.", "I drove by this little place most days.  See all the time and thought it would be a nice little romantic date for the hubby and I.  Finally took an opportunity to go.  The ambiance of the place is great.  I like the the look and feel even for a smaller dinner place.  It is only open for dinner crowd.  They seem to have a good selection of wines which may be the only reason for me to go back.  We did eat dinner and it turned out to be close to $40 per person.  Seeing the place was a bistro when we walked in and saw pizza and pasta thought that was normal.   I guess maybe we had high hopes but they don't make their own pizza dough or pasta.  They do make pasta of the day for their special meals but other than that it's not fresh.  The service crew were nice folks but we're awfully slow.  Had a lobster mac and cheese for appetizer which looked good but ended up having a bland flavor.  Same with all the food.  It sounded and looked good but the flavors didn't connect for me.  I think the anticipation of wanting to eat at the place for months and then it not being as good as those expectations kind of threw it off.  I had even read other reviews and thought if all these people thought so it had to be good.  The food was okay but not really for the price being paid.  I won't be wasting my time much in this place."], ["Jennifer F.", "Went in with a party of 6 around 5:30pm. Took about 5-10 minutes for a drink order to be placed. Didn't get asked to order entree until being there for probably 25-30 minutes. Food was alright, overly salted. Service was absolutely horrible. We were never asked how our food was. We asked for our bill three times and it took 40 minutes to show up (which was supposedly being done by the owner). They refused to split our bill and coughed an attitude when we asked what was taking so long. Absolutely ridiculous service. Not worth it for the food at all. Do not go here."], ["Mar M.", "Love this little gem! Such a fun place to meet with friends and family for delicious bruschetta and wine. The staff is great -- very personable and accommodating. Great wine selection and the food is good. You have to try the different bruschetta they offer!! The pizza is also wonderful."], ["Steve K.", "This is one of those local places that you just love to share with your family and friends. It's a small, elegant restaurant in South Phoenix that is family run. The dishes are awesome and the wine even better. The staff is so helpful to walk you thru all your options and have a great date or family night out. From time to time, they have live music with a guitarist that just builds on the ambience. It is small and if you show up on a peak meal time, be prepared to wait - but it'll be worth it!!"], ["Greg M.", "I've been to this wine bar/restaurant before, however when I went recently there was very strong thick/humid odor. It was raining that day so it could have been the rain, but the odor killed my appetite. Service was a bit slow, but the wine the server suggested was great and the tiramisu was obviously home made and delightful. I would return... just not on a rainy day. Luckily we live in Phoenix."], ["Tanya R.", "This is a family run establishment,  which ensures everyone there is looking to make sure you're hapoy. I went with my parents and there was zero disappointment. Every appetizer and entrée was delicious. Make sure to make a reservation as they are rather small."], ["Scott M.", "It's been hit or miss.  The pepidew stuffed peppers are my fave and I want a double order every time I go.  Otherwise, I've had good and just mediocre food here.  The atmosphere is cool, such a small environment.  The wait staff is typically very knowledgeable, friendly, and very attentive.   Sometimes I wish they would open up the patio.  Great wine selection too!"], ["Sam V.", "Such a cool little place. We stop in for appetizers and wine every so often. We usually end up getting a pizza too. I think last time was a chorizo. We also take the suggestion of the staff regarding wines. They turned us on to one of our new favorites that we get for home now. I almost hope people don't find out about this little spot. It'd be nice to have a little south side secret."], ["Asina G.", "I wish I had only eaten the pizza here and nothing else, because then I could give a completely positive review.  I've eaten here several times, and most of them have been fabulous!  I'll give my bad experience first.  I once ordered a pasta with shrimp in it, and the shrimp was completely overcooked -- to the point of being chewy. Yuck.Now on the good!  The pizza from this place is awesome!  I always order the same one -- prosciutto and artichoke -- so I can't talk about any others.  The prosciutto and artichoke pizza is absolutely delicious -- always!  I always call ahead and just in run in get it so I can take it home and devour it in the privacy of my home.  I'm glad my daughter thinks artichokes are gross, because that just means more pizza for me!  Pair it with a nice glass of wine and a movie, and I have my very own date night (clearly I'm speaking from experience)!  I would put that prosciutto and artichoke pizza up against any pizza from Pizzeria Bianco any day!"], ["Johnyee H.", "This place is so delicious.  It's small and quaint, the atmosphere is romantic.  I can't rave about the food enough.  I've tried several different items, and have been impressed with all of them.  It's so nice to have a restaurant with creative and high end menu options in our area.  This restaurant is mine and my husbands favorite for a date night. I recommend you make reservations, since this pearl of a place fills up quickly and for good reason."], ["Daniel d.", "I wish I could take stars away. Lamb, from frozen and spongey. Couscous, runny and bland. Gnocchi, bland and disappointing, like the service. The service... Awful. I was looking forward to eating here for a year. The first time I stopped by, they were closing early. The second time I had my whole family with me, but they were full (didn't hold any of this against them, it added to the mystic actually) finally got to try it on Nov 2nd and man! What a let down. I wish I could have had the same experience as so many others but, with my visit, there was nothing to like, at all."], ["Jesus C.", "I've been a Chef in the valley for a long time, and this place is one of my favorites. Great dinning experience, very small place that fills up quick. Get there eairly and you won't be disappointed with the food or service. Please be aware this is not a cheap place to eat, but the price is worth it."], ["Chris R.", "We are lucky to have a restaurant like this in South Mountain.  I have been here a handful of times, and the service has always been friendly.  I have only had the pizza, but it's always great.  I went with new friends last night, and some of them had other non-pizza dishes that looked real good, and they gave good feedback as well."], ["PJ O.", "Nice little small Italian bistro.  Both of our dinners were really tasty and I Loved the quaint ambiance."], ["Michael T.", "Been here a few times with different groups of friends, and it's always a fantastic experience. Everyone in the staff is so friendly and very knowledgeable about the menu, and it shows through how much they love and are proud of this place. Food is excellent and can easily beat other fancier places in fancier parts of town, and their daily specials are just mouth watering. Stop by and you won't be disappointed, and who knows, you may just get a lucky sighting of the chef who saunters around every now and then. Truly one of South Phoenix's hidden gems."], ["Chrys W.", "Good was ok.  I guess  its real Italian food. We had to ask the waitress 20 questions.  Crab app was great.  Martini was excellent.  Food over priced for the portioned size . Not kid friendly"], ["Aileen B.", "I'm still here!4.5 stars.  (Initially wanted to give 5 stars, but an incident happened soon after I sat down, which I won't mention here, but if you're interested in finding out what, just PM me!)Came in for dinner and found a group of people standing around the bar area.  Waiting to be seated, I finally made eye contact w/ the group, which led to someone asking me if I was there for the art event.  I quickly said no and scanned the layout for posts regarding the art event, and there it was-- \"Meet the Artist, 5p-6p, wine and apps served.\"  Before seating myself, I asked if I could still take advantage of the event and was told a resounding \"Yes!\"  Cool!Wine was offered quickly (white Torrontes, red Montepulciano D' Abruzzo).  Server Tess told me about the white selection, but was going to get back to me about the red, which they were \"changing out\" at the moment.  Someone (Chef Fabian?) must've alerted her to my choice of red on my last visit, bec. Tess came back w/ a half-glass of the red.  Didn't like it though, so I asked to try the white and found it satisfactory, so she promptly brought me a half-glass of it.  (I am currently sipping on my THIRD half-glass!  LOL.)  Apps, which I was told was going to be bruschetta, took awhile to come out [around 545p, actually, and AFTER the comp table bread and JUST BEFORE I received my ribeye steak salad entree ($13), which, for the most part, looked good (the meat slices didn't look that particularly attractive) and, more importantly, tasted good, as well!  The salad is comprised of 6 oz. of ribeye, organic mixed greens, artichokes, chopped asparagus, and feta cheese.]  The delivered app was actually a rectangular slice of the Semolina crust Margherita, which had a really nice crunch and flavor for a red-sauced pizza!  I agree w/ the two recent reviewers that the balsamic vinegar is a bit too vinegary, but I just asked for butter instead, and that solved that issue for me, although I know that might not be satisfactory to those who are looking for a healthier alternative to butter...Still vacillating on whether or not I'm to try tonight's dessert specials of Bread pudding (w/ bourbon sauce) or Hazelnut chocolate pot de creme, but I can't say that I haven't had a great time dining here, tonight!"]], "Roma Garden Ristorante": [], "Forno 301": [["Leonard B.", "Wow. A local gem!!A place to meet friends, have a glass or two of wine, a cocktail or beer and enjoy excellent Italian \"light\" dishes. Absolutely try the eggplant parmigiana, but honestly everything was terrific. Roberto is a find and all the staff are super friendlySupport Phoenix local or come and enjoy a great place in Phoenix"], ["Fabs C.", "We're all for trying new locally owned pizza places.  Although considering some of the best locally owned establishments are within a 3 mile radius of this place, I've become somewhat concerned that an oversaturation will inevitably take place.  In regards to Forno301, I was quite surprised that I've driven by this little eatery many times. If you blink, you'll miss it, as it doesn't quite stand out amongst the other buildings in this neighborhood.The set-up and ambiance kind of reminds me of Pomo Pizzeria Napoletana, sans their bizarre obsession with 90s R&B music playlists.We opted to start with a Bruchette that featured burrata, tomato, and basil.  I've never been a big fan, as I feel that quality bread needs nothing more than a bit of oil olive to be truly appreciated.  Nevertheless, it was actually decent, even though we both agreed that we've had far superior burrata at Scotto in Los Angeles last summer.For pizzas, we chose a standard Margherita as a baseline and the Testosterone, which features one of the most underutilized ingredients on a wood-fired pie (the fried egg).  While the ingredients aren't quite up to par with what I've had at other places, they were passable.  What really turned us off, however, was the crust.  As another reviewer pointed out, the crust seems to take on this bizarre flavor of a saltine cracker.  Airless, crunchy, and offensively salty.  Initially, I didn't mind it, but its novelty (which I'm pretty sure is unintentional) wore off very quickly.For dessert, we opted to split the chocolate cake.  The size itself was the equivalent of those Little Debbie brownies AFTER you cut them in half!  In fact, a dried out brownie is essentially the best way to describe their version of \"cake.\"  It's not even worth your time.Maybe I would have went a little easier on this place if it wasn't for their abysmal service.  Some of the worst we've ever experienced (and we dine out 3-4 times a week!).  The restaurant was by no means crowded.  There were maybe four tables with customers, including two guys at the bar.  There were three or four employees that were constantly zipping by, never checking up on us and never offering refill our drinks.  When our pizzas were served, I was not provided a clean plate, so I had to physically snatch one myself from their stash.  I'm still not sure who our server was, as they all seemed to in a constant, but highly disorganized rotation.When it came time for the bill, we waited and waited.  People kept walking past us, but no bill was provided.  In fact, waiting for the bill actually look just as long as placing our orders, waiting, and ultimately eating/finishing our food!  We were just sitting there, looking increasingly annoyed, and absolutely no one seemed to pay attention, despite not being busy at all.  Are you serious?  Generally, I like to visit a pizzeria at least twice before posting an honest review, but this is one instance where we have absolutely no intention of ever returning.  I'm sorry, but I can list at least five pizzerias within walking distance of this place that absolutely excel in both their food, and more importantly, the quality of the service provided.  We won't be back - and I'm fairly certain that based on how preoccupied their staff was - they will neither notice nor care."], ["Robert R.", "I don't ever take the time to write Yelp reviews but figured I would offer up my experience to save others the trouble of a trip. My girlfriend and I love trying out local restaurants, so when we saw this place we decided to give it a shot. Unfortunately, the service was bad, and the experience as a whole was unpleasant.We found ourselves dining in on a Saturday night, and surprisingly, we were the only people save for two bar flies watching television, oh, and the owner outside with one of the servers sitting on a couch drinking and lounging about. It was strange. We had two different servers throughout the night and neither were anything to celebrate; in fact, the guy who you could argue as our main server was slow and didn't seem all that interested in helping us, nor did he seem aware that we had ordered a dessert with the other server after we finished our main dish. I typically forgive this kind of stuff and don't even remember it but we were the ONLY people eating so I kind of found it irritating.I'm seeing others describe the owner as a nice guy, and I'm sure he is, but I couldn't help but find his antics oft-putting, such as when he touched my girlfriend's face at one point, jokingly asking if her Sprite was wine. It would've been charming if it didn't come off as unnecessary and creepy. He remained outside almost our entire 45 minute dinner with a rotating cast of servers who would go in and out of the restaurant to enjoy whatever the hell it was that they were doing out there. I don't want to claim he was drunk because I don't know for sure, but it did appear as though there were some drinks flowing. The food was okay. I would've given this place a higher rating if not for the weird atmosphere, strange antics of the owner and workers, and oh yeah, the bad music selection (I enjoy R&B but they played the absolute cheesiest R&B the ENTIRE time). The creme brûlée was messy and unappealing to look at. There are better pizzas around town, like Cibo, Pizzeria Bianco, Grand Ave Pizza Company, Pizza People Pub and Pizza Heaven. I wouldn't recommend eating here."], ["Kyle S.", "Came here on a whim and we were pleas entry surprised for a little late night grub down. Everyone here is very Italian which is seemingly great. The food options were on point. They have a wood fire oven in he back that is clearly manned by someone that has done this before. The wine list was slightly limited but sufficient and he ambiance was energetic without being rambunctious. Not sure if it's in my top places to get to but I'd def recommend it to a friend looking for some good grub late night."], ["John G.", "Really cool vibe in this place - neat interior design.  If you speak Italian, you'll love the chance to practice with the staff (my buddy spent summers in Italy as a kid, so he stuck to Italian while we were there.  So, why 3 stars?  Just not the best pizza around.  The crust was really thin, but had a slight \"Saltine\" after taste, and could've used a bit more blackening.  The tomatoes they use were really fantastic!  I got the \"301\" pizza.  This had sausage, onions, and mushrooms as toppings.  The crust was too thin to really eat by picking it up.  The sausage was really nice (so often, italian sausage tastes like fennel, and not much else - not so this sausage - it was very nice).  Not a big fan of white onions on pizza and the mushrooms were a kind of unusual yellow color - just visually unappealing.  Maybe these are Italian mushrooms, but I didn't care for their look or texture (maybe sliced thinner they would've been better?)  I love wood fired pizza, so this isn't a 'It's not NY style/Chicago style' thing, it's really that I just didn't particularly care for the crust or toppings.Looks like a really cool place to hang out, but too far afield from my usual haunts for me likely to give it another go."], ["Todd A.", "What a hidden gem near downtown.pizza is legit,guy is from Italy and their pizza and salad is amazing. Housewife is reasonable and good and their is nice outdoor seating."], ["Erin P.", "Delish! Service is great! The pizze was so authentic I went back the next night to try the calzone and that didn't disappoint either!"], ["Mark C.", "As the Downtown Phoenix restaurant scene continues to explode, there are great new spots to discover all the time.  I've been at it nonstop for 2 years and I still find new places to fall in love with.  It should also be said that there are a number of culinary voids that Downtown Phoenix has room to fill.  Pizza, however, is absolutely not one of them.  Between outstanding establishments such as Pomo, Cibo, Pizzeria Bianco, and La Piazza PHX, there's an all-star pizzeria pretty much around every corner of Downtown.  So it was with some confusion (and even a little annoyance), when I found out another Pizzeria would be opening up in the neighborhood.  With so many options, I feel like someone will inevitably get pushed out.  And yet, many of them really do bring something fresh and unique to the neighborhood.  Bianco brings a rich tradition, Cibo brings an unmatched ambiance, Pomo takes authenticity to new heights, and La Piazza marries tradition with innovative new ideas.  So what could Forno 301 bring to the table?  The simplest answer is, well, simplicity.Tucked on the far west end of a strip of businesses on the southwest corner of 3rd Ave and Roosevelt, Forno 301 would slip right through your vision if not for a street sign outside directing you to the door.  The interior, while slightly elegant, is relaxed and approachable.  As many Yelpers have pointed out, Roberto the owner is byfar the biggest personality in the room and greets you with that booming Italian accent the moment you walk in the door.  He and his staff are talking up a storm in Italian to keep the atmosphere light and relaxed, but friendly and attentive enough to make you feel important.  My brother and I came here for an early Friday night dinner just before 5pm.  The place wasn't busy at the time but got busier as the dinner hour wore on.  We sat at the bar, manned by none other than Roberto himself.Roberto chatted with us a bit about our day and then proceeded to take our drink orders.  I got a glass of cabernet to start things off.  From there I checked out the food menu, which as others have pointed out is VERY simple.  A decent variety of pizzas, but beyond that the selection of other dishes is fairly limited.  Which I don't mind, as long as the ones they're serving meet my expectations.  I ordered the type of pizza that I pretty much measure every pizza joint by.  A simple margherita pizza.  A simple thin 12 inch neapolitan cheese pizza.  Topped with a little basil as you'd expect.  After taking a few bites, I knew I'd hit pay dirt with this place.  The crust was crunchy on the outside but still had that thin soft chewy interior and just the right charr.  The tomato sauce tasted like the fresh San Marzano tomato sauces I've had at Pomo.  And the mozzarella hit all the right notes (though I wish there was slightly more of it).  I'm not sure I'm ready to say its better than Pomo or Cibo, but it can more than hold its own.  For dessert, I ordered, well, the only thing on their dessert menu.  A tiramisu.  Instead of its own plate, it came in a bowl with a spoon.  No forks needed for this concoction as it eats easily with a spoon.  Its not as hearty as the tiramisu I've had at Pomo, but plenty rich and decadent.  A very nice cap to the meal.Total cost for the glass of wine, margherita pizza, tiramisu, tax and tip came to about $27.  The margherita pizza was actually priced a little cheaper than the other famous Downtown Phoenix establishments, though the rest of their pizzas are priced pretty much like elsewhere.  But echoing what other Yelpers have said, the staff here at Forno 301 was incredible to be around.  Super friendly, happy go lucky folks that clearly enjoy socializing with their customers.  Even though I've gotten great service at most of the big Downtown Phoenix pizza establishments, Roberto and his staff take it to a whole nother level.  Between that and the elegant simplicity of the menu and the restaurant itself, its a great fit for the Roosevelt Row area.  I have no idea how or if Forno 301 or any of the other outstanding Downtown pizzerias will survive the saturation of pizzerias in the neighborhood.  Without question they all deserve to survive and thrive with what they all bring to the table.  As for Forno 301, you can come for the pizza, but you'll come back so Roberto can put a great big smile on your face."], ["Taric W.", "Goodness gracious! Although I could eat many slices every day, I have to admit that Phoenix is becoming saturated with all these PIZZA NAPOLETANA places vying for the attention of a small foodie population. But while most of these joints are locales to see and be seen, Forno 301 simply cares about loving life and making good food. The menu is VERY simple. You've got your choice between red and white wine, like 3 different cocktails, and very few varieties of pizza. I guess it's more easily understood as the In 'n' Out model, where by limiting choices you can really excel at a few things. So I sipped on a very reasonably priced aperol, gin, and grapefruit mix (I love bitter! Legit!) and watched them place an order in the oven. The owners are very talkative, and come off as some of the most genuinely kind individuals I've ever seen run a restaurant. I wonder how they ended up here, of all places? When our pizza arrived, I was excited, but had reservations. Quite frankly, I can describe it most accurately as \"Just one notch below the top pizzas in the valley, but at a significantly lower price that makes the compromise easy to swallow\". I mean, the sausage was amazing, but whyyyy are the mushrooms canned? The sauce also seems canned, albeit the best canned sauce money can buy. The mozzarella tasted pretty good, but had a texture suspiciously on the waxy side. I am by no means saying I didn't enjoy my meal, but that you should lower your expectations from mind-blowing to above-average before you come here. Instead of a 5-star pizza at a 5-star price, it's a 4-star pizza at a 3-star price. It works. \"Every time you come, I will teach you a new word in Italian\" said the tall gentleman with a thick accent as I prepared to leave. And even though word he taught me (Quick! What's Italian for \"Good bye\"?) is already forgotten, the pizza was not...guess I'll have an excuse to come back, and hopefully try a variety of pie even better than what I had before."], ["James S.", "Had lunch today, our first visit to Forno 301.  We were delighted!  The food was fresh, hot and delicious.  The wood-fired thin crust pizza was one of the best, and also enjoyed the daily special gnocchi.  Outstanding!  The house red Italian wine was a perfect compliment to our meal.  Love the ambience and friendly atmosphere.  We look forward to a return visit to this hidden neighborhood gem!"], ["Alisha F.", "I stopped-in on a hungry whim, after a foodless evening meeting next door. Roberto was instantly FUN to be around as I waited for my to-go order. The ambiance was low-key and calming. If you order the prosciutto pizza, make sure that you're ready to dive-in. Don't judge me, but I may have been a danger to others on the roadway... as I could not help but eat half of the pizza on the way home. I was astounded at the value and amount of ingredients on this $11 pizza. The crust (and everything) was delectable. In essence, the pizza is very sexy, and so is Roberto, Luca, and the rest of the Italian crew. I positively recommend trying this spot. Next time I go back I will be dining-in."], ["Nicholas G.", "I actually live directly next to this place. I must also say I'm writing this review after the first day it has been open. Yes, I went on Monday, the day they opened up shop. For a while this little strip hasn't had much success with businesses. So for the people living in this area we were really excited to have a new restaurant/bar opening literally next to our apartments. I ended up walking over and having the Margherita Pizza. One of my neighbors met me for drinks a little after dinner....This is on par if not better then Federal Pizza's Margherita Pizza (which is my favorite, until now). Custom Brick Wood Oven!!!!!!The owners are from Italy and speak Italian. VERY FRIENDLY. They have Tiramisu that is really fresh, they were nice enough to give me a slice on the house. Variety of Italian beers around $4-5, everything very affordable! Cocktails, Wine, Coffee & Soda. They also have Bruschetta and Panini's as well. Interior looks really great. I'm happy this is here and I wish them many years of success."], ["Joanne R.", "what a great neighborhood place.  The food was fresh, delicious, beautifully presented and way beyond my expectations.  The owner, Roberto, has quite the personality and all the staff are just special.  I'll be there a lot and be bringing lots of friends."], ["Alfie N.", "Took me back to Italy! Just got a home on Roosevelt and found this little pizza spot during a night time walk. Decided to drop in and so happy I did. They did a wonderful job with the decor and even better job with the food. The pizza is classic Italian style and tastes great. Even cooked in a wood fire oven. I highly recommend this restaurant"], ["Dave B.", "It's soooooo painful for me to not love anyone, and everyone, who opens up a place of business in my neighborhood. Luckily they are doing well so here it goes. The interior was sparsely decorated and a bit barren (I was there on their first week so perhaps it's been improved) but the inside was not in the least bit \"comforting\".I had a pepperoni pizza and shockingly it had slightly less flavor than Little Caesars. Perhaps this is exactly what \"Authentic Italian\" tastes like, I guess I wouldn't know. But for my choices: a few blocks south sits beautiful Cibo, and a bit north Central sits Pane Bianco, both of which serve exceptional pizza. EXCEPTIONAL!But the owners here are Italians (and they speak to each other in Italian) so if you'd rather just hear a bunch of Italian words brandied about, and that makes you feel all \"worldly\" and \"international\" I suppose this would be your place. I'd rather just have a great meal in a beautiful/comfortable setting.I hope they do well."], ["Christine B.", "I live across the street from this place.  SO SO good. The owner is amazing- Roberto. The staff is amazing. This place is going to blow up. Going to be right in the running with cibo and bianco. It is a very small place but you can tell these guys know how to run a restaurant. Oh yeah the food... Is amazing. Could of ate 2 of the brick oven pizzas. The menu is small but you can tell everything is very fresh. I will be back soon and frequently after that!!"], ["Joe G.", "Pleasant atmosphere, although a bit tight. The owner is very friendly, but service is a bit slow. He had a wait staff, but it seemed he was doing all the work! We ordered the 301 pizza. Excellent crust and fresh tasting  sauce. The only downside was the paucity of ingredients. Seemed like no slice had all three ingredients, mushrooms, sausage, and onions, and many just cheese and sauce. We would have been just as well off ordering the Margharita pizza for $2 less. It was delicious however! No beers on tap, so we ordered a couple Alaskan IPAs in the bottle. I personally would like to see a few more craft beer selections be available as they have only 7 or 8 bottled beers to choose from. This is a nice neighborhood establishment with good pizza, and we will certainly be back for another visit."], ["Steph C.", "Must try their tiramisu. So delicious."], ["Mike S.", "Really great!  Everything I've had on the menu is solid.  Also, very affordable.  The owner is great and tries to get everyone to speak italian which is pretty fun.  They feature different pasta specials as well as salad specials from day to day.  Hidden little gem."], ["Jennifer S.", "I have to admit I was skeptical about another pizza place opening up in downtown Phoenix, but this place definitely is a great add to our neighborhood.  We enjoyed the rustic atmosphere, friendly staff and great pizza."], ["John S.", "If you're looking for more than just great food, this is the place!The mood is always light and the staff is always very social, engaging, and friendly with the patrons. Keeps me coming back time and again. Roberto is an exceptional host with a killer sense of humor! Highly recommended!"], ["Reyna G.", "Real italiano! Love this place, owners are extremely friendly. Very clean and fancy inside. The food is very delicious as well."], ["T A.", "Went back and tried a few specials they had including the Pulpo (Marinated octopus) which was outstanding!They still have service issues when busy. Bartender seems overwhelmed and even if you sit at the bar, it's not good services. All three times I was there he forgot at least one drink order or my food order. Not good. They appear to be understaffed which is probably an owner/manager issue.  Overall I think the pizza is good but I would try the specials before I'd order pizza here."], ["Callie R.", "I found this gem while at Lola's coffee and I'm glad I did. Their pizza is incredible and the atmosphere of the place is very homey. I really enjoyed that you could see the wood burning fireplace where they bake the pizzas from where you sit. Even better was the staff, I've never had more attentive servers at any restaurant before. They treated me like family, this has become my new go-to for pizza and wine for sure. 10/10"], ["Mark G.", "I genuinely love this place. The Italian bartender/server is a riot although his service can be on the slow side. It doesn't really matter though, because the dude is hilarious. Food is on point. Pizza is great, best downtown imo, and I'm a big fan of their pasta and salads as well. The only reason I didn't give five stars is their penchant for playing sexy time r&b music at obscene volumes at times. Sorry, but hearing a dude sing about laying his girl down on a bed of flowers and oil while describing licking her entire body doesn't exactly wet my appetite. For food, that is. Please pick a less obnoxious dining channel and I will be happy to upgrade to five stars"], ["Alessandro N.", "Very authentic Italian place.  It was great getting to practice my Italian skills with the owner.  I had the Margherita Pizza, and overall it was good, great tomatoes and fresh basil. I wouldn't call the crust authentic Napolitana, perhaps the oven wasn't hot enough, or the flour is a bit different, it just didn't have that Naples Caputo 00 flour taste ~ reminded me more of pizza from Florence or Rome. Being a pizza professional I am super critical of pizza places, so I'm giving a solid 4 stars. Stoke the oven up a little more to get some leopard spots on the bottom of the pie for that 5th star."], ["Kay M.", "Amazing! Delicious pizza, fresh salads, great service and overall a a wonderful place! The crust though.... Yum. One of the owners was our server. He was so much fun! We will definitely be back! Ps don't forget to try the tiramisu!"], ["Kosta T.", "This place is wonderful. The food is exquisite as well as the service. So happy these guys moved to the neighborhood... Although there are 2 other pizzerias closeBy that compare, we choose these guys! Love the authenticity"], ["Jenn R.", "This place is truly authentic. It's a brand new little restaurant downtown and the perfect lunch spot if you work/live in the area. I ordered the Margherita pizza which was cooked to perfection. The basil was fresh and the sauce was sweet and perfect, holy moley. We also enjoyed some wine and obviously had to have some tiramisu and now I've been craving tiramisu basically every day since.Everything about this place is fantastic. The pizza was a great size (I had plenty to take home and enjoy later). You can choose between their red and white wine, and we tried both and they were excellent. Tirimasu was to die for. And the owner/employees (who are all Italian) were all so friendly and made it a point to greet everyone who walked through the door. They've created a wonderful little Italian atmosphere in downtown Phoenix and I can't wait to go back. I want to try one of their delicious-looking paninis if I can stop myself from ordering a pizza first!"], ["John S.", "This place is amazing! Reminds me of the north region of Italy! With true Italians working and making great pizza and pasta you truly are in for a great experience. Ciao."], ["Kristin K.", "Prosecco me.Top notch service. I was happy to see the door opened and to hear laughs spilling out onto the Roosevelt sidewalk.  The glowing soft light at 11:30 p.m. in DOWNTOWN phoenix was inviting to say the least after just getting off a shift a work.  I secured my bike and proceeded to see what fun I was about to be encompassed in.  The smell of pizza absolutely kissed each cheek twice as I lead myself to the bar. Greeted by the handsome Luca I was handed a menu while water immediately provided = immediate desert bonus points. The gals at the bar had been there for some time and looked fantastic. I was introduced within 2 minutes of ordering my flute of delicious bubbles, and away the night flew as the lot of us discussed travels afarr and told stories over each cheers. After two prosecco and plenty of cocktails tasting, I was ready to go.   Paid my tab and thanked these charming gentlemen for their hospitality and vowed to myself to order a whole pizza to myself upon my next visit. Next dinner date spot for sure. Although, It's tough to peel my eyes off the staff.  Yikes and meow. Vibe, menu, service, location and open times.  A+"], ["Mike L.", "Roberto, enough said.  Hilarious and the perfect host.  Wonderful environment, in general, including a nice interior setup and a great patio.  Pizza is to die for, heavy on the tomato sauce - and that's a good thing!  Nothing not to like about this little gem..."], ["Victoria K.", "Came here with a few friends for one of their birthdays. The prices are decent... was $12 for a pizza and sodas are $2. I tried a piece of bruchetta that the other people who arrived before me had ordered. It was interesting with fig jelly. When it came time to order they said we had to order a pizza off the menu; we couldn't create our own. However we can take stuff off of it. So we got one with just bacon, sausage, and cheese. There wasn't too much cheese on it, but the sauce was fantastic. The pizza wasn't very filling but was fairly good. This is definitely more of an authentic pizza place so don't go and expect to order a large pepperoni. They did give my friend a tiramisu and she said it was AMAZING! They also sang to her in Italian."], ["Noe' V.", "If you've ever been to Italy, or at least visited any length of time; you are certain to be transported to Sanremo when visiting this distinguished establishment. Roberto e Lucca are delightful, engaging, and warmly Italian!The Pizza is pretty darn good too! They are Italian, not Chicago Italian, not New York Italian, but Italian from Sanremo. Known for its beautiful coast and Song Festival. Hugs and warm appreciation always!If you like american soppy pizza...  This isn't for you"], ["Michael G.", "I live right around the corner from this place and it is amazing! The menu is simple and everything is very good. They also do specials daily and change it up. I love that they are open late and that the kitchen stays open. The owners are so genuine and friendly, they offer great service and it feels like you are in Italy when you are here.The pizza definitely competes with all other local pizza restaurants in Phoenix. We will definitely be back!"], ["Lorenia W.", "Goodness, the atmosphere here is GREAT! The owner is super energetic, friendly, hospitable, the music is lively with a mix of genres. The food - is Fresh and you can definitely taste it. It's light and you don't feel guilty from it being so heavy or eating an entire pizza to yourself lol which can easily be done. My 3 year old Ate Up the Margherita pizza and she is a picky eater so we are even more delighted. We also ordered the 301 and it's also delicious. The crust is thin and not too thick I would prefer a Little more crispy but still satisfying the way it is. The sauce is light and the cheese wasn't too much and simply tasted fresh.The tiramisu and creme brûlée - both single serving size but easily shareable. Not too sweet or heavy. I'm pretty sure we're making this our new weekly pizza place."], ["Will B.", "Wow!!! I had the Margherita pizza. Best I've ever had, hands down. Authentic Italian."], ["Amanda F.", "This place was delicious, warm and very inviting. I came in with my family (5 adults, 1 toddler) was greeted promptly and sat quickly. (Very surprising since it was a Saturday night) Food came out pretty quickly after we ordered and was perfecto! The best part of the night was the special pasta dish they brought out for my daughter right when we sat down. Made everyone super comfortable from the start."], ["Jennifer R.", "Wonderful, just wonderful!  The food is amazing, the owners are warm, funny and friendly. Feels so good to be there! . 5 stars!!!  I highly recommend this restaurant!"], ["Tricia B.", "Great Neapolitan pizza.  I had the 4 formaggio Bianca pizza sans Gorgonzola add pepperoni and it was to die for.  BF had the Testosterone and the tomato  sauce was incredibly light and flavorful. Cream of Broccoli, bacon, pecorino cheese bruschetta was delightful. Tiramisu was also delicious.  Owner was very engaged and attentive.  We will definitely be back to try more pizza varieties. They have got something good here for sure!"]], "Adela's Italian": [["Jennifer S.", "Working in Phoenix and found a hidden gem. If you like true Italian food this is the place. The portions are perfect not too much but a nice portion you would make yourself at home. You have to ask for the meatballsWhich I found out after I ordered the VealBut I will be back for those.The veal was great. Cooked perfectly in a lemon wine sauce with mushrooms and artichokes. Yumm is all can say .Family owned with lots of local traffic love it! I will be back during my next trip for those meatballs."], ["Scott V.", "My girlfriend and I went here last night at 6pm. Initially we were a little concerned, because the ambiance is very simple-- one large room with tables and a small bar. But in the end, the food was fresh, flavorful, and \"real\" Italian food. We will definitely be coming back regularly.Our waiter, who was the son of the cook (who i assume owns the restaurant) was great and had good recommendations.  We ordered a Caesar salad as our appetizer, the Penne All' Arrabbiata with sausage and Scampi Fra Diavolo with Tiramisu as our dessert. The salad we learned, used a house made Caesar dressing, was incredibly flavorful but the presentation could have been better. The entrees were great, tasting like the dinners I had growing up in an Italian household. Portions were of adequate size, not overwhelmingly large, and not small. The tiramisu was also authentic, light, and delicious.Overall, this is a hidden gem in Arcadia. Its not fancy, which makes it a nice casual choice for dinner, and the pricing is about average to a little high. Our bill, without alcohol, was just under $50. I will be back soon!"], ["Yvonne G.", "I don't know who Adela is but I think I love Adela.  I wish I could say that I hated this place so all of you would stay away and I would have no problems getting a table.  But I think those days are on the horizon anyway.  By 6PM, almost every table was taken with parties of 4 or more.  Yup.  People have discovered this place.  Freshly baked bread with a hint of garlic & butter =5 starsSalad offered for $1.99 (with dinner) was excellent.  Spring Mix, lovely light balsamic =5 starsEggplant Parmagiana with spaghetti= 5 stars (although I prefer thinner pasta such as Angel Hair---they may want to think about that)Eggplant, chicken combo with spaghetti =5 stars.Service provided by James was 10 stars.  Total attention, politeness, great manners.  Waters always filled and you can't beat the $5. house wine.  (I wish we had been given a little more -- I think they gave us 4 ounces)  but what do you want for $5?The verdict is that I will be back with bells on.  (that means, for sure! )"], ["Hailey B.", "What is better than a sweet, family owned business!? Not much in my book! Adela's is run by an adorable family who truly cares about the quality of their food and the happiness of their customers. I came here with my family for dinner and we were MORE than impressed! From the homemade bread to start, to the escargot for an appetizer, delicious entrees and limoncello to finish, it was a truly amazing experience! I ordered the Chicken Piccata (and added artichoke hearts, of course!) -- it was FABULOUS! I wanted to drink the sauce with a spoon. We will be back soon!"], ["Amy B.", "All I can say is YUMMO!! Happened across this place by chance while in town for business- and so glad I did. I will be back next time I'm in town.It is small but the deliciousness is big! I started off with the fresh bread- hot, fresh, and had just the right amount of garlic. I also had a house salad which was quite large, made with fresh crisp greens and the best homemade dressing I've tasted in a while. For my entrée I ordered the chicken fettuccine alfredo- unoriginal, I know, but oh soooo good! I planned to only eat half and save the rest for later but it was so tasty I couldn't stop stuffing my mouth."], ["Naoko F.", "We decided to try Adela's based on reviews and proximity from out hotel.  We started with Venice Margarita which was surprisingly excellent.  We ordered Caprese salad, Pollo Boscaiola and Veal Carciofini.  The food was really good and the service was fantastic.  We loved the wine we ordered that we ended up buying a bottle to take back home.  The restaurant is very cute and very reasonably priced."], ["Ladee R.", "First time at this restaurant. The neighbors have been giving it rave reviews so I decided to give it a try. Excellent meal of penne with sausage. I sat outside with the sound of the fountain and Italian music creating a delightful ambiance. Topped it all of with a tiramisu and espresso. The tastes were complimentary and perfect. Great service. Oh, and the meal starts with freshly made bread. Pedro the owner just walked outside and said hello. He's the chef also and is very proud of his business. Now I feel like family too!!"], ["Lisa C.", "New neighborhood favorite.   Classic Italian,  lovely family business.  The bread is soooo good, great classic caprese, shrimp a limone, great sangiovese.   Comfy, really reasonable price, really yummy food."], ["Regina C.", "I took my mom and her friend here last week for a lunch after someone at the Phoenix Zoo recommended it. The menu is not extensive with a billion choices which I like. They have enough to make everyone happy but not so much that it's impossible to make a choice. When they say everything is made fresh they are not lying. The sauces were amazing we started with calamari and the sauce was authentic and fresh. The calamari was good! We each had a different dish and everyone was really happy. Fresh flavors, good portions, and excellent service! The homemade cheesecake was amazing!!!"], ["Gretchen C.", "Excellent service and food. Pollo al Limone was everything I wanted it to be and more! Kiddo got the half order spaghetti & meatballs and it was everything I could do to keep him from licking the plate clean."], ["Paula D.", "Calamari with homemade marinara sauce Freshly baked garlic bread Shrimp Scampi Tiramisu"], ["Meghan L.", "Amazing! Great staff, good food, and good music! The pasta was absolutely delicious! It felt like we were in Little Italy. Definitely a place to visit!"], ["Amanda H.", "Adela's has become our guilty pleasure when we want a really indulgent meal! The staff is really nice and take-out is a great option if it's packed inside - just call ahead."], ["Stephanie K.", "I was a little hesitant at first because of the location, but what can I say!? It certainly didn't disappoint me. It was delicious! Per the recommendation of my very friendly attentive waiter, I ordered the Pollo Al Limone paired with the Brancott Sauvignon Blanc. It was perfect. The calamari and bread were also very tasty! This place is definitely worth trying out!"], ["Jeff M.", "Heard good things but they were closed when we showed up. Their web site said they were open. It's 2015 - businesses that don't update their information online are maddening and unprofessional. Thanks for the messed up dinner plans. :("], ["Kishia B.", "This was a cute little hole in the wall that was surprisingly very good!  After a long day of house hunting on a triple digit Saturday afternoon we stumbled in here fatigued, dehydrated and starving...We needed wine pronto :)  It was pretty deserted so we sat where ever we wanted.  Our waitress was friendly and explained the special soup of the day they had.  It sounded good, so my Husband ordered some.  He said it was pretty good, just piping hot, so he actually waited to the end of the meal to eat it.  For our entrees I ordered the lemon pepper shrimp linguine and he got the chicken parm, but with veggies instead of pasta.  We both thoroughly enjoyed our meals!!  I love shrimp and pasta and this had a great tanginess to it.  Would have been even better with pecorino romano cheese on top, but all they had was the freshly grated parm.  It was still good.  Don't let the sketchy strip mall atmosphere fool ya, this place makes food with authentic TLC.  We'll definitely return."], ["Sandra S.", "The wait staff was very attentive and good at describing and making recommendationsThe food was all homemade and delicious with a lot of selection and reasonable prices. We sat in the patio with a nice pond and beautiful Italian music playing and could smell all the great smells from the kitchen."], ["Jacqie S.", "Amazing service!  LOVED the shrimp and baby clams linguini.  The lasagna was also good.  Thank you for a lovely first time here.  We will definitely be back!"], ["Ames M.", "We went a few weeks ago before going out of town and enjoyed the food.   The ambiance is ok but the food is better.   I like to support local owners and we were glad that we went.Give them a try!"], ["G M.", "Small restaurant with family atmosphere. Food was great. The bread was fresh and warm - to die for! The Arrabiata sauce was awesome."]], "Babbo Italian Eatery": [["John C.", "We're kind of tight on our budget this month but yet we  wanted to go out and have a nice high quality meal Tuesday nights half price spaghetti dinner for two Plus wine appetizers came out to be less than $30 what a deal great place great service wonderful location had dinner outside on the patio area beautiful evening who could ask for more I would highly recommend this great place"], ["Yvonne G.", "Trying out Babbo for the very first time and was hoping that the trip was not a waste.  I did check Yelp reviews prior to going but you know how it is--sometimes they're right and sometimes they're wrong.  We were served sliced foccacia bread along with a dipping sauce made from an olive oil/balsamic vinegar mix.  I felt too much balsamic for the olive oil, but gave it a whirl.  But first I added black pepper, hot pepper flakes and a little salt.  Not bad, but I hate having to \"cook\" when I go out to dinner.  The foccacia and dipping sauce was quite nice.  But, but, but.... why is it that they never give you small plates so you can put your own bread on it and you don't drip olive oil from the table to your mouth??  So I asked Morgan, our server, if they have bread plates.  She says, \"Sure\" AND THEN she comes back with ONE plate (there are two of us ! Morgan).  Hubby's entree comes with a salad. He chose, \"MISTA\" or something like that.  Small salad but delicious.  Mixed greens with golden raisins, onion and PINE NUTS.... I love PINE NUTS.  It was topped with gorgonzola cheese and a sweet balsamic-type dressing.  Really good.  I stole some from hubby so I know.  Entrees arrive:  Spaghetii and meatballs for me and a \"chalkboard\" menu item which included chicken, marsala wine, mushrooms accompanied by veggies.  No pasta.  Pasta was $6 extra.  Really?On a $13 entree?  not even a teeny tiny bit of pasta on his plate!Now why,you ask, did I order spaghetti and meatballs.   BECAUSE IN AN ITALIAN RESTAURANT THIS DISH TELLS YOU EVERYTHING YOU NEED TO KNOW--that's why.   If you can't make a meatball you are DONE in an italian restaurant.  If you can't make a good SAUCE you are DONE as well.  So here it is:  the italian meatball was really, really, really good.  A little on the salty side but good enough for me because I like my food with a little saltiness.  That's just me.  The mix of spices in the meatball was great--sometimes restaurants put in too much oregano.  Not here.  It was a good mix of spices.  And now for the sauce... The question is whether this sauce could stand up to my own.  Yes, my dear readers, I make a killer sauce --the mother of all sauces; the \"capo di tutti capo\", the cat's meow; the slurpiest sauce around!  Let me put it to you this way, if I accidentally dropped my marinara sauce on my kitchen floor, hubby would say, \"skip the mop... I'll lap it up\".   No, really, it's that good.  With that, I am going to tell you that the sauce met my standards.  It was pretty good.  Better than mine.? No.  But remember this is a commercial establishment, they don't do the love thing that I do with the sauce. (Please do not let your imaginations wander).   So not to digress any further, the spaghetti and meatballs was a dish I would order again.  Hubby's dish, while he said it was good, was served on a smallish oval plate that made it look like a nothing portion.  PLUS, and this is important to the restaurant management:  The chicken along with the mushrooms looked like ALPO (the dog food) had been placed on the plate.  Now, keep in mind that he tasted it and liked it--the chicken, the mushrooms, the marsala wine and the sautéed veggies--He liked it all.  Do you think I was going to mention to him that it looked like an Alpo special??  Restaurants are supposed to make dishes ,at least, look a little pretty.  Even I do so at home.  There was no parsley garnish, nothing.  I make chicken fricassee at home and it doesn't look like mush.  Yes, mush.  That's the word I was looking for.  The mushrooms made it look like mush. Hubby said he would order it again so he liked it.  Management could you work on making this dish look more professional?  My spaghetti and meatballs was nice looking--a little parsley sprinkled atop of two beautiful Mount Vesuvious meatballs; beautiful red sauce.  Nice.  So after all is said and done I am giving this place 4 stars.  Morgan, you were a great server and very patient with us on ordering (it was our first time here) .  We forgive you for bringing just ONE bread plate.  Head on out to Babbo's.  You'll have a good meal for a good price in a family oriented setting."], ["Daniel S.", "I've been going to Babbo's since it opened, but I never thought to review it because it seemed like such a local staple. They provide the full range of Italian dishes here, all of it delicious and reasonably priced. In my opinion, they have some of the best salads of any restaurant. Service is always quick and friendly."], ["Deana H.", "Still waiting on their gift card hahaha this company is such a joke omg I wasn't going back I was just thinking I'd give it to Someone but still hasn't come went to the extent of asking for my address obviously. So funny"], ["Robert A.", "Cozy comfortable quaintly lite a nice ambiance. Greated and sat emediatly, clean plush setting. Food served hot and generous portions. Very tasty meat balls to die for. Great service checked on frequently asked if anything need or hows it going moderstly price.      Server. jesse. Awesome."], ["Ray A.", "Solid pasta with a good vibing ambiance. Had the chicken chipotle pasta and it was tasty and a bit spicy. Over all a good experience."], ["Jessica H.", "Nice non-chain Italian. Good service and a good food. The restaurant has a good vibe"], ["Robbie G.", "We decided to try this location because we were in the area and love the Babbo in the Cave Creek area so much. It was a smashing success. As with the other location, we got there early to take advantage of the happy hour and sat at the bar. Our bartender Andrea was phenomenal. She was very friendly and attentive.  Our food came out hot and fresh and was delicious (as always). If you're in the area, be sure to check them out."], ["Bettie S.", "Was hoping for more. It was noisy and the food was no better than fast food, but with a much higher price tag. The staff were very attentive and nice so all was not lost. The bread was nice. Overall, we like food too much to be happy with the quality of the pasta we were served."], ["Maurizio C.", "What a awesome experience and the food was fantastic. We will make sure to make this a stop each time we are in the Valley."], ["Dean G.", "So far service exceeds my expectations. server is very attentive, and all I ordered was my beer. Fresh rolls and frosted glass = Great start"], ["Paula L.", "I don't typically like chains, in fact I avoid them, but a co-worker raved about a Babbo salad. The roasted beet & brussel sprout salad with goat cheese is outstanding. My husband and I split the salad, next time we will each get our own. I ordered a pasta dish with a shrimp which was also good. They give you an ample amount of shrimp which is not the norm for most restaurants. The 5 stars is for the salad. Overall, I would give Babbo 3 stars."], ["Kat S.", "Walked in on a week night and seated immediately. Waiter was pleasant and the food came out pretty fast. Reasonable prices, great food, good portion sizes and nice staff. Babbo's is awesome!"], ["Sage J.", "I love this place, the food and bread is absolutely amazing.  They have a spaghetti and meatball special on Mondays and Tuesdays that bring in the cheap ass people ( who don't tip on the full value of the meal)  who otherwise would never eat there, so I try to stay away from there on those days.  The lunch specials are fantastic, great pizza specials with side salads (lunch)  biggest Calzones in our neck of the woods.  The staff is always friendly and attentive.  One of my favorite neighborhood restaurants."], ["Heidi B.", "This place is our regular spot. Love the food and love the people. Last night was the exception to the rule. We went and they were quite busy so we were willing to be flexible. We were never even asked about wanting water. The server forgot the bread. I had to ask her several times for various items that were ordered and forgotten. I'm glad this was not my first experience with this place because if it were, I'd be unlikely to come back."], ["Rich R.", "First time here and quite impressed with the family type service from Matt! The '3 cheese mac n cheese' was Matt's recommendation and he was spot on!!"], ["Michelle J.", "My boyfriend brought home his leftovers which was one of the sandwiches from Babbo. As soon as I had it, I had to go to the place where they served this deliciousness. The focaccia is probably the best bread I've ever had. It's fresh, warm, soft, perfectly seasoned. It was great with just olive oil and balsamic vinegar, and also on the chicken Caesar sandwich which I had without the buffalo sauce. Zucc chips are nice change of pace but unnecessary with the amount of food that you get.They were very, very busy on a Sunday for lunch but the staff was friendly and helpful."], ["Angela C.", "Came to Babbo today with my girlfriend for a lunch date.  I have never been, but have heard good things about the place.  They do offer lunch specials, but I craved something a little different than what they had on their lunch menu and ordered the 'Creamy Garlic Chicken Pasta'.  Instant hit!  The sauce was delicious, the penne pasta cooked perfectly and there was an abundance of chicken.  I thoroughly enjoyed my dish.  Babbo is approximately a 20 minute drive from where I live and it is worth it.  I look forward to trying their other dishes."], ["Jon L.", "Good food. The Italiano sandwich is my favorite. One of the few places my whole family can agree on. I almost forgot about the bread. It's amazing and served warm. Good service."], ["Alexus W.", "Great service, great food,lots of family quality time, and our server Kyle was amazing HIGHLY RECOMMENDED!!!"], ["Nelson B.", "Had dinner with my fiance and we had a really pleasant time,  the staff was amazing and really nice. The food was excellent,  we'll definitely go back again."], ["Hugh N.", "It's convenient and straight forward menu. A good place for a large party with variety of options. Reservation for party of six or larger (a plus). Good value for pocket spending. I've always had good experience here, just a little commercialized-feeling when I dined here. Staff are always nice and attentive. Breads is one of my favorites."], ["Charlie A.", "After dinner my boyfriend said, \"I feel like I walked in, I laid down, they shoveled amazing food in my mouth, then rolled me out the door.\" Yeah, amazing!! The meat sauce was a bit meaty for my tastes, but everything we ate was incredible, and the prices are just as amazing!! I especially enjoyed the bruschetta choices, as well as the apple calzone for dessert. They truly won me over by having authentic Limoncello, which is an uncommon find in the states. Yummy!! I'd recommend this place to everyone!!"], ["Jana Y.", "Great service.. We had the special spaghetti dinner for 5.99 on tues .. It was delicious and had two huge meatballs.. The bread before the dinner was so good and plentiful.. We really enjoyed dinner there.. They have so much to choose from and if the rest is as good as the spajetti this will be our italian food restaurant going forward."], ["Sandi S.", "We have dined here several times over the past few years. When they first opened, the food was served quickly and was high quality. Unfortunately, the last two times we have gone here for dinner we have been underwhelmed. The first round of bread was served cold, the second batch was burned. Two of the drinks ordered were pure flat or just carbonated water. My husband ordered a Margherita Pizza and it was served very over cooked. The server was very accommodating and put in an order for a freshly cooked pizza. Unfortunately, it took so long to get it that we wondered if the server had forgotten about our table. Very inconsistent overall."], ["Jennifer S.", "We really enjoyed Babbo!  We came on a Tuesday night, which is apparently $5.99 spaghetti and meatballs night, so it was super busy.  We took a seat with no wait on the patio and really enjoyed our experience.  The service was great - friendly, professional and efficient.The menu was huge...so many great selections to choose from.  The food was great!  I tried the chalkboard menu of grilled chicken topped with tomatoes and feta with grilled veggies on the side and a side salad to start.  I ate every last thing on my plate...it was that good!  I also enjoyed a raspberry vanilla Italian soda...love that they serve these and they do it right!  We will definitely be back!"], ["Emily W.", "I'm writing a review to remind myself to never come back. This is one of the higher rated places in the area so we decided to do a takeout. I ordered the portobello mushroom dish with a side of Caesar salad. 1) it can well be a personal preference but I'd like the gills off the mushroom. It just looked unappetizing. 2) the salad, which was supposed to be vegetarian, came with some special protein: a fly.  It was wet and looked mixed in with the salad so it probably came from the kitchen and somehow got trapped in the food prepping process. Not gonna go into what happened after I found the fly, but I think that's enough reason for me to never come back again."], ["Russell P.", "Service is consistently good.  Orders are right and food tastes good.  Small location so often a wait and TOGO orders there is no real place to hang out other then the bar (which is quite small) overall a good choice and love there spagetti specials for the kids"], ["George D.", "My family and I had diner here in mid July 2014.  It was surprisingly good!I had a jones for some spaghetti with meatballs and this place came to mind.  When we arrived I was shocked it had any seats available on a Friday at 5:30 PM.They had a good happy hour menu of appetizers and a good selection of beers.The service was friendly and prompt.The best part of our experience is the food came out quick and it tasted really good.The manager came to our table and asked how things tasted.  More importantly she seemed genuinely concerned.  I LOVE WHEN THAT HAPPENS!I'll be back!"], ["Sindi S.", "Recently discovered this local restaurant. When I find something that I really like I stick with it. Their special spaghetti with 2 large meatballs Mon and Tues is that something. You can't beat it. The first time I planned to try it I though it was just pretty mediocre but was quite surprised.  The sauce is cooked just right and not raw tasting like one other chain Italian restaurant.  I think the last name of that one is \"Garden\".  It is a good source of Vitamin C. The pasta is just cooked right and their recipe for their meatballs is one of the best. So when I am feeling like I need a little extra Vitamin C I head right to Babbo. Other times also when I start craving some good Italian food. This is real East Coast Italian cooking which is hard to find in AZ. Not many SW restaurants know how to cook Italian. Almost forgot the home made bread they serve there.  Crusty just like it is suppose to be. Try some of their Olive oil and balsamic mix for dipping."], ["Angela D.", "Everything we had was excellent!   Manacotti, Spaghetti Bolonese, Meatballs, Chipotle Mac & Cheese with spicy Italian Sausage... S cleaned the bowl!  If you know me, no one makes better sauce, in my mind, & it's not mine but excellent! Everything was so good! We will be back to try more.  Elizabeth was awesome too! ;o}"], ["Lauren J.", "I came here just after the weekday lunch rush on my lunch break. I am always looking for new places to try, especially Italian and this is not too far from work. I honestly thought it was a fast casual kind of place but it's a sit down restaurant. Service was slow; it took a long time for someone to come up to the host stand to seat me, yes I came alone. After being seated, it took almost 15 minutes for someone to take my drink order. I was told bread was on its way but I never got it. It looked really good though because every other table around me had bread. I went with the $9 lunch special, which is a salad and pasta (select menu). My Caesar salad was very good but was hoping to be offered fresh cracked pepper, which didn't happen. I waited about 15 minutes for my pasta after I finished the salad. Pasta portion was perfect for lunch. As a tip, if you want to add meat, you're looking at $4.25 for chicken, more for seafood. I just got the pasta without the meat. My waitress really wasn't attentive and had to ask another waitress for a drink refill. She did, however, get me a to-go drink. I don't know if she's new but she seemed very nervous and jittery. Overall, I really enjoyed my food just not the service. I would probably come again but order it to go or even try another location."], ["R M.", "Nice place in the NW valley.  Has a mom and pop feel to it.Food is better than the Garden of Olives or the Grilled Mac joint.Staff is friendly and the food has been consistent.One can order online and pick up later.Price is just north of the actual value.  All in a great place for a local meal."], ["Nikki C.", "I love babbo. I flund this place a few years ago abd told everyone about it. I went there today with a good friend. I got there earlier then i thought i would be the waitress came over right away offered me amazing bread abd got my drink order by that time my friend got there. We chatted abd ordered the shopping mix salad with extra feta, that they don't charge extra for, are in like 5 seconds cause it's amazing. Then e got the pistachio mozzarella, omg amazing. Or food was perfect, the service was amazing.. My friend and i stayed for a while and didn't feel pressured to leave and felt very welcomed and just lived the experience as usual!!"], ["Alex N.", "Got pasta take out from Babbo with my bf... The portions were pretty small.  Pasta with garlic cream sauce apparently means pasta with some white flavorless water at the bottom of the tin. And the amaaaazing complimentary bread that everyone was raving about is evidently only for dining in customers.  Won't be ordering from here anymore."], ["Kyleen S.", "Come here every time we come to Phoenix for spring training. Love the food and the service is great they are very attentive and the price is perfect for a family of four. They always accommodate my kids well which is always a plus. Only thing I wish was that they had crayons or drawing options for the kids, they do get frustrated without that. Had the 16in pizza and their crust is amazing. And their steak and pesto pasta plate was also very well executed. Stake cooked perfectly and my favorite part the Parmesan shavings....yum!"], ["Colleen L.", "Very busy, Hostess was very helpful in opening the door for me and my grandmother that was in a wheelchair!  Our waiter was fast and efficient and our food was outstanding.  Large proportions and can split with one or even two people!  Love the free garlic bread served when you are seated! Parking lot is tricky, only one handicap spot which someone was already in so tough to unload and load someone that is in a wheelchair!  Great experience!!"], ["Eric L.", "It's a nice place for the prices, clean and good atmosphere.  The staff is friendly and the service is good overall.  The bread and olive oil is always a treat to get and it's hot and very good.I went there twice to get the spaghetti special and that's the only thing I don't recommend since I'm not a big fan of red sauce.  Normally it's not a problem but their dish is swimming in sauce and there was also water at the bottom of the bowl from the pasta.  Turned into a bit of a wet red sauce mess."], ["Ashley W.", "BEST ITALIAN RESTAURANT IN ARIZONA! I don't think I can ever move out of state, I would miss this place too much! Their free dinner bread is the best bread around! I don't know what they do to it, but I eat at least 3 loaves each time I go! Their adult mac and cheese is like nothing I have ever tasted. Its spicy  but ohhh so delicious. Their steak and blue salad is outstanding..I have had so many things on the menu and am never disappointed. I LOVE THIS PLACE! Oh and the prices are amazing for the quality you get!  $12 a plate on average with free unlimited delicious bread, ummmm yes please!"], ["Aimee H.", "Love the Monday night special of $5.99 all you can eat Spaghetti and Meat balls! Very tasty! We were able to get a seat pretty quickly. Drinks came fast. Food was good!I think they cater too. if you are looking for some simple Italian past and a glass of wine, Babbo is great!"], ["Ryan P.", "Babbo's food is quite good and the menu is big enough to come back over and over without a repeat (if you choose that strategy).  Take-out here is speedy and the food travels well to be served at home which is always a plus, granted we're only 4 minutes away.  My only gripe is the dining room comes across a bit too \"cafeteria\" which could be solved with very small tweaks!  Overall, a staple in our household."], ["Jay B.", "BEST ITALIAN FOOD AROUND. Very decent prices for good quality meals. I recommend to all my co-workers and they love it as well.I recommend the 3 cheese Mac N Cheese; a little spicy, but delicious!If you're looking to sit at the bar for an alcohol beverage, look else where. It's a more family diner environment and they only have about 6-8 bar seats."], ["Brittnee R.", "Babbo always hits the spot when you're looking for good wine, food, and service (in that order, wine over errythang). Dishes are flavorful, served hot, and well priced."], ["Kidd K.", "Our waitress was very inattentive and very slow. She never checked on us to ask how my food was and I had to flag her down every time  I needed something (I felt like I was bothering her). She literally just handed me my food and didn't come back until we ordered dessert. Desert took 25 minutes before it came out. I do want to mention that she checked on the people behind us multiple times. My biggest issue was being sat at the smallest table and the waitress never came to pick up our dishes, so basically I sat at a table full of dirty dishes, trying to eat my entree! It was just an overall unprofessional act on Babbo's end. I will not be going here again and definitely will not recommend Diana to anyone. The food was mediocre at best."], ["Elyse D.", "I am an avid Babbo's enthusiast. I have been frequenting for 10 years at the original location and come here about once a month. They have a wonderful happy hour.Everything I've ordered is delicious. The garlic hummus is divine; pizza, salads, pasta and sandwiches all good.  All food travels well to-go. I would highly recommend!Join their email list! Emailed specials are seldom but  are great! :)"], ["Tonya M.", "We had purchased a groupon a while back and realized it was about to expire so we'd come in for dinner. We weren't expecting much since we're always seeing billboards for $5.99 pasta on Monday's and Tuesday's. How great can a place be if they sell pasta for that price? Well, it was amazing!!We both ordered off the chalkboard menu, my bf got the chicken and I had the portabella mushroom. Between my margaritta, the bread, our salads and a decent size portion of dinner, I had left overs. He doesn't normally have a hard time deciding what to get but he kept flipping back and forth since there are soooo many good options. I'm hoping they run another groupon soon, we're coming back regardless but it would be nice to save a few dollars =)"], ["Kallie A.", "I really really wanted to like this place . I went to a wedding show with a friend because she is getting married and they were  there to show off the catering. When we tried samples the pasta was delicious! It was so good that my friend and I decided to eat here for lunch one day. When we went in the place it was half empty. We were surprised because of the reviews and it was a Saturday that the place would be empty. We got sat, we ordered our drinks, and looked at the menu. Our waiter was very nice and brought our drinks out quickly. We ordered our food once we got our drinks. I got the garlic chicken pasta and my friend got a garlic zucchini pasta. When our waiter brought out the bread with the dipping oil..we were disappointed because the the bread was still doughy and it was slimy and chewy. When we got our pasta we were disappointed as well the pasta was pretty much like soup. At one point my friend Said the sauce would make a better mushroom soup. I thought the same. It was very soupy. You would think it would be creamy?  I guess we came on a bad day or something because the reviews are great but sadly I can't say we have a great experience. I would have to say maybe we will try again but this being our first time was very disappointing."], ["Michael F.", "I sometimes eat here with my friends after hiking Dreamy Draw Hiking Trail.Yeah we ruin the burned calories by stuffing our faces with pastas and pizzas at Babbo afterwards.Is it good? Definitely!As you sit you are swarmed with servers laying down complimentary breads with olive oil, and balsamic dip.However, I cannot eat bread and pastas all the time, or I'll gain weight.I have to watch my svelte figure now that I'm getting older.They do have an interesting menu and the ones that I've had were extremely flavorful. I've had the Garlic Cheese Crostini, Bruschetta Romana, Roasted Asparagus, Mandarin Spinach, Mushroom Asparagus, and Pasta Rustico. The place is also very clean,  the ambiance is fabulous, and service is always great.Highly recommended with a great lunch menu too! :-)"], ["Mario C.", "This is really one of my favorite places to go now.Lots of calories, but very good meal and for a very low price. On Monday and Tuesday they have the Spaghetti and Meatball Special for just $5.99.Best deal in town, I think.Bread is great, and I also really like the salad. They make it the Italian way. Really good! HeheeePizza here is really good as well. Nice crust with great cheese.Every time we come here,I always leave happy. {Parking is a bit tight) so be careful out there. Nice clean restrooms."], ["Daniel G.", "Sauce. Love their tomato sauce! Mondays and Tuesday 5.99 specials are the best.  Everything I have tried there is great. Someone recommended this place to me and man I'm glad they did. Love it. The only thing they could improve would be the ambience."], ["Butters U.", "I came in to your 16th and Glendale location on May 16th and was very displeased. We ordered over the phone, I got the chicken limone and my boyfriend got the mac n cheese. I asked for the asparagus and extra chicken. Had I known that adding those two things would raise the price of my pasta by $7.00 i wouldn't have asked!!! So my two pastas ended up costing $30! Knowone told us that it would cost that much. I work in a local pizza/pasta restaurant with up there prices but 17$ for a pasta,  really? So I called to make sure it was correct and the woman on the phone\"natalie\", apparently a manager, told me that is how much it always costs.  That when you ask for extra chicken, you double the amount.  Ok, so that's fine. Now I know. I would have liked to have been told that when I was ordering, but it's too late now. But then I went on to tell Natalie that I asked for extra olive oil and balsamic vinegar.  She got defensive and told me that I needed to ask the person at the counter for It when I got there! Why didn't the person who took my order tell me that!? It shouldn't be my responsibility to check my entire order at the place I am ordering food from! It is their job! They should have told me to ask when I got there! I got home and had one tiny container for two pieces of bread. What I am most disappointed about though is the rudeness Natalie portrayed. Her attitude to not try to help an unsatisfied customer was what just made me go off the wall. She argued with me about the fact that I should have asked for the olive oil a second time when I got there. I work at a restaurant where we check every single order in front of the guest to make sure everything is correct and the guest is satisfied. I guess you don't have the same policies but I just didn't expect the attitude from a manager in your restaurant."], ["G W.", "yup--- this place rocksMonday and Tuesday night special cant be beat in this area.staff and service is great, on line order is easy and food is great!"], ["Carlos G.", "Went with my wife and had a very good experience.. Ivonne was very friendly and helped us on what to get since it was our first time. The food was delicious definitely going back again! The only thing that bothered me was that there wasn't much room to move."], ["Kazi H.", "the first time i went to babbos was the one on 67th and the 101, and my experience was ok, not the best. But tonight, we went to the one on 16th street and it was absolutely OUTSTANDING!!! There were sooooo many choices of pasta that it became difficult to choose! You're gonna want to try them ALL. Anyway, the pastas we got were incredible, but im sure they are all delicious! and that bread and oil and vinegar they bring out is AMAZING. that was my favorite. Overall, food was wonderful.Service, you ask. THE BEST! our waitress, Jessica was amazing. She was a delight! She was on point, checking up on us frequently, keeping up with refills, and even getting personal with us. She is SO sweet. We LOVED her. She definitely made our experience better. So if the manager is reading this, GIVE HER A RAISE!!! ;) we will defintely be requesting her. Want italian and great service? This location babbos is your spot!"], ["Susan M.", "Normally wouldn't give that many stars to a chain type place but I am blown away by their customer service and attention to detail.  I emailed to ask about their gluten free cooking practices and they answered back quickly and with great information!  I feel safe eating here based on what I've been told and have seen.  As of this writing, all of their sauces are gluten free.  Their chicken is marinated in a soy based sauce that may or may NOT be gf so be forwarned!  They cook their gf pasta in it's own water as opposed to plopping it into used regular pasta water (which means it's no longer gf and is a way some restaurants which serve gf pasta do it, so be careful and ASK!)The pasta and the sauce was fresh and flavorful.  The bread smelled divine and I was totally bummed that I couldn't have any!  The service was good and our food came out fast!  I will be tripping around this menu for sure!  Awesomesauce!"], ["Jessica B.", "I love this place! Great prices and even better food. I try something different every time and am never disappointed."], ["Judy L.", "M and I stopped in for lunch today.  The set up reminded me of a CPK.  The server was awesome...  He was there checking and making sure everything is good.  I like!I order the creamy garlic chicken pasta (Roasted chicken, creamy garlic sauce, mushrooms, sun dried tomatoes served on penne).  Very good.  And the portion is fairly large.  I should NOT have tried to eat all of it.  Now, I can bearly type or think (FOOD COMA).  It is Friday and what the hey, I ordered a Dreamsicle (A dreamy orange cream soda mixed with sprite, mandarin-orange &vanilla syrups, and a splash of cream.).  It was good....They also serve a complentary bread (warm, sliced, garlic, & red onions).  I do not know if we were hungry or it was GOOD, we had a second plate.  LOL!  We dipped the bread into the olive oil and balsamic vinegar mix.  YUM!"], ["Kate T.", "Love Babbo so much, that they catered our wedding! Their salads are amazing. I am obsessed with the Spicy Green Bean Salad and the Roasted Brussel Sprouts and Beet salad. Not to mention THE BREAD!! Love love love Babbo!"], ["Mo M.", "Salads are good here. However ordered a a stuffed Portobello minus the meat and got lots of meat."], ["Matthew D.", "Tasty Italian.  Yes, there's definitely the feel of the chain Italian place that it is, but if you're in the neighborhood and you're in the mood for pasta, this place will satisfy your craving for noodles and sauce.I had the Pasta Bolognese, and my wife had the Chicken Lemone.  Delicious all around.  Top that off with bread (perfect for dipping in balsamic vinegar or leftover sauce), and you have a satisfying meal.Service was friendly too and the ambiance was pleasant.  I'm always in the mood for good priced pasta, and Babbo gave me what I was looking for.  If you've seen their billboards and was wondering what they were like, I can vouch for their good taste on multiple levels."]], "La Piazza PHX": [["Mark H.", "Many reviewers here on Yelp seem to dole out 5-star reviews like candy on Halloween. However, I feel an establishment needs to really earn 5 stars, and rarely bestow such high ratings. To the owners of La Piazza Locale - you earned it!Wow. Just freakin' WOW! I left your restaurant completely stuffed, and raving about your pie to whoever would listen to me for days! Thank God I don't live in AZ, or I'd be 450 pound regular in a matter of weeks.I wish I could say I'll be back soon.Order the pizza diavolo. You're welcome."], ["Ali H.", "This place is amazing! Everything I have ordered from here is fresh and delicious.  I vote it better than bianco!"], ["Chris W.", "Fanastic food, prompt service, they are always on point. I have frequented the original location in Glendale and thought I would give the Phoenix location a try while working late tonight. I called my order in about an hour before I planned to pick it up and arrived to find it had not yet been started. I found this to be a little concerning, however, I was assured it wouldn't take more than three minutes to get my pizza and they were not lying. The pizza is fantastic as ever and they are quick to resolve any issues, but if you are expecting to just quickly pick up and walk out durng a lunch rush you might want to be very clear to have the order ready and waiting."], ["Ian F.", "Stellar pasta and salads. Good pizza. Service can be slow at times but the food is worth the wait."], ["Serge B.", "Best pizza in Phoenix hands down!!!!  True European style pizza - so nice of a change from the usual greasy pizza...  Will definitely be back! In addition to the Italian Stallion and Salciccia E Friarielle, we had the misto tavola with fresh baked focaccia bread - to die for!!!!Alisha was great too!"], ["Jennifer S.", "Great new addition to downtown Phoenix, but not quite as good as Bianco or Pomo!  I think downtown Phoenix is becoming a hotbed for amazing, authentic pizza and this addition helps solidify that!Good location, friendly staff, quick service and tasty pizza.  The margherita pizza was good...sweet but still savory!"], ["Marissa C.", "Yes! Italian hubby approved! Nice little gem, great for families, fresh ingredients and very friendly staff. The portions are good and they can customize the pizza's to meet your dietary needs. Wish I would have taken a picture before we inhaled the appetizers and food! Need to return!"], ["Erik N.", "Best pizza I have ever had. This place is perfect. Try the Rubicon IPA it's delicious. I had a veggie pizza everything was perfect."], ["Dustin F.", "Stopped in for a quick lunch in between class at law school right around the corner. Service was quick and informative. We got the Caprese appetizer...it was ok and I've had better. Needs a nice aged balsamic to bump it up. I got the Italian Stallion...AWESOME! Excellent dough and ingredients, ate the whole thing by myself in about 10 minutes. My wife got the pesto pasta dish, added artichoke hearts. Great pesto, but they couldn't add grilled chicken. Would have made it my wife's new go to italian dish for lunch downtown. Ordered a Blue Moon, but waiter came back saying they were out. Suggested a Peroni, my first time trying. Tastes like a Bud Light"], ["Jeremy P.", "Having opened just a few weeks ago, La Piazza Locale brings the 2nd VPN-certified Neapolitan pizza to downtown Phoenix.  The first thing I thought when I found this place was, \"What, don't we have enough excellent pies downtown?\"But we had to try it anyways.My friend went with Rocco, and I went with the special of the day Don Matteo (smoked butternut squash puree as the sauce, with speck and mozarella).My first observation was that the crust had the soupiness that a real Napoletana pizza should have.  The crust was perfect.  This is knife-and-fork pizza, and if you think their crust is too soggy, you're wrong.The smoked butternut was phenomenal.  I'm not sure that's a real authentic ingredient for Neapolitan pizza, but it was probably one of the top three pies I have ever eaten.My friend's Rocco was pretty good, too, but the Don Matteo was definitely at a whole different level.My only real complaint about this place was that the music was a little too loud and too trendy.  When dining, I don't like it when the music is too noticeable.  I usually prefer restaurants not to be too trendy, but everything else about the restaurant was great, so I can let this pass.Locale is now on my short list of best pies in the Valley.  It's not as good as Bianco, but it's top tier."], ["Karen V.", "My husband and I returned this evening and had the Burratta e Speck appetizer, Margherita DOC pizza and Cannoli.  We love this place, which is VPN certified so you know you are getting true Napoletan style pizza.  Honestly, I can't  seem to get excited about anything other than this style of pizza ever again, so simple and flavorful that my eyes roll back into my head every time I eat there.  I can't wait to try their pastas.  The Cannoli was amazing.  The texture was beautiful and the serving was probably twice as large as what I expected.  I had it was a double shot of espresso; the perfect thing.The only thing that we would have changed was the music, which was sort of rap influenced, American Idol style mainstream stuff that I'd expect to hear in a gym, or some run of the mill college pizza pub. But this is not college pizza pub pizza but pizza designed for a more sophisticated palette so homogenized pop/rap just doesn't suit.  I'm not saying they need to play Mario Lanza recordings or anything but something that connects a little more with the food and Italian culture would be sort of unique and special.  We've been in a couple of times this summer and the music just doesn't make any sense.  Maybe if they streamed in an Italian radio station, with contemporary Italian artists it would be an even more stimulating sensory experience.  Of course, if they wanted to have Puccini and Verdi playing some of the time, I'd just bring my cribbage board and never leave.We arrived on our bicycles by the way and it was nice to find bike parking right out front, by the way."], ["Melissa H.", "I prefer this place for dinner to lunch.  At lunch it seems hectic and I want to be able to savor my pie.  At lunch too I find the pastas saltier than they are in the evening, and can't have a glass of wine to enjoy.  The pizza's have a great amount of char and for those who like a more tarte tomato sauce this place is for you.  They take their pizza seriously and have the awards to back it up.  The best starter and can't miss is the burrata.  Creamy, served with charred bread it makes for a lovely carb laden starter.  The pizza's come out super fast and I can't say enough how this is a great place to grab a bite before a show downtown.  The portions are not huge which is good, then you don't feel guilty about leaving the leftovers in your car while you catch the concert.  But I never feel like I'm leaving hungry.  Pretty solid overall."], ["Debbie S.", "Truly excellent pizza - The Italian Stallion! What was better than the pizza? The service was second to none!!"], ["Joseph G.", "After reading about this place in The Wall Street Journal I had to stop by. Based on \"Authentic Napoletana\" pizza, it was a target on my list. With that being said, I have never been to Italy.      But the food was really amazing for the price. I Spent 35 bucks and had an 3 course meal of high quality tasty food.        However, I am a stickler for service. Even though I did not see anyone wait very long to get seated (self included), It took 5 minutes to get acknowledged for a drink - and I sat at the bar. Followed by me flagging servers down to take my order plus asking the owners wife for a utensils and my napkin.       Bless the owner and his wife. He is busting his butt cooking for quality and trying to keeps things moving and his wife was very nice and tried to do the same.       Rare is it that I would consider going somewhere again with bad service. But - I under stood the issue, not the food, location, price, quality of restaurant - but staff. I will come again. lol."], ["Lees V.", "I did a take out lunch order for my first visit. I will certainly be back to enjoy the decor and atmosphere.  I had the tomato e mozzerella Panino- lunch special. It was delicious and a great lunch (as I had left overs) for $7.  If you love brick oven - wood fired pizza, go to this place."], ["S L.", "Good food, but they're way too skimpy on the toppings. I had two pieces of basil on my margarita pizza. Two. I'd go back for a cheese pizza but not much more."], ["Cynthia Q.", "Very nice place, and the Puttanesca was full of flavor! The pizza was also delicious. It can be a good place for a first date :)"], ["Amanda D.", "We don't get it!!!Did not eat the pizza, maybe that was our mistake.Underwhelmed and overcharged"], ["Ivan B.", "The up beat casual atmosphere was overshadowed only by one of the most tasteful italian sausage pizza on the perfectly baked thin crust."], ["Vane M.", "After reading the reviews I will NOT give this place a try! HAIR in food! That's the worst. It ruins the whole experience."]]}