{"Pita Bistro": [["Tommy N.", "This place is great.Kind of like a middle eastern chipotle. Bowls and the fresh juices are my go-to's.My ONLY complaint is that they recently changed the size of the bowl(smaller) and you're still paying the same price..And trust me.. they are NOT the same size lol."], ["Josh M.", "Fresh. Delicious. The grilled chicken is on point! Lentils cooked perfectly and the tabouli is good!"], ["Leticia V.", "Anazing steak gyro wow..foods fresh environment clean and chill..def love it and recommend it!"], ["Yvette Q.", "This is genius!  Like Chipotle but Greek food ....I created my own hummus bowl.  Big portions and tons of fresh options"], ["Laura B.", "Fast, tasty, healthy, real food. Wish there were more places like this. I will be back!"], ["Suz K.", "Completely mediocre.  The original hummus has no flavor, what they call tzaiziki is fatty and bland.  With so many better options within a 10 minute drive, I am amazed they're still open.  First timer, last timer."], ["Etana H.", "The Chipotle of Middle Eastern food, if you like hummus and garlic this is the place for you - YUM YUM - the PB Dip is delicious. Great atmosphere and delicious fresh RAW juices."], ["christine g.", "Love this place. So many things to choose from. Big portions for the money. I am frequent customer. Everything is fresh and delicious."], ["Jessica K.", "Wow. I don't even know where to begin. I'll start with my warm and welcoming introduction to the restaurant - smiling faces and hellos from each and every staff member. The feel is casual yet exclusive. - Modern yet warm. The best part is - YOU decide every detail of what goes into your food. I ordered a bowl (generous portion) and specified how I wanted it - the options are really endless and taste fresh. Only negative comment was their light fixtures by the bar (yeah, they have a full service alcohol bar opening soon) were blocking the TVs somewhat. Anyway, I will be back soon! New favorite joint!"], ["Jaime R.", "Love this new lunch spot! My go-to is a hummus bowl with chicken. It's great to have healthy options close  to the office. I've never had any issues with the quality of food, although (like someone else mentioned) it seems like they're being a little more stingy with portion sizes, particularly the hummus. In spite of that, I would give 5 stars if I didn't think my order was a giant inconvenience to many of the staff. I know the lunch rush can be stressful but I just get the feeling some of the employees could use a little more patience. Great overall!"], ["Lisa W.", "I took my 3 kids to dinner here and we each got different things and everyone really enjoyed their food. I got the kabob with a build your own bowl. The food was fresh and very good. We tried the jalapeño hummus and sriracha hummus. It was fresh and very flavorful. We also tried the original and it was fair, not enough flavor. My son enjoyed his falafel and daughters both enjoyed their steak wrap and steak build your own bowl. I wish I had tried the PB sauce. My kids really liked it. The baklava was fair. My kids liked it but I didn't think it tasted fresh."], ["Lauryn M.", "Absolutely amazing! Being from Detroit I have yet to find a place in AZ that truly has Mediterranean cuisine that I am accustom to! Many have tried and failed but pita Bistro has come and conquered! In the 3 weeks it's been open I've been here twice and tried something different, I was impressed each time! As a vegetarian I have options and combinations for days, and I plan on trying them all! Amazing! I am a Pita Bistro Fan! See you guys next week!"], ["Brandy P.", "Saw this place from the outside on my way to a training for work and knew immediately I would have to try the food and raw juice bar!! Went with the girls for lunch that day and we absolutely fell in love!! The food was amazingly delicious and we couldn't stop raving about every bite we took! On top of that we were able to customize a raw juice which I loved the idea of and the taste even more! Let's just say we were hooked from the beginning and went back for lunch everyday and for juices on breaks from the training.It wasn't only the food and juice that brought us back..we were drawn instantly to the charisma of Nas and Sam and the attention they had to the atmosphere and attention to detail for their customers! I love the feeling of the place and you can tell that they live to a philosophy and not only to making money! I will be visiting as often as possible, even after the end of my training..they have made me a loyal customer"], ["Angie B.", "The long line was totally worth the wait. The service was great, the place was brightly lit and clean and the food is good!  The only thing I would change or request would be a half sizable. This is too much food for lunch for me. Other than that I have zero complaints!"], ["Dsai L.", "Best lunch place ever!  The food is fresh, service is fast.  Reasonably priced, my favorite lunch spot.  I wish they deliver!  It's too hot in the summer to drive out and pick up lunch especially the parking lot is always busy."], ["Andrew F.", "This is about a five minute walk from my office, so I have had a few opportunities to go here. Both times I have ordered the Gyro. I like these and they are a safe bet when having Mediterranean style food. Their Gyro's are pretty awesome! Lots of flavor and stuffed. You also get to build your own, so adding rice and other items such as cucumber and beans. Great casual atmosphere with an outside patio. Very clean and pretty fast service. It does get busy at lunch time, so there can be a ten minute wait or longer to place your order."], ["Wendy L.", "I love this place. Think Chipolte but Mediterranean. Very healthy, Enormous portions (Usually I make a Hummus bowl last for 2 meals), fresh, appealing presentation, charming staff. At abt $9 what a deal!!!I wish there were more of these in PHX, now that I don't work near their airport/Cotton Center location I miss it terribly"], ["Pat M.", "Clean,. Very friendly staff and professional service, willing to please the customer, Food was fresh and delicious. Went with 6 of my friends. We all loved it. Highly recommended!"], ["Shelby M.", "So Fresh and Delicious! I was not expecting much and was pleasantly surprised by the extensive menu and fresh food. I had a hummus bowl with falafel and it was fantastic. My friend had a great big Mediterranean burrito-thing that looked great if you're not thinking about calories. Place was packed but they move the line along swiftly. I wish there were more of these as I probably won't find myself in the neighborhood again soon."], ["Jake W.", "By far the best Mediterranean food in the area. Serving size is enough for two meals. Price is great. Fast food pricing for healthy delicious food. Meat is fresh and cooked daily. Hummus is incredible. Chicken is spiced to perfection. Gyro is the freshest in town. The serving set up is identical to chipotle. Atmosphere is very comfortable and clean. There will be a full service bar very soon. If you need a quick meal and don't want fattening fried food this is the place for you. Most fast food pita joints are dingy and smell. This place is most certainly deserving of a five star review."]], "Different Pointe of View": [["Robert F.", "Priir to visiting Different Point of View... i made the mistake of reading too many negative reviews/comments.  This place was an exceptional dining experience.First, the view is amazing.  You need a shuttle to get to the top of the mountain from the hotel property.  There is a bar downstaits from the dining area where you can have a drink inside or out. Outside has an amazing patio (1/5th of iy can be seen in my picture) which overlooks pheonix.While having drinks, i noticed they were underpoured SEVERELY and cost $14 each.  After several.. I was begining to get annoyed by the size and made a commeent to the waiter.  He apologized and gave me an additonal Macallan on the rocks on him.  So although yhe drinks were severely underpoured, an attempt was made to please me.The food ordered to the table:CHOPPED SALADLOBSTER BISQUESAUSAGE RAVIOLIDUCK SPECIALSHORT RIB (BONELESS)VANILLA BEAN ICE CREAMThe lobster bisque was very very tasty and the other person in my party enjoyed his salad.  We split the ravioli appetizer which consists of 3 raviolis but we each received 2.  They had broccoli rabe sausage and a nice filling.I forgot to mention the two types of bread for the table came with a selection of 3 amazing spreads:: blood orange butter, pesto, goat cheese reduction.The duck was a great taste but I ordered the short rib and only \"tried\" th e duck.  The short rib was a tiny bit overcooked but i am mentioning it for the sake of being accurate... it wasnt bad and didnt take away from how good it was.  The polenta and veg inckuded underneth the shortrib also had a great taste.It's important to note, 4 scotches (one complimentry), 2 bourbons and an additional 2 orders of ice cream were added to the bill before seeing $187.50.  To dome this may dound a bit much, but I dont believe those people travel to New York.  Furthermore, I understand price should be relative to the geo location and I still dont believe it was OVERLY excessive.  This place is great for those who want a mountaintop dining and drinking experience with high quality food.My trip consisted of visits to Tomasos, The Mission, & Different Pointe of View.  Different Pointe of View would come in second to Tomasos.. but just because I am italian and love pasta :-)   If I am to be in PHX again, it will be a must gor me to visit Different Pointe of View again.... wiyhe the misses most likely."], ["Manuel C.", "I came with my wife for an anniversary dinner. The service was truly exceptional!!!Recommendations were on point and balanced two slightly different palates. The food itself was good, in pairings and in the overall taste though as some other reviewers noted... not the best meal I've ever had.Overall, great experience and we'll definitely come again."], ["Barry S.", "Average food, great location, and view, service was just ok. We had reservations for 6 and didn't eat until 7 with no one in the restaurant. The experience was just average overall. One thing I did not like was when we checked out the server added 15% gratuity to our bill. We are usually 20% tippers even if the service is average so not sure why it was done for a party of 2. Would not go back."], ["Katie F.", "::Disclaimer #1:: This review is based on our particular service ONLY! ::Disclaimer #2:: If you are going for restaurant week fall 2015, their online menu is not the same as the in house menu! My husband and I went to DPOV last night to kick off restaurant week. We have both been before and knew the food would be great; and that it was. Our service however, was not. We had an older gentleman with white hair as our server who nearly ruined the experience for us. As I stated before the online menu for restaurant week is not accurate...I had chosen DPOV because it claimed to be serving duck confit (best thing I've ever ate). This was not the case and when my husband went out on a limb just to make sure we couldn't order it our server said \"not if you want restaurant week!\" okaaaay....understandable but maybe approach it diferently (ie. 'unfortuantely it's not one of the featured items OR I could do that for an extra sur-charge'). We ordered our starters and entrees, never did he ask if we enjoyed our starters but when he did ask about the main course he walked by saying \"enjoying?\" while not waiting for a resonse. Finally, once the dessert menu was delivered and we had decided he stood at our table pen in hand for about 10 seconds and said \"yes?\" At this point in time we were done...both of shook our heads and ordered wanting to get away from this guy as soon as possible. Like I said - food is, and always has been then last 3 times we've been, great! I may even go back for a glass of wine and the duck confit raviolis (because duck confit is THAT good) but I will be sure to request not to sit in this gentlemens section. All of this being said - our buss boy (a younger man, with longer, ear-length hair was great: polite, charming...I wish he could have been our server and all our tip could have gone to him."], ["Tyler G.", "Simply amazing. Breathtaking views. Excellent service. The food was incredible and best of all the now fiancé said yes. Be prepared for the price but I guarantee you will not be disappointed. They even gave us free champaign and dessert. Will definitely be back for our 1 year anniversary. Four stars or four diamonds either way this place is amazing."], ["Mike B.", "Three of us had dinner at the Different Pointe of View on the outdoor terrace.  The food was absolutely amazing and the service was impeccable.  We had Ian as our server and received such fantastic service that I would definitely ask for him by name.  He was very knowledgeable about the menu, the wine list, and even the view and surrounding area.  He was one of the best servers we have ever had.The risotto is absolutely amazing!"], ["Sue R.", "Went Saturday night for restaurant week menu.  Food was good and view great.  Unfortunately we had a waiter  that was so hyper he basically ruined the evening.  From the minute we sat down he was in our faces talking a mile a minute and rather condescending. Thanks to the busboy for filling water glasses and bringing bread-he was professional and polite. When we left I mentioned to the hostess the odd behavior of the waiter and she knew immediately who I was talking about.  They really need to reevaluate their personnel.  We dropped over $300 and expect a lot better experience."], ["Darcy D.", "Enjoyed the wine pairing last night with executive chef Anthony. The meal and service was incredible. We will definitely be back he has now made us customers for life. Thanks again for a perfect evening."], ["Danny H.", "Been here twice. The food is good. The risotto with farm poached egg is to DIE for. Ambience is nice, especially at sunset with that AMAZING view!Both times I've been the restaurant has been more than half empty, which makes you wonder if you're missing something that others have figured out..."], ["JO Z.", "5 stars - HOWEVER.... 5 stars for food, service, view and pork. I think though that $12 for a few leaves of a salad was very funny. It was good but this is exactly how it tastes at home (ok I make good salad) I can imagine this to be a great place for someone who wants to rest after a stressful day and watch the city lights from a place tucked away on a mountain - and doesn't mind spending minimum $65 per person.  Maybe it is a good idea to check if the pork, or any meat is grass fed - which would justify the price, or are the prices justified by elevation of the restaurant - which, at least for me, is not worth it."], ["Michael T.", "This place has simply gorgeous views of Phoenix. Two levels of this restaurant have extensive glass panoramas that take advantage of the height of the hill on which the restaurant sits.That being said, the high prices of this restaurant make you think you're getting haute cuisine, outstanding customer service, in addition to the beautiful vistas. This unfortunately fell short with us.While the food was very well executed, the menu was predictable and dull. We had the venison and the filet. Both were cooked to perfection. The portions were smaller than I had expected, and the desserts were even smaller than I thought possible. For the money I was charged,  I would expect a small, yet satisfying portion. I'm NOT a big eater by a long shot, but had I come in hungry, I would've left hungry, even after appetizer, entree and dessert.The service was satisfactory for a cheaper restaurant. At these prices, I had expected superior service. We were left waiting for 10 minutes after we finished our appetizers before the server took our order for dinner (we spaced our dinner out and didn't order everything up front). The server didn't ask us if we wanted additional cocktails either. We received better service from the runners than we did our server.All in all, this is a great place to go for a special occasion, but if you want superior service, reasonable portion sizes, and interesting menu, go to Elements at Sanctuary. The view isn't as \"good\" but it makes up for it in all other ways. Or consider Orange Sky at the Talking Stick. Julio there gave us the best service we've had since moving to the valley."], ["Pepper T.", "Different Point of View is a Lovely Restaurant with Breath taking Views. Most of the food and Service I had was very good. This would be a Four star review if a few execution problems didn't occur. I am basing my rating on price point.Both entrees were less than warm especially the New York Strip. I don't order steak often but when I do I look forward to a very good steak that's tender, tasty and hot like off the grill.  My husband thought the steak was cold but I say it was room temperature. I didn't send it back or say anything because it was tasty and cooked nicely and I didn't want it cooked more and I also didn't want my husband's Pork to sit more. My waiter did come to check on us and asked how it tasted and I said fine because it did taste fine.At this point I was teetering between three and four stars.But another execution problem occurred with the Chiffon Date Cake. The cake is made ahead of time and kept chilled in a refrigerator. I am certain that freshly made the Pistachio Cream is delicious but after chilling it just turned into hard putty that you can't eat. Other issues with this dessert are I didn't recognize anything in the Chiffon Date Cake as Dates. I don't know if the cake had dates in it. I don't know if I got the wrong one either.  I tasted the cake and to be honest it tasted like a dry sorta sponge cake. I do note the coconut lime saffron sorbet was delicious and I used that to soak and moisten up the dry sponge of cake. I did question the waiter about the cake and he assured me I had the correct one. He also said the pastry chef was on vacation.Even with the Summer Menu Pricing I feel three stars is an accurate rating for the execution of the steak and dessert in an upscale place.Possibly a slightly off night."], ["Ann M.", "The view is amazing and we were lucky to be there in time to watch the sun go down. We chose to eat outside which was taking a chance because when the sun went down it got cold pretty fast. I would have thought they would have had some heaters outside. Both the service and food were outstanding. We never felt rushed and we were given great suggestions for food. We also received information about the mountains and areas around the property. The restaurant is high up the hill so make sure you keep following the signs to the restaurant. There is also a great lounge area and we were planning on having an after dinner drink there but it was so cold inside, we had to leave. The restaurant was very cold also. I would have never been able to sit there and and enjoy my meal. We so wish we could have stayed to enjoy more time there. Hopefully they will take care of this."], ["Katina D.", "The views were AMAZING. Everyone visiting phx MUST visit this restaurant and it will not disappoint you! We had sliders, lobster soup, French fries.... So hard to pick knowing that the view is gorgeous.I could sit on the patio all day before the Mosquitos starting attacking lol"], ["Nair S.", "Amazing view you can see whole city specially if your there at night. Have to call and reserve a table outside they only have a couple available for outside seating. Food was small portions  but DELICIOUS!!!!"], ["Gary B.", "Excellent food, excellent service, and a wonderful view of North Phoenix. One of the most enjoyable meals that I have experienced anywhere at any price."], ["R W.", "Wow.  The view speaks for itself and if I was eating a fried burger I would still give this place 3 stars on atmosphere.  Went with a group of 10. Apps for the table were pork belly,  oysters,  ravioli and all top notch.  I had arugula salad with apples also good.  Wife had scallops for dinner and said best in recent memory.  And she is picky.  I had filet which was perfect.  Also best in recent memory.  Everyone raved on the dessert too. Reasonable prices I thought for location. Areas to sit outside on edge of mountain.  A must try."], ["Kevin W.", "Short and sweet: My experience at POV is a really mixed bag.  Excellent service, great view, romantic setting, some of the food and drinks taste fantastic, but the skimpy amount of food offered was astonishing and very disappointing - so much so that its a sad joke if you've come here for a meal.  If wasn't for the 6 pieces of bread I ate, I would have left hungry after dropping $150.  Much of what we were served was sparse and \"micro,\" plus severely bitter greens, which left both my mouth and my wallet feeling ripped off.  See my photos of what we ate.  Wanted to take my wife out to dinner somewhere special, so I made reservations at POV for January 17, 2015 based on Yelp recommends.  She really appreciated that I took her out to such a nice place, bless her heart.  We arrived about a half hour before sunset because I thought it would be fun for us to watch it go down - it WAS fun, great view, had our drinks served to us on the outside veranda then moved to our window table inside.  Drinks were perfect and tasty, but with tax were just shy of $28 for two small drinks.  Ambiance is impressive and classy, but no background music was heard.  Bread was presented to us almost immediately, a generous combination of focaccia and sourdough - tasted good, but wasn't warm.  The meager amount of basil dipping sauce tasted great, but they \"ran out\" of it at the point when I asked for more bread.  It seems the chef made a special effort to make more for us, and did so, which I appreciated.   But to run out of ANY key staple item like this isn't good.Appetizers. She had the Pear Salad ($13) - the menu clearly misleads when it says it consists of \"pears\" (she got tiny bits of pears). I kid you not, it came to her with about half a handful of some kind of green sprouty looking grass plopped on the plate.  The \"pears\" consisted of 3 nearly invisible round scoops (maybe half a teaspoon each) of pears, another teaspoon of cheese and some thin dribbles of sauce splattered on this HUGE plate.  The size of the plate literally dwarfed the so-called  \"salad\" - it was ludicrous.  I mean, I could have played a game of chess on the plate and would never have touched any part of the salad.  Sure, the wife said it tasted great, but REALLY?  Four itty bitty half-bites? The pear and cheese components could easily fit into the center ring of a teacup saucer with room to spare.  I ordered the oysters, which turned out to be 5 of the smallest (1.5 inch - maybe) oysters I have ever seen, laid out on a bed of SALT with rosemary leaves (not edible).  The oysters tasted great, but again, I'm not a midget so why serve me a micro appetizer?ENTREESShort ribs. For once they told the truth - these were VERY short ribs!  They were the smallest short ribs I've EVER been served - at 1\"x2.5\" - on top of a creamy rice mix that tasted just as good as I could get from a box of Rice-A-Roni.  I forced myself to eat it - it didn't taste bad, but - meh - it was oh so ordinary.  The meat tasted excellent, but really?  All that for $35?  This was billed as an entrée, but you could sure fool me!  Even most appetizers have more meat than this entrée..  I could have ordered a really large steak plus much more for that price at a really good restaurant.  And the butternut squash Risotto advertised in the menu as part of the meal was just the thinnest paintbrush swipe of paste...I could see the plate through it.  Not even worth putting on the menu in my opinion. Then there was a clump of limp wilted spinach-like greens between the rice and the meat.  Those greens were soooo bitter that it totally ruined my palate for the rest of the food.  When I asked our waiter if he had tasted the greens he responded by telling me that they were grown locally by some young kids who were trying to make some inroads selling food to them (thus avoiding an answer to my question).  I asked him again if he had tasted it, and he replied that he had not.  Folks, if the waiter at a place this high-end serves his guests anything he has not personally tasted, then he's not doing his job.  On my way out of the restaurant I deliberately snaked my way through some tables to see if anyone else had left those greens on their plate, and sure enough I saw some plates that had.  Hey chef!  Get a clue! (or do you even bother to check and see what your customers leave on their plates?)  My wife fared much better with two fish fillets and 4 medium prawns on a bed of rice and greens.  She said it tasted great.  I was VERY glad she was happy with her meal.  If she had voiced any displeasure, I would have sent it all back.I won't go back.  I would have had a better meal at many other restaurants I can think of.  The view and service are nice to haves - but the food is paramount - and for what you're charging, you should be ashamed to offer so little on many of the plates we tried, and fail to ensure that EVERY ITEM on those plates tastes great and isn't misrepresented on the menu"], ["Barb V.", "We went for drinks what a fun a beautiful atmosphere.  We very much enjoyed the ambiance it was very special.  I wish they would open for lunch!"], ["Jad A.", "This place was Great for our company event Good foodAmazing view and he venue is amazing Highly recommended"]], "Gyro House": [], "The Golden Greek": [["Lisa S.", "Please do yourself a favor and visit this diamond in the rough.  The service in mediocre at best, but it honestly doesn't matter when you're getting such a delicious meal at a good price.  The bread is definitely home made and I could probably eat it all day.  I could die in it and be happy. Its amazing. I eat here a lot with my mother on her lunch breaks and we love it."], ["Deanna B.", "This is a WONDERFUL authentic Greek restaurant.  I've tried many other Greek restaurants, and I haven't found one as good as The Golden Greek.  Although it's not a \"date\" place, it's the perfect place to meet someone for lunch or even takeout.  The staff is very friendly once you get to know them.  The food is the best!  I find myself always getting the Gyro Sandwich, which comes with a small greek salad.  They close down for the month of July, and I always find myself craving it while they're gone!  If you haven't tried this diamond in the rough, you're definitely missing out!"], ["Kayla S.", "My favorite Greek place in the Valley.   You can't go wrong with anything on the menu, they serve the best calamari I have ever had.  The Italian food is good as well.   Service is slow, so plan on awhile and it isn't served with a smile, but it doesn't matter, the food is that good."], ["Gene G.", "Not bad. This place is down the street from where I work. The Greek food is actually a little on the bland side. Excellent service. If you go, order the lasagna, it is wonderful."], ["Mark L.", "For greek food this is the place in Phoenix, If your in a hurry forgetaboutit. No one thats in a hurry or impatient need apply but great food is always worth a wait. Little quaint restaurant with fresh made greek food, the italian is pretty good as well. I crave it all there great homemade bread is amazing I cant get enough. If you love greek food you must try..."], ["Nadia C.", "ohhhhhhh, I am craving The Golden Greek right now.  SO since I can't eat it, I will review it.  I have not been in some time but as far as I can remember it was one of the best Greek meals I have ever had.  The ambiance is hmmmm.... how do you say this? Dumpy?  But the food is just so fabulous that you forget you are sitting in a booth with duct tape holding it together.  The gyros are excellent.  Give it a try if you are in the area.  The price is affordable too."], ["Shawn M.", "Authentic, excellent food! Looks like a dive, and the neighborhood is old, but the food and the prices more than make up for that. Obviously a popular place because the line was almost out the door"], ["Lori C.", "The Golden Greek is awesome....the food is authentic and is run by a family from Greece.  My family and I have been going there for over 25 years.  The food is AWESOME, the service has been described to me by others to be a bit cold, but after you have dined there for a while you become like family.  Go for the food....it's amazing the prices are excellent as well. The chicken sandwich for lunch is wonderful and comes with a salad and tsatsiki sause, dinner has souvlaki (both chicken or lamb), and the shrimp yvesi is the best. The Golden Greek is just NOrth of Glendale Ave. on 35th ave in a small shopping center...you will not be sorry.....I would eat there every day if it was possible..if you want the real thing...then go see Tessi and Phillip at the Golden Greek."], ["Susan P.", "This is a family run restaurant that takes pride in it's delicious food.  The gyros sandwich, made from grandmas home made pita is sooooo good.  Get a Greek salad for a side and you have a wonderfully inexpensive dinner.  Yes, it may look like a hole in the wall, but the food is what you are there for."]], "Persian Garden Cafe": [["Leslie P.", "Persian Garden Cafe is my favorite Mediterranean/Persian/Iranian restaurant in Phoenix, hands down.  When I attended Phoenix College it was perfect for me to run over for lunch.. I'm sad I can't make it in more often now that I live and go to school in Scottsdale. My absolute favorite dish is the spinach burger. Everything is home made and even though the full menu is not vegan, they have a huge vegetarian/vegan portion of the menu. Their hummus is the best hummus I have ever had. I have sent so many friends to your restaurant and they all give rave reviews as well.  i love you persian garden!"], ["Funky D.", "With the short business hours and high prices charged for entrees, I'm not sure how this place has stayed in business so long.  Maybe it's because there are a mix of things on the menu - both mediterranean and not so mediterranean.There are daily specials and you can get:- fresh extracted carrot juice- hummus and baba ghanouj- tofu- soups and salads- salmon- shrimp- chicken- gyros and kabobsMy fave is the Merza and Kookoo which is spinach herb patty alongside stuffed grilled eggplant.  It's a little oily but not overly spiced so what you taste is actually the food.  This platter will make you $20 lighter so given that, the Garden Cafe is probably not a restaurant that I'll eat at all the time."], ["Rachel S.", "I visited the Persian Cafe Garden for the first time today as it across the street from my school and I was in the mood for a healthy lunch. The server there was a pleasant young lady with refreshing demeanor, unfortunately I didn't get her name- but she was competent and able to accommodate my couple of requests.  The food was pretty good as well. I ordered the Americhix Pita, a chicken pita with spiced chicken, cooked bell peppers and tomatoes. It was served with a tasty cucumber yogurt sauce. The only suggestion I have, and it may be a preference more than anything, is vegetables were a little overcooked. I'm sure something they would address next time. The place is also a little smaller and personal, I believe the owner is the chef.. So just know, the ambiance is a little more relaxed and casual than formal. Otherwise, I look forward to visiting again."], ["Nancy S.", "I was so prepared to love this place because I had visited before and because it was featured on Check Please Arizona, the local PBS program.  I never had worse hummus in my life - bland, watery - like no other I have ever tasted.  The so-called naan bread was the low point of the meal - like a piece of dry cardboard.  Really awful.  My friend liked the salad.  I like the gyro strips.  In the future, we would probably go to one of the many other excellent middle-eastern places in town.  The service was fine - our waiter was a nice young man."], ["Rebecca C.", "The Americhix chicken pita was good, nothing special though. They are getting three stars for being slow to bring out our food. We waited about 30 minutes for our food on a not-so-busy Wednesday lunch. Also they charge 0.75 cents for water.. So Meh.. Its alright."], ["Devorah Y.", "Great place for VEGANS and meat-eaters!!! Everyone is so nice and helpful with choosing options, even desserts. Location is okay, wish they were in the East Valley though. We will definitely be going back again."], ["Windy B.", "Phoenix's best kept secret?  Why don't people talk about this place?  I took one star off because I can't afford to eat here.  The food is very high quality so I can't really blame them, but wish it was cheaper. Most dishes were $15-$25 if i remember correctly.The food is fresh, authentic, and delicious.  It's not the kind of food that was prepared to make average people think they're eating good food because it is \"tasty.\"  This food is actually good.  Tons of fresh herbs, nothing was overly salty or sweet.  Lots of options for vegans, gluten-free, etc.  The herb soup was crazy good, never had anything like it. The service was very friendly and non-intrusive.  The atmosphere was pleasant and relaxing.  They were playing what seemed to be Persian classical music.  Was that a nay (reed flute) in the recording?  Well done!I had some gift certificates to make it all possible.  I took my sweetie there on her birthday.  After getting completely stuffed on everything we could, we sadly had no room for a vegan cheesecake.  Knowing about the birthday, the chef insisted we have one on the house, and he came out to personally sing happy birthday with our server.  No one was there.  Why don't you go there now?"], ["Sharon M.", "This little spot of heaven is a treasure. I went there for lunch yesterday for the first of MANY MORE times to come. My dining companion was raised on this type food and she was impressed with their culinary offering as well.  We shared the 'Purple Shoots' and one of their daily specials which happened to be a freshly roasted stuffed acorn squash. Both were excellent choices. Spiced and seasoned to perfection. The delightful hostess/waitress made the dining experience even more enjoyable.  This ultra clean café will be calling my name until I visit again. YUMMO!"], ["Anil K.", "Great hummus and great falafel sandwiches the prices are great and the restaurant is friendly. Try the baklava it fresh and really good"], ["Daniel S.", "Because no stars was not an option. Traveled from north phoenix because of the reviews....735 on friday night and they're locked up. No lights on. According to the information here, they should be open. Peace out!"], ["Gidget S.", "It is hard to find good Arabic food in this area, but Persian Garden Cafe is doing a great job.  When I entered, I was treated with excellent service.  They pointed me in the right direction as far as what to order, being that their menu looked very American.  It was hard to find the dishes that I love because most of them were given American names.  When I left with my take-out, I could not wait to dig in! I even had a few bites in the parking lot.  Their tabbouleh was top-notch and was served with lettuce leaves.  The lettuce leaves are not garnish- you scoop a bunch up with your leaf and eat it that way.  It is a cool, crunchy food that is wonderful on a hot day.  I also ordered a falafel pita, which was spot-on and delicious!"], ["Chris E.", "I love this place.  I've treated Baha'is in from out of town here, friends, family and other visitors to the excellent healthy fare created and served by Mahmoud Jaafari.  On January 20, 2012, Joseph was our excellent server, totally knowledgeable about the menu, special menu items, their preparation, and what good combinations were available.A very reasonable lunch menu's been added with economic crunch.  A great way to start sampling the many dishes served here.This is a good place for a fairly formal evening out with people appreciating Persian and Mediterranean dishes.  Or better yet, people who love exploring the world and other cultures through dining.  I like starting with humus and baba, toss in an organic Shirazi, Tabouli or other salad.Something else I enjoy is doogh, the yogurt drink of the Mideast world.  Tart, milky, icy, very refreshing.Omnivores start your engines.  Go vegetarian, vegan, or just go wild with Alaskan salmon, free range chicken, filet mignon kebab or just plain gyro.   Classic Persian, excellent Mediterranean.The dessert menu has so many choices.  Our last visit, we tried the dense vegan carrot cake, not cased in cream cheese frosting, but delicately sauced with a vegan-appropriate topping.  Be sure to add the Persian Chai at the finish.  You'll probably be asking for boxes because it's all filling and the portions large."], ["Matthew J.", "This may be the best restaurant in all of the Phoenix metro area. It might surpass all of the hottest places to eat around here on the weekend. But it's not Persian. No more than say...mcdonalds. They had grilled cheese. Yep. First thing that warned us when we got there was the sign talking about this was one of their lunch specials. They had falafel. Falafel is middle eastern Arabic thought to have originated from Egypt. Persians are not Arabs. So not Persian food.They had gyros. Gyros are Greek. Even farther off (but closer than grilled cheese). They DID have chicken kababs but you could tell they weren't any more Persian than some chicken I throw on the grille. I hated to give this place a low review because we didn't eat there. But we did drive all across town to eat there only to find out they have zero persian Food. No koobideh. No barg kabab."], ["Rosa P.", "I love the food here. Fresh, flavorful, organic and seasoned with lots of herbs. Lots of vegetarian and vegan choices. Fresh pressed juices and teas. Everything is well-balanced and prepared with loving care.Be sure to check the menu for the daily specials--it is sure to be good."], ["S F.", "I believe this is simply one of the best restaurants and best-kept secrets in the Phoenix area.  Honestly it is quite rare to be able to enjoy this type of Middle Eastern food in an organic, vegetarian, and healthy way. Most middle eastern restaurants create their flavors through excessive amounts of oil and fat. Not here. Fragrant and very aromatic food. I really enjoyed the spinach stew and the sabzi polo rice. While there are the traditional Persian dishes on the menu, there are also creative variants of Persian food including the use tofu. It does have meat on the menu but dedicates two pages to vegetarian entrees. Aside from the cuisine I think what separates this restaurant is the charming environment and personal attention from the chef and owner who often comes out and greets the guests.  This is a ma and pa restaurant. I highly recommend this restaurant."], ["jon b.", "I know that hundreds of you wait everyday for a new review by me, checking yelp several times a day in hopes that I've been generous enough to share my whit and culinary expertise. For all of you, my fans, I have some news that may rock your world. I went vegan 5 months ago. Margaret Cho does a stand up skit about people you should not F*** with. On the list are gay men, lesbians, vegans, and Bjork. \"Do not f*** with vegans... Do not look vegans in the eye.. If you get in an argument with a vegan, say you're sorry and back away slowly. You don't mess with vegans because they're F******* hungry!\"This is true. I was hungry for 6 weeks until I realized the only two foods that satisfied my hunger are refried beans and hummus. So.. why two stars for a restaurant that caters to vegans?The prices. I am not a cheapskate. I spend a ridiculous amount of money on food. I once spent $500 on a meal for three people - and didn't feel ripped off, because it was worth it.I ordered a vegetarian plate. Humus tabouli, falafel & dolmeh served over white & brown rice. Falafel is topped with tahini. Humus & tabouli served with fresh veggies & homemade nan. So... most places... a meal like this would be 8 dollars. Maybe 14 at a good restaurant. $20 for this... I expect the best on earth and a huge portion.It wasn't. The hummus was pure tahini - awful really. The baba was smoky and kind of grossThe falafel I didn't think was that great. The dolmeh were good. The portion size was a normal Styrofoam take away box with one piece of pita.I will say that the rice was divine. Saffron - y and perfectly cooked. The price was not equivalent to the quantity or quality. I was mad. Baiz market sells a whole Styrofoam box full of exponentially better hummus for 5.99.Vegans are a hard bunch to please, I realize, but charging this much for less than  perfect food will not win my business."], ["Jon G.", "I have been to the Persian Garden Cafe a couple of times, but my sister has been here a bunch. We live out of state, but have family in the area, so whenever we are in town we try to come here. I live in Los Angeles where we have no shortage of Persian Cuisine, but I have yet to find a restaurant this good.Persian Garden specializes in vegetarian and vegan dishes, but there is plenty of meat and sea food options for the carnivores. In fact, the options are so good that I had a really hard time making up my mind this time around. I finally decided on the vegetable stew with eggplant, and it was amazing! So much food, and it came with a big plate of rice as well. I couldnt even finish it all, and it was soooo good!The chef came out to greet my party and was very nice, and gave us a complimentary starter.I can honestly say that whatever restaurant you decide to go to, it will not be as good as Persian Garden Cafe, and I have been to a lot of restaurants all over the valley. Do yourself a favor, tell a friend, and come down. You will not be disappointed!"], ["Clayton K.", "The worst Persian food I ever ate.Hummus was tasteless. Gyro meat was that pre-sliced frozen meat you can buy at CostCo. I won't be back.I have nothing more to say than stay away........................................................................"], ["Rachel R.", "This food was so good, I'm not even mad that Persia no longer exists. Persian Garden Cafe is enough for me. First off, there's plenty of meat and seafood on the menu - but - everything can be made vegan. That's right. You can all come out of hiding now. You're safe here.I shared the dolmeh and falafel plate with a friend and was satisfied, but still found room for dessert. Yeah, I've got my priorities straight. It came with four big, crisp, spiced falafel and three FRESH, steamed domlehs. (To anyone who has only had the displeasure of trying a canned dolmeh: now is your time. Feed.) That may appear to be enough to serve one person, but with the heaps of saffron rice, brown lentil-currant-other-tasty-things rice, tahini, tomatoes, and huge basket of flat bread it came with, it was more than enough for two.For dessert, we ordered a slice of carrot cake and chocolate cheesecake. They're both vegan, along with the saffron rice pudding and pumpkin pie on the dessert menu... both of which I'll probably review in the near future. The carrot cake was huge, super sweet, heavily spiced, studded with raisins and walnuts and topped with a dollop of magical cream un-cheese frosting. The chocolate cheesecake was my favorite, probably because it was doused with dark chocolate chips, had a chewy, creamy center, and a crunchy, cookie crust. Last I checked, those are the only things I want from a dessert, ever.Persian Garden Cafe ain't cheap, but the ambiance is warm and pleasant (not to mention, great for groups), the food is fresh, homemade and delicious, and you can get dairy free cheesecake that's better than regular cheesecake. If that doesn't make this place worth a shot, I don't know what does."], ["Sindi S.", "Had lunch here last week with friends and really was not impressed.Mostly everything is served with rice or some kind of bread.  I avoid these items due to carbs.One person ordered some plate with hummus and baba ganush which I sampled.  To tell the truth I did not find this flavorful but kind of bland.  Now I do not like hot spicy food but I do like food to have some sort of flavor.When I arrived I realized I had been there a few years back and didn't find anything at that time I really enjoyed.Maybe next time someone invites me I will remember that I tried it 2 times and not going to try the 3rd time."]], "George's Famous Gyros & Pasta": [["Dee G.", "When you walk into this strip mall you may not expect much. However, this is the best spot in town for gyro, hands down. Regardless if you want a salad or a sandwich, the gyro meat is great! If you aren't a big fan of gyro, no problem. The chicken here is amazing as well! My favorite meal is the greek salad with gyro meat, but you really can't go wrong with anything on the menu. The portions are huge, the quality is great, and the price is worth every penny!"], ["Pepper T.", "This is a small fast-casual Greek Restaurant that isn't fancy but is clean with indoor and outdoor seating. Based on just one visit I can tell you the portions are enormous and the pricing is very low. Everything is under $10.00 and most plates run around $7.50. They offer a very large menu with many choices.I made my order at the counter and paid and then picked a table to sit at. The cashier/cook (maybe owner?) seemed very polite and was very efficient.I tried the Athenian Stir Fry with chicken. I knew my platter came with salad and was just expecting the salad to be a little garnish on for my $9.00 platter but they ran me out a full size fresh Greek Salad with charred garlic bread. In only a few minutes latter I received  a styrofoam plate heaping with a mountain of food. It was enough food to feed a small family. Lots of rice and LOTS of seasoned moist chicken. I thought the food was good but was missing the delicious fresh herbs that Greek Food is usually known for. I figure the prices are so low that fresh herbs can't be used. My husband had the Porky Athens. It also was an enormous plate with lots of rice and moist pork. It was also good but also lacking those delicious fresh herbs.Because of the location and the big varied menu I will try again.Great value dining. I felt like I got more than what I paid for. For me this was A-OK and this is a positive review."], ["Deni G.", "Hidden Gem For Great Greek FoodToday, I had a 'hankerin' for some  Greek/Mediterranean food but had no clue where I should go.  So I turned to my fellow \"yelpers\" for help and after reading reviews I decided to head to George's Famous Gyros and Pasta. Who would have guessed that this little hidden gem had great tasting Greek food.  George's is unassuming from the outside and even more so inside.  George's is small, the tables are plastic and there isn't much in the way of ambiance.  However, George is wonderful and so is  his food, which is always prepared fresh and is absolutely delicious.  George understands Greek food. I assume  growing up in Chicago, laid out a great foundation for this eatery. The Greek salad with gyro meat, burgers, and fries are excellent.  However, make sure to bring an appetite because the portions are large, easily enough for two.After finishing a large lunch, and thinking to myself, I cant eat another bite.  Out of the coner of my eye I caught a glimpse of the baklava and it was impossible to pass up.   I had dessert on the brain.  I am so glad I decided to endulge.  The baklava was oozing with honey and had just the right amount of sweetness. A perfect ending to a great lunch.Oh, did I mention the low prices and great service? George's is an incredible value for the high quality of food.  If you enjoy Greek/Mediterranean food and you're in the area, you should definitely stop by George's, you won't be disappointed."], ["Josh G.", "Very nice local Greek restaurant! Hard to find a good gyro now days! Server was friendly, plus she liked my j's! +2 for that!Food is very good and reasonably priced! Even the to go box is presented nice!Gyro is filled, and they are NOT cheap on the meat!! Another +2 for that! The tzatziki is on point too, but not as good as yaiyai's   The owner is very nice, and hospitable! That alone is worth it!HIGHLY recommend!"], ["Kimberly R.", "George's is a gem and has quickly become my go-to place for pasta and Greek salads. The people are friendly, the atmosphere copy and the food is delicious. I love the alfredo with grilled chicken. So good!"], ["Marisa F.", "Came here by myself for lunch and ordered the platter and when they found out it was just for me they let me know it was a large meal for 2. I appreciate this kind of honesty and will definitely be back.  Oh and the food was great"], ["Zeshan D.", "It's hard to find a place with really good gyros, and George's is the best in town.  They get the best quality meat, and cook it to perfection, with generous portions.  My mouth is watering now just thinking about the next time I'll head there!"], ["Kayla H.", "Tonight was my first experience here and it was quite amazing. I walked in and indicated that it was my first visit so I could peruse the menu. The man that took my order (who I presume to be George himself) was very friendly and treated me and my boyfriend to a free drink for our first time. The prices were very decent, considering the amount of food that you get. George checked up on us to see how our food was and even offered to close the front door because I was cold. I don't usually rate on Yelp, but I feel that people easily forget to rate the good places. So overall they had great food, large portions, reasonable prices, and amazing service."], ["Whitney T.", "I've been here a few times to grab lunch and wow, it's pretty good.I've had the Greek salad with gyro on top, in addition to the gyro platter. The platter is a very, very generous portion that comes with bread and a side salad. I had to take half the food back to the office, it was so much. Absolutely delicious though, and the pita was fresh and warm.I've gotten the salad when dining here alone and it's the perfect portion. Even then it's super generous, but not so much I can't handle eating it alone. I love gyro, so having it on a salad is great.Out of the places I've found in Phoenix so far, this is my favorite."], ["Claudio B.", "Love the Gyro Greek Salad. Its worth everyDollar.. Not writing much because I am hungry and want to continue to eat it. I heard the Sandwich is amazing and can't wait to have it next time :)Enjoy the food!"], ["Jacob S.", "First visit today and ordered the special (always do and don't ask what it is on the first visit), the gyro and the cheese burger.So I believe the special was spinach ravioli with sundried tomato, mushroom, garlic, basil and a butter sauce. First off, it was really quite good. The sauce was spectacular, bravo, chef. The ravioli was al dente, which is good, I think I would pull it just a bit soon though because a little texture would help but that's just me. Seriously, I would order it again, it was good.The gyro was as it should be and frigging stacked with meat. Tiziki was on point. Red onion added color and a bit of depth that made it just right. Very good job.The cheese burger was unique, served on baguette and formed to fit perfectly. Somebody put some thought into this dish. One of the better burgers I've had and there are no shortage of burger shops so that's saying something. One of the top 10 in my opinion.The fries are good. Cooked correctly and seasoned well. For me I would have used celery salt on them as opposed to table salt because when next to the gyro and the burger they came across a little plain, but again that's just me, I'm sure other would disagree.The decor is fine, lighting is bright, the shop is clean as it can be, the folks are fun and clever with their approach to customer service, I enjoyed them a lot.So one thing, and I almost hate to say it but kitchen staff should be dressed like kitchen staff. That's important to me, so I was a bit disappointed that they weren't, once again though, that's just one guys opinion and I am equally certain that an informal approach appeals to a lot of people so I am not judging. These guys have been doing this for awhile now and doing it very well so they know what they are about.I'll be back and I hope the ravioli will be on the menu when I get there."], ["Brandy E.", "Love this place! So many choices. And so yummy! You get your money's worth. And they are super nice."], ["Nikki H.", "We stumbled upon this place when we went to the FedEx in the same shopping center. While my hubby went to mail a package, I noticed the sign to George's Famous Gyros and looked it up on Yelp. Upon seeing the great reviews, we decided to visit the restaurant later that same day for lunch. The restaurant is tucked into a small corner, so it's easy to miss if you don't know it's there. Our favorite item to order is the Gyro Picado, which has grilled onions, peppers and jalapenos in addition to a generous amount of meat. The meat is sliced thin and is extremely flavorful and not too greasy, and the peppers add a nice bit of heat without being too spicy. The gyros are served with fries or a salad. I've never ordered the fries so I can't speak to them, but the salad is large and the dressing is light and tasty. We're often tempted to try something else on the menu, such as the pastas or the pizzas, but we just can't seem to stray from the delicious gyros. Located less than five minutes from work, George's has become a lunchtime staple for us."], ["Tawni G.", "My boyfriend and I were both pleasently surprised by this place. The food is good and I like the family vibes going on. I would go back and reccomend this place."], ["Lalalia A.", "Love georges, hidden gem located next to Pizza Hut and fedex. You won't be disappointed,  the pasta dishes are excellent along with his assorted gyros and pitas. My pita plate was enough for two, enjoy!"], ["Jim B.", "Top notch service with great tasting food. I come here with my wife often for lunch and have yet to have a bad or even average experience. The chicken pita is delicious."], ["Donna M.", "My first visit was earlier this week and I have to say it was pretty good, very reasonably priced too. I got the platter with gyro meat and it was honestly more food than I could eat, but I had leftovers for the next day, which was nice. The platter comes with choice of meat, pitas (which I opted to forego being GF) tomatoes and red onions, along with a salad and fries. The salad was kind of a typical Greek type salad, greens with a couple of cucumber slices, kalamata olives, tomatoes, couple peppers, red onion, a dabble of cheese with a vinegar based dressing. The meat was really delish as was the Tzatziki sauce. The fries were fresh and tasty. Overall, it was a good value for the money. It's also a short drive from work so I think I will include it in my regular lunch-time rotation."], ["Mysti G.", "My roommate and I have been coming here for a few months. The gyros are huge and packed full of meat. The fries are always fresh and just exactly the perfect level of crispy. No mushy fries here! The side salad is huge and delicious, too. We never manage to finish a whole plate of food here!It's a local diner-type atmosphere; low-key, just a few tables and chairs and a big tv. Dining outside in the summer is nice - the tables are tucked away between the buildings, so it's kind of private.Bottom line:  if you're craving a gyro, this is a great place to eat."], ["Adam G.", "The original gyro was quite good. The lamb is seasoned and cooked very well. The spices accentuate the flavor of the meat rather than overpowering it, which is very important for meat like this. The pita bread is nice and soft--not stale or overheated. The tzatziki was great, but there was just NOT enough of it. Though it does cost $0.25 extra, I strongly suggest getting it. They don't skimp on meat portions, so the tzatziki just can't keep up. The amount of tomatoes was a little lacking too, but not really to a fault.My sister-in-law got the chicken pita and was pleased with it as well.I chose fries as my side, but I wish I hadn't. I believe they were frozen store-bought fries that were under-baked and heavily seasoned with season-all. Don't be me--be healthy and get the salad (sister-in-law liked that too).Ordering online with GrubHub was easy and the food was ready on time. The man who handed me our food was very friendly and made picking up our online order quick and pleasant.I'll be going back, but next time... MORE TZATZIKI."], ["Josh R.", "I became addicted to Greek food when living in Las Vegas! This place has delicious gyro's and I'm glad it's close to my work! The server is upbeat and the food came out hot and fresh! The fries that came with the gyro were a large portion and I could not finish them. $10 for the gyro fries and drink is a little pricey! They could have tamed down the amount of fries and made it more reasonable for around $8! Overall it was worth it and I will be back!"], ["Daren C.", "I was surprised and happy to see Georges resurfaced in N Phoenix. This is the same Georges that occupied the small place between the former Kyoto Bowl and the pet store near Bell Rd and 27/28th Ave.I was going to get the standard Gyro but was told of the Chicken Enchilada special. So I had to try it. They were 3 chicken filled corn tortillas with a homemade tomitillo green sauce and cojita cheese on top. The flavor was perfect, nice mix of flavor and spice. The chicken appeared to be all white meat and was really good. Served with a side of rice (great) and a small patch of lettuce and tomato. It was great and very unexpected to enjoy it so much."], ["Allan M.", "Great food, great prices and generous servings. I had the original gyro. The meat was thinly sliced and piled on with just the right amount of sauce."], ["Hope J.", "The food here is really good! If you enjoy Gyros and Gyros done right,  George's is super for that ! Usually the owner is there and he is working and cooking on his own and he makes it spectacular. Location : Small sit down area, nothing fancy, good for lunch, do not bring a date! You can usually call ahead for take out. Prices are about the same as similar places nearby. It would be even better if they had special deals like many other gyros places do. For example a meal deal for a special price during lunch, etc."], ["Fawn V.", "Best gyros in Phoenix! They taste straight out of Chicago. The staff is wonderful and the place is always clean. When ordering for pick up it's always ready and I never have to wait."], ["Andrew F.", "I frequent George's at least twice a month for lunch as it is nearby my office. They always have a good crowd at lunch by the many office workers like me. The restaurant itself is fairly small, maybe 6-7 tables or so inside and a couple more outside.  The decor leaves something to be desired, especially in the bathrooms.  Not unclean, but not something that looks quite up to par either. The service is walk up \"fast casual\" style and usually George himself cooks, runs the register and delivers the eats too. (With the help of 2 more helpers in the kitchen). The big sellers are the usual suspects of a Greek joint; Gyros, Salads, Chicken, etc. The food is the usual fantastic assault of highly seasoned Greek fare. I love the house Greek salad dressing and the Gyro with Fries. Always a winner!  Definitely a must try."], ["Dan M.", "Seriously, how can you give this less than 5 stars with the flavors of their food? I had the gyro picado with the side salad. It rivals any place in town. Go check these guys out and enjoy some really delicious food!!!"], ["Amy S.", "This place is amazing!  They have a huge menu, very wide variety, great salads, phenomenal sandwiches, all very reasonably priced. Service is always excellent as well, short wait time.  I'd recommend this place to ANYONE!"], ["Dean K.", "we really enjoy the food here. not many good Greek places to eat with such a good variety of food"], ["Jeff D.", "Yelp reviews did not let me down. This place was amazing. The hummus was great and the original gyro was incredibly delicious. Portions are huge! Service excellent."], ["Rachel J.", "I work Next door to George's I eat there 2-3 times per week.  It's always amazing. Ted the owner is great, and Elizabeth the kitchen manager rocks! Try the steak stir fry or the Greek Salad with chicken or gyro. Liz makes the dressing from scratch! Great place!"], ["Mike H.", "3.5Didnt even know about this place, but had to pick up a pizza at Pizza Hut next door on a holiday since my work address doesnt have a manned lobby for the deilvery guy to deliver,, Anyways, Tried the PICADO Gyro,the Breading was really good, didnt break apart like other places,The meat (a whole lotta meat too) was consitantly seasoned, and the fixins, were not overpowering. Close to work, and decently priced I will definitly be back.Even the fries were good...."], ["Daniel G.", "The Greek salad with Gyro is amazing!  Owner cares and works hard each day I have come.  Will repeat often!"], ["John K.", "First off.....  One thing: if you ask for more tzaziki sauce, they are happy to give it to you. Just gotta ask!! And, it has lots more flavor than some other  tzaziki I have had.Now for the review:  Great place!!! The food is very good. Large portions in the gyros as others have said.  There are many pasta dishes on the menu that sound really good. I will update when I try them.Ted, the owner, is a super friendly, happy guy. The place is right next door to the Fedex. Kind of hidden away, but search and you will be happy you did!UPDATE.......................................................I have had a few of the pasta dishes (Greek Pasta and Meat pasta). Tthey are great! They come with garlic bread AND a Medium sized salad! A great meal for approx 7-8 bucks!!"], ["Jason W.", "Good food at a great price. I usually get the gyro platter. The small Greek salad that it comes with is large enough for my wife to take to work for lunch. Much more than one person should eat for sure!"], ["Hannah N.", "Had lunch here today and it was very good. My friend had a gyro and fries and I had the Greek spaghetti.  Both came with either a salad or fries and were very tasty and reasonably priced. My daughter had the chicken nuggets and though they were the dinosaur shaped chicken from Costco they were exactly what a three-year-old would want.  My only complaint would be the volume of the TV going in the corner, but I can overlook it for the tasty food."], ["Michael W.", "Wow!!! Thank you Yelp! I've lived in the neighborhood for almost 4 years and had never tried George's until yesterday. The location makes it a bit tough to recognize from the road. The original gyro was fantastic! Has to be the most meat I've ever had in a gyro, and great flavor too! So I took the to-go menu with me and saw something intersting, George's Chicken Faliro. Had it for lunch today :), sliced chicken breast, artichoke hearts and capers, sauteed in olive oil, butter and a little lemon, topped with a bit of feta, all over pasta, outstanding!!! Great value, will definitely be back!"], ["Farzana S.", "The staff here was very friendly, and the food was good! You get a lot of food, but it is a bit pricey for lunch."], ["Thomas O.", "I enjoyed my lunch here!So 3 stars? This ranking may seem a little harsh because I already stated that I enjoyed my lunch, but let me give you a quick run-down on my opinion. I ordered the gyro platter to go.Plusses: Clean, friendly employees. TONS of meat. Salad was amazingly good and fresh. They offer the option of rice or fries offered as a side, and the rice was great. Tzatziki sauce was one of the better ones I've had; quite a bit of dill whereas most in the valley are almost pure yogurt.Negatives: The gyro meat was a tad dry. The seasoning was average - which means it was not bad. Also, despite having enough meat to make 3 or 4 gyros, I didn't have enough onions or tomatoes to even make two. The proportions were off. I'll eat my leftovers after I go home and make some more side items.But this is nitpicking... the platter was $8.50 and a single gyro (with fries or salad) is $7.25. The deal is outstanding.Since this restaurant is fairly new, I'll give a quick run-down on other items on the menu.Appetizers include falafel, hummus, dolmades, spanakopita, zucchini, mushrooms and even chicken nuggets and jalapeno poppers. All are $4.50 or under, plus they have Greek Wings for $6.50.They obviously have gyros and pasta... and they offer pita pizzas; Greek, Italian and Veggie. If their side salad is this impressive, I need to try one of their full salads. They even offer salmon or shrimp salads for $8.25! Greek, Chicken Caesar, Garden and pasta salad are all available. Very reasonably priced.They have shrimp a few different ways on pasta platters, and specials like Italian sausage. They have a sandwich selection including Italian beef, chicken parmesan, cheesesteak, meatball, fish and pork among others. They also have quarter pound and half pound burgers.All of their meals are pretty much between 6 and 9 bucks.Since it's convenient for me, I will definitely go back. I recommend it, although it isn't my favorite gyro place in the city. It earns above average marks, so 3 stars from me for now. I'll re-evaluate once I try more items; especially the dolmade!"], ["Vinnie P.", "I work across the street from George's and have always wondered how the food was there.  I love gyros and I have a place near where I live that isn't that bad but George's blows it away!  Yes, it's further of a travel for me but well worth the price of gas.  My roommate and I couldn't decide what we wanted for dinner and I said there's a Greek joint across the street from where I work.  I see it gets GREAT reviews on Yelp!  Wanna give it a try?  He agreed and off we went.  We decided to eat in.  The dining room is nothing special but it's clean and the workers were really friendly.  My roommate and I both ordered the same thing and we decided to split a Hummus and chips appy.  The Hummus is home made!!!!  YUM!!   Then they bought out a nice sized Greek Salad for each of us.  As we got about halfway thru the salad the main course came out.  We got the Original Gyro platter.  OMG!!!!  The portions were HUGE!!  I took one bite of the meat and I was in love.  It was perhaps the best tasting gyro I'd ever had.  The platter came with tzatziki (and plenty of it), sliced red onion, diced tomatoes, french fries (which were basically an afterthought) and pita bread (which was soft and warm).  It was absolutely delicious.  I hate to admit this but I ate the WHOLE thing........sans the fries.  My roommate bought about half of it home with him because he was full.  The employees came over to check up on us halfway thru the meal which I thought was very nice of them and like I mentioned before, they were very friendly and helpful.  OH!!!!! And the kicker......VERY REASONABLY PRICED!!!!!   Especially for the amount of food we received.  I will DEFINITELY be making many return visits to this fine establishment."], ["Brad T.", "Love their greek salads here. I've tried a lot of their menu items and have never been disappointed. Great service too!"]], "Saba's Mediterranean Kitchen": [], "Middle Eastern Bakery & Deli": [["Tara G.", "This place is amazingly fresh and delicious. Everything was seasoned very nicely. Service was friendly and helpful! Avoid the lunch rush! It got really busy! Would definitely come back again. Lemonade was bomb. Support your local businesses!!!"], ["Danielle L.", "I'm Baklava in Americaaa, and couldn't wait to get back to Yelping once I got wind of this place! It was a perfect lunch experience and instantly inspired me to get my reviews rolling. Immediately upon entrance the owner greeted us with the warmest welcome and sweetest smile. He knew we were first timers so he took his time going over everything on the menu in detail. Can't say it made our decision making process any easier though, considering he described each option as being \"THE BEST IN THE WORLD!\" But I loved it. He had full confidence and enthusiasm about every single thing he served,  and it showed.I would have to agree that the lemonade and baklava were the best around. Don't get me started on the fresh falafel, with a side of special spicy sauce, omg. The chicken was cooked to perfection, and the hummus and pita bread definitely hit the spot. The meal most certainly impressed me, and the grocery corner was a nice touch. But my very favorite part of the meal was the part where he treated me (and my lunch date) like royalty. He was out to make sure we had an exceptional experience and showed us the kinda service that you just don't see much of these days. He welcomed us with a smile and we left with an even bigger one, as he was sure to check on us on the way out. Definitely worth a go! Go, go!"], ["Mary M.", "This place as a great deli setup, decent little market, great service and amazing lemonade! If you're on the fence about what to order you are in safe hands accepting recommendations from the staff, who are very passionate about their kitchen's lineup."], ["Erica L.", "The lemonade, the lunch, the grocery store...everything here is amazing! I randomly ended up here today for lunch and the reviews did not disappoint. The pita bread was fluffy, the hummus was smooth, and the salad dressing tasted very fresh and authentic. The man at the cash ( I am assuming the owner) sold me on the lemonade which was probably the best lemonade ever! The lemonade is made with rosewater and honey, no sugar added. I will be returning soon to try their famous Baklava!"], ["Michael B.", "Simple & delicious middle eastern food, fresh pita & amazing arabian coffee...an institution!"], ["Marybell G.", "This was our first visit to the bakery and were only here because we were in search of baklava. I was surprised that it was a restaurant as well. It seemed authentic which is also a plus. We purchased baklava and it was delicious. Each and every crispy and flaky layer was perfect. I asked the kind gentleman at the register about a particular pastry. He explained the ingredients and said it was burma. Which was also yummy. What really blew us away is that before we left the owner treated us to his award winning lemonade. It's made with lemon, honey, and rose water. What a treat! He was very proud of it and with every right. It really was amazing. We will definitely return and try a meal (the Lebanese chicken caught my eye).The place gets 5 starts from me for the exceptional customer service and delicious pastries."], ["Cindy F.", "I really like this place but wish the food was better.  Could be that it is too original or authentic for me.  The meat is always dry and the small cups of hummus and tzitzi are just small. Very nice people and appealing market. I will definitely be back for the lemonade."], ["Gret P.", "The store is neat, the food was yummy, and the service was good.  The only down side was another patron that had no idea how to act like a decent person.Would recommend :)"], ["Michael M.", "Love it. First time here, and I love the initial experience. My appetite wasn't the largest so I just had a gyros sandwich, but what I was served was the best gyros I've eaten in my years in Arizona (not an exaggeration).Friendly staff and a nice, store-like atmosphere. Definitely check it out for lunch!"], ["Nhu C.", "Love this place! Get the lemonade and the schwarma with tabouli served with pita (all house made). You cant go wrong!"], ["Mimi J.", "Nothing I could say in this review could possibly convey the amazing experience that we had here at Middle Eastern Bakery & Deli.  This was THE BEST place at which I have eaten in all my visits to Phoenix (off and on annually over the last 10 years) and I will be back (multiple times) every time I visit from now on.Why is it that the taste of the food is so often inversely proportionate to the fanciness of the restaurant, at least when it comes to ethnic restaurants?  The fancier the decor in an ethnic restaurant, the blander the food.Stated differently, what is it about the mystical siren's call of the hole in the wall ethnic restaurant?  Does the chef assume that because his food is head and shoulders above the rest that he needn't waste money on decorations?  Or is it simply that the mom & pop chef with his traditional recipes handed down from generation to generation will never be matched by the cookie cutter american culinary school education?This restaurant is very unassumedly named The Middle Eastern Bakery and Deli, though it is also a restaurant and grocery store.  It doesn't look like much from the outside, nor the inside, and would probably fly under most people's radar if it was not for word of mouth passed through Yelp.  Can you see the diamond lurking under the layer of carbon?  I sure can.The proprietor, Isam (yes, we're on a first name basis now and you will be, too, by the end of your first visit), is quite a character guaranteed to put a smile on the face of even the WORST sourpuss.  Before our first visit we called him by phone to make sure the restaurant would be open when we arrived and he was friendly and welcoming.  When we finally arrived he welcomed us like old friends.  I ordered the grilled combo and my coworker ordered the Lebanese Chicken.  Both plates came with a choice of Greek Salad of Tabbouli with a fresh warm pita and rice.  I wasn't sure which to choose, so Isam guided me gently toward the Tabbouli which he makes FRESH 5 TIMES EVERY DAY.  Yes, you can tell this man is incredibly gifted in the making of Tabbouli, which is a thing of beauty, colorfully decorated with red and green pepper rings, white couscous, tangy red tomato, crisp white onions, and ruby toned sliced beets over dark greens.  It is beautiful, but tastes even better.  I ordered a diet soda in spite of the prominently displayed Yelp tip recommending the lemonade (\"Your life will change as you discover the super powers you've acquired from the lemonade.\") as I'm not usually a big lemonade fan.  My coworker ordered the lemonade and I ordered the birds nest baklava with glistening green pistachio pieces covering the top to eat while I waited for the food to arrive.My coworker took one sip of the lemonade, which is made with honey and rose water - SHEER GENIUS - and couldn't stop talking about how amazing it was.  I traded him half of my baklava for a taste and couldn't BELIEVE how amazing it was - TRULY LIFE CHANGING.  Isam brought me a large cup of this elixir of the gods and made my entire day.When our meals came I was thrilled with my perfectly seasoned kebabs with three kinds of meat -  chicken, lamb, and spiced ground beef, all of them cooked perfectly and all of them delicious.  The rice was not basmati, more like a pilaf, but was incredibly flavorful.  Alex said his Lebanese Chicken was amazing, but refused to share any with me.The owner brought us over a complimentary Turkish coffee, a lemonade, and a pistachio baklava - all amazing!!!  Isam also gave us a lesson in appreciating coffee.  He taught us how to sip it and about his secret ingredient (cardamom).  He grinds his own cardamom fresh from the seeds, which cost $100 per pound and I guarantee you are totally worth the expense.  He showed us both the seeds and the ground versions and let us smell them, pure heaven on Earth.  Isam says that the cardamom works on your nervous system to relax you;  I certainly felt relaxed when I left, but I think some of that might have to do with the owner's charm rather than the coffee.  When we left, we stopped up at the counter to say goodbye to our host, because it just felt more like a family visit than a restaurant visit.  You can just walk out of a restaurant, but you don't walk out on family without saying goodbye.I made a return visit several days later and not only did Isam remember me, but he came out from behind the counter to give me a hug and asked where my friend was (I had just dropped my coworker off at the airport).  I ordered the Lebanese Chicken and one of his heavenly lemonades.  Isam once again brought me a Turkish Coffee (this stuff is addicting) and a baklava to enjoy with it.  I enjoyed my second visit as much as my first; Isam gave me a menu and invited me to come back again during my visit.  He even gave me his phone number and told me to call if I needed anything.  I will definitely be back!! Relaxes you, works on your nervous syst"], ["David D.", "Food was decent A little bit of a dive but clean and staff friendly.Would go back again if I was in the area, but wouldn't take a trip to go there."], ["Trista U.", "I eat here at least twice a week, great food and great customer service.  I have a hard time ordering anything but their Greek salad with gyro meat so can't recommend much else....but it's addicting and fresh."], ["Steven G.", "4.5* with so many reviews gets me excited for a place...I've had better gyro meat at countless places (many of them fast food)... It was like the bologna of gyro.The tabouli was weird but had good flavor...hummus was a notch below kroger brandtaziki was nothing special.Also, this place is kind of a rip off. No clue how they got so many 5* reviews. Perhaps people only came for the lemonade or they come here for grocery shopping? But as a restaurant I've had more satisfying meals at Mcdonald's."], ["Edward L.", "I came across this wonderful jewel by a complet accident.  I was getting my car battery charged and just decided to walk over and get a bite to eat.  The owner help me pick a meal as I have never eaten middle eastern before and I must say . Best food I have had (sorry mom)"], ["Cyrill D.", "Love this little hole-in-the-wall. I've now been there multiple times. A bit interesting to find the first time, but overall a great experience. Love the baklava, and the turkish coffee. I've tried several things, (shawerma, gyro, meat & spinach pies) all of which were great! They're super nice, as well as fast (for homemade, cooked to order food). I'm interested in trying the lemonade, but haven't been back this month to try it."], ["Jim G.", "Great shawarma. Bomb chicken lemon soup. Wife had a gyro on gluten free pita and loved it. Lemonade sweetened with honey, which tasted a little off until paired with food then bam that worked too. Great service, a little grocery with all kinds of yum yums. Can't say enough good stuff about this hole in the wall."], ["Kari H.", "Just stopped in for lunch and it was so delicious. I had the shawarma pita sandwich and my roommate had a kifta pita sandwich and both were delicious. Followed it up with some of their homemade baklava and we were set. The owner is so friendly and pleasant, his greatness is matched only by the food. They also have a lot of market style goods, snacks and refrigerated foods for people looking to take more home. Absolutely thrilled with this place and can't wait to come back!"], ["Nindi W.", "Love this place and the service rocks! We got there about 20 minutes before closing. The owner asked us if it was to go or for here. I mentioned that we'll just get it to go since they close soon. The owner told it would be just fine if we stayed. Love their honey lemonade!"], ["Adam T.", "Bad food, fruit flies all over our food while we are eating.. Dirty place. Will never come again."]], "Greekfest Restaurant": [["Doug B.", "Greekfest is the best Greek restaurant in the Metropolitan area of Phoenix, hands down. We've been to them all - and we keep coming back to Greekfest on Camelback. Tony and Sue have been there forever - and there's a reason for that - the food is the best.  By the way - my wife is Greek - related to John Stamos the actor. We have eaten Greek food in Greece including her home town near Argos, and Greekfest is one of the few restaurants we've been to in the US that recreates the atmosphere and flavor of our times there. Some may find the food challenging - but that's because Tony makes it authentic - with sharp garlic tasting Skordalia and other delicacies that taste different from American food.  If you know Greek food - you will love Greekfest.Where does one start when it's all so good?  The dips, the octopus, the lamb...all excellent. The mixed dip appetizer is a work of art that includes all your favorites including dolmades to die for. My favorite is the fried smelts - which are cooked to perfection - but they are not available in every season. Everything with lamb is spectacular. The lamb meatballs have an intricate yet overwhelming taste that reminds me of that old saying...there are two kinds of people in the world, Greeks and those who want to be Greek. After tasting the meatballs, the sausage saganaki, the lamb...you'll wish you were Greek, too. Second best is eating at Greekfest Opa! Highly recommended."], ["Mike N.", "My first and only experience there was excellent. The service was exemplary - the server knew the menu, was enthusiastic about it, and assisted us in choosing our items without being pushy. The food was exceptionally prepared and tasted excellent. The tzatziki was the best I've had. Nice and thick, with cucumber and spiced well with herbs and garlic. The spanikopita was also exceptionally with fresh clean tasting spinach and delicately textured phyllo dough. The pan fried calamari reminded me of Europe, fresh tasting, delicately fried in olive oil and not in the least bit chewy. The pita bread was warm and fresh and for dessert, the baklava had a complex flavor and tasted home made. The environment was tasteful, old world European and exceptionally clean and organized. I will be back!"], ["Diana B.", "wonderful, the best greek food."], ["Aboud Y.", "We ordered in from Greekfest yesterday and I was underwhelmed.Most notably, they delivered quite possibly the worst Avgolemono soup I've ever ingested in my life.  It was pretty bad.  The rest of the food was ok but very pricey given the portions.I'm crossing them out."], ["Dennis H.", "We love Greek food and have eaten it all over the world - including Greece....  This wasn't all that impressive.  First clue should have been that the place was virtually empty on a Saturday night....  Calamari was mediocre - definitely had much better elsewhere.  We can make Tzatziki that is equivalent or better in quality.  Moussaka was a huge disappointment - dry, undercooked eggplant...  Best dish was marinated swordfish - but definitely not worth $18..."], ["Sam H.", "Loved this place! I had the calamari and came with rice and eggplant slice. Very delicious and the waiter did a great job!"], ["Bill V.", "My favorite Greek restaurant in town. A true authentic Greek bar. The owner personally greets all patrons. She is wonderful. The bar is truly Mediterranean. Don't pass up the rotisseries. They all rock."], ["Robert S.", "Christmas party at Greekfest. I had the steak and my wife had the salmon. I suppose it is possible that they were having a bad night but everything seemed nearly flavorless.None of it was good.The desert was about the only thing worth having.The atmosphere was great and the staff was helpful but they need to rework the kitchen if they want to stay in business."], ["Mitch G.", "Perhaps I was possessed.  Perhaps I was having a moment of Hellenic pride.  Maybe I wanted to feel like I was on the island of Chios smelling the marina and humming along with all the traditional anthems.  Perhaps I was hoping to break a few plates after toasting a wonderful plate of desperately sought out seafood in the desert.  I am not sure what it was that night I simply had to have Greek food. I had a dream is more than an ABBA greek tribute.  But here is my reality...Having recieved awesome directions not thanks to my Garmin which placed the restuarant to the right versus the left off 19th and Camelback, but from the owner's wife, I pulled into an empty Tuesday night parking lot about an hour and a half before closing.  Perhaps this was my very first mistake but with this economy, I realized that the place might have been hurting more than my yearning for horiatiki and tzatziki.  Still, the women's voice was alluring and authentic and promising.Enter stage left, a host.  Truly, I thought  that I was part of an elaborate prop set for what would be a Greek tragedy.  The place is certainly capable visually of transporting you to Ellada.  The place was also as barren as an off season tourist trap near Plakka.  The two other people there seemed to be regulars.I admit that I was VERY impressed with the menu.  Again promising.  I went ahead and ordered Ktopodi traditional and kalamarakia.  Homemade bread that was made the last time the restaurant was full appeared at the table with sweet butter that was also frozen at that same time.  A wine list featuring more Greek wines than anyplace else was also promising, but I knew I would have a long drive back and well, you know me and that speeding thing on Interstate 17...I digress...After waiting for almost 25 minutes, I got one tentacle of  what must have been the world's smallest octopus and that octopus was suffering from anorexia.  It was camoflauged in a sea of fava bean paste to give it a fuller appearance.  It was dry and not tasty.  To be more clear... imagine a child's finger being grilled and placed in front of you after being dehydrated.  Yea.  That is what it was like.The salad was fair.Meek, but fair.  Nothing to really yelp about.  The kalamarakia were horrid.  I think they were anything but fresh as they were laden in overly fried onions and sopping in oil with the breading stripping away.  I must have been desperate for the fruit of Poseiden to be enticed in any way to put a forkfull of this stuff in my mouth.  It was the absolute worse that I have ever experienced.  Hands down.  I am certain from the many posted accolades all over the walls of the place, that the GreekFest was indeed great.  But its day has come and gone and its legendary service and cuisine is all but a page of mythology.  I was extremely disappointed.  I am only giving two stars because the server was ok and the setting and music was so authentic.  I can only beg the Marvrides to consider a return themselves to their heritage of excellence that seems now so far away."], ["John C.", "Wonderful Greek Food offered with Excellent Service in an authentic setting, unfortunately very overpriced.  Difficult to enjoy a proper meal for under $100 for two people.  We may be back, but only on special occasions.  We'd be regulars if prices were reasonable."], ["Thais Z.", "Sooooo good! Here on business. I had the lamb and it was great. Their roasted eggplant is very good. Their rice pilaf is very good too, has some broth-iness to it. Very nice staff. Great experience!!"], ["Mark S.", "We've now been to Greekfest a half dozen times. Basically any time we go through Phoenix. The food is authentic and everything is homemade. The place is a bit pricey, say $40 per person but very good. We have had most everything on the menu by now and it's all good. As others have posted, you can't go wrong with the lamb."], ["Michael P.", "This is a truly wonderful Greek restaurant - one that my wife and I return to over and over again.  No, it's not always all that busy - but that's not because the food, the ambiance, and the service aren't terrific; I suspect that most people simply haven't yet had an opportunity to try delicious Greek cuisine.  And no, it's not fast food - it's great food.  All of the dishes are made with care, and with flair, and Tony and Susan and their staff are as gracious as they are skilled.  My wife and I love this place.  The fish, the lamb, the chicken, the appetizers and desserts - everything is fresh, and everything is superbly made.  Greekfest is truly the best!"], ["Calder G.", "We came in sorta late for a Tuesday and even though it was only us the place was great and didn't feel empty. The owner of the restaurant chatted with us for a while and so did the chef! The waiter recommended a really good Greek beer and it went well with the salad and the food was yummy. I am definitely going back"], ["Charlie G.", "Best Greek food in the whole Phoenix area!I have friends from Greece who won't eat at any other Greek restaurant in town -- ONLY Greekfest!When the natives tell me it's the absolute best, and my mouth agrees with them, who am I to argue - either with my friends or with my mouth???"], ["Christie P.", "There is a difference between authentic and antiquated and unfortunately this is the latter. The food was ok but spending HOURS on a weeknight waiting for food in an empty restaurant in the most uncomfortable chair I've ever sat in was not a pleasant experience."], ["Comtrol S.", "Food poisoning. Painful, prolonged food poisoning. I don't like you."], ["Lucia P.", "Ate there for Valentine's dinner.  Too expensive.  Portions very tiny.  No bread.  Salad was tasty enough but consisted of about two tablespoons of mixed Greek salad.---I'm not kidding.  My dish was salmon.  The fish was cold and the sauce was congealing.  Had to send it back for reheat.  My Valentine's was sword fish, which consisted of about 3 one inch square pieces. Also cold. No bread, no Pita bread.  The sword fish was about $24, and the salmon, about that much, too.  The wine list was all Greek wine, and the glasses the wine was served in were like little toy glasses, not real wine glasses.  Our waiter was kind of lackadaisical.  There were food splatters on the white wall next to the table.When a short woman made rounds about the tables to ask how we liked our food, we didn't  trust ourselves to even get started, and mumbled, \"thank you.\"  All the \"Best of Phoenix\" favorable reviews were at least 10- 20 years old.The bathroom had toilet paper stuck to the wet floor of one stall, and the toilet installed inches from the side wall in the other stall.  Weird.  There was a table with chairs outside the bathroom, like they seated overflow guests there.  Weird.We vowed never to go back, and remembered maybe that's why we hadn't been there for years.  Better to eat at Crazy Jim's or Greek Town. Save your money."], ["Don H.", "How this place stays in business I have no idea. Food is gross,  the place is empty all the time, small dishes, over priced. Service is totally crap. The parking lot  looks like a place one could get raped in. If you're handicapped you are screwed one parking space for the whole building. Pot holes everywhere, I can't believe they haven't been sued yet for the condition of the parking lot."], ["Tristan M.", "Ok.... Horrible, Horrible, Horrible. The only thing that was decent about this place was the waiter. Neither of us liked the food, and when we sent one of the dishes back, the owner comes out and to talk to us.She was very nice but clearly took offense to us sending the food back.  The decor is authentic and the atmosphere is great, however the food was not appealing to me or my partner who LOVES greek food. Lastly I would say that they are overpriced for the portions of food. (all of ours went to the dog....she wouldn't eat the stuff either!)"], ["Joseph S.", "Greekfest has something that drives it to the top of my lunch list:  friendly, warm wait staff, cook and owners who remember my name every time I go.  This is why you return to a place - it's not so much the food or the ambiance, but how you are made to feel when you walk in, and Greek Fest needs to file a patent, because they have it.  The authentic delicious Greek food is an added value.  The mousaka and youvetsi defninitely shine here, as does the curious greek salad with the peppery, sharp taste.  Don't be shy - order what the Greeks eat, and leave the gyro alone."], ["Lindsay L.", "I've been delaying this review, partially because I did not want to relive the experience and partially because the owner is so nice that I didn't want to say anything bad about her restaurant.But...My experience was horrible.I had gone to Greekfest with my parents when I was younger and I loved it. My parents had nothing nice to say, but for me it was the greatest. I was 12 years old and not paying for it, which might be the difference. It has apparently not changed in that many years.I went on a Tuesday evening with a fiend of mine for what was to be a three hour long ordeal, not because we were having a laid back, relaxing dinner, but because the restaurant could not handle being \"slammed\" on a weeknight. The truth is that there was a group (who had made a reservation) and one other table when we walked in. Even when the group had gone and we were left there all on our own, the service was horrendous.The hummus was alright, but we were charged for the accompanying pita. I thought, given the price of the entrees, the pita could have been included.I ordered the swordfish and a friend ordered lamb, I think. They were out of both. I ended up with the salmon and she had the steak. While she enjoyed her steak, I feel like I could have had better salmon in my own kitchen. It was overly spiced, and drowned in sauce. There was no taste of salmon to be found.The desert was not as great as I remembered, but they sure are pretty. We had the galatabouriko, my favorite. We also chose a fig desert, which was a little grainy.The whole ordeal came to about $90 plus tip. Usually a good tipper, I left an appallingly low tip to make a point.Occupying the only table in the restaurant, we should have had better service. Toward the end it seemed like a joke. We stared at the owner and waiter waiting for the check, and then had to wait another twenty minutes for them to pick it up before we finally went up to the front to pay ourselves.I won't be back. I won't tell other people to go.The atmosphere was nice, but they seriously need to improve the quality of the food and the service before they can charge the amount they do.The two stars I left were for my friend's meal, the physical ambiance, and nostalgia, along with my hopes that the owner will read this review and improve the restaurant."], ["Georgia R.", "Holy mackarel! I can't believe no one has reviewed Greekfest yet!!  Greekfest is the best restaurant. It's not that easy to find and you'll probably drive past it once or twice before you spot it tucked back a little ways off of Camelback road.  The thing I love about this place is how authentic it is. You feel like you're really in Greece when you eat there, not Arizona and the food is as authentic as it gets. Try the Youvetsi, Cypriot Ravioli, shrimp souvlaki, tyropites, spanakopites and the feta cheese and olives- all are delicious!  It can get a little pricey, but it will be worth every bite!"], ["Fox H.", "The decor of Greekfest was great and really gave the feeling of being in a restaurant on one of the Greek islands.  We had the Spanakopites and Arnopites for appetizers and they were wonderful.  Then for dinner we had the Ravioli dish and the stuffed chicken breast dish and they too were out of this world.  Then for dessert, we had the Baklava which is a must for any Greek restaurant and Greekfest's Baklava was really really good.  Overall we had a great experience and can't wait to go back to try other dishes on the menu."], ["Robin L.", "I actually give this place 0 stars. food-wise, our meal was alright but service was pretty slow. after dinner we ordered tiramisu for dessert. after our server brought it out, we started to eat it, expecting it to be delicious, but no! the first thing we noticed was the disgusting bitter taste and then we took a closer look at the cake. right away we realized the cake was moldy! and I don't mean a little moldy - it was chock-FULL of green mold!!! of course we had already taken a bite because we were not expecting that, so we just started spitting it out like crazy, but could not manage to get the horrible taste out of our mouths. we told our server and he did not believe it at first so we insisted the cake was moldy. he took it away and brought us a fresh tiramisu, which we no longer had an appetite for. the owner came to talk to us when he casually apologized and did not offer to compensate by reducing any part of our bill. the only thing he did for us was give us some free biscotti, which we weren't the least bit interested in. on the bill we were charged for the full meal including the dessert. obviously NEVER going there again! and from now on when dining out we ALWAYS carefully inspect our food before taking the first bite!"], ["Megan D.", "I have known about this place for years, but just went for the first time last week as a default when we discovered that the Big Fat whatchamacallit place across the street had closed. What a nice surprise. The staff was very friendly although they hovered a bit too much for my liking. The food was spectacular, and as a vegetarian I had a lot to choose from (although the menu needs some help; things marked with an asterisk are supposed to be vegetarian, but there were asterisks dotted all over fish dishes). The array of desserts was to die for. My main complaint? Pricey like woah. And it was sneaky pricey. There were three of us; our main dishes were $10-$12 each, with a $9 appetizer, 3 desserts, cocktails, etc. and the bill was over $160!!! I thought my poor boyfriend was going to crap himself.  I honestly don't know how it got that expensive. The drinks? The desserts? Were the baskets of pita $8 apiece? I mean, a Greek meal costing  more than a steak extravaganza at Cork and Cleaver? Come on. While all three of us just loved it (a rarity, as we are all differently picky), at that price, it's going to have to be reserved for special occasions. Sheesh!"]], "Olive Tree Market & Grill": [], "Good Fellas Grill": [["Chris S.", "Being from the suburbs its always hard to judge by a drive by of the store front. Inside is clean, food is spot on and everyone was friendly. The lunch crowd was all business suits and ties.We will be back for sure.The chicken was the best followed by the gyro meat."], ["Giancarlo A.", "I walked into this place looking for something healthier to eat. I was a bit skeptical at the beginning, but it's my experience that most mom and post shops have the best food, so I went with it. The staff is really cool, recommended something and like always I went with it. I can not explain how my tastebuds are right now. The experience is quite pleasing! The food! Oh the food! Excellent!! I will be here again and again. Thank you for the great food!"], ["Paul A.", "Their Kefta Kabob is delicious!   I had the three meat dinner and my friends had the chicken skewers.  All of us enjoyed the meat and the rice that was included in the dinner entree.   The dinner included soup. I had the vegetable and my friends had the lentil  soup. Both soups tasted homemade.  We shared a generous hummus appetizer with fresh pita bread that was outstanding.   It is more of a self serve and take out restaurant. You place your order at the counter and they deliver it to the table.   The prices for the larger dinners are around $13. The only thing I would improve on is putting a little more meat on the skewers.  I plan on being back."], ["Daniel L.", "Three of us came to this Greek restaurant for dinner after seeing all the great reviews on Yelp.  The interior was parsimonious with tiled floors, all around white walls, and tables that spread across the floor. As a first time visitor, the order first, and seat yourself protocol was easy to figure out. I was anticipating an extended Greek menu, but the range of choices was limited to a few kabobs, gyros, soups and salads.We started off with a bowl of complimentary Lentil Soup. The soup was semi-thick, smooth, with a full-bodied lentil texture, and a subtle kick at the finisher. It was an outstanding soup, and I was already half way full prior to our appetizer. The Hummus ($4.99) was plentiful and served with warm pita. With garlic flavor in the backdrop, the texture was assisted by olive oil drizzles and easy to pick up with the basket of pita. The Chicken Kabob ($7.99) was served with two skewers of chicken and large portion of rice. The chicken was moist but a bit saltier than expected. The rice was flavorful, but also noticeably greasy. It was an experience of quantity over quality. Service was friendly, warm, attentive, and outstanding. We were pleasantly surprised by the free homemade Baklava at the end. With many restaurants that serve Kabobs and other conventional dishes in the area, I thought they could have distinguished themselves with a more traditional home-style menu filled with hard to find options. I don't think I will be coming back any time soon."], ["Heather Y.", "Stopped in here today for lunch with my boyfriend. I ordered the chicken kebab meal and he ordered a traditional gyro meal. The counter person offered us complimentary soup while we wait, so I had the lentil soup. The soup had nice spice and well cooked green lentils. My chicken kebabs we're AMAZING! They we're very juicy and had delicious seasoning. The rice with the meal was perfectly cooked and nicely spiced. The salad was fresh, although the dressing wasn't my favorite. I sampled my boyfriend's gyro, the meat had a nice oregano flavor and was tender. The pita bread tasted homemade, which is not too common and tastes so much better than premade. They also give pita bread with a garlic dip with meals which I thought was a nice touch. We will definitely be back!"], ["Deni G.", "First visit but it won't be my last.Today, was my first visit to Good Fellas Grill, but it won't be my last .  All I have to say is you can't go wrong with any of the  menu selections at Good Fellas Grill. At Good Fellas grill you are offered a complimentary bowl of soup with your entree.  Today, I selected the chicken and potato soup and my lunch companion had the lentil soup.  Both soups were delicuous. The  chicken and potato soup is loaded with chicken and potatoes.  Both soups were very flavorful , and so satisfying. From the gyro sandwich to the chicken lettuce wrap, every entree was delicious and brusting with flavorful. On my next visit I want  to try the sautéed chicken it is served with, basmati rice, tomato slices and sweet onions and it looks delicious l.The food and service are amazing, and did I mention lunch specials start at $5.99.  So if your looking for a  great value, fresh made to order meals,  in a comfortable environment, then look no further then Good Fellas Grill."], ["Mihaela P.", "Amazing food! Very well priced! They give you a soup on the house - potato or lentil. Very impressed with that restaurant! Highly recommended!!!"], ["Connie B.", "Kefta, hummus, falafel, baklava, rice, complimentary soup all yum.      Will definitely come back."], ["Jessica O.", "We love Good Fellas!! From the moment we walked in the employee. (I assume she is the owner) treated us like family! She was so sweet and even offered us a complimentary bowl of soup while we waited for our order!! Once it came it was gone in just a few seconds! We gobbled it up! The gyros we ordered were delicious and the meat was so moist and tender!! We will definitely be making this place one of our regulars!!"], ["Yvonne G.", "Just had the following with my dining companion:1.  2 meat combo (skewered chicken & chopped meat) comes with rice, tomato, pita.     EXCELLENT. 2.  BabaGanoush---Outstanding---the star of the show3. Tabouleh--- Excellent, nice portion.4.  Spanokopita (spinach pie) That was the reason for my visit-- Unfortunately they bake it and then when you order it they fry it up.  Too much grease on it.  I had to use napkins to soak up the grease and still it tasted greasy.  So sad.  This is my favorite greek dish that I travel for-- this is why I came.  5.  Complimentary LENTIL SOUP WHICH WAS DELICIOUS!!!  ( so they made up for the less than stellar spanokopita)  Plenty of pita was provided along with garlic sauce and a spicy sauce which I think was Harissa.  Not sure but it was tasty.Positive attitude and smiles from everyone.  Very clean and Prices are very reasonable.  Will definitely be back."], ["JJ J.", "Great food and service.  The spices were just right. Had the Kafla which was hit and seasoned just right.  The wife had the chicken kabob which was moist an delicious as well.  We'll definitely come back."], ["Brian T.", "It has been *WELL* over 100 visits for me to Good Fellas Grill!  The food is *STILL* amazing!  I have yet to have a bad meal there! As someone what had literally tried everything on the menu, I can assure you the food is great!  Try something new!  If you don't like it, they will replace it for you.  Their food is high quality  (I even saw the food delivery guy order some for himself).  It's really worth the stop!"], ["Nick W.", "Holy friggin crap this food is amazing!  The guy at front counter was super nice and talked the food up for sure but when we actually got it he was not BSing us at all.I am glad I know about this place now.  I will be a frequent flyer here!"], ["Jaspreet K.", "Friendly staff, free soup on the house, delicious fresh food, plenty vegetarian options, clean place, spacious seating, great prices and fast service- these are the reasons I love this place and keep coming back. Unfortunately, I never bothered looking at their vegetarian options and always kept ordering the falafel sandwich until somebody mentioned their menu on the right wall is all vegetarian. They have some good options, try the stuffed mushrooms or potato cakes. Both are delicious but my personal fav is the mushrooms, it's called boorak. If you're getting take out, they still offer soup while you're waiting."], ["Kat D.", "This place was spectacular. the lunch special came with soup and a drink. I was in love with the gyro. You can have it on a plate or in a pita. I love trying new food and this place did not disappoint. The guy working the register gave us the remote control and we sat there for a good 45 mins watching sports and local news. I just loved this whole experience."], ["Kathryn L.", "What a GREAT meal!  The food is fantastic - we got the potato soup, lentil soup, French Fries, the 2 meat combo, 3 meat combo and baklava - absolutely everything was fresh, delicious and satisfying!  The portion sizes were great, and the prices were so reasonable for the amount of food you get!! Also, the atmosphere was just so pleasant, and the owner, Nino, even took time to come over to ask how everything was. Fantastic little place that has just jumped to the top of our favorite Greek/Med. food places!"], ["Samantha L.", "I am being messaged by the owner to remove the review which I think violates yelps policy. He says they do monthly sprays. Great. But I still saw a roach & my review is my opinion."], ["H B.", "Excellent food and excellent, friendly service. The owner was awesome. The chicken is soooooooooo yummy! No complaints at all on anything."], ["Jane O.", "Possibly one of the most spacious Mediterranean places I've ever been!! The decor is contemporary, it's clean and well kept. When you first walk in, it's confusing as to whether or not it's a sit down and order type of place. You don't though, you order at the counter and then sit. You get a bowl of complimentary soup in either lentil or chicken and rice. They bring your food to your table for you. We both got the vegetarian platter, which I thought were amazing. Darrin thought that the falafel didn't have as much flavor as most other places we go, but I thought they were perfect!!! I also think most other places falafel is overly salty! You also get hummus, baba ghanouj, salad, and two other things that I can't remember what they were called... They were delicious though!!! The staff were very polite and answered all of our questions for us as well as some suggestions if you don't know what you want. We will definitely be back again!!"], ["Jennifer L.", "You cannot beat the everyday lunch special for $5.99Not just a weekday special either! 3 meats, rice, salad, pita bread with garlic sauce and a bowl of lentil or potato soup. Food is excellent.  Restaurant is clean and service is good."], ["Erinn D.", "Delicious potato soup and tender chicken! We loved everything. Our new fave Mediterranean place."], ["Sebashtzen R.", "The soups were very good. The meat platter was wonderful. The salad dressing was amazing. We are so going back! Just wish they had a waiter/waitress."], ["Scott D.", "My favorite item at the Good Fellas Grill is the Steak Shish Kabob. The meat is always perfectly cooked to medium temperature and very tasty. I take the meat off of the Shish Kabob and eat it with the rice. I don't know what kind of rice that they use, but it's really delicious. Their hummus is great and a perfect appetizer before diner. I also love the potato soup that is given out for free by Ninos, the owner of Good Fellas Grill.Last time I was in Ninos had me cracking up as he was explaining how to say his name to my dinner companions (we were there for about 90 minutes). He touches his knee and says \"Knee\" and then touches his nose and says \"noes\"(not a typo). Knee Noes. That little skit was worth the price of admission. Everybody that I bring here loves the food. His prices are fair and the food is fabulous."], ["Kelsey S.", "Absolutely the best Greek food in Arizona!  This hole in the wall is a hidden gem or shall I say diamond.  Service is outstanding.  I had the hummus appetizer and the three meat entrée. So much flavor and TLC in every bite.  To top it all off you get a starter bowl of soup free. I had the chicken curry which was amazing. I will try lentil next time.  Love this place and will surely spread the word and return!"], ["Tatiana Y.", "Pretty clean & friendly place! Large portions & ordered to your choice. Enjoyed this place !!! Much much better that fast food. This place in between fast food and restaurant . Definitely I would recommend."], ["william r.", "Went back and ordered same thing and order was fine. Portions good and reflected price as appropriate. I hope the kitchen crew didn't get an ass-chew due to my review, but the output was week, reference my earlier reviewOwner was gracious in his reply to me and offered me free dinner; but i don't take freebies like 47% of the country, so while gesture was nice, I work and prefer to pay for things i order. Sorry, Republican here = no handouts.Most likely won't come back as there are other options N and NW side, but I do appreciate the owner's positive response."], ["Candida B.", "I have been coming here since their opening day 3 years ago. We usually order take out but when we feel like an extra treat, we dine in for the full experience. Ninos (the owner) is always in such a great mood, friendly and welcoming - you can tell he takes pride in his food and customer service.My husband always orders the gyro pita with fries, but tonight he ordered it will the Greek salad. Delicious as usual. We had some hummus and pita, and it such a large amount for the price - I have plenty leftover for lunch tomorrow.I ordered the 2 meat combo (served with rice, tomatoes and onions), and while the chicken was tender and flavorful as usual, the Kafta (seasoned ground beef) really  knocked it out of the park. So tender, and seasoned wonderfully. I will definitely get that again. The rice is consistently cooked well - fluffy and light, and so flavorful.The best part of the dining in experience, is that Ninos usually let's us sample his daily soups. Tonight, there were 2 soups - Lentil soup, and Potato soup.  They each had such unique flavor, absolutely delicious.  The potato soup had a nice kick to it on the back end. I love supporting local businesses, and this is one of my favorites. So happy to have Good Fellas Grill in my neighborhood. Do yourself a favor and experience this awesome food. Super family-friendly, great value, and fresh, flavorful food. We love it!"], ["Nathan C.", "The owner and his family are by far the nicest people you will ever meet. My mother and I try to eat here as often as we can because the food is AMAZING and the portions are huge. We always order the hummus, chicken lettuce wraps, and the three meat combo plate. I also have to order extra of their garlic sauce which is completely out of this world (best sauce EVER!). Oh and I can't forget to mention how delicious their complementary lintel soup is (uhhhhhhh it's to die for!) Lol! I definitely recommend this place. AMAZING FOOD AND AMAZING SERVICE!"], ["Evita L.", "Ordered lunch to go. It was really good. I had the gyros and fries. The meat was tender and the tzatiki sauce was delicious! Service was friendly and quick. I will definitely be going back whenever I crave tasty and economically friendly gyros :)"], ["Sue B.", "Excellent ! First time there and already planning my next visit . Grilled to perfection, DELICIOUS !"], ["Ryan C.", "Since my last review update, SUPERB SERVICE, has been the number one reason I keep going back over and over and over and over again.That does not discount the DELICIOUS FOOD made with QUALITY INGREDIENTS, least of which is genuine LOVE for serving their customers.Ninos has added numerous menu items to try, and even though I am a loyal fan of the chicken sandwich on garlic bread and the 2 meat plattter, everything else tried has been worth the venturing away from my favorites. I know of at least two customers that are in the restaurant EVERY TIME my brother and I stop in, and after initiating conversation found out that they are there LITERALLY EVERY DAY (one gentleman sometimes comes TWICE the same day, lunch and dinner). Yes! There is enough variety to sustain this kind of obsession! Several times I have gone two days in a row, myself, or dinner one night and lunch the next day.You will not find better food or service at any equivalent place. Sounds like hyperbole, but it's true!"], ["Michele D.", "By far one of the best middle eastern restaurants in town! It reminds me of my family's home cooking!  Hummus-amazing! Potato soup-I could drink it! Veggie plate is so savory and fulfilling, and baklava melts in your mouth!   Assyrian food!"], ["Linda W.", "I was excited when I saw Good Fellas Grill catering our staff meeting lunch last Friday. We had few trays of seasoned ground beef, marinated chicken, vegetarian dishes, and salad. Food was outstanding as always, so well prepared and delicious. I usually get the gyros and the meat platters when I dined in.  Their ground beef packed with enormous flavor. They sure loaded up on the rice in each tray.  We had plenty of leftovers to take home.  No cooking for a day or two = happy face! ;)"], ["Loren S.", "If you haven't been here you need to do yourself a justice and eat here. The chicken is perfectly marinated and cooked to excellence, literally melts in your mouth. The beef is tender juicy and coked to perfection. Hummus and pita is excellent. I have been searching for a place like this for a while. Not to mention nenose(not sure that's how you spell it) is the nicest guy you will ever meet. Treats his customers like friends and is a genuinely happy great guy. I highly recommend this place"], ["Joann M.", "This place is a hidden gem.  A friend and I made our first vist last week and were delighted. Food is fabulous, prices are reasonable and Nino, the owner, made us feel right at home. The place nothing fancy but very clean.  We tried the lunch special, which consisted of three meats, (chicken, gyros & Kafta), rice, and a salad. At $5.99 it was a bargin plus Nino gave us complimentary bowls of soup because we were first time customers.   Everything was delicious.  It was so good that my friend got another order to take home for dinner.  We also enjoyed a piece of baklava;for desert. It was very high quality - we could taste the butter.  Just thinking abour it is making my mouth water!"], ["Lorenzo R.", "Lunch special....gyros, kafta, marinated chicken, small salad and lentil soup for 5.99.  Everything was fresh made to order and very good.  You cannot beat that price.  the other gyro place in the old circle k parking lot on union hills is not as good and more expensive."], ["Deana H.", "I had to go into goodfellas after all the positive reviews and gotta say it's freaking good! Right when I opened that door I got excited..I got that good marination fresh authentic smell. I love Mediterranean/Greek food that's what I grew up eating and I gotta say this place is the closest I ve had or tried that comes to my mothers food or that's not from east coast.  We were welcomed by a younger man and and he was very sweet/helpful/knowledgeable abt his menu.. We ordered I took his recommendation which was very very good!! he brought us soup on the house which was impressive and good!! That is so little but such a nice homey touch that u don't find too many places these days then got our sandwiches they were steaming hot and fresh and the spice taste marination were spot on so I started stuffing my face then I thought ok if their hummus is good they know what's up so I went and ordered it (after I was seating/eating already) that's how excited I was that I finally found a Mediterranean place!! Got it and yup just like my mamas lol enough said point being u gotta try this restaurant if ur looking for amazing authentic Mediterranean food. Can't wait to eat here again."], ["Teresa S.", "I read all the good reviews for this place so I thought I would give it a try.My friend lives close, so I said I will meet you there.To see it, you would never think ,oh this place will be great.It is in a strange shopping center. Right next to Chino Bandito,or something like that. Though I must try that place one day as well.When you walk in it smells divine!My friend was already there and had ordered an Ice Tea.She ended up getting the Chicken lettuce wraps, and I the Gryo dish,which is on a bed of fantastic rice.We each got the chicken Potato soup. Oh my gosh, everything was fantastic! Plus we even got pita bread and they were nice enough to give me hot tea,even though it is not on the menu.I even got 2 Baklava's to go. Which we had for dessert that night.So glad I read the reviews or I never would of known about this place.It is very clean as well, with nice clean rest rooms and lots of parking."], ["Crystal E.", "The food is delicious and the owners make sure you are satisfied! I highly suggest the kabob chicken- yum!"], ["Jes W.", "Wraps were terrific, as was the two meat plate and the soups were outstanding! AND the service was friendly, not obnoxiously so, just genuinely friendly."]], "Greektown": [["Lee R.", "Awesome food and George is hilarious.  Try the greek spaghetti or anything lamb and you will be in for a treat."], ["Rebecca B.", "Amazing Greek food. Calamari is the best! George is a sweetheart and makes it entertaining."], ["Danielle B.", "I never write reviews but had to for George. The service is the best around and the food matches. Authentic Greek food and every time I come in I want to stop at the appetizers (calamari is his specialty but the mushrooms are my favorite) but keep going because the gyros are my favorite in town! If you're in the area be sure to stop by."], ["Suan R.", "I went to this place when I lived in Phoenix in the 80's and I went back on a recent visit. Great food and George is so accommodating. I will always eat here when I am in Phoenix."], ["Michelle A.", "So this is one of those times when I don't know if I should rate this 3 or 4.  The food here is still absolutley, melt in your mouth REAL Greek food.  The spicy lamb and chicken breast stuffed with spinach and feta combo was outstanding.  Accompanied with the red Greek wine, egg lemon soup, Greek salad, hot garlic toast AND hot pita bread.  Amazing.  And affordable.  But here's the rub.  The owner, George, didn't remember us.  That was fine.  But, he was the only server tonight and was totally distracted, all business, not his old friendly, chatty self that always added to the charm of this gem.  We tried to engage him in conversation but he wanted no part of it.  He wasn't busy.  There was only one other table occupied in the whole place.  But maybe that was the problem.  We don't understand why this place isn't packed all the time.  You couldn't ask for more authentic, delectable food and great prices.  Maybe it's the location, maybe it's his attitude.  But it's definitely not the food."], ["Jim B.", "Our group of six arrived with high hopes based on previous yelp reviews.Yes, the menus were tossed onto the table. That was not an issue and was expected. Also, George was in good humor and we enjoyed his wit.The non-lamb dishes were pretty good. No complaints. However both lamb dishes had the same issues:1. small meal2. more bone than meat3. tough meat4. a more or less empty plate.My plate was lamb served over a very small amount of rice with gravy. It had one bone cut to the same shape as the meat. Vivien's plate was lamb served with gravy. It had two bones cut to the same size as the meat."], ["Jane B.", "Had to a long wait for our table & service is a bit slow but we weren't in a hurry. Once they seat you & take your order the service flows nicely. This is a family restaurant and they are all very friendly- as if to welcome us in their home and share their culture with us. Price and portion of food are reasonable. The kids loved it. We tried the Saganaki Flambeau, which is a great way to start off. They have you say \"opa\" before you can eat it & the while restaurant will say it with you. One kiddo had the Tortillini with meat sauce & the other a Charbroiled Chicken Ceasar's Salad. My husband had a cheese lasagna and I had the chicken gyro. All of it very delicious. They only have 3 desserts but I love baclava so the desert menu hit high marks. They only have Lager beer, which I'm more of the Ale or mild beers but boy was their beer refresh in and smooth - I forgot the name of it (it starts with an \"A\"). They also have a house wine for $4 a glass. George made the kids a blue sprite drink he calls, Windex. This was my first time eating here but definitely not the last. We found this place when watching \"Check Please\" which is great to watch - it gives you ideas of yummy places to eat, all over Arizona. It's also a great way to support the local, small, family owned businesses. We watch it religiously & visit the places they air on their show. Whoever picked this restaurant did a great job."], ["Phx C.", "Food was fine but I refuse to go back. Owner is arrogant and downright rude!  George got my order wrong, because he doesn't write anything down, and when I told him about it he had the audacity to tell me that I didn't order what I thought I ordered!   Are you kidding me??!!  No, thanks!"], ["John A.", "The best Greek food I have ever eaten. I have unfortunately driven past this place for the last year. Definitely a new favorite!"], ["Robert W.", "What a find.  Great place.  Very clean, food is amazing, and the owner George was great.  He was by himself since we arrived at 2 and lunch ends at three.  So he was server cook and bar tender.  He did a great job, with a smile in tacked.  Calamari was great, although I would have sliced it thinner(personnel preference).  We were in an unfamiliar area and found a gem.  We will be back."], ["Ed Y.", "Not sure if Friday nights are usually as crowded as this particular night, but we ended up waiting 35 minutes for them to set a table up for a party of 9, when we were told that it would be \"about 10-15 minutes\".  The food was average.  For Greek food, we usually go to Crazy Jim's on 15th Ave and Indian School, which is awesome, but doesn't have much room for large parties.  The owner (I think) was very friendly and worked very hard, but we could not get over the mediocrity of the food.  The tow stars that I'm giving it are for the following; 1) cheesecake baklava (OUTSTANDING!!!) and 2) the friendly man who served us.  Other than that, we won't be returning."], ["Melissa M.", "Excellent food, service, dessert, ect... I am so happy we discovered this place! The owner was really personable and we enjoyed talking with him. I would highly recommend giving this place a try! I will definitely be back!!"], ["Irma G.", "LOVE! I don't understand how a lot of people don't know about this place! Great service, magnificent food!"], ["Bill K.", "Best calamari. George has does a pan fried calamari that you have yo try. George is George and the restaurant would just be another restaurant without him. Relax, have a drink and some fun with him.  The food is so good that we over ordered and could have easily made a meal out of the the appetizers. The hot garlic toast AND hot pita bread are the best ever! I kidded George about his chewy pancakes (the pita) and he was delighted. Tried a Greek beer and it was to hoppy for my taste, guess I am just an American beer kind of guy. The food id good enough to bring you back and George is personal enough to keep you coming back."], ["Kier P.", "Hope you have all night to wait for someone to come and take your order. After 1 1/2 hours of waiting we left. Service is non existent----is the owner really to cheap to hire a waiter? We went to pita jungle and got served immediately."], ["Frank K.", "Excellent food - amazing calamari!Great service.    Our family enjoyed the meal from start to finish.   Thank you."], ["Isaac B.", "Greektown serves some of the best Greek food in Phoenix. The uniquely Greek atmosphere and delicious food (Chargrilled chicken gyro is my personal favorite) make this a great lunch spot.  The pita bread is easily the best I've ever had. Definitely recommend this spot to anyone who likes all things Greek."], ["James C.", "Just based on the looks of things at Greektown I would have left the building if I weren't with a coworker. It is definitely in need of a upgrade/remodel. I think there was only one person working at the time or maybe a chef in the back as well he was extremely nice. I ordered the gyro plate and it came with a Greek salad. I have only been to a couple Greek places but the meat here was mediocre compared to my past experiences. That was the first Greek salad that I have ever had. It was good but it didn't blow me away. For dessert we shared a baklava cheesecake. That was the best part of the meal. It was a really rich so I would recommend sharing. A few bites of it will definitely satisfy your sweet tooth."], ["Jace W.", "Was looking for a neighborhood local eatery. Was in the mood for Greek food. Found this place. It was exactly what I was looking for. Relaxed, quaint, traditional family owned spot. Great food. Started with a Greek beer,  ordered the Greek meat sauce pasta and added chicken as was recommended by George. George was great. He basically guided me through my dinning experience.  Salad was crisp and dressed well. Pita bread is awesome!! Entree was great, very solid. Again, George  recommended the baklava cheesecake, wow. Can go toe to toe with the butter cake at drinkwaters... That is saying a lot. Over all very very solid. This is a great family owned authentic Greek restaurant!!"], ["Steve C.", "My wife and I love this place.  I don't care that the building's a thousand years old.  I don't care that it was decorated in 1972.  I think George is friendly, funny, and interesting.  But, I do see where some would find him intrusive and overbearing.The food is awesome.  The calamari is one of the best I've ever had.  The best meals I've had are when I just ask George what's good today and tell him to bring it on.  Yep, don't order anything.  Just let him know what courses you want and let him craft a meal for you.  Except for the calamari, definitely order that."]], "Eden's Grill Inn": [], "AZ Kabob House": [["Armin A.", "The best Persian restaurant in Phoenix Good foodsGood customer service and friendly staffI love the decoration I ordered beef soluta I best kabob ever"], ["Will B.", "I've been a big fan of Persian food lately. How is it, that it's only recently that I've come to enjoy it? I've only had one visit at AZ Kabob so far and was hesitant to write a review based on that one visit, but that visit was enough to lead me to believe that I've found myself a new favorite place. I first heard of AZ Kabob by skimming through Yelp for nearby restaurants. Thank you Yelpers! AZ Kabob had 92 reviews at the time with an average of 4-1/2 stars. A convincing rating! It was easy to locate it using the Google Maps app on my phone. Thank you modern technology! I walked in and was greeted with a very clean, modern layout. I already had a good idea of what I wanted to order prior to visiting and that was the Combination Platter, which included 1 skewer each of chicken, lamb, Koobideh (ground beef), and fillet. I was given the option of a side of rice or salad or half of each. I chose half of each. The dish also comes with warm, soft pita bread and rice. I ordered it as take-out and only had to wait somewhere between 5 to 10 minutes. I was also the only patron there at the time so that helps with the speed of preparation. I had the privilege of keeping this aromatic pleasure in my car with windows shut as I drove home. Needless to say I was very excited to experience the dish when I got home.AZ Kabob House is only the second Persian restaurant I've been to ever and the rice in both restaurants have had the best rice I've every had. This comes from someone whose been eating rice since probably since I was a baby. The rice is very fluffy. It looks like they add saffron and butter. All four skewers were so tender, warm, and full of flavor. I loved soaking up the juices at the bottom of the container and enjoyed 4 different flavors and textures of meat. The Combination Platter is supposed to feed 3 to 4 people. I would say that's accurate, but it was so good that I probably ate for two people. The only part of the dish that survived before the day was over was the salad. I'm definitely going to come back and am excited to try all the other dishes!"], ["Ali B.", "Well this was not what I expected from AZ Kabob house! Very pleasantly surprised! I was thinking it was going to be like skewers, the other Mediterranean place that used to be there, but it was definitely better!I loved the setup, the tables and lamps are adorable. Has a cool rustic feel which I am totally into. I did notice it smelled a tad funky when I went in there though. Not terrible but a bit off. Same with the bathrooms, except that smelled strongly of bleach. My only real complaint.Lady working at the counter was awesome. She picked up on the fact that I'm a vegetarian and gave me suggestions. She recommended the pomegranate walnut stew which sounded great but I had just had a bunch of pomegranate at lunch so I decided maybe next time I would try it. I wanted to try a little bit of everything so I got the appetizer platter. It came with hummus, pita, vegetables, dolmas, and falafel. The hummus and falafel were the big winners here, but I totally could have used some tzatziki to dip the falafel in. I will for sure order some next time. The falafel had a good crisp texture and yummy flavor. The hummus was smooth and tasted excellent with everything on the platter. Pita bread was tasty too! I wasn't a huge fan of the dolmas and I totally burned my tongue on one which was annoying haha. My mom got a chicken skewer and loved it. I tried the rice it came with and it was very yummy! Also the prices here are not bad at all for a good quantity of food that is good quality. Can't wait to come back! Neither can my mom!"], ["I G.", "First thought walking in was I'll be coming back here just based off the clean and modern atmosphere, everything looks prestige. Service was also just as impressive. I was craving some fesenjuan and to my surprise it was on the menu. Pricing is also very reasonable and Fresh Baklava to boot."], ["Fatima T.", "The owners/ workers are the nicest people ever! They are so hospitable, the Resteraunt is always clean and very refreshing and bright to walk in. The chicken kabob, kobideh and the stews are to die for. I come here weekly and sometimes twice a week. I am so happy to have found this gem near my home and recommend anyone I know this is the best quality and freshest middle eastern food. Fatima :)"], ["Riyad K.", "Ate here on a whim before a movie (had a chicken gyro) - was blown away by the chicken (moist, cooked perfectly) and tzatziki - was also surprised how much I liked the pickle on the gyro.Anyway, ended up hiring them to cater a 20 person party we were having a few weeks later, cost per-person was *very* reasonable and working with them to more or less order their entire menu was a breeze... along the lines of \"I want A, B, C, D... you know what, I just want a sampling of everything.\" -- they figured out amounts.I was VERY skeptical that they would be able to make that volume of food and still have it taste as good as it did for the two of us... what a fantastic surprise when I was wrong.The owner delivered 2 mobile warmers full of trays of food an hour before the party and for no extra charge let me keep the warmers because it would \"make the food taste much better if you aren't going to eat for a while\" (I dropped them off the next morning).We had at least 6 people come up to us and comment how amazing the food way - we saw many guests go back for 2nds and some even go back for 3rds.All of the meat was spot on; chicken was moist and tasteful, the filet was tender and truly filet - not some lower quality meat with a lot of connective tissue in it - it was honest to god, tender filet meat (I've cooked enough steak in my life to watch for these kinds of things).The kebabs were juicy and bursting with flavor and the salmon kebabs ended up being one of the party favorites - they are spiced and booked perfectly, the salmon almost flakes apart if you push on it a little bit.The tzatziki was the star of the show - fantastic taste. Rice was spot on as well (not soggy, not under cooked... just perfect amount of chew).The baklava was fine, but I'm biased... I make the world's best baklava (hint: it requires enough butter to kill a small family) but given how biased I am, I thought it was good enough to order a tray from them and not make it myself so that counts for something.Besides eating here again, we fully expect to use them again to cater other events in the future. You guys knocked it out of the park, thank you!"], ["Karla P.", "Absolutely delicious food! Every time I come to this place, I know I will be well taken care of and the food will always be a hit! I've never had a bad experience and I highly recommend it to anyone with a craving for quality food made with the best ingredients. The owner is wonderful as well and they make the best baklava!"], ["Kira R.", "This place was a treasure in a corner. I had the beef entree from the recommendation of Arman. I got half rice and half salad and there was plenty of food and came with a half of a pita. I would definitely recommend and will return."], ["Katie K.", "Very trendy little Mediterranean restaurant in north Scottsdale. After two visits, I'm ready to say that I love their chicken kabob. Very tender and oh-so-flavorful. The roasted tomato and side salad are great. The barberry rice adds tartness to the meal, and I don't think I could go back to the plain rice now. The tzatziki was fresh and a generous serving. However, it came with only one pita (cut into 4 pieces). I'm not sure if you're supposed to ask for more, but it definitely wasn't enough pita bread for the dip, and whether or not extra pitas were available on request was not posted on the menu. The lamb kabob was tender as well, and the gyro meat platter was another good choice. I would definitely recommend this place for lunch or dinner, and it's a convenient fast casual choice if you are headed to a movie."], ["Lauren W.", "First time to this place. I came based on Yelp reviews! I loved my gyro plate. Very flavorful and a generous portion. I requested the half salad, half rice side. I personally did not care for the rice..I would rather have a double Greek salad for my side. The dressing is unbelievable. Overall, all of the food is so fresh. We got a hummus app. The pita is so fresh. My only complaint would be the hummus. It thought it lacked flavor. I would not get it again. Great job with the atmosphere and customer service!"], ["Ike B.", "This place rocks! First time here. Had the boneless chicken kabob with half rice and salad. The dressing is on the side and is really good. The chicken had a pleasant mild flavor, pita warm and soft and rice was great and not overly seasoned. Basically a very non threatening meal and be sure to use your Yelp check in discount on the Yelp phone app.**Update**Well, as you can see from my check-ins I am hooked on this place.  I come every week &  always get a quality meal.  They have online ordering as well.  Love putting their hot sauce on everything, give it a try!"], ["Abbawe 1 O.", "Great food. The atmosphere is pleasing and the environment is quiet and clean. The food is clean and very tasty. We had the Salmon Kabob - highly recommend it."], ["Shawn R.", "I have been to Persian restaurants all over the world and they have the best salad Shirazi of anywhere! Truly authentic. Their barg was also great!  A real find!!!"], ["Sara J.", "Had the gyro platter.. Said saffron rice.. But was just white with a couple of sprinkles of saffron .. I would t be calling this saffron rice. Gyro meat was great .. Will go back just won't get rice"], ["Namaste J.", "The Salmon kabob is perfectly prepared, perfect amount of spices and saltiness, clean food, not greasy and flavorful. Highly recommend for good, healthy and tasteful meal."], ["Ken F.", "Fairly new spot in this area. Very clean nicely decorated restaurant. All of the food looked excellent. I got the gyros platter with half rice and Greek salad. Nice sized portions and everything was made to order. fresh ingredients made with care."], ["Pepper T.", "This is a small fast/casual middle east style eatery with very stylish decor. You order at the counter and seat yourself. I had the barberry rice and chicken. The white meat chicken was juicy and I liked the char taste on the chicken. The long grain rice was very fluffy and was studded with very tart barberries. The barberries were interesting I never had them before. The portion of the entrees are very large and they do give you a large portion of meat. You also get a pat of butter with the rice and sumac is on the table. We also shared the falafel appetizer. The falafels are very large and are not the crispy kind and are more of a meatball texture and are tasty.The girl at the counter was friendly and helpful.This restaurant is located across the street in that big shopping center from the Whole Foods on Mayo Blvd."], ["Linda H.", "I ordered the chicken shawarma sandwich and the lamp shanks with hummus, my pita was burnt, dry old cooked chicken and it came with \"Greek salad\" nothing Greek about it, no feta and awful dressing, my hummus was tasteless and the lamp shank was very small what they charge for it.. Won't be back!"], ["George J.", "No AZ Kabob is simply delicious in every aspect. Let me start by saying that the staff was very friendly I got even greeted by the chef which was nice. The atmosphere is great! Very comfortable seating with a warm and comforting environment, made me feel right at home. The food was exploding with flavor. I even told myself that this is on par with some of the high end Persian restaurants. I had the Gyro Platter and the Gyros was very tender and juicy with a lot of flavor. The rice was extremely enjoyable to take in and the Tzatziki sauce was hands down the best I have ever tasted. Will definitely come back and bring my whole family to enjoy a meal from here and even think about having them cater for an event as well. 5 stars all the way!"], ["Richard K.", "I have had a lot of Middle Eastern food and this place is one of the best. Excellent, fresh, flavorful food. Very nice, comfortable ambiance. Independent business, run by the owner. Highly recommended."]], "Al-Hana": [["Codey F.", "I spent 9 months in the middle east and fell in love with street shawarmas.. Ive recently moved back to the Valley and my cravings started so I went on a hunt... after trying a few spots out I finally found (for now) the closest thing to a street shawarma.. this thing might even be better as the ingredients are much fresher than a shawarma made in the slums of Bahrain.. they wrap it the way its supposed to (ive noticed a lot of places around here are turning them into sandwiches) and the chicken is thin enough to be crispy but it is still juicy and the veggies are fresh and crunchy.. I believe they even had cucumber chunks in there.. dont forget to stop in the back and get the best Baklava known to man.. good job guys!!!"], ["Rand H.", "Enjoyed another little UYE here today, joined by Robyn N., Jackie R. and Mike C.  This time I went with the 4-Piece Chicken Plate, which brought out half a chicken, rice, pitas, garlic spread, diced tomatoes, diced pickles, lettuce plus whatever else I'm forgetting.  It all added up to a big, delicious feast for a very reasonable price!     :-))4-Piece Chicken Plate:  $7.99Mango Lassi:  $1.29Note:  No water is served so bring your own if you don't want to buy a bottle of something to drink.  Also $10 minimum to use credit or debit card.  (Cafe + groceries mix ok as long as you pay all at once.)"], ["Blu T.", "I have been going to Baiz for a while now. My mother introduced me to the store. I usually get like 15 bags of the freshly baked pita bread. And I always hit up the Backlawa counter. I have tried everything back there. They have the best Backlawa I have had in PHX period. I then go to the cooler and get 2-3 different flavors of Aziza soda. Baiz is the only middle eastern store/rest I have been to in AZ to carry authentic middle eastern sodas. These sodas go so well with the food and are absolutely gourmet. As I do my shopping I am usually waiting on my food from the rest. I usually get the shish kabob plate. Today they accidentally gave me lamb kabob. It was very good. However I prefer the shish kabob. The food at al-Hana rest is absolutely delicious. I mean authentic to the core. I am pushed to say the  Middle East may have (some of) the best tasting food. And Baiz does it better than right. Middle eastern food is good anyway. However, Baiz gives you excellence. I will say one thing though..I have had many experiences unfortunately of bad customer service. Mainly from the Mexicans working in the rest, and even some of the middle eastern girls. I have made several complaints. Some of The staff have been very rude. I've even resorted to wearing a hijab once to fit in. Middle eastern girl at counter Still rude. However the owner is truly a nice man. Your experience there does depend on who is working for the day."], ["Paul J.", "It's inside Baiz market. I got the lamb kabob plate it's only  $8.99. It comes with great hummus, onion, pickle, tomatoes, and a amazing yellow Jasmine rice. Two pitas come as a side. You can bring your own bottle of water or buy one here. Chicken has been dry a few times so I only order it in a sand which which has a sauce on it. If you like to travel take a look around the market and it will make you feel like you are in a distant land. I love the candies and butcher shop area. It's another world!"], ["Scott D.", "I visited Al-Hana for the first time today for an Unofficial Yelp Event with Rand H., Robyn N., Mike C., Jackie C. and the other Jon H. I enjoyed some great Hummus and Pita Bread plus my main course of Lamb Kafta for $8.99 and a can of soda for $.099; this meal set me back $10.75 today.Prior to arriving, I perused some reviews and the menu. Pro Tip - this place is not located in the ghetto as some reviewers have mentioned. I did not have to use any of my martial arts training to get into and out of the restaurant. There was decent parking at about 11:10 when I got there. As I'm writing this review 4 hours later, I can tell you that I'm still stuffed. I really enjoyed my food along with conversations with my awesome lunch companions. Thanks to Rand for \"inviting\" me. I probably would have not tried this place otherwise."], ["Jay M.", "I was looking forward to some good Middle Eastern food when I went to Al-Hana and did not have a good experience.  Maybe the food used to be better, but it was not good when I went.I ordered the Chicken Shawerma, and it was not good at all.  The chicken was over cooked and cut into little tiny pieces (mistake number one chef).  It was over salted and was not seasoned well at all (lot's of cury).  The rice was very very greasy???  Why would you want your rice to be greasy and your chicken dry?  The pita was fine, but that was out of a bag.I didn't come here for the ambiance, and this in no way is reflective of my review, as I almost exclusively review on food quality and service standards.  But, there was a guy sitting next to me who kicked off his shoes and sat indian style with the bottoms of his gross dirty feet staring up at me.  When his food arrives he starts ripping apart his chicken legs with his hands and mixing them with his rice and lettuce and whatever else was on his plate.  Then he starts eating with his hands, shoveling the meat and rice mixture in his mouth a handful at a time.  Witnessing this did nothing to help my experience; but again, this is just what I experienced and not a reason for my rating of this restaurant.I love Middle Eastern food and I hope this establishment can turn it around, as I want everyone to succeed if they work hard at something.  However, currently I would not recommend this restaurant to anyone."], ["Haneen O.", "Ordered some tabouli and hummus, both delicious. Comes with pita bread which was a nice surprise. I was able to order, get in line and pay for my groceries, and waited a few minutes before my food was ready. It spilled a bit in the bag, but that may be from the drive home. It was busy too, which is good to see. That means people enjoy the food."], ["Shannon M.", "I used to love you, Al-Hana.  I have fond memories of enjoying good food and good company while sitting at your little wobbly tables and chairs.  I fell in love with your babaghannuj.  Yes, you had a lot going for you.I was disappointed, but kept coming back, when you decided to raise the price on Every Single Item I Like, while making all of the portions smaller.  I understood that you have to pay for those new glossy menus with the pretty pictures somehow even though I liked the old menu board with the plastic letters just fine, thanks.  I settled for slow and sometimes surly service from your staff.  Why?  Because I loved you. Well, I think our one-sided relationship has come to an end.  That last visit - you know, the one where you gave our food to another customer (uh, you were confused?), and left us waiting for over 35 minutes without an apology while fulfilling orders for people who arrived and ordered much much later?  That will be my last one.  I especially will cherish the charming way in which the 'manager' grudgingly provided a refund for the food I never received.  \"Do you want to return the water as well?\"  Um, no.  Since I had to get it out of the cooler myself, I actually received that portion of what I ordered.  Thanks.Keep your rising prices and shrinking portions.  You are no longer worth my affection."], ["Ji P.", "I used to come here all the time and it seemed like they had way more business before when they took phone orders for pick up.  They said they no longer do phone orders because people dont pick up. So why not take credit cards over the phone to ensure payment? If they dont show up then they charge the card...simple as that.  So now i have to go through the trouble of waiting 15 minutes for a to go order?"], ["Kat K.", "It was alright. After reading reviews, I expected better. Restaurant is located inside a really cool market, so spend some extra time looking around. The produce and meat is worth a trip back.You order at the counter and the girl who took our order repeated some special instructions, but they were either not written down for the kitchen or the cook just ignored them. After waiting for the food, we just decided to pick out what we didn't like rather than return the item.You have to get your drinks from a cooler. There's more than the one near the counter, so look around if you don't see what you like.The menu is pretty standard middle eastern fair. I got a chicken shawarma sandwich. It was okay. The hummus was good. The pita a bit flat and dried out for my taste.Prices were good.A word on the neighborhood. Yes, it's not your typical trendy location and there's a lot of poverty around, but that can be said for a lot of neighborhoods in the Phoenix metro area. I've been afraid in some South Scottsdale places and there are some areas in North Phoenix that are down right nasty.Part of the charm of places like Al-Hana is where you find them. It's those immigrant, ethnic places that you know are authentic and have yet to be stamped with watered down big box culture. I guess if you're not up for an eating adventure, there's got to be an Olive Garden holding a booth in your name!"], ["Gantry Y.", "This deli/cafe is excellent.  In my opinion, the most authentic place in town.  It's located inside of Baiz Market.  The pita is fresh, the shawarma is cooked on a rotiserie.  No complaints with the quality of food.However, you will have to put up with some chaos.  They do not take orders in an orderly manner.  You just stand near the counter and eask the patrons \"are you waiting to order or waiting for food\"  There is no line.What is worse is the parking lot situation.  It is too small for the volume that they do.  So people make up parking spaces or wait for someone to leave.  The last two times I was their there were minor accidents in the parking lot.They are supposed to be opening a new Baiz Market on Dobson/Baseline.  This needs to happen sooner rather than later.  They have out grown their old location."], ["Darlene H.", "Not sure what happened to this place over the years. Customer service has gradually gone down and they no longer take phone orders for to go food. But if you order the Shish kafta, they warn you its at least a 15 minute wait.....so you're forced to wait amongst the sea of annoyed and somehow always angry customers. The food is good and fairly priced, which is the only thing that brings me back every once in a while."], ["Ursula D.", "----------------CASH Preferred.  Credit Card -- $10 minimum---------------This is important if you're a single as most things on the menu are less than $10.     This place does not have filtered water or even water from a tap.  So, don't forget to grab your drink and pay for it with your food.  I didn't realize I could not get a cup of water when I ordered/paid for my food, so I ended up drinking a bottle of warm water in my car when I was done eating.  Meh.This restaurant is down a street I would never drive down.  Most people would probably never pass this store in their commute to any place in the Valley.  The restaurant itself is located inside of a middle eastern (maybe Islamic/Kosher/?? as there are no pork products in this store) grocery store.  You will not see the name \"Al-Hana\" on the outside when you drive up, so don't be confused.I had lunch here last week with the Yelper lunch UYE group with Rand H. I tried their chicken schwarma and the fatoosh.  Both tasted very good to me.  I thought the chicken was over cooked, but the flavor was still there and exceptionally good.  The fun part about eating here is exploring the grocery store and standing out like a sore thumb.  I loved checking out all the products.  The herbs and spices you find in whole foods for astronomical prices are not so expensive in there.I would love to go back and try this place, when I have cash on me.  I hope the 2nd time is the charm!----------------CASH Preferred.  Credit Card -- $10 minimum---------------"], ["Tasha T.", "This little restaurant is amazing.  As authentic as it gets (as far as I know).  With cheap prices and traditional food, you cannot go wrong.  Chicken Shwarmas, babaganoush, hummus, falafel, pies, and kabobs are delicious.Baklava from the bakery area is amazing as well.I do suggest covering up your shoulders and wearing pants, as there are a lot of Muslims who frequent the store and restaurant.  I felt uncomfortable wearing shorts and a tank my first visit (which was during the summer) but it was my mistake."], ["Karim M.", "Really good stuff. Authentic. Wide variety of food on offer. The staff is small so sometimes they can get really busy and you see the staff working really hard right there. The restaurant makes the knefah dessert right there so it's fresh (and good) - very few restaurants make their own."], ["Alexander C.", "The City of Angles, Los Angles, has to be one of my favorite foodie destinations. Pretty much every food trend over the past 5 years or so has its epicenter in LA. From Korean style frozen yogurt to cupcakes and now food trucks, the people of LA know a good thing when they taste it. While all of these trends have some how made their way to the Valley of the Sun, there's one thing that I've never been able to find here, garlic sauce like the one that's served at the LA institution Zankou Chicken.  If you've heard of Zankou and its amazing Lebanese chicken and tangy fluffy garlic sauce you know exactly what I mean when I say it's ethereal. For those who've never tried it either pack an overnight bag and head to LA or drive down to 20th Street and Van Buren to Al-Hana inside of Baiz market, its the closest thing to Zankou Chicken in Phoenix and its close location makes it even better.The area located around Baiz Market might seem a little rough around the edges but the market itself is clean, well lit and packed with all sorts of interesting Middle Eastern grocery items from dairy and fresh produce to meat and hookah paraphernalia. Tucked in the corner of the market is Al-Hana, a postage stamp sized restaurant specializing in, you guessed it Middle Eastern cooking. While the offerings might seem typical the flavors are bold and shouldn't be missed. The creamy roasted eggplant dip Babaghannuj ($4.49) had a smokiness usually not found in many other places. Al-Hana leaves their version thick and chunky with just the right amount of olive oil drizzled over the top. Ordering the Falafel Plate ($5.99) will get you 6 deep fried cumin scented pucks of ground chickpeas and fava beans. Pile a couple of these onto a freshly baked pita, slather with tahini and enjoy the crunch. Id also highly recommend the Labneh Pie ($2.99) which is filled with labneh, a Lebanese cream cheese, onions and tomatoes all baked in a light tender crust. The main dish for me was of course the Whole Roasted Chicken ($9.99). It comes with pita, pickles and garlic sauce. The chicken itself is so well seasoned and juicy it would seem like a crime to adorn it with anything until you get some garlic sauce on it. The texture is light and fluffy, almost like a garlicky mayonnaise. After one taste you might ask them for another container, seriously delicious. After a wonderful meal you'd think there wouldn't be enough room left for desert, but my rule is there's always room. With that I sauntered to the back of Baiz Market where their in store bakery is located, most of the case filled delights are around $2 each including a flaky syrup soaked baklava. While I love LA, knowing that I don't have to drive 300 miles to get my garlic sauce fix makes the drive across town all the tastier. Al-Hana inside Baiz MarketOpen Daily"], ["Evan B.", "Holy price increases value man! We knew something was up when the faithful menu board was down, there are new glossy printed menus, with new higher prices to match. The falafel is now 4.49 up from 2.99 a 50% increase. Most other items went up by $1 to $1.50For that price the falafel is rather small and does not include any sides.I still like the overall quality and taste of the food but the value factor bottomed out with this one move.One a positive note we finally found a can of hummus on the grocery side that is good, and the fresh bags of pita are still .99 so you can still have a ton of pita and humus for $2.50 or less."], ["Jeremy P.", "Lebanese food is one of my favorite cuisines.  Having heard about this combined market/restaurant, and seen it on Howard Seftel's list of top Middle Eastern restaurants in Phoenix, I decided to check this place out.  I couldn't decide whether it sounded more like a Haji Baba or Cafe Istanbul type place.Upon entering the facility, it became clear that this place is much more market than the aforementioned establishments.  It's basically a grocery store, with a little corner cordoned off for the restaurant.  There is no table service; you order at the counter.  The menu consists of appetizers, salads, pies (I may have to venture into this territory; it's something Cafe Istanbul and Haji Baba don't have), plates, and sandwiches.I was disappointed to find that they don't have lamb tongue, and that they were out of soujouk and ma'anek.  I went with the lamb sandwich, which didn't have the lamb in kabab form like you would expect, but rather as a ground-up kafta type of consistency.The sandwiches weren't huge, but I will say, that lamb was nicely flavored.  And my dining companion mentioned that the beef shawarma was pretty tasty as well.  The food really is pretty good.Cafe Istanbul still has this place beat.  This is true when it comes to food, but even more so when it comes to ambiance.  But it's nice that there is a respectable place to get Middle Eastern food in downtown Phoenix."], ["Michael A.", "Little no frills cafe integrated with a small international market. Had the chicken shawarma which turned out to be excellent. Could be better with the addition of some side dishes but for those who want a small light inexpensive hot lunch this isn't a bad little gem."], ["James N.", "Food in this place is alright and it is a little overpriced compare to other MiddleEaster eateries.I ordered Lamb Kebob sandwich. It tasted alright not something I will ever order again. It had only three small  pieces lamb and the rest was vegetable. I won't eat here again that is for sure. I rather do the drive and go to Haji Baba"], ["P. M.", "This place is great. Hummus was awesome. Just a great all around place for Middle Eastern. The market is great too. Great to pass the time looking around while you wait for your food"], ["Tim J.", "Rather than continuing to repeat what is said in the other reviews, if you like Middle Eastern food, you'll love Al-Hana.It is fresh - made on the spot with Halal meats and fresh produce, the breads, wraps and pies all made from scratch and cooked there.It is inexpensive - the little pies start at 69 cents and most of the sandwiches are under $5. You can easily feed two for about $10.And it is good - all the fresh, homemade ingredients really come through in the flavors and textures, tasty meat, warm bread, crisp, fresh produce.I am definitely going to make eating at Al-Hana a habit. It sure beats the alternative of corporate chain restaurants, processed ingredients and assembly line packaged food."], ["Christine J.", "I tend to forget about Middle Eastern food when I'm considering my dining options, but I have to thank Jason W - who invited me to try this little lunch spot in the Baiz Market - for reminding me of how satisfying and delicious (and in this case, affordable!) it can be. I met him and some other Yelpers to sample some of Al-Hana's wares and while there were a few strike-outs (specifically, the hummus, which didn't have enough garlic or lemon, and the tabloulleh, which had way too much parsley), the falafel sandwich, shwarma beef and chicken sandwiches (both with garlic sauce), and cheese pies were all so flavorful! And at $2.99 and $3.99 for the sandwiches and $.50 - $3.99 for the other sides, the lunch was also incredibly affordable. If you are ever in the area or work or live nearby, you should definitely check Al-Hana out. Given how affordable it is, you can have a savory and enjoyable lunch that really fills you up. If you have time after you finish eating, definitely take a few minutes to walk around the market - there are some real deals on Mediterranean staples, like 2-lb bags of dates for $3.99! One final note - there is a $10 minimum for debit/credit card usage, so bring cash."], ["Brian T.", "What a gem!!!! I tried this place for the first time yesterday, and we ended up going back again today!!! The Chicken Schwarma sandwiches are awesome. The hummus is great, and the Chicken Tahook with garlic sauce is going to be the death of me (in a good way)  The food is in expensive (we paid 15 bucks for a chicken tahook plate (great chicken skewers served with pickles, hummus, pita and garlic sauce) a chicken schwarma sandwich, a small lamb meat pie, small cheese pie and a large spinach pie. Needless to say I\"m speaking from a bread coma right now, but it's well worth it!! Do yourself a favor, this place is great!"], ["M P.", "Came with my hubby and a friend, we ordered two entrees and hummus to share.  Chicken Kofta sandwich (aka pita wrap)  was awesome.  It's rare to find ground meat - even chicken - that doesn't taste like it's bathed in oil and fat.  This had great spiced flavor and tasted fresh and light.  Not crazy about the garlic sauce (it's clumpy and a little bland...tastes almost like regular butter to me), so I just dipped mine strait into the hummus instead. Yum!!Prices were reasonable. 5 dollar wrap, and 4 for a \"small\" side of hummus that's more than enough to share.  Will definitely be coming back to try the falafel and take a look around the market.  (We took a peek at the deli while waiting for our food, and the fresh lamb looked outstanding!)And IMO the surrounding neighborhood doesn't seem that sketchy to me.  Across the street from a park and some apartments that look pretty well-kept and clean.  I'm rolling my eyes big-time at some of the previous reviewers, here..."], ["Chris P.", "Good food and inexpensive.  The market is worth walking through while you wait."], ["Matt S.", "I feel a little funny granting five stars, since that kind of rave implies everyone will love Al Hana - and I dont think that's true.  It helps to leave one's Scottsdale or Camelback corridor preconceptions in the parking lot, in order to find treasure within the area blight, and indeed, within the gray, dreary walls of Baiz Market. If you approach Al Hana with a traveler's sense of wonder, however, this establishment is very cool.  The market is fascinating, especially the tiny bakery and butcher area in the back. The restaurant is more of a simple counter, no frills and limited menu, but rates an objective five stars based on food quality, value and service.  Delicious, cheap, and the young lady who helped us was very nice.  I dont need a sorbet course to give it five stars. Maybe it's different during lunch hour, but at 5:30pm we were the only Anglos in this fairly large neighborhood facility.  Many women in hijabs and abayas.  Young men of varied Middle Eastern persuasion. In most respects, it felt like a market half way around the world.  Iraq or Jordan maybe.  Not every Arizonan's cup of tea, perhaps, but for foodophiles and the culturally curious, definitely recommended."], ["Lindsey B.", "i have to admit that i am a fan of haji-baba's falafel. a big fan. a big, huge fan. that being said, this was not haji-baba's falafel sandwich. it was slightly dry, had floursecent pink pickles (i think they were pickles) and the falafel balls were mushy - not crispy on the outside. based on other reviewers' recommendations, i ordered a side of garlic sauce. it was definitely garlicky and good, though the mayo-like consistency was a little bizarre. the pita bread was good and hummus delicious. despite this, my craving for falafel went unsatisfied."], ["Robert M.", "This place has excellent shawarmas for a low price of $3.99.  I go here almost weekly and they are consistently good.  They have a $10 minimum for debit so bring cash.  Also, the store that they are connected to, Baiz Market, carries hookah supplies.  Phoenix needs more places like this."], ["Wendy R.", "Wow! During a bi-annual allergy induced laryngitis, I went in search for my favorite tea- dry desert lime. Apparently, I am the only one in PHX who knows it because no one is carrying it this year. Next best thing? Find dried limes. This quest led me to Biaz Market. The neighborhood it is in is rough, but it's more poverty than unsafe. The parking lot, though, was full. Walking in I decided to spend some time wandering the aisles. Within 30 seconds I was blown away. They have rose water and orange blossom water for 99 cents! The only place I had found it before sells it for $4! Fresh produce, cheeses, meats. Fresh herbs that I can't find elsewhere for only 89 cents! What? Am I dreaming? An entire aisle of spices- so many that I missed my limes I originally came here for. The very, very nice employee didn't just tell me what aisle, she walked me straight to it and when I commented about a ground version, she helped me search for that. Dolmas in cans and jars for under $3 (and they're freaking delicious!). Pita bread 50 cents. So much yummy stuff priced so well. We don't often get such gems of ethnicity in Phoenix, but this hidden treasure made me feel sooooooo good on a sick day. I can't wait to go back and try the restaurant, buy more groceries and test my cooking skills, and get get my fix of the world abroad without having to buts out the bones for an international flight."], ["candice s.", "What is the hype people????I went here for lunch after seeing all the awesome  reviews, but I was disappointed. First, the menu is very hard to understand (see the pic that someone posted). I ordered the chicken shwarma sandwich and hummus platter. There isn't much of a drink selection in the tiny fridge. For soda, all they had was the cans and they charged $1.00 for them. Later, while I was eating I noticed a lot of people were buying their drinks from the market, then coming over to order their food (pain in the ass if you ask me). Anyhow, so I was only 1 of a few people there and the food took quite a while. When they finally called my order I went up and asked for the \"garlic sauce\" that I heard so much about on here and the lady said it would cost $1.00. I said nevermind because I wasn't going to pay that for a small container of condiment! I was surprised at how small the sandwich was. It wasn't  impressive either. Just a grilled flatbread with a few pieces of  chicken, a few tomato slices, lettuce, and a little sauce. In my opinion this wasn't worth 3.99, but more worth 2.50 or something because of its size and how little filling there was.The hummus was good, but  nothing spectacular. This place is also in a dodgy part of town right across from project housing...literally right across the street. The market was pretty cool though and I'll prob return (during the daylight of course) for some olives, olive oil, and pita. BUT will skip out on dining here."]], "Fattoush Restaurant": [["Kazi A.", "I know my middle eastern food. I eat and sleep Kabobs!Being indian with a middle eastern background and culture. The food sucks. No I don't own a restaurant. I love my food.Slow service, bad food, poor food prepping.I didnt get sick but the food was not tasty at all"], ["Mike C.", "Had lunch here with Robyn,Rand,and Norm .We all ordered the mixed grill platter wich consists of chicken kabab,kafta and gyro slices.when the food arrived it was missing the gyro slices and after short argument over the gyro slices they decided to give them to us(they are on the menu and on the picture on the sandwich board out front) there should have been no question about it,its not something new to the menu.Anyway they were really greasy and not that good anyway.I did like the kafta it was very good as well as the rice. The chicken kabab was ok and the pita bread and hummas was good I also liked the garlic sauce.So I ask myself , would I return , well the answer is no. So 2 stars for Fattoush."], ["George D.", "Great food, friendly service and a good value.I had dinner here recently and the four of us shared a Kings Table combo.  It was delicious, fresh and served with a smile."], ["Jill C.", "I've never had falafel from anywhere but P.J and H.B (in Tempe) before, but when a friend of mine wanted to meet me for lunch here on Monday, I jumped at the chance to try a new place. I ordered the falafel pita (of course) and a choice of soup or salad came with the meal.  I opted for the salad.  Both the salad and falafel were tasty.   Price for my meal - Under $6 My only gripe is when I was asked what I wanted to drink after I sat down.  Our food came out, and yet I was still without a beverage.  So, I asked again for a glass of water.  Finally 5 minutes later, she brought me a glass.  Other than the beverage oversight, everything was great."], ["Holly W.", "AWESOME.  Their grape leaves (although meatless) were some of the best I've ever had.  We also had the lamb kabobs with rice, hummus, tabouleh and lentil soup.  This will be our new staple place to go!"], ["Francesca H.", "I love their hummus, but the fattoush itself left my teeth hurting for days! I couldn't bite down on much after that. This last time I went, I had the falafel and spinach pocket. I don't know what it is about their phyllo but it has a strange texture to bite down on. It's not awesomely crispy. The falafel itself was yummy! I do wish, however, that they had romaine and tomatoes on the sandwich rather than iceberg.Overall, it's good - some dishes even amazing! - definitely give their world-ending hummus and baba ghannoush a shot."], ["Brian T.", "What a gem! I've driven by this several times and read some great reviews about the place and finally decided to check it out. And man am I happy! We did the king's feast, which was supposed to be for 2 people but ended up feeding two children as well as my wife and I. It was $25 for Chicken kebab, Kafta kebab, gyro, rice, hummus, babbaganoush, falafel, dolma, spinach pies, meat pies and salad or soup. The only thing I didn' t like was the spinach pie, everything else was great. My favorite was the kafta kebab, although it did taste exactly like a good meatloaf (which I like, but not sure it's what I expected). We also ordered these little chicken rolls with garlic sauce that were great. All total, I think we spent $33 and had a terrific meal. Can't wait to go back and try some of the other dishes on the menu!!"], ["Nick D.", "I started going to Fattoush in high school, and I continue to return 4 years later.  The food is very good, and the servers take care of you very well. I can't remember the last time I went there and didn't get an appetizer or dessert for free.  The Turkish coffee is excellent, as is the Baklava.  The chicken gyro for lunch is both inexpensive, and excellent. I highly recommend this place.  The location is shady, but in my opinion it adds to the experience. This place is the definition of a \"hole in the wall.\"The only thing keeping this place from receiving 5 stars is the fact that it can occasionally be inconsistent.  The Lintel soup can range from amazing to average.  However, don't let that keep you from coming as you're sure to enjoy a unique experience, along with some really good food."], ["Rochelle W.", "Had such high expectations after reading the reviews! The food is mediocre at best and out of a can at worst. I had the mixed vegetarian plate (my standard to get an idea of the food at any new middle eastern place) and C got the gyro sandwich. The grape leaves were absolutely out of a can (and microwaved to the point of scalding) and I'm guessing the same applies for the hummus and baba. Gyro meat was not fresh sliced off of a spit - it was totally uniform slices, all the same exact shape that had probably been microwaved. Clearly out of a package and not of the spit. The falafal was ok but not seasoned well enough. If you're looking for authentic mid eastern fare - find another place to eat."], ["stephanie a.", "Chicken Sharwarma is amazing!!  I get the chx sharwarma sand, it's in a pita--and hummus on the side.Very cool small joint, family run, enough said.  Very good food!"], ["Andrew V.", "The lentil soup is the star of this restaurant.  I wish they sold it by the gallon.You could say Fattoush is kind of a hole in the wall, which I appreciate in an ethnic restaurant.  The decor is eclectic and seems to embody the spirit of the family owners.  If you expect fancy you may be disappointed, but if you expect a delicious meal at a fair price you'll be headed back for more.Tonight I had the Chicken Shawarma sandwich (seasoned and served in a pita with tomatoes, pickles, and sauce) which, served with soup or salad at $6.95, was a steal.  And the tiny cup of Turkish coffee was just right.The service is good and definitely very friendly. Fattoush fits right in on that magical stretch of 19th Ave. between Indian School and Camelback, among so many great diverse food spots."], ["Melissa H.", "Love mom and pop restaurants.  The food is really great. Service can be slow but its totally worth it.  Have not had anything bad on the menu.  If you're not sure what you want, try just a simple pita.  It's inexpensive and filling.  Save room for baklava!"], ["Kewal K.", "I have to give Fattoush 4 stars because their baba ghanouj is, by far, the best I've ever had.  It is fabulous.I like everything I've tried there.  Great options for vegetarians and meat eaters as well.  The lentil soup is yummy, the tabsy, even the french fries...haven't yet found something I didn't like and we've tried all the veg. options.  A really nice addition is the garlic sauce - we love that stuff.It is true that the atmosphere is...not so impressive.  But I actually like that - I like that it is laid back and casual.  And the people there are very sweet and friendly.Prices are decent as well.  One caution: we always call before we go to verify their hours for that day because there have been several times they have been closed unexpectedly.  But we enjoy it enough to take that extra step!"], ["Holly M.", "Great menu. I had never had middle eastern food and this was a great first experience. I had the Chicken kisara. EXCELLENT We were on a fast time frame for lunch in between meetings and using Yelp with previous reviews, we choose Fattoush, reviews & location where driving forces. I will definitely be back and more adventurous with each visit."], ["Jill D.", "I've been here twice and I can assure you it will not be my last time. Had lunch today and it was yummy and the service was particularly nice. I got the gyro and lentil soup and the fiance got the chicken shawarma, lentil soup, and a side salad (the Fattoosh salad). It was all really good but I think the chicken shawarma was the winner. The lentil soup is also amazing with a bit of squeezed lemon and pepper. I could eat it all day long. Also, the prices can't be beat. Super duper deal."], ["Jim D.", "Had lunch here about a week ago.   I was the only person there at 11:30 but soon folks started showing up for take out.  I ordered a fallafel sandwich and salad.  Both were incredibly fresh and tasty.  Casual atmosphere.  Friendly service.  Great prices.  Great place to eat.  I will go back!"], ["Brooke S.", "Good little family owned restaurant. Friendly service with solid middle eastern food. The leg of lamb was very good. Also, there is a great Uzbek grocery store next door."], ["Catherine H.", "Amazing mix of excellent food and a lil culture.  I do enjoy the little unique places you have to dig for, especially if its a family run location.  The baba ganoush, and dolmas were perfect.  I'm a huge fan.  Will definately return, I have so many things to try now ;)"], ["Julie P.", "Finally made my way to Fattoush and I have to say \"mmm mmmm good!\" Not since my old neighbor, a refugee from Iraq, moved out have I had I experienced such robust flavors combined with healthy food. Lord I miss that man!!!So yeah there isn't much of an atmosphere, the pictures don't really fit in the molding that was hung to frame art, but does that effect the food? Absolutely not! Physically, not much has changed since this place was the Green Leaf Cafe which was the predecessor to the Persian Garden. Except that the food here is less on the fusion side of Mediterranean flavors and more middle-eastern authentic Iraqis with a little Jordanian thrown in.I love that you start out with the green lentil soup or salad with every meal. The name of the restaurant actually comes from said salad, which is a mix of romaine, tomatoes, cucumber, mint and toasted triangles of pita bread, covered with a tart balsamic vinegar dressing. But the soup is where it's at. It's unlike your average lentil soup - smooth and creamy, with bits of pasta. Very mild. It's a nice homey touch which is really what this food is all about. And that homey touch comes naturally, as the two main staffers are brother and sister. Their mom often helps out in the kitchen (and dad is busy cooking in Scottsdale).When we arrived there were just two tables with guests, so we had our pick of eating spots. And there were a steady stream of people coming in for take-out throughout our visit. The menu is actually quite large considering their kitchen is about the size of my bathroom. On this visit, my sis and I decided to sample as much as we could to get a feel for the place. She was a little iffy as she had never had this kind of food, but once the dishes started rolling out, she quickly became a fan. We started with the fava beans, mixed with olive oil, garlic, and lemon. Main courses consisted of the Falafel Plate which comes with warm pita, hummus, pickles, and tomatoes and Chicken Shwarmas which were spiced perfectly and had juicy - dare I say succulent chicken. We topped the meal off with some freshly made baklava and rolled our way out to the car for our trip home.Just after the soup course, a large Ford taxi pulled up and out of it piled out 8 full grown (some more fully grown if you get my drift, than others) ME men. It was sort of like the proverbial clown car... I mean seriously I didn't know you could get that many men in one car. They headed straight for the table next to us and then things really started to pick up. Four of them ordered Lamb Kuzi and the rest all got something different. Let me just say that my sister had to hold me down because their food all looked so good. Their table was literally crammed full of dishes with smells so good that I swear my nose grew just trying to get a better whiff!Our meal came to $25  but in retrospect, we really didn't need all three dishes and could have easily gotten out of there for about $16. Service was attentive, food was phenomenal (and healthy - how often do you find that?!!), and it's only .5 miles from my house. This is probably the best ME food that I've had at a local restaurant and the place would definately warrant the coveted 5-stars on the food alone, but the afore mentioned atmosphere knocks it down one. It may have taken me years to get over to Fattoush, but it won't be long before my next visit! That Kuzi is calling me!!!"], ["Melissa B.", "I used to work at a Lebanese restaurant/bar for years.  And...I'm from Michigan which gives me a fair position to judge Middle Eastern food, as Michigan is crawling with homemade pita and baba to die for..This place is not about gyros or belly dancers, it's a real deal Middle Eastern deli.  I agree fully with the average 4 star rating losing one star ONLY for lack of atmosphere.  But, if you are craving falafel, warm pita, hummus, or chicken schwarma for lunch than this is your place.  Nothing on the menu will disappoint!"]], "ZK Grill": [["Emily K.", "Good food, friendly service, clean. Will come back. Very big portions. I had the chicken and steak meal which was delicious, my husband had the lamb which was also delicious. We found it with Groupon. Decor leaves something to be desired, but again, it was clean and friendly."], ["C K.", "I have been buying food at this place over the past 2 years. I am not sure whether owner has been changed or they want to save cost. I noticed that they had cut their meat portion significantly 2 weeks ago. I always ordered ghormeh sabzi and gyros wrap. I thought maybe the chef has done some kind of mistakes and gave only a few pieces of meat for each dish. Therefore, I have gone back again this week. Same thing had happened. For Ghormeh Sabzi, 3 pieces of small beef cube And rice which cost $9.99 before tax. For gyros wrap, 5 small pieces of gyro meat which cost $7.99 before tax.We will stop going to this place from now onwards as it is not value for the money that we paid.I just found out that this place was name Zaytoon Kabob Bistro. And previously ghormeh sabzi only price at $8.99 with more meat served. Now meat portion has been cut down and price has been increased."], ["Milton K.", "If for no other reason, the service provided by the lady at lunch was enough. She could not have been nicer or more friendly to everyone.  I went on a recommendation to try the LAMB special.  It was very good, but I would have liked it better if it was 2 shanks instead of 1 and less rice and vegetables. But that's just me! The salad's at the next table looked excellent and I might just go again to try one."], ["John B.", "Fantastic food, staff is great and friendly.  Lamb is outstanding, beef sublime, rice extra special, and desserts were much better than expected.  Gives Persian Room a rival that they will struggle to beat for the price.  Possible new hang out."], ["Prasanjit T.", "Had the chicken entree and the falafal wrap. Food is great, but I felt the meat portion was a bit less. Didn't like the ambience of the place though. If you are looking for some good Mediterranean food and don't want to spend much then this is the place for you."], ["Trish B.", "We've eaten here now a few times and each time I have asked the person taking orders what is good (different person each time) and I have ordered their recommendation.  3 for 3 so far!  Each item I have ordered has been delicious.  Today I tried the Barberry Rice with Chicken.  Super flavor, tender rice, loved the dried berries sprinkled on top.  Definitely a do-again!  This place is a small spot in a strip mall off Tatum and Greenway and isn't anything fancy but the prices are reasonable and the quality is high and the food is quite healthy."], ["Steve S.", "This restaurant is one of my son's favorites.  We usually order the filet and chicken combo with rice and salad for $13.99.  Delicious meal, plenty of food for the two of us and a great value.  Cannot prepare something this healthy for the price.  We frequent this restaurant often."], ["Shawn F.", "Yummy :) we got Thursday special and number 19 which is the chicken plate , very delicious :) I always enjoy ZK food :) thank for the good costumer service"], ["Mohammad A.", "Great food, you won't regret trying it.If you love Iranian (Persian) food its the place to be.I like the \"Ground beef\" and \"Falafel Wrap\" the prices are great comparing to other Iranian restaurants."], ["Nichole L.", "Generally I'm always 100% satisfied with my take out orders but tonight it was awful.  I ordered a #14 and there was no side dressing with a minimum amount of dressing already on it. I also ordered a hummus appetizer which came with 1 pita bread. Dropped the ball tonight and disappointed."], ["Suzanne M.", "Local recommendation, we loved the food and reasonable!  Plenty to eat.  Order at counter then take a seat.  Clean and very friendly.  Lamb was delicious and so was the ground beef kabob.  Will be back"], ["Omar S.", "Delicious food for great value. Service is prompt and would recommend it if you like Mediterranean."], ["Andy R.", "I was looking for something different for dinner and the \"fresh grill\" sign caught my attention. I absolutely love middle eastern cooking so was excited to see this place. This is a fast food restaurant however the food is cooked fresh to order. I decided to go with the gyro plate with rice and salad. In about 10 minutes, I was served this very generous plate of tons of gyro meat, tzatziki sauce, hot seasoned fluffy white rice and salad. Everything was absolutely delicious. Service was warm and friendly. I will definitely be back."], ["Danny L.", "ZK Grill is one of my favorite Persian food around.  The food is great.  My favorite is the filet.  My kids love it also.  The staff is always very nice.  We love going here."], ["S R.", "TERRIBLE!!!!! Service was a joke. As soon as she found out I had a groupon she could care less to help. She flat out lied about the \"homemade\" bottled italian dressing and never once came over and asked if we needed anything, wanted anything or anything else. HELLO!!!! arent you the one who needs business???? And beside all of that, the food was marginal. I've had better. I will never go back, not even for FREE food."], ["Ali H.", "Cardioloogists might as well co brand with them to offer discounts. The grease in the grilled items is extreme! I think maybe I have been spolied by oter Persian Restaurants.I think the spices are a little weak, and they are really not using the most quality ingrediients. Its not horrible by any means. I have a 2 year old that coming home one night said: \"Daddy, kababs please for yummy!\" So we decided to try it.He had a few bites, and looked at me and said \"Other kababs\" referring to our other Persian resturant in town, and then asked for his milk. The rice wasnt bad. Nice and fluffy but instead of adding butter to the rice we got they simply provided us a packet of butter on top of the rice.For the same price as a lunch at a full service restaurant,. you can get a full dinner but its a far cry from their Persian competitiion. Its basically a no frillls fast casual place. OK meal but not really one I am going to crave too often."], ["Kaori M.", "Yum!  I really enjoy this place.  Especially when you can find it on Groupons makes it even better.  It is what it is... fast casual type of food so don't go there thinking your going to some fancy restaurant.  The prices are good, the amount of food you get is good and they are consistently... Good."], ["Lizeth M.", "This place is so fresh and so green green!!! :)   I loved my chicken wrap, to bad their so close to my official work place or else I would eat this over Jimmy John's and Subway any day!! This time I was luckily around the area getting training done at another work location nearby this little bad boy!!  How lucky was I, I had heard of this place from an old classmate from Tempe, he used to work here and also had invited me over to try some of their goodness, plus the prices are affordable and understandable to their selections!! I truly loved the flavors in my wrap, so full and bold, I was satisfied and still feeling healthy in the end!! Way to go ZK Bistro!!!!!! You rock!!! :) I look forward to coming here more often!!"], ["Rez A.", "Great quality , fresh Persian food , great kababs!  The chef here knows how to make every dish on their menu perfect."], ["Rob D.", "Gone way down recently. Sunday night 6:30, tried to order takeout on the phone, they said machine down cant order, call back in a few minutes. So I called 5 more times while I drove there. On the 5th call I finally got through, same response machine broke. So I show up and order ( only 3 workers two cooks and a very young cashier). So he writes order on scrap of paper (why couldn't he do this over the phone) and asks if I can pay in cash ( cause the machine is down) so now I am waiting, what do I do, write this review. My 3rd visit here in 2014 the other 2 would have been rated only 3 of 5.  Like I said they have gone way down recently."]], "Athens Bar & Grill": [["Evan W.", "This place is a midtown hidden gem. No idea how we haven't found it before, but we will most certainly be back! Excellent food, service and venue. Wonderful experience! Top food pick: house salad with signature Mediterranean dressing. Phenomenal."], ["Josh A.", "A hilarious endeavor in the Greek experience.While the dirty floors, tables, and walls are a nice touch to add a third world feel, I'm pretty sure the health inspector wouldn't appreciate the attempt.The hummus tastes like an old divorce and the tzaziki is runny and depressing.But at least the AC is broken and it's hot and muggy, just like a summer day in the Eastern Mediterranean Sea."], ["Jennifer O.", "It's always a little uncomfortable to be the naysayer in a sea of ... yay... sayers? Heh. Anyway, I think maybe the problem is that I came to Athens for dinner... on a weekend... and this place is more like a lunch place possibly. The place was completely empty, which maybe should have been a warning. My friend and I had decided to come here because we could get food and it was also a bar ( hence the name bar and grill). Well, the bar is more like the bar one would have in their home... there are a few bottles of alcohol there, but a bar that does not make. So cocktails were (sadly) not had. We did, against our better judgment, get some food. I had a chicken pita and we shared some greek fries. The fries were alright, just fries with some feta on top essentially. I know the owner ( or whoever was there) made them fresh, so that was a plus. The pita was fairly lackluster. The sauce on it was flavorless and the chicken was underseasoned. It wasn't bad, but it wasn't something I would want to eat again either. Besides the mediocre food, we were very disappointed by the lackluster service. Like I said, we were the only ones there, but we waited a long time for any drink refills and for our check. The guy who works there (or owns the place) was sitting at his little desk by the kitchen ignoring us most of the time, which I totally get, since having one table is probably excruciatingly boring, but being that they decided to be open for dinner, they should treat it like it's actually business hours. I probably won't be back."], ["Natalie T.", "Very awesome experience eating here tonight.   The owner Tomas was a delight to talk to,  and the food was wonderful.   We'll definitely be back again!"], ["Rina H.", "I had previously came into this restaurant once two years ago and didn't eat here because the workers were not welcoming. I had been given a deal to try this place so I decided to give them another chance. I walk in and was not greeted by anyone even tho the workers were sitting down by the minibar I immediately realized their terrible customer service, which is probably why they are resorting to deals to attempt to boost customers. Well I hope the business is reading this because if your business sucks it doesn't matter how many deals you put out there, people will come once and then never return. The waitress did not take responsibility for her actions and kept blaming each situation she couldn't accommodate on \"him\" which I'm assuming is her boss. \"Can I get some lemon with my water\" \"sorry HE is out of lemons\" \"can I take this to go?\" \"Sorry HE said you can't\" etc. I found that rather weird. I asked for a gyro plate for here and a chicken plate to go and was told \"he\" can't pack one to go so I said that was fine I'll just get both for here and take the leftovers. (Same thing) well I found it rather strange that you are a restaurant with no to go boxes... Then after a few minutes they said \"they were willing to pack it to go and make an exception\". Like all of a sudden to go boxes magically appeared! Well I didn't wanna piss them off anymore so I said no it's fine I'll get both plates for here and take the leftovers like they wanted. Some other minor things that added up were that I asked for a fork and knife and she only gave me a fork, and I asked for no onions on my plates in which there were obvious pieces of onions on the plate. This place just crawls with bad things. I highly suggest DO NOT COME HERE!! Service sucks and food is not good enough to ignore that!This is the strangest restaurant ive ever ate at. I don't understand their practices and don't trust their owner or food after giving this restaurant two chances. This place makes me feel extremely uncomfortable and unwelcomed. The food was ok and definitely not tasty enough for me to return. The gyro meat was too salty and the chicken meat was flavorless. And I'm not just saying that because the service here sucks."], ["Pablo M.", "Great gyros, the cook/owner is very friendly and will accomodate to you within reason. I prefer my gyros without lettuce and extra onion, he always says \"you got it, buddy!\" The food is always tasty and the meat is perfectly spiced. I highly recommended this place.I have only gotten things to go, the dining room itself is spacious, clean and a luxurious feel to it.  They have Karaoke according to signage."], ["Matt H.", "Great Food... Just had the Gyro combo and one of the best Gyros I've ever had. Definitely recommend this place!"], ["Noor B.", "Reallllllllly good. Definitely enjoyed my meal here.Gyro is yummy with a reasonable price and some nice options if you don't want to get fries and a drink (like double meat at an extra charge). Chicken shawarma is served on a bed of fluffy rice. Definitely enjoyed it. Baklava - awesome. So delicious.Location can be hard to find, but it's a good, solid gyro shop in Central Phoenix. I will be back."], ["Carmen L.", "My co-worker and I tried this lil joint today for the first time. The ambiance... amazingly charming. Food was great. I am definitely a fan. I tried their greek coffee... love it. The best part of the experience was service with a smile and some cheerful banter. I loved it. Check it out."], ["Roger E.", "I spent half my life eating food in New York and needless to say I am extremely picky ... I have never had a better Greek meal in my life ... Oh did I also mention that my mom's maiden name is Staros ... OPA ... They also have live music at noon for lunch can you imagine! Tomas may you have a great success in your restaurant fabulous! :-)"], ["Rock R.", "While it might be off the beaten path, this place has the best gyro I've found in Phoenix. I normally don't take the time to write reviews, but I couldn't recommend this place more. For the price, the gyro combo is well worth $7, and it's an added bonus that the owner is both Greek and incredibly passionate about his food."], ["Steve K.", "Stopped in for lunch today and to check the place out. It's a bit tricky to find in this small strip center as it doesn't face the street.  It's a small local business owned by a very friendly Lebanese man names Tom (Tomas).  It's a fun little place to hang out and listen to music, and they even have a small stage in the corner. I ordered the Chicken Shawarma for lunch, to go. Took about ten minutes, but worth the wait as everything was fresh and flavorful. Can't wait to go back though and try a gyro as they are my favorite."], ["Kalyan R.", "Horrible service time on a to go order. I have thirty minute lunch break, they took 45 minutes to make my gyro combo."], ["Eric N.", "Great food and the gyros are awesome. The owner is really friendly and will make anything  to your needs"], ["Keith F.", "Let's be realistic here. It was ok. The owners was nice. They may have been understaffed because we really waited ages for everything. Food was alright."], ["Reimun S.", "I like it! The food and service is really good! I love to support small businesses like this that are family owned and operated. They feature many of the authentic Mediterranean Items including beef kabob, chicken Kabob, Shawarma, etc. They also feature live entertainment during the weekend I believe. Definitely stop by when you're in the area! I would recommend it!!!"], ["Brittanie M.", "Really hard to find if you're heading east! Just turn on 9th Street and it'll be in the dingy shopping center on the west side of the street (near an \"Indian\" fry bread place I also want to try). Having had gyros at a different place earlier in the week, I had something to compare this to (before that, it'd been over 10 years!). These gyros are a little smaller but a lot fresher and tastier. The meat was seasoned perfectly and you could taste it through the fresh tomatoes, onions and tzatziki sauce. I don't mind a little bit of grease because that tells you the meat is fresh and roasted rather than pre-cooked and stored. It also came with really delicious french fries. The hummus was obviously in-house and came with a pita that was steamed so it was very soft and warm. I took it to go and it smelled so good, I almost snuck some on the way home! The gyro and fries came with a canned soda and was $5.99. The hummus was just under $5. A very tasty, filling meal with drink for under $13 with tax is definitely a win! Definitely surprised and sad this place wasn't packed on a Friday night around 4. I hope people are just getting take-out because this place deserves to stick around.I will be back!"], ["Alexandria K.", "We stumbled upon this place on Indian School. There was no wait, service was fast and great. The gyro sandwich was delicious and fresh. It is a little hole in the wall place, with middle eastern decor but also tropical beaded curtains and pictures of black and white pin-up girls. Definitely recommend."], ["Heather Y.", "A little disappointed they didn't have a chicken gyro, but the chicken pita was pretty good. I enjoyed the creamy flavor of the taziki sauce and the oregano infused salad dressing. Side salad was nice and fresh. It wasn't the best Greek food but it was good."], ["Joseph S.", "wow had not eaten here in a while was glad to returned had gyro combo with 1/2 1./2fries and salad fresh delicious and great service too"]], "Z's Greek": [], "Ali Baba's Restaurant & Bakery": []}