{"Asadero Norte De Sonora": [], "La Santisima Gourmet Taco Shop": [], "Taqueria Los Yaquis": [["Ukay N.", "Ummmm. I have been here twice since moving close by. This place was hyped up to me as the BEST TACOS! but BEST does not mean authentic. No Bueno for vegetarians, but they do have some insanely tastey cheese sauce on their nachos..."], ["Linda L.", "The best tacos in Phoenix. They're cheap and delicious. Nothing beats that. Their quesadillas are pricy at $7 but they are sooooo good! I come here whenever I am craving tacos or need a really late night snack even though it's far from where I live."], ["Nader A.", "The other night was wonderful! I met her in the city after cocktails with friends. I was blindsided...I had no idea she would just randomly come into my life like that, but it happened. She's on the petite side, and puts herself together a little nicer than most girls around that part of town. The moment we connected though, I knew she was far from hollow. In fact, she was one of the most down-to-earth, simple, yet complex, ladies I've met in a long time who is filled to the brim with good things, and she's not the type of lady just looking for your money. When we kissed, time stopped, and in that moment I knew true bliss...and needed a napkin.She's a mini quesadilla, and for $2, she's more than worth venturing to Yaquis, one of Phoenix's legit late-night grub spots, for. I always used to get the tacos, but this time I went with a gut feeling, and it paid off! No longer will I be held down by my self-bestowed shackles! No longer will I preach that the tacos are king, and that they're the only food that matters at Yaquis! For the sky opened up, and a divine thing occurred that beautiful night...I know now what I must do. I must shout it from the mountaintop! THE! MINI! QUESADILLAS! ARE! DELICIOUS!So go already."], ["Nick A.", "Very good asada tacos which is not easy to find in Phoenix. Both quesadillas are also very good, the mini and the full-size. It's only a four star because of the limited menu choices. The pricing is about as cheap as your going to find.This place delivers excellent flavor and a good price point. The service is quick and helpful. The employees make you feel welcome and at home even though it's outdoors. If you are craving Mexico style street tacos this is about as close as you're going to get in the Phoenix area. If anybody knows a better taco stand please let me know."], ["Raymond U.", "AWEEEEE-sooooommmeee!"], ["Ryan J.", "Great amount of food for the money but the flavor wasn't there for me. Everything came across as kinda spicy but then left a bland taste in my mouth."], ["Billie M.", "Culinary Graduate - Norwegian Cruise line EmployeeI would recommend chicken tacos, line is a little long, but tacos for a dollar that are that good are waiting for!"], ["Melissa M.", "Definitely worth the wait! Only open at night but they stay open late so you can grab some post drinking grub. Always helps take the edge off those morning hangovers. Everyone is very friendly and hardworking so they move pretty fast to battle the line."], ["Mossey Y.", "No puedo creer que hay tacos tan ricos aqui en AZ. Delicioso!!! Evie, thanks for turning me on to this joint! I think that these are the best tacos in town."], ["Didmar F.", "Fresh, simple, authentic Mexican and very affordable food. The line sometimes can get long."], ["Brett B.", "Wow. By FAR the best taqueria tacos that I have yet had in Phoenix!Amazing find - I just ate there tonight and I am still dreaming of the delicate and perfectly cooked homemade tortillas used for the mini Carne Asada Quesdilla that I practically inhaled!. I almost missed ordering these \"mini size\" Quesadilla bad boys but saw a plate of these delicate morsels at a nearby table and I added them to the taco order.OMG were they good. Sorry to gush, but each bite was pure bliss. Without a doubt - unequivocally - these are some of the best tacos and quesadillas that I have ever eaten. The place is a kind of hole in the wall with a small parking lot up front. You know you are in for an amazing food experience by three dead giveaways:  1) The massively long and slow line out front on a Sunday night (at least 30 min before being able to order - worth every minute!). 2) The sight and sound  of the cooks freshly chopping away at the tender Carne Asada on the block continuously - no pre-made dried out beef here. This is the tender melt in your mouth Asada of your dreams  3) The happy people eating at the tables nearbyPrices here are dirt cheap - Only $1.00 per taco, and about $2.00 for each mini Quesadilla. Our family of 3 filled up our hungry tummies for less than $20 including drinks.Tacos were superb with a bit of cabbage, some spicy and flavorful homemade red salsa and a dab of salsa style guac. The tortillas are fresh, and extremely tasty. The only place I've ever had Taqueria tacos as good as this was in Mexico many years ago. The opening hours of this place are a little strange right?  Open only Thursday through Sunday, mostly nights and late nights. No lunch possibility sadly. This must be related to opening at hours coinciding with the Charlie's bar just behind to feed the happily inebriated with some of the best munchies in the city lol.  Taqueria Los Yaquis is now on my radar as a standout for delicious cheap eats - one of Phoenix's true gems -  some of the best tacos that this town has to offer. Yes, the tacos are exceptional but don't miss the \"mini\" Carne Asada Quesadillas ($2.00 each) as they are the big O."], ["Anthony N.", "Wasn't blown away as suggested by some reviews, but pretty good tacos for the cheap price.  But they are not the best I've ever had and the service is very slow. I didn't think the line was too long and was surprised to find myself still in line 15 minutes later. Disappointed to see only carne asada or chicken choices. The tacos were a great size for a late night snack. I found the mini quesadillas to be too salty, although it did have a nice crisp.  The salsa roja had a nice spicy kick.  The horchata was too creamy and sweet. I wouldn't go out of my way to come back. But if I were in the area and had the nighttime munchies, it'd be better than a 24 hr fast food joint. Just be ok with waiting up to 45 minutes for some tacos."], ["Christina P.", "If I could sit on an air conditioned couch with a beer and immediately enjoy my nachos, this place would be five stars but, alas, I have to wait to get home... therefore, only four. But four grateful, guilty pleasure, love-filled stars!$7 for a heaping, i-am-somewhat-ashamed-for-nearly-finishing-them-myslef-sized serving of SUPER nachos. Movie theater style tortilla chips, doused in (what I like to call) \"fake\" cheese, carne asada, jalapenos, salsa, guacamole and sour cream... consuming them is an entirely unhealthy act of gluttony -- one in which we should all spoil ourselves and indulge on occasion!They're only open Thursday - Sunday and mostly with late night hours: Thu: 9:00 pm - 3:00 am Fri - Sat: 9:00 pm - 4:30 am Sun: 4:00 pm - 3:00 am"], ["Ryan R.", "Coming from Los Angeles, I am pretty up to speed on good Mexican food. After a night out at Charlies, we discovered this place that is basically attached to the bar (which is an awesome concept).Originally, I did not order anything because I was not that hungry, but after having a bite of my friends chicken burrito, I immediately changed my mind.Normally, burritos that you get from food trucks are a lot of beans and rice with some chunks of chicken mixed in. However, the burritos from this place are around 95% meat, which provides for a very filling and tasty meal.Overall, I was very shocked at the great seasoning and flavorful taste of the food here and would definitely recommend it, drunk or otherwise."], ["Jennifer M.", "Best tacos ever! Love this place, and the dollar per taco makes it even better. Staff is friendly, but always carry cash just in case their credit card machine isn't working."], ["Penny M.", "Best food! I want to eat there Thursday-Sunday! Love this place!!!!! The burrito is delicious! Park at Charlie's next store."], ["Emily S.", "PHOENIX HIDDEN GEM!!!! Cant beat the $1 tacos and the late night hours! I'm so glad so many of my friends told me to go!Park at Charlie's."], ["Anthony W.", "This is hands down the best late night eat in Phoenix.  There will be a little wait, and your eating outside. But done despair, this is the BEST carne asada you've ever had. It's a late night tradition, I think, to gorge yourself on their food on Friday and Saturday nights. And if your not... Your loss."], ["Michelle A.", "What is all the hype about? Two-thirty in the morning and no where else to eat...perhaps. My tacos where missing the Guacamole and the cabbage tasted more like sauerkraut to me. The salsa was yummy and I prefer flour tortillas to corn. I saw that they accepted credit cards online however it was cash only the night I went."], ["Victor C.", "Best after hours choice in Phoenix! Really good authentic cheap Mexican food. Good horchata! Good salsa! Good food! The long lines at 2am are definitely worth it."]], "PHX Burrito House": [["Amanda L.", "I'm writing this review from the standpoint of someone who thinks Chipoltle is overrated when it comes to big,tasty burritos, because PHX Burrito House takes the cake.I seriously don't know why any Phoenician would ever ever ever set foot in a Chipoltle when they could go here. One, it's local. Two, it has the same options as Chipoltle (rice/beans/meat/etc) and is ten MILLION times more delicious. The carne asada falls apart in your mouth and is seasoned very well. The carnitas are amazing, and one burrito was seriously the size of my face. When I dined in, I got complimentary chips and salsa and they were delicious.Service is probably the only difference when comparing to Chipoltle. PHX Burrito House cooks up your food and brings it out to you, thus meaning it takes a little bit longer, but it's fresher. The wait can easily be avoided by calling ahead and placing a to-go order if you're in a lunch rush. So next time you're craving a giant, meaty (or beany or veggie) burrito, skip the national chain and go to PHX Burrito House. You will not be disappointed."], ["Jennifer S.", "Entirely different experience than June's meal with my family at this restaurant.  We were the only people seated in the restaurant and it was clear the take out customers who arrived after our order was placed took priority.  I regretted adding gratuity on prior to receiving our order.  After what seemed like a long wait for a two burritos, I bit into my shrimp burrito only to taste the cabbage and hot sauce.  The shrimp were fairly well distributed further down but the guacamole was isolated to one bite somewhere around the middle. The tortilla itself was one of the best I've had but who was constructing the burritos last night??My horchata was just meh.  Mostly ice and the guy had to be reminded to bring it all.I like the location close to our home and the fact that it is a small family restaurant.  It is clean with nice decor and a good menu but with so many other options in the area, after last night, I doubt I'll be back."], ["Anthony P.", "Inexcusable slow takeout service, time and time again. It is insane that it could take 40 minutes to get a burrito and quesadilla. Keep in mind all three times I was there it was 7:30pm or later, and was slow. There is a serious kitchen issue at this place. 2/3 times the food was very good so I tried to overlook how gotdamned slow the place is, but tonight was slow and poor quality- and like my boys Hall & Oates- I can't go for that. If the owners don't invest a little time and attention to this place- soon it will be known as the place that used to be phx burrito house. Pull it together and do it quickly. I want them to succeed but life is too short for a 40 minute burrito."], ["Bryana N.", "First try here I had the shrimp burrito. Was full of cabbage, a bit dry and not too flavorful. 2nd attempt was the Carne Asada Burrito. Much better! I had mine with pinto beans, guac and sour cream. It was a bit too 'soupy' in texture for me. Next time I'll try without the beans..Tortillas are delish. Service is friendly."], ["Sara D.", "Great burritos! I love the pork in green chili burrito! Staff is friendly. Takes a little time to get the food. But it's worth it!!! Great atmosphere and drink selection."], ["Duci D.", "We decided to check this place out while in town. The wait time for our order took longer than expected for 2 burritos and a Chorizo plate. I guess that only makes you even hungrier! Once the food arrived, I wasn't disappointed but I wasn't impressed either.  This place is alright. Will give them a try again when I return to Phoenix."], ["Terri K.", "Happened on to this place because one of our favorite breakfast burrito places closed.  Omgoodness,  fabulous smothered green chile breakfast burrito!  The people are awesome.  Definitely,  a new favorite! ! The ingredients are very fresh,  the place is clean.  I loved that they used fresh jalapeños . Just can't say enough about this little diamond in the rough. Love it."], ["Gina C.", "First visit and I really like this place. They made my meal to order. I just said I want a plate with rice beans and meat and they had no problem with that even though they are a burrito taco joint. The red salsa is very good. My meal was fresh and delicious. The service was good. If you are in the area you should stop at the Burrito House. Come eat here."], ["Aryck R.", "Best burritos ever! Really fresh, authentic ingredients and great tasting food. Their breakfast burritos are top notch, as well as their green chili. Super friendly staff and really clean as well."], ["Kazi H.", "I had high hopes for this place after seeing the reviews but it disappointed and I won't be going back. The chips were thick and stale. The salsa lacked flavor. The Guac was literally just mashed avocado  with a few pieces of cilantro. My carne asada burrito was a rice burrito. It was so overfilled with rice that I couldn't taste anything else. My coworkers fish tacos tasted of pure fried oil. So gross. The food took FOREVER to come out. We were all done eating and one of my coworkers hadn't even received his food yet. This place was bad all around and the food say heavy."], ["Gary M.", "Stopped by for lunch on a Friday. They certainly weren't packed but there were a lot of tables (3 out of 5 seated, 4 open) waiting for their food. I ordered a shrimp burrito to go ($8.50). It had shrimp, cabbage, pico, lemon juice, hot sauce, and avocado. I couldn't find the avocado and hardly any pico (see pic). Shrimps were good and I'm glad they threw in some additional hot sauces (and chips due to the wait) to help out the flavor on the burrito. I'd say their issue is turning food. If they were full, you'd be waiting 20 minutes for a three minute \"Chipotle\" type burrito. Lady behind the counter was very nice. Worth the try if you're in the neighborhood."], ["Connie L.", "Delicious thin flour tortilla. Carne asada can be more marinated. Green chili pork chunks were tender. Pretty tasty, but not overwhelming.My friend the veggie quesadilla was better than most and lemonada was good .Tamarino and jaimica beverage was interesting... Sweet/sour. Staff was very friendly. Gave us complementary chips and salsa."], ["Devin A.", "Hooray for PHX Burrito House! Yes, there are a ton of great options for Mexican food in the Valley, and if you find yourself in the Melrose area looking for some hometown Mexican fare, then PHX Burrito House is the place for you. On my last visit I went with their carne asada burrito -  savory chunks of nicely-marinated and seasoned beef with all the fixings wrapped in warm tortilla. I also added some chips and salsa. Great flavors that hit the spot. After settling for just so-so Mexican food as of late, I was happy that I came.Staff (owner?) was beyond friendly. Wonderful service all in all.Easy parking, freshly-made flour tortillas and salsas and GREAT hometown service make PHX Burrito House the place for me!"], ["Robert C.", "I can't actually comment on the food. I would rate the service as lousy. I waited 20+ minutes for a burrito i had already paid for. I got tired of waiting so I left. There were only two people in front of me and they each ordered a burrito to go. They left in 5-8 minutes so I thought mine should be read pretty soon. I waited another 10-12 minutes. Food never materialized so I split. Maybe I'm  just used to Chipotle"], ["Duncan B.", "Fast friendly service. Really good carnitas burrito, they do put rice in the burritos but you can get it without. I usually as for easy rice but I like it. The house breakfast burrito is a must have for the mornings."], ["Julio C.", "$5 for chips and awful salsa - NoThe carne asada was blandHot sauce on the table was buffalo wing sauce, like... seriouslyDon't plan on coming back."], ["Taric W.", "Good Mexican food for people who like mediocre Mexican food. This place smells so freaking good! Like, for once, I've stumbled in a place that was both hip AND authentic AND tastes great. It's small and humble, with prices on par with Chipotle, so I expect something great. I went with a green chili (pork) burrito with black beans. I can say that while the beans & rice are good, the main attraction falls flat. It's not spicy. It's barely flavorful! what a letdown. I found myself dousing it with the green habanero sauce featured at the table. Oh yeah, don't expect any sort of complimentary salsa bar. Salsa (and chips) will cost you a bit extra, and if you're going to shell out the $3, you might as well just drop the same amount for a better burrito + chips + salsa combo at a place like La Santisima...or even Qdoba. This is me dropping stars because of superior, accessible places in the same area at the same price point. At the end, I washed it all down with a freshly-made horchata...but halfway through, I was dealing with coarse granules of sugar! Gross! I'm in no hurry to come back."], ["Kevin P.", "I'm all about their red chile burrito.  Green chile and carne asada were pretty damn good too but there's something about the red chile mixed with the gooey cheese, rice, beans, meat, sour cream that hits the spot.  It essentially feels like mexican (or whatever...mexican-american..) comfort food.Prices are good (comparable to chipotle/qdoba's of the world) but the flavors are not the same at all (burrito house is better...).  They do a good job mixing the burritos here too. No one bite of only plain white rice, one bite just beans, etc. Only complaint is it needs to be even spicier!"], ["Will C.", "Just saying the EPIC burrito is where it's at. Ham, bacon, egg, cheese, potatoes, and refried beans. Try it and I promise your mind will be blown!"], ["Dan G.", "Dine in order:Grilled Chicken Burrito w/ guacamole added & a Mexican bottled Coke; total $10.01Came in to a slow Tuesday evening, only one other table was being occupied. Not only was this place dead but it had no good atmosphere at all. From the young man taking the orders to one of the owners present. One could at least add some low volume music so you avoid hearing the awkward silence. This is not to say they had bad customer service just no soul / passion in the restaurant The chicken burrito was good but sadly the overpowering of refried beans made my burrito sloppy & unwrap-able. At the end it was a soggy mess. As for the chicken I was able to take out and actually taste it was juicy and flavorful. Tortilla was a tad bit thin but didn't bother me cause I'm not particular to thick or think flour tortillas.For what you're purchasing this place gets a 4 out of 5 stars & for the ambiance of the restaurant I give them a 2 star rating. Overall it's a 3 out of 5. My recommendation, take your food to go"]], "Tacos Sahuaro": [["Dan G.", "I dine here when my budget/diet allows. I think the food has improved in quality lately. I am in serious like of their Burrito, Carne Asada, with avocado and everything. Not too spicy for me (most Arizona residents would probably say not spicy at all)"], ["Andy G.", "Fantastic Authentic Sonoran Tacos. This would be what I call your street vendor style food. If you want gourmet there are other places for that such as La Santisimas. With that said, this is the style that I crave the most. I recommend the Carne Asada and El Pastor tacos. They are rich and flavorful. Make sure to snag a bottled coke while your at it.I will be back!"], ["Steven H.", "Got word they take credit/debit cards now. Super great place to eat in Phoenix and will always visit when I'm in town"], ["Beau P.", "Tacos Sahuayo is a casual small shop with great food and a casual atmosphere. I ordered a chicken quesadilla, one carne asada taco, and one chorizo taco. All of them were amazing and I left rubbing my belly in a food coma. There was a chili hot sauce served on the side which reminded me a bit of harissa. I'm not sure exactly what it was, but it I wanted to put it on everything. The service was great and I'll certainly stop again if I come back to Phoenix."], ["Martin S.", "Loved It. Feels like eating Tacos in LA!"], ["J O.", "Um . . . OK, we gave this place a shot, but were far less than impressed.I think they tried to be \"authentic,\" and actually had a few items which could be picked up in \"authentic\" Mexico (sopes, tacos, which were what we ordered), but the taste and the quality were not something which would prompt us to eat there again.Location is . . . unimposing?  That's one way of putting it.  Another way is it is a bit scary.  Yes, you can order in Spanish.  That doesn't, however, make it a 5-star joint.  Not all that well-maintained . . . much like the surrounding neighborhood.  We came on a Sunday when there was hardly anyone there . . . and we were more than a little nervous parking our car and walking in.I don't have anything really bad to say about the food . . . I will applaud their effort.  I can safely say, however, that the taste was not of the \"died and gone to heaven\" variety attributed to them by so many of the 5-star reviews they have been awarded.I would say give them a shot . . . not bad, but not great.  They have menu items other than the regular \"burrito / chimichanga\" fare that so many folks think constitutes \"real\" Mexican cuisine, but not, in my opinion, meriting a special trip."], ["Todd P.", "First time here was this week and I'll definitely be back.  Very clean and easy to find.  The menu is primarily tacos, burritos, etc.  Got a combination of the asada and pork tacos.  Both were excellent.  Service was quite friendly."], ["Lowell C.", "Best Tacos since I have been here in AZ.  Little dive spot....great service...and the food was delish.  $2 street tacos....packed with meat.  yes...yes...yes!!!"], ["Jordan C.", "íMuy Delicioso!  My Buddy and I were looking for a post-workout meal to enjoy with the underlining reason being that it was Tuesday.  As any good hungry person would think, Taco Tuesday.  We found Tacos Sahuaro and noticed that Yelpers loved this place.  We came and it definitely had the look of an awesome hole-in-the-wall taco shop which gave me a sense of ease and excitement.  I decided to get 4 tacos, even though the quesadilla and the tortas looked awesome.  I was sad to hear they were out of the pollo asado, but i take that as it must have just been delicious.  I instead got the Carne Asada, Pastor, Lengua, and Chicharron.  All were just absolutely FANTASTIC!  I was pleased to see that they either fry their tortillas or they're just housemade b/c they were just awesome!  The texture was thicker than usual, but still nice and soft and and just tasted fresh.  I will say that my least favorite of my four was the Chicharron, the reason being was that the skin was not crispy as I had initially expected.  The skin was soft and perhaps I am mistaken that it was supposed to be fried, but that was my reasoning behind that.  The pastor or the lengua were probably my favorite.  The flavors of each are just so distinct and are just on point.  They also have the verde y rojo sauce which are both on point and last but not least they gave us a bowl of limes and cucumbers which enhanced the flavors just that much more.  I will definitely be going back for some delicious Mexican food :) ¡Salud!"], ["Kenny B.", "Man Oh Man was this place the FUCKING bomb. The pastor and asada tacos are the da shit i would highly recommend getting those if you ever want amazing tacos. Even better is they are only 2 dollars each can you say WHAT??????? best of both worlds and they are not stingy with their meat. amazing place definitely going back."], ["Art C.", "Been here before it was good back then and its good now.....they accept Credit/debit cards now with a $.50 fee which is a ok wif me.....nom nom nom....lol"], ["The Denius J.", "A late night dinner. Elisa's carne asada and al pastor tacos were decent. I got a chicken quesadilla. It was outstanding! Maybe it was the seasoning on the pollo asado, I don't know. All I know is that I wanna eat it again."], ["Cameron E.", "Best tacos I've ever had (carne asada is what I usually get). The horchata is amazing as well. Looks like a big hole in the wall but DONT LET THE OUTSIDE OF THIS PLACE FOOL YOU!"], ["Chanel E.", "By far the best tacos I've ever had! Don't let the outside deter you.. This place is as authentic as it gets. You won't be disappointed."], ["Juliana L.", "Loved it! This place is very authentic, humble, and most important: DELICIOUS!!!! Looks can be deceiving, please don't get scared of the simple looks and may I even say \"ghetto\" vibe & looks... This place serves a great portion of food, very clean food and staff.  Oh, staff is very polite, very attentive.  Def will be going back for more:)"], ["Kprue M.", "The best tacos and tortillas. Definitely one of my favorite places for lunch now!"], ["Wendy P.", "No frills taco place! Ordered 2 carnitas tacos though on hindsight I should have ordered another type of meat instead. The nice thing about this place is really the food. What's not to like? Fresh warm and fluffy tortillas, topped with chopped carnitas cooked to the point of slight caramelization, and then finished with chopped onions and cilantro. Nice and simple. You can dress your tacos with lime wedges or the 2 types of salsa they provide. No beans or rice to cloud your perfect taco experience. I would come again if I set foot in PHX!"], ["Elaine Z.", "Tacos are okay, better than others I've tried. The salsa is not that good, but the prices are fair. I'll come back."], ["Maddy C.", "My husband and I were staying in Arizona for only a day and had a craving for Mexican food. Looked up restaurants near by and came across this whole in the wall. As we walked into the restaurant we were dubious to order but we've always known that hole in the walls tend to have the best food and this joint was no exception. I ordered the asada gordita and my husband the chorizo and asada tostada with a side of the mini chorizo quesadilla. Hands down this has been the best Mexican food we have eaten and even being from LA. The food was fresh made to order and did not taste of grease like other Mexican foods. Another upside was their affordable prices. The only downside is their small menu selection, but their tasty quality food makes up for it. If you are in town please give this modest hole in the wall a try! You will honestly not regret it!"], ["Gordon S.", "Great authentic tacos for two bucks.  Carne asada were excellent.  Pig skin...May be a inquired taste."]], "Sierra Bonita Grill": [["J W.", "The Sierra Bonita salad was really good but their Bloody Mary was quite possibly the dullest and flavorless I've ever had :/ Service was good. Nice lunch atmosphere. Over priced a tad. Otro Cafe is better."], ["Taylor V.", "I give this place a 5 star, because of the service... and the Fresh squeezed Margarita...OMG, the best.Our waiter, all I remember that he was Black and puerto rican... funny, gives excellent service, friendly... We ordered soups, and the fresh bread sandwich...and all of it was delish... price was okay . but nothing like Fuego del Mar...(don't go there).  I'm going back for sure... my family and I agree this was a great place to visit."], ["Alissa M.", "Before last weekend, it had been years since my last visit to Sierra Bonita. I remembered they had really good fried chicken, and I was glad to see it was just as delicious as I remembered! It was not at all greasy and was perfectly seasoned. The side of chipotle sweet mashed potatoes are so good! It's the perfect combination of sweet and spicy, and the gravy on the plate is just the right consistency and flavor. I also had a glass of wine and felt like they gave a very generous pour.My boyfriend ordered the SBG burger. The combination of chorizo and ground chuck sounded great, but it was a little dry and I felt like something was missing.The rest of the menu sounded great, and there are plenty more things I want to go back and try. Plus, they have 1/2 off bottles of wine on Tuesday nights. I will be back!"], ["Kelly R.", "I've ordered food to go, a margarita on the rocks at the bar, and had brunch on a Sunday.Each experience was well above average. When I stopped in for a drink, it was a Friday during happy hour and packed! Still got my drink promptly, and I enjoyed it so much I had to repeatedly remind myself I had plans that I would not be able to show up to in a cab.I ordered the chicken sandwich and tortilla soup to go and I would definitely get it again.When I went for brunch with the bf, I got the enchilada stack with chicken, my egg was perfectly cooked over medium, and the Desert Blossom iced tea really hit the spot. My bf had the burger with cheddar cheese and fries. It was so good I wanted to trade even though mine was delicious. Just the right amount of salt on the fries, and the burger was as good as I'd heard!Our waitress was attentive, always bringing us more iced tea and anything else we needed, she was personable and really made our whole experience a very positive one. We look forward to going back again and again. There are many more menu items I am dying to try!! I really like the ambiance- dark and relaxing at night, bright and cozy during the day.Thanks Kari M. for telling me about this great restaurant!!"], ["Peace D.", "fabulous"], ["Carri H.", "Love this place!! Always friendly waitress Jes & always great food.  We have a wonderful lunch every time. I enjoy the southwestern cobb it has just the right amount of everything in it & flavorful steak to top it off. Jessica's smiling face makes the lunch even sweeter, but also the gelato hits the spot."], ["Bryan F.", "Get the fundito"], ["Michael T.", "amazing dishes, good prices, great service. Oh, and they have some insanely good microbrews on tap. I had the roast chicken, which was really really good. My friend had the pork osso buccco, which I tasted and was blown away.The guac appetizer was excellently done. Geoffrey was our server and gave us excellent service. We'll definitely be back soon.. Loved it!"], ["Jenelle C.", "Excellent appetizers, main courses, atmosphere, lighting, music, service, drinks, desserts and coffee. One of my favorite restaurants overall! Thanks Sierra Bonita!"], ["Brad L.", "Live in the neighborhood and have been wanting to try it. Went in for lunch on valentines day and were seated immediately. All the staff was professional and friendly. We were also impressed with how fast the food was ready. Food had good flavors and definitely had its own \"style\" and flare.  I had the pasta dish and my wife had the Mahi Mahi fish tacos. Not traditional Mexican and wish they had some chips and salsa but a great experience over all."], ["Marc C.", "Went here for Lunch for the 1st time, with a group of people from work, & was thoroughly impressed!  The decor is very nice, but the food was truly unique & delicious! I would like to come here for dinner sometime.  :)"], ["Kerry M.", "I have to admit, I had driven by Sierra Bonita about a million times before finally being formally introduced to their delicious menu. I had no clue this little gem of a place was hidden here. In fact, I seriously thought it was going to be some kind of cheesy, chain restaurant. No no, my friends, it is not. In fact, this is much more of an upscale restaurant than I would typically visit. Which is exactly why I always sit in the bar and order from the appetizer section of the menu. And oh my, there are so many delicious options just in that little section. However, my favorite by far has got to be their mac and cheese. It is definitely not your traditional, American mac and cheese...but the green chiles and unique pasta make it so very tasty. I find that it's plenty of food for a main course (and much more affordable too!). If you're looking for other less expensive options, the queso and guacamole are great too. The adult beverages are always good, but they do seem a bit overpriced. Overall though, I think it's Sierra Bonita's atmosphere that keeps bringing me back. It offers a lot of variety: from dark and sexy, to comfy bar tops, to a cozy patio that exudes ambiance. It's definitely different from your typical Phoenix restaurant which is a big lure. The only drawbacks to this place? The service is questionable and the price is rather steep. I've been here four or five times now and I've mostly been served by unfriendly, snooty characters. I'm not sure what the deal is with that. Maybe because I'm too busy trying to save money and prefer to order appetizers. Is there a secret monetary amount that's supposed to be spent when you dine here? Or maybe it's just a too-cool-for-school vibe. Either way, I do not enjoy a server who isn't polite. Take your attitude elsewhere buddy. All in all, Sierra Bonita is a great, local restaurant. It's a nice place for happy hour or a date night out. Enjoy!"], ["Cindy J.", "I love SB.  I eat there at least once a week and find that the menu has a good variety.  I like the daily menu with different seafood items.  Jessica is the best!!"], ["P K.", "Great restaurant. The service was impeccable. Fron the hostess to Jose, our waiter and everyone in between they made sure we had everything we needed. The food was delicious and plenty. Will be back."], ["Amy H.", "I cannot put into words how impressed I was with Sierra Bonita! Absolutely everything about this place is epic! We went in on a Saturday night and were seated almost immediately which was a relief since it's such a busy night for restaurants. Our waiter promptly came over to our table and was super polite, well-spoken, and knew the entire menu off of memory. My husband and I brought another couple with us and we all had different dishes. We all tried each other's and were in food heaven. Everything was perfection. I had the buttermilk chicken which is one of their most popular items. It has a bit of a kick to it so be for warned. The sweet potatoes are the icing on the cake for this dish. Another if us had the carne asada and it was too notch quality meat! It burst with flavor. We always enjoyed their black tea and some wine. The prices are fantastic for the quality you get here. The ambiance is candles and soft lighting with light background music. The wood decor throughout the restaurant finishes setting the scene and makes you feel at home and comfortable. I recommend geting the smaller portions being that it's still a lot of food! I can't wait to go back here ago. And bring new friends! It is a MUST go!!"], ["Jonathan Z.", "A highly recommended restaurant from separate concierges at the Hilton Pointe Squaw Peak Resort. To their reco's, the Sierra Bonita did not disappoint. I really enjoyed the bacon covered shrimp and I loved the buttermilk chicken with asparagus.  I was pleasantly surprised when our waitress brought a complimentary 's'mores' dessert for my colleague who was celebrating his birthday that night.Our waitress was ultra-sweet and fun; despite telling us we were welcome to stay as late as she wanted, we could tell when the chairs were on the tables and the lights were being turned off that our time there was coming to an end."], ["Elizabeth P.", "I hosted a small baby shower brunch in their downstairs room. Everything was perfect. I made arrangements with Tony who was super professional and accommodating. Every staff member from the host to our server and bartender was friendly and helpful. The food was amazing and the atmosphere perfection. This restaurant is a small gem of Phoenix and I can't wait to go back!"], ["Gwynne S.", "My family and I have been eating at Sierra Bonita since they first opened. They keep getting better. One primary differentiator I can point out about this place is that they do not skimp on the veggies. A lot of the time, eating out means carbs with a side-o-carbs, featuring one protein ingredient and maybe some cheese. They don't just do vegetables as an afterthought, they use delicious and unusual ones. Their mix has green and purple romanesco, rainbow carrots, broccoli, squash, green beans, spinach and usually sauteed with butter and rosemary. Sometimes choyote is in the mix too - at brunch, order Cowboy Hash.And then all too often, at other places beans are \"just beans\" and don't have much flavor (or my least favorite, are honey-like and sugary). Sierra Bonita's beans are totally rich and flavorful, they're whole beans, not refried and are super savory, elevated far above the ordinary \"side of beans.\"They have a Moscow Mule that comes in a copper cup and tastes super refreshing in the summertime (plus you can rest the cup on the inside of your wrists to cool down from your drive there). I love their Southwestern Cobb salad for lunch. Their Carne Asada is super filling, even the half-size. Same goes for the Buttermilk Chicken, and it's nice to get mashed sweet potatoes instead of just mashed potatoes. Lots of good, rich flavors and intensity here.They have a new dinner appetizer, butter-braised mushrooms. OMG these are to die for. There's gorgonzola cheese in there, and maybe a little bit of heaven. I've had the Albondigas soup, the green chile posole and the Azteca soup and they're all rich and deliciously filling. Then the most out-there sounding dinner entree: chocolate and espresso-rubbed pork tenderloin. It says all this but the taste that pops out the most is the vanilla. It's like Holy Crap, how did anyone think this up and how does it actually work so well?Gah ... I just ate there for dinner and writing all this makes me hungry all over again.They just added salmon tacos to their menu. Totally heart-healthy, what a good excuse to go. Super juicy and delicious. Everyone who works there is nice and relaxed and a lot of them have been there for years. Happy hour is fun. There are always people from the neighborhood there and their jalapeno poppers are super delicious - not fried with ranch dressing like a pub would have. Their jalapenos are sliced and filled with seriously flavorful cheese and served on a skillet with a tomato wedge sizzling in between each pepper.I could go on, but if you do a ctrl-f search on my review for the word \"super\" you'll find a word count that's high enough to show what I think of this place."], ["Matt A.", "If you come inside you think they must specialize in fancy street tacos or fajitas, but I am telling you that the absolute best thing on the menu is the Buttermilk Chicken. Fried Chicken, mashed sweet potatoes, and a pepper-y gravy. I would say that it tastes like Thanksgiving but I've never had anything that good on Thanksgiving before. That is the dish that keeps me coming back and back again."], ["Kristina B.", "The food was excellent! Great venue, and clean. Exceptional service, will definitely return!"]], "Comedor Guadalajara": [], "Dick's Hideaway": [], "Mariscos Playa Hermosa": [["Belinda R.", "Im here on a business trip from California and default to Yelp as hunger savior. I found Mariscos Playa Hermosa based off my location and yelp reviews. I walked in and there were only 4 other people eating,  then again it was only 6pm. I was greeted by a friendly gal.I picked my own seat and immediately was offered a drink.  I got agua de  Jamaica which was perfect not too sweet. I was brought chips and salsa a few minutes later. There were 2 salsas, an avocado salsa and a red salsa. The avocado one was perfect,  the red was great but OH EM GEE my mouth was on fire. I love hot sauce, but this for sure was blazing! I really wanted shrimp and asked for recommendations.  I was recommended the bacon wrapped shrimp but decided not too because I'd feel guilty of it being too fatty. I then was recommended the A ala diabla shrimp. I usually love spicy shrimp, but at this point my mouth was on fire from the salsa.....sooo i got it anyway. Why not?  My plate arrived with about 6 shrimp and tons of sauce with rice beans and sode salad.  The beans and rice were great, but holy moly the shrimp were BLAZING SPICY holy moly. They were still good.Overall, the service and food was great. I will def come back on my next visit."], ["Mark C.", "Whenever a friend or out of towner asks me where they can find the best Mexican food in the valley, my answer is always the same.  The more questionable the neighborhood, the better.  That's by no means an exact science (nor meant to be demeaning to the neighborhoods for which many of these establishments undoubtedly take great pride).  But with apologies to the numerous suburban Mexican food establishments that dot the valley landscape, the working class Hispanic neighborhoods of inner city Phoenix are where I've always found the best Mexican grub.  When I told my Dad I wanted to try this place and where it was, he hesitated a bit thinking we were driving into a death trap.  Fortunately my food adventurist side convinced him to make the trip with me to try this place for the first time.  And oh, what a place.I first found out about Maria Maldonado's creation on a segment of the wildly popular PBS show Check Please Arizona (you can watch it on YouTube right now).  From the onset, you could tell this wasn't your typical Mexican establishment.  While they have all the usual Mexican staples you'd expect (burritos, tacos, fajitas, etc.), the emphasis here is decidedly on seafood.  But even the meat dishes here are completely unique to the valley (more on that in a bit).  Thanks to the Check Please segment and the fabulous Yelp reviews, we came in the door on a Sunday afternoon.  As I expected (though to the shock of my Dad), the place is a rainbow of colors from the furniture, to the walls, to the numerous photos and keepsakes on the wall.  And yet its small enough that it feels like you've walked into someone's dining room.We got here just before the dinner rush so we got sat immediately.  My Dad and I first got a couple of Dos Equis Lagers to start.  I mention this because the beers that came out were HUGE.  The beers came in cold gigantic beer mugs to where there was at least 2 bottles worth of beer in each mug.  Did not see that coming, but a GREAT start to the evening.  Next, we (unexpectedly) each got a complementary appetizer of ceviche on a tostada.  Basically a variety of different fishes (I think I picked up octopus, shrimp and tuna) mixed with guacamole and other veggies with a hint of lime juice.  Very refreshing dish.  Then they brought out the chips and salsas (one of which was a green salsa that had a big kick to it).  All of this food and drink before we even ordered our own dishes?  Wow.My Dad got the grilled shrimp skewers that were seasoned and wrapped in bacon and cheese.  I went with the dish this place is most famous for.  A giant molten bowl of green tomatillo sauce and cheese with shrimp, fish, chicken, and beef lining the rim of the bowl (see my photo).  This my friends is the Molcajete Caliente (even the name sounds intimidating doesn't it?).  Both of our dishes came with a side of beans and rice (though even the rice was different as it was more of a rice pilaf).  While the tomatillo and cheese is bubbling hot (and pretty much stays that way), its actually not spicy at all.  But it coated every piece of meat on the bowl beautifully.  The meats were all grilled and seasoned perfectly and with a coat of that tomatillo and cheese I was in heaven.  My Dad absolutely destroyed his bacon and cheese shrimps he loved them so much.  I was going to use the Yelp check in for the free tres leches cake (which they do honor), but we were both so stuffed full of food and beer we couldn't eat another bite.  Between the great food, festive atmosphere, friendly waitress and stuffed stomaches, our first venture here was a highly successful one.Total tab for the 2 huge beers, chips and salsa, complimentary ceviche tostadas, main dishes, sides, tax and tip was $75.  The Molcajete is $30 by itself so that's what pushed the price a little higher (they also have a bowl for larger groups that runs around $40).  But trust me, this is $30 worth spending.  It can easily feed two or more people (though I stupidity tried to take it down myself).  I'll happily enjoy the rest for lunch tomorrow.  So like I said, if you're craving good Mexican food, look towards the inner city area.  Even though i was pretty excited about this place, even I was surprised how generous the portions were and by all the freebees.  Its no wonder the place was packed the whole time we were there and why it seemed like every customer was smiling.  The Maldonados originally created this oasis in the desert to help pay for their kids' college education and achieve the American dream for their entire family.  If their cuisine, staff and happy customers are any indication, I'd say the hard work has paid off, many many times over."], ["Josie M.", "I really hate having to write this because I really was hoping that I was going to have this delicious mouth watering experience after reading the reviews.    Unfortunately this was not the case, as I stepped into the restaurant the decor was something I pictured a Mariscos restaurant would look so colorful and beautiful and my server was friendly and that is were it ends.   I ordered a water of jamica w/o ice as I took a sip to my disappointment it was warm. Now I ask myself shouldn't fresh fruit water drinks be placed in ice or the refrigerator to avoid contamination? So for my meal I had the shrimp ceviche plate and as I took a bite of my tostada all I could taste is the staleness of the tostada and saltiness of the civiche and I am one who LOVES salt. The shrimp definitely was not fresh (I wonder if it may have been canned?). So I brought it to the waitress attention that the saltine crackers and tostadas were stale. She informed me that the restaurant was aware of this. Now why would a 4 1/2 star restaurant serve stale food to their customers?   Mariscos Playa Hermosa I wish I could say my food made my taste buds dance but it did not."], ["Monica O.", "Mariscos Playa Hermosa was picked for May's International Supper Club UYE and we had a big turnout expected 14 but had around 26 to 30 and I have to say management & servers didn't blink an eye when I kept asking for another chair please.  Excellent customer service!  The parking lot is very very small, maybe can park 8 to 12 cars, but there is plenty of parking on the street, so that what I did, once inside the place is very colorful and inviting.I ordered the 3 carne asada tacos with beans and rice. They were great street tacos perfect for what I was craving. The beans and rice were ok, over all it was a good dish and with tax included came in under 10 bucks! That's a great deal for dinner!  After everyone was done eating they brought us out 5 different types of cakes/dessert to try, chocolate cake, tres leches cake, coconut cake, cheese cake & flan. I'm a chocolate lovin fool and the chocolate cake was perfect, it was sweet, rich and full of chocolaty goodness, but my favorite I have to say was the Tres Leches Cake, that stuff was amazing! Also the coconut cake was great too! I defiantly will be coming back to try a few other of their dishes for sure!"], ["INubia S.", "I'll start by saying that the people who I dealt with here were very polite and hospitable. But, they seated us and forgot about us. We sat for about 10-12 min before we asked someone if we could order (after looking the menus over and deciding on a plate), so we ordered our drinks and food at the same time. The wait for the food was long as well.Our plates were expensive for what we got in return. I ordered Pescado a la Diabla, which is a fish filet in spicy sauce. The sauce was not at all spicy, not to my standards anyway, and it was salty. It came with beans, rice & salad, but a very small portion of each. There were four of us who dined here and everyone said their food was just okay. The chips were stale and the salsa tasted too much like tomato, there was no spice to it. Our table had no napkins and we had to ask for our silverware after we were given our food.The location is not very big and feels crowded inside. It was so loud it was hard to hear the waitress or the people at my table.There are no baby changing stations in the restroom. Definitely will not be returning."], ["Brian M.", "Not sure why the high star reviews. We went here with high hopes of a shining review. Instead I got bait and switched.  Chips were thick corn and the salsa was water but the guacamole sauce was pretty good. The 'drowning shrimp' was a nice start and I thought the rest of the meal would follow suit.  I thought I was playing it safe with garlic shrimp, but I was surprised that for $15 you get six medium (seriously the 25-40 size) shrimp. The 7 seas soup was watery with little to it...the main reason we drove 30 minutes to the ghetto...think Notorious BIG \"Juicy\" playing in the background as you roll up.  Homeless drunk lady harassing patrons as they waited for tables and the guy I told about it seemed to care less.  The mariachi band was a nice authentic touch and was fun, but a bit intense for such a small place.  Don't get me wrong. It's a good mariscos restaurant and if you are in the area it's probably the best mexican seafood option for more than a few blocks.My apologies for some reason my phone only saved the pic of the 'drowning shrimp' (raw shrimp over cucumber and tomato drizzled with lemon juice,salt,pepper and topped with avocado and onion ---like whole shrimp ceviche.)"], ["Cristy F.", "I only had the mixed seafood cocktail. It was not as cold as I expected it to be. The temperature and watered down flavor made me cautious about eating it. Not the best I've had. The michelada was amazing and my husbands carne asada tacos were flavorful. I would go back and try something different."], ["Justin K.", "Molcajete Caliente - best dish ever."], ["Yvonne E.", "Pinch me I have died an gone to heaven...!!! Going to the Circus found  this treasure on yelp and I'm a better person for it...!! Cant wait to come back..."], ["William L.", "Went with the family for something new. Ordered the house special Molcajete, all I can say is WOW.It had shrimp, octopus tomatillo sauce, beef, chicken and fried fish. Every food group you could possibly imagine! :)We go the green sauce, the red sauce is a LOT spicier than I expected. If you want delicious Mexican food you can't beat Moriscos Play Hermosa. Don't be afraid of the location, my wife and I were a bit worried as it does seem like it's in the middle of nowhere and in a shadier area but well worth it!.Make sure to check is as well and get that free slice of cake (we grabbed the coconut one mmmm)."], ["Charlie N.", "hmmm I must say I was a little disappointed after driving 45 minutes to eat here. I saw it reviewed on a popular local TV Show and it looked awesome so decided to give it a try.First the parking lot was really small/tight so that made it a challenge. The place was very much smaller inside than it looked on TV as well. Your table chair up against another tables chair small. You couldn't easily get in and out without hitting other diners.As far as service they were nice enough but after taking our order we didn't see our server very often. Had to ask for menus and after we received our food we had to ask for silverware. It was said on the show everyone get a small sample of the ceviche. We did not. We did get chips and salsa as well as a tomatillo green sauce. While not bad the chips and sales was not that good either. They did not give small plates or anything so the chip went into the sauce then straight to your mouth. Kind of sloppy.For an app we had seafood cocktail. It was large and pretty good with lots of different kind of shrimp, octopus, fish etc. They didn't scrimp on the seafood but at $18.00 each I would hope not! It was served with saltines which I also thought is kind of weird for a Mexican restaurant.For entrees we had a spicy shrimp dish and crab enchiladas. The spicy shrimp was good. Smothered in a red sauce it was a little hard to eat since they left the tail shell on and it was hard to remove and eat because it was smothered in the sauce. Not sure how you were expected to pull it off?The crab enchiladas were not good to me at all and had a weird smell. I only ate two bites and was done. Overall damage approached $70 for two people and I left hungry. I love Mexican food i guess just not Mexican seafood."], ["Cesar S.", "Good food but terrible waitresses. I had to get up two times to ask for more drinks and tortillas. I know it was a busy Sunday but that doesn't excuse the terrible customer service. It ruined my entire meal with the family. I don't think I'll be back.Buena comida, pero muy mal meseras. Me tuve que levantar dos veces para pedir más bebidas y tortillas.Tengo en cuenta que era un domingo ocupado pero eso no es una excusa para un servicio al cliente tan terrible.No vuelvo a regresar a este lugar.Owners of this place please hire more competent waitresses. I think you need it."], ["Terry W.", "This a great restaurant.  In Phoenix in business and found this place on Yelp.  It was pretty close to The Crowne Plaza at the airport.  Huge portions and truly authentic!!  Couldn't finish everything.  Had the Tostada with shrimp & octopus, followed by some great enchiladas!!!!"], ["Ness O.", "Drove almost an hour to come here and will never come back. I took my mom here because of the rating and for her birthday. As soon as you walk in you'll see frames and frames of how they were on the newspaper. The place is cute and We were greeted by friendly staff members as soon as we walked in.We went ahead and ordered their shrimp cocktail, shrimp tostada and oysters. When the oysters came out, right off the bat we knew it wasn't fresh. My mom ate one oyster and immediately said \"I'm not going to eat anymore\" and had a disgusted look on her face. She said when she swallowed it it wasn't cold but tasted warm so I touched one of them and she was right. We told the waitress and she got the manager. He stuck his thumb in one of them and said \"it's cold\" then says \"do you guys still want it?\" We told him \"no\". After that incident my moms cocktail came out and I had a bite from it. That was also warm and so I told my mom to put ice in it from her water. The only thing that was good was my little dish. It had a lot of chopped up shrimp and pico de gallo on top of a tostada. Man I'm surprised of their ratings.. I've had better Mexican food elsewhere."], ["Amber A.", "Everything was so good - service, food, atmosphere.  I had the caldo siete mares (seven seas soup).  The broth was so good and the fish was so tender.  Also a huge bowl.  Looking forward to going back."], ["Natasha H.", "Insanely delicious.  I don't know how else to describe my dinner there.  My husband and I were in Phoenix for a long weekend and wanted some good Mexican food.  (Thank you, fellow Yelpers, for pointing me towards Mariscos Playa Hermosa.)This adorable little restaurant looks like absolutely nothing from the outside- just a plain looking building with a sign.  The inside, though, is cute and definitely has an authentic Mexican feel.  Upon entering the restaurant, we were warmly greeted and seated. Within a few minutes, we were offered beers and tortilla chips.  We opted for guacamole to compliment our tortillas, the former of which I was suspicious at first because of the seemingly runny consistency.  Boy, was I wrong - the guac was tangy and full of flavor. I would love to have their recipe!    Based on other review, we opted for the molcajete for our main curse.  It. Was. Off. The. Hook.  It arrived in a medium-sized, deep bowl, filled half-way with a delicious spicy cheesy gray.  Along the sides of the bowl are shrimp, chicken, beef and scallops.  We just kind of pushed all the meats into the sauce and then dug in.  And while this dish is meant to serve up to 4 persons, we totally killed it and finished every bite.  (Disclaimer:  I'm a small person and really don't eat that much.... The molcajete was JUST THAT GOOD.)  The next time I'm in Phoenix, I'll make sure to return to Mariscos!"], ["R G.", "Today was the third time I come to this place and the first review I make. I am giving it 4 stars for the overall experience.  However,  being here 3 times now I can say that some of the reviews are correct, service is a hit and miss, the food depending on what you order will vary as well. We had the \"Molcajete\" which is a must order serves 2-4 depending on how hungry you are. And we had the \"Mojara Frita\" whole fried fish. Both come with rice, beans, and a little salad. It was all good and filling. If you are in a hurry don't come here, this is one of those places that is meant to be enjoyed at a slow pace. Order,  eat chips and salsa, have a drink, chit chat and wait for your food. Atmosphere is great!"], ["Caroline C.", "I got the Camaron culichi it was really good, but has to wait on my tortillas, husband got the shrimp/ pulpo cocktail with no onion but came with extra it seemed like, serve was extremely bad never came to our table to see how we were doing if we needed any crackers for the shrimp cocktail, I asked for a soda with a cup of ice got the soda no cup of ice had to wait 10 minutes for my ice had to ask another waitress, asked for one taco of carne Asada no onion Took another 10 minutes, asked for the bill and that came out in one minute not sure if I would be going back the service sucked."], ["Lou C.", "We come here about once every month or so and love it here. I like to order the molcajete, which is basically a huge pot filled with meat and seafood, in their \"Diabla\" sauce. It is spicy as heck, but I can't stop eating it! It's my favorite sauce by far. The food is always fresh, as well as the veggies they serve on the side. The staff are all friendly and very attentive to you. The atmosphere is very chill, with different cumbias playing softly in the background and a soccer game always on TV. They just recently remodeled and now there's way more seating, so wait times are cut in half. I love Playa Hermosa and am a loyal regular. Five out of five stars."], ["Mia N.", "I came here for lunch and was so surprised it wasn't packed, based on all the great reviews on here.  But, it was a rainy day so that may have deterred some people from going out.The prices here are a bit higher than you'd typically expect at a regular Mexican restaurant, but you have to keep in mind that you're ordering seafood and seafood in the desert ain't cheap.  (well, it's probably cheap at some places but it's also probably really gross at those places).  for the non-seafood entrees the prices were lower and more what you'd expect.I ordered a fish taco entree that came with 3 tacos and beans and rice for only $8.99, so that's not bad at all.  The fish was fresh and tender and I really enjoyed the tacos.  However, I did not care for the complimentary fish ceviche tostada thing they served - the fish there tasted a little \"off\" to me.I would definitely come here again!"], ["Mironda R.", "Hidden Gem.. Scary Exterior (especially IF you aren't from the area). So we found this place on Yelp.. drove around a few times and then when we found it, we couldn't believe this place was actually where we were thinking about having dinner. The area is less than inviting and at night it feels destitute.We decide to take a chance and the interior is warm and bright. Patrons are enjoying themselves and we are greeted with big smiles by the waitress.We were seated and served this pretty tasty ceviche tosta on the house. We also ordered a separate order of ceviche, that wasn't as good and took forever to come out. But skipping on to the entrees, people were pleasantly surprised.. ranging from my vegan co-worker to my meat head only co-worker. I had the fish in red sauce with rice and beans which was awesome. My vegan friend had the enchiladas with green sauce which was also tasty. I did hear the drinks were not that tasty.. so be wary of the margaritas.Good food, reasonable price. I'd give it a 2nd go."], ["S J.", "It's another beautiful sunny Arizona morning after an evening of birthday festivities...which after seeing \"Check Please\" was celebrated here at  Mariscos Playa Hermosa.We were a party of 10 with a reservation and ready to sample what appeared to be some great seafood!The restaurant is small with lots of beautiful colors and wooded tables with authentic chairs and I felt like I was in Mexico!The atmosphere was a bit chaotic ... Although they were not super busy they were running around like chickens with their heads cut off... BTW... Today's special.... Chicken! ... NOT! In reading previous reviews... The biggest complaint is the service... Or lack of it!  Boy oh boy... They were not kidding!  Why o why do they not have ample employees?  Or at least experienced ones? HEY OWNER... Do yourself a favor... HIRE SOME EMPLOYEES!!Moving right along... The place is small so you can imagine it would be loud... Which it was... but that's ok.. Made it feel more festive!It took forever to just get water and for 10 people they gave only 2 bowls of chips and tiny saucers of hot sauce... Water glasses and drink refills RARELY happened!We tried many item between all of us.The larger whole fish was moist and delicious! This was the best part of the evening!They served their complimentary ceviche which was enjoyable and might I add... A nice touch!The shrimp and fish in garlic sauce... Let's talk about that for a sec....Ok, just the other day I cooked some shrimp on the Barbie bathed in butter/garlic. Mine was equally as good if not better because my shrimps were larger.They use a medium shrimp that's tasty but nothing the average Joe can't make themselves... The fish part of the dish was a saturated fried piece... Didn't try the rice simply because it looked unappetizing and did not care for the beans... I related them to baked beans... Like in hot dogs and beans... That's the initial taste.We also tried the crab enchiladas ... Again not impressed... It was filled with crab meat but did not care for the taste ... Nor did anyone at the table.The tortillas were tortillas nothing special.Back to the service...I don't want to hear excuses like \" it was very busy\" because according you all those 5 star reviews( which I just don't get) you should expect it to be super busy on a Saturday night!One end of the table was almost finished by the time the other end got their food... The servers had absolutely no idea who had what so she pretty much passed the plates and we figured it out ourselves!  I had to ask for all the dirty dishes to be taken away as nobody came to take them.On to dessert...they knew we were there for a Birthday and we had to remind them several times.  For the birthday girl they give a piece of cake and she chose \" tres leche cake\" the cake was unlike any Tres Leche I have had.. Had a raspberry? Filling and did not taste very leche... I am no expert at this but the ones I have tried sit in the leche which absorbs into the cake making it somewhat soggy and delicious... This was different ...  I am sure there are many different kinds but it was not a hit at the table...So, they have this other deal... Where they bribe you to YELP a reviews using names of servers and when they confirm it was posted they give you a piece of coconut cake...so one of the kids at the table did it...I must say...the coconut cake was delish! Very moist and lots of coconut!Getting the check was another challenge and when we did get it they charged for 3 items of which we only had 2....Really makes me wonder... Between the REVIEW BRIBES and the mistakes on the check.... How much money they make this way?Since we live nowhere close the chances of any of us returning are slim ...On goes my quest to find some great Mexican food!I imagine when a restaurant knows they are going to be on TV they make sure everything tastes great and service is great...But on any other day you see how it really is... Don't believe everything you see on TVIt is a cute place and the fish was good... Give it a try... See what you think!Never base a decision on one persons review... Food is a preference and I am very tough critic!  Bon Appetite'"], ["Melissa Z.", "This place is family friendly and the food is fresh and delicious, Definitely coming back..."], ["Bill K.", "Saw the Mariscos Playa Hermosa menu photo layout in the Phoenix Mexican Food Guide (Mexican Seafood) section and we had to try it. It's almost 30 miles one way and I would do the drive a couple times a week for the food, service and friendliness We were taken care of from the time we entered right up to leaving. The \"on the house\" appetizers are are excellent. I like the red and my wife liked the green so much she had it put in our take home. We shared the Molcajete Catiente Mix and had enough take home for a late dinner. My beans and rice were the first empty plate and I know I had two loaded plates from the bubbling Mix bowl. The Mix sauce was so good I put it on my rice and could have made a meal from just that and the beans. I had a little trouble getting Yelp to come up,on my cell, but they had already taken our order for the complimentary \"Yelp  cake\". If you haven't tried a Tres Leche Cake you will want to make sure and order a slice here. My wife's chocolate cake was top notch too.  If you haven't read the Phoenix Mexican Food Guide (Mexican Seafood) article you want know how to get the cake. Here's a link to the restaurant: mariscosplayahermosa.com…and a link to the Phoenix Food Guide magazine:phoenixmag.com"], ["Benny T.", "Outstanding seafood restaurant. Was craving something different and this restaurant delivered. Do yourself a favor and try the house special."], ["Nick W.", "Nice authentic Mexican joint. I don't remember the name of what I ordered but it was basically a bucket of meat and spicy sauce. It was excellent."], ["Arana W.", "My first International Supper Club!I think we overwhelmed the kitchen - everything was just a bit off.Granted - it's not a huge restaurant - and I think having a group of 20 something people arrive and order at once would throw any small, independent restaurant off. Service was as friendly as could be - but it is difficult for 2 servers to handle 20 hungry and thirsty patrons. Arrival of dinners was poorly spaced - by the time the last person got her plate, the first people were done. Sides and tortillas came very late. The food itself was somewhere between decent and good. I have no complaints, but wasn't really wowed by anything I tried.I can see the diamond in the rough quality here - and I have friends that love it - so I will be back with just a small group (4 tops) to see what a \"normal\" dinner is like."], ["C H.", "For a Mexican restaurant and the area its located in it seemed really, really expensive. Our check for 2 people was $60. We both had 1 drink and 1 entree and split an appetizer. The rating is highly influenced by the total price of the experience.On to the food-- the ceviche was OK at best, it was comprised of 90% pico and 10% shrimp/fish. I've had ceviche from several dozen places and I'd have to rate this ceviche in the bottom 3 : /The 'Camarones Fantasia' were very dry (over fried a little) and small for an order/the price. It came with 6 medium sized shrimps and should have been at least large or jumbo so as not to become so dry while cooking optimally. Ironically enough, I thought the actual taste was not terrible, but I could not describe them as \"succulent\" by any means.The 'Camarones de Ajo' were very good but lacked some flavor that should have been there and that has been present in other Ajo dishes I have sampled throughout the US and Mexico.The drinks were AWESOME! The micheladas were very great and by far the best part of the meal. However, they were the most expensive I have ever bought (40% more than the most touristy of spots in Mexico, which if you understand, is saying a lot!). I'm quite confused how they can charge so much for the drinks and dishes here.The experience was not \"bad\", but its certainly not a place I will return to anytime soon.3 stars is the best I can give this place."], ["Alex S.", "To start off \"best in town\" that is definitely a big statement to back up.. \"Best of Phoenix\" is an even bigger one.  Typically yelpers are not from the Hispanic community.   Because of my Hispanic palette I would say that this place has very bland food.  Watered down shrimp cocktail, and al pastor tacos that were really not flavorful.  The restaurant itself is nice and cozy. Decorated very well and Mexico City looking with lots of color..  Staff is very nice.  But there are definitely better Mexican sea food places."], ["Tamara U.", "Okay, so first I have to mention the decor is so nice it took me back to Mexico!  It goes downhill from here. We waited an hour for our meal of fish tacos and shrimp cocktail. In their defense, they did have a large group in the back. However, when we finally received our food, my hubby's tacos were steaming hot and his beans and rice were barely warm. Also, my shrimp was a tiny bit fishy tasting which was very surprising for a place that specializes in seafood!  Overall, not bad but a disappointment."], ["Ursula D.", "What a fantastic meal I had.  I've been desiring amazing Mexican restaurants in Arizona.  Since I moved here, I've been to several places that were underwhelming, at best, and generally just not good to me.  So, I'd given up on Mexican Food in AZ and I just didn't eat any.  Well, a conversation in Yelp Talk about Mexican Food inspired me to check out some different places and this one turned up in my searches on Yelp and other websites.I'm happy to say that I was so thrilled and enjoyed my meal very much at Mariscos Playa Hermosa.  Again, another hole-in-the-wall, but still quite the find.  Mariscos is located in a pretty seedy part of town, so don't get nervous going there.  They close early, so you'd better arrive early.  You will find that there is a full bar inside this colorfully decorated resto.  Don't eat at the bar.  That things not suitable for anything except decoration as the bar itself doesn't extend out far enough to make it comfortable to sit there.  (this is a tip from a person who opted to sit at the bar)I tasted a few items off the menu.  The shrimp in diablo sauce was my favorite.  I ordered extra diablo sauce on the side.   The sauce has a smokey taste with the heat of the peppers.  Perfect for my heat seeking taste buds.  They prepare the sauce \"fresh to order\".So there is a charge for $3 for the extra sauce on the side to go.  I used that sauce to make more shrimp diablo at home later that week.  I also enjoyed the camarones culichi... shrimp in green sauce.  Culichi is a tomatillio sauce made with some dairy product and cilantro and of course the poblano or tomatillio peppers.  The sauce is simply to die for.  I left there satisfied and happy!  I will return and take a friend for the Molcajete Caliente with verde sauce.  Can't wait.  I'm sure it will please.They have a check-in offer too, so be sure to check-in.Oh, that parking lot is TINY.  Be aware of that when you go."], ["Asina G.", "So we pull up and the first thing we see are 2 Phoenix police cars -- SCORE!  You know cops always know where to find good food!  LOL.  This place is fantastic!  After only one visit, I'm rating it a conservative 4-stars, but I can easily see upgrading to 5-stars after a few more visits.  The food is the star here.  We ordered the ceviche with fish and shrimp to start, and it was well-balanced and fresh!  One ingredient didn't overpower the others.  It's served with adorable tostada rounds versus chips, but you can always use your chips they automatically deliver to each table also.  Neither my BF nor I were super hungry, so we both ordered tacos -- I ordered the shrimp tacos and he ordered the fish tacos, and then of course we shared because, well, that's what we do.  I'm always hesitant to have my tacos served with cheese already served on them, but I'm so glad I didn't order cheese on the side!  My tacos were in toasted flour tortillas (they normally come with corn tortillas, but I asked for flour) and had the perfect amount of melted cheese holding the sides together.  Just thinking about them makes my mouth water.  The pinto beans served with the tacos are also really flavorful.  (They're also served with some greens, but I didn't eat them -- who has time for salad?)With a Yelp check-in, you get a free slice of cake, so we ordered the coconut cake. OH-EM-GEEEE!  This is literally the best coconut cake I have ever had in my life!  The flavor of the coconut really shines through and is not diluted by sugar or cake.  Neither of us could believe how good it was.  Even as we were getting up to leave, my BF was scraping the plate clean of the rest of the cake. LOL, greedy self!The only possible area for improvement are the margaritas.  I initially ordered just a house margarita and my BF ordered the mango margarita.  Although the flavor was good in both drinks, the tequila was lacking.  I'm not trying to get lit off of one margarita, but I should feel a little something. LOL.  But we both ordered the Cadillac margarita as a second drink and that one was WAY better!  Next time I'll just start with that one. All in all, a pretty great experience, and I look forward to going back to try more items (and get some more coconut cake)!"], ["Mike F.", "I really wanted to love it, but couldn't.  The food was good, but it didn't pop.  I had the garlic shrimp which had some nice flavor, but it wasn't unique and it didn't speak to me.  The guacamole was good.  The shrimp in garlic sauce was pretty good.  Service was solid.I might need to come back because the menu was extensive and it could only take one or two excellent items to change my mind on the place."], ["Dan P.", "One of the better Mariscos places in Phoenix. Ceviche is very fresh and goes well with some cold beer."], ["Jeannine P.", "Nothing to brag about here but the decor.Ive had better Mexican seafood in food trucks."], ["Teresa J.", "So my husband and I were looking for someplace to celebrate our anniversary. We both love seafood and found this place. It reminded us of the first time we went to Mexico together so many years ago. The chips and salsa, especially the green salsa (in my opinion) were very good. We shared the molcajete and it was so very delicious. The green salsa in the middle is extremely tasty. I have no idea what is in it, but I would eat it again. The hubby had the $5 mug of Tecate and I had a Corona margarita. We definitely plan to come back!! The service was attentive and helpful, since it was our first visit I asked a lot of questions and our waitress was patient! Can't wait to go back!"], ["Thomas T.", "I had the cocktail with everything. It's been 6 hours since I last ate and I am still full!! Portions are awesome and the service was great! I will be coming back very soon this place is legit!"], ["Luz M.", "Very good food. Very good atmosphere!!! We will definitely come back!!! The tostadas and the fried fish were excellent. The fish was very moisture."], ["Izak M.", "I walked here from the Sheraton after dark - don't do this! Once inside - I was in an oasis of great food and margerhitas. The atmosphere is festive with a colorful fish motif like I've experienced in Mexico.The tortilla chips were fresh made as we're the tortillas that came with my meal. A complimentary ceviche was provided. I had the fish filet with shrimp and octopus in mushroom sauce. The plate was huge with sides of salad, rice, and beans. The food was delicious. I was alone so my review can only consider one visit and one dish - but, I've been trying to minimize calories yet cleaned the plate.Another great seafood dinner in Phoenix - who'd have thunk it. Mission accomplished."], ["Cody S.", "This place was a lot of fun. They had a band playing in their during dinner. We will definitely go back again!"]], "Los Taquitos": [["Matthew F.", "Whoa, get the breakfast burrito with chorizo!This place is just up the road from one of our offices in Tempe.  On Taco Tuesday's, you can get street tacos for $1.  The line apparently wraps around the building.Located in a strip mall, the restaurant itself is very clean and modern.  Awesome paintings and decor throughout.It took about 10 minute for 2 breakfast burritos to be made and served, but it was well worth the wait.Upon unwrapping the steamy beast, it just looked like a regular burrito.  Biting into the flour tortilla released a perfect blend of cheese, chorizo, egg, and potatoes that sent the taste buds into a wild Jarabe Tapatio.The heat from the chorizo lingered long enough to warrant another few bites.  Within three minutes, the burrito vanished into the neglected pits of my stomach.This place warrants a pit stop if you're cruising into or out of Phoenix."], ["Jim W.", "A great place for a quick meal in Ahwatukee! (Thanks to Yelper Mark E. for the tip!)Food:The menu is extensive! I saw so many things I'd like to try, and settled on a Breakfast Burrito \"naked style\" (no tortilla, in a bowl). I had it with chorizo, pico, and their excellent green salsa, and it was delish! Cost:Very reasonable. One burrito (to go) with no drinks was $6.28 including tax.Service: Today they were very crowded. Even so, my order came out promptly. The staff were helpful and friendly.Atmosphere:This is a small, family owned restaurant in a strip mall. That said, the interior is nicely done, Mexican music is playing, and the staff keeps it very clean!Overall:A definite repeater! This place is now on my local \"short list\"!"], ["Mike D.", "I hadn't been here in quite some time and I don't know why.  The food here is great, the prices are cheap, and the atmosphere is greatly improved since they remodeled the place.  The tamales and tacos are both excellent and I didn't get a chance to try the quesadilla but I couldn't stop staring at the one on the next table.Taco Tuesday provides $1 street tacos on 4 different varieties (Pastor, carnitas, chicken, and marinated chicken when I was there)."], ["Andrew C.", "In the mood for quick and amazing Mexican food? Los Taquitos is the place to go! Weather it be for Street Tacos, a massive Burrito, or tamales, you can expect an awesome meal here.Meg and I have come to Los Taquitos more times than I can count. The service is always quick and friendly. With their new renovations they now have a wide open and colorful dining area with plenty of tables for groups big and small.Of the many things we've had, it's a tie between the Street Tacos and the Tamales plate as my favorite. The three street taco plate comes with all the fixings, your choice of taco meat (which can be different for each one), rice and beans. I recommend their Carne Asada which has the perfect flavor to it.The tamale plate is the closest thing to my Nana's homemade tamales I've found here in the valley. The beef tamales were really fluffy with spicy red chili beef cooked in. The plate comes with two tamales which, like the tacos, can be a mix of their three flavors: Beef, Chicken, or Cheese. I can go on and on about all the things we've had there because we keep coming back any time we get the chance. The food speaks for itself as some of the best in Phoenix."], ["Matthew G.", "The remodel is so nice, really digging the modern look. Been coming for breakfast burritos, and they have not let me down! A little pricey for a breakfast burrito, but very good and worth it. Wait is also a little frustrating, but again, the burrito is very good."], ["Karen M.", "So happy to find this local establishment!  The husband and I were wanting something quick and filling after working on house renovations and after a desperate yelp search, I found Los Taquitos with numerous complimentary reviews.  When we arrived, we were underwhelmed by the boxy feel of the interior -- the restaurant is essentially a box with tables around the perimeter and down the middle -- but the place was clean and everything smelled great.  What we DID appreciate was our food.  Really nice flavors, very filling, and fresh.  My husband got a veggie burrito and it was huge.  I ordered the veggie bowl and really liked the hashbrown-style potatoes (and the beans...and rice... and veggies...and sauce...).  Prices are reasonable (about $14 for the two of us) and wait time was pretty short.  If you are ever in Ahwatukee and are craving some Mexican eats, check out Los Taquitos."], ["Ravi T.", "Delicious street tacos!  Clean and friendly service with fair prices... Definitely a repeat customer!"], ["Victoria C.", "The tacos are ok ugh I'm disappointed! The carne asada was dry and it was just ok! Moving to the area I was excited to try them but maybe next time!Few hours later, heart burn."], ["Victoria C.", "Chicas caliente, fresh tasty food and awesome margaritas, per my husband.  Lol. Strong and tasty house margaritas.  I had half, and was buzzed, proceeded to pass the delicious other half to my better half. aMy husband commented on feeling his first margarita.  And he can hold his liquor.  Drinks legit!  To legit to quit! Haha. This place is pretty damn good.  The veggie tacos and chili relleno burrito are delicious! The accompanied red and green sauce are hot and flavorful!  Can't wait to come back! Thanks for the suggestion Lalo!"], ["Chase W.", "Been coming here since 2002. Consistently delish. The new renovations are great for the family. Every time I've come lately they haven't had carrots and jalepenos. I miss them. Bummer."], ["Ashley D.", "Good food but not the best service. They need to work on their customer service. I'll eat here again but I wish the girls were nicer"], ["Ryan P.", "Nice place with a fun ambiance. The tacos are good. I've had better but I would recommend this place if you are in the area. The best meat was the carnitas. Lots of flavor and juicy. Definitely do the carnitas on whatever you get. The Asada had a nice grill flavor. The Asada could have been slightly juicier but it wasn't dry. The pastor was good. Had a hint of spice and overall pretty good. The Asada and the pastor would tie for my second favorite. The chicken was nothing special and my least favorite. It didn't really have much flavor and was on the drier side. All in all pretty good but if you are willing to drive about 20 minutes there are a number of places that I would choose first. The price was right for the tacos at $1.50 each. You can fit 8 adults at the booths and there was plenty of seating otherwise."], ["Stephanie P.", "My husband just had to try this place way before the renovation because of the Diners Drive ins and dives place featured them at one point. Really great street tacos and quesadillas! The chicken on the salad is a little dry so I'd recommend getting it on other things. The new renovation looks great and gives the place more room for sure! It is our go to place for tacos."], ["Ethel T.", "(Leaning more towards 3.5 stars rather than 3, but not quite a 4.)  Finally stopped by after their renovations and it looks nice!  They've definitely expanded and they added a ton more seating.  I love that they kept the murals on the walls, cause to be honest, that was the best part of their decor.  Their menu is a little hard to read and that might hold up the line, so guys and ladies of Los Taquitos, if you're reading this,  laminated menus at the start of the line might be a nice touch?Customer service, once again, wasn't great, but I've lowered my expectations since my last visit.  However, I was pretty taken aback when a very cheery and polite lady handed us our food to go.  I almost wanted to thank her for actually smiling but that probably crosses some sort of line between normal and creepy so I kept my mouth shut.Food, food, food.  My boyfriend got the burrito bowl, which was a little smaller than expected, but still tasted great.  Was expecting beans and rice on the side, but since you already get beans and rice in the bowl, I guess you don't get more (yes, I'm greedy).  I need to read that menu again.  The tamales with beans and rice were good, tamales a little dry and crumbly and needed some reheating by the time I got home (probably takes us 10 minutes to get home).  I am in love with their red salsa though.  It has a little bit of a kick, and everyone needs a little spice in their life.Word of advice, don't do takeout.  It's still good, but from my experience, it tastes a ton better fresh.  Plus, soak up the atmosphere - it's a much livelier place than the hole in the wall it was before.  Though I kinda liked that hole in the wall...dammit, nostalgia!"], ["Edward L.", "All I got was a bean burro... very salty, very long line, act like they are better than you..... I will spend my money elsewhere... have a nice day....."], ["Mayra C.", "Solid 3.5 stars. Got sopes, burritos and tacos. All were requested with asada and were delicious. Refrain from the guacamole- it's basically smashed avocado with a bit of salt- super bland. Burrito was really good- from the tortilla to the beans. Meat was seasoned perfectly. Sopes were also on point- had sour cream, lettuce and pico de gallo. As far as tacos go- niece had them and loved them."], ["Justin B.", "Amazing food. Amazing staff! Great prices. Kinda slow on taco Tuesday but can't complain for dollar tacos!"], ["Amanda H.", "Saw this place on DDD and knew that when we moved to the area we would have to try it.Fresh food, quality ingredients and prepared perfectly. Carnitas street tacos are to die for. Their hot sauce is great. Service is fast, but don't always expect to get a table. It's been very busy each time we've come."], ["Taylor R.", "Hands down one of the best places to grab a burrito or tacos! Personally, I'm a huge breakfast burrito fan, and Los Taquitos' always hits the spot. My boyfriend always gets some sort of a burrito from there (even though it's not a breakfast one) as well. Their tortillas taste so unique, and that's honestly an important part of a burrito! They have amazing rice and beans, and their red and green sauce is pretty decent as well. 10/10, would eat here 7 days a week if that wasn't extremely fattening."], ["Traci H.", "Lovely family owned restaurant. This is my second visit in 2 weeks. My daughter introduced me last week and I was highly impressed with the customer service and the food. Green chili tacos, yummy!Unfortunately today was not a good experience. Girl (SHORTEST of all behind the counter with all black hair and braces) offered no hellos as we approached. My daughter greeted her but she struggled with a response. Seemed unhappy to be working yet greeted customers behind us. Customer service brings people back. Makes people talk about your restaurant. Also, my green chile tacos had no green chile sauce on it. I was sadly disappointed! I will think hard about returning."], ["Vince S.", "Still awesome after the remodel!Food is as good as ever. Now the seating area is larger and more spacious."], ["Angi S.", "This place is amazing.  The food is truly authentic and offers a wide variety of good, home-style Mexican food.  Los Taquitos was featured on Diners, Drive-ins & Dives and is constantly busy.  My favorite dish they offer is the carne asada sopes; I also really enjoy the ceviche. However, they do cook up a mean breakfast burrito."], ["Diana M.", "I kept forgetting to write my review but I love this place! I used them for catering for my babyshower back in feb and everyone(40+) loved the tacos and asked where I got them from (I did just tacos carnitas, asada, and pastor). The ladies are all very friendly and helpful. I'm upset I just moved farther away but it will be worth the drive! I've tried different dishes and have not been disappointed yet. The sopes are sssooo good!! They also recently renovated and the place looks great!! DEFINITELY recommend trying them out:)"], ["Cheryl S.", "Finally! A place for good tacos! I'm from southern CA and love Baja style tacos and finally found some here in AZ. Homemade refried beans were yummy too and good rice! I had a prickly pear margarita with my meal which was a bonus. It's in a strip mall and it feels fast-foody (you order at the counter) but I didn't mind that. Will definitely be back when I want Mexican food."], ["Roderick S.", "Pretty good, but not the best. I compare all Street taco places to a lunch truck in Vegas behind the Walmart on Boulder Highway. That lunch truck had the best tasting tacos EVER! This place was kind of dry and not a great selection of salsa. Typical Mexican fare , little pricey for average quality, but I'd rather go to Polibertos on Baseline and hardy in Tempe. The biggest disappointment was the music selection. IT WAS TERRIBLE AND NOT FAMILY FRIENDLY MUSIC. I was annoyed because I was there with my wife, 11yr and 3yr old daughters, and the music was TOO promiscuous for my taste. Better suited for clubbers. Not family friendly environment when music is blaring about sexual content. AND YOU HAVE TO PAY FOR TORTILLA CHIPS AND SALSA. POLIBERTOS IS FREE SALSA AND TORTILLA CHIPS. MANY OTHER PLACES THAT ARE BETTER, NOT WORTH THE EXTRA DRIVE."], ["Mark C.", "I went here with very high hopes, given the good reviews on here.  But I came away thinking that it is unlikely I will ever go back.Service - the cashier was not friendly and got confused over me telling her that I wanted a crispy taco.  She thought I was asking for all of the ingredients to be fried to a crispy texture.  Really?Food - I have been looking for a great shredded beef taco, and this is definitely not the place.  Cheap hard taco shells that are not cooked to order (think Taco Bell) - no wonder she had no idea of what a crispy taco is.  The meat essentially had no flavor at all.This was my first time going to this place, so, in fairness, maybe they have better tasting food on the menu.  But I came to a place called Los Taquitos, looking for a great tasting taco.  I left very disappointed, and without any desire to return.  I guess my quest for the perfect taco will just have to continue."], ["Dan W.", "Always double check your order if getting take out. I have yet to see them get an order right."], ["Ann H.", "This is our go-to torta place.  They recently expanded and updated the seating area, providing for more room and better ambiance.  Everything we have gotten here has been delicious, but I recommend the Carne Asada Torta and any of the burritos made into a bowl.  Lovely owners and amazing food."], ["Lily H.", "We were looking for a place to go have dinner since we had gone to Arizona for the Dodgers spring training for the weekend. We were all craving Mexican food. One of our friends who lives out here recommended this place to us so we googled it to get the address. We got there and took at look at their menu, it was a hard choice. Everything sounded too good!! But I guess cause we were super hungry. Well we ordered not knowing what to expect.  It didn't take to long to get our food either wit it being kind of busy and only 2 people working the front floor. We sat down took one bite of our food. And let me just tell u! It was beyond bomb!!!! for it being our first time we were impressed. They meat has a delicious taste to it. We would definitely go back when we're out in Arizona."], ["Andrea C.", "Growing up Mexican, I have pretty high standards for Mexican food, and this place delivers. Food: Absolutely delicious. I recommend the al pastor burrito. It's so good that within the first bite, I instantly wished that I had fifty more. You could taste the pineapple in the meat, which is so tender and not lacking in flavor at all. The burritos are a good size, big enough to leave you full but not Chipotle-sized. Both the red and green salsas are incredible. The horchata is delicious; I usually find that a lot of horchatas have the problem of being super sweet, but this one has just the right amount of sweetness and cinnamon flavor.Service: Many people are complaining about the wait time, but every time that I have come, I have never waited for longer than a few minutes. I've never thought that the employees were particularly rude, just as polite as they needed to be. Decor/Cleanliness: They have recently remodeled and I must say that it's a nice upgrade. Before, the place was tiny, a very hole-in-the-wall establishment with not much room for seating. However, now they expanded into the business next door and it looks a lot more open and airy. They also upgraded their signs and menu board to look a lot more sleek and refined. The only thing is that in their old place, they used to have a huge mural that I really loved, but with the remodel, they had to tear down that wall. There are still murals of La Catrina and such, but I really loved the last one. Very clean, never once questioned how hygienic the place was."], ["Bryan M.", "Delicious Mexican food spot in Arizona! Guy Fieri (from Food Network) has eaten here! thought that was really cool! I'd definitely be back next time I'm out in AZ! Their tacos are great!!!!"], ["Beatrice C.", "Guy Fieri definitely knows his food!I had the three taco plate- carnitas, fish and pastor- all incredible. They were a bit small but the flavors were big.The cashier also convinced me to try the imported mexican apple soda. I was skeptical but she told me it was her favorite so I had to get it. When in Rome, right?! It complimented the tacos well and I felt as if I had just stepped over the AZ/Mexico border to get some authentic street tacos."], ["Kelly B.", "Their tacos are awesome. I haven't tried anything but taco Tuesday's and thought it was delicious."], ["Leo M.", "I was in Phoenix for business and Yelped good local Mexican cuisine. I stopped by Los Taquitos and it is solid. Tried a few things to sample the menu. I had chicken tacos (both grilled and shredded) and a green chile pork burrito. All three items were excellent. The shredded chicken was amazing. They feature a large street taco selection and the restaurant is a step above local taquerias. It's worth making a trip too. Food is good. Vibe is good and well priced. Go check it out. I will be back."], ["Ivan G.", "Great food and atmosphere!  Love the carne asada anything but the whole menu is tasty.  The tacos and the quesadilla are my favorite.  Don't forget to grab a bottle of classic Coke too."], ["Ric H.", "One of the rare reviews that I'm writing right after eating, and still sitting in the restaurant.  I ordered the Asada Taco plate, three fantastic tacos, good rice and excellent beans.  On top of that I ordered one pollo tamale on the side.  OMG it has been too long since I've had a good tamale.  Even the ice tea is fresh and tasty.  Highly recommend, and definitely worth the drive from south Chandler!"], ["Cami K.", "I can't imagine coming back. I have been a couple of times and really don't get the good reviews. There is so much better and for less! But today helped me decide to review. I called ahead to see what was on things. I asked about the nachos and the fajitas. I was told that the fajitas came with guac and sour cream so I ordered them. I go pick them up and not one person smiled at me. There was one other customer and she got no smiles either. When I paid I did get a thank you but still no smile. I paid and waited for my food. There were no straws so I asked nicely for one and was given a look of hate and finally got my straw. how dare I ask for a straw for the $2+ 20oz sprite I ordered. Anywho I go back to work with my food from the angry place and open it up. I figure maybe this will be awesome! Yea no. First of all no salsa, guac, or sour cream to season the lackluster fajitas. And on top of it they give you one tortilla. for fajitas! So I call. The girl was not that friendly, not that apologetic, and says I will get 20% off my next visit. I work in a huge call center and will make sure that nobody I know goes there so yea probably not going to be using that 20% off coupon. What I want is my $11 bucks back for this unseasoned pile of beans, rice, and chicken.  But thanks anyway..."], ["Mark H.", "Good street tacos and nice service."], ["Kevin S.", "Eat here regularly and have for years now.  It's definitely the BEST Mexican food in Phoenix.  Newly remodeled, they've increased the seating capacity greatly.  They've also increased the counter space as well, so 2 people can order at once now.  Their AZ Burrito, smothered with Green Chili sauce, is to die for.  I honestly have NEVER had anything on the menu over the years that I didn't like!  GREAT CHOICE!"], ["Tobias D.", "Don't go on Taco Tuesday.  Stood in line for 15 minutes and then waited 30 minutes for our order.  They couldn't handle the volume and were more focused on the phone orders (you could see the orders piling up on the back counter) than the 15 customers standing in front of them waiting for their food."]], "Carolina's Mexican Food": [], "Most Wanted Taco Shop": [["Ben L.", "This place is amazing!  I just moved here from Chicago, IL. And I live within walking distance of Santos Lucha Libre.  Coming from Chicago, I had a few local Mexican places that I loved and was hoping to find something comparable in Phoenix (I mean AZ is way closer to Mexico than IL, right?).I saw that other review by a woman also from Chicago, and I wholeheartedly DISAGREE with everything she posted.  She doesn't know what she's talking about!And boy was I glad to find Santos Luche Libre!  They found out it was my wife's and my first time there, so they let us sample the meats.  Oh man, each one was fantastic.  Some spicy, some smokey, all exploding with flavor.  My wife got the five street taco plate and I got the 3 large taco plate.  The flavors were amazing! The service was very friendly and the decor was bright with a Mexican wrestling theme. The Mexican pop music was decent and provided a great ambiance for our meal.  The salsa bar was really great, there were 4 different salsas to choose from, varying from VERY HOT to mild.  The VERY HOT was by far the most flavorful.  We both agreed that the two green salsas were the best.  The salsa bar also had limes available, which was surprising, considering the drought in California and the skyrocketing price of limes.  I'm very excited to be close to this restaurant and we will definitely be back, probably at least once a week!"], ["Deena H.", "I guess you have to live in Phoenix in order to appreciate this place. My friend and I came in and had high high hopes for a restaurant that has 122 reviews and 5 stars on yelp. Let me preface by saying this: it does matter where you are from in the USA when it comes to the appreciation of the fine food arts. The special sauce on the massive burrito smelled like booty. It was sad. The ingredients inside the burrito were relatively fresh to be honest but nonetheless the booty sauce killed it for me. Maybe I got the bad batch that fateful Friday afternoon. There were two people working and it was busy. They have a salsa bar that was limited and not much to the imagination. I am sorry Phoenix but you need to come to Chicago and try some Mexican food. I realize Phoenix is way way closer to Mexico than Chicago but good LoRD do they not know what good food is. You guys got us beat when it comes to weather but that is it. Either that or the heat has killed their taste buds. This is not a five star restaurant."], ["Eileen G.", "Delicious! Authentic! Generous! Cheap!First mexican restaurant that exceeds expectations since moving to arizona. Thought I'd be drowning in delicious mexican food when I moved here but it's been like a needle in a haystack finding a good burrito! I mean the fact that chipotle was the tops said it all, smh.Fun atmosphere although the mannequin playing the piano kept me looking back over my shoulder lol. Has a chipotle like assembly line but they offer tastings of every topping and meat like an ice cream shop. Very considerate. Few beers and Mexican sodas but most importantly there was a vegan option for me and plenty of meat options for my hubby. Generous portions and very friendly staff and you could tell all the ingredients were fresh. Nothing says fresh and nothing to hide like an open kitchen and fresh avacados sliced in front of you to go on your burrito. Salsa bar topped if off though I wish they would label the salsa flavors, it was hard to guess what was hot or mild. We got drinks, salsa, 2 massive burritos and soft tacos and our bill was still under $30! Now if I only lived closer.."], ["Andrew C.", "I hate to break it to you, but I'm not sure why this place has all the hype (#39 on yelp's 100). Maybe it was an off time, maybe it was an off day, but me and my group did not think this was anything worth writing home about.I got the 5 street taco platter that was so highly recommended. Bacbacoa, Green Chile, Adobada, Cochinita Pibil, and Tinga (mixture between beef, chicken, and pork).All of the meats resembled mush. Maybe i'm used to california and texas tacos, where there are real chunks of meat, but none of these were too satisfying. On another note, it's located in the corner of a small strip mall, the waitstaff is friendly, and there's plenty of space for big groups. Overall, not my cup of tea."], ["Adam C.", "¡Cochinita Pibil es caliente y muy muy delicioso!Translation: why are you still reading this, come eat here right now. Grab yourself a few tacos, try all the meats and pick your favorites. I'd suggest the cochinita if you like spicy, or the carnitas if you like it mild. After your are full, come back tomorrow and try something else, it's all awesome food."], ["HoyMay P.", "We were surprised upon rolling into the parking lot.  We noted that Los Luchas Libre's name had changed to Most Wanted Taco Shop.  We hesitated and hoped it was the same.  Much to our relief only the name has changed.  The same staff were present and the food is just as good as previously.  the staff recognized us as we mentioned we were hoping that had not closed their doors.  We have brought friends here and they love it as much as we do.  Prices are extremely reasonable even with a slight raise in cost.  Visit this place and you won't be sorry by the taste and staff.  Bring a new guest and they can sample the various meats being offered for tacos or burritos."], ["Jack N.", "This used to be Lucha Libre but is now Most Wanted Taco Shop.  No idea why Yelp rolled the reviews over because it is not the same place other than the location.  Half of the building is under construction and many menu items are not yet available.  The food isn't the same nor are the employees.It is still an order at the counter and sit down place but the salsa bar has completely changed and isn't near as good.  The food is okay. I tried the barbacoa, spicy pork, and carnitas.  The flavors were all very similar.  Nothing really stood out on its own. The toppings weren't as fresh as I would have liked.  They also knocked down a wall and half the place is a construction zone."], ["Dorian S.", "Wow - a hidden jewel in phx. A great mix of food, atmosphere and reasonable prices.  We found through yelp and needed Waze to navigate the 30 minute drive from Scottsdale.  Was well worth the trip.Ladies behind the counter gave us samples of the meats in little containers - luv the carnes cita. I had the 5 small tacos (7.50) and my wife had the fish tacos for $8.99. With the tacos you can have a variety of meats if you like. They then top with cilantro, onions, cabbage, tomato, roasted corn and sour cream.  Two thumbs up. The only disappointment was RC Cola in the  fountain dispenser but they had a great selection of Mexican bottled drinks. Something for everyone. Well worth the trip and will come back on our next trip to phx. Thank you yelp community for highlighting this restaurant.Also if you grab a copy of the local Sunnyslope Plus magazine/free paper they have a $1 off $5.00 or $2 off $10.00 order (June 2015)."], ["Kelli S.", "Oh the selections they offer! I couldn't understand half of what I was told to try from the worker there, BUT I loved my food anyways! I played it safe and got carnitas tacos because I knew what it was by name lol and the hubby got others...sorry not much help, but we were both so happy! I think he got a chicken taco in different sauces...idk it doesn't matter because yum! Great street tacos and location is run by a family which is fantastic! Great job guys! I hope this place survives a very long time and brings you much happiness!"], ["Joel P.", "My wife and I found this on yelp driving through Phoenix. So glad we did! These are some of the best stinking tacos I've had. The variety of meats offered is quite the spread. We let the owner, who is the nicest lady ever as well as her daughter, know it was our first time and they let us sample the meats. Sample the meat!! Every single one tasted like heaven and we loved it. Every time I drive through Phoenix I will definitely be coming here. I pleaded with them to open up one in my home town.We got the 5 small tacos each with various meats. So amazing! We loved it so much we got burritos to go for dinner. Best taco shop I've ever had."], ["Martha N.", "Hole in the wall on the edge of town: best tacos ever!!!Chicken, pork, and beef prepared in 10+ ways in 4 or 5 levels of spicy. Beef in green salsa! With pickled red onion!! To lick your fingers!!!"], ["Nikki H.", "If you've ever wanted variety in your street tacos, this is the place to go. There were 10-12 different meats to choose from, including an assortment of chicken, pork, and beef. After choosing your meat, you top off your order Chipotle-style, choosing which toppings you want to add. While we were deciding what to order, we were offered samples of the meats since there was no one in line behind us. Make sure to do this if you can as some of the meats are spicier than you might think. This was great for me though, as I love spicy food. My favorite meat wound up being the green chile beef. It was nice and spicy, while retaining a smoky beef flavor. I wound up ordering five street tacos, all with different meats, then topped them off with pretty much every garnish they had available. My hubby ordered their burrito (enchilada style), and it was HUGE. The assembling of our order was a little on the slow side, but the owner mentioned it was one of their employee's first day. We weren't in a hurry, so we didn't mind. In fact, we were so not in a hurry that we didn't realize the restaurant closed at 8 and we wound up hanging  out in the restaurant about 40 minutes past closing time. The owners never said anything or tried to make us leave. As we left, we saw them in the other half of the restaurant (there's a wall that separates the ordering and dining areas), and we apologized profusely. They were very gracious and just thanked us for coming."], ["Melissa R.", "Great food! I love that they let you try the meats before you order. It makes it easier to make a decision. I had the green chile pork quesadilla and it was excellent. Everything was very fresh and cooked right in front of me. This is a place that I won't mind turning into a regular stop."], ["Timothy C.", "Had the five small tacos, churro, and Mexican coke. Tacos were tasty and fresh, churro was freshly fried crispy and a little gooey in the middle. Everything was good."], ["Erich B.", "Awesome place. The taco very authentic for what you will find in Mexico. I stopped her for lunch on Sunday. Not crowded. Very clean. I had the fish tacos. They were excellent. Crunchy and tender inside.  You can top it with anything they have like cilantro onion cremation etc. I also had 3 small tacos: barbacoa, green chilli chicken and carna asada. The barbacoa was my favorite. Deep flavor and med heat. The others were great also..Can't wait to return with my wife!"], ["Leah S.", "Delicious, street-style tacos in a unassuming strip mall. First time diners are offered a taste of each of the meat selections. Last time there, they looked to be expanding (bar!) and even added a few more items to the menu. Street tacos are always a smart pick, as is the Burrito Bowl. The guacamole is delish, as evidenced by their often running out. Haven't been in since the name change, guess I'm due for a visit!Consistently good, friendly, independently owned."], ["Roddy B.", "They finally lost the name infringement lawsuit filed in California. They are back open and now called Most Wanted Tacos Shop. Don't panic! They are still FANTASTIC!  I can't get enough of the very spicy Morita pork tacos. So much so that I have decided to become a Sumo wrestler and these bad boys will be my ticket to get there.-I you feel this review is Useful, Funny, or Cool, please check the boxes below. Thanks."], ["Angela H.", "Street Taco HEAVEN!  The pork, and the beef.  ASADA ME.  Grilled Cactus and Homemade salsa.  AND CHEAP!   I am wasting your precious time.  Just trust.  However parking is minimal.  4 spots in the front.  Building is up on a hill next to the mechanic shop."], ["Roam J.", "Flavorless asada. Soggy barbacoa and green chili pork that packed more heat than flavor.  The churro with caramel dip was good, but sorry...I'm not in sync with all the rave reviews here.  This taco shop is more trendy than authentic, and was simply not that good."], ["Lucas R.", "I loved this place! I cane here with a friend and one of the employees greeted us and immediately insisted we sample all their meat selections. I did the green chile pork burrito which was fantastic. Might I even say better than Chipotle?Similar concept to Chipotle, but better all around. Great fun and funky decor. Music was interesting, it started out good then got weird. That's probably the only thing I would change...I marked this as good for kids, but be careful, many of the meats are spicy!!"]], "Crescent Ballroom": [["Lorna W.", "Fabulous little gem attached to the Crescent Ballroom. A casual, upbeat restaurant with American and Mexican fare. Not your run of the mill offerings, though. Cocina 10 puts its own spin on favorites and we haven't been disappointed. I highly recommend the blackened salmon salad. It's a source of culinary comfort to me. The seasoning is perfect. The veggies are crisp. Mango! Houston, we have mango. DH is working through the menu and has already been delighted by the Lolo Burger and Street Tacos.The desserts struggle. There is chocolate bark, rice pudding, and mini churros. I would like to see one large piece of cake for sharing. That is my only complaint. One of the best things about this place is the people who frequent it. A very diverse, pleasant crowd."], ["Amanda T.", "The food is good ,drinks are good and seeing a show here is the best venue I have ever been to. Its small but not to small. The shows are always great and 90% of the time the artist will hang out at the mech booth and take photos/sign things. They give you free soda if your driving your friends that are drinking. Which I love! They support not drinking and driving. If its an all age show they rope all the under 21 in a small area. So you can sit in the stand (they have a area to sit! that doesn't ruin your view). I buy tickets to see any band that is just ok , because I know it will be a relaxing great time coming here."], ["Dave H.", "Crescent is one of my favorite venues in the Phoenix area.  They host a large variety of shows and the staff is all very friendly.  They've recently expanded out the patio areas and it's helped a great deal in alleviating the cramped feeling you could get.  The only negative thing I can really say about this place is the bathroom situation.  Make sure to stand in line for a bathroom before you need to go."], ["Alesha R.", "We have seen lots of fun shows here.  The food was over priced in my opinion, but the live music and band atmosphere is Oh So Amazing!"], ["Clementine E.", "It is the third or fourth time that we've come here and we were never disappointed. The few times that we came was a Saturday night for a concert, so we would get one or two drinks before and enjoy our night in the back room. But this Monday we decided to come for happy hour, their house craft beer is actually very good, and $3 for a pint, what a deal! They have their chips&salsa for $1! Seriously $1, who can beat that? My boyfriend and I decided to get the Lalo Burger, honestly the best burger we've ate in a long time! Their patio is very very very nice, love the high tops. I highly recommend this bar in Downtown Phoenix!"], ["Jon H.", "Have you ever experienced that moment where you realize you're not half as cool as you think you are? Yeah... well Crescent Ballroom did that for me. The first and only time I've come here, was to play Bingo. That statement alone should be enough evidence to myself and anyone else who will listen that my days of coolness have passed. If they ever existed at all.This place is pretty sweet. I had dinner before Bingo because grandpa (me) knew it might be a late night and I didn't want to eat after I left here. Doing something like that would lead to a night of indigestion and no sleep. Psssh... who needs that in their life. Am I right? I tried the carne asada quesadilla and it was unexpectedly good. I would eat here again without a doubt. The Bingo was played in the concert area. I'm not gonna lie... it was fun. The event was put on by Jackalope Ranch and emceed by the National Comedy Theater of Phoenix. They did a great job. Funny people. Especially this guy Marcus. Hilarious.They were all about audience participation. Like it or not. I was actually glad I never won a hand of Bingo because then you had to go up on stage and try to match wits with a trained comedian. I don't need that in my life. I'm the kind of person who thinks of a comeback 3 days later. It was a lot of fun though. Crescent Ballroom seems like it would be an amazing live music venue. I checked the calendar and there was not one band that I knew. Oh, wait... except the Toadies. You know the \"hipster\" line, you wouldn't know who they are... Well they're right. I don't. Bottom line is that this place is cool. A solid 4. Hopefully one day a band I know will play here and I can bump it to a 5. Until then I'll live in happy acceptance that my days of coolness are behind me."], ["Kevin D.", "My friends and I frequent the Crescent Ballroom because of all the great shows that come in here to play and the great atmosphere in the front room and patio.  This is a great place to come for a show or just to hang out and grab some food or drinks. There is always something awesome to check out here no matter what day of the week. Most of the shows do have some sort of cost, but it is usually worth the price. I have seen tons of shows here in the past and had a wonderful time. The venue is very personal and offers a wide array of options for you to enjoy the show, including lots of standing room, high table tops, and stadium blenchers in the back. Inside the venue there are conveniently located bathrooms, the merch table and a bar.Drinks - The bottled beer selection here is pretty decent but the draft selection of beers is very limited. I would recommend sticking to hard liquor here. The Vodka Sodas here are some of the best and strongest in town. After just three of these drinks you will be feeling very good. They also carry a personal favorite of mine, Templeton Rye whiskey. A glass on the rocks will run you $10, but it is well worth it.Food - I have heard many good things about the food from the Crescent, but I have only ever ordered the nachos.  These nachos are awesome though! They are delicious but expensive at ~$13. However, they can easily feed 2-4 people so the cost is not that bad unless you are the one treating the table. I am very interested in coming here during the day to try other food. Most of the menu is extremely affordable and sounds delicious, especially for a concert venue.Staff/Service - I have only been here at night, but it is pretty typical not to receive any sort of table service if you are at the front room or on the patio. I would recommend ordering all drinks and food up at the bar. The bar staff are super nice and work quickly to get everyone's order taken care of. If you are ordering food they will give you a card to bring back to your table so someone else can deliver your food.I love the Crescent Ballroom and it is by far one of my favorite spots in town. If you like live music you have to give this place a try. The staff, drinks, food or music will not disappoint you. This concert venue and bar has a great vibe!"], ["Stephanie K.", "Crescent Ballroom is an iconic establishment in downtown Phoenix!  I have been visiting Crescent for over 1 1/2 years and I have had only great experiences.  It is one of the more authentic, laid back venues in the area and it's a great addition to the downtown scene.  I only go to Crescent for a specific concert or show.  I have never gone \"just to hang out\" but I know it would be a great spot for that as well.  I love a good concert, especially new independent music.  Crescent brings some wonderful bands to Phoenix who you wouldn't be able to see otherwise.  There are so many bands that are uber successful now but I first got to see them at a small, intimate concert at Crescent.  The food and bar are above average for a concert venue.  The food is somewhat mexican themed with some salads and breakfast sandwiches mixed in.  It's inexpensive and good quality.  I recommend the bean dip and tacos.  Always a good choice! The drink selection is good if you're into beer and hipster cocktails.  My only complaint is that they only have 4 beers on draft and I love draft beer.  But they have a large selection of cans.  The mixed drinks are interesting - especially the Honey Badger which is a bourbon version of a moscow mule.  I think Crescent does a great job of cultivating a friendly, artistic scene in Phoenix and I am looking forward to many more visits in the future!"], ["Jess P.", "It's been 4 years and this place still blows my mind! Love the bartending staff and that they have been there since the beginning! Highly recommend!"], ["Gina V.", "I have always enjoyed coming but was very disappointed last time I came in which was last night. Went in at midnight and was immediately told at the door that it was last call soon. We got our drinks went outside and the security guy kept harassing us to drink up fast cause they're closing early due to it being slow. We only stayed there for 20 min and in that duration he told us 3 times to leave. The last time he told us he said we have to drink fast now and leave basically chug and go.  Told him to give us 5 min as our drinks were almost done and we were speeding it up anyhow. 5 min later he came back again. Absolutely inappropriate and rude, never coming back and spreading the word."], ["Erica S.", "Love the crescent! Great place for shows and the food and drinks are tasty. Definitely a five star place...except for the extremely rude and tactless employee we encountered tonight heading into the show. Beware of the grumpy man at the entrance into the show."], ["Moniquea K.", "Place seemed legit but not friendly for out of towners. We waited in line for 45 minutes to find out they don't take out of state vertical identification cards... Lame"], ["Mary S.", "A cool fun venue in Downtown Phoenix. Rock on!"], ["Eddie U.", "Man, I was just there last night and I like watching a show here and having a drink. The staff is always pleasant at the least. I haven't tried the food yet but one of my home girls keeps telling me I need to try the food. Next time."], ["Patch R.", "This place brings great shows to phoenix. That's why I give it 2 stars over one. Also I like that most shows are all ages or 16+. Music is good and sound quality is nice!  They have messed up artists sound quality in the past . The staff is super hipster and not really my favorite. Security is pretty awful in my opinion I like other venues in phoenix way more. It's an ok set up and bar. And the scene is pretty horrendous"], ["Quynh N.", "Good concept, restaurant and music venue. The tacos came out fast, that was after we waited forever for our server to come around and take our order. They might have been understaffed. I would definitely go back and give them another chance."], ["Arana W.", "How did it take me so long to get here?Great place to see a show, or just stop in for a bite to eat and a drink.I came for a show - we got a table near the front. Acoustics were good, drinks were fairly priced (I can't gripe about $5/pint anywhere - at a show, it's great!), and the staff were friendly.Tip - one block west of the venue has no parking meters!It was a fantastic night out with a great group of women - and I will definitely be back - this is a great little venue!"], ["Ela W.", "Hands down favorite venue in Phx. Great place to get your groove on. Saw Nightmares on Wax here a couple months ago and had a great time per usual. The small space makes for a more intimate experience with the artist. DJ EASE literally kissed my hand at the end of their set. Swoon."], ["Vanessa G.", "I saw Jarabe de Palo here last night. The place was awesome, small venue and they have a good collection of bands going through it.Also, i loved that they had a water jug out, so for the non alcohol drinkers, you dont ahve to dedal with the lines at the bar and you can serve yourself!"], ["Jordan S.", "Crescent ballroom is the best! They have great food and drinks, and events and acts are always exciting. Pro tip: there are two sets of bathrooms here!"], ["Pancho Pantera ..", "I've been a regular here for a couple years.Usually show up at night for dancing. Its always random one night its rock, another its hip hop, another its trance/dance. I love the change of beats. Dress code is whatever you want. I've gone after a wedding (suit attire) other times I've gone with just jeans and a t shirt. Just as long as your positive than this is a nice place to hang out.Last Saturday I decided to go early 6pm.None stop chips with red and green salsa.Chicken Burrito is stuffed with ingredients.Flamenco show.This venue is awesome day or night, drink and food."], ["Cosmo W.", "I wasn't sure what to expect, but I was pleasantly surprised- GREAT food, good drinks and wonderful service. Place is a a lot smaller that I thought, but it has great ambiance and is very intimate. Bar is good and they have outdoor seating. Just a nice place to hang!"], ["James D.", "A coworker and I came here for lunch today. The weather was nice so we took a seat outside on the patio. They could use more umbrellas on their tables, but we were able to grab some shade.  The service was a bit slow, but the food was fantastic.  I especially enjoyed the guacamole.  It was a huge portion, unlike some places.  My coworker got the carne asada tacos and I got the chicken tinga torta.  Both of us really enjoyed the food. I will definitely come back here for lunch when I'm working downtown."], ["Julia E.", "Definitely the best small venue in Phoenix I went to when I lived out here. They also serve pretty awesome Mexican food, which elevates this place to an entirely new level of greatness."], ["Ryan F.", "Crescent is one of my favorite places to drop into for all kinds of reasons.... particularly Saturday night dance parties. Sure it may be a little hip, but to be honest, I think this is exactly the type of thing downtown Phoenix needs more of. It's a great place to grab a drink, catch a show, dance your pants off, meet new people, and generally have a great time without the bougie atmosphere other areas of the valley may offer.By all means, if you like whiskey and ginger beer - get yourself a HONEY BADGER. They're on happy hour and are generally delicious.MAJOR PROPS to the CB for expanding their patio areas as well. Most businesses aren't as proactive with stuff like that and would rather just keep a line waiting outside. Last time I was there, the added space was much appreciated."], ["Blaine K.", "the food is! burritos, salsa, tacos, and burgers are the greatestalso the local bands, dirty Disney and and 90's hip hop night definitely worth checking out!"], ["Adrien G.", "Best place for an intimate concert and a good beer! Parking is a little bit tricky you'll have to walk a few minutes for a good spot.Very good bands come to the Crescent like Metronomy, London Grammar or The Bright Light Social Hour. You won't be disappointed by this venue."], ["Jewearly K.", "Came here yesterday with a group of 5 for their 2000s R&B/Hiphop partaaay! Great atmosphere & great music reminiscent of the good ole high school/college days :) Some friends went to their 90s R&B/Hiphop event a few months back & enjoyed it too so go check that out! I want to come back for a flamenco show. Anyways, my 5 stars has to do with the set-up of this place. (Note: I've been here once before for post-dinner dinner since the fattie in me got hungry again. Ate their chips/guac & Sonoran dog & it was good. Get it if you like dirtydogs). As I was saying, the set-up is nice because the outdoor area allows you to enjoy the food while having an audible conversation, but if you're curious about the live band/DJ/show or want to just vibe with the music you can sneak inside and grab a drink by the bar. And perhaps you like what you're hearing and want to dance it off ... the dance floor is yours! Our cover charge was $5 at the door for guys/girls ($3 if purchased online), I'm not sure if that's always the case. I REALLY liked that they have these \"bleacher seats\" extended across the back wall so if you're tired from dancing or maybe you don't like to dance at all but just want to enjoy the music, you can just chill back there without having to  pay for a table or deal with all the inconveniences of a swanky club.  Big plus for all you ladies in heels who need to rest your poor little toes!*Parking: Plenty of metered parking and lots.. use them! I thought we snagged a great non-metered spot for free on the side street, but it was a fail & I got a parking ticket for being too close to a fire hydrant :( So watch yourself!"], ["Elocin P.", "The best in booking shows in Phoenix, no contest. The venue is set up really well. The lighting tends to be low but other than that pretty good. Always clean. Nice smoking patio. The restaurant is good but they could offer some less expensive options-- it is a venue after all. The sound is hit or miss, it tends to be bass heavy and blows out the other instruments. They tend to not care much about mixing for local or supporting bands unfortunately.The wait staff is nice. The security is the worst only second to The Marquee. I probably went there 2-3'x a week for a year before anyone in that place even began to remember me. Others of my friends have been harassed about their ID's which was totally bogus. Other venues seem to make an effort to know their regular customers . This place seems like they couldn't care less -- it comes across as pretentiousness. For this reason I'll give them a 3 instead of a 4. Embrace your community that pays to keep money in your pockets and your doors open."], ["Jen J.", "Thanks Crescent Ballroom for a stellar New Years Eve celebration! We got advance tickets for the bash - only $5 pp. Let's see what all went down between 9 PM and 1 AM: My new years eve meal = an $8.50 burrito that tasted fresh, with well cooked and well-seasoned meat; I was pleasantly surprised considering it came out of a big nondescript cooler; bartenders were nice and efficient; Drinks weren't outrageously expensive. Music was awesome, an eclectic mix of songs from the past three decades; there was an artist doing a painting live on stage while the DJ was blasting away - very cool to see; the crowd was late 20s-early-30s-hipsters-heavy; People cheered when some dude opened his umbrella in the middle of the crowd - gotta love the random hilarity. Dance floor was packed by 11 PM. It looked like the kind of dance floor for people who say \"I don't really dance\". To clarify, that's an observation, not a complaint. Nothing wrong with it. Overall I'm glad we picked here for our one night in Phoenix/NYE outing."], ["Punit S.", "Lola burger and honey badger. Best burger ever, and best combo if you're a fan of whiskey ginger.This is a lovely artsy spot and must-go-to in Phoenix."], ["David S.", "Excellent beer bar and not to mention my friend and I were allowed inside to catch the last of Dr. Dog's set.   What a chill place."], ["Brandon M.", "Great concert venue ... smallish, bordering on intimate, but they draw in a lot of great bands.  The food's great too.  Pretty much typical Southwestern/bar fare.  Great nachos and burritos, and their Sonoran dog uses a Schreiner's dog and an awesome roll. Overall, if you haven't been here you should definitely stop in for a show or at least a good meal and some drinks!"], ["Roxanne G.", "Food is good. Drinks a bit pricey. Not strong but for the price I'd like to get a buzz going on faster...Seen a few shows here and love the acoustics. Great for intimate shows.Will be back! Might not drink but, I'm a sucker for live music!"], ["Mark R.", "The Wife took me here for a Date Night to see her band ZZ Ward and have a few drinks. We both really enjoyed the ease and simplicity of the whole experience. Parking is right out back for around $5. Tickets for the show were $15 each and both the drinks and food were very affordable and tasty.Inside has a small lounge up front where you can enjoy some good eats and drinks. You can even hear the bands playing in certain areas without getting a ticket. There is also a small patio that you can use if you need to light one up or just get some fresh air.The bands are in the middle section and it is a rather large area. Most of the people listening are standing up by the stage and you can move around wherever you want to go. There are also some bleachers along the wall if want to listen sitting down. Really like the cool bar area in the back when you need a quick refill and the easy access bathrooms when it is time to go. Nice!This particular show was sold out and packed to the rim. Even with a full crowd it was still a very enjoyable event. The sound is pretty amazing no matter where you listen. It does have a tendency to get pretty loud at times so you may want to bring some ear plugs as an option.Get there early so you can goof off and work on your buzz. The music can go for a few hours depending on the length of the sets and who is playing. We both ordered the giant Lalo Guerrrero Burger to soak up some suds before the main act and it was delicious.Don't tell the wife but I thought ZZ Ward was really CUTE and could easily be my new Yelp Current Crush. Definitely will be back for another show soon. Check online for tickets and schedules. COOL MAN!4.5 STARS"], ["Janelle E.", "The staff is friendly and the food is good.  There was a band playing but we didn't watch them.  We stayed in the lounge and had a late dinner.  Prices are good.  Five stars because they use Tilamook cheese.  My fave!!"], ["Andrew K.", "I've been to the Crescent twice now and both visits were \"rad\". Like that? It's hipster lingo. If you don't like it, this may not be your scene.I'm kidding.  I think it'd take a very particular type of person not to like this place. I mean, the food is excellent (I had the mouth-watering Lalo burger, with sautéed green peppers and melted cheddar cheese) and the look of the place is neat; I'm guessing it was an old mechanic shop long ago. Last but not least, this place gets some of the best musicians I know of to play here, and they're kind enough to stream the music live from the show inside to those outside (who may have not bought their tickets before the show was completely soldout - heh).  From 90's acts with cult followings such as the Dandy Warhols and Eels to up-and-coming indie stars like Phantogram and Allah-Las, this place gets the shows I want to see. I'll be returning many more times."], ["Mosh J.", "No complaints. Best sound in The Valley."], ["Amelia H.", "Fantastic venue!  Clean.  Nice restrooms.  Not a bad place to sit or stand in the whole place.  I was here checking out some Lucha Libre wrestling recently and it was fantastic fun.  Yeah,  nobody really got hurt, but we sure had fun pretending that they did.I didn't get to try the food, so I can't comment on that, but I would definitely be back for another performance."], ["Tony C.", "The venue itself is beautiful but please do something about your staff/security. Is it really neccassry to hire a bunch of wanna be cops/MMA fighters that eye fuck everyone? I get that some of the shows can get a little \"aggressive\" but the staff honestly seems to antagonize more than they actually do their jobs."]], "Taqueria La Hacienda": [], "Regio's Mexican Food": [], "Al Fuego Mexican Restaurant": [], "Rita's Mexican Food": [["Shibly U.", "This place is amazing! At a location I wouldn't really think of going. But this place is definitely worth coming back to even without Groupon. My friend and I loved every dish we had.The bacon wrapped chili was actually stuffed with 2shrimp as well! Everything was great! From the staff, the service, and the atmosphere, but the food speaks for itself. Amazing!Can't wait to go back and try more. It does cost a little more than those chain 'bertos' places. But you have to pay a few extra dollars for delicious food. Don't be afraid to just close you eyes and pick something in the menu. Next time I will try and ask to have my seafood deveined. Their salsa also amazed me. Tasted homemade and authentic. Met the owner during dinner and made our experience even better! A great guy!Very attentive and friendly staff!"], ["DianondsRock 6.", "It was great to finally get Sonoran Mexican food that showcased Mexican flavors instead of Americanized, cheese-drowned versions of Mexican food.  The Patron margaritas are the real deal and a steal at only $9 as the glasses are enormous.  The Chili Colorado offered lots of meat and a good red chili sauce.  The Pablano Relleno was lightly battered and stuffed with flavorful shredded chicken with a light cheese sauce floating in a plate of red chili sauce, it was the right touch of cheese.  One of the best parts of the meal was the beans.  They are authentic as you get the pork flavor you are supposed to get from beans when they are done right and made with ham hocks or other pork parts!  I didn't ask how the beans were prepared but they taste like they were made with an old school recipe.  We liked the fried ice cream with the cinnamon shell over the sopapillas as they were a little to doughy.  This and the fundillo are the only reasons I am going with 4 instead of 5 stars.  The cheese fundillo was more of a thin Monterrey cheese than the traditional thick Mexican cheese, however, the chorizo on top was excellent.   It wasn't that it was bad it just wasn't what we were looking for in a fundillo.  We are hard to please when it comes to authentic Mexican food and this will be our new go to place as it is unbelievably hard to find good Mexican food in Phoenix/Tempe and this was worth the drive.  We can't wait to go back to try the seafood and grilled carne platters."], ["Miss D.", "Love me some yummy fajitas; that's about the only \"Mexican\" food i love; so I ordered a steak fajita & a shrimp fajitas platter, with the amount of food & all the sides, I left feeling super satisfied. Other places can be stingy with the amount of shrimp they give, so I was super ecstatic that there were much more than 5 shrimps!Staff was nice & I got myself a deal online so it was a super great deal as well!"], ["Jay M.", "I wan't sure about this place when we first arrived as it is just off the freeway and shares a parking lot with a Mexican auto / tire shop.  However, when you step inside, this little gem looks like it belongs in Old Town Scottsdale.I made a mistake and order my old standby, shredded beef tacos.  Don't get me wrong, they were okay, but nothing like my GF's order.  She order the steak fajitas which were amazing!  In fact, these are by far the best fajitas either one of us has ever experienced.  They came with all the usual suspects, however they are of the highest quality.I want to go back and try more items on the menu, but I am definetly ordering the steak fajitas next time!!!If you like fajitas, you must try Rita's!"], ["Roni T.", "Found this gem while looking for a non-chain restaurant before a concert at ak chin amphitheater. We were greeted by the manager who was all smiles and genuinely happy to be there. Our server Vanessa was great as well. She was pleasant and attentive. Food was WONDERFUL! Table side guac and a pitcher of premium margs to start, 4 entrees and dessert ran us 99 bucks which, for all the food and booze was a steal. This is our new go to for concerts at ak chin."], ["Paige W.", "We had the appetizer the bacon wrapped child's which were pretty good. We then split the carne asada plate which was plenty of food for the two of us. The service was good, the salsa was good and we will come back for lunch."], ["Rita R.", "We ordered margaritas, fresh guacamole, abondigas soup, salad, fajitas, and fried ice cream. Everything was so delicious and you could tell the ingredients were fresh. The waitress was very nice and did a great job. I will definitely come back when I'm back in the Phoenix area."], ["Angie T.", "So we were on yet another hunt for some fabulous  Mexican food and Found it! chips and salsa were fresh, the frozen mags were good.  I had the steak fajitas and wow I was in heaven!   The veggies were cooked and seasoned to perfection and the steak was mouth watering and tortillas hot and fresh.  And the serving size is huge!  Yum I will be back!"], ["Abram E.", "No thank you for responding. I know you might have great tasting food but unfortunately that wasn't the case when I was there. It was a little to salty and about the staff I would of appreciated if they came back asking if everything was ok, but they didn't. I was actually excited to go there due to the some good reviews on your restaurant but I wished it was a little more pleasant and employees more excited to work there. I would of asked for something else but due to the lack in timing of the waitress I was to hungry to even wait. Hopefully you continue making changes and it all works out."], ["LaNoya J.", "Extremely delish authentic Mexican food. Saturday evening around 5ish and wasn't that busy. When we got there waited just a tad to be seated but then were taken care of right away. Waitress was very nice and explained anything we didn't quite understand. Overall great food and experience"], ["Sandra R.", "A friend told me this place was a place to get great Mexican food.  We got lunch from there today. Prices were high. We spent over $50 for lunch for three people.  For that price you think the food would be unbelievable, well it wasn't.  It was more like tasteless and less than remarkable.  Definitely will not be eating there again or recommending them to anyone.  Such a disappointment."], ["Denise L.", "Sorry yelpers this was awful!Cheese crisp was made with an old tortilla.  Like eating thick paper.  Sick.  Cheese was barely melted.  We ordered a three combo plate 2 tacos and a cheese enchilada.  Plate was not even hot.  Cheese not melted in the enchilada and the tacos were on these weird shells. So disappointing and a whopping 35$ with tip.We were expecting 5 star food from all the reviews......only thing we can imagine is they have never had really good authentic Mexican food.  Big big let down.Never again.Sick sick sick."], ["Sean C.", "Sadly, I have to update my review from 5 stars to 2 stars. Margaritas were awful, service was awful, server did not know happy hour drink special and we had to point on the billboard the prices, instead of checking, she immediately informed that alcohol drinks were not o happy hour. She cleared chips and salsa without asking us if we were done. Horrible experience compared to previous visits. We will try one more time as this may have just been a fluke. Fingers crossed..."], ["Bill D.", "I relied on the Yelp reviews to find a good Mexican restaurant in a certain vicinity, and Rita's Mexican Food was the choice. Seeing they take reservations, I made one since it was a Saturday night, and we were planning on dining at 6:30.I was surprised to see the place empty, except for a couple tables, and wondered if Yelp had let me down. Nope! It started with the friendly wait staff. She was very nice and checked with us often, but not too often, to make sure we were ok. The Sangria and strawberry margarita were very good. My Parrillada Del Rancho dinner included a thin slice of steak, chicken, and pork chop. All 3 meats were a slightly overdone, maybe from the grill or the \"cooker\" it was presented on at the table. But tasty, none the less. The other 3 meals were said to be very good, too. Oh, and the guacamole was freshly made at the table, and also very good.4 dinners, 2 alcohol drinks, guacamole appetizer, and a a fried ice cream came to $132."], ["Tatiana Y.", "Manager is pretty GREAT! And Eva bartender pretty great too! First time stop because I was thirsty for margarita . They served well! Enjoyed time there!!!! I will be back for Molcajette !!!!!!"], ["Eduardo B.", "Great Mexican food and excellent service! The food and the Margaritas are to die for! Try it, it is worth it.Ever, Erin and Paulina always make you feel welcome."], ["Stellz L.", "The food was just alright. Really great happy hour specials for drinks. ****BEWARE**** for our party of 4 (not 8 or 10) they added automatic gratuity. The fast and not thorough explanation given to my boyfriend was \"yeah..we already add on gratuity\". Ok...where is that posted? Is that legal? Gratuity is an incentive. Don't get me wrong, I tip, but I don't like being forced into something. I actually tip more than their forced tip charge. Just doesn't sit right with me when that isn't made clear. ****Seems deceitful.****"], ["Pam C.", "Whenever we're in the area (which is infrequently), we come to Rita's. The chips and salsa are great - though a little too spicy for my gringo husband.I have enjoyed both entrees I've purchased (the carne adobada and the combo with the beef tamale, shrimp taco and chicken enchilada). My husband got a little more adventurous (and expensive) and got the Azteca and didn't care for it.Also have to disagree with other Yelpers on the Toritos. They aren't extremely tasty with the exception of the sauce - and we took the extra sauce home because there was way too much of it and we used it as steak sauce. I wish they would bottle it and sell it separately!Margaritas are also tasty, but not extremely strong. Go and support your local AZ businesspeople. To me, it's better than Valle Luna and many other self-proclaimed \"authentic\" joints."], ["Amber B.", "The $5 margaritas the size of my head was excellent. The table side guacamole was fresh and tasty. Food is incredible!!! Tacos, crispy, fresh, good flavor. Loved it. Server was kind, friendly, personable. Great find!"], ["Buckeye.eater A.", "Most excellent!!! Whole fried red snapper gorgeous to look at and great tasting. Service was A-1 couldn't ask for more. This is a gem of a Mariscos restaurant."]], "Barrio Café": [["Mike D.", "Really good food but the prices are steeeep for what you get.  $12 for guac?  Again, it's good but pricey.  The sides on the meals were actually my favorite part and I'm confident I can eat a 5-gallon bucket full of those mashed potatoes they serve.  My god those are good.  One of our meals was $25 and we thought, \"this is great at $15, good at $20, and completely mediocre at $25).\"This is a great place to bring people from out of town if you're looking for a nice Mexican meal but there's a lot of good Mexican in the Valley at much more reasonable prices for the day-to-day dining."], ["Jodie W.", "I really liked it, but it was to hipster for my mom, who only orders chile relenos.  I liked the variety and the unique take on the dishes.  The salads were amazing!"], ["America R.", "My wife and I stopped in for lunch yesterday because we recently saw the triple D episode. Have to say, the food is amazing. Service was good and waiter was friendly. We tried the tacos, she had the fish and I had the pork. Both were phenomenal. When we are in the area we will put this on our rotation of Phoenix food choices!"], ["Judy L.", "We came here for HH.  Great selection and reasonable priced.  The regular menu is a bit pricey for the amount you get but the food is good.  The place is small and you bump chairs with your fellow diners.  I got the Pescado Tacos, good but small portion.  The service was awesome!"], ["Nora V.", "Loved the food, atmosphere & tasty beverages, Your meal starts out with bread & Spanish style tapa vs the usual chips & salsa which is a bonus. We tried the cochinita pibil & camaron tacos. All were very good. I would order both again & again. We had 3 cocktails & they were really good but I gotta say on the small side. I know traditionally speaking you get what you pay for & this was a depth of flavor & profile above & beyond traditional Mexican fare. Having said that you get what you pay for. 2 taco entrees (no sides etc) & 3 cocktails came to $63 at lunch time. So if you go make sure you're prepared with some greenbacks in your pockets because this ain't your nana's house."], ["N A.", "I've been hearing about this restaurant since I moved to Phoenix over 5 years ago.  It has great reviews, the chef is often featured in local magazines, lots of people love it, etc.  I just never made it because my all-time favorite restaurant in town is also on 16th street (La Condesa aka La Santisima). On a number of occasions I've planned to go to Barrio but once I'm on 16th Street I just go to La Santisima because I love that place.  Anyway, today I finally went to Barrio, and will never make this mistake again.  First, the food was mediocre, at best. I will admit that their guacamole was delicious. But that's about it.  I literally didn't eat my plate.  That's how bad it was.Second, everything was over-priced.  I have no problem paying higher price for good food, but this just isn't worth it.  For example, that delicious guacamole is $13. The fries that came with the tacos tasted like cheap grocery store frozen pre-cut fries, which is gross.  The corn tortillas that the tacos came in were terrible--mealy and dry, and the salsas (2 kinds) just tasted like vinegar--no complex flavors or spice.Third, and most upsetting, the service was horrendous.  It was possible one of the worst service experiences I've had in a restaurant in town.  So I'm glad I tried it, because now I will never wonder about heading here when I'm craving Mexican food, and will definitely never go back to this place."], ["david n.", "Hands down the best, most unique, and freshest Mexican food I've ever had. If you've been to any of the Barrio restaurants you'll know there is hype behind the name... Well I've been to the one in old Scottsdale and in Gilbert and neither live up to he hype of the original, which after eating at today I will go nowhere else for median food. The guacamole is fresh and he perfect combo of ingredients, again in a league of its own compared to the other restaurants around the valley linked to Barrio.  I ordered the Chiles en nogada as that's the signature item and the dish made on DDD. Is didn't disappoint and I will definitely order again.It was also happy hour here on a Saturday with half off drinks and buck-fifty tacos. The tacos alone are worth coming for. They don't have beans, rice, or flour tortillas... So if you're looking for cheap filler foods go somewhere else.This place was amazing."], ["Angela S.", "What a great experience!!  While producing a conference in Phoenix, I wanted to take the staff out for a great time at a restaurant and with food that we can't get in Detroit.  In my research, I found Barrio Café, and so glad I did.  I called ahead days before and were told THEY DO NOT TAKE RESERVATIONS.  And they are NOT kidding about that, so be prepared to wait. It's a small, yet very popular place, but worth the wait.  While we were waiting, we ordered chips, salsa, and guacamole.  All three were great, but the guacamole with pomegranate seeds was phenomenal!  Living 3/4 of the way across the country, I am definitely going to try to recreate it at home.Once we got our table (there were 7 of us and we had to wait for 2 side by side tables to clear out), our service was friendly and efficient.  They served fresh white bread with an olive tapenade.  Several of us had read up on Chef Silvana, and were excited to try her creations.  I ordered the Cochinita Pibil.  Reminiscent of my family's North Carolina Appalachian pulled pork, it had a Mexican flare that was unique and delicious.  It was even served with a thin \"dip\" rather than a thick bbq style sauce.  Outstanding.  Another of our crew ordered the Chiles en Nogada and we traded bites.  It was also outstanding. Fruity and flavorful. After dinner, we took a group photo in front of the artwork on the side of the building.  I will definitely go back if I have the opportunity.  Thanks for a great experience."], ["Leslie M.", "I came here for lunch and lucky for me, it wasn't too busy. We were seated right away and my date and I ordered the Tacos Camaron (shrimp tacos) and the Torta Poblano. The waiter was slow and took forever to place our order, get refills, and give us our check. Pretty annoying...However, the food was incredibly good. I practically ate more than I should of but, I could not stop eating. The shrimp was delightful and tasty, the torta poblano was just as good. Before tip, our bill was less than $30. I am definitely a fan of the food. The service needs some improvement."], ["Lo R.", "Ok, I'm going to keep it honest. This place let me down. Big time.I started by ordering a couple drinks. I had the La Bomba & my boyfriend went for their Lowrider. My drink was eh good? His tasted like pure tequila. I mean it was top shelf but still.. He wanted a mixed drink not shots of tequila. Their complimentary bread and salsa was odd to me. I kept an open mind and dived in. Just wrong.. The salsa had an extremely unique taste. Honestly it shouldn't even be considered salsa. We ordered they infamous guacamole, BLAND. I'll just stop there with the apps. I ordered their camaron tacos w/ a side of spicy papas. Pretty tasty. But nothing life changing. The atmosphere.. Where to start. They had a band? that night which had the volume on waaaay to high. The gentlemen sitting at the table behind us was literally yelling at the top of his lungs to converse with his company. It was ridiculous. Our waitress even rolled her eyes towards the direction of the music and made a comment which of course I couldn't hear over the noise. We skipped dessert.. Unfortunately. Due mainly to the fact that during our entire meal we were waited on by our waitress maybe twice. Once when we ordered and second to drop off the check. Pathetic. If it wasn't for her 20% gratuity that they so gracious added on themselves, she would have received close to nothing for a tip. And that concludes my Barrio Cafe review. I really looked forward to dining here but that was the first and last time I will be visiting this restaurant."], ["Mark R.", "Came here to celebrate our daughter's B-Day. This was a place that she had been to before and she was wanting to go back again. Even I was eyeballing photos of the famous Chiles en Nogada dish and was getting excited.The outside of this building is covered with several crazy and colorfully painted murals. They are very psychedelic and most interesting. Inside is decorated in a similar way and has paintings of the same type of art on the walls.We started with the table side Guacamole that everyone raves about. Guess we missed the fine print and it came straight from the kitchen. The guacamole was pretty good. But not enough to give it a $12 price tag. Not sure why they put cranberries in there. Maybe not the best match for such a dish.Tried ordering their famous Chiles en Nogada and was told that it is a seasonal dish. They said that pomegranate was not available and they did not have the ingredients. Why put it on the menu if you do not serve it at all times? Maybe start by putting SEASONAL next to the item so that everyone knows up front.Ordered the Pollo Poblano instead and was not very impressed. Daughter ordered the Cochinita Pibil and said it was very tender. She also said that it lacked any deep flavors and was not very exciting. My wife and son in law decided to go with the Fish Tacos. Both dishes looked really good. Again they fell short on taste as well.Service was friendly and the atmosphere was pleasant. Other reviews also generally mention that this restaurant is not the same as it used to be. We thought the food was more or less A-OK with prices that were higher than desired.Maybe it is time for a kitchen intervention or something. Give them a try and see what you think. Everyone has a different idea of what GREAT taste like these days. LO SIENTO!2.75 STARS"], ["Jameson T.", "Excellent  food and great service, you can not find the food combinations anywhere else.Went there with a friend from Cali and is a place i will be returning to."], ["Teresa E.", "The food here is good but wayyyyyy overpriced. Talk about gouging your prices. I had the black mole enchiladas they were good just like we make at home but really 20.00 for this plate of tortilla chicken and mole sauce is just ridiculous. It also came with a side of veggies that lacked flavor and a pico that was forgettable.   I didn't even bother eating the pico or the vegetables. My daughter had the carne Asada tacos nothing special. My husband had the crepa de chorizo and he said it was nothing special.  I don't recommend this place  the food is good but with the price ....I left this place feeling taken advantage of.  I won't be back but at least I tried a new place....."], ["Jessica G.", "From the michiladas, cochinita pibil, and the table side guac., very very good. Excellent. My new favorite place. I definitely recommend this place."], ["Connor C.", "Barrio Cafe is an amazing place to get inspired and creative Mexican food.  The lemon and pomegranate seeds in the un-mashed guacamole is unique and nicely balanced, served table side with awesome homemade tortilla chips.  But be careful not to fill up on bread and appetizers because the entrees are big portions.  I've loved all the entrees I've tried here, usually smothered in intensely flavorful sauces and served with delicious spicy mash and grilled zucchini.  The margaritas are also awesome.  The service is very quick and friendly; our waiter was happy to give us extra chips to take home.  The space is intimate and comfortable with live guitar music being played near the bar.  Be sure to check out the amazing street art that covers the building on your way in or out."], ["Bryan M.", "So this may have well Been the tastiest Mexican food I have ever had. I had the cochinita pibil. The pork it's self was so succulent it just broke apart and topped with the pickled red onion just added a different dimension to the dish. Served with mashed papas which I could probably have eaten a plate full of them on their own were just delicious. All elements combined on the plate so well together. I've read other reviews saying it's a little pricey but you get what you pay for,  great service and most importantly GREAT FOOD!This is one not to be missed"], ["Eric S.", "We all know what to expect in an air port but this seemed to be the opposite.  The margarita was actually the worst part of the meal. The tacos de la cochinitas looked small but were packed with flavor.  The place is packed and service is decent."], ["Jessica C.", "First time here. The food was very good. Big portion size meals so I guess the price is worth it. So many items to chose from but still simple to the point menu. I ordered pollo en mole black it was good hubby got shrimp enchiladas super delish we also got dessert hubby said best flan and I say delish curros. Small inside tight tables. But I would try it again."], ["Randy S.", "I did some research before my day business trip to Phoenix, and Barrio was the target lunch destination. The \"tattooed\" exterior is really cool, and great signage to find Barrio.I had the tacos de cochinita de pebil with french fries, and I must tell you; Wowwaweewa! The pork was flavortown, and it was \"the. most. tender. meat. I have ever eaten.\" The tortilla held the contents, but ripped tenderly when bit.The ketchup for the fries was so good, and very unique; it was spicy.The churros dessert was amazing."], ["Dr Tim L L.", "Exquisite food, creative and delicious.Horchata Heaven .......... the best. They serve in a coke bottle just like home in Guatemala ...... or so I think.This place gets Packed ..... and the crowd forms early.I look forward to going back again and again.Enjoy!!!"], ["Chris S.", "First time here.  I have seen it featured on TV with Guy on Diners, Drive-Ins a and Dives.Atmosphere is unique in a good way that pleasantly surprised me.Bread and Olive spread is tasty.  Made from Spanish olives.Roasted corn soup  is the best I have ever had!!!I order their highly acclaimed pork in banana leaf entree.  OMG, so moist and tasty.  Unfortunately, on the salty side, especially after the Olive spread.  I couldn't finish it because of that.  (I still took it home!)Pork is partnered with mashed potatoes, fresh cooked veggies and tortillas.Portions are large and can be shared by two.I will return and get the corn soup but will try a new entry ."], ["Venus J.", "First time here, on the recommendation of other yelpers! I must say it was delicious!!! Big BOLD, spicy flavors :) I ordered the Guacamole del Barrio to start, it didn't came with pomegranate seeds as seen in other yelp reviews. It came with dried cranberries. It was still fresh and had balanced flavor! I also ordered the Organica Margarita. It was very crisp and refreshing and a decent pour of tequila! For lunch I decided on the Kuali de Camaron. I saw a gentleman at the table next to me with this order and I was sold on appearance alone. It had bold, spicy and VERY fresh flavors! Large enough to serve as a main dish for me. My guest ordered the Pollo Panlano. It was opposite, creamy and fresh taste, it was a large dish. It came with a side of the chipotle mash potatoes and grilled zuchinni. They did have a Sunday brunch menu until 3 and had a live musician until 2pm. The restaurant is rather small and very busy, so they were a little slow with the service in the beginning until the servers caught up, but our server Jamie was very pleasant and apologized for the delay. The artwork (murals) on the exterior walls were beautiful. And the artwork hanging inside was great too! Overall great atmosphere and amazing food! Can't wait to come back and try more!"], ["Raquel A.", "Tried \"Chiles en Nogada\" and the enchiladas suizas last night. The Chiles dish was far more sweet than I ever could have imagined it to be. The enchiladas were quite plain, low on flavor, as they simply had sliced chicken breast inside and melted cheese on top. A  lack luster experience considering the $60 tab (that included one margarita...) We were a bit disappointed. Service was very attentive and friendly. A difficult place to review considering my prior expectations weren't met."], ["mikey m.", "Food was great. But having to fork over $20 for a lunch, I thought the portions could have been bigger. Nice decor on the inside. Its a place I would return to, but not more than once a month"], ["Mcintyre B.", "My first time today! I was really excited to finally make it. Upon arriving the building sets itself apart with latin murals, and a modern entrance.The staff are very welcoming and proffesional, we were seated immediately. I got the torta cochinita pabil, and my wife got a torta that has some pablano, chicken, onions, goat cheese. The pork had alot of flavor the onions and peppers were good. Wish I had some cilantro to go with it. My wifes was ok, she didnt eat much of it. We both got the spicy fries for the side, comes with a chipotle ketchup. This was good! Its spicy, it lingers a while with amazing flavor and heat but it never gets to be too much heat, its perfect.The atmosphet is really nice. A mix of upscale dining/cafe/latin art. Its blends well!The service was fantastic, havnt had good service like that in a while!I wanted to try the horchata and some desert but final cost was already getting steep for me :(Over all it was a good experience for me, not so much my wife, not sure if or when I will go back but its certainly worth a first visit!"], ["Jamie B.", "Only stopped in for a few drinks, but the margaritas were exactly what I was looking for! ! Great service too. Also love the murals outside - good chance for a photo op :)"], ["Tara F.", "Very good hole in the wall. We must admit, when our taxi driver dropped us off from our hotel, we wanted to run; there were bars on the windows! But as it turns out, the bars are the place next door. Okay, maybe it's not that much better but let me just say, it's the locals place because as it was, we just barely beat the line that ended somewhere around the corner outside. The food was pretty good but not the best we've ever had. There were some interesting dishes that aren't typical of what you expect of a Mexican restaurant, but we regretted not stepping outside of our perceived notions of what Mexican food is exactly; everything that passed us by looked amazing! Definitely the bees knees of the area so go if you can."], ["Kath H.", "Ventured to this place after seeing it featured on DDD. Always on the hunt for good eats, especially Mexican food. This place does not disappoint. Started with the queso fundido. It was so much more than just your typical queso, with a huge blend of flavors. Served with homemade chips, it was a great start to our meal. I had the mariscos enchiladas, and my husband had the cochinita pibil tacos. Both were very good. The enchiladas were amazing, with lots of cheese and seafood! Great service and great food. Come visit this little gem!"], ["Beau L.", "Amazing, amazing. Chiles en Nogada is all that. Cochinita Pibil had good flavor, but a bit dry. Pollo Poblano was fantastic. The mashed potatoes...whatever is in them, I don't know, but it is delicious. Flan is thick and delicious with perfectly toasted and candied pecans. Service is exceptional. Art is great. We had a Cuban trio playing on Saturday night...man! Just go here."], ["Joe B.", "This is the most over rated joint in Phoenix. Who gets 13$ for guacamole? A chopped up avocado with some lime juice, at table side lol..  Amazing how many people actually fall for this."], ["Rob W.", "THE BEST MEXICAN FOOD IVE EVER HAD ANYWHERE!  And I'm a huge foodie who has eaten at a lot of great Mexican restaurants. This is my family's all time favorite restaurant!  No, it's not cheap, but YOU GET WHAT YOU PAY FOR!  Incredible food from an incredible chef. Believe the hype.  There is a reason why chef Silvana has been written up in various magazines and has been nominated multiple times for a James beard award. Notable items on the menu include- guacamole, the elote appetizer, all soups on the menu are to die for, the pescado del mar, the seafood enchiladas, the cochinita pibil, The low rider margarita, and all of their desserts( in particular the churros). I've never had anything here I didn't think was amazing!"], ["Jose G.", "I was recommended to this place by a family member and it turned out to be exactly what I expected and more. I would say that it is one of the best Mexican restaurants I have been too.  I had no problems finding parking (right in the back of the restaurant by all the cool murals) and found nothing dicey about the neighborhood and we arrived around 9pm and were coming from out of town. The spicy margaritas were excellent and the cochinita pibil were super good. We also ordered the Chiles en Nogada dish and it was not only super unique but the TASTIEST dish I have ever had.  Thumbs up!!"], ["Alan N.", "Wow the food here is fresh, super authentic and burst of with flavor. The area seems like the edge of the ghetto but it was still good. Staff was friendly and the art work on the wall made for good table conversation. Highly recommend coming to this place."], ["Chad D.", "For East coast travelers, note they don't serve lunch until 10 AM Phoenix time.  House made horchata is a sippable rice pudding iced drink that taste great with the pancakes. The pancakes were unremarkable. The syrup was unique. It was extra thick with cinnamon and other spices."], ["Susan D.", "No. We've been there before and the food and service were excellent, BUT we think it's had its season of fame and now, it is over.  The service was terrible. Rushed when it wasn't busy, 20 minute wait for cocktails, no follow up on the food, the \"famous pork\" was essentially boiled, flavorless, dry, without any sauce, pico, cream, zip, none, nada. Server was chewing bubble gum and proud of his bubbles. Once we were served, that was the end. Never came back. We had to go get the check at the front and just left.  Never again. Rethink this one. Zero stars."], ["C J.", "My hubby and I heard about this restaurant on DDD with Guy Fieri. We were in the area and dined here on Saturday, April 18. We arrived a little before 6 PM and were surprised to find the restaurant pretty empty. By the time we finished our meal, the place was packed.We ordered the Pollo Poblano, Cochinita Pibil and split a Flan for dessert. The food was delicious and the service was fantastic!!! We recommended this restaurant to family members who live in the are and they will be visiting Barrio Cafe soon."], ["Zahami G.", "So delicious!  Barrio Cafe did not disappoint!  All flavors and dishes were delicious.  The quest fondido was different than the norm but so good! The food here is legit!"], ["Juan C.", "Dine out for Life! De-Freakin-Licious ! Had the Tata Salad. Wow. Best salad ever! Must have it. One friend had the street tacos Carne asada without the tortillas and wow delicious too. Well this place amazed me.  Oh yeah plus the Guacamole with pomegranate. Delicious."], ["Arizona T.", "Weird flavors. Supremely over hyped.I don't understand what people are reviewing when they leave all these 5 stars.There is much better gourmet Mexican food to be had within a mile of this place.Don't even get me started with how over priced this place is!"], ["Kenya V.", "Outstanding food! Great service! Neat place! Live music! Nothing negative to say. We went on a Saturday around 6pm and I think that's just right on time before it get's crowded and you have to wait. The place it's small so big parties may have to be patient and wait. First thing we ordered was the Kuali de Camaron; amazing taste! A combinationof spicy and creamy and all things good, with tastefull chorizo and a perfectly marinated shrimp, the goat cheese just adds perfection to it, all on top of a crispy totopo.Your tastebuds will be very happy; just typig this makes my mouth watery! You def have to try the tamarindo agua fresca. It's a must. Doesn't feel artificial at all and you can tell it's freshly made, you get the tamarindo pulp in it and the sweetness to it it's the right amount. Our main entree, fish tacos and chicken suiza enchiladas. The tacos are a very good size and they are great option if you're not adventurous to try something different. They're def satisfying, though. The enchiladas: you get 5-6 enchiladas so it's a very generous portion. They have to be the best I've tried. Just look at the pictures. Oh, this place is not you average price, not a 10dll plate but it's totally worth it. Our check was about $65 for two."]], "Los Reyes De La Torta": [["Vannessa S.", "Yoooooooooooooooooooooooooooooooooooo. This place is off the chain good.  Came here with my boyfriend this past Sunday afternoon after seeing all of the awesome Yelp reviews and it did not disappoint.  The place was PACKED and we waited about 20 minutes for a table.  No biggie.  I'll wait for good food.  We were seated and ordered two agua frescas (one strawberry (for him) and a watermelon (for me)) along with two of their famous tortas.  About 20 minutes later our drinks and food came out together.  I wish the drinks came out sooner (I was thirsty), but again, the place was packed and the boyfriend and I were engaged in conversation anyway.  Tortas?  Bomb!  Agua Frescas?  Bomb!  Definitely a fork and knife kind of sandwich (it's huge!).  I preferred my watermelon agua fresca to his strawberry, but they were both yumm-o. The boyfriend couldn't say enough good things about his torta (he'd never had one)  and I was so pleased to know that I had found the amazing Mexican restaurant I had been searching for since relocating to Phoenix in July.  I'm still perplexed as to why there is such a lack of decent Mexican food here!The menu is diverse and carries many other items besides tortas so check it out.  Also, Adam Richman from Man vs Food came here to film a food challenge episode.  You'll immediately know by the wall sized photos of him strewn throughout the restaurant.  Bring your peeps and an appetite and you won't leave hungry or disappointed.  I can't wait to come back and try more stuff!"], ["Iliana C.", "Thanks to this place I am always down for tortas. Deeply in love with la norteña de res. Aaaahhh. Service is always nice, food gets done quick. Shrimp ceviche tostadas are on point."], ["Krista N.", "I had friends in town and they had seen this place on Man Vs. Food and were dying to go. I have to admit I hadn't seen that episode, so this place wasn't on my radar at all. It's located in a little shopping center and you couldn't tell from the outside, but it was packed and this was just before 11am!The food looked and smelled amazing as we were seated. My girlfriend and I went for the quesadilla's because frankly everything else looked so HUGE! Her husband got the sandwich that was mentioned on Man Vs. Food - La Reyna, and it looked and smelled awesome! It was massive but he finished every bite (and didn't eat for the rest of the day).The staff was friendly and the food was good and fast! I will definitely have to bring the Hubby here!"], ["Bryan F.", "I am going to repeat the EXACT words used when I took my first bite of food.....Stupid Good.  Yes that is the best I could pull out my expansive vocabulary.  This is, quite literally the best Mexican food I have had in my life.   I mean, most of the patrons of this fine establishment are Hispanic.  I always say, if the patrons of a restaurant match the ethnicity of the cuisine, EAT THERE!  The last thing I want to see in an Asian or Mexican or Thai restaurant is all white folk!!I have been here several times, and nothing is bad. Even their home made juices are amazing. I constantly find myself ordering the V8.  I also love the Chorizo Fundito and the Massa Quesadilla is SOOOO GOOOD!"], ["Kris M.", "Found this on Yelp! Thank you! Great food. Ordered the guac, a Torta mini, and a burro. Yum"], ["Lisa K.", "I was quite excited to go here based upon all the reviews on Yelp and by friends but was a bit disappointed.  We only ordered the Fortas and there was very little meat compares to the bread sizes. While the salsa was tasty it wasn't very filling or satisfying.  Their \"chips\" we're Ruffles. Overall maybe would consider it if I had a coupon and would try something else"], ["Austin L.", "We love taking friends and family here when they visit Phoenix, as you simply don't come across gems like this on the East coast. They're known for their tortas, which are simply phenomenal, but they also have great options for breakfast. They don't have a liquor license, so there's no margaritas to pair with your massive sandwiches, but they do have a wide variety of fresh juice options. This place is super authentic and the staff is very friendly and quick to bring your food and top off your drinks."], ["Tom D.", "What? I was so shocked by my experience here!! I feel like I was told that I won a new Audi R8 and went down to the dealership and was given a 1986 Club Car Golf Cart. Have my tastebuds died from all of my martini nights? Don't I know Mexican food? My foodie confidence has taken a massive hit. Do I start at Taco Bell and work my way back to the Big Leagues? Damn you Los Reyes!! I thought I should write down how I felt about my torta to start my process back. Dear Carne Asada, you were treated with such disrespect and were left without flavor and Mexican flare! I was so looking forward to meeting you and seeing why so many loved you. Carne Asada, you're like all those girls in SoCal with the fake boobs and lips. Such a disappointment to find out! The one saving grace you have is your roll, but that roll only hides what you lack inside. Empty and souless! Where do I go now? Where are the real Carne Asada's out there? Do I need to go south of the border? I know my perfect Carne Asada Torta is out there. Juicy, flavorful and every bit tasty! I'm going to keep looking, but I won't be fooled by Los Reyes again."], ["Emanuel R.", "This is the place for Tortas In Phoenix AZ Always really constant with the every order, I seen it all I been going to this restaurant even before it became Los Reyes that was back in 2000 when I was barely 13 years old. This is more like my family restaurant even though they don't eat bread anymore. But it has a friendly atmosphere but in the last 3 years or so the service gone really slow and a bit rude I don't know why. But now I just order ToGo instead I love there food"], ["Jim P.", "This place never disappoints. We branched out, but stayed with the mini-ceviche tostadas (can't miss those) for apps. Can't remember what the GF had (some torta - which is unlike her) and I had the pork belly street tacos. In addition to the Valentina's sauce on the table, there was some other one made with chiltepin peppers. EXCELLENT and actually non-gringoized. I'll admit, I didn't finish the 3rd pork belly taco. It just wasn't crisp enough for me (the meat not the shell), but it was tender. The texture just wasn't suiting me at that moment in time. I think the contrast of the crispness and citrusy flavors of the ceviche was just too much for me to take in on that day. Sometimes you like black and white, other times, you want muted pastels, ya know what I mean? I'm pretty sure it wasn't their fault - so my song remains the same 5 stars. This place rocks. Staff is fantastic, food is good, and I was intro'ed to a new bottled hot sauce...which I don't remember the name of but theres a pic of it on GF's phone. I'll add it later.P.s. As many ppl have noted, the tortas are a bit on the large side. They offer mini versions of most (if not all). That's the way to go if you order apps or just aren't into eating a pound of meat.."], ["Harrison W.", "This place is consistently great. I've brought many people here, and I've always loved it. I'm not even a big fan of Mexican food, but man I love the Ranchera steak torta. Just thinking about it is giving me cravings. You won't find tortas like this anywhere else. Since eating here, I've started looking for tortas at other places and I'm always disappointed that they're either not there or they're terrible in comparison."], ["Janet N.", "Living near East Side San Jose in California, I have high expectations when it comes to Tortas and Mexican food for that matter. However, I feel that Los Reyes rides on their fame of Man vs Food albiet their torta portions are massive. Nothing here was spectacular to me.I ordered the Del Rey Torta, from the rave reviews and I do tend to get signature items from restaurants since it should be a representation of who they are. Along with the torta I ordered a horchata.The Del Rey is a massive torta that easily feeds 2, a half for each person. It comes with a side of chips and in the torta itself it has: avocado, pickled onions, tomato, egg encasing chorizo, hotdog, then cheese, brisket, and fried steak. Bread barely held every thing in and was a huge mess.The torta had lots of textures, flavor wasn't as flavorful and didn't seem to be cohesive. It was just a lot of meat, cooked different ways in between two slices of bread. The chorizo didn't have that lovely red color nor heat to it.The horchata was plain chalky, powdering and doused in cinnamon powder on top.I packed half of my torta home since I couldn't finish my meal, but didn't even end up eating it afterwards. I didn't finish my horchata.Service is decent. Typical of a family run restaurant, casual but timely. Pricing was okay for what it was, though I would get Mexican food elsewhere."], ["Stephanie L.", "This place is super authentic from the music playing in the background to their friendly employees and cooks. I was pleasantly surprised that my strawberry agua fresca came blended with ice. I ordered the quesadilla de maíz with chicharrón. I squeezed the lines that came on the side over it which added a lovely citrus flavor to the delicious combination of fresh tortilla, pork and cheese. It was very big so I didn't finish the whole thing but wow was it good!"], ["Jason W.", "I have been coming to Los Reyes de la Torta for a couple of years with my coworkers for lunch and I have enjoyed every meal.  Their menu is huge with many different variations of burritos, quesadillas, tacos and much more.I typically get a burrito that comes with steak, jalapeños, beans, onions and I ask for no avocado or cilantro. They have always been flavorful, hot, fresh and a bit spicy.My co-workers get the quesadillas, other burritos and taco and they have always enjoyed their food.They are always on point with flavor, consistency, service and even during lunch you can find a table or two.I look forward to next time."], ["Dwayne O.", "This locally owned family restaurant serves up very authentic mexican food.They are famous for their tortas and in particular the \"Del Rey\" which consists of - Ham, melted cheese, pork sirloin, breaded beef, sausage, chorizo and eggs with tomato, onions, jalapeño and avocado. This beast is about 8 inches tall and can barely bite into it. All the different items blend well with each other for $8.99The Del Rey was featured in Man vs Food and is the staple but other items are very good also.King Carlos V is the double version of the Del Rey and is brought out on a pallet for $19.99.The tacos and burritos are also tasty and you will not leave feeling hungry. We also have had the Mexican drinks aqua fresca which comes in a variety of flavors and which you can't go wrong.But if you go here the tortas are what you come here for."], ["Felipe N.", "Being from Oklahoma, I've had plenty of \"Mexican\" food. There's some amazing tex mex, but as far as authentic Mexican places and taquerias go, it's like you have to know a guy who knows a guy. It's not always easy to find a good one.Searching for Mexican on Yelp while here from out of town, I see Los Reyes De La Torta is near the top of the list. One look at the menu prices and the photos of the Torta Del Rey, and me and the lady knew we had to check it out.Of course we both got aguas frescas; I got the mango and she got the strawberry esquimos. Both were served in huge glasses with fresh fruit, hers was good enough she had to have a second.I had to try the Torta Del Rey and see what all the fuss was about and it was worth it. It came packed with layer upon layer of delicious meat: some kind of breaded beef, pork, some scrambled eggs wrapped around hot dogs, cheese, avocado, and a bit of refried beans.. oh man. It was so good my lady stole half my plate! Not cool! I got her back by munching on her peluche, essentially a mix of the meats inside the Torta Del rey, but sautéed with onions, peppers, jalapeños and pineapple. Delicious, but we both agreed not as good as the torta. Altogether it was an extremely filling and tasty experience. There are really exciting and uniquely Mexican flavors in the food here, and Los Reyes De La Torta call themselves the kings for a reason. This place is special."], ["Ben R.", "Came here for lunch. Got the smothered carne asada burrito and the pork belly street tacos. Both were really good. The portions are generous, the food is cheap and the place was much cleaner than I expected it to be. Would come back and try some of the other stuff.....the Tortas looked awesome (and huge)."], ["Thomas L.", "If there were only 5 Mexican Restaurants I could eat in Phoenix.  I would put Marisco's Playa Hermosa number 1, and Los Reyes prolly 4th or 5th.   This place is good.  They have a variety of Torta's and a others such as tacos, burritos, etc.  My girlfriend and I shared the Torta Del Rey and some other dish she ordered.  Overall pretty good, I would come back if I'm in the area."], ["Cory W.", "Haven't had Mexican in a while and this place touched on every detail!! A must for a casual dinner!!!"], ["Tyler S.", "Los Reyes De La Torta has great food and even better Torta sandwiches. I like to follow where Guy Fieri and Adam Richman go to eat. This restaurant i can now know why they would stop."], ["Tim S.", "I've been here so many times I've lost count.  I love this place.  I have many friends that feel the same way so there's never a shortage of people that want to go here with me.  My only problem is that their closest location to me is 20 minutes from my house; I wish they'd open one closer.  I need them to open one near Tatum and Thunderbird; it would be a raving success.I've had many of their sandwiches (Tortas), plates (Platillos) and Quesadillas.  I've never had one bad meal.  My friends frequently order their Burros, although I've yet to try them because there's so many other things I want to try.  Perhaps my favorite time to go is for breakfast.  All their breakfast items are excellent but my favorite is their Huevos Rancheros, which is not like any Huevos I've ever had.It gets very busy around lunch time so I try as best I can to avoid going there from noon until 1:00 pm because there is always a wait.  Their service is wonderful.  Even when they are busy the food comes out fast.  There servers are always rushing around but they take care of the customers and this place is like a well-oiled machine.Adam Richman (\"Man vs. Food\") did a segment on his TV show here several years ago.  If you haven't seen it, go to their website and it is available to view.This is a unique, different and wonderful Mexican restaurant.  Don't expect the typical."], ["Gigi C.", "This place is always busy however your waitress is always on her game and always courteous. Really should have more waitress's like this place does. Food is healthy not all of their dishes are carb loaded. I love how they prepare the Nopales. They have veggie & fruit juices freshly made as you order. I love their V8 veggie drink."], ["Kevin C.", "I went here on a recommendation from a friend who visited Phoenix two months ago.  The date of my visit was August 2.The food was very good.  The avocado slipped quite a bit from the sandwich, but it was good overall.  The service was so-so - my waitress didn't seem to like serving me at first after she realized that I didn't speak any Spanish, but she remained pleasant."], ["Chris D.", "There was a time when I would have thought the Del Rey Torta was a fantastic conglomeration of meat. I must be getting old or something because the sandwich seemed like an obnoxious amalgamation of low quality meats. I had my fair share of overeating just to say I did; I legitimately felt like I'd be sick if I ate this whole thing. Were I visit again, I'd probably get a \"normal\" torta and be good with that.P.S. - The watermelon aqua fresca was fantastic."], ["Fahira C.", "I have been to this place many, many, many time. It never disappoints. I am purely in love with their tortas and even though their are bit out of my way I do not mind driving when I crave torta. Service is also great and I love laid back atmosphere. Food is super filing and super delicious. When you have your cheating day and want something filling and greasy but yet so good, please go and check them out. . Muchas Gracias Los Reyes crew!!!!!"], ["Rick G.", "I usually go during the lunch hour. The place is always busy and very popular. The crew is hustling about, helping customers and they're courteous, friendly, and eager to help. The smell of food fills the air and it's plenty loud with conversation and kitchen activity. The portions are normally hefty; you will not leave hungry. The food is fresh and always tasty. It's a little on the greasy side, but as much as one might expect from a local favorite Mexican food restaurant. The place is on a crappy-looking strip mall with limited parking. It's not very good looking and the dining area feels slightly cramped. However, the service and food make up for it. I highly recommend!!"], ["Melissa A.", "I have always loved Tortas and had been wanting to try out this place. First of all,  the service was exceptional and I felt like I was actually in Mexico. The food came super fast and it was delicious! The potato chips, however were not homemade as I've had in other Torta restaurants. That is the only reason I didn't give them five stars. Overall, I enjoyed my lunch. I ate the Mexican Torta (mini) perfect portion size and adequately priced. I will be back for more!"], ["Roam J.", "Food here ranges from the delicious to the absurd.  If it reads like a gimmick, it probably is so be warned.  On my most recent trip I tried the del Rey - my goodness, what a heaping pile of meat.  There was egg, pork, cheese, ham, chorizo, some kind of hot dog, avocado and who knows what else.  I dumped their salsa on top (delicious!) and experienced pleasure through about half the sandwich, then very quickly reached a threshold and now I probably won't be able to eat a torta or any kind of processed meat for about a month without curling up into ball and sobbing.  In past trips I've chosen smaller, less ambitious items and made it through the visit purely in the pleasure zone.Outside of the entrées, another reason we come here is the aquas frescas -  again, a bit gimmicky in that they are humongous, super sweet and come decked out with garnishes and umbrellas and such.  But they are quite delicious and great to share -- only problem is the wife always orders the regular, and I prefer them with sweetened condensed milk..."], ["Lydia E.", "Holy wow! Home made tortillas and everything is so fresh. Order a drink- you will thank me later. I could easily drink one of theses a day for breakfast. One of my favorite non alcoholic drinks hands down. While the tostas are what they are known for, the casadillas are more than amazing. The customers come in waves but the wait is short and worth it. While you are waiting you can watch the food being cooked and press their own homemade tortillas."], ["Cody V.", "Absolutely love this place. Food is fresh and made well. I do find that occasionally it is over salted. But if you ask for no salt they are okay with that request. Order the King Tacos. Super delicious and the fresh veggies that come on the plate are so welcome to an already great meal. The Agua Frescas are always yummy. It is very busy. But if you go at a off time it's easy to get in."], ["Pancho Pantera ..", "3pm on a Tuesday. Waitress is on top of her game. The service was perfect.Agua de avena is delicious.Torta Del Rey is absolutely a killer. My taste buds were going into a frenzy from all angles, ham one second, avocado, breaded beef, beans, sausage, cheese, soft bread salsa roja. For desert I got an esquimo. I wasnt a fan of this to me it taste like strawberry quik. Next time I'll have a different desert.This place lives up to its hype."], ["Sebastian M.", "..just had the most deliscious late brunch at this place. Started with a freshly made aqua fresca Pina Colada. Ordered the Torta del Rey and la Plata del Peluche. The place is famous for its tortas... and damn I know now why. Both mains were absolutelly delicious. To finish of, we ordered the flan for desert, that was like the cherry on the top, literally. Def great place and nice service. Coming back for sure!!!"], ["Jasmin C.", "For lunch this is my go-to spot for either a Mexicana torta or a carne asada torta to go. My food is always ready in 10 minutes."], ["Jose C R.", "You want authentic mexican food? Say no more. Head over to this restaurant and your mexcan taste buds will be satisfied, no doubt. This place has been my favorite mexican food place for over 10 years and there is so much variety and flavor. I would recommend the Alambre de Camarones (Shrimp with beans and rice) or a Qusadilla estilo del Rey (really good quesadilla). The staff is friendly and I've never had a problem with the food. The owner is awesome too. He's friendly and REALLY likes to talk. Lol Anyway, definitely recommend this restaurant."], ["Pete T.", "This place is awesome.  It's a little tough to get to due to how cave creek and 7th St merge but once you find it, it's a gem.  I always get the same thing, the nortena torta with chicken.  The Mexican sandwich is marinated grilled chicken with jalapeño and onion tossed in. They then top it with Jack cheese, avocado and a chipotle cream sauce. It's incredible.  The bread is super soft and light.  My favorite item here is the orange salsa.  It's sweet with a little touch of heat, I could honestly drink the stuff.  I ate there with a buddy and we went through like 5 of the little dishes, it's insanely good.  My understanding is there authentic drinks are very good too but I haven't tried them personally. The service is always spot on.  This is one of the better sandwiches in Phoenix!"], ["Christina N.", "I will admit the last time I was here a few years ago I was VERY disappointed!This places was on DDD and i ordered the torta with high hopes.   Turns out, they are just not for me.  However, my SIL asked us to meet them here two nights ago and I am so glad they convinced us to go!  The cameron burro is insanely delicious!  Chipotle crema, prefectly prepared tortillas, so much yum.  I ordered a fancy drink (I think this is a dry restaurant?) and it too me to the beach without the booze! Get the King piña colada, you gotta try it.My husband ordered the king tacos (with steak) and he loved them.  SIL ordered the same as me, and her husband got another cameron dish that he really enjoyed.  We also got 4 ceviche orders to start and they were really tasty.   They are individual sized and a great way to begin your meal.  If you enjoy Tortas I'm still surr this is the place for you!  They just aren't my cup of tea apparently.  I've now learned that LRdlT can serve up delicious food no matter what you're looking for in a hole in the wall Mexican joint.One last note:  this place is kid friendly too. Server was attentive and made it fun for him."], ["Mike L.", "came here late on a Thursday night.My wife and I split the Del rey torta and i really liked it. I would order it again. also ordered a watermelon fresca that was really good also. the sandwich came with potato chips which we all thought was weird because we were at a Mexican restaurant but it was a sandwich i guess but still would rather had tortilla chips."], ["Nick Q.", "Seriously the best tacos I've had in a long time... maybe ever.I know they are famous for their tortas, but it was a late night stop and I didn't want to eat some beastly, 11lbs, torta.  So, I settled on the Bistec Encebollado tacos.  The flavor was spectacular and the meat was tender and easy to chew through.  I hate when you take a bite of a taco and pull all the insides out... The only downside, IMO, is that I couldn't have a beer with my tacos.  It's not enough downside to warrant a 4 star rating, but maybe a 4.5 star if that was an option.Check out this picture:instagram.com/p/vxJCgJNL…"], ["Traveller222 2.", "This place is the best. I saw this place on man vs food and we decided to check it out on our way to Cali. Boy I'm glad we did. Hands down my favorite sandwich spot in Phoenix. To make things even more interesting Adam from man vs food was doing another episode on his show the day we showed up. I was loving it. It's kind of messed up how they moved all the regular customers to one side of the restaurant and filed on the other.Anyways, food was delicious and so fresh. They give you a lot of food for the money. We've been here twice and I promised my self anytime I'm in Arizona this is gonna be my first and last stop before I leave Phoenix. It's a tiny restaurant so be prepared to wait for 15-30 mins depending on what time of the day you show up. It's still worth the wait."], ["Dominique T.", "delicious!"], ["Cathy J.", "I have driven by this place every day for the past 5 years. Finally stopped in. I had a quesadilla,  and my husband had the del ray torta. They both were very tasty, and we even had some leftover for the next day."], ["Liz S.", "About as authentic as it gets. I was the only gringa in the restaurant where I had a asada quesadilla, which came with salad and jalapeño and limes. Great service, and great energy! I'm glad I was walking up 7th street and saw the Mexican families streaming in!"], ["K S.", "The place was packed, so I opted for takeout, it was out in like no time flat. It was one of the burritos, but it was kinda salty."], ["MissNikki C.", "BEST tortas EVERRRR!!!!! Nortena- steak- no avocado, no jalapeños, no chipotle sauce & extra chipotle mayo & hot sauce...... I promise you will fall in love!!!!!"], ["Isabel G.", "I've been wanting to try this place out ever since I saw it on Man Vs. Food. I finally got around to it since it was close to my new doctor's office. I ordered the Torta Del Rey and a papaya cremosa. The torta was exactly what I envisioned,  layers of meat goodness. The papaya cremosa was what really surprised me. Most boba places I frequent use powdered papaya flavor, but with this I could actually taste/ feel the bits of fresh papaya they used. I haven't had a good papaya drink in years and this is definitely one of the best ones I've ever had. They also have an extensive menu with items like burros, tacos and ceviche.  And the restaurant is actually bigger than it looks from the outside. I can't wait to come back to try out the other items!"], ["Bobby D.", "Los Reyes de la Torta (LRdlT) was my family's 3rd stop in our quest to try Diners, Drive-ins, and Dives and Man vs Food restaurants in the Phoenix/Scottsdale, AZ area.  My family loved the DDD restaurants we experienced and LRdlT was going to be our one and only M vs F restaurant to try.  If there are any other Yelpers looking for a M vs F restaurant to eat at in Phoenix, LRdlT must be your 1st stop.LRdlT is located in a mini strip mall.  At first glance, you probably would question how one of the best sandwiches could be cooked here because the restaurant looked simple and unassuming.  Highly recommend that you arrive around 5pm to beat the dinner rush.  The restaurant is not too big and the secret is out about how great the food is at LRdlT.  If you come after 6pm, expect to wait and you'll be jealous watching the lucky people eat some delicious, mouth-watering authentic Mexican food.  How do you gauge whether a Mexican restaurant has legit food?  Mexicans frequent the restaurant.  As we were eating, the waiting area filled up with Mexican brothers and sisters from another mother.A Mexican torta is a sandwich with such Mexican meats as carne asada, pollo asada, carnitas, etc.  Adam Richman of Man vs Food fame introduced me to the Del Rey and the King Carlos V tortas.  If you want to accept the food challenge Adam performed on the show, you'll have to eat the humongous King Carlos in 15 minutes.  If you're successful, you won't have to pay the $25 for the sandwich.  No thanks, the Del Rey was more than enough for my overstuffed belly.  If you want a filling and very tasteful samwich, the Del Rey will make you thank Adam Richman out loud.  The Del Rey is comprised of ham, melted cheese, pork sirloin, breaded beef, refried beans, hotdog meat, chorizo, omelette, tomato, onions, avocado, and chipotle sauce, all squeezed between soft, nicely toasted bread.  This conglomeration of meat, milk, bread, and vegetables will satisfy all food groups and your daily caloric intake in just one sitting.  To be honest, I probably could have finished the entire sandwich, but I split it with the wifey to save room for our other food excursions while on vacation.  You honestly can't fathom how amazing this torta is until you experience it yourself.  Ask for the grilled onions and jalapenos, which complement the torta.  To help the food go down, a must order is the watermelon agua fresca.  This will satisfy your thirst.Why oh why do my best food ever reside in places other than San Diego.  Adam Richman, you got it right recommending Los Reyes de la Torta.  The Del Rey was so worth sacrificing my slim waistline.  Until we meet again Del Rey, I'll be dreaming of how much I enjoyed engulfing you."], ["Patricia P.", "I can still taste the Lime. Mexico at its finest & the food has a fresh taste, the portions are eatable, and the drinks are HUGE. I enjoyed the good...and as a family of five..everyone left there satisfied and full. Very tasty food."], ["Rick B.", "Arrived early evening. Long line is a good sign to me. The smell is wonderful. Soda from a real bottle. YES! This s a really nice place with excellent food."], ["Carmen L.", "One of the most delish mexican food places I have visited since moving to AZ more than 13 years ago. It takes quite a bit to please me. I always say I cook better at home. I've been here a few times and I just love the selection and the tortas are amazing.I will continue to be a client for many years."], ["Adalid C.", "I've been living in Phoenix for about two summers and I can confidently say these are the best tortas I've ever had. Although the atmosphere is somewhat loud and the wait can be long during busy hours, the wait is always worth it. The staff is very friendly and you can never go wrong with any of the dishes you pick. If a torta is a mouthful, their quesadillas with handmade tortillas are delectable. I also recommend trying out their aguas cremosas made on the spot. This is one of the few places in the area you can he a delicious, full meal for an affordable price."], ["Ian C.", "i got the torta del rey. holy moly there was a lot of food in it. If you like meat.. there is every type imaginable in this torta.my only issue w/ it was that.. i got tired of eating it after the first half. It may be my preference but i felt like someone blended a bunch of meats and i was trying to eat it. On the positive side.. that quantity of food was only like 6$. I probably could have made 3 meals out of this."], ["Regina F.", "Delicious, filling, fresh. I just wish they had a bigger place it is always so packed of people. Love their carne asada tortas, Their grilled chicken tortas, and their cevizhe tostadas. Good place to go to. Definitely gotta make time for it though."], ["John S.", "Wow! Thanks to Man vs. Food I ate possibly the best torta sandwich ever! The torta del rey had a plenty of meat and the watermelon aqua was to die for. If I was ever was on death row and I had to pick a last meal then the torta del rey would be a top candidate.  Not only was the food mind-blowingly addictive but the service was top notch as well. Our server was not only helpful and fast but she was also extremely courteous and professional. I only wish that there could be a location somewhere in Los Angeles because then I would go every single week. Simply put this restaurant is outstanding.  Go, NOW! To unbelievably delicious eatings!! :D"], ["Silena T.", "Found this place on Yelp. We were looking for taco Tuesday specials and decided to give this place a try. When we arrived, it wasn't as busy so no waiting. The service was good. We ordered Pierna torta, Ranchera de Res, asada tacos and pollo tacos. Everything was delicious! We also ordered a pineapple fresca and strawberry fresa. The fresa was the best dessert I've ever had! Not too sweet which is what I liked and well worth the $5 it cost. I would definitely come back and try other dishes."], ["Craig M.", "The best food I have ever put in my face .  We had shrimp ceviche tostada, shrimp tacos, and a shrimp dinner plate .   Words do not describe this. It's that's good ."], ["Daniel L.", "One thing I missed having after living in Iowa is good Mexican food. Finding Mexican cuisine in rural Iowa wasn't difficult, but the range of ingredients, freshness, and flavor often fell short of expectations. On the first visit, I came with fellow Yelpers Angela T, Fia R, and Kurdy S. More recently, I introduced my aunt to this place when she came to visit me. There's plenty of parking in the strip mall. Lighting isn't the best, and the hole in the wall décor consists of tiled floors, large open kitchen, TVs, and a down to earth vibe. The first thing interested diners need to know is their specialization in tortas. These gigantic subs are known for their size that probably weighs more than 5 pounds. The Del Rey ($9.50) came fully stacked with ham, cheese, pork sirloin, breaded beef, refried beans, two hot dogs, chorizo, eggs, tomato, onion, avocado, chipotle sauce, and a plate full of potato chips. There seemed to be no end to this sandwich, as I couldn't even finish half of it. In terms of quality, I liked the overall composition, the soft toasted bread, and the apparent shock effect for the amount of calories this beast carries. However, the refried beans could be more evenly spread, and the breaded beef could be seasoned so it has flavor. It was an item fun to have in group situations, and a novelty to cross off my long and never-ending to-eat list.The Nopales con Asada ($10.99) came with thick slices of grilled beef, cactus, fresh cheese, guacamole, and my choice of flour tortillas. The beef was juicy, fully marbled, chewy, and flavorful. The cactus was a highlight too, but was slightly over-salted. Food again was plentiful. I couldn't finish it all and had to take the rest to go. I'm likely order this again.The Chilaquiles ($7) came with fried tortilla, cotija cheese, runny eggs, onions, sour cream, and green and red salsa. The combination was delicious, particularly with the thick runny egg yolks to finesse the crispy textures and sharp salsa. The mix of flavors was still not as excellent as the Chiaquiles at Anepalco's, but it is a dish I would recommend besides the torta. The Pollo Burro ($6.75) came with chunky chicken, refried beans, pico de gallo, cheese, and avocado. The texture was too wet and mushy. El Farolito has a better burrito, where each ingredient is discernible and better seasoned. I don't recommend it.Another item I would not recommend is the Cocktel de Camaron Chico ($10.99). It came with shrimp, tomato juice, cilantro, onions, and avocado. The ratio was off as the few shrimps were lost in the tomato juice. The support cast could come chunkier as fillers. I felt like I had gone fishing only to come up empty with a few tiny shrimps. Overpriced and it was awful.These meals would not be complete unless I hit the 10,000 calories mark. So, for dessert, I highly recommend getting the Chocoflan ($5). It's a custard cake, not too sweet, very moist, and rich in chocolate flavor. It was addictive and easy to finish. For drinks, I liked the Aguas Frescas Naturales ($3.50). I preferred the watermelon flavor to the cantaloupe, and the non-alcoholic King Margarita ($4.50) was also worth considering as it comes with fresh strawberries with a touch of salt in every sip.The food took some time to arrive at our table and service was very absent unless we flag down someone to help us. Overall, I thought this restaurant offers a good variety of dishes, and portions were consistently out of this world. However, I have also had better and cheaper Mexican food elsewhere. I would consider this a good place to bring out of town guests looking for hole in the wall experiences. 3.5 stars for both visits, I'd be interested in coming back."], ["Marissa B.", "At first I missed it since its in this teeny strip mall type thing south of Hatcher. The little parking lot was full so I decided to chance the Wireless Phone store next door, parking at the end, completly ignoring the tow away zone. Living on the dangerous side - that's me! LOLWhen I walked in, it was PACKED. Sunday 300pm, guess everyone came in after church. I was quickly greeted by a waitress and asked for here or to go. I ordered out and got the Alambre De Res. I asked her how many tacos come in it and was told an order of three. Only when I got home to find two corn tortillas hiding under the mound of beef. Anyway, as I was standing there to pay, another waitress was handing over these two fruit things, the nosey person I am quickly asked what is that because it looked delicious. She called it a Fruit with Whip Cream, apparently it had sour cream and pecans in it to. So I ordered the Strawberry one as well.As it was just to crowded for me, I stepped out side, eating my Fruit Cream and waited for my order to appear. I was told it would take 10-15mins which I was fine with because of the crowd it was understandable. After about 5mins I realized it started to get hot and I stepped back inside and grabbed a seat and proceeded to people watch.There was one waitress who's sole purpose was to answer the phone, taking to go orders and packing them up as they were ready. Another one stood at the cash register and accepted all payments. I saw a man there not dressed in the pink shirt and khaki pants, perhaps the Manager? He would talk with the waiteresses, pointing out things that they quickly addressed. Just made sure everything was running smoothly.As I waited, I munched on the Fruit Cup - delicious! It had chunks of strawberries and pieces of pecans. Almost like yogurt. When I finally got my order home, and opened the box it just looked delicious...only missing one corn toritlla. What I liked about the meal is that it had a huge wedge of grilled onion and chili, so I could take a bite of that with the tacos. Grilled veggies are the best! The \"salad\" I didn't bother with, I think it was shredded lettuce, could've been cabbage, but since I didn't touch it, I'm not sure. Beans would've been a better side. I munched on the slices of cucumber and radishes that accompanied it. The meat was delicious with the melted cheese on top and with the salsa - a delicious meal it made!Oh. And all these reviews about it being a sketchy/scary area. Umm..not really..6/1/14 Update: This visit I got the Mexican Pizza in the appetizer section - delicious! I also got the Alambre De Cameron (Shrimp Tacos) SO GOOD! Filled with shrimp, topped with melting cheese. I didn't want the \"salad\" that usually comes with it and asked for beans instead. Welll...they gave me double serving of rice. BUT! It wasn't the typical Spanish Rice that I do NOT under any circumstances like. It had corn, bell peppers and NO hint of tomato sauce anywhere. YUM!"], ["Monserrat M.", "I love this place! I been coming here since I was a little girl, and I had never had a problem with this place. Their tortas are to die for, and their fruit waters are a must if you come here."], ["Raquel A.", "Delicious! Waiting too long to try this place. I could've been spending my money on tortas here ALL THIS TIME!! I ordered a chicken torta and requested the tinga-style chicken. Freakin amazing, fresh and light choice for this hotter-than-hell Phoenix summer. I'll be returning soon to try other great priced, creative dishes here."], ["Matt G.", "This was my first time here and it was awesome!  The Torta Del Rey was the bomb!  It's not a fancy place, but it was clean with attentive service. The chipotle sauce was perfect. I'm a big guy and this meal was plenty filling."]]}