{"El New Yorican Central Catering & Delivery": [], "Sofrita": [], "Timo Wine Bar": [["Allie S.", "Yummy brunch! The hollandaise sauce was really good. $12 bottomless mimosas! Service was friendly. A little slow but it was Mother's Day, so it was busy! The patio was lovely and spacious. And dog-friendly!We have also been for wine and tapas. Great atmosphere for a date night!"], ["Steven B.", "Nice atmosphere and tasty food makes this place a nice spot for a dinner.Old fire station converted to a restaurant - kinda cool.The patio area is also inviting( and dog friendly).Overall good experience - I would go back again."], ["Ericka B.", "I really wanted to like this place for dinner it seemed to have such promise but our party left disappointed. We sat on the patio since it was such a nice night out. Half of the tables were plastic card tables and chairs with table clothes. It was a strange contrast to the other patio furniture and indoor decor. Our service was ok. We had to request a refill of the water bottle twice and the waitress just seem to agree with is but not really know the ins and outs. As for the food our party had the lemon chicken, braised short ribs, crab cakes and lasagne with sausage. Only the lemon chicken got a somewhat thumbs up. It only had some slightly burnt areas and was a little too lemony. The braised short ribs were moderately burnt not that it mattered because it was so salty there was no taste beyond that. I sent mine home with my friend to give to her husband, maybe he could eat it. The lasagna had potential if the entire top layer wasn't a piece of charcoal. It was nice to discover that under the excess sauce and sausage. Inedible. My friend then asked for the crab cake appetizer. That got an ok as well with only slightly burnt edges. Because we were still hungry we decided to order dessert, chocolate creme brûlée with brandies cherries. It was good I think but over half was made of cherries. I thought they would be on top or on the side, but we're in the dish. The side of bread was delicious, which made us think we should have stuck with pizza. Doubtful any of us will return since there are so many other options to try."], ["John G.", "Timo is in a really cool space - great atmosphere!We started lunch with the Sriracha Shrimp small plate.  It was pretty good, but not something I'd order again.Ordered the Loaded Italian pizza - the toppings were really tasty.  The crust...ummm...not so much.  It was kind of spongy, no char, just not what I'm looking for in a wood fired pizza.4 stars for the atmosphere and toppings, 2 stars for the crust - averages out to 3 stars."], ["Danica L.", "We enjoyed the meal but it was a hefty cost that we paid for it. It's four stars for the food and two stars on drinks. Five stars on the setting and service. The meatballs were ok, the spicy sriracha shrimp was fajita like with more heat, but the pizza was fab. A glass of wine is pricey here and it doesn't go that long of a way either. Maybe the long drive had me parched but the glasses of wine seemed fairly smaller than the average pours. For a tapas place, wine is a must but it would be nice to have lower priced glasses available or perhaps more types to choose from in the glass option. Soda is served in a can, yes they give you the can. Indeed the patio was Amazing and the ambiance was perfect. A little crowded but manageable. I'd go again but would choose happy hour."], ["Courtney C.", "I want to say that I was not expecting to find such a good restaurant in Arizona.I was here for a convention with the American Cancer Society. I was with friends and we decided that we needed to go out to a nice girl night dinner the first night that we arrived. I never though that I would find this gem.I would've given it a five star but the service was not the best. Food: was amazing! Such a good menu. They had so much good food. I went with a bunch of girls and we had share all our food. It was my first time having escargot and it was surprising good. There is a brie soup with truffle oil and I highly recommend that you try this. The spinach dip was amazing and I love the toast they serve with it. Also, if you like scallops, you must try this places scallops because they were cooked perfectly. They have a cool brochette plate where you can pick three of there brochette and the brochette is huge. I highly recommend doing the brochettes because they are big and totally worth the price (about $13). It is also very filling. However, my friend was little disappointed with the salmon because it wasn't warm (i think or there was too much). The atmosphere: Its very romantic and they have an outside patio area with lights and it so pretty. Also, there chairs are like little couches or comfy chairs. I sat with my friend on this little leather couch. Its a very intimate setting. Def a good place to bring a date or have a girls night. Lastly, I will say I really enjoyed the sangrias because they were so tasty and fresh."], ["Lisa C.", "Another visit to Timo.  As always, quickly seated and attended to.  Had my usual butternut squash soup and corn bread (not like regular corn bread...this stuff is insane!) and this time had diver scallops...with pesto.  Surprisingly delicious.  I had intended to ignore the pesto and ended up swiping the scallops in it!  And then, when I left and realized, 20 minutes later,  that I had left my phone there, I went zipping back.  The waiter had it tucked safely behind the bar and when he saw me came running over with it.  Great service and, as always, a great dinner."], ["Kaily N.", "Wow. This place I'm definitely returning to. Very unique in its own right. A must for dinner, early to mid evening. The setting is a little darker on the back patio but it's too pretty not to sit out there. Very hip and very romantic feel. I think it's an old firehouse. They offer two unisex restrooms that are very clean. There's a big firepit on the back patio that I think you can reserve. Oh... Their food?? Yeah let me get to that :) Their bruschetta I was NOT expecting. They're huge!! We tried all of them and all of them were amazing. Especially the one with tomato, brie, and olives. Yummm. I asked our waitress, who took a little while to get to us but it was a bit busy, what light sweeter red wine she recommended and said to get one of the light Pinot Noir's. Can't remember the name... Bridge Water maybe? I got the Brie Soup, which was a bit Salty but soo delicious. My date ordered the Crab Cake Benedict and that is a MUST try. I was jealous. And. The. Chocolate. Creme Brulee.Good, fun service? Check! Yummy drinks? Check! Delicious food? Check! Delicious sweets? Check! Music? Very good and very fitting! Pretty fair pricing? Check! (Except maybe the wine, $9 a glass to start is a bit up there...)"], ["Patrick N.", "OK, let me begin by saying that there are THREE things that I enjoy most about dining out. 1. The food. 2. The ambiance. 3. The quality of service. TIMO gets 5 stars for both their food and ambiance, and about 3.5 for the service. Now, the service isn't bad whatsoever, but I really enjoy a vivacious and personable waiter/waitress that spends a little time chatting with us. The place is small indoors, but cozy, with a brick oven and all. Outside has a really nice lounge area with a large fire pit and lights/heaters all over. Very romantic. The food is really really good. We've eaten here twice, and both times we had appetizers, salads, entrees, and even desserts. ALL fantastic, with consistent quality! And I think what I love most about this little gem, is that it's \"hidden\" and none of our friends really know about it, so we always feel cool when referring people! ;-)"], ["Debra W.", "Timo's was selected as this month's foodie adventure for our work party of 9 was which excellent with the help of our awesome server, Kevin who even helped us celebrate a couple of birthdays. We enjoyed Kevin's many recommendations for both good and wine!Making a decision for Top Picks was tough as everything was deliciously prepared. We enjoyed all 3 thin crust pizzas but picked the (def not ordinary) Mediterranean for originality and the Chicken Jalapeño for creativity. The Spicy Copa stood out as the best amongst the other selection of delicious bruschetta. For Tapas, the crab cakes. Best for sharing was the Artichoke & Spinach dip, another def not ordinaryAnd for Oven Pizzas, the short ribs. To be honest, it was tough making choices because there wasn't a bad dish on the menu; which we probably covered about 90%. We will definitely keep this one at the top of the list! Thank you Kevin and Timo for the great foodie adventure, experience and a wonderful evening!"], ["Carol N.", "The best beat salad and sangria in Phx.Michelle was very helpful with suggestions. ..loved it so much I made reservations for brunch"], ["T W.", "This place participated in Restaurant Week.  We try to go to at least one every year.  This year we chose Timo.First tip, don't use Yelp to book because only the manager sees that.  Apparently today was his day off, so no one knew we had a reservation.  Really not a good system they have there.  Fortunately there was a table large enough for our party.  When I tried to call for a reservation (before using Yelp), no one answered and the message I left was not returned.  Even now, no call-back.We all ended up going for the Restaurant Week menu options. I started with the lamb chop appetizer.  It was pretty chewy, the flavor nothing special.  The presentation was well-done.  Next for me was the short ribs.  Sort of like a really good beef stew.  Looked fancy, but wasn't.  Still very good.  Dessert was Creme brûlée.  It was very nice, though I didn't like the cherries.  They were too strong and overpowered the chocolate.I sampled what my wife ordered as well.  The bruschetta not very good.  The bread was too chewy, so instead of just biting a piece you had to pull and tear.  So the toppings fell off.  And the flavors were OK, but not \"wow\".  I'm comparing to Vintage 95 when I say this.  Her salmon was fine.  Didn't really \"wow\" me either.  They are pricey, which is fine.  But \"pricey\" needs to \"wow\", and this was hit and miss.  Some things were good (like my short ribs), some were just OK.  They would kick Chili's butt, and at the same price as Chili's I'd probably go 5 stars here.  But a place like this is holding itself up to a higher standard, and they just didn't quite make it.  A solid 3 stars.  Maybe 3.5.  They are not Vintage 95.The ambiance is trendy/hip."], ["Anita E.", "A very nice cozy spot. I drop in for a quick cocktail and boy was I surprised I a pineapple lavender a signature cocktail. Organic and delicious . And salmon cornbread cakes and chocolate creme breule  just say this I'll be back !"], ["Amy H.", "Really impressed. My honey had the small plate meatballs which he enjoyed. I had a crispy kale salad; if you like you can get any of their salads in a smaller portion for $5. I also had a blue crab cake which was mostly crab and not a lot of fillers... Yum! White peach sangria was good and $6.95. The staff was very friendly, and the place is small but cute with a garage door front and industrial style with pretty velvet chairs. They have a pretty and dog-friendly patio with live music on Thursdays. The coolest part was sitting at the bar watching the chef create everything right in front of us in the wood-fired oven. We'll be back for their great specials like lasagna dinner for two with a bottle of wine for $22(!)"], ["Wyatt M.", "My every experience at Timo has been delightful. With modern decor, friendly and courteous staff, wonderful dishes, and excellent rotating specials, you'll have a marvelous time. Amy, the bartender working every time I've visited, has been charismatic, perfect with her suggestions, and an absolute pleasure to dine with. I have had the bruschetta, the brie soup, several salads (the oven-roasted chicken salad tonight), the prosciutto pizza, the chicken pesto burrata BLT, and the creme brulee, and not once have I been disappointed with my choice in the slightest. Brunch on the lovely dog-friendly patio has been charming, and they've had no issues with providing a wide palette of different options for my vegan and vegetarian friends. This is, without a doubt, one of the best establishments I've encountered. I suggest you stop in, try the bruschetta, a glass of wine, and see if Timo is the same lovely fit for you."], ["Ryan P.", "Great atmosphere! Reasonable prices. The back patio is big and very cozy. Beautiful ambiance."], ["Jared L.", "Very cute place. My hunny and i stumbled onto this place one night and it was great. I had the pizza - excellent. Service was awesome - always checkin up on us but wasn't annoying about it. Cant wait to go back"], ["Erin R.", "Two Stars are for the service and ambience. The food, however, was horrible. Granted, we did come here on a Monday in the middle of the day and there were no other customers, but just the quality of the food itself was poor. The buttersquash soup had a gelatinous consistency with way too much flour in it. It tasted like gummy potpourri. The plum tomato soup was watery and tasted like Campbell's soup. Having recently enjoyed Postino's and even Sauce's tomato soups, Timo's soup was a considerable disappointment. The bread for the sandwiches was not freshly baked and lacking depth compared to other fresh baked breads. There was nothing \"wood fired\" about it- more like \"heated really quickly in a wood oven.\" Definitely will not be returning here for food but perhaps for wine on the patio, which is a nice find for the area and is dog friendly!!"], ["Christine P.", "I think this might be the spot. this place is so cute. Love the layout. :))) butttttt... let me start off by saying parking was ridiculous!!! Who has a parking spot that only has 8 spots... Omg. I parked right across the plaza from the gas station. We walked!!!! :(We started off with the artichoke dip. It was fabulous. It was spot on creamy and hot. The bread with crunchy and it well with the dip. We also had the margherita pizza. Very declious :))The waiter wasn't very helpful nor seem like he likes his job. I asked for new plates because the plates we have on the table was wet and muggy look. He took forever, so I went and got it myself. This was his response when he saw me get them \" thanks for getting them, (shaking his head) \" wow.  really?!? Oh there's more. So my girlfriend and I ordered the Creme Brule. He came over and had the torch to caramelized the top of the creme Brule. I said awesome, do you mind if I record this. He said \" wow, what is this world come to when you have to instagram everything\" seriously?! I just snarled at him.  Seriously,  the food was great, the dessert was delicious.  But this guy must be a joke... riight?!I'll be back, but not to that kind of service."], ["Penny W.", "One of my favorite hidden treasures- Delicious food and great atmosphere.  Sat outside, listened to a fabulous guy play the guitar and sing a few songs that brought back many memories.This is a definite must!"], ["Leanne L.", "This was an excellent experience!  Our waiter Nathan was perfect in following up & didn't ever make us ferl tudhed. Tge good was beyond what I expected.  Can't wait to come again."], ["Jason R.", "This is our first time coming here and it was a wonderful experience! Our waiter, Nathan, was superb. Love the ambiance and the bruschetta was fantastic."], ["Daetriel O.", "I am in love with this place! Nathan is absolutely amazing! Next time I come I'm definitely having a party on the patio with the fire pit. The beverages are awesome also. Be sure to come check it out!"], ["Frank W.", "We love this place! The atmosphere, the service and the food are all top notch. The first time we came to Timo's it was my birthday. I did some hunting on Yelp as we really enjoy tapas I was looking to a place to get them. The menu has some delightful tapas or appetizers as they the portions for them are are on the big side. I have had the escargot on several occasions and the first time was simply amazingly good. This dish does seem to very depending on the cook that is working but it has never been bad. The artichoke dip is another that's always outstanding.There bruschetta is quite nice it has a bit of a twist to it as you can select from a variety of toppings from traditional to neuvo. The wood fired pizza is terrific! The sandwiches to die for yummy... And have I mentioned the wine... It is a solid list of good wines at really reasonable values. They are hand picked and change regularly, most can be by the glass or the bottle. There are three specials two of which are in the menu. The third you need to know about as it is a hidden one for regular customers. Look for the Sunday and Monday specials on the menu, they both will make for a great meal for two including the wine... for the price most of us would gladly pay for the bottle alone. *** Tip The third requires you to be on the email list and is sent out on a regular basis. Check out the web site for details ***I may add more later to this review, just know you will find this Jem of the Desert a true oasis from the mondane."], ["Amanda W.", "1st time here and I'm thoroughly impressed!! Unbelievable atmosphere. Spectacular hospitality. Ask for Nathan, he's out of this world. Goes above and beyond!! Couldn't have asked for a more positive and enjoyable evening. Thank you!! Again.....Thoroughly impressed!!! Check it out!"], ["Sheeba S.", "My fiance and I love the dog friendly patio and the food is consistently wonderful! We love the various wines (especially the peach sangria, yum!) and the atmosphere. Our dog is happy there too as they always bring him a water bowl. You don't feel rushed when you come here but try to make reservations if you decide to come at night. A true gem here in Phoenix! The only tip for improvement that I have to offer to to make the bruschetta bread a bit softer as it can be difficult to chew."], ["Marc S.", "We come here for brunch. The food has usually been pretty good. Lately, the place has gotten dirtier and dirtier. They tell you to sit anywhere you like but every chair is dirty. The floor hasn't been swept. There are a lot of flies. It seems like the owner and employees don't care. There is hardly anyone ever in here. There has only been 4 tables at the most at the same time. It's probably because it's kinda gross inside. The service is average. The food is good however it is cold half of the time. We may wait awhile to try this place again. Hopefully they start to clean up every day like they should and hopefully they figure out the cold food issue by serving food on hot plates. That would help."], ["Anthony S.", "What a joke,  party of 12 and our food came out separate in a 30 minute span. Food definitely sub par, I'm a restaurant manager and was very disappointed. Better places than this. Not coming back"], ["Audra B.", "We LOVE this place. My husband & I chilled on the quaint patio sipping great wine. Ask for Nathan. He made us feel like new friends hanging out on his patio. AND the food was great! Try the beet salad & something from the wood fired oven, we had the Mediterranean white pizza. A-mazing."], ["Tara G.", "I really want to like this place more but they need a little TLC with their service. Atmosphere is a mix between a vig (arcadia) and postinos. Really cool fire pit makes for a nice loungy spot. Service is slowwwww. It seemed they only had 2 servers for the whole place. They were both rushing around and once tables got up to leave, tables stayed dirty and were never bussed...I suggest they get a server assistant to help run food! Things would go a lot more smoothly as a whole. Our server was very nice but he seemed so stressed! If you can't run a restaurant the right way, then why stay open. Bump up your staff so your restaurant can run the right way."], ["Chukki S.", "This place is cool!  I like how their patio faces away from the street noise.  And they have big firepits out there too.  Wine was good too.  I didn't try the food but we will try that next time.  Servers were friendly and prompt.  I wish they had the NFL Network because I was missing Thursday Night Football, but I get that's it's not a sports bar."], ["Diana B.", "No one wears gloves at all when preparing any food, they touch everything.  Will notgo there again, and, it is too small and too noisy"], ["Khaldoun B.", "Expensive, average food, gluten free bread options are misleading. They just skip the bread with bruschetta & simply call it gluten free. Should have listened to my gut instinct. I don't understand the hype, maybe it's for the wine which was decent but nothing to write home about."], ["Leah D.", "Checked out Timo's for the first time yesterday. Fell in love with the Brie soup and salmon small plate. My only complaint is that they are so far! ;)"], ["Charlie M.", "This place is really good ! I have been to timo a hand full of times and everything I ate was amazing and every drink suggestion from our bar tender Amy has been superb !"], ["Crystal E.", "Love Timo!!! We like to come during brunch and happy hour to sit on the patio!! They have excellent food- we suggest the bruchetta or the antipasto platter!! The mimosa flight is also wonderful (only available during brunch on the weekends until 2:30). This place also has a great fireplace and lights on the patio for night time."], ["Cassie N.", "What a quaint little spot! They have a great patio however we chose to sit inside, but only because the patio chairs were too \"loungy\" for us to eat dinner. I'm sure the patio is perfect for happy hour and relaxing with friends! There were maybe 4 tables with chairs to actually eat. DEFINITELY make a reservation,...even on a week night. There are maybe 10 tables (mix of 2 top and 4 top) inside. The service was great! The atmosphere and decor is cute. Once the sun goes down they open the glass garage doors and let fresh air in. It felt like being outside! We had the scallops, meatballs, salmon platter, and margherita pizza with sausage. Everything we ate was delicious! I would absolutely recommend this place. Thanks, Yelp, for the recommendation!!"], ["Marchant D.", "We have been here several times.  The food is good but the service is always lacking.  Today's experience took the cake.  We arrived with my family (5 of us) at 11 am for lunch.  We waited 15 minutes in the parking lot for them to open.  At 11 am we began to go inside and the cook started to shake his head no as we walked towards the door.  He said \"i don't know what you are doing, I don't have a server\".  He was rude and when we asked what he wanted us to do since they were open and we were there to have lunch.  He said rudely, \"I don't know\".  He then walked away.  We said well I guess we will find somewhere else to eat.   There were a million better ways for him to handle this.   He should have welcomed us in and apologized for his server not being there and maybe offered us a drink while we wait.  I suppose this is the reason he is a cook and not in the front of the house.  As we were leaving the \"server\" had finally arrived.  He said you guys can come back now, I can serve you.  Well, a little too late.  The damage had been done and we were not happy and probably will never go back there.  I decided to call and speak to a manager when I got home to make him aware of our experience.  The manager answered the phone.  I told him what had happened and he said he was actually the \"server\" that arrived as we were entering our cars to leave and he had told my husband we could come back in.  I explained the cook was very rude to us and the damage had been done.  He said he was sorry but didn't seem to affected he lost 5 customers.  I would not recommend this place and we will not be going back.  Timo's is poorly managed and run.  If they plan to not have anyone but the cook there at opening then they need to teach him some customer service skills."], ["Sarna O.", "Delicious. We stopped in for a quick bite before a concert. Had the Smoked Salmon and Corn Cakes and the Antipasto plate. Yummmmm! We will be back to sample other menu items."], ["Sara P.", "We just had a wedding at Timo with about 90 people attending. The food was fantastic and the service was out of this world. Our guests were greeted with delicious appetizers and champagne. The food received rave reviews and we danced on the patio until midnight. I cannot say enough good things about the service, food and atmosphere. It made it a worry free, fun, magical night for us."]], "The Market By Jennifer's": [["Elaine D.", "Loved our breakfast! One mimosa is all I can do. Had pulled pork and chiles omelet with white cheese, completely delish and gluten free! Definitely coming back"], ["Janet M.", "Stopped by here on the fly one day to get to go dinners. Revelation!  The food was so delicious we decided to come back for brunch. It's a menu brunch rather than a buffet.  The food is so well prepared and the ingredients chosen with such care.  The staff is very welcoming and knowledgeable.  They have a full bar as well as a good wine and beer selection.  We went back to try the dinner. I ordered risotto, which was as good as it gets.  My companion ordered the salmon.  Just delicious.  They have a nice selection of desserts. We went with the Bananas Foster bread pudding. Many, many yums.  I cannot recommend this place enough."], ["Sandy W.", "What a find in the neighborhood!  I had the chicken and polenta and it was over-the-top fabulous.And the service is wonderful.  What a treat!"], ["Shoni S.", "First time patrons,  Sat afternoon,  quaint place,  fun and fresh decor. Good service.  A bit confusing for a newbie,  seeing that there was no direction as to if you are to wait to be seated, seat yourself or order at the counter.  Great presentation of the meat nosh board and herb fries accompanied by iced coffee(that had no real strength to it) and was surprised that a restaurant like this didn't serve a simple syrup with the coffee, but packets of all types of sugar. Meat nosh board was tasty,  Good variety, could use a bit more cheese and bread for all of the meat they give you,  And the peach chutney was oishii(delicious)! Try, it won't hurt."], ["Jayd L.", "I work right down the street from The Market and often have little down time in-between tanning clients to eat, so I love the convenience of stopping by The Market to pick up a delicious, gourmet meal from their \"Grab N Go\" section that offers REAL, quality meals that'll nourish and energize me for the remainder of my day. You won't find long lines here or in their parking lot. Parking is a cinch (no valet), which allows me to literally walk in and out in 5 minutes. It's one of the best attributes of The Market that I can greatly appreciate.A hungry girl is no pretty sight so time is of value when it comes to feasting.I'm also here every Sunday stocking up on my Evolution Juices for the week because The Market sells them at $4! That's the best price I've seen so far in the Valley, plus the girls and Richard always have a warm smile to share every time I walk in. The restaurant has an open air feel to it, great packaging for spices and delicious pastries. I've only had one opportunity to sit down and dine, but I'd love to explore their menu more."], ["Tracey C.", "This is a great find and a great addition to the Arcadia area! My family stopped in for lunch  and was very pleased with our meals. I had the Cuban which was great and my husband had their burger. You can tell they are using fresh ingredients and there is a lot of attention to detail in the entire experience. I am looking forward to coming back and trying their nosh boards! It seems like a great spot to bring a group of friends for drinks (great wine selection) and we def want to come back and check out brunch which they serve until 5pm- bonus!This place really deserves some love from CenPho people and I hope you all check it out!"], ["Chris H.", "Food is awesome!  Locally sourced, great service, country breakfast chic and they even play football on the big TV along side your aromatic surgars (locally made)."], ["Michelle J.", "So happy to have this in the neighborhood! I've been there several times and not been disappointed once. I can see how Jennifer has been a long-time successful caterer. The Cuban sandwich is plentiful and delicious. The asparagus, burratta, and prosciutto salad is a nice light offering but still satisfying. Butternut squash soup hit the spot. I enjoyed the fresh shrimp po boy - the shrimp was not fried - which made it feel healthier.I'm not a huge fan of the nosh boards, the corn chips are nothing special and the combination is a bit weird.  Do try the brownie cookies, you will not regret it."], ["Mike D.", "Amazing food and a great staff. Karleen is one of the employees and she always recommends the best items on the menu to eat. We also met Jennifer for the first time and she made the experience even better, very happy and made us enjoy our meal even more. S'mores board is a must try for desert."], ["Chaz V.", "Way overpriced for okay food. Sorry, I was hoping it would be a new favorite spot but I'm going to have to pass on this one."], ["kara y.", "The Gaslight Square is on fire and this is another bright option to this strip mall. Why am I so hooked to The Market? They didn't copycat any typical new restaurants. All of their interiors are fastidious and tasteful (not just thrown up yesterday) and they definitely have the cafe vibe. I'm excited about the cheeseboard and charcuterie options plus happy hour. Baked goods are very yummy and quiche was gorgeous.  Staff were extremely professional - even making sure that tidying up (sweeping) wasn't a bother to me.Thanks for the great option in our neighborhood! Looking forward to kicking back on your patio this spring. Folks, they also have ample parking... A commodity in Arcadia."], ["Tara M.", "What an adorable little place! The food is amazing!!! The staff is friendly, knowledgeable and helpful. The pricing is a little high but the food is delish!"], ["Catherine H.", "My husband and I came here with a groupon to try it for brunch.  We were not disappointed!  We both had the steak and eggs, which was savory and filling.  We also both enjoyed a Bloody Mary that was made with homemade mix.  We really enjoyed dining here and will be back!"], ["Jerrod K.", "I'm not one to fling around perfect ratings based on just one visit, but this place made such a great impression on me there was just no alternative. I had the salade niçoise and a side of the herb fries ... MY GOD SO TASTY. The salad had perfectly seared sashimi-grade yellowfin tuna, and the dressing was light and perfect. The fries ... I have no idea how they got the fries so crispy and delicious. After lunch I bought pretty much one of everything from their bakery display case ... their pastry chefs know what they're doing. I loved the French décor, too. The music was hit and miss though, but no big deal. Oh, it's not visible from the street, really. It's on the southwest corner of the strip mall. The main entrance faces south."], ["John H.", "Love the neighborhood feel and location of this restaurant.  Every dish we ordered was outstanding.  Can't wait to try the Grab and Go options!"], ["Stephanie K.", "I am so excited about the wings. OMG. Even better - by checking in on yelp we get an order free today!  Everything I've had here has been wonderful."], ["Rae I.", "So it seems that the owner of this business is just as unprofessional as her employees!After my conversation with them on Wednesday, today I received a call from Jennifer and a voicemail that was largely sarcastic in tone, as well as unapologetic for her employee's behavior. Also in the voicemail was her distaste for my yelp review that she called \"harsh\". She does say \"I apologize\" at one point in a tone and verbiage that is clearly an \"I'm sorry, I'm not sorry\".\"Hi Rae, this is Jennifer with Jennifer's catering... I would love to chat with you. I know that you chatted with Amanda yesterday and I see you had a \"very large problem with that\", so I'd like to talk to you about that. I apologize if she came across...um... harsh? But... uh, yeah... this yelp review is awfully harsh too. BUT, I think she was just going by the guidelines but, uh... obviously that was very (inaudible) to you so I'd like to discuss.\"Jennifer ends the message by leaving her number and an extremely curt \"Thank you\". How inappropriate can you get?!? The only reason you have my information is because I gave it your staff member before I realized what kind of a company I was dealing with. The information was given under the pretense that I wanted to hire you to cater an event, not call and complain about my very accurate, well deserved yelp review and subsequent review update. A tip: Don't call and leave voicemails complaining about yelp to the yelper who left it for you in the first place. How in the world do you have a successful business when you don't know the basics of customer service, hospitality and appropriate business behavior? I'd also like to add, if you had called and were actually professional, apologetic and genuinely concerned about \"very large problem\" & the poor experience I had in the first place, instead of your yelp reviews, I would have gladly changed/amended it to say that you called and cared. Instead, you shot yourself in the foot and now this is here... To anyone who is thinking of hiring this company, you've been warned! As for me, I've moved on and booked someone else."], ["Gina D.", "Loved this place,  I had the seared yellowfin salad, and it was amazing.  It's pricey but worth it .  I would say to order it raw since I got it medium and it was cooked all of the say through, with no pink.  It was still amazing, even over cooked."], ["Lisa C.", "First visit...all by myself.  Sunday pre-evening,  kid-free, errands done, glass of wine and a nosh desired.  Drove by, saw a light crowd, a patio, and a bunch of motorcycles.  Clearly not overly pretentious...so I stopped.   I had a very attentive waiter,  a lovely glass of wine, good butternut squash soup and an amazing salad with beets and pistachio vinegrette.  Happiness on a patio!   I look forward to a family dinner here to try the salmon :-)"], ["Rebecca M.", "VERY excited about The Market by Jennifer's. As in, I tried it this past weekend, and oh, I'm already going back today. I was excited to see that the place was packed because I want this market to be around for a long time.The LOCATION is great.  In the complex with Antique Gatherings, Poor Little Rich Girl and Zipps, Right next to Crudo, and facing 36th Street. They've taken limited exterior space, and managed to make a great outdoor patio (that doesn't face Indian School - yay!). INSIDE - ohemgee. Exposed ceiling, french-inspired chandeliers, and cafe tables. The devil is in the details, and they nailed it. Even the water beverage bar is on a french industrial table, while the order numbers for your table are made of solid wood with bold-font numbers. It feels provincial, trendy and local at the same time. I like a well-designed space.  The SERVICE was great.  Diners order at the counter and the food comes to you. As soon as we walked in, a server told us the process, gave us menus and told us to make ourselves comfortable at a table while we decided.  This avoids a long line at the counter.  While we sat and looked at the menu, we were served water and asked if we had questions.  (Although this is an order at the counter cafe, we never had to get up to refill our water glasses.  The servers were on top of this for us.)And we did have a question - which of the MENU items do we try because they all sounded ridiculously good.  Traditional lunch and dinner entrees and \"nosh boards.\" We went for the Molten Fondue Nosh Board because we were on a diet (I kid, I kid.) Fresh fruit, locally-made sausage, bread and pretzel bites on a great wooden board with a small cruet of fondue. It was a prefect light lunch for two.  And it was so good that when we finished the board, I was honestly tempted to drink the few remaining drops of the fondue straight.  (Maybe they should offer this as a cocktail \"molten fondue, neat.\") We didn't have dessert or pastries, but the looked worth the splurge.Last but not least, the \"GRAB N' GO \"  A fridge of prepared entrees that you can buy and pop in the oven at home. I was excited to see entrees in a range of palates - sophisticated choices for an adult get-together to comfort food for the kiddos. (I hear the mac n' cheese is so addictive you should warn your arteries.)My only point of contention (every review has one) is that they are closed two days - Mondays and Tuesdays.  Deal breaker?  Nah. I'm hoping they're testing the waters and might compromise on one day for those of us hoping to pop in to grab an entree or two for dinner.So clearly, I'm a fan. I will probably become a Norm-like regular. Cen Pho / Arcadia was crying for a place like this - casual, easy with exceptional food.  Yay. Yay. Yay."]], "68 Degrees Sabor": [], "Postino Arcadia": [["Bri F.", "Love the bruschetta!  My favs are the brie and apples with fig spread, prosciutto and fig with mascarpone, smoked salmon with pesto, and ricotta with dates and pistachios!  I've had the salads and sandwiches.  They are good, but you can get those most places, so I usually get the bruschetta! Staff is great.  I don't drink and usually stick to water.  Their water glasses are small, and they frequently have to refill it, but I usually end up with a glass full of ice and a sip of water lol."], ["Jel G.", "I love this place! I've been to quite a few wine bars these past few years around Phoenix and Los Angeles. This restaurant is by far the best one. It's my go to place to hang out and have some wine and bruschetta. I especially love the artichoke spread and smoke salmon Bruschetta. They have the best deal in town. $20 for a bottle of wine and bruschetta on Monday and Tuesday starting at 8pm. $5 dollar glass of wine deals all the other days.I've also had their breakfast sandwich and salads. I hope they open one closer to North Scottsdale."], ["Jenna A.", "I don't know how I've never reviewed Postino before! It's definitely my go to for date night or girls night. They have great specials including the infamous $20 bottle & board deal on Mondays and Tuesdays after 8pm. If you can make it for lunch or early happy hour they also offer $5 glasses of wine until 5pm. My favorite bruschetta toppings are the Brie, apple + fig, and the goat cheese + roasted red pepper. The smoked salmon pesto is worth noting as well. When I'm in the mood for something lighter I usually go for the mixed greens salad with pear, candied nuts, Gorgonzola and a light vinaigrette. The only reason I docked a star is because I'm not a fan of the parking situation. It's extremely limited. And while they have valet, I wish there was a way to offer more (free) parking."], ["Ann Y.", "OK! Where do I start......, first things first let's start with the amazing Bruschetta........OMG! OMG! It was by far the best Bruschetta I have ever tasted..... If you don't try anything in your life... This is a must!!! I know, I know it's toasted bread but it's not the bread it's the toppings on the bread......I had the Brie and apples with fig spread: the Brie and fig melted in your mouth and then here comes the crunch from the apple... POW!!Fresh Moz w/tomatoes you can't go wrong! Smoked salmon with pesto.... Yummy White bean with chopped tomatoes....round two please..At first I looked at the price...$14 for Bruschetta but you get to choose up to 4 different varieties so that was great. Worth every penny!!!!!The wine was delicious!! Before 5pm all wines on the wine list are $5 so keep them coming! (I had the Victor wine it's a red zinfandel with vanilla under tones) I also order the mixed greens salad... Don't let the name fool you.  It's was soooooo good! It had shaved pears, candied pecans, red grapes, Gorgonzola, leeks and mixed fresh greens...,this combo of flavor sent me on a tail spin... ( I know I'm a drama queen) My husband had the turkey panini it was delicious but nothing to scream about.  Desserts was the crème de la crème of desserts....salted caramel sundae..... Vanilla bean ice cream with chocolate cover corn nuts and two pretzels on the side with a side of salted caramel to drizzle on top!!!! Yummy!!!! This place has a warm and inviting atmosphere. The host was very accommodating. Get there early!!!This place is always crowded and I see why!"], ["Jaqueline J.", "Ive been here a few times for dinner. The atmosphere is great. It is dimly lit making for a more intimate feel. Their wine selection is good and their food is great. I've had the bruschetta board, which is a must try, with my favorite being the roasted peppers with goat cheese as well as their Nine Iron panini on focaccia. The cheese board is also delicious!! Really enjoy coming here, even if it is a little bit of a drive for me."], ["Tiffany A.", "Wine, bruschetta, friends, and Yelp was how I spent my Labor Day here at Postino's! I had the cabernet and tried four different types of bruschetta, which were all amazing (not a huge fan of the artichoke spread), but still loved them! $5 wine before 5 p.m. so make sure to head in early! It had a very relaxed, chill atmosphere and comfortable seating options where you could choose table, high tops, booths, or even couches. Music was a bit loud, but still enjoyed the vibe. Jet really made the experience here excellent. He took his time to give us the history of the restaurants and the management behind them. He gave us great recommendations of other restaurants under the same ownership that happen to be next on my list to try!"], ["Leslie M.", "I love me some Postino from time to time! You can never go wrong with anything you order because everything is delicious! My partner and I came for a late dinner and I loved the ambiance. I always love the ambiance during the day, but at night - it is so intimate, romantic and dark! Our server was really great and it is always a delight to visit!"], ["Eugene S.", "Five stars for $5 wine by the glass and beer pitchers from open toll 5pm!! The good their is well prepared as well. Definitely try the bruschetta!"], ["Will B.", "Once again another wonderful experience at Postino.  The staff was attentive without being intrusive and the bruschetta was delicious.  Be sure to get the Apple, Brie and Fig if you are getting the bruschetta and save it for last.  Also outstanding was the Smoked Salmon with Pesto.My girlfriend also had a cup of the soup of the moment which was Tomato Basil.  She said it was fantastic.And of course when discussing an evening at Postino you have to talk about the wine.  The selection is amazing and the staff is knowledgeable about the selection without being pretentious like I've seen in similar places.  If you are intimidated by the selection or just don't know what you would like they will be able to assist you with finding the perfect match for your meal and your tastes."], ["Marina V.", "Fantastic place!!! Helpful hint beer pitchers & wine are $5 everyday 11-5!!! The food is really amazing and fresh! VALET IS RUDE and semi lost the keys and gave a sour look that we \"only\" tipped them $4 bucks after all that. So I would not suggest valet. Although I don't believe they are associated with the restaurant I think they are outsourced. The tomato jam is great! The iron skillet sandwich and all the bruschetta and mixed green salads are great. I didn't get a chance to try the Cream Brulé because I was overly stuffed but, that's next. They also had a cute brunch menu and since I do love a good brunch I will check them out."], ["Hailey B.", "Postino is my go-to girl talk, wine & munchie hangout! Their bruschetta board is off the charts ~you pick 4 options off of their delicious list~ {Warning: It's so hard to choose!! They're all amazing.} I've been known to get an entire board to myself for dinner! Whoops, carb overload but worth every calorie!! A few of my favorite classics are: Warm Artichoke, Red Pepper + Goat Cheese & Brie w/Green Apple +Fig Jam. Monday & Tuesday evenings after 8PM you can enjoy a bottle of house wine + a bruschetta board for $20!!!! Having a case of the Mondays? This is your spot!!!"], ["Jen T.", "The food is awesome here. I recommend getting the Butcher's Block as a starter. I absolutely love the bruschetta! You get to choose 4 different kinds for the price of $14. On Mondays & Tuesdays after 8pm, you can get a house bottle of wine and bruschetta for only $20! It's difficult to find parking around this place. They provide complimentary parking, which we use every time we are here. There is a relaxing vibe all around. You can choose to dine outside to enjoy the beautiful weather, or even sit inside at the bar. There's a huge selection of wine and beer. 7 days a week they offer $5 wine by the glass or pitchers of beer 11am - 5pm."], ["Mark G.", "This place was an awesome place that you can get a charcuterie board, soup, sandwich all at a nice price. Really liked the options here, you can keep it light and get a good meal here.The charcuterie board options were amazing. Very fresh meats and flavorful cheese. They give you a decent amount for the money and there is more than enough to share.I really wish they had one of these type places back home, I would go often if that were the case."], ["Holly M.", "This location is the original Postino and they are definitely doing something right. The food is excellent and they are almost always busy. If you're unsure of what to order, you can't go wrong with a bruschetta board. You get to pick four different types for one board. Get are great for sharing and you can't beat the price. Their raspberry chicken salad is incredible. It has a lot of flavor and isn't drove in mayonnaise. There are a number of sandwiches and salads that you can mix and match during lunchtime. If you're looking for a beer or glass of wine, you can get one for only $5 before 5 p.m.  It's a great spot to meet friends and they have a nice outdoor patio that is great most of the year. Just remember it can get a bit noisy."], ["Connie L.", "Great atmosphere at night. Bruschetta overall very delectable. Favorite is the one with prosciutto. Killer $20 for wine and bruschetta deal after 8pm Monday and Tuesday. They make reservations for larger groups."], ["Ally M.", "Postina Arcadia deserves more had the service not been absolutely dreadful. Which sucks because i have eaten hered before and loved it. Our server was a blonde older looking Woman and she was very rude and was hardly at our table. I had to flag a busser down for everything i needed and when i asked someone to send our waitress over she still went around to all her other tables.The food however is always really good!"], ["Lou H.", "My first visit to Postino and it won't be my last. Seated on the outdoor patio, with the heaters on, in the evening along with wonderful service, was perfection. The wine selection was great, and a cute touch coming out in mini carafes. A great menu and the bruschetta fantastic!"], ["Gabriela S.", "Nice surprise.....On a way to Four Seasons from the airport we Yelped lunch restaurants and was intrigued by the reviews and menu so decided to stop by.  It is in a more industrial area not a great part of town and for a little while thought we were lost by GPS leading us to wrong direction. only to come up to a place with tiny parking lot, jammed w/valet parking only- so good sign:)Place is very cool looking, loud (would suggest some noise cancelling options like area rugs or ceiling /wall padding), very granola like feel (reminded me of Portland and Seattle a bit), wooden tables, beautiful central vase w/amazing fresh flowers, plain bar. The best \"personal touch\" is the stamped toilet paper- def clever idea. The bathrooms are unisex and frankly when that busy should be catered to more- papers on the floor, overflowing trash, etc.Food- started w/the butcher's block- cured meats and cheeses- very good but not very much hard cheese at all. Bruscheta tried two- the burrata, bacon tomato is fantastic, the smoked salmon average. Prosciutto panini is OK- not warm/pressed enough and bread too think so that is mostly what you taste.Waitress wasn't that friendly (unfortunately) and did not know the wine list that well so could not describe the actual wines by the glass. Also did not offer wine list per bottle which we would have ordered as better selection.Overall nice place to come experiment if you are a foodie."], ["Erica G.", "Oh, Postino how I love you so.  During my most recent visit on Labor Day with a fellow Yelping friend of mine, we had quite the memorable experience. Jet, the manager, was very kind, welcoming, and generous. He informed us about the history of the restaurant and recommended others in the area. Truly, he went the extra mile with his positive attitude and engaging conversation. Furthermore, all of the servers we encountered were incredibly hospitable, friendly, and considerate. Now, for the food and drink. The menu is simple yet superb: soups, salads, sandwiches, and most popularly bruschetta are the options. My favorite is definitely the Hannah's Field, which is so healthy and delicious! Not to mention $5 glasses of wine before 5pm...talk about a wonderful deal! The dishes are affordable and quite tasty. The ambience is casual, artistic, and relaxed despite the very loud music. This is truly a spot where you can relax and enjoy good food and wine. I HIGHLY recommend Postino!"], ["Jessica P.", "Perfect spot for a date or a girls night out! Different wines to choose from and the bartender is great at helping you find something you'll like. Definitely need to order the bruschetta, you get to pick 4 and all of them are amazing so you can't go wrong. The prosciutto and brie panini is absolutely delicious with the fig spread and my favorite salad is the Hannah's field. The service is amazing and everyone is friendly."], ["Faye S.", "I have never been to a restaurant  that specializes is bruchetta.  This was a treat do not sleep on it.  The salmon and capers with pesto was my fav.  Happy hour wine 5 bucks added bonus. Special treat after a spa day.  Loved it"], ["Mark F.", "I thought I just reviewed his place let me do it again we stopped in for wine in a Balenie and extensive appetizer menu was almost daunting we finally decided to build our own bruschetta and very delivered product was unbelievable I'll be back"], ["Kamille D.", "Yum yum in the tum! Love the bruschetta! Was recently told about board and bottle nights. Awesome deal ! Can be busy and loud but busy for a reason!"], ["Alex S.", "Great food and ambiance. Bruschetta is on par and very tasty! Cants beat 20 dollar wine and bruschetta board night."], ["Nikki B.", "Really good gluten free bread makes the bruschetta menu work for this girl.  Fantastic combinations, small but selective wine list complements the menu. I'll be back."], ["Christina A.", "Went on a Tuesday night for the $20 wine and bruschetta deal. We waited about 45 minutes but ended up with a lovely and romantic table outside. We ordered a bottle of Albarino and a selection of bruschetta. They are not reinventing the wheel or anything but, what they are doing, they are doing it very well. Service was friendly too which only added to the overall experience."], ["Ivy L.", "This place has an amazing selection of wines and he bruschetta is delicious! We ended up ordering a bottle of wine and two bruschetta platters for 3 people.  The white bean one was delicious! Definitely one of my favorites! The apple and Brie was on the sweeter side, the mozzarella and tomato was also good, on the simple side.  The bacon and tomato was a superb flavor and the prosciutto and fig was also good.  I think the one with pesto was also wonderful and may have been my second favorite! The bread was soft, wish it was a little crispier but it makes for easy eats cause it's not hard to bite into! They also cut each bruschetta into quarters so it's easy to share all the different ones! Great for a wine night and bites where you just want to hang out and chat! The atmosphere is also good.. Very dark and candlelit inside and there are misters on the outside to keep it semi cool!"], ["Adelisa L.", "The food here is incredible!!! If it's your first time you need to order the bruschetta. All of them are good. I also enjoyed their wine selection. This is my favorite restaurant to go to when I'm in Phoenix/Scottsdale"], ["Edna M.", "I just moved to Scottsdale about 2 months ago, and this is by far the best place my friends could have brought us to. The ambiance and music were super cool, the food was beyond amazing. We got the butchers block, and the bruschetta sampler of 4 and we paired it with a nice bottle of wine. Over all a great experience, wish I could give it a 10!"], ["Raisin F.", "I had lunch here on 11-4 with my mom and her friend I loved my chicken mozzarella sandwich and brushetta. It was cheap plus they have complimentary valley parking. Loved the service and casual atmosphere. Will be back soon!"], ["Dwayne O.", "Been wanting to eat here for a long time since I frequently go to LGO,  Chelsea Kitchen and Ingo Tasty Foods.Ate here on a Sunday after church,  not to busy as compared to dinner time.Valet service for the car which parking is very limited. Not a drinker of wine or beer so automatically limited our choices of the place which very much revolves around the wine selection. Had the Autostrada Panini with the salad and the food was just not that great tasting. There was barely any meat in the sandwich. The Panini was ok but the combination of dressing and meat was not to my taste. I could see how this place could have a great concept with the wine bar, but for food they need to put more effort and expand the menu."], ["DeeCee J.", "This place will not disappoint. I got the bruscetta (you choose four) and all of them were delicious. Do yourself a favor and throw in the tomato jam option. It's actually sweet and provides a nice contrast to many of the other savory options. My husband got the B.E.L.T. panini and we both agreed it it needed a bit crustier bread and some melty, stringy cheese. The service is super friendly and non-pretentious, which is a pleasant surprise considering the hipster vibe... I usually expect a too-cool-for-school feeling from establishments with lots of beards and flannel. Overall, it was delicious and fun! Give her a go!!"], ["Mark R.", "Came here for my birthday with my wife and some friends. All the photos of the food made me crazy hungry so we could not resist.Place looks like it could have been an old post office in another lifetime. Inside has been redecorated and there is a really nice patio for you outdoors folks. No need to check your mail here. Just order what looks good and they deliver it right to your table.Started with the Butcher's Block Starter plate and an ice cold Italian Beer. It was beautiful and tasty at the same time. Decided to go with the famous Bruschetta next. What did we not try is the question. There are so many choices.Brie & Apple with Fig Spread, Prosciutto with Figs & Mascarpone, Warm Artichoke Spread, the yummy Ricotta with Dates & Pistachios and a few others that were not so great.We all enjoyed anything with Figs on it. The plates were very colorful and the quality of the food was very high and fresh. Sounds like a good portion of their products come from right here in the valley. Nice!Recommend coming here during the day and not at night. The lighting is very dim and we had to use a flashlight app on my phone to see the food and menu. Maybe I'm justing getting too old for the late night thing.Seen other reviews saying that the best areas to sit are on the patio or right between the inside and outdoor seating area. Not sure how that works when it is a crisp 118 degrees outside. I bet the cheese starts melting rather fast.Definitely a fun and enjoyable time. The Bruschetta is out of this world and a new favorite of mine. Looking forward to trying out some of the other locations. SALUTE!4.25 STARS"], ["Dinah R.", "Cute little spot. Great wine! Amazing happy hour! Attentive servers. Very quick valet. I'll be back!"], ["Morgan T.", "LOVE this place. Fantastic wine selection and a few beers for the bros. I've had their bruschetta (10/10) and grilled cheese bites (8/10) and never been disappointed. The fig + goat cheese + pistachio bruschetta is the way to go. It was the first one I ever tried and will forever be my favorite. They have a fantastic deal on Monday nights after 8 I believe for $20 you get a bottle of wine and a bruschetta board. My only complaint would be that it gets so loud at night because it is a compact space that you can barely hear the person across from you, but I can't bring myself to take off a star for that."], ["Perry M.", "Bruschetta and a bottle of wine on Tuesday for $20. For Realz!!!!This deal can't be beat. This place is cool. It's in a trendy part of Acadia. Your always in for some juicy upper middle class gossip here, the crowd is 80% yuppie hipster. It is hard to differentiate between the staff and the customers, but that is kind of Postino's thing.I haven't had the best service here always, I don't fit in. I'm one of those old school hip hop guys so when I come in here, I feel I kind of stick out but it seriously is a good wine bar, and good wine bars are hard to come by. I do enjoy people watching thou, and this place is definitely good for that, it's good for dates, you are sure to see allot of first daters and couples without kids here that have been together for ever just staring at their food not talking...awkward!!!!The ambiance is always good the lighting is just right. You can smell the love in the air... then again maybe that is the bruschetta...I love the Bruschetta...only place with better Bruschetta might be North...also in Arcadia...BRUSCHETTA WARS!!!Sometimes they have live music here. Always a plus...love live music, I wished more places did this. Anyhow besides the snooty staff, this place is pretty cool. I'd give it five stars if I looked like I walked out of a JCrew catalog or if  had the latest thrift store Macklemore look going on, maybe I could relate better to the staff...but I grew out of that trendy shit in like 2004. I look like I came from the gym when I come here...and I just assume the staff assumes I have no money and give me attitude. I just don't care. But still a good time."], ["Samantha S.", "I cannot say enough good things about Postino's !  I love the atmosphere, the wine selections, the servers... Postino's is my Spirit Animal.  Bruschetta boards are ahhhmazing!Please visit and experience for yourself...you'll understand my happy speechlessness"], ["Prachie J.", "Great lunch place with good food and good service, but not so sure about five stars... I dont give those out that easily.I ordered the bruschetta plate:- Prosciutto with Figs & Mascarpone - delicious!- Brie & Apples with Fig Spread - delicious though a little sweet- Burrata, Bacon, Arugula & Tomato - delicious but gets a little soggy- Fresh Mozzarella with Tomato & Basil - good but the tomato was not very ripeMy sister had the chicken salad, with pecans, apples, gorgonzola and raspberry vinaigrette - she said it was alright. I tried some of her Prosciutto with Brie panini, that comes with fig jam and arugula - that was really really good. Heavy on the prosciutto, light on the fig jam - an excellent balance :)They also have happy hour drinks 7 days a week -- all wines $5/glass, draft beers $5/pitcher -- worth noting!Overall I liked the place and the prices were great, but I think my expectations of a soulful renovated historic post office were maybe too high."], ["Kristy B.", "My heart aches when I have to miss a Tuesday...I love every single staff member here as if they were my family. Tyler at the bar ...man you hook it up with hands down the best service in the industry!  Can't thank you enough for the friendly service, the amazing bruchetta..and even better wine! Again,  I love you postino! Thank you for making my date night surreal every Tuesday."], ["Brandy S.", "Postino never lets me down! Proscuitto & Fig Bruschetta is my fave. On Mondays and Tuesdays they have a deal for $20 you get a block of bruschetta (includes 4) and a bottle of wine. Can't beat it!"]], "T Cook's Restaurant": [["Hugh C.", "The food is a little above average, but the price is way way above average, it is not with the high prices. Had desert and a cup of coffee...$18!!!!  The service is awesome, but I can't give it 3 or 4 stars because the prices are so high. I had the strawberry rhubarb torte."], ["Casie R.", "What a wonderful way to spend Mother's Day! It was a delicious brunch with a wonderful spread. It was nice that we could immediately enjoy the top notch buffet and also enjoy a made to order entree. Our waiter Paul was absolutely amazing. He paid extra attention to make sure my mimosas were replaced as needed  we had our newborn, toddler and 9 year old with us so he had his hands full and he was just amazing throughout out service. Hoping  this is our new Mother's Day tradition."], ["Jaycee V.", "I am a  first timer at T-Cooks and WOW! the food was great! We started off with the tar tar..then had a vegetable  salad that was tossed in lemon juice and olive oil. All of the veggies where left in big pieces that were perfectly placed on the plate! Had the  steak for the main entree and was very pleased! Only complaint is that the table we were at was right under a forceful air vent. I even noticed other people moving seats because of the vents.."], ["Tina M.", "I have to say that all of the food was perfectly prepared and delicious. My complaint is the time it took to get our food. 7:30 reservation and we didn't get our main course until 9:15, 1hr 45 minutes shows that they were over booked for what they can handle. For the price they get for dinner it seems they could manage their/my time better. The fish special was trout with mashed potatoes, asparagus & hollandaise sauce. It was very tasty and perfectly prepared.The seating outdoors is fabulous, comfortable w/ heaters when needed and very chic with great patio landscaping."], ["Mike D.", "Hard to say exactly what you should order, but i've eaten here 5+ times, all three meals.  the service has always been superb.  We typically eat here when we stay at Royal Palms, so having a $50 meal credit softens the blow.  Dinner IS pricey...Presentation is obviously big here.  Portion sizes are just right.  you won't be stuffed...you will have room for 3 courses.  I generally order something unique here.  not your typical \"filet\"...go to Donovan's or Dominick's for that.  I think entree's are best.  Apps/soups are #2.  Dessert usually isn't the best part of the meal here.  they almost try too hard with the desserts.  they need to find a couple staples for dessert and make them home runs...i just haven't found that (yet).Beet salad.  butternut squash soup.  antelope.  lamb.  scallops.  all winners.  enjoy"], ["Lali j.", "There were some hits & misses, but I will definitely be back.The remodel/update was needed, and looks beautiful. I feel that the rich fabrics, large upholstered seating, warm lighting & tile work are all in line with the classic, old-timey mediterranean / Spanish vibe.Starters:The sweet corn bisque with huitlacoche is off the charts delicious.  It is a must-have. I can't wait to go back, and have it again. I found the lobster angliotti to be a bit underwhelming. I thought the the combination of a very soft stuffing to the soft and slippery pasta wonton to be unpleasant, while the lobster was chewy. Still, the flavors were interesting. Sides:Risotto with brocolli rabe was nothing to write home about. The presentation was poor, and the texture & flavors unenjoyable. Main Course:My husband had the antelope cooked medium rare. It was a first for both of us. We absolutely loved it! The flavor & texture were so fantastic! They did a beautiful job with the sides, and cooking the meat to the perfect temperature. My dish on the other hand, the black grouper was a huge disappointment. I don't see how this ever made it's way to the menu. It was over cooked & tough on the outside, but the inside was raw. It was sitting in a fishy bean soup. The beans were undercooked, and the flavor was not the good flavor of the ocean, but simply terribly fishy.Dessert:Chocolate Pate and Peanut Butter Chocolate Bar. I'm just going to say, WOWZERS!"], ["Bee S.", "The food was absolutely amazing and the live band was the cherry on top!! What a great date place. This restaurant has such a nice ambience and we could not have asked for any more. And a special thank you to  Bridget L. for making our experience that much better!!"], ["kara y.", "Beau and I Indulged a Friday evening here with a nicely paced meal of cod and duck/ pork belly. The latter was the chef's special and the tasty dish had nice presentation and a generous serving of duck. My order of the cod was ok; the white asparagus was too a la dente for my liking but the fish was cooked perfectly. We enjoyed a moderately priced bottle of red.  Service was excellent. THEN we went to the lounge and swung to 3 sets of sassy jazz with Renee Patrick. Lounge is always great people watching and folks may have mused as we slowly, totally unwound to the music and jive. Thank you T Cooks for a musical evening, that is a routine offering with their weekend dining. Thank you Ms Patrick for the enormous set of lungs."], ["Terry E.", "It was my father-in-law's birthday, one of those big milestone birthdays, and he chose to have the family take him to dinner at T Cook's.T Cook's is recommended a lot in the foodie blogs, often along with Kai and Binkley's.   I haven't had dinner there in probably 10 years or more so was looking forward to trying their current menu.The wine list is awfully good and as you would expect, the prices reflect it, though I was able to get a very good reasonably priced bottle of Cab which would go well with the lamb I and a few others planned to order...which turned into 2 bottles.Here's where the experience started going off the rails.  T Cook's has a pretty short entree menu.  They ran out of the lamb, leaving only 8 other entrees to choose from.  There were no specials.  I asked the waitress for a recommendation and she suggested the pappardelle.  What arrived looked nothing like the menu's description.  Where were the morels?  What are these peas doing in here?  And I'm just an ignorant Phoenician, but this thick doughy slab bears no resemblance to any pappardelle I've ever had...or even pasta.  The person sitting to my left, a cultured gentleman with impeccable manners, ordered it too saying it looked to be a dish that would say a lot about the chef.  He politely dubbed it \"interesting\".The Birthday Boy deemed the cod watery.  Being a fish, watery could be a virtue, but I don't think he meant it that way.  The other meals were deemed good, but at these prices I would have expected at least one person at the table to be rolling their eyes in their head and moaning.Dessert was the point where I figured I may as well take out every dollar in my wallet and set them afire.  At least I get some entertainment and warmth from the fire; not disappointment then embarrassment.  The waitress eavesdropped on us to find out just how old our guest of honor was turning that day, a number I deliberately had not shared with the restaurant out of respect for the Birthday Boy who really didn't want to hear it.  When it came time to sing Happy Birthday, there was a complimentary dessert placed in front of him with his age piped in large chocolate numbers on the plate for all to see.  Ugh.  Cringe.  What other words can I insert here to convey the utter embarrassment?I am a dessert eater. Scratch that - I will eat my dessert and most of everyone else's at the table.  No kidding.  Not tonight.  These desserts were the kind that are little bits of something I can't recognize all over the plate, but none of them satisfy my sweet tooth.  Can't remember the last time I didn't like my dessert.  Kind of made me want to cry.We and the Birthday Boy forced ourselves to have a good time in spite of everything.  Then we forced ourselves to pay the $700 bill, along with the tip they forced onto it."], ["Garrett H.", "The white corn bisque was one of the best bisque I've ever had. Their staff is very friendly and are very nice and make sure everything is ok. All in all a excellent restaurant  that I would go to again."], ["Susanne B.", "First they tried to sit us right in front of the kitchen door- I'm not one to sit in the muddle of traffic, then they suggested to sit us next to the patio door so every time someone came in from the patio, the door would hit the back of the chair. We finally sat outside under the heater in the beautiful patio garden. We ordered the charcuterie - wonderful, great selections of meats & cheeses!  They have a new chef, so the menu has changed. I had the salmon, it was ok, my husband had the sea scallops, very good and our friend ordered the antelope, ( not what I would have picked), he said it was  average .Our server was Daniel , who I thought did a fine job!  Overall it wasn't quite fine dinning, but working its way back up there. Beautiful patio!"], ["Melissa H.", "Have been here both for dinner and lunch.  Spendy, but worth it for dinner.  The lunch crowd is very much the \"ladies who lunch\" set.  You'll be hard pressed to find a guy in the place, but for dinner you will find larger corporate groups as well as couples wanting some romance in Scottsdale.  Go while the weather holds and you can sit on the patio.  They have some of the best fois gras around.  (Possibly even better than Lon's if you happen to like fois that is).  You'll also see some intimate wedding parties, baby and bridal showers etc in the back rooms.  My favorite is the \"library\" room.Their desserts are wonderful and I should note that they will also customize cakes for special occasions, and the cakes will rival any bakeries in town.Try not to fill up on the bread, although I always do due to the pesto that is served with it."], ["Angela C.", "We took my mother-in-law and father-in-law here to celebrate Mother's Day.  We had a lovely dinner.  I had the mussels as an appetizer and they were just as good as the first time I had them.  The rest of the party had the heirloom tomato salad with fennel which was yummy.  I ordered the halibut for my entree and it was awesome.  My mother-in-law got the scallops and enjoyed them.  My husband and father-in-law both had the lamb and said it was delicious.  For dessert we had the Royal Bar, Banana's Foster Upsidedown Cake, Creme Brulee and gelato.  They were delicious.  My only complaint is that they keep sitting us by the door to the patio - next time I will request a different table.  The hostess was very pleasant this time though."], ["Kent D.", "Mother's Day brunch. Short rib and Salmon both expertly prepared and fabulous. Large chilled shrimp and crab claws fantastic. All good but way overpriced. Will look elsewhere going forward."], ["Teresa B.", "T.Cooks is one of our favorite restaurants in Phoenix. The food is always excellent and the service is top notch. The warm and inviting atmosphere of the hotel carries through to T. Cooks and we always look forward to a night out here. There is so much character to the Royal Palms, so take time to walk the grounds before or after your dinner."], ["Danielle D.", "I have dined here multiple times since Chef Paul McCabe has been heading up the kitchen.  It is consistently fabulous and exciting cuisine. The  major complaints I have about the dining scene in Phoenix/Scottsdale is consistency and innovation.  This is NOT the case at T Cooks, it is definitely bringing exciting things to the Phoenix!  Every meal, and every aspect of the dining experience has been stellar each time I have been.  The food is exciting, inspired and executed perfectly each time.  The octopus is the best preparation I have ever had.  The venison tartare and sea bass crudo are some of my favorites as well.  I can never resist ordering the antelope either.  This menu is stacked with some winners for sure!  The Service is first class as well.  You can tell the staff is informed, and an excited part of a culinary team.  They truly are top notch, without being stuffy. This is new T Cook's is so much improved from the former version - you can't even compare the two.  Still beautiful and classy, but now with innovative 5 star cuisine as well. If you are lucky enough to be able to dine at T Cooks on Wednesday they offer a true culinary adventure called #PM31. Definitely call ahead to make reservations - there are limited seats available. We were fortunate enough to enjoy it last night.  It is a world class experience.  It is a 12 or so course tasting menu based around the chef's inspiration and passion.  It's always changing.  This was one of the most special and FABULOUS dining experiences I have ever had.  It was truly a special experience and orchestrated to perfection.  It was exciting, innovative, playful, and as I said before, inspired .  And most importantly each course delivered!!!!  This is an experience NOT to be missed.  I will attach some photos.  Whether it be just going out to dinner or another adventure from #PM31 - I can't wait to visit T cooks again and see what they have in store."], ["Dwayne O.", "truely one of the best places to eat and celebrate a special occasion"], ["Rose L.", "This is only for the bar.  I have been here twice now while visiting, and service is superb.  The bottled beer list has some unique options; if they had a couple of these on tap, I would give five stars.  In talking to Joe the bartender, we learned that the majority of their employees havebeen working at T. Cooks for years. . .like 5, 8, 13 years??!!!  This speaks really well for the place.  It is a romantic spot for a drink or a snack.  The venue is lovely.  If I lived here, I would probably try out HH and love it."], ["Jack H.", "We had lunch at T Cooks twice this weekend.  I wanted to visit the second time simply to confirm that it was as good as the first time.  Beautiful ambience, excellent food and service, this place has it all. I had the winter pear salad and the crispy salmon.  We also ordered the lobster bisque and the chicken salad sandwich.  We each ordered a flight of wines, which is a bargain at $25 and highly recommended.  We shared the dessert tasting (your choice of three small desserts for $8).  They also have a cozy little chef's table for two. T Cook's was the highlight of our weekend in Phoenix!"], ["Ken J.", "What an average dinner.T Cooks is in a beautiful hotel and has a great atmosphere. Not much else to offer. As a disclaimer, I had fairly high expectations considering the caliber of restaurant. The salads were mediocre at best. For the meal, I had the filet which had to be one of the worst filets I've ever had. My coworkers had the bison ribeye, and said it was good, probably would recommend that if you do go to the restaurant. One bright spot - the marscapone mashed potatoes, some of the best mashed potatoes I have ever had.The dessert was seriously lacking. I had a layer cake with peanut butter in it, I seriously thought that it came out of a Hostess box (no offense to Twinkies), it was the most bland and uninspiring dessert I have had in a long time. One coworker had a banana dessert that looked great, but no guarantees....Lastly, they just redid their wine list, eliminating many of the upper end wines. Not that I'm a frequenter of the Reserve List, but if you're going for a special occasion or on a business dinner, you'll be out of luck. If you are staying at the Royal Palms, it is convenient. But I wouldn't venture more than a mile to eat here."]], "De Mi Tierra": [["Eric R.", "Incredible food! This is one of the hidden places in Phoenix. Their menu changes every week and provides the customers with delicious options! A must stop"], ["Celena D.", "I love the food they make really good great service. Many different product from Latin America"]], "Tapas Papa Frita": [], "Postino Central": [], "La Flor de Calabaza": [], "Cuban Foods Bakery & Restaurant": [["Mark C.", "Like most Americans, I've never been to Cuba in my lifetime.  And until recently I never suspected I would.  But like many Americans I've always had at least a passing curiosity about our neighbors just 90 miles south of the Keys.  Cuban culture (as with many cultures) has been quietly influencing American life in subtle but noticeable ways from music, to the classic car movement, and yes even the culinary arts as well.  Admittedly living here in Arizona means we don't encounter much in the way of Cuban influence, much less Cuban cuisine.  Havana Cafe was widely regarded as the Cuban culinary staple of the valley for many years.  Sadly, Havana Cafe closed its doors earlier this year before I had a chance to take in the experience.  That leaves maybe 3 Cuban restaurants left in the valley that I'm aware of.  And the only one in the city of Phoenix is Cuban Foods Bakery.  I came here for lunch on a Thursday to try and finally get a taste of what so many chefs and food critics were raving about when it came to traditional Cuban cuisine.  In the end, I arrived a novice and left wanting to do the cha-cha.Located in a strip mall on the northeast corner of Peoria and 43rd Ave, Cuban Foods reminds me a great deal of the setup of the recently defunct Latin American haven Mi Comida.  A simple table and chairs place with a few native emblems on the wall, but little else in the way of aesthetics.  There's Cuban music playing in the background to lighten the mood and the placemats are a bounty of color for the senses.  I got here right at 11am and was their first customer of the day, but the place filled up for lunch shortly thereafter.  I counted 6 tables with 4 chairs at each so room for 24 here max.  There was just one waitress on duty and she was delightfully friendly and helpful.  I knew some of what I was getting for lunch, but she helped me with the rest.I decided to start with a menu item that enticed me right away.  The Tostones Camarones.  Four green plantains made into little bowls and fried, then stuffed with shrimp covered in garlic sauce.  Wow, wow, wow.  This is an appetizer that eats like a meal as the cups were each packed full of shrimps (at least a dozen in each cup) and the texture of the bowsl were soft on the inside with a nice crunch on the outside that absorbed the juices beautifully.  Still craving more authentic Cuban cuisine, I went with the standard Cubano sandwich (note: they discount the sandwich at lunch and include a free choice of canned soda, of which I chose an orange Fanta).  Roasted pork, ham, pickles, Swiss cheese, and mustard on Cuban bread.  If i had to describe the bread it would almost be like a kaiser roll in panini form.  Unlike most panini sandwiches, the interior of the bread maintains its chewy texture while the outside retains the crunchy notes.  I can see why the Cubano is a staple of most every Cuban establishment.  Fantastic meat flavors densely packed together with the condiments.  And surprisingly it didn't taste as heavy as I expected.  Despite already being full, this is Cuban Foods \"Bakery\" after all and the bakery display case was packed full of tasty looking desserts to try.  I asked the waitress for suggestions and after some back and forth, we settled on a dessert that almost acts as two desserts in one.  A slice of their Tocinillo del Cielo.  While this dish literally translates as \"Bacon from Heaven\", there's no actual bacon in it (though using bacon as a description is always endearing in my book).  There's two layers to this version.  The bottom layer is a moist white sponge cake while the top layer is a flan-like pudding.  A deliciously smooth, creamy and surprisingly light dessert.  Every dish I had was so phenomenal I could basically care less about how crazy full I was.Total cost for all the food, plus the soda, tax, and tip came to $23.  Great prices for the amount of food you get here.  I'll be back in the near future to dive further into more delicious Cuban cuisine.  Its a shame its so rare to find a Cuban spot here in Phoenix for a cuisine that's so widely respected.  Hopefully as relations thaw between our two countries and there's a more open sharing of cultures and traditions, we'll see an even greater influx of Cuban treasures into Arizona and beyond."], ["Manuel C.", "I'll get right to it, this place gets 5 stars for serving the best Cuban food in the valley and three stars for comfort and service.I love visiting ethnic places where the crowd is mostly natives. We came on a Sunday for lunch. Six of the six tables were occupied by Hispanics, three of which were Cuban families. As most reviewers note, the place is small, and had only one waitress/hostess/cashier/busgirl taking care of the entire place. We had to wait a bit but she was nice and attentive, but a bit overwhelmed. My three star rating is not because service was poor, they just need to hire one more person.The food is very authentic. The tostones and platanos maduros were made fresh, the fries yuca was frozen but tasted good. The croquetas were also frozen but good as well. For entrees we had the masas de puerco and the ropa vieja, both authentic and tasty! It reminded me of a corner joint in Miami (except for the frozen products).To the owners... great job! Consider expanding to achieve a 5 star review."], ["Antiquity S.", "I'm rating at 3.5 stars, but don't have that option.  I went there never having had Cuban food before.  I had the pork and black bean rice.  As far as food goes, I liked it very much.  If I were to rate just the food, it would be 5 stars.  It was that good.  The service itself was also very good, and the server took good care of us.  No complaints there.  However there were two issues.  The first was not within the restaurant's control, so it was not their fault.  There was a large, noisy family that literally took up half the restaurant, which has a small eating area.  I would say at most it can seat 40 people, if that.  While this trashy, noisy family was not the fault of the restaurant, it sort of put a damper on a first time experience at this place, as well as a first time experiencing Cuban food. The second issue was the dirty silverware.   The forks were poorly washed and had food particles on them. Since the server had their hands full with the obnoxious family, I didn't want to pile on with the silverware, and I just used a spoon instead, but I didn't like that.  My recommendation is the food is great, and the servers are nice, but just get the food to go."], ["Doris G.", "Wanted to try something different and this place hit the spot! I had the Torta Cubana while my hubby ordered the Torta Media Noche. Both where delicious! We then ordered dessert to go from their baked goods and choose 4 different items. All where amazing! Service was good the server was attentive and gave us great advice on our dessert choices. The resturant looks clean and taken care of. Only bad experience we had was their credit card machine stopped working the moment we where getting ready to leave. Had to wait like 45 minutes while they called the credit machine company. I had ordered extra tortas to go which ended up cold and our fries soggy and our desserts melted by the time I finally got to pay and leave! Even though I liked their food and feel bad they had problems with their machine, I feel they should have taken something off the bill specially after having to wait so long and getting home with cold food and melted desserts. After $50 spent!!! Okay, so I might go back but next time I'm taking cash!"], ["Vivian A.", "My son ended up here on thanksgiving and was blown away!! Incredible food and croquet's, will be visiting very soon like tomorrow for home cooked Cuban meal will keep u updated as a true Cuban native can't  wait to taste their cuisine."], ["Hugh C.", "Great place for authentic Cuban food. I've been coming here for a while and it always gets a little better than before. A good fix if your like me and miss food from home."], ["Karina R.", "If you're looking for authentic Cuban food, go here!! It's a ways away from my house, but whenever I'm in the area I make sure to always stop for a Media Noche and coffee. It really doesn't get anymore authentic than this place. Family owned. I've only tried their sandwiches. Maybe one day I'll try their other options."], ["Amanda D.", "Living in Tucson, Cuban food is nonexistent. Any time I'm traveling through Phoenix I try and make a stop at some type of Cuban restaurant. This one has become my favorite. It's located in a strip mall so don't let that discourage you, you will not be disappointed! I usually go for the beef bistec empanizado which comes with moro style black beans and rice. The portion size is huge! Definitely shareable if you're not too hungry. I've also tried the papa rellenas and croquetas de jamon which are delicious! Small little place but the food is awesome!"], ["Yei R.", "Food I will give 5 stars. Everything was delicious. We had papas rellenas and tostones which were amazing!!!! Bistec encebollado and ropa vieja were great too. To end our Cuban gastronomy experience, a delicious dessert. They were very well priced and delicious. Now, our server was attentive, but the placed seemed to be short handed so he was literally running everywhere to serve well. Advise, they need to find at least one more person!!!! In general we were pretty happy and would come back, now make sure you have enough time to eat and wait for the bill lol!!!!"], ["Rafael C.", "Lechon with onions was very good.  Platter came with black beans and rice and a salad. We ordered the beef empanadas to go with the food. We tried the flan as well and we were surprised as to how good it tasted, after all it is a bakery as well. Very friendly atmosphere."], ["Nikki H.", "We decided to try this place out based on the great reviews on Yelp. Upon entering, we were greeted immediately as we walked in and were handed menus as we sat. Despite our group of three being the only ones in the restaurant, it was about 10 minutes before the lady came back to take our order. I ordered the Sandwich Cubano, my hubby ordered the Ropa Vieja, and we also ordered the empanadas. It was about 20 minutes after ordering that our food finally came out of the kitchen. My sandwich was good. The bread was thin and crispy, and the pickles added a good bit of saltiness and crunch, but it was a little on the dry side and probably could have used a little more meat. The Ropa Vieja was very good. The meat was tender and flavorful, and the mole sauce had a nice smoky flavor. The empanadas, which were listed in the Appetizers section of the menu yet were the last plate to come out, were okay. They were a bit dry since it had a lot more breading than meat. Overall, the food was decent but the service was a bit slow. We came for lunch during work and probably won't again as it took so long. Their pastries, however, looked good in the display case, so maybe we'll come back to try those."], ["Isabel G.", "I came to the restaurant with high expectations based on the reviews given here,  but was a little disappointed. I ordered the bistec encebollado (steak and onions). The steak was too salty for my liking, the accompanying beans and rice mixture was pretty good though. I also had a bite each from my friends' cubano and ropa vieja dish they ordered, but neither of the items really stood out for me. I didn't get to order any of the baked goods, but I did over hear the lady saying they had something that contained guava in it, so perhaps I'll return and try one of those."], ["Farisa A.", "You can't get much more authentic than this place!!!! I dare you to try and find a restaurant that brings the flavors of Cuba to Glendale better than this restaurant.Primero: el cafe Cubano...*check *Segundo: la ensalada mixta...do not ask where the dressing is. It's already tossed in it and is very refreshing.Tercero: los moros y cristianos...all fully cooked but a little on the dry side for my taste but the flavor was still there.Cuarto: el pescado...on pointQuinto: los postres.....aaaaaahhhhh :) :) :)....los postres. Don't ask. Just eat whatever looks good to you and if you can't decide just buy 1 of each para llevar. They are all verrrry good and you will not be disappointed.Sexto (Yes. That's how you spell it) :p Do not be afraid to use your spanish to order your food. The nice young lady who's running around like a chicken with its head cut off will understand what you want.I WILL definitely be back. As at any small restaurant everyone is welcome, but repeat customers treated con un poco más cariño.Buen provecho!"], ["Tony R.", "Fantastic Cuban food at great prices. The exquisite sandwich I had(sandwich de bistec) had great flavor and looked awesome. Note: many of the dishes have a lot of onion so be careful if you don't like onion just like my wife.  My beautiful wife had the classic Cuban sandwich which was really good, however it was huge.  See picture compared to my wife's head.  Got to try this place.  I'm given it 4 stars because my wife said the pastries she tasted had too much egg taste. I thought it was great. Overall and definitely recommend it.   Service was great too and loved the authenticity of the people that work there"], ["Vickey S.", "I was greeted with a friendly smile and surprised at the amount of traffic this place got. I got a Cubano for me and Steak for my wife and a I was quite pleased with the quality of the food and the service I received. I will be back!"], ["Mike S.", "I'm  always  in search of good Cuban  restaurants., found this one on yelp.  We came in for lunch,  the place is small inside but luckily  we found a table. I ordered  the Cuban sandwich with a side of black beans cooked with the rice.  The first thing I noticed was the bread was the right bread for the sandwich. Not just a friendly roll.  I asked and they bake their own bread.  The sandwich  was excellent  and rivaled any you would buy in Miami.  I also ordered  papas  rellena  which is a ball of mashed potatoes stuffed with ground beef then lights breaded and deep fried.  Great flavor. I ordered a guava  pastry to see how they did.  Also excellent.  I was not disappointed.  Looking through  the menu they had all the typical Cuban dishes and the prices were fair.  Average  dinner plate was $9-$10.Just a note- my buddy ordered the Mexican style Cuban  torta (can't remember  the name of the sandwich) .  I tasted it and it was epic.  Such great  flavor.  It had pork,  onions,  cheese and other things that gave it a little kick but not too spicey. Look for it on the menu,  you will love it. Hot tip- seating is minimal,  get there before lunch or dinner rush.  I got there about  11:30 and it wasn't  busy.  By 12:30 people  were waiting for tables. All in all great food,  the owners were Cuban  and know their stuff!"], ["Deb L.", "Muy Rica! The food brings back memories of Little Havana from our trip in 2013.The HUGE Cubano is easily enough for 2 people. Syaked on crust bread with of course traditional pork , cheese and taa daw pickle this sandwich is the  real deal.  We were more than please with our food. Extra bonus is the generous pieces of postres , desserts such as flan , tres gracias cake, eclairs and more. We shared and were satisfied with the rich but not fake tasting flan and tres gracias cake. I look forward to going back. My one wish is  that they would put in a soda fountain instead of cans but I can deal,  no problema."], ["Master M.", "Loved the food! Took our kids in and we feasted on some sandwiches, fried mashed potatoes (with meat filling) and took home some amazing desert. The decor is nothing special but the food makes up for it.  We will be back!"], ["Johanna D.", "Great food, fast service! Love this place. We originally came here for ropa vieja and ended up ordering a few things of of their menu--- all of which were delicious! FIVE STARS."], ["Maggy B.", "Super yummy, authentic Cuban food. I got the yucca con mojo and the ropa vieja -- neither disappointed. Also tried a few desserts and those were pretty amazing as well!! In a town where Mexican food reigns king, this place is nice, family-run, and authentic Cuban food! Eat here!"]], "Guanaquito Restaurant": [], "El Chullo Peruvian Restaurant & Bar": [["Jennifer S.", "This place is ridiculously good...so good I can't wait to go back there again.  The parking is very limited, so be prepared to park in the neighborhood and walk.  Trust me, you'll forget all about the parking situation once you try their food.  We shared a causa rellena to start and it was surprisingly fresh and flavorful.  For my entree, I selected the lomo saltado based on our server's recommendation and man, was he right - this dish is over the top good!If you have not yet tried El Chullo, get in there and give it a try...don't let the exterior of the restaurant discourage you from trying this gem of a restaurant!"], ["John G.", "First of all - very cool 'hole in the wall' kind of vibe. We walked in and were seated at one of the two remaining tables...good signWe started by splitting a 'choose three' appetizer platter.We got the Papa Rellena, Yuca Frita, and I don't remember the name of the third.The Papa Rellena was really good - tasted kind of like a tamale, but better - and served with some pickled onions, I think?  Really tasty - this was the best.  The Yuca Frita was good.  The  other one was about a 4\" diameter cylindrical shaped item about 1 1/2\" tall.  It had chicken in it - I thought it tasted like deviled eggs - it was also very good, but we had to save room for the main course.  My wife ordered the Ceviche - it was very good - had a lot of zing to it.  Everybody else ordered the Lomo Saltado.  It was also really good.Our server was friendly and attentive as well.Very nice place to go and get your Peruvian gnosh on."], ["A B.", "Peruvian cuisine is Interesting,  flavorful and varied. El Chullo is a very small restaurant so recommend making reservations. Thee stars only as I thought the staff was not the friendliest and the Sangria was mostly fruit juice and very little wine. The parking lot in front of restaurant is very small with very few spots so be ready to park in the neighborhood. Ordered the Lomo Saltado, which essentially is slivers of beef with French fries. and while I thought was good, could have had more meat considering the price of $ 14.95 . El Chullo is not an inexpensive restaurant. A word of caution, the restaurant closes early on Sundays at 7 P.M so get there early."], ["Cyn V.", "I'm a Peruvian girl and I always think my mom's Peruvian home cooked meals are actually the best. I came to El Chullo on Peruvian Independence Day (July 28th) with my dad in order to celebrate.I ordered the lomo saltado and he ordered the cau cau. As much as I love my mom, I hate to say that this lomo saltado is just as good (maybe even a bit better - please don't tell her). I told my hubby that I have to take him here so that he can try it out for himself. I even loved their rocoto (hot peppered sauce) and I dipped my french fries in them. It was spicy...but a good spice. I highly recommend this place if you want to try good Peruvian food!"], ["Lisa D.", "In AZ and not sure what to eat? want something flavorful and definitely worth every penny? El Chullo is your spot! go here and you totally won't regret it one bit!!!! ordered:*Lomo Saltado-YUM! flavorful. one of their most popular items at el chullo. i definitely didn't want to stop eating this! everything was very well seasoned and the beef strips were cooked perfectly. the tomatoes were very flavorful as well! *arroz con pollo- this was recommended to me by the staff. which i thought was pretty good. the rice was flavorful and the sauce that came with it was very unique. for my first time having arroz con pollo i was definitely left with a good impression and would definitely try to order this at other peruvian places. overall, staff is really nice. the bittersweet part about coming here is you're hungry you gotta wait quite awhile for your food because they make it fresh. it's like i like the idea of it being made fresh but the wait is long for the food. also they don't have the spicy dipping sauce i've had at other Peruvian food places that you eat with bread. they however give you these unpopped popcorn kernel thing that is lightly salted. personally i didn't care for it.  tips:*small front of store parking lot.*cash and credit cards accepted*they post a lot of their food on instagram*serves alcohol.*they have a few TVs.*indoor seating only. *not super ideal for large parties since it's a small little mom and pops place."], ["Alejandro A.", "Delicious one of a kind dishes here!! I had the ceviche and I ordered it medium on the spicyness....OMG taste buds went crazy!! I would definitely recommend this place to everyone!! The traditional Peruvian drinks are refreshing and tasty!!"], ["Deb S.", "I'm pretty sure I won't be able to say enough good things about this restaurant. Jeez - everything from the delectable adult beverages, through the amazing appetizers, to the main courses - wow!!! Over the top delicious. It's another one of those places I don't want to get too crowded, but I don't want it to go away. Stay busy, but not too busy, you know? Head over there - you won't regret the Papa Rellena for starters, the Arroz con Pollo with its perfectly seasoned chicken and yellow rice (enough for 2, btw), or the Carapulcra - a heavenly potato stew with yucca that I still can't get out of my mind. Enjoy. I know you will."], ["Pepper T.", "This is a very small Peruvian Restaurant with a bar. They serve mostly Peruvian Food thats heavy with rice and lots of potatoes. They start everyone of with tasty complimentary corn nuts. We started with the Peruvian Specialty Appetizer called papas a la huancaina that means basically a boiled potato topped with a creamy chile cheese sauce. I thought it tasted good but for me this dish is an acquired taste kind of dish because of the texture. I ordered the Arroz Chaufa (a chicken fried rice) because it sounded like the lightest dish on the menu. The chicken in my dish was developed with flavor and was very moist. I thought this dish was tasty but it was an extremely large portion so I took half home.My husband had the Frijol con Seco a la Nortena (basically a beef stew with rice and beans). I tried a little piece of beef that also was prepared well and was flavorful and moist. The pickled onions were bright and bursting with lime flavor. This was also a large portion.The pictures of the desserts looked interesting and mostly different from other desserts I've seen and our server talked me into getting his favorite dessert the crema volteada. It was like a very dense flan with a dark sugar coating. It seemed rich and wasn't too sweet.Service was very friendly and welcoming."], ["Betsa R.", "The food was just ok. I have NOTHING to rave about at all. :( I'm a big fan of Peruvian food and this place just didn't do it for me. I had the Jalea,Cebiche, arroz chaufa, and lomo saltado."], ["Erik H.", "My trip to AZ isn't complete until I come here.  I HAVE to go every time I visit.  This is the best Peruvian food I have ever had.  Whatever you order will be amazing, I have had damn near everything on the menu."], ["Michael A.", "I've driven by this hidden Peruvian Cafe many times and never noticed it until tonight. Truly a hole-in-the-wall from the outside but a nice cozy restaurant in the inside. The wait staff were friendly and efficient. I had the Yuca Fritas appetizer and Mariscos con Arroz entreé. I enjoy the Yuca and the two sauces. Some of the Yuca pieces were hard and stringy, but the rest was quite nice. The Mariscos were a disappointment. A few pieces of the seafood were very hard and chewy like they were seriously overlooked. These pieces were inedible. Most of the rest of the dish was good, but not great. I was expecting more flavor that would make this uniquely Peruvian. I will come back again and order a completely different entreé. I want to like this place and I think it's definitely worth another shot."], ["Mark C.", "Its a good sign when you feel explosively full after a meal and yet still wear a silly grin on your face.  Such was the case during my first visit to El Chullo. Admittedly I'm a novice when it comes to Peruvian cuisine so it was with some apprehension that I ventured here on a Saturday around Noon.  I had seen the great reviews this place was getting, but honestly had no idea what to order when I got there.  Fortunately my waitress helped guide me through it, and helped me make some delicious choices indeed.As with so many Mom & Pop ethnic establishments in the Downtown Phoenix vicinity, the restaurant is a small space in an old building.  This space is on the northeast corner of 7th Street & Virginia, in between a barber shop and a convenience store.  There's barely any parking up front (though there were available spots when I arrived).  There is, fortunately, extra parking available in back (take the alleyway east of the convenience store and you'll run into a parking lot leading into El Chullo's back entrance).  The restaurant itself seats about 20-25 including the bar area.  When you walk in you immediately hear the Peruvian dance music in the background.  When I arrived just before Noon I was actually the only customer there, though the lunch crowd started streaming in shortly thereafter.  A quick FYI that from 10am-Noon on the weekends, they serve breakfast only.  It was close enough to Noon that they allowed me to go with the lunch menu instead, but just be aware of this if you're coming here on the weekend.  I started things off by ordering a traditional Pisco Sour.  Pisco is basically a type of Peruvian Brandy and a Sour is traditionally mixed with lime, syrup, bitters, and egg whites.  Wow, talk about refreshing.  There's enough alcohol to remind you its a cocktail, but truly a smooth, delicious, easy drinking cocktail perfect for any occasion.  For an appetizer I went with the Causa Rellena with crab filling (you can also choose a chicken filling).  Two potato cakes with crab filling and avocado in the middle, topped with a dusting of cilantro, half a hard boiled egg, and what I believe was a liquified sweet potato sauce.  Holy moly was this awesome.  It wasn't huge (maybe 3 inches in diameter & 3 inches tall), but remarkably rich and filling.  I'm not sure what type of potato they used for the potato cakes, but the texture was smoother than any potato I've had (maybe they used extra butter?).  And there was plenty of crab meat in there to be sure.  If you're coming here for the first time, get this.  I'm making it mandatory.After the appetizer, I had no idea what I was doing, so I let the waitress pick the next two items for me.  For the main entree, she recommended trying one of the ceviches since this was my first time here.  I went with the Ceviche Mixto since that had a variety of seafood (though admittedly I didn't ask which kinds).  The seafood is garnished with onions and a spicy lime juice blend (you can get it super spicy, or go with a mild spice level as I did) and comes with sides of sweet potatoes, sweet corn, and cancha (basically dried corn).  Again, didn't look like a huge portion but they packed in a ton of seafood into this dish. In addition to the fish (which I believe was sea bass) there was lots of shrimp, clams, mussels, calamari, and octopus.  I'm not a huge fan of squid or octopus so I was a little apprehensive when I saw it, but actually this style tasted quite delicious.  All of the seafood tasted fresh and the lime sauce had the perfect amount of seasoning.  There's actually enough food in this dish to be split by two people, which probably explains why I felt pretty full after I finished.  Nevertheless, the waitress prodded me to try one of their desserts, so she had me try the Alfajor.  Two round flaky sugar cookies covered in powdered sugar with dulce de leche filling in the middle and chocolate sauce on the side.  I don't how in the world I had room for this, but I made it happen.  The dulce de leche was buttery smooth and the cookie cut with a fork.  An awesome, decadent conclusion. Absolutely incredible meal.  The presentation, the flavors, and the variety was amazing.  They actually have a number of chicken and beef dishes to choose from as well, and I'll be sure to try those upon my next visit.  Total cost for this go around including the drink, appetizer, entree, dessert, tax and tip came to $50.  Worth every penny as El Chullo's cuisine could easily work as a fine dining experience (though I'm thrilled its just a neighborhood joint that I can wear my flip flops to).  I now see why Peruvian cuisine is quickly conquering American pallets, and El Chullo is Phoenix's ground zero."], ["Thomas P.", "We got hungry at the perfect time. Driving around and saw this place. It's absolutely amazing. Had the pork tamal peruano, ceviche mixto, and tacu tacu lomo al jugo.  Everything was so delicious. Best ceviche we've ever had!! You gotta come in."], ["Rob C.", "Location is cute although the Parking situation isn't the best. Service was exceptional by a young girl. Our first time trying Peruvian  food and or server explained some items which we ordered. They also offer great Peruvian beverages like the inca soda. The food was simply delicious in every bite. I seriously can't describe it any further at the moment since I am so stuffed by the food! Certainly worth a try."], ["Bao H.", "(Lyrics - Restless Heart - When She Cries)The place I have traveled inIs Yelped with good reviewsIt's littered with several starsThat only quite came trueWhen all of my peers were drinkingHer food kept me tryingShe does her best to cookThe meal that Bo Bites been throughEl Chullo's tonightAnd I really think that I should taste itIt can't hideAll the meals they make insideEl Chullo serves up some authentic Peruvian style food!I just got back from Peru and unfortunately they don't serve Cuy! Now that would be authentic! In any case, my foodie friends and I ordered individually but different dishes. I went with the Tallarin Saltado, a spaghetti like dish with beef. Overall, it was pretty solid. Salty and just a tad bit of spice, with the crunch of the raw onions giving this dish a savory bite!However, my 2 favorites of the night were the beef heart and the fried rice! Beef heart anyone!? Yeah, it came a super spicy sauce you can add and when I say be careful.....BE CAREFUL! Youch! Spicy indeed, but the heart was so tender....uh yummy! The fried rice...I thought my mama made good fried rice; sorry mom! Overall, one of the best bite of fried rice I had in a while. It was a blend of Peruvian and Chinese style so I totally appreciate the fusion and so will you!The service was spot on with our large group plus no mix up with our checks, which is totally awesome. The place is very tiny so be sure to make your reservations! - Enjoy!"], ["Jeff S.", "We went during their breakfast menu hours (10-12). Their menu consisted of sharable dishes for 2. They were able to flex and cater to my girlfriend's dietary restrictions, and the food still came out very delicious and perfectly seasoned. Would definitely recommend for a breakfast date."], ["Yvette N.", "We went to this joint and ordered Lomo Saltado or Beef with potatoes and white rice.When we got our plates we were very dissapointed with the tiny portion of beef we got.We complaint to the mananger about the beef  portion  and he told us that they only use aprox. 2.8 oz. of beef per plate, so after is cooked you probably get 1.4 oz. of beef in your plate and  lots n lots of potatoes n rice. I don't think we are going back.We don't want to be ripped off again."], ["Jared S.", "I will start by saying my wife is from Lima, Peru.  We have been all over the world finding local peruvian places to eat (military family). This place is amazing!  Small place but gives a family feel to it. U can smell the spices while the food is cooking. Amazing rocoto sauce and cebeche was awesome as well. Everything tasted like it was from Peru. Will go back again."], ["Claudia G.", "Divine Peruvian food. I had the PAPA RELLENA & the chicken escabeche which both were amazing. I also drank the pisco drink w ginger ale which I like better than pisco sours. I'm going back here ALOT, I'm Peruvian and this is authentic food w fantastic flavor. Can't wait to try their ceviche and seco next time I go....."], ["Michael M.", "I'm very glad my wife and I finally got around to trying El Chullo, a little hole in the wall off 7th street.  I got the escabeche de pollo.  The chicken is described as pan fried but it didn't taste fried, and I mean that in a good way, and the sauce was very tasty.  My wife loved the tallarines verdes-- pesto spaghettis (yes, spaghetti with an s) and steak.  And for dessert: a giant alfajor, cookies with dulce de leche filling. Overall, a great first Peruvian food experience"], ["Alex H.", "I've had my fair share of Peruvian food here in the valley. I'm surprised that there actually are so many to choose from. Out of all of them, I believe that El Chullo has the best food of them all. I've had their ceviche, lomo saltado, and jalea. All of which were excellent. I would give it 5 stars if ratings were based only on the food! Not only does it taste great, it even is presented beautifully.Now, what brings this place down is the location. My biggest gripe is the A/C seems to not always be running cool. Not to mention it isn't the nicest looking of restaurants. For the price I expect a bit more class. Not super fancy, just a touch more.And yes, it's central Phoenix. So parking is tight."], ["Josh G.", "Pros:  Food, service, price.Cons: Smaller sized restaurant (may be occasional waits), parking (park across the street - see parking section below).The food here is amazing.  I had the Tacu Tacu Con Lomo Saltado, which is rice and beans topped with strips of marinated sirloin steak.  The rice must be cooked in a small cast iron skillet and flipped over, because it has a seriously delicious exterior with a slight crunch.  The beans and lomo saltado are equally excellent.  Portion sizes are large, and they have a small selection of wine.  Really delicious and highly recommend.  Parking: After business hours (ie: 6:00pm) you can park either across 7th street at the auto shop, or across Virginia street, just south of El Chullo, in the parking lot behind the 3 story building (Techniprint)."], ["Sana H.", "Excellent food. We got the cause rellena with chicken, ceviche and Lomo Saltado. The cause rellena was creamy and delicious. The Lomo Saltado was the best one I've ever had, the sauce is so goooood and the meat very tender. This was my first time here but I'll definitely be back for more!"], ["Boom Y.", "Hidden gem. It has some minor work to do but it earned the five starts. Service was excellent, half the food from our big group came out fast, the other half not so fast, but it was still worth the wait. Appetizers were fast and held us through. Very authentic Peruvian food. I had the Chaufa, its Chinese/Peruvian food and excellent!I can't say enough about the Pisco Sour. The best I've ever had including in Peru!!! Well return for more. Cheat day restaurant for my family."], ["Leslie M.", "I am a big supporter of family owned business so I decided to stop by and see what all the fuss is about. I have never had peruvian food before so I can't really compare my experience to another peruvian restaurant. The lot is small and it's kind of hard to park.  The service is good.  The server was really friendly and he tried to give us recommendations.  I ordered the Lomo Saltado and it was flavorful, but I didn't see the difference between that and the nacho fries that you get at Filibertos for half the price. Now, don't get me wrong.  It was a cool experience, but when we got the bill, it was a little much for an appetizer sampler, a drink, one entree, and dessert. I didn't even end up with a doggie bag for the price we paid. I didn't expect to pay as much as what we had paid, but I know they have to pay their bills.  It's a  business.  I get it. I just don't know if I would justify the price and value of the food to come back.  If you have never had peruvian food, come on over though and try it. At least once."], ["Matt D.", "Excellent food!!!  I had the amazing opportunity to eat at this family owned and ran business. The food was outstanding and so was the service. I will definitely recommend  this to friends and family."], ["Alexandria K.", "I have eaten here twice now. I get cravings for their delicious cause rellena, which is a stack of creamy potato purée, chicken salad, avocado, and egg with creamy mustardy sauce. Their lomo Saltado is sure to please with perfect strips of beef in a delicious mildly spicy sauce, with a triangle mound of white rice and French fried potatoes. I highly recommend this locally owned restaurant!"], ["Ric B.", "Peruvian cuisine seems to be based on chicken and potatoes- fine with me. El Chullo is a New Times Award winning place on 7th Street north of Virginia. Can't remember the names of what I ordered but the appetizer was a thin sliced marinated fried potato. You eat them like potato chips but they are not dry and slightly crispy. The entrée was a chicken breast, pan fried in a red pepper vinegar sauce with red onion slices. Very good! There was a small side of potatoes and a rather large pyramid of white rice. I love rice but I prefer it flavored. I almost asked for more red pepper vinegar sauce for the rice. It was similar to Japanese sticky rice. The place was small, clean, nice artwork on the walls, flat screen tv with Fox Spanish channel showing a soccer game. They have a full bar so we ordered a carafe of Sangria- iced, filled with what appeared to be fruit cocktail- very good and pared well with the meal. We ate the wine soaked fruit like a dessert. El Chullo has an air of authenticity about it and I most likely will go back in the future."], ["Ashley C.", "AMAZIING Peruvian food!! They make an awesome pisco sour and the ceviche was incredible! You have to get the lomo saltado!"], ["Dennis H.", "Food was okay...little too salty and it takes a long time to get order. For the cost I was expecting more."], ["Alaina S.", "Yum!  The food is authentic and one of the best Peruvian restaurants that I've eaten in.The service was great. I was the only one in my party that had eaten Peruvian food before and everyone else had a lot of questions. The waitress was so nice and patient. She obviously took a lot of pride in the food they serve, particularly their more traditional food and drinks.This place is a must try."], ["Alex G.", "All I can say is \"WOW\" the ceviche was super delish. I've tried a few peruvian places in the past and El Chullo wins in my book. I tried both the ceviche mixto & the ceviche with fish and they are both amazing dishes. I really liked the flavors. I also had lomo saltado and same thing the flavors were soooo good. This is my new favorite restaurant. Enjoy!"], ["Joe N.", "Absolutely the best Peruvian food in town!! I have been hesitant to write this review because I wanted to be selfish and enjoy this spot without the huge crowds it can easily draw!!  Not a place to rush in and out, it's place to be enjoyed with good company and great Pisco. Enjoy"], ["Sarah D.", "Great service, great apps, great entree, great fruit juice, great dessert. It's so small that is you drive too quickly, you'll miss it. Don't be fooled by the look or location - this place is stellar."], ["Andrea Z.", "What a great change of scenery (diamond in the rough) El Chullo restaurant. Visited today for the first time and experienced great service, great food and overall value for my price. Will most definitely be back. A must try in the Phoenix area for any locals or visitors.  Muchas gracias to my new favorite restaurant."], ["Chelsea C.", "El Chullo is one of the few authentic Peruvian food locales in Phoenix and luckily for us, is absolutely delicious!  The lomo saltado is a must, especially if this is your first experience with Peruvian food.  But, you can't go wrong with the fish ceviche - the best I've ever tasted.  The Chicha morada (purple corn drink) was also interesting and delicious.  To top it off, the service was great.  We'll definitely be back :)"], ["Larry M.", "Had a great dining experience here.  Papa a la huanca was ok.  The lomo saltado however was excellent.  Well cooked, well seasoned with a hint of Garlic.  I posted some pics below.  The arroz con pollo was excellent as well, the cilantro was prominent throughout the rice and was well seasoned.  I have been to many peruvian restaurants across the country, and this one is the best in AZ hands down."], ["Sebastian R.", "Service was nice, but as a Peruvian I tried there lomo saltaldo and I was very disappointed. Too many fries, everything was soggy and the rice was pretty bad too"], ["Bryan P.", "The best ceviche mixto! The lomo saltado is always on point as well as the tallarin saltado. My favorite Peruvian spot in Phoenix."], ["I. J.", "We ended up in this restaurant with a search in yelp. This is a great place overall: customer service, cleanliness, nice environment.The food is fresh and the portions are huge! My mom and I will be sharing next time; had a lot of left overs.I really want to go back to have some pisco sour :)Parking is hard as the store is facing 7th st and there are only 5 to 6 spots in the front; so park in the back and come in. Main cross roads are 7th st and McDowell. Head north on 7th street and it will be in the corner of Virginia - NE corner."]], "The Wrigley Mansion Club": [["Lance F.", "The location is a 5 star.  So cool and full of history.  The appetizers were amazing but our main meal was just average.  I got the lamb shank and it was dry and disappointing.  They had a unique guitar player  for entertainment that played the guitar like the piano pretty cool to listen to and watch.  Overall it was pricey but unique enough to enjoy one time."], ["Mark O.", "Best view from a restaurant in Phoenix, best feeling of class when you are there.  Kind of tough to get to from the road, but worth it.  A grand old mansion with lots of interesting rooms."], ["Jenny S.", "The brunch buffet has a great selection of seafood breakfast options. The ambience is fairly casual with lots of families. The view of Phoenix is unbeatable."], ["Vanessa R.", "Came here for Sunday brunch with a large group.  The setting is really unique for Phoenix as historical buildings are few and far between in Arizona. The Wrigley Mansion affords great views of the city and mountains with its floor to ceiling windows and how it is situated atop a steep hill.  It really felt like a classy brunch complete with white tablecloths and bottomless mimosas served by the waiters.Brunch was buffet-style with a huge assortment of food - from waffles, to lobster legs, egg dishes, baked ham, and everything in between. I opted for the omelet station as this was the safest choice for me as far as gluten-free eating. The omelet station was great - a lot ingredient options including plenty of veggies and proteins. Even though there was a long line the cook was really friendly & made everyone's omelet to their specifications. I was also glad they had a huge selection of fruit.Being gluten-free, I did not expect to be able to eat any of the desserts, however it would be a good idea for them to be labeled as they looked great, but you could not really tell what the ingredients were, etc. The house itself does appear to be a bit neglected, but at the same time features a ton of original features. It would have been fun to take the official tour and learn more about this historical home. Note: Make sure to do the valet parking otherwise the trek up to the top and back down is quite the hike - we had to give some people in our party a ride back down to their car!"], ["Holly D.", "This place is worth 4 stars due to the history, architecture and view. If you want a unique experience for a birthday/anniversary ect...this is the place. The restaurant on site had great service, but food was average. I'm not dying to go back for the food, but man do they have a great basil/lemon gimlet. WOW. Come here if you want to go back in time to the 30's for a nice dinner and/or drink. I will be back!"], ["J D.", "We were invited to attend a Wine Tasting special event hosted by one of my clients.  In the 2 yrs since we've lived here, we haven't been to the Wrigley Mansion, so we were very excited to come check it out. When you pull up to the mansion, it's a bit confusing to figure out where to drive....there's a self-parking lot at the bottom of the hill....walk up a large hill in 90+ degree weather, um....no thanks.  Ok, so we drove up the driveway assuming that's where the valet parking would be located....and it was.  Beautiful views from the top of the hill.yelp.com/biz_photos/the-…yelp.com/biz_photos/the-…We walked inside the mansion and were greeted by a hostess who directed us to the private event area to the left.  We enjoyed Wine and Cheese/Crackers/Fruit, etc that you normally find at a Wine tasting.  The Wine was very good and the room was comfortable.  After 30 min or so we were asked to move into the dining room area where we would start a formal Wine tasting with 8 glasses (4 White, 4 Red) of Wine.The sommelier did a nice presentation about each Wine....however, she took too long and was a bit too in-depth for this group of people.  There were over 80 people and many of them were not Wine enthusiasts, so they were bored very quickly.....too much time between sips.  I personally enjoyed it, but afterward many people said it was too much info for them. Since the building is very old, the room we were in was not well insulated and got a little stuffy/warm....so if you're coming here during the Summer months, dress light.After the event, we wandered around the mansion and took a bunch of pics of the artwork and rooms.  I'm sure there's a story behind all of this, but we were on our own and didn't have a guide to explain anything to us.We picked up a flyer for a social club you can belong to here...?  Not really sure what that entails, but it's available.Overall, I'd rate this experience 3.5 Stars, but I'm rounding up for the views and Wine.Return Factor - 70%"], ["Cheryl W.", "My girlfriend from outta town suggested we have dinner here last week. The mansion & it's history is what I really loved about it. We walked around and peeked in all the rooms before we ate. Kinda has a spooky vibe- heard it was haunted! Service for dinner was great! The food was just okay, I had the Filet and it was just so-so. I would not order a steak there again. We decided to indulge in caviar- pricey but yummy! We sat outside and the views were amazing. We even saw fireworks coming from a baseball game ?I will be back for Sunday Brunch- heard that's their specialty! Bottomless mimosas & lots of seafood ! I'll update once I am able to go!"], ["Pepper T.", "I suddenly knew this was a mistake as soon as we started to scale the steep difficult steps and the handrail covered with a large amount of bird POOP. My stomach turned and I couldn't imagine why they don't have somebody to clean the handrail.We were a few minutes early for our reservation so we walked around a bit. It is an interesting OLD House with narrow hallways and a small room with an old fashioned operators switchboard. It does have beautiful views. The house has a beautiful entrance door and interesting intricate ceilings but over all it really isn't so grand with old worn carpet and common tiles. I thought I'd see a bunch of marble or granite but I didn't.We thought this was an interesting Choice for restaurant week because we wanted to see this place. Also this was one of the few places that gave you three courses without dessert. Also the $10 non member fee was waived for restaurant week.I can't say the food was completely awful but I wouldn't come back for it either even for free so I think that qualifies for the one star rating.We asked about cocktails and our waiter said they were the last page of the wine menu but they weren't and only lasted the liquors. He returned and my husband asked for the cocktail menu we saw outside and the waiter brings us the cocktail menu. I decided on a drink but the waiter didn't return for a long period of time so we decided to just order dinner and skip the cocktails.Our waiter said the Sous Vide Chicken was stuffed with something green and he didn't know what it was but to him it was very salty. He also said the Carpaccio wasn't very good. So we decided to go with the other two starters.The starters were passable but nothing either of us would want again. A not so great crab cake sitting on creamy peas with two refrigerated cold roasted tomatoes. The other was a few slices of eggplant with a little cheese.The middle plates were not so seasoned escargots with a forgettable salad. The highlight was a small chunk of gorgonzola cheese. The other middle plate was not hot and not cold but unhealthy room temperature tomato soup with a over whipped cream laced with truffle aroma. (Aroma means perfume) (and over whipped means turned to butter). We both thought the tomato soup was the best of what we tried here. It tasted like good tomatoes that would be great on a pizza.For dinner we tried the duck and the bronzini. Both were cooked just OK but neither seemed to have good seasoning or flavor however both of our vegetables were salted too heavy. I'd say so heavy I could tell what kind of salt they used and it wasn't good salt. The one thing that I could honestly say WAS terrible was the artichoke , anise sabayon. I tasted it and nearly barffed. I am without words to describe how it tasted but the texture was like hummus. Both plates had what they called polenta towers. They looked (see photo) happy to see us and I thought mine might squirt something when I went to eat it. But I was baffled when I tasted it because it wasn't like polenta. It was like corn muffin mix that was mixed with a farina kind of cereal. It was bready and lacked much of the corn taste and really tasted like cream of wheat cereal.I can almost say forgettable but I can't because I will never forget the bird poop or the polenta tower.1.5 stars almost 2 stars but with price factored in I feel one starSLIGHT UPDATE 9-11-13I read that they got a new chef since my review so hopefully they are better now."], ["Ginger B.", "I visited the Wrigley Mansion with my daughters to have lunch and celebrate their birthdays. We had just joined the Club for the very reasonable price of $15 annual, and as a member received free valet parking. The valet was a pleasant and professional young man, who opened our doors, provided a valet ticket, and directed us to the entrance. Once inside we were promptly greeted and brought to Geordie's for lunch at a lovely window table with a great view. Debby, the manager, waited on us. I informed her it was my daughter's birthday today, and my other daughter's birthday was yesterday, 17 years apart. We ordered beverages and a margherita pizza to share, and would order something more later, if needed. The pizza was amazing, with plenty of mozzarella, slices of heirloom tomatoes, basil and sauce on a wonderful crust. My youngest said it was the best pizza she had ever eaten! (and she's had Pizzeria Bianco several times!) We ate only half the pizza and wanted to take the rest to go. Debby was very professional yet also fun and personable. To our surprise, she brought out a slice of chocolate cake with Happy Birthday beautifully written on the large white plate. The girls were thrilled, blowing out the candle together. After our wonderful meal and time spent at Geordie's, we enjoyed walking around the museum like mansion. Many of the ceilings are beautifully elaborate and colorful, and the views of the city are fantastic.Visiting the Wrigley Mansion was definitely a highlight to our special day together!"], ["Shaina K.", "Visited for AZ restaurant week. It was evident that the service is highly diminished when you aren't there for their regular dinner service or perhaps when you're a good twenty years younger than their typical patronage. The table behind us received outstanding service. Our server was curt and mostly ignored us. This was after they switched our server with no notification. One minute we had a one server and the next a different one appeared (this was after we said we were there for restaurant week) No refills offered for water or second round of drinks. Waited far too long for the check. Servers, bartenders, and managers displayed unprofessional behavior throughout. Food was basic quality (I would expect more given their pricing). Chicken and steak we ordered were dry, salad was nothing special. Flourless chocolate cake was dry. Plus $6 fee for valet? Far nicer restaurants in Phoenix offer valet for free. This place is not worth the time or money. Won't be returning or referring."], ["Holly R.", "Oh, Wrigley Manson if only I had the means to fix you up and make you the amazing gem I know you could be.Phoenix is seriously lacking when it comes to historical buildings and homes. I have always been curious about the Wrigley Mansion so I was excited when we made plans to go here for Easter brunch. The brunch was good. Our server was friendly and funny. There was a decent variety of food and it was tasty. My only complaint about the food would be the desserts. They were not labeled, the cakes and pies were whole so people cut their own slices and they became a mess. Overall I just wasn't impressed. I've seen better dessert spreads at casino buffets. After the meal we wandered around the building, exploring the rooms, peeking around corners and checking out the history. The bummer is that it's obvious that the money isn't there to keep this place looking its best. Some of the bathrooms were run down (burned out lights, doors that didn't lock), in one room the curtains were torn, walls and flooring showed signs of wear and tear, and furnishings just looked tired in places. It wouldn't take much to clean this place up and have it look amazing. I'm sure when the Wrigley family lived here it was incredible and it's sad to see such a great home being neglected. I'm sure if they fixed it up they would book more parties and weddings and it could be a prime location in town. I hope someone will take the time and money to invest in one of our rare glimpses into Phoenix's past. If it continues on this decline I don't think it will last."], ["Amy C.", "I ate here this morning for brunch with my husband.  The building and grounds are beautiful, but the food was disappointing.  It was more like a fancy continental hotel breakfast, and definitely not worth $50 a person.  There were even store bought yogurts and pastries. The worst part of our experience was when we were leaving the mansion, a large group of African Americans had just arrived and we actually heard a waiter mock them saying, \"we've got fried chicken and collard green but where's the kool-aid?!\"  That was horrifyingly rude and summed up our experience that the building is the only classy part of this establishment."], ["Patricia O.", "This was my first time at the Wrigley\"s Mansion but definitely not my last. Had a late lunch yesterday and I had a great experience, the service was outstanding, the meal very tasty and the place is on a hill overlooking the Valley and downtown Phoenix.Tour the mansion a bit and is a beautiful Spanish style with beautiful paintings and furniture from the times when the Wrigley family vacation at that home. They offer a Sunday brunch that I will be trying soon as the sitting is a the ballroom where the views are the best."], ["Terry S.", "Wonderful tour and a fabulous lunch with the ladies.  I can't wait to take my husband for dinner in the evening. The view was so great really look forward to seeing it at night"], ["Ernesto L.", "The place is just beautiful with great service.Perfect for a date or a private conversation.The food was good but not impressive. Food wise I would give them 3 stars but the place and service made it up for the 4th.I had the asparagus salad and the salmon. both were good. Period.The bread was really good, though.They have a great wine selection and the prices aren't that bad.I'm a sucker for Riviera del Duero and they have plenty of them. Funny fact, the fist one I selected wasn't available. Cheers."], ["AV G.", "A-OK.  Had a 150 person work dinner here.  Nice job--pretty good food--EXCELLENT wine choices"], ["Bao H.", "High above the city of Phoenix lies a mansion of secrecy!  Views of the great mountains to the North and South, while the high rises sit dormant.  Where my friends......?  The Wrigley Mansion.....da duh da.......! (Thunder rolls and the lightening strikes -- haha Garth Brooks)This place was not a joy to find, but it was definitely worth the visit.  Valet is a must here!  This ain't your ordinary \"restaurant\".  You are free to roam around the mansion at your own risk that is hahaha!  Yes, the mansion is said to be haunted!  Just don't go to the restrooms alone.  Needless to say, this place was a delight.  It's literally someone's mansion.  The view is amazing!Sit down for a nice brunch with some of your favorite guest.  Mimosas flow freely so why stop at 2 wink wink?  The brunch buffet definitely has a variety of food.  Everything from crepes, Thai chicken, aged meats, prime rib, and tacos!  YUM!  Coffee is great and I would say better than Starbucks, yeah I said it!  Finally, service...it's a fancy brunch I didn't think service is lacking in any way. - Enjoy!"], ["Melissa A.", "Romantic relaxing atmosphere. Spectacular food and service. Hidden gem down the road from the Biltmore hotel. Had the lobster bisque, lamb shank, wine....so utterly delicious. Will go again for sure. Worth every penny....although I was lucky enough to snag a Groupon deal this time. Next time....I'll have to plan for it. They've got a Happy Hour too as well as live jazz certain nights. Enjoy the self-tour and save yourself the $15 to go through a guided tour of the Wrigley gum winter home."], ["Kathryn B.", "My husband and I went on our date night to try Geordie's. I'm not sure if it's because of the timing, but we were there at 8:30, service and food was okay history of the environment/mansion was pretty neat, we sat outside in the patio area, and every 5 minutes people were pulling trash, bringing trays of plates, glasses and etc. to go in the kitchen."], ["Clarence Thomas ..", "We wanted to make Thanksgiving special.  The Wrigley mansion is a beautiful house overlooking the city.  My date and I were seated at table 40/1 in the formal dining room.   The food on the buffet was excellent.  The buffet offered options of turkey, ham, prime rib, and lamb.   There was also an area where you can order omelets or pancakes.   Tons of food with very good quality.    On the other hand; the service was unbelievably poor.    We had to virtually send up a solar flare in the sky to get the server to stop and give us refills on water or champagne.    Our server Steve didn't have that many tables either and it was not crowded at the 3:30 PM seating in the formal dining room.    I did notice our server had a different level of attentiveness for our table in comparison to his others.   It was blantently obvious at one point he passed by our table and we both had dirty plates and I motioned for assistance he responded I'll be there in a sec; but a sec was minutes later.  Instead he utilized his time to fill up water glasses at adjacent tables marginally empty and chat with guest who had already eaten.   Perhaps his lackluster performance as a server hinged on the fact that gratuity was already included.  If this is the case he didn't earn one dime of it.  $189.45 for two people is a reasonable price for a Thanksgiving brunch if service is at least average.  This was not the case here and I admonish management for not monitoring poor performance of their servers.  The mansion is immaculate and I may come back for a random  tour and lunch; but for holiday buffet I will err on the side of caution because you never know what server you're going to get here.  Overall this is 5 star venue with 0 star servers."]], "Fuego Bistro": [["Cheryl A.", "So good, I already wanted to write this glowing review while still at the restaurant! Came to Phoenix for the first time and found this place off Travelzoo. Atmosphere: It's tucked off a main road in a quaint little plaza strung w/ festive lights and has ample outdoor seating with heating lamps. There's live music (not sure if it's every day, but lucky it was going on at dinner time) and the musicians are so talented.Food: The Travelzoo voucher is probably the best bang for your buck. I tried the blackberry sangria (highly recommend), and a little bit of everything -- I mean everything. Pernil, mashed potatoes, jalapeno biscuits, chorizo penne pasta, corn, salmon croquettes. Super flavorful! I don't think there was an item I disliked.Service: Amazing! I think this is what really did it. The hostess is so bubbly and the waiter is genuinely nice (sorry I don't remember their names, but previous posts mention them as well so you know they're consistent).Zero complaints for this place. Very glad I stumbled upon it!"], ["Bryan H.", "Awesome food! If you like the spicy side this place is for you. The staff is attentive they are very quick even when under busy times. Great music too on Friday and weekends."], ["Krista N.", "This was a great spot found by little sisters boyfriend. He saw it on groupon and did the research on Yelp and we ended up going as a group of 6. First off, their happy hour looks worth it in itself, but the dinner and drink menu is great.They are very tucked away, so it took us one time circling to find it. I liked this aspect of it because when you do find it, its quiet from the road and it makes for a really cute patio.We started with drinks - mom got the prickly pear mojito, dad got the blood orange (everyone's favorite), sister got the white sangria, boyfriend had a margarita, and little sisters boyfriend got a regular mojito (I was boring with white wine). All of the drinks were good and strong.Boyfriend had the short rib for dinner and man was that good! Dad and little sisters boyfriend had the pernil asado, which aside from the short rib was everyone's favorite. The flavor was slightly smokey with an all spice or cinnamon after taste which was just delicious. Little sister had the special of the night which was a sea food risotto (odd for a Mexican restaurant but no one will complain about some good fusion). Mom had the seafood chile relleno and loved it and I went with the chicken. Everything was delicious but I think I would go back for the short rib or pernil asada for sure. All of the sides were great, green beans, creamed corn, cornbread, carrots - YUM.What I loved was the happy service along with the great food. We even got a little coupon for the next time we come in and we will be there sooner rather than later -especially to try the big happy hour menu."], ["Roam J.", "Came here on Friday night with my wife and enjoyed a pleasant dinner in an \"art gallery\" while a somewhat bored looking guitarist serenaded us with Latin melodies.  Started things off with a mojito, which was very refreshing and quite large.  I've been a bit of a light weight since dialing back the carbs, and spent most of the meal with a healthy buzz - it didn't help that we skipped the appetizer.  Onto the meal - I got the asado, which was served up as a pleasant tasting mound of pulled pork.  The 3 small tortillas paired with the dish couldn't hold up to the juiciness and broke apart into mush, but I enjoyed my meal anyways.  I chose cornbread and creamed corn as my sides - both to die for, though I did kinda regret doubling up on the corn.  My wife got the short rib enchiladas - again, a mostly delicious dish, though the mole sauce was a bit to strong and she had to scrape some off to the side.  We finished with the bread pudding - it was good, but also my least favorite part of the meal. It's paired with a strong, chocolate ice cream - probably heaven for chocolate lovers, but I felt it overpowered the pudding."], ["Nathan S.", "Timeframe: Wednesday about 10 min before social hour ended.Service: waitstaff and the service in general seemed a little unorganized possibly due to the large party that came in as we finished up. Once they round to us the host, dressed in shorts and an oversized button down, made it right and extended the social hour for our whole stay. They do a good job just don't have high standards/expectations. Food: empanadas, chicken tacos and tostadas. The two chicken dishes looked a like but it seemed like the tostadas were spicier and with smokiness, maybe chipotle. Anyway the apps were delicious and filling. Drink: spicy margarita, Moscow mule, and NOT YOUR MOTHERS margarita. I cap the latter because it was awesome. Don't be fooled by the Amber color from the agave nectar this is a solid refreshing libation. Spicy margarita had a spicy sugar rim and the mule came in a copper mug.All in all it's worth the trip to this hole in the wall and we even got a treat with live music....there are also lots of regulars."], ["M L.", "Very solid Mexican food, great service, outdoor seating with live music was a plus!  We ordered the short ribs enchilada with a side of the chipotle mashed potatoes and baked beans.  These were excellent!  We also ordered a tortilla soup which was good but a tad too spicy for our tastes.  The key like pie was delicious as well and not as tart as I expected, which is a plus for us!  Overall a very fulfilling meal at reasonable prices!"], ["Carlos H.", "This is Awsome place to eat always fresh very tasty food it's a cute little place with nice ambience Steve was our waiter he was excellent desert is also excellent and lots of mixed drinks to choose from and beers"], ["Chris H.", "Fantastic little place and yes it's off the beaten path a bit, but worth the adventure to find it. We were looking for something new to try and bought a groupon for this place. The dishes are unique, very flavorful, and good portions. Service was very good, everyone was attentive, drinks were well made, and desert was aces. It is a bit cramped and you feel like your into the next tables conversation, but I'm there to have fun and do business or divulge my deepest secrets at the table so who cares. Worth the stop if your looking for something new and exciting."], ["Jennifer C.", "WE LOVE FUEGO BISTRO! We purchased a Groupon about a year ago and were blown away. The food was excellent, the music was amazing (pianist), and the service was out of this world. We come to Fuego Bistro about 2-3 times a month and that says a lot because we don't like to eat out much. I order the Natural Farmed Chicken Breast, sauteed organic green beans, and jalapeno cream corn.  My Husband gets the Pork Medallions, chipotle cheddar mashed potatoes, and green chili cornbread casserole. We always order the iced tea which is always refreshed without even asking. The Banana Burrito and Key Lime Pie are so delicious. There's nothing more wonderful than sitting on the patio, sipping ice cold tea, and listening to music. We'll be there tonight!"], ["Maria D.", "I just love this small locally own business they are just so into making your experience there the best.. I had the beef short rib and my friend had the pasta. Tried both meals and equally impressive. Pictures posted. I made reservation for only  4 in our party & we got right in. The location is in a different setting at first I didn't like it but I do now.. Give them a try. Oh and the first picture is funny 0% off.. I forgave them but the do need to change this."], ["Brittnee R.", "We used a restaurants.com deal to try this local spot for the first time. We were definitely charmed by the patio and outdoor space, but not so much by the $25 yucky short rib enchiladas and $12 watered down drinks. The sides (cornbread and creamed corn- waitresses selections) were decent the empanada appetizer had good flavor but again all wayyy overpriced. Won't be back."], ["Sheril C.", "NOT about the food, which was excellent as ever.  Service was miserable.  We sat in in the bar area, and the bartender grudgingly served us, never once checking on drink refills or food; she seemed offended when I asked for a clean glass (my wine glass was pre-lipsticked and not in my shade...)......Each server  on duty on a quiet Thursday evening  had to pass by our table to pick up orders from the kitchen, not a one made eye contact or offered water refills, drinks, nor checked on food quality.  See Daren & Nathan's reviews; the owner is great, very sociable, etc, but the staff is ill trained,  not at all up to the five star food.  Towards the end of the evening, a nice young bus-girl asked if we'd like a to-go box, and she was literally the only person who checked back on our table with out being flagged down.  Previous visits had EXCELLENT service, to match the food, not so much this time........disappointed........."], ["Alexis R.", "Oh my god, ohmygodohmygodohmygod!The food here is INCREDIBLE.  The owner is friendly, the ambiance is soft and super pleasant--even romantic if you want it to be, and did I mention the food?A group of us went here for Restaurant Week.  SO HAPPY we did.  I had the cola and pineapple braised short ribs, the green lipped mussels, and the horchata bread pudding, along with a berry sangria.The short ribs were amazing and a good portion.  the flavors balanced beautifully and the meat melted in my mouth.  Oh, and the sides?  The corn bread casserole was enough to make me cry for joy.the mussels had blue cheese and fresh tomatoes on top, and were good enough to be a meal on their own.  I would never have thought blue cheese and mussels could be so amazing together.The bread pudding?  Not so great.  However, I tried the key lime pie and I wished I had ordered it so I could take it home and roll around in it like a happy puppy.  Holy moly, was that key lime pie crazy delicious!Fuego Bistro is top notch.  Loses one star because while I was there, my chair got kicked by passing waiters and busboys ELEVEN times.  Three of those times  the chair was kicked so hard I was smacked into the table.  Not exaggeration.  If they had not been packed, I would have insisted on being moved elsewhere."], ["Cemone K.", "3.5 Stars. Came here for restaurant week and everything was pretty good!Got the Cola and pineapple soy braised short rib with jalapeño creamed corn, Chipotle Cheddar Mashed Potatoes, and the taco appetizer. Didn't like the tacos, but I tried my fiance's empanadas and I wished I had ordered that. The shortrib was very tender and flavorful I would totally order this again, as well as the side dishes. My fiance ordered the ribeye, it was yummy was cooked perfectly. Everything was delicious but very heavy and buttery so I could only eat 1/4 of my dish before I got full and a little sick lol. I tried my friends green beans too, very tasty even thought it was just green beans. We all alternated and got the red and white sangria, both were tasty but the red was definitely stronger. I was really looking forward to the horchata bread pudding and was really disappointed. I was expecting a cinnamon explosion but I couldn't really taste the \"horchata\" in it and it was more of a bread than bread pudding... it was super dense and not very moist. Maybe they were having an off day? I did however try my fiances kahlua creme brulee and it was delicious. Make sure to order this for dessert!The restaurant itself is kind of in a random residential area, the indoor part is small but the outdoor patio is spacious. We came wiht a big group for restaurant week so we had to sit outside. It's a little awkward though because the restaurant is surrounded by other buildings, including a kid's dance studio. So we had kiddos dancing and watching us while we stuffed our faces...yeah it sort of killed the ambiance. There was a live singer there though so that was nice touch. I'll probably be back to try more items on the menu, but we will sit inside this time!"], ["Ceaz D.", "Sooooo good full of options and great staff! The food is so delicious I willHave to come back again! Deff recommend it!!"], ["Nathan R.", "Always impressive with great food, service and one of a kind atmosphere! Come for the food, but their first rate friendly staff will win you over with their fun and attentive style of service. Love the live music and the patio!"], ["Michael V.", "Excellent food and very nice atmosphere. courtyard setting is great. Don't let view from street turn you away."], ["Chase H.", "Like others, I first tried Fuego Bistro after discovery them on Groupon a little over a year ago. I've been back 7-8 times, now.... only twice without a Groupon.What brings me back? The food. Fuego Bistro serves Latin American cuisine with some southwestern U.S. influences. Most entrees come with two sides from a variety of choices. I've tried several, but I always go back to the prawn dish. For sides, the cornbread casserole is delicious! And you can't go wrong with the green beans.I find that the portions are large, so I've only tried desert a couple times. If you have room or are planning on taking most of your meal home, I highly recommend the ancho chocolate torte -- it's incredible! On my most recent visit (a few days ago...), I noticed that many of the prices on the menu have increased. In the future, I will have a hard time justifying the value of this place without some form of discount (e.g., Groupon).A few tips: 1. They often offer Groupons, check before dining2. The place is a little tricky to see from the street, use GPS3. Try the cornbread (not for vegetarians)"], ["Oona C.", "I have been to this place about 3 times now.  Although I do enjoy the outdoor dining, lights, nice music, etc. this last time was not so good.  Maybe this was because it was a Friday?? The place was very busy and although we got seated fairly quickly it was at a table situated above an overhead mister which dripped water on me throughout my meal.  I managed to maneuver around the problem so it would not hit my head or food.  I have to admit, it  sort of surprised me that the establishment was not aware of this problem.  At any rate, I did not mention it to the staff until much later in my meal and I did not ask to be moved since I managed a \"work around\" the problem.  The music that evening was louder than the previous evenings.  I personally prefer music to be an undertone when I am dining.  Don't get me wrong, the music was good, I just hate having to raise my voice to be heard over dinner which is the last thing I feel like doing on a Friday evening toward my significant other.  I am starting to question the food here  -- the fact that it comes out so quickly makes me feel like I am being served fast food and the prices do not reflect that. Perhaps it's the ambiance we pay for.  The dessert we shared was, in our opinion, not so good even though we ate it but who has not eaten something they thought was not that great??  If we all did that, how would that change dining out?  Everybody has different taste buds and dietary concerns as well."], ["Christine P.", "Wasn't hard to find at all, my boyfriend found it quickly. Love the whole atmosphere.  The lighting and all that was romantic.  Super cute.  I got the vegetarian tostadas. Ehhhhh. It was just like salsa and dip basically.  Spicy, which I love. But still.. ehhh.. lolz.  I was so bummed though. :( because my boyfriend ordered the fuego pasta, with chicken on the side (so we can share because im a vegetarian. And the waiter knows that. )  the food came looking super delicious, as I was going to take a bite. There was sausages in it.............. um okay. The waiter didn't say anything about sausages in it knowing we were going to share.  :( booo.  The bill came out. It was $35.74. I had a Groupon, so end up paying $5.74. :D I just left a $20. Other than that. My boyfriend like his pasta.  Lolz."]], "Salvadoreño Restaurant": [["Stephanie E.", "LOVE this restaurant. Bean and cheese pupusas, with a side of rice and beans.... and an extra large side of curtido. If you don't know... curtido is marinated cabbage and thinly sliced green peppers with a hint of vinegar and a hint of spice. It's like a crunchy cole slaw sans mayonaise with a Salvadoranian flare. Put a bit of hot cheesy pupusa, with some extra beans and a huge pile of curtido and it is heavnely. We *think* it is gluten free although the addition of rice flour based pupusas on the menu has confused us greatly. My hubby who can't do gluten always feels fine though after the regular ones. If you've never had pupusas - you must. They are inexpensive, gf, can be vegetarian or even dairy free (ask for just beans). When you call they might answer in Spanish, but if you just start speaking English they will instantly switch over :)"], ["Jose C R.", "The food is great but the staff could use some work on business ethics. I didn't feel appreciated to come in to try their restaurant when I visited this place. I told the waitress that I've never had this type of food and I wanted to try it because my girlfriend was insisting and she wasn't too willing to help me. Even at the end, when I paying for the check, she circled the tip area -- insinuating that I wasn't going to leave a tip. I'm very well educated and even my mailman gets a tip, and this was just plain disrespectful to me. I didn't leave a tip because she did a horrible job, but to be fair it was just we didn't click at all.The food is really good, but stay away from the tamales please!!!"], ["John G.", "What to try that's different?  How about Salvadoran cuisine?  :-)Salvadoreño is tucked back in the corner, just west of the Walmart (where the Food City used to be - you know, the good one).  Salvadoreño is a nice little place (and wow! CLEAN bathroom!).The lady working the front was very nice and helpful.I decided to try the Dos Pupusas combo - carne asada and chicharron with a side of rice and beans.  The Pupusas kind of reminded me a bit of Venezuelan Arepas, but not as thick, and pre-stuffed.  They were tasty.  I'm not sure what the red sauce or slaw-like stuff is called, but both were really tasty.This is a cool place to try something different.Good pricing on the combo, too!Come on over and give them a try!!"], ["Sarabear B.", "Salvadoreño makes delicious pupusas!  Pick your filling, they are all delicious.  I like to call ahead so that they are ready when I arrive.  Cheese is my favorite.  I'm also fond of Spinach and cheese.  They have plenty of other options, and all are very nice.The place is quite inexpensive, and very casual."], ["Alex M.", "Best thing about this place is that every time I go here same great customer service no wavering in that and the food is amazing I don't go as often as I'd like to but when I do go I'm very happy with there service and the food . I do suggest this place there papusas are amazing as I've tried other places and they don't come close to the quality as this one.  They also have a nice beer (brew)selection it's not a big selection but they do have a few favorites I'm sure anybody would find a liking to . ENJOY"], ["Karla W.", "While it may seem sketchy, this place is amazing. My boyfriend and I went here for a date after I had raved about it to him, and he loved it. Obviously you have to get the pupusas. They're so good, but I wouldn't go with the chicken. I had it twice and it just didn't compare to the steak. I always get the crema and beans on the side, but it's up to you. WARNING if you are lactose intolerant, like I am, don't eat too many of these bad boys. They are stuffed full of delicious gooey cheese and as delicious as it is, it doesn't sit well.Other than that, I would say the service is a bit slow, but only because they make they food to order, so it's always fresh. I seriously love this place though. Don't judge it by its cover! It's awesome!"], ["Nicole H.", "Oh. my. gosh. The pupusas.  I ate three of them and spent the rest of the evening in a food coma.  Definitely try the carne asada and shrimp pupusas.  The cheese one was fine, but the other two were out-of-this-world delicious.  They come with a tasty salsa and some awesome veggies to toss on top.  I also tried part of what appeared to be a meat platter, with shrimp, carne, sausage, jalapeno, salsa, beans, rice, fresh queso, and plantain, served with fresh-made corn tortillas (they taste identical to the ones cooked fresh for us daily by our house mother during our homestay in Honduras).  Again, amazing.  The fact that this place is family-run and has Mexican soap operas playing on a flat-screen tv in the dining area just adds to the awesomeness. 5 stars.  I'll be back."], ["Stellz L.", "If you want some delicious pupusas, this is your first stop. Decently priced and yummy. My boyfriend and I tried the shrimp, steak, pork, and black bean. All good. Grab a green corn tamale for dessert. They are just sweet enough. Favs: shrimp pupusas & green corn tamale"], ["Lalalia A.", "Only place I get my salvadorian fix of goodness! Very delicious food and great service. You won't be disappointed."], ["Danny H.", "I had the Cevichi, which was good, but the shrimp was a little dry. The pork pupusas was very good, as was the Salvadoran soda."], ["xtoz s.", "Delicious!  I love pupusas!  I got several of them to go, and shared with friends.  We cut them into small pieces so we could try all of the flavors. This was the first time I had loroco and it was surprisingly good.Tip: Call in your order because it takes a while to make everything fresh.  Then, it will be ready or a short wait when you arrive."], ["Deb L.", "When it comes to Central American food, This is the place. If you are like me you spell Yummy , P-U-P-U-S-A-s.    Love, Love, Love the Cheese pupusas. Come with your appetite, you are in for a treat Pupusas come with a side of coleslaw that makes it extra lovely and of course there is Salvadorean  salsa. Whenever I can I stop here to get my favorite treat from Central America.  I like Cheese but they make other flavors as well.Be sure to have plantanos frito as well. A tasty sweet fried Plantain with crema and side of beans,  I adore this as well. This is an excellent hole in the wall place, clean and neat and  authentic.  Stop in watch some futbol and have a real meal . ( The family that runs it has several locations)"], ["Alberto B.", "Thanks yelp! Found this gem of a spot and had a great meal. Plenty to choose from and you won't be disappointed. Plenty different pupusas to pick. Or try the sampler with a little bit of everything. Me and my son had a great filling meal for less than $20"], ["Carlos G.", "Servicio, servicio y servicio. La chica dorada esta muy ocupada con su vida personal para atender a los clientes."], ["B M.", "Love this place! Great popusas! Loroco are my favorite and typically revueltas too! But since I'm not eating meat Loroco is my top pic!"], ["Jorge R.", "The tamales de eleto and crema were sooo delicious!! The platano frito was not good- platano was very hard, beans were too watery. The pupusas were ok, big, but I had better, the \"curtido\" was the best."], ["Bill J.", "Recently took a trip here with some friends and I have to say, this place definitely lived up to the hype! I had high expectations going in, based on the good reviews and mouth-watering photos people have uploaded of the food, and I was not disappointed! As you can probably tell, the place is small and somewhat low key, nestled in a back corner of a shopping center and not quite visible from the road. The decor is basic but authentic, and while you definitely get the hole-in-the-wall vibe, it's not at all in a negative sense. The place is clean well kept, but it's also bare bones and very much down to earth, with very few frills. One clearly comes here for the food and not much else, but there's nothing inherently wrong with that! As for the food itself, we sampled a wide variety on our visit and everything was fantastic. We started out with the appetizer sampler and from the tamale to the yucca to the bits of pork and the pupusas, all of it was absolutely delicious. For entrees, I tried the tres pupusas combo, while my fellow diners went with the beef tongue and the fried tilapia. The pupusas were beef, chicken and cheese, and all three were every bit as good as they looked, freshly made with lots of flavor. My friends rated the tongue and tilapia very highly, and several of them ended up taking food back home with them, which I always consider a good sign. As for me, I was unable to take anything home because I devoured the entire plate and had nothing left, it was just that good! I will definitely be back to this place for another taste of those delicious pupusas!"], ["Rick G.", "The food is very good. It is cooked very well, served hot, and super tasty. Music is playing. I was greeted by a friendly and smiling server. She was very concerned with making sure everything was right. The place is very casual, slightly festive, clean, and cozy with Salvadoreño food cooking sounds and scents filling the dining area"], ["Ann R.", "Yummy, great little place with a family run environment. Happy little Nana's laughing and cooking in the kitchen while the kids work the counter and keep the place clean.  Try the Pupusa's they are so good, sort of like empanada."], ["C. M.", "Came here while visiting from SF with family and was looking to have a descent salvadorean meal. This place is ok. The Pupusas were ok, they were a bit too soggy for me. Curtido could have been a bit mor flavorful. I do love the decor and the staff were very friendly. I wish I could have like the food a bit more.Maybe next time I'm in town visiting, I'll give these guys another chance."]], "Fire + Spice": [["Mur Z.", "Good enough for a lunch break where you want something different but nothing mind blowing.  Dinner service might be more interesting than lunch."], ["Mae M.", "I stayed in the Sheraton and got room service from this place.  I ordered the salad with balsamic vinegarette dressing, the pan seared salmon and the cookies and milk for dessert.The salad was pretty tasty.  I enjoyed it.  It was a combination of romaine lettuce, spinach, tomatoes, and freshly sliced onions.  With the dressing, it was very good.The pan seared salmon was lightly seasoned.  It was served over some gnocchi, spinach and some tasty sauce.  I thought it was pretty good.  Not the best, but pretty good. I really enjoyed the combination of the gnocchi and the spinach with the whole meal.  It really complimented the salmon nicely.The cookies and milk was a nice way to finish off my dinner.  I read on the menu that it was supposed to be 2 chocolate chip cookies and 2 white chocolate chip and macadamia nut cookies served with a warm tall glass of milk.  Instead, they gave me 4 chocolate chip cookies, but I couldn't complain.  The cookies were nice and warm and so delicious.  They were the kind of cookies that were soft and would melt in your mouth.  They were very thick and chunky because they had so many chocolate chips in them.  I really enjoyed that dessert.  It kind of reminded me of the pizookie (minus the ice cream), but  in a smaller and slightly thicker form.  Overall, I enjoyed my food.   I wouldn't mind sampling some of the other things on their menu if I had the chance."], ["Brian A.", "Had a coupon and came here on a Sunday night for steak. We had the NY strip and filet. The strip was seasoned well and cooked right, and the filet was very tender. The flavor on the strip was better than the filet, but no complaints. The potatoes and asparagus were great compliments (esp the grilled asparagus) and didn't leave anyone still hungry. We'd certainly come back for the steak and they always seem to have some specials and/or coupons for budget friendly eats!"], ["Michael H.", "I went there for a very early dinner prior to going to a baseball game. Arrived before 3:30 and there was no wait staff, so we sat at the bar. Not a big deal given the time of day. I ordered the fish tacos, which came out as to tacos with some excellent black beans, good corn, and chees and salsa. The tacos were pretty good, but at $15, I expected a bit more. It's a very pricey restaurant for a little commuter hotel. I was compleed to go to this restaurant because of a groupon offer for $30 worth of food for $15, but two entrees and two beers came to $45! I'm not sure it was worth \"saving\" $15."], ["Laura G.", "My husband and I went here on a Saturday night for dinner because we had a restaurant.com gift certificate. Yes, it's in the Sheraton, and yes it's near the airport with not much else around, but I have to say- we were both impressed. We started with the Gambas al Fuego, which were deliciously spicy (although I thought that $10 for four shrimp was a bit excessive, no matter how tasty they were). We both had house salads with blue cheese dressing- I think you can tell a lot about the quality of a place by their salads. They used fresh field greens, the tomatoes were perfect and sweet, and even the thinly sliced onions were sweet and delicious. The blue cheese dressing was fantastic, and had actual chunks of blue cheese. I was impressed, for a hotel restaurant. For our entrees, I had the hickory smoked baby back ribs (good, but not phenomenal) and husband ordered the chorizo chicken- I am so glad he shared a bite with me, because it was awesome. I was really wishing I'd gotten that instead of the ribs. Oh, and I especially wanted to mention the asparagus that came with my ribs- tender, cooked just right, and flavorful. This place uses quality ingredients.If it wasn't so out of the way, we would definitely come by regularly. My husband was especially enticed by the prime rib melt sandwich, so I think we'll be back during lunch in the near future. The only reason I'm not giving 5 stars was that the atmosphere was pretty dead. Which I suppose is understandable, given that it's inside the Sheraton. The decor was nice though. They should have a free standing restaurant in an area with more traffic- this place would be a hit."], ["Brian T.", "Wifey and I went here a few months ago for lunch with a Restaurant.com gift certificate. I had a French dip sandwich and wifey had some sort of a salad. the food was OKAY, but the atmosphere was jus odd. it's in the lobby of a hotel, and I felt just weird. The server was nice, but the place was dead as dead gets and it was just waaaay out of place."], ["Asaad M.", "I just ate at this place and the food was just amazing. This was what i hadCHILI RELLENOSA breaded fresh Poblano pepper stuffed with Chevre and melted Asadero cheese and baby shrimp layered over a bed of shredded cabbage. Served with chipotle cream sauce, southwest black beans and yellow posole.The posole was a perfect side and the pepper was perfectly breaded and fried.Its about $18 but it was totally worth it and just amazing."], ["Mark S.", "Wow, this place was so terrible. We had a $25 restaurant.com gift certificate that we bought for $2.50, and we still didn't think it was worth it. Service is super slow, the atmosphere is terrible (its in the lobby of a Sheraton by the airport) and the food is the worst of all.We started off with the nachos and they were decent. The service was brutally slow even though barely anyone was there, we had to repeatedly ask for refills on our soda, and our dinner took forever to arrive.We ordered a bean and cheese burrito for our daughter (not on the kids menu???) and it came full of tons of non kid friendly things like peppers and onions. My wife ordered the taco salad and it came with guac and sour cream on it (which the menu didn't say) and it didn't come with a black bean salsa that the menu did say it came with.I ordered a fish dish served over gnocchi which was really bland. The only good entree at the table was the Chorizo Chicken.Anyway, just don't go here."], ["Bruce W.", "Had a good experience last evening.   First time I have visited this eating establishment.   I generally think food at hotels are less than adequate.   However, the food at First and Spice was excellant.     I had the Braised Pork Shank; very good and my wife had the Southwest Grilled New York Strip.    She said it was one of the best tasting steaks she has had in a long time.   Also had the red chile horseradish dip.  Great.    Highly recomend trying their faire.      Prices are a bit high but the quality of the food offsets the price.     By the way the desserts: Homemade White Chocolate Bread Pudding and Kahlus+ Chocolate Toffee Mousse Cake were both very good.   The bread pudding as good as I have tasted."], ["Emily R.", "I went here due to a Restaurant.com coupon. The menu was expensive, which made me think that it was a fancy place, but it turns out that the food was expensive because it was a restaurant inside a hotel! It was inside the Sheraton and I didn't see any signs outside indicating it was there. We'd made reservations since it was a Friday night, but they really weren't necessary, as there were only two other families in the restaurant. We'd dressed up. We were the only ones.The restaurant area was really very modern beautiful. They'd made good use of lighting effects and there was a large, full bar wrapped along the back portion.We ordered the Pan-Seared Cheese (which were basically fried cheese poppers - delicious, but definitely overpriced considering only 4 of them came on a plate) as an appetizer. My date ordered the Baron's Burger (your basic burger), and I ordered the Valley of the Sun Ribs. The ribs were a little dry, but I really loved the \"Arizona croquette\" that came with them. It was fried crispy on the outside with creamy mashed potatoes on the inside.With the restaurant.com coupon, the meal was reasonably priced, but without it, I would have felt a little ripped off."], ["Michael C.", "Wow! What a surprise!Go Here!Tucked in the lobby of the Shereton Airport hotel at 52nd St & Broadway in Tempe. My big complaint: the chairs are too low to the ground. That's it.Appetizers: Ravioli in cream sauce, Pan grilled soft cheese (NOT mozzarella), shredded chicken nachos, hot & spicy shrimp.Pre-meal: Tortilla soup w/chicken & avocado, Southwestern style salad w/blue cheese.Meal: Center cut Angus filet w balsamic reduction & Spicy Shrimp.Dessert: Chocolate Kahlua Mousse Pie - Decadent!, Creme Brulee, Deep Fried Ice Cream.I don't really have anything to comment on because everything was so good! Been here twice looking forward to visit number three!"], ["Monique L.", "We went here for dinner, I made reservations not knowing what to expect. No need at all to make them, its a walk in place and you just sit yourself at an available table. First impression of the place was, \"oh no what did we get our selves into\". The restaurant is inside the lobby of the sheraton and is open, so you can see anyone just walking around the hotel. We had dinner at 9:30pm so was not too much traffic but there was an entertainer convention going on, so was very noisy and then when they had an intermisssion we got to see some interesting looking people. It was a lil bit of some nice entertainment. I could see how that could be annoying with all the background noise. First off we started with some cocktails, I had the orange margarita with sugar on the rim, was delicious, and Javier had the house special Fire and spice, it tasted just like a classic margarita (nothing special). Appetizer: we shared the Gambas al fuego. So for $10.00 you get 4 shrimps, (they were delicious) but for $10.00 I expect a lil bit more food. It wasn't even the jumbo shrimp, just normal size. Besides the price and quantity, this dish was delicious. It had a mango salsa that was sooooo good. It had jicama, mango, red bell pepper, cilantro, chile and lime. I think i will try to recreate this at home. So Im glad this is the appetizer we chose, but I will not be getting it again just because of the portion. On a side note, they give you a basket of bread, which is actually soft pretzel sticks. and you get 3 condiments to dip it into.Oil (which I think needed some spices for more flavor), jalepno jelly (ya I know, but surprisingly good), and a sweet/nutty butter.  For the main course: I got the chorizo chicken (chicken stuffed with chorizo and cheese) with a chipotle sauce on top, it came wth ranchero beans( i didnt like these, but thats just my preference, I enjoy more authentic tasting beans) and jalepeno cheese rice, (this was very good, and the cheese dishes are made with white cheddar). Javier had the bbq short ribs (he loved these) and came with jalepeno mac n cheese( this was extra cheesey) , but very good. And finally I ordered dessert, creme brulee. Now I may not be the person to ask because this is my all time favorite dessert, but I have definaltly had better. There was nothing special to it. But I couldnt leave with out trying it. I will be returning here to try other menu items, I just with they would change the location or open up another location in the valley."], ["Brittany A.", "Tortilla soup is delicious, spicy and reasonably priced.  Not cheesy like max and ermas and not like a vegetable broth like at many Mexican restaurants, thick and stewy.  Potato Bacon corm chowder was good but bot as chunky as I had hoped.  But is you don't want spicy this tasty.  The creme brulee has coconut milk in it and is AMAZING."], ["Scott J.", "Wonderful strawberry chicken salad.  Comfortable.  Awesome cheesecake."], ["Joyce G.", "My husband and I ate here Saturday night, using a Groupon I'd recently purchased. We enjoyed the open atmosphere and great service, and we were entertained by what appeared to be a large wedding or graduation party. Despite the fact that their kitchen had to have been extremely busy with such a large group, our meal was absolutely delicious! I had the portabella mushroom dish, and my husband had penne pasta with chicken - both excellent and a pleasant surprise! Yes, a little pricey, but definitely worth it. We'll be back!"], ["Tom B.", "I spent 3 nights at the Sheraton and since there are really no restaurants of any kind within walking distance of this hotel, I just braved it and had a few meals here while attending a 3 day conference. First day I had a turkey wrap for lunch which was yummy and quite filling. I asked the waiter for water, but I got served a Pepsi instead and got charged for it on top of it. Free refill though. Wish they had Coke as I hate Pepsi and all you can get in the hotel including the vending machines is Pepsi. Next meal I had was a dinner the next night. Ordered chicken enchiladas and they were just fine along with 2 beers that were a bit overpriced. Last night there I had dinner. Ordered the 8 oz fillet and it was made to perfection. Overall, very good service with the exception of the slip in of the Pepsi for the water the first day. Alcohol is a bit steep in price, but food is moderately priced for the amount you get, so overall, they get 4 stars. Very good, but not excellent. Just wish there were some other places to eat in the area without having to drive somewhere or take a cab to get out of the hotel."]], "Corduroy": [["Lisa G.", "I stopped by Corduroy for the first time this week, and I have to say that I'm impressed. My colleague and I shared the Crispy Cuban Cigars and the Dragon Salad, and it was fantastic!First of all, whoever thought of taking the ingredients to a Cubano and frying them should be given a medal--and then shot. I mean, these are dangerously delicious. The coarse-ground mustard is also to die for. Next, the Dragon salad is really tasty. I've rarely encountered dragon fruit in American cuisine, and it's very interesting and totally worth the feature. Additionally, the mango was fresh and the salad itself was well-balanced in terms of taste and of texture.The staff was friendly and attentive, the space has been repurposed beautifully. I'd definitely return."], ["Milo P.", "Quite possibly delicious food, unfortunately served almost cold. Everything else is right: a sincerely friendly staff, stylish surroundings that also manage to be comfortable, and an intriguing and varied menu.  Each dish tasted like it might have been great, but nearly all arrived too cool to tell. You could have fed almost any of it to a toddler without incident. It's hard to imagine that a kitchen able to turn out such well-prepared food would put up with having it served at school cafeteria temperatures.We didn't see as much of our server as we should have, but when he was around he proved to be very pleasant, knowledgeable and accommodating.I'd like go back in a month or so -- there's plenty more to try. In the meantime, I hope they get their sea legs."], ["Rob R.", "Check your check carefully! On the good side: surprisingly innovative menu--looks like a lot of good flavors. My meal was really good. I'd come back for the food. Negatives: The suggestive sale for wine & dessert came on a bit too strong. Once we received the check, a very long wait to get it processed. But worst of all, the prices on the check were higher than the prices on the menu. I was going to say something, but it took so long for the server to get back to us that I decided not to bother. On second thought, I checked a menu on the way out and confirmed that the prices for the entrees were $1 higher on the check than on the menu. I did say something at that point, & I'm sorry I did because it took a very long time to sort this out--a lot of hassle for $2. We're so dependent on computers that everyone is lost when they don't work right."], ["A. R.", "I wanted to love this place but walked away disappointed. Saturday, date night and we were in need of a late night dinner and Corduroy came to mind. Close in proximity, serves late, and appeared to have good reviews, why not? I became slightly concerned when we pulled up and the parking lot was empty, which is strange for a weekend night in downtown Phoenix. Inside, the space was nice, dimly lit and appealing to the eye. However, it was the temperature of a meat locker so any cozy feelings brought on by low mood lighting are quickly dissolved into violent body shivers. Jaime, the gentleman who sat us, was bitchy when we asked to be moved to another table due to the table next to us having a loud valley-girl like conversation that even the strongest drinks would have made impossible to stand - like, OMG! We ordered the Cuban Cigars as appetizer, followed by Lemony Chicken and the Supatra salad. The Cuban Cigars were dry and without flavor, unless you count dripping grease as \"flavor\" Without the dip, they would have been hopeless. The Lemony Chicken was salty, and the potatoes were burned to a crisp. You can't truly mess up salad...or so I thought. Not only was the combination of flavor strange, the actual lettuce has an overpowering chlorine smell that reminded me of my swimming pool...or impending death. In my desire to survive the night, I had a couple of brave bites and tried my best to wash the flavor down with my overpriced glass of wine. All in all, this dining experience cost us $68.90, hunger pains and full body shivers. Never again."], ["Robert G.", "I was happy to see another restaurant coming into the neighborhood and still wanted to try it even after hearing mediocre reviews from friends that tried it.  While the interior  was very trendy and comfortable, I do have to say the food that I tried was extremely disappointing.  Our table sampled 5 different tapas dishes and I really could say that they lacked flavor......all were kind of bland.  I ordered the lemony chicken and it was such a bitter sauce accompanied with undercooked potatoes.  It was pretty horrible.  Phoenix has so many great restaurants and it's a shame that such a great space is wasted with mediocre (at best) food.  It's new so maybe they have to work out their issues, but I won't be back unless I start hearing great reviews from friends that go there."], ["Joe M.", "Stopped in almost on accident for lunch. Was going to go to Switch next door but this place has a nice curb appeal. Aside from the exterior grabbing my attention with its small but modern chic patio the interior had equally aesthetically pleasing touches for my tastes. Once seated promptly we were given several menus. A specialty cocktail, brunch and regular menu. I have to say every option, whether a drink or a side dish looked interesting and tasty. Me and my guest actually took longer than usual to decide simply because so much sounded fantastic. The final choices for both of us to ultimately share were as follows: bloody Mary carafe, modus hoperandus, bacon and cheese board(custom built), Cuban cigars, breaded cauliflower, and the crab cakes eggs benedict. With out dissecting each dish I will keep it simple and say everything was superb!!!! I highly recommend this place to anyone with an adventurous palate. My one and only knock on the place is both the menu and our server say that the Cuban cigars and cauliflower are small plates. They are not. They are delicious so who cares right?!?!"]], "Ticoz Latin Kitchen": [["Gigi K.", "Wonderful food, great service and, wow, did I mention great food?Yelped to find a local place with 4 stars or more.  Ticoz Latin Kitchen popped up and we gave it a try.  Great find. Ordered the Blue Corn Enchiladas and was pleasantly surprised with freshly grilled slices of zucchini and a serving of tamale blend on the side without having to open the leaves. The enchiladas were hot, perfectly spiced, and very well presented.  My friend ordered Pork Verde Mac-n-cheese.  She could not stop saying how wonderful it was.  Nice amount of heat and large portions.Service was spot on. Very pleasant and helpful waiter. Thank you fellow Yelpers. This is a great restaurant. Definitely on the good list!"], ["Farzana S.", "We always drove by this place and have been meaning to go for years - and last night was the night to do it. We had a groupon and decided to give it a try. The food was extremely flavorful. The pineapple salsa that comes with the chips -- very good. My husband and I both got the chicken chimichanga and this dish was packed with flavor. My tastebuds didn't want to stop, but I had filled up so much on the chips and salsa earlier, I had to. Luckily, I had leftovers which I just polished off tonight.  We also ordered the Mac and cheese for our child, which we tasted (you know, to check the temperature and all). My husband said it was the best Mac and cheese ever, and our kiddo seemed to enjoy it too!"], ["Brandon L.", "The new servers the have are excellent! The food is great! 2 buck taco Tuesday what else could you ask for?  I recommend trying all of them. Everytime I come the food is great. The atmosphere Is good and the drinks are even better."], ["Jason C.", "My wife and I visited for Restaurant week and we were not disappointed. The service was fast and punctual, they didn't even disappear after giving us the check like so many places do.  The atmosphere was good, we were seated outside. The food was deliciousCourse one was the lettuce wraps, simply divine, one of the best things I have eaten in a long time. 5 stars by itself. The Chicken over veggies was my second course. The chicken was tender, the veggies delicious, even the mash potatoes were good  (They are hidden under the chicken).  I give it a 4.5 StarsThe third course was dessert. The churros with ice cream was good. Though I did feel like it could have used more syrup other than what was drizzled on the plate. 4 Stars All in all 4.5 Stars rounded up to 5 Stars because of great service. Love restaurant week and the ability to try out new restaurants, I will definitely be back."], ["Steve A.", "I have been here a number of times and the place never disappoints.   Wonderful food - I had lobster mac n cheese tonight - that's always spot on.  Happy hour has decent prices on food and I live the sangria.  An intimate patio makes this a great neighborhood spot.  I really enjoy the Spanish background music as well."], ["Mike O.", "Fun and good value happy hour. But there are just too many places within a half mile that are doing the same thing and doing it better. Makes me think of the divey old pookies... A place where you don't go for food, but good company and tasty beverages.  ...and a drag show (if that's your thing).## the scrambled egg special with jalapeños and peppers was dead and overlooked. DEAD. Think: chafing dish, serving spoon and steam table. Ugh. Small details missing, reflected everywhere including the kitchen. Stop trying so hard, just get good at a few things and let the booze do the rest. # water glass chipped# bits of dried food on the silverware# gents' door sticky enough that somebody might think it's occupied# seating upholstery is worn, cracked and tattered# wall to wall kitsch not dusted recently# staff congregates at the host stand chatting and leaningI'm not supposed to care because you don't.  But I do. It means you don't care about my food. And it shows. ## open face tamale is not a tamale, it's a hot mess. Stop calling that mushy pile of barely-cooked masa a tamale. # queso sauce is a wet mess (I'm always wary when the menu has to change languages from English to convey the description). Glad I asked for it to be left off. # nothing made to order. It's just a lazy kitchen with squirt bottles and chafing dishes doing nothing well. MEH!!What a shame. Maybe if they add a drag show I'd be back sooner than later. So far it'll be later."], ["Angelica M.", "My daughter and I chose this restaurant for lunch because we were shopping at a neighboring store. The place was nearly empty.While the general atmosphere was good, it was clear that housekeeping standards were not up to par. It wasn't dirty per se but for a restaurant you don't want to see a  previous patron's meal (crumbs here and there) in the booth cracks. It was obvious that it was \"cleaned\" too quickly. More like swiped. Now I don't know if the young man who served us was a waiter or busboy or some guy off the street because he never gave us his name. Although he was pleasant he appeared to be new. He was still knowledgeable and attentive. He got our drink and appetizer order then served it.  He mentioned that he didn't know where our waitress was and said he'd  go ahead and get our order. The appetizer was very good (shrimp cerviche?). Our meal came in a relatively timely manner and was pretty good with the exception of the \"Uncle Ben's\" styled Spanish rice. It quickly became evident that while the entrees were very good, someone in management decided to cut corners with the sides. Overall it was okay. A bit overpriced for lunch but still okay. Now i'm not too familiar with the Phoenix area so my daughter and I didn't know about other restaurant options nearby but it was a generally good experience. I'm taking a star off for lack of cleanliness and another for the waitress confusion. Yeah I'd eat there again."], ["Ryan N.", "Really enjoyed this latin fare locale.  Tacos were tasty. Can't wait to return to try more."], ["Corina L.", "This place is clean, the staff is very friendly but the food is egh. The prices are a bit pricey. The drinks are good. I went to the girls bathroom and was horrified when I walked in and saw men dressed like women in there using the bathroom and washing their hands. I understand the new fab these days with accepting people for who they are and I have nothing against cross dressers but it doesn't make me feel comfortable for me walking into the girls bathroom and me trying to use the bathroom when technically there is men in there with me. I wouldn't come here again and I don't know how should've addressed the situation about the bathroom without upsetting anyone."], ["Valencia G.", "My new found favorite spot !  I was invited to a birthday dinner here and I was truly surprised and enjoyed EVERYTHING I had!  I had the paaaion fruit sangria which was awesomely delicious!  The monster quesadilla appetizer was tasty and the Taco salad was the business!!  And our server Dave was great!!!  I shall return!"], ["Chris M.", "I love this place. It's not so much of a case of anything in particular being overwhelmingly good, as it is NOTHING being bad. For some reason, it all just really seems to work for me lol. Food is always good, great happy hour, very friendly service. Bartender is great. I was there most recently late Saturday night and the bartender talked me out of  ordering  something as this particular dish had some negative feedback a little bit earlier in the night. I was very appreciative of that and the overall genuine friendliness in the service.Food: very good, nice range of options. Love the lettuce wraps Drinks: the cocktails aren't necessarily my thing, but can't knock them because I'm sure they work for a lot of people. Just keep the beer cold and I'll be just fine. Red sangria was tasty as well. Service: really friendly and genuine. Bar service was outstanding"], ["Ginger G.", "Stopped in to Ticoz for lunch today and it was amazing.  I had the chicken tamales which are served open-faced.  The mass is sweet and pairs amazingly with the salty and spicy chicken.  My coworker had the blue corn tamales  which were also very good.  Service was quick and friendly.  Highly recommended!"], ["John B.", "Our waiter, Bryan, was exceptional, giving some great suggestions. We did have two appetizers, the lettuce wraps, which were better than PF Changs (and I love those), and the guacammus. I eat hummus all the time, and this was good, but the lettuce wraps won. My wife had the chimichanga, which was a lot of tasty food. However, one of us in our party had the blue corn enchiladas, which might have been the favorite of the group. However, I had the pork chile verde enchiladas, which I claim was the best during our four person taste testing. We did sample the pork verde mac and cheese, which was tasty if you like mac and cheese, which I don't. Even though we were stuffed after licking our plates clean, we indulged in the peach cobbler (yes, don't even hesitate, just order it, you will not be sorry). The daughter and her hubby had the empanadas, which they loved! My taste buds definitely favored the peach cobbler, however. We did come during the early happy hour and the waiter was looking after us, making sure we knew when happy hour was ending to take advantage of the specials.Definitely a place to return to. Highly recommended."], ["mark g.", "We actually ventured into town searching for a new and exciting dining experience and we're delighted by ticoz  our wait person was professional  and efficient, I had the Mexican Benedict which I found delectable my wife had the huevous rancheros which was also very good the only thing was the eggs were not done as my wife had requested when she brought it to our wait persons attention she did offer my wife a new egg but my wife said it was ok as is. I thought maybe a bit of a comp on our bill might have been a nice gesture none the less we will certainly return for more, oh did I mention 2.99 bloody Mary's"], ["Joe E.", "Good beer selection and good prices at happy hour. I had the Blue Enchilada's. Wow! Fantastic food and service."], ["Manuel C.", "Came in for lunch on Taco Tuesday and enjoyed $2 tacos. I had the Pork Adovada, Tinga Chicken, Carne Asada, and Dos Equis Battered Tilapia. Service was great. The chicken and fish tacos were awesome. The pork was good. The beef was so so, the meat was chewy and not as tasty as the other three tacos. The waiter did not ask if I preferred flour or corn tortillas, and I forgot to specify so I got stuck with flour. I'm sure my tacos would have been better with corn. Good spot to try out."], ["Jodi O.", "Well a friend told me about this place and I wanted to try it. So Margie and I hung out today so we did a few things and then came here for a meal. We were greeted by Susan who was a delight and Brett was our fine looking server. The two of them were very professional yet friendly:). So Margie and I ordered a appetizer Ticoz Guacammus w/pita bread. Margie ordered the Pork Chile Verde Enchiladas - yummy. I ordered theBlue Corn Enchiladas with chicken OMGI can't tell you how awesome our meals were. Margie and I shared our plates so we can each try them. They have a sweet tamale mixture that is really tasty. Thank you Susan & Brett for sharing and explaining the different sauces. I do plan on coming back for more awesome meals."], ["KC C.", "Had a nice plate of Blue Corn enchiladas with a fried egg on top...delicious, loved the sauce and with the addition of the egg yolk it enhanced the experience. Really nice service too. I would definitely go back when in town to try some other items on the menu."], ["Karina H.", "I would say the best thing I've had here is the lettuce wrap appetizer. It has chicken, fruit, and pumpkin seeds, so yummy! The rest of the food is so-so. Maybe it's just the plates that I have ordered so far are not so tasty...I don't know. It's not that what I have ordered isn't well put together or not cooked well, it's just, well, bland. The drinks, as other reviewers have commented, are great. I love the sangria.I also feel like they need to update the place. I can see how the place may have looked great 5+ years ago, but now it looks a bit outdated. I can tell some of their furniture/décor is straight out of Ikea. The material on many of their chairs is worn down or ripped. It's time.Overall, their drinks are great, their apps are yummy. While there were good things about the few times I've been here, I probably wouldn't go back unless I heard that there's been changes or updates."], ["Angelica C.", "This is one of my favorite Happy Hour spots! They have some great drink selections here and the vibe is just a feel good vibe.The menu is pretty good. They used to have a variety of salsas that I no longer see on the menu which makes me sad but is definitely not a deal breaker. The street tacos are hit or miss. Love the fish tacos but the carne one was way too chewy. The servers are very nice and attentive, I have never had a bad experience here."], ["Leslie M.", "I was searching for a place to eat this afternoon and decided to hit Ticoz - I remember visiting a few times before but I didn't remember my experiences.  All I remember was the restaurant was kinda cute, so hey, since I didn't remember if I liked it or not, I should try it again.We walk in and there is one employee - she is making drinks for the bar, trying to seat us, AND she is also our server.  There weren't many people there so ok - I get it, labor cost savings - However, you jeopardize service - and yes, the service was lacking a little.We ordered the shredded beef tacos and the grilled burrito with spicy queso.  We got our food (which I felt like it was half an hour later), and I took one bite in the burrito.  It was not good at all.  The spicy queso on top of the burrito tasted like the cheese in a jar that you get at your local grocery store.  It had this taste that I could not get out of my mouth.  Next, the street tacos.  They were a little better, but nothing fantastico!  Bill came up to a little less than $30. I left there and I could not shake that burrito taste out of mouth so I did what I needed to do - I ate a big GOOD brownie all by myself.  I'll probably never forget what my experience here was again..."], ["Zachary W.", "We went on Sunday and they had their brunch menu going.  I ordered off that and my wife got a half salad and cup of soup.  Food was really good!  I had the huevos rancheros and they were awesome!  Service was good.  My only negative comment would be that the menus were really dirty.  We will be back!"], ["Bobbie M.", "This place makes a mean lychee mojito, badd ass passion fruit coleslaw, and cross cut fries...but I'm unhappy with certain menu changes, and the price increase. I wish they would have kept the sliders on the menu, they were THE BEST (especially the one with palm hearts). The ambience is great, friendly staff, super comfortable seating, and good service."], ["Ursula C.", "Great atmosphere, friendly staff, and delicious food! A place I'll recommend and keep coming back to!"], ["Aaron W.", "This unassuming place is a gem. Forget the typical brunch crowds, and get some great food and service at Ticoz. Mojitos and great lunch and dinner entrées put this place over the top."], ["Rose O.", "Have eaten here several times for lunch and dinner. The food and service were consistent. Staff is friendly and attentive.  The blue corn enchiladas are fantastic.  I love the twist in how they present their tamales.  Not over powered with masa.  Excellent.  Decor is ok some of chairs are very worn and the patio is ok.  I am not a fan of patios that face the street where you hear the noise and aroma of vehicles passing by.  Otherwise great food."], ["Samantha L.", "Love the welcoming staff. Happy hour is the best bang for your buck! Mojitos are yummy...lettuce wraps mouth watering! Love the low lighting & its not jam packed. I've been twice and plan on it several more times.Update-also the macaroni & cheese---uh mazing---my brother in law tried the blue corn enchilada's--he loved them!"], ["Jose S.", "Pretty good. Wish they had more beer options. This IS the era of craft beer. Not a better time to add more beer options than now. But as far as the food goes.. it's good! Try the green chilli pork Mac n cheese!"], ["Renita M.", "NEVER EVER HAVE AN EVENT HERE!!! Food is good, but the service is the worst I have ever received in life.  No lie! I planned a dinner party for my husband's birthday here and it was a complete disaster. We ended up having more people show up than our original RSVP count. Went to the hostess stand twice to work out food for the extra guests and the hostess was so hair-brained she kept telling me, yes the chef will be right with you. Finally, 30 minutes later I ended up just talking to the waitress. I told her we needed additional items and that I was happy to pay regular menu price for the additional items no problem.  Well I guess she was put out by having extra people to serve and was smacking her lips, not refilling drinks and was throwing - yes literally tossing down plates of food - at our guests. then she stood up in front of the entire room and read off how much our final check was. So embarrassing.  Completely rude and highly unprofessional! Needless to say, I have not been back and I will never go back."], ["Nicole B.", "If I had to pick one Latin-fusion restaurant to eat at for the rest of my life, I would choose Ticoz. They have a great happy hour every day of the week with different drink and food specials. I adore their Blackberry Mojito and their Coconut Margarita. Also, their Guacamus is my favorite appetizer. I could eat it any time of the day. Normally we order the Grilled Burrito and have them do a split plate. Sure, there's an extra $2 charge, but it is totally worth it. The husband and I each receive our own burrito (slightly smaller than the normal sized burrito, which is huge) and our own coleslaw. It is still a lot of food, but so good. We've had a few desserts here, but nothing special. All of the staff is super nice and utterly kind. We have always been seated promptly and served quickly. Even when we do take out, the service is impeccable. The inside is hip and modern with a relaxed feel and the patio is great. The bathrooms could use an update, but that's not going to stop me from coming here. If you are ever in the area, I would highly recommend going here."], ["Victoria W.", "I LOVE this place! Everything is so good and the staff is always friendly.  The prices are reasonable. It reminds me of a smaller version of Maria Maria that was at Tempe Marketplace and has filled that void for me. If it weren't so far from me I would go weekly but am satisfied with going every other month."], ["Keith C.", "The reviews on this restaurant are dead wrong. We had dinner on a Wednesday night and it was terribly disappointing. The atmosphere is dark and dated. The food is bland across the board. Nachos were ample in size but lacking in flavor. The high point of the meal was the Chile lime Caesar dressing on the salad. It was great. The signature pork Chili Verde Mac and cheese was terrible. The pasta was overcooked. The cheese had no flavor. They must have ran out of green chili's because there was zero kick. There are a hundred Mexican food joints in Phoenix with better food at half the price."], ["Catalina C.", "A friend took me here a while ago. But o know the place is good because I remember it! I went on a Monday night,  great drinks,  I think i had a mango  mojito, yummy! Whatever I ate i couldn't stop eating. It was great.  Attentive staff,  great  decor.  Definitely check it out."], ["Joanna M.", "Friendly staff & customers ~ lots of regulars here that always make you feel welcome. One of the best brunches & Happy Hours around"], ["Kiana B.", "This was my first time visiting and I don't think I'll be back again. The atmosphere was intimate and well decorated but the food left a lot to be desired. It was restaurant week and it afforded me to get an appetizer, entree, dessert and drink all for $30. I thought it was a great deal. My appetizer, a chicken lettuce wrap literally could have been a tropical trail mix with diced chicken mixed together. It was cold and it just wasn't good. My entree, seafood paella, was oversalted and lacked finesse. I tried a peach sangria which also was disappointing. For my first visit, I was hoping for a lot more since I heard good things about the place but I don't think I'll be back again."], ["Bao H.", "(Lyrics - Britney Spears - Baby One More Time)Oh, Ticoz RestoOh, Ticoz RestoOh, Ticoz Resto how was I supposed to knowThat something was all right hereOh, Ticoz Resto, I should order soonBut now you're in my sight, yeah!Show me what I should eatTell me, Ticoz Resto, 'cause I need to know nowOh, becauseMy hungryness is killin' me(And I)I must confess I still thirsty(Still thristy)When I'm at the bar I'll order minesGive me a wineHit me, Ticoz, one more timeTicoz Resto Bar is \"sexy and chill\" lounge according to what they want to bring to Phoenix - oh baby baby indeed!  I'm impressed and happy to finally hear a restaurant bold enough to admit they want to bring some sex appeal to a restaurant.  S......saucy! \"Hit me one more time\", with another drink please.   I came here on a HH meeting with some friends.  The place is far from sexy sorry to say. I think it's more chill then anything.  When you say sexy I'm thinking a hot vibe and sultry art and pictures.  Then again it's not an adult shop haha!  They have a dining room and bar room.  Both seem pretty mellow to me - \"Show me how you want it to be, Tell me baby cause I need to know now oh because!\"  I think they want to be modest, but also have some sort of flair, but either or I think the place is pretty cool.We sat at the bar today to get some HH drinks and food.  Very good prices I must say so cheaper is good for my alcoholic side!  Nachos to start of course with some chicken.  Needless to say, I'm not a big fan of nachos, but the cheese and shredded chicken really popped. The cheese was melted well and it didn't drag all the other ingredients along while you rip it apart.  My next dish was the Tortas.  Tortas to me is street food, but I totally dig a restaurant that can bring it indoors and make it work.  It worked indeed at Ticoz.  Soft bread and shredded pork; add a little hot sauce and yum!  It was serve with waffle fries; crispy and crunchy.  I'm a texture guy so I love! - Enjoy!"], ["Deanne B.", "I have never had a bad or even kinda bad experience here.  Happy hour is amazing, the food is great and the servers/bartenders are fantastic.  The passion fruit sangria is something dreams are made of, and pair that with the guacummus or lobster dip and it truly is heaven.  What can I say? love, love, love!  My fellow teacher colleagues and I meet here once or twice a month and everyone loves this place - most people pick this place even though we work in Maryvale and most of them live in the Peoria/Glendale area.  If you're looking for great food and great service, this is definitely a sure bet!"], ["Norm R.", "Tonight I dined here with friends for a Dining Out for Life get-together. I had the Latin Passion salad, which was so good that I'm planning to have it as my main meal next time I come here. I also had the blue corn enchilada - truly scrumptious! Service was efficient even though this was a busy night. It was a really tasty meal and  I'm glad  that I now live near this restaurant!"], ["Penny Y.", "Yesterday was my first visit to this place, and I will definitely be back!  We started with some calamari, and they were tender, made with panko bread crumbs.  The calamari wouldn't stand out on it's own except for the two dipping sauces that came with it.  The green, creamy one had a little too much kick for me (I'm a wimp when it comes to spicy), but yet I couldn't stop eating it.  The other sauce with it is tangy but not spicy, so I used that one to take a break from the creamy one.I had the green corn tamale enchilada, vegetarian style.  It was AWESOME!  It was flavorful, and the sauce they have enhances it.  (I think it's the same tangy sauce served with the calamari, but it seemed better on the tamales than with the calamari.)  The zucchini was grilled and tender, and it actually had flavor (which sometimes vegetables don't).  I'm not a black bean fan, but I ate all of them because they were tender and flavorful, and I liked the sauce they squirted on it.  The rice was also really good and not hard or dry.  I don't know if I will try anything else on this menu because I liked it so much.For dessert, we had churros to celebrate my friend's birthday.  They were hot and crunchy with copious amounts of sugar, and drizzled with chocolate and served with vanilla ice cream.  It had a little too much sugar for my taste, but I do love any fresh, hot churro.The server was super nice and he made sure to keep my water filled.  The restaurant is a little dark, so if you need a place for privacy or a place to make out (like a couple in there was), then this is perfect!"], ["Paula L.", "I don't know if this restaurant is Mexican, Puerto Rican or Cuban, but I don't get it. We split the monster quesadilla which has jack cheese, monterey cheese some tomato and jalapeno peppers. I went with the sweet corn tamale as my entree that came with rice & beans and a red sauce. The tamales were 2 scoops of cornmeal. My husband had the grilled burrito topped with queso cheese. I don't mean to be critical, but nothing at all about our meal was authentic, everything taste processed.Disappointed."]]}