{"Hana Japanese Eatery": [], "Iron Chef": [], "Sushi Station": [], "Wild Tuna Sushi and Spirits": [], "Sushi Style": [["Kyle D.", "I've had sushi all over the world. Sushi Style is not only the best sushi I've had in the valley, but some of the best sushi I have had on my many travels. Great happy hour, great servers, very reasonable prices,and great sushi chefs! For great sushi I will go no place other than Sushi Style!"], ["James F.", "The sushi is decent but we used to come here cause it was cheap. They raised the prices recently on the plates but the quality of the sushi didn't make an equal jump. Not bad overall but I would rather get better quality at these prices"], ["Karn H.", "It was fun, cMe here on a whimmmm ok service and sushi. It's the only one around, I'll be back"], ["Kimberly M.", "I am writing this follow up for one reason.  I have gone back...tons of times and never again has there been any conflict to be seen.  The food is still amazing and it's still my go to place when I eat sushi.  When I move next month, it will be hard to leave this gem behind!"], ["Anthony F.", "Heard good things from people who have been here and thought I would check it out and as a sushi fanatic I was not impressed at all.The service was rather slow, the waiter rarely checked in on us and seemed distracted most of the time although the place was not really busy. He would take one order then come back 7 minutes later for the other. Also we waited a good 15 minutes for our check after we all decided to leave some kind of signal we were done by stacking our plates together.Onto the sushi: most of the sushi was fresh, however the avocados were not ripe enough and were slightly hard. All throughout the dinner, I had this very unusual undertone taste to everything I ate. After several experiments we discovered it was a mixture of the dirty soy sauce bowls and the soy sauce that made everything taste like you were eating a latex balloon.Between the service, the weird taste and the high priced food ($14 for Beef Yakisoba? It's just ramen with little tidbits of beef!) we figured we can go to Sushi Station near Desert Ridge in the future for a much better meal."], ["Zoe J.", "Went there with my boyfriend and didn't know what to expect since I've heard mixed reviews. We got there at 8:30 and their reverse happy hour was during that time. We ordered crab puffs, 2 Vegas rolls and 2 crunchy California rolls and also got miso soup. It was high quality sushi and I was more than satisfied. All together our total came to 26 dollars or so which is not bad at all, taking into consideration how sushi can be expensive. I will definitely be returning!"], ["Mikegregory23 ..", "This is a great place to eat and it has a great look inside and always has fresh food. It also has a nice patio and  I have personally seen the kitchen and it is very clean, no problems. I would recommend eating here to everyone."], ["Annie L.", "Great happy hour! Nice size rolls and a large selection of rolls to choose from! Great service :)."], ["Jody K.", "I like going to this place for their ramen.  There aren't that many places around us that serve ramen and when I have my craving, this is where we go.  If we are there during happy hour, we also order a few sushi rolls, which there are none that we have not liked.  Service is really friendly and there's always a table ready for us when we arrive.  I definitely recommend this place."], ["Donny T.", "An interesting place for Sushi that is not bad for local. There are a couple of things that I really enjoy about this place. The first is their Happy Hour and Reverse Happy Hour. Smoking deals on basic sushi and beer. The other thing I enjoy is their speed of service. Their sushi comes out fast! It's not the best but it is a good value, especially if you catch those HH or RHH deals.  Shrimp and Crunchy rolls are my fav. Decor is decent and contemporary but nothing outstanding. Oh, one more thing I like, they are busy which in the Sushi world comforts me in knowing they are moving product so its fresh and not last week's fish!"], ["barbara m.", "If I could give this place zero stars I would.  Terrible service.  Waited outside in the patio for 15 minutes and no one came out to greet us or give us water or take our order.  There were plenty of employees standing at the bar talking to each other and watching tv.  We left.  Terrible service.  We come here a lot because it's 4 miles from the house.  But with terrible service like this we won't come back.  You shouldn't treat your customers like this. There were not many customers either so that wasn't the problem.   I will not be coming back. You have lost a costumer."], ["Heather H.", "This place has a great Happy Hour menu with good food and prices! The Teriyaki beef ribs are a must try, very tender. Service is always quick and friendly. We've visited with our family 3 times and will continue to come back."], ["Chelsea G.", "Let's start with the fact I worked in sushi for 4 years... This review is for the food not the service. I got two rolls for roughly $18 and they were so small. The soft shell crab aka spider roll tasted burnt. There was only a small amount of rice on the roll as well. The rolls were bland with not much going besides the sweet unagi sauce flavor. On top of this they don't have any special sashimi dishes tuna tar tar or bbq albacore which is my favorite. I'm super disappointed because this place had pretty good ratings. Maybe the sushi in Cali is just better"], ["Adam C.", "The food was amazing and the the service was great as well. I wish i the waitress checked on us during the meal, but thats because i wanted to tell her how good the food was. Thanks for great food."], ["Shane C.", "The fish is very fresh. The sushi chef's are very knowledgeable and personable. They also have a killer happy hour including different rolls and sake bombs. My girlfriend and I do sushi night once a week and we don't usually venture away from this place. If you are not into the raw stuff they have amazing fully cooked dishes as well."], ["Yvonne H.", "Best neighborhood hole in the wall.  Great food, portions, price and service.  I WILL be going back."], ["Sarah Z.", "Went in for the first time tonight. Sushi was not very good. They were mostly all rice--I didn't enjoy anything except the seaweed salad. Service was pretty bad too."], ["Sean S.", "I stopped in to this location with a co-worker for a bite during lunch.  Always on the lookout for good sushi, we decided to give this place a try.  The results were less than stellar.We both felt the service lacked somewhat.  Not on the server side, but on the food delivery side.  We both felt the service was sort of slow, despite the restaurant being mostly empty.I ordered smoked salmon nigiri, seared tuna tataki salad and a baked scallop roll.  The Tuna salad was large, but seemed to be doused in a lot of sauce that was sort of vinegar-like.  It was too much for me.  Additionally, the tuna was brown with visible white connective tissue veins.  I did not finish this dish.  The baked scallop roll was one of the lessor examples of the dish I have had.  Using what appeared to be regular US-style mayo, straight, and little, if any additives made for a roll that any untrained person could execute at home without any flair or problem.On the flip side, the smoked salmon nigiri was tasty and well portioned.I also ordered a desert I had never heard of, tempura or deep fried cheese cake.  This peaked my interest and I explored.  Once delivered, it dawned on me that I was looking at a close cousin of a churro drizzled with chocolate sauce and whipped cream (see a photo I have posted).  It was initially tasty, but lost its attractiveness as I consumed more.  It's high sweetness load, combined with the outer \"fried\" layer made for a bad finish.  This is a desert that would probably appeal more to children at a party.Overall, not my best sushi experience, but not my worst.  Since I always believe that everyone has a bad day, I will keep this one on my second chance list."], ["Deborah S.", "I live in this area, and have always seen this little joint by the Target and wondered about it. When a girlfriend at work wanted to go for Happy Hour I decided to pick this place- one for its proximity and two, for the fact that their Happy Hour goes until 7 pm. For a workaholic like me, who doesn't ever know if I have to stay late- that's totally a WIN. So me and my friend roll into here at the tail end of happy hour and it's pretty busy. Clearly the locals are in the know about the happy hour deals at this place. We wait a little while- not too long, and get seated in our own little booth. There are two sets of menus- the happy hour one, and the regular one. We order off of both and wait for our food to arrive.First off- cocktails. She got the sangria, I got the Tokyo Tea. Both are great- the Tea is DEFINITELY pretty strong, so be warned. It's apparently their version of Long Islands, with Midori added. Good to know. I lucked out with it being good- the cocktails had no description and so I picked blindly, hoping it would taste decent. The sushi came out very promptly, and was decent for sushi. Nice portion sizes, fairly fresh. I unfortunately can't remember what exactly we ordered, though. Interestingly enough, we note after we finish our first plate of sushi that we're missing some. We flag down what I'm pretty sure is the Lady Boss, and she apologizes profusely- and brings back out for us the Happy Hour menu. Even though it's actually AFTER happy hour at this point. I was quite impressed, to be honest. But we tell her no, we had orders on the regular menu, and she brings that out instead, we mark down what we got and reorder again. This had a bit more raw fish- I believe we got the Cherry Blossom roll, and the... white something? My memory fails me, but it had white tuna, and mayo, and was awesome. I also got my standard Ikura nigiri, and that too was okay. It can be too fishy if not fresh, but this was good. For all the sushi we ate, and the drinks we drank (we got an appetizer AND miso soup as well) it only came up to about $30 a person. Pretty gosh danged decent, given that us two ate enough for 4 people. So definitely worth a stop in, and for me- repeat visits, if only because it's so close to home."], ["Barnabas L.", "HAHAHA,the place is exactly what i thought. I wanted to try this because hey...i want to give all new places a shot before passing judgement.When we went in no one sat us down for 5 minutes, but it was completely empty...finally a hostess came sat us down and then didn't bring us any menus...I was fed up so i got up and grabbed menus myself from the hostess stand.Just by looking at the place i knew it wasn't going to be good. The salmon was warm slimmy and rubbery...yeah three traits your \"fresh\" seafood should never be..guess what happened 4 hours later...I will spare you the details and let your imagine play.Anyways, pretty typical poor quality sushi place, with inflated prices. They don't even use real crab for their quality roles. Whatever gets the suckers to come in and spend money thats fine..won't be back...second chance has been revoked for this place"], ["john s.", "Great surprise in the hood , no more driving to Scottsdale , tried several rolls , all well prepared , and happy hour 4-7 and 8-10 ., I'll be back!"], ["Melinda W.", "This place has great lunch specials! I've been a few times with my friend and we've gotten a ridiculous amount of sushi, miso, an appetizer, and tea for about $15 each. The service can be a little slow, but the sushi is tasty and you can't beat the lunch prices."], ["Morgan G.", "Food is pretty good, service is sometimes slow, which is why I gave 4 stars. Happy hour is great..till 7! Gets pretty busy around 630, so try to get in before then. Staff is friendly, but you need to get their attention most of the time to get things. We go back often, so definitely try to go if you are low on funds but want a decent sushi place."], ["Stacey K.", "I'm not a sashimi girl so no review on that but the rest of their food is consistently DELICIOUS. I live close so am a frequent patron.  Service is always good, really friendly and cool like you want them to join you for a cocktail and chat. Dig the atmosphere too."], ["Tyler M.", "Pretty decent little joint.The staff was very pleasant as we came for a round of sake bombers ($5) and a few rolls during their reverse happy hour which starts at 8! Even though the venue is small they have a nice environment and the food was very good. I will definitely be returning to this sushi bar for their delicious sushi rolls and happy hour menu,"], ["Kim C.", "We have been coming here just about weekly since we found this place last year. I enjoy the salmon sashimi as well as the cucumber salad. The crispy spicy tuna is very tasty with just the right amount of spicy and sweet with the jalapeño slice on top. Yum! The service is fast and friendly."], ["Sam S.", "We stopped in on a Wednesday night around 6:30pm- the end of the happy hour which is from 4-7pm.  We ordered crab puffs, 4 happy hour rolls and a sake sangria.  A few minutes after the server took our menus he informed us they were out of crab puffs.  We said that's fine and did not order a different item to replace it. The sangria took about 5 minutes but was ok when it arrived- not too sweet.  Very drinkable.  We got 2 if our 4 rolls out after 30 minutes.  The Las Vegas roll is typically one of my favorites but this one was room temperature and the tempura was slightly soggy.  The Philly roll was typical.  Our second 2 rolls came out after we ate the first two.  The crunchy crab and spicy tuna were both just ok.  Something really small that I did notice was the nori seaweed wrapper seemed chewy-er than I've ever noticed before. All in all- I didn't hate it but they don't even have to cook the food!  It should come out quicker then that!"], ["Kayla S.", "I've been to this restaurant a couple of times and overall their bento boxes are very good. A great source of variety. The only thing that sometimes can get bothersome is the noise level and how crowded it gets in there."], ["Gabrielle C.", "Every since moving to AZ I have been in search of a good sushi spot and this is it! Great sushi, attentive staff, and amazing happy hour. I have and will continue to recommend Sushi Style to my friends."], ["Sandy B.", "Great service from Ashley, we had lunch on the patio. Fresh sushi and great beer, highly recommended."], ["Eddie M.", "Been here several times with friends. LOVE it. Not outrageously priced for sushi. Even when packed, great, fast and friendly service. One of our favorite sushi spots in town!"], ["Jonathan H.", "Not very good I've eaten at many sushi spots at various places throughout phoenix and this was one of the worst it's not that it's terrible tasting or that the service was bad it's just the food was not very good"], ["Sarah H.", "Great!Their happy hour prices are very reasonable, and the $3 salmon nigiri was delicious!Plus- they had a lot of \"cooked\" sushi options for my mother who is scared of raw fish.  Silly mom."], ["Celeste C.", "Food was alright, service was horrid not sure if she had a problem with serving us but coming from someone who works in food business I was not impressed. We observed her being way nicer to other guests and also she acted as if anything we wanted was an inconvenience. Probably won't be returning."], ["Jasmine J.", "Stopped in at Sushi Style for the first time this past Tuesday for Happy Hour with the hubby. We loved it so much that we went back last night for reverse happy hour!! The hubby is rather new to sushi but really enjoyed the cream puffs,philly rolls and spicy tuna rolls. This is a good place to go if you are an experienced sushi go-er or if you are a beginner. We also enjoyed the full bar. He had 3 saki-bombers and I had a rather strong martini ;)Stop in and ask for Alex. Prices outside of happy hour aren't bad either."], ["Marcia G.", "Time for selfish confessions.  I have purposely not reviewed Sushi Style because I didn't want to share my fantastic find which would possibly lead to bigger crowds, longer wait times, and less sushi for me.  I said I was selfish...  It all began when Kampai, my favorite sushi place for over ten years, sold to new owners.  The search for a new place led me to Fresh Wasabi at 6645 West Bell Road.  After enjoying a wonderful omakase experience with owner, Masa Kim, I was confident that I would become a regular there.  When I mentioned this to Masa, and lamented the distance from my house to Fresh Wasabi, he advised that he owned another restaurant that was closer to my home called Sushi Style.  I literally went to Sushi Style the very next day and many, many days since.  If I am not there once a week, I begin having withdrawal symptoms.  The most I have gone is 4 times in 7 days and I am not ashamed to say so.  I would venture to guess that I have been to Sushi Style over 100 times in the past year.  What's so incredible to me is that I have never had the same meal.  Every visit is unique, amazing, and delicious.  I rarely order anything unless I am having a serious craving.  I feel completely safe in the hands of all of the sushi chefs.  Kevin, Danny, and Rafael have all created unique chef's choice dishes for me that were fabulous. Some of my favorite bites include:  Hamachi Kama (aka Yellowtail Collar, a cut of fish that many throw away, seasoned and grilled or broiled, served with a delicious dipping sauce and lemon); Asian BBQ Ribs (not listed on menu, just on a tiny sign near the hostess stand, but almost always available); Shishito Peppers (only one in ten is spicy hot, sauteed in the most delicious sauce and topped with bonito flakes); and White Hawaiian Tuna Ceviche Style.  I have made so many great friends here. It is not unusual for me to know every person sitting at the sushi bar on a given evening.  I tell anyone who will listen that this is the best sushi bar in town.  I can't tell you how many people I have sent that came back to me bragging about the wonderful experience they had.  If you like Japanese food made from scratch with authentic flavors and lots of love, then take my advice and get your butt in here."], ["Mike S.", "Worst sushi I've ever had. I didn't think it was possible to have bad sushi, unless of course it caused you to become ill. But this is the first time I've had bad sushi."], ["Catherine B.", "Came in for a late lunch on a Wednesday afternoon. Waitress was super sweet and helpful! She recommended the double climax roll, it was a little pricy yet amazing. For our appetizer we had the baked muscles, which were perfect! Also had the crab claws (they gave two big pieces of meat on each roll) compared to other sushi restaurants we were pretty happy about that! Of course, spicy scallop rolls were amazing too. We went at a perfect time, because it was pretty empty and we had extremely quick service. Definitely will come back again."], ["Elizabeth M.", "Sushi here is A+ ; come here during happy hour though that's when you'll get the best value for your dollar! Plus the happy hour menu is awesome."], ["Denisa W.", "Not the best in town, but we will definitely be going often to the happy hour as it is very close. The salmon was delicious melted on my tongue. The Philly roll was probably one of the best I've had at any of these west side sushi places, even better than Yen. Yen has asparagus in it which makes it weird. They have cucumber AND avocado. Any Philly roll fans would say that's a little piece of heaven. Very clean inside and staff is attentive"]], "Nori Sushi and Asian Kitchen": [["Greg G.", "Great sushi and friendly staff.  I have become a regular to the point where I can sit down and will have a Yamazaki served neat ready for me.I generally get the Sushi Omakase (or the Chef Sashimi Platter according to their menu), but have sampled almost everything on the menu.The green tea waffle is a **must eat** if you can fit it in your stomach.  Don't share it (you'll understand after your first bite)!"], ["Toni S.", "Absolutely best sushi in Phoenix. Food is always consistent. Price is very fair. Lunch specials are awesome and fish is always fresh."], ["Justin L.", "Great sushi.  Great atmosphere.  Well worth the trip.  And yes I will be returning.  Jeanette was amazing and made the experience that much better!"], ["Lindsay C.", "This place truly deserves MY five stars. World class service and delicious sushi is the blanket statement, here are the details:Went to Nori on a blind date, I arrived first.Staff:I was promptly greeted and seated (within 30 seconds of arriving). My waitress introduced herself-- she had a stellar personality and I told her I was on a blind date. She courteously offered to \"check in\" with me as the night progressed to ensure I was comfortable, and she held to her word! Several times she'd pass by and look at me, I'd smile back. Everything we ordered came out quickly. Both she (our waitress) and the person I assume was the manager, poured the sake for us, even refilling our glasses as needed. She was truly one of the BEST servers I've ever had the pleasure of dining with. Food:I like my rolls nice and tight. We ordered three rolls: a spicy tuna, a spicy salmon and a yellowtail roll. All of them came out at the same time, all of them looked absolutely perfect. The fish was fresh and light, as it should be in sushi. The edamame that we ordered as an appetizer came steamed and warm (as it should be) and was perfectly delicious. My date ordered a bottle of cold sake (~$20) and we liked it so much, we ordered a second one, haha! Ambiance:Beautiful layout, with patio, booth, table and sushi bar seating available. Ambient lighting and music throughout the restaurant. Restrooms were clean and well stocked. Gave off a fine-dining vibe without too much fuss. I don't often rave, but when I do... it's for a place like Nori. It's a bright, sparkling example of how dining establishments should be."], ["Roxy H.", "Nori may be on of my new favorite sushi places in Phoenix... I was a bit skeptical walking in here the other night and had pretty low expectations because of its location in Desert Ridge. But alas I was pleasantly surprised and had an absolutely fantastic meal here - drinks, food and service were all on point! For dinner we ordered a bit of everything -  We started off with some Nigiri, Tuna, Salmon and yellowtail. All 3 selections featured surprisingly fresh fish and the rice was cooked perfectly. It wasn't gummy and didn't fall apart. The Seaweed salad was solid. For rolls we ordered a Poki Poki which featured their house speciality tuna poke and crab. It was recommended by our server as one of her favorites and she didn't disappoint. Soft Shell Crab roll was flavorful as was the Salmon Skin roll. We ordered a bottle of their unfiltered Sake which was placed in an ice bucket on the table to ensure that it was kept cool and their Strawberry lemonade Martini was to die for! I will def be back!"], ["Sarah Z.", "Brought out courses backwards. Food was ok. We have come before and enjoyed it. Hopefully this is just a hiccup."], ["Tyler C.", "Great food and ok service. The manager is rude to the staff and that is why I only gave this restaurant a 3 out of 5. Overall great restaurant with ok service."], ["Brenna M.", "First off, THE PLACE IS INSIDE THE MALL. I'm from Iowa Visiting Arizona and I spent a really long time trying to find this place. After 10 minutes of trying to find it, I went with my gut and looked inside the mall. It is by the islands which you can see from outside the mall. Our waiter was very informative about the sushi and came out with our drinks and food promptly. We got 3 different rolls, edamame, udon noodles and ALL of it was amazing!!!!! I need to go back here next time I visit Arizona!"], ["Michelle F.", "I have been here several times. It's always a great experience. And I love sitting on the patio"], ["Tarik A.", "Unexpectedly amazing!  The location is good but the food and service is consistently great.   Being new to sushi, I like it when the server is friendly and offers helpful hints asking us what we like.   These people take care of their guest and the server checked on us to see how we liked out first few bites.   We loved it, but it was great knowing they were on top of checking.In Desert Ridge they could be probably be average and stay busy, but they raise the bar for other places.   Will definitely return.  (P.S.  don't forget to check-in for the edamame app)"], ["Drew H.", "I love sushi...Who am I kidding? I love food!  But sushi is towards the top of my list when I'm deciding where to go to dinner.  So when I searched for new sushi places near me, I found Nori.  The reviews seemed good, and the recommendations were right up my alley.Had a little trouble finding the place, since the address directs you basically to  Desert Ridge Marketplace, but to the corner of Deer Valley and Tatum.  Ended up calling them after driving around for 5 minutes without having a clue where to go.  When we got there, the patio had a couple tables open and the inside was half full, so we decided to sit outside.  I took advantage of the check-in free edamame and we looked over the menu.  I love tuna poke so the tuna poke roll was a must have, along with the softshell crab appetizer and another of their specialty rolls.  The server was incredibly nice and attentive.  She came by several times to fill up our water, and make sure we didn't need anything else.  I'd give that part of the experience 5 stars.Now for the food.  The tuna poke roll had crushed Doritos on it, which was an unnecessary addition.  Plus they were stale and just stole from the taste of the fish.  The softshell crab, which I've had at other sushi restaurants, was bland and the mango salsa it came with was hardly salsa at all.  It was more a salad, sans lettuce.  Just large chunks of cucumber, tomato, mango, and red onion that had very little flavor.  I think the biggest reason I gave this place only 2 stars was the price.  We had two rolls and an appetizer, without drinks, and walked out of the place for $50 after tip.  Hardly the price point I search for when it comes to so-so food.  Unfortunately, I don't see myself coming back to this place."], ["Max R.", "I would give them a better review if I ever recieved my food. We waited 40 minutes and nothing came out. The place seems pricey for mall sushi. I would recommend Cafe Hiro in Scottsdale if you want decent sushi."], ["Kyle L.", "I want to say it was great great sushi restaurant in Arizona.  Everything is awesome and service is also wonderful."], ["Michael T.", "Absolutely amazing place a must check out if you haven't already. All of the staff was very friendly and had an answer for exert question I had. The fish was very fresh and made promptly after I ordered. Great kids menu and awesome happy hour. Will be returning very soon for more sushi and drinks"], ["Anthony B.", "Where do I start?  Sushi arrived before my 8 year daughters child plate.  Waitress mentioned that it was because I ordered raw fish.  Waitress brought my straw with her fingers on the straw where I'd place my lips.  I first thought I overreacted with the straw thing until I visited the men's room.  It was was too nasty for an establishment that serves food....considering the straw thing.  Lastly, a neighboring waitress was more friendly than my own waitress. Bad experience.  Enter at own risk...."], ["Harriet S.", "Love this place...great service and the sushi was fabulous. Everything very fresh and flavors were superb. Nori crunchy roll was really delicious. Will definitely be back as we travel to Phoenix regularly. Deserving of all 5 stars!! Highly recommend."], ["My N.", "Went here for the 2nd time. I went during lunch.My thoughts have changed for this place. I realized how overpriced they are. If this place didn't have the nice, clean, and modern setting with beautiful decor... it wouldn't be any different than any other hole-in-the-wall type sushi restaurants.Some of the food is unique and tasty, such as the ahi poki tuna, but it so very  expensive for what its worth. 4 very small pieces for ~$12 is expensive for what they claim as a \"main dish.\" I think if they served around 6 pieces, I wouldn't be complaining. The bento boxes are a rip off, IMO. Salad is okay. Gyoza is nothing spectacular. Tempura is greasy and battered up. Rice is okay. Nothing spectacular. Nothing disgusting, either. Just a bit overpriced.My husband and I spent around $50 for LUNCH for 2 bento boxes and the ahi poki tuna. RIP OFF, if you ask me. If you compare it to other decent sushi restaurants, $50 would probably get you almost 2 separate meals during lunch for 2 people instead of just 1 at Nori. It's all about value. And this place... is not up there on my list. Sorry. Money not well spent."], ["Nick M.", "We went on a Saturday for lunch, got two of their noodle dishes (udon soup and the sautéed udon) and two plates of sushi. The sushi came out fast but we literally waited 30min for the noodle dishes and there were only three other tables of people there. The sushi tasted fine but fell apart easily upon being picked up. The noodle dishes were good however their primary vegetables that they seem to use in a lot of the hot dishes are: asparagus, bell peppers, zucchini, and button mushrooms. There were no Asian veggies at all (ex. Bok choi, Asian turnips or mushrooms, seaweed for the soup) so the dishes were kind of like Panda Express, except even less traditionally Asian if you can imagine that."], ["Lisa B.", "My girlfriends and I had a lovely time at Nori.  Our waitress was adorable and very attentive (I wish I remembered her name!)  We loved the happy hour drink specials and the check-in perk of free edamame.  Thanks, Yelp!  The salmon sashimi is the reason to go here.  It was amazing!  I still think about it.  Delish!"], ["Jeffrey C.", "Nice people, especially Brianna. Very clean and well organized. The four tvs don't hurt. The indoor/outdoor seating makes the experience fun."]], "Number1 Sushi": [], "Sushiholic": [], "Yasu Sushi Bistro": [], "Ginban Sushi": [["John K.", "Eat here. I could stop the review with those two words but I'll add a bit more color. This is hands down the best sushi spot in Phoenix.  I've tried way too many of them.  After a while I got to know the owners, Kenny and Vivian, and they're very nice and accommodating.  Kenny was always willing to make a special off-menu dish (I never asked for one if they were swamped) and they sometimes have specials you won't get in most places, like the time they had a fresh sea urchin (delicious).  Also, get the fresh (real) wasabi.  You won't regret it.  Alas my time in Phoenix ended (a while ago - somehow I forgot to post this review) and this spot is what I miss most.  If you see Kenny and Vivian, tell them I said hello."], ["Kelly V.", "The major downside of this restaurant is that it's extremely far from my house.  :(  We stopped here for a bit on the way to Tucson and I'm so glad we did.  Rolls were fresh and creative.  Service was excellent.  We had the Banana Mama roll and while it's not my favorite roll, it is possibly the most creative roll I've ever eaten.  Prices were very reasonable and it was a great value."], ["Alison T.", "We've been here enough times that I can update this review. This place is so damn good! Our last experience was a little disappointing because my boyfriend got a cross contamination allergy reaction but I blame us for that. We should have reminded them that he needs his sushi prepared away from any shellfish. We've basically tried all the sushi rolls that are without shrimp. All wonderful! They even told us we could always pick any roll we wanted and they could swap out the shrimp for another type of fish. Very cool. We'll be back for sure!"], ["Allison T.", "Very impressed with the sushi rolls (golden spider, spicy girl, ginban) and love boat for 2 (sashimi and nirgiri). Fresh fish and nice atmosphere inside!"], ["Maria M.", "Great food, but some of the servers are a little slow.  The core staff is awesome, but they seem to have done problems with new servers."], ["Leslie M.", "We stumbled upon this place on New Year's Day. It was pretty difficult finding a restaurant that was open on this day and on our way to the Chandler outlets.  We stopped at a restaurant before this one and it was jampacked! I was not about to wait so I found this place - luckily!When we walked in, the restaurant was empty. I was surprised because the ambiance is trendy.  I didn't care though and proceeded to order the Volcano roll and Hawaiian roll.  Both were fabulous! I also ordered the tempura red bean ice cream and that one was a fail.  The bowl that it came in was too small and the ice cream was so hard that it felt like it was in the freezer for months. However, the sushi did hit the spot and they probably saved me from eating at a chain fast food restaurant (yuck).  If you are in the area, I definitely think you should try this place!"], ["Claire S.", "The best sushi place in the town!!! Their sushi are fresh and so delicious. Staffs are fast and helpful. Love it!!!"], ["Tyna T.", "I have a love hate relationship with this place. We tried it for the first time on SAT on the way back from the outlets. The younger gentlemen who greeted us was super friendly, sat us right away and brought our drinks over right away too. However, he was the ONLY part of the service that night that was good. The waitress who took our order seemed new? She didn't know what agedashi tofu was and didn't seem very happy to be there and neither did the other two waitresses (one of them being the owner). However,  I will say that the food is great! This is probably THE BEST moderately priced sushi you will get in AZ. I'm from Hawaii so I know fresh sushi/sashimi! : ) We ordered the following items.APPETIZER: Agedashi Tofu - this was EXCELLENT! VERY lightly battered, perfect crisp and the dash broth surprisingly was the perfect soupy consistency and not too salty!SUSHI: We ordered the Spicy Scallop Sushi (Gunkan), and the Sweet Potato Tempura Roll. The Spicy Scallop was pretty fresh, no the best I've had but definitely not bad. The consistency of the rice here is fairly decent! The sweet potato roll I could love it or leave it. The sweet potato was crispy and delicious but I think because it was piping hot when it was rolled up, it ended up heating up the rice a bit and making it a tad mushy.BENTO: We ordered the Combination Bento Box with Salmon and Beef Teriyaki. It came with a full size California roll. The roll had very little rice which I can definitely appreciate and the inside was STUFFED so the bento box was a great deal!! It also came with miso soup and a side salad.MISC: We decided to try the Shrimp Yaki-Udon. The udon could've been a bit more al dente but overall, not too shabby at all!!As the evening progressed our wait staff became more friendly which was nice and the busser (who was also the one who initially greeted us at the door) was super diligent about drink refills and taking away the dishes we were finished with.In regards to the decor, it's very chic! It's a new spot so it's super clean. The interior finishes are all very modern and the both times we've been here it's been a nice and quiet dining experience. I'll definitely be back!! : )"], ["K J.", "I can't believe how dead this place was on both of my visits this week. Please help support this place. Good sushi is had to come by."], ["William L.", "Went with the family on Sunday for sushi and grabbed the love boat for 2 with some happy hour rolls (salmon skin, and snow white roll). Overall, the salmon was deliciously buttery but the snapper tasted a bit funky. The Snow White roll was great incorporating snow crab but the happy hour price ($9) didn't make me that happy with every other roll on there being around $4. I think the highlight for me personally was the salmon skill roll which is normally hard to find in Sushi places around Chandler (or they make the recipe kind of odd, or taste burnt).Overall, I would probably visit again but try some other rolls and stick with Salmon for deliciousness."], ["Miranda H.", "I live right down the street from this restaurant and drive past it constantly so my boyfriend and I thought we would give it a try. They also have happy hour all day on Sunday's, so that helped swayed our decision. After waiting about 20 minutes for our food, I ended up getting the Crazy Roll and the boyfriend tried the Dynamite roll. The Crazy roll was supposed to be spicy, but it actually turned out to be extremely sweet and not what I was hoping for at all. Almost had a banana taste to it. I thought  his Dynamite roll was delicious and wish I would have ordered that instead. Also, even though it says happy hour all day on Sunday's, the speciality rolls are only 20% off AFTER 8:30 that evening. Made this mistake of not reading the fine print."], ["John L.", "Great lunch spot.  Quick service with lots of options for a reasonably priced meal.  They also offer fresh wasabi which had me crying!   Miso soup and a salad with all the lunch specials."], ["Timothy R.", "Great place!  I have finally found a place that make a roll similar to what I would get from Sushiya in San Diego.  The roll from Sushiya is called a snowball and the one at Ginban is a Crazy Roll and Ginban's roll is even better!!!!.  I also got a Philadelphia which everyone makes the same so I knew it was a good comparison to start with.  WOW I think I just burst my own bubble...  Well after some looking it seems that other places have a similar roll to a Snowball but call them Jalapeno rolls (deep fried, Inside: Jalapenos, crab, and cream cheese.  Topped with spicy mayo, eel sauce, green onions and masago.)  The only difference with Ginban is that their Crazy Rolls has crunchy spicy salmon, avocado on top.  Everything else is the same.If I had to choose between RA and Ginban I would pick Ginban every time!  I liked the feel of the place much better and the quality of the sushi was better too.  Ginban is going into our rotation of regular lunch spots."], ["Jen A.", "What does my daughter want after a long day working the home show? GINBAN! I can't go there without getting perfect sushi. The tempura is perfect. The rolls are perfect. I'm so glad they're practically next door! Thank you for maintaining your quality and service visit after visit! I highly recommend that people in Ahwatukee give you a try. OVER AND OVER!!!"], ["Dimitri P.", "Very fresh ingredients. This is the best sushi take-out in Ahwatukee, we order way too often from this place... Make sure to always ask for what the chef/owner recommends for the day. If you like a spicy sushi, ask for the Evil Roll, it's not on the menu.Sunday all day happy hour!"], ["Jeff W.", "Awesome!  Great sushi quality and reasonably priced.  We ordered the sushi and sashimi combo and it came with the Ginban roll.  Both dishes were excellent and the presentation was beautiful.  We also  tried the crazy roll.   It's piled high with soft shell crab meat.  My wife loved it. The staff was very attentive and the facility is clean and beautifully decorated."], ["Chris B.", "This was dead. I understand it's a Wednesday but there was a couple and me that's it. Staff was super friendly. I wasn't impressed with the selection of rolls and lack a sashimi combos. Most of the rolls I ordered were dosed in sauce.  Not fair to write a review of the place a week after I had the best sushi of my life in New York."], ["Hideki M.", "This is not Japanese sushi restaurant. This is Korean sushi whatever. The waiter is an idiot and sushi chef never greet customers. I will never come back again."], ["A R.", "Decided to try Ginban after reading many positive reviews.  My boyfriend and I have been looking for a decent sashimi place.  We ordered the sashimi deluxe, and since it happened to be happy hour we also ordered a ginban roll, spicy salmon roll, and seaweed salad.  The sashimi deluxe included seven different kinds of sashimi, three pieces of each kind.  The quality was average for Arizona-- a couple of the pieces did not taste very fresh.  However, the price fit with the quality as it was only $24.  The ginban roll was similar to what you get at asian fusion restaurants; the spicy salmon roll was below average; the seaweed salad was above average.  The service was average.  There was only one server working.  She checked up on us periodically, but was not very friendly.  The atmosphere was nice for a date, although it was very quiet (almost too quiet).  There were three other couples eating while we were there.  Overall, I would eat here again--but it would not be my first choice."], ["Rejane M.", "The BEST sushi in town!! Love itService is very good, place is clean and the fish is very fresh ... The sushi is so tasty !! I'm a happy girl!!"]], "Delux": [], "Sushi Brokers": [], "Nobuo At Teeter House": [["Margery C.", "Definitely one of the best Japanese restaurants I've been to in Phoenix, if not the  best restaurant I've been to in Phoenix.AMBIANCE: 5 starsCozy, great lighting, great for dates or small groups. Situated in a historic home which makes the location much more enjoyable.FOOD: 5 starsWow! Yellow tail hamachi with grapefruit, the clam soup, uni and oyster... EVERYTHING is fresh and combinations will melt in your mouth SERVICE; 5 starsPlaying, delivery and overall service 5 stars all around.It's Nobuo and not Nobu so I did not expect much, but if I had expectations of this place it would have surpassed it."], ["Mona W.", "Food does not disappoint. Flavors are refreshing. Chef did a good job of incorporating innovative elements into traditional Japanese ingredients. Dishes are tapas style all meant to be shared. That said, I do find the portion on the smaller side. If you have more than 3 people in the party, you might need to double up on some dishes. Also, food is served in courses rather than tapas or izakaya style.Do save room for dessert and don't skip the cocktails."], ["Renee U.", "I absolutely love this place. Great ambience, very quaint in an old Victorian house in the heart of downtown Phoenix by their museum.Their food is truly innovative and a true foodgasm.90% of their dishes covers all those basic 5 senses (sweet, sour, bitter, umami, salty), making their dishes well balanced and an explosion of flavors in your mouth without thinking, let me add a pinch of this or that to make it better.Here are my recommendations: The presentations were just as good as the flavors!!! Watermelon and goat cheese - so fresh and delightful, great startersHouse cured salmon - amazing!! Left me wanting moreGrapefruit hamachi - again, wow...keep them comingSashimi plate - a spoon of each amazing and heavenly flavors!!! Love!! Shiromi carpaccio- wowshers!Yellowtail ceviche - love!! Soft shell crab salad - tastySeabass and mushroom in parchment paper was good as well but I like all the other dishes significantly more Overall- the flavors for their dishes are divine!!! Top notch in creativity, flavors and presentation.5 stars all the way!!"], ["Clarissa S.", "The food here was beyond amazing. I took my friend here for her birthday and figured we would try something different & we were not disappointed. The flavor alone is something to rave about! The only down fall is we we on a time crunch and wanted to share the 7 course dinner but the waiter said we couldn't do that. That's the only reason for one less star. We were going to share everything anyways but we understood and just picked other dishes. The waiter was well educated in the menu & we often turned to him about what to order for drinks & dinner menu. We loved every dish that came out. We loved the small quaintness of the house and overall enjoyed everything. The dessert was superb! It is a bit on the pricey side but well worth it. Per other reviews I thought I would not be full but to my surprise we left very satisfied. Can't wait to return and try some other things on the menu!i"], ["Clémentine C.", "This lunch was absolutely amazing. We stayed only 48h in Phoenix but were delighted to find such delicious Japanese food there. All dishes were perfect, nothing to complain about. Would totally recommend this place!"], ["Amie P.", "Charming house converted into a restaurant in  downtown Phoenix with complimentary garaged parking nearby. I'm not sure the quality of the regular food menu yet the bento box dinner entree during restaurant week was good, not great. The bento box was a seafood or meats selection that ranges from ahi slice tuna, grilled mackerel, pork wrapped bun to medallion beef filet. It was a nice assortment of choices yet not the best quality for a 30 year Japanese chef.The waiter was friendly and attentive yet the food runner was the complete opposite. They failed to properly provide a detail description of items being served and ran off faster than a bull in Spain. I think proper training could be implemented in this area of service.The decadent desserts offered is what brought my 3 star rating to 4 stars. The robust blended flavors of berries on top of a well prepared graham cracker crust was the desert of choice. A truly divine creation! The carmelized tofu topped with candied sweetened popcorn was unique and creative but not a favorite."], ["Faye S.", "Very creative but a bit of a lack of flavor love the ambiance. I would come back for a date nite cocktails looked awesome"], ["Dori B.", "Bad day for lunch today. The service was slow and uncaring. There was only one other table seated at the time. Our entrees  came out after 30 minutes of waiting. The dishes were dropped at our table and no one checked back with us. My seafood pancake was clearly  burned.  My friend's  crab sandwich was served with a tiny portion of slaw, about one tablespoon of cabbage. It looked like a joke. We were expecting  graceful, beautiful  plates of food and were  presented with overcooked, sloppy looking plates. I complained about my burned pancake and was told that the chef meant to present it that way, and I was confusing  the dark sauce with burned food. Over all it was a sad and confusing  lunch that left little to be desired."], ["Abraham Q.", "Just astounding!! On our way back to El Paso from California, we stopped at Phoenix to get some lunch. We saw this restaurant on Yelp and considering I love Japanese food we decided to stop. The restaurant looks like a small cozy house. We were seated quickly and the waitress/hostess was very nice. As an appetizer we ordered a sashimi which came in four little scoops meant to be eaten in one bite. As soon as I put it inside my mouth, a burst of flavor exploded inside it. Spicy, sweet, fresh, bitter, and savory all mixed into one. For entree my party ordered a shrimp salad (I forgot the name of the dish), Okonomiyaki, and a Chicken Catsu Curry. I got the chance to try both the Okonomiyaki (which was the plate I ordered) and the Chicken Catsu Curry. The Okonomiyaki is a savory Japanese pancake. Mine had shrimp, Japanese mayo, and eel sauce as well as an assortment of other veggies and herbs. The other entree was very delicious as well. The chicken was breaded and lightly fried and it created a wonderful sensation when combined with the white rice and curry. Lastly for dessert l had the special for the day (they only had one dessert). It was fritters accompanied by strawberry jam and miso sauce. The fritters were just the right amount of crunchy and they tasted sort of like funnel cake from a fair. Overall it was a very pleasant experience eating lunch here, I'm sure the dinner menu is even better, and I hope I can come back again to experience it."], ["Elizabeth S.", "I crave grapefruit and hamachi all the time. And soft shell crab. Ohhhh those noodles in fish sauce? Holy heaven in my belly. I first heard about this place years ago, and after venturing downtown and showing up early once on a whim, and then the other time making a reservation on like a Wednesday a week in advance, I've never had an issue. I actually wound up getting a science center membership? Just to eat here again. I know I know, seems silly, but I just love it. And I'm planning on going one more time to make my membership worthy!I usually end up getting two orders of things, as they are decently small portion sizes, but quality over quantity is definitely the case here! It's a pretty romantic spot, I do usually get claustrophobic in downtown, but this place? Nope. Maybe it's the food.... The food is my version of Xanax. Till we meet again my lovely teeter house!"], ["Holly M.", "The Shiromi Carpaccio is a MUST. One of the best things I've ever had. The Grapefruit & Hamachi was incredible. I was not a fan of the Chicken Nanban, which was disappointing since it was the largest course we ordered. Overall, the flavor profiles (at least of the fish-based dishes) were unique and SO delicious. This place is certainly pricey, but absolutely worth it. Most dishes are around $20, and if you're ordering from the front of the menu, those will each only be about 2-4 bites of food. But the food is amazing quality, and unlike anything I've eaten before. I just wish I could afford to eat more of it ;)My husband and I shared 4 courses from the front of the menu (\"lighter\" fare), 1 course from the back (more substantial), and a dessert. We certainly weren't stuffed by the end, but felt comfortably full.The staff was great, the atmosphere was quaint but left something to be desired. But I will forever crave the Shiromi Carpaccio, and my husband was completely thrilled by the birthday dinner we had here. Highly recommend this place for a special occasion (but I wish we could eat here every day!)."], ["Salman M.", "The setting is warm and inviting. Nobuo is located in an old house in downtown Phoenix. It is walkable to the Hyatt, Sheraton, Westin, and other hotels in the area - so if you are visiting from out of town - a great place to go after work. Everything on the menu was delicious, it was prepared well and the presentation was super. See attached pictures. We ordered a variety of items such as Oysters, Grapefruit Hamachi, and House Cured Salmon. We were a large group of 8 people from out of town for work - with that size of a group, the food was expensive, it was almost $8 a bite. The drinks menu is stellar as well - they carry Japanese whiskey, which seemed to sit well with my colleagues. 5 stars, if there if a \"work tab\" in play. Otherwise 4 stars."], ["E W.", "The octopus will change your life. I have never had it this bloody good and I've eaten a lot of it. Then there's the foie Gras with grilled peaches... swear word... so good. The dishes here are super creative and taste amazing. The ambiance is intimate and relaxed. We had the pork belly wrapped in banana leaf, octopus with tomatoes, warm duck salad, Hamachi with grapefruit, fluke, foie gras with grilled peaches and the uni-caramel desert. All of the flavors went so well together. There was some serious experience put in to these dishes. For sure going back to tackle the rest of the menu."], ["Linda B.", "Was super excited to try this restaurant and left thinking it was just ok.  Good service, cute place but the food was nothing special.  The duck was overlooked and very dry and even though we told the server, she just shrugged it off.  Yellowtail sashimi with grapefruit was nothing special, flavor was kind of flat - I've had better.  $200.00 for two at lunch with a limited menu ..... Overpriced!"], ["Black X.", "Nobuo--can I move in?What an inviting atmosphere.  Set in a home from 1899.The entire lunch menu made life difficult to choose just one dish...but I had to go with the Soft Shell Crab Sandwich. They make it all in house...focaccia bread, aioli. Maybe the best sandwich I have ever encountered.The little helping of slaw on the side is perfect. A little spicy from the spicy daikon...leaves a zing on your tongue.Jasmine tea was served in a Hario Glass Pot...and set the mood as rain hit the window. This tea also made me piss 20 times over the next 6 hours.Well worth the wizz.Nobuo you are a superstar with great service and better food."], ["Rachel Z.", "Ooooo the hamachi appetizers... they were like little bites of heaven. Note: you'd have to like grape fruit and be able to stand the smell of truffle oil. The restaurant is inside a historic looking house in the heritage square of downtown Phoenix. It has a very lovely outdoor seating area, but we opted for indoors because of the heat. We went at a less busy hour for lunch. Our waitress/hostess was very friendly. She did a great job explaining each dish for us and served quickly. Everything we tried was quite tasty but the hamachi appetizers were the best."], ["Amanda L.", "This place never, EVER, disappoints. EVER.Craft cocktails, an eclectic wine and sake list, food that is both art and delicious, and a staff that is personable and charming.This place is sensational, and could easily be successful in ANY big city. I will never pass through Phoenix without eating a meal here.Thank you, Chef Nobuo, for the unforgettable dining experiences!"], ["T A.", "Nobou is in a class by itself. For those of you seeking the \"traditional\" sushi bar that's on every street corner in America, Nobou is not it. This is an otherworldly culinary experience that captures the chef's exquisite attention to detail, presentation, texture and ambiance. I went recently during restaurant week and they had a fixed price tasting menu. It was one of the best dining experiences I've ever had. From the wonderful and quaint historic building to the expertly prepared dishes to the stellar service, Nobuo is Phoenix's hidden diamond that should be experienced by our locals as well as the folks visiting."], ["Leona T.", "Loved this place. Not your typical Japanese restaurant and that's why I love it. There are no rolls or rice. It's all tapas style. Very high end unique items. A must try is the miso Foie gras, hamachi grapefruit, and the duck salad was all so amazing. This chef has an exceptional palette. It gets 5 stars in my book"], ["Chris B.", "When we first got seated I thought maybe it was a bad choice but looks are deceiving. The service was impeccable. The food was superb."]], "Squid Ink": [], "Phoenix Blue Fin": [], "Akaihana Sushi & Grill": [["Marissa M.", "A young lady named kiokiri-sorry if I spelled it wrong-was super attentive and great service from her. Anyways, great sushi selection and beverages. Thanks again kiokiri."], ["Su-shien C.", "This place used to be called Mr. Sushi. It's been open as long as I've been in Phoneix so going on over 20 years now I am sure. I'm not sure of the reason for the name change. The new name is difficult to pronounce and even harder to remember. I used to love the Mr. Sushi name- so easy to remember!Regardless of the name, the place has the same feel and if think the same menu too. For a reasonable price, you get generous portions of whatever it is that you've ordered. It's a guarantee that you will not leave hungry coming here for lunch or dinner. I am glad the atmosphere of this place has stayed the same. Warm, friendly and inviting. It's like greeting an old friend when I walk through the doors after not being here for awhile. Regardless of how many name reincarnations this place goes through, I hope they don't change the atmosphere of the restaurant and this place will always be Mr.  Sushi to me!"], ["Melissa R.", "My husband and I are not necessarily sushi people, but we tried the sushi rolls here and they were delicious. Not realizing how much food we were ordering, we got the blue flame, Philadelphia and Tokyo rolls along with Beef Tataki. It was way too much food for 2 people. It was all excellent, especially the Beef Tataki. We came on our lunch break, and the place was busy, but wait times were reasonable. Service was very friendly. I appreciated the fact that the waitstaff didn't seem territorial at all. If we needed a refill and a server was passing, they just offered a refill. It's refreshing compared to restaurants where your one and only server is overloaded and can't give you the attention you need.We will definitely return."], ["Dwayne O.", "Having family dinner here on a Sunday evening and is pretty busy.Ordered the Salmon combo #C which comes with miso soup, salad, tempura, rice and California Roll. The Salmon is on the small size but pretty tasty. The Miso Soup is pretty good with a generous amount of salad. The tempura is crisp yet not dry.Have had the Udon and Ramen Soup before and they are both served in good size bowls.Service is always fast and reliable. If you can understand their broken English. Don't generally come here to eat because of the distance but they do a great job with food and service."], ["Sadie S.", "Love this place, way better then any sushi place yet. I've taken my boyfriend and he even agrees it's better then sushi brokers ect. Huge rolls at a great price !"], ["Taric W.", "Overall, this is a decent place for inexpensive Japanese food, but you'll have to endure questionable service and a landmine of unsavory rolls on the menu on your way to a satisfying dinner. Also, show up early. If you wanna eat at 9, be there before 8. It gets PACKED. They close at 10. I arrived around 8:30 and was understandably told to wait. At about 9 I was seated, and we ordered appetizers. The entire time, I was gawking at the menu like \"OMG I can order like 3 different things this is so cheap\". I ordered the terriyaki chicken as an app. It was freaking delicious, and came out in less than 10 minutes. My dining companion and I ordered 3 rolls between us. They are, on average, about $7 each for some decent stuff. Only problem is that it took a bit over half an hour to arrive! WTF? The hana roll was beautiful and tasty, with the multiple varieties of fish. Unfortunately, they fell apart rather easily, even for something so large it was cumbersome to enjoy with chopsticks. I still approve. The tootsie roll was not exactly what I was expecting. Didn't realize that all the contents would be cooked, and thought it was weird that there were tempura batter bits mixed throughout the rice. As for the tropicana roll, mango and salmon sounded lovely, but I didn't realize there would be excessive globs of mayonnaise on top of it. I feel as though the menu does not accurately describe what you're signing up for, and that can result in disappointment. In the end, I barely had time to take a couple of bites before a server dropped off a check. They were adamant about getting us out ASAP despite being patient with them. It's hard to knock a sushi place that's offering such great deals, but it really pushes my limits of how much questionable service I can put up with before I ding you. I really want to drop this to a 3, but I just can't. You were too easy on my wallet."], ["Melyssa H.", "I have been going to Akaihana (Mr Sushi) for over 13 years now and the quality is always excellent. They have an extensive selection and the service and atmosphere are wonderful. I drive out of my way monthly just to get my sushi fix from Akaihana. Love this place!"], ["Christina B.", "We have not been here in a few months as the complex has been under construction. But it is by far our favorite place for sushi!"], ["Jay S.", "Food is average. Service a little slow but very nice staff. Busy place, casual atmosphere. On the plus side, the prices are great."], ["Beatrice B.", "This sushi spot is a pretty awesome little jewel. It is tucked away off of the highway frontage of I-17 and Northern. We arrived just before the 8PM Happy Hour started and boy was this place packed. At first we were not sure we were going to stay but we walked inside and saw how packed it was and saw large platters of sushi going out to every table. We were sold! This place is not in the best of neighborhoods so we were a little skeptical, especially of sushi. However, we were pleasantly surprised. We got the Aloha roll (which was a bit fishy tasting), the Hollywood roll which was my fav, teriyaki chicken and rice for the kiddo (which was excellent), a sushi and sashimi (raw slices of various fish and octopus) sampler platter, a la carte yellowtail belly meat sashimi (which is my all-time favorite cut of sushi) and it was a high quality and done right here (to give the melt-in-your mouth effect). We also had a roll that had predominately fried elements to it which was the bf's favorite. For dessert, they had cheesecake tempura that I had to try because it sounded interesting and I've never had that before. This was our least liked dish. We would never get it again because there were ice chunks in the middle of the cake and it taste like frozen cheesecake from the box with tempura on in a flashed in the fryer, with strawberries on the side then drizzled chocolate syrup. 2 rounds of saki-bombs were fun as well.Overall the price was great and the food was really good. This will be one of my new Happy Hour spots."], ["Nicole P.", "Can't say enough about this wonderful place!  Great staff, owner and locals!Happy Hour is available during many hours of the day- check it out."], ["Jeelyn D.", "Go here for sushi! Love love it! Have been to japan and back and I would say sushi here is the closest I have tasted so far in terms of taste. Really authentic. For much bigger groups, you can also rent a more private enclosure for more privacy. Con: It is a small diner so it can fill out fast especially on weekends. Also will not recommend their combo plates aside from their sushi. Prices can also add up which is why would recommend going during their happy hour."], ["Aja S.", "I usually love this place...My favorite roll is the butter me up roll.  I love the garlic butter that they melt over the roll and how they torch the outside. Unfortunately this time (actually the last TWO) I felt they hardly had any of the best part! I wished that they had torched the outside a little more. That bummed me out!"], ["Brian M.", "This is the best sushi joint I've found in all of Arizona. Their happy hour prices and times are excellent and the sushi is made to perfection, there is something for everyone! I recommend the blue flame or the tootsie rolls, but honestly you can't go wrong with so many options available. The restaurant is always clean and the servers are always friendly and efficient, they can be a little hard to understand sometimes but this should be expected at a place so authentic. Plenty of places to park and don't let the outside of the building discourse you as the city is in the process of upgrading and remodeling the shopping center that this restaurant is located in."], ["Eddie B.", "Awesome tasty sushi, made with tlc. The menu sheet is a Little busy but each roll has its own flavor factor."], ["Nathan C.", "**Best sushi in ALL of Phoenix**I frequent this place very regularly and I never get tired of eating it. They have a huge variety of choices to choose from, so you'll never bore. Variety range from vegetarian/vegan rolls to meaty rolls and even low carb rolls. Staff is always friendly and very helpful. Each sushi chef has his own unique style/flare and it is definitely represented in their cooking. Granted all the chefs cooking AMAZINGLY, my family and I have our favorite chef named Sean while my friends have their favorite chef named Hero. You take your pick lol! I would 1000% recommend this place."], ["Russ D.", "I love this place. Always smiling and friendly staff. The Sushi is the best in the valley for the price.  Went there again last night after not visiting for 6 or so month... and all I can say is that I do not go to this place enough.TIP: If you are a lover of sushi rolls with a kick, the Blue Flame is a must."], ["William S.", "We gave this restaurant four stars simply because we are tough graders.  The sushi rolls were great, creative, and HUGE.  The service was fine, and the atmosphere was great.  My lady would like to add that the temperature here was pleasant as opposed to the subzero temperatures that is usually coupled with sushi bars.  We got the Paul (Our Favorite), Crazy (also good), Crunch, Godzilla, and Las Vegas(wasn't a huge fan of) rolls.  The rolls were decently priced, the only regret we have is trying to eat 5 rolls (due to our ignorance of the portion size).  Over all, it is agreed among the  three of us that it was a pleasant experience and we would come back."], ["Chris H.", "I have ate here in the past, and they did a great job on lunch today. Service was fast, people were friendly, food was good. Nothing too stellar about this establishment, everything is the way it should be.The reason I gave three stars was that my rolls kept falling apart when I picked them up with the chop sticks, it was very hard to manage and then a section would fall out and I had to scoop it up.The cucumber salad is different and with long shredded strands of cucumber and a nice sesame sprinkle a light vinegar dressing. I did nothing out the ordinary on the rolls as i ordered from the Happy Hour specials - great prices BTW!Its a decent place to try, so swing by if you have a craving."], ["Christine P.", "Ive been here for years! i love ittttttttt. Hands down the best sushi everrr!!!Hole in the wall...? Yes. Yes it is. But this is the only place I go for amazing sushi!!!!!!!!!!!Happy hour starts at 8pm Whooo. I always get the vegetarian blue flame. It's so delicious. Love the sweet sauce they sprinkle in.They don't speak English well...but it works out some how. Ahha.I LOVE THIS PLACE!!!"], ["Janet N.", "Did I eat at the correct Akaihana? Because based off the reviews, it seems like I had a completely different experience here that was hardly passable in my book.Akaihana advertised a happy hour and had deals for apps, sushi rolls and alcohol, plus it was cheap, but I guess some things are too good to be true. I stepped into Akaihana and was greeted by the sushi chef in some kind of indistinct Asian language, I'm used to the \"Irasshaimase\" greeting as I used to serve at a Japanese restaurant in the past. However, I could not make out what language he was speaking. Regardless, I was seated in the corner of the restaurant and was given 3 menus.Since I was sharing dinner, the items that were ordered were: Tootsie Roll, Spicy Salmon Roll, Tropicana Roll-Tootsie Roll: deep fried salmon surrounding imitation crab meat, big roll and served with a soy-based sauce-Spicy Salmon Roll: chopped up salmon mixed with spicy sauce in a roll, this is nothing special. Spicy salmon does not work in my book, spicy tuna does though. - Tropicana Roll: Salmon with mango, each piece topped with spicy mayo and sriracha and more soy-based sauceThis place masks the quality of their fish with sauces, deep frying and rice portion. The portion of rice was overwhelming in comparison to the rest of the fish in the rolls and wasn't seasoned well and hard, the sauces overtake your tastebuds not allowing you to taste the fish. The ginger was very sweet and I didn't even dare try the wasabi.Cheap prices are reflected in their quality of rolls,: over sauced, too much rice and lacking in quality of fish. Interior is a bit crazy with variety of menu choices and service is decent at most. Also upon leaving, the sushi chef greeted me once again in some indistinct (made up sounding) language which I found to be a bit offensive. Because I know for a fact he was not speaking Japanese, Korean, Vietnamese or Filipino because I've worked and frequent Japanese and Korean restaurants/have friends who are and that I am both Vietnamese and Filipino.*Pass on this place, I got a stomach ache the whole night after dining in here."], ["Starr S.", "This is the only place I eat sushi at. The fish is fresh and sushi is prepared when ordered. Everytime I go, I try something different and have not been disappointed yet. If you are a true seafood and sushi lover you need to come here."], ["Jamie L.", "Been driving past this place for the longest time and never noticed it before I yelped it! Happy we found this hidden gem! The service was wonderful and it gets packed later on at night! There was a wide selection of food and beverages and we enjoyed our meal very much!!!! Everything was fantastic, I just wished our food came a bit faster!"], ["Nicole R.", "This restaurant is amazing for good sushi. The happy hour after 8 is great and has a lot of options. The blue flame roll is amazing and I will be coming back to try more!"], ["Greg M.", "The sushi here is fantastic and judging by the Saturday night dinner crow, I was not alone in that opinion.  We had a number of rolls, I wish I could remember them all now but they were all fabulous.  My only complaint is that the service is very slow.  Our waitress brought us waters and disappeared for about 20 minutes.  I had to flag her down to place our order and to get the check.  However despite that I would definitely go back."], ["Michelle C.", "I love love LOVE this place! They have so much to choose from its hard to decide on just a few items. My boyfriend and I have been there twice so far. On our first visit we happen to get there during happy hour. Needless to say it was BUSY! I know a lot of people hate to go to restaurants when they are packed but not this girl! To me, it says a lot about the food! We sat at the bar and ordered drinks and started salavating as we picked out a few rolls. We decided on the Manhattan Roll, Soft Shell Crab Roll, Las Vegas Roll, Soft Shrimp Hand Roll and one other that escapes me at the moment! Ha! Anyways, the Manhattan Roll was on point!!! Oh so good! The Soft Shell Crab Roll was amazing! Not fishy at all! I think my other half could have eaten a ton of those. The Las Vegas Roll was definitely different than you'd get at most sushi places. It had some sort of green sauce rather than the typical eel sauce. Because I am so use to the average Las Vegas roll, I was a bit taken back at first, but after each bite, I rather enjoyed it! Man I wish I could remember the other roll we had because it too was fantastic!The second visit was not during happy hour. It was by far, not as busy. We sat at the bar as we usually do and was greated by Sean. This guy should be in comedy! He kept us entertained with his humor which was refreshing since most sushi chefs are so dang serious! On this day we ordered the Shrimp Tempura Roll and the Rose Royce Roll. I'm not even go into reviewing the Shrimp Tempura Roll. Don't get me wrong, it was delish! But I have to tell you about the Rose Royce Roll....can you say spicy? No.....spicy does no justice to this roll. Hot? Hmmm....no. Let's see...how about a nice subtle heat that turns into a punch in the throat like sneak attack from highly trained Ninjas! Yep that'll do! This roll was so delicious! Packed with fresh cut habenero, If you are a novice to hot food, you will never get through this roll! This thing had us both sweatin' to the oldies! But we loved it! Sean was gracious enough to let us try some jelly fish. The marinate was very tasty but the texture was like eating soft plastic. Very cartilage-y lol! The service was great! Never had to ask for drink refills since they were on top of that. We will definitely be back here. So far this is our \"sushi place of choice\"."], ["Sara B.", "Happy hour here is absolutely incredible! My sister used to work here in high school (I know, I know. Token Caucasian server)- needless to say, I have been coming here a long time. Blue Flame and Super Mussels are unlike anything I have ever eaten!Today I was planning on meeting a friend here and she tried to cancel on me. Because I had been looking forward to it all day and he had given me sushi blue balls, I went before happy hour ended, ordered amazingly-priced rolls and convinced my friend to come meet me. Probably the fattest thing I have ever done but I'm sharing with you to prove a point- the food and the deal here is just THAT worthwhile."], ["OFFSHORE I.", "Great sushi in an odd and easy to miss location. Better than most places in town, reasonably priced and always consistent. Standouts include the crazy roll, baked scallop dynamite rolls and many of the others on both the extensive sushi menu and large Japanese Menu. I consistently to come here out of my way instead of the \"fancier\" places simply because their food is better."], ["Neha M.", "I've had sushi twice in Arizona and I think that dallas just has better sushi.  The prices were phenomenal here during happy hour.  The sushi just wasn't that great. Ive had way better in Dallas.  One of our rolls had crab in it and my friend are a piece and ended up finding a piece of shell in her food.  It made her turned off by eating anything else so she couldn't even finish her lunch.  The waitress was kind enough to not charge us for it but this spot kind of ruined sushi for me for some time."], ["Liz C.", "So, I was a little nervous about trying a Sushi place in AZ. I wasn't sure how fresh fish could be since the state is mostly desert...However, I'm happy to say I was pleasantly surprised. I had read a lot of the previous reviews including some really horrible ones, but decided that those seemed few and far between.The reason for 4 stars instead of 5 is the slow service. All the servers were very friendly and helpful, but it was a little slow to get just about anything.We ordered shumai appitizer, miso soup and four rolls. The Blue Flame roll was my husbands favorite, its fried, but lightly so it doesn't have a lot of crunch which we both really enjoyed. We also ordered a dragon roll, Jan roll and baked scallop roll. All the rolls were good, fresh and presented well. And considering the price, its a great value.I will definitely eat here again next time I'm in Phoenix."], ["Sarah B.", "Awesome specials and family friendly. Very busy place! Tempura and wasabi salad dressing were delightful. Reasonable prices and great dinner specials. We'll be back soon.  Delightful dinner."], ["Heather P.", "The husband loves sushi.  Me, not so much.  Therefore the subject of sushi or Japanese food never came up.  He would pass this little place tucked back into a strip all as he drove to work each day for a couple of years.   Well, today for some reason I had a hankering for either teriyaki chicken or a jakisoba bowl.  The heat had rendered cooking unimaginable so we had to get something to eat.  After checking Yelp and what was nearby I found that there were many more than just fast food bowl chains.  This online menu looked to fit the bill and would give the hubby a sushi fix as well.  The place was easy to find as there are not many other businesses around.  The space is nice and intimate but not too cramped.  There were a lot of people there and the menu was quite extensive.  I had the yakisoba and the hubby had teriyaki chicken and some sushi.  The portions are HUGE and the tea excellent.  I had the mango ice cream for dessert was was absolute bliss."], ["Roscoe T.", "Neighborhood Japanese joint.  Sushi is always fresh, excellent and reasonably priced.  Tempuras and appetizers are wonderful.  Try the chicken yakitori and the baked scallops.  Service is sometimes spotty.  It's my go to place for a casual night out with sushi."], ["Abigail A.", "Yummy sushi! I definitely recommend coming in and trying the crazy roll (pictured)! The portions are large and the food is delicious! The staff is friendly and authentically Japanese-family owned and run!"], ["Jeri Lynn W.", "Sat at the bar terrible service.  We were presented with two quail eggs than 10 minutes later 10 pieces of salmon.  We paid our bill and left.  Going to Wild Tuna."], ["Bob D.", "Happy hour at Akaihana can't be beat, $3.75 Cali rolls; great service fast seating during lunch, we usually sit at the bar because I am intrigued by the making of the rolls by the sushi chefs.  If you are down for some good sushi at a good price, this place can't be beat!"], ["Jamie P.", "Shockingly delicious. I got the rainbow roll. Mmm. I was with 2 other people. We cleaned our plates. The prices are affordable. This restaurant isn't the most beautiful place I've ever laid eyes on, its just okay looking inside and out. The food though, is fantastic. The only reason I took a star away is because one of us received our order about 5 minutes after the other two. If it wasn't for that, they would  have had a 5 star rating."], ["Sandra O.", "We have been going to Mr.Sushi for well over 10 years.  LOVE IT!  There sushi chef's and staff are awesome! We tried other sushi restaurants and always come back here!  and Happy Hour is awesome!"], ["Chloe M.", "We went here today for happy hour and was disappointed. We ordered gyoza, teriyaki chicken, spicy chicken, ramen, baked scallops roll and salmon skin roll.Gyoza and spicy chicken were the saving grace for me and the family. I will definitely come back just for the spicy chicken.Teriyaki was nothing special. The ramen, which supposed to have pork and veggies but I only found 2 thin pieces of pork. The worst part was that the broth was barely warm and lacked flavor. The salmon skin roll was ok. It was falling apart! The baked scallop roll was just mostly imitation crab with mayo and some scallops. The baked scallop roll took about 15-20 mins before we got it.Anyway, the service was ok, the food was so disappointing especially for the price."], ["Stormy Suncloud G.", "This place is pretty good. It's among my favorites on this side of town. I have had really good sushi in my lifetime as I used to live in California, but this place is not bad. I liked everything we ordered and the service was okay. I would come here again."]], "Sakana Sushi & Grill": [], "Yen Sushi & Sake Bar": [["J. J.", "Really slow! Over forty minutes for the first roll to come out. Are they fishing and flying in the catch to make the roll. Service is ok if you can get there attention. Normal price for sushi compared to other in the area. Sushi is ok. So I won't be back but if you like long waits for everything due stop by."], ["Brandon Y.", "Decent food. Small sized rolls and definitely $2-3 more than most comparable sushi places in the area."], ["Sierra W.", "My absolute favorite sushi bar. They just added on some room to the restaurant which is really cool. Edamame is always good. The service is good. The sushi is amazing. I've had so many from there. I was just there yesterday for my birthday and had the heart attack and it's just so yummy. It's not too fishy. So it's perfect if you don't want too much fish. I love fish but I thought that it would be a good mix. It's a mix of stuff in a jalapeño and rice. So only get it if you like spicy. The motchi (not sure how to spell it) is a desert they have that is just amazing. They have three flavors. Mango, strawberry and green tea. It's that flavor of ice cream in this almost gummy fuzzy thing. It sounds gross but I promise it's so so good."], ["David R.", "Quality at its best.  I suggest starting off with what I have featured, Tuna Tataki, Salmon, Spicey Tuna Handroll and a Large Asahi."], ["Brittany E.", "Yen has been my go to sushi spot for years now.The Happy Hour hours, although not convenient for everyone; works really well for many.They are in a great location just north of Bell, and the parking lot is tight, but there is plenty of space inside the restaurant since its expansion. Their Philadelphia Roll is hands down the best in town.Don't be impatient when it comes to waiting for a table; it has exploded in popularity because of how delicious it is.Because it has gotten so big they do have new staff many of whom are younger, so be courteous and understanding if they aren't waiting in your beck and call.I will never stop going here."], ["Desiree C.", "Sushi is awesome here! I love the rolls they create! The staff is so friendly and I've never had a problem with our order. I've been eating here for sushi for the past 6 or 7 years. It also just expanded which I love! The happy hour is the best too! And the lunch menu deal is awesome too! Try the crazy boy roll!"], ["Brian M.", "Udon noodles soup is great on a cold day. Sushi is pretty good. Rice could have used a few more minutes cooking but good over all.  Nice place for a fast lunch with excellent and prompt service."], ["Kt C.", "This place is soooo good. Their sushi is delicious and I have yet to have a bad experience here! Very yummy id recommend it to anyone."], ["Michael R.", "I've been here like 4 times, it's always amazing sushi. Always fresh and delicious. Highly recommend coming here at least once. Happy hour is great too."], ["Olena V.", "Excellent fresh food and great service/atmosphere. Their portions were big and I totally over-ordered but everything was so good. I would love to come back again and try everything they have!"], ["Grace S.", "Happy hour is great!  We came in on a Sunday. Have been to a few sushi places  and this place had way superior flavor.  Inside is super cute and the staff is nice. We had Amy as our server.  Will definitely  be back."], ["Ervin H.", "Ok.  So you had a rough week.  It's Friday night.  You are in the mood for some great sushi, but not looking forward to hurting the pocket.  And BOOM!  You hear Yen Sushi & Sake Bar has an AMAZING happy hour deal after 8 pm.  I mean cheap appetizers, about half off on sushi, and great prices on drinks.  All I am going to say is for a party of 4, we had:2 appetizers6 rolls of sushi2 specialty drinks for the ladies2 sake and beers for the dudesTotal amount came to $62!Ok, with your mouth dropping, and thinking, \"the food probably wasn't that good, right?\"  Well, you have to be wrong, my fellow yelper.  The appetizer tempura was not overly breaded, and you can really taste the vegetables with the light crunch from the tempura.  The gyoza had some rough texture on some, but when bitten it was tender and flavorful.Now to the sushi.  For the price, it was above average.  Well organized and presented.  Tasted fresh, therefore, it was some quality sushi.As a result, great deal for happy hour, which I will definitely come back to.  It is a small environment in not the best looking shopping center.  However, the service was good even though it was definitely busy.  I would strongly recommend coming 10-15 minutes before happy hour to beat the line.  Excellent DEAL, and looking forward to another evening at Yen Sushi & Sake Bar!"], ["Cody V.", "Best place in the Valley! Sunday happy hour is the best. Rolls are delicious and fun. great atmosphere. wonderful service!"], ["P K.", "If you are seriously sashimi lover,go for somewhere else.They served smelly fish and I couldn't believe they put sesame oil on hamachi!"], ["tipzi g.", "Really good sushi! I come here as often as I can and highly recommend! Mmm craving it now."], ["Revital U.", "Loved it here. Friendly staff. Really good sushi. I loved the sea weed salad. Definitely a place to enjoy some well made sushi. Will be coming back !!"], ["Maria I.", "This review unlike (some of) my other ones will be short and simple. Comes down to the question - Do you want some super yummy sushi? Then - YES - do come to Yen - you will not be disappointed! Yet to try their Happy Hour - just afraid that I will be in big trouble not knowing when to stop eating at HH... lol"], ["Keith B.", "This is my go to place for Sushi, they have recently expanded - so they have a bit more room. Paul has done a great job on the expansion but the sushi is wonderful and fresh. They have some early bird specials, just a class place with a class owner and staff. Food is fantastic and always a good deal.I have probably been here some 50+ times and it has always been great each and every time."], ["Kelly R.", "I'm striking out lately loving restaurants as much as I hear others do, but I do like Yen! The likes: happy hour prices and times, location, atmosphere, friendly service, tasty & fresh sushi!Why it's not a love affair: happy hr roll choices are mostly deep fried, and I have yet to get a table, only been squished at the sushi bar. At 9pm nonetheless.All in all, I'm glad to have Yen in my sushi rotation, but I won't be crowding the sushi bar regularly."], ["Don Y.", "Yum. This place has amazing food. Eat here today. Leave now, you won't be disappointed. I came at the recommendation of several of my friends. I was not disappointed. But, I am mad at myself for not coming here sooner."]], "Extreme Sushi": [], "Harumi Sushi": [["Jason B.", "I adore this resto, hands down the best sushi in metro Phoenix. I've had numerous rolls here for lunch, and one of my favorites is the OMG roll, it's served wrapped in foil and flaming! And yes, when it's served, you're like OMG! (insert valley girl reaction here) I'm a fan of the H3 roll which is spicy tuna, spicy salmon and spicy yellowtail, and the Ahi Tower too which is more a rice bowl of sorts. What I love about this place is that it's unique in that their sushi is made with purple or forbidden rice. So it's better than white rice, and brown rice too. It's pretty much a sushi resto with exceptions during the weekday lunch hour where they also serve bento boxes. The seafood is fresh, good eats, and a great experience!"], ["Diane W.", "My friends and I were downtown for a show and decided to give Harumi a try.   It's definitely very casual so don't take a date if you are trying to impress them with the décor.  The service if efficient, the food is good, the prices are reasonable.    I loved the roll with the sweet potato. Interesting note:  Go find the restroom.   It's an interesting location."], ["Cherry L.", "Omakase and fresh wasabi. That's all you need. The omakase (chef's choice) is probably thee best one I've had and I'm comparing it to some great places in LA. A bit different in that it all comes at one time instead of one at a time but I had no problem with that. And the price?! OMG!! ONLY  $35!!!!! What a deal. What a steal. And you will leave pretty full. And fresh wasabi. You should definitely try it if you haven't yet. I can't stand the paste but eating it fresh is a whole different experience. It's worth the drive to downtown."], ["Jennifer S.", "I recommend their rolls over their bento box if you hit up this joint.  This is what people ordered the most.  They focus a lot on their rolls.  Unfortunately no noodles which is what I was craving."], ["Jen T.", "My first time having forbidden rice aka purple-looking rice. It definitely adds a unique touch to the sushi rolls. I still like my nigiri with white rice though. Fresh wasabi was added on top of the nigiri. If you want additional fresh wasabi, they will charge you an extra $2.00 for \"real wasabi\". I was so bummed out because the other sushi place that I usually frequent gives out fresh wasabi FREE all the time. My favorite item on the menu was the H3 roll. It was spicy, but not in any way a tear-jerker kind of spicy. I would also recommend getting the spicy sashimi salad, which was super good with strong flavors of sesame oil. Service was quick. We made a reservation, and were immediately seated upon arrival. The waitress forgot to bring out the miso soup we ordered until our meal was half done. By then, we had to cancel the soup from our order. This place is right in Downtown Phoenix. They do not have a private parking lot. There's a public parking lot behind the building that was $12.00 on a Monday! We settled for street parking at the meters right across from the Wells Fargo Museum instead - way cheaper. It's a four hour limit after 5pm versus a 1 hour limit before 5pm."], ["Thomas T.", "This is probably the best spot in Phoenix to get sushi. The rice is purple and seasoned well. Out if the 3 times I have been here the food has been consistently great. Fish always fresh, staff always friendly. The amount of food you get is awesome as well, I ordered 5 rolls thinking it was gonna be small, except it was not....at all. I did end up eating all 5 rolls cause I had the \"munchies\".  Anyway to sum it up, best sushi spot in Phoenix,  fresh food, friendly staff, they only thing I would worry about is parking"], ["Elaine B.", "Been wanting to try this place for a while. The purple rice is very unique but added a great flavor to the sushi rolls. Service was great everyone was very nice. Can't wait to go back to try more."], ["Tommy R.", "This place rocks. I'm in town for work and it was right next to my hotel. I came in on a Friday night and they were slammed. Got us a table pretty quickly and food came out quickly.The fish was fresh but the best part is the black rice which I've never seen at a sushi place but they also have real wasabi. Even better the prices aren't bad at all. Great find."], ["Anthony G.", "I just had the best sushi of my life! Have the unagi, oh my god, and the spider. So good!Service very friendly and fast. Too fast. I prefer a slower pace and time between dishes. On the pricey side but so worth every penny."], ["Tammy S.", "Quaint, local and great service! We all get cravings and sushi is one of them!! Centrally located in Downtown Phoenix is a spot that will fulfill that craving! From entering on a Friday night it was busy inside. Not a huge place which I prefer it being the size it is. We were greeted immediately and sat right away. No wait for anything from our drinks to getting our starters. Of course I have to get the typical edameme and also ordered the crab salad. Edameme was warm, and the crab salad was in roll form! Delicious! Real crab not the fake krab btw...Anyways my dinner date ordered a platter of sashimi including albacore tuna,salmon and yellowtail. I ordered a combo plate with 3 different rolls for only $15.00!! They all were fresh and tasty! They do use purple rice, do not be afraid it is perfectly fine! They also do not skimp on the portions of filling and the rice is not overwheming like most places. I don't appreciate when I get a roll and most of it is rice and small amount of filling.The overall experience was fulfilling and I felt very satisfied! Please go and visit and support our wonderful downtown! I will most definitely be returning to satisfy future cravings!"], ["Susan P.", "Living in Phoenix it's extremely hard to find an amazing sushi place. Until now! First, this is the first place I've ever been to where the rice is purple! I came for the first time with my friend and every roll I got was amazing. I wish they had a website because I couldn't remember what was exactly in my rolls. My favorite was the H3 roll and the Oh my gosh roll. You will definitely like this one. The name speaks for itself. Trust me, you won't be disappointed. My friend was also friends with one of the chefs so he let us try some rolls he made. Everything was so fresh! I brought home the leftovers and they still tasted yummy the next day. I wish I could come here everyday!"], ["Hee Y.", "My boyfriend and I came here after reading reviews on yelp, and we're glad we did. Since we're NY natives, we were pleasantly surprised at the quality of the sushi, which were consistent with what we were used to.We both had the omakase ($35/person). A lot of pieces for the price. The owner even came to greet us and gave us an extra dish and there was complimentary mochi ice cream afterwards.The restaurant has many 2-4 people tables; so it's not exactly a place to go to with a large party but it can with a reservation.I would definitely go eat at Harumi again. The place is clean; it doesn't have much of a cool-looking decor, nothing fancy, but the food and service are quite good."], ["Raisin F.", "Ok so I have been here three times in a week. That is how much I love Harumi!!! It is just so tasty, worth it, cheap! Juno, the owner is working everyday. Very hardworking, humble guy. Love harumi!"], ["Phillip L.", "There is a reason for all the positive reviews of this place.  The sashimi was amazing and the service was perfect.  I am going to try and come back as many times as I can while I am in Phoenix for the next two days!"], ["Emily T.", "Have been here twice now when I'm in town. I've tried a lot of sushi around the country and this remains as some of my favorite. Have gotten the Ahi Tower both times and it does not disappoint. Love the purple rice and the whole dish has great flavor and is quite filling. Service is also very good and friendly. Already looking forward to coming back again!"], ["Nicole G.", "Firstly, the dudes behind the counter are legit. They know exactly what they're doing, and because the place isn't accommodating too many people, they can artfully and carefully craft their creations. The yellowtail was some of the best I've ever had outside of Los Angeles. The sushi is light, well portioned and proportioned. I never felt like \"This could use a little of this/that\".Also... what is it about that purple rice? It's subtle, but I find it to be a superior vehicle for the fish to white rice. Maybe I drank the Kool-aid, but who cares?  I'm in!I encourage you to go. My stomach is literally growling as I write this review."], ["Taric W.", "Harumi is exactly what sushi should be. It's fast, yet high quality. Doesn't matter much what color the rice is, it has great consistency that doesn't take away from the quality of their rolls. Their fish is great as well. Very nice tuna. I am still blown away by how it was ready within 10 minutes of ordering, or how during the day you can just grab some to-go. It is inexpensive. Rolls start at $7, and perhaps the best deal is the $15 mini roll combo that nets you 15 morsels that aren't significantly smaller than other dishes and can easily feed two people. All in a setting that's casual, but still very comfortable. If you're ready to sacrifice a bit of sushi bar showmanship of larger establishments, Harumi is *the* place to go for a tasty dinner."], ["Lauren C.", "Harumi Sushi is by far my new favorite place to grab sushi here in the Valley.  I went with a group of 10 people, and not one person had a bad food experience.To start, the rice is purple.  Yes.....PURPLE!  Apparently, it is a black rice that turns purple once cooked and is filled with extra antioxidants and other components that are good for you.  And trust me, even if it wasn't good for me I'd still be asking for it.  I don't know what it is, but it is phenomenal!The dishes we shared were the Ahi Stack, Spicy Scallop roll, and Salmon Sashimi.   Holy moly; the Ahi Stack was unlike anything I've ever eaten.  I thought it was a roll, but instead it is a mountain of ahi tuna, crab and spicy sauce on top of a mound of purple rice topped with fresh avocado and roe.  We inhaled it, and will definitely get it again.  And the salmon is the most buttery, fresh salmon I have ever had in the valley.  They top it with their homemade fresh wasabi, which was also fabulous!I docked 1 star because when we went to pay there was a lot of confusion and some people received their bills, some didn't, some didn't get their cards back for awhile.....it was a cluster, but definitely forgivable.If you love sushi, I definitely say run, Run, RUN to Harumi!!"], ["Alan C.", "Tried the Omakase for two. Fish is fresh, price is reasonable too at $35 pp, however I guess you get what you paid for -- only regular fish Nigiris are offered.  Your run of the mill salmon, tuna, hamachi, taka nigiris with salmon sashimi and tuna tataki.  Disappointed that I don't even get ikura sushi. $70 is leaning on the expensive side... Might try their rolls next time."], ["Jana B.", "Craving sushi, this was the answer in downtown Phoenix. My brother and I split many items, the highlights being the seaweed salad, fresh wasabi, yellowtail nigiri, tuna tataki and pink mochi (compliments of the chef!). The purple rice was interesting and, to be honest, I didn't think that it was too appealing. But, the taste was just the same as regular white rice to me. The chef was great and talked to us throughout the meal given that we were seated near the bar (the only place to really be at a sushi place!). This is worth a stop if you need to get your sushi fix."]]}