{"Sala Thai": [], "Jasmine Thai Cuisine": [["Shannon B.", "Tasty food, quick service, and a great location! I'm partial to this location, since I just live down the street! This is a quiet little spot near St. Joe's hospital off Thomas.  We were the only ones in the restaurant at the time we visited. The waitress was attentive but not super friendly. The food: excellent, hot, and well-spiced (well, except the vegetable rolls).  The spring vegetable rolls were crisp and tasty, along with some delicious peanut sauce.  I had a history of these with friends who made them homemade in the 1990s, and these were a close recipe! I ordered a vegetable stir-fry. The waitress said I could specify vegetables to be removed from the dish.  They were out of sticky rice (sadness) but I love jasmine rice. My friend ordered the curry and loved it. We'll be back!"], ["T A.", "Just stopped in for lunch today. Had the crab puffs, satay and pad thai. Crab puffs were not good. The wontons were way too thick and chewy and were almost flat. Crab puffs should be light and airy. These were heavy and greasy. Crab stuffing was almost nil and too creamy.Everything else was good. Service was attentive and the place was very clean and tidy.A solid 3 star choice when you have a hankering for Thai food"], ["Chris H.", "Great place with good food. Very cozy and prompt service.I was in the mood for Pad Thai so I stopped by on a whim, everything checked out very good and the food was delish!"], ["Leslie M.", "I decided to try this place out because it is right next to work. The décor was cute, clean and cozy. Our waitress was great in servicing us. I ordered the Thai iced tea which was a tad bit too sweet for me. I had to put more ice in my glass to water it down a little bit.We ordered the beef pad se ew and the chicken red curry. The red curry was pretty good. I had to ask for more rice in which my server had no problems bringing me some. The pad se ew tasted sweet. I usually like mine hot, tangy and spicy.Overall, I would definitely come back! The restaurant isn't too busy so you wouldn't be waiting for a table, which is a plus. There is plenty of parking in the back of the building so if you get annoyed with the lack of spaces at the front, just go to the back."], ["Evan B.", "Cen Pho is a thai hotspot, I can ramble off at least 5 places with in two miles, so if you are going to jump in to that game, you should be at the top of the game.Jasmine tahi is not quite up to the challange. My drunken noodles were a bit too soft are not really spicy, the spring roll was crisp but greasy. The odd music and empty tables made this for an akward trip. Also I was dismayed when I went by the kitchen and heard a microwave in use, this may explain the general limpness of my food.The PadSeEw did not have the wake` char one would exptect."], ["Noor B.", "Not bad, but not great. Stopped in for dinner one night. There's lots of parking right behind the building, so don't stress yourself in the tiny lot out front.Restaurant is small, cute, and the staff are super nice. Started out with the chicken satay, which was good. Flavor was nice, chicken was juicy, and the peanut sauce was fine. It wasn't bad, but it wasn't outstanding.Entrees were pad thai with chicken and red curry with tofu. I thought the pad thai was a bit too sweet, and it almost had a touch of ketchup flavor. I'm not sure how it was seasoned, but it wasn't my favorite pad thai. Red curry was fine - again, nothing extraordinary.If I wanted a quick bite, I wouldn't mind stopping in. I think it's a great spot for those at St. Joes wanting to get out of the hospital system and grab lunch. Same goes for anyone else working nearby. I wouldn't make a special trip of visiting, but overall it was fine."], ["Morgan D.", "As newbies to Phoenix, we have been looking for a great Thai restaurant for dine in and take out. After eating at Jasmine Thai we are confident that this will be our spot! The restaurant is clean, service was speedy and the staff very friendly."], ["Norm R.", "Good, inexpensive Thai cuisine, well presented and no corners cut even as they keep their prices down. The service is friendly and the place is cozy and conveniently located. While parking in front of this commercial strip facing St. Joe's hospital is very limited, there is ample parking behind - as is known by those who frequent the popular 5th Avenue Cafe which happens to be their neighbor."], ["Mike A.", "Tried this place due to the overall high reviews...the chow mein plate was tasty but once I got through half of the plate I found a piece of metal scrub brush in my mouth and almost choked trying to get it out... Although I didn't have to pay for the plate I expected a better reaction to try to save future business but was surprised that I was charged for my soda and the other plate at the table....i'm not the type to try to get stuff for free or find extras when a mistake happens but a little effort into keeping me coming back might have worked....won't be back here- cleanliness is very important part to trusting a restaurant!"], ["Rachel K.", "Officially a regular at this spot, I have tried multiple dishes by now. It's pretty authentic and delicious! The lunch specials are great you end up getting a lot of food for like 9 bucks ! Everything I've tried is good and the service is also really friendly and as efficient as they can be in a tiny place like this."], ["Jasmine V.", "My sister-n-law and I ordered from here for a late lunch/early dinner. We called to see if they did delivery and were informed that the delivery guy had left for the day already. It wasn't a huge deal because the place is so close, so I biked to pick it up. They said it would be ready to go in around 15-20 min. First thing that made me nervous when I got there was I didn't see a bike rack, sign, pole, anything to lock my bike to, so I had to leave it sitting right outside the store for the world to walk off with. Otherwise, the place looked nice and clean, the lady had my order ready and was polite and quick with processing my payment. After I got home I was excited to see the food. I had ordered Chicken Spicy Noodles  (med. spicy) with an added side of sticky rice and my sis had ordered Pad Thai Chicken.Both main dishes looked delicious (a little sloshed due to the ride back) but delicious. The only 'ugh' thing was the side of sticky rice, it looked horrible. It was packaged in a little fold over sandwich bag and seemed very stiff. ((I'm not the best cook but the only time my sticky rice looked like that was when I had overcooked or reheated it wrong)). Once I took it out of the bag I feared the rice was a lost cause, I had to pry a chunk off just to try. Needless to say I was hoping that it tasted better but I was wrong there too. I ended up tossing it.The flavors of the main dishes made the loss of rice bearable. My dish was extremely good and had a very delicious heat, my sis's dish was also very tasty with a nice crunch. I would say this is definitely a good place to stop if you're nearby and craving Thai. The prices were decent and I will most likely eat here again when I've got a craving and not wanting to go out; though I doubt I'll ever get the sticky rice again - better just make my own."], ["Youri L.", "Just discovered this Thai place after driving by it with a friend. Some of the best Thai/Asian food I've had in the Valley. Highly recommend the Pad Thai and the Pineapple Fried Rice is amazing. A small restaurant that deserves the praise it's been getting."], ["Jackie Z.", "Some of the best curry in town! Delicious food, excellent portion sizes and very clean inside. We had both the panang curry and pineapple curry which made it an excellent decision to get some refreshing Thai ice tea!"], ["Andy G.", "Amazing Thai for the price. I will be back soon!I had the Duck Noodle Soup and it was fabulous. Our service was wonderful, the spice station is as advertised... HOT! Also enjoyed the Shrimp Rolls to appetize my pallet before the duck rodeo. The menu is what you would expect from Thai but also included some Chinese items such as orange chicken.Overall, this place excelled. I give it 5 stars for consistency and quality. I've been here over a dozen times and every entree Thai item is spot on."], ["Jennifer O.", "A friend and I went here this weekend after reading the great reviews (and since it is in my 'hood). I was so excited to try it! Unfortunately, it didn't exactly live up to the glowing reviews. The space is nice, very quiet and relaxing, and the service was attentive. I ordered the spicy noodles and my friend had the pad see ew. Although both dishes seemed fresh, with fresh veggies and juicy chicken, the flavor was lacking. Hers was almost completely flavorless. Mine, ordered 'hot' was also fairly bland... more of a medium spicy and lacking seasoning. I would like to and probably will try this place again, as it is close to my house, and hope that other items (such as curries and soups) are more flavorful."], ["Kelly M.", "This thai place was just okay. Nothing special. I considered leaving only two stars for this restaurant because the food was very overpriced and it was literally the most uneventful dining experience I have ever had. But I decided to be generous because the food was not terrible and the restaurant had a nice, clean interior. The main things that irked me about this place were the prices and the fact that they don't offer cups of soup, only bowls. I absolutely adore tom-yum soup, and enjoy starting my meal off with a cup, but this place only offers $10 bowls of soup. When I asked the waitress about this, she told me it was no big deal and that I should just order my entree and a bowl of soup... uh, me thinks not. Really, how hard is it to offer a cup of soup? Anyways, I won't be returning; there are TONS of better places for less money."], ["brooke f.", "I love this place! Great flavor, good prices and everyone is super friendly! I like the green curry, yellow curry, pad thai, and sesame chicken!"], ["Karen P.", "If I could give it no stars I would. Food was bland and oily for no reason. I tried to give it a chance but once I tasted it, the food spoke for itself. I ordered beef pad see-ew. My friend ordered green curry chicken and His response was the same. And we had not even compared notes yet. I can't understand why it's so bad with all these fabulous reviews on here. I can tell u perhaps these people don't know what good thai food tastes like. This isn't it. The portion was also ridiculously small for the money you are paying. Cutting corners will NOT keep u in business. Don't waste your money or your lunch break here."], ["Cindy S.", "I would like to say that I enjoyed my soup but alas, no. I ordered #29 beef soup. Garlic was featured. But it was fried garlic! Nooooo. Just chop a clove man. The \"meat\" balls were those little rubber balls that bounce from here to kingdom come. Not to worry; there's only 2 of those little babies in there. Don't know about the other dishes but I would specify, \"no garlic\" unless you want to smell like Lipton Onion Soup for the next couple days. Service was friendly. The waitress bent over backwards to make me happy and that's why they get 3. Count Em. 3 whole stars. No chop sticks! Come on man. You guys can do better. Heard someone say \" this was good. I'd definitely come back\". So... There were satisfied customers."], ["Jennifer S.", "Yum...so excited that a tasty Thai place just opened in Central Phoenix!  Nice atmosphere, attentive and friendly staff, and delicious food.  We tried the shrimp rolls, steamed potstickers, pad see ew and rad na.  Everything was fresh, flavorful and quite tasty!  This will certainly be our go to Thai place in Phoenix!"]], "Chandhra Thai Restaurant": [], "Wild Thaiger": [], "Krua Thai Cuisine": [], "Red Thai": [["Kevin P.", "I like my food,especially southeast Asian food to be hot and thank goodness this is one of the few places I've been to where the dishes that say they are spicy actually have a good burn to them.  It's nothing outlandish but you do start to sweat and feel the spices in dishes like the hot and sour soup.  I can't keep track of the number of thai, vietnamese, mexican, indian, chinese, you name it restaurants where I order a \"spicy\" dish and I'm left disappointed in the heat level.They put a unique twist on a lot of dishes which I appreciate.  The hot and sour soup was like no other hot and sour soup I've had and they sometimes even warn you when you order the Pad Thai that it isn't going to be exactly like the dozen's of pad thai you can find in any restaurant here in Phoenix. The Anime behind the bar can definitely lead to some amusing conversations..."], ["J K.", "Their pad Thai was sorely disappointing. It was much too saucy and too sweet. It wasn't true at all to what you would normally call pad Thai.The red Thai chicken and rice on the other hand was very good. Mostly rice than chicken (it is a cornish hen after all), but good no less."], ["Rebeka J.", "I love Red Thai, they have awesome Red Curry. The reason I didn't give it a 5 star review, the staff. I work nearby so we go at lunch time. They have a great lunch menu, great price, but it's dead. The staff is really good at holding up the bar with their bodies. Basically leaning on it all day. It's rare to get a smile out of them, it's more of a \"ugh, how many? sit here.\" and a dead pan face.I don't know if they inject sleeping pills in the water or what, but getting some sort of energy out of any of the servers would be a feat. It's also going to take the entire hour lunch, because of the staff. The food comes out quickly, there's no issue in the kitchen. It's how long they wait to get your drink order, then food order, then check, it's kind of silly.Thank goodness that damn curry is so good, it makes up for the lack of customer service."], ["Jeanie C.", "Thai restaurants and I go way back, if you are looking for Thai food...this isn't the spot for you. I give it two stars only because the pork pot stickers were decent, the servicers were attentive and it was a neat ambiance. Ordered spicy chicken basil, no bueno. All the food was very bland. My husband had the crispy noodles with beef, the meat was chewie/grisly. He asked for it spicy and they brought him a side of chili paste. Not sure why they couldn't make it spicy for him while preparing the food. I won't be returning."], ["Norm R.", "My colleague and I decided to have an early dinner here because we both love Thai food and wanted to try a place with an out-of-the-ordinary atmosphere. The staff was friendly and attentive and we were seated immediately; the place was spacious enough to be able to accommodate a significant dinner crowd. The lengthy layout and projected anime on the walls gave the place a modern informal vibe. Being able to arrive early enough to take advantage of happy hour prices was a plus for this visit. The food was flavorful, well-presented, and reasonably priced for the quality."], ["Susan M.", "So I went here with a group of friends for the Drag Show on Friday night.  First off we waited for over a half hour WITH a reservation and we were getting ready to leave when they finally found a place for us.  They comped us our first round but at the prices they charge......made up for it on the next round.  I had an adequate Cosmo and the Yellow Curry was very spicy, even though I asked for mild.  It was still quite good and full of veggies. The waitress was chatting after the show ended and I walked my own bill to the bar to hurry her up.The drag show was just okay.  Not great but not bad either.  Overall I was not impressed.  It would take a LOT for me to be enticed to go back.  Like a lot.  There are too many other places to try in a city of this size.  They just don't stand out and the service was horrid."], ["Xigua F.", "I went last Saturday to have a late lunch in the early afternoon. The restaurant was relatively empty with only few customers. I ordered chicken pad thai and the meal did not resemble typical pad thai I usually got from other thai restaurants. It was watery and disgusting. On top of that the chicken was not thoroughly cooked and I have the proof (PICTURE). I told the server that I can't eat this because the chicken was not cooked. He then asked if I wanted to order something else and I decided to have the same meal my husband ordered beef basil. I made a bad choice, I should have sampled prior ordering! The meal was as bad as the chicken pad thai. It was salty and beef was hard to chew on.  I was utterly disappointed. I do not blame the workers but I blame the management. They do not provide enough training for the cook to ensure food quality and SAFETY are properly maintained (HELLO UNDERCOOKED CHICKEN). What really irritates me the most I was charged for UNDERCOOKED chicken pad thai (my husband should have reviewed the bill before make a payment). I disputed the bill which then the server refunded our money and made us make another payment with the correct check.The server did apologize but I did not feel like it was a genuine apology.  There were tons of 'hiccups' and 'surprises' dining in this place.  Servers are the nerve center of the business and they should be more attentive to customers' needs, be more observant and deliver a genuine care. Again this is management problem. Management should have trained its workers to meet with the standard of exceptional quality of customer service. I will not return until you fix the system in your restaurant!"], ["Scott W.", "Stopped in for lunch recently on a weekday. I didn't realize there are two restaurants that share the same door but it didn't take me long to figure it out.  I was greeted quickly and service was good throughout.  I had the lunch red curry with chicken.  Interesting take as was the first time I had pineapple in that dish. The food was good and reasonably priced.  The one thing that drops it a star for me and I probably wont go back for lunch is a lack of brewed iced tea.  I had a choice of a couple of flavored bottles or a Thai tea.  I chose the Thai tea and it was good but at $5.00 it took a reasonably priced lunch and bumped it a price point."], ["Heather C.", "Went there with some dear friends a few months ago when we found out Shabu Fondue is closed on Mondays.  Then returned with my husband a few weeks later.  Although I basically ate the same things on both trips, I guess I can say they are consistent.My favorite dish was the hot and sour soup with shrimp.  I expected it to taste like the usual you find in every Chinese restaurant.  I was sorely mistaken.  Theirs is so much lighter, very spicy, but less on the sour.  I also tried the kobe pho which I did like, but it seemed boring compared to the hot & sour.  We also tried the pork gyoza and spring rolls, both very good.  My surprise of the night was the fried tofu my friend suckered us into ordering.  One, I hate tofu.  Two, see number one.  Well apparently, much as the State Fair has figured out, you fry anything and it becomes delicious, especially with the dipping sauces.  In fact, it kind of reminded me of paneer. Unfortunately, what's also consistent is service.  Not terrible, but could be better.  My husband and I asked for small bowls since we were sharing the soups.  We had to ask twice.  I ordered a bottle of sparkling water and had to ask for a glass.  It was a one litre bottle.  Just little things that could be better, but overall, I really enjoyed both visits.  Oh, and they run anime movies on big screens behind the bar.  My husband loved that."], ["Jacque R.", "Great addition to Sunnyslope. Sister restaurant is Sochu House in Central Phoenix. There are two restaurants within: Red Thai & Shabu Fondue. This review is for Red Thai. Price: $36 (two dinners & appetizer) Flavor: Perfection. Mild - request heat. Seating: Plenty of options, tables, booths and bar is length of restaurantService: Friendly & quick"], ["Alan K.", "Loved this place. Modern decor for sure. The food was excellent. Appetizers, soup and red thai curry. Yum."], ["Natalie D.", "Chef Johnny Chu does it again.  Every dish that our table ordered was outstanding. Make sure you get the hot and sour soup, the tofu spring rolls in rice paper, and the Papaya duck mint salad. For the wok dishes, I suggest the Hong Kong flat rice, Black Dragon, House Dynamite, sizzling shrimp, or the spicy basil. They are all good! :)"], ["Eric R.", "Came in here for dinner one night. I like the place, it's got a good vibe and my beef stir fry was good but nothing to write home about. I suppose by Arizona standards, where crap ethnic food is the norm, Red Thai manages to stand out as one of the better options for Asian cuisine in the area. But if you come from L.A., San Fran, New York, etc. you're bound to be disappointed as you've been by many other Asian establishments in The Valley. I REALLY like the bar. It is the stand out feature of the place and I think it's a shame that they close so early because I think they could do a decent business later at night with the bar crowd. I know it's a little isolated but other than North Central Sports Bar, there really is no other place nearby to catch a drink and I think these guys are missing out but not staying open later.I would certainly be open to coming in again. If they stayed open later I would be a in a lot for drinks and late night munchies."], ["Aaron B.", "So glad to have found this place. We tried just about everything on the menu, and had great recommendations and service from our bartender Michael. I highly recommend the yellow curry, red Thai chicken and rice, potstickers, and pho."], ["Lori A.", "Awesome place! I had no idea it was here. Amazing ambience and music. Great atmosphere and huge screens playing anime, totally awesome.  Food was great too! :-) The almond chicken was so crunchy and juicy."], ["Brian O.", "The best Thai Dynamite chicken I've had in Phoenix.  I was sad that I lost Sochu house and then heard about Red Thai.  Love the openness of the space inside and the minimalist decor works well here.  The Japanamation is also a fun touch on the walls.  They have martinis similar to Sochu as well as the wonderful sugar cane pork.  Red Thai, you're a little further away but worth the drive.  I can't wait for my next red martini at Red Thai."], ["Margaret M.", "I'd like to preface this by stating that I have never written a negative Yelp review.I am disgusted by the way the owner treated me today. He was extremely rude, dismissive, and unprofessional.He is currently standing in front of me at the bar, ONLY tending to two guests, and is loudly speaking about his $400.00 phone bill and why that is - \"I f*cking watch too much mother f*cking porn.\"Hmm. Ok.That's great. Do what you want, but please for the love of the hospitality industry and courtesy for those around you, TRY to act as though you are a business owner or respectable human being at the very least.His style of customer service (or lack thereof) has clearly bled into the rest of his staff. Every bartender and waiter I came across was cold, inattentive, and a carbon copy of their boss.This is the worst dining experience I have ever experienced in my life. Needless to say, I will never return to Red Thai.I advise you all to spend your money elsewhere."], ["Paul S.", "1st time here. Happy hour specials and anime will make this my go to spot at least once a month.The yellow curry with chicken is excellent and the pad thai is a winner in my book.  Next time, I'm bringing friends!"], ["Bao H.", "(Lyrics The Rolling Stones - Paint It Black)I see the Red Thai and I want to try it outSo many options I want to eat them allI see Chef Chu walk by dressed in his kitchen clothesI have to try the shrimp and some more eggrolls I see a line of peeps and they're here for Red ThaiWith mixed drinks and a beer, both always worth a come backI start to Bo Bite and quickly rate awayUnlike a newbie Yelper I just Bo Bite everydayLocal celebrity Chef Johnny Chu's Red Thai is a new restaurant offering up Vietnamese and Thai fusion food.  As you walk towards the restaurant, you'll notice his signature night light theme; violet, bold red, and let's not forget statue of Buddha!  As I walked into the main room, first thing I notice was Anime movies playing across the walls behind the bar.  The wall is literally the screen projector.  Overall, the place gave off a nice vibe and energy!I came here with a group and as we ordered our drinks and we couldn't wait to be seated to order some bites!  We started off with some appetizers; Spicy Mint Shrimp, Thai Fried Chicken, Saigon Egg Rolls.  All sounds pretty exotic and it was.  I have to proclaim this; I love the Spicy Mint Shrimp!  I could eat that sauce with rice any day and any time!  Spicy indeed, while the onions and mint gave it a pungent aroma along with some texture!  The Thai Fried Chicken was good and crispy and cooked to perfection; the way it should be! The Saigon Eggs Rolls was a nice compliment to finalize our appetizer round; nice and crunchy along with a refreshing papaya salad.  Moving on to the entree we ordered the Sweet Ginger Fish.  The Thai ginger sauce was definitely sweet and it was glazed over chunks of breaded fish.  Overall, I liked it, but not as much as my appetizers.  The sauce was okay, but I would have liked to see the entire fish fried and battered then glazed with the sauce.  I think I'm an old school Asian that can appreciate that sort of presentation. - Enjoy!"], ["Sam H.", "Great service! Showed up around 6-7pm on a Wednesday and was seated right away. Ordered a cucumber cocktail and chicken spicy red curry. The dish had plenty of veggies and chicken . No complaints at all! The spice was between 1-2 Thai hot (I love spicy food, may be too hot for others) my cocktail however wasn't terrible but wasn't on point. I still would highly recommend for others to try out this place!!! Environment was relax, dim, with a wall dedicated to inaudible anime playing."]], "Thai E-San": [["Angie F.", "Good Thai food. We love their drunken noodles, bbq spare ribs are awesome, and their sticky mango dessert is great. :)"], ["Dara P.", "Best Thai food in central Phoenix, hands down.  If you are looking for tasty, authentic Thai food that is prepared with fresh ingredients rather than an Americanized version of Thai food, Thai E San is the place you want to go.  We dine in and ordered take out regularly and we are always pleased.  The food is consistent and the flavors are very authentic.  The restaurant staff are pleasant and very attentive. The portions are a good size and their prices are reasonable, especially considering the excellent quality of their food.  And as a vegetarian I have to say that they know how to cook tofu and don't skimp on it in their dishes. And the variety of options here for vegetarians is very good. The tofu satay is a must.  Their vegetarian Pad Thai and Massaman Curry are 2 of our favorite dishes.  Everything we've tried has been delicious!"], ["Graham G.", "Came in since the reviews were so good and now I see why! Spring rolls = amazing!! BBQ Chicken = melt in your mouth! Pad See Yew = Fantastic! Massaman Curry = spicy but so so good! I'm kind of an expert in Thai restaurants and this is definitely one of the best Thai restaurants in Phoenix. Oh and super friendly staff! Helps when u tell them u saw them on yelp"], ["Michelle C.", "Even though I arrived 10 minutes before they opened, I was happily seated and promptly served. My red curry was the perfect amount of spicy (medium) with all the complex flavors as expected in Thai food. The restaurant was very clean and the staff was friendly and speedy."], ["C A.", "For all intents and purposes, this place delivers what is promised; good Thai food. The coconut soup was surprisingly delicious and so was the yellow chicken curry. I think we'll come back for some coconut flavored ice cream. Delish!"], ["Fletch S.", "I love this place! Some of the best Thai food in Phoenix!  The owners are wonderful and extremely friendly and hilarious!  I always have an amazing experience!"], ["Nicole R.", "Since we were just working in Phoenix for the weekend, I yelped \"Vegan\" to see what options this city had in store for us. Thai E-San was highly rated with great reviews that proved to be true!. The owner was great and let us know everything was made to order and that we could pretty much pick anything to be prepared Vegan. The Pad See-Ew and Eggplant were cooked to perfection. We ordered a 3 on the spicy scale of 1-5 and that was HOT, but so goooood. To-go portions were generous as well. Plenty of food for 2 people to share. If we lived here... we would definitely become regulars."], ["Neema E.", "We were greeted quickly and very warmly upon our arrival. I asked if they had a cocktail menu and they did not, so I asked for a mojito. They didn't know how to make that, so I asked for a tequila with soda and lime. The bartender came back to our table about 5 minutes later and said they didn't have lime. What?! Isn't lime one of the primary ingredients in Thai food? The crispy spring rolls arrived and while I would have preferred spring rolls without chicken, they were hot and fresh, if not a bit greasy. The pad thai was nicely seasoned but again, could have used the acidity of the lime to balance out the sweetness of the tamarind. My husband enjoyed his royal yellow curry with chicken and we shared the egg fried rice. Service kind of went downhill as the restaurant got busier. Our waters were not refilled and we were not asked if we wanted additional drinks. We sat around for about 15 minutes waiting for the waiter to ask if we wanted our check and finally, we just got up and went to the front register to cash out."], ["Anu M.", "Great food,  quick service. And a 4/5 spice level was a touch spicier than I expected.  Next time I'll stick with a 3!"], ["Liz B.", "The best Thai food in Phoenix. Great atmosphere. Will never go anywhere else.  Must try!!!!!!  Thank you for the amazing service. Staff is amazing from the moment you walk in to the time you leave."], ["Todd C.", "I am quite fond of the decor, and chu chee duck. Especially with eggplant. And all the staff are lovely people!"], ["Kazi H.", "Our Thai food craze continues...We were searching for a place close to Lux and saw this place. It's in this shady little strip mall thing, if it even can be classified as a strip mall. I'll just call it that for now. Anyway, we walked in here and the place was cute. It had an old feel to it. It was pretty empty. There was one other Person in there besides us. I got something with beef. As I usually do. I love me some cow. And my friend got the sweet and sour chicken, of course. Everything was super tasty and delicious. Service was good. And prices were good. We left satisfied."], ["Noor B.", "Not bad. Cute decor, friendly staff. I thought the pad thai with tofu was a bit sweet - I like pad thai a little spicier, and it was greasy. Portion size was fair. Red curry with tofu was also too sweet. Perhaps that's the personal taste/preference of the owners.I think my other staple Thai restaurants in Central Phoenix were closed for a holiday and Thai E-San was open, I wouldn't mind stopping in, but I don't think I'd make a special trip of it. However, if you like sweeter Thai dishes, Thai E-San might be a good way to go."], ["Ann S.", "We were at the Thai E-San recently as our friends had recommended it. The food was less than luke warm, like it was sitting in the kitchen and quickly put together. The restaurant was not even closing for another hour, so that was not an excuse. I am not in the habit of complaining, as the food should at least be hot when it arrives at the table. It was not as flavourful either. Very, very disappointed. I would not recommend it to anybody."], ["Joey W.", "Best thai food I've had in a long time. Dishes are fresh and spicy. Wish I lived closer."], ["Tara L.", "The curry and the pad Thai were so good! Defiantly added to our list of favorites! Thanks:)"], ["Bill B.", "Their $7.49 weekday lunches are such a great deal. Even the soup that comes with the lunch is yummy. It's not on the lunch menu but they always make the Yellow Curry for me upon request. The Spicy noodles are very good as well."], ["Dominick J.", "One thing is great customer service. For the first time the owner of the restaurant responded to my review and took it as advice to better the restaurant. For that I change my rating from 3 to 5 stars because the only reason it was a three was customer service. Besides this, the food is amazing and priced very reasonably. Definitely one of the better thai restaurants in Phoenix"], ["Rand H.", "= = = = = =  WEEKEND LUNCH BUFFET!  = = = = = =Liz S. brought 14 of us Yelpies together for a great UYE here today.  This Buffet featured 19 items including two soups, salad, lots of different unlabeled but DELICIOUS hot dishes (spiced mild to medium), & little donut hole things for dessert.Dining room comfort and table service were excellent & we all had a great time, so it's 5 Stars for this newest Thai Buffet in the Valley!     :-))Weekend Lunch Buffet:  $9.50"], ["Ukay N.", "Tried this place for the first time tonight -takeout. The service is great, nice on the phone, and were prompt making sure I was attended to. Got the vegetable green curry- 4star and pad Thai 3star. Green curry is nice, it was a true 4star spicy, vegetables crisp and cooked just right, but sauce did have more of a sweetness than I'm used to. Bf got the pad Thai, and he liked it. Will be back for sure!"]], "Reign Of Thai": [["MU S.", "Excellent! The paennang curry with tofu and vegetables was the best we've had in a long time. The atmosphere is clean but still cozy and the decor is nice as well. One of the owners was our server. He was really helpful, friendly, and informative. We also had a spicy drunken noodle dish, which had lots of fresh vegetables - also really good. The portions were large. We both took home leftovers."], ["Parker T.", "I love Thai food. But I always end up trying the same entree. That is why this place is so great. I don't know of any other place that has a Thai food all you can eat buffet. I tried five different Currys, two different noodle dishes, two different soups, and everything was excellent."], ["Roam J.", "Ate for dinner - food was okay with very big portions.  For spicy level I normally order 4 or 5 at Thai restaurants, but we played it safe and did 2 since my wife prefers it more mild.  WARNING - the food was waaaay spicier than 2 and the wife couldn't eat more than a couple bites.  It even had me sweating a little - I made a comment to the waiter and he proudly told me they use fresh ground peppers and their 3 was a 5 at other places.  That's great and all - but a little up front warning would be nice since we did say we wanted to keep it mild.For dishes, we had pad Thai and green pineapple curry.  Quality was good and the curry made for great leftovers.  Still, I felt the food overall was average and didn't come close to unseating Siam as my favorite Thai food in the valley - I suppose I'd give 3.5 stars if I could."], ["Becca N.", "Let's start with the soups. Out of this world delicious. The Silver Noodle and Tom Kha are spectacular. Deeply flavorful. Hands down some of the best soups I've had in a long time. Clearly I can't recommend Reign of Thai's soups more. On to the noodles. The Pad Thai is always a good point of comparison, and sadly, Reign of Thai's Pad Thai was a major swing and a miss. It was waaaay too sweet, lacked any kind of complex flavor, and even my kid said it was gross and wouldn't eat it. Yuck. The Pad See Ew was ok, but nothing special. It was edible, at least. Larb is one of our very favorite dishes and sadly, this white girl makes a far better larb in her own kitchen. It majorly lacked one of the signature flavors of larb: toasted rice powder. It's like they skimped on it. Not cool. They also really skimped on the service. Awful. Just awful. Aside from actually carrying our dishes to our table, there was literally no service. He never checked on us which made it difficult to ask where our missing dish was. It also left us very thirsty.All in all, Reign of Thai offered a good soup experience and I'd come back for those. But only those. Otherwise, it's not worth the trip if you're looking for an authentic, high quality Thai meal."], ["Lucky T.", "Sometimes a little too hot for my own taste, but this very tiny place really tries.  Good flavor for everything at their buffet with great soups for sure.Pad Thai was sub-par to me, but the chicken with pineapple curry was really good and filling.I did try some ginger chicken but way too hot, and I did keep choking on the lemongrass soup with the red peppers floating in it.The food, tho, is clean and plentiful--just a little hotter than this American taste can handle often.One negative is that there is no dessert at all on the buffet which surprised me, since I don't think I have ever been to a buffet with no offering for dessert.  Something would have been nice.One caveat:  Went on a hot Summer day for about 1.5 hours, and their electricity (lights, fans, etc.) went out about 8 times--but immediately went on again.  They must have someone standing there and flipping the switch at the electric box all the time.This is a good Thai place, tho, and if you like your hot at a 3-5 level you will just love this place. Unfortunately, I don't like it that hot."], ["Randy C.", "WOW ~ Best Thai food on the planet ~ So fresh & crunchy, loaded with spices & flavor. If you have not checked out this hidden gem yet, boy are you missing out. We have been here a few times, and it keeps getting better. I love spicy food, and usually order the spice level on my dish at level 4, but you can adjust it anyway you want. The food here is PHENOMENAL !"], ["Jenpin W.", "Unfortunately they don't allow byob anymore and still waiting for their liquor license.We recently tried their calamari pretty darn good"], ["Tera C.", "Came into town from Utah for a little getaway. We are fans of Thai food and thought we'd check out a local restaurant. I think we chose well. I ordered the red curry at a spice level of 4. 5 is the highest. I think 4 was good for when I want to be a little uncomfortable but still enjoy the meal. Chicken fried rice, pad Thai and red curry (spice level 1) were also at the table. All good, according to the party. Would definitely return but maybe choose spice levels one step down. Most Thai places I've been to in Utah that have a \"native hot\" (tends to be the highest on the scale) designation don't tend to serve food spicier than what I had at Reign."], ["Moe G.", "This place is AMAZING. Whether you do the lunch buffet or order by plate, you'll love what you get. No matter what though, you must try the mango with sticky rice. It's perfect!"], ["Cristie R.", "Love this place!  Excellent lunch buffet, spring rolls, staff and they have a BYOB option."], ["James F.", "We come for the Buffett and never leave disappointed. The curries are awesome and everyone loves the coconut soup. You need this Thai food in your face. Trust me"], ["Scott W.", "So I get this notice across Facebook that some of my friends want to go to the Sunday buffet here in about 2-1/2 hours. I really like Thai.   I had to call my help and tell her not to come in and went off to meet Monica, Rand and Norm.  What a lovely place to have lunch, or probably dinner too.  My favorite Thai dish is red curry with chicken and theirs is very good, with the heat level at medium which I like.  I tried several other dishes and liked every one.  The owners are super nice.  Keeping in mind this is a buffet, I know at least three of us tipped in the 18-25% range because of the quality of food and service and the value of the meal."], ["Monica O.", "It was a spur of the moment thing and happy that it happened! I met up with Rand H, Norm R & Scott W to try the Reign of Thai buffet on a Sunday afternoon.Every item in the buffet looked delish and fresh,  I tried a variety of things and enjoyed them all, egg rolls, chicken won tons, pad thai, beef massaman curry, chicken pangang curry just to name a few.   Massaman curry is my favorite curry, and normally I chose chicken but the beef was good too!Service was friendly and learned from the server that it was her aunt and uncle who cooked all the dishes.Sundays buffet was 10.99 and it is very much worth the price! If I am ever in the area again you bet I will be back!"], ["Bill W.", "This place has great Thai food with really good, friendly service. A family operation, they really pay attention to their clients and make their clients feel as if they are guests enjoying a family meal. Food quantity is large. Definitely watch the spice level. Level 5 is Thai hot, hot, hot and really for the very serious spice lover. A word to the wise....The fish cakes are some of the best around. This is definitely one of my regular places!"], ["Kyle F.", "Great food! Hard location to find. I love the yellow curry here! The spicy food here is great. A lot of flavors to love."], ["Norm R.", "I've always enjoyed dining in this location in its previous incarnations and it seems that the dining pleasure will continue with this reboot. The new owners have done a good job with new decorative touches and with maintaining the bright spacious ambiance of the place. My yelp friends Rand, Scott, Monica, and I tried the Sunday lunch buffet and I thoroughly enjoyed pretty much everything I had. I started with mussels in a gingery herbal broth and proceeded to sample each of the main offerings - the flavorful pad thai, the delicious eggplant and tofu dish, the spicy curries, and other meat and vegetable dishes - all very good. The lively young hostess made sure that our water glasses were always filled and the dishes taken away as we went back to the serving area for more helpings. I'm looking forward to literally many happy returns to this restaurant."], ["Elizabeth S.", "I've tried the lunch buffet and it is really good.  The food is fresh and there is a good variety to choose from.  The service is helpful and friendly.  I have not tried dinner off the menu yet, but that is next!"], ["Jennifer O.", "I had the pleasure of attending the ISC UYE here a couple weekends back and was pleasantly surprised by the Thai buffet offerings. This place has a legit buffet with dish after dish of fresh Thai foods (and the employees continuously brought out fresh food). They had a tasty lemongrass soup, a delicious spicy chicken dish, and several tasty curries. Additionally, their eggplant was tender and perfect. They had all types of meat, noodles, tofu, soups, curries, and even vegetarian spring rolls... huge range. This place is fairly far from my house, but If I were craving a Thai buffet, I would certainly return!"], ["Amanda L.", "This is my second time here and it's been delicious! Finally was able to come for their weekday lunch buffet... and it was so worth ~$10. I love their coconut chicken soup with a hint of spice, pad thai, fat noodles, and spicy basil chicken.... others tasted good as well but I forgot what they were called... the staff were very nice and attentive. The decor was beautiful and felt authentic. I'm definitely coming back!(Note: parking lot is a bit awkward to get into, but worked)"], ["Brando B.", "First time here; went in on a Friday evening.  Parking lot is small and there was one spot left.  Restaurant was very busy, so we sat at the bar.  The sign by the front door said \"now serving beer and wine\", so if you were waiting for that addition, it has arrived.  We ordered the egg rolls, chicken satays, massaman curry, and garlic sauce.  I had 2 glasses of wine, and it was boxed wine, but this isn't a wine cafe so I'm not going to let that get me down.  Bottom line is this: service was excellent, and the food was the best Thai I've had in the valley to date.  I like my food spicy, and this place delivers.  (We ordered a hotness of 4, which is Thai hot).  The only flaw in the entire order of food was one of the larger potato pieces in the massman was undercooked.  But still, I cannot dock a star off the overall experience.  We will definitely be back.  Another positive I feel I should mention is that they have televisions... so now you can go on Sunday and catch some games while you eat :)"]], "Thai Basil Signature": [["Patricia B.", "I just noticed this place a few weeks back and had to go there to show my support ; )We ended up there for a weekday dinner and the food and the service were great.Our server Raul was very nice and friendly. He made some recommendations and clarifications to help us decide.We had spring rolls (veggie, flour fried ones), very tasty and crispy.I had the coconut soup and hubby had the spicy noodles.That soup I love and it was up to my expectations. Hubby did like the noodles too.We even made a big exception and had dessert : ) the fried banana something.Hope to be back soon!"], ["Trent P.", "My wife and I have been by this place a number of times and always said we wanted to try it. Well, we finally did before our movie. The decor is so-so, and there is a full bar crammed in the back. The restaurant was very clean and void of patrons other than us and another couple.I had the Drunken Noodles. They were good but nothing spectacular in the taste department. The portion was a fair size and price. We split a pot of green tea, which turned out to be Lipton brand and very pricy. We switched to the loose leaf jasmine tea. It tasted better but was still pricy.Overall, a solid 3-stars. There are plenty of Thai places in the Valley and probably won't be returning here any time soon."], ["John G.", "Went to Thai Basil for lunch.Ordered the Panang beef off the lunch special.First came a salad - attractive, but WOW!  the dressing was overpowering (maybe get it on the side).The Panang was good - not a fan of green beans in Panang, but the curry was tasty. Not a bad place to grab lunch if you're in the PV Mall area."], ["Bryan J.", "Delicious!!  That food was amazing!  I have never been here before, but have wanted to stop in every time I walked by it.  If you are thinking the same thing, you NEED to stop!  I got the Signature Dish with pork and medium spice, TO DIE FOR!  I will definitely be coming back here again.  Thank you guys for an amazing meal!"], ["Ashley P.", "My mouth watered as I looked at everything on the menu. It all sounded so good. I decided on the Thai Basil Signature dish, thinking it had to be special. My husband got the Dan Dan noodles. I was not very impressed with either. Not much flavor to me. I did like my husband's dish more though. I am hoping to try this place again but get something different, maybe it was an off night. The service was very friendly."], ["Dwayne O.", "From the previous reviews I was expecting alot from this restaurant. Honestly wanted to like this place but did not live up to expectations. Ordered the Coconut Shrimp,  Drunken Noodles,  Chicken Curry and Thai Basil Fried Rice.The Coconut Shrimp was pretty good, the Drunken Noodles were good but did not leave an impression. The Chicken Curry was tasty. We ordered the yellow curry but the base was a little on the watery thin side. I prefer it to be a little bit more thick. The fried rice was just average. The service was good and fast.As we finished,  they brought take out containers and as I poured the curry base into the plastic container there was a hole in the bottom and began to leak out. Half of the liquid base poured down the table onto the floor.One of the workers was real concerned and the other asked how was the food.Was not overall taken by this place and not to certain to return."], ["Rodney C.", "I've always been a fan of Thai Basil. Their new location in Paradise Valley Mall next to Sears has the same great Thai food I have enjoyed at their Tempe and Downtown Phoenix locations.I honestly cannot recommend a favorite dish because you will be very satisfied from anything on their entire menu.I always start off with the spring rolls and dive into a main entrée afterwards. Call me selfish, but my main entrée is too good to share. Get your own. Just kidding.Raul has waited on us on different occasions. Raul is very courteous and very knowledgeable when it comes to the menu.Thank goodness there is a Thai  restaurant in my neighborhood."], ["Joshua H.", "I really enjoyed this place for a number of reasons. I was genuinely welcomed by who I believe is the owner. A very nice woman. She knew the customers who were eating at the establishment and sat down to catch up with them \"very personable\". I ordered the yellow curry with chicken which came with a spring roll and jasmine rice. The curry had just the right amount of heat and sweet balance. Also ordered a Thai tea which was also perfectly sweetened as I did not leave with a new cavity haha. My server a nice younger gentleman who I'm sorry I don't remember his name was very informative of the menu helped me decide what to order. All in all I would highly recommend Thai basil and will probably be making it my go to Thai restaurant."], ["Sarabear B.", "A friend and I decided to try Thai Basil the other night.  We arrived at what should have been the end of a dinner rush.  The place was empty.  There was one other occupied table when we arrived, but they appeared to be employees eating after their shift.The place looks nice, but the booths are uncomfortable. The seats feel more shallow than standard sized seats.  The service was acceptable, but not great.  I was unhappy with my dish, and the server did not offer to adjust or change it.I ordered a masaman  curry, which is usually very mild compared to other curries.  This was not mild at all.  It was so spicy that I could only eat about half a cup.  Masaman curry is supposed to be made with coconut, cinnamon, lemongrass, ginger, cloves and other sweet strong spices.  My dish tasted exactly like a panang curry.  Masaman is coconut based, and panang is peanut based.  They should not taste the same.  The dish was flavorful, but not the right flavors for a masaman curry.I'm certain that my friend enjoyed the signature dish more than I enjoyed mine.  She also only ate a small amount and took the rest to go.Dinner with a shared appetizer, beverage and dessert will cost close to $30 while lunch specials will bring the meal price down closer to $15"], ["SarahJane H.", "I ordered from Thai Basil (2 orders of pad Thai) and when it arrived and hour and a half later the driver wouldn't give it to me even though my card had been charged. he said he wouldn't give it to me because there was no tip on the card. I always tip 30-40% no matter what service I get because I've been a server, I know it's tougher than heck to make good money. But he flat out refused to give me my food with out his tip first. I had a 10$ bill in my hand for him but his attitude was so appalling that I said no, please give me my food. He walked away, with my pad Thai. I called the restaurant over and over asking to speak to a manager. Never was put through and never got my food. I will never order from this place again. Ever. I want my money back since I never got my food, and for some one to please tell that driver he can't treat people that way."], ["Chae L.", "I was swayed by some of the  good reviews and decided to try this place and ordered Thai basil beef in medium heat, hot sour soup, hot; pad thai noodles and mee krob. Hot sour soup was just greasy, Thai basil beef was just so-so, veggies were over cooked, all mushy (yuck), pad Thai was ok, I've had better but OMG!! The mee krob was just gross. Either it was cooked using a very old rancid oil or the noodle itself was old and rancid. I smelled it and tasted it, just because I couldn't believe my nose that it is rancid, yep had to taste it and almost barfed, had get a shot of tequila to sanitize my mouth. :( You bet ya I'll never go back there  again. Yuck."], ["Fon K.", "The best Thai food intown. FOOD HERE  are so fresh and taste so good. the real Thai food in town.  MY FAVORITE is Red Curry, and BBQ Pork.  Their Crab Fried a rice is amazing made from fresh crab meat too.They have lunch special as well for only 7.99 come w soup and eggroll.So yummy :)"], ["Caryn O.", "Wonderful food and very friendly staff. I love coming here because they always have fresh food and it is so artfully prepared. The music whisks you away to another place.My favorite things to get the yellow curry, chicken satay, and the Thai custard with purple sticky rice. The purple rice is not only a beautiful matte yet also shiny black/purple color, it is so delicious! I love pushing it back and forth while I am eating it because it is almost unearthly beautiful. It (the desert) is both sweet and earthy. I never want this place to go away!!Ask for Raul, he'll treat you right!"], ["Hannah R.", "Too expensive for mediocre food. $30.00 for chow mein, pad Thai, and an order of rice.  These are not meals either,  just the main dish.  I have been to many other Thai restaurants were the most I pay for these dishes is $14.00 including sides. The pad Thai also did not have a variety of veggies like the dish usually does.  It just had bean sprouts,  green onion,  and a small sliver of lime.  I would have gotten my meal from somewhere else if my fav Thai place wasn't closed.  My boyfriend also mentioned his chow mein was a ripoff with how much shrimp was in there.  Sorry but not eating here again.  I personally like Noodles and Rice over TB any day because it's not that expensive,  good food,  and delivers."], ["Lilly S.", "This is our 2nd time here. The tom kah soup is yummy. The rice the noodles! Yeah it's good. I'd recommend it to anyone that enjoys Thai food. It's pretty cool that they offer 20% off on orders for $50 or more."], ["Meldy G.", "The BBQ Chicken here is my son favorite. I always come here just buy the chicken BBQ, and the Spicy green beans is my Favorite. The dish is extremely prepared"], ["Shakira E.", "Fresh and flavorful Thai cuisine is served at this establishment. My husband loves the Thai fried rice and I go back and forth between the Pad Thai and Drunken noodles. Service is always friendly and the food is always served nice and hot if it is a hot dish. Go for the medium spice and then ask for the out spice tray so that you can add more spice and flavor if you need it."], ["Jaime L.", "My newest best place to eat at. Flavors are high in deliciouness and very friendly waiter/ waitress."], ["Brittany D.", "I love the Thai Basil restaurants in the area. The food is presented nicely and it is delicious. This particular location is at the Paradise Valley mall and is brand new. The service is great, although I don't particularly like one of the servers due to some attitude he served instead of my meal-- but that is forgivable, he seemed like he was overwhelmed that day. Regardless, the food is really great, the restaurant is clean, and the place gives you a good vibe when you walk in! Good Thai if you're in the area!"], ["Paul J.", "I was in the PV area with friends and they wanted to try it out. I ordered some wings and spring rolls as appetizers. We also ordered happy hour beers and the service was quick with both food and beverage. I'll admit i thought they might do some magic Thai wings but they were just regular, tasty (but kinda small) wings with a sweet Thai sauce. I hosed myself by getting my hopes up. The spring rolls were good.  I got the red curry and it was all that i thought it would be. One of the other diners got a garlic and chicken dish that looked great but didn't have a ton of flavor beyond garlic. The people at my table had never tried curry and after they tasted it said they would go back and try more curry dishes. Parking is in the mall lot out front. At the time I ate there they had a 10% Yelp coupon on your phone. I always love a good deal so with that and HH beers it was sub $ 50 for the three of us. I like the decor once you get inside but I was worried since it is in mall."], ["Marc N.", "Thai Basil is less than 5 minutes from my house, which is great news. The food is solid, but the best part this restaurant is the Manager, Raul. I walked in minutes before they were shutting down, but was welcomed with open arms. I was the only customer in the joint, yet no one rushed me out or made me as if I were inconveniencing them. In a city where non one wants to work, it was a pleasure to find a staff that enjoys their workplace--even when cleaning up."], ["Nicole C.", "What a great atmosphere, delicious food that is well priced, and an excellent staff! So glad you're close. We will be having dinner and staff luncheons often:) Well done, and thank you Raul!"], ["Tina R.", "This is the best kept secret at the Paradise Valley Mall!  The food is good, fresh and affordable and the service is great.  It's tucked in between Macy's and Sears and can be easy to miss.  Our yoga class goes there for lunch and everyone enjoys it.  For $7.99 you can get a spring roll, soup or salad and a generous entree.  The curries are great; I especially like the green curry."], ["Cara H.", "Our waiter was really friendly and sweet. The yellow curry with extra veggies is flavorful and tasty and the BBQ chicken was nicely cooked with a tangy sauce on the side. The cute little mall location is in a convenient area."], ["Arthur Z.", "Had lunch today for the third time. Can't beat the price of $7.99 which includes a salad, rice, a spring roll and the main dish. I had the BBQ pork which are actually two nice sized pieces of pork. Service and ambiance are right on. In a hard to find corner of PV mall, but it is worth checking them out."], ["Keith G.", "Very flavorful dishes. Lunch hour on Friday was very slow, so the service was remarkably fast and courteous! The pad Thai noodles had a slightly off odor and flavor... Everything else was great.Further thought, I had to drop a star due to the pad Thai noodles."], ["Viritpon H.", "I just founded this Thai Basil by PV Mall Just Open 4 days and you need to try out !!! So good!!We love Pad Thai Yummy -"], ["Byron S.", "Wonderful food and excellent service.  We stopped in the mall to do some walking out of the 115 heat and we're very pleasantly surprised.  I had the ginger dish and wife had the spicy rice and both were wonderful."], ["Tyler L.", "Great Thai food, great Thai iced tea, and a great waiter named Raul made it a great night with my lady! :) the food was just spicy enough and very plentiful for the price! Keep it up guys! Definitely a good restaurant with very fast service."], ["Jerri H.", "Good flavors, ordered Thai hot and the waiter gave me a funny look but didn't ask anything else.  I then received food that was mild at best."], ["Keith C.", "To say I had an incrediblyFrustrating and drawn out ordeal with this location would be an understatement. Let me preface with the fact that I'm a huge fan of the other thai basil locations and will continue to frequent the other locations. I will never go back to this location despite how close it is to me and how excited I was that it opened.I ordered pick up to take to my girlfriend as a nice gesture to save her from cooking dinner. When I got to her house and opened our order (chicken pad Thai and beef green curry- our go to every time at every location) and there was one piece of meat in the curry. One whole piece. There were zero pieces of chicken in the pad Thai. I figured I must have picked up the wrong food so I called them back. The managerTo say I have had an incrediblyFrustrating ordeal with this location would be a severe understatement. Let me preface with the fact that I'm huge fan of thai basil and will continue to frequent the other locations. I will never go back to this location. I order pick up everytime and the first two times everything was fine. The third time, I ordered pick to take to my girlfriend as a nice gesture to save her from cooking dinner. When I got to her house and opened our order (chicken pad Thai and beef green curry) and there was one piece of meat in the curry. One whole piece. There were zero pieces of chicken in the pad Thai. I figured I must have picked up the wrong food so I called them back. The manager apologized and said next meal would be comped since I didn't have time to go back and have them  apologized and said the next full order would be comped since I didn't have time to go back and have them remake it. Reasonable solution in my opinion and I was happy again.  I asked the manager to please make sure her team knew about our meal and she assured me I wouldn't have any issues redeeming my meals when I called back.Two weeks later, I decided to take thai basil up on the standing offer. Except no one knew what I was talking about when I called in. The man I spoke with said he'd have to call the manager to check and would call me back. No call after an hour so I called again. He said she remembered only one of our entrees having a mistake. I was frustrated and gave him my contact info to have the manager call me directly.She never called me back so I called again a few days later and I had got the same \"I have to check with the manager\" from a girl this time, followed by no phone call, so I called back again 30 minutes later. Same story about one meal so again I gave this girl  my contact info and let her know I expected a call back this time. Again, no call.My ask was very reasonable- a simple call back so we could have a conversation about this specific incidence and the manager either felt it was unnecessary or the staff did not inform her. Either way the service is inexcusable and for a new location that is constantly empty, this is not the way to win over repeat customers."], ["Eliana I.", "This place is awesome. I ordered the red curry and thai iced tea. The curry had plenty veggies and chicken, that it made my tummy satisfied. The lunch special includes a spring roll and soup! The service was great. The waiter let me sit wherever I wanted. I have absolutely no complaints I love this place!"], ["Chris N.", "I've tried a bunch of Thai places around town, and even around the country, but this one wins every time. And because it's so close to home, I just feel like belting out Sound of Music's \"I must have done something good\". I'm a creature of habit so I tend to order my favorites (Pad Thai and Green Curry) every single time. Everyone raves about the taste when they try it. How do you solve a problem like finding good Thai food? Try Thai Basil."], ["Angela C.", "Raul is amazing. Great food. Great service. Super fast. I would strongly recommend the chicken pad thai."], ["Jamfan F.", "Really good, fast delivery, fresh and tasty Thai!  The fish cakes and curry are really good.  We also had a noodle dish with chicken and a pork dish.  Excellent customer service.  So happy to have a Thai place that delivers!  Have not dined onsite, so cannot comment about that."], ["James M.", "Fabulous !  Dropped for lunch on a whim and had the best pork larb salad ever.  Nice ambiance and very friendly service.  Only drawback is its location is not obvious at PV Mall (between Sears and Macy's). We will definitely be regular in future."], ["Sandi O.", "I'm sad, not really though, to report that I found nothing special about this brand.  The service was mediocre at best, the food while almost tasty did leave a lot to desire and when you add into the mix that we had to ASK for napkins, wait several minutes for them to serve the rice and not bring silverware, causing me to eat with a serving spoon, guess it's a good think I have a big mouth.  I'll not be rushing to eat her again even though I really enjoy Thai food.  Guess I was spoiled by a previous Thai Restaurant that has sadly gone out of business."], ["Chelsey Y.", "My boyfriend and I just had lunch there and got two noodle dishes. The service was friendly and the food was delicious and out in a timely manner. The restaurant itself was very clean and inviting. I would definitely recommend!"], ["Stefanie P.", "I have never written a review before but felt so strongly about our recent visit here that i found it necessary to download the app just for this review. The service was awful. No one seated us. There was only one server for the restaurant and he wasn't able to handle it even though there were only 3 tables at any given time. He was unfocused and needed us to repeat ourselves several times. He never checked in on us or refilled our waters. They also neglected to clear any tables after people left, leaving loads of dirty plates and trash sitting there for the duration of our meal.We loved the potstickers and dipping sauce but other food was awful. I ordered the grilled seafood (an $18 entree). The calamari was inedible, the fish, mussels, and shrimp were way overcooked. The \"salad\" was large torn pieces of unwashed romaine without dressing. My husband ordered curry noodles that he described as \"disgusting\". The curry was watery and the chicken seemed to be haphazardly cooked. This dish had the appropriate spice but was swimming in coconut milk and lacked the actual curry spice.Needless to say, we won't be returning."], ["David S.", "Despite it's location (attached to the mall), I'm going to highly recommend this it you like Thai. The other 3 reviews did not lead me wrong with the recommendation for the Pad Thai. It wasn't until I had devoured half the meal that I thought about taking a picture. The presentation was very neat and I really enjoyed the flavor of the crushed peanuts. I ordered it with a medium spice. At first bite I was worries I'd made a mistake, but as the temperature cooled, so did the spice. Do yourself a favor & check this place out :)"]], "Krachai Thai Kitchen": [], "SaBai Modern Thai": [["Marial F.", "They are awesome. I had my birthday party here and they didn't freak out when I said there were fifteen of us. Don't be afraid to customize the menu."], ["Kelvin T.", "1 star for the friendly waitress, 1 star to the cleanness of the restaurant.  I am disappointed the food at this place, can't really taste the Thai flavor from their food.  Hot, sour, spicy, saltiness...are not there.  I believe the food is fresh made cause it is so hot when it serve on the table but the taste got very disappointed.  The soup is vegetables soup with a lot of grounded pepper (which made it spicy).  The green curry beef, only got 6-7 slices of beef and mix veggies, the curry had very light curry taste to it, barely tastes few drop of coconut milk.  Where are the lemongrass, basil, limes, Thai chili, coconut milk...I can't taste any of that from the food and soup here.  The portion of food is like a kid meal, if you are hungry and looking for Thai food, i won't suggest to go there .  By the way, I like the glass of water with couple of cucumber slices in it, it tastes a bit freshness."], ["Beverly W.", "Quite disappointing.  We started our lunch with a bowl of Tom Yum soup.  The usual hot and sour became hot and sweet.  It tasted like it was cooked with tomato paste.  The pad thai was way too sweet.  Spicy fried rice was bland with big pieces of carrots, broccoli,  and jalapeños.  Also, way overpriced."], ["Catherine C.", "I don't live in Phoenix, so I don't really know what the general standard is for Thai food here, but this place wasn't very good.  I ordered the spicy beef salad and the tom yum soup, and ordered both medium spicy.  Neither dish was spicy at all, the beef was overcooked and underseasoned, and the tom yum soup was too salty and lacked substance.  It was basically shrimp broth with some sliced mushrooms.  Service was good, but everything was definitely overpriced, especially for the quality of the dishes served.  Very disappointed."], ["Mimi J.", "On my last visit to Phoenix we hungry ( yet lazy) so we decided to order delivery from SaBai Modern Thai.  We found the website very easy to use.  The menu items are sorted by type of food: appetizers, soups and salads, house specialties, stir fried entrees, etc.  When you select any item, a window appears asking you to designate a spice level for that particular dish on a scale of no spice, medium, Thai hot, mild, or hot.  You can also designate special instructions such as no onions.  I ordered my dish Thai hot, but my fellow diners stuck to the mild level.  I chose the Mussaman which consists of braised boneless beef short ribs in classic mussaman curry with potatoes, carrots, onions, whole peanut and cinnamon essence.Our food was delivered quickly; everything was still hot, and the food was packaged securely enough that none of it spilled.  Things started out very well.  They ended well, too.  The dishes were generously portioned and quite delicious.  I couldn't finish all of my rice and curry, so I had enough left over for breakfast the next morning.  I didn't try any of my brother's dishes, so I can't comment on those, but mine was delicious.The convenience of having food delivered right to the apartment was quite a treat.  I'd definitely order from here again."], ["Vanessa G.", "Sai Bai never disappoints. I wish the size of the thai tea was larger, or they were cheaper.. because I accidently drink the entire thing beforw my food even comes. No self control! But please order thisAs for food, I always go here for Lunch and their Lunch menu is reasonably priced and you get a big portion as well, so get ready for leftovers.I love the classic pad thai, and any of their curries are amazing."], ["Angela H.", "Crazy busy street to walk on to get here.  You can tell this used to be a fast food joint.  On the outside, it is not so inviting.  GO INSIDE.  GO.  Lunch time was groovy.  The seafood soup is a coat of warmth.  I only did the broth.  The even leave the shells in it. LEGIT.  I am a carb loving fool.  Anyone that is happy in life knows that carbs are what makes the world go round.   RICE ME.  Yep.  I took that plate down like they were taking me to the electric chair.  Balls to the walls awesome.  I even ate it with chicken.  It is something I am trying, chicken.  Whatever.  It was super tender.  Veggie Heaven.  The best part, you ready.  I do this at home on my dishes.  FRESH BASIL.....on hot anything, breaks it down.  On the bite you devour, pops all in your head and just makes dining that much more enjoyable.  Service was groovy.  Huge lot for free parking, hard to come by in the PHX.  Valet here and there.  Give me a break.   I hate touristy crap.  So I was happy I found this spot.  Thanks Yelp.  Great Vacayyyy...Hey."], ["Ken O.", "First impressions was it was going to be a wonderful experience. The bathroom was exceptionally clean. Food was just ok. The owner sat around talking to her friend and her kids while the waitress tried to keep up with the orders.  The owner was completely inattentive to our needs or others waiting to be seated. First and last time for us. I hate to have to box my own food to take it home.  They don't go out of their way to make it a great experience. Sorry we stopped here for dinner."], ["Hannah W.", "Awesome food and friendly staff! I'm only giving 4 stars though because the 5 times I have ordered delivery they have only given me everything on my Pad Thai once. The delivery is fast though, they usually say it'll be an hour + but usually arrives in 30-45 mins. Like I said the staff is friendly and the food is awesome, just make sure you are getting everything you pay for."], ["Vicki J.", "Love this place! Great food and even better service. My mom will drive from peoria just to eat here with me. All their dishes are customizable."], ["Robert G.", "Went there for  2nd time but this time the old thai screw, ordered a seafood dish and got baby shrimp and small clams or mussles you can buy in a large amount for cheap, new name i have for them, say buy!! Wont return, and the server had an attituide, !!"], ["Taylor D.", "Love, Love, Love, going to SaBai for lunches. The services is great when you need to eat a quick lunch on an hour time span from work. The food and service is fantastic! I did order for delivery once and I was bummed about my food that arrived. I typically order Pad Thai and it usually has great flavor with a lot of chicken and shrimp. When I had ordered for delivery it was very dry, low on sauce and the chicken seemed like it had a different texture due to the dryness. Another favorite is the lettuce wraps! The peanut sauce and the flavor is AMAZING! I did try to order the Thai hot once as I thought I could handle it and I was completely wrong. They do warn you that it is very hot, and even the waitress says she can't handle it, but they did offer to give me a new plate for free which I thought was great. Since it was my wrong doing I declined the offer, but it shows what great customer service they offer."], ["Desiree F.", "I've had A LOT of Thai food in my day and this was my least favorite; ever. I found something that was suppose to be \"similar\" to a drunken noodle but I would probably only eat it drunk.I think the dish was pad suiw so? The fat rice noodles were dry and hard, not fresh. There was so much sauce it made everything way too salty. The reason I love Thai for so much is because the veggies are always so lightly cooked, fresh, and crunchy but these carrots and broccoli were soggy. I was also confused as to why they feel a need to throw a scrambled egg into nearly every dish?!I only did a take out order and the service didn't seem to bad. Although, the other server was stanging in the middle of the kitchen, eating soup, I didn't see her was her hands after. I know this because there is a mirror that you can view the kitchen, so maybe eat where people can't see?"], ["Jordan M.", "This place wasn't awful but it wasn't great. I paid $18 for the avocado green curry with tofu expecting some really incredible dish. I was very disappointed when it arrived. Very minimal veggies, and an okay tasting but no where near the best green curry sauce. I've paid half the price of this dish for more substantial, more delicious, and better presentation. I ended up switching dishes with my boyfriend for his sweet & sour tofu. He liked the curry, but he wasn't the one paying. The music and atmosphere was not too great either. Sad indie music played the entire time. I did love the water with cucumber. I would go back for the water and maybe try the desserts next time. However will not be ordering curry here again."], ["Cindy C.", "I am still searching for the perfect Thai meal so met up with a buddy for lunch at this place.  The place is neutrally decorated and was fairly empty as it was Labor Day.  We both ordered our favorites: pad thai and yellow curry.  This place runs a lunch special with rice, salad, and won tons.The food was OK, nothing exciting but definitely Americanized.  I wish them well and think they have the potential to do a brisk lunch business due to their location and pricing.  As for me, I'm continuing my search."], ["Ashley S.", "The food was great but when they ask how spicy you want it spicy can mean almost uneatable. The service was alright, we had to ask for more water multiple times. The portion side was good. We will be back again to give it another try."], ["Dawn W.", "I've only been here a couple times, but everyone is friendly and the food is fantastic. Seriously, the lettuce wraps are totally addictive!"], ["Henry C.", "The coco soup was excellent, the yellow curry was average, and the choo chee seafood was terrible. Thai iced tea was good. Overall we were disappointed with the food, especially based on the reviews here. We wouldn't come again."], ["Laura U.", "I have been looking for a yummy Thai place for a long time and I was pleasantly surprised by SaBai! I highly recommend the avocado curry or yellow curry.  They also have wonderful cocktails, which is always good after a long day. I am excited to try more from SaBai and glad to finally have found a good Thai restaurant."], ["+TheGeneralofHope +.", "I had my first meal at this fine establishment today and was thoroughly impressed! The food was fantastic, prices were reasonable and the service was stellar. If you like Thai food or are looking to try it - give this place a shot - you won't be sorry.A solid 5 stars!!!"]], "Noodle & Rice": [], "Golden Thai Kitchen": [["Tania M.", "My friends and I came here for lunch and the food was great we had pad Thai, if you want it spicy you need to ask for it extra spicy, but the service was great, the prices were reasonable, and the food was wonderful. It's small but it has a good vibe to it. They have outlets at just about every table so you can charge your phone."], ["CESIA C.", "They are awesome,  food is delicious and I'm addicted with their Tom Kha (Coconut soup)"], ["Natalie L.", "Te pad kee Mao is delicious!!!! just the right about of noodles, the perfect spiciness, the amount of meat!! the waitress is also super friendly!  can't wait to try some other things on the other menu!"], ["Vickie U.", "Me and my family came to this place after doing a color fun run on March 14th. I am not familiar with this area and we came to this place by looking it up by yelp. It was a simple place not too fancy. I ordered the number 29 veggies with tofu and small bowl of soup. Very yummy. Very reasonable prices. I would recommend this place to everyone."], ["Dre R.", "I've been here twice. I ordered the yellow curry both times because it is SO GOOD that I don't want to try anything else. The \"medium\" is just spicy enough and very flavorful. I've ordered medium at some Thai restaurants that is so spicy that it blows you out of the water, which is not the case here. Service is speedy and the portions are a good size for the price. It is definitely worth the extra drive to West Phoenix."], ["Joan A.", "Great service, very attentive waitress. Pad thai is so-so...good, but not great. But their pad see ew is sooooooooo good. Panang curry too. Lunch specials also available on weekends 11 am to 2 pm."], ["Nessa N.", "Delish, had flat noodles w/ shrimp spicy, Mmm mmm. I mentioned to server that it was my first time she was very helpful and friendly she ask what I'd like noodles or rice. Then point out plates with noodles. I devoured the noodles before even thinking of taking a pic. I will definitely recommend. And be back to try the curry."], ["Brad W.", "Random lunch stop and went for the usual chicken pad thai as I dined in the empty restaurant near the end of the lunchtime period. Only $6.95 for the entree and a crispy spring roll. The pad thai was a good version with bean sprouts, white chicken and some crushed peanuts hanging out on the side of the plate (maybe some more?). Their twist is the four pack of sauces that they give you when the entree arrives. One was a yellow powder that was supposed to be fiery and another was also a hot sauce, both of which I had to avoid, but good for hot food fans. I did try the light red sauce that was was kind of sweet and hot and added some flavor gringo style. Can't beat the service either when your the only one in the place."], ["Cindy R.", "Best Thai food in the west valley!  Nice variety of dishes.  The service is wonderful.  Very attentive and helpful.  I am always amazed at how fast the food is prepared and served.  I think the portion size is perfect for the lunch specials-I am full, but not tempted to be a glutton because it's too good to stop eating.  The prices are excellent.  The food is flavorful and fresh, and they can make it spicy like I like it and mild for my friends.  I are there for lunch and find myself wishing I could go back for dinner.  You have to try it..so good!"], ["Ella M.", "I will start off by saying that I was very hesitant to try this place.  The thai place that was housed here before this was very near and dear to my heart.  It was where a close knit group of friends and I often met to break bread and enjoy one another's company.  But I caved and gave it a chance...I'm glad I did!I am a sucker for Pad Woon-Sen.  So of course, this is what I ordered.  I was excited when she asked me how spicy I wanted it and I quickly answered, \"VERY!\"  I got what I ordered!  A steaming plate of glass noodles mixed with chicken, mushrooms, broccoli, and other veggies.  It also comes with a side of rice.  The thing about this was that the level of spiciness is apparent throughout the entire dish.  It's not just an afterthought...it's cooked in so with each bite, you get that delicious flavor and a slow building heat...that I love!  We also ordered a side of spring rolls that came with a clear and more \"brothy\" version of sweet and sour sauce.  It was not too sweet or too sour...it had a very yummy tang.  The spring rolls were very flavorful and crispy.  I am really hoping that this place can last.  We need good Thai places out here in Maryvale.  I'm sure to be back and try some other dishes that will take me out of my comfort zone!"], ["Inderjeet S.", "V good food I am vegetarian they cook v good veggie food i go there almost every  week I love Thai food is family own Resturent that r so good people good service red curry is my favorite"], ["Kourtney C.", "The food is awesome. Delicious!! We used to drive over to Litchfield for good Thai food, then we found this place and it's just as amazing. My picky son even loved it."], ["Julie K.", "Don't let the location and decor deter you...if you happen to be in the area, stop by for some hot, fresh Thai food.  Based on the yummy chicken panang curry, I had - if they keep this up, this place earns a top spot on my \"hole-in-the-wall but damn good\" list!"], ["Katherine C.", "This restaurant doesn't look like much, just another place in a small strip mall next to a Mexican restaurant.  However, I always get good food there for good prices.  I usually get one of the curry dishes and have leftovers.  I live within a mile or so of the restaurant and sometimes even if I'm not hungry I have to stop in and get a Thai iced tea to go."], ["Laura S.", "This food was amazing. I saw it on yelp and decided to try it out bc of the great reviews. The waitress was super sweet and explained all the different items on the menu for me. I ended up ordering pad new Mao #17 and the red curry. Both were amazing and I can't wait to come back and try new dishes!!"], ["Edwin C.", "Solid food & service. I've only liked one Thai place but unfortunately it's on the far east valley. Looks like I've got a new one! :)"], ["Tiffany V.", "Love this place! I get pad see ew here atleast once a week. The egg roles are also fantastic! Officially my favorite thai place EVER!"], ["Tony R.", "Horrible, the absolute worst Thai food that I have ever had. No flavor, just bland. Made the mistake of ordering for takeout, took two bites and threw it out."], ["Craig S.", "A friend and I went in for lunch. The menu is fairly small with not many choices but the food is very good. I had the yellow curry and practically licked the bowl when it was gone. My friend was very happy with his selection as well. I would definitely go back."], ["Ethan D.", "Outstanding Thai food. Fresh and flavorful food in every dish.  My wife adores the red curry and the spring roll appetizer.   I've had a few things from the yellow curry to the pad thai.  Everything is worth getting twice! An absolute win. Be sure to try either the coconut ocean or the mango dessert both worth the trip alone."]], "Thai Lotus Restaurant": [], "Thai Basil": [["Onanong J.", "I will definitely back for more peanut curry and mango sticky rice, best place for having dinner these days"], ["Bill G.", "The food is very good, especially the coconut shrimp. Go to the Ahwatukee TB and be entertained by the funny Thai Grandmother, and if you're lucky, you will hear a heated conversation from some of the authentic Thai=talking servers. Priceless!"], ["Tracey K.", "This wasn't bad Thai food, but it was a little undercooked. My eggplant was still really hard (almost raw). Their Ahwatukee location does it perfectly! It's worth driving a little further if you have time to go to Ahwatukee."], ["Ron D.", "Wow, I was shocked to see some of the mediocre and poor reviews for this location. We went there for the first time today and had good service and food. I had the Pad Thai which I really enjoyed. Susan had some kind of peanut sauce rice thingy that she gobbled down with no problem. Flavor? Plenty enough for me and I ordered \"medium.\" The little bowl of soup offered as an appetizer was a nice touch too. We both really enjoyed our lunch experience but maybe we are not the Thai food aficionados some of the other yelpers are."], ["Jeff R.", "I just have a consistently great experience at this location for lunch, dinner and take-out. The ladies who work the lunch shift are great and always cheerful.  Some of the nicest staff at any restaurant I have had the pleasure to dine in.  The only time I had shaky service were a couple days they had off in the summer.  The replacements were very nice just not up to the usual standard, but I go so often I'm not one to ding new people as they tried.I still recommend going with medium (5)  if you like pretty spicy without burning you up.    My parents always get no spice (0) as they are sensitive to spicy food.  So don't be afraid to take your friends who don't really dig spicy foods.There is another location down the avenue near the Intel Plant which is also pretty good, but they are always super busy for lunch ( Go Figure ). Try:- Pad-See-Ew  (Best in AZ )- Pad Thai ( Seems Real to Me )- Crispy Sweet Potato- Purple Sticky Rice"], ["Evan R.", "This is thai food like the Olive Garden is Italian food. Very simple, bland, and mild flavors. The broth in a Tom Kha soup should be thick and rich, but we were presented with a watery and bland substitute. A good thai curry should be bold and complex, but not here, the Panang tasted like peanut butter, the Green curry tasted like coconut milk, both very simple and overly sweet. Also the music belonged at a dentists office or an elevator, very annoying stuff! I recommend thai elephant in Tempe, much much better than this place!"], ["Ariel S.", "The worst place I have ever been. The service was horrible and the food was even worse. If u are someone who values customer service this isnt the place for you."], ["Catherine C.", "Over the last year we've had some good meals here. We went last week and it was inedible. The pad Thai was cool and had NO flavor while the curry was flavorless. When we pulled up, 2 of the kitchen help were standing outside smoking...not sure if they were the cooks for our food or not. Regardless, we won't be going back. It was a waste of money."], ["Dustin G.", "They have a great green curry and huge spring rolls. Their beef and broccoli is just okay. I know, beef and broccoli? Well, it can be great. I've had beef and broccoli that's worth talking about. Anyway, the food was great and the portions were huge. I just moved to the area and I'm happy to find a thai place ALMOST as good as my favorite haunts in Chicago. I'll definitely go back."], ["Cadence C.", "The service was wonderful and the server was very nice,but ...DON'T GET THE PAD THAI. Its NOT pad thai.The young coconut... it was served whole with a spoon.The coconut meat was to tough to scrape out with the spoon.But the coconut water was refreshing.I think I'll stick to Touch of Thai in north phoenix"], ["Mike A.", "Seafood lunch red curry plate.  Awesome. Tiny little place but clean and comfortable atmosphere.  As soon as I walked in I smelled good food!  They have free wifi and waitress was really nice!"], ["anna w.", "Worse thai food i had in a while. Tasted very watery. No flavor at all had a curry. Was pretty much coconut water with very little veggies and almost no taste."], ["Arianne D.", "Co-workers and I have been coming to this location for a few years now.  It was one of our favorites until they hired a new manager named Taika.  She used to work at Yuppha's Thai restaurant (used to come to this one too until they moved their location a few years back).  Taika always give us an attitude everytime we ask for something different like changing white to brown rice.  Came here today and when we got our food, it was not even warm.  Asked her why food wasn't hot and she grabbed the plate and said she'll microwave it for us... in a very very rude fashion!Food was ok.  Noticed there wasn't much meat in my curry.  I can see the discoloration (brown spots) on the potatoes.  Curry tasted watered down.  Will definitely not be going to this location anymore."], ["Melissa M.", "Food and service mediocre."], ["Nydia A.", "Used to live & work right by this place, so I would come regularly. Sometimes the food was a bit garlic-y, but other than that, I was never disappointed by the food here. The service was fast & friendly. The portions were just right, and it seems like their food is made healthier than other Thai places I've been to. I LOVE hot spicy food, and they actually challenged my palette a time or two. So let it be know, if you ask for something very spicy, they will give it to you!"], ["Jessica K.", "3 stars - I've been here multiple times and prior to the last experience they would have gotten 4 stars.  Last time I went I ordered pad thai - it was dry, cold, and bland.  What the heck happened here?  Usually the pad thai and spicy noodles were consistently good.  Sad to have experienced such a drop in quality.  Hopefully next time is better."], ["Jeff R.", "This place has become my new favorite!  I've ordered take-out each time and have received excellent service!  The food is simply amazing.  The Pad Thai not only has huge portions, it's exactly how Pad Thai should taste.  The Thai Iced-Tea is a great addition to any order.  I highly recommend this place!!"], ["Melissa A.", "This restaurant has true knowledgeable cooks in the back. They don't just make the typical 'pad Thai' for those that generically order. This place knows how to make authentic Thai food. So glad it's in my neighborhood. Lucky me."], ["Jeff P.", "I've been here multiple times the service continues to get worse. They are severely understaffed and it's impacting everything from their service to their food. We waited an additional 40 minutes for carryout when we were told the food would be ready in 20 minutes. They shorted us on rice as well. We ordered multiple dishes and they gave us one box of rice instead of a box with each dish like they are supposed to provide. The quality of the food is slipping. The curries continue to become more watery. The sauteed dishes or so dilute with water that you can't taste any seasoning but rather just limp vegetables that resemble a bad broth. It is sad because this place used to be 5 stars but it seems to me that they really don't care about customer service. Today was so pathetic, they had one person(one of the owners) serving tables, taking phone orders and busing tables. And the restaurant was busy! Seriously, you can't afford to hire a couple of waiters? This place used to be 5 stars back when they had a normal waitstaff but for the past 3 years or so, it just seems like they don't care about customer service. Unfortunately, now it's impacting their food. I would only order carryout. Stick to the curries. If they tell you 20 minutes, double or triple that time when arriving to pick it up. And don't tip on carryout!!!"], ["Sarah G.", "So I've been craving Thai food.This place is fairly close to me, I decided to try the Red Curry with Tofu , my daughter had the Chicken Noodle with beef. (see pics)The sauce part was perfect, spicy and slightly sweet of coconut, BUT the tofu was spongy and tough and the bamboo shoots were awful and tasted like bleach? The egg-roll was my favorite part that spicy sweet sauce they serve it with is so damn good!Val really liked her dish, I'm not  fan of beef but I tried a noodle and it had really good flavor.The glasses were really clean and the water tasted filtered. Generous portions and affordable prices.OK place, but I probably wont go back seeing as I didn't like their Tofu and that would be my filling of choice."]], "Touch of Thai": [], "Chanpen Thai Cuisine": [], "Vegan House": []}