{"Peking Restaurant": [], "Lucky Liu's": [["Steve R.", "Quick service from these guys. I ordered to go last minute and the service was Great. No, I'm closing s@/T. The guy on the line Christian did not hesitate to take my order and I have to say 5 stars all day! Thanks Ninjas!"], ["Nadine C.", "My boyfriend and I came to gaslamp on vacation. Food was good, provides vegetarian options. However, service is not good. Our waiter didn't check on us at all and they forgot one of our dishes and didn't even apologize or acknowledge it even after we told them to just cancel the dish. We waited forever for our check. Wouldn't recommend unless you don't mind the bad service. She was the only waiter..which I understand she is busy but at least her attitude and an apology would have been appreciated."], ["Marissa L.", "Absolutely great food, ordered the wonton soup, spring rolls, combo fried rice and combo fried noodles- everything was delicious- especially the cashew chicken I forgot to mention. Service was excellent! Would definitely return to this restaurant and would recommend to friends and family. Great ambiance, as well!"], ["Roberto M.", "Really good Chinese food, the Kung Pao chicken, Black Pepper Filet Mignon, Fried Rice chicken and the Orange Chicken are really good!!!"], ["Zildheam D.", "First time visit during comic con and what chaos. The wine list is excellent, i really appreciate the Gloria ferrer sparkling in their menu as a local choice for bubbly. Food was OK, i ordered a number 38 which arrived drowning in a mayo sauce that made it difficult to eat. However, prices were not high and the restaurant and decor was beautiful. Service was not great, i believe they did not expect the comic con crowds and we were neglected for a while, the food was put in front of anyone and rushed, bill could not be split and the server flat out handed us a pen and said 'i am too busy, you do it yourself\" and walked away. For that and the excess mayo sauce on number 38, i can only do two stars."], ["Brittany C.", "I Order from this place all the time. Their food is very good don't get me wrong. The issue is Consistency. When I order something I expect it to come out the same way every-time. When the description says one thing that's what you expect to receive. The two stars is for the host who asks if it tastes good. Which was completely besides the point."], ["Peijean T.", "I'm so glad that Gaslamp has a new, authentic Chinese restaurant that is also a hip place you would actually go to with friends or company!#1: Locals can now stay downtown for authentic Chinese food! Gaslamp is seriously lacking in Chinese grub, other than the delicious Panda Inn at the very top level of Horton Plaza.  If you're a local like me, you do NOT want to drive up to the Convoy area when you would rather dine steps away in your backyard. And regarding Panda Inn, it's a generally acceptable principle that no one wants to go to the mall to eat, unless you're already shopping there.#2: It's hard to find quality late-night dining in the Gaslamp that isn't a) gastropub fare (read: fried) or b) greasy Mexican food. The menu boasts a variety of traditional entrees, dim sum, and appetizers, and even fusion items like saladsand cream cheese wontons. items from Lucky Liu's is open 'til midnight on Fridays and Saturdays!#3: Decor is modern rustic, atmosphere is ambient with Asian charm. Think Burlap, minus the koi pond. Fun and hip!#4: The open kitchen is quite a treat, as you can watch the chefs working through big glass windows as you walk by on J Street.#5: Fantastic service! Regarding the food, we tried:--Fried Noodles (#61, crispy Hong Kong style noodles with an assortment of veggies and choice of meat): large portion, multi-dimensional sauce bursting with fresh garlic, ginger and other flavors. Authentic and not overly greasy as some restaurants can be with this dish.--Steamed bbq pork buns: definitely on the small side and not much meat inside. Authentic!--Shrimp sui mai, deliciously juicyWill definitely be back to try more menu items!"], ["Andrea L.", "I love this place! Best Chinese place in down town! Great drinks great service. But you guys also need to try the chicken wing apprizers.. Ughhh I want to marry those chicken wings! I want to be Mrs. Those chicken wings haha"], ["Cathy Z.", "A must for us when we visit our Kids!   Have eaten at many Restaurants and I have too say, there food is one of the Best in So Cal. Can't wait for our next outing...."], ["Teresa V.", "Came here with an old friend - we were both in town for conferences - and we ordered all the dim sum.  So good - I especially loved the shrimp balls.  Thanks for a wonderful dinner!"], ["dolores d.", "Went for lunch with my daughter and granddaughter, they were supposed to open at 11:30 but didn't actually open till 11:50. Took quite a while for someone to bring menus, water was warm no ice,  food took quite a while to come out, mine was just barely warm. I had the Mongolian beef, my daughter had the orange chicken, granddaughter had the beef and broccoli. The food was sub par in my opinion, service was not very good . I will not be returning here my next trip out."], ["Donolito K.", "Finally a place that serves up east coast style Chinese! I dig the optional family style portions and I could eat their Egg Drop every day. Hope they they open another location like in North Park."], ["Nancy W.", "I came here yesterday for my friend's birthday. a table of 4! I also purchased a Groupon $30 for $50 food, not bad at all! We ordered a pork shui mai, shrimp shui mai, har gow, fried shrimp balls, chicken wings, hot and sour soup, and chicken lo mein. The chicken lo mein was delicious had a right amount of flavoring and not too bland. the complimentary fried wonton strip things were good too! all the dimsum was good too but a bit pricey sadly. the chicken wings were perfectly fried and had a right amount of salt and pepper seasoning. sadly i was disappointed that the hot and sour soup was not that warm/hot but i wouldn't mind coming back to try other dishes!"], ["Jacques L.", "I am world traveled and have had authentic Chinese food(Mandarin and Cantonese). I have had Chinese food in all of the major China Towns in America. The negative reviews on this restaurant are petty and whiney. THE FOOD HERE IS GREAT!1. In order to REALLY enjoy it GO IN AND SIT AND HAVE DINNER. This is not the neighborhood mom and pop\" don't forget the soy sauce and the fortune cookies\" kind of place. The recipes have a different twist while maintaining a traditional foundation. They might do take out as a convenience ,but it's not the strong suit of this place. It's been open less than a year. Give em a minute to get the kinks out. 2. Its downtown.  It's going to cost more. All the food does in all the establishments,shy of a taco stand in ANY MAJOR urban downtown district. We found the prices fair, and affordable with ample proportions when it comes to serving size. 3. Guess what? They made a mistake on our order as well. So what? It HAPPENS. It was quickly rectified and RECOGNIZED at payment time. Servers turn over in all restaurants and the best way for them to get better is to get out there and learn. None of us will starve to death because a SDSU student forgot our noodles. This is not a $1 Chinese food place. I will drive from LA JUST to enjoy the wonderful food and fine service."], ["Paul J.", "This will be my first bad review in a long time. The place was very nice. The service was great, the girl from Ireland was awesome, so friendly and helpful. The bus boys were on point. The host so friendly...........But the food wow. I must say might be some of the worse Chinese food I have ever had. Orange chicken was below average (panda 100% times better), the chicken kung pao was average, the chicken wings were good but way too much salt. Overall food was 1/2 star, the other 1.5 star was for service. I hate leaving bad reviews but when it comes to food I have to. Best of luck fixing this issue."], ["Rahul H.", "Ok so I had a moment of weakness and this time ordered up some delivery and switched up the items. It was a lot better and I will now comfortably throw these guys into the mix for delivery only. The Fried Shrimp Salad Rolls were my favorite and I will be ordering them again. Shrimp mousse, scallops, crab sticks, bell pepper, celery and spices wrapped in egg roll skins and lightly battered and fried. The Chicken Wings were OK, and the Chow Fun was pretty good.  Don't expect to be totally amazed but what I ordered for delivery was pretty good for what it was. They don't have their own delivery staff so the service may be hit or miss."], ["Sheeraz A.", "We went there last weekend for dinner, and used our groupon deal ($30 for $18). We ordered egg drop soup, sweet & sour chicken and Mongolian beef (both came with brown rice). The soup tasted fresh, and 1 cup was enough to share between us two as well as to whet our appetite. The entrees was delicious as well, especially the chicken. To round things up, the service was good, the decor beautiful, the bar looked inviting and the window table was perfect.An unexpected fun addition were the folks on the next table. They said that our food smelled delicious, and offered us to try their entrees (kung pao chicken, broccoli and beef). We in turn offered them some of our food. The waiters didn't seem to mind at all and were friendly, so we ended up with somewhat of a family style meal. We would definitely go there again, especially if they keep offering this pretty sweet groupon deal!"], ["Osito S.", "1) their potstickers are not potstickers. They are gyoza. Complete difference and a Chinese restaurant should know better.2) food that was delivered came in open containers, not sure if it was just the way they packed it or what, but they need to make sure the containers are more tightly sealed.3) no chopsticks?!?!!? What the what?!??!"], ["L T.", "One word: expensive. Dinner for 4 came out to be over $120 and it wasn't anything special. The food quality tasted like pick up sticks. You're basically paying for the decor. When we came during dinner it was just us and another table. We had trouble getting the check even though it was just two tables and 3 waiters."], ["Tom C.", "Ordered takeout from here.  Totally solid.  Wouldn't call it super authentic, but it's still very good.  One of my big complaints with takeout is very few restaurant's food travel well. By the time you get home it's cold and nasty.  Here it was totally fresh and delicious even after stopping at the convenience store for drinks before getting home."]], "Red Moon Noodle House": [], "Super Wok": [], "FuAn Garden": [], "Tan Ky Mi Gia": [], "Phuong Trang": [["Sam W.", "We came here last night and I must say we were disappointed. Baked fish- was a bit oily, and there was no \"tamarind\" sauce which is how this fish is usually served with. There was an alternative fishy sauce that did not cut it.Vermicilli with Egg Rolls and Char-grilled Pork- eggs rolls were ok, we've had better and the pork was red and mushy on the inside.Overall Food ***Service- * When asked to get a new boil of noodles since the pork was not properly cooked, had the waiter try to argue with  me that that pork is suppose to be that color and texture, when in fact another piece of meat was not that way. Then had another waiter attempt to come out and tell us that we were wrong and their food was properly cooked. We did order the beef instead and that was quite tasty. Suggestion for owner, never have your employees argue with the customer.Unfortunately, we won't be returning here any time soon."], ["Sireesha R.", "I was recently introduced to the heavenly Butter Garlic Wings that were catered to a party and have returned to this wonderful place a couple times after that. Mainly for the wings of course.I came here with a couple of friends and our eyes were definitely bigger than our stomachs. My boyfriend and I ordered a vegetarian soup with veggies and tofu, the lemongrass and hot pepper tofu, and a full order of the butter garlic wings. Needless to say, we had to take almost all the tofu and half of the wings home. The lemongrass tofu was out of this world! The tofu is fried and the seasoning/sauce they use is addicting. This is probably top 5 one of my favorite dishes ever! Our friends ordered a rice paper wrap dish that's kinda DIY with meat, veggies, and some herbs. I'm not sure what the name is but I'm sure if you look for rice paper wraps you'll find it. We put some of the lemongrass tofu in it and it was great. Service was prompt and we got seated right away. We might not have come during a high traffic time though. We'll be back soon!"], ["Cassie H.", "This place was really disappointing and I'm surprised by the ratings it has considering all the other amazing Vietnamese restaurants in the area that are way better! We came in a little after lunch time on a Sunday with about 4 or 5 other tables. The service was so incredibly slow. Let me just say that we were seen but not acknowledged. Took about a good 5-10 minutes before they took our order and they slowly brought out our water. It then took another 20 minutes for our food. The restaurant wasn't even close to being half full. The pain it brings me to have to type it out and relive it. Our food wasn't even good! Disappointment after disappointment. I got the Vermicelli with shrimp and egg rolls. The vermicelli was stringy and dry. The shrimp was rubbery. And the egg rolls were over fried. I tried the hu tieu and the broth was bland with not much meat. I was just so disappointed. I was really hoping for more...anything!Our service was so impersonal and dry. Why, I wanted to like this place so badly. :("], ["Jennifer A.", "Yelp 100 challenge 2015. This place is great for Vietnamese food. They have 7 corpses of beef, cAtfish, great pho and soups, they also have Chinese food too. I like their Vietnamese coffee and also their count drink. They have great salmon and clams too."], ["Helen D.", "Nice big comfy dining area. Price is decent for SD. Pho was very good. Wings were too damn sweet. And they make vegetarian food the lazyass way..... Pffffft. Come on.The service was efficient but not nice."], ["Jon O.", "Meh...  Went here for dinner on Sunday and the line was quite long. Based on that and the yelp reviews we figured it would be great. It was just ok.  I had the lemongrass tofu with peppers and also tried the shrimp and rice crepe. They were decent. We were there with 6 people and all of us had the same reaction."], ["Mayra U.", "Oh my, I don't have words to express how amazing the Garlic Butter Wings are! I know, I'm being a total basic girl since every picture on here are those wings. But the Masses speak nothing but the truth! What we had in order on a scale of 1-10:Thai Tea and a Milk Tea boba = 8.5(For the first time I tasted fresh boba and not chewy!)Garlic Butter Chicken Wings 12.5!!!(Seriously best wings we've had)Lemon Grass Chicken 8.5Very flavor full! If you like citrus you'll like this! Rice noodle stir fry 7.5 Your average rice noodles, just really good chicken and fresh veggies"], ["Sandy P.", "Ahh this place never disappoints. What keeps me from coming back when we are in town are the salted and pepper fried crabs! Hands down the best. Be prepare to wait a few minutes because this place is always busy and packed. Everything we have ordered were so good. Flavors are always on point."], ["Ka Chun C.", "Actually not good as u think.  4 stars is feak.   The service is bad and also the food is very normal"], ["Kasey T.", "The food is good, but the service is terrible. I recommend dining and dashing. Just kidding, but seriously, the service is absolute trash. A+ for food, F- for service."], ["John M.", "The pho here is perfect. I could eat this every week and never get tired of it.  We come here often for our \"Pho Phriday\" dinner out.  The pho broth is amazing and everything is fresh. The restaurant itself is large so don't be intimidated by a crowd outside waiting to get in. We've never had to wait very long even when it looks like it will take forever. The restaurant is clean but not really fancy at all. The prices are great and the service has always been pretty decent. They are very busy so they're not as attentive as you may hope but it doesn't get to a point where it's obnoxious or you're waiting forever. Unlike many of the other places on Convoy the parking lot is pretty large and it's not too difficult to find parking."], ["Cherie T.", "I definitely have experience better Vietnamese restaurants when it comes to Pho. The pho here is just okay -  a bit flavorless. I ordered the Bun Bo Hue and I enjoyed it. Gave me a good amount of noodles and tendons. The broth was strong and it wasn't overly spicy.We also ordered a half order of the garlic butter chicken wings - it was just okay. While it smelled delicious, it didn't taste that great. The chicken wings were dry and it's one of those dishes where it smells better than it tastes. The chicken wings were not tiny; they were a good size wings. They need to somehow marinate the chicken wings better so that the meat inside will taste good. Without the skin, the chicken meat is bland."], ["Gumby L.", "Came here with the boyfriend Friday night. We actually showed up 15 minutes before they closed...we didn't know they closed at 10pm. We got seated quickly, got our orders in. Disappointed because I wanted the crack chicken wings but it would've taken too long. I ordered the house plate. Picture included. The only thing I ate was the rice, the steak, and the tofu shrimp, along with the cucumbers and tomatoes included. I did not like the egg triangular thing not the pork with pork skin. The egg triangular thing was weird. The pork with pork skin, why when I read it did I think it was going to be a chicharron, ehhhh well. Next time I will go back and get my crack chicken wings.Negative 1 star due to the constant pestering of the male waiter that took our order. He asked, I shit you not, about 7 times if everything was ok, he asked once, came back 5 minutes later, asked the same thing, came back 10 minutes later, and so forth. OMG. I'm a girl and wanted to tell him to get off my nutsack!"], ["Darrin B.", "Okaaaaaaaay. So first things first the only place I enjoy getting my Pho is at OB Noodle house. Now with that being said I DO enjoy the food here. I came here for a really quick dinner before heading up to LA one day. As I walked in my girlfriend and I were greeted right away which was a plus being in a rush. I knew what I was going to order a head of time so I didnt really look over the menu. As soon as the lady asked us what we would like to drink I replied with \"Two rare steak Phos and a half order of the garlic chicken wings\" The food came out quickly and tasted good to me. The was a lot of steak in the pho I REALLY enjoyed that Pho sure! The Garlic wings were good but nothing to rave about like I seen some yelpers do. I ordered a coke and it came in a can with a glass of ice, I HATE THAT lol but I assume its probably cheaper for them. Being local I'm sure I will come back and order the same thing again if not other options on the menu."], ["L K.", "Pho broth was good Cube steak was soft but was  kinda plain Fried rice was on the oily side Clay pot cat fish was good. Okay prices items. Portions are okay Dessert fruit cup was plainClean restaurant Clean restroom Baby changing station was great in the woman's restroom"], ["Peijean T.", "Apparently I have been living under a rock. A rock where Vietnamese food isn't served.Dropping by Phuong Trang earlier this week gave me an amazing orientation to the \"other\" Asian food that has somehow been neglected on my regular trips to dine out. I always go for Japanese, Thai and Chinese, and when I get Vietnamese I stick to pho noodle soup. But I'm glad I branched out by coming here.I ordered a delicious noodle dish off the \"bun\" section of the menu. As I learned, \"Bun\" is basically steamed rice noodle salad, so you get steamed noodles with thinly sliced raw veggies over a bed of lettuce, and then it's topped with a grilled meat or egg rolls of your choosing. I got the stir-fried shrimp and bean sprouts which were warm and savory on top to contrast the lighter, refreshing bottom of the giant bowl. On the side you're provided with a light housemade fish-sauce dressing that provides a nice tang to dress up your dish and take the flavors to that next level. The bowl was so big I ate half of it the next day as leftovers.The menu is massive and divided into sections (e.g. pho, bun, stir fry, etc) and there are even lots of Chinese dishes, especially under the specialties section. So if you want both Vietnamese and Chinese food in one sitting, this is your spot.My dining companion, who got pho noodle soup, also added a half order of garlic butter wings to our table. My oh my. I have never had a JUICIER tastier wing, it was just bursting with every bite and packed with flavor! This definitely had a butter flavor to it, versus the usual Chinese-style salt and pepper wings I would get at a place like Sam Woo or Royal Mandarin.The hilarious part of the meal that made me feel like such an uncultured foreigner was when my companion ordered the grilled pork skewers. Being that this dinner was my companion's first trip AT ALL to Convoy Street, he was equally clueless.  First came a huge plate of raw greens -- mint, cilantro, carrots, radish, cucumbers, canned pineapple chunks and a massive plate of rice papers a top a small bowl of warm water. We had NO CLUE that this came with the pork and asked our server if we had been given the wrong thing. Then when the pork was brought out (SO incredibly tender and flavorful!) we were still confused. We asked our waiter what was up and he said we were to wrap the pork and veggies with the rice paper. Ladies and gentlemen, please SOAK your rice paper circles before trying to eat it. I did not know this and tried to bite into what was basically inedible plastic. Later on my own I figured out we should soak them, and then they become soft and translucent, and delicious!Overall, an absolutely delicious meal for two with beers for only ~$40 with leftovers! TIP: They have Tsingtao beer but though the menu says they have it bottled and draft, we were told they don't have it on draft anymore."], ["Jocy C.", "Phuong Trang is a Vietnamese restaurant located in Kearny Mesa neighborhood of San Diego.  Marked with several awards in the best vietnamese restaurant category.  I must agree.  The only other Vietnamese restaurants that I have to compare to is from New York City as I have never actually been to Vietnam (bucket list item for one day in my life).  Folks - I do have to say - Lemons and Limes are NOT the same.  I don't know why... but Vietnamese restaurants in New York City serve Lemon with their Pho.  It doesn't come anywhere near in the deliciousness scale as Lime with Pho.With that said - the 2 dishes to order are:Pho Xe Lua - Extra large bowl of rice noodle filled with rare slices of steak, well-done brisket, flank, tendon, and tripe.yelp.com/biz_photos/phuo…Broken Rice with Grilled Pork, Sunny-side Egg, and Steamed Egg Meatloafyelp.com/biz_photos/phuo…Pho with LIME - Killer!Grilled Pork - *Licks Lips*Beware:  Service is a little slow if the restaurant is busy.  It appears that there aren't enough waiters / waitresses to work the restaurant when all of the tables are full.ENJOY!!"], ["Soo H.", "Rorshach : You know what I wish? I wish all the scum of the Earth had one throat and I had my hands about it.The Watchmen3pm  Arrive at parking lot.  Full.  Vultures circling.  Leave ride in more discreet location.  Take nature hike.3:10pm  Notice fish sauce or garlic only choices for fried chicken wings.  Smell could give away my location if stealth required later.me:  Would like fried chicken wings with no sauce or garlic and won ton soup.cherub faced waiter:  I think wings can only come out of the kitchen with sauce or garlic...me:  *pause to stare intently into eyes till waiter becomes nervousme:  Would like you to ask chef why he does not know how to not place sauce or garlic on wings.waiter:  I was only guessing.  I'll go ask the chef.waiter:  You can get wings without sauce and garlic.  Sorry I'm new here.me:  Hrm...3:25pm  Won ton soup arrives.  Won tons small.  Made with only pork.  Flavor not good.  Pork/shrimp won tons at Sam Woo better flavor.  Bbq pork has too much fat.  Bean sprouts come on separate dish.  Add to soup.  Broth not hot enough to cook sprouts properly.3:30pm  Notice fly.  Reach out to crush.  Too slow.  Feel impact as fly bounces off hand and is redirected against wall.3:35pm  Wings arrive.  Hot.  Crunchy.  Juicy.  Lack flavor.  Needs salt/pepper/msg.3:45pm  Notice another fly.  Reach out to crush.  Too slow.  Fly escapes.  Hrm.4pm  Check for security patrol before taking nature hike.I wish all the flies of the earth had one head and I had my hand around it."], ["E K.", "Came here by the recommendation of a Vietnamese friend and loved it. The food here is amazingly tasty and authentic! It's like a old school Asian restaurant. We got the baked catfish which was HUGE! It is packed with flavors, moist and crispy on the outside. It is large enough for 4 people to eat. The catfish comes with pickled carrots, cucumbers, a variety of greens, vermicelli noodles, fish sauce for dipping and rice paper to roll everything up together. Market price is between $40-50 for the meal. We also got the vegetable egg rolls which were super crispy and hot when they came out! Lastly, we got the garlic chicken wings which are to die for. They are perfectly cooked and sprinkled with fried garlic pieces. I can't give it 5 stars because their service needs work. It takes forever to get seated, to get your order in, and even to pay your bill. They get pretty busy for lunch and dinner so get ready to wait."], ["Bao H.", "Phuong Trang is a family owned restaurant and a very popular one at that. My friends recommended that I attend this place with him so of course I obliged.The place itself is located in a strip mall and inside is you very typical Vietnamese restaurant decor.  Cheap chairs and tables along with some portraits of some Vietnamese art.  Not too shabby and I don't really mind since I'd expect this!  We ordered some eggrolls to start and for the entree went for one of the restaurant's specialty; the Oven Roasted Catfish.  Needless to say, if it's not your cup of tea to have your entire fish fried and plated, head and tail, then you need to explore and me more adventurous!  Overall, the eggrolls were decent and nothing too special.  Crunchy to the bite and with added herbs giving it an aromatic bite each time.  The highlight of the night was the fish.  Crispy from the outside and warm and meaty in the middle.  Wrapped with rice paper this dish is one of my favorite traditional meals in Vietnamese cuisine. - Enjoy!"]], "Dumpling Inn - Shanghai Saloon": [["Michelle B.", "Atmosphere: The atmosphere is friendly. You have to get here pretty early to beat the crowd. There are lots of seatings, but the place is pretty packed fast. That should tell you about how great the place is. Customer Service: The customer service is great! They come to your table frequently to make sure you are satisfied or if you need anything.  They have great customer service. Food: The food is excellent. I am very picky when it comes to Asian cuisine and i have to say this place was great. My husband and I would return. I am not a fan of lamb, but someone from our party ordered it. I have to say it did not taste gamey at all. I loved there orange glazed shrimp. I want more already. Price:The prices are very reasonable. Each dish is enough for two people. They are mostly under $13. Their appetizers are very low priced. I highly recommend this place."], ["Ellre V.", "Yassssss Dumpling Inn finally has a bigger location AND it's attached to a trendy bar/lounge area! The space is huge and very open (which is a nice change from dumpling inn's previous location). Parking can take awhile since it's located in a tiny stripmall containing other popular places such as Kula and Icekimo, but I've never had too much trouble *knock on wood*. I came here last weekend while we waited for our number to be called at Kula. Dumpling Inn was already closed at that hour (closes at 8:30pm on Sundays), but the Saloon was open and was still serving their menu. We ordered the pork & shrimp dumplings for $8, because how could we stop by and not? It was all gone. I didn't eat the dumplings (because pork), but I ate some of the greens and jalapenos on the plate. Super delicious! The seasoning and sauce were perfect. My only critique: please add vegetable dumplings to the menu!! The only vegetarian options are cheese rangoons and fries. Plenty of meat and fish options though, such as szechuan menudo, popcorm calamari, and steamed bun sliders (pork belly and chicken). Note: Food Happy Hour is from 4-7 Tuesday-Friday and all the food is HALF OFF! Dumpling Inn-Shanghai Saloon is definitely another Convoy Street must."], ["Lisa W.", "Came back to Dumpling Inn after years (4 years...), what do you know... all that Chinese stinginess when they were in that small ass place did wonders... Or maybe they finally left the Dumpling Inn reign to their kids/younger generations and their Millennials decided to invest in the place. They moved from the little hole in the wall (probably seated like 20 max...if even) to the place next door, which looks like it can seat 5 times that amount AND has a full wrap around bar! With SD craft beers available (Sculpin + more). Also they have legit decorations, plants and nicer tables...instead of the typical Chinese restaurant decorations (think the \"lucky cat\" with the moving arm). Oh you can also see the chefs making the dumplings (like Din Tai Fung)...so this place is also new and cleaner too!Food was still good and cleaner than I last remembered. We got the mixed chow mein with home made noodles and it good. Not too saucey or even salty. We also got the Xiao Long Bao which was so good, we probably could have eaten 3-4 orders of this and be full. And our last plate was the kung pao seafood...which wasn't my favorite because it was too saucey. Maybe next time we'll stick with the popular dishes like the catfish. Service was ran by the OGs and it's a lot better, the younger workers are doing the hostess or at the bar. I really like the new venue. I think a lot of their success had to do with yelpers/reviews on yelp and they were finally able to take all the money under their mattress and invest in their kids future. This is probably the best Chinese restaurant in San Diego!"], ["Tim P.", "The Dumpling Inn seems to be a very popular spot. When we went to lunch we had to wait at the bar before we got a table. The wait wasn't very long and we got a nice table in the pretty big restaurant. It has a nice flair and fun atmosphere. The food came very quick and the waitresses were nice. I can recommend the dumplings, however the rest of the food was pretty medium and just enough to fill us up as we were very hungry. I think the best idea is to get Americanized food rather then ordering authentic Chinese food from the menu. The fried orange chicken looked really good. Though this is not really my motivation to go to an Asian restaurant it may be good for a hungover lunch. We had the lobster shrimp sauce over rice and the shrimp and veggies. Do not try these entrees."], ["Jill G.", "Went to this place for an early Mother's Day dinner since I know that most restaurants are going to be packed for Mother's Day on Sunday 5/10. 1) got to the restaurant around 4:45. It opened at 4pm for dinner and wow was it packed already. Put our name down and it took us about 30-45 mins to be seated since we were a party of 9. 2) looked at the menu and didn't really have that many options to choose from (well there was, but not a lot for a usual Chinese restaurant). It had a whole page of entrees, half a page for noodle soup/lo mein, half a page for other noodles, back page for dinner packages for the dumplings. 3) we got our order fairly quick for knowing how busy it was. We had about 8 dishes and overall my favorite were the schezchuan (sp?) beef, garlic seabass, pan fried pot stickers, and the XLB. Although some of the dishes were a bit salty, it's ok4) Customer services was good. They filled up our water without hunting the sever down for more water. 5) I would recommend going to this place and will go here again. But, to only come here for the dumplings (duh that's why it's called the Dumpling Inn). But, I highly suggest to come here right when it opens or even before it closes to avoid the crazy wait."], ["Linda X.", "Wow I was blown away from how different this location was compared to the previous tiny place they had before! It's a beautiful space and tons of seating with a large bar in the middle. We walked in on a weekday for lunch and there was no wait. The service was quick and friendly.We ordered the famous xiao long bao (pork soup dumplings) 10 for $8. You seriously have to try these when you're here! The soup is hot, soo flavorful and very high quality. It took awhile for this dish to come out we actually finished our other dishes by the time it got to our table.We also tried the pork pot stickers (8 for $8) and deluxe fried rice ($11) that came with shrimp, beef, and chicken. They were both pretty good but I've definitely had better at other places.Come here for the xiao long bao! I'll probably just only get this next time. It's worth the trip out here, there's nothing else in San Diego like it!"], ["Christine K.", "First timer here!The decor is very updated, clean, wooden tables and high chairs in the lounge. There's also a very nice looking bar! Tvs everywhere. This place was modeled perfectly.Parking will give you some trouble if it's a weekend but you can park at Jasmines lot next door as well.I ordered the shrimp chow mein, deluxe noodle soup, shrimp and pork dumplings in hot sauce and xia long bao. In all honestly I'm not even a dumpling person! But the ones here were so good I wouldn't mind coming back for more. I would have gave this place a 4-5 star except for one dish and customer service.The deluxe noodle soup was so bland, sad and flavorless. Do not ever order this. I did not even touch it. No one at my table wanted to.The shrimp and pork dumplings in hot sauce and xia long bao were great and out of this world! It has truly started my love for dumplings!!The shrimp chow mein was very good! BUT my friend saw a hair in it. At first I thought it was a bean sprout but I moved it a bit and YES IT WAS A HAIR!!!!!!!! A little black hair. I have blonde hair and my friend has purple hair so obviously it's not any of us. Told the waitress she gladly took back the dish and said they would make a new one. Some guy comes back with a new dish and says \"Upon further examination it was just a burnt bean sprout but we made you a new dish anyways\" with attitude and I was so pissed off I didn't even eat the new dish. I should have just voided it off the menu. That moment just ruined my night.Hopefully I'll find another dumpling location I can enjoy or they should really get their sh*t together here."], ["Pat F.", "This review is more Shanghai Saloon based than Dumpling Inn based. We've dined here three times since the Dumpling Inn-Shanghai Saloon had launched at their new location on Convoy Street. Those familiar with the authentic Chinese food which the Dumpling Inn served when they were next door to the optometrist shop with 9 tables will be ecstatic that they now have 35+ tables throughout their dining room. Don't think for a moment that there won't be a scramble for a table with all that extra room. Next to Kula Sushi Lounge, Dumpling Inn-Shanghai Saloon is the next most popular spot in the strip mall they're located at (yes even more popular than Jasmine).We've sat at the bar all three times and Shanghai Saloon has an abbreviated dining menu consisting of small bites, appetizers, and a limited number of offerings. On Sundays, you can order everything from the Dumpling Inn menu at the bar. On all other occasions, you can only order off their bar menu. The bartenders Shawn (Bar Manager), Devin, and Steve are all really really cool and many of you may remember them when they worked for another very bar & burger spot some time ago. Standout dishes we've ordered were the: X-L-Bao (of course), their pork pot stickers, 3-ingredient (chicken, fish, shrimp) pan fried noodles, deluxe fried rice, lollipop fried chicken, & ahi poke salad.This Chinese Restaurant/bar has by far the one of the best lounges with couches and coffee tables set up to the left with many large screen television monitors to watch your favorite sports on. Go check it out! Their bar has plenty of seating on three sides at the center of the Dumpling Inn dining room! You may see us there if you stop in. Kudos to the owners for putting a place like this together which has all the right stuff. I wish they served food longer into the evening... I believe the kitchen stops preparing food at 10:00pm even though they continue to run the bar well into the late night."], ["Huy D.", "Easily the best chinese dumpling house in San Diego. This reataurant was housed in a small shack in the Asian district of Convoy st but now it moved to a location worthy of its stature in this community. Shanghai Saloon has been revamped for the better in all ways. The new theme is an old western chinese bar. Step inside the restaurant and you are taken back to the old wild west. Every element in the restaurant reeks of old western-chinese influence. The menu is large with many options. The typical choice is the xia long bao - juicy pork dumplings. There's nothing more to be said about that dish. It's just a must have entree that defines Dumpling Inn. Today I tried the fried rice with shrimp and the stir fry noodles with shrimp. For the noodlea, I selected the wide house made noodles which cost extra but taste so much better than the regular noodles. This dish reminds me of chow fan. The diah comes out smoking with the smoky smell and flavor. Large firm shrimps fill up the dish. Taste is excellent. The fried rice comes out the same way, smoky and delicious with large shrimps. Everything tastes wonderful. The quality of the dishes at Dumpling Inn stands out from the numerous other Chinese restaurants in San Diego.  After finishing eating, I do not have that icky dry mouthed feeling that I get from eating chinese food at your average chinese sit down restaurant. Must be the good quality ingriedients. Service was average. Not up to par with the American restaurants but better than the typical chinese restaurants. Parking in the plaza is tough though since the plaza is filled with many popular stores and not enough parking spots. Be prepared to park on the streets.Taste rules and this is the best lunch/dinner chinese food in San Diego so 5 stars!"], ["Roger M.", "I sort of miss the small hole-in-the-wall feel of their original location. But this new minimalistic hipster ambiance is not too shabby either. Who would have though that craft brews and crafted cocktails can be mixed together with \"little dragon dumplings?\"I've came back a handful of times since they've moved into the new building and found that it's much faster to get a table now that they've got much more space. If you're not looking to have a proper meal but just want to get your dumpling fix, you can just order directly at the bar. If you're a newbie or at a lost of what to order, here are a couple must haves:- XLB (their abbreviation for siu lung bao/xiao long bao). Having it with a splash of soy sauce/vinegar/ginger is a necessity!- Beef curry dumpling. This is sort of like a Chinese style samosa, with a lovely curry beef stuffing. Goes well with beer by the way! I noticed some reviews ordering orange chicken here. This is not the place to order that (take your arse over to Panda Express for that). Eat plenty of dumplings and wash it all down  (especially that MSG) with a nice pint of brew!"], ["Jason T.", "Definitely worth checking out. Sit at the bar if you can and enjoy some great local beers. My wife and I came in 20 minutes before close and the service was incredible. We didn't feel rushed and they even brought out each item separately to ensure we ate everything hot. Damn it was good. We started with the kung pao striped sea bass, yum. Light, crispy, and full of flavor, will definitely be ordering again. Next we had the steamed fish and chive dumplings. Solid. Tender and great flavor. Mix a little chili sauce, soy, and sesame oil in your little dish and dip generously. We wrapped up with the pan fried shrimp dumplings. So damn good. I could explain but you need to try it for yourself. Do yourself a favor and order them pan fried.I've been a few times and the food has been great each visit but this time was extra great because of the service. Our bar tender recommended a killer IPA and took time to poor tasters for my wife and I even though it was close to quitting time. I can't remember his name but he was working Sunday night 10/25/15 in case management wants to give him a pat on the back. He was really nice and enthusiastic about the food and beer it was obvious he enjoyed his job.Check this place out for sure, you won't be disappointed."], ["Dong P.", "With a name like Dumpling Inn - Shanghai Saloon, one could only wonder what manner of deliciousness this place could deliver. Inside, your senses are welcomed by lovely aromas from the East, coupled with hipster bar chic from the college age West. Is it a bar? Is it a restaurant? Maybe it's both!I've generally gone by a simple rule that if the restaurant doesn't cater to the ethnicity of where its food hails from, then it's probably no good. No doubt, this was no low rent shopping mall Panda Express nor did it attempt to be a sit down suburban PF Changs. But without any Chinese people in sight, I was pretty damned surprised to find that the food was quite good. Here is a breakdown of my culinary experience at Dumpling Inn:xialongbao - 3/5 stars, what happened to the soup inside?won ton soup - 3/5, won tons were good, soup was on the bland side of the spectrumpot stickers - 4/5, perfectly pan friedfried rice - 4/5, tasty, fried rightpan fried noodles - 4/5, great balance of crispy noodles and savory gravygarlic baked fish - 4/5, tasty fish without the fish tastepepper steak - 5/5, the best I've had in a whileService was attentive and always on point with any last minute requests, despite being part of a very large, multi-generational party of Vietnamese and Midwesterners. Perhaps this blend of East meets West offered at Dumpling Inn was the perfect venue to host our event after all. I think I'll probably come back again if I was in the area."], ["Nhu N.", "Wow!!! This place is so big now! Such a change. They recently relocated to the old market right next to their original place. Everything is so different now! Workers actually have uniforms now, there's a bar, decorations are completely different and nice now, and there are probably over 20 tables instead of 5. Everything has improved. I'm so glad they finally invested a bigger location. Food is still as good. I got the fried potstickers and 3 ingredient lo mien like I usually. So delicious!! Service was great! They refilled my water a few times and constantly checked up on us!"], ["Jake A.", "Likely the best tasting dumplings (specifically Xao Long Bao aka soup dumplings) in San Diego. Not nearly as legit as Din Tai Fung (for those of you that know), but it'll satisfy your local cravings. This new location at Shanghai Saloon is a huge improvement...to include the appearance, draft beers, and air conditioning. The food here is great, and the dumplings are solid. I highly recommend that you take your guai lo friends....its a local favorite for good chinese food."], ["Khrysten T.", "I've been all over Convoy, but never here until recently. The inside is spacious and looks newly done. I've only gone during the weekend, so I'm unsure how busy it gets during the week. I'm usually able to just grab a seat at the bar. Their dumplings are so good! My favorite are the ones with like a pork soup inside (Xiao... something). Their chow mein is very flavorful, as is their won ton soup, which is also perfect for a rainy day. Their happy hour prices are a steal. I've had their pork belly sliders, tuna tostadas, and their cream cheese rangoons. I would order everything, except the tuna tostadas, again. Great place to watch Sunday football that isn't too crowded on Sundays. Just beware that their parking lot is shared with Jasmine and several other stores, so parking is an absolute nightmare."], ["Conrad R.", "I like what you've done with the place. Much more dining room seating than before. A well stocked bar with crafty beers plus a swanky lounge area. The food is tasty. Service is ok. The lack of parking spaces is abysmal, especially with a new sushi spot that dropped, stopped, and opened up shop next door. It's a slick setup inside and a fresh departure from the original humble beginnings of Dumpling Inn's dining room, which was a handful of tables in front of mirrored walls for the illusion of a bigger space. The XLB is still delicious as well as their other freshly made dumplings. The restaurant theme is consistent throughout the room and visually pleasing.The central Shanghai Saloon is a nice addition, including an array of craft beers, a variety of spirits and a lounge area. We were there for lunch, so daydrinking wasn't in the plan. We'll be back during Happy Hour for drink specials and to check out the separate menu of bar snacks.The third feature is Dai-Pai-Don, a cash-only late night snack bar inspired by HK and SE Asian street bites and comfort foods. Check out the chalkboard menu for daily specials. There is a convenient ATM by the door, although I find it odd that this snack bar is cash & carry, yet Dumpling Inn & Shanghai Saloon both take cards.Hopefully the parking situation doesn't discourage. Dumpling Inn-Shanghai Saloon brings a new school restaurant bar to Convoy St that is worth checking out."], ["Adria D.", "I like the old dumpling inn better. The service was horrible and the soup dumplings were dry and generic. Definitely not the same. Rip dumpling inn :( Don't get Kung pao chicken either it has no heat and also lacked flavor. You could probably buy it in the freezer section of a grocery store and it would taste better."], ["Jeff S.", "I've probably driven past this place a dozen times without a second thought.  I guess it's been too long since I used to stroll up and down the streets of Convoy in search of great cuisine.  Regardless, like \"The Godfather\", Convoy keeps puling me back in.First of all, you can expect parking to be tough but hey, it's Convoy, so that shouldn't be a surprise.  After you find a place to park and make it inside, this place is extremely spacious considering that just about everything else on Convoy tends to be cramped and space is at a premium.  The bar is huge and there are plenty of large and small tables.  I wouldn't expect you to really ever have to wait but then again, anything is possible.Their food menu is pretty extensive, we shared a bunch of dishes including the XLB, potstickers, squidballs...and some others that I just can't remember.  For the most part they were all adequate, nothing that I would complain about but nothing that totally blew me away either.  Then again, it has been a longtime since I've really indulged in Chinese cuisine.  So I'm no expert.  Additionally, they have some solid happy hour menus for food as well as select beers.A very \"refreshing\" aspect about this place is their beer menu.  The menu is pretty extensive, something close to 25 beers give or take which should have something for everyone.In addition to all that, the service is pretty solid and our server managed to keep the tabs straight as well as regularly keeping tabs on us.  So everything seemed good there warranting no complaints.At the end of the day, this place is a solid Chinese cuisine joint with good Happy Hour as well as a great beer selection, and has great atmosphere with a nice restaurant and bar layout.  Will it parallel the best you've had in China? Probably not but who are we kidding?  People complain about the parking but it's Convoy and there really isn't anywhere other than the car dealerships and Zion that have a decent lot so I'm not knocking them for that.So drop by and check it out if you've been thinking about it. Dumpling Inn has something for everybody and are a pretty comfortable place to kick back and enjoy some food and drink."], ["Francisco M.", "The dumplings here are always great. Last night was my first time there since the remodel. The place looks amazing. The beer barrel tables in the front of the restaurant are awesome to see. With the whole saloon rebrand, they have a full bar in the middle now. They offer 30+ beers, hard liquor, and a whole bunch of drink specials. This is definitely a place to host dinner parties now! The food has always been great here. My wife ordered cashew chicken. I normally hate cashew chicken but this time around I almost finished it. Good Chinese food is hard to come by in San Diego. So this is definitely a go to spot!I didn't give them 5 stars because I think the plates are a little more pricy than traditional Chinese restaurants and don't give as big portions. But I will be back to try the pork belly sliders!"], ["Jannet C.", "Amazing ambiance, good prices, attentive service, delicious food- this place deserves 5 out of 5 stars from me! I have never visited the old location, but I adore the layout of this place and the saloon style, intimate feeling once you open the doors to Dumpling Inn. Despite the rather grand appearance however, it's dumplings are simple, yet quite delicious!This visit I got to try their quite WELL known soup dumplings and the curry dumplings. I wasn't too big a fan of the fried curry dumplings mainly since I'm not used to the two being mixed together- but those soup dumplings were pretty spot on. Flavorwise, they gave me the impression of 'mellow richness' if that makes sense: the flavors worked well with each other but weren't overly rich.The only qualm I have is that I wanted more soup in the dumplings! It seemed like all the filling soaked up our dumpling's delicious delicious juices."]], "Hong Kong Restaurant": [], "Rising Dragon Chinese Restaurant": [], "Panda Inn": [], "Minh Ky Chinese Restaurant": [], "Mr. Spicy": [], "J Wok": [], "Chung Hing": [], "Crystal Palace Banquet Hall & Restaurant": [], "777 Noodle House": [], "Mandarin Wok Restaurant": [["Lina L.", "There wasn't a single thing I could point out that had something wrong with it. My boyfriend and I were on out way to out usual post-gym dinner at Panera, but decided to try something new in our new neighborhood. Our order consisted of: egg-drop soup, cream cheese won tons, fried dumplings, orange chicken w/white rice, & mushroom chicken w/fried rice.I know what you're thinking - post-gym dinner!?? Yeah, we're a bunch of fatties! We justified our eating choice by telling ourselves we just went to the gym. Hahaha!So, go here! No excuses! Enjoy, and be merry!"], ["Kristina J.", "Not my first choice for Chinese food, but good enough when too lazy to drive down to National City. I usually just call in my order... Leave my house and by the time I get there my food will be ready! Pretty convenient! I always order the honey walnut shrimp...(it's my favorite dish and a MUST any time I see it on a menu) they garnish theirs with fresh broccoli which is a nice balance to the sweetened mayo sauce! I've also had their Mongolian beef. The beef was nice and tender...sauce had great flavor and lots of scallions and onions as well! Only thing it's missing is few chili peppers for some heat (but I guess that's just my preference with what I grew up on) The Buddha Delight veggie dish was also very delightful! I feel like it was a mix of all my fav veggies...mushrooms, baby corn, water chestnuts and bok choy with a delicious sauce! White rice always come free with the entrees, which I appreciate! The lady at the cashier is also very nice and sweet!"], ["D P.", "Without a doubt the staff are some of the friendliest I've encountered at any restaurant.  They were very friendly and my order was ready almost immediately upon my arrival.  I ordered the Kung Pao Chicken (at the suggestion of the lady taking my order - it being the \"most popular\" chicken dish), wonton soup, chicken lo mein and mandarin fried rice.  The only thing positive I can say about the food is that the portion sizes are huge.  Otherwise, what started as a pleasant experience turned out to be some of the worst Chinese food I've ever tasted.Despite the appetizing pictures on Yelp, everything was salty but bland and almost flavorless.  The chicken in the Kung Pao, the Lo Mein and the fried rice were those weird balled up pieces of chicken with fat or goo or whatever some places use.  I'm used to weird pieces of chicken here and there but this was WAY over the top...I couldn't eat any of it after a couple of bites.  The wonton soup was bland and some of the worst I've tried.  The shrimp was overwhelmingly fishy smelling and tasting and the beef was super fatty and tough.  The fried rice was just OK, with the meat in it being disgusting.  I ended up spending about $40 at this place and threw everything away and had to fix a sandwich for dinner.  I really wanted to like it as there is a dearth of decent Asian places near PB.  I will definitely NOT return.  Other people seem to like this place and that baffles me.  It's not like I tried one thing and it wasn't good, I tried something from almost every portion of the menu and it was all equally bad."], ["Josephine C.", "Never been a big fan of Chinese especially when paying. Most items are $10-13 and most include rice. Eh, I don't know what to say. Was looking to please my cousins guests for some fried rice but it probably won't be a place I'll go far to go to. Friendly servers and the place was clean and quick on orders."], ["Brian T.", "Writing this on the food. Not the restraint. Ordered the salt and pepper chicken nuggets. The chicken is cooked good but they just sprinkled salt and pepper on it. Royal Mandarin in Nation City is way better. The shrimp fried rice is on point though. I will go back."], ["Masako T.", "First time here and I'm a fan! The fried rice and mandarin beef are a must! The service is excellent, speedy and courteous."], ["Koala E.", "This place is awesome. Great, fresh food for a reasonable price. I love the \"Mad Men\" feeling inside.  The staff is SO nice and it feels good to support a local, family-run business. 好吃!"], ["Vanessa L.", "Came here to balboa park and yelp for a Chinese restaurant and yelp directed me to Mandarin  Wok. As always Yelp never let's me down. I love the atmosphere with he Asian soothing music. The food was delish!!! Orange chicken was delish with pieces of chicken breast and crispy. The customer service was excellent."], ["Louise C.", "Love trying hole in the wall Chinese places that are long standing and family owned restaurants. My family owned a Chinese fast food restaurant on the east coast and I've been looking for those same dishes and quality that matches. Ordered the pan fried dumplings, sesame beef, and chicken lo mein. The dumplings were pan fried crispy just right. The filling was moist but just average flavor. The sesame beef was light and crispy with a nice sauce served on a bed of broccoli. The white rice that came with the beef dish was a little dry. The lo mein was flavorful but was a little too salty for my taste, the chicken chunks were very big. Service was attentive and really available when we needed refills on water. Restaurant was clean and comfy. Definitely coming back to try other dishes!"], ["Jyoti Y.", "People here are really sweet. Even though they were crowded due to Christmas Day, the waiting wasn't long and the service was good. Less options for vegetarians but good food quality. Worth the price!!"], ["A P.", "Best Chinese in town. I have always been happy with the amazing food, great service, and affordable prices for such gourmet  cuisine. There is a reason why they have been around for over 25 years.  Check this place out and you won't be disappointed."], ["Maria O.", "Really enjoyed my lunch. Just what I was craving; some peace and quiet over a piping hot and fresh savory dish of seafood and fresh veg. Black bean sauce hit the spot. Really great service, good vibe, and throw back mom and pop. You can tell there's a lot of love that goes into this place and their Chinese food for the soul."], ["Jack H.", "After reading some of the bad reviews on yelp, I was hesitant to eat here, but since my favorite Chinese place shut down, I was desperate.For starters, I dined in on a Sunday-there weren't many people in there, also scary, but they were doing A LOT of carry out orders, which must be how they have been in business over 30 years.We ordered: egg rolls (they were so good we ordered 2 more to take home and they are the legit egg rolls, not spring rolls like a lot of places in San Diego), pan fried dumplings, sesame chicken with fried rice and chicken lo mein (hesitant after reading some of the reviews on the chicken). Everything was DELICIOUS-especially the fresh dumplings and the in-house made noodles. Portion sizes were HUGE for the price and I have enough left overs to last for days.Just as important as the good food was the amazing service. Everything came out fast and the two women working there-presumably the owners were very fast to refill my drink, brought everything out fast and were so so nice, which is why I decided to write a review.I will definitely be back. They have a big menu and based on my experience, they know what they're doing."], ["Ashlee H.", "Let me start by saying that the staff is super sweet, my food was ready when I arrived to pick it up and my order was correct. So far, I'm a happy customer!I ordered my go-to meal of chicken lo mein, shrimp fried rice and sweet and sour pork. Unfortunately, I wasn't very impressed and it didn't really satisfy my taste buds. I really wanted to love this place too, because it's so close to my house and I am desperate to find a worthy Chinese food spot in San Diego (I'm truly surprised at how difficult this feat actually is). I may try them again and order something the yelpers recommended though, because the customer service was great. Maybe those dishes just aren't their thing. Annnd the hunt continues..."], ["Carter O.", "First time eating here. I am very happy that the customer service was excellent. The food was very good. We had mangolian beef, lemon chicken and fried rice. Everything was delicious. My wife and I are definitely going back."], ["Mark M.", "got general tsos and it didn't taste like general tsos...and it was over priced...terrible"], ["Kelly N.", "Hi,  I am from out of town . We took our daughter to sea world today. I wanted some good authentic chinese food so I YELP it. I will only tried a 4 stars and up restaurant. I came upon this one it has good review and it's a family owned. I totally agree with ,yelper NAE P., on the hot and sour soup. It does taste horrendously awful. I think it's the worst I've ever eaten. They should call it hot and vinegar soup instead. We also order the Orange chicken and it did not have that crunchy orange chicken taste. My husband order the scallop with bell pepper, corn and veggies. Yelper, NAE P., was sooooo right, they used canned veggies, and 3 FROZEN SCALLOPS cut into thin slices for the dish.Last but not least, we order chicken fried rice without the veggies for my 6 yrs old daughter . Let me tell you , it is the most horrendous fried rice I've ever eaten. The chicken size was bigger than the McDonald's nugget and it taste like it came from a frozen batter chicken that they decided to toss it in there. We did not let our daughter eat it. Definitely disappointed for the 52.00 dinner plus tips it come out to be 62.00.I honestly don't know how they got 4 stars. Yelp has failed me this time."], ["Jasmine R.", "Worst chinese food I've had in awhile and pricey too. I ordered kung pow chicken and orange chicken and both lacked flavor and were heavily floured. Won't be reurning to try anything else."], ["Brandi W.", "I had the Kung Po Tofu (yes, it is called \"Kung Po\" on the menu instead of \"Kung Pao\"). I was expecting some vegetables to be mixed in, but it was just the pan-fried tofu with peanuts in a spicy sauce. It comes with a choice of white rice or fried rice.Despite the lack of veggies, it was really tasty. I gobbled it up appreciatively. The sauce was awesome, with just the right amount of heat. I would definitely order this dish again. Dinner entrees are on the pricey side, so I wouldn't suggest this place if you want a cheap bite. The dining room does have nice ambiance: lots of candles, dim lighting, big cozy booths. I would recommend this for date night or anytime you feel like having some expensive, great quality Chinese food."], ["MJ J.", "Had dinner with my family here. Based on the reviews we expected it would be super good Chinese food. Maybe it was the dishes we had. We thought they were bland. My husband has the mu shu pork and I had the chicken with mixed vegetables in the white sauce. We both had a small bowl of wonton soup which very good. As for the ambience, we got there a little before 5 pm on a week night. No wait for a table and the food was cooked quickly."]], "Dragon's Den": [], "Little Sheep Mongolian Hot Pot": []}