{"Luna Grill": [["Korina S.", "Good place to get lunch or dinner.  Have a good sized menu and the food is fresh and tasty.  Live close by so sometimes come here for take out.  A good go-to place!"], ["Jenna S.", "Finally tried this place for the first time the other day. Parking is rough around this street but we lucked out. The prices are affordable and they give you a ton of food. The place is clean and they have indoor and outdoor seating. Their menu has a good selection of options and the food came out quickly. You order at the cashier and then sit down with a number. If you are look for a casual and quick place to dine this is a good choice!"], ["Stella A.", "I was very surprised at how good the food was! Usually I don't find chains of restaurants to be as good, but I really enjoyed eating here. I got the bone in chicken kebab plate which came with salad and bread as well as rice. The chicken was flavorful and moist without being oily. I liked the modern feel of the restaurant and the cleanliness of the facilities as well as the friendliness of the staff. I would highly recommend trying here if you have not gone yet."], ["Sergio R.", "Stephanie is awesome. She goes over and beyond to satisfy your wants. I'm a picky and needy customer. She made sure she listened carefully and repeated my order. Love the food and atmosphere! Thanks y'all!"], ["Linda L.", "Awesome Sunday lunch. Kenia was our server and the chicken was moist and very delicious. We love the atmosphere here, very relaxing."], ["j p.", "I've been here many times to eat healthier food when i'm on a diet and I want to eat out. We usually get the chicken kabobs and they are pretty tasty, and I dip them in their yogurt, yummy. Also we love their spicy hummus (and they have regular also), with pita bread. If you're trying to watch your carbs, you can opt to get it with raw carrots and cucumbers instead. They got new dishes and I think the serving of hummus is smaller than before, and it's $4, so definitely go for happy hour.They used to have a feta dip that was delicious, but they took it away and we still wonder why. The desserts are 3 kinds of bahklava (we got the chocolate one) and it was pretty yummy, but they are $1.50 for 2 small bites worth. Their mini cupcakes aren't bad either, but they are the same price, which is too much. I've had the feta fries...not too impressed. The spinach pastry is ok, nothing that special. Bring back the feta dip!They have happy hour every day from 3-6 and all day sunday. The appetizers are half off, so that's a good time to try 2 for 1 price. The bathroom is clean and you can sit inside or outside in a shaded area on the side.Our waiter, Patrick, was extremely friendly and very attentive! The whole staff is always very nice. They would get an A+ in customer service."], ["Jamie T.", "THE PROS- Very clean/well-lit restaurant with a pay-per-hour parking ($3 per hour during dinner hours) lot behind it - There is a happy hour special for early dinners--50% all appetizers/starters! - Very friendly and courteous workers- Good-sized portions - Option to dine inside or outside in their patio - Very very good and authentic dishes at very affordable prices- Food is beautifully presented - Large selection of beers THE CONS - The paid parking is pretty small and can be difficult maneuvering your car through during peak hours ---I came here with a friend for an early dinner (4:30 pm pm) after picking her up from the airport in downtown. I was recommended to this restaurant by a Persian coworker when I told her about how much I miss Persian food from living in Little Tehran (Westwood) in Los Angeles. She highly recommended Luna Grill because of the prices and quality/how authentic the food is. I agree with her and highly recommend this place as well! It definitely hit the spot for my Persian food craving.My friend and I ordered the HUMUS AND PITA BREAD appetizer, the GYROS QUESADILLA, and CHICKEN KABOB ENTRÉE. All of the dishes were terrific. Well seasoned, perfectly cooked, and looked beautiful. From the dishes that we ordered, we liked the quesadilla the least because it took some time to get used to the restaurant's novel creation, but it was still fun to try and appetizing. The humus is some of the best humus I've tried in SD and it looks beautiful (I've uploaded a pic of it to Yelp). The chicken kabob entree is a nice complete meal with a sizable skewer of chicken, basmati rice, lightly seasoned salad, two sheets of pita bread, and your choice of a grilled tomato or carrots. The portion sizes of all our dishes were perfect; we even had some leftovers that we took home with us. My friend and I left with our stomachs comfortably full.Although the restaurant is next to a few bars, the environment is still great for families. When my friend and I went, there were several gay families; they warmed my heart. The restaurant is spotless and very-well lit. The workers are very kind and the restaurant is well staff. There are a lot of tables/seats including seating in their small outdoor patio. Overall, I highly recommend this restaurant! You should definitely go if you're craving Persian/Mediterranean food."], ["Karen S.", "I love Luna Grill! The food is fresh and the service is excellent! Joviah was very attentive and so sweet. The patio is nice and comfortable and super clean."], ["Paula J.", "I put in an order over the phone and I'm not really into salad but JOSEPH did what he could to accommodate me and make sure I was happy. He was a pleasure to speak with and very sweet. I know I can be finicky and difficult but he didn't make me feel that way at all :) and obviously the food is awesome, duh."], ["Larik M.", "Delish mediterranean food and very reasonably priced. Great service, clean and good ambiance."], ["Kirsten K.", "hi, i'm with stupid.i had a birthday party and ordered take out from here ($200).  my mom called in the order.  i called to check on its status and they were certain that no such order was called in nor paid for.  i must of talked to the guy for 5 minutes about my confusion.... meanwhile party's a bust.  my mom later drove over there only to find out that the name our order was sitting under was in catering vs. take out.  roger that.wow!  use kid gloves here, folks.staff was not apologetic.... they were defensive.  food was cold.  party was over."], ["Lauren L.", "The flatcut chicken plate is amazing! Everything from the fluffy jasmine rice, to the super juicy and flavorful chicken. A great, healthy meal. If you haven't tried this place, give it a chance, you won't be dissappointed."], ["Gloria C.", "I love the food here, the kitchen staff are very nice and personal. My favorite chef is Sergio, always a great meal when he is cooking."], ["Amanda D.", "We got some kebab meals for takeout. It was SO delicious! And very healthy as well. We will be back!"], ["Ruben L.", "We had the Mediterranean salad and beef kabobs plate; good ambient, nice presentation, great flavor."], ["Fouad M.", "Went to this place on weekend and loved it. Ordered spinach pie in appetizers and it was delicious. Also ordered chicken kebab and lamb kebab entree and they were delicious and cooked to perfection. Apart from quality of food, I was very impressed by their customer service. If you like to try safe Mediterranean cuisine, this is a good place to start."], ["Ruben Q.", "A nice blend of Mediterranean food, vegan and vegetarian friendly. There happy hour is awesome $3 hummus platter is well worth it!"], ["Sean C.", "Quality, afffordable food that is consistently good. For a chain, this knocks it out of the park."], ["Staci S.", "Great atmosphere, friendly staff, delicious food. I ordered the Apple Walnut Salad with salmon and was given a meal that was fresh and satisfying. I would definitely go back, and would like to try their Gyros or Kababs."], ["Corina S.", "Abran is always friendly and prompt! The place has been clean all the times i have dined in. The guest service is awesome, abran made sure to check on us at least twice to make sure we were doing good. Food order was correct and reasonable price! I enjoyed my dinning experience once again and will deffinately be back!"]], "Harbor Greek Cafe": [["Ray T.", "I don't care what everybody says I came from Chicago and I know what's  Gyros is, how come you serve gyro sandwich without tizyaki sauce and cheap on the meat.!  save your money and go somewhere else., by the way it's overpriced"], ["Dee M.", "Decided to try Harbor Greek Cafe at the recommendation of a friend and because I wasn't in the mood to actually get out of the house, their option for delivery had me sold ! I ordered the chicken plate, gyros plate, and kids gyros plate. The prices are reasonable and competitive and we didn't mind the $5 delivery fee. We waited just about an hour for the food to arrive and the delivery guy was nice and pleasant.  I would have given more stars because the food was great, but I was shocked at the serving size (or lack thereof) for the meat on the gyros plate! The kids plate and the full sized gyros plate had about the same amount of meat :( so completely disappointed.  It barely tickled my husband's stomach who had just gotten home from an afternoon of playing football. I took a pic that I'm going to include. The food is awesome, but the portion sizes leave something (a lot) to be desired. Willing to give it another try and cross my fingers that they don't skimp on the winning item on the menu !!!"], ["Fanny C.", "This place was GREAT! I'm so glad I found it because I've been looking for a greek food spot near my house that isn't SUPER expensive.  I got the greek salad, which is my favorite salad.  I forgot to tell them no olives, but thankfully there wasn't that much olives.  They didn't over feta cheese the salad, which was great.  It comes with some pita bread and the tzatziki dipping sauce.  The tzatziki could have been better, but it wasn't terrible.  The place was PACKED during lunch time on a Tuesday, so they clearly must be doing something right.  I will totally be going back!"], ["Mel H.", "Got a combo ate that included a gyro, chicken, rice, pita bread, and hummus. The price was average. I don't think I've ever found a cheap Mediterranean restaurant. The gyro was delicious and the rice was good as well. The pita was a bit cold but I can't blame them; I ordered it to go. The hummus was average but the chicken was too dry. I would definitely eat here again but will stay away from the chicken and stick to the lamb."], ["matt l.", "very good greek food close to the airport. Easy parking. Fast service good food and beer. Been here several time over the last three years and always leave satisfied. Great place for a quick bite before the airport...thats why I first stopped by and have kept coming when I'm in town."], ["Shelly B.", "Food was good & enjoyed the Hummus and beef \"kabob\". Pita bread was warm & tasted good.  We sat outside, which was really nice on a breezy evening.  Server was really friendly and nice."], ["Emilio H.", "Food is great. We had the combo for two with chicken and lamb and it was very satisfying. Service was great and staff friendly."], ["Andrew M.", "Hummus was awesome.  The eggplant dip was just ok, but the tahini in the middle of the dip was amazing.  It was the first time i had white tahini.  The gyro was good as well."], ["T S.", "Very straight forward menu and reasonable prices.  I was pleasantly surprised with the service and the gyro special with fries & a drink for $8.99!  They have a great condiment bar with peppers & a hot sauce that is to die for!  Hits the spot!  Definitely will return."], ["Dustin R.", "The food is good, but unless you get the daily special, it's too pricey. I've been to greek places with bigger portions and u get a little hummus with your dish. Add some hummus for the pita slices and we are talking a bit better deal. I debated dropping to a 3 star rating."], ["Paul T.", "Ate there last night and the food was really good,the lamb was nice and tender,and I had a gyro salad!"], ["Pascale N.", "Aaok.  I rest time having a falafel sandwich with green falafels.  Definitely lacked a kick of flavor. $7.99.  Friend got a gyro sandwich with a drink and fries for $8.99.  Amount of fries was eh."], ["Cassie B.", "Ordered the salmon plate and moussaka for delivery.  They increased the prices from the menu for delivery AND added a delivery fee.  The food was mediocre.  The salmon was overcooked and the moussaka tasted like something out of a TV dinner.  I would not come back."], ["Melissa C.", "Pretty solid greek food.  Went there the other night and had moussaka, gyros plate, and dolmades.  The food is GOOD and the service is very friendly.  We're looking forward to picking up \"to go\" after work every now and then."], ["Craig M.", "Wonderful little Greek place to stop and have lunch. The food is always good and tastes like Greek food with the seasonings that they use. (Sorry, but some places taste like they forgot that they have Greek on the sign out front with lack of flavor) you can't go wrong here but would advise that it's not that big of a place. So, if they are busy..you might be looking for a seat outside."], ["Craig L.", "Was really hopeful to experience some unique flavors, some high quality food, at a reasonable price and found none of that at the Harbor Greek Cafe during a recent evening stop for dinner.  Have been to plenty of Greek places having lived in Greece and all over the country but other than the food being hot when served, this place has a way to go.  None of us ordered gyros so maybe that's what they do right but otherwise, dine elsewhere. Sure it was walking distance from my hotel but so were a number of other restaurants more highly regarded (and rated on Yelp) but after a week in SD, it was time for something else.  Bottom line, should have had something else than Harbor Greek. The flavors were bland including nondescript hummus, store bought pita, old dolmas that were soggy, runny tzaziki sauce, stale Stellas, though I did think the felafel wasn't bad but for the price, it wasn't anywhere near what our group was looking for.  Service was quick and the woman at the cash register was friendly. Noise level was quiet since there was only one other person eating there (should have been enough of a clue) though they were doing some brisk take out business."], ["Tracey W.", "I'm visiting from out of town and just had food delivered to my hotel. I'm eating as I write this, and I'm just so stinking happy right now.  I ordered the humus, cheese and olives, and spanikopita.  I recommend all three."], ["Marissa J.", "I love greek food...this place has really good food but they are so inconsistent it's ridiculous. I order something very very very simple. I always get chicken kabob and hummus appetizer. I have to add and pay separate for cucumber and tomatoes to have with the hummus, which is crazy to me because most GREEK places automatically serve cucumbers and tomatoes with their hummus and pita because that's traditionally how hummus is eaten. That's how I prefer it. The appetizer hummus and pita doesn't come with it so I order it on the side. Every single time it's different. The first time it was a full order of hummus and pita bread and I ordered a side of cucumber and tomatoes...it was the perfect amount. I ordered it again another day and they gave me a whole order of hummus and pita but literally 3 tiny tomato chunks and 3 slices of cucumber that were cut in half.... I had to cut up the tomatoes and cucumber so small to eat with my food it was strange that I was charged extra for it. Today I ordered the exact same thing and I get 4 pieces of pita and the teensiest tiniest portion of hummus and 1 half slice of cucumber and 1 tomato chunk....so disappointing to know I was charged $15 for 1 chicken kabob and the skimpiest portion of hummus and pita with a side of cucumber and tomatoes. I'm still hungry it wouldn't have even satisfied my 8 year old. Good tasting food, just very inconsistent and pretty skimpy."], ["Bonnie F.", "Awesome gyros and the pita bread and tzatziki sauce are wonderful!!!  We always get gyros pita sandwiches and they never disappoint.   Loaded with tender gyros, lots of fresh lettuce, tomatoes, onions and the freshest softest pita bread.  Sometimes we get fries and they are tasty as well.  Excellent service, clean.  Love that they use real dinner plates and real silverware, instead of disposable plates and utensils like most fast casual places use, because they can't be bothered washing some dishes. Wish more places would catch on to this model.  They have outside seating too.  Friendly service, huge selection, fresh, fast, yummy."], ["Rick B.", "First let me say the employees were very friendly and attentive. We were greeted courteously and rendered patience as we, being newcomers, got the hang of the menu.Located among a swath of restaurants at Liberty Station very close to the historicmock-up ship, U.S.S. Recruit, Harbor Greek Cafe has a very small interior and with the grill area open to the restaurant  the ambient temperature is a little on the warmside in spite of what ever air conditioning may be running. We sat next to the front door although there is outdoor seating.We had the Dinner For Two Special which was a gyros plate and a chicken kabobplate each with salad and rice, we added two bowls of soup and fountain drinks.The Egg Lemon soup (Made fresh daily according to their website)  tasted like it needed some salt and pepper, and definitely some more lemon juice, a lot more, and maybe some more eggs. Seriously, check that recipe.The Gyros plate and the Kabob plate were acceptably tasty.There is a small salsa bar with with Italian pickled giardiniara. To my way of thinkingGreek cuisine leans toward the eastern Mediterranean. I would expect a \"Salsa bar\" thus to be stocked with olives, olive oil, hummus, and Tzatziki, not Italian pickled giardiniara.The tab came to $36 and change. A little bit pricey considering the same thing at Daphne's would have run about $21, with pretty similar ambiance.The restaurant was clean and tidy. There is plenty of parking, and easy access from Harbor Drive."]], "Troy's Greek Restaurant": [["Mia C.", "It was an ok Greek restaurant, which we tried because of the Groupon they offered. Tried the Gyro and Chicken Souvalaki combo, with a side of Clam Chowder. And the Mousakka with a side of Chicken soup. Overall food was good. Chicken Souvalaki was flavorful but had too much fat"], ["Andrew L.", "There isn't much to say about this place.Best greek food I've ever had, no other place has ever come close.Whole family and many friends have been coming here for two decades now. Nuff nuff fam. Tbh tho this place is fire flame. Peace out fam."], ["Cathy H.", "We came here on Friday night.  I haven't experienced such prestige customer service from a server in a long time. He was very nice, accomodating, attentive and efficient! I had the chicken athena, salad and my boyfriend had the 1/2 lemon chicken and lemon soup which is way better here than anywhere we have had in the past. The chicken athena was nothing short but dynamite! It was delicious, still juicy, very rich and definitely not recommended if you're watching your waist line!! Haha. We have never noticed this place before, but we live up the street and will definitely be back for Greek food."], ["Eva C.", "Very good Greek food.. The place need some upgrade as cheap buckets holding umbrellas outside-looks more like TJ"], ["Steve F.", "I'm trying to broaden my epicurean horizons by trying new places via Amazon Local and Groupon, and when I saw that my coupon for Troy's was going to expire, I told myself that I would come here for brunch this past Sunday.  Normally the brunch is about $9.95 (the champagne version is about $13.95), and even with my drink, my coupon still covered everything.The brunch was quite delicious - while there's the usual breakfast items like sausage, eggs, bacon, and waffles, it's the lunch items that really steal the show.  From the tender pot roast, to the well seasoned gyros, to the creamy pastisio (a baked casserole with macaroni, ground beef, and topped with a creamy bechamel sauce), and even the mousaka (another baked casserole, this one made with eggplant, ground beef, potatoes, and also topped with bechamel) - nothing disappointed.  Even the spanakopita and baklava were on point - the baklava in particular wasn't overly sticky, which is the way I like it.  No falafel on the buffet table, though - although there are Greek salads and tabbouleh (bulgur, parsley, and tomato) available.Service was great - they kept my drink refilled and even made some small talk when they found out I was a Yelper due to the Yelp charm on my cell phone.  And the restaurant itself is pretty clean; despite a busy brunch service, the staff did everything they could to clean the tables between customers.Looking forward to coming back to hopefully get the light lunch special after work... especially as I have one more coupon for Troy's that expires this Wednesday.  (Who knows, maybe they'll have the belly dancers on the floor by the time I get there!)"], ["Jennifer W.", "Calamari - delicious nice & crisp but the squid wasn't overcooked. Gyros Sandwich, presentation was nice but it was difficult to eat. Meat was really well seasoned and tender. Service was good, our server checked on us often and refilled our waters without us asking. Overall the food was great and I would definitely come back again to satisfy my greek cravings!"], ["Koula V.", "Was driving through the strip mall and unintentionally found this place. I was very impressed at how great the staff and food was! It's a great place for a meal at a decent price, will definitely be going back!"], ["Damaris H.", "Disclaimer: I know nothing about Greek food. Tried this place because it was convenient. Very flavorful food and really nice hostess who took my take out order. Will definitely come back."], ["Margaret D.", "All these years of living in SD and I've never set foot in Troy's. Last night I wanted some Greek food and decided to check this place out.My husband and I were the youngest in there by far, unless you count the grandkids accompanying some of the parties. It's that kind of place-- not for the young and hip, but for people who want a good value in the neighborhood. Light colors and white tablecloths topped with glass. Meatloaf or gyros on the menu. Something for everyone. I got the super platter-- which is just as it sounds-- super. Huge. Came with gyros, souvlaki (forgive the spelling-- the beef shishkebab), spanakopita (huge wedge), salad (or soup), cooked carrots, rice pilaf, AND gyros with bread. Husband got the gyros plate. I recommend the super platter because it's only $2 more than the gyros plate and you get a ton more food. I took half home.Service was good though they were pretty busy. If the waiter didn't come over then the busboy or hostess did. They had free refills on soda, too. Our check was processed immediately when we were ready. None of the slowness some other reviewers have experienced."], ["Orlando R.", "Went out for Greek but the place I had in mind (taste of Athens) was closed. Bummer, anyways we decided to drive around the area and see what else was there to eat. While doing so, we came across this place. Greeted immediately as we walked in and we were seated right away. Everything about this place is pretty old fashioned which I don't mind. At first they seemed a bit slow, but through out my meal people constantly came in for take out orders. The food was ok but everything was a bit on the salty side all around from the soup to my rice. Another great thing about them is an actual kids menu, being I have a three year old this was perfect."], ["Andrew N.", "For the price it deserves the highest rating. The Greek food and soups are great. They do offer traditional American cuisine for those that don't want Greek, but if you go go Greek. The atmosphere is really fancy and noise level is quite. They can accommodate larger groups   and have cozy booths for the couples. It's great for breakfast too when you want something different. They have regular breakfast dishes and some diverse Greek breakfasts that blow me away, especially for the price, less than $10.The wait staff is very friendly and explains the food rather well. I would highly recommend giving this place a shot."], ["Mark W.", "our experience does not come close to some of the reviews here.  I had one of the Dinner Specials which wasn't all that special.  It was roast lamb which was extremely dry and gamey tasting.  I wondered if it had been the special on previous nights and amounted to leftovers.  very disappointing.My wife had the char grilled chicken which was unimaginative to say the least.  Looking for the positive...our waiter was a nice guy.   Would not return"], ["Brianna D.", "I love this place. I go here when i have a groupon. THe portion sizes are large enough to share! My fav is the rice pudding."], ["Veronica D.", "I have lived in Allied Gardens for 6 years and today was the first time we visited Troys. It was very good! I'm so glad I finally tried it! Great little venue, great food and friendly service! We will go back!"], ["Adria D.", "This place was pretty good. I still think Alexi's in Hillcrest wins the Gyro wars. The gyro meat and pita was pretty damn good here some of the best.  I had the Greek chicken which was good, a little bland and dry but not bad. The side of green beans were EW. They were nice enough to bring me more carrots instead because I kept trying to eat the beans and making faces while pushing them around in the dish. I thought they were canned but the waiter insisted they were fresh. I guess they just cooked them into mushy oblivion in the tomato sauce. The garlic lemon potato was weird. I took it home and put jalapeno cheese on it for lunch which was good.The service was excellent! They let me try several wines and of course the gyro which was really cool.Anyway i will go back for the gyro at lunch time just to be sure but for now the sample they gave me was very impressive."], ["Dani R.", "First time experience- used their online ordering system and asked for a falafel plate which comes with rice pilaf and pita bread with the option of soup or Greek salad.I asked for and paid for the Greek salad option with a substitution for the rice pilaf for more Greek salad which I paid nearly 3 extra dollars for. Picked up my food, got home, surprised to see my order was made wrong. Double rice pilaf and no Greek salad to be found anywhere. Total disappointment. Even tipped them at the front for being so friendly. Go here if u like to be ripped off."], ["Walter K.", "Troy's has the look and feel of a Restaurant that has been there for many years. The decor is a bit dated, but It's clean and well maintained. The service is attentive and efficient. I like going to a Restaurant where the servers have just the right amount of interaction with Diners and seem to be experienced at doing their job. And now for the food, the Gyro Platter is a good choice, fresh beef and lamb cooked on a rotisserie. It is served with soup or Greek salad, rice pilaf, hot pita bread and tzatziki sauce, though I wish it came with french fries. The lemon chicken is very good and comes with the same sides. We've had quite a few salads and most are very tasty. Strangely enough, they have some of the best clam chowder I've had anywhere. The Burgers are good as well. I'd say a solid for stars and consistently so. Have never had a bad meal there. The reason I don't give the fifth star is that it's not outstanding and a bit on the expensive side. It seems to be popular as it's always fairly busy with people dining in and getting take out."], ["Marie I.", "service is great, food good, atmosphere pleasant...I just couldn't get over the amount of gnats swarming my food, and self o.0I looked like a crazy person waving incessantly to everyone and no one... fending off those pesky critters! I was inside dining."], ["Maria B.", "We got take out from here to bring to our friends with small children, and it was a great treat from everyone! We ordered several of the combo plates (chicken, gyros, souvlaki) with potatoes and green beans, the pastistio, and the pasta. It was enough for both lunch and dinner for 4 adults and 2 kids, and reheated very well. It was the real deal--very authentic and fresh.While we waited for the food, we noticed how pleasant and accomodating the staff was with their patrons. They have a very nice outdoor seating area, and it appeared that the staff was very attentive to both indoor and outdoor patrons. The restaurant was clean, with scenes of Greece painted on the wall. Best of all, they play greek music in the background!"], ["Bree G.", "Got delivery at work ( right across the street). Ordered from eat24, literally ordered and delivered within 20 min! I was amazed. Got the gyro sammy and some fries. Fries werent mushy when they got here which is a super plus. The sandwhich had alot of meat in it which i liked. The tziki sauce was good but i wished it was already on the sandwich. Solid 4 stars!"], ["Michael R.", "I live right up the hill from this place and have seen it for months and always been curious. Finally looked it up on yelp and decided to give it a chance today. I had the calamari to start.....and I was pretty impressed.           Then I ordered the gyro platter, and it started with a soup. I chose the lemon chicken and rice soup. I loved it, extremely lemony, but I love lemon so it worked out great. And my gyro platter, I had ZERO complaints. Rice pilaf was cooked very well, the gyro had a lot of flavor, not like Luna Grill or Daphne's, but very flavorful. Tzatziki sauce is not as flavorful as the others, but still very good. Not worth taking a star for tzatziki being my only complaint. Will definitely go back!"], ["Patty M.", "I came here with my boyfriend and his family for the brunch buffet. A few people from our party were running a little late and the server was a great sport! She made sure we all had drinks, reassured that there was no rush, and invited us to begin on the buffet when we were ready. The food was surprisingly good quality for having been buffet style. I often find food at buffets to be dry or overcooked but everything tasted fresh. I preferred the Greek food over the breakfast options. The salad and the gyros were by far the best! The pita was nice and soft and the tzatziki was just ok, I would probably pass next time.Would I go back again, absolutely! The food and the service were both great."], ["Juan E.", "First of all I have been wanting a Greek Omelet for a while now. I used to get it back in Chicago and Toledo. I had it there and it became probably my favorite since. It had been almost 3years since I had one. So I saw a guy with a sign that said Troy's Now serving breakfast. I was headed to get a breakfast burrito. But quickly changed my mind. I pulled up and notice they had an outdoor patio. And since it was Oct. 31. and the weather was nice. I had to eat out side. I was quickly attended to. I saw that they had a Gyros Breakfast. I asked what it was. And to my delight it was my Greek Omelet. I was very excited. I ordered right away. I sat outside enjoying the nice weather and yelping. When my waiter brought my orange juice, I told him about my search for that omelet. I also told him our favorite Greek dishes. He told me then that I had to bring my girlfriend in on Sunday for their brunch. I agreed but we haven't made it back yet for that. shortly after our conversation. He brought me my food. i almost dove right in. But luckily I took a picture before. Julie is getting me good at that now. My mouth salivating as I took the pics. I could smell the great aroma of the gyros meat and feta cheese. I put the camera down and took my first bite. It was just like the one in Chicago. I could not believe it. I was convinced that this place was going to be getting a lot of my business when I have time to get breakfast. It didn't take long for me to finish my meal. Even though I was trying to hold back. It was that great. I enjoyed my time outside and loved that how they had table cloths and how the place was placed in the corner. I do have to come back for lunch or dinner to see how great that is."], ["Christine H.", "Awesome service! Seated quickly! Our food was ahhh-mazing! Seriously, the prices are low for the quality, flavor and presentation of the food! We ordered pork barbecue, charbroiled chicken w/ lemon potatoes & green beans and the chicken salad (Greek salad). Everything was cooked to perfection and absolutely delicious. I was sad to ask for a box...I wanted to eat it all!!!! The people who left bad reviews are INSANE!"], ["John M.", "I tried this place a while back for breakfast. and while the food was good enough, there is no way it should have taken nearly 35 minutes to get a plate of eggs to me. Especially since I was the only customer in the shop. Won't be giving them a second chance."], ["Tristan P.", "Love this place! I get the gyro platter which is so good. My girlfriend loves the grape leaves which I have had and they are awesome as well! Highly recommend."], ["Sue B.", "I haven't ordered from the regular menu because we met up here for the buffet brunch last Sunday morning.  Around 10:30 AM it was nearly empty except for a handful of what were clearly regulars at this fairly large sized restaurant be-decked with Grecian whites and blues and murals depicting vignettes of the home country.  Parking is fairly easy to come by in the strip mall where Troy resides.  The buffet has a number of choices including scrambled eggs, sausage, bacon, French toast, moussaka, pastitsio, BBQ chicken, roasted chicken, pulled pork, meatloaf, spinakopita, warm slices of pita bread, salad, dressing, tzaziki sauce and gyro meat.  I tried the pork and roasted chicken which were good, but nothing notable.  The pastitsio and moussaka were both topped with traditional bachamel sauce, but it tasted sweeter than what I'm used to and had congealed into a rubbery crust on top of the casseroles.  I could also not detect a trace of cinnamon in either of them and while this didn't detract from the flavor, the saltiness did.  Thus, I focused mainly on the pita, gyro and tzaziki which were the best items that I chose.  My brother loves this place so I'll probably try it again and just get a gyro next time!  It costs about $11 a head which is is a moderate price for all-you-can-eat, but I don't know the exact amount because the baby had charmed a local regular and she paid for our entire meal without taking any credit.  If that lady ever happens to read this review, I sent a hearty thank you from Mom, brother, sister-in-law, baby and me!"], ["Melissa G.", "My coworkers and I placed an order for pick. I ordered the Greek Salad w/ Salmon. The salad was WATER LOGGED. It had about 1/4 cup of water. I called the Troy's to let them know about my order. They replaced my salad with a new one. Left work went to pick up a new salad, SAME ISSUE!!! Called back and ZERO help, ZERO remedies, ZERO apology, ZERO NOTHING!!!! Will not be back"], ["Elisa H.", "SECOND REVIEW ON TROYS...last one was 4 years ago. FOOD IS still CONSISTENTLY EXCELLENT. BUT.....The wait for the food is ungodly slow at times...We went in here - MID WEEK DAY MORNING - with 4 tables of 2-4 people each - in the entire restaurant - and it has taken over 35 minutes for food to be served. Other times as short as 10 minutes  - same number of tables filled. We've been ordering the same thing...not complicated...an omelete.  ( We think they are waiting for the hens to lay the eggs out back.) OVERALL: Service is very good, food is suberb, but the grill staff need some help. I still give this place five stars."], ["Jack M.", "I was in the mood for some Greek, specifically a gyros sandwich, so I decided on checking this place out. To my surprise, the single gyros sandwich was only $5.95 (yelp.com/biz_photos/troy…) and for a $1.95 extra you could add fries or soup. I decided to add the split pea soup. (yelp.com/biz_photos/troy…)The soup was very good. It was creamy and it still had bits of tender peas, onions, and carrots. (yelp.com/biz_photos/troy…) The flavor felt very home style and the seasoning was mild but right on the money. I would order this again.The gyros was not only very good as well,  but it was loaded with flavorful tender gyros meat. (yelp.com/biz_photos/troy…) The tomatoes and onions were all crisp, fresh, and plentiful as well. (yelp.com/biz_photos/troy…) The Tzatziki sauce was top notch, and it just made the gyro sandwich even better than it was. It was creamy, filled with cucumber strains, with a slight lemony and garlic flavor. (yelp.com/biz_photos/troy…) My server, the gentlemen that was also running the front, was very polite and he kept my iced coffee filled. (yelp.com/biz_photos/troy…) Nice place and the gyros sandwich is a good bet.Today was a good day for some gyros..."], ["Dan E.", "Very reasonably priced Greek/Mediterranean food. We had great service (and dressed nicely too- our waiter in a crisp white shirt and dress pants, our hostess in a black skirt and stockings with a dress shirt; it made it feel a little classy, you know?) a delicious meal, plentiful parking and a Yelp deal to boot!The menu is mostly Greek favorites- souvlaki, gyros, spinach pie, with some American items like hamburgers and meatloaf and fries. For dessert they have baklava which was great! I would go back for this alone. The pieces are large, warm and flaky and served with a generous serving of honey. Everything we had was good though the fries were a little dry.The interior is a little aged, but feels like a Greek family place you'd find on the East Coast."], ["Agata S.", "Omg came here for brunch this place was amazing!! For buffet food it so good. And I love hat they have greek and breakfast food. I also love that they give you glasses of Champange not like premixed mimosas. The service is decent they are just super busy but everyone is friendly good atmosphere and great food."], ["Jen C.", "Stopped by here after reading reviews on Yelp. Was very good and the lunch specials cannot be beat! Delicious , fresh Greek food. Nice spacious dining area. Great service-I intend to return"], ["Skye T.", "Good Food and Friendly Staff! I found them in the get1free books offering a free dinner"], ["Kirsten C.", "Good food, nice atmosphere, prices are just right."], ["Ashley V.", "This is a really good Greek place. My favorite item is their lemon chicken soup! The Tzatziki sauce is great with their pita bread. Some of the food is not super amazing, but I still really enjoy other items there. :-)"], ["Chinh N.", "Food is great here, I always order the two grill chicken breast filet and side cucumber. I would really suggest eating here if you are looking for some good grill chicken."], ["Kris R.", "Found out about this authentic Greek restaurant located near Kaiser Permanente Medical Center after many hospital trips during my mother's illness. I still continue to meet my family there for an occasional meal. There are elderly local folks that know the wait staff which tells me it's good. Food is always freshly prepared and orders are fast. The menu caters to everyone's palate, and wallet, besides Greek food there are standards like burgers and fries. Awesome breakfast served daily until 11:00 a.m.  On a recent breakfast outing we were actually 15 minutes past the breakfast service but they accommodated us anyway. For lunch I usually have the hummus/falafel dish. I think my family has tried just about everything and no one has been disappointed. These are usually large plates and you'll be taking some home."], ["Bruce J.", "Great food, reasonable prices and good service.  What more is there?  Definitely recommend this place and their various menu items.  Parking can be rough at times but that's about it.  Highly recommend"], ["Einna S.", "After working out, I was hunnnnngry.  The boyfriend wanted to go to Soup Plantation but I was not really craving SP so we were on a hunt through Yelp.  We haven't had Greek food in awhile and this place was super close to our pad. PERFECT.  We got there and it was not too packed at all for a Friday night. It wasn't super fancy but it was  nicely decorated. We were greeted by friendly servers.  The bf ordered the braised lamb meal and I ordered the gyro and chicken souvlaki meal which comes with either soup/salad and rice pilaf.  We thought it was pretty darn good. Along with an appetizer, everything came up to under $40 including tip.Will we come back? We sure will :)"]], "Apollonia Greek Bistro": [], "Meze Express": [["Erin L.", "I work near this plaza and live near the Meze downtown, so when I saw Meze Express, I almost peed my pants!!!I ordered a Greek sausage mini wrap, which is $5, and it was pretty good but nothing to write home about, unfortunately.  I think I may need to try some of the other goodies.Here's my issue.  I think the food is good.  But, I'm cheap. I'm not the type of gal that can spend $10-15 on take out lunch.  Flamebroiler next door, $7 for a bowl.  Subway couple doors down, $5 six inch.  $10 wrap?  Hm...although, the food is of much higher caliber and pretty good....I don't know.In any case, I will most definitely go back and try some of the other stuff."], ["Phil A.", "Good food, a bit pricier than the other restaurants surrounding it though. The portions make up for it and the feta topped fries are amazing! Sometimes it takes a while for the food to be prepared which is the reason for the 4 stars, as I'm on a schedule usually for work it can lead to me going elsewhere during the day. Definitely recommend the place!"], ["Jenn S.", "After shopping at Ralph's, I was driving through the parking lot & spotted this place. I had eaten at their downtown location and came back w/ mixed reviews so I decided to give this express location a try. Food was very tasty, with big chunks of meat. Their customer service was great! A HUGE improvement from their downtown location. I will definitely be back.But ... if you get cold easily like I do, bring a sweater because it was FREEZING in there! That's the reason I took one star off. They had a/c blowing full blast right on our faces & ceiling fans also going at full speed. I have no idea why either because it was only 70 degrees outside - overcast too so it's not like it was Palm Springs & 120 outside. Good grief. Other than us totally freezing, everything else about it was great. We will definitely be back - but I'm bringing a scarf or sweater w/ me next time."], ["Jennifer V.", "I want to like this place, I really do. I did at one time. Their Greek Chicken hit the spot...at first.  I kept coming back. But.. I can't get consistency with this place, they cut the amt of chicken, then the pita.  So I ordered double chicken, hoping I can get the same satisfaction and quality, willing to pay more... The salad was $15! Ok cool, I'm still in.  The chicken was BURNT!!! Did you really have the nerve to serve me up a $15 salad with BURNT chicken???! Really?! I'm done.  Maybe I'll see if the one in Hillcrest can keep it right...I miss the old Greek spot that owned this spot'"], ["Janelle B.", "Just tried this place for lunch today.I LOVE GREEK FOOD. Its truly one of my favorite cuisine's on earth. I also used to work at a Greek restaurant (Daphne's BEFORE they become this \"California Greek\" crap...back when they first started out and served Greek food.) I had a hankering for a Greek chicken salad and some avgolemono soup so I decided I'd give this place a try. Coming in, right off the bat, they had a flat screen situated outside since its World Cup season which was pretty cool. Compared to the previous Greek Café that was here before, this place is A LOT BETTER in terms of cleanliness and looks. The young lady at the counter promptly took my order and so I waited for my food.I ordered a Greek salad with chicken ($9 + $3.50 for the chicken) and soup ($3.50.)  I'm usually weary of ordering salads to go because it seems like a lot of places jip you in the to-go salad department but the salad was a good size. The downside is it does not come with any type of flatbread or pita bread. For $12.50, I would have hoped they had some to go with my salad. The chicken was good, nicely marinated. I did not care for the type of cucumbers they put in the salad - they were bitter. If I ever find myself there again, I will also probably ask for extra salad dressing as they don't give you much (that's a personal preference of mine though.) The salad also had a lot of the middle part and end of the lettuce that I throw away.The soup was okay to me. Not as lemon-y as I prefer but it had a good amount of chicken chunks and rice.Overall, I give this place 3 star based on the salad and soup. Maybe I'll come back and try the gryos as it seems that's what a lot of reviewers seem to like."], ["Donna R.", "Love this place. Great food.  Great service. I work close by and it so so nice to have this quality food choice for lunch"], ["Jack S.", "I recently tried Meze Express in Mission Valley. I'm like their falafel tacos, what could be better then a perfect falafel in fresh soft corn tortillas ! (it's even better if you bring your own avocado slices !). Falafels need tahini (not tsaziki), and Meze offers a great tahini sauce for the tacos - but you have to ask for it. They also have a good hot sauce at the tables. They tend to screw up the orders, and there is a new cook that hasn't quite nailed the recipes. Definitely one of the best places in that strip mall...."], ["Jeremy N.", "Great Gyros and Garlic Fries! Awkward that they ask you for a tip at checkout (it's on the computer).  It's fast food, they really shouldn't be asking."], ["Antoinette G.", "I am not very adventurous type when it comes to food... I tend to stick to what I know. This was first experience with Greek food and OMGosh!!! I have a new found love! The food was great and the prices weren't bad either! When I'm in San Diego I will definitely have to visit again! You will enjoy!"], ["Wendy D.", "I love Greek food and I really like how this is super close to my work. The fries are the perfect amount of crispy and flavor. The greek salad is my favorite salad and there's is a good porition size. This time I tried the falafel pita wrap and it was delicious! Will try that one again soon. Friendly and helpful staff as well."], ["Gregory M.", "My wife and I had very good lamb shanks with Meze fries and gyros wrap.  I am usually not a big fan of fries, but in this case I enjoyed it.   Gyros was a bit too salty, otherwise good.   We are going  to come back"], ["Timothy S.", "The steak taco is amazing. The chicken taco was a little dry, but still has great flavor. I will definitely be back."], ["Vanessa B.", "Customer service - exceptional. Super nice lady gave me a few samples of the hummus and tahini sauce because I'm so indecisive.Good - consistent with the restaurant (AWESOME). Portions are good sizes and chicken kabob and grilled veggies were sooooo good!! And clean healthy food too! Gluten free optional available!! Favorites: grilled chicken breast kabobs, fiery feta hummus, cilantro jalapeño hummus, grilled veggies!!"], ["Jeff B.", "I seriously have been here 3 times this week! I can't get enough of the tacos! This place is like a Mexican / Greek infusion! Totally recommend this place."], ["Victor P.", "Hands down the best Greek food in town! I was very curious to try Meze Express, and did not let me down! Meze Express has all the flavor of the downtown restaurant without the higher prices. The food at this place is fantastic! I got the chicken skewer plate.  The chicken was super juicy and grilled to perfection.  It comes with pita bread and you get to choose two sides.  I chose salad and rice. I work in the area and have been there 3 times since they have opened. I would recommend the Greek and Gyro tacos, are really awesome. Great meal at a great price and the staff was friendly too. Definitely check this place out."], ["Aztech Sol O.", "Mezé will become a favorite at first bite! Our server Andrew was very welcoming! All that was served to us was top of the line! Thank you for the fantastic experience!!"], ["Melissa D.", "My man (who is Greek) and I love this place!! We saw Meze Express while out running errands and are always looking for the best Greek food to try. This place definitely met our expectations! He loves getting the gyro plate and I love the getting the gyro wrap. The tzatziki and pita bread are amazing as well!"], ["zzyzx z.", "Co-worker and I walked over to try this new place today. We both ordered the asparagus salad with chicken which was a whopping 14 bucks.  The wait was long so you'd think my complaint was untrue. Looking forward to our lunch back at our office I was getting ready to sit down and enjoy my salad when my co-worker called me, don't eat the chicken it is raw. I opened mine up and sure enough it was raw. We waited 20 minutes for raw chicken?!?! We had to walk back to return the food. When we told the cashier she just said ok. No apologies at all.  No trying to resolve it to make us want to return.  They told the cook and he did not react.  You'd think he would apologize as well.  They just gave us our money back with no apologies.  We have warned our co-workers about this place and not to bother with them."], ["jim s.", "I ordered the Gyro Wrap with a side Greek Salad.  Everything about it was delicious!  My wife ordered the grilled asparagus salad and enjoyed it.  She let me try the grilled chicken that she added to the salad and it was really juicy!"], ["Jason S.", "Just came in today with high hopes that this greek place would be a little better than its predecessor - nope. The last place was better, not by much but it was.I asked for a just a standard Gryo + fries and a drink combo. The girl let me know they didn't have a combo like that with a drink included so just ordered a drink a la carte. She recommended the Meze fries so I went with that.The gyro was large but cold and sad...Gooped up with too much tzatziki sauce, the gyro meat with slightly warmed over and balogna'ish, wilted lettuce, weird pickled bright purple/pink onions, and the pita bread tasted like something you'd get a Vons, processed, dry, and chewy. The fries were also cold, in old grease, and had feta, garlic, and parsley on them...didn't do much to make them better.This was pretty sad times for the gryos and fries combo. Not being a snob, everything I said above I could substantiate. It was like a slopped up lukewarm bologna wrap with cold fries. The drink machine was cool - one of those high tech soda machines where you can create any soda variation, diet and caffeine free vanilla coke if you so desire."]], "Mediterranean Cafe": [["Tyler K.", "Two for 22 is the way to go! Tons of food for a good price too! All you want in a Greek restaurant and more."], ["Sunny J.", "Thank you for another delicious night out! The food and service is as great as always :)"], ["H B.", "Why does this place have 4 stars overall?We heard great things. Maybe my expectations were too high. Or maybe it was just a bad night.The hummus was so thick and gritty it was like hard-serve ice cream. No creaminess that is supposed to relieve me from that dry ass falafel. My spanakopita was soggy so at least that was some moisture on my plate, even when it shouldn't have been.I give it two stars for the effort of our lovely waitress, who was sweating hard in a no AC restaurant, working a full room with no help. You go girl. You're kickass. I have no idea why you'd work alone but you did good."], ["Chey S.", "Food was great, Pricing was excellent... And $2 off, just amazing.. Would highly reccomend!!!"], ["Scott H.", "Took advantage of the dinner special. For 25 dollars you share a meal that can feed 4. Do not order this unless you are hungry! I liked the flavoring of the pita slices. What you get is a large salad, pita slices, hummus, tabouli, feta cheese, choice of two kabobs, gyro meat and falafel.  The ambiance is great. Kinda like a rustic Italian, maybe? Great service with Vanessa and the owner stopped by to see how we were doing then the next thing I know, we had a warm conversation. Very inviting and warm. I say try this place if you are in the Mission Hills or Hillcrest area. You will not be disappointed!"], ["Sunny L.", "I didn't feel that this food was the most tasty and I love Mediterranean food. I was looking forward to trying the dinner for two with my man, but it wasn't what I had hoped for. I felt that the kabobs were over cooked and I was looking forward to those the most. Everything else was just ok and was kind of overshadowed by the toughness of the kabob. We were the only ones in the restaurant and were able to watch Judge Judy while we enjoyed our meal. They provided plenty of pita bread and the selection on the giant plate was vast. If I could have gotten over the dryness of the meat, I would have loved this place so much. The beer selection is interesting. Maybe I went on a bad day."], ["Priscilla B.", "It's so hot. No AC. Fans off. The rice is dry. The salad looks like it came from a pre made Costco bag. The meat is delicious which is the only reason I am leaving any stars. My suggestion is to order meat only to go. We waited forever to try and escape because we were surrounded by flies. Which brings into question the cleanliness of the food being prepared in the back."], ["Stephanie T.", "Fred, I don't appreciate your delivery driver accusing me of getting a free sandwich, when all I wanted was my lunch. .. the food I payed for and I even gave him a tip. Had he not accused me of receiving free food this review would've been different.  The experience should match the food.  I don't patronize establishments that don't value their customers.  I still say someone can't count.  We ordered and paid for 4 sandwiches,  received 3 but I got free food. Do the math."], ["Yeon W.", "Unfortunately, some of the people working here are forgetful where they shouldn't be. Already twice in a row, I find out they didnt give me salad dressing previously  and this time they forgot the white sauce for my chicken shwarma sandwich. Sigh. A good sandwich gone to waste!!  It's not the same."], ["C B.", "Sunday, June 21st of 2015, 8:07pm.  I walk in, and immediately get asked to have a seat anywhere.  I pick the center table.  The server takes care of me right away, asking me for my beverage of choice from a drink menu, I decline, and she gives me the menu to order.   I order an appetizer of tabuli and the chicken kabob.  The server told me it's going to be a lot of food, and recommended that instead of a salad for my entre that i go with a tabuli salad.  I comply, and wait patiently for my meal.  The meal arrives, and at first I was expecting a huge 12x12 plate overflowing with Mediterranean goodness.  Instead i got a beautiful 12x6 plate full in the middle.  A great serving of rice on the left, freshly made pita (it was bomb diggity) filled the top center to the top right corner, at the bottom right you have this perfect size of tabuli (with all its freshness and goodness), and finally a perfectly grilled, chard, and thick chicken kabob that filled the entire stick stretching from one end of the plate to the other (not 12 inches) on top of the goodness.  I recommend this great restaurant! Try it, love it, return, and spread the good word."], ["Latha P.", "We went back for a meal before heading to Balboa Park and once again, it was a very good meal. I had the vegetarian lunch special and my son had the hamburger, which he found very different and tasty. There is a public /paid parking lot behind the restaurant if you don't mind spending the money. I wanted a cheap meal and so parked on Front Street and walked down. But if you are in a rush, pay for parking. Otherwise, you may be driving around for a while before you find a good spot. Their food and service are both outstanding. The salad was so fresh and tasty. This time around, I found their falafels a little disappointing. Too much salt and a little too wet/soggy inside for my taste. But their hummus, pita bread and their rice were all delicious. And it is extremely well priced. Don't forget to check in on yelp and get $2 off!Oh and I tried my son's french fries and they were very, very tasty. In fact, he finished his fries before his burger. And that is very rare for him :)"], ["Vivian W.", "My first visit to Mediterranean Cafe was during my business trip to San Diego.  I've been to San Diego many times and sampled many savory foods but I wanted something different, something not too greasy.  Not in the mood for pizza, fried foods, or Mexican but for some delicious Mediterranean cuisine.  Beef lule and chicken kabobs were on my mind...which lead me to the Mediterranean Café!At first, this place wasn't much to look at; just a plain front which was kind of dark.  But once inside, it was very clean and tastefully decorated.  My friend and I were the only ones there at the time and we were greeted by a very friendly hostess, who took our order.  I had the chicken kabobs and gyros plates (yes I was that hungry!).  Before long, our plates arrived at the table by the same gal.The plate was huge and plentiful.  Good amount of food plus a side salad.  The chicken kabobs were good but a bit on the dry side.  A little more seasoning would make it perfect.  The gyros were nicely seasoned and I was given a good amount.  Overall my plate was not bad but that doesn't deter me from returning.  The friendly hostess did a very good job.  Before long, the entire place was filled with patrons."], ["Stephanie A.", "You guys already know how much I love this place. Great food, service is prompt and always friendly, and they've been accommodating when I need to bang out some work in the corner. I'm updating my review just so I can give anyone the quick run-down on their food. They have a vast selection, and you might be looking through here to find out what people are eating. Avgolemono soup: It's a lemon chicken soup. Savory and just rich enough to remind you of your childhood American comfort food, with a proper amount of tang. I believe there are rice bits in there, so if you're feeling under the weather, or if it's a rare, chilly day in San Diego, the soup comes highly recommended. Salmon plate: You get a salmon fillet, cooked until it juuuust flakes. It's perfect. Seasoned well, and buttery. It comes with herbed rice/fries, warm pita, and a side of greek salad. Beef Kabob: The meat; It's seasoned, with a lovely char on their onions and green bell pepper. Biting into the meat produces a juicy pink middle. I don't usually do kabobs because it's so easy to overcook, but this is really good.Mediterranean Veggie Delight Plate: Try saying that ten times fast. Now this is where I get really excited. It's silly because I'm a massive carnivore, and 9 times out of 10, if I don't have meat when I go out, I can't help but feel a little disappointed. Not so, here. Let me break it down; falafel balls are perfectly tender and moist, with a crunchy exterior. It's just herby chickpea mash, but done right. Hummus is great. You'd be hard-pressed not to bump into it at some point when you're here. Spinach spanakopita--it's like garlicky creamed spinach wrapped in filo dough. Definitely one of my favorites off of this platter, but it's very rich. It came with fluffy herb rice, greek salad, and warm pita.  $9.95 and it's a lot of food I nearly couldn't finish it. Nearly.This probably brings me one step closer to the dark side, but boyfriend is pescetarian, and I'm super excited to let him know that I ate veggie food, and I am happily sated."], ["Annalisa Y.", "First time here and I will be coming back! I ordered food to go over phone and it was ready when I got there. The chicken Greek salad is so delicious! The chicken tender and juicy as it should be. I got the herb rice which I have enough for leftovers to make with other meals this week. Lastly the chocolate mousse cake is TO DIE FOR. I love desserts and this was awesome. You can definitely tell it was homemade. Hurry and check them out! Worth every penny. :)"], ["Sam A.", "Wanted to try a new place other than what the main streets of Hillcrest has to offer (and often go to eat) And a grand experience of taste was eaten! Heard a rumor from patient that there is a place just around the corner of UCSD hospital where all the doctors, nurses, and staff members go eat. Well certainly no lie there, after we sat down three nurses, staff member and two doctors come in. Came in and checked out and noticed they have lunch combos. Order the combo #5 came with a Gyro (stuff with tons of meat! Not like other places you are eating and there is only like 2-3 strips if meat, this was stuff). If also came with either fries season with their salty n spices seasoning or basmati rice mixed with herbs (I got the rice), along with a Greek salad with a free canned soda! It was very tasty! The gyro I couldn't put down highly recommended.The rice was hot off the place good along with a fresh Greek salad with feta cheese crumbles! Yum!The restaurant it self is bigger than how it looks. It's very nice décor. A lot of windows, flat screen tv, and fountain. If you check In on yelp you get $2 off your bill!!Good place for lunch! Will return again! :)"], ["Irma A.", "This place is just good! I like it, it's comfortable, it's very reasonably priced and the food has been good every time I've been there. The family meal is a win win, several meats to try, salad, rice, pita, cheese, humus and rice. The chicken is delicious! Served on skewers, cooked perfectly--so tasty! This time I tried their pistachio baklava--- it was very good! I don't know if they make it there or elsewhere, but it's good, try it!Family, couple, or friends--nice atmosphere to sit and talk.."], ["Sonia S.", "I'm giving one extra star literally for the delivery service... They seriously got here in like 20 mins! Anyway the food was not superb in my standards of Greek food, but it was good.  The gyro meat was delish as always.  The hummus and tzatziki were a little bland, but still passable.   Kabobs tasted a little overcooked for my taste, but that could have been a result of delivery.  But all in all not bad, and they give you large portions."], ["Noelle R.", "Ordered delivery.. It took forever and I didn't like the taste of the food. Cheap tasting rice, salad and soup."], ["Darlene B.", "Literally came here to visit a friend working and for some dessert. Checked out their options and we couldn't decide between the key lime pie and the cheesecake. Debated because I wanted the cheesecake but he wanted the key lime pie and we went back and forth that our friend was nice enough to give us both. Little did I know that I'd like the key lime OVER the cheesecake, haha, my mistake. That means I should branch out to try other things, cause clearly I'm missing out. The key lime is also made there while the cheesecake is most likely store bought. This place is more on the casual side, plenty of seats, you can order in or take it to go. Great selection of kabobs and other Mediterranean options."], ["Cindy B.", "Fucken amazing!  I live a good distance away and my fries were still hot when they got here. Delivery was fast. The food was great. And they deliver to the middle of nowhere! Thanks! Oh portions are huge"], ["Chop J.", "Really dry flavorless food .. second visit same as first experience . .was hoping it was just a bad day..nope ugh... waste of time a money...."], ["Brad B.", "Man, checking in on Yelp really does the trick. I totally forgot that I had been to Mediterranean Cafe until I saw the reminder to write a review today. Let me be clear that I didn't forget because it wasn't a decent spot, but most likely because I had margaritas and tacos on my mind before leaving on vacation to Mexico the following morning.A few friends and I were actually on our way to a different restaurant in the area when parking (or lack there of) got our panties all knotted up. As we turned onto Washington we landed a metered space and lo and behold the Mediterranean Cafe beamed it's soft and welcoming interior lighting upon us. Walking four blocks all of a sudden became an impossible task and we stepped into a much more convenient and equally delicious option.I browsed the menu while listening to live acoustic guitar and selected a glass of red wine with the chicken kabob, gyros and hummus combo plate. The wait was brief and a MASSIVE plate of food arrived in mere minutes - I was staaaaarving and started picking it apart. The chicken kabob was the definite star of the plate (platter) while the gyro meat jumped on the average train for me - not disappointing, not great, just average. The hummus and pitas were portioned well, which seems silly but I always find myself either asking for more pita or running out of hummus with pita leftover. The little things, friends. Oh yeah, the hot sauce comes in a bottle that looks like ketchup and is awesome... drown your food. It's okay and who says that lambs and chicken don't like getting a little wet? Long story short (not really) is that the price was right at $12.95 for the meal and all of us walked out satisfied, stuffed and ready for vacay."], ["Nancy R.", "This place caters a nice lunch for your workplace, they deliver and are very nice.  We had kabobs, hummus, pita, salad, and they comp'd some desserts.  Very fresh, healthy, and delicious food.  I will use them again for a nice catered lunch."], ["Gwyn C.", "Like the ambiance.   Nice presentation and tastey.  Kabob chicken was very well seasoned but a bit skimpy on the chicken.  Veggie plate was well seasoned and perfect size.  Lunch specials were very reasonable and good service  A lucky find, thanks yelp."], ["Jolie F.", "I had a horrible experience with this place. I put in a delivery order and it took them over two hours to get it to me when I was originally told it would take about 40 minutes. After several calls, the staff kept giving me excuses about the delivery guy being over worked. The delivery guy arrived and he had dropped my food so it was all jacked up and cold of course, and he gave me attitude when I didn't tip him. I I left a message for the owner and he refunded me for my purchase and invited me to come in to have some hot food on the house (which was actually pretty decent). I appreciated that he tried to fix it. My advice is if you are going to order here, don't do delivery."], ["Leslie M.", "I ordered my first order from MC last week. I ordered a delivery for a very important sales presentation I had at a local college. I chose them because of the reviews, and I am soooo glad I did! The food was a hit! Everyone was so happy, and I landed the sale!! Thank you, Mediterranean Cafe :)"], ["Chris M.", "Delivey service was ok, but not the best food. Tried the \"dinner for two\". Most items were way too salty, especially the falafel and the lemon chicken soup, which was simply inedible after the first spoonful. Shish was ok and chicken was good. Hummus was good. Rice was dry. The 'cold' soft drink I ordered was placed in the middle of the hot food in the bag, so was closer to room temperature when it reached us."], ["Adria D.", "Stale old bread which tasted moldy. Ice cold gyro with about five tiny tomato sprinkles and 3 onion smidgens. The taziki tastes like trader joes and was too thick. Hands down the worst gyro I have ever had what a waste of $7"], ["C D.", "Wanted to take a second to update my review. We went nearly a year without eating here after our last experience. But we went a few weeks ago and experienced the service and food that we fell in love when we first started eating here. I've had very few owners bother to respond to my reviews and the fact that Fred did just further shows how much he cares about his restaurant and values his customers. I'm happy we went back and look forward to eating here more frequently again."], ["Missmojorisin C.", "The food was pretty tasty. The BF and I both got the chicken kabobs, gyros and hummus plate. The salad portion that came with mine was a little lacking, which was disappointing( I found it odd I got a little puddle of salad and my bf got a regular size side salad.  Other than that everything was pretty good other than having to nuke our food when it was delivered since the delivery took about an hour and a half. I'm not sure if this was some kind of delay because of ordering through Grub hub or what but I would order again, just wouldn't wait till I'm hungry already to place the order."], ["Amara B.", "We ordered delivery. Practically one of the best Gyros I've had. Nuff said. It took about 30 minutes for the food to be delivered and was still hot. It almost seemed like the era wasn't cut from the spinner but with more fresh pieces which I really liked it it was a little bit different and it also provided for thicker pieces instead of the typical thinner ones that I'm used to. I like the fresh to Tzaziki sauce.overall he was definitely happy and will certainly order again."], ["Ellen H.", "Really neat decor.  Service was confusing.  We finally went and got our own menu.  We got the  $21.99 dinner for two.  First a huge salad came out with a heaping amount of feta cheese.  Mmmm.  Then our meal.  The meats were so tender a butter knife cut them.  Soft pita and another heap of feta cheese.  Very good!  Only negative thing was that there were a lot of flies.  We'll go back if ever in this area again."], ["Thomas M.", "Love this place.  Best place I've found for delish chicken swarma and I've tried a lot."], ["Marisol H.", "This specific location was not very clean when we stopped by. I'm not sure if we had just missed the rush, but the tables were dirty. On the positive note,  we have eaten here multiple times and their food is great."], ["Isabella N.", "Best place for greek food ever! I brought my mom here for mothers day and she loved it!  The hummus is to die for! Will definately be back! It's a must try! The service is great as well!"], ["Candy S.", "We ordered delivery from Mediterranean Cafe yesterday afternoon. There were a couple of little things that were not amazing, such as the rice being pretty bland and a bit dry (even by delivery standards), but that wouldn't really warrant a one-star review; not in my opinion anyways. The thing was, the chicken kabob was completely raw in the middle... On a delivery order. Not really all that easy to just send it back, now is it? Gotta get that one right guys!BTW- the delivery man was very nice. I apologize to him for my one-star review."], ["Joanna T.", "I just strolling around Hillcrest for dinner and I finally decided to try medditerian food for the first time.  I was surprised how fair the prices of food is. My friend was hesitant in trying different food, since he loves eating pizza on a daily. But we are glad we tried it. The customer service was amazing and since we came in on a Friday night we were able to listen to live music.  It was really nice and the amenities offered here was just fabulous. I ordered the gyro in pita and wow my taste buds just wants to roll over. My BF got a beef kabob, it was huge portions, tender and juicy.  The rice has herbs in it and I really enjoyed that.  The owner of the restaurant was super nice.I try my best to support local/ family own business because it taste like a little bit of home."], ["Joseph D.", "We were very disappointed with our recent experience with Mediterranean Cafe. We ordered delivery and were told it would take 45-60 minutes and it ended up taking over 100min  to get our food.  In addition, our food was cold on arrival and overall not very good.(Not a surprise as the driver who dropped it off also had 7 other orders sitting in his car)The chicken wrap was incredibly dry as was the falafel. The beef kabob meat was at least tasty and the gyro meat was tender and flavored well. The appetizer sampler was okay. We appreciated the pita bread that was soft and fresh.Overall, the food is likely generally OK, but since it was cold by the time we got it it came across a lot worse. Primarily, the delivery time was downright ridiculous. We recommend they hire more drivers and be more realistic about their delivery time."], ["Joe A.", "We absolutely love this place! It's one of the best kept secrets in town. However, the owner could always use more business. :-) I mean, where else can you getFreshly baked pita bread, large Greek salad, hummus, falafel, tabouli, eggplant dip, gobs of feta cheese, rice pilaf, gyros, chicken kabob, beef kabob all for under $25!?!?The food is consistently good and there's always leftovers. Many times we actually split the two person meal with three of us.And whenever I come into the restaurant, no matter how long it's been, the owner always seems to remember me and greets me warmly genuinely asks how my family and are doing. Whenever my friends are having a craving for Greek food, Mediterranean café is my first and most enthusiastic recommendation."], ["Hung M.", "There's a sign by the kitchen that said to be patient because good food takes time, and it's true because we waited at least 20 minutes for the food to come out...but it was sooo damn worth it. Chicken kabobs were juicy and plump with wonderful flavor. Rice was perfecto. Hummus was...well hummus.  Salad tasted fresh. If you're considering dessert, get the chocolate mousse. Truly a slice of heaven. Price was very reasonable for the quality and portion size.  One con is parking sucks. Had to drive around a few times before finally finding a spot along the streets a block away. It's Hillcrest tho...Will definitely be back here soon to try out more!"]], "Arslan's Gyros": [], "Alexi's Greek Cafe": [], "The Kebab Shop": [["Lisa S.", "I just tried to give this place a 5 star (now I'm redoing it???) Anyway, like I said, the place is great except for when you have to wait -- that's why I call in advance now.  The other day I was able to receive a free kabob card when I did have to wait so they too care of me :)Get the gyro plate!! aweesome"], ["Matthew R.", "My second visit was the same as the first. Both doner wraps. Both very disappointing. The lamb/beef meet seems as is it was cooked from frozen.The flatbread cool down the entire wrap so that the contents are lukewarm. Suggest: putting wrap in sandwich press to prevent this. Staff were are super nice, but that doesnt make up for the sub par food. If you're from Europe you will be disappointed. Suggest having a few pints before attempting to eat here. That may help."], ["Thulasi O.", "In Turkey or Europe when you get a doner kepap they slice the meat hot right off the rotisserie. Its sizzling hot and the aroma hits you. Here it was lukewarm precut, had to have been from the day before, b/c this was nearly opening time.Staff was very nice.Also, the Algerian salad the eggplant was way way undercooked and essentially not much flavor."], ["Mike H.", "We love this place but when you order a chicken doner with orzo zuchini salad to-go, and arrive home only to find a kebab of chicken with rice, it sucks!"], ["Stephanie G.", "I went here last month when I was in San Diego and WOW. I've been searching for a real doner kebab since I came back from Spain and every place has either had meat on a stick or gyros - FINALLY found a kebab shop that does it right.My boyfriend didn't want a kebab because he'd never had one before, and got a chicken shawarma - and totally regretted it once he tried my doner kebab. Get extra sauce! And if you're visiting San Diego plan to want to come here more than once - I was so bummed we only had time to get it 1x while we were visiting."], ["Crystal R.", "It was good tasting. I didn't know they were closing at 9 and but we came in at 8:47pm and they were nice about it.They messed up on my order I ordered 2 shawarma with lamb but they gave me ckn. They only had enough for one lamb bec they were closing. The kids meal is pretty good decent size. The cashier Amanda was fabulous, she was closing and didn't pressure is to leave. She was real friendly.Gave it 4 stars bec of the service of the cashier."], ["Nikki N.", "I came here around 7pm last night for a quick bite,unfortunately by then they had run out of beef and lamb. So I figured I'd try something new and ordered the Moroccan Shrimp doner box, less rice and extra salad. I was a bit disappointed by this dish, there were only 4 shrimps in the box and it was over cooked so the shrimp meat was hard and stringy. My meal basically composed of saffron rice and salad. Ive had other food at the kebab shop before and it has been great, maybe just need to stay away from the seafood.Service however was great, the cashier was a wonderful lady who was patient and very tentative."], ["Juana M.", "Monday 11/23/15, was not my day at the Kabob Shop in little Italy; an hour after I ate a chicken kabob plate I got extremely sick!!!My husband called the Kebob shop left a detailed message for manager to be aware of and call back, never heard from him/her. Of course, we sure did not want a free meal after the terrible experience. Juana"], ["Lisa W.", "More like a 4.5 stars now... I was reluctant to try The Kebab shop again because my first time around wasn't the greatest and I didn't have a desire to, but nothing wrong with giving second chances. Especially if the Kebab shop is all about great customer service and they do truly care if you have a good experience. This time around I tried their lamb/beef doner (wrap) and it was much much better than the plate and less salty. The yogurt sauce was just as good as I remembered it. The meat was less salty and it had great flavors. It went well with the sauce, vegetables in the wrap and the wrap was nice and warm. This is a very good and I would say a better alternative to the other lunch options in the area (sandwiches or burritos). I also had their roasted chicken doner. The wrap needed a bit more chicken or evenly distributed chicken, towards the end like 1/4 it was all veggies, but still delicious! I'm just a pig and always want more food... yummmm. So why not 5 stars? Because I have yet to try more! Next stop their sandwiches. It will keep me coming back."], ["LaMar D.", "I tried the Kebob Shop based on good yelp reviews. I ordered the Doner with grilled chicken. I will say that I was pleasantly surprised with how big it was. It was all I needed for dinner. The chicken had great flavor and all the ingredients molded together nicely in the wrap. I got a side of cucumber yogurt to dip it in. I'm sure I'll be back."], ["Andrea A.", "I came here to get some food to go a couple of time , 3 time for be correct, the staff is young , happy , the food is good , not the Top but affordable and simple in the taste . I try the lamb plate and the chicken , if you really hungry go for the chicken they give really nice portion . I will came back."], ["Angelina F.", "Wowzers! Best Doner I've had, maybe, ever?!? I ordered the beef and lamb donor and it was mind blowing I also got baklava as dessert let's just say anytime I'm in town I will come to this place to eat!"], ["Vicky B.", "This is a good quick casual spot that's also good for take out.I came here Thursday, I love the smell of a Greek place when you walk in the door.  My friend had the chicken skewer plate with rice and hummus, I don't eat meat but he thoroughly enjoyed it and the chicken looked grilled to perfection.I went in thinking I'd have the falafel wrap but they had tons of side dishes in the front that looked so yummy so I went for those.  I had the eggplant salad which was delicious and definitely had a kick to it.  I also had the spicy hummus and pita bread and between the 2 you could feel the heat.Clean place, friendly staff and overall a great place to grab something quick yet fresh!"], ["Ben T.", "This place is quickly becoming one of my go-to spots. It's reasonably priced, and the food is VERY good. I always thought gryo meat was supposed to be sort of dry and crispy, but here it's moist and tender. I want to try some of the other things on the menu but that gryo keeps seducing me every time.The customer service in this place is on point, as well. Everyone in there was super nice and friendly, and not just the kind of regular customer service that you'd expect in a restaurant. I walked out of there saying to myself \"wow, they were all REALLY nice!\" When I got my order something was accidentally left out, which i was pretty bummed about because I was incredibly hungry. But I contacted the manager and he was very responsive and quick to make things right. Mistakes happen and they more than made up for it. I will definitely be coming back. A lot."], ["Randy B.", "Just when I was heading into Little Italy to get a meatball sandwich, I came across this kebab place.  It was nice enough to stop me on my heels (not pumps), and allure me in.  With it's nice branding and cute little rustic and yellow paint, I had to pop in and place an order.  The meatball sandwich will have to wait for another day.The kebab plate had the lamb/beef shawarma with two sides and a bevy of choices -- I went with rice and caprese salad.  The shawarma was flavorful and spiced, and everything nice -- large portion.  The rice was a little undercooked, and thus, small grain and not tender (but I ate it all anyway), and the caprese was loaded with mozzarella and tomato.  All in all -- great.With that said, I recommend the Doner sandwich.  Made with flatbread and wrapped like a burrito, it's everything and with fries and HUGE.  I was salivating watching everyone else eat it.Recommended for a quick $10 bite."], ["Ken T.", "Good portions. Mediocre food. I liked their flexibility of ordering which allowed me to have only meat and vegetables on my plate."], ["Clo L.", "I had the salmon wrap and it was AMAZING. Wait time was about 10 minutes but well worth it. Staff was friendly too."], ["Robert A.", "It's always been good here.Getting the lamb shawarma with a side of cucumber dill salad.And I get a free soda for checking in!!!"], ["Anthony N.", "I came here a few weeks ago before heading back to LA. I was really impressed by the good yelp reviews so I thought I'd try it with my friends. To my disappointment, it was just an Ok Kebab place. The meat was a bit dry for my liking but was well seasoned. I did like the options of side dishes. Over an ok place, I'd come back to try other things but won't wait in a crazy line because I don't think it's worth it."], ["Linzy W.", "Love LOVE Love the salmon here!!! Cooked perfectly every time! I would take a picture but I ate it all before remembering to comment! Oh and the fries are perfectly crispy!"]], "Georgia's Greek Cuisine": [["P W.", "I have been coming here since 1991 and haven't had Greek cuisine better anywhere. U couldn't say what my favorites are, other than the Mezedakia combination appetizer, because everything is fantastic. They have indoor and patio dining with beer and wine, with Greek varietals. It is a great stop for a lunch or dinner date, or with coworkers. Excellent service just puts Georgia's over the top!"], ["Emilia D.", "This was probably my worst yelp experience... The live plants on the patio were nice and the service was pretty good considering there was only one server. All the employees were smiling. The opa platter was so bad my boyfriend wouldn't even let me take the leftovers for a homeless person. The gyro was the better part of the platter. The vegetables were canned and brown, green beans. The meal focus was on meat. The Greek salad was pathetic no olives or peppers. Not a made dressing. Don't even try the baklava.  I wouldn't recommend this Greek restaurant."], ["Hen A.", "weekend lunch for three...tables plenty inside and mostly empty...large outdoor patio group loud and happy...nice and tidy linen setting...basket of hot pita bread first..standard dense and thin pita...vinaigrette and creamy dressing for the salad...simple falafel pita bread wrap sandwich good..served with yogurt dressing side...combo lunches available...combination of kebab and lamb slivers served with rice and salad...finding decent and filling...grilled chicken salad probably the worst choice....simple greens, feta cheese and hard dry chicken breast....poor salad...food average...service slow, but friendly...roughly under $20 total per person meal..."], ["Ed M.", "Clean set up and friendly and quick service. Did a pick up order via phone. Soon as I got there the food was ready.  What I liked was I asked for 3 separate orders for 3 separate payments.  The cashier already had the checks ready with the amount I owed when I got there.  That is a time saver I rarely see.  The food itself was alright.  The sauces that came with my chicken kebab and the pita bread were great.  The chicken itself probably could have used a bit more of seasoning.  I am interested in trying their gyro plate next trip so we will see how that pans out."], ["Hilary S.", "Love the dishes here. The salmon here is delicious and I've ordered party trays that are great with a good variety of treats. I'll be ordering some for the holidays to take to parties."], ["Jenna C.", "Okay HOLD UP.  I have seen this place almost since the day I first moved to San Diego and I hate myself right now for not coming sooner.  For some reason I had some image in my mind of a standard cafeteria womp womp Greek place.  I don't know where this came from and I admit now that I was wrong haha.  HOWEVER.  I walk in and the first thing I notice is that to die for amazing Greek food deliciousness smell.  Heaven.  Second thing I notice is the nice atmosphere!  So clean.  And then the friendly smiles from the ladies working there! So polite and happy to help.  I ordered the gyro salad to go cause I was starving and had been away from my dog for too long and wanted to get home.  So I get home and this salad is off the chainnnn!  It's huge and smells incredible.  The gyro meat is perfection.  The lettuce and veggies in it are nice and crisp and tasty.  The dressing was so good too!  And the tzatziki!  Ahh!  I almost couldn't stop myself from eating this salad, I'm not joking.  It was so big I initially was like, Cool, I can eat this for lunch tomorrow too!  But it was a fight til the end to leave a little less than half for leftovers.  And the next day it was just as bomb!Don't make the same mistake I did and sleep on this place.  Do your Greek loving self a favor and hit up Georgia's!"], ["Mary Anne H.", "We really enjoyed ourselves at the first Greek restaurant we've been to in a couple of years.  The Saganaki was delicious, the avegdolemo soup needed more lemon and salt, but was still good, the Greek salad very fresh, but could use some bell pepper.  Service extraordinarily friendly, the wine reasonable .   The ambiance was clean, modern, warm, a bit noisy, but acceptable.  A good evening!"], ["John I.", "My Buddy Franco chose this place for our reunion dinner. We sat and drank and ate for about 5 hours. Had an absolute blast the food was amazing!!!!"], ["Anne S.", "LEMON CHICKEN ORZO! It all started here for me. They got me hooked and now I can't stay away. I also love their lamb dishes and their baklava. Can't get enough!! They have a lamb shank served over spaghetti that is just so soft, it falls off the bone. The lamb chops served with rice and veggies are soooo good and juicy.Saganaki!!! They set the cheese on fire with wine. Ohhh myyy.. it has the crisp from the burn but is so chewy and ahhh..I can't explain but it's so goood!My friends and I would always come here after night classes and they would always welcome us in even thought it was just before close. Fyi this is a family owned restaurant. The people are really nice and quick to serve you.Their kebabs are good and the gyro plates are too. Their desserts are made daily and omg..their pita bread..DELISH! It's kind of on the pricy end but they give a generous amount of yummy food."], ["Yudith H.", "Best greek food i've ever tried, the invironment is so nice, people who work there is very friendly and patience with the clients, they have affordable prices and the taste is simply delicious!!! To go to the restroom you have to go through the kitchen and everything is very clean. I love this place and absolutely Highly recommended!!!"], ["Marina H.", "Love love love Georgia's! Between the awesome customer service, the fresh patio and the delicious food, this place is definitely a go-to spot. For lunch, most of the entrees are $10-11, which is a great deal because the portions are generous and the entrees include plenty of meat. The food itself is awesome, and really has that home-cooked-with-love taste. The gyro meat has a unique flavor that really hits it out of the park and the pita bread is soft, fresh, and delicious. I had the lunch combo and combined the beef kabab and the gyros and it was superb. The beef was thick and quality and the salad was freshly made. I ended my meal with a piece of baklava, which has always been one of my favorite desserts, and Georgia's is one of the best."], ["Flavia F.", "We went to lunch today at the Georgia's Greek Cuisine.  We order the calamari that as perfect fried and cooked.  The pita bread was warm and fresh - delicious. The Gyro plate was my favorite. The beef was tender; I loved the salad with a kind of feta cheese and a homemade dressing hummmmm  We also tried the Baklava. It was very crunchy and with a lot of cinnamon and honey. The perfect dessert after a delicious lunch."], ["Mercy B.", "Food is good here. It's been a few years since I ate here, and I had a craving for a gyro the other day and came back in. I took a seat and could not believe how uncomfortable it was. Granted, I'm a plus size woman, but these seats were ridic. Both my cheeks were hanging over on both sides, making it very uncomfortable to sit for long. I want to say it's probably a family owned and run place, as it seems someone's grandma came to wait on me. No smile, no welcome....expect no tip, or at least a very reduced one. My gyro was very good, but I chose not to stay long, as I was uncomfy, grandma did not come back once to see if I needed anything or to ask if  my meal was ok. I will not be back to enjoy eating in. Might take it to go but that's about it. What a shame. How does a place like this survive with uncomfortable seating and no customer service??"], ["Robert Z.", "This is my go to place for Greek Cuisine when I am in San Diego. As a Greek American I can tell you the food is authentic, well prepared and reasonably priced. The dining area and kitchen are very clean and the service is very attentive but not overbearing. I wish I had Georgia's near me in Boston. I would be a regular."], ["Kevin F.", "My wife and I are HUGE fans of Georgias!  It seems to be quiet during the week, but the food is always excellent!Start with the Hummus appetizer. Great flavor, and the pita bread is always fresh. We have not had anything here we do not like. Gyro meat has great flavor, and for you vegetarians, the falafel tastes amazing as well! They come out in little medallions. Overall, service and ambiance is great for a romantic night out."], ["Demetria Z.", "My first time at this restaurant... enjoyed the ambiance, the energy, smells and authenticity down to the sign in the restroom (don't flush the toilet paper) ;-)Living in Greece for a few years, this is the only Greek restaurant I have come across on this side of the pond that remotely comes close to the authentic flavors I grew accustomed to.  Our dinner party of ten sampled most everything from the menu, excellent service, delicious food - highly recommend.  Back patio is lovely for larger groups.Brilliant experience, I highly recommend."], ["Summer S.", "My experience prior to visiting this restaurant was a Greek salad, so I was in for an education.  I would totally change my major if my server was teaching.  He anticipated my questions, brought me samples, made good natured jokes and flirted shamelessly, and I loved every second.  I tried so many different flavors that were totally new to my palate, stayed too long, and spent more money than I had budgeted.  I left feeling a bit more worldly and dragged all my friends there the following week."], ["Daniel K.", "So many types of olives!! I had only ever tried the standard dull green or black ones, this restaurant had an olive and cheese bar, staffed by a knowledgeable server.  I may have over-indulged, but so amazing!  As I grew bolder with my choices, the server made suggestions on complimentary adult beverages, and a new found appreciation for olives is born . As I was setting up my bill, the server recommended an upcoming event that he thought that I may enjoy.  I love that little personal touch."], ["Sarah V.", "First time here the bread is great service is prompt and their food is amazing.I will be back"], ["Peter K.", "Sat on the patio. Fairly pleasant. Good gyro salad and friendly service. Really great salad and fresh vegetables.  If it had AC inside would have been five stars. String greek music in the background and clean bathroom"]], "Taste of Athens": [["Josh L.", "Still a great place to eat real food! The steak fries are really good with spicy green greek sauce!"], ["Joseph P.", "Best Greek food I've tasted. Nice hidden mom and pop shop. I go here most of the time for my dinner break when I work at the hospital next door. Razor, the owner, is an extremely nice man. His wife and daughter are the cooks and they do a marvelous job. Pros:- Fast service- Authentic Greek food Cons:- The interior needs some work, looks like a hole in the wall type of establishment.- Parking is hard to find because it shares the lot with many other establishments. Grade:4 stars!"], ["Jon S.", "This is a hole in the wall establishment with several tables and no table service. You pay at the counter and can eat inside or take it to go. I was surprised when I arrived at 12 to see a very long line but I waited anyway figuring it would be worth it. There was one girl taking orders and delivering food and two women preparing the food in the kitchen. I ordered and my time stamp on the receipt was 1211. I got the gyros sandwich with fries and drink. 30 minutes later, the two boys in front of me that ordered entire plates for lunch had eaten their food and left and my previously cold soda was now barely cool. The girl working the counter could not remember who ordered what and kept approaching tables and asking if they ordered what she had in her hands. They gave no system of names or numbers to prevent this. After I had been approached three times, having told her each time what I HAD ordered, I got back in line for another 5 minutes and explained my order had been taken 30 mins prior (no exaggeration) and the guys in front of me had eaten and left. She again asked what I ordered. I again reminded her. She then proceeded, as she had several other times previously, to speak with the kitchen staff and asking that they please make my food. And ten minutes later I received my food. 45 minutes after my order to go I'm driving home with it. I hope it's good. Must be for how busy they are. The parking is shared by numerous other businesses in the little shopping center. However, many of these businesses also serve food at lunch. Large businesses are nearby including Kaiser Hospital. I would strongly suggest that you call in your order and plan ahead leaving plenty of time to pick up your food and get back to work.Needless to say, my experience today was less than satisfactory. I will likely return once more to give this establishment another opportunity to provide better customer service. The girl at the counter had explained to at least one customer that the owner is currently recovering from surgery. I would imagine that the owner provides better customer service.Two stars for what I hope will be decent food instead of the one star the lackluster service deserves."], ["Ryan F.", "I was actually hoping to have lunch at the Purple Mint a couple doors down, but they were closed so I had to find somewhere else. I still wanted something healthy, and so I figured I could come here and at least get a Greek salad.People aren't lying about the quality of food here, my only slight disappointment was my chicken being a little dry. Other thanks that, the salad was well-portioned and very fresh. It came with some freshly toasted pita bread and two kinds of tzatziki, both really good. I'll definitely be coming back to try more! It's even a healthy option, as long as you stay away from the fries and don't over do it with the pita bread."], ["Nancy T.", "My first time here today and I the food was cheap. But the service was ehhh!!! Maybe they were under staffed. Went during lunch hour and our order came out wrong and other people were served before us. But since it's cheap and the food is great I would go back. $8 for a chicken plate. That's great. McDonalds meal is about 8 bucks nowadays."], ["Carling B.", "I read reviews before I came and pretty much everyone I read said it was amazing. I got the gyro sandwich. Delicious! The steak fries were very good. I got hummus on the side and I really liked it. I've never had hummus like this before. I would definitely come back."], ["Shawnda N.", "I love the greek salad with chicken. Fresh and tasty. Great customer service as well. They are always quick when I need to go grab it on my lunch break. 4 stars because food a little on the oily side."], ["Larry M.", "I really want to give this place 5 stars but closing at 7pm is just so dumb! Sometimes I can't even get home from work before they close because of traffic.However, the food here is so good. It's become my favorite Greek food spot. It's a small restaurant with 7 small tables. I wouldn't recommend coming with more than 4 persons. There really isn't room to put tables together. The decor is simple and basic but you're not here for the scenery. You've come for the food. And let me be the one to tell you, you will not be disappointed. Ask for the spicy tzatziki, yum!! I usually go for the gyro plate. But I've tried everything on the menu and have always been please. Do yourself a favor and get the hummus plate. For real, you will enjoy."], ["Adria D.", "More of a 3 and a half star for the gyro. The meat was moist and juicy but it was mediocre on flavor. It wasn't bad but it wasn't spectacular. The tomatoes and pita were nice and fresh which I like, however they don't come with onions on them. All gyros have onions. I'm not used to getting lettuce on it either so that's a different twist which I was not a fan of because it became soggy from the heat of the Gyro and I had to pick it out. When I asked the cashier for onions he said they \"don't put onions on them because most people have to go back to work\" and it was lunch time. It was 2:30 so lunch for most 'workers' was already over. I don't know if he even realized that was a backhanded compliment or how stupid he sounded  but maybe I was on lunch break from work and I don't care if I have onion breath? How about ask your customers if they want onions and don't assume??Anyhow I blew that off he did give me a nice glass of ice water with lime in it after putting his dirty hands all over my ice cubes.I still think Alexis in Hillcrest is way better."], ["Sue B.", "I want to say up front that this place deserves a huge nod because of the personal touch.  The owner is kindly and presents his food to you with pride.  We weren't sure what to expect even with the rave reviews when we faced such a non-descript storefront and interior in a strip mall.  It was also empty at lunch time on a Wednesday which was even less auspicious.  We ordered a gyro sandwich with fries and a chicken plate to go.  The steak fries are ok:  thick and mostly potato with a decent amount of pepper and salt coating the fried skins.  My gyro was a warmed pita with lettuce, tomato and gyro patties too uniform to have been cut from rotisserie.  Mom said her chicken and salad were satisfactory and the tzaziki sauce is good, but nothing that stands out from the kind you make at home with Greek yogurt, cucumber, mint and garlic.  Word of warning:  the Greek vivid green ketchup obviously laced with some sort of pepper is VERY spicy.  I am not a hot food fan and I had to toss it, but there will be some very happy ghost pepper poppers out there who would never commit such a felony.   All in all, satisfying Greek cuisine but there are other tasty options nearby, too."], ["Marc P.", "I had the Greek Salad with chicken, and I was very happy.    It was quite tasty, filling, and I loved the spicy green dipping sauce they served with it.   I've only been here once, but if you are looking for a very casual atmosphere but with great Greek food, I'd definitely recommend it."], ["Amanda P.", "This hidden gem is a must-try! The only reason I haven't tried this place yet is because they appear to close early and I've never been able to catch them open. I sure am glad I thought of them for lunch though! The service was fast! I chose to dine in and the food came pretty quickly. I really like that they had real plates and cutlery to use. The hummus plate appetizer was fantastic and had a choice of spicy or regular Tazki. The hummus was something to brag about. It was some of the best hummus I've had! The plate also featured sliced veggies which was a nice touch. I also ordered the chicken Greek salad. The chicken was beyond what I expected! It was juicy, tender and grilled to perfection! Way to go! The salad was nicely tossed and the dressing was great as well. The dressing may have been a little on the heavy side, but that's the only thing I might critique them negatively on. If you're in the area- you have to try this place!!"], ["Caligirl P.", "Family owned serving fantastic greek food with great service and charming atmosphere, casual and comfortable."], ["Yelena C.", "Small place with good food! The service was really fast and friendly, and my chicken plate was huge and delicious! Great for a quick lunch."], ["Daniel K.", "Food qualityVery good. I literally tried everything from their menu within 2 months.ServiceI believe the guy infront is the owner. Hes very friendly and even remembers his regular customers. He will always greet you and even offer you a refill for the ice tea.PriceVery cheap and great for people like me who dont cook at home lol."], ["Michael D.", "$8 plates and $6 gyros make this place a steal of a deal.  The plating is also on point.  With a gyro plate, it comes with pita bread, tzatziki, the meat and a side salad.  This is a great place for lunch.  Looks like you are getting a take out style meal, but when it comes they serve it with a lot of detail.  I will be coming back!"], ["Nikki G.", "We got the white meat chicken plate with rice, greek salad and pita bread and the chicken kebab sandwich with fries as well as a hummus appetizer. All of the food was so delicious the Greek ketchup as the owner called it was very yummy and a little spicy made the steak fries even more incredible! The hummus was excellent too and it came with some fresh veggies in Greek dressing such an awesome touch. I love the mom and pop feel and the fact that it's the best Greek food we have had in the San Diego area means we will DEFINITELY be coming back."], ["Miranda P.", "The woman saw me walking up at 6:41 when their hours say they close at 7:00. She locked the door and walked away and when I got to the door to see if she really just locked it on me the guy inside at the register just shrugged his shoulders. Can't comment on the food since I didn't get to eat it, but horrible customer service"], ["Aurora D.", "I love this place! It's the perfect lunch spot! The food is so fresh,crisp,and delicious. They serve a good amount of food, enough to fill you up and give you that satisfying feeling. Good pricing on every order... no more than $10 for any dish.The service is friendly, personal and prompt. The owner Sebastian, is always the one ringing up the orders and if you go there more than once, he'll be sure to remember you."], ["Jeff S.", "Disappointing. Gyro meat is that processed pre packaged crap. Real Greek places don't use that meat. On the upside the fries were good.UpdateTheir hummus was pretty good and chicken plate was decent."]], "Vanoos Grillette": [["Fatsha S.", "This is a hidden gem, great service and a smile and the flavor are perfect.  Give it a try."], ["Matt R.", "I know that I'm giving this place 3 stars and, yes, I'm surprised too. Given the rating here on Yelp I figured I'd be more into it. The first problem we had is that the people behind the counter didn't seem all that interested in taking our order. They glanced at us briefly and didn't say much after that. They eventually came to take our order, but they didn't seem to be in that happy of mood.The other problem was that there was no water in the dispenser and they seemed almost bothered when we asked if we could have some. 10 minutes later they added about 32 oz of water to the container and went back behind the counter. The water ran out again soon after that.Finally, the food was good. Great? Not in my opinion. We had the falafel sandwich and Greek wrap (as suggested by Yelp). The Greek wrap was average and though the the falafel was definitely better, it didn't blow me away by any means.Between the poor service and the average food I can't recommend Vanoos Grillette."], ["Dwayne D.", "Wow. Here visiting from Vegas, baby, and hit this place for lunch Thursday and again today.  Food is so good.  The Tex Mex salad will feed a family.  Flavors so deep. Today two gyros, a roast beef sandwich on a baguette and a grilled chicken feta black olive wrap. Awesome.  We spent less than we did at Chik Fil A and had authentic home made hole in the wall I own this place food.   So darn good!"], ["Fatemeh B.", "Every thing is fresh, nice and delicious and the couple who work there are very friendly and nice. The environment is not as nice as their service and their food and the foods are a little bit expensive."], ["Amber B.", "Amazing.  Sandwiches have loads of meat and cheeses.  Definitely eating here again.  I over ordered and have leftovers for two meals.  Salad is awesome. Friendly service."], ["Omar A.", "Small Mediterranean sub shop owned by Arab Israeli husband and wife, and maybe their daughter, since they named their restaurant after her. I came here during a Mogl promotion that basically made eating here free.My favorite thing to eat at Middle Eastern restaurants is Gyro, even though it is of Greek, not Middle Eastern origin, and in fact, most people in the Middle East have no idea what a gyro is.Vanoos makes a good gyro. The meat is a mix of beef and lamb. I personally prefer straight up lamb, but it's still pretty good. The pita is delicious and fresh. They use a much thicker tzatziki sauce than most places -- it has the consistency of sour cream, and I suspect they make it with labneh. Very good so far.They also add way too much lettuce and tomatoes -- so much that I could barely taste the gyro the first time, and I had to ask them to hold the lettuce and tomatoes the next time I got it. They tend to pile a lot of lettuce on most of their sandwiches, which is a little strange.The quality of the sandwich is slightly inconsistent. Some days, it's better than others. At it's best, the food was good, but not amazing.Their french fries are delicious, but be warned, they are not crispy. I prefer \"tender\" french fries and that is how they serve them. They season the fries with a delicious mix of salt, pepper, and other spices.The service is very friendly.I'd come back if I was in the area, but it's not somewhere I'd go out of my way to patronize."], ["Francis F.", "Great deli and great service.  I like to order the Italian sub- I can usually have it for lunch twice since its a pretty good size.  When I feel like sharing my gf and I order the greek wrap and split it, it's also a good size but i have definitely eaten the whole thing on my own before.  We have been going to Vanoos on the regular for a couple of years now and highly recommend it.  Tip: If you are driving down mission its a bright purple building across from cold stone, you cant miss it."], ["Kelly O.", "I got the namesake \"Vanoos Grillette\" wrap and taste-wise, it was amazing. So much flavor, so delicious!! It had grilled chicken, corn, cole slaw, Russian Dressing and more. It was also ENORMOUS, like the biggest wrap I've ever seen. But it was so tasty that I almost ate the whole thing!My eating partner had a pita filled with shwarma or gyro meat (don't remember) and it had a delicious cinnamon flavor. Also--very large!My only negative was that the ingredients of both sandwiches were absolutely saturated with sauce. It was dripping out of the pita. I mean, YES, it was delicious, but I felt gross about myself as I ate it because I'm sure it was one of the unhealthiest things ever. If I ever went back, I would ask for the dressing/sauce on the side or just less of it on the sandwich.The eatery is small, unassuming, and homey; you're probably better off doing takeout."], ["Brendan C.", "I chose Vanoos Grillette on a sub. If you're going for lunch you won't need to eat dinner. This is a mega Sandwich, very tasty!  Hot Sandwich greek gyro also very good. Themoreyouknow: \"Vanoos\" is short for Vanessa and the name of the owner's daughter.Pleasant Service. If it's busy, order online!"], ["Nicole N.", "Went here looking for a small and quick bite to eat and split a falafel sandwich with a friend. We fell in love at first bite!! Seriously best falafel and freshest pita we have ever eaten; the cabbage soaked in their house made tahini dressing made my life! This was so good we came back for another 2 hours later!! I am moving to Pacific Beach next month and am definitely becoming a regular here!! Also this is a very small family run restaurant which makes it more unique. The woman working was very sweet! I would highly recommend it to anyone who wants an amazing and authentic pita sandwich!"], ["Jennifer A.", "Incredible amazing most delicious EVER! I got the Mediterranean wrap and ate half. It was so good. Will be making this a weekly stop!"], ["Lori M.", "Delicious! I love Mediterranean food, and this place is fabulous.  A real treat for the taste-buds. We had dinner (lamb shwarma, gyro, dolmas, and tabuleh), and returned the next day to pick up mezze dishes for a family gathering.  People swooned.  I may need to return to San Diego for the baba ghanouj, alone. This family run business is wonderful."], ["Lori K.", "Ahhh..maaaze..ing!  Love this place... Its probably a good thing I don't live too close because I would eat here every day and probably end up playing hundreds of pounds!  My favorites: hummus & cucumbers, vanoose  Grillette chic wrap and the falafel...so awesome...spices like I've never tasted before. The owners are always there...quality is the best!  Thank you..."], ["Heather H.", "Soooooooo good! My bf and I are staying at a hotel nearby and they do free delivery. We ordered the Greek gyro sandwich, so good. It weighed like four lbs. There was a lot of shredded lettuce on it, but I just slid half of it off. It tasted really fresh. Only took 20 minutes to get it to us! We also had the chicken tenders with honey mustard, also delicious! I'll be back :)"], ["Skip S.", "Quality ingredients with great tasting results. Had a Greek Salad and could barely finish it there was so much. Yum. Will definitely be back."], ["Deborah P.", "I did not expect to get such great Middle Eastern food in San Diego! The hummus was one of the best I've had - subtle, earthy, with a deep roasted tahini flavor. The baba was good as well - the pita that comes with it is a notch above. The falafel is quite good, make sure you get it with the red cabbage. The lebne with zaatar is as good as the stuff in Israel - ask for an extra pita. The best sandwich is the kebab with tabouli and hummus. I normally don't like big combos but this was fantastic. The gyro meat was also a notch above the average gyro place and the cucumber sauce was excellent. I wasn't crazy about the cut of beef used for the shwarma but I liked the spices, next time I'll get the chicken shwarma.The staff are super helpful and nice."], ["Sal A.", "OMG! Absolutely delicious my favorite spt in PB (maybe San Diego) great family own. My favorite is:1)  homemade roast beef 2) chicken cutlets 3) lamb shawarma 4) Reuben Definitely give this spot of try Worth it your money"], ["Elle-jayne H.", "This place is all about quality ingredients- fresh bread, amazing meats, and all of the sauces and seasonings made in house. If you have never been here before and are a meat lover, I highly recommend you try the Garnet special. It's got a very generous serving of thinly sliced, medium rare roast beef, bacon, and coleslaw. The shawarma is also a good one to try and comes in pita bread (the pita bread is really good here, especially with the hummus!) The salads are also good but don't order one if you're after something light, they are huge (could probably share between two people) and pretty hearty with lots of meat. I have been coming here for a couple of years and never had a bad experience, the couple who run the place take serious pride in their food!"], ["Lainey S.", "Great wraps!Stopped in the past weekend and glad I got to knock this off this list of places to try. I ordered the kebob wrap and the fiancé ordered the greek chicken wrap. While his wrap was good, my definitely crushed his.The sauce on the wrap was perfect! So tangy and yummy :) For two wraps and a bottle of water, our total bill came out to about $22. Not bad considering the wraps are huge! I only ate half and saved the other half later- made a perfect snack!I can't wait to come back and try their sandwhiches. Fast, friendly service and excellent food!Yay Vanoos!"], ["Tyra W.", "Seriously the best!!!! I drive from east county as often as I can. Little family owned shop. They are amazing and the food is incredible. Only the second review I've ever written. I always get the Schwarma but everything is fresh and delicious!! Thank you Hadin!!"]], "Athens Market Taverna": [["Dan H.", "This is probably the first Greek restaurant I visited when I moved to California in the late 70's. At that time it was more of a market (hence its name) than the semi-fancy digs it now calls home however. And is still one of my all time favorite Greek restos, especially since my life long favorite, Hella's, closed a few years ago in Detroit.It's more of an upscale place now with prices also a bit higher than at your typical Greek resto, but in this area it is in line with everyone else. Plus the food here is definitely worth a few more bucks with everything cooked with top quality ingredients. Service is usually a bit more formal too. I have tried many items over the years and have never been disappointed in any of them. Their avgolemeno soup is the benchmark from where I judge all others. Perfect consistency, and the proper amount of lemony tartness. OPA indeed!I often start with their off the charts Grilled Baby Octopus, but we arrived fresh off of AMTRAK from OC in a very starved state. The waiter gave us fair warning that it would take 15 minutes or so to prepare. Thanks man, plan B it shall B then. We opted for the quickest choice: olive and feta cheese plate. Pretty self explanatory, except that feta was fresh as a daisy. Also ordered a delish Greek salad, also very fresh and refreshing.M'lady had never tried moussaka, and wanted to give it a go. From their menu: \"Eggplant & Ground Sirloin Casserole. Baked layers of grilled eggplant, zucchini, and ground sirloin topped with béchamel.\"  Selfishly I tried to steer her on to something else as we agreed to split an entre. I have always thought  moussaka to be cloyingly rich and too \"milky\" for my taste. This was not. That is why I copied the above from their menu. I have a feeling many other versions I have had did not use ground sirloin, but a lesser ground beef of some inferior sort. Others I have had over used the béchamel sauce, adding to the too milky richness that was imparted. Major problem. She will now want to order this in our future Greek resto visits, but I am sure she will be let down after this one. Thank dog we now have Georges in HB so I don't have to look forward to my now infrequent visits to San Diego for great Greek. Hmm, will have to give Geo's moussaka a try next time I have the lady in tow. Dimitri? You game for a little comparison game?"], ["Chris H.", "This place has been here forever, and for good reason. The food is fantastic. The people are really friendly. It's a nice place to be. Not too fancy, but classy. Quiet."], ["Corina P.", "Solid greek food in a nice dining environment.  I've been here several times as I work nearby.  I typically have the gyro and have also had salmon and a salad.  The gyro is my favorite; the meat is soft and thin, and the bread is usually really warm and soft.  The service can be hit or miss; sometimes really attentive, other times not so much.  They get busy during lunchtime so that's a consideration to factor in."], ["Danielle N.", "I love this little gem! I come here for lunch because it's close but would love to try it for dinner. They're reasonably priced ($9-12 for lunch) for large portions. Its very clean and the staff is always friendly and attentive. I usually get the vegetarian special because their lentil soup is amazing and the spanakopita filling is so creamy and the Greek salad is so fresh and light! The sausage pita sandwich and the meatball sub are also extremely tasty! I would love to see this place have more business :) they're a little hidden being just outside of the Horton Plaza and Gaslamp area but well worth the walk."], ["David W.", "One day we felt like Greek while downtown but didn't want to walk over to the Seaport Village spot; so we tried Athen's Market 2 blocks away from home.Looking in you think it may be a bit pricey by the wonderfully set tables and ambience (not to mention primary lawyer clients); BUT the value offered here will pleasantly surprise.We ordered a Horiatiki Salata (village Greek Salad) , the 3-dip eggplant & pita plate and a nice house white wine.  With tip all under $45.  Considering the historic hotel Senator bar setting and EXCELLENT service this a place I'll come back too....to enjoy a game and sandwhich  at the bar will be great...."], ["Nxt P.", "Had an amazing lentil soup.  Unfortunately, that was the only dish that was good.  We didn't care for the mushy and bland vegetarian Moussaka and found the spanakopita  also very mushy.  Service was very attentive, but we won't go back (unless its just for a bowl of soup)"], ["Jeff F.", "Exceptional service from an exceptional family owned restaurant. I wish I had more hands because I would give it 4 thumbs up!Great food and great service!"], ["Terrance W.", "Always friendly service and the food rocks ! I hesitate to reveal my fave so that it does not get sold out when I need it, but here goes...The Lamb Shank is a very tasty, tender marinated experience. There is one other place that I will not name in Gaslamp with Lamb Shank on their menu. It's OK but you can tell they skipped a step or two. Athens Market Taverna is the place to go."], ["Lacy D.", "Athens Market is great! Traditional, delicious Greek cuisine. They participate in Restaurant Week, so you should absolutely go during that week! I've had the Spanakopita and Dolmathes for appetizers, Greek Salad and Prawns Metaxa, and for dessert Baklava and rice pudding--not all at one time, though I really wouldn't be opposed to inhaling all of their delicious food at once. Mary Pappas, the owner, is a sweet Greek woman and you'll probably see her at the restaurant running around. She hosted a lovely Holiday Party last night complete with a buffet spread, dessert, and drinks. It was a wonderful time, the food was really phenomenal, and I'm encouraging everyone to go check this place out!"], ["Heather M.", "My girlfriend and I found this place by reading all the reviews-it is our fav little gem in SD! Mary the owner hugs us and fills our wine glass with great red Greek wine each time we come. Really we feel like we're in Greece! We always get the octopus that is grilled to crunchy tender perfection w/ garlic, lemon wedges, tomatoes and the best olive oil! The servers are great-music is always perfect-we either sit at the bar or outside. It's amazing and hands down the best Greek restaurant in downtown SD!!"], ["Charles T.", "Excellent food and atmosphere on a rainy night in San Diego.  Started with saganaki flaming cheese appetizer that was super delicious.  Had lamb shank main course.  Excellent flavor and tenderness, and the spaghettini it was served on was al dente perfection!  I highly recommend."], ["Karen H.", "Great food, lovely service. A welcome respite from the craziness of Comic-con. Big thumbs up!"], ["Jerm J.", "Honestly one of my favorite greek places anywhere. It's not a gyro/kabob shop... it's an actually sit down dining experience. The food is great, they have an awesome menu that has just enough but not too much.The lamb shank with pasta is amazing, but i have an affinity for lamb.They are also very friendly and actually treat you as a guest"], ["Kathreen L.", "I was recently thrown a bridal shower here, and the entire experience was absolutely wonderful!As a Greek myself, I can be critical of Greek food, but let me tell you everything I had was WONDERFUL! From the spanakopita to my (perfectly cooked, no joke) salmon, I was blown away by the wonderful food.The place has been recently renovated, and the new space is beautiful. There are pretty chandeliers and the decor is great and created a lovely atmosphere. From what I hear (since I didn't do any planning), they were very easy to work with as far as booking the restaurant for the event was concerned, and on my end all I can say is they were extremely accommodating and everything went off without a hitch!I highly recommend them, both for booking any mid-size events and for their wonderful food in general. Get the salmon and some spanakopita!!!"], ["Kristin B.", "Just terrible.  Took a chance, and it didn't pay off.My boyfriend and I decided to head here for early dinner last Friday because (A) we were trying to get some more mileage out of our 2009-2010 Entertainment coupon book before the restaurant coupons expire and (B) Athens Market Taverna opens for early dinner at 4PM.When we arrived a couple other dinner tables were occupied, and there was a jovial Happy Hour crowd at the bar.  Though there are some beautiful pieces of furniture in this huge restaurant, \"dingy\" is a word I'd use to describe the overall appearance and décor.  The burgundy carpet--filthy.  Soiled and heavily speckled with God-knows-what just 45 minutes after opening.  We were invited to choose our table.  My butt had barely touched the chair and I was still holding my handbag when the waitress was back handing us menus and asking for drink orders.  The traditional Greek entrées on the menu didn't appeal to me, so when our waitress returned again I asked what sides come with the salmon entrée.  Her response of rice, potatoes, and green beans sounded miserably boring to me, so we asked for more time.Into huddle mode we went:  \"Dinner menu sucks.  What should we do?\"  We decided to stay, but we'd waste our free entrée coupon and have a few small dishes instead.  We ordered the 3 Dip Combo ($7.50; sadziki, hummus, and eggplant) and were told that the house was out off eggplant.  (Out of eggplant at a Greek restaurant at 5PM, really?)  Our waitress eventually offered to substitute 2 pieces of spanakopita.  We also ordered baklava.The waitress understandably had a tough time carrying the dip combo to our table in its totally inappropriate vessel, leaving a path of crumbled feta behind her.  It was even more awkward when she put the inexplicably massive serving spoons in the dips, causing them to ooze over the edges of the side-less little platter.  The dip plate was pitifully presented with a few wrinkly overripe veggies that I'm confident were put there as little dams to attempt to keep the dips on the plate.  All components were mediocre at best, and the hummus was thin and watery.Wow, I was glad we had decided not to venture into entrée land being that our experience with the simple dips wasn't a good one.The $4.50 tiny piece of baklava solidified this 1-star review.  It was obnoxiously fussy, served on a plate big enough to be a dinner plate and molested with unappetizing clear syrup and not enough honey.We'll hit up Greek Islands Café in Seaport Village for the best baklava I've had outside Greece, and we'll continue to visit Café Athena in Pacific Beach for consistent 5-star Greek food.  For us, Athens Market Taverna was unfortunately a big mistake."], ["Jay H.", "Wonderful owner and tasty food. Love the background music, friendliness & warmth. Oh yeh, the food is excellent too !  Decent wine menu but excellent value overall."], ["Anne-Marie M.", "I have lived in the San Diego area for 4 years and in those 4 years have not found a Greek restaurant I would consider going back to, until now.  This is the best Greek restaurant, by far, I have encountered in San Diego.  The service is impeccable.  The food is delicious.  Try the lentil bean soup and gyro sandwich for a perfect lunch.  I will be back!"], ["Paola R.", "I loveeee the food here... not too many places in San Diego where you can get excellent Greek food. For appetizers, I love their feta cheese plate and their baby octopus. As for entrees, I've had their gyros and their salmon plate. The salmon used to be on the menu but isn't anymore, but I still ask for it and they still make it for me. Both the gyros and salmon are delicious, especially the salmon. And for soup, I really like their lentil soup. The service is wonderful. They're very prompt and friendly."], ["Kim R.", "This place had really great food! I had a gyros plate and my boyfriend had filet mignon medallions, they were both delicious with generous proportions. The staff was so incredibly nice. When my waitress bagged up my food she gave me extra tzatziki and extra pita to take home, a definite plus since most places charge for extra pita bread. My food even tasted great the next day for lunch. The only downside is that it was a bit pricey. I have a couple other favorite Greek spots in La Jolla and PB and this one is more expensive than the others. Delicious and convenient for being right around the corner from my house though. Good atmosphere, food and service. Be on the look out for the golden shoe in a place of honor behind the bar!"], ["Kris Z.", "Athens Market is amazing. Very classy, great service, good atmosphere. Thank you for a great time."]], "Meze": [["Elliott P.", "Brunch review:We grabbed the endless mimosas and our server kept the carafe filled the entire meal! Very Nice. Very attentive staff.We didn't drive home immediately after and opted for ice cream first.Filet Mignon benedict was slightly tough but very good.Filet Mignon chilaquiles (?) was small, but very good."], ["Sonia S.", "I really enjoyed this place!! They have a chic, laid back environment and had a nice large table in the back ready for big groups, and were able to accommodate and serve us quite well.  If you go here, just beware that it is definitely a little on the nicer side, therefore their prices are a little steep, but it's well worth the ambiance and quality.  They have small plates (/supposed to be more like appetizers) and large plate though, so if you're not wanting to spend as much you can always just get a small plate, but some of them are like really small (I remember several people ordered the mini order of souvlaki and it really is quite mini!).  I got the Greek tacos, one with falafel and one with gyro meat and they were delicious.  Everyone else's stuff looked really good as well, and people seemed to enjoy it.  Also, their cocktails are strong!  I got the pomegranate margaritas and was feeling pretty nice by the end of dinner :)"], ["L L.", "First time for me and my wife at Meze. We both are Greek food fans. Love this place. Food was fast and delicious. Saganaki and the lamb souvlaki  when broke da mouth!!!! Definitely what made the experience even better was our server Andrew. From the moment we entered to when we left he was helpful and attentive. He even constantly returned to ensure our water glasses were never more than half empty...and always came by with a smile and a little joke. Service was excellent!!!! Would definitely come back."], ["Augusto R.", "It was so good and the waiter was so cool we felt compelled to come back... We got another waiter even better than the first one and the food tasted even better!!!This is a place we all in my family HIGHLY recommend !!!"], ["Stephanie W.", "Great Greek wines with expert recommendations from the sommelier Chris. As a bonus, Chris is an amazing table side magician too!We enjoyed the flambé Kasseri cheese as an appetizer... This is our favorite! I also loved the gyro dinner entree. We love the new location, too!"], ["Yelena G.", "Came here during 4th of July and had such a pleasant time. It's a great place to come with a date or even a big group. They have a very nice lounge sitting area with great atmosphere and good servers. I ordered the Octapodi Skaras which was grilled to perfection and the lemon gave it a nice touch. I also got the Greek Quesadilla and added chicken to it, it was the best Greek style quesadilla I've tried. If you are a feta cheese fan like I am you would love it. They have a huge variety of unique hookah flavors and I would highly suggest getting one with a wine base.Best part of the night was when the belly dancer came out. Also love the fact that they were playing Greek music, really reminded me of back home. Wish they had a location here in LA but will for sure be visiting again next time I'm in San Diego."], ["Dimple B.", "So, so glad I discovered this place. On a Sunday, after driving around Gaslamp for almost 20 minutes just to find parking, a girlfriend and I noticed Meze near where we ended up, and, both being famished and huge fans of Greek food we decided to check it out. It gives off a very relaxed but upscale vibe.  The doors are completely open so you can see the menu posted outside, and two floors and a giant bar before you go in.We got there a half an hour before brunch (and their bottomless mimosas for $12) ended, and our waiter Kevin, who was awesome assured us that we didn't have to worry about the end time. My friend is Greek, and so when we go to places like this she takes the lead on ordering, which is absolutely fine because she picks well - like the garlicky, VERY garlicky mashed potatoes to start with. They were served with bread - thinner than pita, it seemed, so I am not sure what kind of bread, but no complaints with that.Between the mimosa-ing and appetizer I didn't want to get too full so I got the appetizer portion Souvlakia, which came looking like it was smothered in buffalo sauce (see picture), but definitely was not. I hadn't had that type of sauce on chicken souvlaki before, but whatever it was was delicious! My friend got a gyro wrap which was very hearty in portion size and came with a heap of meze fries (fries made topped with feta and I think basil). Everything was just delicious. Kevin was very generous with our pours, coming by constantly to refill and to check on us. Also, someone who must have been the owner stopped by to tell us more about the grand opening event, and he was very friendly and kind thanking us for our patronage. The only weird thing we noticed - which hardly warrants taking off a star - is that they play really sad pop music. Haha. Maybe it was just that particular day, but when I'm hanging out having brunch with friends, I don't really want the saddest Coldplay songs ever being blasted around us. Otherwise, the atmosphere of Meze is nice and fun. There are three floors, plenty of seating, pretty lights and decor, and it looks like they have an extensive hookah menu, too, which people can do outside while eating. I am glad I've found a new brunch spot with bottomless mimosas and countless tasty offerings on the menu. Can't wait to come back!"], ["Michael C.", "Think creative Greek tapas. Beautiful room, delicious food, staff that enjoy being here, reasonable prices. Go!"], ["Ada J.", "Greek fusion? I'll try it, and I am glad I did! It was so tasty. Ordered the Greek tacos,  steak and chicken, also ordered some jalapeño cilantro hummus, meatballs , and finally some Mac and cheese. The hummus was so good! I had no idea it could taste so good. My favorite though we're the meatballs. It had a red pepper sauce that just complimented the dish so well.  The Greek tacos were good but not great. I did like the chicken more than the steak. The only setback I had was the beer I ordered, it was flat. Oh well. Also, I saw this place has a killer happy hour.  I'd definitely come back."], ["Detroit R.", "What an amazing surprise. I walked in this resturant with no expectations and was WOWED :)The music along with the ambience was very inviting. From the moment we walked in, we were treated with a high level of professionalism by Andrew. He was very pleasant, kind and attentive. I ordered a Greek salad with minus olives and two tacos (one chicken and one gyro). First off, my salad was served with with olives. Without hesitation, Andrew snatched my salad and brought me a fresh salad one within minutes. He's definitely is a perfectionist and pays close attention to detail. We also ordered the shrimp and Ouzo fettuccini. That about a delicious dish??? OMGGGGGGG!!!! You need to try this....like, right now!!! We ended our meal with loukoumades. No half stepping here folks...another winner! What are you waiting for?? Stop in, try this place and ask for our friend Andrew. Money very well spent."], ["Andria S.", "Food was good, but the prices were a bit high.  I understand that it's downtown, but $16 for a lunch wrap mid-week was a bit much to swallow."], ["Tonya H.", "While visiting San Diego, hit this place up for dinner before a night out in the town! Lol. My friend and I opted to share a few of their small plates including grilled shrimp, Meze fries, feta mac-n-cheese, and their take on the cares salad....which you guessed it included Feta! The food was indulgent but wonderful! They even had a belly dancer! Lol!!!! Good place to go and start your evening."], ["Honee R.", "What can I say... Meze has great food and excellent service. Andrew was so very attentive and personable. Once he finished describing the shrimp and ouzo fettuccine dish I knew I had to have it. Let me tell you, it did not disappoint. This was a great experience. I'll definitely be back.....TOMORROW :)"], ["Theodore T.", "Wonderful place to get a sampling of everything greek.  If you are looking for traditional greek food, this may not be the place for you.  But if you are looking for exciting, original dishes inspired by greek classics you are in for a treat.Meze is basically a greek version of tapas; smaller, appetizer size plates.  You can get two or three things each and share, to really get a taste of everything.  They do have traditional entree size plates with rice and veg if thats more your thing, but I encourage you to try the mezes, especially if it is your first time.Their signature dish is called saganaki (if I remember correct). Its a kasseri cheese flambed tableside in brandy with lemon juice on top, served with pita bread.  Highly recommended.The souvlaki, feta fries, feta mac n cheese, and spanikopita were also hits.  The gyro was good too, but it is prepared and presented less like a meatloaf and more like a shredded beef.  While the texture was not what I expected the flavor was spot on.Many of their best mezes are half off during happy hour (5 to 6 I think) so if you are on the fence about trying it, this is the time to go."], ["Alissa F.", "Great food, the belly dancer was a fun surprise and polite service. Step off 5th Ave and you'll find a gem."], ["Michelle C.", "Awesome service! Food was amazing and the drinks were to die for! Would 100% recommend and will definitely be returning!"], ["Nam N.", "My bestie and I were looking for a brunch spot downtown and stumbled upon Meze. Want to know what drew us in? Bottomless Mimosa from 10am - 2pm is $12. YES PLEASE!We grabbed a high top seat on a beautiful Sunday late morning and took a look at their menu. Funny enough, although Meze is a Greek/Mediterranean restaurant, we both ended up ordering the Huevos Rancheros because the table next to us had it and it looked DELISH! I waitress also heavily recommended it.So when our plates hit the table, I was stoked! It looked scrumptious! Tostada, refried beans, two eggs, ranchero sauce, Pico de Gallo, avocado, sour cream - and we added chicken to ours. I was so pleasantly surprised how much flavor there was in the dish even though it was an odd find at a  Mediterranean spot. And the ranchero sauce was awesome. HIGHLY RECOMMEND!As for the Bottomless Mimosas...it was totally worth it. I've been to so many places that say they have bottomless mimosas but it's like pulling teeth to have the servers come by for refills. Not here at Meze, our serve (I wish I remembered her name!) was on point and kept the bubbly flowing.Added perk? Downtown residents get 15% off their bill.We'll definitely be back."], ["Alice F.", "Loved the food and service here. Everything tasted great, but I will say the portions of the small plates are pretty small for what you are paying for."], ["Pillin L.", "Aaaaaamazing! I was a little skeptical of this place when I first sat down. There wasn't much options. They had a list of cold appetizers and hot appetizers. Cold were your dips and such. Hot were stuff I wasn't really familiar with either. But read through and ordered a handful of things that sounded good. I'm not a Greek food connoisseur by any means. Boy, did we eat good today! The stuffed grape leaves (not sure what the official name was) were delish! It sat upon a lemony sauce that just complimented it so well. The filet skewer was a melt in your mouth delicious piece of meat as well. Their baba ganoush wasn't a favorite but the warm home made pita made it taste so much better. The gyros are a must! Unfortunately when we were there, their fryer was down so we were forced to order a salad (yuck... lol) but it was all very very good! Fresh, and had the best balance of flavors and meat to veggie to tzatziki to pita ratio! You can't ask for more than that.I definitely recommend this place when in SD Gaslamp area. Ambiance has a very chic upscale appeal but the prices are just right. Yuum!"], ["v v.", "Great food, especially great server.  Andrew provided outstanding service, professional, friendly, attentive!!!We shall return."], ["Jordan M.", "This is a perfect place for large groups! There have plenty of tables that seat at least 6 people. The front is really nice and open. It's in downtown, so it's just a great vibe overall. We ordered a ton of stuff:-fiery feta hummus-baba ghanoush-firey feta mac n cheese-saganaki-meze fries-grilled asparagus salad -Filet plate-pasta lahano (for the vegetarians)-meatballsEveryone's favorites were the firey feta mac n cheese, saganaki, and the meze fries. Delicious! My favorite was the grilled asparagus salad. The salad comes with mixed greens, grilled asparagus, gorgonzola cheese, fresh fruit, walnuts, and a strawberry-fig reduction. I would come back to Meze for this salad alone. Boyfriend and brother's girlfriend, both vegetarians, both loved the pasta lahano. The night we came they had a dancer going around. It was pretty cool and it really gave them place a sense of culture and it helped create the atmosphere. The dancer asked my dad to get up and dance and after from coaxing from the family, he got up and danced with her for about 5 minutes! It was probably one of the best events of the night.Our waitress was amazing. She really helped us go through the menu and pick things to eat that everyone would like. This is a great place for vegetarians because there are a lot of dishes that don't have meat and most of them could go with some type of substitution if you wanted. They have taco Tuesdays! So if you're looking to try it out on a discount, that'd be the perfect day to come. We didn't have any tacos when we came, but all the meat we had was delicious."], ["Casey Q.", "Fun place, GREAT bar, good food. Was in San Diego for a couple of conferences in March, and since much of my family lives in SD, it was Party Week.Mixed the groups one night when I hit Meze with a colleague, and my brother (who lives two blocks from the joint), where we enjoyed some saganaki - who don't love a nice flaming cheese? - grilled octopus, and some of the less exotic offerings.Setting is comfortable, and very eye-pleasing. Service at the bar was stellar, at the tables a little less so, but they only lose one star for that.Overall, a place I'd happily revisit on my next trip to \"America's Finest City.\""], ["Tara I.", "Delicious. Great service too. The fusion is so well done without compromising the Greek taste!! The tea, the fries the souvlaki - it's all Greek to me. Highlight of my San Diego trip for sure."], ["James L.", "Only in town for the day on a business trip so had to find a place that would appeal to a group of 4 who was primarily looking for a healthy spot. After some research, we ended up at Meze.They had a dip platter (that came with 6 dips) and I loved this app. Very good to share- the standout was definitely the feta with roasted peppers. On the other end of the spectrum, I didn't care for the yogurt that was strained multiple times- it resembled sour cream to me. For my entree- I had the octopus salad (most salads have an option of making it a half salad but this didn't... glad it didn't because I loved this). I don't normally order salads either! The octopus was cooked nicely- tender but not rubbery. The dressing on here complimented the dish well. Very light and guilt free if you ask me.Wouldn't mind checking out this place if I'm every in the area again. I do get weary of places that serve food and have hookah but this place changed my mind about that!"], ["Arman B.", "Can I say that this place is literally a gem. Good food, proper portions, and did I mention really good food! Service is great and atmosphere and good for 99% of occasions. They even have a private area for small parties. Drinks are good too, try the hibiscus mojito and definitely try their cheese dish that they set on fire. Loved it!"], ["Vicky B.", "Yum this place is absolutely fabulous, great vibe, good background music, fun entertainment, good wine list, great service and delicious food!I noticed a lot of the reviews stated that the food here didn't taste any different than Luna Grill and other casual cafe type of spots but I completely disagree, it was far more high end and definitely Greek fusion as it's described.  It's like the PF Chang's of Chinese food.I had made a reservation for 6 people at 845pm this past Friday, got one no problem.  The minute I walked up the hostess was nice and let me choose between 2 tables, we went for the 6 seater high top in the front. Lizzy was our server and she was great, very nice girl and highly recommended several things that of course we went for.  I especially liked how she told us about the restaurant, the owner, the history and the preparation of the food, I thought that was a nice touch!What I did like is that they have several small plates that you can share or meals if you want your own plate and are hungrier than others.  Because we had a late reservation we mostly shared all the cold and hot meze dishes.We started off with cocktails, wine and beer.  For food I personally chose the baba ghanoush which was delicious, I eat a lot of hummus so this was right up my alley.  They brought it out with delicious tasting warm pita bread which tasted similar to naan bread that you get at an Indian place, I also asked for veggies with it also.  I also had the grilled shrimp which was 3 large shrimps with a fabulous sauce, their meze sauce which I wiped the plate clean with the tasty bread!  Others at the table had the meze fries with feta, my dad enjoyed the Greek quesadilla, my Mom had the spanakopita which she thoroughly enjoyed in addition to a side of gyro meat, our other friends had the lamb plate and the tacos. One of the best things we enjoyed which came with an \"experience\" was the saganoka which was a warm cheese dish that the server brings out and lights on fire, very cool and highly recommended!I really wanted to get the asparagus salad, the pictures I'd seen looked really good but we had so many small plates that I wasn't hungry enough for that so I'll try that next time.After we were finished eating, Patrick one of the owners came to the table and introduced himself and asked how everything was.  I also thought that was a nice touch as it showed how much of a family orientation the place had.  And for the grand finale, they had a belly dancer!  She came in around 9:30pm in a cute costume with lights and danced around the restaurant so it was nice to have some entertainment!Meze is a very cool spot that's a trendy, fun spot with fabulous service and food.  It's also very large inside, I'd never been to their original location so I'm saying this is a great new addition to the gaslamp!"], ["Kasia M.", "Never been here before...So I go on customer service, drink, foodThat order.Customer service... Amazing. From the hostess (Alicia) to our incredible, sophisticated, charming, knowledgable New Yorker native Server (Addy), to the amazing drink creations done by Eddie.... This was a truly wonderful experience all around.Food - needs work.Peace and Love"], ["Nicole D.", "Came here for lunch. Funky Greek decor. Service was prompt and attentive. Gluten free options are not listed but they will tell you what is safe. Had the fries with feta and herbs and the Caprese Greca. Must love feta to enjoy these two dishes which I do! Put the spicy sauce on the fries which made them even better. Speedy and fresh lunch in the Gaslamp."], ["Kat R.", "! Very good. A friend suggested this place to me since I was in the area for a conference. I spent my summer in Greece and was excited by the idea of a great Greek fusion place. The Gaslamp area is really nice to walk around and this place is easily accessible by public transportation (which is a big statement from me since I'm directionally challenged enough in cities I do know - still managed to navigate my way here from Harbor Island having never been to San Diego before) The exterior is sleek and there were a good number of people out smoking hookah who seemed to enjoy the service. The interior is just as nice - open, airy, classy lounge feel. I came during happy hour which turned out to be amazing. They had $3 cold appetizers, $4 warm ones, and had Mythos beer which was a plus. Happy hour is for the bar and lounge only but since the lounge section wasn't open, I was able to grab a table and still order from the happy hour menu. Friendly, accommodating staff and the prices cannot be beat for the quality. I ordered the baba ghanoush, the meatballs, and the fiery mac n' cheese all off the happy hour menu. The food came out quickly and was really great! I thought the baba ghanoush tasted more like a hummus plate but it was just a personal preference - the waitress was really nice about it and took it off my bill since I didn't enjoy it as much. The meatballs were wonderfully seasoned and tasted really great. I wouldn't say the mac n' cheese was exactly 'fiery' (sort of expected it to be set on fire similarly to saganaki) but it complemented the meatballs well. I think the food would be a little lack luster if I were to have only ordered the mac n' cheese though - needs to be paired with something. This place seems to be creative with their food and concept. Absolutely check it out if you're around Gaslamp and if you're not, it's worth the trip. Bummed that I'm across the country! Will absolutely come back next time I'm in SD."], ["Will V.", "A respectable Greek dinner option with a spacious room, attentive service, and occasional deals like half off on all bottles of wine. Decent Mediterranean food, I had a passable appetizer/tapas style size portion of hummus, decent baba ghanoush, good dolmades, and shared a nice, half off bottle of white wine. I love half priced bottles of good wine. Who doesn't?"], ["Kindra M.", "As an out of town visitor to the Gaslamp district we had no shortage of options for restaurants.  I am so glad we ended up at Meze for a late Wednesday night dinner. We had our dog with us which wasn't an issue since they have a lovely patio that opens up directly to the restaurant so you are still able to enjoy the cool ambiance inside.  Ok now for the food- we decided to order a variety of items from the starters menu. Cilantro jalapeños hummus- excellent. The spanakopita was probably the best I've ever had, lots of spinach encased in fluffy, flaky pastry omg it was good. And the the gyro- I really think it was the most flavorful gyro meat I've ever had!To recap: great patio (gotta love the people watching), friendly service and delicious Mediterranean fare."], ["Cathy I.", "What a fantastic find! We had Tiffany (waitress extroidinairre) and we ordered nearly all her suggestions. The Mezes ( smaller portions) allowed us to sample lots. The fiery feta, meatballs, lamb souvlaki, gyro with yummy taziki coupled with a few cold mythos made us think we were in heaven. BUT when the (I can't spell it but will try) loukades? Mediterranean donuts fresh hot smothered with honey served with ice cream and fresh berries arrived I knew I was in heaven. I wish they would open 1 in florida ! Wonderful meal!"], ["Hercules R.", "I had the Beef and Lamb balls with the basmati rice and sautéed veggies. The meat was well-seasons and very flavorful!  Surprised this place isn't more crowded given the awesome food and the amazing service! Our attendant was very courteous and the staff was kind enough to let me charge my phone while we wined and dined! Eric ha the falafel plate and that was equally scrumptious. I highly recommend this place to anyone looking for great Greek cuisine! I would like to come back again next year boils we be lucky to get ComicCon tickets again for 2016!"], ["Kara W.", "This place was absolutely delicious!  The food was unique and  exploding with flavor! Amazing  friendly staff! Great decor and atmosphere! A must go to if you are in San Diego. They had a sauce I have been looking  for for years,  and found me an extra large bottle so I could buy some to take back to AZ with me.  I will definitely  be back...  Maybe for dinner!"], ["Julie B.", "Recently checked this place out for a work lunch. I had the greek salad, a hummus appetizer and the chicken kabobs. The food came out promptly and was tasty. Sitting on the patio was refreshing and our waitress knew the menu front and back. Will definitely return."], ["Mandi B.", "Stopped in here for some late night food recently and was quite pleased! Just some basics, hummus, dolmas and a few falafel, but they do the basics well!  We devoured our snacks.  This is a pretty large space with multiple levels to it.  They do hookah here too if that's your thing.  Oh! And they have a drink called \"Bye Felicia\" which made my friend's night ... A little too sweet for my tastes.  I would definitely go back here for food if I was hankering for Mediterranean."], ["Loc T.", "Service was top notch.  There were even belly dancers on the weekends.  I ordered the combo plate with filet, giant shrimp, and chicken.  All were very moist.  Nice and upscale Greek restaurant in the Gaslamp quarters."], ["Steve R.", "Came here on a Tuesday night and it happened to be Greek taco Tuesday. You can't go wrong with $2 tacos! I also had the Baba ghanoush and jalapeño hummus. Very tasty with a Modern Times Stout to go with it. I was greeted by a friendly gentleman at the door. Zee was his name and Demi my server was attentive and had my food out in no time even though it was last call for food. Very nice decor and ambiance at new location. Check it out!"], ["Lisa N.", "Had a lovely experience here during comic con, we ordered the meatballs, chicken Slovaki and Greek salad. The food was surprisingly delicious! The meatballs came with a nice tomato sauce and were delicious when eaten with the complementary pita bread. The Greek salad had nice size pieces of cucumber and tomatoes atop a bed of crisp romaine lettuce and sprinkled with olives. The chicken Slovaki had a nice cucumber yogurt sauce, yummy rice and sautéed vegetables. I look forward to coming back!"], ["Ana C.", "My boyfriend and I happened upon Meze months ago. We have been loyal patrons ever since. Every time we eat here the food is delicious and the servers are great.Tonight we had the Greek salad and Soulvaki. Both were very tasty! In the past we have also enjoyed their saganaki ( ohpa!) and gyro plate. SO good. Tonight our server was Andrew and he was friendly and answered our menu questions and made some great suggestions. He was very attentive and we hope he serves us again int he future. If you want Great Greek food with nice ambience, definitely make it to Meze."]], "Cafe Athena": [], "Aladdin Cafe": [["Alyssa T.", "Aladdin's has the best hummus I've ever had. It's ultra creamy, smooth, with fresh garlic that doesn't overpower. Their pita bread is made fresh and is pillowy soft, perfect for dipping into the hummus. I was looking for tzatziki but didn't see it on the menu so I went with their side of tahini. I'm not a huge fan of tahini alone because it can taste bitter, but the tahini at Aladdin is so good! I don't know what they add to it, but it's not bitter and is addicting. I've had the lamb gyro, lamb biryani, Greek salad, and lemon soup. Everything is delicious but the lamb can sometimes be on the fatty side and the lemon soup was a bit too sour for me. Whenever I order for pick up, they've always had my order ready when I arrive, but they still ask me if I'd like something to drink. The service is great and the servers are friendly."], ["Row Bear F.", "Great food. Solid service. The most authentic and highest quality Lebanese food we've found in San Diego.  That said, the prices are about 25% more expensive than one might expect.They've got Lebanese beer, which is pretty cool, too."], ["George T.", "Great food and great services. All the waiters are very friendly. The pita and hummus are must have. The food portion is huge!!Lamb chop is amazing!!"], ["Sylvia H.", "So I'm mostly writing this review on behalf of my brother, who said I must \"Yelp the Cr*p out of this place\" (in a good way!) cause he loved it so much. We came here desperate for food that was close by and we could agree on. Yelp did not steer us wrong.This place is amazing! The food is fresh and delicious with huge portions; the location is convenient; the service is great; the restaurant is comfortable; the prices very reasonable. In fact, my whole family declared that this is a \"must go to\" everytime they visit me in San Diego! -convenient location in Claremont Mesa in a strip mall with lots of free lot parking-casual, table service restaurant; large, spacious, comfortable eating areas both indoors and out; nothing too \"fancy\" but very clean-good for large groups, kids and couples; lots of options depending on which area you're sitting in-it wasn't very busy at all when we went, but even on a full night I can see this place being conducive to a quite, relaxed meal-the service was wonderful! we were seated quickly and  the menu was explained extremely well, all of our questions were answered and quirks addressed without issue (especially regarding food intolerances (one of our guests has a corn allergy and they were very accommodating... that in and of itself deserves top praise), a kid's menu, specific requests, etc)-the waitress was super friendly and helpful, the food came out quickly and she checked on us several times-the food was amazing; the star of the show! -the menu is really varied, there's no limit to the options; the food is clearly described and there are lots of pictures-the portions were huge (the side salad was larger than you'd expect most entree salads to be); we had enough for dinner and leftovers for lunch tomorrow-everything was freshly cooked using great ingredients and seasonings; each item tasted delicious. nothing was overly oily and everything was cooked to perfection. -each entree was a feast of various components, so with three adults ordering there was a massive variety of food which is great when you want to try a bit of everythingChicken Shawerma, $20; Marinated strips of chicken, grilled and served with Basmati rice, Hummus, Garlic Sauce, Lebanese salad and freshly baked pita bread. The hummus was really creamy and delicious. Falafel Sandwich, $8.50 plus $1.99 for Sub Greek Salad; A Delicious Vegetarian Sandwich Rolled in Pita Bread & Topped with lettuce & tomatoes, pickles and Tahini Sauce. The Falafel was really good, but the Tahini sauce was extra yummy (they even gave us a container of it to take home... really, we would have taken a tub of it!). Chicken Kabob Skewer ($6) with Cucumber and Tomato (ripe, freshly sliced) ($2.49) and Sauteed Veggies (mushrooms and squash) ($4) for the \"Kids\" meal as suggested by our waitress. The chicken was SO GOOD! It had a mildly spicy marinade and was grilled to perfection; well cooked in the middle with lots of charring on the outside!Cheese Borak ($10.50 for a half dozen); A Blend of Feta Cheese, and Halumi Cheese with Fresh Mint baked in a  Wood-fired Oven. This got rave reviews from everyone and could easily be an entree on its own.Baklava ($5.50). The family took this to go and reported back that it \"rocked!\" It is massive and looks great. Very fresh and crispy looking.-The prices were really reasonable, moreso considering the size and most importantly the quality of the ingredients and flavour of the dishes. There are a TON of other items on this menu which we can't wait to try. This place scores on every level. An amazing find. Definitely soon to become a regular spot!"], ["Vince F.", "Came here a few times and every time I just enjoying the food here. I like service, the attention, I tried different entrees like the chicken kabob, the lamb, hummus and falafel very tasty. If I could eat here every day I would. If you are looking for traditional middle eastern food , you came to the right place."], ["Adrienne K.", "Absolutely delicious salads! The chopped salad and Greek salad seem to be a fave! One salad is big enough to share, and the parking can be a little tricky. Ps don't ask for Tziki, it's \"Mediterranean, not Greek! \"Ha!?? Confused me too. But it's all sooo delicious! Probably the best hummus I've ever had too!"], ["Jack M.", "I happy to learn that Aladdin continues to do well after all these years. I use to come here before I was a Yelper. I dropped in for a light lunch and ordered the lentil soup, a half order of hummus and pita, and a Chicken Kebab with sandwich on pita bread. The Lentils soup was light but full of great flavor. It was of the extremely blended variety, in that there was no whole lentils in it. But, the soup tasty of lentils, garlic, turmeric, and a variety of other seasonings and herbs. The soup was a great way to start the meal and cost $4.95.The hummus was fantastic as well. Made from fresh ingredients and garnished with excellent extra virgin olive oil, it was hard to go wrong with this. The hummus was served with a pile of sliced warm pita bread which were perfect for eating the hummus. The hummus was quite delicious, and provided a creamy consistency and great flavors of tahini, a bit of lemon juice, garlic, and seasoning for taste. It was quite a treat, and I even used it on my chicken kebab sandwich. The half order cost $5.25.The chicken kebab was very well prepared. Although it did not come with lettuce, the sweet waitress brought me some when she figured out I was bummed it did not have some. The chicken breast marinated in the garlic lemon saffron sauce was great. The chicken properly soaked up the marinade which allowed me to taste it in every bite. The charbroiled chicken was cooked to a tender and juicy temp. The tomatoes were a nice touch with their acidity and the extra garlic was just fun. The chicken kebab cost $8.75.I ate at their small bar and service was active and friendly. It seemed to be the place where the servers congregated, which allowed me to chit chat and be served rather quickly. Everyone was very nice."], ["Yannis A.", "Fantastic food if you like Mediterranean and Middle Eastern. Good prices. One of the best hummus and baba ganoush around!Service is ok but the food is A+."], ["Lisa W.", "My friend raved about this place and how he loves it and how he comes here everyday for lunch... So he took me here after our hike. We started off with the pita and hummus. I must say that the hummus was nice and fresh and the pita came out warm as well. But then to my entree, I got the lamb shawarma wrap. I thought it was extremely flavorless. I definitely like Mamas in North Park better. This absolutely had no flavor, even when I dipped it in hot sauce. Nothing. My friend got the Aladdin's Mediterranean chicken salad and OMG that tasted so much better than the lamb shawarma! That chicken salad was delicious. Next time I will order the right thing and get the Mediterranean chicken salad."], ["Andy R.", "One of the best, if not the best Mediterranean food I've ever had! Staff is always friendly and the chicken is always moist... highly recommend the hummus to start and the double chicken plate (Kebab+Shawarma)!"], ["Sana H.", "I'm not a salad girl but the aladdin salad was great! So refreshing and the chicken is nicely seasoned. It's also huge...could only eat half of it. My husband got the lamb shawarma sandwich which was juicy with a cinammony kick and tangy yogurt sauce. Really hit the spot!Only reason I gave it 4 stars is because it's a bit pricey. Would come here again to try an entree/platter for dinner!"], ["Heihachiro K.", "This place is the best Greek/Mediterranean food I've had in San Diego. Their lamb and chicken shawarma dishes are on point. Also, the hummus is awesome and it's fresh. It doesn't sit there for days and have that weird discolored look to it. I highly recommend this place for lunch. Oh and the salads are enormous, I eat those a lot. Price point is middle of the road. Salads are about $12 and shawarma sandwiches are about $10-11. They have a ton of other shit too. Go there and try it and thank me later. Actually, try the falafel too. Bomb."], ["John M.", "Best garlic toum sauce around-- and a great variety on the menu!  My wife and I never really realized we love \"Lebanese\" cuisine, but most of our favorite menu items are only available at these hard-to-find restaurants.  The chicken and beef shawarma cannot be missed!  A lot of their platters includes lots of extras like Lebanese salad or hummus.  This place is also has some of the smoothest, best hummus we've had.  Not cheap, but I'd highly recommend!"], ["Kristin S.", "We stumbled into Aladdin Cafe last night and am so glad that we did! We wanted to order our food to go and the staff was more than accommodating! Everyone was super friendly and we were also offered a delicious iced tea as we were anxiously awaiting our food as our senses were filled with the smell of amazing food. We got the chicken chopped salad (with romaine), lamb shawarma and a large serving of hummus. Everything was amazing and we will definitely be back!"], ["Christle D.", "This place was walking distance from where we were staying.  Soooooo glad we decided to give it a shot. Came on a weeknight at 8:45pm with only two other parties in the restaurant who were already finished with their meals...We were getting a 'lil \"hangry\" before we walked in (just came from LA traffic to SD), but the staff took very good care of us despite dining so close to closing time.  We never felt that they were trying to get rid of us.  We appreciated it so much.  Thanks guys!!Ordered the baba ghanouj, lamb borak, lamb biryani, lamb shawarma, and a Greek salad.  Took a bite of the lamb biryani, and my mouth wanted to sing \"Araaaaabian Niiiiiiights\" from Aladdin.  The rice, lamb, and seasonings came together wonderfully.  Everything we ordered was full of Mediterranean flavor.Your breath won't be pleasant after, but who cares. The food is freakin' delicious!!Will definitely stop by Aladdin again whenever we pass through this area of San Diego."], ["VJ J.", "We ordered food to go. Lamb kebabs, chicken kebabs, falafel, biryanis which added to about $75. The lamb was really overcooked and inedible, chicken was good though. So when i go in to pick up my order, the bartender asks me to stand in the corner since i am picking up food. Then i ask him to add some galic sauce and tahini, he charged me $4.50 for 2oz garlic sauce and yogurt(i was given plain yogurt). Ridiculous. Rude and the food was bad."], ["Mohammed M.", "Good taste. Need a little bit more to be perfect.Good service.Definitely I'll come again"], ["Chris R.", "best Lebanese food ive ever had. enjoyed a nice feast with family and we will be regulars. I loved everything about this nothing was bad nothing wasn't up to high standards. please eat here and youll love it!"], ["Marlena S.", "Came to Aladdin Cafe on a recent visit to SD and I will absolutely come back when I'm in this neck of the woods. I ended up getting too full to try the dessert, but I will be back to try the Baklava and Knafeh I saw in the dessert case. There were three of us, and we got Kebeh, which where huge (these ones are made of lamb), Baba Ghanouj, Pita Bread, Falafel, and one of the kebob platters. It was more than enough food and we ended taking a bunch of it home. The food was delicious and the service was friendly. I'll be back!"], ["April P.", "I crave this place all the time! I live about 2 hours from here, but when I go to SD, I try to make a stop. This place is so worth a try!! 1. Portions are huge! If you don't eat a lot, I suggest sharing or taking the other half togo. You can also take your soda togo when you leave! 2. Not only are the portions big, but the taste and quality is top notch. I usually get the chicken shwarma plate. It comes with a huge bowl of salad (which is delicious), rice, hummus, pita, garlic sauce, and chicken. 3. Pita bread is fresh! They have the best pita bread I've ever tried! The workers are so generous, so you can get more if you ask. 4. Dessert: Don't leave here without trying the baklava! It'll be the perfect end to your meal. 5. Service is wonderful here. Servers are so kind and friendly."], ["Conrad R.", "When Wifey suggests we go to Aladdin or similar place instead of some generic chain restaurant, I'm so happy.Busy lunchtime crowd, and the food still looked and tasted delicious. I thought maybe things would get sloppy with a packed house, but that wasn't the case.The rush was on! We promptly got seated and our server quickly put in our usual orders. I say that like we're weekly regulars, but we aren't since we moved. It's nice that the food quality is as great as when we first frequented the place. The sharable salads are bountiful, piled high with fresh ingredients.My fave is the koufta kebab sandwich with fries. It normally comes with a side salad, but I get to pick at Wifey's ginormous salad that she can't finish. This is one of those situations where I'd like to try a different menu item, but I end up picking something that never lets me down. I hope they didn't permanently change up the fries because this time they served up thin shoestring fries instead of their usual kind...not so much chunky wedges or steak fries, but they remind me of Ore-Ida Zesties. Either way, their fries are always served up perfectly piping hot and crispy. Service is quick and friendly and the servers check up on us often to make sure we're doing ok. I've noticed a couple of small restaurants within walking distance come and go, but Aladdin Restaurant will stick around for awhile longer providing great customer service and delicious food to the neighborhood."], ["Reyna M.", "It was our first time here and the food was good,service was ok! Our sodas cups were never refilled unless we asked , but they make sure to  charge you 18%service fee + tax + svc! I didn't like that at all. You should not impose such fees unless you come in with a large party. If you don't mind the service fees then give it try."], ["Martin L.", "This is simply the best place in San Diego for salads. The mediterranean salad is amazing. The service is top notch they're friendly, courteous and prices are terrific!!! Hands-down the best in San Diego"], ["Mari P.", "Best hummus EVER. Salads are my favorite - just wish they were slightly larger in size (they used to be, but seem to have shrunk over the years.) Clairemont Mesa location was expanded and new, beautiful, separate mens/womens bathrooms installed. Woo!! LOVE ALADDIN CAFE!"], ["Alyssa V.", "I have been here more than 20 times and never written a review, I always forget!I love Mediterranean food, honestly there are only two places that I will frequent, Alladin is the only place in San Diego. Starting with fresh pita & hummus, and as a main dish I frequently order their Chicken Shawerma (I love the garlic sauce but I skip the tomatoes), and if I am super hungry, I will add a salad. Fear not if you have picky children (or adults) in your party, they have tasty pizza as well. I have been to Alladin with a friend who has a very picky 4 year old, but he keeps quiet as soon as his own \"large pizza\" as he calls it arrives; in all actuality it's a little larger than an individual pizza at CPK, but hey he is 4, picky, and it kept him quiet both times I ate dinner with his Mom, a good friend & fellow lover of Alladin.I ordered the Halibut Arrabiata on my last visit and it was very good, I am very picky about fish and Italian food, having grown up eating both frequently, but I was very impressed with theirs, and would order it again if i were craving a healthy & tasty fish dish. The halibut came with rice, pita & hummus, bit I always order extra pita & hummus, as an appetizer, because it's so delicious.They also have a plethora of teas, and I love tea when I can find it, the mango and passionfruit are my favorites at this restaurant, and they have refills on teas as well as sodas (many restaurants are stopping that method, not so here). Overall, one of my most favorite restaurants, you can linger over a meal, and you never feel rushed. All too often, even at nicer restaurants I feel like they are just wanting to get me in & out flip the table and serve another guest; not so here. Alladin Mediterranean Cafe will always make you feel comfortable, as if you were dining at an establishment owned by friends & for that very reason I will always return and leave with a full tummy and a smile on my face."], ["Sam M.", "My favorite Greek/Mediterranean restaurant! I have been coming here since I was young and it's great to see that they are doing well with their newer expansion! Their chicken salad is a feast! Chicken Shawerma sandwich is amazing also. Try their garlic sauce!"], ["Kitty K.", "I've come here a few times recently and the food was great!  However tonight I arrived at 8:30pm and was told very rudely that the resturuant is closed.  Then as I walked out another group of people walk up and heard us say that they are closed, so they start to walk away and another waiter runs out and tells them they are open. After I got back into my car and left I called the resturuant to ask if they are still dining in and I am told yes if I make it back in five minutes.  How do you turn business away and expect the customer to come back after you kick them out.  By the way it was 8:30 p.m. when I went in and they close at 9 p.m. even though their sign on the door says otherwise"], ["Jenna M.", "When ordering on the phone for take out the person who took my order was rude and got my order wrong even though he seemed quite confident that he knew exactly what I wanted before I ordered. The falafel is so far the best in town for me. The pizza was yummy and the kids crushed it. I will be ordering from here again."], ["Chuck A.", "It was wonderful.  We had Pita sandwhiches, the best Falafel ever and a wonderful Borak; one with fries and one with salad and shared.  Everyone mst love them as mostly regulars and also a huge take out business.  Service was great and attentive,  One server soon figured out we were rookies and showed us every dish he delivered from the kitchen!  We will be back soon.  We then met anther couple at Proud Mary's where they were entertaining, and they told us they eat at Aladdin at least once a week and we know they have good taste.."], ["Gina R.", "Delicious!! Delicious!!! As soon as you walk in, the smell.. So yummy.. Chicken kebabs so well marinated, well served entrées , service is excellent.. No wonder is always a full house.."], ["Joe H.", "My wife and I LOVE their food and the friendly staff. So when it was time for her B'Day party I had them carter. Got hummus, salad and bryani. As usual, all was delicious. The staff was great and had it all ready for pick up when promised.Love this place!"], ["Rene M.", "Bad experience after bad experience, the only thing I used to find attractive about this place was the different dishes but after looking around there are others with better choices.The prices are high and the service is one of the worst, you basically come in, someone greets you with a smile and sits you down and then is all over, you get forgotten, time after time they do the same, eventually you have to basically yell \" Where is my food!! ive been here almost a freaking hour!!\" then all of a sudden your food (that was sitting on some counter who knows how long) gets brought to you, already partially cold and you can tell the cooks rushed as well due to the burned taste on some items. Last time i went there in a business meal and i was embarrased. Not to mention that just 2 of us got charged over $60.00 for our lunch.Never returning again to this place."], ["Yoseline S.", "Went by here for the first time and i have been dreaming about going back since! It was amazingly delicious!!! I had the chicken kebab and was surprised at the amount of food. I cannot wait to go back and truly recommend it!"], ["Kamil E.", "Good food! We ordered bunch of appetizers and couple of sandwiches, kitchen closes at 9 so we couldn't order more food after 9 which I totally understand. I would visit them again since this is my 2nd visit to Aladdin. I was hoping the beef shawarma is cooked on the rotating spit but it wasn't, but it's still good."], ["Michael L.", "The chicken kabobs are probably the best thing I've eaten this year.  I'm not kidding!  The flavor is amazing and I've been craving them and can't wait to get back to SD for an Aladdin fix."], ["David F.", "Outstanding food. Fair prices. Quick and very friendly service. No other middle eastern restaurant comes close."], ["Rana R.", "Probably the best hummus/pita combo I've had.. to be fair I haven't had a lot, but it's still yummy! Go here any other time other than lunch cause the place gets packed.. So if you're on a thirty-minute lunch break, this isn't the spot for you. Unless of course you order ahead & take it to go. I've only had their sandwiches-Lamb Shwerma to be exact. Huge portions, can never finish it in one sitting. Your choice of house salad or curly fries. Lamb is perfectly cooked, never dry. This is all only for $8.75. The hummus half order is $5.25 while the full order is $7 something. Endless pita! Nice, hardworking employees, never saw them break a sweat during the lunch rush. Aladdin is also a great spot for healthy plates. Almost all dishes come with huge portions of salad. Parking is hard though, just be warned"], ["Traci D.", "Do you love Hummus?  Fresh pita bread?  The chicken kabob is yummy - Cooked to perfection, moist and juicy!Crazy, busy atmosphere but they do everything possible to accommodate and find you seating quickly. Just don't want you to think that you will never have to wait to be seated."], ["Lina K.", "I always enjoyed eating here or ordering take out. We live close by and this place has been around for years! Their selection of middle eastern food is great. Their tabouli and hummos are delicious. I knocked off a star because we went as a large group this weekend and the service was pretty poor. I left disappointed. We ordered a lot of food and it seemed that the chef may have changed or something. We ordered a Biryani plate which we usually do and the rice was stale and the plate was really small when usually it's large. We asked servers for several small items to accompany our dinner and they never came out. I just wish there was more consistency in the food and service. Parking and location are great in my opinion."], ["victoria b.", "IF YOU LOVE MEDITERANEAN/ MIDDLE EASTERN FOOD.. READ THIS. So this little San Diego neighborhood gem is in an obscure place. You would drive by it a thousand times and not notice it, I know I did. Thank heavens we were starving when we went in. We started with the warm, hot out the wood oven, pita and lebne, drizzled with amazing olive oil while we waited for the Aladdin Meze Platter we SHARED. Still so much food we took some home. Fresh, cooked to order, home made, delicious and not over salted like a lot of middle eastern places. Perfect spices. I really can't wait to go back. It's super east to get to, by the 52 and 805 of Clairemont Mesa Blvd. So worth it. By the way, the staff are super friendly and lots of smiles and seem like happy people. That makes a difference as well. It's like going to someone's home for a good meal."]], "Dino's Gyros": [["Amanda M.", "This place is pretty good. The food is very flavorful and the selection is great. From Mahi Mahi  and pita sandwiches to Gyros and baklava, this place has your bases covered. The prices are fair enough considering the freshness of the ingredients and the portion sizes so I can't necessarily complain. Also, there is a young guy by the name of Ricky that works at this location...And he is friggin' wicked awesome...His service is always top of the line and he doesn't even have to go out of his way to put a smile on a customer's face. He is quick, efficient, and friendly... Now THAT'S what customer service is all about!"], ["David G.", "very disappointed I have gone there for years but I will not be back after the quality of the food was only fair.  the amount meet on my plate was about 40% of what I have gotten in the past.The Cashier who took the order was a little rude and not very help full.  I paid with my debit card and showed my military ID and in the past I got 10% off what I purchased.   This time I only got 10% of one of the four times that I purchased. I felt cheated or ripped off.   Then I do not like the new register/computer that they have.  I think the first question is do you want to tip the Cashier.There are no waiters in this place it is self service they call out your name and go and pick up your order and take it back to the table.  So why should you tip?  then they want you to sign your name with your finger on the computer screen!  First time I have gone their for dinner and last time. I have been there for lunch often and was always satisfied but not any longer. I would  send anyone there not even some one I dislike!"], ["Sue G.", "If I could give customer service at Dino's less than a 1 star, you can be sure that is what I would do. The sign for their family pack is misleading in regards to the choices of meats offered. When ordered, there was an assumption on our part that the pack included gyros and a whole chicken. Unfortunately when we got home with our order, we discovered that we only got gyros, no chicken. When we called, we got a lecture from the owner telling us it was our fault and that she wouldn't do anything to accommodate us. That she couldn't afford to pay us to eat her food. Bad way to handle a customer. A 28.00 order is going to cost her more with us never going bad to her restaurant. There are plenty of Greek restaurants in San Diego. Obviously bring in business for 20 years, this owner has forgotten about promoting good customer service!!!!"], ["Rachel R.", "It's one of those place you think it will be good but you don't expect heaven... I had some hummus wrap of some sort. It was good and messy--what is it they say \"if it doesn't get all over the place it doesn't belong in your face?\" Oh yeah I was submerged in the Greek goodness--I think there was conversation happening but I was so focused on the pita bread smoothed in hummus and veggies I just don't remember.To bad they don't have one in L.A. : ("], ["Lindsay V.", "I ordered a gyro Greek salad and they delivered a regular Greek salad. When I called they said they couldn't do anything about it. I will never order from here again. Poor customer service."], ["Trevor P.", "Delicious. ... we showed up tonight right when they were closing and the food was as fresh as I've ever treated a gyro anywhere... on top of super fresh food at closing the manager was awesome.  The whole staff was awesome.  All were professional and extremely friendly...I highly recommend this place if you want fast friendly service and good Greek food. .. I'll be back"], ["PatMan F.", "How could you not love this place?  We don't live in the area, but driving all the way to Clairemont for some Dino's Gyros is always worth it. Been doing it for years. We've tried to find Greek food that's just as good and priced right but can't seem to find a better Gyro restaurant. The owner is always so attentive to the customers. It's always a nice touch when she comes out to say hi to my little eaters. Way to go Dino's Gyros!"], ["Jessica P.", "Been to this place four times and they have messed up my order every time. This last time I said something and the older cook argued with me. Good food but I won't go back after that. Even another customer mentioned how the cook shouldn't have treated me that way. All the other staff are nice, but that one cook ruined it."], ["Kathryn W.", "Delicious.. one of the best gyros around. Friday's they have a lamb shank special that my husband absolutely loves. Sometimes they have a beer special of buy one get one free. Also I love the European style outdoor dining by the fountain, but they have indoor tables too. Staff is great as well."], ["Amanda W.", "They have really good food but it is overall a little pricey."], ["Annie W.", "Price is good. ~$7 for a gyro sandwich.I would get the gyro plate; it comes with a Greek salad, lots of gyro and fries. $8.50My friend said the falafel was AWFUL. (Hence 4 stars vs 5)Service was perfect. Was asked how everything was, even though it isn't a sit-down dinner. The workers are happy. :)"], ["M S.", "Dino's has excellent gyros! The servings are generous and everything is fresh. Unlike the generic \"Mediterranean\" crap served at Daphne's, Dino's always serves fresh pitas and tzatziki sauce! The service is EXCELLENT. Everyone that works there is very nice and they have never messed up my order (which seems to be a chronic problem throughout SD). There is only one reason why Dino's does not receive five stars: 1. LOCATION!! Their Clairemont location sucks. Let's be honest: driving into shady Clairemont for anything is a royal pain. I obviously love gyros, because I will not traverse crime-ridden Clairemont for any other reason. For those of us who are not fans of the \"bars-on-windows\" architectural trend, the location leaves much to be desired."], ["Daniel C.", "I was craving gyros and we so happened to be in the neighborhood and try this place out.  They hit the nail right on the head! It was delicious! I ate that gyro so fast I really wanted a second one but I have to control my eating habits a little better. If you're close by swing by you'll love it!"], ["Kelly S.", "Dino's is the best Greek food in San Diego! Good portions, good service, fair prices!"], ["Navid F.", "If you want Greek, you have to try Dino's. Greatest gyros in all of San Diego. Always a consistent, filling, delicious bang for your buck. In a wonderful location for an afternoon or evening outing with family, loved ones, and/or friends. With a Starbucks and movie theaters next door, Dino's is always the place to be. Always an incredibly hospitable and helpful staff. If you want a taste of Greece, Dino's Gyros is it."], ["Rachele A.", "this is my dependable go to neighborhood greek joint. the food is reasonably priced and tastes consistently good. also, the service is always on point. i've literally been coming here since i was a little girl and i've never been disappointed. the soup/salad meal is a great deal and a delicious way to fill up. there are plenty of vegetarian options and everyone loves the gyros. it's a great place for those awkward herbivore/omnivore relationships. i'd recommend this restaurant to anyone, especially for hungry people who are too lazy to cook but too cheap to go all out. that's usually when i find myself here."], ["Samantha B.", "This is a Greek place that has great gyros but I've been coming here for almost 3 years and I always get the chicken Dino's . The fries are to die for (get extra seasoning) . I'm addicted, wish they were open earlier and later ."], ["Leslie P.", "Gyro Plate is good! Just wish their rice wasn't so overcooked. It is convenient because it is in the Clairemont Square parking lot...so parking is usually never an issue."], ["Gloria T.", "The french fries have delicious seasoning on them. The Greek salads are delicious and the lemon chicken is really good too. The hummus is good and the pitas are fantastic.I have nothing but good things to say about Dino's. We like it so much we usually eat here once a week!"], ["Michelle H.", "Got the Gyro plate (comes with slices of pita bread, salad, and your choice of fries or rice).  I am not too fond of the rice here.  Fries are with a kick of cajun (?) seasoning.  HUGE portions! But for $~8....it should be.  We also tried the falafel.  The \"herb\" taste was a bit too strong.  Overall, it's good portions for the price you pay. Not bad."]], "Olympic Cafe": [["Hannah G.", "This is some of the best Greek food I've ever had! The gyros meat is delicious and the salad that comes with the plates is so good, with homemade dressing and an entire chunk of feta.The service is great and the waiter is personable and helpful.I highly recommend this restaurant to anyone who wants to try Greek food or already loves it!"], ["Jonny C.", "I like this place. It's simple and you get a good portion for what you pay for. I had the gyro with souvlaki. The beef had a nice char (what I look for in all the beef dishes) and good tenderness. The gyro was pretty good, served up with all the usual suspects, pita, yellow rice, and salad. The place is in a little strip mall so you have to catch it before you pass it by. Service was great, waters refilled promptly and knew the right time to ask if we needed anything. Not too overwhelming."], ["Joseph W.", "My gf and I were craving gyros after leaving December Nights. I thought of just getting it there, but the hell with paying their overpriced food when I can get it better at the restaurant. Olympic Cafe was actually in the way home and after yelping \"gyros\", they came up on our way home. So, we went in and were greeted warmly by the owners son I believe. I got the gyros sandwich and my gf got the light Greek plate. Oh man! My sandwich was delicious! The meat had a light crunch on the outside and the flavor was just on point! I usually eat my sandwiches with fries, but the light crunch texture on the meat was good enough. My gf's light Greek plate was pretty good size portion but it mentions in the menu that it's for a small appetite. When she got it, it was actually pretty decent size and filling. I thought it was a regular plate size. Love the pita bread too! I could eat it by itself. Overall, it was our first visit and was a good one at that. We will definitely be back when the craving hits. Lol."], ["Daniel P.", "Damn the reviews were true. Best gyro I have ever had. Guy running the counter was way friendly. The gyro was awesome so much food. The guts of it were falling all over the place. I'll drive back from la Mesa again to come here! High five guys!"], ["Renée A.", "This is fabulous greek food! i ordered the gyros sandwich and my friend ordered the spanokapita. Both were excellent, and accompanied by a fantastic yogurt sauce that was fresh and tasty. We also ordered a plate of fries to share, and the fries are AWESOME! A great place to get 'steak fries' which are in wedges, but still crispy and seasoned.The iced tea was the best iced tea i have ever had. seriously. When i asked, she said it was 'farmer brothers'.  i had 4 glasses of iced tea because it was so delicious.both my friend and i ordered baklava and -- wow, it was amazing. obviously fresh, wonderfully flaky, with a solid middle. i am sure it was handmade there at the restaurant.this is the only greek food in all of san diego for me. the service was quick and very kind. it was a comfortable place to sit in and go too. very casual, relaxed, and regularly filled."], ["Zenia P.", "Small Mediterranean and Greek Cafe with private parking lot shared with neighboring businesses in North Park. Went for dinner when it wasn't so busy on a Sunday...until after we were seated, more people showed up. We ordered an appetizer of hummus and pita and shared a Super Greek Combo (Gyros, Souvlaki (one beef skewer) & Spanakopita (slice of traditional spinach pie) with pita, rice pilaf and Greek salad. This dish is perfect for two people. The Greek salad had a big slice of feta cheese on top, not crumbled in the salad. Aside from the DIY feta, this combo platter was very yummy! This cafe also serves breakfast and lunch. Great place to get your Greek food on!"], ["Mike N.", "This place is my favorite Greek place.  My husband and I come here once a week, the waitresses know us and always greet us with two glasses of iced tea, followed by \"Would you like your usual?\"  It's great.I always get the falafel platter, which comes with a simple salad, rice pilaf and pita bread.  The falafels are the best I've ever had.  I've never had a falafel that compares with theirs.  My husband usually gets the Gyro and Chicken platter, which is equally delicious.Looking for great Greek in a homey atmosphere?  Come here!"], ["Aaron H.", "What a pleasant surprise! I don't think this place gets enough attention and recognition because of it's location and the places that surround it. Someone told me awhile a go to stay away from here. When I remember who that person is, they're getting a punch in the mouth. That's what it feels like from being neglected from going here that long.Tiny little older school feel in this place, but nostalgic and cool. Good amount of people in here so it's starting to get my hopes up and I love Greek food. Super nice waitress seats me handling this entire place and take out orders with grace and never ending smile. It was impressive to see her hit 4 tables in one swoop.I got the mousaka plate. Looks amazing and tastes even better. Wish the mousaka portion was a little larger, but it was absolutely delicious. Big serving of rice done right. The salad they put some attention in to. Very fresh and put together with care and the perfect amount of dressing. I really appreciate when places can do this even when they're busy. The bread is fresh and tasty as well. Perfect temperature and texture. You can't lose going here. I'll be back soon. Gotta respect the range on the menu."], ["Aline M.", "Definitely a mom and pop shop. This place is amazing. I had the gyros plate and the portion was very generous. The service is GREAT!! The owner is soooo nice and cares so much about his restaurant. Most people seem like regulars and the owner checks on every table. I'm  Very attentive. An added benefit is the owner's son who works the cash register and slightly resembles a Greek god."], ["Andy A.", "This place has amazing food at reasonable prices. It looks like an old school diner, and it'd be easy to pass it right by it. Do yourself a favor and go in to try it."], ["M D.", "This isn't the best Greek food I've ever had, but pretty close. I am a huge Greek food lover and have tried it around Europe and the states. This place will make you very happy. Their chicken kabobs are heavenly and their rice taste like someone's mother made it (maybe that's the case). I order take out a lot from here. The only advice I would give to them, is to lighten up on the phone. Their customer service skills aren't as great as their food, but I'm willing to look past it because the food is worth it."], ["Darci D.", "I absolutely love this place! Chicken breast salad is one of the few salads I will actually go to a restaurant for. Lamb shank is also very good and so is the 1/2 chicken plate. Their lemon potatoes are great! Staff is always very friendly and I like how casual it is. Portions and prices are right. You can never go wrong with the chicken, it's always very tender and flavorful."], ["Huyen N.", "Hmmm really want to give Olympic a 4.5 stars but it is not quite a 5 so I'm going with the 4.Great place for gyros wrap, sal-d, and fresh pita bread. I often get the gyro plate and that would get me almost two meals. Lunch combo with sandwich and a choice of fries or soup is a great deal. Will miss living right around the corner from this cafe."], ["Ellie A.", "Great spot for breakfast. My family and I have been coming here for years! I always order the spinach and feta scramble. It's big enough to share! They also have delcicious French toast."], ["Cole J.", "We were looking for Greek faire, and had passed Olymique Cafe many times.  We are so glad we finally made it in. Tender steak souvlaki and feather light spanikopita. Fantastic.  We will revisit soon."], ["Brit M.", "Another great dinner finished.  I love the kabob plate, always fresh items!  A very easy place to enjoy a great meal.  Family owned and operated!  You will always a family member working, multiple generations!Easy to get to, easy to park, easy to be comfortable!Try the chocolate covered pretzel rods when Mom has them out!!"], ["Rachel S.", "i love this place.  went earlier this week and had the gyro and chicken kabob plate.  out of this world delicious!  the leftovers were good too.  today i had the lamb shank daily special.  the lady told me they had just taken it out of the oven after cooking for hours.  it was spectacular.  the deserts look really good, i haven't been able to try any of those.  i'd recommend this little north park gem to anybody looking for yummy greek food.  opa!!"], ["Nhan N.", "Been going here for years.  Love Rosa and her sister.  They are always super Nice and hard working.  Food is above average. Cheap prices. Horrible decor and old."], ["Cody A.", "Food is great .... The people working their r good.. But i would have given a 5 . but they didnt make my gf's . good . but i forgive them."], ["Brittney B.", "I love Olympic cafe. Very mom and pop, great service and the best Greek food I've ever had. Large servings too!! The desserts are out of this world."]]}