{"Tandoor": [["jen p.", "I used to come here all the time, and I need to start coming for lunch again. Why? The prices are great, first off. Chicken Vindaloo combo (rice, dal, raita and some naan) for under 8 dollars. What? Yep. And it tastes good too? Yep, it does. They have some cayenne on the counter, so you can spice your food more if you need to. I have always experienced fresh and tasty naan here as well. The people that run this place have always been very kind, and I am happy to have seen them doing brisk lunchtime business. Thanks!"], ["Nae P.", "I dont have much experience with Indian food but I really do love Tandoori chicken and chicken masala and I discovered my love for the cucumber yogurt salad (Raita) at this place. The quality is good enough, but I do wish the Tandoori chicken was a tad bit more spicy and more of that tandoori flavor with all its lovely seasonings, besides the somewhat deceiving strong color, it kind of lacks in that authentic Tandoori flavor. The pricing is ok. It's pretty good but at the same time the flavors are not really strong enough for me, I think they go too light with the spices. Overall I still kinda like this place and the food is good enough."], ["Ananthaprakash N.", "Good Indian food with mango lessi. Good choices in down town. Try chicken briyani too"], ["Santiago T.", "Excellent!can't go wrong, the meal's come complete.I love the palak paneer!Dal reminds me of my moms home made dal! Yumm"], ["Jeff B.", "Ordered the lunch special - it looked pretty sloppy on the plate, the rice was overcooked, the side dish was cold, and I requested 10+ spice, which I expected to have a considerable amount of heat, but it tasted pretty mild. I left a 20% tip (you pay first) so I expected decent service - but they didn't bring my food to the table AND they forget the Naan!!! I had to remind them about it. Only giving them a two because of the free drink refills and the Naan was actually pretty good when I finally received it."], ["Simon J.", "Have been going there for over a year now, and the curries are typically good. However, last night I saw through an open door into the kitchen a giant bottle of red food coloring. The bottle was almost empty. I don't know if this is a common practice, but the tandoori chicken looks like it had been collared red with artificial dye. That is not cool, as typically Tumerick powder or papeika can be used to alter the color without resorting to artificial dyes.Also, when I eat their Indian dishes like saag paneer, they have a lot of curry sauce but very little cubes of cheese. It feels like they are stingy with the cubes of cheese.Beside from the food coloring and the stinginess with the cubes of cheese, I like the food, the people are friendly, and I would go back."], ["H D.", "Chicken Tikka Masala is my favorite. The combos are a good balance with meat, daal, rice and yogurt with half a naan. Wish it was one full naan."], ["Sierra W.", "I love this place! The prices are very fair and the flavor is top notch! Maybe I'm a spice baby, but when I asked for medium spice on my chicken tikka masala my mouth was on FIRE! But it was to die for! I could eat the naan all day long. I will be a regular here :)"], ["Ray G.", "This is the best Indian food I found in San Diego for the price by far. I have been going there since they opened and the food quality has not changed and the portion sizes are always generous. It's a family owned business and once you get to know them they are very warm and friendly. They atmosphere is very regular it is located in a shopping center so it's not anything fancy but if you'd like to impress a girl with some delicious food for lunch or even something very casual for dinner I highly recommend this place. Everything is excellent on the menu but they probably have the best tiki masala and lamb vindaloo I've ever had in my life. do yourself a favor and stop by and have a meal very affordable very friendly large generous portions."], ["Jerry A.", "Have to make sure to thank the people at Tandoor for their great food and beyond-friendly interaction.  They've always treated me  well and I've never left unsatisfied or unwelcome.  And a favorite place for me to order samosas for parties.   They are so kind and accommodating!  I thank them for their generosity."], ["Elizabeth V.", "I'm that person who never gets sick, but when I do, my illness makes the Bubonic Plague run for cover.  Enter Tandoor. I discovered Tandoor in law school, when my sniffles needed healing like yesterday, because I can't afford any downtime in this cutthroat environment. My requests were on a short list: very spicy curry, allows take out, priced extra cheap. 4 years later I am still returning to Tandoor because their hot curry never fails to make my ears whistle and the $6 huge plate of food can't be bested in the typically expensive Mission Valley area.  Everything on the menu tastes sort of the same to me - hello it's Indian!  And the highlighter-yellow wall will pretty much give you a seizure when you first look at it but the food is tasty and I can get 3 meals out of it unless I'm a fatty that day and I feel like taking a bath in my curry.  This has happened.  Best naan of my life."], ["Glenn B.", "I ate here yesterday & had the chicken vindaloo. It was so good I got an additional order to go!"], ["Antonio G.", "Washing my hands, walked past the prep area on the other side of where they cook and saw lots of raw chicken just on the side of the sink!  Not in a tub and many many lbs of it!  I think a young guy was going to cut it and move it to a proper container.  Gross. next to that we're at least 15 large bags of raw chicken inside of bags just on the right side and NOT in a refrigerator. Why wouldn't they unpack it from a box and put it straight into the fridge?!  Holy shit. Too bad this was discovered AFTER I ate.  I worked in a restaurant when I was younger, there is no need for all that much chicken to be out in the danger zone at one time.  Scary.  Salmonella, E. coli, bacteria, sink scum... I know I'm forgetting a few, but you can guess what's all over the side of that sink and growing on that chicken being left out.  And I saw a fly buzzing around, perfect... Absolutely wrong.  Too bad, the cook is pretty good and the family is nice.  I guess when there's no health inspector around they do whatever shortcuts they want and ignore food safety protocol.  I showed my husband, he was appalled as well, will never eat there again.  Eating bad chicken, is the worst sickness imaginable I've heard.  Worse than eating bad beef."], ["Nawal H.", "Yum! Really amazing food...even my Punjabi husband gave them props. One of the workers was kind enough to give us very detailed and accurate directions on how to get there. Excellent customer service and fantastic food :)"], ["F.C. C.", "I love Indian food and eat at three restaurants in the Indian commercial area off Miramar Road often. But even though I have lived nearby for four years and would appreciate the convenience, I never went to eat at Tandoor until tonight.That's because one friend said the food was bland. And because a couple I know went there and ordered one garlic naan and one regular naan, and both pieces tasted and looked exactly the same, but the older man behind the counter told them they were wrong, and wouldn't let the waitress give them a garlic naan.Maybe he was right, Or maybe he's just a surly type who shouldn't be in customer service.I decided to give Tandoor a shot tonight because it was getting late and I was really craving the idea of lamb curry or lamb vindaloo.I went in and all but one of the six or seven tables were occupied. The one that wasn't occupied had a drink, a coat and a newspaper on it. It looked like an Indian paper, and like a restaurant employee had been sitting there until a late rush.I asked the woman behind the counter if I could sit at that table, and if someone could clean it up. She looked to a bearded white-haired man, who shook his head no. I directly asked him: \"So I can't use a table that no one is using?\"And he wouldn't look at me, but he looked at his female co-worker and shook his head again.Super, super, super customer service."], ["Alex V.", "Best fast Indian restaurant in the area!They make individual entrees to order, and they're always delicious and at the perfect level of spiciness. On weekends, their brunch buffet is an incredible deal, with plenty of vegetarian and several meat options for less than $10.The owners are very friendly and seem to actually care about the food they make, plus you can see the actual stone oven they use right behind the counter.My favorites are the chana masala and saag paneer, medium-hot, with a side of garlic naan. Very filling and very flavorful!"], ["Jason H.", "Great tasting Indian food! Their chicken masala is very good Their naan bread is amazing! They roll their doe fresh! Oh and the entire family that works their are all very nice  :)A must try!"], ["Brandon Y.", "This place sucks. The food has no flavor at all. Not only that but parking lot is difficult to maneuver and crowded. Stick with Monsoon Express in the mall. The food quality is better,  you get more for the money, and is a lot more flavorful."], ["Amy S.", "This is the only place that I have eaten Indian at. So, my review maybe somewhat limited on the options out there or comparing to other places. The service is spot on. They are attentive and accommodating. Will seriously answer any questions you may have. The food is great! I wish the ratio of rice to palak paneer was a little bit more equal (lots of rice) but the flavor is outstanding. If you want to have some of the best naan of your life, you should order it here. They make it fresh right in front of you. Both the regular naan and the garlic naan are to die for. Warm, doughy and crispy at the same time. I'm in love. Try it. You'll love it!"], ["Joaquin L.", "Used to come here frequently many, many, years ago before Indian food was popular and started appearing everywhere.  Food is pretty good and tasty.  This evening, we opted for the all you can eat (AYCE) buffet special $9 which tasted very good for AYCE.  Everything was properly cooked, nothing under done or over-cooked.  So the cooks here are pretty talented and have good technique.  Flavors were pretty good.  I liked the vegetarian dishes better from a flavor perspective and I typically prefer protein dishes more.  The lentils, spinach and paneer (cheese), and garlic naan were amazing.  The chicken curry sauce was very good, but the chicken pieces were just good.  The samosas weren't crispy as they got soft from sitting there, common problem with AYCE fried food.  The tandoori chicken while flavorful, dried out a bit from sitting there.  I would definitely come back and eat here again if craving Indian food and needed to be in Mission Valley."]], "Cafe India": [["Shane M.", "This place has great food and customer service. Im suprised this place is not alot busier.  Cafe india is one of my favorite places in this area."], ["Joanne B.", "Absolutely delicious. Great for vegetarians and meat eaters alike. Varied menu, food was good quality and service was good. Look forward to coming back to try out more dishes."], ["Veena G.", "I may be exaggerating by giving this place 5 stars. I like their lunch buffet. I think the food in the buffet is well made, but needs a little more variety. I wonder if the lack of variety is due to them not having a lot of customers. This place does give me kind of a sad feeling, like I wish they were doing better. The waiters always seem very nice and attentive and the food is good, so I'm rooting for them to succeed."], ["Steve W.", "Hadn't been here in awhile and we could tell althought the food was good it was a bit different since we had last been there.  I can't really say if it was better or worse, just different.  Food and service was great. We used the yelp coupon and we noticed no change in service quality, we were nice to the server and she was nice in return.  Of course we tipped on the pre-coupon dinner charge and then some. We will return"], ["CE G.", "Really good service and nice selection of food."], ["R B.", "The food was great! Gobi Paratha is killer. Chicken Momo is so good. Shahi Paneer is wonderful. Super food, charming decor, we had a great time!"], ["Ron R.", "I just discovered Cafe India today. It has an excellent environment inside with lots of Tibetan prayer flags, colorful bunting and photographs of important historical sites in Nepal. The soothing music set the mood for a relaxing lunch time.  I tried the buffet at a reasonable $9.95.  It's made fairly mild with at least two spicy sauces on the side - the perfect mint sauce and a \"911\" grade of chili sauce for those who need more \"kick.\"  This is not your typical sloppy Indian restaurant (sorry). The owner is Nepali and is very friendly, attentive and has done a lot to make the cafe a enjoyable experience.  I'll be back for dinner sometime soon."], ["Dolores R.", "We went to this restaurant but we had a terrible time trying to find it. We looked direcctions trought Yelp it kept taking us to the wrong address..??? so I called the restaurant and the guy said, \"we are behing Red Lobster\"...good! we were about to go somewhere else.Sadly the restaurant was empty, I think people has a hard time finding this place. Food was delicious, service was great an will come back soon now that I know how to get there...Loved this place..."], ["Airee K.", "I came here twice before. Most recent time I ordered the Daal soup, Chicken Korma, and Kabuli Naan. I wanted to try the Veggie Momo but they said they ran out (weekday evening). The food was pretty good, but for me personally the soup was a little too salty for me (but I eat more bland than most people), and the Kabuli Naan had too much butter (also, personal preference). Other than that, food was good. First time I ate here, I ordered the Chicken Biryani and the Channa Masala. The biryani was not memorable, but the channa masala was better. Both times I've visited, service was sub-par. It wasn't horrible service, but both servers could use some upbeat energy. It made me whole meal experience a bit sad. But, food itself was decent, but nothing quite memorable for me to come back on a regular basis."], ["Warren H.", "I do recommend the place.Hey,I'm a homeowner next to it,and my husband is normally long-term deployed on the US Navy orders,so,i have to get my depressed bum out of my kitchen,where I'm cooking just for myself and our dog,so i always try to eat something healthy,like Asian or Mediterranean  or Mexican rather than Wendy's,McDonald's and other junk food around.I'm Caucasian,by the way,like white/blonde American,but never overweight in my whole life.I'm actually a model.Royal India cafe is such a nice and single lady friendly,it's relaxing atmosphere,meditating lights and music,very clean restrooms and reasonable priced healthy choice menu,they,guys serving really fast and care about my needs during the whole visit.Tandoori chicken is delicious,I also love their goat lamb curry,yam-yam!Fish curry tastes so good with the herbs blend,i normally order all the dishes not spicy,cause herbs blend create the natural spices taste and easy on digestion.They also offer me deals,like get one free,20% off the bill and such,i love it,i get out with bunch of to go boxes for the next couple of days and it does smell good in the fridge.So,why four stars?I'm just a sushi eater,that's why.Otherwise,it's perfect Indian cuisine,delicious curry,amazingly tasting sizzlers and great service and atmosphere,i love it!i go there every week,cause eating sushi every week is kinda expensive for my budget,however Indian cooking is a good healthy diet replacement with their herbal blend and curry antioxidant sauce,yam-yam!!"], ["Haley S.", "Fantastic! I am hooked.I have been happy with the service here during my multiple visits.The menu is well organized and explains each dish superbly. Plus, your server is happy to help you understand what you're ordering.They are very good about their spice levels, although I think they might use a five point scale, not ten. I will ask next time.I always get very little spice, and my husband gets a medium. He says it's on par every time.The dishes are excellent! I'm a big fan of the Veggie Tikka Masala, but there's plenty of vegetarian options for me to branch out.The meat options are plentiful as well. They also have a good variety of naan.I have yet to try the buffet.Prices are absolutely fair for the amount and quality. The Yelp deal is just the cherry on top!Portions are satisfying, leaving me with just enough extra to bring home. My husband finishes his whole meal happily.This will continue to be my favorite Indian restaurant.(Oh, and the decor is lovely too. As an odd additional fact, I appreciate that their ladies' room has a purse hook and full length mirror. Someone actually thought about it!)"], ["Edward I.", "Finally!!!! An Indian place that makes it as hot as I like! Pretty stoked to find Indian so close to home too. Also, as we walked up, I told my girlfriend not to expect much in décor, as Indian places tend to be tucked away in forgotten mini-malls of the '80s, and this place looked to be the same (in behind Phil's and Red Lobster). When we walked in, however, it was a nice change of pace from the usual. Tastefully done, well lit, nicely greeted, and no huge bigscreen belting out Bolliwood movies. The two guys servicing the place were super nice, helpful, and attentive without being bothersome. We started with veggie samosas, a few orders of naan, and two orders of chicken tikka. TWO, you ask? Yeah. Turns out the only person in our house, that can handle the HOT food I can....is the dog. So, if the same thing looks appealing to us, my girlfriend has to order a milder version, or else her face burns off. It's kind of a bummer because we go home with lots of leftovers, but at least I can order things past 10, especially when I think they'll really cook it that way. The other thing I notice, is that places where they are really going to give it to you hot often test you with little treats to see if you can handle it, and they also laugh at you when you tell them you want it as hot as they eat it. This place was no exception. Guy looks at me, and goes, \"Really??\", \"Are you sure? Because, it's really hot.\" When I told him I wanted it redder than the tablecloth, he finally understood. What was really cool, is that he brought me some sort of chili paste that was hotter than the sun, in a genuine interest of me trying something new. It was amazing and I ate it on everything that was put in front of me. The samosas were amazing. Flaky, steaming hot, and with a wonderful flavor. The Tikka was equally good, with really high quality white meat chicken, a glorious sauce, and plenty of it. Rice was the same, and although the naan was not as fluffy as what I'm familiar with, it was good in its own way. One thing I realized, if that you're not in the mood to drink, as I wasn't, order yourself a Coke. For some reason, it just fits and was one of the best Cokes I've ever had.I would actually drive to eat here, which is more than I can say of many Indian places in town. The prices are extremely reasonable. The service is great. The food, most importantly, tastes fresh, and is cooked with pride and creativity. It's worth a shot if you are anywhere nearby, and is some of the best food in Sports Park area, if you ask me. Nice work, guys!"], ["Genesis G.", "First time eatting Indian and it was grate. The  price was responsible and the food was beyond the price."], ["Megan G.", "I cannot begin to express how disappointed I was to go to cafe India an establishment I have been going to since 1996 to enjoy a delicious vegan buffet only to find out the ownership changed and with that the food had as well. The Dal was always my favorite and I could tell just by looking at it something was not right. They only had one vegan option on the buffet and one vegetarian. Please tell me the old owners are at a new location."], ["Rachit D.", "Went for buffet. Very limited vegetarian options, had to order off menu which wasn't good either. Service is slow, even had to ask for ice to add to the warm water they serve. Don't recommend"], ["Marissa M.", "The buffet is heaven and the service is amazing!"], ["P C.", "Charged me full price on a 10 yrs old when the menu clearly states $5.50 10 yrs old and under. I showed the owner the menu and she disagreed with me. Buffet food selection is very poo and very watery. I gave it one star for naan bread which was decent but arrived really late.Service is not good.Sounded good on paper but don't bother!"], ["Helen H.", "My first time at this restaurant. I am a big fan of Indian food, have traveled in India, and eaten in many of the Indian restaurants in Melbourne, my hometown :)For three of us we ordered Dahl tadka, saag paneer (the cheese was homemade) and goat curry, plus some raita, steamed rice, one plain naan.The naan and the saag paneer were standouts, among the best I've eaten outside India. The rest of the food was probably 4 out of 5. But the prices were very reasonable, service was excellent, servings on the generous side, the staff friendly and helpful. Ambiance nice AND they provide cloth tablecloths and napkins, which I love.That's good enough for me to give an overall 5 stars for this visit.Hope you try it and enjoy as much as we did!"], ["Jibu K.", "Nice food and very good hospitality.  very close to Wyndham hotel and I did multiple visits.. highly recomended!!"], ["Paulie B.", "Tucked away in the corner of the strip mall where the hideous Phil's BBQ cows to slaughter place is, you will find this jewel of Thai food, Cafe India. The service is attentive, the food is spicy and delightful, and I am a returning customer. The buffet is reasonably stocked, and the seating intimate. You'll be back!"], ["Victoria P.", "Excellent Indian food. Great prices. Even allowed us to try samples of the saag and tandoori. The veggie momo was delicious. Would definitely come here again."], ["Mara S.", "Me and my husband have been to every indian food place in San Diego. India food is my favorite cuisine, and cafe india is the best one. We go here at least once a month and I have no complaints. The food is exceptional, the service is amazing. The people are awesome and we feel so at home here. If you want indian, COME TO CAFE INDIA!!!"], ["brian i.", "This used to be a great \"hole in the wall\"BUT NOT ANYMORE!!- Bad service, small portions, & argumentative owners.- I witnessed an argument between the owners &  a customer on my LAST visit. Regardless of who was right, after the customer & his family stormed out (leaving their \"unacceptable\" meals untouched), the owners proceeded to audibly discuss the disagreement w/ another table of customers nearby. Such a huge turnoff. -The food isn't worth the lousy experience."], ["Lyndsi W.", "It was decent Indian Food.  Wouldn't rush back here wouldn't say no if someone asked to go.  Felt pretty neutral about it.  Had the Chicken Vindaloo, samosas, and a dish with cauliflower and peas which was good and different than something I usually would try.  The heat level was good with what we asked for."], ["Joanie S.", "I love this place.  The tikka masala is to die for.   The staff is awesome, so friendly and GREAT COOKS!!!!!!   A little off the beaten path.  Just go into the parking lot near Phil's Barbeque and it's in the back.  SOOOO GOOD!!!"], ["Chris S.", "Great staff"], ["Courtney C.", "I really wanted to like this place. I even trusted my foodie friend that this place was supposedly really good - she says it met her standards.I've had the buffet twice, the first time was better, since they did have navratan korma, which is my favorite Indian dish. It was a little watery, not too many vegetables. The naan is very good, but not the best. The second time I went, I was a little more disappointed. Maybe because it was a busy night, I don't know. The chana masala was just garbanzo beans and a tomato paste, which was seriously disappointing. Their chai masala tea is very very good though. I don't need to add anything to it. The only real thing that bothers me is that the buffet doesn't - or hasn't, in my experience - offered plain jasmine rice. I like rice as a delivery device for my sauce and it doesn't need to have all that jazz added to it."], ["Ganesh B.", "I am giving 4 stars and not 5 only because I have been there only once and have not tried a lot of food. However I do not get easily impressed about Indian food but this place is like finding an oasis in a dessert. I recently moved to PB and was actively searching for a decent Indian place. This place seems to have it all. The tomato soup was really good. And the Chicken Vindaloo curry was perfect. I had the curry with rice which had a very nice jeera flavor to it. I had asked for the curry to be on the spicier side and the curry was perfect to made to my request. Would definitely go back for more."], ["Charlie K.", "Had the buffet,i had a taste of everything on the buffet bar and liked it all, service was friendly.If I need the want for Indian food ill go back."], ["Ruslan M.", "Good deal, friendly service, it was flavorful and tasty"], ["Gary C.", "My wife and I just went there tonight, based on the reviewers who liked it. (It seems everyone either loves it or hates it).We called ahead to order the naan, since everyone says it doesn't come until the end. I ordered garlic naan and onion kulcha, but they brought us garlic and onion naan. Believe it or not, it didn't come until we had finished our first plate of food! Luckily, we wanted more! Now, based on what people had said, I was expecting fantastic garlic naan. But it was just so-so. It seemed like it could have been cooked a little longer. I ordered a Yeti beer and they brought me Taj Mahal. So, ok, two things a little off. We had the buffet - the dal, as someone mentioned before, was great. The \"yellow rice\" (can you say \"saffron\"??) was very good, the alu gobi was great, the navrataan korma and the mushroom curry were just ok. So, whereas I wish I could give this place one star so they would offer me a free meal like they have the other doubters, I can't! It was much better than that, but it wasn't excellent. So I gave it three stars. I don't think I would go out of my way to go there again, but it was perfectly acceptable. We are having a staycation nearby, so it was convenient. If I go again, I will definitely try the menu."], ["Karen P.", "my son and I have been going to this place for years & years and even though I think it's under new management, it hasn't skipped a beat with great food, friendly service, and what I love most of all, they don't rush you out of the door."], ["Deborah N.", "We love going to Cafe India. It's right down the hill from us so it's easy to get there and home again. The food is authentic Indian cuisine and Meera, (the owner, hostess and wait staff) is so very sweet. She has an amazing memory and always gets our order perfect, even though she does it all by memory. This family has been serving San Diego for decades. They work to keep the fat, salt and sugar at a minimum (the things that American palates are so addicted to but that lead to high blood pressure, diabetes and obesity!). I'm not sure what a previous reviewer was talking about with the \"yellow rice\" but the rice has always been perfect. Perhaps an off day?They have so many vegetarian options and the Paneer Tikka Masala is so good we wanted to lick the serving dish. The Kofta Curry is like no other and the buffet always pleases.The only challenge is parking on a weekend night with Phil's BBQ customers filling up the lot. We'd drive around the parking lot waiting for an open spot or park in the street a couple of blocks away if we needed to in order to go to Cafe India!!!"], ["Claudia M.", "Food is really good!!! Loved the place. I am glad we just did the level 3 of spiciness :) definitely will come back"], ["Mindy N.", "We've been here many times, it's one of our favorite places for Indian!!!! Our favorite dish is the the Chicken Tikka Masala, but there is many other greats on the menu such as the Paneer Curry & Aloo Palak to name a couple!!! Some of our fav appetizers are the Samosas & Pakoras!!! This time we tried the Aloo Tikki, fantastic as well!!! Their naan is perfect, we usually get garlic. The owners, a husband and wife team, are so sweet and take pride in you enjoying their delicious food. They're usually there at the restaurant to greet you! Highly recommend this place!!"], ["Faith O.", "Great food, and great service.The staff is caring and very attentive!!!Basically recommend this place!"], ["Foodlover V.", "Food is too oily and taste is ok. We ordered Aloo palak, which was better than chaan masala n paneet butter was the worst. Not going back again. I was craving for good Indian food but what I got was very disappointing:("], ["Shaun T.", "Delicious! We got a large beer to share. Ordered the Shrimp Vindaloo and Goat Curry. Delicious food. Garlic naan was perfect and so was the rice. Used the Yelp deal and got $20 for $10. The meal was still a little expensive but very good."], ["Michael B.", "This is the worst Indian food I have ever tasted. Perhaps I have high expectations because I've eaten a lot of really good Indian food, but this was truly terrible. I will not be back.I went to eat here after getting my hair done at Salon Soulé next door and I was excited. Indian food is my favorite (when prepared right). Immediately upon walking in the door I noticed it was REALLY hot inside the restaurant. I was seated by the hostess who took my bread and drink order and then told me to go help myself at the buffet.My first impression was of this big pan of yellow mush. The sign said it was rice. It looked like they put 2x to 3x too much water and still decided to serve it to customers...Basmati Rice is supposed to be dry. Even I know this and I'm a \"gora\". Since this is all the rice there was I decided to get some...and have an open mind about it. Maybe it's supposed to be that way? Next I got some Chicken Vindaloo and Aallo Anday. These looked safe, I mean how can you mess up potatoes and chicken? Again, even I can cook those and I'm a white boy. Well these were terrible too. The Chicken Vindaloo had hardly any meat - it was all bones. And absolutely no flavor. It was like chicken in watered down tomato sauce. And the Aallo Anday also didn't taste like anything. It was like eating boiled potatoes that weren't cooked all of the way in some kind of bland gravy.I choked down what I could of this and went back to try different dishes. I decided to skip the yellow mush this time and instead got some Daal soup and some vegetable korma. The Daal soup was actually good - like everything else they didn't put ANY spice in it - I guess they were scared of Americans complaining it is too hot? - but the vegetable korma was terrible. It was sweet rather than spicy or gingery. There were chunks of something in it...it didn't taste like paneer or tofu...so who knows what it was.I gave up on trying anything else at this point. As I finished my last few bites of Daal soup, my bread finally came. The rotti bread was actually good. Too bad it didn't come until I was done eating. While all of this took place, the health inspector was in the kitchen with the hostess. Makes you wonder...Run away from this place and go to Village Indian in Clairemont if you want to eat Indian food that is both edible and tastes good."], ["Stu B.", "Hate to leave a bad review on a small place like this that looks to be family owned but this place was awful. Felt ripped off for what we paid and there was mold in the cucumbers. Never going there again."]], "Taste of the Himalayas": [["Nina M.", "Total disappointment this place used to be one of my favorites*Staff is not friendly at all *Silverware was dirty *Food Had no taste at all *We order garlic naan and i did not taste the garlic at all *Food portions are small and pricey *Waitress forgot our drinks"], ["Carlos A.", "Camr here on a whim and realized it was a good choice once thet soup came in. It only got better om there. I ordered the nammy naan best bread I have ever had came with almonds fennel tomatoes  and spices  it was amazing then the curry came and it was bu far one of the best. Survice was good. It was what I expected for an indian restaurant.  I recommend  anything  lamb. I look forward to coming back"], ["Mo D.", "I really like the food there. Their Daal Soup is great and so are the momos. The food is very authentic. And a great lunch menu and deal."], ["Garrett Kaeo W.", "Came here for a early dinner. Great little place. There was only one of couple (with a young child) in the restaurant. Sat down and flipped threw the menu. I really like Indian  food (everything from that region) so I already knew what I wanted to order. My girlfriend didn't really know so i order for the both of use. I ordered the naan of the month, Himalayan biryani spice level 7 (the lady doesn't like it too spicy), and the lamb moms.Everything was amazing. I really enjoyed the meal, and glad my girlfriend did too. The only difference is that I would order the lamb biryani, just because there wasn't that much meat in it, and I really love the taste of lamb.Overall this place is great and I can't wait to come back for more."], ["Connor G.", "I grew up in San Diego and had never has Indian food. When I moved up to the Bay Area for college, I got hooked. When I moved back to San Diego I struggled to find a place up to par, but this place finally fits the bill. Every meal comes with a daal (lentil) soup, which I think is one of the best parts of the meal. Some other dishes I typically order are the chicken tikka masala (tomato curryish sauce), paneer (cheese cubes) tikka masala, some kind of biryani (seasoned rice with goodies), and maybe a channa masala (garbanzo beans). All of these go great with naan (preferably garlic), in fact don't eat them without naan! This places spicy scale is also off the charts. I am a huge fan of spicy food and I would like to think that I have a pretty high tolerance, but I don't know if I would enjoy higher than a 4. Don't be a hero! Order 4 or less on the spicy scale...trust me. If the food is too spicy (or even if it's not) make sure you order a mango lassi (mango yogurt drink) to cool you off."], ["Mel T.", "Came here for dinner last night and I must say, this place is legit.  I haven't had indian food in years, but this is definitely my first time having authentic indian food and it was a good experience.  We ordered the lamb vindaloo and the chicken tikka masala served with naan or rice. One word. GOOD. They were delicious! I think I liked the masala more than the vindaloo though since I like chicken more.  The naan was great - soft and crispy.  They served lentil soup as well. My first time having it and I was not a fan of it.  The portions were small, but don't be fooled.  Trust me, it can fill you up quick especially with all that naan and rice.  I was very impressed with the layout of the restaurant.  Nicely decorated with dim lighting, creating a lovely atmosphere.  Felt really homey and relaxing.  They had tables for groups, couples, and even an area in the back set up for those who wanted to get the full experience and dine indian style. It was really neat.  Great customer service!The parking lot was really cramped and there are barely enough space in between cars to leave. Overall, good experience. Even though I just had it last night, I am already craving for more! Lol. I recommend this place!"], ["SanDiegoSunriser S.", "WARNING! THIS RESTAURANT NO LONGER OFFERS A BUFFET.On their website at tasteofthehimalayassandi… this restaurant displays the following information:  Lunch BuffetA lunch buffet fit for everyone. At $8.95 for all you can eat, this is a definite bang for your buck! An array of dishes - both meat and vegetarian I drove from La Mesa on Monday, March 9, 2015, to partake in the \"buffet.\" Upon entering this establishment, I looked around for the so-called buffet. I did not see any buffet. I then walked up to the front near the cash register and asked, \"Where is the buffet? It says on the website you offer a buffet.\" The woman replied, \"No, we do not offer a buffet. That is an 'old website'.\"Old website? Really? And do you know what False Advertising is? I mean, how difficult is it remove a few lines from an \"old website\"? And where is the \"new\" website?My date and I promptly left, walked across the street to Tandoori, and had a wonderful meal."], ["Joseph Y.", "This restaurant is quite small and sits in a little strip mall off midway, but its a great place to grab Indian / Himalayan food.The service is first rate, they make you feel welcome when you come in, they constantly fill your drinks and make sure you're happy with your order. The food comes out steaming hot and smells amazing.The food its self is great too, they know how to add the spice to make their food nice and spicy, which is great because Indian food should give you a little heat. The bread is great, especially the onion nan. They give you a complimentary dal soup which is a great way to start your meal.Overall, its a quality Indian place for San Diego, defintely stop by and try it out."], ["Dee S.", "First time here because my husband was telling me that this place have best  Indian food in town. I have had Indian food many time and Don't get me wrong The food was amazing I like it but the service SUCK The room in the back need a serious ventilation.. I could barely breath!!! Overall I'm giving this place a 3 stars because the food was good but like I said service just isn't there maybe I will go back aging just for the food and hopefully the service improve and I will come back and give this place a 5 stars!!!"], ["Kimberly L.", "Every time I travel to San Diego, I make it a point to eat here. The staff is incredibly kind and helpful, and each and every item on their menu that we've tried (which is a lot!), has been nothing but extraordinary. Their food is so good that they have completely spoiled me for my expectations for \"Indian food.\" If you are nearby, or even if you aren't, do yourself a favor and check them out!"], ["Nancy T.", "One of my close friends showed me this place and ever since than I loved Indian curry. This place is soooo good! Me and my friend usually go here during their lunch special which is from 11am-3pm. We usually get their chicken tikka masala with rice and garlic naan. I believe the lunch special is around $7-$8 and you get soup, curry of your choosing with rice and naan bread. The chicken tikka masala is delicious especially with the garlic cilantro naan which is a flat bread with garlic and cilantro it's perfect with the curry. The portion doesn't look like it will make you full but it sure does fill me up! The parking lot around this place isn't too big and the parking spaces are pretty tight. But overall I recommend this place to anyone who wants to try some good Indian curry!"], ["Reinke E.", "This place has the best Indian food I've had in San Diego. The garlic/cilantro naan was beyond delicious and fluffy! I would HIGHLY suggest this to anyone looking for a hearty, fulfilling meal. Also the staff is extremely friendly and the atmosphere of the restaurant is very relaxing."], ["Nikunj B.", "Cant give 0 starts. Pros - 1. Sometimes wih luck you get consistent food with right spice levels.Cons1. Horrible service. Even water is served once in the beginning and once in the end.2. Ordered spice level 4. Got spice level 1 million.3. When asked to correct the food they bought same food with more gravy mixed.4. The food was served after 45 mins wait. Not once but both times I visited which compelled me to write this reviwe.5. Not at all friendly staff. Got angry looks when pointed to flaws in food.Frequent eater of indian food outside these people will never ever have my business again."], ["Melissa M.", "Soooo delicious!!! I had the rack of lamb, and I am an extremely picky eater and it was wonderful.  The decor is also very cozy and they have the pillows if u would like to sit cross legged on the floor... They also have regular seating."], ["Heather H.", "wow...so delicious! I went with a friend who was raving about it.  Wow!!!  I had the lunch special at a low 7.95 for a very filling meal.  Started with soup and then enjoyed 2 lunch dishes, rice, and naan.  MMMM.  I was stuffed when I left.  I would recommend the chicken tikka masala.  The flavor on that is indescribable other than, simply amazing.  Please go here and support this business.  It is a great restaurant with great food and a great vibe."], ["Brad B.", "It had been a few years since my last visit, and on a brisk Saturday evening some Nepali/Indian cuisine sounded like the perfect dinner.A few off the less happening details that I remembered were still in place - terrible parking lot and a guaranteed wait at the door. No worries, the reward is sweet (or spicy) and well worth an occasional door ding and twenty agonizing minutes of watching everyone else inside already chowing down. We studied the menu on the outside window and once inside we already had our meal planned. The second the server came to our table we spit out our whole order from drinks, appetizers to entrees. Now it was time to sit and wait... and wait... and wait. In all honestly it probable didn't take more than fifteen minutes before food started to hit the table but the fact that we were so ready for this meal made it feel like an absolute eternity.Lukshya ko Momo (8 Pieces): $9.95Steamed dumplings filled with minced lamb, onion, cilantro, and spices. Served with special Himalayan sauce. So good! Every culture seems to have some type of dumpling and they usually are a pretty safe bet. These did not disappoint and I could lap up the Himalayan sauce like a puppy with a craving for spice. Lamb Tarkari: $11.95Boneless lamb pieces are cooked in Himalayan special sauce with different herbs and spices. Basically a lamb stew that was perfect served over rice and finished off with the garlic herb naan bread.Speaking of...Garlic Herbal Naan: $2.95 Naan with fenugreek, or orgeno and other Himalayan spices. Break away from the usual and give this naan a whirl!Chicken tikka masala: $12.95Boneless chicken breast cubes cooked in special sauce with herbs and spices. As good as any other chicken tikka masala in town but far from an adventurous order - we just wanted an Indian staple on the table.Mixed  Tandoori: $16.95This dish is the combination of marinated chicken, lamb, shrimp, and salmon served on a sizzling platter with onions, carrots, and cabbage. On an Atkins kick in 2014? This is your dish. My buddy ordered this but I couldn't keep my sticky little fingers from stealing off his plate. Believe me, there was plenty to go around!"], ["Sabin S.", "The price is too high for the food that you get. I ordered chicken chili, momo, chicken tikka masala. The food portion that you get by paying more than $12 for any entree you expect those to be a good portion size. The portion that you get is 1/3th of other restaurant serves. I do not know how this restaurant get best in the town. May be it was when they open. They failed to maintain that title. I am never going back to restaurnat again in my life. I am very big fan of authentic nepali and indian dishes. I travel a lot and try lots of restaurant, but this one is one of the worst restaurant."], ["Carlos H.", "Ambiance not good! Taste is good, little slow service as there were 70 people sitting on a Sunday night at 7:30pm. Food is tasting good!"], ["Joniene S.", "Shrimp Tandoori. = Heaven. Okay service. SIt in the big chair if it's your bday."], ["Selphyne B.", "How to articulate the actual greatness of this establishment...it may be the best food I have had, hands down, of any ethnic option! Don't be fooled by the surround area of this gem! It looks like a dump on the wrong side of the tracks at first sight. The inside smells, sights, and welcoming spirit of the staff, will transport you to the Himalayas!We went to this place twice in 2 days because of our wonderful experience. The entire staff was so wonderfully kind and we felt right at home. We were surprised with complimentary soup and smiles all night long! My husband and I can't physically eat much at once and the portions here are generous: the waitress was so concerned that something wasn't right with our food and wanted only to fix it! I felt awful because she didn't believe that it was truly glorious! I wish I could stuff myself here! Every morsels I tested was heavenly! Aromatic and appropriately herbaceous. We ordered quite a variety of menu items each visit in order to test consistency and determine the potential of being regulars. My only complaint is actually a wish: that the vegetable pakora was actually a variety of vegetables, which is what I'm used to, rather than the same blend for each bit. Absolutely delicious as is! The lentil soup is incredibly smooth and packed full of flavors! My new favorite food to eat: vegetable momo. TO DIE FOR! They are a dumpling similar to Japanese gyoza and this particular flavor was full of minced cashew, herbs, and a variety of chopped vegetables. Truly wonderful despite its affect on me (I get greedy!)! We tried several different naan: cilantro garlic, garlic and herbs, plain, and onion. The cilantro garlic and onion varieties were our favorites. Balanced flavor and texture! You do need to request chutney to accompany the naan! For our entrees we shared a tandoor salmon well done: the vegetables were excellently prepared, al dente which is how I enjoy my vegetables best. They were not oily and were a fresh accompaniment to the protein! The fish was cooked as I requested and had a marvelous char and was succulent and moist! I was pleasantly surprised at the reheating value the next couple of days! The other entree we shared was a level 7 spice of cauliflower in a tomato curry sauce (can't recall the exact name), MAGNIFICENT! This was far too spicy for me by day 3 of leftover status. Still ate it like a champ. The naan were delicious in all flavors, though, the cilantro garlic and onion tied for favorite! We loved this place so much we returned with friends the following day! Everyone left stuffed and ensnared by our new regular place! So happy to start out our move to California with such great food!"]], "World Curry": [["Jay D.", "I've been here multiple times and have never had a bad experience. I usually get the keema curried chicken dish with the garlic naan. The regular portion is more than enough food and I usually have enough for leftovers. With the added side salad, you'll never go hungry here. Taking into account the service, quality of food, and portion size, it's hard to go wrong here. Add to the fact, they have frequent BOGO and Groupon type deals to make it an even better value, I'll keep coming back again and again."], ["Mi W.", "The quality of the food has gone down and the service is abysmal.   Just recently got two orders to go, a large green curry and large Bali beef.  It took about 15 minutes for the food to arrive to go.  Once home we got to eat, the salad that comes with the meals was really browning and it was not the dressing that caused the salad to go brown, the dressing is in a small container.The green curry was good, but the Bali beef was terrible.  There was zero seasoning in the tub.  The beef was in just water, no flavor, no hot sauce that they usually dump at the bottom of the plastic tub of curry.  Just was totally soggy water logged beef.  You could tell by the appearance there was no rendang seasoning.I went back last evening to exchange the Bali beef because it was inedible and $12.99, prices have gone up considerably.   There was a long line and totally disorganized. The woman at the register did not know what to do and said I need to wait for the manager.   Finally after about 8 minutes the manager came to the register and ask what I would like to order.  I said I had ordered 2 large entrees to go 2 nights ago and he looked puzzled and odd.   I said the Bali beef was terrible and not seasoned.  I asked him to look at it, but he didn't care to (really wanted him to see that it had no seasoning and the beef was sitting in water), he said  he will offer free food for another time.  I asked just for them to exchange it tonight.  About 10 minutes later he gave the food and said he hopes it is better this time.I should have looked at the food before I left, but was waiting for so long and there was no seating for customers wait while getting take-out or waiting for a table and I had been there a while to try to get it straightened out.  The bali beef was the wrong size regular size and not large as ordered and there was 1/4\" of oil on top of the beef, but it did have rendang seasoning this time.  So disappointing.  Doesn't seem the restaurant cares anymore about customers nor want to serve edible quality food."], ["Emily L.", "I came here with my boyfriend and the first thing I noticed was how clean the restaurant is. The menu in front of the entrance showed pictures/prices of the food they offer and most of them looked pretty good.I ordered the vindaloo (Indian) curry and my boyfriend got the Bali beef-- both in regular portions. We also got the garlic naan which was the BEST part of the meal. It satisfied our tastebuds 100%. The vindaloo has a set spice level of very spicy and it was true to its spice level. It was also tangy, sweet and spicy just like how the description said it would be and I thought it was pretty good. But I'm not a huge fan of it. The Bali beef was a different flavor entirely and it had a coconut flavor to it which made it taste creamy and smooth unlike the vindaloo. Both curries came with salad which was salty due to the dressing they used.The regular portions were good enough for one meal and I couldn't finish the last 20% of it. Each spoonful of rice is accompanied by a spoonful of the curry basically. I used a Groupon that was $20 worth and the check came out to be $4 without tip. I might come back here again to try the other curries if I'm around in the PB area."], ["Brick W.", "Went here for dinner because they had Phaal.  They were nice enough to give us a sample before we ordered it.  Sadly it was not that great.  It just didn't taste very good I didn't think.  It was spicy but it's gotta taste good as well.  All in all it's an ok place if you're close to it  But I wouldn't make a special trip."], ["Auto Detailing D.", "Man! If can smell the dish Igot you would stop what your doing and meet me here. The food is amazing. I being coming to this place for years and the food and service is always outstanding. Not the cheapest place in town but it's worth it."], ["Miguel A.", "This place is easily my favorite place to snag some curry. The vibe is super calm, and there's always seating. Food: went for the Panang curry with extra veggies, and yellow curry with shrimp. Both were good, but that Panang curry thoooo. Hmmmmm Still dreaming about that sweet Panang sauce. Yum. They also have a sweet check in special, so if you're good at checking in this little place will reward you for that. ;)"], ["Faye L.", "It still brings a smile to my face when I think of World Curry as they are the Godfather of curry houses in my opinion. They've been here in PB for 20 years now. TWENTY YEARS. I remember having my first Thai ice tea EVER here at World Curry. I swear I still remember, to this day, the way the orange colored thai tea looked and the way the beautiful 1/2 and 1/2 cream slowly bled through the tea.I received word that World Curry is going to be offering the same prix fixe menu starting August 10 until August 30th from 4:00p-8:00p for $20. I don't know how big the portion size will be but it's still a great way to try (or re-try) World Curry.Here's what we tried from that prix fixe menu:PHALL POPPERSThese cream cheese stuffed eggrolls have a bit of their phall curry inside. The phall curry is bat sh*t crazy SPICY. We loved these poppers. TIKKA TACOOne of THE BEST things I've eaten all year. The taco is made with World Curry's roti flatbread (which was so soft & nicely chewy) and stuffed with their tikka chicken. It's covered with fresh cabbage and smothered in sauce (curry? cream?). VEGGIE PAKORAThere were lots of fresh vegetables (zucchini, carrots, onions, broccoli) in this pakora. The chickpea batter could have been crispier.NAANThis is the underbelly of the naan. The naan was clay oven baked beautifully.THAI GREEN CURRY WITH CHICKEN & VEGGIES; TIKKA MASALA WITH CHICKENI was shocked to see this dish as my memory of this place was jostled once again. I asked Momo (one of the owners) if they always served their rice in that pyramid shape. She smiled and said yes. It's funny the stuff your head remembers! I enjoyed the Thai green curry as it was lightly sweet and had a thinner (curry) sauce. The tikka masala was a thicker curry with almost a grittier texture. I wish I could remember what Bruce said was used in their tikka masala. The chicken tasted fine but could have been served warmer.BANANA FRITTER WITH COCONUT ICE CREAMYou could taste that they make their coconut ice cream in house. It was a wonderfully coconut-y ice cream topped with toasted coconut. The fried banana fritter had a nice crunch (I think they used a wonton wrapper) and would be a nice dessert option if you like something sweet and gooey (from the caramel sauce and hot banana flesh).The owners Momo and Bruce are such sincere hard working people. I can't imagine how many hours they have put of themselves into World Curry since opening it 20 years ago. TWENTY YEARS. Still baffles my mind."], ["Arielle J.", "My husband and I have an obsession for curry and decided to take a trip down here. And all we can say is WOW! My husband had a tomato based curry while I enjoyed the tikka masala. It's was super delish! We also ordered the garlic naan to soak up all the goodness we had! Definitely coming back for more!"], ["Teneille S.", "This place seems perfect - the fact that it has been open for twenty years I would think is testament to that. However I had some concerns.The service was wonderful; our waitress was attentive but not overly persistent - glasses full, perfect amount of check ins, etc. Bae had the Bali beef curry which looked and smelled delicious, he rated it 3/5, generous portions and quick arrival. We also had a garlic naan which was spectacular. They didn't have any of the \"Singapore\" curry left, so I opted for my second choice - I had the soup, salad and naan deal with the Thai yellow curry soup. I can absolutely take responsibility for not returning it when I should have, as it tasted oddly sour but I chalked it up to the spices and salted the oddness away, but was barely a quarter in before I started feeling nauseas. Obviously i soldiered on as its curry, and I didn't want to waste my money but couldn't finish more than half. Was tasting it come back up every time I burped or breathed in too hard. Promptly went home and involuntarily puked the whole thing up. Yikes! So maybe if your food tastes odd, let them know - I'm guessing the coconut milk had gone sour. I still want to go back and try the Singapore curry when it's available again, if I'm feeling game. Drinks are well priced too, and they have a good happy hour from 3-6."], ["Elizabeth P.", "World curry is one of those curry houses that I will always come back to. Our favorites are the Japanese curry and the tikka masala. There brown rice is always on point if you want a healthy option, and there naan, always so fresh and HUGE, love the garlic naan! They have delicious curries from all over the world. There customer service depends on the time of day and how busy they are but it's definitely efficient! It's one of those casual places to grab lunch or dinner that always ends very satisfying!"], ["Ed C.", "Great food, relatively inexpensive, good service, what's not to like??I've been here about a dozen times.  I've enjoyed every visit.  Highly recommend the Tikka Masala, the Panang, and the Bali Beef curries.  Their side salads are tasty, and it's worth it for us to get the more flavorful brown rice rather than the white.  Recommend the large size over the regular; the regular is a good portion, but take home leftovers, it's just as good the next day!  The large size is only $3 more, so it's better value IMO.  Garlic Naan?  Yes please!Service is always solid.  Only drawback is parking, most of the time you can find a space within a block or two on busy Garnet, but occasionally you'll end up circling a bit.If you're in the neighborhood, and in the mood for Indian, check it out!"], ["Robert B.", "The Tika Masala was excellent as was their selection of local draft microbrews. The nan bread was hot and delicious and helped cool my taste buds. Nice little spot on Garnet to relax and watch the crowd."], ["Chad G.", "I ordered chicken tikka masala with some garlic naan and a mango lassi.  The food was pretty good - not great.  (Actually, the mango lassi was excellent.)  My biggest issue is that they took almost 90 minutes to deliver.  I prepaid a tip hoping that would speed things along.  It didn't.  If you need some Indian food in a pinch, the food can meet the need.  But be sure you order well in advance of any hunger pangs."], ["Raechel S.", "What a taste bomb! We came here after JRDN was out of oysters on Oyster Day...craving some curry and fusion, we stumbled upon this place on our way out of PB.  I'm so glad we stopped!  If you check into Yelp, you get a drink and naan for only a buck.  The waitress let us know that if we ordered a Thai Iced Tea, which is a MUST here, it was 2 bucks.  WHAT A STEAL!!!    I ordered the Indonesian curry while my hubby had the Tikka Masala curry.   Hard to imagine that they both come out from the same kitchen, because the flavors were so different and yet so deliciously wonderful.  My only regret is that we don't live close to PB.    The prices were so reasonable too--9.99 for a large and 8.99 for a regular.   We actually had enough food to bring home for another meal.  This place is a steal in my book!"], ["Miriam M.", "My friend and I were craving something spicy and decided a curry fusion place would do the trick. We were starving too so we thought this would be quicker.Service was good in terms of friendliness and helpfulness/knowledge of the menu for first timers. However, it was kind of busy and they didn't seem to have a lot of help so it did take awhile to get seated but once we ordered the food was pretty fast. I love that they have curry options from several different cuisines. We ordered the almond (i think it was called golden) curry and the green Thai curry both with brown rice (fyi 50 cent charge for brown rice). Each dish comes with a small cabbage salad. Crunchy, fresh, and I really loved the dressing.We also got a side order of garlic naan. 1 order is enough for 2-3 people. It's like naan for giants. HUGE. They have a happy hour I need to come back for because the asian bears were like 5-8 dollars. I saw they had Tiger which is the most popular beer in Cambodia. I know Asia is different but I couldn't bring myself to pay $5 for a small tiger when I bought it for 50 cents in Asia. Darn it, Asia! You ruined me in the cheap beer department! Haha but the happy hour specials looked pretty stellar.As far as authenticity, it's not the most amazing but it's a fusion place so to me that's expected. And the curry was still delish!"], ["Emily P.", "Ever since being introduced to curry via my school's cafeteria, I have been in love. How have I not heard of this place earlier? World curry, it was love at first bite. Okay that might be a bit of an exaggeration but seriously the food was fantastic.I was so excited to see that there was a Yelp deal, but unfortunately the deal expires at 3 and I was there for dinner. Anyways, I came here with a large group for one of my curry loving friend's birthdays. Service was relatively slow, but we did have a large group.The normal curries come with a refreshing salad, which was too doused in dressing but still crisp and tasty. My friend and I ordered two curries and split them because you can never have too many curries. We had a mild Tikka Masala and \"very hot\" golden curry (both with chicken).  The Tikka Masala sauce was delicious, too mild for me, but still flavorful. Something was off about the chicken in it - I can't quite identify why, maybe it was too stringy or dry? The golden curry warmed my soul probably because it was spicy. The chicken was perfect and the sauce was to die for. I would literally drink it instead of water if that were socially acceptable or sufficient enough to hydrate me.I can really say nothing accurate about the ambiance or staff because I was to focused on the food. The restaurant could have been on fire and I wouldn't have noticed because I was distracted by The Great Pyramids of rice surrounded by liquid heaven called curry. My new goal in life is to get my signature up on the \"Finished a Phall\" board."], ["Katie H.", "I love that they let you try various sauces before ordering. It makes for a fun date!!"], ["Aiste S.", "Great flavors in the curry! Definitely wish there was more quantity for the price though. The only cons: they didn't make it spicy enough even though I specifically asked for it HOTHOTHOT. Anddddd the garlic naan was no joke awful. It tasted like they went down the street to Pizza Hut and took their stale pizza dough and added some garlic powder. Definitely didn't taste like authentic naan AT ALL."], ["Jennifer A.", "Yelp challenge 2015 this place is in pacific beach and has curries around the world we went here for our anniversary lunch, Lauren our server was very attentive, sweet, and nice.. I liked that she sings when she was working. We ordered the vindaloo very hot it's a 6 for spice was I ordered the almond curry I liked it very much for me a 3, I like that I can have chicken, tofu with out being charged extra. The garlic naan was amazing and also the rohti, I will come again... It was great cause there was a groupon too :)"], ["Dawn B.", "I came here for lunch with some friends from PB. I ordered the Singapore (reg size) they got curries. We all enjoyed our food. I wouldn't say it was great though. The Indian curry pack from Trader Joes are just as good. Here's what will prevent me from recommending the placeNickle & Dime add on charges!  @  .50¢ extra for rice. Really?  @  $1 drink + naan Yelp offer ended up being $1.75  I wanted coffee as my drink (instead of soda) so they added .75¢ & if I wanted garlic on my naan it would have been another .25¢ The food was good but the Nickle & dime charging put a bad taste in my mouth & tainted the experience.Also - the takeaway containers are Styrofoam  :("], ["Leah L.", "Since everyone knows I LOVE curry people always ask me if I have ever been to World Curry.  The answer has always been \"no\" until last week.....It was definitely a strange coincidence when the Groupon popped into my e-mail the day after I was discussing World Curry with a friend.  Fate had me buy two, because I knew I would like it.  It was kind of late when I came in, so I was surprised to see it was pretty busy (always a good sign). No one was at the front to seat us and I needed to use the restroom so I  headed back and asked someone if we seat ourselves or not...she was very polite and trotted to grab menus to seat us. Super cute decor, very kitchy.  The booths are like you are sitting under a thatched roof hut in Thailand. Our server (Lauren) was effing fantastic. Super attentive, very nice, great suggestions...I can't really say enough good things.  I sadly did not go with her curry suggestion, I really wanted a Tikka Masala so that's what I went with.  I will say though it was good, it wasn't my favorite Tikka Masala.  She recommended the Thai green basil curry so that's what I'll try next time.  The naan was out of this world.  I don't think it was purely authentic naan because it was a bit thicker like a flat bread...but DAYUM was it tasty.  There was a lot of food.  The regular size is good enough.  OH and I failed to mention the tasty side salad that all the dishes come with. All in all good experience, food wasn't the best Indian curry I have had but still tasty and large portions. Fun atmosphere, awesome service  so they get an A+"], ["Katie W.", "I've been here a few times with colleagues since it's just down the way from our office.  The first time, I actually wasn't terribly impressed.  I had the Japanese fried chicken curry, and the chicken was practically inedible.  The texture was incredibly weird, and there wasn't any meat.  Loved the garlic naan, though, and the Thai iced tea.We came back not long ago and I went for the yellow curry with chicken.  This was a MUCH better experience, and now I will happily return when my co-workers suggest this restaurant.Service is always great, and there's plenty of seating.  There's a lot to choose from on the menu.  The portions are very generous.  And they're very accommodating of spice levels.Overall, a nice spot for international cuisine."], ["Lane M.", "I've never had a bad curry here.And they make curries from literally all over the world. As firey or vanilla as your sweet little taste buds are willing to savor.And I don't eat red meat or chicken! Every time we have come and I've had some weird restriction, they have been awesome about accommodating for it.They have this delish little salad that comes before every meal, and the portion sizes are huge-mongous. Watch out for that food coma, though. The pyramid of brown rice really sneaks up on you."], ["Pedro F.", "I have ordered take out and dinned in and both times the curry was extremely good. Service was great and one of the times was a little problem that they solved both quickly and an extremely satisfactory manner. I completely recommend to try their panang curry and their garlic naan bread."], ["Nicole P.", "We have been to World Curry quite a few times and the food is fantastic.  We stopped by last night and unfortunately had the worst service EVER.  We started with appetizers and beer and were going to order dinner however the server never came back after she offered another beer to my husband but must have forgot that and obviously us.  We sat there for literally 30 minutes twiddling our thumbs.  By the time she reappeared we no longer wanted to be there and left.  I would rate the food a 5 star but service last night 0 star so had to give it a 2 over all.  It's a shame because I love World Curry.  I hope the mgmt reads the comments and fires her because it really wasn't busy enough for that poor service."], ["Chris R.", "Really good curry here! My favorite has to be the green, but there's lots of other good choices, and great service."], ["Zachary S.", "This is a place for fast, cheap curry, and has a wide variety of different style curries and meals from around the world. I find the variety really interesting and I want to come back to give it a chance for 4 stars with another dish.As for this visit, this is how it went:FoodI had The Phall and my girlfriend had the Tikka Masala. She was disappointed with the Tikka Masala, and the Phall was spicy and good, but not amazing.Drinks My girlfriend's water had some residue floating in it (I don't really know what it was). Otherwise we both ordered waters. DealsWe wanted to use the check-in on Yelp in order to get free Naan Bread and 1 drink with the order of curry, but we were informed by the waitress that only applies before 3PM (I didn't see that anywhere on the deal, maybe they should emphasize it more).ServiceService was friendly and quick, the waitresses seemed cool. OverallIn the end, I like the variety, and the food wasn't bad for the price - bottom line is I would come here again to give some of their other dishes a second chance at excellence!"], ["JJ T.", "Been coming here since I first moved to San Diego. I was on the hunt for a good curry bowl and World Curry was my first choice. Tried many places after but nothing beat their Panang and Yellow Curry. So delicious and savory. I will be a returning customer till I move again and when If I do move I will always make sure to eat at World Curry when I visit!"], ["Peijean T.", "Sometimes I hate my foodie friends.My fellow foodies have told me for ages that World Curry was just \"meh\" and passable and that I was better off going to an Indian resto for tikka masala or vindaloo, a Thai resto for massaman or green curry, etc (you get the picture) instead of a place that has curries from all over under one roof.But tonight, I finally, finally tried this place after passing by it so many times over the last year and a half. I even let a LivingSocial voucher I bought almost a year ago expire on me! Tonight, I finally, finally answered that question in my head whether it was any good.Well it IS good! The chicken tikka masala I ordered had a nice layered flavor, not sharp in any way and was lightly creamy. It was amazing with their chewy medium grain brown rice, and I love the little cabbage salad (with vinaigrette) that they give you on the side since this dish is just meat, sauce and rice. You can order the curries in two sizes: regular for around $9 and large for around $11-12. You can also get a smaller bowl size version for $6.99. Reasonable prices for a legit meal. I'm not a tikka masala connoisseur but have had it many times where the flavor is sharp from tomato and I preferred World Curry's.I look forward to returning to try the Thai massaman curry, which is apparently their top seller next to the tikka masala. And I'm also interested in their new Thai/Indian vegan yellow curry that has been featured on their board the last few times I passed by. Plus next time I dine in, I can take advantage of their Yelp check-in for free naan and soda for $1!Lesson: they hate us, 'cuz they ain't us."], ["Sam G.", "It's not that perfect, I tried bali beef its cold and not taste good, but the waiters is good and friendly, thanks Virginia."], ["Loni N.", "Service was wonderful.  They have a great kids menu option.  You get a mild curry (your choice), naan, chicken skewer, rice and a drink for $6.  Our part ordered the following curries:Chicken Vindaloo: the sauce was super tangy and green.  I was not expecting that.  It was good with a medium heat level.  I ordered the large which was too much.Chicken tikka masala: you're standard.  The sauce was thick and creamy.Katsu Carry: the chicken was extra crispy which made it great to soak up the curry base.  Great flavors!Unless you have not eaten in days, I'd recommend getting the regular instead of the large.  We also ordered their Karaage which was a huge hit with the kids."], ["Albertine F.", "This review will be nice and quick.  The place is great - great atmosphere, delicious food, lovely staff, and fantastic prices.You just can't go wrong.  The green curry is my favorite, but I have never had a bad meal there.  The appetizers are also very good.They have a reward system that gets you free stuff after so many meals:6 will get you a Free Soda8 will get you a Free Naan Bread20 will get you a Free Entree50 will get you a $30 Gift Card100 will get you a $75 Gift CardThe large dishes (about $12.00) will easily feed two.So if you're in Pacific Beach for the day and are crazing some curry -  from Thailand, India, Japan, Bali, the Caribbean, or Singapore - this is your place."], ["Anthony T.", "I've been here twice so far and both times I've had a delightful time eating here. Both times I ordered the Thai curry for myself, as well as sampled my friend's curries and I have to say, they certainly know what they're doing with their curry."], ["Alice A.", "With a craving for Indian cuisine for my birthday lunch we decided to try World Curry. Great meal, friendly waitress, large portions & delicious left overs. We ordered the murgh masala with chicken/brown rice, the panang curry with chicken/white rice and a kids plate with a mild tikka masala, plus an order of garlic naan. This place will definitely be added to the rotation of restaurants we frequent. Join the 5star app to get points when you dine here!"], ["Vivian N.", "I wouldn't say they have the best curry but it is tasty! The service was great and the atmosphere was cool. The only downsider about this place is parking.... Being in the middle of PB! It's a hit or miss with parking. **right now, there is a groupon deal that is $12 for $20 (great deals) Their menu carries a handful of curries around the world. From Thailand to India! The food I ordered are: -golden curry: tasted toasty and has a little kick to it. Wasn't a big fan! The chicken I got was kinda raw...-tiki masala curry: decent! The flavors were there. Would try again!-garlic nan: this sealed the deal! Delicious and can't express how yummy this was. I would come back and try more curries!"], ["Alex C.", "A must try for lovers of international cuisine! From Japanese to Caribbean curry, there is something to please everyone's taste buds. First off, this place offers a lot of bang for you buck! Portion sizes are HUGE. Hubby and I ordered the regular rather than the large portions for both our curries, and we still have plenty of leftovers. Second, the flavors of the the curry are amazing. I ordered the Golden Curry which is essentially red curry with coconut milk and almonds. I have never had curry with almonds before, and I was pleasantly surprised. The almond adds a nice texture to the curry. The hubby ordered the Keema Curry which is minced chicken with tomato, peas and cilantro. The garlic naan is amazing, nice soft bread full of garlic butter that melts right in your mouth!! I look forward to trying more of their curry the next time I am there!"], ["Robert E.", "The problem with being a little good at everything is that you don't get real good at one thing. This curry joint has been a staple in the PB community for a while now. It does offer a wide variety of dishes that can give something to offer to just about anyone. There is ample seating and the vibe is ultra laid back.The staff is pretty top notch, and they are pretty perceptive at taking care of things even before you can ask. Great happy hour offerings from food to drink options, and there is a homey satisfaction to it all.Great local place to grab a bit to eat and walk it off with a stroll to the pier."], ["Bruno A.", "This is one of my favorite places to eat in San Diego. The food is really tasty. I usually get the green curry with veggies. I recommend upgrading it to a large size, it's only an extra $2-3. They also have a good beer selection. My favorite beer on tap is Tower10 IPA ($5 for a pint or $15 for a pitcher)."], ["Marianne D.", "Great service, great food, and a whole lot of variety (they sell gluten-free, vegetarian, and non-curry items)!Me and my best friend Reaven chose the Thai Panang (brown rice) and the Japanese KaRe (white rice), but this was after ordering our dessert first, which was the Banana Fritters and Coconut Ice Cream. IT WAS DIVINE. We loved the fritters so much, we didn't even think of eating it with the ice cream at the same time (we definitely will next time). But there was absolutely no rush from the servers. They checked up on us A LOT which made me happy. We even ordered two drinks - the thai tea and green tea frappe. Both were just right for our distinct tastes. As for the curry, DO NOT EAT ANYTHING BEFORE COMING HERE. We decided to order the regular size over the large and we still left the place with leftovers. It's very filling and the presentation of the rice was very cute (shaped into a pyramid). My friend was literally 20% done and he was incredibly full, as was I. We're coming back though. There's so much more we wanted to try. And get the garlic naan bread!!! It was baked to perfection and it looked crispy but tasted soft and ugh. It was great. 5 stars, World Curry.And thank you to the gentleman who served us. I didn't catch his name but he made us both feel very comfortable! Lowkey looked like David Beckham. Then again, I didn't really try to look at his face. Lol, thanks!"], ["Kevin H.", "Wold Curry is so good. I have had a few different types and really enjoyed them all. The staff is friendly, and I really like that you can choose the spice level of the curry as well!"]], "Himalayan Dine Inn": [], "Tandoori House": [["Ninamarie O.", "I'm a regular here now--their food is DELICIOUS and their service is kind, efficient, and professional! This place is a true gem, and I love that it's affordable and that their hours are so convenient."], ["Jean - Marc D.", "I was here last weekend with some friends, had mango lassy, Tikka Masala n Chicken KarahiPaneer with garlic nan n rice everthing was very goooooooood.Will come back again n all for about $ 10.00"], ["Hans S.", "I came in at 3:31pm for there lunch special and they said I was too late because they stop at 3:30. I said it is literally a minute and they still said no. Boohoo to the service here!!!"], ["Joseph Y.", "Came here on a Sunday around lunch time. The restaurant and its parking lot are quite small, luckily for us the place wasn't that busy.We sat down and the cashier/waitress immediately came up and offered us the lunch special menu. For $8 you get to choose from two entrees which includes soup, rice and plain naan. What a freaking deal. My friend wanted to order off the main menu because the lunch special menu was very limited in vegetarian selections. Like usual, I went for the Chicken Tikki Masla, and my friend ordered the yellow Dahl. Our soup came out and personally we didn't care for the soup. I had no clue what it was, but it tasted too sweet for me, so I didn't even bother to finish it. Our entrees came out and for a special, they sure give you a large plate. The rice is cooked perfectly and seasoned just right, the rice adds amazing flavor and texture when you mix it with the curry from the chicken tiki masla. My chicken dish was great, I told them medium spicy. To my surprise, they actually made it medium spicy, it had a kick, but not too much. My friend always gets hers spicy, and they came through on that too. Naan was also a great addition to out table, the garlic naan was awesome. Overall, for price you definitely get an amazing value here for their lunch specials. The food is great and the service is great, what else could you ask for?"], ["Kim P.", "I think it is great here. Yes, the area is sketchy and you're probably not going to want to bring a date here or have a nice evening on the town. And yes it is right next door to the Taco Hell. But if you are a local and craving some authentic and cheap curry and naan, this is the place to go. I wouldn't drive across town for it because you can prolly get good Indian anywhere, but you can definitely get it good here! The chicken Tikka dry was actually really surprisingly delicious! It is a Tikka without any sauce, just chicken and veggies in oil and spices. Of course rice comes with everything and they have a lot more varieties of naan than I have seen at other places. The staff is very attentive and knows everything on the menu so they can explain things that might be confusing. There is ample parking. But lots of homeless people walking about... I mean... that's Midway district, so you kinda know what to expect."], ["Raymond F.", "I got the Tandoori Chicken and Cheesy Knaan. The cheesy knaan is good. slightly expensive but it's good. The Tandoori chicken is really bland so it's definitely deceitful. The onions and bell peppers help fill up the plate and can actually aid the meal in being filling and somewhat healthy but still doesn't yield a very tasteful meal. It's easy to order for this place though since you can literally do it through Yelp."], ["Drew E.", "Alright I love this place.  Its on Midway in a somewhat obscure retail location which is usually enough to make me cautious, but these guys deliver great Indian food at a ridiculously cheap price for the lunch specials.  If it was walking distance from my house I'd be here a couple of times a week.  The staff is super friendly, the food is great, the portions are large and the prices are cheap.  If you're already in the mess of midway and need to grab lunch this is a no brainer, do it."], ["Mae E.", "I'VE BEEN LOOKING FOR A PLACE LIKE THIS FOR SEVERAL YEARS. FINALLY A PLACE WITH CHEESE NAAN!! Like quesadilla style! (I think your business would do exponentially better if you made garlic cheese naan an option, no one else has this cheese naan either --that's the recipe I've been looking for and I requested it when I went in but you said your cook wouldn't do it. Please consider it!!) I usually go to Indian style places usually rate their spicyness from 1-5 rather than mild,  medium,  hot like here so I was a little dissappointed that their hot wasn't \"hot.\" (I can eat habaneros for breakfast.)Chicken masala,  vindaloo, samosas,  and the shrimp appetizer?, and lamb curry were excellent. Will come again for that cheese naan!!  (Hopefully garlic cheese naan too.)"], ["Adria D.", "I decided to try this place even though my favorite Indian place in the area is across the street at Taste of Himalayas. They had Great reviews too and a $6.99 2 item lunch special. I looked at some tips of my friends who said it came with lentil soup and you can also add 2 samosas for a $1.50. I ordered my two standard go to dishes when I'm trying a new Indian place Tikka masala and saag paneer. When the lentil soup didn't come out and other people got it around me I asked about my soup and they said the soup was done for the day even though it was 2 o'clock? I'm not sure if they ran out or what exactly that meant but I didn't get soup with my lunch special everyone else did.  I decided to add on the two samosas for $1.50 when it came out it was only one even though the lady agreed it would be two. When I asked her where my other samosa was she says it's only one now that whoever got two samosas well that was a mistake. So there was a lot of bait and switch going on with me. The Saag paneer was pretty bad and inedible and I told them I did not like it and I usually order that a lot. It had a word old burnt bitter flavor.The tiki masala it was excellent! The chicken was nice and tender and the sauce was good. I ordered spicy on both but they weren't too spicy but it still had a nice kick.The naan was mediocre. The staff were very friendly even when I was denied things that I was supposed to have they were friendly about it, so there is that.Afterwards I wish I had gone over to taste of Himalayas they are definitely way better I was not too thrilled with a few things here."], ["Abe N.", "Lunchtime at Tandoori House during the week.-parking lot was filled-all tables were filled-two friendly wait staff-new tech-savy touchpad register to add tip, sign the bill, and email the receipt-Saag Paneer and Vegetable Korma were both creamy and delicious-spice level was lower than expected (level 6 tasted more like a level 3)With a full house, the food arrived slower than usual.  The staff forgot my soup until I asked for it.  Don't expect really spicy levels.  [If somebody complained, this is Indian food, pal.  If you can't take the spice level, say, \"not spicy\".]  But if Jazzy is working in the kitchen, you may ask him to please jack up the spice level 10 (like Supannee House of Thai level 10) and you might get something close.Overall, the lunch special was still piping hot, had good portions, was full of flavor, but mild on spice.  Tastey.  Thumbs up."], ["Mo T.", "This place really impressed me.   I love the service and food.   Tikka masala and the saag paneer are to die for.   Probably the best I've had.   I was a frequent visitor of Punjabi tandoor but there starting to pull tight on their food.   But I've found this gem and I just love it.   Lunch specials for 6.99.  Can't beat it."], ["ken G.", "Over a year ago I gave this restaurant a 5 star review but today had a dreadful experience.Arrived at 1pm. during 'lunch specials' and a little after the rush. There are only about 9 tables - some had single diners so it wasn't swamped with orders. I gave my order for the special - asked for 10/10 for extremely 'spicy' and water. Although it's not 'fast food' - it looks like it caters to a 'quick' lunch crowd. I waited over 25 mins. and was about to ask again for the water when the waitress appeared with it apologizing that it took so long.I thought at least it was a sign the meal might be ready but a couple of minutes later the 'manager' came out with the menu to confirm what I'd ordered and she pointed to 2 of the choices that I did not order. I should have just left at this point as the meal hadn't even been prepared.I waited another 15 -20 minutes then my meal appeared - one of the 2 choices was wrong but I just wanted to eat and leave. Taking a first bite there was absolutely no spice or 'heat' in the sauce - it was a 0 out of 10. I'm not exaggerating when I says you could puree the whole meal and feed it to a 3 month old baby with no problems. At this point I actually turned around to see if any 'Candid Camera' or 'You're being Punked' crew were there !I ate about 4 mouthfuls then boxed it up. The waitress then asked for the first time how the meal was and I replied it had no spice - the 'manager' apologized saying she got the order wrong and gave a gratuitous small pot of curry sauce to go.I usually leave at least $2 tip on a $10 meal but when the bill stated $7.55 I just left $8  and thought I was being generous.I'm not in the habit of asking for meals to be comped or discounted but I really think if I was a manager I would definitely give a free meal or free coupon to return after they acknowledged the meal wasn't what I'd ordered and the incredibly long wait.Sadly I will not return."], ["Mia L.", "There are really good reviews here and I happen to bookmark this place but didn't really put a reason why. Anyhoo we decided to come here for dinner and they were pretty busy. I was bit sad that they didn't serve us those crackers and because the server said they don't have chutney. SO??? I still want those delicious crispy thing. I never really knew what it was called but its like a crispy version of roti. At this time I was disappointed. First I didn't get my water until we were serve our soup. Next they didn't serve us the crispy thing at all nor did they tell us why until I have asked. I was thinking this place is about to get a 2 stars right now. But then somehow the service got better the girl was nicer maybe because she didn't feel as rushed later on. I don't know what that was all about and then the food came out. We ordered the Chicken Vindaloo and the lamb Jalfrezi...Both dish was amazing there was so much flavor to the point I was thinking giving me more rice to go with this dish.Since this is my first time I can't quite give them five stars yet. 5 stars to me means consistent every time. Great food wish I was with more people so I could try more of their food. Definitely will come back. Until then Tandoori House. :)"], ["Eileen H.", "This place is really good. We normally get take out and you can order online which is nice. The garlic naan is great and so are the samosas. I normally get the Chana Masala which is amazing and so is the Mango Chicken.  Tonight I had the Alu Punjabi it was alright but next time I'll get my go to."], ["Carol C.", "My last visit here was a little disappointing. Food was still same high quality, but the service was slow from taking my order to receiving the food once order was placed. I didn't realize till after I left they forgot the soup with the lunch special. Note, I dined in, so there was no reason not to provide the soup. Portion size has gotten smaller, too. I had to box half my meal to go, in order to make it to a meeting even though I had allowed more than enough time for lunch.Maybe it was just a bad day."], ["Robbi M.", "I'm not happy with the customer service.On my first visit, the soda machine was broken. Even though I purchased a drink, I wasn't offered a refund. Instead, I asked for a free drink on my next visit. She said okay, but offered nothing to document our agreement. I had to request something for documentation. So she made a coupon, didn't sign it, didn't give a name, nothing. I'm wondering if they will honor it in the future.My second visit, I did not have the coupon. So, I did not even bring it up. Instead I ordered a lunch special to go and a coke. I requested raita instead of the salad, and said that I don't need the rice. When my food was ready, I think they hoped I would forget and leave without my drink, but much to their surprise, I remembered! Jokingly they said, \"I meant your food was ready, not your coke\". When I got to work, there was no raita and no spoon or fork. I guess they wanted me to eat traditionally with my hands. The last straw was when I stopped today for lunch. I was going to use that coupon. Arriving at 3:35, I was unformed that I could not order the lunch special. It had ended at 3:30. Wow! Okay, 3:30 is not 3:31, 3:32 or 3:35. So, I left and went to Pieology! See the time on the receipt from Pieology.Hope your experience is much better or you go someplace else!!"], ["Drew T.", "2 stars cause the Saag Paneer was at least spicy. I'll skip the long story, all I know is I slept with my ass out of the window last night and I'm not going to get into it but I was pretty sick this morning.I'll stick to Sundara. How is this place rated 4 stars? Baffling!"], ["Phil S.", "I am going to give the food 5 stars. The restaurant is nothing special, but I always do takeout. Love everything they have. Nice large portions, family owned, it's the real thing. Super friendly people who obviously know how to cook."], ["Michael P.", "Amazing food. Lunch meal was huge for only 6.99. Lentil soup, naan, basmati rice and got to choose two entrees. I got the saag paneer and chicken tikka masala. It was absolutely delicious. Probably the best saag paneer I've ever had."], ["Neeraj M.", "Fast, great service - 1 extra star for that. Seated us fast, took the order quickly. Even accommodated the special bread for our little one. Enjoyed the food. It is a typical Indian place with the standard curries etc. No frills. Will go again for food when in the area. This was especially better than the unresponsive Himalayan Indian place across the street. We waited there for 20 mins. and then walked out since no one showed up to even take the order."], ["Nancy P.", "Saw the movie \"The 100 Foot Journey\" today and had a huge craving for Indian Food afterwards.  Found this place on Yelp and boy, are we happy we did!Food was wonderful.  Service was excellent.  Management was personable and welcoming.  My husband and I started with the Chef's Sampler Appetizer Plate:  samosas, vegetable and paneer pakora, onion bhaji and alu tikki.  Be aware that these items are all fried; if that's okay with you, it's a delicious sampling.  We then ordered garlic naan, chicken tikka masala and saag alu (meal came with basmati rice).  All dishes were flavorful and came in generous portions.  Finished off with kheer (rice pudding) which was lovely.  We took much of our entrees home because we were stuffed.Tandoori House has only been here for five months, and we hope it's the beginning of a long and successful run for them.  We'll definitely be back!"], ["Rossana C.", "Great service and the food is delicious, im very pleased with this place its kind of hidden but well worth it!"], ["Kassi K.", "Meh. We eat a lot of Indian food, at home, and in restaurants, and my boyfriend and I found this food to be really boring, and were disappointed by the vegetable masala (made of frozen mixed vegetables. Blegh) Their rice has ghee on it, so vegans beware. It wasn't a terrible experience -- the service was nice, and the food was ok, but seriously, it was just ok. With Taste of the Himalayas right across the street, I can't see any reason to come back to this spot."], ["Emilio H.", "Very very good food. My first time trying Indian food. Very surprised at how filling it is. Had a Lamb dish with Balmati rice. Tasted great. Can't wait to come back to try more dishes and expand my food horizon!!"], ["Adrian M.", "Friendly service and even better food! The menu during lunch is incredibly simple which I like, and at 6.99 plus naan bread I'll definitely be back ASAP!"], ["Matthew S.", "Lunch special is excellent, really enjoy all the items."], ["Peter F.", "Please permit my RAVE review -- in addition to all the others -- for Tandoori House's lunch specials.  I've been 3 times in recent weeks, first time completely by chance, and thought: \"Oh, I wonder if they have any nice Yelp reviews.\" I see they have many --and well deserved.Portions are generous, very flavorful, and $7 for a reasonable selection of lunch items (you pick two). In addition, there is a soup which changes; so far, I've had black lentil, yellow lentil, and cream of tomato.  I do NOT exaggerate when saying the cream of tomato is among the tastiest soups I've ever had.  This place understands \"flavor.\" Very pleasant service.  There is a family (father, daughter, son) team working at this restaurant. I had the pleasure of meeting them all this week when I was raving to them about their food.====Update (23 Nov. '14): Changed my 4 star to 5 star review. *****Have been here now at least 10 times. This is exactly what I look for in a lunch place: friendly, efficient service, excellent value, consistently high quality, delicious.  In fact, I now get sort of giddy and lightheaded (!!!) when I walk through the door -- in anticipation of a fantastic $7 lunch."], ["Yelena C.", "Ordered delivery... Their Tikka sauce was delicious! Fast delivery and friendly service.. and the portions are very generous!"], ["Vince R.", "Great location excellent dining experience had a great time the staff is top notch too!"], ["Alex Z.", "Exquisite!  Awesome costs for lunch specials!  The food is so good, sad that they don't have a lunch buffet, but there wouldn't be any space inside if they did!  The food and bread is super good, and I highly recommend it to everyone!"], ["edy r.", "Went there on my first Indian cuisine experience so I was excited ...I got the special it had lamb curry and a chicken dish I forgot the name...the lamb curry was amazing and the pieces of bread as well the staff was friendly but the reason I'm only giving 2 stars is because my chicken was spoiled...it had that awful chicken smell of bad chicken !"], ["Pete Q.", "The food was mediocre at best. I ordered the chicken tandoori to go, figuring since it's the name of the restaurant it should be their signature dish. I was told it was chicken breast but I got drumsticks and thighs that were mostly overcooked. The wife got the korma dish and she said it was sub-par for lack of flavor and spice.Oh, and they over charged my credit card. After several calls to this place, I gave up and called the credit card company. The service needs improvement."], ["John L.", "Lunch is a simple and tasty affair - especially if you don't want to do buffet dining. The \"short list\" menu is easy and has broad variety - and you can select the spice level of your dishes (whereas buffets are \"one spice fits all\") Particularly fond of the Vegetable Korma and Saag Paneer."], ["Elizabeth W.", "Really great place to grab Indian food in the Ocean Beach area. (I know everyone raves about Sundara, but it's way Americanized. This is the legit Indian food in the area.) I especially love their mushroom masala. We will be back! =)"], ["Claudia M.", "Just walked in, was told to sit down, and about ten minutes later they asked if I was was ordering to dine or Togo and when I said Togo they tell me they were closed."], ["David K.", "Really good Indian food in Point Loma.   I like the lunch special - 6.99 for soup, choice of 2 entrees, rice, and a big basket of hot nan.   Usually 6 veggie and 6 meat entrees to choose from...  All the standards, and well done.   Add a drink with refills for a buck, or a lassi for $2.  7 days a week.   If you bring a friend you can have a 4 entree feast!It's good and I always leave with a second meal left over, and I eat a lot!   People are nice and there's always a Bollywood musical playing on the TV!   I like it there.Kind of hidden behind Taco Bell on the south end of Midway and tiny, but definitely worth adding to your list of places to eat in PL!"], ["Colleen M.", "This review absolutely would have been a five star after my last visit, but not after my recent delivery experience with them. We ordered the beef curry and the chicken tikka masala, both of which we've had and enjoyed before. When I opened the beef curry I noticed that there was a *lot* of cilantro in it. There has always been a bit in past orders, but I have been able to eat around it. Not the case this time. I called the restaurant and asked them to just take it off the bill as the dish was inedible for me (ridiculous, I know, but I just cannot stand cilantro!) The restaurant offered to send a new order, which was appreciated, but we didn't want to wait and decided to just share the tikka masala, so they just comped it. In retrospect, we definitely should have checked the chicken tikka masala before calling about the other dish, as it was also chock full of cilantro. It was when I called back to ask them to just send a replacement of the whole order instead if comping it that things went awry. The woman who answered the phone was incredibly unpleasant and said that it was my fault for not ordering the dishes without cilantro. This would have been a valid, if rude, thing to say, except that I have had both dishes before and have never had a problem with them. I just did not expect this much deviation in a dish from one visit to the next. Honestly, the whole thing would have been fine if they hadn't been so rude about it. Just not what I expect when I shell out $40 for Indian food."], ["Ronald G.", "Love the food here. Really good taste and not very expensive. I love the red chicken curry."], ["Michael B.", "Had lunch at Tandoori House last week and it was Excellent!The lunch special was a great value. It came with 2 menu options, rice and plenty of  Naan Bread...Everything was HOT and FRESH...I will be back!"], ["Matt M.", "I randomly tried this place a couple weeks ago on my lunch break. I have to say this is damn near some of the best Indian food I've had in San Diego - EVER. Their lunch special is amazing - I had the Chicken Tikka Masala with Chicken Vindaloo and was blown away. Flavors, freshness, portion size - all were excellent. Ive since been back twice and will probably go back this week.I'd probably recommend these guys over any other Indian place in San Diego right now, without a doubt. They seem pretty new so I hope they can maintain their current quality over time, which is something alot of places seem to struggle with in San Diego. My only criticism is the service, as much as I love their food I felt the hostess/waitress was just in a daze and when asked for a \"to go box\" brought me a cup. Weird...but not that big of a deal. Id say my only real complaint is how long it took to get my order during lunch hours when there was nearly no one in there...I actually had to end up asking for it to go because they took so long. Overall - Excellent food and price. The Chicken Tikka Masala is among the best Ive ever had, really. The service is weak but maybe they'll work on that...not like its so bad I wouldnt go back, in fact I might go after writing this...I'm just being honest here. Its a great place, I'd say don't hesitate to check them out."]], "Royal India": [], "Namaste Dining": [["Daniel A.", "This is definitely my go to place for Indian food.  I probably eat here once a week and love the food.  If you want the best indian food buffet (seriously, a buffet that is actually delicious and has an amazing selection), you have to come here for lunch.  Imagine ALL YOU CAN EAT indian food, including naan bread for only $9.95!Winner:  Best Chicken Tikka MasalaWinner:  Best Garlic Nan BreadWinner:  Best Saag PaneerPS.  Ask for the secret hot sauce from the kitchen."], ["Eley D.", "Party of 6 for their lunch buffet. Looks like they switched ownership, or at least their name, but the food is still great. One of my gaslamp favs.M-Th their lunch buffet runs $9.95, F-Su $11.95. I think it is a great deal for the quality of the food. Along with the buffet, they offer a choice of plain naan or garlic naan. I have to say that I prefer the garlic, but it is veeeeeeeeeeeeeerrry garlicky so beware!!!The buffet has several salads and dressings, dips. and chutneys. The main courses offer a variety of different curries, with varying degrees of heat. Their samosas are delicious but spicy . . . yum! I prefer a tandoori chicken right off the bone, and they offered kabobs--- not my favorite.And they have some lovely desserts. They are bite sized. I believe that I have tried the mango mousse, but honestly I am usually too stuffed to make it to the desserts! Good food, good value!"], ["Zainab C.", "One word: WOWW! My family and I stopped by for the lunch buffet. Staff was very welcoming and attentive. Restaurant  was so clean and beautifully decorated- ambiance felt great. Every item we tried on the buffet stand was flavorful and delicious! Definitely worth trying if you are in the area."], ["Susan S.", "We love Indian food and it is our first choice when coming to an international city. Namaste is truly amazing. Fresh ingredientscooked with care and experience. We had masala Dosa and a vegetable korma.This is the best Indian food I've had in all of Southern California!"], ["Rahul H.", "This is my new spot for Indian lunch buffet (thanks to Brad for taking me). Namaste has the widest variety of dishes I've come across for something in this category including kebabs, which are typically seen at Pakistani restaurants. Good amount of veg options and salad but the variety of meat dishes is where they separate themselves. Great service at the bar too. You'll want a wheelbarrow to sit in when you attempt to leave."], ["Margo H.", "Terrible overpriced tourist joint. Bad food and tried to overcharge us.STAY AWAY!! We should have known, the place was almost empty on a Saturday evening."], ["Kimberly M.", "The food is very good... Everything is fresh and made to order. If you live Indian food, this place is a must try! You will not be disappointed!"], ["Louise W.", "Nick the bartender made my night! It's after 10pm and I got to eat, have a good conversation, and an amazing drink!!! Sooo happy!"], ["kelly g.", "Great South Indian food! The dosa is impressive. The cilantro chutney was a bit watery, but the flavor was nice. Glad to have a place that has South Indian options. The decor was lovely, but they had American pop music playing and a football game on all the tv's. Maybe it's just me, but I enjoy the beautiful Indian music while I'm at an Indian restaurant."], ["Nundkeswarsingh B.", "Awesome , real authentic Indian Cuisine .Chef for the day from Goa, excellent Goat curry and Lamb Briani.Chai Masala also very tasty.Will drive 200 miles again !!!!Great Place  to enjoy an spicy dinner , Medium level spices was as said and spicy indeed as describe by Marco!!"], ["Alan V.", "Although ownership has changed the food is still just as amazing... I love Chicken Madras and garlic Naan"], ["Amit A.", "Overall: The food is VERY over-priced and under flavored. The food was made by someone who does not understand Indian food. Frozen Indian food from Trader Joe's is better. The ambiance is reasonably nice. With at least 2 other Indian Restaurants within 3 blocks, try the other places.Details:FOOD: the food was poorly made. Indian food is traditionally served family style - in serving dishes with individual dinner plates. Our food was served in soup bowls and we were given appetizer plates to eat from. The Malia Kofta sauce was good, but the dish overall looks like someone threw it together. It was not cooked as a single dish.The Palak Paneer - the cheese was tough and also did not look like it was cooked as a single dish.The rice was old, dry and smelled odd.DRINK: My mojito was poorly made and served in a water glass. SERVICE: the service was pretty decent. The waiter was attentive and timely. AMBIANCE: The ambiance was ok. Indian movies were playing on a big screen. The music was oddly out of place but pleasant"], ["Jenny S.", "I host a dinner every year at Comic-Con for all my friends and colleagues - and had my original booking fall through at the very last minute this year.  Mike Reigel (Manager) and the staff at Namaste didn't just get my party in for a Saturday night dinner (the BUSIEST night of Comic Con), but went above and beyond with a beautiful, and gourmet, buffet, attentive service, prime seating, and extras included (naan, chutneys, sauces, dessert, coffee, tea, sodas all included in the original pp $).  The food selection was authentic Indian cuisine, and of the highest quality.  The choices were varied enough to cover a wide spectrum of palates, and the bar had a strong selection of different cocktails, beer, and wine.  The price was $30-35 pp, which while higher than I had anticipated was absolutely supported by the food and service.The atmosphere is open, tasteful, and offers big party options or small, more intimate seating.  The decorative waterfall is peaceful, not intrusive, and the wood etchings/carvings are beautiful.Lastly, the service was phenomenal.  I know they are a new restaurant and so on top of their game right now, but I - and my family and friends - will be back, for romantic dinners or more parties!"], ["Nagesh K.", "Good Indian food. We have ordered Spicy Gongura mutton and chicken biryani , both are really good. I have tried 9 Indian restaurants before this one and didn't like any one."], ["Andrea F.", "I'm actually really surprised by the poor reviews this restaurant received because we thought it was fabulous!!! My husband and I eat a lot of Indian food and this was by far one of the best restaurants we've been to. The corn soup was outstanding and the shrimp 65 was amazing. For dinner I got a veggie dosa and my husband got the butter chicken. Everything had a lot of amazing flavors and absolutely had not been frozen, as other reviewers suggested. We ended up taking everything...even the sauces and white rice...home for leftovers. If you're in Gaslamp and looking for a great restaurant you should look no further than Namaste!"], ["Monica R.", "Nameste is a new restaurant here in Downtown SD.Right now it has an all-you- can-eat buffet for $12. No need to wait for table. At least for now.Yum! Well spiced and tasty. Great variety. Good amount of vegetarian options. The naan was fresh and brought to our table. We asked for lemonade  and since it was not a staple the gentleman whipped it up. Delicious!We will definitely go again. I really only had a plate and half of food but it was worth it. Good for groups. Outdoor seating is also available. Great lunch time dining experience.  :)"], ["Dhwani S.", "Appetizers are good... Vegetarian entrees not worth money spent.. Navratan korma was a disaster... Paneer butter masala too sweet else would have been very good... Ambience is good for fine dining.."], ["Katie B.", "Excellent food especially the Chicken 65.  You MUST try the delicious Imly martini with tamarind and jalapenos made by Jeremy, their excellent bartender. Very attentive and friendly! An overall wonderful dining experience."], ["Juan G.", "SUMMARY: Your wallet and your tastebuds will regret this place! Usually empty. overpriced. Tikka Masala sauce tastes like canned marinara sauce!? There are plenty of much better Indian food options in SD. DETAILED REVIEW: There used to be a pretty good Indian restaurant at this location called \"Monsoon,\" but the restaurant is under new ownership and has a new name (Namaste).The last joint didn't do that well, probably because there isn't a big market for upscale Indian cuisine. Nevertheless, the food was pretty good and the servings were generous. All entrees came with a side of basmati rice. We tried out the new place on a Friday night and it was empty! The first thing the new ownership did is jack up prices (not a smart move for a business that was already struggling with traffic). Before, you could get a $14 tikka masala plate with a complementary serving of basmati rice (very common for Indian restaurants). Now, the much smaller tikka plate will cost you $18 and rice is extra!As far as taste, it's pretty bad. The tikka masala sauce quite literally tasted like canned Italian marinara sauce! Very bland. I give this place a few months before it gets sold again. In the meantime, don't go unless you want to pay $$$ for some pretty mediocre Indian food."], ["Adam Z.", "We miss Monsoon!  We ordered Chicken Tikka Masala delivered just like we used to from Monsoon (which was in the same location previously).  This dish didn't have the same delicious flavor as Monsoon at all.  Plus, the portion was small and very expensive at $18/dish.  Very disappointed."]], "Hare Krishna": [["Christina K.", "Best THING EVER! Warning: Food coma will occur 15 minutes after you eat a whole plate of Hare Krishna food. I've never had a bad experience out of the five/six times I ate here. No meat Mondays should taste more like Hare Krishna Wednesdays! I pile my plate high and usually share with another person because you will KO'ed in 15 minutes or less if you eat a whole plate to yourself. I loooooove the dessert they always have. Whatever they have, I eat. End of story. Delicious."], ["Kari H.", "Are you kidding me?! People are giving this shit 5-star reviews? Even for $4, it's awful. I decided to give it a try last week, and paid my money, and was horrified to see students descending like vultures on 2 extremely unappetizing-looking piles (troughs, really) of amorphous veggie slop. Then I actually tried the stuff-canned vegetables overcooked in a slurry of bland curry-like sauce, and canned beans in a watery swill of tomato-like substance. I suffered through about half a plateload, and started to feel well and truly sick 20 minutes later. After an hour, the battle of Kurukshetra was raging in my stomach, and I could no longer keep the food down. Shame on you, devotees! I'm pretty sure there's nothing in the Gita about poisoning non-believers. UCSD students, you can't seriously be this poor, or have such unbelievably bad taste. What am I missing here?"], ["Jessica W.", "Where else can you get a fantastic tasting, $4, vegetarian (vegan by request) lunch buffet that never disappoints?  Nowhere else that I've discovered, hence the reason that the line stretches all the way across the student center.Hare Krishna Wednesdays are more than just a weekly ritual, but a way of life.  You get all your friends together, break out the tupperware, and soak up the sun on the grassy knoll while stuffing yourself with the best Indian food on campus.  (The Govinda's in LA doesn't taste nearly as good and it's $7 for the buffet)  Drinks are included, but bring your own reusable container so you don't have to use the plastic cups.My favorite dishes would be the ones with potatoes.  Ask in advance if you're vegan and they'll tell you which offerings to avoid and bring out the special stuff hidden away just for vegans.  The rice and pasta dishes aren't my favorite, but you can't expect utter perfection for $4.The halva (sweet, cream of wheat like dessert) is my favorite part of this weekly tastebud joyride.  Blueberry, pumpkin, peanut butter -- every week there is a new type that makes me go back for seconds.Go, eat, enjoy.  You'll soon be a regular like the rest of us."], ["Tim K.", "I'll give it two stars. One for the blueberry dessert stuff, and one for the price. Those are really the only two pros.I thought the couple bitter reviewers below me were just being, well, bitter, but really, they weren't. This place (can I even call it a place?) really truly just has two piles of bland \"vegetable mush.\" And don't get me wrong, I love Indian food and all the \"vegetable mush\" that goes with that. But I found both of the whopping 2 savory options at this place besides rice to be quite bland and unsatisfying. Bottom line, if you want a lot of unenjoyable food for cheap, this is your place,"], ["Carolyn K.", "I don't know much about Indian food as I've never tried it before Hare Krishna, but the food was delicious! Three entrees, dessert and some type of juice. Apparently the menu is different every week, but the day I went there was a tomato-sauced vegetable dish, something with chick peas, and another dish of orange pumpkin-esque food. I didn't know what exactly I was eating, but everything was nevertheless amazing. Everything is vegetarian, too (: Fit as much food on your plate as you please. All that for $4. How friendly for a college student's wallet! Thank you for making Wednesdays a little more exciting."], ["Rory L.", "Super tasty vegan food, for super cheap! What more could a girl ask for? I usually go for the $4.50, stack your plate deal, but when I bring my own tuperware (they don't care about how big it is), I can feed myself for the entire day for $8. The curries they have are good and the occasional pasta sides they have are alright. The highlight of my meal is always the dessert, which is some kind of vegan/rice thing. I'm not sure what it is, but it's some kind of amazing with raisins, peaches, or strawberries in it (depending on the season). Fun fact: Hare Krishna is also here during summer school and it's way less crowded then!"], ["Dan K.", "These guys are still here on campus every Wednesday during the summer! Instead of being on top of Groundworks, they're on the ground floor next to the bookstore instead. Mad props to coming during the summer. I'm sure they don't get half the amount of business they do during the school year, but yet they come to serve us regulars faithfully. A huge plate of food is still at an incredible price of...$4. Forget eating at Hi-Thai, this is a MUCH better and healthier option."], ["shari k.", "There are only 2 good things about Hare Krishna:1) You get a lot of food for your money.2) It's vegetarian.Other than that, it is meh. The Food Co-op has much better food (the Food Co-op is that store that the Hare Krishna stand is set up in front of - they are NOT the same food/people/store - Hare Krishna just happens to set up in front of them). As a plus, Food Co-op food is mostly vegan (non-vegans don't be put off - I highly recommend that you give it a shot - you might not even notice that it is \"missing\" meat, and I am saying this as an omnivore)."], ["BETTY C.", "It might not be everyone's favorite type of food and the dishes may seem foreign to some people, but try it at least once! Some people hesitate when I tell them that the dishes are vegetarian, but the veggies are super yummy in the curry and pasta, although I can't always tell exactly what I'm eating... They have a different menu each wednesday consisting of rice, two dishes, rice dessert, and a drink. The dessert took me a few times to get used to.. I didn't like it at first but now it's the first thing I eat on my plate! =]$4.50 for a plate and you can get as much as you want. Trust me if you know how to stack your plate you can get 2-3 meals out of it each time!"], ["Stephanie C.", "WHY DID I NOT DISCOVER THIS PLACE BEFORE MY LAST YEAR AT UCSD??In some way, that's probably best for me because as much as I'm always trying to save money, I've decided that I'm already going to spend $4.50 every Wednesday from now on.What I'm curious about is what and how they make their dessert?! It's so good!"], ["Tuss R.", "Some of the best vegetarian food I have ever had! I go to UCLA but am here visiting a friend and after having Hare Krishna food yesterday, I wish I came to UCSD!Absolutely delicious and healthy.  Get in line (that moves very fast like everyone said), grab a plate (or tupperware), sit underneath the trees nearby and enjoy!Hare Krishna near UCSD, please serve more than one day a week (or have recipes of your dishes available)!Hare Krishna near UCLA, please come serve us vegetarian food!"], ["Linda N.", "I tried Hare Krishna for the first time today as I was walking out of my long ass microbio lab from 8-1p and I was starving!The food was warm and soooo cheap! That's what gives this five stars, the quality of the food (very home-cooked-feeling) for the price of 4 bucks. come next wed :)"], ["Sydney G.", "After reading others reviews for Hare Krishna I had very high hopes, but unfortunately these were not met.I am an avid lover of all kinds of Indian food, including having an Indian Roomate who's mother constantly brings home cooked meals and when I heard there was a cheap delicious Indian buffet I ran to the opportunity. Not only that, but I invited an enormous amount of people garuanteeing them happiness. Needless to say, I've learned my lesson.At arriving there was a man walking in circles who hardly noticed us. After reading others reviews I brought my own Tupperware and everything, but after filling it with the sort of canned vegetable and tomatoes sauce mixture I realized that I had wasted my time. The only thing I can mildly agree with is that the dessert was decent enough, but the hours old food was not doing it for me. Out of friends and I, none of us finished any of our food and ended up just getting somosas from the food co-op. I definitely recommend someone looking for Indian food at UCSD just make the trip off campus, because they definitely won't find anything good here."], ["Ann V.", "They're open for business during the summer too! and if you're nice enough they let you fill up your waterbottle with their tea for free ;)"], ["David G.", "Yikes!  It looks like I'm going to have to go against the grain of predominantly generous reviews.  2 stars from this UCSDer.  As you probably know, Hare Krishna serves its all-vegetarian-and-sometimes-vegan meals every Wednesday at lunchtime on the patio of the Old Student Center.  $4 for as much food as you can fit onto a plate.  Sounds like a good deal?  On a monetary basis, sure it is.  But there's a serious problem: the food is NOT actually something that I want to eat.When I was here last time, Hare Krishna was serving its usual array of mushy and pasty things.  There was one dish that looked like couscous.  It looked tasty, but good lord -- it was loaded with sugar.  It was lip-smackingly sweet.  It wasn't at all what I was expecting, and the surprise wasn't a pleasant one either.   Next up: a spinach dish.  This concoction looked vaguely like saag paneer, but didn't taste like saag paneer.  Instead, it was completely bland.   It sure felt rich, given the way it sank to the pit of my stomach, but it didn't taste like anything.  Finally, to wash all this down, I had a glass of fruit punch.  Somehow they even screwed this up -- again, it was loaded up with obscene amounts of sugar.  It tasted like molasses thinned out with Kool-Aid.  I thought vegetarian food was supposed to be healthy.  Hare Krishna is going to give me adult-onset diabetes if I can ever manage to learn to actually like the food that they serve (or, alternatively, I guess I could always force-feed it to myself if my blood sugar falls too low).Once again, I get hungry and UCSD fails me.  No fair."], ["Jessica H.", "The food at this place is great. We ordered a cross-section of about five different items and everything was great. The curries come in a bowl that is in a holder with a candle underneath to keep the food warm longer.The biryanis and naan were fresh and flavorful.Reasonable prices, a good amount of food and it's a clean place."], ["Lauren B.", "-What a deal.  $4 for a large plate of food.  It's all vegetarian and mostly vegan.  The dishes are packed with beans, lentils, and veggies.  mmm.-Meal also comes with a refreshing juice drink-Every Wednesday at the old student center at UCSD-I bring my own plate and cup, but they provide all utensils.-I don't like all the dishes (and they ca change each week), so some Wednesday lunches are not so great"], ["Diane I.", "Definitely the Wednesday tradition. Most of the courses are pretty good. Every once in a while they have some misses - beware of the white yougurty sauce.It's definitely the dessert that jeeps me coming back for more - even if it is just fancy cream of wheat."], ["Rob D.", "Possibly the only good food in the UCSD area.  And CHEAP.  Bring your own bowl, you wastrel.  It's $4 for all-you-can-eat (I usually throw in the extra dollar to make it $5 since I can't believe they're making any money and I don't want them to stop doing it).  If you pay $6 you can eat all you want, plus take a plate to go.  Unbelievable.  The dessert definitely is weird in texture and appearance but it tastes GOOD and that's what counts.  If you're vegan, ask the guy who's serving the food and he'll tell you if something isn't vegan and he'll give you the vegan option from the secret stash.  I do have to say, these guys are the least pleasant krishnas I've ever encountered, but that makes them still more pleasant than the average stranger so it's okay."], ["Timothy N.", "I've eaten at this place around 4 times.  I was a vegetarian for about 5 years and I think I would've liked this place.  Even though I like the food I don't think it deserves an average rating of four stars.  Four stars might be a little misleading to people who are visiting UCSD or those who don't like vegetarian meals."]], "Indian Grill": [["Sunny K.", "The staff here were very friendly and helped with things like the outdoor heaters without much prompting :)The food was tasty and fresh - with the mango lassi and garlic naan being particular stand-outs. The service was a lil slow, but then again it was busy, which is a good sign!I'd definitely return and it was a great touch to meet the owner, Mayur. Good luck on this new venture!"], ["Julio O.", "This place is awesome! I love the food and this is coming from somebody that hates trying new foods. I will recommend to anybody, the water is not a big deal and it doesnt taste funny!  The food and service is what matters the most. Mayur the owner is a very friendly owner and he cares about the people and makes sure that everything was up to par. I will keep coming back to this place. If you want to try real authentic indian food I will highly recommend this place. Nice and friendly environment."], ["Christine E.", "Having lived in NYC for nearly a decade, I'm spoiled.  The Korma here is spectacular, rich and full of cashew warmth.  Vindaloos and Rogan Josh are spectacular.  Also, they offer goat on the menu, and excellent quality (not the tough boneless but bone-in falling off the bone tender and delicious!).   I highly recommend!!!!"], ["Katherine S.", "Had dinner there tonight with my mom who is not an Indian food kinda gal. I had the malia kofta and she had the Indian baked wings. All and all the food wasn't bad, not my favorite but certainly not the worst. My mom really enjoyed her wings and honestly they were very good, but my kofta just wasn't what I expected, but was still tasty. The owner was there and was very friendly and the service was great, very attentive and knowledgable. I had my one year old which me who loves to make a mess and bang plates and the staff and owner were great with her and her rice mess she left on the floor! Would defiantly go back but I would just try something else."], ["Mary C.", "Just discovered the Indian grill, simply delicious. Had the veggie samosas, and Indian wings highly recommend them.  The food was great and discovered Indian medium is HOT but addicting. Also had my first and 2cd Indian beer   The owner, and staff were so nice and helpful definitely coming back soon. Buttered naan bread see you soon"], ["Pranali T.", "The food here is absolutely awesome!!!! This surpassed Himalaya Indian cuisine by eons! About time San Diego got an authentic Indian restaurant!Chicken kheema, paneer bhurji and malai kofta are a must try. The papad is complementary and is fried fresh for the table. Our host Mayur made our day by his friendly nature!I'm definitely recommending Indian grill for catering my office meetings."], ["Mike A.", "First place I have ever had curry.  LOVE IT!  Have been back several times after being recommended by a Scottish chef friend of mine."], ["Sarah L.", "I just moved to Old Town and have been wanting to try this place for a while. I was not disappointed in the least! Everything, from the appetizer, to my vegetarian meal to the naan bread was incredible. I don't eat Indian food that often since the spices and oils are usually too heavy, but this is the only Indian food I've ever had that didn't make me feel that way! For any vegetarians out there, check this place out. The veggie options were great and all looked incredible. Also, I loved how attentive the staff and owner were. They came out and made sure everything was great. The garlic naan bread is incredible. I will definitely be a regular from now on and I encourage anyone who wants something that's not the typical Old Town Mexican restaurant to try it!"], ["Markusdimonio ..", "Best Indian in San Diego you have to give it a try great service great atmosphere the owner is very friendly the food was absolutely delicious."], ["David B.", "Great service, Better food!An complementary appetizer of papaddum and sauces were brought to the table quickly.  We ordered samosas and Our dinner quickly followed.  Channa masala, dhal, chicken vindaloo and chicken tikka (grilled) all came out hot and beautifully prepared.The prices were quite reasonably. Around 10 a plate even at dinner time.Having had a lot of Indian food in my life, I was very impressed.  Dishes prepared with some modern twists while still maintaining classical Indian taste.  Wonderful!We are only here for a week and may come back again. That is how good it was."], ["Victorya J.", "My dad was wanting to try some Indian Food so we yelped some places and I was scared of some of the uncleanly review from other Indian restaurants in San Diego but this place looked really clean - and it was. My husband, me and my dad sat outside, they have a open patio area that was super nice. The food - delicious. And the beer was yummy- I got a Hayward 5000 and it was citrusy and light but also 8%.  We had the Vegetable Pakoda, these were battered veggies deep fried and they came with cilantro sauce and something else and we also had the Indian Grill Wings. Then we had the Tandoori Mixed Grill platter (the lamb shish kabob was my favorite), Chicken Tikki Marsala (this was my overall favorite), and Chana Marsala (hint- if you order something vegetarian, it comes out spicier). The Chicken Tikki Marsala was so delicious, great texture and spice. We finished with the Rasmalai - which is like rice meat, sweet with a pistachio flavor. yum!!! The recommendations came from our server Estal, she was so helpful. And the manager Mayour even came out to check that our spicy levels were on point. MUST TRY THIS PLACE :)Oh. PS- Nick Hardwick loves this place!"], ["Rajesh K.", "India grill is a good quality Indian restaurant with great outdoor seating. The owner is an awesome guy who made sure you had a good experience. I rate the service top notch. The food was really good. We ordered the planner butter masala, vegetable korma and malai kofta. The naan was so soft and the entrees were top notch. Overall a good Indian restaurant and a must visit. As someone from Portland who misses good Indian food I will come back."], ["David T.", "In the past I've been pretty indifferent about Indian cuisine but I had a vegetarian friend with me who wanted to see Old Town so we gave this place a try. No regrets here! Not only was the food great but the service was extremely helpful and friendly. I had the chicken Madras which came highly recommended and I can see why. The taste was indescribable..a delicious blend of spices. My friend had a vegetarian Masala cream curry dish (sorry don't remember the exact name) and that too was delicious, way above my carnivorous expectations. Again, I've never been a real fan of Indian food so it's hard for me to describe some of the dishes and flavors but I do however know good food and this is it. A hidden gem in Old Town as its on the \"quieter\" side of San Diego street in a peaceful patio setting. Everything about this place is good!"], ["Sean M.", "Eaten all over the world indian food. This is up there with the best. The variety of location-based dishes was great. Every region was covered. I had a goat dish that was outstanding. Wife had vegetarian did get to taste she wouldn't allow me. Don't let inside dacor change your mind. Simple dacor, outside is very nice food out weighs any hesitation that I had and should do same for you"], ["Reshma M.", "Not sure how this restaurant gets 4.5 stars from? Does this restaurant chef know how Indian food tastes and looks like? Veg Samosas were horrible - flat triangle with weird spices and tasteless. Daal Makhani was undercooked & thicker than jelly. I had to move the rice toward the Daal to mix it 'cause the daal wouldn't move in my plate. Order was not taken correctly as well. Never going back. I wish I could give zero stars."], ["Alex S.", "Good food and excellent service.  The wings were great as was the chicken korma.  Would definitely recommend.  A welcome change to all the Mexican restaurants in Old Town."], ["Daniel R.", "Been to decent number of indian spots and san diego spots especially beong a native and they bring some very tasy top pallet indian spice to old town, great place, great staff, dog friendly patio, well priced, I recommend"], ["Shivali K.", "After a long day in SD, we wanted some good Indian food. Unfortunately the restaurant was under staffed, and the food was extremely spicy. When we informed the server that the appetizer was too spicy for us, the dinner entrees came out even spicier. Definitely will not go back."], ["Laura L.", "I took my mother here for her birthday. The staff was very friendly and recommended the channa masala and the coconut curry (can't remember the name). The food was pretty good I liked the channa masala the most. Garlic Nann was good too had the right amount of garlic and butter  (most importantly it was fresh). I really enjoyed my hot Chai tea  (better to save it for dessert). The staff sang for my mother and brought her a little dessert  (sweet cake ball I forgot the name of the Indian dessert) it was really good. I have had that dessert at Indian buffets and this one was much better. Perhaps because it was made fresh. I liked that you can control how spicy you want your food here too. Overall it's decent Indian food in a casual environment."], ["Niza B.", "I had given up on finding Indian food this good outside England. It's the only edible food in England so we ate a lot of it and learned to really appreciate the complexity of flavors. When we got back we were excited to eat more of our new favorite food... Except we couldn't find the depth of flavors anywhere... Until now! Majur, the owner, could not have been more gracious and welcoming. The three of us ordered chicken tikka masala, madras lamb and a veggie dish that was one of our favorites but we can't remember the name of. Darn! We also had garlic naan and the wings! Everything was packed with layer upon layer of flavor. We had so much food that we invited the owner of Mermaids Cove down the street (where I work) to come down and help us finish. He loved it too! I can't wait to return and have another awesome meal.... Maybe lunch today! Ps. The patio is dog friendly! Street parking was easy, and right in front of the restaurant, but remember that this is Old Town and you might get the opportunity to walk your dinner off for a few blocks returning to your car."]], "Flavors of Mayura": [], "India Palace": [["Carol F.", "I've ordered off YelpEat24 and every time they deliver its fast and hot and soooooooo delicious.Let me tell you Mild is Mild and medium is spicy, spicy is fiery and so on. So make sure you know how much heat you can handle.I try something new from the menu every time. Absolutely love Indian food because of this place."], ["Philip G.", "I'm a big fan of Indian food. This place has high ratings and high prices but fails to deliver quality. Last time I ate here I thought that it was just an off night for the chef. This time, I'm sure they cut corners and hope the Americans wont be able to tell that the product is sub-par. The murg (chicken) tikka masala sauce was flavorful but the chicken tasted dry and probably came from Thursdays buffet. There is no way that chicken was cooked within the last 24 hours. The other entree we ordered (channa dal) was runny and bland.The garlic naan, chicken byriani, samosa and chutney were tasty and fresh so the Palace earns 2 stars.  If this place was low budget fast food, the mains would have been a disappointment. Because the (small portioned) entrees cost $15 and $11 each (à La Carte), it feels like I got swindled.Although some of the meal was good, it was hardly worth the $76.00 bill. This was a delivery so that does not even include drinks or a rubdown. At least the food came quick. I pray to Fishnu (the porcelain God) that I don't get food poisoning."], ["Jasmine R.", "My girlfriend and I come here all the time whenever we are in the area and we love it. Good quality food and excellent customer service!"], ["J.ariosto G.", "I  have mixed feeling on this place. On the one hand very good food. On the other almost entire wait staff sucks.Wanting to discuss somthing important with my oldlady I figured its a good excuse to go out to dinner (always on a budget this dont happen often) she says she wants some good tikamasala. My roomate aways orders from here so we figured why not. We go in and asked if there any availanle available  seating outside. The kind waiter says sure  anywhere you would like. 10 min later I have to go back in because no one has even brought us a menu. Another couple came in before i complained and were seated by the waiter and handed to menus right away.After confronting them about it. Waiter apologized and brought us water as well. We have to flag down a waiter to actually place an order. We ask him about a couple different questions which were mainly answered by oh yes very good. We asked for 2 orders of naan one garlic one regular. 2 orders lf tikamasala and 2 orders of rice. 30 minutes go by and a diferent waiter brought us each thing. But only one basket of bread and one order of rice.We ask the last waiter who comes. Why only one order. And he says oh you want second order ok and trys to run off to get it I said no I was just wondering if its two orders worth or not. It turns out rice is unlimited they just bring it out hot everytime or else itll be cold by your second serving. Which made sence but no one ever told us that besides the one guy i finnaly was gonna argue with. He seemed to know exactly why we were frustrated apologized and explained it all to us.  The naan was all put in one basket a d you can differenciate by the cloves on it. I got to say though even though the service sucks I will keep goibg there because the food its self is above par. Atleast in my opinion : )"], ["Tahara L.", "I get delivery from India Palace about every six weeks. It is spot on delicious every time. I get the appetizer sampler every time (perfect to split with two) - and I keep trying a new 'entree' to order.Delivery specific: always timely (if not early!), and worth the price!"], ["Eric C.", "Great food and service. Saag paneer was great consistency, lamb masala was great and new to me...they have 2 versions....traditional and kabob style. I went traditional. Rice was ok...just had plain basmati. The homerun was the kheer dessert. Best I've ever had. I eat Indian food weekly.4.5 STARS"], ["Dcudney13 P.", "Amazing! My favorite place to enjoy authentic Indian food.I eat here atleast once a month.murgh makhani is to die for"], ["Kimberly H.", "I arrived and to my surprise, this place was completely empty. We were immediately seated by a lethargic woman whom I presumed to be the owner of the joint.I thought the decor to be quite charming and fitting for such cuisine. But the place itself was filthy! There were three employees, all of them were lazily standing by waiting for their master's command. What happened to taking initiative? Don't just stand there when you can be doing something productive. It's not like there was a lack of things to do. As I said, the place was absolutely filthy! Vacuum the carpet, wipe down the tables!When I took my seat I noticed the table was a bit dirty and when I touched it, I felt the stickiness of it. \"Whatever, I can deal with that,\" I said to myself. But that was only the tip of the ice berg...I hate places that leave their silverware on the tables because they are usually dirty. Who knows how long they've been there, unwashed, possibly touched by previous dinners who left when they realized what a mess this place was. I check the silverware and low and behold, it was dirty. There was a nice piece of God knows what. I asked to get a new spoon. The waiter went to the back, came back, and gave me the exact same spoon! I have an anxiety disorder, but I don't get anxiety attacks often. When I saw the spoon I lost it. I ended up having an anxiety attack... I was having trouble breathing and I felt paralyzed. Why would they give me back the same spoon? Unfortunately, me and boyfriend had already ordered so I just sat there waiting for him to finish his food, which he barely touched. I just looked at him. I was so upset I was nearly in tears.I felt so bad about the whole experience, especially because it was my idea to go there in the first place. I rarely pay for anything when I go out to eat with my boyfriend, ya' know, because he is sweet and like to treat me, but I felt so bad I insisted to pay for my mistake."], ["Priyanka L.", "If you are looking for the DESI taste, go for India palace. The buffet is truly appreciable."], ["Stephanie P.", "Place is situated in a strip mall in hillcrest..Looks like a hole in the wall restaurant from the outside,but it's a different environment inside..you can take your date out to this place and fool them thinking its a plain restaurant but actually it's elegant inside..an ideal dinner date..quiet inside..relaxing..wine are offered..there's a separate dining patio area..food was really good..I had a deep fried onion appetizer (forgot what it's called) and the fish masala, with rice..overall it was really good..sauces, dips, masala, rice..price is a bit in a mid range but it's acceptable..I'll come back here again maybe today..before I head back to bay area"], ["Summer S.", "Not hangry, but thought it best to eat now and be prepared for how the rest of the day unfolded.  I was enticed into this small Indian eatery by the aroma.  It didn't look busy, but it was early, so I took a chance.  What a lovely little break from a questionable Monday.  I was seated immediately, of course, and was  served a large glass of iced water, on the side were mint, lemon and lime slices. The lunch menu was one page with seven choices, cool, wasn't into thinking too much.  I randomly selected and the food just started flowing out of the kitchen.  Little plates of fresh herbs and accoutrement, samosas, saag aloo, and finished with a lassi.  I guess my surprise is based in the quality in such a small place on a Monday.  Bravo, you couldn't have been more gracious."], ["Daniel K.", "As someone with experience in a professional kitchen, I am familiar with markups, etc and understand the cost per serving ratios .  I've been to well spoken eateries and marvel at the nerve associated with what the plate cost to make vs what I am charged.  With that in mind, I had my credit card ready to take a hit after all the gushing reviews of this Indian place.  The service and civility are beyond any I've received barring Michelin star.  The food and beverage were artistic masterpieces and it overwhelmed the table with abundance.  Taking a deep breath I open the bill to a very modest bill in comparison to the food and service received.  Please support this fine establishment."], ["Vinay A.", "A restaurant that charges U for pickle with food. A restaurant that willCharge u to even have water one day or breath. Their reasoning. - we pay a lot of rent so we have to Nickle and dime you for everything. Good luck guys. Don't waste your money here. Better quality elsewhere. What a waste ofMy money."], ["Nicole D.", "This is my go-to spot for Indian delivery. I have not had one bad thing on the menu and I love that they don't use styrofoam for most of the take out items. Tonight I went in for a take out order and when I got home, I noticed the sauce was overly creamy. I'm not one to complain, but I just couldn't finish the dish. I called the restaurant and they were AWESOME. They not only recooked the entree, but they went above and beyond and delivered it to me!! They also tossed in a dessert. I wasn't calling to \"look for anything,\" but really just wanted them to know there was a problem. The entree they delivered was on par and the gentleman who brought it even commented on the dish I showed him and that he felt it was really creamy too. Having worked in restaurants myself for SEVERAL years, a true mark of a restaurant that really cares about there customers is how they handle mistakes."], ["Fabian K.", "We have ordered delivery the last two weeks and it has been excellent! The food is piping hot and neatly packaged.  We have ordered two vegetarian curries and enjoyed them with garlic and plain naans. The portions are large and the flavor is great. The delivery services is actually pretty cool. You place your order through Yelp/Eat24, then it tells you how long it will take and sends you a tracking link to your email. India Palace has made their deliveries in about 30 min. Again, the food is hot and the contents are nicely packed, nothing leaking and nothing missing. Looking forward to trying the restaurant in person."], ["Amanda P.", "I wanted to give this five stars,  but my companion hated the chicken in his tikka masala, so I wasn't allowed.  This is a pretty casual place, at the end of a strip shopping center.  The place appears to be pretty clean, but kitschy decor.  About exactly as expected for this type of place.  I loved the food.  I had buttered chicken, he hd chicken tikka masala and we both had garlic naan and chutney.  He loved the sauce of his meal but said he didn't like the chicken.  I loved the chicken in my buttered chicken as well as the sauce, which I ordered spicy and was still very edible -- not too much fire.  I'm not sure what his issue was with the chicken, but whatever.  Service was friendly and fast.  Food was very very good.  The cost for all of the above was $37 plus tip.  Not bad for San Diego."], ["Evelyn R.", "I ordered delivery from here and it was about 30 min late, as it seems some other people experienced. The food was decent but it was CRAZY spicy. They offered 4 levels of heat and I asked for the second lowest. I almost couldn't even eat it. I would say go with the mild just to be safe, even if you think you like hot."], ["Antonio G.", "Id give it 2.5 stars as it was just alright.  Samosas were big and flavorful.  Spinach dish was meh.  The fish was alright, not much for what we paid for.  And service was pretty good for us.  Heat is from 1-10.  And apparently 3 is nothing, 4 is barely mild.  I was missing some depth of flavor in the saag.  The green masala condiment was not very fresh tasting or looking.  I'm used to a bright vibrant green with some kick in the flavor.  This looked and tasted like they made it yesterday or even days ago.The chicken tikka masala is $15.  I think I will stick to tandoori hut very close by with dinner buffet for $12!  If I ever come here again, it's be just for lunch.  The value was underwhelming for $45.  2 entrees, a naan and 2 samosas.  They must have a ton of profit with such little portion and inexpensive ingredients.  I've had way better Indian in artesia in LA.  The Himalayan place near phils is really good btw, much fresher and amazing lamb chops.  Try tandoori hut if you're in hillcrest.  Everything there was delicious.  We didn't go as it was late at night and didn't want the end of buffet meal w dry food that hasn't been replaced probably.  if we can't get there by 8-8:30, we don't bother.  Hope they improve.  I love Indian food and would like fresher offerings when I'm paying top dollar.  Ppl can eat out for $25-30 these days and expect great food.  Don't give me blah and small portions for $50 after tip, we will likely not be back.  (Even for $30, i would've been disappointed)."], ["Debbie A.", "Ordered through Grub Hub and they delivered quickly, but usually indian restaurants give you one piece of naan per plate, with the option to buy additional naan. I have NEVER been served an Idian dish without naan.  You have to BUY the naan to get any with the meal.  They are $3 each! So, to get what I would normally get served free of charge (the first naan) I'd have to pay 3 for me, and 3 for my fiancé. Our dishes were $15 each, served with plain basmati rice; no sides.  No small cup of lentil soup, or a few ounces of salad. Plus, the food was just \"okay\". Indian food is known for their range of spices and heat.  The chicken masala and lamb korba were bland and had absolutely no kick.  My fiancé and I LOVE authentic Indian food full of spices with a bit of heat. We are not ordering from here again and will NOT recommend India Palace to anyone."], ["Stephanie A.", "This review is based on delivery, using Eat24. It's Friday night and boyfriend and I don't feel like cooking. We've ordered from this place before with pretty great success, and the curries have always been tasty. We placed a $44 dollar order and waited. And waited. And waited. About 10 minutes after an hour, we get in contact with Eat24 and try to figure out where our order is. Jeanette gets in contact with the restaurant, they send out a trite apology, say they're slammed and our order is on its way. Gotcha, this stuff happens.20 minutes later, our beer buzz long gone and getting cranky, we poke Jeanette again. Boyfriend mentions that they are less than a mile away from us and tell her that it doesn't take 20 minutes to drive a couple of blocks down.  She empathizes with us, asks us how we could possibly remedy this situation, and my partner suggests getting a discount. 1 hour and a half later, the driver gives me a call and asks me if there is a way to get into my apartment. I tell her I'll meet her at the door, and she doesn't even get out of her car. I have to walk down to the street to retrieve my food, where she apologizes and lets me know that she thought that my street was on the other end of Downtown. That's 15 minutes away by car--would it kill your drivers to have GPS? I know it's a couple of blocks away, but for some reason India Palace couldn't get this right.I come back in, partner says that they will not honor a discount, and he promptly mentions that he'll be leaving a bad review on Yelp, and they immediately quip that they will be willing to take off 10% of our order. That is my driver's tip. Mixed appetizer was $9 and what came in the container was a soggy mess: two sad samosas, a dry soggy (how does that even happen?!) chicken pakora, two limp pieces of potato, and a piece of fried cauliflower. Definitely a waste of money.India Palace, your customer service is in the shits and we could have easily ordered from Bombay--a great Indian place just down the street from us. We didn't feel like coming out of the house, and paid for that luxury, but business 101 if you've gone done fucked up, own up to that shit!"]], "Spice Lounge": [["Audrianna R.", "Good Chicken Masala and cury. The nan with cheese is great. Family that owns it really great people. Authentic."], ["Emily S.", "Food is consistently good :) and appreciate the check in offer.. I usually get the vegetable karma (add garlic naan of course) and my dinning buddy orders the chicken tikka masala (also with garlic naan). And the mango lassies complement it well. The chocolate samosas are really good too!"], ["Shannon T.", "Great atmosphere full of culture! The food was delicious, we got the vindaloo and tandoori chicken. We loved the music and the service was awesome!"], ["JL L.", "I really enjoyed this place - quick service and great ambiance! The bar is a nice addition too! I didn't order any drinks, but they did have a good happy hour menu for drinks between $1-$2. I noticed the lady at the table next to us ordered mimosas for $2!The only reason I didn't give it 5 stars is because i noticed the chicken tikka and shrimp pakora was a bit salty. It wasn't overwhelming but it was definitely noticeable. It may just been the mix that evening so I won't totally rule this place out just because of that. On a more positive note, the garlic naan was very delicious and a must-order!I'll be coming back here soon! :)"], ["Jenn C.", "Lovely ambiance, new, modern, nice decor. I had the lamb vindaloo. It was decent. The lamb was tender and flavorful. However, the sauce did not taste very authentic. It was thinner, and more of a thin tomato sauce than other Indian places.We ordered beers, and they basically filled them up with 3 inches of foam at the top. If you know beer glasses, you know that the width accounts for a lot of volume. Filling it 3 inches from the top, where the glass is twice as wide, is basically giving you at least 30% less beer, if not 40% less. I asked mine to be filled up more. I have never done this before, but 3 inches of head was just out of control.I used my Yelp check in offer to get some free calamari. It was quite good, crispy, flavorful rings, with a chutney sauce. Loved the sauce. However, it was about 8 calamari rings (about an inch and half in diameter each). The appetizer is $8 regular price. I would not pay regular price for this.Service was a little scattered. They were pretty slow to take our order. They forgot to give me my beer. Then they charged us for 2 extra beers which we did not order.They had a happy hour sign outside with some pretty good deals. Unfortunately, we missed it by a tad."], ["Kristin P.", "Small place with great atmosphere.  Cute candles and lanterns all around.  Fun music and a slideshow of the staff's travels to India playing on a flat screen, along with an Indian movie on another.  The food was great and delivered pretty quickly.  I enjoyed this restaurant."], ["Aga P.", "I was here few times and I always enjoyed the food!"], ["Julianne S.", "Maybe it's just me, but with Indian food, the cheaper the price, the higher the quality. I thought the chicken masala here was really salty and watery. The samosas were decent (cheese ones), but c'mon, you gotta nail the curry to earn street cred."], ["Teja C.", "My girlfriend and I ordered takeout from this place so I can't speak for the ambiance, location, or service. However, once the food arrived ($2.50 delivery fee), it was quite delicious! As an Indian, I can spot authentic Indian food and this place's take on Indian fusion hits the spot (perhaps that's why some reviewers don't think it's authentic?). The garlic naan was well flavored, not overpowering. The tikka masala was rich and creamy and the vegetable jalfreezi had a subtle taste of coconut milk that made it delicious. I'll have to visit this place soon but as far as the food goes, I'd recommend it!"], ["Tim S.", "Really good food. Spicy, and flavorful. Great service- really, really friendly people. Will come back again for sure. The best Indian food in PB."], ["Trevor M.", "Wow. So good I went back within the next few days!I got the tandoori chicken with garlic naan, and aloo tiki as an appetizer. Was seriously the best food I've had since I moved to Pacific Beach a month ago.Spice Lounge has made me their new best customer."], ["Paulina B.", "My husband and I went to try a new Indian place in PB. We looked on yelp and saw that spice lounge had pretty good reviews so we decided to try it out. We ordered the chicken tikka masala and the lamb vindooree (sp?) and holy crap was it good! The lamb was so tender and VERY spicy. My spicy pallet is seasoned (as my husband called it) and his well not so much so he thought it was overwhelmingly spicy but nonetheless delicious. Will definitely come again and will recommend to anyone in PB looking to try some Indian food!!"], ["Carolee B.", "We bought four Indian cook books after eating in what we consider the best Indian restaurant in Northern California. Failed miserably at duplicating it. We are picky about Indian food.  If I lived in Pacific Beach, I would throw every cookbook away and just come here to eat...often.Red and white Sangrias had a nice twist and you know, things I like, I try them twice.Chutney sampler: two out of three were dynamite. The green and mango chutneys were lovely and the red was a nice contrast though nothing special on its own. Veggie samosas were tasty by themselves and with the chutney.I was a bit disappointed in the choice of rice (I like Indian brown or safron) until I tasted it. It was fragrant and tasty basmati and after this, I promise to give it a chance again.We had the mixed vegetables and tofu masala with cheese naan. I could have been rolled from the establishment. I ate too much and my poor tummy was so over used. But everything was hot, steamy, fragrant and a pleasure on the lips and tounge.The staff were really welcoming. They explained the plot of the Bollywood movie playing at the bar and recommended others when we told them which we liked. All were very sweet and helpful. The fire on the far screen, was a nice touch.The atmosphere is casual romantic and I would spend a lot of time here if I lived In town."], ["Dan H.", "Everything was very good; saag, masala, nirvana, tandoori, all good. At these prices, a very easy choice. Little neighborhood joint, really casual."], ["Ben C.", "The only two reasons for this place to get three stars is because:1. The garlic naan was kinda chewy. Coming from a tandoori it should have a golden crisp on what you add a bit of butter. Maybe it was too much butter maybe not2. Raita should have a bit thicker consistencyOther than that, this place is highly recommended!!! Lamb saag has been something I've been missing and while working in an Indian restaurant myself, I can def say that it fulfilled all the requirements for an amazing Indian curry.Too all the Estonians wondering if to go there: kindel värk, ei jäta külmaks."], ["Borneo G.", "This place is JUST okay. Here's my take on it:First off, we went here in the early afternoon so it definitely wasn't crowded. There was only 2 other people in the restaurant.  Not to mention this place is tiny. Our service was extremely slow. I don't know why. We only ordered 2 entrees. I tried to justify it, believing that good food comes to wait.As most yelpers wrote, the food here is good (which is why this place is getting 3 stars instead of 2), but I think it's a little bit more on the expensive side for what you get. I've personally had better, cheaper Indian/Himalayan food; I only went here because I wanted to take a friend out on her birthday. And to top it all off...they got our order wrong. After all that wait, wouldn't you think you would be a little more meticulous and get it right? We didn't send it back because we were too hungry. :-/ At least it tasted good....I will say that our server was nice and checked up on us every now and then. So kudos to that.We didn't feel like going far and being that she lives in PB, we decided to go here. I think I should've been a little more proactive in going to Downtown instead of this place because I wasn't that impressed."], ["Traci B.", "Again another amazing dinner at this insanely beautiful restaurant. Raj, the owner accommodated my boyfriend and I along with 18 of our friends for a bday dinner and it was out of this world. We will always recommend this fantastic restaurant. Best Indian food in town."], ["Andre L.", "I have ordered from Spice Lounge a few times and I am a fan of their menu. Really good food, full of flavors. Delivery was reasonable; about 40-50min. The only reason why I am giving a 4 star rating is because portions are a bit smaller than normal."], ["AKSHAT K.", "Very good food , loved the mango lassi ( feels like homemade )"], ["Christian M.", "9:45 on a Sunday night in summer and we're told the kitchen is closed... I would be pissed if I were the owner... Next time we are at our place at 9:30 and are thinking of a place where we can get a late night meal, Spice Lounge won't pop in our head. Especially since it's now 10 pm and most of our other options are closed. :/"]], "Village Indian Cuisine": [["Tyler B.", "If you're looking for authentic Indian favors and options, this is the place to be! My lover and I came in during the evening.  Loved the selection of vegetarian options! 100% tasty!To start off we got the vegetable Chana samosas, which started the dance on our taste budsWe ended up getting the Eggplant purée and the ALWAYS delicious Saag Paneer. They had just run out of mango lassi's, but the service was friendly and informative. The atmosphere was positive and appropriate, with light music and beautiful tapestries and artwork. We give this Indian dining experience an \"A\""], ["David E.", "Great find!! My wife isn't the biggest of Indian food fans and she LOVED the Tandoori chicken. Really good. Son got lamb masala super spicy and loved it. I got the chicken tiki masala and it was excellent too. Swift service, super nice folks. As Arnold would say, \"we'll be bock\"!!"], ["William S.", "Came here right after opening at 11am. Very curious to see how good quality Indian buffet food they serve in this small restaurant. From 11-3pm is their buffet. Cost is cheap at 8.99 M-F and 9.99 sat and sun. Parking was an issue as many businesses share the small parking lot. To be honest, this was my first time trying out Indian food. Didn't know what to expect, but I was in for a treat. I'm not really into curry, but the Indian version of curry was a pleasant surprise. I tried the chicken tikka masala and I swear there was a lot going on in that curry. Lots of flavor and spice sang a sweet saffron song inside my mouth. Samosas was crispy and potato filling inside was a bit much in terms of fullness. Tandoori chicken was a bit dry and seasoning was a bit salty. The naan bread was fluffy awesome to use to dip with the curry sauce. Biriyani chicken basmati rice was a bit dry but good spices. Saag paneer (green curry) was not spicy at all and a welcome addition with the plain white rice. Achari chicken was good with me with mild heat spice level. There was salad, orange slices, and rice pudding for the side items. Staff were really friendly and helpful. Bathroom was unisex yet well kept. There's a TV that plays hindi cinema music videos. Funny thing is that I recognize some of the movies that the songs are based on. This place may have set the bar high for Indian food for me. This place is literally 3 mins. away from home. Small selection of buffet items but price is really good for what you get. If you are in the area craving for hindi cuisine, try this joint out. Jai Ho!"], ["Piyush A.", "If there was a star less than 1, i would have given that too. The food here was so bad. I went for a lunch buffet and tried almost every item on the buffet and I can say that every single one of them sucked!!The food tasted so bland - no good spices, less on salt, not well cooked. I was really very disappointed with the food here and just wanted to get out of there asap. Indian food is considered to be one of the best varieties of food because of its rich spices and authentic taste, please don't spoil that taste for everyone!!"], ["Frank L.", "Great place awesome service. Had the tikka masala and its was creamy, aromatic and chicken was moist. The saag paneer was delicious and lots of goat cheese. My fish curry had moist perfectly cooked fish chunks and the curry was savory and spicy. Next time I'll ask for medium to hot spiciness. Definitely coming back."], ["K H.", "This place is a hidden gem. For our vegetarian day we ordered the bahngan bartha and saag paneer with vegetable samosa and magi lassi. Their buffet for $9.99 seems like a deal since it looks really good but since we can't have any of the lamb and chicken today we decided to order from the menu. The mashed eggplant was well flavored and the spinach was tasty as well. The vegetable samosas have more spices than other Indian places so it was more flavorful. Will definitely come back to try the buffet on our non-vegetarian days. :) wish it was in more convenient location for us coming from point loma."], ["Anastasia M.", "Today I was having dinner with my husband and I have it Chicken korma is delicious!!!! Thanks guys for dinner!!!"], ["Adam A.", "We made an order through yelp ! It takes more than two orders and a half to deliver the food ! And the food wasn't hot when they made the deliver !!!!!"], ["Maneka S.", "Great spot to get my indian fix, usually come for their buffets that end at 3pm, always on point Thanks!"], ["Janel P.", "I was really impressed with this spot.  It was very clean, small, and simple but one of the best Indian places I've ever been.  I will definitely go again when I'm in the area. I got the shrimp masala and my bf got the chicken tikka masala based on the reviews.  Both were so good!  So much flavor and large portions for a great price!  Combos come with your choice of naan.  We got garlic but there are multiple options."], ["adda w.", "Cheap and Close to my house, what more can a girl ask for!?! Ordered the chicken mahkni and garlic naan. For the price you pay, you're getting your money worth. Shareable portion. I wished my food was spicier but the guy was nice enough to bring out more dry spice."], ["Nhu N.", "Never heard of this place before until my friend brought me here. When I came in, I thought we were supposed to order at the register since it looked like it. But they actually sit you down and you order at the tables. Indian food usually fills me up really quickly so my friend decided to order one appetizer and one entree combo. We ordered the vegetable samosa and the chicken tikka masala. The vegetable samosa was good with the green mint hot sauce that they provide. It was crunchy on the outside and very soft in the inside. The chicken tikka masala however, was delicious! I wish it was a little spicier but the overall taste was great. They were really generous about their chicken which was a plus. I don't know what they put in their rice but I love the texture of it! I could eat it alone if I wanted to. The prices of these dishes were affordable! Service was awesome. It seemed like only one person was serving but he did a really good job explaining the dishes and being attentive to us."], ["David L.", "The curry is so good, we will make this our regular stop for sure.  The people in the store are also very friendly and helpful since this is our first time here.  Good food and service all around."], ["Tammy I.", "Still hands down the best place for Chicken tikka masala. I noticed that their prices went up $2 since the last time I've been here. But it also now includes rice which it didn't use to before. So that most likely accounts for the difference in price."], ["Henry R.", "Service has gown down hill and  current employees are not customer focused; Many items on menu are not available. And this has happened on several previous occasions. Food is ok. I woukd not recommend anymore this restaurant unless they cater to the customer I was there for lunch and opted not to have buffet. I was told that i would have to get my own water and dishes etc.  NO SERVICE. Finally they relented but this should not have been an issue. Perhaps the staff does not realize they have to focus on the fact that this is a restaurant in America and not in someother country.  And customers are American used to American standards. The bathroom cleanliness is also gone south. If i could give them no stars or negative stars, I would."], ["Silvia S.", "Found GLASS in my curry chicken ordered to go!!!!!!!!!!!!!!!!!!"], ["Erin C.", "9.99 for the lunch buffet on a Sunday around 1. Only ones in and then a few more parties trickled in shortly after us. Not the very best Indian food I've ever had- it is more of a fast food/casual joint. Decent selection in the buffet included one beef, two chicken curries, tandoori chicken, four vegetarian options (Channa masala, saag paneer, daal, veggie korma), some fried carby options, dessert, salads.. Big plus of Halal meats :)! Flavors were nice but not vibrantly outstanding-- a bit mild/watered down-- but everything for the price was perfectly okay by me. Maybe I'll order off the menu next time to see if there's any difference. If you're picky, you might want to pay more elsewhere for those really rich, homemade, slow cooked, curries."], ["B S.", "Great cistomer service! Good value for the lunch buffet! It has wonderful fresh food! Try it yourself! Free Parking is okay with only a short walk. Very convenient off the 163 and 15 freeways. The Naan is especially good!"], ["Irene P.", "I come here twice a week. I order always the same :TIKA MASALABuffet every day until 3pmto die for!"], ["Casandra P.", "Amazing customer service, very attentive! Brought my dad here for an early dinner, our first and definitely not our last trip here!"]], "Urban India": [], "Punjabi Tandoor": [], "Tandoori Hut": [["John K.", "This place is close to my place and i eat there about 10 times a month. If it wasn't 10/10 i wouldn't eat that much there. Go place, good management vi recommend it. John K."], ["Rick C.", "Great food! We enjoyed ourselves.. ...... Came with family on vacationGood good good"], ["Honey B.", "Smallest selection of vegetarian buffet items I have ever seen at an Indian restaurant! Literally there were only three vegetarian dishes besides rice and condiments! The whole rest of the buffet had dishes that contained meat minus the desserts!Speaking of the desserts, the rice pudding was watery but did have cardamom pods which I appreciated. The mango pudding tasted as if it was on it's last leg, and was! The next day for lunch I had my leftovers and had to throw it out because it was rancid!Also they were supposed to be open for another half hour, but the woman was rushing me and said it was to go only. Even though there were groups of people inside. I am assuming she wanted to close early. Right before I walked in, she was saying goodbye to some guy saying she would be off soon. Anyways, service was average once inside and fast. I had higher hopes for this place on my trip but not every meal can be amazing, or at least good."], ["Rachana W.", "I always trust Yelp when it comes to restaurant selection but this time Yelp disappointed me. We went for the dinner buffet and not even single curry was good. I don't like to give negative reviews but food was not at all good. 822 reviews with more than 4 star??  By the way the promotion going on is \" Review on Yelp and get 10% discount and you need to show that the review you have given is good\" Not at all recommended"], ["Faisal T.", "He asked people to post review to get 10% off as a discount.It's a bad way"], ["Kimmy Y.", "All you can eat for $12.99!! What a steal! I mean deal! :)It's not a super big place but there's enough tables for parties. It's served with garlic or regular naan and they have about 6 different curries including the popular chicken tikka misala, tandoor chicken, and the green cheese one (sorry, I don't remember the name). The buffet didn't hold a LOT of food so a lot of it needed refilling but if that means fresher food, by all means!Service was really good and you can also get your own water at the fountain machine. Don't forget to check into Yelp for a 20% discount!"], ["Volkan Y.", "Very good buffet, reasonably priced with many authentic food options, very friendly staff, nice decor"], ["Kelly O.", "Tried the lunch buffet again and, damn, it was really good that day! Better than I remember it being previously! There are a LOT of dishes on the buffet. The pakora--which I thought was subpar last time--was good. Maybe everything was fresher than day. I tell ya, my opinion on this place is much improved. What a great deal for $9!!!"], ["Jennifer F.", "I love this place!!! Best Indian food ever. I took my husband this time and he's a fan. Will be coming back soon can't get enough lol"], ["Jeff W.", "We stopped in for lunch today and enjoyed the buffet.  The choices were a little limited, but they were delicious.  Complementary naan comes with your meal.  If you are in Hillcrest, stop in and give it a try!"], ["Haroun K.", "Technology is already passing me by.  Since when could you order delivery on Yelp? There we were, on vacation in this strange and lovely town, and totally dead tired and starving.  Not dismayed by the Yelp app on my old phone constantly crashing, I was finally able to get an order in via Eat24. It arrived over an hour later, but still hot.  And it really was fantastic.  The palak paneer, the chana masala, the samosas, the naan.  All fantastic.  5 stars. The rice pudding dessert was a bit abominable, so don't go for that.  But everything else was divine.  Of course, the delivery person from Eat24 was out of her gourd, and they don't include cutlery, and they took forever, but such are the evils of these new economy delivery services I suppose.  If you're living it up at the hotel and hungry, open your Yelp app, give yourself an hour or so, and try Tandoori Hut!"], ["Alexandria R.", "Came back again! The lunch buffet is just as good as the dinner buffet if you can make it on time!"], ["Angelo M.", "Great place! 12.99 dinner buffet. im stuffed!! Multiple selections, i recommend the chicken tikka masala. They have awesome garlic naan too!"], ["Ali L.", "Tandoori Hut is the one place you should go for authentic Indian cuisine! Their yellow daal with rice is phenomenal and the vegetable samosas are very flavorful and crispy. When you walk into the restaurant, you immediately smell the spices and quality of their cuisine! Highly recommend to anyone in the Hillcrest area! Amazing"], ["Deniz A.", "Great food, reasonable prices. The naan was amazing as well as their curry dishes! Lunch is served here till 3:30."], ["Mushfiqur R.", "Good food with friendly service. There are not much item for lunch buffet. Chicken tikka masala is good one. Overall food quality is average."], ["Will L.", "Lunch buffet and DINNER BUFFET!! Most Indian restaurants don't have dinner buffets but this one does! It was really nice because for dinner they still had a selection of choices and got to try many different entrees at a very reasonable price! Lunch is $8.99 and dinner is $12.99. My Indian friend said the food didn't taste very authentic but my other friend said it was okay. **Be cautious of this restaurant's reviews because they have a promotion to receive a discount if you write a review. And they check over your review too so I'm sure many are artifical."], ["Kathy N.", "Nothing too special about this place. It's a pretty standard indian buffet, although not as fancy and clean as some other places are. I came here to try the dinner buffet. I was hoping there would be samosas, but noo... You have to ask for the garlic naan, they will bring it out to you. Drinks are not included. The chicken dish rice pudding and mango pudding were my faves."], ["Ophelia L.", "The food here was soooo yummy! If I was ever craving for Indian food in SD, I would go here!My group came here to eat lunch. They have a $9 lunch buffet, which was awesome. We got garlic naan, paneer pakora, saag paneer, mushroom masala, chicken tikka masala, tandoori chicken, chicken jalfrezi, lamb curry, the sweet donut ball, and mango mousse. Everything tasted great. We had mixed feelings on what was spicy though. I love Indian food, but I was never a fan of tandoori chicken, but I thought their tandoori chicken was the best I've ever had, it was juicy meat and not dry. We also felt that this Indian buffet has a distinctive taste - a good one."], ["Jim B.", "I ordered through the Eat24 app while staying at a hotel. The good was absolutely delicious! Despite delay of ordering through app, it was piping hot and packaged well to avoid spillage.My reason for the three star rating has nothing to do with the food. It is more a common sense issue. When delivering to a known hotel, please be courteous enough to include napkins and, more importantly, eating utensils. I had to call the hotel desk and wait for utensils to be delivered.Again, food was absolutely amazing!"], ["Lorine C.", "This place was excellent! Low key atmosphere and friendly staff. I had the lamb tikka masala which was tender and flavorful. The bf had the buffet which he says was delicious. Much better value than some of the \"fancier\" Indian places around here but good was better."], ["Michele I.", "Best paneer I've had in a long time! The buffet is a great mixture of some favorites."], ["Nikki B.", "Came here for their dinner buffet and I was not disappointed. My favorite entree was the chicken tikka masala. It was made just right! If you're not a fan of buffets there is a menu to choose from as well. The employees were helpful with explaining their dishes and overall the atmosphere was great. The prices are reasonable and for the food you get, I have to say it is worth it! They also do lunch buffets for 8.99. I know I will be returning in the near future."], ["Love R.", "I just finished puking for about a solid half hour and have gnarly runs.  Thanks for the food poisoning. If I wasn't starving I wouldn't have ate that food you served me, it was so bad my friend took one bite and stopped eating. So sad to have spent time and money at this place."], ["Jerrid B.", "Straight forward authentic Indian restaurant, I usually have the Chicken Vindaloo it is delicious and one the better ones to be found in or near San Diego. I tend to eat Indian or similar cuisines quite often as they are one of my favorite and as a result this has been a mainstay for my dining needs when in the area. The restaurant is clean and has a nice decor, additionally, the staff are attentive and polite. This is a locally owned place to eat. I have not had the buffet because I like my food spicier than most, however, whenever I am here it seems to be a popular choice. Above all for most is cost. The food is incredibly affordable and reasonably portioned. Give it a try I'm sure you'll like it if you typically enjoy Indian food.P.s. If your a spicy lover like me and you ask for a 10/10 you'll actually get a 10/10 unlike some places that don't trust you know what you're asking for!"], ["Saravana R.", "Budget restaurant with a good night buffet. I tasted and enjoyed the mango mousse, raitha, garlic naan, chicken tikka masala and tandoori chicken. For 12.99 it is a great value. Only Road side parking which is free but difficult to find. Restaurant is silent and has some Telugu songs playing in the background. Try it if you are in the San Diego downtown area!"], ["Charles K.", "Came here for all you can eat. Dude food is delicious. If you've never had Indian food before, this place is the bees knees. Tons to choose from and very clean. Also Bollywood playing in the background makes digesting easier. Ayyyeee lmao!Will be returning!"], ["Justin F.", "First time having Indian food and I got to say, it's pretty good .. They had a good selection for the all you can eat buffet  .. Would definitely come back for more"], ["J A.", "Great food and great service. Good variety on the buffet and the price is good. Plus they play Indian MTV (yeah it's a real thing)"], ["Jet C.", "Best buffet this side the Mississipp. Food is always hot and fresh and the service is great. Will come again."], ["Jesse J.", "Solid place for yummy Indian cuisine. Their spice is spot on and it's all for an affordable price here at the Hillcrest area. Easy to find location and very easy going atmosphere. I recommend the Lamb Vindaloo for all you heat seekers and the Chicken Tikka Masala for those who want to try something tasty without too much heat. Also Garlic Naan is a must have. Will be back for sure."], ["Aditya M.", "Best restaurant! Delicious, tasty food. I want to eat here all the time.Highly recommended!"], ["Zoe K.", "The food here is classic Indian food. I've only had the mattar paneer, garlic naan, and samosas. The portions don't look that big, but you fill up quickly. Everything is tasty and leaves nothing to be desired. The sweet chutney that comes on the table is amazing, too. They have a really good deal for the lunch and dinner buffet, which I'll have to try one of these days.The people who work here are all very nice.Definitely check this out if you're in the mood for Indian and/or if you're a vegetarian."], ["Kurt F.", "Amazing food and service.... Attractive renovations and booths....and it smelled really yumie walking past"], ["Mathew W.", "Takki masal and chicken tendoori are well made and has that amazing kick of Flavors. Oh and the garlic naan are my favorite"], ["Stacey S.", "Came back again. Absolutely love this food. I always bring people here when I have friends visit san diego. Highly recommend!"], ["Eva K.", "great indian food!  We had the Indian buffet for dinner and the saag and chicken masala was fantastic!"], ["Austen C.", "I really had a hunger for chana masala today, and was glad to find that they had it as part of the buffet. The garlic naan was piping hot and had fresh garlic on top - very yummy! I had a glass of Tropiche red wine and it paired perfectly with my meal. The rice was cooked perfectly and the vegetable pakora was crunchy and my daughter loved it too. The ambiance is simple and parking is just 5 dollars in the lot a block down, so it's very affordable. They have music playing and MTV India on a few big screen TVs in case you need a distraction."], ["Tommy T.", "For the price ($12.99), it is pretty decent for AYCE. The quality doesn't compare to punjabi tandoor but it is good if you're looking for abundant and decent Indian food!"], ["Evan M.", "Lamb korma was bomb. Tandoori chicken is good. The buffet is a good value. Would come again!"], ["Laura D.", "First time here. Came with my husbands family(12 people) for dinner. To start, the customer service, well it's hard to explain. There was only 2 people working and the cook in the back. Very sweet people. Service was good but they were confused on what was on the menu and couldn't answer questions concerning spices or how the meal is cooked etc. All the food was amazing! However the veggie biryani was a little off and spicy. The night we came; the restaurant was out of many things because they didn't get a delivery in. The saag paneer, chicken tikka Marsala, garlic naan and aloo was my favorite. They have a dinner buffet but starts at 5:30pm. There is a lot to parking in the back. It's currently $1.50/30 min. Lots fills up fast. Not a lot of street parking. You most likely will need to walk to the restaurant. Prices are pretty fair, but slightly more expensive. You will know what I mean if your from L.A county. Worth trying and I will be back the next time I am in town."], ["Jason H.", "First time trying Tandoori Hut. Good food at a great price. The lunch buffet is awesome. Service is great. I'll definitely be coming back."], ["Kesia W.", "This place is awesome! They are very friendly and helpful. And the food is great!!!! #thebestindianfoodintheworld"], ["Sud V.", "one of the best paneer tikka masala i have ever had in US ! Thin n perfect garlic naans... Overall amazing food.. Must go place in San Diego for Indian food lovers.. Ll definitely come back again.."], ["Skye V.", "The lunch buffet is $8.99 plus tax. You pay after you finish the buffet. (Also if you review them on yelp, you get 10% off). Water cups are free and they're pretty strict in making sure you only get water in there.They had chicken korma, chicken tikka masala, and beef curry for their meat curry. I always liked their meat curry more than vegetarian curry only because their vegetarian curry isn't as spicy as I would like it to be. My favorite is definitely the chicken korma!!!!!Their dessert mango mousse is amazing!! Tastes exactly like mango instead of some mango powder. Definitely must have!! I wasn't a big fan of their rice pudding but it wasn't that bad. The restaurant itself is really nice and doesn't look run downed. Very cute setting for lunch or a nice dinner. Really recommend for a lunch that will make you filled up for a really good price! :)Total: $8.74"], ["Erika B.", "It is very nice to find a buffet that offers dinner. The food was very good and the naan was delicious. Nice clean restaurant and overall a pleasant dining experience."], ["Kim L.", "Delicious food! Came here with some friends twice now. The buffet dinner is a great deal. The staff is lovely too. :)"], ["Tasha N.", "My boyfriend and I finally got a chance to come here after reading all the great reviews! I originally was thinking we'd come and get the buffet but instead we decided to order the tikka masala with lamb and the chicken vindaloo along with both garlic and regular nann. We were super pleased with everything we ordered! The masala in particular was on point. We will definitely be back soon!"], ["Matt K.", "Great place, very reasonable price for the buffet, great food especially the masala my favorite"], ["Karlo K.", "Today was a bit extra spicy loved every bite , love this place the price and the awesome employees, they have morning and dinner buffet prices ,"], ["Luisa S.", "The food is decent but the service is atrocious.  I forgot why I stopped coming here but was reminded today when servers forgot half of the items our table had ordered. They were eventually brought 20 min later. There are better Indian places in the hood, avoid this one like the plague."], ["Jen H.", "I ordered take out from here and while everything we ordered was tasty, they forgot our naan! It did come with the largest order of free rice, so I guess I can't complain too much. I'd really like to try it again because the tandoori chicken was good enough to do so."], ["S R.", "We stopped by at this place to have dinner buffet yesterday and can say that food was horrible! It seemed none of the dishes had any salt. Naan was good enough. Service was just fine. One star for bad quality of food."], ["Alicia M.", "Lunch buffet was delish....chicken tikka masala on point! Came here for the first time and I will definitely be back!"], ["Nat A.", "So so good! The lamb curry was awesome!"], ["Lakmal A.", "Food was great , staff was very nice and the restaurant was clean. Also great is thy they give a naan for free with buffet purchase"], ["Samuel W.", "Great dinner buffet value. Veggie parkora was great. Goat curry was also delish! Food was hot and ready to be consumed. Thanks!"], ["serina c.", "Was not expecting too much from this place but I wanted to try some different options other than my favorite chicken tikka masala. What way better to try a variety of different dishes than a indian buffet. I loved the fact they did not skimp on the meat choices here. Normally places only have 1 or 2 meat options and the rest are just veggie curries or with some sort of bean in it. This place had tandoori chicken along with 2 other chicken curries and a beef curry and a lamb curry. Wow that's awesome they had such a variety to choose from. The naan was sooo good. So worth the cheap price.Sucks the parking is such a pain in hillcrest or else I'd come more often"], ["Joanna M.", "Not the best food. Chicken isn't authentic tandoori chicken. Authentic tandoori chicken is cooked in a clay oven. This chicken is broiled in a regular oven. The vegetable dishes are not cooked well. The service was rushed and terrible, no refill of water and they'll kick you out early and collect their money before you finish your food. Not a good place to eat."], ["Lane M.", "Out with the diva, noshing on some aromatic delights. That buffet is super tasty, even for those of us who prefer non-flesh in our diets. Good deal, and not just yelping happy because it's going to save me 10% on my ticket (but what an idea...)Totally recommend if you've got to eat and don't have time."]], "Sundara": [["Sai S.", "Indian Pizza!!! Place to go after a tired day of work. Ambience was just great with hospitable folks aroundOrdered paneer tikka pizza to start with and then dal makkhini side dish with Naan and riceSpice level was perfect and flavor was amazing! The presentation topped it all, clean crisp and luxurious. The food was not costly for the area and quality offered. Just can't beat this restaurant Will keep coming again and againPS: if you could add DOSA + Sambar to the menu it would be great. Your minimalistic menu is intriguing"], ["Songbird G.", "It's a tiny little place tucked away on the way to point Loma. Parking behind the restaurant for a few cars.Ambience: it gets a little loud and so I guess private conversations are a bit difficult. We went on a Saturday date and still had a great time!!Food: We ordered Cheese naan(a very pizza-fied naan was brought out) and it was delicious. We gobbled it up while still hot and the cheese, liquidy. The Vindaloo with vegetables and the saag paneer were delicious. Samosas were crunchy and the filling spot on(even though they were not authentic samosas the outer layer was made of spring roll paper). It took very little time to clean-lick the samosa plate with their chutneys. Usually Indian food leftovers taste bad the next day for whatever reason(mostly it has to do with the restaurant quality). We had our Sundara leftovers the next afternoon and they were still yummy! So yes, take those boxes home people. Don't waste the food! I think they make their own sweet chutney and wow! It had an amazing zing to it. The food was beautifully presented and the wait staff was especially awesome and caring. We ordered a spice level 7 and the vindaloo was steaming spicy wile the saag paneer was just right. I suggest going down a notch for the vindaloo gravy.One star off for: Lack of dessert options. They have \"rice pudding\" or payasam as it's called in south India but that is the most basic and boring pan-Indian dessert to have at a restaurant for 5.50. I'm sure it would have tasted great.Another thing I noticed is, when a large group of guests left, the waitress just wiped off the rice from their table onto the floor!! :-o :-oI am very particular about rice wastage especially, as it is a value taught in my household that rice signifies prosperity. My plates are clean when I finish eating without a single grain of rice left in it. Seeing a few spoons of rice just dropped on the floor(instead of a bin) to be stamped upon was a bit upsetting."], ["Beau S.", "I'll never eat Indian food anywhere else again. If I was traveling through India, I would have GrubHub fly Sundara's Tandoori Chicken across the ocean to India. That being said: get the Tikka Masala, Spicy Baby Back Ribs and Tandoori Chicken. And they have a solid draft list. This is a great date spot for sure when you're in the doghouse.... Because they'll get you back on track."], ["Peijean T.", "It's like a secret within a secret...OB (Ocean Beach) feels like a best-kept-secret neighborhood in San Diego, and this little restaurant is even more off the beaten path while throngs of people run amok at the restaurants and bars along Niagara and Newport Avenues.The sell here is that it's Indian cuisine meets craft beer. The dining room is quiet and intimate, and the menu offers homestyle curries that feel wholesome and comforting. The owner isn't Indian but he's somehow created authentic fare, from the chutneys, to the naan and the saucy, flavor-filled curries. The menu isn't too big, but they seem to know what they do well. My friends who are regulars brought me here last weekend and we ordered the Vindaloo (just a little spicy) and the Tikka Masala, and added cheese naan and all three of the chutneys. We also ordered the Indian-fusion spicy pork ribs appetizer which I highly recommend. My friend told me that the paneer (cheese) when ordered instead of meat is presented in one big slice versus chunks or small pieces.I'll definitely be back, especially since my friends are already hooked!"], ["Angel L.", "A very cozy/quaint Indian restaurant. Serves beers and wines, even rum mango lassi! I didn't have any of the drinks, but the prices are reasonable. Wednesday evenings feature $10 off the wines by the bottle!What a gem!Overall, the following fed 4 guys and a gal. We were all pretty full with this amount of food. The curries may look small in portion, but the flavors are really intense, and you will eat plenty of rice and/or naan with it before you get to the bottom.Our orders, with unlimited rice(!):Apps - samosa (comes with Tamarind Chutney and the Mint Chutney)Spicy Baby Back RibsChicken Tikka Masala PizzaTandoori ChickenThe samosas may be a bit pricier than you expect, but it is really well executed crust and filling. It is both crispy and soft. The chutneys are also really good. Others who tried the mint chutney said it was really good, as I am not a fan of mint.The pizza was just amazing. I've had Indian style pizza elsewhere in Miramar, but that was underwhelming and unremarkable. This pizza though, exudes Indian in and out. The pieces of chicken hide inside the sauce under the cheese. Based on the size of the chicken I think it was ground chicken.The ribs were good, but it didn't scream indian to me. Anywho, very tender and full of flavors.Tandoori chicken: juicy! flavorful!Naans:Garlic/Cilantro naanSesame nannAll are fresh and fluffy. Can't resist fresh baked breads of any kind!Curries:Dal MakhaniChanna MasalaChicken VindalooAll the curries were delicious! Of the 3, Dal was the least intense in terms of spice and spiciness. It is a really good dish to order if you're just going to eat it by yourself. Channa was also delicious but the spicy is significantly stronger. The garbanzo beans are very very tender. The Chicken Vindaloo is the spiciest of all. The chicken was very tender, but it does not absorb all that heat from the sauce.Dessert:Authentic Rice Pudding: topped with almonds and pistachiosI had a few bites of this. The spice is just perfect, and I must say, this will not shine without the crunch from the nuts. Not too sweet at all. I loved it."], ["Leslie G.", "Finally gave Sundara another shot.  This time we got take out.  Ordering on their website was super easy.  Everything was hot and ready when I arrived.We had the channa masala and dal makhani.  Both were great, I'd get the same order again.  We also got regular naan and garlic cilantro naan (which I didn't eat due to my aversion to cilantro - vile weed!).  The naan was great.  Side of raita was also great.I really appreciated the packaging for the to go order.  I usually avoid getting takeout because I hate all the styrofoam waste, the food is usually spilling out of the packaging, and sometimes the portion size is smaller for takeout, so it will fit in the box.  We didn't have any of those problems with the takeout at Sundara.I would absolutely get take out again, but I still don't think I'd try eating at the restaurant after our first experience."], ["Amina M.", "We ordered:Chicken Tika MarsalaPaneer MarsalaSamosas The food came at a great pace although services was just a tad slow.I had no choice but to give it 5 stars for how great the food was. Best Indian food restaurant in San Diego. Don't forget to order the rice pudding. It's to die for!"], ["James K.", "A friend recommended this place and I'm happy they did.  It's quite out of the way for me, but given all the positive reviews, I was eager to try.It's right on a main road going into Ocean Beach and very easy to find.  Parking is another thing.  There is street parking but it's quite limited.  I came on a Sunday evening and it was quite full.  Always a good sign.  Even though they were quite full, they still had a couple of open tables and we had no reservations.  We were seated immediately on the back patio.  The main dining area inside is quite small and most of the tables seem made for two, but they can easily accommodate a table of four (or more I suppose).  The menu is quite limited but full of the traditional meals one would expect in an Indian restaurant.  We had the garlic/cilantro naan bread to start with.  It was somewhat greasier than I expected and under cooked.  We both had the Tikka Masala with chicken.  The basmati rice was average at best and the chicken was quite dry.  The Tikka Masala sauce did taste as expected.  The portion was quite adequate and despite first serving of bread, we ordered more and it just came out the same;  kind of soggy and for something with garlic and cilantro, while I could certainly see it on the bread, I couldn't taste it.I had black iced tea to drink and this was quite disappointing as it tasted like something instant.  I would absolutely be shocked if they say it's brewed.  But what is really shocking is that most fast food restaurants serve fresh brewed iced tea so it's sad that I have to have instant tea at a place like this.The restaurant is quite nice and definitely very quaint.  They also serve quite a few local microbrews.  But the menu is limited and the food was average at best.  Kind of a fun place to try but honestly there are many other truly great Indian restaurants in San Diego."], ["Jeb H.", "Sundara is a good Indian restaurant with some very tasty dishes! They've also done something really smart, which is offering delivery in Ocean Beach and Point Loma. Since OB is perpetually 420, I'm sure they are making a killing with their delivery service (you can order through Yelp or on their website)! Just be patient as delivery usually takes 45 mins-1.5 hours.I have ordered several items for delivery, and most of them are really good while a couple are \"meh.\" My favorite item has to be their Spicy Baby Back Ribs appetizer. It comes with two large, very tender, baby back ribs in a dish with a really delicious dark sauce. True to it's name, the sauce is a bit spicy, but just the right amount! I like the sauce so much that I also order a plain Naan because it's perfect for dipping in the sauce.Also good is the order of Samosas. Two very crispy samosas are in each order, and they're packed with a mix of vegetables including potatoes and peas. I love that they come with both a tamarind sauce and a mint chutney because they impart two very distinct and different flavors to the samosas.I've also had the rice pudding, which is OK but it's too runny. The Chicken Tiki Masala was mediocre because I think the sauce could use a kick of some additional spices. Judging by the Yelp reviews, some people love the Tiki Masala, but it tasted kind of \"blah\" to me. I'll still order delivery, and some day I may actually trek to the restaurant itself."], ["Ravi R.", "This was one of those unexplored places. One of my friend had recommended this restaurant some time back and one fine afternoon we decided to just drive there and see what it has to offer. Well, to start with the welcome at the entrance till the time we left the restaurant, it was a very pleasant experience.Even though this place offers Indian Food, none of the people working are Indian but wait till you read the rest. They not only offer great service but the food was really delicious as well. We asked for some onions and the guy (who was serving us) obliged us with a plate of sliced onions, chilies and some lime. I am sure they understand the Indian culture and the way of serving Indian food and that's the reason they are so popular.Well, I would definitely like to come back to this place. Good Luck, guys!"], ["Priyanka B.", "We ordered1.samosa2.panner tikka masala3.sesame naan 4.rice pudding5.dal makhaniFood was really good. It comes with basmatic rice bowl n the quantity of rice is preety good it serves 3-4 ppl ."], ["Akshay P.", "Wow, this place had the best ambience I have seen in an Indian restaurant in US. Very creatively designed interior, themed really well, each and everything looked perfectly in sync with the theme. Nothing was out of place. All in all a perfect place to have dinner. Coming to food, short menu could be a negative for some people but I believe it gives them the option to concentrate on what they are best at rather than cramping hundreds on items and none of them tasting well. I loved the food. We literally ordered almost half the menu and everything was perfectly cooked. Chicken was tender and exactly the way i  expected it to be. We asked them to make it spicy, and probably one of the rare occasions when the spice level was perfect. All in all, a must go if you are in San Diego and want to try some Indian food. Can't wait to be there again."], ["Estefany B.", "So, I think living in Nor-Cal for 2.5 years has ruined Indian food for me. For whatever reason, Indian restaurants there are plentiful and amazing. Ever since I moved back to SD I have not been able to find anything that compares. Sundara is not bad by any means, it was a convenient fix for my indian cuisine craving. What makes this place even better is that they deliver (dangerous commodity, really) From here I've had the samosas, masala paneer, saag paneer, several types of naan.... and while everything is good, the real winner for me were the samosas, specially with the tamarind sauce. They were of good proportion, seasoned to perfection, filled with all the right stuff and not super oily. Also, perfect to share with someone. Trust me, if you're here order the samosas!  Long story short, Sundara is one of the best indian restaurants in the OB area. If you're feeling lazy and don't want to get off the couch and stop with the House of Cards binge watching.... just pick up your phone and place the order. That may or may not have been exactly what I did. (Hint: it was. )"], ["Bobi M.", "We got the chicken tikka masala. It is not as creamy as a butter chicken. Good flavor though.I have two words for this place: CHAI TEA!!!Best chai I have ever had....they make their own recipe here, and it is spicy good! Fresh ginger for the win!!! I came in to eat not feeling well, was achy from fighting a cold coming on....this food was healing!!!Between the spice and warmth of the chai to the tikka masala....I slept good that night!The cup of chai was small, but the waiter asked if I would like a refill at no chargeI would seriously buy chai here everyday if I lived in San Diego!This restaurant is small, more seating in back. It has nice ambience though.Parking can be difficult...very busy street."], ["Tiffany M.", "Sundara is a very special gem in Ocean Beach. Small place but comfy, cozy, and great ambiance. It's decorated with beautiful lamps, lights, and succulents. However the decor and restaurant environment doesn't come even close to the food. I have made two visits here and the first visit was impeccable. My boyfriend and I got the Mango lassi, Chicken and Vegetable Tikka Masala, Veggie Samosas and chutneys, and garlic naan. The dishes are also served with a huge portion of Basmati rice. We were blown away. Great flavor, quality, and service. However, my second visit was this past Thursday night. The food was not as good as the first time. My boyfriend and I got the Channa Masala, Paneer Tikka Masala, sesame naan, and mango lassi. The sesame naan was subtle in flavor which made it delicious. Paneer Tikka Masala was comforting and warmed us up  however the Channa Masala was overwhelmingly salty. It was disappointing because Channa Masala is my all time favorite. I think tonight was just an off night but I still love and believe in this Indian gem. I informed the server of the super salty Channa masala and she was very nice about it. She asked us if we wanted another dish and I ordered the Vindaloo to replace the Channa Masala. The vindaloo was much more spicy and rich in spices and flavor. Sundara is a nice little oasis to go to for comforting Indian Food and a comforting environment."], ["Kim P.", "Really wonderful Indian food! You cannot go wrong with any of their currys! It comes with a big bowl of rice and the naan is super good too. The prices are really inexpensive! Also on Wednesdays there's a discount on bottles of wine! They've got a cool back patio as well. I don't think it's dog friendly. It is however pretty classy! You won't be underdressed but it is a really nice place. They also do a lot of to-go orders. Loved this place. Fine dining in a casual setting. Really excellent food and drinks too."], ["Adam T.", "I was stoked for this highly rated Indian restaurant so close to my house.  It took me a while to get out here just because it was on the back burner.  I actually swung by here one time on a Tuesday but they were closed.One of my favorite Indian dishes is vegetarian vindaloo but it was my least favorite dish I tasted at Sundara.  It was just too tangy and acidic tasting.  I also found the ordering system a little impersonal.  You just check off what you want on a piece of paper and hand it to your server.  Everything else was just fine but I just wasn't as excited leaving as I was going in."], ["Ross B.", "Small restaurant with indoor and outdoor seating.  Small, but well balanced menu.  Appetizers were good, entree was good and so was the dessert. Would visit again."], ["Melissa H.", "The best Indian food I've had so far!!!! Went to SeaWorld for the day ended up pretty hungry by dinner time and found this place on yelp. Great staff, cute and cozy atmosphere, and excellent food. Cheese Naan strongly recommanded!!!!!! (Garlic is also good)We ordered the chicken tikka masala pizza, which was amazing. We ordered three curries: Tikka Masala with veggies, Saag with Chicken, and the Vindaloo with Chicken. Vindaloo is medium spicy while the Veggies in Tikka Masala are mostly brocolli, couliflower, and green peas."], ["T L.", "I come here every time I'm in OB.THE best Indian food I've had in San Diego.Staff is very friendly and food gets to you quickly. Location is great, they have an outdoor seating area with tons of plants and candle lighting.It can be pretty busy during weekends and when you get in they'll ask for a phone number and send an automated text when they are ready for you, which is very efficient. Take a walk down Newport and back and they'll be ready for you. Definitely worth trying, I took two of my friends who had never had Indian food and they absolutely loved it."], ["Kelly O.", "Before we came, my eating partner was like, \"Come on...an Indian restaurant in OB? You know it can't be good.\" To which I replied, \"But there are so many great reviews!\" Indian is my favorite cuisine, yet living here in SD I rarely get to eat it because there aren't many good Indian eateries (and I live so far from Black Mountain Rd.) As we were driving there, I read more and more of the reviews and came to a frightening discovery: several of the reviews from prolific people with tons of reviews (i.e., people I trust more) were not good.So...I had a bad feeling.And sure enough, my feeling was correct--but too little, too late. The cilantro garlic naan was not good; it was doughy. Added nothing to the meal.The saag paneer was generous with the paneer cheese, but it had an unusual flavor and thickness. It did not taste like other times I've had this dish. It just simply didn't taste that good.The chicken tikka masala was also just a bit off. It didn't have the wonderfully complex and deep flavors that you expect in this dish and in much of Indian cooking. It was just Meh.The rum mango lassi didn't taste of mango nor rum. Just tasted like thick yogurt with a tiny hint of fruit.Even the raita wasn't good. It seemed like yogurt with a few pieces of cucumber in it. It was thicker than usual and didn't have much flavor.The samosas were good.Service was nice, and prices were ok, but the food was lackluster and flavors were off. Sorry, Sundara, you are just not my cup of tea."], ["Sarah B.", "This is my favorite Indian Restaurant in San Diego. Sundara has a friendly and CLEAN environment (not always the case at other Indian establishments). I recommend the Saag curry as well as the Tikki Masala. The naan is very fresh also. I've been going here once a month for a while now."], ["Nam N.", "I had initially wanted to try out Sundara as their website stated they delivered to all of OB and Point Loma. But when I tried to order online for delivery--it said it wasn't available for me. I called in and the guy who answered also said they didn't deliver to my area----strange because I live off of West Point Loma and Nimitz. Oh well... I had to run an errand anyway that night so I placed a take out order.Since I love leftovers (and Indian is fab the next day!), I got:- Samosas- Chicken Vindaloo - Garlic NaanThe samosas were great! Crisp on the outside and filled with tons of spiced and flavorful goodness. Their tamarind and mint chutneys were tasty as well!The Chicken Vindaloo was average to me. It seemed to miss the deep, spicy flavors which I love about Vindaloo--and it was \"tomato-ey\"....if that's even a word. Come to think of it, it reminded me more like a tikka masala than a vindaloo.Garlic Naan---delish. What's not to love?Over all, the food was okay for me and perhaps I would try the Tikka Masala next time. If they delivered to mi casa, I would definitely have it again for convenience. But it was ready for me when I came in to pick it up. And the servers seemed nice, too.ps. Street Parking can be a bit tough at night but you can find parking behind the restaurant."], ["Samantha S.", "One of our favorite places! Never disappointed! The tikka masala is one of the bests I've had. I also like the Chana masala. The nan is made fresh and is delicious. The restaurant is small but cozy and very nicely decorated. If you're in Ob, you should definitely try it!"], ["Su B.", "I don't know, you guys. I love Indian food but...The samosas and papadum we really good. The chicken tikki masala and paneer vindaloo were not. Maybe I came on an off night, but I stopped eating my masala because I just didn't like it- too salty/tangy. I asked my friend if I could try her vindaloo in the hopes there would be some vindication for the masala, to no avail. The naan was different but OK. So bummed because the reviews had me looking forward to a delish Indian dinner. I liked the intimacy of the restaurant and the service was very attentive and friendly. Also, there's parking in the back. Maybe it was an off night....."], ["Dave M.", "Take order- had the spicy ribs, chicken tikka masala, cheese naan and chicken vindaloo. All was amazing, just fantastic food. Excellent curries, excellent food quality,Very tender meats. The online ordering and pickup were perfect, order 100% accurate, greeted with a smile. This is one of my very few 5 stars... Well done Sundara, very well done. You made Indian work in OB. Very Caveman friendly as well."], ["Charles K.", "I'm a huge fan of Indian food, so I was pleasantly surprised and excited to find a place ranked 4.5 stars on Yelp. After having done a little bit of research on this place I figured it was worth a shot. My dinner, shared among a total of four adults, consisted of: samosas, chicken tikka masala, chicken vindaloo, tandoori chicken, and two pieces of naan(1 plain, 1 garlic-cilantro). The ambiance of the place is great, it gives you a hole-in-the-wall feel with pleasant waiters/waitresses. The price is more than fair as the quality of the ambiance and the quality of the food was good. But why only A-OK (3-stars, as Yelp likes to refer to it as)? The entire meal seemed way too salty. The chicken tikka masala had a good tomato taste to it, but became quickly overwhelming as the salt took over. The vindaloo even more so when combined with the mildly more spicy nature of the curry. The chicken within the curries were succulent, moist, and generous. But the servings were generous as was the serving of basmati rice that came with the curry orders. The garlic-cilantro naan had solid garlic and cilantro flavor too, but coupled with just maybe a dash too much salt. BUT, with that said the samosas were fantastic, maybe a little over-fried at the edges, but I am more than happy to let that slide when the samosas are well filled and massive! The tandoori chicken is to die for. Flavorful and very moist (not something you expect from a chicken that is cooked under really heavy duty heat). I will admit that I've had a mixed experience with regards to the food at this restaurant, but because this is only my first visit, I hope to be able to update this review at a later time with more favorable conclusions."], ["Bridget H.", "Delicious! Smaller menu, but what they do have they perfect!"], ["Tien N.", "We saw that they had a chicken tikka masala pizza and had to trek out here, but their curries were the sticking point.There were so many flavors that my taste buds were having an orgy inside my mouth. The menu doesn't have a ton of options on it but you don't need many when everything is this amazing. Throw in some garlic naan on top of it and you have yourself an amazing meal."], ["Randy B.", "Food is okay, chicken lacks flavor. No dark meat. I don't see how this place has 4.5 stars. Its average indian food, the place does look nice and trendy.I import gemstones from India and have been there over a dozen times."], ["Jen L.", "We have been to this great, local restaurant at least 20 times and have had consistently good food and service each time.  The appetizer pizza sounds strange, but it is tasty and worth a try.  For vegetarians, they will sub paneer for the chicken.  The tikka masala with veggies is my all-time favorite.  The sauce is perfectly spiced.  The samosas are also a favorite as is the cilantro garlic naan.  They have reasonably priced beer and wine too!  What more could you ask for?"], ["Christina E.", "The garlic naan and cheese naan were BANGIN'! So, so tasty. All 3 people in my party got variations of the tikka masala and it was super yummy. This place has a skeleton menu of Indian foods, but it has the basics and the ambiance is great, too! These white folks make some good Indian food."], ["Chuck H.", "Disclaimer, I'm a white boy, but this place is impressive. It looks more like a window display from the street, and it is small, but is also very fast and tasty. I've never had to wait.  Menu is short and simple.  So far so good after about 5 visits.   I would recommend it for people that might normally feel intimidated or avoid Indian food. The garlic naan is a little over the top, as much as I love butter and garlic.  But it is OB, you won't find any real Indian people here unless they're lost. I think they even have craft beer."], ["Kevin H.", "I wasn't really into Indian cuisine until a prior roommate took me here.. Now I can't get enough of this delicious spot! I usually keep it simple and get Samosas to start (SO good), some garlic naan, and either the traditional tikka masala with chicken or the saag with paneer or chicken. They will make your order as spicy as you'd like, but be careful what you ask for because the heat is no joke! I like a little bite to mine but I made the mistake of asking for it \"spicy\" and couldn't eat more than 1 bite every 10 minutes. After learning the hard way (as usual) I now ask for just a little heat and that seems to do the trick. This place delivers in OB which is sweet for those lazy days and football. If you dine in, the atmosphere is mellow with a chill vibe. Always delicious beers on tap including at least one Dogfish Head which makes my East Coast roots happy. I'm sure they have other delicious things on the menu, I'm just not adventurous enough to try them.. Enjoy!"], ["Liz F.", "Simple menu. Great food! Nice atmosphere. Nice place to relax and have a good meal and good service."], ["Ryan W.", "Delicious!!Great prices paired with craft beers!Small cozy place with patio. Awesome, I will return."], ["Lee L.", "The restaurant is small and cozy.  I hate to use the term a \"hole in the wall\" but that's kind of what it is - in the best possible way.  It's just a jewel.We ordered two curries (vindaloo and tikka masala) as well as samosas.  The currries had great heat and tasted great on rice or naan.  The samosas were delicious (I preferred mine without any of the dipping sauces).Be aware, the seating is relatively limited but parking is plentiful for the size of the restaurant.Definitely will be back.  I wish they delivered to the LA area!"], ["Crystal L.", "The convenience is great but the food left a lot to be desired.  It wasn't traditional at all.  The chicken makhani was so dry.  Very dry breast pieces of chicken.   The saag paneer has a strange orange sauce with it, not a traditional cream sauce.  I don't think I'll make the trip back to Sundara, unfortunately.  Thanks for the easy online ordering, but the food needs a lot of work!"], ["Adam S.", "We decided to try Sundara on a Saturday after reading the hype on yelp and were pleasantly surprised to learn that Saturday has an all-day happy hour. Beers were half off, and they have a nice selection of craft beers including an IPA, double IPA, Indian brown, and more. One complaint I generally have about Indian restaurants is that many don't offer drinks and the ones that do only have genetic pilsners and Indian beers, so we often get carryout and grab a six pack. This was a nice change. Service was friendly, fast, and good, but we came earlier and the restaurant was empty. This place is nice, but small - there are maybe 3 booths inside and a larger selection of tables on the covered patio out back. Nice atmosphere overall, particularly for an Indian restaurant. The naan was delicious - fresh and hot, well spiced, a bit crispier than I usually see. The samosas were the best I've ever had - lots if flavor instead of the plain mash potato type others serve. The mint chutney and tamarind were also great, though the mint is spicy so be prepared. I got the Vindaloo and my wife went for the Masala. Generally I'm not a fan of Masala, but this wasn't as milky/creamy as others. Tons of flavor and really tasty. The Vindaloo was murder. Just spicy enough to get my sinuses going and full of huge, tender chicken cubes. The rice was served in a huge portion and was fragrant and perfectly cooked. Overall, probably my favorite Indian restaurant yet. Higher quality food, good beer, great service, and a nicer environment. We'll eat here often."], ["Shonna L.", "Indian pizza was sooo good an very unexpectedly great place! Good flavor a and friendly service"], ["Annabelle N.", "Sundara has a small menu of good Indian dishes. The Tika Masala is delicious and I love the rice desert. Friendly service, beautiful interior and the little patio complete a visit at this restaurant."], ["Pratik B.", "One of the best Indian Restaurant in San Diego, the samosa is too good.Not much choices but whatever is offered is awesome"], ["Adrienne S.", "Delicious Indian food from the Naan bread to the chutney all was excellent! Recommend the lentil curry and the vindaloo curry!"], ["Eddy C.", "I can see why this place got 4.5 stars! I'll not be quite that generous, but it's a lovely spot in a surprisingly quiet part of Point Loma with great dishes and decor.My first gripe is that they do not take reservations between 630-830 pm. Really?!? Is this a Michelin star restaurant? Are they flooded with passersby every night for 2 hours straight? Do they resent paying the $1 OpenTable fee so much as to alienate their customers and incite vengeful Yelp critiques??? Perhaps the restaurant will realize the idiocy of this policy after reading this review. I can't see how it could possibly benefit the customer or the merchant. This snafu almost derailed the evening, but I decided to sally forth like a good Yelper!Luckily, the place was more than half empty when we arrived. We were promptly seated and promptly ordered drinks. Menu is small (this is presumably a good thing for small restaurants). The drink list is surprisingly strong: several wines and beers by the glass (no full bar). Mango lassi was the only authentic drink (you can order it with rum).The food was all excellent/ Chicken tikka masala pizza ($8.5) was cheesy and rich. Not terribly Indian in my opinion. Samosas were decent. Naan was excellent (definitely do the garlic and herb). All of my companions were please with their dishes.The bathroom was immaculate. There was a nice scented candle burning, which you don't see nowadays. My only complaint was the subpar bussing service. My friend's dirty plate sat on the table 30+ min, as did my empty wine glass (from tasting). I'm also inclined to believe the server forgot to order my pizza, as it came out a good 5 min after everyone else's meals. These flaws are accentuated by the fact that we were literally sitting underneath all of the waitstaff. I could see into the kitchen from my seat.All in all, this is a nice place and I will definitely consider coming back, possibly with a date."], ["Lisa S.", "The restaurant is strangely run by Caucasian servers, etc. That throws me off, since Indian food in L.A. is usually served and run by Indian people. Although worrisome, the food ended up being excellent, so no harm done.I appreciated being able to order online and only having to go pick up the food. It's also great that you can ask for utensils through the system.The garlic naan is served in generous portions, so I probably should have only ordered one instead of two. Since each dish comes with rice, it's more than enough carbs already.The chicken vindaloo was my least favorite. It's usually the one I go to right away, but this one was lacking in spice and flavor. The tikka masala, although not as creamy or smoky as what I'm used to, was still very appealing. This was the first curry to be finished of them all.  The saag paneer was also different. I'm used to it being completely green. This time, it was red! At first, I was very hesitant and apprehensive, but I loved it -- maybe even more than how I've had it in the past.Great food overall, and it's at a relatively cheap price (compared to other restaurants of it's kind)! It was $35 for what would have been about $50 back home."], ["Brooke P.", "Nice environment, friendly service, tasty food. The tikka masala pizza is a must try."], ["Candice J.", "Great food! Great ambience! I totally recommend the Saag with Paneer. AND PAIR IT WITH THE HERBED NAAN! you don't even need a fork. Just mush it up in the bread :) the tikki masala is also good! A bit on the tangy side! The tandori chicken was SO juicy and flavorful. I recommend squirting the lemon right over it! Definitely would come here again especially for the decadent mango lassi!!"], ["Tracey C.", "Amazing complexity of spices and flavors in a casual joint with stellar service. Spicy Ribs stole my husband's heart, \"best ever, bar none!\" Equally compelling: the veggie Vindaloo and Saag Paneer. Garlic Naan rounded out our lively, hearty meal. You know you're experiencing a class act when the Owner sends along a second course of Spicy Rib appetizer plus Pappadum and Chutneys to apologize for \"small delay with the rice cooker.\" Well done Sundara, we will be back!!!"], ["Nicholas G.", "Pretty great indian food!Ok today i decided to goto OB and we choose our destination Restaurant via yelp so I thought it was responsible to leave a good review for this place, wether good or bad.As a brit I love my indian food, believe it or not we eat indian food in the UK more than fish and chips and crumpets :-), so i'm a pretty good judge of good indian food.What can I say it was great, other than Gourmet India downtown which is way way more pricey this is the best i've had in SD, its a shame they don't deliver to PB.The place is pretty small, and from talking to the waitress i hear they get busy at night time so I guess make a reservation if you plan to eat here at night.Long story short, was a good experience, great food and service and would come back, if you add PB to your delivery route would give you an instant 5 :-)"], ["Bridget L.", "Car payment, insurance bill and new books left me with enough money, if I wasn't too extravagant. So when I found this Indian restaurant with an amazing lunch special, I knew this place would be in the regular rotation.   By mid-semester, I had shared my discovery with some close friends, so on top of being considered a wise consumer , lunchtime also became a nice break for the ordinary.  We love the food and the service and are there every Wednesday afternoon, stop by!"], ["Jillian W.", "I loved this place, after moving to Houston I really miss eating here. I wish they would expand and come to Houston."], ["Justin A.", "I came to Sundara the other night after I began to crave Indian. I was a bit disappointed at first, the menu was extremely limited and only contained Masala,  Vindaloo, Saag, and Tandoori Chicken.After getting over the small menu, the food that we did order here was great. Quality over quantity ! My girlfriend and I split the samosas, chicken vindaloo, and saag paneer. The portions were large and tasted fresh. They did charge for Papadum (most Indian restaurant's don't), but given the relatively inexpensive prices, the $3 dollars wasn't a big deal.Overall, Sundara is a great place. Even though there is a limited menu, each item seems to be cooked with pride. I will be back soon."], ["Rachael C.", "I love the food here and I am not a huge fan of Indian food generally ... not sure what that says, but again the food here is awesome.  I love the vegetarian options and the fact that they deliver.  The delivery usually arrives within an hour which is perfect."], ["Ray L.", "My girlfriend and I tried the chicken tikka masala and she said it was too salty but I thought it was OK. Was really disappointing because of all the rave reviews saying how great it was when it's mediocre. At least the chicken wasn't dry for breast meat, that was the biggest plus of the meal. The worst part of the meal was that the rice was stale and tasted very old. We understand that basmati rice can be dry sometimes, but this rice was hard and tasted old; we know rice, since we're asian and eat every kind.The garlic and cilantro naan was burnt on the bottom and tasted like it was baked with garlic powder rather than fresh garlic so that was disappointing as well.The rice pudding was a little heavy on the cinnamon but not bad. The nuts were a pleasant touch to it. The portion was tiny for 4.05 but hey, probably the best dish in the meal... which isn't saying much.We really wanted to like this place but after this poor experience we probably won't be back. In total, it was only $17.30 but for less than that we could've gotten 2 amazing lunch specials at Taste of the Himalayas for less so the price being an excuse for the quality really isn't a valid argument. We feel really misled by the inflating ratings."], ["Suki E.", "Went here STARVING for dinner (and Indian food) about a week ago.  Overall I really liked the place and will totally go back!!It was a little different than the Indian food I am used to though.  The bulk of my exposure to Indian cuisine has been in Yuba City, CA...an area that has one of the largest Sikh populations outside India.  In that area, I can't remember a single dish that I wouldn't eat again and again and again.At Sundara I ordered the Tikki Masala with chicken.  The chicken pieces were well cooked but the sauce didn't impress me and I wouldn't order it again.  The Naan (plain) seemed a little less soft than I am used to but still tasty.The samosas were delicious!!!!!!!!  My friend had the Dal Makhani (vegetarian lentil curry) and I thought it was exceptional as well!!!!The dining areas (one in the front/entrance and one in the back)) are very small...we sat in the back where there was ample air flow...it was comfortable.  The service was excellent.  Very attentive and friendly.  Excited for visit #2!!!  Saag & Vindaloo are next on my list..."], ["Saad S.", "Their Tikka masala and saag was awesome and their tamarind chutney was fantastic! Can't say the same about their dessert, the rice pudding. It doesn't taste like Indian rice puddings and in my opinion is way too heavy on the cinnamon."], ["Madhav G.", "One of the best indian restaurants we have had so far. I could rate this as the best in USA."], ["Andrew N.", "My friends and I walk here all the time, which is good when we drink a few beers. They only have a few beers on tap, but they are all good. I get the vindaloo and a nan and have enough for lunch at work the next day. My buddies get the tiki Marsala and they like that too.Afterwords I stumble home with at least half my food left (unless I bring Erica and we slit one). So go to sundara, tell your friends, but not too many bc I don't want to wait in line"], ["Hanna G.", "Great Place. Clean food. Simple Menu. Great for first time.The Chef is super cute, you can see her in the small kitchen window working hard with to-go orders flying out the door. She's also white which is pretty cool because she executes the authenticity of Indian very well with her own spin on it. 5 stars because they do VEGAN options. Yes please!Also a nice glass of red wine is perfect with the meal. My boyfriend usually gets a good beer. We aren't even drinkers but for some reason we love cuddling up in a booth, sipping on some grape juice and fermented barley and grubbin. The place is small and I think if you live close to the area its best to get take out. I live in downtown and I'm always in  a starving mood when I want indian so we always eat there. Not a lot of room, but we've never had to wait. In the summer, the back patio is nice and cool. In the winter they have heaters, but like i said earlier, the booth is where its at.Service is amazing. We've always had a male server and they're great. They deal with our odd vegan requests and always execute properly. They are good at knowing what you need with out bothering you too much.Def worth a try. Reading some of these reviews confuses me because I'm a foodie and all the other indian I've tried was way to heavy and for not being Indian they hit it on the head pretty well."], ["Wanda S.", "My first visit to an Indian restaurant in San Diego was a complete success. After having one of the best dinners at Himalayas in Ventura, I didn't think it could any better...however, I was wrong.The ambiance of this place is cool and romantic. The lighting is dim and the soundtrack is AMAZING. ( 80s / The Cure, The Smiths, etc.) It was a slow night so it felt like my date and I had the restaurant all to ourselves. Customer service was spot on and the food was so goooood.... the only thing keeping this from a perfect rating is the super salty taste of the food...I like salt, but I dont like waking up in the middle of the night feeling like I just walked the Sahara desert. I will probably come back, prices are good, the beach is around the corner, and they deliver! Try it!"]], "Bombay": [], "Gourmet India": [["Sabine M.", "Very good meal. And I have eaten Indian food my entire life including in India and from my in laws. Flavors are good. Had chicken tikka masala, sag paneer, Dahl Makani and chana masala. All were good. The chicken tikka masala was excellent, as well as the sag and the Dahl.We also pester garlic naan and everything formed with Rice.You can eat on the patio.Service is good."], ["Shruti N.", "We ate here on a whim last night and while we enjoyed the meal there were a couple things we would change. First even after asking for our food \"Indian spicy\" it wasn't really all that hot. Second the service was a bit slow and scattered, as others have mentioned. We did ask our waiter to ask the chef to make us some chili naan which isn't on the menu but wow it should be. He really packed that naan with chilis and it was delicious!!! Overall a good meal."], ["Mike P.", "Really deserves a 4.5. All items I tasted were well done. My sole complaint is that I asked for the chicken curry to be spicy and it wasn't. That said, the flavors of the samosas, dal and naan were all excellent. I would order again."], ["Vivian A.", "So so good! We walked by the night before and drooled over the incredible looking food. We came in for dinner tonight and it just happened to be during happy hour, so we decided to splurge. Two naan bruschetta, one panneer appetizer, nirvana chicken (delicious), and vegetable curry (again, delicious). Happy hour drink specials were ridiculous- I got two Bollywood beauties (4 each, and so good I am tempted to order more) and my hubby got a mojito and sangria (4 each). Wonderful service, incredible food, great drinks, and a cool ambience. Highly recommend you coming in!! Plus, it's great for a date or girls night :)"], ["Jerry v.", "We really enjoyed our meal there. We really appreciate all the gluten free options. The tandoori chicken was fantastic and the masala delicious. We're here for a conference and plan on taking our group there again!!"], ["Ray G.", "Excellent restaurant, service and great quality food. Mirna was an amazing hostess as well Divya, attentive, courteous and professional. Great atmosphere!Ray G."], ["Christine M.", "One of the best Indian restaurants in town. The place is small and cozy, right in the heart of the Gaslamp District. The waiter was a delightful guy who brought out the food quickly. The tofu masala was just perfect! I was impressed with the bartha, it had a more natural look than most barthas I've tasted."], ["Judith H.", "I honestly love this place. At first I thought I was not going to get full with the lunch special but half way through it I was full. I was unable to finish the whole thing because my stomach was not letting me. The food is good the price is good. Customer service has always been good."], ["Peter S.", "Gourmet India is a real delight.  The food is very good (try the Lamb Vindaloo), the portions are more than enough and the service was wonderful - attentive but not overbearing.  It was my first visit but certainly not my last."], ["Timmy L.", "What a great restaurant! I cam here during the esri user conference 2015. Very friendly wait staff...helpful about whats good and offered recommendations. A plus was i didnt have to wait long for a table. The food was fantastic and flavorful. I had the nirvana chicken curry and tandoori chicken lunch special. Very good price for the food you get!! I'm coming back here again during the conference."], ["Mark S.", "I am grateful to find a good quality place that makes amazing food with love and care. I had a lunch platter with nirvana chicken curry and added a marsala chicken curry for +$2. The garlic naan doesn't get any better. Everything's fresh and delicious!"], ["Dakini Engineering General Contr D.", "The food was excellent!  The service was a little confusing and disorganized."], ["Ana H.", "Great food! Very friendly staff and great martini! Try chicken tikka masala and tantric martini... Yummy!"], ["Matt G.", "The BEST Indian lunch spot in town.   From the Chicken Masala to the garlic naan, delicious."], ["Jason C.", "Awesome place to come eat at. Food was great, service was great. Definitely coming back soon! If you want some good Indian food, try this place. You won't be disappointed"], ["Alejandro F.", "In my hometown there's no decent indian food within 500 miles so we make it a point to enjoy Indian food on our travels. In San Diego we stumled upon Gourmet India and we are so glad we did!  The staff were very friendly and attentive. The real star though, was the food! Excellent flavors melded together in perfect harmony.... Highly recommended!"], ["Mitch L.", "Gourmet India is a cozy little joint in the gas lamp district.  The food is great and the prices are very reasonable, especially given that with a couple of appetizers, one entree is big enough to split between two people. Unlike some of the other restaurants in the area, there's no charge for splitting an entree, either. The staff were friendly and I enjoyed the ambiance.  I would definitely go back again,"], ["Cherice W.", "Given the sarcasm from the manager/owner , I am dropping this to one star. That lack of care is evident not only in the food but in management of the venue . Just plain tacky.I should've known the place would be crap when I went to an Indian restaurant that had no Indian customers . Smh"], ["Randy H.", "Went back here last night and had a great time. Food was good, service was good. Wonderful dining experience. This is now my go to Indian spot when I'm stuck working downtown."], ["Katherine K.", "We love EVERYTHING about this restaurant!  My husband is British and not easy to please when it comes to Indian food.  He was shocked at just how good our meal was.  The service is perfect and the prices will pleasantly surprise you!HIGHLY RECOMMEND!!"]]}