{"Matador Mexican Grill": [["Christie C.", "Attending a conference at USD and only had an hour for lunch Yelped restaurants.  Service was fast an friendly. I had street tacos which were awesome. Hub by had Achitoe burrito which he loved. Highly recommend! !!"], ["Amelia C.", "My go-to burrito destination! The carnitas California burrito is my personal favorite, but I'm pretty much there every Tuesday night for their taco Tuesday! Try the adovada...you wont be sorry!"], ["Tatjana T.", "Delicious tacos especially for the price! Do not miss their taco Tuesdays and at some point make sure to try buche tacos, yummy!"], ["Emily P.", "There's a large selection but the man who took my order wasn't very helpful in giving suggestions, and he looked at me like I was an idiot when I asked what the difference between street tacos and soft shell tacos is. The food came out in a timely manner but really wasn't that great. The chicken in my tacos had some debatable bites that were extremely chewy and the tortillas were doused in grease. On a positive note, the salsa selection is pretty great... But the salsas themselves were mediocre. I love spicy food and salsa is probably my favorite condiment. The extra hot one was not as spicy as you'd think and besides burning it doesn't have a taste. Honestly the mild and pico were the two most flavorful which was unexpected. It was a cheap eat, very fast, and had decent food, but there was really nothing special about it."], ["Alon B.", "I went here for a lunch-to-go (my family was to lazy to leave the hotel room). Very neat place, fast and most important - delicious !!!Thank you, Yelp for helping me find a close by place."], ["Hawri H.", "Great pollo asada burritos and there sauces are fresh and flavorful. The cashier was helpful and polite which goes a long way when you first visit a restaurant."], ["Corrie H.", "The food since the change in ownership is really good, and the service is good as well. Very nice people behind the counter, and food always comes out right."], ["Geoff K.", "This place is excellent l!!!! I've eatin several time and loved everything I've ever ordered"], ["Amanda D.", "I have been looking for a good carne asada burrito for awhile. I found this little gem just today and my carnal needs were alas met! The burrito was far more than I could handle but the price was well worth it. The taste exceeded my every expectation and the customer service was outstanding."], ["S W.", "We eat here at least once a week!!  So yummy!"], ["Bob O.", "We were staying nearby at Mission Bay.  Looking for something to easy and tasty to take back.  I was surprised by how clean it was and liked how nice they explained their specials.  We got burritos, the carne asada fries, and some street tacos.  All dishes far exceed ur expectations.  They were fresh and flavorful.  Inline with what we would expect at a restaurant charging $30 / plate.  Definitely a good stop!"], ["Alex K.", "Called in an order for a carne asada burrito and it was ready right when they said it would be! One of the best carne asada burritos in San Diego in my opinion. It's never crowded so even if you don't call in your order it's ready very quickly. Staff is friendly and I think they're starting to recognize me...it's a good thing, but bad for me that I go there so much. I guess working down the street doesn't help. Overall a great place to find quick and delicious carne asada burritos."], ["David K.", "This place needs more love. Located in a humble strip mall across USD. You can essentially create your own breakfast burrito and it comes perfectly wrapped. Will be going back to try their Machaca and Asada breakfast burritos. Great salsa and also appreciate that they have carrots and radishes out. I don't understand why you have to pay for \"hot carrots\" in San Diego. Nice lady at the counter too."], ["Jennifer E.", "This small Mexican restaurant in the strip mall down the hill from USD is where you should be eating. We came from Phoenix to check out the campus and needed a place to eat. I quickly pulled up Yelp and spotted all of the 5 star reviews. This place is GREAT! I had a cheesesteak burrito - generous chunks of beef, crunchy bell peppers and cheese (I left off the mushrooms because I'm not a fan) topped with both red and green sauce. My son and husband had chorizo burritos and my daughter had crunchy tacos. All delicious. Servings are huge. Free chips with multiple salsas. Do it- you won't be disappointed, but your pants might. Ah who cares right?  This is the type of food worth getting fat for."], ["Fred F.", "Be careful of the mild salsa at the salsa bar.  Tonight, I've some kind of food poisoning."], ["Drew T.", "Oh man oh man, this is by far the best Mexican I've had in SoCal. I got two hard tacos--house made shells, one chicken one beef. They were sooo juicy, huge, loaded with creative ingredients, the flavor was bursting.I plan on going here again tonight--and every night I have a show down in SD. Give this place a try--it's new looking, clean, and the staff are very friendly. The salsa bar was great and really clean, as well. They also have Mexican fountain drinks--never hurts!Prices aren't the cheapest in the universe but they aren't what I'd call expensive considering what you get: Good portions and amazing flavor.I'll be a regular in no time."], ["Nataly H.", "This is definitely one of my favorite Taco Shops. I drive all the way here just for their California burritos."], ["Sol C.", "Awesome breakfast burritos.  Only place I know where you can choose your ingredients for your breakfast burrito.  I hate when other places include rice and/or refried beans to your breakfast burrito. Here, you can avoid this problem. You can add 3 items + 1 meat.  They even have mushrooms on the list.  I had the sausage with cheese, mushrooms and potatoes. They have other ingredients you can choose like guac, salsa, hash browns, french fries, grilled onions, refried beans, and rice."], ["Jared D.", "This hole in the wall near USD will blow your mind. Huge flavor and extremely authentic. Great salsas and well priced. The dining room is not appealing at all but food terrific! You really should check it out if you haven't been. Pleasantly surprised."], ["Brent B.", "Friendly, casual atmosphere. Had the chimichanga with rice and beans which was delicious. Even good re-heated."]], "Las Cuatro Milpas": [], "La Perla Cocina Mexicana": [], "Tostadas": [["Alice H.", "There are other more detailed reviews here that do this place justice, but I wanted to add mine to underscore the high ratings.We had the following tostadas: Sandia (ahi tuna and watermelon) which was my favoriteCamaron (shrimp)Ceviche de Pescado (red snapper)Aguachile (large shrimp with chile Serrano) which was spicy, for anyone who doesn't like spiceThey were amazing. Hope to be back to try others. The aguas frescas were very refreshing."], ["K. S.", "This place is added to my new favorite restaurant!! I love the freshness smell of the ocean when you open the door. Everything I had was really really GOOD, my favorite one is the 1st item on the hot tostada (smoked yellow fin? I guess) the duck and strawberry sauce was also really dilicious and interesting. I also had a lobster seafood soup which was really good (creammy and richy). The service was very friendly and attentive. I cant wait to go back!!!!"], ["Lilyanne C.", "It was so f***king good! The menu is small but everything on it is amazing. Don't overlook this place. I've taken people here who've underestimated the culinary genius of these tostadas and they had to order their own after a bite of mine lol."], ["David G.", "This is perfect hot-weather food.Really.  When the Santa Ana winds kick in and the breeze is more like a hairdryer in your face, there's nothing better than cold, fresh ceviche on a crispy tostada, washed down with a fresh agua fresca or smoothie.And thanks to the generically named Tostadas, all of these things can be found in North Park.  The place is fast and casual -- just order at the counter at the counter and grab a number.  We ordered a selection of 3 tostadas: sandia (ahi tuna + watermelon), ceviche de pescado (red snapper + cucumber), and salmon (with dill and vodka).  To wash it all down: a modified \"Mellow Yellow\" smoothie (papaya, raspberries, mint, carrots and orange) and a tamarindo mojito agua fresca (free with Yelp check-in -- score!).I enjoyed it all, but especially the salmon.  It was a unique take on the traditional tostada, with a Pacific Northwest twist.  The other items felt much more traditional, although they don't quite compare to the awesomeness of TJ's La Corriente.Another thing: these tostadas are tasty but tiny.  I left the place still feeling hungry, as if I had nothing but appetizers.  It's always questionable when I dine out and find myself making a sandwich after I get home.Then again, maybe a light snack is all that's needed on a hot-weather day."], ["Kate G.", "Was ok but I am not a fish person so it was hard to judge. We had a few mix ups with the order and our food came out sporadically. I know it's new so I'll chalk it up to experience.It's pretty healthy food and unique as a stand alone restaurant. Ironically- I would recommend the black bean soup :) but my boyfriend did like the seafood."], ["Joy M.", "Fresh healthy ingredients and very nice atmosphere.  we loved the all tostadas seafood in their menu. Definitely we are coming back. They need a paper menu my neck hurts when I look up reading their menu at their wall lol. The cashier is a friendly dude and very accommodating. I recommend this place."], ["Adam S.", "Best new lunch spot in North Park!I've been by a few times, and they never disappoint. My favorites are the mixta, the camaron, and the salmon ceviche tostadas. The tropical rainbow is like 5 or 6 fresh juices and yogurt together in one cup, it's absolutely killer. Staff is friendly, definitely knows what they're doing, and the recipes are original and creative, but still have an authentic appeal. Two tostadas and a juice and I leave happy every time."], ["Parada O.", "The hubby and I made a bee line to Tostadas the weekend it opened. The wonderful owner Gerry Torres (also of City Tacos) was there to greet us and walk us through their menu of agua frescas, juices, and unique tostadas. You order at the counter and find yourself a seat on the communal table, or one of the chairs by the tostada bar, or there are a couple of tables inside and outside. I got the mixta (mixed seafood ceviche and pineapple) and sandia (ahi tuna, watermelon and about a million other things). The hubby went for le de pato (duck breast) and ceviche de pascado (red snapper). My favorite was definitely the sandia--the sweet crisp watermelon was the perfect complement to the ahi tuna. This is what summer is all about! I probably could have done without some of the other ingredients because I honestly couldn't taste all of them. I also love that the watermelon helped to prevent the tostada from getting soggy. The mixta was good, but difficult to eat because of the thick ring of pineapple. The hubby enjoyed his tostadas but said that the ceviche one got really soggy because it had been sitting for a little bit longer than the others before it was brought to us. Overall, the tostadas are incredibly fun, with unique combinations of ingredients. I like that they don't seem to take themselves too seriously and experiment with ingredients you wouldn't ever see together, let alone on a tostada. Gerry really took care of us--he even asked for our feedback about the food and generously re-filled our drinks. By the way, the watermelon agua fresca and banana agua fresca (think horchata but with banana) were super delicious, refreshing and not too sweet. We'll definitely be back!"], ["Tony C.", "If you are a fan of seafood and City Tacos down the street you will enjoy Tostadas.Walking in I was immediately greeted with a smile by a young gentleman. All the staff were nice and I really appreciated when the chef came over to check in on me and ask how the food was. I was also pleasantly surprised to see fruit on display and them making fresh juices in the background. Honestly I was expecting more of a taco shop vibe. I was totally wrong! Instead it had a healthier feel to it since the restaurants menu is based around fresh juices, waters and seafood.  I ordered the ceviche de pescado, aguachile, and sandia tostadas.  The pescado tostada was prepared with Red snapper and fairly traditional. I felt they put too much of the avocado sauce (which I mentioned to the chef) and slightly took away from the flavor of the ceviche. Either way it wasn't bad. Next up was the aguachile tostada. The menu description says large Mexican shrimp and they aren't lying. The shrimp they used were huge, prepared perfectly with the right amount of heat coming from serrano chilies and acidity that a aguachile should have. Lastly was the sandia (watermelon) tostada which was my favorite. A slice of sandia, topped with fresh ahi tuna, bits of red onions, jicama, mango, apple, cucumber and peanuts. It was the most unique tostada I've ever had and delicious. I would order all of these again but the sandia really stood out. This was all washed down with agua de sandia which was absolutely refreshing on a hot afternoon. Great addition to North Park and can't wait to come back. I'm a fan!!!"], ["Roo H.", "Where I'm from, \"tostada\" means refried beans smeared over a fried tortilla, covered in questionable ground beef, shredded lettuce and a few artificial tomato chunks. This place was the polar and most wonderful opposite of what I'm used to. The service was so welcoming-the sweet woman at the counter took the time out of her day to explain everything on the menu to us after our admittance that it was our first time there. Everything sounded incredible, many options (mostly seafood related, but with vegetarian and pork-atarian choices as well!). Fresh seafood, playful presentation, amazing juices--Tostadas is 100% in my book."], ["Daniel S.", "Being Mexican, I've had many tostadas and lots of ceviche. However, this is by far the best ceviche and tostadas I've had! Not only that, but Tostadas brings a refreshing and unique perspective to the common tostada. So far I have tried 4 of their tostadas - The Mixta, La De Pato, Sandia, and Ceviche de Pescado - they were all amazing. The Mixta surprised me since I'm not a big fan of pulpo (octopus), but this pulpo was tender and so flavorful. All of their seafood is fresh and you can definitely taste it in each tostada. Their Ostioned (oysters) were also the best oysters I've ever had. I definitely recommend trying this Tostada place! I will definitely be coming here regularly!"], ["Teresa N.", "Tostadas sell tostadas only, no taco, no burrito. Found this place on the San Diego Tacomania week ad. Tried to look them up to see if they are any good, just a handful of reviews on Yelp? Must be new! Okay, I will be the guinea pig.They had like $2 totadas specials, ahi and yellowtail. I ordered one of each. Both were pretty tasty, fish was fresh. I liked the ahi more cos they put a slice of sweet watermelon on the tostadas, a nice surprise and it went well with the fish! Perfect summer snack!They had mojito.. the virgin kind for babies under 21. Not bad, a pretty refreshing drink."], ["Dan T.", "After going to City Tacos this past Tuesday I learned of their new restaurant Tostadas. I enjoyed eating at City so much that i decided to go to Tostadas the next day. The menu is not very big but most of the options sounded good. I ordered the MIxta and the duck one, along with the lobster bisque. All the options are spelled in spanish, which I don't speak so I accidentally ordered the lobster bisque but luckily it was really good. UNfortuantely they messed up my order and brought me the ahi tostada instead of the duck , when i told the serverer he said that it was the duck, despite it obviously being fish. I had to get up and take the plate to the counter in order for them to fix it . All the food we ate was good but it was overpriced , had a weird ambiance, and less than great service. I think I will stick with City tacos from now on."], ["Anthony G.", "Place was amazing we had the nopal tostada , filet mignon, aguachile, and salmon tostada. Everything was delicious I would have guessed everything would be a lot more expensive for what we got yet was perfect price to return again and again. Just try it !"], ["Amber P.", "Get the Mixta--it's soooo good!  Scallops, shrimp, octopus, pineapple, and more.  My husband wanted to lick the plate (the paper plate).  Also, the service was fast and very friendly."], ["Enrique V.", "This place is a little tostado gem in the heart of North Park, I came here the other night with a friend to check it out since I was hungry and also in the area, I didn't really come with any expectations seeing that I eat some of the best tostada ceviche in tijuana and south bay but man I was really impressed. The fish ceviche was pretty amazing and by amazing i mean I didn't have to add anything to it like lime or even salsa the flavor was great. I also tried the cochinita pibill tostada and it was pretty good as well. the only down side was the jamaica tasting a little fast like it needed some more sugar but other than that my experience was great. I'll be coming back here to try their sandia tostada since i heard the workers saying that was a popular one but for me i rate a place with their fish and I give it an A."], ["Lauren J.", "Been wanting to try this place out since they opened and finally got to today! Everything I had was so delicious, fresh, vibrant, and full of flavor. I will def be coming back.  thank you!"], ["Claudia L.", "Tried a bit of everything wasn't too busy. Love love love. Nice and friendly Sandia tostada was by far my favorite.Nice atmosphere. Has a great fruit bar, granola and fruit was very good too. Can't wait to go back."], ["Noe V.", "Great Service. Excellent Food. Perfect Ambiance. Very authentic and fresh sea food tostadas."], ["Garett G.", "I've come here fairly consistently since I moved into the the area and I cannot get enough. The customer service is always excellent. The employees are attentive and welcoming. Not only that, the ambiance of the place is perfect- very simple but clean and fresh. Most importantly, the food is delicious. I haven't tried a tostada that wasn't perfect. The seafood is fresh and the ingredients are vibrant and seamlessly work well with each other. The flavors are refreshing and lean. All in all, the restaurant is a hidden treasure in north park. I would recommend it to anyone. It is ideal in every single way."]], "La Puerta": [], "Salud": [], "Michos": [], "Fiesta de Reyes": [["Emeel N.", "This is the place that in my opinion comes closest to experiencing world class food and drinks in an authentic Mexican/Spanish environment in San Diego.Grab a drink (have some cash with you,) in the front of the little stage and watch the lines that the chiquita bonitas draw in the air in their bright colored dresses when they dance to the acoustic sound of the live Spanish music filling the air. It gets crowded over the weekends which multiplies the charm by x100."], ["Rachel S.", "Went here on a Thursday night and it was really busy. Saw that as a good sign. Luckily got here right before the crowds started showing up. Ambiance: outdoor seating only with live band. parking: there is parking available on Juan St. Had to take a detour due to road construction. Food: mango margarita blended was delicious. I got the shrimp fajita platter which was very good and plates are big portions. My boyfriend got the carnitas platter and he said that meat was moist/tender and most importantly delicious. Churros for dessert was good/average. Comes with chocolate sauce. Only negative thing was there were lots of birds flying around the dining area."], ["LT K.", "This is the best Mexican restaurant in Old Town that I have been to. The food is good. The tortilla soup is really good. The rice and beans that come with an entrée is nicely flavored. I had the flank steak and shrimp wrapped in bacon. Nicely seasoned, though a tad over cooked, but okay.Service was friendly and prompt. The front of the restaurant is a fun place to wait for a table, have a drink and watch a live band play."], ["Karina H.", "I had so much fun here. Seating is all outside in a courtyard type of setting and it's so festive. I really liked sitting here and listening to the performances that were in the stage area just beside the restaurant area.The food was good. I had beef fajitas and they weren't the best I've ever had, more than anything it was the setting and the environment. Also, it may have very much to do with the margaritas...They have a deal where you get a pitcher of margaritas for $24. With that pitcher my husband and I were able to refill our glasses 3 times.For dessert we ordered the churros. They are filled with custard and come with a chocolate dipping sauce. I'll definitely be coming back. It was a very good time."], ["Shweta B.", "I just love the vibe,it's so beautiful,the performing artist are talented.Cloudy weather n hot mocha that too in old town makes a good combination for me to hangout.Not crowded, easy parking,I am so gonna visit the place again :-)"], ["Davis B.", "Discovered this place through Yelp. A lot of the other Mexican food restaurants around the area really don't have the best reviews. But this place is a nice little open-air restaurant nestled into the Old Town scene. Can feel like a \"tourist trap\" because there's typically between a 15-30 minute wait for this place during the weekends. Bigger parties will take awhile to be seated from what I was seeing this past weekend. I came here with a party of 3 others and had to wait 20 minutes. Sure enough, they sent us a text that we were to be seated right at the 20 minute mark. I suggest having a churro or a street taco nearby to whet your palette for the great food that awaits you at this place. It is worth the wait. Had a really nice server (his name escapes me) but he was very attentive, made sure we were taken care of, and constantly kept our waters filled to the brim on a warm Sunday afternoon. Chips were great. The house salsa it came with wasn't anything to write home about, but I didn't come here just for that. I came for a burro enchilada style, or a \"wet\" burro as so many Californians refer it as. I ordered a chicken burrito with the red sauce on top. The dish came with refried beans and Mexican rice. It tasted great and I would highly recommend that dish to anyone. Next time I'm back I'll be taking aim at their house margaritas I keep reading about on here."], ["Jonelle O.", "Food was meh and overpriced, but their pitcher of mojitos was ON POINT. I'd like to come back just for that. The service was excellent and our waiter was so very nice.Um. I don't really have anything else to say. I ate half my enchilada and it wasn't great so I just kept drinking mojitos instead. And that's where that story ends. Come for the drinks, leave for the food?"], ["Jon O.", "Great food with vegan options!  Amazing margaritas and their tortilla chips are the best I've ever had."], ["Deeann B.", "The ambiance is awesome with the outdoor seating with tons of tropical plants, Mexican pottery, dancing and music on the stage. Oh, and the food is great too and the service fine. My favorite place to eat."], ["Marco B.", "Good place to hang with a margarita and chips. Food is decent but over-priced. At the stage nearby there are folklora dancers, mariachis, or latin dance bands most week-ends and evenings. Because of a great increase in tourists, service and quality may drop considerably  at any time. Avoid holidays like Cinco de Mayo, no specials, poor service, $9 plastic cups of ice selling as a margaritas. I recommend for drinks and chips on non holidays, and you can take them to stage area."], ["Jo S.", "We were visiting Old Town San Diego, we poked our heads around Fiesta de Reyes, not planning to have a meal in the area.This restaurant has a huge outdoor area, so nicely decorated, the weather wasn't great, but everyone seemed like they were having a great time sipping their huge margaritas. We couldn't resist, got seated at a nice table and had a memorable meal- simple street tacos (the best we ever had, Mexico is included) and great margaritas. Very nice service, ambience, so relaxing. They had some live music playing and dancing. Great place, it's not a tourist trap, check it out."], ["Kat J.", "The wait for large party was insane...no ridiculous.  Fiesta de Reyes would not allow for large party reservations and they could NOT even sit us together.  WTF???  Our server was a bit on the mean side...borderliner rude.  He seemed annoyed to have to serve large party of mostly teenage girls.  My family ordered:Chile VerdeCarnitasCarne Asada soft tacosThe Chile Verde was okay but a bit on the salty side.  I could not finish it because of the over seasoning.  My daughter and husband both loved their Carnitas and the only complaint was it was not served with sour cream.  My son also loved his Carne Asada Tacos.A bit of a tourist trap.  I don't think I would have come if I had known about the lack of reservations.  It is definitely a one and done for me...I've had better Mexican food elsewhere."], ["Chris C.", "It's an entertaining, touristy place with mediocre everything. The lime in my drink was so old and dried up that it was brown. pricing was way higher than the quality would suggest. I'll probably never go back."], ["Susan R.", ":) We had a lovely dinner and shared a pitcher of margarita between 4 people. The atmosphere was great, catered to tourists, but still a local's destination. One of my favorites in Old Town. Visitors will love it.:( Long wait for what it is. There are so many places for good Mexican food in San Diego and this place is honestly just average in terms of food. Parking was not ideal, but we got lucky finding a spot."], ["Sammy T.", "Wonderful cultural experience. Food was exceptional and surrounded with a great atmosphere. Highly recommend."], ["Gary B.", "This review could have gone another way but I'm here to tell you that a manager with a seemingly miraculous sense of intuition and perception stepped in to erase a potentially terrible experience.  It was a busy night and the wait time was about 30 minutes for a table.  We went to the bar area had some drinks including the Million Dollar Margarita which is Fiesta's version of the Cadillac and a very delicious one I might add.  We were finally seated almost exactly in the bar area where we had been waiting for our table.  Shortly after, a series of less than stellar events began to occur and it started to go down hill quickly.  Without so much as a single complaint, the manager and two wait staff swooped in with guacamole, homemade salsas, chips, silverware and a heartfelt apology for our experience.  The manager said, \"May I get you a round of drinks on the house and hopefully you will have amnesia around your experience so far.\"  I couldn't wrap my head around how he was able to tell what we were experiencing since the place was so busy.  He obviously has passionate attention to detail as evidenced by his knowing the mood of his patrons and also the way he adjusted everything at the unseated tables into perfect place.  My cousin and his partner were visiting from Los Angeles and we often take family and friends here because of the wonderful atmosphere and arguably best food in Old Town.  In fact, we had been here 3 times in the past 10 days with different visitors.  Perhaps the manager recognized us?  Whatever the reason, I'm here to tell you that I have never had or seen a better service recovery in all my years working in hospitality.  Perhaps this reinforces my reasons to come back again and again.  Hats off to the manager and server  for making this a pleasant evening of delicious food, drink and magical service.  Note: Delicious carnitas, guacamole and homemade tortillas!"], ["Alec T.", "This place is crazy busy, but worth the wait and the hassle. Tamales, enchiladas, grilled steak and margaritas all spot on. Sure it's touristy as all hell, just grab a drink and enjoy the ride."], ["Brenda H.", "I just took my daughter here for her birthday this last Saturday night.  The wait was 1 hour and 20 minutes so we sat and listened to the band and ordered a margarita to share.  The atmosphere was very nice and the band made it even better.  When we finally got our table it took at least 10 minutes for someone to come over and take our drink order.  Then it took at least another 10 minutes to get water.  Then another 15 minutes possibly more like 20 and even more to get chips and salsa.  We sat there such a long time talking and realized wow we still havent gotten drinks and then later the chips etc. We get our food and had asked our waitress and the person that dropped off our food for more salsa because we had none.  We all sat there waiting for the salsa while our food slowly cooled all the way down to almost cold.  Seriously.  Then they didnt bring enough salsa so we asked for more.  I had to go to the bathroom so 3 of us left for the restroom and during that time they came out and sang happy birthday to my daughter and my husband which was nice but it would have been really nice if most of us weren't absent for all of it.  When we came back her son was upset he missed it.  The waitress came over and picked up my half full monster glass of a margarita and turned around and walked away with it sloshing back and forth in her hand.  Everyone is saying hey what the.......and she turns around and says oh and puts it back.  No apology no nothing after sloshing it around and dumping some on the ground.  That was crazy.  The service was not good at all."], ["Leslie M.", "Beautiful outdoor setting. Excellent chips and salsa to start. My boyfriend got the Burrito Fuego with chicken and it was amazing. The tortillas are made fresh right behind you and they taste like it. Super authentic. I had three tacos and loved the fish version. It had a big piece of white fish with avocado and slaw. Delicious! I wish we had places like this on the east coast."], ["Courtney C.", "This is my favorite Mexican restaurant in San Diego!!1) The margaritas! Hands down the best margs I've ever had!! Just the house margaritas, never a bad decision! 2) The atmosphere. The restaurant has an awesome location where it's completely outside with a stage where traditional dances are performed all the time. And for those few times when it's a little chilly they have heaters!3) The food is delicious! Chips, salsa, burritos, tostadas!!I always take my visitors here and they always love it!! I'd give it 10 stars if I could!"]], "El Borrego Restaurant": [], "Cantina Mayahuel": [], "Puesto": [], "Las Hadas": [], "Mexican Fiesta": [["Kate T.", "I had a fish taco and the California burrito, and they were both delicious! I'm used to ordering several tacos and still being hungry, but the fish one was quite big on its own, and the burrito was big enough for leftovers. The prices were cheap ($8 for the both of them), and because I went there around 11:30 they weren't too busy so I didn't have to wait long. It's unassuming from the outside, but it's well worth the time! I'll definitely eat there again when I'm in San Diego!"], ["Jeremia F.", "This is exactly what I was looking for. I think the ambiance really adds to the experience. Well or lack of... No frills tasty fresh Mexican delights. I stumbled upon this place after searching for something for lunch aimlessly in little Italy.The service was quick and the food was tasty. I asked the kind woman working at the order window a few questions and decided to give to fish tacos a shot. The price was right, I would say under $5, CASHOLA only folks. The fish tacos where lightly battered and fried to perfection. Not sure what the fish was but it was moist and flaky. I would certainly stop by again for lunch."], ["G T.", "Came here to check out all the hype.  Order Cali burrito.Verdict:Taste:  4/5, pico de gallo was fresh, crunchy, and spice was spot on.  The carne asada had good flavor, not too tough.  Hash browns instead of fries.  All in all, good!Quality: 3/5, ingredients seem fresh and meat was not tough.  Tomatoes seem fresh.Time:  Took a little longer than usual.   Then again, customers kept coming, in person and on foot which is a good sign.Value:  Size of burrito is small.  You get what you pay for, and since the price here on burritos are fractionally lower than average, you get less food.  Simple economics.Ambiance: none.  Hole in wall.  No seats.Frills: No salsa bar, no limes, only red sauce.  -1 star.Bottom line:  I can see why its popular, good flavor, lower prices.  That said, I wouldn't necessarily go out of my way to find this hole in the wall, especially since I had to hit up another Mexican joint to fill my belly since just one burrito didn't satisfy."], ["Ramon L.", "Really delicious and cheap tacos! They're big tacos, too! I got the fish and al pasteur tacos which were both really satisfying. The tacos were really inexpensive--just a little more than $2 per taco.The place is located in downtown and is strictly a takeout place. You order from the side of the street and they give you your food to go. Cash out. Taking to go is no problem because it's right next to the seaside and there are plenty of grab places to sit and eat there.Conclusion: Awesome, inexpensive tacos. Would definitely go back if around the neighborhood again!"], ["Tania S.", "Snapped a photo of the stand with a curious little set up. If you look up, it's surrounded by innumerable skyscrapers. If you're looking below and haven't tried it, you're missing out. An older man walked up at the same time and said to me in Spanish, \"I need to do the same thing! I need to show the boys where I'm at. Are you just getting here from somewhere?\", as I am with phone and carry-on in hand. \"I just got in from Salt Lake City.\" His accent was familiar to me, I had to ask back in Spanish, \"Are you just getting in from somewhere too?\" It turns out our families are from the same town in Mexico. That doesn't happen to me to often, but it was a warm friendly exchange right in front of Mexican Fiesta.Not even four dollars later, I had five rolled tacos in hand with world-stopping guacamole, fresh crispy lettuce, and cheese. What a banging deal! The excitement was starting to seep in: It was going to be an amazing weekend. I asked the older man, \"So tell me, it sounds like you've been here before. Is this the real thing?\" He smiled, \"Yes, this is the only place I stop when I want taquitos, mija. This is Mexican food. This, my dear, is real San Diego.\" And there, I said my thank yous and goodbyes to this perfect stranger who sent me off to enjoy the rest of San Diego. Don't take it from me, take it from him: Mexican Fiesta is the real San Diego."], ["Cindy L.", "Great Mexican food. Very filling and satisfying. Don't let the low prices scare you away. It's well worth the wait in line. However it's cash only."], ["Ryan F.", "As a purveyor of 'frugal eats', Mexican Fiesta appealed to me with their low prices. However, their prices also reflect the portion sizes of their items and sadly their quality too. Although I cannot say I truly know my Mexican cuisine, I have eaten at many other Mexican joints to compare and unfortunately Mexican Fiesta does not compare. My order consisted of their Machaca Burrito and while it was cheap, around $3.80, the size of their burrito was definitely disappointing. To start off, the burrito was smaller than your typical disposable water bottle. If that wasn't enough to disappoint, the burrito lacked flavor that I was heavily expecting. To be quite frank, the burrito was simply way too bland to the point that I relied upon their 'hot sauce' to supplement for taste. Sadly this does not only apply to their burritos, as a few days later I ordered their Carne Asada Fries in hopes of swaying my mind. Their fries are topped with the most liquified guacamole I have encountered and their carne asada was almost nonexistent to the point where my fries included close to a handful of pieces the size of a trident gum. The only saving grace to this meal was their fries, typically I'm not a fan of most fries but these ones had a nice bite to them and brought together the catastrophe that was this item. Overall, I would say this place suffices for a quick meal but their items do not satisfy if you're looking for quality Mexican food."], ["Amit T.", "Fish tacos are to die for and so are the burritos. Got enough food for 4 people for $16. Burritos are full of meat and very tasty as well.Absolutely amazing Mexican place and the best Mexican food I've had ever. Such a hidden gem - this is the place to be."], ["Caily T.", "I kind of want to give this place a bad review just so the line won't get longer, but alas I will not. I stopped by this delicious little establishment on my way to the farmers market. Surprisingly I did not take the time to consult yelp reviews as I believed I was wasting away due to lack of nourishment and anything would work. The BF and I agreed to split a breakfast burrito as we planned to take full advantage of the farmers market concessions.     We order said burrito, wait a while (pretty sure it seemed like longer for my BF given my whining about my first world starvation)  burrito arrives, open it up. First I must say, it's hot the tortilla looks amazing and the eggs are perfectly fluffy. Take a bite with some hot sauce....bam life changed. Their hot sauce is so good, so good. We scarfed our burrito down and talked about it for 2 days. Very next opportunity we had, we were back in breakfast burrito heaven with a pint of extra sauce and a few burritos for later.     I read some negative reviews and they might be legit, I didn't try everything but I loved what I had! Thanks Mexican Fiesta, your food is delicious!"], ["Jeff L.", "Omg!!Best way to describe this tiny little gemI grew up with Mrs Soto making me lunch everyday as a teenager. I'm glad to say I've found hot sauce that is as good as hers Machaca, beans, breakfast burritos- I wish I could give them 10 stars.  The food was so good I am adding it to my list of San Diego must have. I can't wait to try more menu items Well done ladies of Mexican fiesta"], ["Stephie Z.", "Just say yes to a breakfast burrito sans ham.  Egg, cheese (have to add this), hash browns, salsa. Less than $5, cash only. 5 -10 minute wait for a morning made right. Well worth it."], ["Evan W.", "HIGHLY RECOMMENDHad a California burrito and ordered guac w/ it. I'd say food is a 7/10. It was well seasoned carne and the tortillas have that authentic taste. Salsa and guac were okay too. Speed and quality are an 8/10. I called on phone and it was ready before I got there and still hot. Variety is immense and prices are decent. Downsides: sometimes they don't answer the phone and on a short lunch I can't make it happen. I've had coworkers say they had a bad experience so I'm just waiting for mine, but so far so good. Will update if something ever happens."], ["Patrick B.", "Probably the best California burrito I've had, and that's saying something for SD. Be aware that the restaurant doesn't have a seating area."], ["Lisa W.", "I'm upgrading my review because I had a carne asada burrito at Taco Express (down the street) and it was the oiliest shit ever. So I thought about Mexican Fiesta and remembered how not oil it was and cost $1 or so less!"], ["Ena Y.", "This place doesn't disappoint. Good, cheap, fast. I ordered two a carne asada tacos. The tacos were larger than the ones I usually get at taquerias in northern CA and tasted just as good. Prices were even better. Refried beans could have been better, but overall everyone in the group was satisfied with their orders. My husband absolutely loved his al pastor taco and the fiesta salad was decent. If you're looking for an authentic, delicious, quick, inexpensive Mexican food, this is the place to go."], ["Food L.", "I absolutely love this place! Very inexpensive and delicious. Fish tacos are great. Their hot sauce is the best thing ever!"], ["Melissa P.", "Pretty solid mexican food and the prices are super cheap. Try the chorizo burrito, breakfast burrito or the beef tacos. Only con is that their hours are limited (Mon-Fri 8:00 am - 4:00 pm, Sat 9:00 am - 2:00 pm, Closed Sun) and they're cash only."], ["Cindy H.", "I was staying at a hotel nearby and decided to go on yelp and find a place to eat that I can walk to. I ended up finding this place and was not disappointed. I got the carne asada fries and it was delicious! I liked that the fries aren't soggy like other places. It was jam packed with flavors. For it giving off a hole in the wall vibe, the food certainly delivered."], ["Michael G.", "Wow, the food at this place is wonderful. I had a burrito al pastor, thinking it was a gamble given my other experiences at Cali Mexican \"fast food\" places, but they really impressed me. I placed the order at 11 am (not rush hour), and it felt like it took 15 minutes to get my food, so I was annoyed about that. However, as soon as I took the first bite I knew it was worth it. The tortilla was perfect, as was the meat. I loved the fresh cilantro mixed in. Their great salsa and juicy, fresh lime was also appreciated. I can't wait to try their other menu items!Seems like people in the know call ahead with their orders, FYI."], ["Emily K.", "Finally tried this place and I'm very happy!!! At first I was bummed they didn't have a bacon breakfast burrito but after my first bite it didn't even matter!! I recommend calling first. Way easier :) enjoy!!"], ["Timmy P.", "If you're looking for authentic Mexican food that's fast and cheap this is your spot.  No drive thru but you can call ahead and make an order: I recommend anything that has the refried beans it in they are dam good"], ["Kasey B.", "The carne asada burrito is the best here!  What makes it so good?  Tortilla-to-filling ratio.  Let me explain.The tortilla is always fresh and homemade.  The carne asada is always juicy and well-seasoned.  It is also the highlight of the burrito--not overly smothered in guacamole or sour cream (as seems to be a common issue with burritos).  Now, this burrito isn't huge.  In fact, I think this is exactly why this particular burrito is good.  The filling doesn't overwhelm the flour tortilla.  With each and every bite, you get all of the burrito components.  I can easily finish one of these burritos for lunch.  This is not to say they aren't filling burritos, because they most certainly are.  They really are perfect in my humble opinion. Takes a bit of time to cook but that's because they are back there grilling up the meat fresh! So stop complaining!FYI: This place is cash only.  Understandable since they don't sell one item over seven bucks.  I mean be practical, don't offer to pay for your four dollar burrito with your AMEX card."], ["McGoats T.", "I was walking down the street looking for something to eat. A burrito sounded good so I was happy to find this place. At first glance, it's kinda a hole in the wall, literally. There is a very small window that you order and pay at & another small window you pick up your food. I wouldn't say it is the fastest burrito I have ever had, but one of the best. I had the carne asada, it was juicy and tender. I hate it when the meat is tough, that is not the case here. I guess when there is a line & it looks like a lot of locals, the food must be good. Prices were very reasonable (under $5). I will come back. I heard that I need to try the \"California burrito\"."], ["Martha G.", "Absolutely incredible Cali Burrito - lots of meat, the hash browns stay crispy and perfect, and the hot sauce is a delicious must.  The tortilla is also perfect, never has one better!There's no seating, so grab one and head someplace else to nosh."], ["Heather K.", "My god, this place is a revelation. Stopped by yesterday and had the basic chicken burrito -- just slow-cooked chicken wrapped in a tortilla. The tortilla, so warm! The chicken, so hot, and served in a hearty measure of piping hot broth/juice/liquid from heaven. It was like eating a giant Mexican soup dumpling. Went back today and tried the California burrito. This was the burrito all other burritos aspire to be. The meat was delicious, the fries maintained some bite, and the overall seasoning was on point.I see another trip to Mexican Fiesta in my very near future."], ["Abbie R.", "I passed by this place maybe 100 times before I tried it.  I'll be honest... I was suspicious, as it looked like a window that was doling out hepatitis to its patrons.  But the lines were so long at lunch that I started to think something good must be cooking in there. I was bringing in breakfast burritos to work from nearby Taco Express and my coworker sat down and had a serious talk with me.  He said he couldn't let me continue to eat those breakfast burritos while Mexican Fiesta was just around the corner offering the best B.B. in town for 3 bucks. The next morning I called in my order and picked one up at the window: EXCELLENT. I mean, the best. I sat at my desk and ate it and thanked my coworker over and over. The tortilla is light and buttery, the eggs/ham/cheese ratio is perfect.  It's no-nonsense and to the point. Simple and filling. I really can't think of a better meal for $3, especially in Little Italy.  Places like this are what make San Diego a great eating town. You can have a feast of fine Mexican cuisine for 5 or 6 bucks. Don't be scared of the rough-around-the edges exterior.  They're delivering pure Mexican delight out of that window!"], ["Tyler N.", "Had the rolled tacos, beef burrito and California burrito food was okay.... Nice little hole in the wall where you order from a window"], ["David J.", "As many others have said, this place is the bomb. I work onboard the Amtrak train so I picked up 4 burritos for my 2 day trip. The Bfast burrito was pretty good as was the chorizo and egg. But the Cali burrito was off the hook. It was that much better the next day as it say and marinated over night. I added the Mexican Guac and it was fantastic. Try all they have, but the heavyweight champ is the Cali!!!!!"], ["Daniel J.", "Well priced small Mexican joint. The Carne Asada burrito was high in gristle and lacking in guac and onions. Ok for the price point."], ["Adam R.", "Once again my fellow yelp reviewers did not let me down!   Came to Mexican fiesta this morning around 0900.  Since I am on east coast time I wanted lunch.  Ordered the California burrito, chips and a Pepsi and it came to $7.42!!  The burrito was amazing!!!! Fresh carne asada, pico, hash browns and cheese all wrapped in a homemade tortilla!!! Yummy!!!  Will definitely be back!!"], ["Becca S.", "Tried the rolled tacos then came back the next day to try the carne asada burrito. Both were delicious."], ["Michael S.", "Mexican Fiesta is only 0.4 miles from the Hall of Justice so I walked over during my lunch break from Jury Duty at San Diego Superior Court. I was lured by the YELP reviews but didn't realize the restaurant is really just a to-go window on India Street lacking any sort of seating whatsoever. I had to wander another couple blocks to find a suitable sunny spot to chow down but even there the wind didn't cooperate and  it overturned my hot sauce cup. Twice.  No matter - the grub was great. The first time I visit a taqueria, I usually order a California burrito or a fish taco.  As goes these two San Diego staples, so goes the quality of the taco shop.  I was hungry and bored out of my mind so I figured what the heck, why not order both.  The fish in the taco was nice and crispy on the outside and soft, succulent and delicious on the inside. I could have used more white sauce but it was a stellar fish taco. Same for the burrito. Crispier potatoes make crunchier California burritos, which set this one apart. This variant also had more salsa than I've had in comparable California burritos in the past but I was fine (if not enthusiastic) with the addition. I could have used more cheese and sour cream but I still liked the burrito a lot. Once again, great YELP reviews in big numbers don't lie.  Good food."], ["Charlie S.", "What is wrong with you people!!!??!!! This was/is far from a quality taco shop!Order: Cali Burrito(no salsa fresca, add sour cream) $5.25Pros: Tasty tortilla and sour cream seemed freshCons: Meat was overly salty, potatoes were almost non-existent so I honestly couldnt rate their quality, red hot sauce was bland and watered down. Last time I visited this establishment was in 2010 and I thought it was better than this.... While the price is cheap... so was the construction! Went here because of its close vicinity to my work, but will not be returning any time soon. 2-star rating only because you cannot find Mexican food for this price downtown"], ["heidi m.", "My Favorite mexican taco shop! Great prices, great hot sauce. Call it in so you dont have to wait in line, the place gets busy. Cash Only. Specify Mexican Guac unless you like the sour cream kind.Only thing I would change is for them to be open more!"], ["Scott S.", "This is the best Mexican food in downtown SD. It's good. It's cheap.  It's the best."], ["Christian M.", "I was quite surprised with this location since I got a tip to try it.  I didn't know there was no seating at all.  It's basically a hole in the wall type place set up on the sidewalk.  You order at a small window and wait on the sidewalk for them to call you name and pick up your food to take out.Prices are low so I guess it works out.  Food is pretty damn good though.  I tried the California Burrito and it's pretty tasty.  The carne asada is on point and their ingredients are pretty fresh.  Potatoes were good as well.  I'd give this place a solid 4 star.Keep in mind if you plan on visiting here that parking is hard to find.  You're going to have to pay to park around here.  Just a tip because I wasn't warned when coming here."], ["Sara B.", "This is seriously the best Mexican in SD... not only is it really cheap but it's quality. The only downfalls are that they only take cash, there's no parking and they close at 4pm on weekdays, 2pm on Saturday and closed Sunday."], ["Todd M.", "All I can do is echo the sentiments of others...this place was great!!  Best breakfast burrito I've eaten, and only $3ish. FYI take out and cash only order thru window."], ["Mike W.", "Little hole in the wall place with great tasting Mexican food. I can't wait to get back and try it again. Don't be scared by the appearance...there is some seriously awesome food being served out of that tiny little barred window."], ["Jonard T.", "The food here is average. I think the appeal is that it's a hole in the wall Mexican restaurant located next to trendy and expensive restaurants in Little Italy. For a cheap lunch, it's worth a try if you're in the area. The al pastor tacos weren't very flavorful, but the carne asada tacos tasted better. The carne asada torta wasn't special either. The bread was so bland I ate the carne asada only."]], "Bracero Cocina de Raiz": [["Glen J.", "Offers a variety of small plates with some awesome flavors!  Our server was pleasant, knowledgeable, accommodating and offered great recommendations.  The wood-fire charred octopus was amazing, as were the lamb barbacoa street tacos.  Two signature \"Get-A-Job\" cocktails were refreshing, smooth, and quite relaxing.  Desserts were equally amazing, and although Tres Leches was not on the menu, our server performed a bit of magic to make it appear when one of the members of our party mentioned that she would really love capping off the meal with that particular item.  Overall, a very pleasant evening, great food, great location, and great ambiance.Downstairs is open seating throughout the bar area, while upstairs is generally reservation only, including a lovely outdoor patio."], ["Chris S.", "We came here for brunch.Most of what we wanted was only served at dinner. We did however eat a lot of tostadas. I had one with shrimp and the lady had something that I can't recall, and we were both happy with everything. The drinks were very good for brunch. Service was impeccable and I would hope that everyone gets the same waiter that we had."], ["Angela A.", "A friend of mine decided to take me here for my bday dinner tonight and I honestly have to say it was a great choice! I loved the atmosphere and the food and drinks were delicious!We tried a few of the dishes and they were all so good! I highly recommend the heirloom tomato salad...it was simple but so flavorful and fresh. We also had the chilaquiles, fideo taco, mexiterranian taco, and lamb taco. ALL amazing! I also had a delish cocktail (can't remember the name) but it had jalepeno infused tequilla. SO goodThe service was also great. Everyone was very attentive and friendly. My glass was never empty!"], ["Mike T.", "Bracero for dinner proved to be less exciting than the Yelp reviews had suggested. First of all parking is an absolute nightmare! No valet parking either. Had to park in a lot for $15!Walked in and was seated immediately with our party (we had a reservation). The host at the front was very kind. Now on to where things got bad. The restaurant was HOT! They seemed to be saving the AC for another night. I was wearing a T-shirt and was sweating like crazy. The AC would come on for a minute then shut down. For such a nice restaurant I couldn't believe it. Our server was very monotone and not welcoming at all. The table had dirty dishes and there was no apology. Seemed to be in a bad mood all night long. The food was what I was most looking forward to and even that was nothing special. The best things were the tuna two ways and the street tacos. Do not get the corn tamale for dessert if you dislike goat cheese. And seriously who puts goat cheese in dessert!Overall I would not try this place again and would recommend skipping it."], ["Bianca Calle V.", "I heard about this place being the newest buzz hot spot in Little Italy, so I made it a point to have this venue as my girls night out to go place on a Friday Night.  I arrived early for happy hour 4pm to 6pm (honestly they need to extend it till 7pm) I was seated upstairs where all the buzz seems to be more active but as my party  arriving was 8 to 10 of us, they then seated us downstairs. It appears that table seating is only for reservations and outside Patio seating in both bars are open seating. If you don't make a reservation in advance you won't be sitting all Night at a table which is how we ended up leaving early at 8pm. I was lucky to be accommodated in such short notice. THANK YOU HOSTESS!! Anyways,  the food I thought was very good with small plate offerings and larger plates too. It's a great twist on Mexican cuisine with it all being flavorful. 3 ceviche choices, tons of different style tacos too. A bit on the pricey side but let's face it we pay for the location, the ambiance and the Decor! All which were beautifully Adorned. This place is definitely a meet and mingle venue if you are Single  so making connections won't be difficult at the bars:-) My gfs loved it and so did I but be prepared to spend $14 on a glass of wine here and $4.50 happy hour price for some select beers.  People watching at its full time high  for all the Busy Busy Busy atmosphere. Service was excellent too. YES I will return;-)"], ["Jules B.", "I've seen this place from construction and heard a lot about it over past few months. When I got back to San Diego I saw it had finally opened and was excited to try it. I've heard about the chef/owner in the past as apparently his restaurant Caesar's down in Tijuana is the birth place of the Caesar Salad. Also when running at night thought Little Italy I always saw lots of people and the building and decor looked really cool. With all that said I was definitely looking forward to trying it. I've only been here once for lunch so I don't know how the dinner is but I've heard it's really good. I went during San Diego Restaurant Week so I opted for the prix fixe menu which looked pretty good. There was a Verde Vida Salad that had Nopales called in it to start. It was ok but only had one small piece of cactus and lacked some flavor. The main was Brisket Torta that was really good. The brisket was full of flavor and cooked very well. Also the torta bread was delicious and toasted perfectly. There was a Chocolate Cherry dessert that was good as well. I also got a Beef Cheek & Lengua Taco that were both really good. Lengua isn't the easiest to repeat well so I was happy with it. Overall the food was good and I would try it again. On the bad side, this place is just too expensive for what it is. The building is beautiful and the vibe is good too. They have good beers and drinks and I really liked waiting out on the patio. But paying $5 for a street taco and $7 for TJ style corn is pretty crazy. With that said, I still will try again for dinner or maybe even happy hour if they offer it eventually."], ["Kimberly O.", "Have been here twice now and enjoyed the atmosphere in the evening but lunch is a lot more relaxed with elbow room at the bar. Delicious cocktails (Agua Chile) great appetizers but so far the Tacos are the star. The tortillas are incredible and the standouts on fillings are the  Lamb barbacoa, the Beef cheek and most of all the  Mexiterannean taco which is a life changing experience. If you're at all peckish right now stop reading this and go and get one immediately. Hell even if you're aren't peckish go and get one. They're just that good."], ["D A.", "It is overrated,it is normally priced for a fancy restaurant in little italy but oh boy,most of the  dishes are just like mehh..Cocktails,$10-$12,4 sips ,they are gone.I go to Mision 19 often in TJ which is Javier P's other restaurant.The food,the presentation,the service is incomparable.Bracero is doing great because it is in an amazing neighborhood.I think  He opened this one to make money,not to take care of his loyal customers and continue his dynasty.I have been there at least 6-7 times ..For drinks,appetizers and twice for dinner.The only reason is/was because my friends who don't live in Little Italy always wanna try that place.Overall:Overpriced fancy 2 star restaurant.Try it once for the experience but leave it with that.You won't be that impressed anyways.I'm shocked by the 5 star reviews here but most of them are not even locals so ...."], ["Michelle W.", "Loved the decor, food was interesting and delicious, and restaurant location was good.Make your reservation early - they are hard to get!  This is a popular place!  The food is good, albeit expensive.  Our server seemed a little snobby - I asked for ice water (hey, I like ice, sorry), and she seemed offended and said their water was chilled.  Then when we asked a question about an ingredient in a dish or how it was prepared, there was a bit of an eye roll.  I consider that rude.  I have eaten at many nice, expensive places where I feel 100% at ease, so this is unusual.A toddler at the table next to us got trapped in the restaurant's chair and it took his parents a good 7 minutes of nervous, good-natured wrestling to get him out (crying and scared).  Several employees walked by during that time, and not one of them offered to help, or even really slowed down, even though it was clearly a liability.  Hmmm.If I wanted to impress someone, I'd bring them here, but I don't think I need to come back.  Good, interesting food, but once was enough for me, thanks."], ["Odell H.", "I was not pleased with this restaraunt at all. It is an expensive and trendy place so I expected a lot more. The place was extremely busy and overflowing with customers both seated and waiting. Granted they had a very large staff, I think the staff may have been too big to the point that they created chaos amongst themselves and it was apparent that they were having a hard time organizing things. Even with the large staff the service was horrible. On their menu they had both enters and Latin finger foods like tacos. The small bites were excellent. I ordered a pork chop that they served to me rare ( at least it looked rare) it was pink. I asked the waitress what was wrong with it. She said that was how they served it and it looked like that because they cooked it in a bag. My first question is, \" why are you serving pork that looks rare?\" My second question is, \"why do you name your restaurant 'Bracero' if you are cooking your foods in bags as opposed to cooking it over open flames wich your name suggests? \"I was not happy with this establishment. For the price I expect a lot more."], ["D A.", "After a long day at work I decide to try out Bracero to see what the hype was about.  Arguably one of the worst decisions I have all year.Our reservation was for 3:30.  By 9pm 3 of the 6 people in our party where violently throwing up.  I personally was on the throne and unfortunately had it coming out of both ends.  There is not question or doubt that this was because of the food here.  We had the ceviche style plate, Birria, chilaquiles, guacamole, and torta.   We all shared the dishes so not sure which one was the culprit but I will tell you that I will absolutely never return here again.  I wouldn't send my worst enemy to this restaurant.DO YOURSELF A FAVOR AND AVOID AT ALL COST!"], ["Jacopo B.", "I headed to Bracero to grab some quality Mexican food and a few cocktails before a night on the town.  Not a bad place to have dinner in the wonderful neighborhood of Little Italy.  Good 'Street Style' Tacos, great atmosphere, solid line up of cocktails.  We started off with a round of cocktails, then had another round (and then another after that.)  The beverage menu here is great.  Lots of creative, fun cocktails to start off your dining experience right.  Many keep with the Mexican theme and are based with Tequila, but you will find something for everyone, and they won't be disappointed. I tried as many of the street tacos as I could, four in all and I was pretty happy with the results.  The Mexiterranean tacos were by far the best.  Delicious adobado style gyro meat, with fresh plump chunks of pineapple, these were fantastic!  The other tacos left a little to be desired, not bad, but, for example: the barbacoa was very greasy but flavorful.Overall the staff was polite, fun, and friendly.  For a Wednesday evening, things seemed disorganized though, and the wait was about 40 minutes for a party of two.....If I am in Little Italy and craving Mexican food, I'll probably come back.  At the same time, I didn't leave with that satisfied feeling of a great meal, great drinks, and a great dining experience. Overall ok."], ["Allie M.", "Ok so let's set the scene. Bracero was my pick for celebrating my second wedding anniversary with my husband. We went to The Patio (Goldfinch) for our last anniversary and had a slightly less than stellar brunch. We came into this with high hopes on a glowing recommendation from a co-worker and friend. I tried to make reservations, but with our anniversary only a week out and this place being hot spit--it didn't happen. Husband and I decided to risk it anyway and head down early from North County to grab a spot in the downstairs kitchen. (Sadly can't comment on the upstairs dining room and decor but the wall of cowboy hats atop the staircase seemed promising). For us lowly patrons sans reservations, the wait was actually minimal. We arrived just before 5pm which is when the downstairs dining room can order from the full menu. As we sat down, the front of house manager greeted us--but it was quite awhile until we actually got a server, probably 10 minutes. I was a little disappointed but all things considered, it did seem to really pick up (long line at the door) and appeared to be a shift change for the staff. I ordered the 'agua chiles' cocktail which was a watermelon, vodka based drink with a bit of a spicy kick to it. I loved it. Really interesting flavor, pretty stiff, but refreshing as well. As far as food--we ordered a handful of tacos, and a couple appetizers. OK so just to put it out there and not mess around, the Albacore Two Ways is AMAZEBALLS. Crunchy tempura, black sesame sauce, sashimi pieces and little jalepeno slices...oh my god. Just get the damn thing and be done with it. Also really amazing the BEEF TONGUE taco. Simple, elegant, on a delicious corn tortilla. Really, just, all around good flavor, well seasoned--on point. As far as middle ground--the \"Mexiterranean\" Adobada taco. Pretty intriguing concept with a yogurt style white sauce over the tangy adobada meat. It's a solid taco. If you're feeling adventurous--go for the shrimp and bone marrow sopes. Not my husbands favorite dish but I enjoyed them. As for the misses, the Fideo taco touts an 18-month aged cotija cheese--which, unfortunately is only sprinkled over the top of a crispy fried taco filled with what seems to be mostly a long grain rice, not the strong punch of chorizo when you bite into it. Ultimately, it tastes good but doesn't seem to fit the expectation build up by the description. Lastly, the poorest choice we made was the Grouper Birria taco. I can't really describe it any other way than just really, really...fishy. The elements here didn't seem balanced at all and the flavor was just not impressive. While I can't give this place 5 stars in my book, I will say that I loved the vibe and the adventurous menu (keep an eye out for the ant larvae). This place is lively and busy with good reason."], ["Lilly R.", "I suggest you read this review if you plan to try this new restaurant. Hmmm, where to start with this review. There were three phases of our dining experience, so I'll try to sum it up. (Backstory, my husband had heard of this hot new place and booked us a reservation 6 weeks in advance. Needless to say, we were optimistic and excited!).Act 1. We arrive and are seated in an upstairs tunnel like area. Turns out these are the tables they use to seat reservations (the entire downstairs space - the area we all see as we pass by and longingly think \"how cool is that!\"- is for first come first serve). So anyone making reservations gets stuck in the upstairs tunnel-like space which is dark, LOUD, and isolated. We order a few dishes recommended by our waiter and after the first two dishes, we are super disappointed with how bland and boring the courses are. The manager stop by, listens to our feedback, apologizes, and offers to re-seat us and offer some of his favorite dishes. Act 2. We get new seats outdoors (so much better), and we get treated like kings by the manager. He is the most kind, empathic manager I've encountered, and he offers to bring us some dishes he personally recommends, paired with wine. Even though we've had two dishes and aren't really hungry, I'm still open to experiencing this amazing food. He brings out multiple dishes paired with local wines, and he comes out to personally describe, in detail,  every dish. This is seriously one of the nicest dining experiences we've had. I am utterly impressed with the manager's kindness and attentiveness, and can't believe how many dishes he continues to bring out for us to try (not to mention paired with the wines).Act 3. Womp womp womp. After the dessert comes out, we get the bill. We are charged for each dish that he has brought out to us. (Thankfully he does not charge us for the wine pairing or the dishes we didn't care for before he moved us outside). Not surprisingly, we don't see him again once the bill arrives. SO DISAPPOINTED! We would have called it a night and left after the disappointing dishes, but we were offered what we thought was a reprieve on the house. Turns out, it wasn't on the house. Two things here. First, please get waiters who can describe the dishes and guide us toward dishes that fit our tastes. Second, don't have the manager come out and sweep us off our feet, and then charge us for the additional meals!For the quality of food, the ambience, and the price, I could not recommend this to any of my family or friends. This place was a huge disappointment and we will not, ever, be back."], ["Andrea G.", "Train wreck oh no! Was expecting so much more from this overly hyped restaurant.I love the concept, however I believe flavor. presentation and service are all musts for a place to hit the 5 stars.Servers are very uneducated in terms of the dishes they are offering. With so many choices one needs a little guidance, you hear me?! Also the parking can be a pain. The prices are a bit off, you can put lipstick on a pig and it is still a pig. Sorry not sorry."], ["Bella V.", "Had a late lunch here as it seemed like a nice and quite time to check it out. Place is cute and cozy! Very well designed Food s got a lot of flavors to it. Tried a few items on the menu. All single tacos priced at $5-$5.50 each. Tasty lamb neck tacos What failed was the service. Arrogance!Not friendly nor welcoming. I probably wouldn't return since I didn't feel welcomed"], ["Scarlett C.", "I heard a bad review shortly after Bracero opened so decided to give them a month or two to figure their stuff out. I'm glad we did because our experience was very good.We had reservations for a Sunday at 8:30 pm so the place wasn't crazy busy. The atmosphere is veryyyy trendy, I'm talking antique-farm-equipment-spinning-along-on-the-ceiling-in-the-stairwell trendy. The upstairs bar and balcony were looking mighty cool too, though we sat at a high table inside.We ordered cocktails - I had the Javiar Wallbanger which was delicious - two small plates and an entree and it was enough for two people. Specifically we had the albacore two-ways (mmmm!), the griddled cheese (double mmmm!) and the meat four-ways (sorry I don't know the exact names but you'll figure it out) and it was all unique and very good. I would recommend asking for extra tortillas though cause they were a little stingy on that front. The bill came to about $92 with tip. It's trendy-expensive but good, not like Kettner Exchange trendy-expensive and \"meh.\" Go if you're in the mood for a nice dinner or have friends in town."], ["maria g l.", "Last time we visited we came right at the last minutes if lunch I guess (unintentionally)  and we had to ask for everything from silverware to salsas...not a pleasant experience...then today we came in and comes out they closed early because it yesterday was Halloween?!?!?!  Gave them two stars because their food and drinks are good but service is flat so so..sorry"], ["Michael W.", "Underwhelming dishes, overpriced street tacos, and very slow waitstaff...I have been here three times and the hype is not there. You can't get a reservation on a weekend and I'm not sure why after these visits.Anything the waitstaff says is a hot item on the menu is most likely one dimensional and not very well executed..."], ["Miss M.", "First, let me start by saying 4 stars is a GREAT review. Bracero came as recommendation from a server at another restaurant. We got a little background story, and tonight we were craving a little latin spice for dinner so we hopped in the car and headed down. Great location, easy to find, beautiful building and the architecture was appealing. We had no problems with finding a table for two on a Thursday night around 6:45pm. Having read a few reviews of the place on Yelp, I initially thought we ought to sit downstairs, but the view from up top was too good to pass up, so we decided on an upstairs balcony table in the corner. The hostess was polite and honest in informing us that those tables were generally for reservations, but the next reservation was at 8:30pm, which would give us PLENTY of time. We waited for quite a while for our server to come over to us, but she apologized for taking so long, no biggie. We ordered a couple cocktails, the guacamole and Tuna Two Ways to start. Drinks and apps get two thumbs up. For dinner, we got two of the tacos, the Cook Pigs carnitas taco and the adobadas taco (By the way, Cook Pigs sells locally I found and they are INCREDIBLE!!!  Cookpigs.com). Anyway, for the past reviewers who say these are glorified street tacos, I would have to disagree. They are not intended to be a meal folks, they are STREET TACOS. Inherently small in size and not meant to single handedly fill you up. They are similar in size to a TJ street taco, with all the fixings of a gourmet taco.They are worth the $5/taco- so cork-it haters. For the main course, we ordered the Cook Pigs pork and the short ribs. I didn't care to ask what was popular because I already spotted what looked good, so nothing else stood a change of swaying my decision. Two thumbs up, squared, for both meals. Exceptional meat, great little presentation that all went well together. I will say, one family style meal and the rest of what we ordered was plenty for two of us and we are good eaters. We could have probably stopped there and not have felt like blimps. But of course, the food was great and we wanted to leave nothing on our plates."]], "Oscar's Mexican Seafood": [], "Dos Brasas": [["Jamie M.", "Thanks to Yelp I found this little treasure and it did not disappoint.  We ordered the carne asada torta and the carne asada platter. The meat was tender and flavorful and everything from beans to rice were not from a can. Based on reviews their breakfast burritos is where it's at but it was 4:30 in the afternoon.  Still very happy with the food and no lines!  Will return for a breakfast burrito soon!"], ["Issac G.", "Today I had a carne asada torta which at $5.98 including tax was a good deal. The bread was nicely glazed and firm. It didn't fall apart or get soggy. I like that they include avocado without charging extra. The meat was thin strips, but I prefer the later cube cuts in my tortas. Also, the salsa is great here. Hoy compre una torta de carne asada cual fue buena compra en $5.98 incluyendo taxes. El pan estaba dorado y firme. No se desbarató ni se puso aguado. Me gusta que incluye aguacate sin costo extra. La carne fue muy delgada, prefiero cortes en cubo más grandes. Eso si que la salsa esta muy buena aquí."], ["G G.", "Found this place before I started to Yelp. We were hungry and tired and a bit lost when we found this lil shack. Now everytime we hit SD...we swing by here for a snack.The food is tasty. The prices are ok. The food isna lil bland but nothing hot sauce, sour cream and some guac cant fix.Try it is you are sick of the chains selling wannabe mex food."], ["Dan O.", "Dos Brasas is a neighborhood Mexican restaurant just down the road from my hotel when I visited San Diego.  It's a mom and pop hole in the wall, although they have a parking lot and a small indoor dining area.  First stopped by for late night tacos and chicken tortilla soup.  Wow, it was so good!  Seasoned and carmelized beef and pork, the tang from the lime juice, yum!  The soup was also hot and savory, with huge chunks of tender chicken.  During my 4 day trip, I got another two meals from Dos Brasas, including a breakfast burrito for the flight.  Nothing disappointed.  Look forward to trying out some other items on the menu the next time I visit San Diego.  Definitely recommend!"], ["Tom H.", "Best breakfast burritos I've found in SD.  I get the one with ham"], ["Amaresh S.", "I was in the San Diego area for a work conference, and was mostly confined to our hotel for events and stuff. Managed to get away for some food before flying back home, and dos brasas was one of the places I tried. I'm super glad I did, because it was awesome. Super cheap, really flavorful, a great sauce, exactly the kind of hole-in-the wall place I was looking for. It wasn't crowded either - I have a feeling not too many people besides the locals know about this place. If I'm ever in San Diego again, I'm totally coming back.I got the chile relleno burrito - it was actually a chile relleno inside a burrito, with beans rice and some veggies. Super tasty, and it was cool to try something different. Came here with some meat-eating friends, and they really liked it too."], ["Olivia A.", "Went to get Mordiditas for the family.  When I got home and everyone was starting to dig into their \"food\" it was nasty.  They took frozen taquitos and covered them up with runny guacamole; sour cream and some greasy cheese.  The stupid things weren't even warm.  My husband tried to warm his up and it just made a sloppy mess.  A total waste of 26.00 for garbage food that wasn't edible.STAY AWAY FROM THIS DUMP!!!!!!!!!!!!!!!!!!!!!!!"], ["Ruben S.", "Good food. Lazy when busy and with regular customers. Greedy with extras. Red sauce is poor. Green sauce is good but sitting out all day ... Damn ."], ["JC R.", "I think there are a million taco places like this one in SD. The food is good and a ton of choices, but what sets this place apart is that they actually take American Express! It's close to the airport too."], ["Tiffany Y.", "I came here to grab a breakfast burrito before my flight, they are less than a 5 min. drive from the airport so it was perfect! They are located near an industrial area downtown, about 2-3 blocks from amvets ( which I used to go to all the time).  I was craving a breakfast burrito, so I got their original breakfast burrito with chorizo, the burrito was $4.50 and it was freaking HUGE. I had half of it for bfast, and the other half for lunch. The burrito had potatoes, eggs, cheese, and chorizo, it was soo filling, yummy, and flavorful.  The hot sauce here wasn't that good, but the burrito was so tasty that I didn't even need hot sauce.  This is a great hole in the wall place if your in the area and need some mexican food. It took less than 10 min. for my 2 burritos to come out!"], ["John T.", "Hands down one of my favorite local spots. Conveniently located near the yoga studio I practice at. Breakfast and veggie burritos keep me coming back for more. Salsa verde is superb enjoy their salsa bar inside along with some chips if dining in. Really under the radar place unless you are local as its not near the main intersections but def worth it."], ["Nick B.", "First few times I came here I ordered their fajita plate and fish tacos......they weren't bad but they didn't leave me feeling like I had scored. The fajita plate was poorly put together and just didn't have great flavors. Don't get me wrong, it was great drunk food, but that's about it. On their poorly constructed menu it said that a meal came with rice and beans......fast forward 10 minutes when my wife and I are sitting at the table to eat. She noticed that she didn't get the rice and beans. I obliged and drove back to ask the girl for the listed rice and beans. She said that I read the menu wrong and that I would have to pay for it. I pointed out the menu and said that it's right there in plain print....her response...outdated. Well what the shit? change your damn menu than.Decided that is was finally time to try their Carne asada California burrito. SCORE!!!! Seriously, that burrito was fantastic and definitely re-vamped my opinion of the place. After reading the other reviews I'm curious when the owner will call the place to yell at me for \"stealing\" pickled carrots from the \"free\" bar."], ["Lida W.", "I used to live near Dos Brasas. I miss their excellent soups. Stopped by today and had an awesome breakfast burrito. It's a good spot."], ["Pauline F.", "I tried the special breakfast burrito and it was very good. Came with potatoes cheese eggs and your choice of bacon chorizo or ham. Excited to try some of the food from their normal menu."], ["Katie M.", "Dont understand the hype, I was not impressed.First off the staff was rude and I couldn't understand anything he was asking me because he talked so quietly. I asked for onion on the burrito and you would have thought I was asking for a free burrito the way he looked at me. Thank God I got the onion that was the only thing in the burrito that wasn't dry or without flavor. The salsa was bland as well. I only added it to help with the dryness of the burrito. It was eatable but not even close to a worthy title of \"best breakfast in San Diego.\""], ["R N.", "Wow. This is by far one of the best asada burritos ever. I ordered a asada burrito, chicken taco and large soda for under $10. The burrito was plenty. I'll definitely be back."], ["Lindsey B.", "This is a great go-to authentic Mexican spot. I ordered a chorizo breakfast burrito and my boyfriend ordered carne asada fries. We enjoyed both dishes and I definitely recommend this place. The salsa verde is good and spicy. The parking lot is very small, but there is some curbside parking available. There isn't much seating either. Both of these things were not an issue for us on a Tuesday morning."], ["Michelle D.", "The best Mexican food I ever had! My sister found this spot on Yelp when we were on a family vacay in San Diego this past week. The location is right outside Old Town San Diego. It's convenient too since it has it's own parking lot. We all know how crazy it can be finding parking in downtown areas! The place looks a little run down, but hey! The best spots are found in the hood tho...remember that. The girl taking our order was very helpful and super nice. She was switching up our tortillas for free since my dad only likes flour tortillas and not corn ones. She also didn't even charge for our drink refills.We ordered carne asada fries, a carne asada rice plate, two fish tacos, and two carne asada tacos and  nachos...it came out to around $29. Not bad honestly.BTW, seatings/where you place your order is outside of the restaurant. The free chips and salsa bar is inside. GO INSIDE. I realized this halfway through our meal..."], ["Barnali D.", "A good spot!  Great food, mediocre service and space.I tried the steak, egg, and cheese breakfast burrito after reading all the rave reviews, and liked a lot!  It was huge, though, and I wish I had eaten half so I wasn't stuffed.  My husband enjoyed his fish taco, chicken tortilla soup (both flavorful and healthy!), and chicken taco (though he wished he had known it was a fried crispy taco, so he could have requested a soft taco instead).  As for the tortilla chips - they were way too salty!I was disappointed that they prepared my order to go after I specifically said I was eating there...and then they were not apologetic when I pointed out the mistake.  They didn't offer to fix the problem - not even offering a tray.The outdoor seating is nice, but limited.  On a hot day, stay away from the tables in the sun."], ["Kevin H.", "Nothing fancy.  Just straight up Mexican food.  Great value.  All their burritos are tasty.  We like it especially for a quick pick up/take out meal for the family.  Not a sit down place, except for very casual outdoor (and a little indoor) seating."], ["Chan L.", "Ate here about 11:30 am on Sun/26 Oct:- $6.25 for a breakfast burrito & a fountain drink.- My buddy ordered the same thing.  We both thought it was delicious and I was surprised my buddy didn't finish his burrito (he's a big dude).- Will probably be back the next time I'm departing San Diego again."], ["Katie E.", "Was on vacation with my fiancé who is a complete Mexican food addict. We went there due to the great reviews on Yelp. I had the Juevos Racheros and he had the Chorizo Breakfast burrito. The food was piping hot and absolutely delicious!! Service was really good and fast. Would def recommend to anyone!"], ["Julie S.", "Needed some food close to Budget Rent A Car. Pretty good breakfast burrito. Think a scoop of pico de gallo would make it better. Liked the squeeze bottle red sauce. Lots of great sounding options on the menu. Will give it another try."], ["Keith W.", "Food is okay, but the attitude is what deserves the 2 stars.  And, the parking can frustrating if not dangerous.  If the food was GREAT, I could overlook the rest. Been there a few times.  If I am in the area I might go back, but not out of my way.  Whatever you do if you go there, don't ask for extra salsa!"], ["Carol T.", "This place deserves no stars and should not even be Yelp considered. I looked up \"Best breakfast burrito in San Diego\" and one of the many places I find this place, thought it looked interesting so my family and I ventured here. We arrive and it looked promising, little did I know this place is a DUMP! dirty and filthy with disgusting tables,  no one cleans the seating outside and most of all AWFUL service. When asking about something on the menu they are very rude and irritable, I'm pretty sure it was because I'm Asian and they're racist, they told me 3 different prices on the SAME breakfast burrito. The owner of this good for nothing joint of a hole along with his employees need to go to customer service training, and a message to the owner:  Learn some manners! You are so rude and easily annoyed. Being in the business of providing service and food for people,  you rely on people like me to promote you.  Good luck with that one buddy! I will make sure that this will be a story all of my friends will hear and laugh about.  I will also be posting this on other food blogs to make sure everyone knows that the \"Best breakfast burrito in San Diego\" list gets updated because they sure made a terrible mistake adding your dirty hole in the wall to that list. Thanks for nothing."], ["Shawn L.", "Delicious, freshly made and authentic...beef tamales and Menudo...delicious!  They also included chiles, onions and cilantro on the side...very authentic touch ladies :)Open early, so I ordered breakfast...smells delicious while you're waiting!Also good looking chicas! Haha nice plus!"], ["Aryn G.", "Well since I live down the street I thought I would decide to try this place again, even though every time I went there in the past has been a disappointment. This time is the last time I will ever go there again. Haha once again stingy with the sauces, now they have watered down the green sauce and I just paid 7.50 for the smallest amount of Carne asada fries I have ever gotten from anywhere. Could they get any cheaper about the way they run their place. And get a new girl to run the front.Geez."], ["Pauline C.", "Good vegan burritos are hard to find. I modified the vegetarian burrito so there's no cheese, sour cream, or beans (made with pork). I also asked if they had other veggies they could throw on so they included yummy mushrooms. The first time I got it, I thought it was delicious but they forgot the rice. I didn't care enough to take it back because it was still so good. This time, they remembered the rice but didn't include the guacamole. I can only imagine how delicious it would all taste together, but that's what I get for being picky. Third time is a charm!"], ["Patrick Gabriel L.", "It took a family vacation after leaving San Diego to try this place. When you think Old Town you think classic Mexican food. It does have that, but it comes with a heftier price tag. If you do your homework and ask enough college students you may be pointed in this direction, a spot literally blocks away from the Old Town neighborhood.It's a hidden gem in the SD taco shop scene. Tucked between two much more well known taco shops in the area has probably overshadowed this place. Rest assured it's solid. The chorizo burrito was on point. Good size and excellent ratio of chorizo to egg. I didn't care for their chips, but the menu is well rounded. They can cater to all sorts of tastes.Bonus feature is that this place is near the airport. Whether it's your departure or arrival, you can put this on your dining adventure to do list easily if you're from out of town and seeking a quick quality taco shop fix."], ["Christopher M.", "The tacos I had here were good.I ordered three tacos, three different kinds (shredded beef, pork, carne asada) and for some reason two came with soft shells and the other a hard shell.  The shredded beef that came in the hard shell was *phenomenal*, the other two that came in the soft tortillas were just ok.  And the meat was kind of mealy tasting on those two.  But that first one was good enough to get me to return at some point, really really good."], ["Mark M.", "This breakfast burrito is hands down amazing. I don't even know how to express my feelings about this burrito. Eat one. Now."], ["Dot M.", "Excellent food - best places to eat are the small hole in the wall joints that a tourist would pass by! Mordiditas to start, and the chorizo burrito that was admittedly better that the ones I make...yummm."], ["Sara H.", "Bean tostadaScrambled eggs with cactus Fish tacosSalsaExtra corn tortillas :)"], ["Michael A.", "I thought I knew what a breakfast burrito was until I had the steak cheese and egg breakfast burrito at Dos Brasos.The delicious and large burritos that are fresh, hot and made it order to any specification will extinguish the memories you might still be carrying from any previous breakfast burrito experience.Added bonus is how convenient the location is from both downtown and the airport off the freeway.I was there at 7am... Which meant I was the sole customer and at last got to enjoy a little reflection with a few added dashes of hot sauce.Highly recommended."], ["Tracy Joy K.", "Stopped by here for a breakfast burrito before the Zoo during my time in San Diego. The burrito was a little on the expensive side for burritos but it was pretty big, easily fell apart. The steak was good and came with a really good hot sauce with a chipotle-y kick. Overall, a-OK but not the best burrito I have ever had."], ["Jake L.", "Needed a quick bite to eat as we pulled into old town for the night..  Wife pulled up yelp and found this place not to far from where we were staying so we could bring back to our hotel to eat.  Glad we did.We ordered the mar y tierra burrito and carne asada burrito and potato taco.  All equally good.  The tortilla on the burritos were crisped too perfection giving a slight rigidity to the generous burritos we were about to eat.  The carne was seasoned well, simple and tasty.  Our son kept stealing bites it was so tasty.  The mar y Tierra was equally done well, and loved finding a hidden shrimp every few bites.  I did not even sit down to eat, nor put my burrito down for that matter, and not for lack of space either.  The potato taco was good, have had better but did like the crunchy/chewy taco it was served on.Would we go back, yes.  The breakfast burritos would be something to indulge in next.  And for the price, cannot be beat."], ["Tom H.", "Reading the Yelp reviews I had to try their breakfast burrito. Freaking awesome!! I've been loyal to El Zarape but this place is closer to my residence and is slightly better! Geez Louise can't believe I said that!!!!. No meat, potatoes,eggs,cheese and Pico Di Gallo.  Mui Bueno. Service was awesome as well. Girl working the counter was friendly and courteous. I expected the service to suck after reading the reviews but it wasn't the case for me"], ["MaryJo A.", "Best breakfast burritos.  You can also order ahead to avoid the wait.   I always get the chorizo bfast burrito. Yum!"], ["Jake W.", "I've had the fortune/misfortune of trying a lot of San Diego's breakfast burritos (including Lucha Libra's El Jefe), and this place's steak, egg, and cheese burrito took a huge crap on all of them (in a good way). And while I tend to scarf down food like a tiny Asian woman trying to win the Nathan's Hot Dog eating competition, I've been splitting this thing in half to eat in two sittings (this isn't to say I COULDN'T finish it in one sitting - I think I'm just getting old, or something). The lady who has been taking my order has been very nice. I haven't really been there when it's busy, nor have I eaten there, so I can't say much about its cleanliness. I also haven't been verbally accosted by the owner (yet), so until that happens, I have to give this place my full endorsement.I can't speak as to anything else on the menu, so don't blame me if you're not good at ordering."], ["RT L.", "Just got charged $1.75 for tap water with my burrito, and was told by owner \"it's the same\" (as the bottled water I declined).  food is good, service sketchy"]], "Lucha Libre Gourmet Taco Shop": [], "Ortiz's Taco Shop": [["Rachel H.", "Ortiz's SAVED us while my boyfriend and I were on vacation. It was open late, was super casual, and was super cheap. No kidding, we ate here THREE times on our five night stay. Each and every time, we left thrilled.From personal experience, my boyfriend and I can attest to the deliciousness of: the carne asada fries, the sabroso burrito, the california burrito, and two orders of the rolled tacos (incredible).The low key, no BS atmosphere of this place is the ultimate win. You're not paying for froofroo aesthetics, as there is only a small dining room, and no public restroom, BUT-- this place was spotless each time we went in, and the staff couldn't have been better.If you're in the market for a small, corner taco shop, look no further. If we're in the Point Loma area again, I'm sure we'll be back.PS: Try the salsa that comes in the yellow mustard bottle. No, seriously. Whatever you're eating will be better. You can thank me later."], ["Frank V.", "We found this taco shop courtesy of yelp and were craving tacos and carne asada fries. Small taco shop on a dark corner and when we walked in we were greeted with a smile and how can I help you. I went with the team members recommendation and ordered the Cali burrito and my boo went with the carne asada fries and we were not disappointed. The asada fries were LOADED with carne asada, fresh fries and all the works. My burrito was rolled in a fresh warm tortilla, loaded with fries, carne asada and the works only to find out I ordered the same as my boo only rolled in a tortilla! The dining area is clean, there is a flat screen with college football and the jarritos were nice and cold. We were completely satisfied from the customer service to the fresh food and the A from the dept of health.  We are full and happy"], ["Stephen M.", "When I lived in San Diego this was my favorite burrito joint, and having just stopped in again while back in the city, I have to say it still is. Their tortillas are toasted to perfection, their housemade salsas are amazing, and their Cali burrito is the perfect ratio of steak, fries, cheese, and sour cream. I have yet to find a place in SoCal that comes close."], ["Mike P.", "Ordered an al pastor burrito with guac and grilled onions. No guac in it and barely any onion. I went back asked for a side of guac and the cashier told me that there was guac inside the burrito and asked all the cooks if they put guac inside and of course they all said yes. Instead of just apologizing giving me a side of guac not that big of a deal. Luckily the food is good here but work on your customer service skills."], ["Brenyn C.", "Probably the best Mexican food ive ever had. There's nowhere near I live close to the flavor this place has great job with the fresh, delicious food"], ["Alison B.", "Best machaca in SD! We love this place, especially because we usually stop over at the donut shop next door for the kids too!Great little hole in the wall taco shop. Their salsas are delicious. Nice setting to dine in. I love how I don't need salt for their food, it has plenty of flavor! Also very friendly customer service!"], ["Betsy F.", "Rude: I stopped in one night for a quick bite to eat, I heard this was a great place to get a good burrito. They man behind the counter was rude. Seemed irritated that I wanted to know what was in the burrito  I was getting, seemed irritated that I wanted it with no avocado, seemed irritated that I wanted green sauce instead of red sauce. The food was OK, the service was rude."], ["Daniella W.", "Loved it! I got the Sabroso burrito with chicken and shrimp. The shrimp were huge and the chicken was freshly grilled! The staff were also so kind and helpful! I'll be back when I'm in San Diego again, thank you!"], ["Mike V.", "The prefect fish taco."], ["Jade S.", "Yum. Very friendly and food was good. First time in SD eating cali fries and Carne asade fries. Only thing our food was a little cold but still really good"], ["X D.", "We have been coming here for years. Tried a variety of choices on their menu. Nothing beats their Sabroso. It is filled with rice, carnesada and shrimp with a special tardy sauce to die for. I truly recommend it! It gets bit crowded in there but we take it to go. The prices are so reasonable too! Come here for some good Point Loma Mexican food. Always fresh!"], ["Pastor Johnny C.", "Food was pretty good. Got the Sabaroso Burrito & Carne Asada Fries since Yelp recommended it. The cashier wasn't too friendly but I came for the food not for the customer service. Was in the area for a Marriage Getaway and was trying to find Mexican Food open after 9pm on a Thursday night. This hit the spot."], ["David C.", "This place is really as good as everyone says it is. Their Cali Burrito is without a doubt one of the best burritos I've had anywhere. You SD folks are so lucky to have this place. Can't find this caliber of food quality and pricing in the Bay.My usual order: Cali Burrito w/ (2) Fish Tacos = Gluttony at its finest!Friendly staff and quick service. This joint is a must for me every time I'm in SD. I already memorized the surface street directions. Sad....Until we meet again!"], ["Steve S.", "Got two crispy, shredded chicken tacos with beans and rice and a California burrito to go. Plenty of food, tacos were okay, guacamole was hardly noticeable. Rice and beans okay. California burrito okay. Nothing special. However, I shouldn't be making repeated trips to the toilet the following day after eating at any restaurant. And for that reason, last night's first visit will be my last."], ["Ann W.", "Straight up - HOLE IN THE WALL HEAVEN!!!  We recently spent just shy of a week on Shelter Island in San Diego.  The young man who served us coffee at the hotel that morning offered up this gem as some local deliciousness to go check-out and I am so glad we did!I had the chilaquiles with red sauce, rice, and beans (OH, MY!) and my husband had the California burrito.  My husband said it was \"stoner food\" as he happily ate away at his burrito (...which had french fries stuffed inside).  I think this is their specialty as person after person ordered it as they came through the door.  Stoner or not (he is in the \"not\" category btw), at the end of the day, when you are hanging at the beach, living on an island for a week or just in the mood for some good Mexican food, Ortiz's Taco Shop was fabulous, no frills about it, dang good food."], ["Hannah N.", "I get a Cali Burrito or Carne Asada Fries almost weekly so I figured I should put a review. I have lived in OB for almost two years ( moved from Dallas) and this place is Godsend. Friendly service, delicious consistent burrito, and amazing rice and beans my two year old loves. Whenever any family or friends come to visit we know we are going to Ortiz for a quick, amazingly priced burrito. Love this place."], ["Katrina D.", "Came down to the area to go jet skiing and figured it'd be nice to grab a bite to eat first.  Yelped local restaurants and noticed this one had some really good reviews so we stopped by and ordered two Cali burritos and two drinks.  Came out to about $15 total, but definitely not bad for the portion size you get. My boyfriend and I both ended up with leftovers.  The meat was well seasoned, cheese nice and melty, and the fries were the icing on the cake.  Also, GUAC :) The restaurant is really clean on the inside even though we ordered to-go.  Customer service was great and the cashier was extremely friendly.  You could tell they naturally have a good reputation as several \"regulars\" came in and the cashier greeted them by name.  I would definitely recommend their Cali burritos (as I can't speak for anything else) and will definitely be back when in the area!Only MINOR \"issue\" is that it's located in a very tight plaza making parking a little difficult and some of the patrons were on the younger \"rowdy\" side (but they all ordered to-go).  However, when it comes to good food no issues with this place at all"], ["A J.", "Oh, ok den. Y'all  got that gudt taco. Best carne Asada fries and nachos I've ever had. Bellee dat. Holler at your manz an em."], ["John G.", "Solid 3 1/2 stars!While in San Diego, you gotta have the Cali Burrito and Carne Asada Fries. These are ubiquitos in San Diego as a summer fog in San Francisco. I've had my fair share of Cali Burritos and Carne Asada Fries in San Diego. I've also had better elsewhere - like Filiberto's comes to mind. Or maybe it was my druken stupor that made them taste better?Having said that, these are pretty good compares to the ones in the Bay. And you cannot beat the low, low prices. It's a local neighborhood joint that seems to be popular with the locals and that is good enough for me. Picked up 4 Cali Burritos (1 with Shrimp) and 1 Carne Asada Fries last night for dinner. Brought them back to the hotel and they were devoured within minutes. Plus I gotta mention the rockin' sauce that gave it that extra kick and flavor. If it wasn't for the sauce, I'd just rate them 3. I was sprinklin' that sh*t like gravy over fried chicken. Yup, it was finger lickin' good. Overall, a pretty good joint at cheap prices."], ["Brandy W.", "You know when you've fully integrated into the community when  you've found your neighborhood taco shop.I loved this place so much that I went back for dinner after eating brunch there a few hours ago.There is really nothing fancy about Ortiz.  The small strip mall has a handful of spots that you'll have to share with the thai shop, the donut shop, and the bagel shop.  With that said, I'm sure you can imagine the mornings are the busiest.  You order at the register and wait for your delicious meal to be called.The tortillas were the tastiest freshest tortillas I've tasted here so far!  Something as simple as a tortilla can completely sway a review!  The machaca was well mixed and perfectly proportioned.  I didn't taste an overwhelming flavor of egg or meat.  The carne asada fries were huge!  I like that there was a ton of different toppings instead of JUST carne asada and cheese.   The best tacos come from the most humble of places.  This is definitely one of those places."]], "Mariscos El Pulpo": []}