{"Berta's Latin American Restaurant": [], "Wine Vault & Bistro": [], "Rustic Meatballs": [], "Cueva Bar": [], "Tapas Picasso Spanish Restaurante": [], "Enoteca Style": [], "The Joint": [], "Embargo Grill": [["Andrew E.", "The food is delicious and very reasonably priced. I recommend the Montego Bay, Empanadas, and Calamari (Thursday special!). This might seem stupid but even their water is good. I keep bringing my coworkers there and everyone loves it. Thanks EG!"], ["Monica P.", "When my boyfriend and I arrived yesterday, it was just before dinner rush. He had found this gem on Yelp after seeing they specialize in Cuban sandwiches. (The only reason it even peaked our interest is because of this awesome movie called 'Chef' on Netflix -- definitely a must watch btw!) They had a huge banner right above their menu that said \"TOP 100 PLACES TO EAT IN THE U.S. IN 2015\" so my expectations were pretty high already. We ordered at the counter and were told that we could take a seat and they would bring the order to our table. My bf got the pollo grill plancha (chicken) and made it a combo with the canasta de papas whereas I got the original cubano with pulled pork. BOTH WERE BOMB.. Although I didn't get a chance to taste his sandwich because he scarfed it down before I could even finish my first half :TI enjoyed dipping my piping hot, crunchy cubano into the garlic aioli and curry sauce (that came with the fries) and it tasted even BOMB-er. We were also able to get the super crispy and FREE plantain chips during our meal too. Service was great considering they had a full house and only 2 servers + one busser (in training) on the floor. Staff seemed pretty tired but were still sweet enough to ask if we were doing okay.Overall, The Embargo is a great hole in the wall to check out if you're ever in the area!"], ["Stuart S.", "Great Surprise. Right near Sea World, so was convenient afterwards. All the food we had was great!"], ["Miguel G.", "You order at the front and Latin music greets you at the door, honestly feels like a little vacation in here. My girlfriend is Colombian and LOVES anything with plantano (plantains aka fried bananas to some) and the food did not disappoint."], ["Lainey S.", "I got to try this place out for the first time this past weekend. I was craving a sandwich but wanted to try some other stuff from their menu as well.Luckily, I came with someone else so I didn't have to gorge out all by myself. We ordered the Cubano Sandwich and the Boricua dish.The Cubano came out first. SO tasty! We inhaled it! My fiancé said he might've liked a little bit more pickles on it, but I thought it was great. The Boricua is slow roasted pulled post, Puerto Rican style pink beans and yellow rice, with Caribbean BBQ sauce and cilantro.  I thought the BBQ sauce was a little too sweet for me, but still very good. The portion size was perfect. The prices are very reasonable, the staff is very friendly, and the food is so yummy! I can't wait to come back and try more of their menu."], ["Angel R.", "Awesome food!! Really loved it yesterday & came back today! I brought my colleagues here. I had the build your own with fish. It was delicious! Checked in & got free plantain chips - pretty fabulous! We couldn't stop eating them. Customer service is really great too! I highly recommend this place. Food quality, speed of service & friendliness of staff was terrific!"], ["Nicole A.", "I am so glad I found this hidden gem! The food was so flavorful and such a reasonable price. If you are giving this place a try definitely try the fried plantains appetizer! They are so yummy! I have been dreaming about them ever since I ate lunch there a few days ago. Also if you check in on Yelp you get a free appetizer of plantains which were really good as well. This is one of those places where you want to order 5 things to try them all. I refrained and said I will come back 5 separate times so I can enjoy them all! I highly recommend checking it out!"], ["Vincent B.", "I wish I could give this place 6 stars. That's how great the restaurant is. A hidden gem"], ["Jamie D.", "Food was amazing! Empanadas was great w/ the curry sauce. Roja Vieja sandwich was perfect and definitely hit the spot' Free plaintains w/ check-in. Coming back to try the grill dishes."], ["Cristal M.", "Super yummy food and great service!!! Food was so great I couldn't stop eating and couldn't resist dessert!"], ["Willie D.", "The medianoche Cuban sandwich is the best Cuban sandwich I've ever had. The staff is super friendly and the atmosphere is second to none. I stumbled upon this place a couple years ago and then realized it is Top 100 places to eat on Yelp."], ["Kristin S.", "Searched for a Latin American food place in San Diego for my son's high school Spanish class cultural activity. I can't tell you if it's authentic but all of the food was outstanding!  I had the Key West which was wonderful. I love that you get the salad, rice, beans and chicken all in one dish. The plantain chips are really good with the spicy (mild) aioli sauce. The appetizer beef empanadas were really good too.  If you are looking for some variety in your dining out life, try this place!  Very casual and family friendly. Nice wait staff."], ["Bryan M.", "Friendly staff and great food! If you are interested the film chef and want to try the Cubano which is featured in the film then you have got to check out this place you are in the area.We had the ham and Swiss cheese croquettes,  the calamari and the pollo chicken wings and the signature Cubano which was just delicious. One of my highlights of visiting San Diego"], ["Alexa O.", "Went last night before the Madonna concert.Thank you Yelp for the recommendation.The shrimp with rice and beans was to die for.Had never heard of this place or thought to go there but I will definitely add it of places to eat if I'm in the area."], ["Bryan B.", "Great food. This place will knock your socks off. It's Latino food done right. Ask for Irwin, he's the man. So helpful and passionate about his food. All in all we will be back, several times."], ["Amy R.", "One word for this establishment: AMAZING!!! Came here on a Saturday night and once we walked in to view the menu, the lady at the counter advised us they did not have shrimp, chicken, or ropa. No big deal, since we planned on getting something with steak anyways. For our appetizer, we ordered chicken wings and the fries. For our main dish we ordered the Cubano Panini and the \"create your own\" plate-choose currasco with carribbean jerk sauce and yellow rice and black beans. Desert was the maduros foster. Everything was DELICIOUS. Would HIGHLY recommend this place'!!"], ["Ac C.", "After watching the movie Chef on netflix we were dying to try a cuban sandwich! So we headed over to Embargo grill due to their good reviews. We were NOT disappointed! The cuban sandwich was everything we imagined and more! They know what they are doing. Get it exactly as it comes. I dont like mustard on anything but i was firm on trying my first cuban sandwich in the traditional way. And i loooved it! The mustard/mayo spread they use is perfection! The staff was incredibly friendly, helpful and professional! The way the lady explained the food on the menu made us feel like we were in a 5 star restaurant! No lie! On Mondays they have an awesome special for the cuban sandwich, fries and a drink for 9 bucks i believe. Cant wait to go back and try more food from their menu! Altho im afraid I'll keep ordering the cuban sandwich because of how delicious it was haha... Go try it guys!"], ["Michael R.", "Awesome food, great atmosphere - unique to the area, highly recommend checking out out!"], ["Jonathan F.", "This was the best experience ever. We were exhausted after an 8 hour drive and a day at Sea World. Got on Yelp to find a good dinner place that was reasonably close and had good ratings. Came across Embargo and we were so glad we did. The Cubano was unreal. My picky 14-year old daughter even loved it. I don't hesitate at all in recommending this establishment."], ["Anh N.", "Tried the Cubano here a while back and remembered it was quite delicious...but 11 hours after eating the jerk chicken sandwich today and I'm still thinking about it really says something. The panini- perfectly crunchy on the outside, chicken - dark meat and extraordinary flavor, combined with the garlic aioli and marinated onions made this almost as good as Paseo's in Seattle!"]], "Romesco": [], "Tropical Star Restaurant & Specialty Market": [], "Viva Bar + Kitchen": [["Cindy Y.", "Had a groupon for a brunch on Saturday, totally worth it! Foods was okay, but the bottomless mimosas were strong and the service was awesome. Sara was our server, she was very kind and her service timing was on point! Skirt steak and eggs that came with potatoes and fruits was about 6/10, but the chimichurri sauce was really flavorful. Chicken and waffles that came with pesto sauce, syrup, and potato salad were tasty but could've used an extra minute of cooking on the chicken for crispiness. They don't skimp on mimosa, so I'd definitely come again for a casual weekend brunch in gaslamp."], ["Hillary B.", "Went here for brunch for the second time and it was still just as amazing! Got the bottomless mimosas and steak and eggs and it was great. Sara P was our waitress and she was great and made our time the best! Will definitely be back :)"], ["Maria M.", "Shannon is my bartender soulmate!!!!Or rather,  she is an excellent bartender who got a non drinker to fully enjoy drinking.  Okay... occasional drinker.But overall this bar is awesome!"], ["Heidi I.", "I have been here twice now.  It's on the fancy side, and expensive.  We sat at the bar and had a drink, and then moved on for more reasonably priced food.  I am sure it's delicious....actually I know this because I had appetizers there about 6 months ago, but we were just not feeling it the other day.  The bartender was not especially friendly or talkative with us, so we bailed.  I've had Moscow Mules here a few times, no complaints.  The food is creative and the few things I have sampled were good, we may go back when in the area."], ["Laura M.", "Delicious!! We purchased a Groupon before coming to San Diego and it was a great deal! I had the Filet Mingon, sautéed mushrooms and potatoes Melissa was our waitress and she was awesome. Thanks Melissa!!"], ["Jennifer S.", "Rarely do I ever give 1 star reviews, but this place deserves it!Short version: Don't bother making a reservation, just say you have one when you arrive. It doesn't matter. Also don't eat the food here, just get the bottomless mimosas if you have a deal.My husband and I ventured to Viva because of a Travelzoo coupon. It was a good deal and we had never heard of Viva serving brunch so we thought we could check it out. Well from the moment we checked in with the hostess everything went downhill.We were greeted by the hostess and told her we had a reservation. She doesn't check anything (there's no computer) and says ok she will find a table. After walking through the restaurant and coming back to the hostess stand, she approaches ANOTHER couple and asks if they have a reservation. They say yes and she walks them over to a table. My husband and I stood there in shock. What just happened?! After she seats the other couple she then looks at me and asks if I have a reservation. I thought we had already covered that. YES WE DO. There was no line of people. It was just us. Nothing could excuse that goldfish 5 second memory. She ditches us at the first seat she could see (one right behind the hostess stand outside).On to the food. Ordered the short rib benny. Waaaay undercooked eggs! There was more raw egg than cooked egg. Because of that the bread underneath was a soggy mess. The sauce was probably something chipotle since it was tinted orange, but it lacked flavor whatsoever. It was a raw creamy mess. The only thing I ate was the actual short rib itself as it was the only safe thing. Husband got some sort of chocolate pancake. Not worth the $.As for the bottomless mimosas, all the tables around us and inside the restaurant received a little carafe of OJ and a bottle of champagne. It looked great so we decided to go with it. Unfortunately, our server brings out a pre-mixed mimosa carafe. It was definitely more OJ than champagne. Why would be treated different from all the other tables in our section? Or in the restaurant for that matter? I was visibly upset. After the seating fiasco and the mimosa carafe, I definitely felt that they were discriminating against us for some reason. My husband flags down another waiter and asks if we can be treated like everyone else and pour our own mimosas. She apologizes and brings out a bottle. Her explanation is that when the waiter wants to make less trips to a table she brings out a premade mimosa carafe. Makes sense, it would take forever to drink all that OJ.All in all, they definitely have a lot of kinks to work out. The front of house needs a LOT of work and perhaps a revamp on procedures. Some waiters may benefit from more training as well. Thanks Travelzoo. We now know we do not like nor will we ever return to Viva!"], ["Tyler F.", "Decent place to come and have a drink. Confused on the music and sports playing on the TV but we came in, had a beers and watched some sports. Happy hour was a good deal and food looked really good."], ["Erin L.", "My husband and I went last night... What a great experience!  Beau took care of us, can't say enough about his hospitality.  We had the Barcelona paella and filet mignon, both were perfectly prepared. But overall, it was Beau who made our night.  We can't wait to go back."], ["Kristine R.", "We came here for  brunch thanks to a travelzoo coupon which included two brunch entrees and bottomless mimosas.The place itself is situated right in the middle of Gaslamp and is next to the mall, it's on the corner so you can't miss it! There's outdoor seating or you can sit inside where the music is a little too loud. Anyway,  we had a reservation for 11:15AM we were seated inside since there were no available tables outside. The inside is fairly large and there are few tables that can hold big groups, there's also the bar and its four tvs each showing a different sport. By the way, there's a free chips and salsa upon check in but it's only available during dinner (boo, the check in thing doesn't say that).Ok onto the food: they have a decent brunch selection: there's omelets, sandwiches and sweets such as pancakes. I opted for the fried chicken torta with fries. I thought this was delicious actually I loved the crispness of the chicken, though I wish it had more aioli. My boyfriend  got the carnitas with eggs dish.  This dish came with potatoes, eggs, beans, carnitas and a green sauce which he said tasty a little sour. Though all in all he liked the dish. His one complaint was the portion was small. I didn't have the same problem, I thought the portion was just right.We did get the bottomless mimosas, but it didn't feel bottomless. First they give you the juice and champagne bottle, then they gave us a small carafe of champagne and lastly they gave us a premixed carafe. Boo. I remember in NYC bottomless mimosas meant they just kept pouring the champagne in your glass, no questions asked. But hey, every place is different, I get it.I probably wouldn't come  back here not only because of the skimpy bottomless mimosas, but also because this place is pricey without the coupon. There are better brunch places (cheaper too!) around the city."], ["Ian L.", "These people work very hard to present you a memorable dining experience. The food was artfully presented. My wife loved the ahi tuna, and I enjoyed the paella. Two things prevent a full five star review and that is that the service is slow, and the fish in my paella was pretty dried out."], ["Morgan R.", "The Chorizo omelette, steak & eggs, and bottomless mimosas for Sunday brunch. Food was phenomenal and the atmosphere was fantastic. The only thing I would improve on would be the service. When we first got here the owner was very attentive asking if we needed help after our waitress had left, but after getting our food, our waitress didn't return for a period of time. If you're looking for good drinks and great food, I'd come here. If you like to have attention on you from the waiters and waitresses, you'll be disappointed."], ["Elli H.", "I came on a pretty quiet night but still enjoyed myself. The waitress was very friendly and the food good.  I ate the tuna tartare with avocado. It normally comes with fries but I had it without. I then had soft tacos with beef with were yummy."], ["Emma O.", "First time dining at Viva with a friend. We had the carne asada fries and shrimp tacos for dinner. They were both so delicious. The plate of carne asada fries is enough for a few people. And the shrimp tacos were probably the best I've ever had! Very pleased with the service and food. Also a pretty cool atmosphere inside!"], ["Jonathan R.", "Absolute fantastic first experience....we came to brunch off a groupon we bought and this place did not disappoint. We had Sara as our server and she was great...highlights were the steak and eggs and carnitas Benedict...the chimichurri seasoning/sauce on the skirt steak w/ the eggs was unreal good...we will be back again!"], ["B D.", "5 stars. Sent my parents here for dinner for their murder mystery weekend, spoke to the hostess in advance to explain the theme, and their waitress killed it. Nailed the role to the t. Asking them for their envelope and clue (Contained groupon so dinner was paid for) and she keep the game going. Parents said the food was fantastic,  and will be back!THANK YOU VIVA!"], ["Ariel M.", "The food is phenomenal and the decor is modern and awesome.  Great bar staff and strong drinks.  However, the service was less than subpar.  20 mins after we ordered an app, we had to go to the bar to ask if we could order  entrees.  Waitress hardly checked on us and when asked for an extra something, was completely forgotten.  Food yes, service"], ["Curtis G.", "Beau is by far the utmost knowledgeable professional in the food industry that I have ever spoken to. My girlfriend and I used a Groupon and chose the Seared Ahi and the Seafood Paella for our entrees. We also ordered the Baked Mussels which were our favorite. If you ever go to this restaurant be sure to ask for Beau because he definitely knows what he is doing."], ["Katherine I.", "Absolutely the highlight of my Comic Con weekend in terms of food and drink. After being left flying solo by a very busy bf who was working during Comic Con, I took a solo walk and ended up at Viva for my Saturday brunch. The special read \"Short Rib Eggs Benedict\". It was calling my name! Since it was just a party of me, I opted to eat at the bar, and that was actually a great choice. The female bartender hooked me up with an AMAZING bloody mary chock full of celery, olives, and lots of lime. The manager came by often to check on me and to chat so I wouldn't feel so alone up there. The bloody mary could have been a meal in itself. It was absolutely delicious! If they threw some maple bacon in there, I would have had three of those as my breakfast! The short rib Eggs Benedict was all that I hoped for and more. The short ribs were tender, seasoned well, and melt-in-your-mouth tasty! The eggs were poached perfectly. The seasoned potatoes came with a spicy chipotle ketchup, and I had a little fruit cup on the side to round out my meal. (Gotta love California!) I love that they offered me 3 types of hot sauce to choose from. How awesome is that?! The food itself would have warranted a 5-star review, but the service was just over the top amazing. It was so good, I came back a couple more times with some friends I made at Comic Con just for drinks and apps. Same fantastic service with a different staff. If I ever make my way back to San Diego, this will be one of my go-to spots!"], ["Caroline T.", "I haven't been for dinner, but their brunch is awesome! I had their steak and eggs and it was delicious. Their bottomless mimosas are an added bonus to a fantastic meal, and their awesome Sunday bartender makes one of the best Bloody Mary's in town. Can't wait to go again!"], ["Grace C.", "I was in San Diego for Comic-Con and went to this place for brunch with coworkers...kind of a mistake!! Our waiter was either very new or just not trained well and there were so many small things that detracted from the experience. 1 coworker asked for coffee and OJ (note, this place is a bar) and the waiter said he wasn't sure if they had orange juice before looking at the bar and changing his mind to say yes, they did. Another coworker asked for a veggie omelette with egg whites and the waiter replied, \"So...you want egg whites instead?\" and then, when he delivered the food, he said it was a chorizo omelette (luckily, it wasn't). All 3 of us asked for coffee, but there were no spoons and we had to stir our cream in with our knives. The last straw was probably when my coworker asked for butter for her pancakes and 10 minutes later received a little cup of MELTED BUTTER. She was eating pancakes, not lobster!!Overall, the food wasn't bad and the space was pretty nice, but the service was just so sad to see that I wouldn't recommend going there if you're in San Diego."]], "Pata Negra Market": [], "The Prado at Balboa Park": [["Elizabeth F.", "SO...I met my 5 girlfriends at the Prado for drinks and appetizers after a stunningly beautiful day at Balboa.  Needless to say, the flatbreads and Sangria were absolutely delicious.  But that is not where mt story ends...When we finished, I found out that I had parked in a lot far from where everyone else was,  i assured everyone that I would be fine and headed out, An hour later I realized I had lost my car!!!So I headed back to the Prado.  That staff was SO helpful and kind!!!  In fact, Sophia even walked me way out to the parking lot and helped me to find my car so I could get on my way.What service!!! Such kindness and consideration!!!I cannot say enough about this charming, darling place,Thank you, thank you, thank you!!!!"], ["Diane A.", "We always head to Balboa Park for a stroll - when we were dating years ago to now that we have a one year old. Always had events at the Prado but this time went to late lunch. Decor is splendid inside. Adds flair to the restaurant. You can request Voss water instead of tap. I ordered the grilled portobello mushroom arugula salad with grilled shrimp and paired it with wine. Wow that was so good!! We ordered my son the grilled chicken tenders and fries. I've never heard of kids menus with grilled tenders so this was pleasant! Thumbs up.Overall it was a good experience and the food was superb!!!"], ["Adriana A.", "A restaurant to go and be seen. I've been here for happy hour and lunch. I enjoyed lunch more, but the happy hour was great given that we needed to eat and had theatre tickets. For dinner happy hour/dinner, we had a couple flatbreads, some fries, and the black bean soup. All of these were tasty, but nothing to write home about. The fish tacos that I had for lunch were better, especially with the mango and slaw. But even though the build yourself concept seemed fun, it wasn't well executed. The tortillas stuck together. The beans were just okay. My friend really liked her turkey burger. That was a very generous mean, and I can attest that the fries were deliciousThe beer selection here isn't great. The are a couple local beers, usually saint archer and greenflash, on draft. But nothing amazing or rare. The cocktail and wine selection is more satisfactory. Still, you can't beat the location."], ["Patti B.", "I had a bad waiter this past Friday (wont go into details) but I love the atmosphere outdoors even on a cool crisp day And the Kobe burger was excellent! I complained to manager and she fixed the problem. I will definitely keep coming to this restaurant."], ["Nicole F.", "Our service/server was far superior to our last visit. I wasn't even planning to return but due to another nearby restaurant being unexpectedly closed we decided to give the Prado another chance. The chicken club sandwich was a little on the bland side which was surprising as it had bacon on it. Fortunately the \"Deliful\" Sandwich came with a side greek salad which we used on the chicken club to zest it up. The strangely named deliful had bison, pastrami, turkey and bacon. The only thing about this sandwich that I didn't care for was the malted brown bread....very dry. But the other flavors all worked well together. The fries were really disappointing...next time we'll go for the homemade chips.They really know how to do their cocktails right. The mojito was one of the best I've had.  You are definitely paying for the park ambience so just know that you aren't getting any culinary masterpiece here."], ["Phil F.", "Romantic place.  Great ambiance.  Food can use an upgrade. We came here for our anniversary.  We started with the spicy calamari as per everyone's recommendations here.  It was \"ok\".  The waiter naively pushed the short rib.  It was very tender, but lacked a bit in flavour.  The mashed potatoes however were outstanding!My wife had the steak and shrimp duo.  Great flavours but shrimp were on the smaller size and the steak had to be a 3oz steak. Our dessert was the star of the night. You MUST try it. It's amazing!!!! Seriously.  I'm not getting paid to endorse it either ;)"], ["Karen N.", "I am a fan of the Cohn Group, and have now eaten in about 6 of their restaurants. (I totally miss the Ken Grill. Can we bring it back in another form, maybe in North County?)Over the last year, I have been to a lot of events @ CRG restaurants, since they are partnered with KPRI.I really enjoyed the Happy Hour at the Prado. My friends and I have eaten there several times before the concerts at the ballroom. It can be difficult to get a table, so give yourself some extra time.The staff was really friendly, and had to hustle with the crazy crowd (I'm sure the event made it more crowded than normal). The food was good, and with HH pricing you are able to try more things than you would normally. Their salads are really good, and I also really love their desserts.We got a promo coupon at the event, so I will have to come back and eat in the regular restaurant."], ["TaeRay D.", "Husband & I decided to come here after taking family holiday pictures. It was busy but we were seated right away. Today was super hot but they did the best they could and seated us in some shade. They were just breaking down a wedding and it was nice to see the planes in the sky as well. Ordering was fast but the food took forever it felt. We ordered a moscow mule (weak and watered down), white peach soda (delicious, Husband ordered 2), a caesar salad with salmon for me, & steak tacos for the Husband. Food was good but it took awhile to refill waters. I had to get up and try to find the server since we were melting in our seat to pay the bill. I think he was doing the best he could but it did take too long for me today."], ["Elysse P.", "I love love love love LOVE Balboa Park. It's just beautiful, so of course The Prado compliments the park well.My boyfriend picked me up from the train station downtown and took me straight to The Prado for dinner. Unfortunately we didn't have the pleasure of sitting outside, but their patio is stunning and overlooks the park. (If you're making reservations, ask for outdoor seating!!).Romantic and lively. A live band was playing while we were having dinner... it was nice :)+ seared American Kobe beef sushi roll - everyone rants about this app on their review so we had to order it. It's a sushi roll with asparagus and kobe beef. Sauce: wasabi cream, aioli, and a ponzu dipping sauce. A super Americanized \"sushi\" roll... it was good, but nothing to be excited about. If you really think this is amazing, please try real sushi. Or a beef tataki roll at a real Japanese restaurant. Guaranteed you'll be mind-blown.+  thyme roasted jidori chicken grits & gravy - boyfriend wanted be slightly healthy so he ordered the chicken. It comes with potatoes, onions, pea vines, and topped with a mushroom cream sauce. The chicken was moist and the dish was overall light and flavorful, but also not the best jidori chicken I've ever had.+ red wine braised beef short ribs - Didn't even have to use a knife. I just gently scraped the ribs with my fork and it would fall off. Amazing texture. Flavor was mediocre, but the texture.  The Prado is definitely a great date spot, but more so for the setting and not the food. I am in no rush to come back."], ["Jennifer H.", "My server was so ecstatic about the food that he didn't really make my decision easier. I could tell from the tables around me that everything was good. Settled on the Kobe sushi roll and it didn't disappoint. Filling enough that it held me til after sunset. Sangria wasn't all that great....wish I'd gone with a glass of wine."], ["Cerena P.", "This place is amazing, if you're in Balboa park I definitely recommend coming here. The calamari is so incredibly good. The pear martini is delicious! The best martini I have ever had. The food overall is absolutely amazing. Service was excellent. Our waiter was very friendly and helpful. Probably the best service I've ever had at any restaurant. We were also the only ones seated in our area, which is probably why the service was so great. But no complaints! Fresh silverware after our appetizer, wiping down our table in between courses, and constant refills on our drinks. He was great! The only thing I was disappointed by was my boyfriend and I showed up around 3:30 wanting to have an early dinner; but unfortunately when we arrived the dinner didn't open until 5. The hostess was very nice she just told us they were serving small things like soup and salad then. So we made a reservation for 5 to come back. We waited an hour and a half but it was so well worth it!! If I'm in the area again I'll always come here! 5 star food and service!"], ["Kirsten S.", "Tuesday night date night!We've been ogling this place for years now, but always walked past due to prices. Low and behold, the clouds parted, and we saw the sign. $39.95 for two full entrees and a bottle of wine or champagne. Yes please. I got the roasted chicken with potatoes and onions, while my husband ordered the seafood paella, and we decided a bottle of champagne was most appropriate for date night. Both dishes were beautiful, well-portioned, and delicious. Our champagne came with its own little ice bath bucket, which was extremely classy, and our waiter was quite good at refilling our flutes right as they emptied. If you can afford Prado normally, then go check it out! If you can't normally afford Prado, go on a Tuesday! The atmosphere is terribly romantic, and it's right in the middle of Balboa Park, which in and of itself is incredibly beautiful. Do it."], ["Henrietta L.", "We had a wonderful lunch in the front patio but what made even more special was our amazing waiter Chris.  His timing was perfect."], ["Bert G.", "Happy Hour at the Prado Restaurant.  My wife and I had tickets to \"In Your Arms\" a dance/musical at the Old Globe, and decided to partake of a little HH food and drink.We sat ourselves in the back patio, which offers a nice view of Balboa Park, and an endless parade of airliners on short final for LIndbergh Field's runway 27.The service was average, it took a short while to be acknowledged, but our drinks came out pretty quickly.  Not so quickly for the food, as I noticed the group next to us arrived after we did, and was served their HH food about 10 minutes before ours came out.  Gotta keep up with the Joneses !While we were waiting, we munched on some really excellent designer crackers accompanied by a container of garlic and spice infused butter.  Our food took a while, so we asked for seconds on that combo.It's been a while since I've visited this Cohn restaurant, and noticed that the HH prices have increased noticeably.  Margaritas are now $5.50, up from $3.50, as I recall.  The plain-jane HH flatbread was $7.50, and the single pork slider with homemade chips was $5.00.  Sliders are usually served 'plural', aren't they?  Anyway, it was pretty good, although the chips were darned near tasteless, and we left most on the plate.  Neither food item was much of a deal, actually.Well, it's a nice place to sit and talk, and maybe people watch or airliner watch.  It was A-OK."], ["Sam M.", "Review based on food quality only. Our Sunday lunch server was awesome.I ordered the Paella (about $22). Rice had no flavor, very small portion, ingredients seemed low quality for the price. Very disappointing seafood dish"], ["Diane W.", "This restaurant is right in the middle of many San Diego famous attractions. The place is large and very scenic which made lunch enjoyable, and the service was very good, even with recommendations. We got the calamari fries and crab cakes to start with. I definitely recommend the calamari fries, they are so different they typical restaurants and the flavor was awesome! The crab cakes were subpar, nothing out of the ordinary. For my entree I ordered the prado paella which was filled with seafood, I only wish it had more rice! It also didn't take that long to cook cause they start it in the morning."], ["Elizabeth A.", "I find it strange that I have never been to the Prado until now. This restaurant is lodged in the middle of the famous and beautiful (and famously beautiful) Balboa Park. When renewing my Explorer Park membership, The Prado gave my family a $20 gift certificate. I decided now was the time. First things first, this place is popular. Make reservations (and ask for patio seating). Arrive early to find parking. Enjoy the walk from your car to the middle of Balboa Park. My server was extremely friendly! She shared recommendations and joked with us. Sometimes this is not the case at a tourist location. I was pleasantly surprised! We had a seat on the patio which gave us a view of the Japanese Friendship Garden. I started with a Caipirinha: a Brazilian drink made with cachaça, sugar, and lime (heavy on the cachaça ;) This drink is a refreshing change from a margarita on a hot day. The wedge salad was great with bacon, tomatoes, and blue cheese. I would have taken a picture of the beautiful presentation but I gobbled it down before I realized I forgot. For my main meal I had the kobe beef sushi, which came highly recommended on Yelp. It was an interesting take on sushi. I am glad I tried it, but I think I would go for something else next time. I also tried the kobe beef burger with gorgonzola. That was GOOD. The cheese took this burger to the next level. The burger was paired with fries and baked beans. So, all in all, a great experience!"], ["Andrea M.", "The waiter was excellent, and very attentive to our every need! The host was very kind, and all smiles which was nice and made the whole experience so pleasant! We had a table of six, and everyone thoroughly enjoyed their lunch! If you find yourself in Balboa Park my family and I highly recommend going to the Prado for a bite to eat and a glass of Champagne, and or an IPA!!"], ["Courtney O.", "Perfect place for a date night!!!The BF surprised me by bringing me here for my birthday! I've been talking about the Prado forever and I'm so glad we got to come here! First, let me start by saying that the atmosphere is perfect for a night with your special someone! Super cute and romantic! My birthday happened to fall on a Tuesday, which coincided with their date night special. Two entrees and a bottle of wine for $40! Seriously, what a steal. Everyone should come here to take advantage of this deal. The food is INCREDIBLE! I took a look at the menu and immediately knew I'd be ordering the paella. I studied abroad in Madrid and am always craving a Spanish fix. The paella was one of the best I've had in San Diego despite trying many traditional Spanish restaurants around town. The rice was cooked soft, which I like and it was packed with all sorts of seafood and meat!! So delicious and filling. The BF got the short ribs and they melted in your mouth. They came with tasty sour cream and chives mashed potatoes that were equally perfect! Everything about this place was perfect. I would also like to shout out the amazing staff. Our waitress was so attentive and fun! She was really considerate and caring the entire tonight and I really appreciated that. No doubt in my mind that I'll be back!"], ["Andrew N.", "The Tuesday night date night deal is really good because you get a bottle of wine and two entrees for $40. The paella is really yummy. It's filled with all kinds of meats and seafoods. It's very flavorful. You should definitely get this especially during the deal. The atmosphere is very pretty and elegant. Brought the GF here for her birthday and she loved it. It's right in the middle of the park so there's plenty to do and see before and after your meal."]], "Urban Crave": [["Dan R.", "Surprised me for airport food. We all know the horror stories of bad service and bad food. Our service from Danielle was exceptional! The BLT hotdog was good and everything was served piping hot! My smokey Titos was excellent and had a proper \"kick\" to it. Great send off to Hawaii"], ["robert d.", "They call it street food but it is far from it. The food takes a long time to get served (not good for an airport). Additionally, it is not simple to eat. The blt although tasty, was a hot mess. You had to reconfigure the sandwich in order to eat it.The food quality is good, it is probably the best choice at this airport terminal. It isn't a great value but that is to be expected at an airport."], ["Jordan C.", "Dishonest and Incompetent! They sell a yogurt parfait for $7....which they buy next door at Peets Coffee for $5.50. Just made me feel like I was slapped in the face.Also, asked for no cheese on my and my wife's burrito. Both had cheese. Sent back. New ones came without cheese but also now missing avocado and salsa. Not complicated...only four things on the menu (one they get from their neighbor) and they can't get one special request right."], ["Shalini G.", "SD Terminal 1 airport food..beyond TSA...Alaska Air flightwell we didn't exactly have ANY options since we passed TSA...fortunately this was pretty decent...fed the kids and us pretty quick..kids loved the food! i liked it good enough =) service was friendly.  wish they had more seating. if it was just me...i wouldnt mind eating food on my lap...but with kids, a table is essential."], ["Jozlyn H.", "Giving them 5 stars because of their Bloody Mary!!!! Their version is called \"crosseyed Mary\".  Definitely puts u down before your flight.  Urban Crave is located near the Hawaiian Air gate 51 at the San Diego airport.  I stopped here to get a breakfast burrito when I overheard some patrons talking about their bloody Mary's.  I just had to try one.  In fact, I had 2, before I got in my flight.They soak all kinds of peppers in their vodka. That's what makes this Mary sooooooo delicious!two of these drinks gave me he perfect buzz for my 6hour flight back home to Hawaii.LOCATION: Conveniently located next to gate 51, Hawaiian Air in the San Diego airport.BLOODY MARY: aka Crosseyed Mary.... 10 stars! The best I've ever had! Strong and tastes delicious!!!PRICE: Eh.... Normal airport prices lol kinda pricey but worth it.FOOD: I had their yuppie breakfast burrito. Thumbs up. Bacon eggs fries and some other good stuff wrapped up in a burrito.SERVICE: quick, friendly... And he also recommended some lemonade that would knock me off of my feet (21 and over only)Can't wait to travel through San Diego again...... Just for their bloody Mary's"], ["Johnathan C.", "great food and drinks great service ...only negative it's in the airport so limited seating ... overall it's worth it I had a good visit"], ["Guy B.", "Airport bar and food. For an airport I'm gonna knock a star just for the price. But food and ambiance was great. Service was great. Drink was delicious lol. Flight was delayed and had some work to do. Got me a screw driver (dbl) and a chorizo wrap and got to work. Loved the wrap. Very spicy. The OJ was spiked perfectly. Hope I never have time to repeat, but happy with this airport bar."], ["Kiki H.", "I wouldn't come back here for several reasons:1. Music too loud; this isn't a club it's an eating establishment.2. Service felt rushed in the beginning, slow while waiting for our food, and it took a unusually long time to check out because the card machine wasn't working/the employee couldn't figure out how to work it. Not good when needing to eat and board a plane. The employee also spilled water all over the floor by us when refilling our water and never cleaned it up.3. The food was mediocre. My husbands Cobb salad looked like it was placed in a food processor before service. it was crazy chopped! The ingredients were not of a high quality and definitely not gourmet. The salad was not dressed and he had to ask for dressing on the side. My Texas burger was so jam packed of different flavors it was confusing. The mustard overpowered everything else including the crunchy onions and beef. The cheese was lacking, and there was way too much bacon. The French fries were barely warm and just not good.I really wish I would have just went to Phils!!"], ["Vicki C.", "Boy, there are some harsh reviews for Urban Crave. I am going to set things straight for y'all!Urban Crave is a watering hole in the San Diego Airport that also sells food. In order to eat at Urban Crave you must pass security which means you are traveling. So this is not a destination for mouthwatering delicacies. Who goes to the airport for fine dining? This is a place to imbibe before a flight.  They sell beer, wine, cocktails and virgin drinks. I had a bloody mary which was prepared with a spicy mix and I could  really taste the horseradish and Worcestershire sauce. IMHO it was a delicious drink. At first glance it looked great too, however the celery was tough and hard to eat and the pickle had seen better days. My advice, don't eat the pickle. I did enjoy the salty olive.The draft beers are big and cold, but what really makes this place special is the happy people traveling. Before our flight to Cabo we sat at a large group table and met all kinds of fun people. It was like a boozy get to know you party of everyone on our flight.  Seriously folks, half of the flight full of people were partaking at Urban Crave.  I am even planning a day with one of the friends that I met.Come to Urban crave to get an attitude adjustment, and meet cool people. Don't come here for pickles or fine dining."], ["Kathy A.", "If you have to wait for a Hawaiian Flight out of San Diego this is the place to do it.  Absolutely the best Bloody Mary in the Airport.  I'm usually the 2 hour wait person since I abhor being late and would rather read to pass the time then panic that I would lose my flight...or sit in the Urban Crave and people watch.  Service is spot on, they make their own infused Vodka prominently displayed with all the goodies in it.  I can do without the celery, pickle and olives that are added and try to save them for the next person.  Food is fast and good too.  Had the Bahn Mi this time which at 8:30 in the morning really hit the spot.  The couple next to me had the Philly Cheese Dog which was over a foot long with the correct creamy cheese, onions and red peppers.  Looks awesome and definitely enough to split.  Worth stopping in."], ["Trish S.", "I grabbed a quick breakfast sandwich to go and subbed bacon for the ham. It was delicious! The airport used to have such microwaved crappy food... but thank the travel gods for the fresh cracked eggs, quality generous bacon and cheese on a soft rill: It totally sustained me past lunch on a lob travel day. The service was casual, nice and prompt. I needed my order to go and they were fairly quick about it and packed it in a wrapping that kept it warm for about 15 minutes till I could settle in and eat it at the gate. I only docked a star because it was a little dirty behind the counter, could have use some wiping down and a good sweep. The kitchen is in full view and open so thats an important element that needs to be adhered to constantly. Not bad, just a little attention was needed and it wasn't busy."], ["Steven G.", "My reviews are written with relativity in mind...that is...you cannot compare service and selection at a restaurant like Denny's or at the other end, Donovan's to an airport restaurant....you have to compare it to other airport restaurants, and in that perspective Urban Crave is pretty fine!I didn't eat because I wasn't hungry, but I got a double Balvenie Portwood shot for $15.58.  The fact that they had it is a miracle, but the price is comparatively inexpensive.The bartender Jonathan was attentive and professional and poured with precision,  The space was hip, clean and inviting.  My flight took off at 10:30 on a Wednesday night, and they were pretty much open until 10:00 pm, which is nice.  I think the kitchen shut down at 9:30 pm.Would I check it out if not at an airport?  Probably not, but am very grateful that it is there, as it is massively cooler than Gordon Biersch afaiac."], ["Harold W.", "I like that every booth and seat at the bar has a charger for everyone.  They weren't busy and the young lady that helped me is Vilma D.  She was awesome. She checked on me and realized I was sprawled across 3 booths charging all my devices and eating.  She just started laughing and said she would keep checking in to make sure I was good. I ordered a wedge salad which looked great and arrived promptly. My only thing is that wedge salad is traditionally with Bleu Cheese dressing this came with Ranch and Bleu cheese crumbles on a tin plate.  Wasn't a fan. I did ask for Bleu cheese dressing Vilma said they don't carry Bleu cheese dressing but could bring me more crumbles and ranch dressing.  I said ok since she was sweet about it.  I thought for sure for an airport restaurant I would see an up charge for the extra toppings.  I was prepared to pay and wasn't even bothered that she didn't mention an up charge.   To my surprise there was no need to mention an up charge because there was none. The service  and no up charges for extra topping maybe the only reason I gave this place an extra star in my rating."], ["Rocky B.", "I mean it's the only thing really open with real food in this area. I wanted the BLT on a wrap and would've paid extra but they don't do that. Baguette is ok. U have no other options if ure stuck here"], ["Anne C.", "Husband got the yuppie burrito while waiting for our flight... A hefty size for $11, price is expected considering it's in the airport. Not a whole lot of food options in this part of the airport, just glad they had breakfast items! So anyways back to the burrito... It's a pretty heavy meal, not something to choose if wanting to eat light before your flight.. But it's packed with egg, bacon, fried, salsa, and avocado. Lots of flavors! My husband, with his big appetite, was satisfied."], ["Amanda W.", "Great bloody marys. Very comfy place to have a drink and watch a game while waiting for your flight. I had a burger as well....very good. Waitresses were very polite &efficient."], ["Michael J.", "It is really difficult to express how loathsome this place is. The layout is so inefficient that it is nearly impossible to get a seat when the place is full of two and three person tables, each with one person at it. Then there is the piss poor on tap beer situation and a menu comprised entirely of fatty unhealthy food. Every other twrminal at SD has a far better option tha this pathietic mess of a bar."], ["Alicia O.", "I generally avoid eating meals at airports due to how expensive it is (unless I'm at PDX) but I found myself with a long flight delay and so I checked out the menu. Not one item on the menu is vegetarian. And no, I don't want a salad with the meat left off of it. I want an actual meal. Just offer a veggie patty with your burger options, please? Problem solved. Additionally, how about some good, local craft beer (we're swimming in it here in SD!) because I sure as heck am not going to pay $8-11 for a Shocktop on draft. Even at the airport."], ["Lucas M.", "Overpriced even for airport food. Burrito is basically tortilla and french fries with a tiny bit of meet and eggs. Not even remotely worth the price."], ["Mitchell W.", "Tasty, yes. But if your specialty drinks are $18, you might want to list the price. For a few more bucks I could've had the whole BOTTLE of Makers. When I don't see a price I assume $12ish.... Not $16 and $18. Terrible. Not even international terminal."]], "Antojitos Colombianos": [], "Wet Stone Wine Bar & Cafe": [["Margaret M.", "Who even knew this place was here?! I must have driven by hundreds of time and never even noticed it! Luckily on our way home from dinner we stumbled upon it and wandered in for a night cap. The place was full, and we snagged the last two seats in the back. Within minutes we were greeted by a server, and a man who appeared to be the owner - both were super friendly and helped us with our selections.The atmosphere here is what I loved most; it's a really sexy & sultry spot with low lighting, natural elements that make you feel like you are in a swanky European courtyard. Sadly we didn't try the food, but our drinks were perfect and they had a great selection of wine & beer. We will definitely be back for happy hour & dinner!"], ["A.M. C.", "A fabulous place to go for happy hour or if your are feeling like an appetizer dinner! The white wine sangria is a must! Super refreshing and light! And the meat balls were out of this world!"], ["Vanae T.", "Such a cute place for happy hour.LOVE LOVE their tropical white sangria! i went here a few times with my girlfriends.all of the dishes i tried, was delicious and the staff is helpful in picking out wine.i really like going here for the happy hour."], ["Elise L.", "What an absolute gem in the neighborhood! Its so delicious and the wine is excellent and the prices are fantastic. Go for happy hour! Its usually buzzing with young professionals."], ["Elle J.", "I had never heard of this place because I live under a rock and also I don't look around very well because this is a place I pass by often enough to notice it. Upon entering I was impressed with how cute it is inside! We were seated right away and we were surprised to learn that it was happy hour (score because it was a weekend).I am ashamed to say that I sorta put up my nose at the HH menu. I thought $6 bites wasn't that great of a deal and that there wasn't a ton of options.I was wrong.Caprese Salad ($6): Really good and a large portion. It was perfectly made and I could not believe how large it was for the price. They also have a little pile of greens to add to your meal which really hit the spot. Fontina Bread Pudding ($6): Really yummy. I liked the take on bread pudding and trying a savory version. I really liked it a lot, but one could tell this was not a diet food! Wow, really cheesy flavor without being greasy and a tasty aioli. I wished for more greens on the plate but really it wasn't a huge factor.Wine: Red Sangria came in a really cute fashion with mint and cinnamon stick. The other wine was good but I am a lightweight so it gets foggier.As some time wore on the place got crowded and lively. It made the service super slow and it took a long time to get the check but our waiter brought us a little Sangria on the house for our trouble so I can't get too huffy about it. The one thing I didn't like was that the 20% tip was already added. I actually would have tipped him more for being so nice and also I like to round up from what the cost of the meal is and then add 20%. I just found it really weird for a party of two to add in a gratuity. I wonder if they do that all the time, or if it was just a really busy night and because the service really fell off in the end he might have been afraid I wouldn't have tipped correctly? Parties of 5+ I understand but I like to give my tips the way I want to. Also if this is common one can only think that if you just come in for a glass of wine at the bar you might be paying 20% for each drink when it should be a $1 or $2 per glass."], ["Vanessa H.", "Sorry - wrong establishment!  No sure how to remove a review.  Knowledgeable pourers; friendly and"], ["Suzy G.", "The sangria here is amazing. Love this place for a fun girls night or a romantic date night with the husband. This is one of my favorite places to take my gal pals when they come to visit. Hip scene and perfect for conversation. They have a little spot outside where you can sit on tree stumps while you sip on cocktails. Cute! Pro Tip: Get a pitcher of sangria for Happy Hour - you will not regret it! I love both the red and white sangria equally. Def the best sangria I've had so far in San Diego!"], ["Jenn L.", "Stopped in here for a drink and a bite on their Saturday happy hour before the symphony. Delicious sangria. Fun atmosphere. And they had chimichurri sauce on one of their food items!I'll be back. Just wish they were open on Mondays, because that's when I'm usually in the neighborhood."], ["Shannon H.", "Came for dinner Saturday May 10th.  Great wine lover's spot.  The selection was good and the sangria was GREAT.  The atmosphere is dark and intimate yet trendy.  It did get a bit loud once the place filled up.  Service was wonderful.  Our server (I think her name was Wendy...?)  took great care of us, had good suggestions, and was consistently checking on us."], ["Marvin M.", "Looks like a hole in the wall on the outside, nice vibe inside.  Curry Tuna bocaditos were delicious and the ahi tuna tartare was fresh and scrumptious."], ["S J.", "Loved this little gem. We stopped in on a Sat nt for drinks & apps b/4 our dinner date recently & just loved everything about the place.Charming setting, cute & cozy. Great H Hour , which we did not expect for a Sat @ 6pm. Where else can you get a local delicious craft beer for $3.00?? Really!! $3.00!!! We had an avocado/garbanzo bean appetizer that was delicious, & a couple of drinks & its was less that $25.00 After rolling out somewhere else for dinner, I wished we would have stay @ Wet Stone longer!!We will be back. & SOON."], ["Banu K.", "wow, loved this place.how lucky am i that i work right across the street.we had a 'little' happy hour here from 4:30-6:30, and Christian graciously let us have the cute back area, which seated almost 25 of us.we arranged this event for our staff, and it was PERFECT.great service, the food was delish (especially the pork belly panini, OMG)by the time we left at 6:30 on a thursday night, the place was PACKED with patrons, and it is such a cute, quaint place.i can't wait to swing by after a crazy day of work, and bring along my coworkers.wanna join us!? you will have such a personalized, intimate time, the servers were amazing too.thank you for the special 2005 red, 'just because'. i'll definitely be back."], ["Kathleen P.", "The food is good, the watermelon agua fresca is delicious, the service was friendly, and the space is pretty cute. But for tiny portions of over-priced food, I would rather hang out somewhere else that is more satisfying."], ["Neil R.", "Excellent all around.  I would say this is a very intimate place so would be great for a date or romantic night out.  I came for a glass of wine but also ended up getting their Hummus and Pita which was awesome.  It really hit the spot.  The wine, which was their happy hour special, was very good too.  The interior is cozy and chill- does not fit a lot of people but that does seem appropriate given the vibe.  The servers are really friendly and attentive.  They have a good happy hour too."], ["Marie M.", "Having just moved to the area I was eager to explore my surroundings. Stumbled upon We Stone which is a block from my home.  Was beyond excited to see Sangria on the Happy Hour menu. Sangria is my favorite and I consider myself quite the expert. The Sangria was good except for the cinnamon stick in the glass which left a bizarre taste even after we pulled it out.  We ordered hummus to start and then tiger prawns on ciabatta and a flat bread. Our meal was over $80 for two people and we really didn't eat anything of substance.  It was all good but a little pricey."], ["Guineasaurus R.", "What a great restaurant and wine bar! A very thoughtful and eclectic menu. Very fun little details. Excellent service. Great quirky music, created a very chill vibe. Not too loud, great for a date or out with friends you want to catch up with. The tiger shrimp and churrasco plate were memorable. Will definitely be back!"], ["Allyson W.", "Popped in here to get a drink after dinner.  Great spot.  I really loved it.  I ordered a glass of wine that I also loved.  I loved it so much, that I called the next day (after looking at BevMo and Total Wine) to see who their distributer was, so I could contact them to see where I could buy it.  The woman working didn't know and told me to contact the manager via Wet Stone's website, where you can email the manager.  So I did.  She said he was \"really good about answering emails.\"  Well, two weeks later, I'm still waiting for a reply.You don't need an MBA to know that in order to run a successful business, you have to keep the customers happy.  If they like a product that you have, you should be responsive to their request because it may eventually lead to future sales.  I would have even bought some bottles from them had they at least responded.Good idea, cute place, bad customer service.  Probably won't be back."], ["Lucy C.", "An intimate and friendly wine bar in Bankers Hill.  Christian, the owner, is always so nice and helpful.  I always ask him to suggest something for me.  Great place if you are solo, with friends or date night.  Love the gorgeous bossa nova music and setting."], ["Nancy S.", "Love love love this place ! From the moment you step into this little organic cafe you'll fall in love. Theistic is soothing , the ambiance is so amazing . It really makes you feel like you're in a romantic cafe in a foreign country. It's totally casual. Perfect place to end your busy week with a great happy hour. $6 specials $3 beers and select wines. Must try the Mosqueca it's a Brazilian soup with fish and shrimp in a coconut cream tomato broth. It's to die for. I also tried Their flatbread, that was pretty good as well. Very light but filling. I definitely recommend going ."], ["Brian K.", "stopped for sangria and a snack.  the white sangria was good, but i was expecting more given the reviews.  very good only.  the garbanzo bean and avocado toast was quite tasty.  a nice atmosphere off the beaten path"]], "Costa Brava": [], "Cafe Sevilla": [], "Chez Loma": [], "El Salvadoreño": []}