{"Thai Taste": [["Cesar M.", "Been here twice and everything has been delicious. They also have boba which makes the kids happy."], ["Gwendelyn W.", "This is my favorite thai place in San Diego. Quite possibly my favorite Thai place, period.Tried and true, never fail items:Pad see ew - I get it with beef. Level 3 spice is a nice kickPenang curry - I get it with chicken. BEST ITEM.Pineapple fried rice - has curry in it"], ["Paul G.", "Love this place for the yellow chicken curry and the pad see iwe it's amazing! The location isn't the best but the food and service is beyond great it's a diamond in the rough"], ["Justen B.", "I really like Thai food and this is hitting the spot. Great place while my car gets serviced at Allman family auto few doors down. My new routine!!! Car Thai, car Thai, car Thai."], ["Stephanie B.", "If you do end up going here, DO NOT get the calamari pad see iew or the duck pad thai. The worst thai food I've ever had. The calamari made me gag. I would not recommend this place. Not only was the food awful, the service was even worse. 20 minutes just for the waitor to give us our menus. Waited another 20minutes just to get waters. And the place was not crowded whatsoever."], ["Ashley W.", "This place is really good. I had a favorite Thai place by my parents house in Temecula but they closed down :( after they closed my hope for good Thai food was lost! I had tried a few other places and they just weren't the same! So when I found Thai taste I was ecstatic they tasted just like my old fav Thai! I always get the \"spicy noodle\" and the yellow curry! And it lasts me a week! When I go in to pick up my order I'm always baffled because there is maybe 1 table seated maybe 2 and I'm the only one in there to pick up so I don't know how they are still in business but I am so happy they are because I love them!"], ["Derek G.", "Came here the other night cuz I was craving some pad thai. They got a real good menu. The got egg drop AND egg flower soup which threw me thru a loop cuz I didn't know there was a difference. Got the combo pad that and looked the lady in the face and told I wanted medium and she brought me out something that nearly blew my head up. The shit is too spicy. It's just too spicy girl."], ["Amber F.", "I called in the coconut milk soup with chicken to go as I wasn't feeling good... All she said was ok and hung up. No, how spicy? No eta, no name... Ok... I gave it like 10 mins in case... It was ready and she knew I was the soup order. Got it home, still nice and hot... Needed spice and waaay too much onion than I've ever seen in this soup. I wouldn't get my fav Thai soup there again but I am a fan of Thai so will prob come back and try other items."], ["Bonnie S.", "It seems as though this place has read the reviews and made changes. They asked for my name and gave me an estimated time  my order would be ready. The food was ready as soon as I arrived. Good prices and big portions. The food is tasty."], ["Daralyn H.", "Me and my boyfriend drove past this place and just decided to try it since we were looking for a good lunch spot and we both love Thai food...it was more than excellent! A cute small little place with good prices and delicious food. We had the spicy noodles and the hot basil with chicken and both we would highly recommend! Next time i'm going to try the Thai iced tea...looks awesome!"], ["Tina S.", "Thai Taste is really delicious.  Their food in general is not too expensive.  My husband got the Pad Thai.  He asked for a scale of 4 on the spiciness, and it was super hot!!!  It was a really simple dish with noodles, eggs, bean sprouts, beef, carrots, peanuts and lime.  I got the red curry, which I would totally recommend.  The chicken was good, and it wasn't dry.  The veggies and meat were soaked with curry flavor.  I would definitely return to this restaurant.  By the way, they have lunch specials too!"], ["Ling W.", "This place has a great taste compare to other thai places in the area. Trust me I have been. THE Best thing about it is the big proportion with the cheaper price than other places. (;"], ["Kelly H.", "TOM KAH soup!! THE BEST!!! LOVE this place. The family who runs it is  the sweetest! My roommate and I are regulars here. We always get the Tom Kah (coconut milk soup) at a spicy 5 and the yellow curry spicy 5. SO. DELICIOUS!! And you get a ton of food for a great price! Hands down, my favorite local Thai spot!"], ["A D.", "I'm so glad that I am adventurous and that I trust my instinct.  This place, looks a bit sketchy at first, is soooooooooo yummy!  From the appetizer to the yellow curry was D LISH CIOUS!"], ["Mark W.", "watered down yellow curry and bland tasting pad thai thats a little too sweet for me.  Also the shrimp had this chlorine taste to it. service wasn't great either. if i lived walking distance Id come here once in awhile, but i drive and would rather drive 10 miles out of my way for a better place."], ["Cassie H.", "I totally love hole-in-the-wall food joints. Maybe because they're easier to get a table at, perhaps parking is easier to find, or, in the case of this amazing restaurant, it's because the quality of food hasn't changed. It's dependable, delicious, basic thai food, no bells or whistles, fusions or fancy names."], ["Ashley E.", "I am so glad I tried this place!  Best Thai food in town by far!  This is a hidden gem."], ["Alejandro P.", "Amazing food, started with golden wings, and interestingly enough they were out of corona, but had lucky buddha, which is amazing beer. Right after we were done with the golden wings, our entrees arrived. My friend got the pad thai, and was a huge portion. I had the green curry with beef myself. Spice levels range from 1-5, i got a 3 and it was amazing. Overall, good experience."], ["Courtney S.", "Been here serveral times before.. New owners now.  Never coming back! Ordered panang curry and the hot basil and it was just ok...in fact the dish looked identical (same cuts of meats and same veggies used in both dishes) DIY paint job is awful! If the look of the place was better maybe, just maybe it would have made up for the whole in the wall experience."], ["Quinn W.", "The food was was good. I had the spring rolls and the Penang curry. The Penang curry was sweet with a touch of spicy, lots of veggies although they could have used a bit more chicken. Spring rolls were perfect, crispy, not over fried, and tasty. Service was mediocre, the restaurant was empty and I had to wait until I was nearly finished with my meal to see if I wanted a refill. Overall a good place to go eat Thai food."]], "Lanna": [["John A.", "The food here was quite good. We had yello curry with chicken, honey duck and see-ew noodles all of which I'd recommend. I'll definitely be recommending this place to friends & going back."], ["Morgan M.", "I have never actually come here to sit down and have dinner, but I always get take out (one of their curries) and bring it back home to enjoy. They are always super friendly and thankful that I came in. This place is the bomb. I definitely recommend it!"], ["Catherine M.", "If you're a vegetarian this place isn't for you, unless all you're looking for is a selection of 2 soups and 2 salads. The name is quite misleading. They were good, but I think maybe they didn't take care in cleaning or separating the vegetarian utensils from the regular dishes. I got horribly sick while the rest of my party did not."], ["Tram P.", "Hands down my favorite Thai restaurant in San Diego! Everything we have ever ordered here has always been delicious: pad Thai, spicy noodles, see ew noodles, salmon curry, lamb shank, Tom yum soup, papaya salad... You name it. Their service is always very good and they are accommodating for big groups. The ambience is a bit on the romantic side but not to say that you can't enjoy this place with a bunch of friends and family. It takes me about 25-30 minutes to get here but it is definitely worth the drive-- plus it's near the beach so what more could you ask for? Go go go... You're missing out if you don't try Lanna's!"], ["Rebecca P.", "Rare great-flavored food that is vegetarian. Everything was well prepared and flavorful. Our new favorite!!!"], ["Tim D.", "My girlfriend and I have been to this place twice in the past year. Let me start by saying, the spring rolls are AMAZING! Make sure to get this!Pad Thai was okayBoth the Pad See Ew & Pad Kee Mao were fantastic!"], ["Claudia C.", "Yey!!! The only reason I am not giving it 5 stars is the very unfriendly waitress but the food has always been great. Today we shared the fresh salad rolls ( spring rolls) and the Larb both were great We all had lunch specials which come with salad , soup and a crispy roll and jazmine or Brown rice. I had the vegetable delight While my friends had the panang curry. Note that They ápice up their food so be careful Great lunch déals Will keep coming back"], ["Stephen P.", "Whenever I'm in San Diego and want Thai food I go to Lanna. In my opinion it's the best Thai food I have ever had. Love this place!"], ["Mel J.", "My Pad Kee-Mao with chicken was tasty and a little heavy, with pan-fried thick rice noodles with onion, bell peppers and basil in chili garlic sauce. This entree was satisfying, though not my favorite. Our \"Fresh salad rolls\" with shrimp, tofu, noodles and veggies in rice paper definitely weren't as fresh on our most recent visit. The veggies weren't as fresh as they usually are in the fresh salad rolls. It's hard to go wrong with sweet rice with mango, but we had to send it back because the rice wasn't cooked all the way, so the rice was a little crispy. So our recent visit to this restaurant was a bit disappointing overall. However I will still give Lanna Thai another chance because we've had good visits previously. Lanna Thai is in the same location as Sushi Ota.I enjoy the mojito at Lanna Thai with fresh mint. The service is friendly. They just need to work on consistency in the kitchen."], ["Queency M.", "Cute spot with elegant decor. Food: Tom Yum Soup Pot 5 starsChicken Larb 5 starsMassaman Curry 3 starsPanang Curry 5 starsYellow curry 4 starsPad seeyew 4 starsBrown riceFried Banana with scoop of coconut ice cream 5 starsThey gave a lot of shrimp in the soup. Pot gave out about 7-8 small cups so its worth it to pay $11 per pot vs. $5 per cupWe ordered 2 chicken larbs because it was just that good. They use white meat and flavors were so fresh.Panang curry was everyone's favorite main dish.We topped it with dessert. Their fried bananas were light n crispy and not oily. Very tasty with both scoops of ice cream."], ["Irina H.", "WOW!!  What incredible food, service and ambiance in this beautiful Thai restaurant!!ATMOSPHERE: This place innocuously tucked away in a shopping mall, but, inside, it's beautifully classy, with lovely ornate statues and simple modern lines.  It's quiet, comfortable and lovely.  The servers are friendly and knowledgeable.FOOD:Everything we ordered was fresh and bursting with flavor and creativity.  This was easily some of the best Thai the four of us had ever eaten.The shrimp lettuce wraps we chose for an appetizer were light and delicious.  They had wonderful ingredients and the sauce was lovely.  Being able to construct them ourselves allowed our friend who doesn't eat coconut to join in the fun.The Ocean menu had so many delicious options that we took extra long to make a decision.  The Citrus Halibut was so light and fresh!  The citrus really brought out the flavor in the fish (not fishy at all), served over yummy cabbage and broccolli.  The Soft-Shell Crabs were delicious - frying didn't rob them of freshness or crab flavor at all, and the curry was sublime.  On our server's recommendation, we opted for the Special Yellow Curry Sauce which we felt was genuinely special.In short...EAT HERE :-)"], ["Alan C.", "My favorites:Appetizers:+Tom Yum Soup w/ Shrimp+Chicken Satay+Larb+Fresh Salad RollEntree:+Citrus Halibut+Spicilicious Seafood+Duck Curry+Green Curry+Pad Kee Mao+Crab Fried RiceDessert:+Mango Sticky Rice ***MUST ORDER***Wow, I think I listed like half their menu. That's how good they are. Wait times can get pretty lengthy so best to make reservations. Curries: Thick, and packed full of flavor like you would expect. Serving size is adequate, you may need to order an extra bowl of rice though as it really opens up your appetite.Noodles: All their noodles are on the sweeter side so you may want to up your spicy level by 1 to offset their brown sauce. Their mango sticky rice is awesome, the coconut milk they use isn't too sweet and the rice is always the right texture.Food is amazing, service is great. This is my go-to Thai place even though I live 40minutes away."], ["Daniel M.", "First time visit. Nothing to look at from drive up, but interior is calm and stylish for a strip center. As many others have said the flavors are unique and pungent in the best ways. Lime sauce superb, Larb one of the best ever, Lemongrass chicken is a lot of food, Spicy beans with pork very delish. Spice level 6 was right on, maybe 7 next time with extra tissues...Eat here and know you're in good hands."], ["Root C.", "For the Pacific Beach and La Jolla area, it's one of my top 2 favorites."], ["Geleen A.", "This is absolutely my favorite Thai Restaurant. I come here so much the wait staff recognize me. Everyone that has ever visited me in San Diego has had the fortune of trying this place out since I take everyone here. There's not a single item on the menu that I haven't absolutely loved. My favorites are below:Appetizers: Mango spring rollsShrimp spring rolls Papaya salad Entree: Pad Thai with chickenChicken supremePenang curry with assorted seafoodSurf and TurfDrinks: MangotiniThe rest of the menu is great but those are my go to items. Their food is always fresh and always comes out hot and fast. The service is also amazing, I have never had to wait for a seat even when I have brought in big groups of 10+ people. Also they come by frequently to make sure that you have everything you need which is great because I'm the type that always needs more water! I can't recommend this place enough!"], ["Mark J.", "I had lunch here, fresh, tasty and spicy!I had excellent service as well. It was cool and relaxing inside. Tom Kha hot pot, spice (7). I may try 8 next time. Plenty left to take back with me. Tom Som (7), a nice fresh, crisp Papaya salad. Spicy hot & sour. And Thai ice coffee."], ["WorldTraveler F.", "One star for the cleanness of dinning area (don't know about the kitchen/prep area).Zero star for the food.  They served 'closed to rotten' vegetable.Split food into smaller portion, but still charge us full prices.We were staying at La Jolla for a couple day R&R.  Wanted Thai.All four of us happened to all want Pat see ew.  We all order 4 shrimp pat see ew plates (and some appetizers).Broccoli were all yellow (not green).  This is something I would throw out at home!They cook 1 batch of pat see ew.  3 plates were somewhat fill.  4th plate, they had so littleso they put the pat see ew in a smaller plate.  With these two major food issue, I would normally bring up to the manager.But, (1) typical Asian normally doesn't listen to learn and improve (2) I just want to get out of the place.  Too bad they are losing potential returned customer.  Btw, do not order their papaya salad.  Expensive and NOT WORTH IT !"], ["Shawn L.", "One of the best Thai places I have been to. I'ts been a while since I've felt this fresh and good after eating such a full meal. The food is on point and isn't oily at all and the food is authentic, fresh as can be, and healthy. My gf and I had the Lanna platter and then the pad see ew with beef and the pineapple fried rice. I highly recommend the platter as an appetizer as it comes with like 4 of the things on the appetizer menu and was well worth it. The pad see ew felt light but the portion was still generous and barely any oil. It was delicious with every bite and usually I get oily residue but that wasn't the case here. The pineapple fried rice was great as well with shrimp and nice spices. I would definitely come here again to get full and know that I had a healthy meal!"], ["Jodi A.", "Came for dinner after not being here for a few months due to trying out some newer thai restaurants in the area. We started our meal with the Yum Nao, a deliciously flavorful salad topped with perfectly cooked beef. The lime dressing is so good I could drink it, after using the spoon to get every last drop on the plate! For entrees, we love the chicken supreme, grilled chicken topped with their amazing peanut sauce served over spinach with steamed carrots and broccoli. We also had the pad ke Mao (drunken noodles) but unfortunately this wasn't as good as some of the other places we've tried recently.. Lana thai has a nice ambiance and is very reasonably priced. It's a solid choice but definitely not the best in the area anymore."], ["Lawantha M.", "I've never been here but I guareentee that you'll love it because Thai cuisine is amazing   You should totally go there like I think it's freakin awesome Thai food man"]], "J Wok": [], "Harborside Thai": [["Gerardo R.", "Great food, better service. Recommend the Panang Curry. The sushi is also great. I've been looking for a great Thai Place since my regular spot in Culver city closed. Who knew I'd find it in San Diego."], ["Cat G.", "I wish I could agree with all the other reviews. The service was very disappointing. The food was a mix of pretty good and not very good. We walked in and were sat quickly. Water was received and we flipped through the six pages of menu. Server came back and took our order: namtok to start, pad thai, spicy noodles, and thai iced tea with the meal.Thai tea shows up a minute later. Okay, not what we asked but it's not a big deal. All three dishes come out together. Again, not what we asked but we weren't going to make a big deal and have our other dishes sent to the back where it can sit under a lamp for another ten minutes.Namtok was good. sour, spicy, tender meat, and lots of flavor. Pad thai - soggy, clumpy noodles, not much taste. Spicy noodles - meh. It was okay. Not that spicy, light flavor. For the next fifteen minutes, there was no service to be seen. It wasn't after we both put down our forks because I found something small and rock-hard in my food, like two little street stones. The server comes back with the check without an apologetic manner and tells us how it's not really anyone's fault that those inedible stones (she claims were \"really hard noodles\" that \"could've come from outside\") were in our food. That's not quite how customer service works when you try to make excuses of how it \"isn't your fault\". We sure as hell didn't put that in our food so it must've come from somewhere in the back where the restaurant is reponsible. Anyways, clearly unhappy with our food, the server brings the check without any offer of a discount. I guess for the server, it was okay for our food to be mixed in with street rubble and we were entirely wrong in saying otherwise. It wasn't until my husband asked her this that she offered 10%. We paid and left.This accident could have been redeemed but not with such inaccurate, careless, insensitive service."], ["Angela K.", "I have had way better.. I went for the Ahi Pokie salad expecting this to be mixed with SMALL chunks of fish and seeweed salad. it was with mixed greens and it had the nastyest taste. I have tried this place 3 times the only thing I will ever eat form them"], ["Kaye H.", "The place was dead unfortunately. Inside was very nice, the people were very friendly. Its a mix of Japanese and Thai. The sushi was delicious and the Curries were the best I've ever had. The prices affordable. Definately coming back."], ["Sally D.", "The restaurant just open today. I like the food here because its optional. They have sushi/ thai food. I love both kind of the food so this is a perfect place to go to cuz its all in one place. :)"], ["Cristina A.", "This place is conveniently located right by my job so I can stop by whenever I feel like having a sushi roll! Very good sushi and Thai food! Try the Tempura roll, Harborside roll and my favorite the Coronado roll! I have also ordered the Shrimp Pad Thai and the Shrimp Panang Curry before and both are very yummy with nice big shrimp! Their prices are reasonable and they give a 10% military discount. The place is clean and the employees are very nice! I love this place!"], ["Max S.", "Thai sports bar and sushi?! Pretty good spot. I wouldn't venture from far away, but it's worth a try if your local and craving Thai. Ambiance is unusual. Food was good. Didn't try the sushi. Service was good."], ["Josh B.", "Food is probably a 3 star but it was really cheap. Staff was pleasant and really fast."], ["Jason L.", "ugh, the only thing that was good was the leave."], ["Lisa M.", "I was really excited to come here. You see...I love Thai food. I use that loosely. There is one dish that I always get and here they call it \"Hot Basil\". I just transferred work locations about 5 minutes away and to my surprise I found this place on yelp. I called in my order and it was ready when I got there. Nothing but US Navy guys there. The service was quick and I couldn't wait to take it back to the office and savor every piece! Unfortunately, the salad dressing was nasty...so was the \"wonton\". It had nothing but curry and I know many Thai dishes have curry but I simply do not have the taste for it. The Dish itself was MEH. Not the worst but not the best. For the price of the food I could have received better. I doubt I will be back. I was tempted to try the sushi but I am not sure after this dissapointment."], ["Paul S.", "Came here Friday night around 830p. No wait, quick service and above all great food. Would definitely recommend for a quick meal before heading out for the night."]], "Thai Village": [["Kristie L.", "I order delivery from here occasionally. The store itself is too small and cramped for my style.The chicken and beef satay are delicious. I like that they have a beef satay option because many places don't. The drunken noodles are not my favorite. I actually prefer Rakadeka for noodles. The thom kha soup was good, but for some reason I was expecting the creamy coconut soup... but I may have clicked incorrectly.It took more than an hour to get delivered, and I had to call in 5 after the hour to check on my order status. However, the lady on the phone was very nice about it and not rude. Plus, free delivery, and I can wait for the convenience of something being brought to me."], ["Michael M.", "Best thai food in PB. You have to try this if you live here or you're just visiting. You won't regret it... For real! I was hungry one night, so my girlfriend and I decided we wanted Thai. Actually, I decided I wanted Thai. Haha. The place is a small restaurant with probably about 8-10 tables and booths. It's a seat yourself kind of place so keep that in mind. Once we sat down, the server brought us our menus and some waters. He's ready to take your order when you are, so shut your menu quick! I ordered the house (panang)  curry with chicken and not very spicy at all. I had just gotten my wisdom teeth removed. My girlfriend ordered the pineapple fried rice. The food came out quick. Within 10 minutes and piping hot!  It was amazing and creamy. We both loved our food, which is why we've been back 5 times.  Haha. They even deliver!  So there's no way you can't try this place. The Thai iced tea is also really good!!  Reasonably priced too."], ["Karina P.", "Recommended by a friend who lives two blocks away and I fell in love with this place.  The drunken noodles are so yummy along with the spring rolls. I will definitely come back again."], ["Meghana K.", "Delicious food, but never open when I want it to be. For instance, it says it's open now on Yelp, but it actually is not. I love the larb, panang, steak salad, tom kha... can't really go wrong here with the flavor. But it's always understaffed and takes too long."], ["Lisa D.", "Quaint space near the ocean. Very good spring rolls and pad Thai. Passing through town and heard there was good Thai in the area. If your looking for ambience this is not your place. If your looking for good in a fun surf area I definitely recommend!"], ["Realtor Karl B.", "We used the EAT24 app and they delivered on time like promised. And they don't charge a delivery fee!They even gave us free egg rolls without even asking.I really liked my yellow curry with chicken, but the rest of the group thought their food was bland - spicy noodles, green curry, pad thai with shrimp, and thai tea. The kids liked their cream cheese wontons and chicken satay."], ["Molly H.", "Decided to go here with a friend for a nice night out. The food was awesome.. Until I got food poisoning the next day. Service sucked too. Safe to say I will not be coming  back."], ["John D.", "It was my first time trying this place. I thought the food was really good and taste.  I differently would order from them again.. Yummy :)."], ["Angelica L.", "This place is conveniently located if you live in pacific beach. It's only a block away from the water and usually has a pretty short or no line.That being said I feel as if their takeout has better food than their in-dining. I'm not sure why that is, but I've ordered the pad thai, fresh roles, and a variety of soups from here. In person I've gotten varying service and food quality- my latest experience with their pad thai was pretty horrible. Overly soggy, bland, and the sauce was almost soup-like it was very strange and took almost 40 minutes to come out at the restaurant. When I've ordered take-out it has been consistently good though, and usually only a 15 minute wait time from the time you call in. In terms of Thai places in the area it's decent but for an in-dining experience with high quality food I'd opt for the tumeric thai cafe in la jolla instead."], ["Ryan C.", "Ordered for delivery, it took an 1 1/2 hours so make sure you plan ahead. I'm 99.9% sure the cashew chicken was cashew tofu, if not it was sure was one funky chicken- didn't eat it. The yellow curry was ok but we were ready for bed by the time it showed up. One and done- next."], ["Volkmar S.", "This Place was amazing, Seriously! I am not really a big fan of Thai, but I REALLY REALLY LOVED THIS. I suggest anyone give this a try, they really have something Fresh and Delirious for anyone!"], ["Joseph K.", "We were 13 people walking in STARVING and tired!  They took such good care of us... Serving us fast and delicious food. Every item we ordered was amazing. Great place!"], ["Zaira F.", "I decided to come here due the the good reviews on yelp. I left completely disappointed. I came here with my husband and we ordered  a small cup of soup to start and shrimp fried rice.The place is very small, a little outdated but the little hall you can see from the restaurant leading to the kitchen looked like a total mess. The phone kept ringing the whole time we were there and most of the time they didn't pick up and totally ignored it without silencing the ringer. It was super annoying, I felt like going up to their desk to pick up the phone. Our soup took about 30 min. To come out. And our rice 45 min. It was bland and flavorless. I was so mad I made the decision to come to this place.Keep in mind it was a Friday night, so they are obviously super busy on Fridays and weekends but to wait 30 min for a small cup of soup is insane. It was obvious they were short staffed but they could have warned us when we sat down that they were busy and short staffed and our food would take 45 min to come out. Never coming here again!"], ["Jessica F.", "I love this little place. Very clean, good flavors, fast service...my coworkers and I use to walk from work for lunch :)"], ["Samantha G.", "I've ordered two times delivery from Thai Village through their online system. I love how it notifies you right away that they got the order and when it's on it's way. I live in a complex and they always deliver to my door. Both times I've gotten the avocado curry with shrimp. It's enough for two people to be completely full. It comes in a large plastic container appears to be about an entire avocado, at least 6 large shrimp and a container of rice. The curry is delicious!!!! I'm a major foodie so I know a good place when I taste it. Other things I've tried and loved include the $3.95 papaya salad- simple but tasteful, the crab Rangoons which came hot and super crispy (doesn't usually happen when ordering delivery anywhere else) and the pad thai. Last time we couldn't even open the Pad Thai we were so full. Delivered in under the time recommended too! YUMMMM! Thanks Tao!"], ["Jaylin S.", "Ordering was simple and fast as it should be and our meal arrived within the time we were quoted. Our soups and spring rolls were the ideal temperature when they reached us. Michal enjoyed his Tom Yom and commented that while it was delicious, a little extra spice would be good. My Tom khar soup was tasty. I liked the assortment of veggies. I do like this soup to be a bit thicker. We devoured the spring rolls and peanut sauce. We are looking forward to ordering again!"], ["Tyler S.", "Avavado curry with duck might be my favorite Thai meal in San Diego. Parking can be a little crazy though, what's new."], ["Patricia B.", "Simply delicious!"], ["Nick A.", "Went on a busy Saturday night and we were lucky enough to get a table right away.  Egg rolls were very light and not too greasy and just melted in your mouth.  I had to Spicy Thai Fried Rice, Medium Spice, but still a bit too hot for me.  My wife had the Pad Thai and I wished I would have gotten it too.  She loves Pad Thai and said it was the best she had ever had and I agree is was exceptional.  We finished off the dinner with the Fried Bananas and Coconut Ice Cream, which was also very good.  Prices were fantastic and we would definitely go back on a future visit!"], ["Kelly N.", "Best Thai spot in town! Everything is always so delicious and authentic....and fast! Usually just get take out here but sit down is good, too."]], "Chaba Thai Kitchen": [], "Bahn Thai": [], "The Orient Thai Cafe": [], "Thai Pepper Cuisine": [["Rosa Icela C.", "Awesome!!!We wanted a light lunch and ordered a pot of Tom Kah and a shrimp salad, both authentic and spectacular."], ["Hamid M.", "San Diegans are apparently too easily pleased. I'm not going to talk about the service because at the end of the day, who cares. The food was sub-par at best. So if you are drunk..."], ["Ashleigh M.", "Moving away from Serra Mesa and might just come back cause I love this tried and true Thai place! Been coming here for years now. New management even better than the last.Faves are pad see ew, pad Thai, cashew chicken, spicy noodle, thai pepper basket special and just today tried Siam chicken which was great! I appreciate the extra effort and service they give me when I'm being especially picky (can I have the tails off my shrimp). Definitely recommend!"], ["Blair O.", "Love love love Thai Pepper! It's my go to spot for a great pad thai! I can't tell you how many times I have popped in to place a pick up order (not calling ahead, just stopping in) and I have NEVER waited more than 5 minutes! Super fast, super fresh, super delicious! I have tried a few things on the menu and every time it has been on point. I recently went and dined in for the first time with my husband and was very pleased. It's just a little hole in the wall eatery; simple, no frills. But my water glass was always full, server checked on us regularly, and our food came out super fast, fresh, and delicious! The staff is always friendly and helpful too.This is definitely going to become a regular thing!"], ["Eric X.", "Hidden Thai food gourmet! We went here for lunch and what a great decision it was. From the get go the waiter was attentive with everything. For lunch we get soup, salad, and fried dumplings. We order fried chicken basil, flat noodle with pork, flat noodle gravy with pork, and beef satay. The whole meal was dericious and all of us what a satisfied group. This is going to be our go to spot for Thai food every time we are in the area."], ["Justin M.", "I have had Thai food all over San Diego, and although I have yet to be let down in this city, I am more than impressed with Thai Pepper!! The food is amazing and I received it all super fast! I will be back, probably every time my work brings me to Serra Mesa. Thanks guys!!"], ["Kate K.", "Good price and awesome food!!!  We ordered Som Tum, Tom Yum, and pad Thai. All of them are so yummy."], ["Teresa P.", "The food is fresh and delicious!! The service was great. I am so glad I tried this restaurant. I went for lunch yesterday and had the mango chicken curry lunch special which was amazing! There was lots of lemon grass and basil which made the flavor incredible.  We went back today and I had the thai pepper basket. Spicy and delicious!! Also, the prices are very reasonable. A must try restaurant!!"], ["Jeffrey S.", "Excellent service, as well as food everything was great! Huge portion well worth your dollar."], ["Kaitlin M.", "Amazing service, very prompt and kind :-) Has a home-like feel and the cream cheese won tons are a must have!"], ["Brandie J.", "Came down for the Cowboys game and was in the mood for Thai food. Found this lil restaurant with GREAT Pad Thai noodles. We all enjoyed it!!!"], ["Jack P.", "great atmosphere service is great can't complain! I ordered pad see yu and it was very good"], ["Jisu K.", "nice place! i love pineapple fried rice! so tasty! yammy! we went there for lunch, we found this place on yelp, it was amazing as i thought!i will definitely came back again"], ["Sandy T.", "Very Disappointed!!! This was my first and last visit. Bf and I came here on a Wednesday night (6/11) for dinner. We arrived ~7:40, saw 2 other couples in the restaurant waiting for their food, we ordered papaya salad, chk pad thai, and eggplant w/ tofu.1. Food came super late - Papaya salad came at 8:20, which is 35 min after we ordered. (I was checking the time because I was in a middle of laundry)  Eggplant arrived around 8:35, and Pad thai about 5 min after.2. Papaya salad - there was hair in it!!3. Eggplant - very salty, we had to pour all the sauce out.4. Pad Thai - Over fried tofu and driest chicken I ever had (see pic), we ate about half and didn't even bother to bring the rest.5. Service - nada, the only waiter was helping out cooking inside the kitchen 6. Customer service attention** If a customer requested no dried shrimp on a dish (description), it could be due to allergic reaction. When I request no dried shrimp on the pad thai, a waiter should be caution enough to note there are also dried shrimp on the papaya salad (the ones we usually go to do not have dried shrimp on their P.S.).  We were a little surprise/upset to see the amount of dried shrimp on the P.S. because my bf is allergic to shrimp. He had a small bite because both of us were starving and had up itching the entire night. :(I'm not sure was that day just off or not. There were at least 4 people working in the kitchen (exclude the waiter), during our wait, there was 1 phone-in and 2 walk in togos, one of them I believe was from a delivery company where the driver was walking back and forth checking the status of the food. At the end he spoke pretty loud saying \"The promised delivery time was 8pm, but now is 8:30 and the food still not ready?\""], ["Its Me Y.", "Thai pepper has the best lunch special !Great food, good service.I usually get the hot basil shrimp !with the tom yum soup And its delicious!"], ["Queena L.", "Bestest Thai Evers! They are so friendly here and portions are big!!! Love this hole in the wall"], ["Sophie T.", "This was my first time visiting Thai Pepper and I was very pleased! I went with a friend and we ordered an appetizer and an entree for the two of us to share, which was more than enough! Delicious food."], ["Robert M.", "Been living in this area for about 2 years and I love their yellow curry. Some of the best Thai food in SD. and even better service."], ["Raquel L.", "Our first time here and we came because we read the YELP reviews. The food was absolutely delicious but we waited over an hour for our food. Our server was like a fish out of water. He apparently served one of our vegetable dishes (Sirachi vegetables) to another table because  the gentleman said it was too spicy.  If we had a server who knew what he was doing I would have rated it 5 stars. I would recommend they mark their tables with numbers so orders get served correctly. The poor server was in over his head. I don't know if this is the norm for service or if the server was filling in for somebody either way, food was delicious, service was bad. The Sirachi vegetables never did make it to the table and we asked them to cancel the order which they did without any issue."], ["Quinn F.", "Fast excellent customer service!! Simple and quaint ambiance. Most importantly, amazing food. I will order spicier next time, because I ordered a 6 spice and it wasn't spicy enough. Thanks Thai Pepper!"]], "Plumeria Vegetarian": [], "Bangkok Spices Thai Restaurant": [], "Koon Thai Kitchen": [["Anthony Z.", "Good Thai spot. Whenever I get a craving for Thai, I like to order take out from here. I call ahead and usually order pad Thai. I have also gotten the Panang from here which is also good. They do have good lunch specials that comes with all the fix ins. Pretty cheap too. Service is usually good. At times, it's hard to understand the person on the phone. (Just means it's authentic) I can deal with that. No problemo. Will have to try dinner here and eat in. The decor looks nice."], ["Staci R.", "Koon Thai you rock my world. Whenever I'm in the mood for Thai Koon Thai is my first choice. Sometimes the wait is cray but when you're good you're good. It can be difficult to find parking in the lot shared by multiple restaurants and other establishments but that's a common problem with businesses on Convoy. I used to go for the safe stuff like Tom Yum Soup or Pad Thai (which are delicious), but after I tasted the Green Curry the box I was living in was shattered and my tastebuds danced in rejoice. It was soooooooo good. I've already gone back for more like a week later. I'm excited to try the other curry dishes and to get even more adventurous with other traditional Thai dishes. I don't eat meat so I ordered veggie but I'm pretty sure that there was a piece of meat in my vegetable green curry (my stomach seemed to think so at least). This has happened to me at several Thai restaurants though (I don't know why). I'll still go back! New week perhaps?!"], ["Cris L.", "I've come here for their lunch specials and for dinner a few times since it's one of the few convenient places on Convoy that has a big parking lot.The food itself is decent. Nothing mind-blowing, but it's good enough if you're having cravings for Thai food. Can't go wrong with their noodle dishes, and their soups are tasty. The price is very reasonable as well. For all this, I give them 4 stars.However, the service is terrible. We'll be with a crowd of other people, waiting in the lobby to be seated, and we'll see that there are clusters of empty tables not being cleaned to seat new groups of people. Once seated, it wouldn't be uncommon for us to wait forever to get our order in. When the food finally comes, there will be one person missing their dish, and it usually won't until we can flag down a server to check on it. As long as you get past all that and have your food, then it's fine. It's just annoying leading up to finally getting your lunch or dinner, and for that, I dropped it down to 3 stars.I'll come here because it's conveniently located for me, and I'll try to arrive when I'm not starving. Besides that, there are other Thai places with less hassle."], ["Kristina T.", "My second time coming here and I'd have to say their food and service are really good. My friend and I came around 5, so it was right before a dinner rush would come by. They just added in some cute table dividers that have Thai phrases and their meanings on them so people could try learning a little Thai. The decor in the restaurant is also very cute; very modern but still with Asian influences. Our server was very friendly and constantly came by to check up on us after we ordered. I ordered the red curry with chicken medium spicy, and they don't play when it comes to spice. As I kept eating the curry, the spiciness increased but that wasn't a total problem. The curry had a rich flavor and I liked how they put generous amounts of bamboo shoot in it. I loooove bamboo shoots and I can also say they didn't skimp on the chicken either. Overall a really good meal at a really nice place."], ["Gordon D.", "This restaurant is well furnished, and it sets the mood for a dim lit dinner.The past three times I've been here, we've ordered the following dishes:Satay skewersPad see ew with chickenPad kee mao with chicken or porkCrab fried ricethai ice teahouse soupThe noodle dishes weren't special for some reason--maybe it's because it's not spicy enough or that it wasn't flavored enough. The meat additions seemed like the flavors weren't mixed in completely. The crab fried rice was disheartening--crab meat prices are high and the lack of portions reflect that.The thai ice tea and the tangy house soup was delicious, though. The skewers were also delicious.Despite the reviews I've given, I did enjoy the experience there. I'm still on the look out for other Thai places in the meantime!"], ["Amy R.", "I was craving pad thai, so I yelped this place and when we arrived, was very satisfied with the overall ambience. Such a clean restaraunt! I ordered the chicken pad thai in mild. The waitress told me that even their mild is pretty spicy and she was right! Had a slight kick, but was the perfect amount of spicyness."], ["Joanna R.", "I was really excited to try this place as it was recommended to me by a friend, but I walked away a tad disappointed. First off, the service was so-so. We didn't get our waters refilled until we were nearly finished with our meals. (*** In response to management, okay... We are in a drought. Yes. But if water is upon request, your servers should still check on those they are serving and ask if they would like their waters refilled.***)They didn't clear out our empty appetizer plates when the waiters finally did come by. The woman who greeted us and seated us was very friendly, but the staff who served us weren't as inviting. As for the food, it was okay. But I'm sad to report that it was nothing we were too impressed with:My hubby had the seafood padthai and barely had any sea food in it. He got maybe two mussels and 1 small shrimp on top of a mountain of noodles. He said the noodles were pretty tasty, but he couldn't finish it as he didn't have an adequate portion of seafood in it. If we are paying for seafood padthai, you'd think there would be more pieces of seafood in it :-(. I, on the other hand, had a decent portion of chicken for my padthai but the tofu in it tasted old. I really wanted to like this place... I'm thinking maybe I needed to try different entrees to really understand why they have so many raving reviews. So I may be back to update this."], ["Kimberly B.", "I had pad Thai it was good. However I was very uncomfortable because the place was so hot. I ask if they had the AC  on and one of the workers said they did. The worker said the reason it might be hot was due to having lots of glass windows and black interior.  I been to places that had the same elements in their restaurant and it was cool. Maybe the AC is broken but it definitely wasn't on."], ["Shawn L.", "Nice Thai food and atmosphere. Their Thai fried rice was delicious and the Pad Thai was spicier than I had expected since we ordered mildout. The taste was great and the spice really kicked in since I thought it wouldn't be. I would definitely stay at a safe mild to low medium for spicyness here. I would come back for their lunch specials too."], ["L T.", "My friend really wanted thai food and he was leaving San Diego soon so we settled on this place. There was no wait really. The place was pretty empty besides our group. We got the tofu stew and the curry with brown rice. The food was good, but it was spectacular like Siam Nara or Sab E Lee. I would come back again, but only because Siam Nara and Sab E Lee are too far from UCSD."], ["Kelli S.", "One of my Taiwanese friends always raves about Koon Thai, thanks to their generous portions, great lunch deals and reasonable prices. I finally went with her to check it out on a rainy Friday for lunch around 12:40 p.m.Tip: Definitely make a reservation for lunch if you go during the week, cause this place is hoppin'! We had a group of 5, and we probably would have been waiting for 10-15 minutes if we didn't have a reservation. My friend suggests going at 11:30 a.m. or so if you do go for lunch (without reservations), so you can beat the typical lunch rush.There's a lot to choose from on the Koon Thai menu, but I decided to go with one of the \"Create Your Own Lunch Entrée,\" per my friend's suggestion. The interior of the restaurant is pretty cool, and I especially liked the décor and water glasses. I think the one thing that can definitely be improved is service -- even once my party was seated, it was a good 10 minutes or so before our server came just to ask for drink orders, and we had to flag someone down! They seemed pretty short-staffed -- even once our server came, she didn't come back very often and we always seemed to be hunting for someone to flag down whenever we needed something (more water, extra napkins, our bill, etc.). I'm not sure if slow service is the norm at Koon Thai, but if it is, be sure you plan accordingly if you're going for lunch during the week (I would give them 3.5 stars because of service, but the eatery gets a 4 because of the yummy food).Here's what we ordered, as well as what I would get in the future:\"Create Your Own Lunch Entrée\": These lunch entrées all come with house salad, and you can choose one of the available meats and pair it with different rice or noodle dishes. During my first visit, I opted for the \"Chicken Pad Thai,\" which came with generous chunks of grilled chicken, stir-fried noodles with eggs, tofu, chives and crushed peanuts (I ordered my Pad Thai sans bean sprouts). The salad was light and I liked the flavor of the dressing, but I didn't finish all my salad so I could enjoy every bite of my Pad Thai. The dish was served piping hot--I could still see the steam coming out--and the crushed peanuts were in a small pile on the side. I liked the fresh taste of the noodles and could easily taste the eggs and tofu. I ordered my Pad Thai mild--I can't handle super spicy food--and the dish had just enough flavor for my liking. Definitely a good traditional dish that I would order again in a heartbeat.\"Pad See ew\": My friend said she usually orders this dish but changes up the meat she chooses. During our visit, she opted for shrimp. This entrée consists of flat, stir-fried rice noodles stir with egg and Chinese broccoli in black soy sauce. My friend likes this dish because of the black soy sauce; the noodles came with a good amount of broccoli chunks as well.\"Thai Fried Rice\": If I ordered a different rice dish for the \"Create Your Own Lunch Entrée,\" I probably would have gone with this chicken fried rice. The fried rice portion entails Jasmine rice that's stir-fried with garlic, egg, Chinese broccoli, tomatoes, onions and cucumbers. Of course, I would modify my order a bit--no tomatoes, onions and cucumbers for me--but everything else in this fried rice medley sounds absolutely delightful. Plus, I like the finer grains of Jasmine rice, so I'm sure I'd love this concoction.\"Garlic and Pepper\": I love the smoky flavor of combined pepper and garlic, so this rice dish sounds like it's right up my alley. I definitely want to try this rice entrée one day--it's probably great with chicken or pork--and I'd get it if I'm certain I don't have any other plans for the day (don't want to be smelling like strong garlic!).\"Chicken Satay\": Though we didn't order any appetizers during our visit, this dish sounded yummy. It features marinated chicken in mix of Thai spices on a skewer and comes served with cucumber sauce, peanut sauce and bread toast. I'm not sure what the bread toast tastes like here, but I like peanut sauce so I'm sure I would enjoy this dish. If I ever order an app from Koon Thai, this one's at the top of my must-try list.\"Poo jah\": I love a good crab cake, but I must say, I've never tried a Thai crab cake in my life. This one sounds appetizing, as it features stuffed crab that's dipped in egg batter and fried, and it's served on a spring mix with lime mayo dressing and Sriracha chili sauce. Now, I'm not a huge fan of Sriracha cause I can't handle the spice, but I am curious to try the Thai crab cake itself. I wonder if it has a super strong crab flavor ...\"Wonton Soup\": This soup sounds absolutely perfect for a rainy day and it doesn't encompass too many ingredients, which I like. It features a milk clear broth soup filled with wontons, ground chicken, shrimp and shiitake mushrooms. I love wontons, so I can't wait to try this comfort soup one day."], ["Mandy S.", "Came here a while back after a massage therapist from Thailand said Koon Thai is better than Thai food in Thailand. The interior is clean and warmly decorated, service is good for the most part, and since our first time, we have come here at least once every week. The lunch menu is very reasonably priced, but the dinnertime portions are larger and they set the table with fancy napkins. Here's our top five:Pad Kee Mao - stir-fried flat rice noodles with vegetables and choice of meat. Go-to dish not only for thai food but stir-fry in general . Five out of five.Duck noodle soup - broth of soy sauce and fish sauce with chopped duck. It goes well with both flat and skinny noodles, and on good days you'll get the meaty duck breast (other days you might get bony or fatty parts). Four out of five.Thai fried rice - fried rice seasoned with fish sauce. Good portions, consistently delicious. Four point five out of five.Pumpkin curry - we tried several other curries, and I found most to be too sweet for my taste. However, all the curries are very flavorful. Pumpkin curry isn't on the lunch menu, but it's our new favorite -- the smoothness of the coconut milk doesn't overpower the spiciness, and the pumpkin melts in your mouth. So delicious. Five out of five.Tom yum soup - Adequately sour, just as tom yum soup should be. There's chicken, two different kinds of mushrooms, skinny green herbs, and tomato in the soup, and it's only $1.50 for lunch, although I would pay full price any day. Five out of five, just ask for some limes if you want more sour.We always order no spicy and ask for the hot sauce caddy on the side, that way dishes can be shared with everyone. Spicy-lovers beware, we've been here with friends who underestimated the spiciness and couldn't eat their food at all. We tried appetizers like papaya salad and fried shrimp, they were all just ok. The beer towers are pretty cool. If I were to choose one restaurant to live off on for the rest of my life, this would be among the top choices."], ["Ivonne V.", "Came here for lunch, and they have a special lunch price. Which it is a great price , good amount of food and delicious!Nice ambiance, clean and fast.Definitely will recommend it! :)"], ["Tait L.", "Had Thai pepper steak. Very good. 1st here. Will be back. I ordered through the yelp/eat24. Took longer than expected to receive food. But well worth it. The employee explained it takes longer ordering through yelp. He recommend calling in or going straight through eat24."], ["M. D.", "Go-to Thai food!Favorite dishes:Spicy noodles - Flavor is plentiful, not too greasy.  I usually get mild and it still has a kick to it.Sweet and sour fish - Fried fish with tangy and sweet sauce containing bell pepper (I've only gotten the fillet but you can get the dish with whole fish).  I always get this dish but there is one complaint - too much sauce!  The fish would stay crispier without so much sauce and that much is really not needed because the sauce and fish are both so flavorful.Crab fried rice -  Not typically a dish I would order but here it is great.  I can really taste the crab!  Good balance with the veggies and the rice texture is just right; not too greasy, not soggy.Service is friendly.  The place is always busy but I've never had to wait.  Parking lot can be difficult and the spaces small.  I try to park on the street."], ["Angela F.", "I love my Thai just like I love my men - spicy enough to bite you, but not make you cry. The reason for 3 Stars is two-fold: ordering spicy food is inconsistent. Some waiters will ask \"what number 0-10\". Others ask \" no spicy, medium or hot spicy \". Even still, you never really know what you are going to get. Ordering spicy is like playing Russian roulette, you never know what you'll get.  Sometimes medium is not spicy at all and other days I can't feel my tongue. But I just take it however they dish it.Typical of Asian establishments, once you order your food you won't see the waiter until it's time for the check. So get everything you might need upfront.I'm ashamed to admit I spend too much of my paycheck on this place because it's close by. The lunch time menu is deal with average cost of $8 for a large enough of a portion to take home leftovers. The red curry is seasoned perfectly. As a soup connoisseur, I've tried them all and they were nothing to brag about.Overall, it's a decent little place with an overcrowded ambiance that I won't make any special trips to on an off-work day."], ["Drew L.", "Prelims: a nice clean little place on Convoy street, the interior is a bit dim, even during a lunch but is still a pleasant place to go kill time and food. The interior is larger than it looks, and the place is definitely a cleaner joint than most Thai restaurants I've been at. Parking is a beast - you'll have a harder time finding parking than finding the lost city of Atlantis; which is totally ironic as there is a massive parking lot! It's just really poorly designed with horribly small spaces that make you feel like you're backing in a semi. Service is quick and fast - food came out a bit slow but it was lunch hour - who gives a rip.I came here with 2 other coworkers after much debating over who wants what and where we were going to go eat. We were originally going to go somewhere else, but the driver (cough, MAX, cough) decided on his own to just drive here, despite our protests that we go elsewhere because he said that he \"heard\" someone say they wanted Thai food. And we all got the lunch special. Because it's cheaper. That's right - I'm a cheapskate. I ordered the Pad Thai - yes, I ordered the most boring and common dish that the entire world orders when they step through the doors of a Thai restaurant. And it tasted like it was meant to tickle the palate of every person around the world: decidedly average - the flavors were all present, with the sweet and sour, the tomato, the peanuts, the chicken, etc. But it was all a bit underscored - like they took the flavor and dialed it backwards. The food tasted like it was supposed to but it wouldn't bust down the doors to my tastebuds. The portions were pretty good-sized through. I had a massive pancake breakfast beforehand and so I ended up eating half of my noodles. It lasted the night and I had it for lunch that next day and it was pretty decently filling so I'm pretty sure most people would be full....scratch that, it's America. You'll probably get full but not enough for a second meal leftover. So all in all, I would eat this if I was pretty hungry and didn't really care too much to be a snob about it, but there are definitely better things on the menu to order. My coworker ordered the Pad See Ew (god I have to spell this again :0 I think it's spelled Phat Si-io). It was again, decidly average - a bit oily, a little on the small side for the amount of chicken, and the flavor was a bit underwhelming. I mean, the flavors were all there - it tasted like what you expected it to taste. But that was the best of it's flavors - just a little bit of average. Now, if I was desperate for PSE and couldn't find it anywhere else, this would definitely hit the craving spot. And if I didn't care about being a snob about Thai food, it's a good place to go. But there are other things on the menu and I feel like this is just a safe option only if you know exactly what you want and expect. My other coworker got the drunken noodles. It ended up being pretty decent; personally I have never gotten drunken noodles before because the idea that my noodles are haphazardly meandering down the street singing old Disney songs at the top of their lungs because they consumed too much alcohol doesn't exactly excite me. On the other hand, I'm a much bigger fan of curry, so I haven't exactly had the urge to try them either. So as the opportunity presented itself, I dug in a bit to see exactly what they taste like. And it tasted like PSE just a bit spicier. I mean, it was as if they used the same ingredients, in the same work, for the same dish, with more pepper. My expectations were low - this hit it exactly on the mark (so success, I guess?) so drunken noodles were something that I would now put on the backburner in my mind whenever I am going to a Thai restaurant. Lunch specials are under $10TL;DR decent location, big servings, average Thai food."], ["Kat H.", "Mmmm. Fancy Thai restaurant next to Cafe Heu, WAFFLES FOR DESSERT. Really nice decor with lights, a cool painting on one side, and tinted wine glasses. I've had the pad thai, pad kee mao, and boat noodles here, and I've loved them all. The boat noodles, and other soup noodles, are really cheap too. They have a huge variety of dishes, not just your typical pad thai and curries. I believe they have my favorite dish, Kha Moo as well which is slow braised bork pelly, but I'll save that for another review if I get to try it.Generally pretty quick service, workers are very friendly, and a solid place to get some Thai food. Decor is more modern than Thai, but still a nice environment. They have lunch specials too!"], ["Erika T.", "Food is delicious. They have great drink specials and lunch specials. And right now if you check in you get half off a bottle of wine.  Theres a little bit of everything there for everyone. :)"], ["Lo R.", "AbsolutelyAmazing. ! Hands down some of the best Asian food iv eaten in a while. The amount of food, the taste of food and quality is all on point. Kitchen definitely knows what they are doing. My only complaint would be towards their service and FOH. These guys were clueless.  Either that or just too busy to pay attention.  Another one of those places where the food compensates for the shitty service. So back to the food.  I had the shrimp +  cashew plate and it was great! My and wife and her sister had the same chicken friend rice and were speechless thru dinner. Just face to spoon interaction.   Great menu. Could do better on the service."]], "Supannee House of Thai": [], "Thai Papaya": [["Ranjit J.", "Whoa!! Another home run from the SEL crew! Some very unique items -- my favorite: the \"Mok Nor Sai\" with Pork. Also superb: the sausage and the \"Khao Soi\" which is super rich but worth every Kcal. The friendly folks will warn you about the unusual-ness of various items, but be brave and press on: you will be rewarded!"], ["Philipp R.", "This place is excellent. Everything on this menu  is so bright and flavorful. I recommend this place to all."], ["Janine D.", "It will never get better than this! This is best Thai even if it was in Thailand. I had the green curry with vermicelli noodle and larb pork. Same six seats as sab e lee originally had.  I would nominate this one of the best restaurants in San Diego"]], "Taste of Thai": [["Missy B.", "My friend, Venessa V. and I were out wandering the streets of Hillcrest on Labor Day looking for somewhere to eat and, after approaching several \"Closed\" signs, were stoked to see Taste of Thai open for business! The inside decor is nice. Actually, I almost felt a little underdressed in my shorts and flip flops sitting at a table with white table clothes and beautifully folded cloth napkins. The place is fairly small so I can only imagine the wait on a busy Friday night, but we were here at an off time of day (2pm or 3pm, I think?) and on a national holiday so the place was pretty empty. We were seated immediately and given time to look over the menu, although Venessa and I are no strangers to eating Thai food together, so we already knew what we wanted! I ordered the yellow curry, as I always do, and brown rice, which I sometimes do when I'm trying to be a bit more healthy! The food came out pretty quickly and my yellow curry was great! It wasn't as creamy as I'm used to it being at other places, but I'm no Thai food expert so who knows who's is more authentic?! I liked it all the same and gobbled it down, no problem. Lastly, the service was great. Sometimes the worst service I receive is in restaurants that aren't currently busy. You know, they are all either talking in the back and you don't get any service at all, or they are all over your table, hovering and taking your plates as you still have that last bite in your mouth. Not here! They were perfectly attentive -- there when we needed them and not there when we didn't. They even helped us make some wine selections and talked us into the Tom Kha soup (not a hard thing to do with Venessa and I!)Even though my favorite (so far) Thai restaurant is just a couple blocks away, I like Taste of Thai enough that I will return. But next time, I want to sit outside on the patio and people watch!"], ["Marty B.", "Nice dinner ( 4 stars ) Came one night for Thai food. Nice Chang beer.Got recommendation between the 2 duck dishes.I ordered the savory Duck in garlic sauce.It was a generous portion, and the duck was OK, which came with vegetables and rice.My server noticed my LA Marathon shirt and we talked about running. He runs too, but lately just does weights to compete in body building contests.Nice guy."], ["Auriel M.", "To start off with, their food tasted good. Me and my husband went in for lunch and the special seems nice, you get a lot of food at a good price. Unfortunately we noticed with the Chicken Pad Thais that we order they used half chicken and half tofu. I paid extra for the chicken. If I wanted tofu that's what I would have ordered. Most likely won't come back. We feel cheated after a 40 dollar lunch..."], ["Barbara L.", "Great Thai food for a reasonable price with a nice ambiance. Thai food is a hit or miss for the most part. I'm glad this place was a hit. I enjoyed the chicken panang curry and spicy noodles with Chinese sausage, which is unique to this place. Flavor was there, but it was on the greasy side as most Thai dishes are. Portion sizes were smaller compared to other places but still very filling. We checked in for free Thai tea and it was delicious. Great experience trying this new Thai restaurant. I will be back to try other dishes."], ["Nikki B.", "I was in the mood for Thai and decided to try this place. It is very nice and clean in the dining area and there is a small patio to be seated. I decided to sit outside to enjoy the weather. The waiter was very helpful and the customer service through the visit was great. I couldn't give this place more stars for two reasons. I ordered the broccoli lunch with chicken. The meal comes with a small soup that was basically broth with peas, mushrooms, and noodles. I can't say that I was impressed with it. When the meal arrived the presentation was great but the salad was lacking dressing. The dressing I could taste was too sour. Overall the experience was great and since I live around the area I might try it again."], ["Ryan ..", "I was taken to Taste Of Thai, by a friend last night.  The food was amazing. I had never had the yelp app before or yelped before. Because of this place is why I got the app. To praise this place for is awesome food."], ["Angie G.", "Came here with a party of 10 on a Saturday night and was very accommodating w/o any reservations. Their Thai food is delicious if you are in the Hillcrest (but have heard there are better) in which I have not yet tried. The service here is top notch and is always on top of your needs. When you check in on Yelp you do get a free Thai Tea, but only one per table! There were a lot of Yelpers I was with so we had to ro-sam-bo that! I ordered the Tom Yum soup hot pot and it came out so cold. I didn't know if it was sitting there all day and they figured that the hot pot would heat it up, but it didn't. So I had to ask the waiter to heat up the entire pot! He did and it was perfect. FYI- There is this strange white guy that hangs out in the front smoking a cigarette whom I thought was homeless, but later on I saw him at the front desk (very weird)."], ["Victoria P.", "I came here for dinner the other night. I don't usually eat Thai food so this place was great to me. The food was good and tasted fresh. The ambiance was nice and quiet. I would come back :)"], ["Mark L.", "It's all about the chicken pad thai!  The service is top-notch, the food well above average and the price is the best in town.   If you're looking for reasonably prices delcious thai cuisine then look no further!      Word to the wise: The takeout portions are HUGE!"], ["Stefani T.", "We ordered:Leaf wrapped savories - this is a sort of build-your-own spinach taco with toasted coconut, peanuts, fried tofu, carrots, bean sprouts, lime, and ginger.  It really comes together and creates an explosion of flavor.  5 starsFresh spring rolls - small order for $7 and lacking in flavor.  I wouldn't recommend these.  1.5 starsThai fried rice - with shrimp.  The chili powder and oil made the rice very greasy.  It tasted better when we mixed it with the extra steamed rices 3 starsLove boat - a small combination of mock meats served with lots of glass noodles and few vegetables.  Good flavor but it wasn't worth $14.  2 starsYellow veggie and tofu curry.  Delicious, mild taste but very thin with not enough coconut cream/milk. 3 starsThai iced tea - yummy 4 starsI have a long lasting affection for this place - when I lived in SD over 20 years ago, a Taste of Thai was at the forefront of amazing cuisine.  While I still enjoyed our dinner,  there are now so many other Thai establishments in the area.  I'll have to give those a try the next time around."], ["Angela Irene D.", "After searching high and low, we Found Taste Of Thai! I was looking for my beloved Mee Krob that I truly truly fell in love with in Hawai'i. Found out they have it here, and came straight here for lunch! Too bad we came on a Sunday,  because they're lunch specials are a good deal!!What makes it two stars was NOT the lack in customer service at all, they're customer service was very hospitable and always checked if everything was okay and if we needed anything else.The two stars goes to the food. Yeah, the food! :(We Ordered:-Mee Krob: (appetizer) sweet crispy noodles with chicken, shrimp and tofu.-Hot pot of Tom Kha-Sweet Basil Beef with brown rice.-2 Thai ice tea (which was free with yelp check-in)Now, we are avid in eating Thai food, and I'm sorry but after eating LEGIT thai food, this place is a no go.The Mee krob was mostly noodles and a *couple* pieces of the chicken, one piece of shrimp, and *couple* pieces of tofu! Seriously? $8 and I should've got more than that, damn shame. The taste was even off. It seemed more sour than sweet. NEVER ordering that again. The hot pot of Tom Kha, came out to be Tom Yum! We knew something was off and I'm glad our waitress regonized it and asked if it was okay (of course it's NOT okay) but we were nice about it because the Tom Yum tasted BETTER than the Tom Kha, it's like They just need to add coconut milk to the Tom Yum and it it will be good!When we received our actual Tom Kha, it was kinda worse. It was more bland and lacked that spice of ginger, so we had our left over soup of Tom Yum and added it to our Tom Kha and THAT was perfect! I feel like it was lacking more ingredients, it's like the cook got lazy and just put 3 ingredients and added water and coconut milk. I should've asked for the spice rack but I shouldn't need it *If* it tasted so good, but we were so bummed that it lacked flavor and ingredients. You would think for their mistake of our order they would minus the $11! Nope, but we paid because The Tom Yum was decent enough anyway.The sweet basil came next and it too lacked flavor! What is going on here?! I asked for pepper and added it and I just gave up after that. Didn't taste like Thai food to me, and I might come back here to try again, because maybe the cook was just having one of those days. Chances are slim though. I thought I wouldn't be disappointed but I am."], ["Richard C.", "What happened? This was a good place when I came several times before. I ordered sweet and sour chicken that turned out to be sweet and sour soup with about 4 small pieces of chicken. The wontons and egg rolls were cold. The server didn't even ask if everything was ok even after she saw I only took about three or four bites of my meal. I am very disappointed, I usually enjoy this place when I come but NOT today."], ["Enrilo u.", "For as long as I have been coming here, I finally have the time to write a review on this \"AMAZING RESTAURANT\"  I have been coming to taste of Thai for 9 years and they never disappoint, Let's starts with the service, they always greet you and have paid parking for your dine in, so you'll always have parking if you need it.Are waiter is Mark! Always does such an awesome job, making our time here enjoyable Also if you check in you receive a complimentary iced Thai tea I always order the drunken noodles (spicy noodles), beware their spicy is spicy, their levels are from 1 to 10, 1 is very minimal and 10 is like eating a habenro. I'm not joking. So I usually get level 7 and ask for the spices on the side. I"], ["Maridel A.", "Good Thai spot. Been here twice. Free Thai tea at check in! Woo hoo!I prefer Amarin Thai on university but since I live in Hillcrest this place is walking distance. My fave Thai dish is the crab fried rice but unfortunately they don't serve that here. I ordered the pad Thai noodles with chicken. Yummy!Staff are friendly and nice. I Mainly come here for the free Thai tea haha"], ["Candie A.", "At First appearance looked like a very suitable place to come and enjoy lunch... what made me give this place a low rating was the young lady that took our order, she was rushing us through the entire time of us trying to decide what to oder also  as I tried to redeem my free Thai tea coupon she gave me attitude and as other guest came in she never excused her self just sorta pushed her self through the door past me and my seven year old nephew. We Will think twice about returning unfortunately. Wish I could've received better service. As for the food review we will have to see as we are ordering take out. Hope the taste makes up for the bad service."], ["Brad B.", "Spring rolls. They are my barometer for Thai restaurants and are typically the first thing that I order to figure out what else to eat based on their quality. Though simple, they're f#cked up constantly. The good news is that Taste of Thai is doing them right!First things first... the parking blows here. You can cruise the streets in search of an open parking meter but your best bet is to park in the lot out back and they'll validate your parking for you. Just be sure to head inside first, have them give you a parking pass and drop it on your dashboard upon arrival, not departure. Okay, those spring rolls. I think they may call them fresh salad rolls here, but they are not the fried ones, they're the ones rolled in rice paper. You have the choice of shrimp or tofu here and they'll come served with a side of peanut sauce - standard. What makes these ones shine is the crunch when you bite into them. The veggies are fresh, aromatic and the rolls are most likely made to order. Stir some Sriracha into the peanut sauce and dip away...So why four rather than five stars? They're small and they're pricey. Where most places will charge under five bucks for this stellar starter, Taste of Thai rings in at almost seven.Will be back!"], ["Julia J.", "We got seated right away on a Saturday night.  (This could be a good thing or a bad sign, am I right?)The restaurant was clean and had an open feel to it, but the seating was a bit uncomfortable.  Our table was so close to our neighbor that I could hear them instead of my husband.  (It was also a long table...kinda strange.  If you ever eat there you will see what I mean.)For an appetizer we shared the Fresh Spring Rolls.  The basil was fresh and the peanut sauce was mild.  It was very good.I ordered the Green Curry chicken hot pot and it was SPECTACULAR! (But, it was pretty hot and spicy, so if that's not your 'thang, FYI. ) I asked the server to make it steamed with the sauce on the side.  The chicken was perfectly cooked, tender, moist and juicy.  I was really surprised because I've gotten used to a rubbery texture that chicken seems to take when I order it this way.My husband had the Broccoli Chicken with Ginger sauce. From what I sampled, it was very good. (But then again...I only had one bite! Hungry husbands aren't too good at sharing!)The service from 'Ae' was very warm. He was friendly and on top of things. We will definitely be back.***********************************************************************************UPDATE: My husband and I returned and had another great dinner.  There's nothing to write about because we ordered the same dishes.HELPFUL TIDBIT: We just found out that if you pay your bill in cash, they offer a 10% discount. Who needs dessert with a SWEET deal like 'dat?"], ["Monique D.", "Great Thai food, came here Sunday with a few friends because we were craving some tasty Thai food and this place did not disappoint!! I loved the atmosphere, we were seated right away, the menu was full of options and specials. I got chicken pad Thai with 8 as my spicy level ( love spicy food) and it was perfect!! I love spicy food with flavor, some places you just get heat but not flavor but for this place that is not the case. My friend got the curry and my other for something else, everyone was happy with what we got and the price was great.Will be returning !"], ["Esther L.", "Great service. Super speedy and yummy pad Thai and Panang. Looking forward to trying more from this spot!"], ["Max P.", "I would give this place a 3.5. Honestly this place is definitely above average. They have a menu in which you as a customer can refine yourself. My girlfriend loves their pineapple fried rice with chinese sausage and honestly it is the best I have tasted. Only reason this restaurant is lacking in the stars department is their overly sized cuts of vegetables. Tum Yum Soup - The flavors are almost there, however the broth was over-ly sour. The large chunks of half cooked onion did not have time to sweeten the broth and balance the flavors. Almost maybe only had 2-3 pieces of shrimp inside the entire soup The green peppers added was unusual but did not do harm besides being too large.Pineapple fried rice w/ chinese sausage - The flavors inside that dish was delicious. The sweet flavor from the pineapple was not overpowering and the saltiness from the chinese sausage gave a great balance to the meal. However, the same problem remains in all their dishes. The oversized chunks of vegetables that would make up 1/3 of your spoonful made us not wanting to touch any of the vegetables."], ["Brianna M.", "My baby introduced this place to me and at first I was skeptical. However I was a team sport went to this place and dam! The soup is bomb and dont even let me begin to tell you about the spicy noodles with chicken. Craving some right now!! Never had tai food but it sure is good ass food!"], ["Catherine C.", "The people working here are incredibly sweet, but I have to say that I probably wouldn't choose this Thai restaurant to eat at given all the other nearby Thai places that I enjoy so much more.  I came here for a work lunch meeting, and my coworker and I were the only two people in the place for quite some time.  We each ordered one of the lunch specials-- I had the red curry, and my coworker ordered a spicy tofu and noodle dish.  My curry was okay, but nothing great, not really a red curry actually, and just didn't have any pizazz.  My coworker's noodles gave off the same effect, and the tofu was overcooked.  I liked that the place offered a deal for free Thai Tea with check in, and they were very attentive with our water situation, but otherwise the flavors just didn't quite deliver."], ["Evan L.", "This review is going to be short because I came here for the taste of Hillcrest and could only sample a couple items: I tried the pad thai and a chicken skewer. I felt that the chicken was dry, not really tender and lacked flavor. I felt that the pad thai was only warm and really lacked flavor. Unfortunately, the pad thai also was dry and due to this, I don't think I will be coming back here with all the amazing food offerings in hillcrest."], ["Kathleen R.", "Excellent!!! I had the Hawaiian Fried Rice with added vegetables and no egg. My husband had the Hot Basil with tofu -yum. I love the fact that almost everything can be made vegetarian/vegan. Healthy and delicious with no fried oily aftertaste. Will defiantly come back when we are in San Diego."], ["Melissa S.", "Favorites: 1) shrimp pad thai 2) chicken & asparagusOverall great flavor and cooked perfectly!Other recommendations:-angel wings-seafood curry-money bags-fried bananaTips: -they have a 20% off coupon on their website -you get 10% if you pay with cashThe waiters wrapped the take out boxes to prevent any leakage which was pretty thoughtful."], ["Ariana R.", "Love this place the service is ALWAYS good even if they are going to close they are so perfect"], ["phil c.", "We've been coming here for years, the food has always been good, and as a vegan and vegetarian, we've always asked for the pad Thai with no fish sauce. I ordered tonight, and they said it only comes with fish sauce, and has always come with it. So for years, they've been lying to us and feeding us food that goes against our dietary requirements."], ["Nelce S.", "Tasty pad Thai with condiments served.Location is great at the heart of hillcrest.Staff is very attentive and unobtrusive.Will return."], ["Nancy T.", "One of my favorite Thai restaurants in San Diego!! I always get the pineapple fried rice, shrimp panang curry, and the spicy chicken noodles!! Sooo good!!!"], ["Paul S.", "I went here for lunch and ordered the spicy noodle lunch special. Excellent value for the price, very flavorful. Service was excellent and fast. Decor was a very nice mix of traditional Thai and modern look. I would come here again."], ["Jac D.", "Taste of Thai is a tad pricier than other Thai restaurants in the area, but the extra dinero is well worth it. Lived in SD my whole life and eat most meals out-this is one of my top 8!"], ["Minsun P.", "I visited here one week ago. It was great!! The service was great!! The food was delivery so fast. I waited just 5 minutes? The interior was comfortable!!! I recommend this restaurant to you!!!!"], ["Jay K.", "A foul pit. Aside from the bland food made with clearly 2 day old vegetables and other ingredients, service was abysmal. Orders came out randomly and one person overlooked completely. Stay far far away."], ["Bill K.", "I am vegetarian. I love good thai food.  I had the vegetarian duck.  Medium spicy.  They do medium spicy perfect. The food was perfect temperature in both ways. Rice was also perfect.  How can I get you to stop reading and come here and satisfy your tongue?Oh, I know. Visit their web site and print off the 20 percent discount coupon and present it before you order.  Then checking on yelp and get a free thai tea. Just wow."], ["Sue J.", "Love their food and the service!  Plus, they have free parking!  My favorites are their Som Tum salad and spicy noodles.  Their Thai Iced tea is better than other Thai restaurants.  Great ambience.  Just wish they had more room for bigger parties."], ["Nicholas G.", "I'm not a huge fan of thai food. I do however love one thing on there menu. The calamari is my favorite. The staff is friendly and so kind. Today I tried the tiger steak and it was not for me. Nice portions tho. ...I'll be back when I'm in the mood for more calamari"], ["Kurt B.", "The service here was incredible. My water glass never made it below 1/2 once and they must have filled it a dozen times at least.  The wait staff was on top of their game. The food was also above average for sure. I ordered the Pad See Ew with pork. It was a delicious, nice-sized portion for $10. Well worth it."], ["Teresa N.", "Good things: 5.95 lunch specialIts right in the middle of a very busy area in hillcrest but it has its own parking! Clean, nice music and decorating. Nice wait staffI got a free Thai iced tea for checking in with yelp.Bad:Had to park, walk to restaurant, get parking pass, then go put it on the dash, then walk back, then i could be seated to eat.My green curry was VERY bland although it had a much larger variety of vegetables in it that all the other thai places in san diego which had me exited until I tasted it. That made me sad but the free tea made me feel better."], ["E W.", "For starters we did not eat here, on a Friday night we were seated right away just in front of the hostess stand. The restaurant was busy but not full. We sat for over 15 mins while waiters and waitresses passed, coming up on 20 mins we still did not have water or even any contact with the wait staff. We decided to leave and never return."], ["Celine N.", "Taking a break from my normal prose, may I just say that this place is the bae. Thanksgiving day found my family in San Diego, in search of an escape from nosy in-laws. Apparently, however, restaurants aren't supposed to be open on this national holiday, and we were stuck hungry and a little ashamed. Then came along this heaven of a place. (thank you yelp)I consider Thai places in general a hit or miss. Either it's authentic, or it's crap a pig wouldn't eat. Taste of Thai was definitely one of those first places- service was fast, polite, and friendly, with the waiter being extremely patient with our hunger-addled mutterings. (I interrupt this long af review to tell you to CHECK IN AND GET THE THAI TEA. EVEN IF YOU DONT LIKE THAI TEA, GET IT ANYWAYS. Seriously. It's really good.)We ended up ordering the Pad Thai, Red Curry with shrimp, and Panang with beef. Pad Thai is a great way to determine the quality of a Thai restaurant, and Taste of Thai's was authentic as it got. The noodles were perfectly chewy, and the sauce a mix of salty, sweet, and sourness. I greatly appreciated the spiciness of the curries, and the freshness of the ingredients. For dessert, we ordered sticky rice with mango, and that, needless to say, was really good also. Parking was essentially a chaotic mess, and we had to walk about two blocks to get to the restaurant. Not too happy about that, but what could I do? At least the food made up for it. Very long story short, Thai food good. Taste of Thai food good. Eat here. 10/10 would come back."]], "Amarin Thai Cuisine": [], "Issara Thai": [["Robert M.", "I got the drunken noodles. I ordered them as7 out of 10.  Still it was way too hot!  By far the hottest drunken noodles I have ever had.  Also, there wasn't much pork in the dish - I counted about six small pieces."], ["Erik J.", "The Green Curry with chicken is good but the Pad Ki Mao (Drunken Noodles) is incredible! Good service and great beers on draft too. Highly recommended."], ["Marissa T.", "I am sad to say that I walked away from this restaurant feeling pretty disappointed.  Especially since I was given such great recommendations about their food and service. My group was seated very quickly and our food came out super fast.  I was not expecting the level of spiciness that came with my dish, well, all of our dishes actually. Holy cow! My throat and tongue were on fire.  The spices overpowered the taste of the food. Even eating extra rice didn't help to end the problem."], ["Nelce S.", "Liking the shrimp pad Thai here. Texture and flavor is good. Basil chicken is so so but the mussel appetizer is a good choice.Service was prompt.  Lighting for dinner was a little bright. Will come again to try other items if in the area."], ["Chris W.", "I have been here maybe 4 times and ordered take out 3 times.  Food is ok nothing special, as its ok when you need a quick fix wen your starving.  My only two complaints are when you go there you will see for yourself.  1.  The food, especially the stir fries are VERY salty, and 2. The beef and all the chicken that is cooked is WAY OVER COOKED and HARD AS A ROCK!!!!   what is up with the chef?  I can cook seafood and all meats more tender.  Yes this kills the dish.  I can deal with the salt better than the meat being hard as a rock!!!  go eat there and you will see.  If the meat was cooked perfectly they would get 1 more star from me."], ["Faye C.", "We ordered take out from here last night.  We had the chicken pad Thai and golden curry with chicken.  Both were ordered without spice (you can get spice levels 1 through 10).  The dishes skewed a bit in the sweet side.  If I were going to order from here again I would select a heat level of 2 just to cut through the sweetness.  The pad Thai is made from a thinner noodle than I'm used to.  I like that they offer an option of white or brown rice.  Overall it was pretty good."], ["R L.", "Pineapple Curry was delicious...ordered a spicy level 6. I probably should have ordered a 5...it was slightly too hot and I'm used to some heat. Still it was delicious! Service was great!"], ["Claire D.", "Came here for a rehearsal dinner and had a great meal. The chicken wings didn't really absorb much flavor from the peppers etc. they were served with but they were nicely crisp. The chicken satay was delicious, as were the egg rolls and shrimp cakes. The drunken noodles were very flavorful and my husband and I both enjoyed it. We had wanted to try a duck dish of theirs but they were out so we got the massamun curry with pork instead. The roti it came with was a flakey oily delight and the curry was good, though more bland than other curries I've had. The ambiance was pleasant and the service managed our large party well. I would recommend giving them a try if you want Thai around liberty station."], ["Jack M.", "I've heard good things about this place, so I decided to give it a go for lunch. After using my 15% Yelp check in on one entree, I decided on a appetizer of their Peppery Garlic Wings for $6 (yelp.com/biz_photos/issa…) and an entree of their Issara House Noodle Soup with clear soup broth, dressed with barbecue pork, shrimp balls, and ground pork without the noodles for $8 minus $1.20 for the 15% discount. (yelp.com/biz_photos/issa…)The wings did not come covered in sauce, but rather sprinkled with hot pepper, scallions, and garlic. (yelp.com/biz_photos/issa…) They arrived steaming hot out of the frier, and the tender meat was cooked thoroughly, and they had a crunchy exterior (yelp.com/biz_photos/issa…). I did feel that they needed more seasoning, the black pepper was light and salt came up short. What bettered them, was their table hot sauce. It wasn't mouth-firing, but mild with good flavor and seasoning. (yelp.com/biz_photos/issa…) The House Noodle Soup was outstanding. The broth was light, well seasoned, and savory. It came filled with wholesome BBQ pork, tender ground pork, healthy bok choy, scallions, and aggresively flavored shrimp balls. (yelp.com/biz_photos/issa…) The shrimp balls threw me for a loop in a good way.  Their flavor profile would suggest they did not belong in the soup, but my palate would beg to differ. (yelp.com/biz_photos/issa…) The soup and pork were very savory, so the shrimp balls, with their hint of the sea, broke up that savory dominance of the soup. Oh yes, the soups was even better with a little hot sauce! (yelp.com/biz_photos/issa…)The service was pretty nice. I was served by \"Chewbacca.\" Yes, I said Chewbacca. (yelp.com/biz_photos/issa…) I am sure it is just a joke, but I did have to take a double look, before I realized what it said on the receipt. I am certainly a fan of that House Noodle Soup...."], ["Jett U.", "I absolutely love the pad thai here. The sauce is fantastic and the noodles are perfect. BUT the last time I came the shrimp was overcooked. So this time I ordered the chicken pad thai... And it was overcooked. I was super disappointed but I still would've given 4 stars bc I would come back and eat the pad thai any day. I just wouldn't make the mistake of adding a meat anymore.THEN-- the check comes... I had asked for a little extra cilantro and the person with me just said they wanted the same. I didn't eat one piece of my chicken and it was sitting piled on the side of my plate when she brought me the check. I look at it and they charged me THREE DOLLARS FOR CILANTRO!!! WHAT??? If you add meat it's only $2.... And who doesn't tell you there's an up charge for something like that in the first place? And why would you set down the check without asking if there's something wrong with the food that wasn't touched? So I look at her and say, \"the chicken was really overcooked\". She says, \"oh. Ok.\" and takes the plate away. No offer to discount, no apology, no remorse whatsoever.. And a $3 charge for a sprig of an herb you can buy for fifty cents a bunch."], ["Patrick M.", "This is my favorite Thai place in the Point Loma area. They have a multiple choices for lunch specials. Staff is friendly, quick on the refills, and pretty speedy with getting your soup out as soon as they know your order. There is a 1-10 system on how spicy you want your dish. I'm pretty good with spicy foods and have settled with their 6 or 7. Otherwise, be prepared magma mouth if you go any higher. Parking is super available. Establishment is clean. Just an awesome place to get lunch."], ["Kenneth D.", "Food is delicious and the servings are filling. Staff is extremely polite and helpful. Place is nice and clean with lots of parking."], ["Mike O.", "This is the best that food that I've had in Pt Loma.  My co-workers and I go there about once a week for lunch.  Everyone gets out of there for under $12, the food and service are on point.  I've never had to wait very long to get served.  Decent beer selection.  The lunch special is where it's at.  I always go with the vegetable pad Thai, comes with a cup of Tom kha soup, spring rolls and a small salad, all for $8.  I usually keep the heat level around 6 on their 1-10 scale.  10 is ridiculously spicy and I've regretted ordering even a 7."], ["Joseph P.", "Nice happy hour. Small, but good selection of beer.  Of course the most important part is the food and service are excellent.  I get the feeling this place is still somewhat undiscovered as it is not usually crowded."], ["EmmaRae M.", "My favorite Thai place in San Diego. Their lunch special is a little more pricey compared to others, but definitely worth it. Also their level of spice (1-10) is true to the number. Our server was also really nice and was helpful with suggestions. Would definitely recommend this place :)"], ["Justin K.", "Been here several times and the food is great. Their lunch special from Sunday through Friday is also an amazing value. Thai iced coffees and that iced teas are so good it's worth making the trip for that. You won't regret coming here!"], ["Shayna H.", "Not impressed. The food was ok, but there wasn't much flavor in the Pad Thai that I ordered. Service was less than favorable, and the place wasn't even busy."], ["Nelly M.", "I really love the yellow curry and the Thai fried rice.  I order pick up and take home,  enough servings to share or to save the rest for leftovers.  I especially like the spice scale and able to order with no spice for my 2 year old and order the spiciest for my entree. Worth the trip."], ["Goen K.", "We were greeted right away and seated quickly. That was nice. But I suppose they don't have an excuse not to since we were the only customers here. With soup, noodles, salads, and a side of rice; we got our meal pretty quickly. Everything tastes like they dumped a handful of sugar. The sweetest Tom yum soup I have ever had. ): I'd prefer the to soup to be a little sour. I loved the fact that the pad Thai had tofu in it, but it was so sweet! I felt like a diabetic would probably die before their second bite. Over cooked beef in the yum salad. It seems like they only used the bottom half of a romaine heart for my salad. ): the lettuce was more bitter than the soup. The girl who served us was sweet (Tall with short black hair). The shorter girl seemed a little tired and didn't seem like she wanted to be there. Probably won't be back.. Too bad. I would have loved to have a go to Thai place near my home. The food is worth two stars. Our server was super sweet. She deserves 5 stars."], ["Geno P.", "Issara Thai doesn't offer the usual menu of 100-plus items, but man, what it does offer is really frikking tasty!Our favorite deal is the lunch menu. It's a LOT of food for an order that comes in at less than $10. My chicken pad se-ew was a plate with a small salad, rice, egg rolls, and a sinfully delicious coconut curry soup. I haven't seen much in this area of San Diego offering this much of a value for lunch - especially considering how delicious the food was.Don't let the mini-mall style location fool you. While it may not be the size of some of the Thai powerhouses in San Diego, Issara definitely holds its own and is a regular lunch spot from here on out."]], "Pure Thai": [], "Bangkok Spices": [["Kristi S.", "They are quick to get the food out on to the table and the prices are very fair.  Lots of food!! I always have leftovers! Jungle Curry, Pad See Eiw, Drunken Noodles, Mango Sticky rice... ALL delicious! I've gotten take out a couple of times and it is always ready within the estimated 10-15 minutes"], ["Shawn E.", "Small place that doesn't look like much from the outside. The inside was nicely decorated  but when we got toq the table our dishes were dirty. As for the food itself, we finally got a place that gave us a ten in spice. Every other place would say ten and would taste like a two.  It was alright. Little too much soy sauce on the chow mein and the crispy shrimp rolls were more bread than shrimp. Probably will not be returning."], ["Marlene A.", "Used to go here all the time when I lived in North Park. Under construction last time I visited. Now only for take-out which is a bummer but well worth it. Drunken Noddles and salad are da best!"], ["Aleck L.", "My friend and I came here on a Thursday night and it wasn't crowded at all. It had its own parking lot, which is nice because parking can be a pain in north park. I ordered the spicy noodle with mock duck, which was decent. The mock duck was great, but the noodles were only okay. We also had the angel wing appetizer, which was tasty! And it looks way bigger than the picture in the menu. The portions are great for the price. I'd come back again!"], ["Grace C.", "Pork larb, spicy noodle, pad thai, mango sticky rice and thai ice tea - the regular dishes that comprises our dinner when we dine at Bangkok. The friendly, fast, efficient staff also makes for a great dining experience.Pork larb is sooooo flavorful and spicy and is great in contrast with the lettuce wraps and cucumbers they give you to eat with. I love their Thai ice tea - not to sweet, even though it's a little heavy on the condensed milk for me. Spicy noodle is spicy and is loaded with your choice of meats. As for the mango sticky rice....I could come here and eat just that. The rice is the perfect blend of warm and sweetness and the mango is soft and juicy. Obviously the mangos taste better when the fruit is in season, so...grain of salt! Generally speaking, portions are very generous and they don't skimp on quality. I've come back here several times, and will continue to dine here. Great service, great food, and great prices."], ["Alisha S.", "Please go back to dine-in service again! I miss sitting in what was clearly a gutted pizza hut, sucking down the best tom kha in town, and enjoying any number of their noodle dishes. For now, I'll have to eat it at home, or in my car if delicious smells overtake me."], ["Ray V.", "Sorry Folks...Bangkok Spices is no longer open for sit down dining. The good news is they're still open for business, but only take out."], ["Jackey N.", "Took one of my best friends to have lunch here for our first time. I'm giving this place 4 stars because for one, as we walked in we were not greeted til about 10 mins later....where is everybody? There was only one other group of people eating away besides us. We were then seated and given menus. Our waitress came and served us water then asked if we were ready, but we were not. It was my friend's first time so I had to explain the menu to her for she was confused. The waitress came back again and asked if we ready. So we felt a little rushed. But we did end up ordering after she came back the 3rd time. I liked that she gave my friend a sample of the Thai ice tea before she decided whether or not she wanted to order it, since she never had it. She loved it!My friend ended up ordering the pad see eiw for her first time. She couldn't decide between noodles or rice, but she knew she wanted a lot of veggies, so I told her pad see eiw. I ended up ordering a bowl photak soup w/ a spice of 9 and papaya salad with a spice of 9. When the food came I ended up ordering a bowl of jasmine rice to go with my order. My friend ended up taking half of my rice and putting it w/ her noodles! LOL! Food was delicious! Soup was not spicy enough for me but the papaya salad was perfect!So why not a perfect 5? Well, for having to wait as we walked in, and for being rushed to order.But we'll be back to try other stuff on the menu!"], ["Christina T.", "Every now and then, I have a craving for Thai food, and it haunts me until I am satisfied.Sure, the parking sucks and the building looks a bit out of place. However, this a definitely diamond in the rough.The menu is abundant with many authentic Thai dishes to suit any taste preference. A large serving of papaya salad (spice level 5 burns!!!) with PLENTY of shrimp?! Don't mind if I do! I always have trouble finishing the large portion of spicy drunken noodles (pad kee mao) because I always get them too spicy (oh but it's sooooo good) with ingredients abundant. They give you so much shrimp in seafood dishes!! I've only ever had their yellow curry, but it's quite tasty. The Thai tea isn't as sweet as other places - it tasted more like tea, which I prefer. They have the perfect ratio of milk, tea, and sugar/cream.Great service and I like the booth seating. Pricing is perfect, as most dishes, even with shrimp, are under $10 and enough to share. Now if only they could open a location near La Jolla *wink wink*"], ["Macey M.", "My group got Red Curry, yellow curry, Spock noodles, and Angel wings. Incase you were looking for good suggestions. Food on 1-10 1 being garbage 10 being amazingly perfect I give a 9 however the service was a 7. Don't get me wrong the waitress was super nice but the problem was there was only one.. Granted it was after New Years so I'm sure everyone called in sick.. They had amazing curries Red and Yellow were creamy and full of spice both equally great! And the appetizer Angel wings was.. *muaw* .... Well I went to heaven hence the name..hahaha great restaurant highly recommend"], ["Sabrina K.", "Been eating here since they opened.    It's located in the strip mall next to where I work so it's a super close lunch option.I usually get the yellow curry add extra veggie with brown rice.  It is a pretty consistent item as far as flavor profile goes.  There are a couple items that seem to change depending on who is cooking (the Larb Chicken and the Yum Woon Sen noodle Salad).  Sometimes they are over spiced and sometimes under spiced.  I always order Spicy #6, but I've had it come totally mild or totally flaming hot! Another item that is pretty consistent is a chicken noodle soup... kinda their version of Pho,  I don't think it's actually on the menu but there aren't any Pho places around, so they make this for a lot of my coworkers.  It is a little oily, but regardless, I'm always satisfied after I eat it."], ["Cecily H.", "Order spicy garlic fish and Bangkok spicy chicken it was made to perfection my new fav. Thai place - I highly recommended.  However call you food if you don't want to wait either way you can only order to go. Don't let that stop you from going the food is great!!"], ["Carlos P.", "Excellent. Consistently good spot. Tom Kha and beef salad are always on point. Very popular place for to go orders. Everyone is very good at customer service. Unlike most Thai spots in the area, parking here is easy because they have their own parking lot...that my fellow yelpers is called...\"winning\"."], ["TianChee S.", "I need to be honest, I don't understand why Thai places are so stingy with the amount of duck served. This is another restaurant that charges a premium and cheaps out on duck meat. I mean I was basically just served duck fat and skin. If that's what you are going to serve then list it like that. Had I known I would get little to no actual duck meat I would have never ordered.Note to self, don't order duck at any Thai restaurant. Seems rather consistent with most Thai places here. Only few exceptions I would go again and order a duck dish but sadly this is not one of them.I tried my other friends' dishes which were decent. Beef Pad See Eww was good. Their Jungle Curry was pretty good. Would consider ordering that next time. Their Pad Thai was very mediocre. Was not really impressed with it at all. This place didn't leave too good of a lasting impression. I would not proactively come back here for my Thai cravings. It's worth a try I guess."], ["Angie V.", "We found a new restaurant. Absolutely delicious.Great service.  Easy parking. Spicy the better. Very reasonable."], ["Brian C.", "Top notch service and food right here in our hood !!! Spicy Noodle level #3 with Chicken was the BOMB. (That's good.)  I tried the duck for first time ( a taste of someone else's entree ) and it was perfectly cooked and tender. )  Super friendly servers. GO. NOW !!!"], ["Eric C.", "My first time here this place is the bomb!!  This place has the curry spices that will make you happy!! I'll be on there's so many people here waiting for tables and they bring the food out piping hot and absolutely delicious!!  You could do substitutions that help you create your epic meal!! Bad part it is walking distance!! I will be able to come again and again!Love this place!! Cheers!"], ["Vicki W.", "The pad se ew was really tasty.  The meat seemed good- not too fatty and it had really good flavors.  I also had the spring roll starter and it was good.  There weren't too many people in the place when I went but it was 2pm so maybe the lunch rush was over."], ["James S.", "I have tried a lot of different Thai restaurants but this is my all time favorite. It has been a staple of my life for the past four years. I always get a noodle dish, a chicken curry dish, and either soup or an appetizer. The food here is amazing and the prices are great. I would never think twice about going to another Thai restaurant in the Hillcrest/Northpark area.Edit: Disappointed that it is only takeout now."], ["Laurel T.", "Yum!  This place exceeded my expectations.  Their tom kha is really yummy and the service is warm and friendly.  The portions are large - I shared the drunken noodles with  my sister and they were delicious. The place is cozy and welcoming and there is a parking lot provided.  They have a very large menu and I look forward to trying more of their offerings."]], "J&T Thai Street Food": []}