{"Mr. Gyros": [], "The Fat Greek": [["Mac J.", "Food was consistent with the original location. I would describe it as a mall food court version. If you crave Babaganoush you will not find it here. Go to the original location. You cannot BYOB here either. If you're at the Ala Moana mall and crave a quick fix of Greek food, this is the place. The prices and portions don't match but that's to be expected at a food court."], ["C P.", "Awful! No flavor, COLD, questionable meat (chicken) and stingy with beef/lamb AND overpriced -  yeuch. Worst meal I've had while vacationing. I take that back - worst meal I've ever had, period. Avoid this dump like the plague."], ["Sarah H.", "I had been craving Greek food, while Christmas shopping we decided to eat here. WORST MISTAKE EVER we ordered our food after waiting for the one customer in front for 8 minutes. We ordered they were out of rice, and seemed very rushed and the people making the food were moving very slow. Order costed $24 we waited for our food for 20 minutes. When we got it my beef and lamb gyro was cold...not warm...but cold there was no hint of heat to it. My boyfriends was the chicken gyro and his was warm/hot. Fries were mushy & dry like they had been siting under the heat lamp for 45+ minutes. Needless to say it was a waste of our hard earned money. I had stop eating it and opted for a slice of pizza. DONT TRY THIS PLACE!!!!"], ["Raquel B.", "We liked this place: fast, yummy and healthy food when shopping at Alamoana mall (although this mall is touristy expensive price, so it is more like window shopping). We got the Greek salad and even our 5 year old thought it was yummy. The only problem is that it is very expensive, with two plates and two orders of pita bread (they don't come with it which is the other problem) came out to almost $30? For salad? I have to say that is why people are bound to just eat fast food because it is relatively cheap. Overall good food but not for that price."], ["Sasha L.", "Delicious and quality Greek food!  Came here because I was watching Iron Man, and at the end they were eating shwarmas.  They looked so delicious!  I ordered the shwarma combo with a side of falafel and hummus with pita.  The Schwarma was fresh and piping hot, and came with a cool Greek salad and fries.  Stuff your salad into the Schwarma, it's so refreshing! And the servings are so large, you have plenty to take home with you.  We were stuffed and still had a large plate of leftovers to give to a hungry homeless man. :)"], ["Amber B.", "I tried. I really tried! After coming here innumerable times and never having a smooth error free or pleasant transaction (but totally delicious food!), I'm done trying. Here are Some of the reasons why: They offer a mall discount. I told them I work in the mall and they forgot to ring it up. You would think they'd offer to refund and charge the correct amount. They said sorry there's a long line so they cannot. THAT shoulda been a red flag... During the most recent attempt (aka the last straw) I ordered a felafel with no cheese, or cream sauce. After I generously tipped, I waited my usual ten minutes. They called VEGGIE WRAP! &looked at me. I said no, I ordered felafel. Oh but this is yours. I'm confused. She actually rung me up for a veggie wrap and said \"you have to tell us if you want felafel.\" I said well if there's no cream sauce or cheese in here I'll just take it. They said no we'll just add felafel. Cool I got what I ordered! Except when I got to my break room, there was cream sauce AND feta cheese all over everything. Soooo sad cause their food is good. But we are breaking up as of today."], ["Angela A.", "I had the combo chicken gyro. It was very tasting and filling. The combo includes the main dish, 2 sides, and a drink. I didn't want a soda so I asked if I could get a bottled water instead and they told me it was interchangeable with a soda. Which may be a small detail but is pretty cool for those who are trying to be healthier. Also if You like spicy food, ask for their spicy dressing."], ["Layna F.", "Not very good. The falafel here is disgusting. Very mushy and had a weird sour taste to it. Also very pricey for a salad that only had 4 falafels on top."], ["Jean Q.", "5.2-15 lunch with my niece. Our first time here. I recommend that you get the combo meal, which I did. It comes with 2 sides and a drink. I ordered the chicken gyro combo with fries and something else (Sorry, can't remember what it's called. All I know is its wrapped in grape leaves). Everything about it was good. Next time when I order the gyro, I'm gonna have to scrap the onions (yuck)."], ["Alexandrea P.", "Whenever I crave Greek food, this is the place I go to. I've been to Leo's Taverna and Mary's Mediterranean but nothing beats the Fat Greek! The combo with the beef and lamb gyro / garlic fries / hummus and pita bread was delicious. Not to mention the quick and friendly service :) It is a bit pricey but you get what you pay for (tasty, good quality greek food.) I'll definitely be back to try other things on the menu."], ["Mister O.", "The traditional lamb and beef Gyro is really good. The garlic fries were delicious as well. They are located in the center food court of the Ala Moana Shopping Center. Portions are generous and service was fast and friendly."], ["Roxy W.", "My husband and I love the food here. I miss doner kebabs and gyros from the mainland so we come here to satisfy our cravings.Food:I usually order either a chicken or falafel gyro plate with the hummus and salad. The hummus is good and the gyro hits the spot every time. The salad and dressing is nothing special.Price:The gyro platter is priced around $12. The gyro is less than $10 so the gyro platter is definitely a great deal. The gyro platter also comes with a drink.Location:They are located in the food court in Ala Moana Shopping Center near the bubble drink stand and across from one of the ramen eatery.Overall, I recommend trying this place out if your craving for a gyro or just something different than your normal food court foods."], ["Michael G.", "Went here earlier today for a quick snack before heading back to the office. Ordered the platter. Was not pleased at all. The dressing was utterly disgusting, it tasted like someone just blended cafeteria dressing with grass that came from the bus stop right outside.  Not to mention the overweight sweaty cook who was wiping his sweat with his hands and then making everyone's food with an very unpleasant attitude. Seriously, everyone can see you. All in all, the food was disgusting.  Service was so so, the cashier was very polite.not coming here again. I hope françois can improve this business, I'd hate to see it close down especially since the new health regulation placards being put in place ."], ["Ivy Lou H.", "Two stars may be a little undeserved considering its a Food Court after all. But mediocre good and usually sloppy teenage service is what it is; barely tolerable and that's really all you can say about The Fat Greek. I've eaten here 5-6 times because I love Gyros and am hoping it will get better but it's still just mediocre."], ["Julie D.", "Popped my Greek food cherry here. Located in the food court of Ala Moana Shopping Center. Tried the beef and lamb gyro with a side of Greek salad and spicy sauce. It was decently good and healthy but they were pretty pricey for a small size gyro.  I'll probably be back to try other things on the menu."], ["Kathy M.", "Mediocre food.In addition, what I signed to be approximately a $25 charge to my card was changed to a $50 charge. I called to discuss this with a supervisor, and the employee told me they would get back to me. They never did. I have reported this company to the BBB and am disputing the charge on my card considering this subpar restaurant refuses to handle this professionally.To the managers: what kind of business are you running? You have a fraudulent charge and you ignore it. Unbelievable."], ["Maria C.", "Terribly slow. Waited half an hour for \"fast food.\" Workers looked stoned, customers pissed. French fries were cold, hummus was old and dry. Didn't know hummus could be dry did ya? Neither did I. Gyro was ok, but hardly made up for everything else. Too bad, because I had heard so many good things. Very disappointing. Cannot recommend to even my enemies."], ["Franky F.", "This place never lets me down! Had their gyros combo with hummus and salad today! Their hummus is so good it addicting, especially with that hot sauce! It's a surprise to find such good quality grub in a food court. I've had the falafel here before in the past but it wasn't  great because they cooked it on a grill. Now they have a deep fryer and can cook it the traditional way, so I suggested it to my girlfriend that's vegetarian. She said it was the best falafel she has ever had. I'm obsessed with this place! I highly suggest anyone stopping by the mall to try it out, you won't be disappointed."], ["Dee F.", "When I got a hankering for some Greek food and in in the area,  I stop by and get my hummus on! I've always had great food from this location.  They used to be a but slow but today I think The Flash was working (who knows he may be Greek)! I fit my gyro combo in less little over 5 minutes as there were 3 other people ahead of me.  Staff was super friendly and cheerful and the food absolutely delish! My tummy is happy!"], ["Sheryl L.", "Had the gyro special with lamb and beef. It also came with salad topped with feta cheese. Service was mediocre and a little slow. The tsaziki sauce was only okay, but the gyro still tasted good. I notice that the sauce is really important in the gyro, and I actually prefer another establishments better. It's just personal preference."], ["Ashley C.", "The gyros are amazing. You can see them being made fresh and you get the same amount of meat every time because they weigh it. One of my favorite stops in the food court."], ["Lynne H.", "I love falafels so I was really happy to see The Fat Greek kiosk in the food court.  I ordered the falafel gyro which was $6.95, and the guy at the counter made it a point to say it would take 8 minutes. I guess they have it  down to an art.  The gyro comes with tahini sauce on it and a small (tiny) cup of hot sauce.  I ordered the tzatziki sauce on the side for $1.50.  As I was watching them cook the falafel on the grill I saw them smash it down which is a good thing because it makes the gyro easier to eat.  It comes with hummus, lettuce and tomatoes. The gyro was good, but  not great because the tahini sauce was too salty for my taste.  So I tried putting some tzatziki on it, and that was super salty.  I like tzatziki so it would have been totally worth the $1.50 if it weren't so salty.  Not sure what was up with all the salt in the sauces that day. The hot sauce was good!I would definitely go back to try the falafel again.......this time without the tahini sauce."], ["Yuri M.", "I love this place! I know its probably not the best ever but I am always down to eat here!"], ["Lisa A.", "Ive eaten at 2 of their locations and both times the food was fresh tasting and excellent. Loved the Greek salad. Everything tasted good, service was fine. Prices are very reasonable. Hard to find different types of good ethnic food in hawaii but this place is a welcome change."], ["Stefannye S.", "The food is pretty good. I work at the mall and often go for the beef and lamb gyro. The only complaint I have is that the service isn't that great. One guy is really nice at first but when I pull my card or to pay his tone changes and seems irritated. I don't always have cash on me, so sue me. Also, I try to go during off times so I don't have to wait and every tinge I've gone when there's no line, I watch the chef doing prep work and continue to do prep work for another five minutes instead of quickly throwing my gyro together. It feels like they're making me wait just to make wait."], ["Christine K.", "Not bad for fast food. Falafel was tasty."], ["Chi W.", "Love the falafel gyros!Falafel gyro + side salad $8.99Fried falafel balls made from a blend of spiced fava beans, chic peas & authentic Mediterranean spices. Folded in pita bread with lettuce, tomatoes, onions, hummus & Tahini sauce.I've tried the Falafel King and Shaloha, but I prefer the falafels here because they're softer, lighter, and tastier!"], ["Jared W.", "I ate here twice and I have to say it's awesome!~ Food ~* Beef & Lamb (yelp.com/user_local_phot…)There is some vegetables in there with the beef and lamb, and it is delicious.  It must be that sauce they put in there!~ Service ~ * Pretty good.  The girl who takes your order seems to be hanging out in a good mood.  Ordering there was overall a good experience~ The wait.... ~* You have to wait couple minutes for them to make the food. Maybe it's more then a couple.  Bring some friends to keep you occupied!~ Price ~The price is on par with most of the food court.  I think it was $9 with the drink.I will be going back!"], ["Kayla A.", "What I love most about The Fat Greek are their gyro plates! This review is mainly for the gyro plates. You can get a gyro wrap/sandwich, hummus with pita bread, a salad, and a drink all for about $13! I say this is a really good deal because greek food can get a bit pricey and for a full meal... you can't go wrong with that. The portion sizes of the platters are really good. The pita bread comes pre-cut into triangles and you get a good amount of them. The Ala Moana location is conveniently located in the center of the food court in one of those food hut/kiosk looking things. The wait is normally not too bad.. I haven't waited more than 5-10 minutes for my food.Overall, I definitely recommend The Fat Greek if you're craving Greek food and you want a good deal for a full meal!"], ["Tina S.", "This location is in the food court at Ala Moana Center. It has a smaller menu than the full-scale restaurant in Kaimuki, but it'll do. The kiosk portions and prices are also smaller than the restaurant. The server informed me that they don't always have all the items listed on the menu, and the selection is dependent upon their shipments.I had the vegetarian gyro, which was good. It was made with hummus, lettuce, tomato, and cucumber. The hot sauce provided on the side is a nice addition. I also had an order of dolmas, which are grape leaves stuffed with rice and herbs. It has a heavy dill (pickle-y) flavor. This was my first time trying Fat Greek's dolmas, and it was just okay. I definitely prefer Olive Tree's dolmas.   It's nice to have a Greek option at the mall, but I wouldn't get this all the time when Paradise Cafe and Poi Bowl are just a few steps away."], ["Crissy K.", "Despite the wide range of cuisines that are served at Ala Moana Shopping Center, this is the only Greek you're gonna get. It's not the best in the world, but it IS in a food court, after all.The gyro meat is tasty without being overly salty and makes a nice complement to the other ingredients in the aptly named Gyro Salad. This is pretty much what I get every time I go here. I've also tried the mussels, but they were pricey and not spectacular, so I wouldn't get those again.The level of service here varies: Some employees are really, really nice, and others can be described as brusque -- on a good day. Once, a guy gave my gyro salad away to a girl who ordered way after I did, but who was dressed in a way that would probably not please her parents. Whatever. At least they usually work pretty quickly and get your food to you in a timely manner.As others have pointed out, prices are not great, but they're pretty much on par with what you'd expect at Makai Market. A good go-to place when you're on sensory overload here and aren't sure where else you'd get something safe and satisfying."], ["Jenn Y.", "Came here today because I was feeling Greek.  We decided to come to this location thinking it would not be too busy plus I was starving/hungry.It is nice it is in Ala Moana.  I did not even know it was here till a friend told me.  There was like 4 servers here.  Lots of people ordering so I was assuming it was good.  They have big bright colorful menu and pictures so it made it easy to order so you know what to expect.We tried to order beef and lamb gyro but the cashier said it was a 15-25 minute wait so we got 2 chickens with greek salad, and 2 baklava.  Waiting for our food took about the same.  The combo plate with gyro and greek sald was pricey at $12.  I figure right now, should be filling, I hope.  I thought maybe if it was not enough since this place was located in the Ala Moana food court, we could get more food.  I was getting inpatient, but finally it was ready.  I guess it took so long because someone before us ordered 4 plates, but really there was 4 servers what were they doing?  By the time I got my food, my inpatientness was good and I was satisfied.  The food was very yummy.  Hot sauce was ok, but not too hot.  I put it over my salad.  Did not care for olives in my salad, that is just me... I know crazy.  I never use to care for feta cheese too be honest, but I like it now.  They put hummus in the salad with pita bread so that was good and made me full fast."], ["Trent U.", "The service was great.  The employees were very friendly.  I only ordered baklava and it was only ok.  It was obviously not made by them and was ordered in.  You could go to Foodland and get it for less than $3 a piece.  Won't be back for the baklava, but their other menu items looked ver inciting.  I'll definitely be back to try their falafel!"], ["Jayson D.", "Lunched here just today--this is the location in the Ala Moana food court...Had the gyro platter: gyro, Greek salad, hummus, and some warmed pita for dipping into the hummus. Everything had decent taste to it, and I think that surprised me given I was basically ingesting fast food. The lamb/beef gyro was spiced well, the salad had a zingy dressing, and I was impressed to see that I indeed did have enough pita to balance the serving of hummus I was given. Throw in in a drink and the whole thing came to a little over $13. Not the price I'd want to pay for lunch everyday, but then everything in the food court here is overpriced. So I really can't single out the Fat Greek. I got my food quickly, the young females working the counter were friendly enough, and I left full. Not much more I could expect. I wouldn't be afraid to head back here.  :)"], ["Ben P.", "The Fat Greek is a dope little spot close to UH campus so it is easily accessible and for the price and quality of food is definitely a deal. BYOB, simple for a date or just cruising with friends. The gyro is a must, and the Greek Salad/Pita Bread & Hummas is a close second. Must try when in the area or ala moana mall!"], ["Lauren H.", "Overpriced. For $12 I got a lamb and beef gyro, side of salad, and a diet coke. The drink is not included in the combo (gyro + salad). For this Greek fast-food quality, I prefer Leo's Taverna (both Bishop St. and Donki locations) over this.TFG also tried to rip me off by asking me if I wanted extra tzatziki without mentioning that it would cost a dollar more. Thank goodness I had the wits about me to ask if it was extra. And then they forgot my soda, so I had to remind them! And when they rushed my soda, the outside was covered with a film of grease! Disgusting!Also, they gave me someone else's order because they screwed up and made two of the order of some guy before me. Who knows how long ago that order was placed and how long the gyro was sitting there! I was wondering how they instantly had my order ready when there was a handful of people before me that were waiting quite long for their orders.Boo. Two thumbs down."], ["Mel G.", "While yes its pricey and its always busy, the food is worth it.  Staff is friendly and food comes out quick and delicious.  Make sure you get the lamb gyro.  So good!  Can't go wrong here and much better choice than a lot of what else is in the Ala Moana food court!"], ["Natalie K.", "A little kiosk in the huge shopping center- I had a falafel salad and was told by a very nice worker that it would take 5-7 minutes because they make the falafel (on a griddle, not fried) to order, which was good news for me.For fast food, I think it's pretty great.  The salad was large and included iceberg lettuce, red cabbage, and was topped with tomato, cucumber, white onion, and a little feta cheese.  The falafel (3) was served on the side and drizzled with a creamy sauce.  $8.99, but it was big and tasty.  When I'm in the mall and craving Mediterranean, I'll revisit for sure."], ["Lofa L.", "I have to say that I really like this place. I just want a good gyro, some soft pita, and sauce for days. Fat Greek kiosk gave me just that. Don't get me wrong I love gyros but the semi-chang person I am had to weigh the options of buying gyros from here or plate lunches or ramen from Goma Iichi. I decided that I would no longer order gyoza and buy gyros instead. Maybe it will go good with my tantan ramen? Fat Greek makes a good gyro. Wait wasn't that long but by the time I actually found a table my food was good to go. I would have to wait either way. The pitas are win and I love their hot sauce too.  Will be back for sure. I hardly go to Ala Moana but this will be well worth it."], ["Ketura R.", "First off, let me just say I LOVE Greek food! But finding a really good place in Hawaii seems to be impossible especially living on the west side. The gyros are so good and even better with their hot sauce. I went there for lunch one day during lent thinking I wasn't going to find anything to eat in the food court that had no meat. To my surprise, the vegeterian gyro was just as good as their meat ones. The vegeterian gyro was smothered with their hummus... which to me is the best hummus on this island. If you can prove me wrong, please let me know! I was a little bummed when I ordered the spinch and cheese spanakopita and they were out of it. Apparently it's one of their best sellers and I had missed out on it that day. One day I will venture out to their Waialae location but for now I am satisfied with getting my fix at their Ala Moana food court location."]], "Mr Gyros": [["K B.", "This is, hands down,  the best gyro I've had from a food cart.  I was pretty impressed with how incredibly fresh the lettuce and tomatoes were. In fairness,  I did not sample the pita bread, but how easy is it to mess that up? If you like gyros and you find yourself near here,  it is worth the stop."], ["Dave K.", "been here a couple times, had a wrap type sandwich both times with varying meats (sorry cant recall exactly what it was) either way,FOOD IS AMAZING AND PRICE WAS NOT BAD AT ALLi really have nothing else to say. Other than I will be back."], ["Paul R.", "I had mixed feelings about this place. I ordered the beef and lamb gyro. What I did love about it was the amount of meat that is given.. It was awesome!!! I'm a big meat eater, so it got me excited.. But the flavor didn't do it for me.. It was too much flavor, if there is such a thing.. The spice or whatever they put on it was just overpowering and it did not appeal to me.. It made me thing of how smokers will put extra seasoning on things so they can actually taste it.. And I also ordered a side of hummus because I love to put inside the gyro, but then he pulled out this little pre-made cup of hummus.. It was cold, and not hard, but not as smooth as I like my hummus. And this lacked flavor i thought.. All in all a decent place. If i was in the area again, I might try it, but I don't think I would recommend it. Also, the location changed so it was difficult to find. It is now located in the Navy Exchange. One kiosk is inside upstairs and another out front of the grocery store."], ["Cubby T.", "Very good gyros and fresh tomatoes, onions and lettuce. I'll be back soon :)I had a hard time finding this place because they moved to this address:Moanalua Shopping CenterWarden AveHonolulu"], ["R B.", "It's ok. I got a chicken gyro and wasn't overly impressed. There wasn't a lot of tzatziki sauce and the chicken was subpar.  Probably would not eat here again."], ["LaurenMarie V.", "Based on the fact there isn't much Mediterranean food to chose from in Honolulu, Mr Gyros is delicious. Their staff is ALWAYS soooo nice!!! I'm not crazy about spicy food myself, but I hear that their spicy tzatziki sauce is to die for."], ["Manda S.", "Wilty lettuce in my salad, wilty lettuce in my gyro. :(- There are two locations at the NEX: one outside and one upstairs in the food court.  Wilty lettuce came from the stand outside.  I'm wondering if the Food Court stand is better because its cooler in there?  - Also regarding the outside stand: if he's not there, it's because he's delivering the meat to the upstairs stand.  I guess all the meat is cooked outside.  He should be back...relatively soon.  I waited about 3 minutes or so.  (He was a nice guy, apologized and hoped I wasn't waiting too long)- Don't bother with the salad--Wilty Wilty lettuce!  The single tomato wedge and the three cucumber slices were fresh, at least.  Oh, and I think there was an olive.  A mini mini mini olive.- The gyro was much better.  Ira J. is right--the food is prepared super quick but its kind of messy.  The kid behind the counter was generous with the meat portions so at least you'll be getting a good bang for your $6.75.  Once I picked out the wilty bits, the taste was okay.  Decent, definitely familiar Greek, but nothing special.  The bright side was that I was pleasantly full afterwards!I'm super hesitant to say I'd come back here!  I was so excited when the counter guy came back from delivering the meat--he was wearing a Kronos shirt and hat, which reminded me of all the Kronos signs at Leo's Taverna Express.  Total mis-association.  Overall, I'd say Mr. Gyros is just okay, as long as you keep your expectations in check. :("], ["Ira J.", "I don't expect 5-star service at a glorified food cart like Mr. Gyros.  I also don't expect the kid behind the counter to slap my order together like he was playing some sort of Greek culinary version of Beat the Clock!  I mean, dude, the lunch rush is over.  It's just you and me.  Slow down a little, and maybe I won't need an entire loaf of napkins to clean up after my Gyros.It was messy.  It tasted okay.  And at $6.75, I couldn't call it a value.  Overall, I'd say that the next time I'm at the NEX food court, I'll most likely chose one of the other glorified food carts over Mr. Gyros."], ["Jane L.", "The guy working at the little cart was really friendly.  Service was pretty quick.  I ordered the Beef & Lamb Gyro and it was sooooooo good I have never had one before.  It was a total with tax $7.07, I told myself this better be damn good for this price or else I'm going to be pretty pissed off.  Lo and behold it was worth every penny.  I would definitely go here again because of the polite, quick service and yummy food."], ["Brandon T.", "Place is the shit. Food is super good . Workers can tend do disappear but not there fault as it runs on only one worker. Food is awesome, best to go during busy times cause you'll more likely get fresher meat but longer waits.  The owner is the coolest guy, he would give the shirt of his back to any stranger he that nice."], ["Thomas O.", "Just had the best lunch at work to-date at this place. I ordered a beef and lamb gyro and an AriZona half & half and let me tell you, that hit the spot. Who cares if this was thesecond time I had Greek food this week? It was most delicious thank you. The meat melts in your mouth with the added crunchof romaine, tomato and onion topped with coolGreek cucumber yogurt dressing. Broke da mout so much, I'm gonna need surgery to fix it for dinner. I'm so full, my coworkers are worried I might need a Dollie to get to my car."], ["Cheryl K.", "Because we normally go to grab greek food in town at the Fat Greek or Greek Marina all the way in Hawaii Kai, Mr. Gyros is a godsend if we are too lazy to travel across the island. My husband used to go to the NEX foodcourt during work for lunch so he suggested Mr. Gyros for our greek fix. So we both order a gyro with beef and lamb and grab a bottled drink. All for about 16 bucks. Prices are okay here. For goodness sake, its a vending cart. Anyways, the gyros were pretty darn good. I love their tzatziki sauce as it was drenched throughout my gyro. I was actually craving to eat hummus but maybe at a later time since that size was about a $1.25 (around that price I think for all the sides). But overall pretty good food. If you are with someone not craving gyros, there are also tons of choices in the food court around it. Anyways, I dig having some greek on this side of the island."], ["Daniel R.", "The different middle eastern/Greek places that I've been to are way better than this. This place is fast food for beef and lamb. The fake meat they use and the store bought Pita bread is not the best tasting. its one of the less tasty treats on this side of the island in my opinion when it comes to that type of food. They don't even include hummus as a side. That's like buying a plate lunch and it comes with no rice."], ["ilovefoo d.", "there is a severe lacking of greek food on this side of the island so this is as good as it gets. when i want my greek i come here. they give generous portions of meat, the veggies are always fresh and crispy, and the service is great. i usually get the beef and lamb salad or the beef and lamb gyro. both are delish, and i love their tzatziki sauce too. they have a secret spicy sauce too (they wont tell you about it) but if you ask for it, it's pretty damn spicy so unless you can handle it you may want to pass."]], "Waikiki Trade Center": [], "SHALOHA": [], "Da Spot": [["Kristen K.", "5 stars for the Moroccan chicken and their awesome selection of smoothies!!!!! Plus, SUPER reasonable pricing. Very hard to find parking in that area, but the smoothies are worth it!!"], ["Tellia W.", "I always liked eating here, but I think last night will be my last time. I ordered the Thai chicken and my friend ordered the Moroccan chicken. She said it was as tough as leather and extremely salty, so I tried it and it was. Almost unbearable. On top of that my salad had about 6 small leaves in it, almost nothing there. And my chicken wasn't great. The worst is that I felt like there was a rock in my gut all night and now I feel really nauseous. Not good! I don't know what happened to this place, but it is not the quality that it used to be. I hope da spot gets back on top of da quality of da food."], ["Britnie R.", "Been here on two occassions. Overall the places smells and looks a lot better than it actually tastes which is a big disappointment to my search for decent Italian and Mediterranean food on this island.I tried the falafel and hummus.And the chicken parmesan with a Amazon wave smoothie.The food was mediocre would not return. And the smoothie was amazing.I gave it three stars for atmosphere and they did have live music the first night."], ["Malia H.", "I always see this place at Farmers Markets and wanted to try it. It's located right across the big baseball field. There's no parking so you have to just look for street parking. It's a huge space and sometimes I think they have live bands play here.The service was ok, I told the girl it was my first time so I wasn't sure how to order or anything and she just looked at me and reluctantly told me about their plates. They have a cafeteria style ordering system and serve Middle Eastern/Indian food. You can order a mini, regular or double entree plate that comes with rice and tossed salad. I will say make sure you get their saffron rice. You can upgrade your salad to one of their daily special salads. The plates are reasonable for $6-$12. They also have a regular menus with wraps and sandwiches. They also serve smoothies and you can create your own. I didn't know what their specialities were so maybe I didn't choose well. I had their garlic butter roasted chicken and Thai red chicken curry. The food was ok but was a bit greasy. It's supposed to be healthy but I'm not sure. I did enjoy the saffron rice. I guess I should see what they're known for and give them another try. It's worth checking out."], ["Amy M.", "I had a good workout, and so I decided to reward myself by going to da spot. After reading much raving reviews, and salivating over the pictures today was the day. As I entered I witnessed a huge open area with tables and chairs. Great for people watching:) I walked in a little further to where the food was.   It was not crowded at all around 6:30pm. The employees were polite and helpful. I was planning on ordering a mini plate and ended up with a combo;).     One of my choices was the morrocan chicken a popular favorite. It was honey, caramelized, cinnamon, based, roasted with almonds and cranberries. My second option was the lemon, herb and coconut chicken. For my starch it was saffron rice which came with a salad.     I can see why the morrocan chicken is a favorite. It was tender and sweet. The sauce mixed into the rice was absolutely wonderful. I did not want that feeling to end. Now for the coconut chicken I can't say I feel the same. I barely tasted any herbs or lemon. The coconut was really light almost bland. But, the chicken melted in my mouth like butter. It would've been perfect if I had tasted those flavors.     I will be back to try more of their exotic food options along with their sides!!"], ["Kris B.", "Okay, straight to business - docked a star for the following things: 1) street parking sucks sometimes bc there are a number of good restaurants nearby, 2) no AC so you hotheads out there might not appreciate that, and 3) sometimes they have live music which is awesome and cool but honestly it is ridiculously loud and makes enjoying company near impossible.Now, the food and service are still worth 4 stars! Get a combo plate and coordinate with a friend to try as many dishes as possible. They offer different kinds of rice, and the entrees change pretty much every day. Entrees include vegetarian dishes and offer all kinds of meat (though primarily chicken). The entrees also range in culture, I've seen anything from Egyptian and Moroccan chicken plates to good old Honey BBQ and dishes including Thai curry to Eggplant Parmesan. I'd recommend any one. Everything here is so full of flavor - even the rice has its own special flavor, for crying out loud.Also smoothies - I like mine on the creamier rather than tart/fruity side so anything with soy milk here is great to me."], ["Molly B.", "Perfect place for a quick lunch or a life changing acai bowl. It's like a cafeteria with a huge entry way without doors so people are in and out all the time but service is fast and friendly. THE Acai Bowl: I realize it's unfair to rate something so high when it's the first time I've ever eaten it but I'm going with it. I can't stop thinking about it, talking about it, I think I have a crush.  On a food.  From what I've seen it's also the best priced one on the island. Also, the size is humongous, definitely shareable, if you're even willing to be that nice. I've also had one of the Moroccan chicken plates. The flavor was powerful and on point! I want to try everything here! There a big assortment of dishes, sides, and smoothies galore - seems relatively healthy. There's something for everyone."], ["Mikey H.", "Okay, it's next year...lol!  I was looking around for a place to grab some lunch and was starving.  I was able to score a parking spot which was a good sign.  I ordered a lamb gyros, which took a while since those were cooked to order.  The lamb was tender and flavorful!  It also came with a nice little salad.  Definitely worth coming to.  The workers are still friendly and they all look like they have fun working here.Hit up Da Spot!"], ["Kotsumi S.", "I looooooooooooooooooooooooooooooooved their acai bowl. I'm not saying that they are the best, but you can eat a big bowl of acai with fresh fruits for just $6! I wa so happy when I digged my spoon into the bowl: a lot of coconut flakes were hidden! The staffs were really friendly and they served you fast.I've tried their fresh smoothies too. All of them are really tasty and refreshing; and large in portion for $3.5 (medium size). I just didn't like their smoothies with soy milk. Those are REALLY sweet, that I felt full with just a sip."], ["Violet H.", "Love Da Spot! Great place to take guests and have a leisurely lunch or dinner. We almost always partake of the prepared foods. But be prepared to wait if your order a sandwich or a smoothie (both have gotten high marks from my friends). I love the curries, of which there are usually several choices each day of varying levels of spicyness. There are plenty of meat and vegetarian dishes each day. I get the regular combo with two selections on tossed salad (rice and other side options are available, some cost extra). It's a LOT of food. You won't go away hungry. They manage to sneak in a lot of veggies in their meat curries, which is great. I've tried both the Egyptian and Moroccan chicken. They were fine, but I found them to be rather heavy.Drawbacks: No air conditioning and nearly no parking. Mostly street parking. Warning: Park across the street at Longs at your own risk. You may find yourself with a ticket upon your return.The 1 and 6 buses have stops nearby on King Street.  The A and 4 stop on University and you'll have to walk a bit (about 2 blocks). The restaurant is easily accessible to those who use wheelchairs or scooters."], ["Stephanie L.", "Maybe my favorite place to go when I don't want to cook dinner tonightFOOD:The best food I've ever had from a chaffing dish. I don't know how they get their food so flavorful and still call it healthy! Da Spot serves middle-eastern, thai and fusion style chicken, fish and lamb dishes. They are all wonderful - I've yet to have a bad tasting dish. Some of them can get a little spicy (so you can ask for a sample if you're nervous), but overall they are just jam-packed with flavor and the meat is so tender. They must spend a long time preparing each dish. A mini plate, with rice, an entree and salad, is the perfect dinner when I'm too lazy to cook. For this place to have flavorful entrees, and then offer tasty rice and a fresh salad is awesome. None of the food they offer suffers from lack of attention. From time to time I also like to get a pint of their homemade sorbet or get one of their smoothies. I've also hired Da Spot for catering and event twice before, and they are awesome! They have a great catering menu, and will work with you to make sure they fit your budget for the event.SERVICE & SPACE:Service is really chill and laid back. Mostly college kids that work there and they are really nice and never skimp on the portions The space is really great too. It's so open and there is always plenty of seating. I'm a little shocked this place isn't busier. The line to order is always pretty short and it's cafeteria-style, so you get your food right away. PRICE:AWESOME! A mini-plate is only $6. You will be hard pressed to find a better deal on the island for the amount and quality of food. Seriously, I'm shocked that this place isn't more packed with college students on any given night."], ["Little D.", "DA SPOT @2469 S. KING STREET:Recently I loved their take out experience and came back here a several times.  Interestingly each time the service, potion and quality went down.  I am rating averaging the first great and last meh ok experience.I still think the value is well worth the money I paid.  You get tasty chicken, salad and dessert about $10.00!  I like their dry side baklava. Safran Japanese rice, Coconut Chicken the best, Coconut Fish the second.PS.  A several years ago, when their store was still at the old location, I decided not to return to this store due to an unbelievably ill customer service by the Japanese wife.  She might just had a bad day, caused a few good customer (me+) for a several years."], ["Max A.", "Be aware of Da spot bad service. Went in and server acknowledge customers behind me and just ignored my presence until another customer said that they where not next in line. Server still didn't acknowledge or apologized but just simply treated me like a 3rd class citizen by asking what you want. How rude the only positives for this place is its food. I've been a long time customer but sorry to say I will never spend a dollar again in this establishment due to the poor service."], ["C L.", "Poor quality food. Chicken was rubbery and dried out. Went at 6:30 for dinner and the pan of chicken was near empty. Being that it was still early peak time for dinner, I expected a fresh meal. I'm guessing that chicken has been sitting in the warmer since lunch time. The gravy was super salty as well. I used to love da spot but lately the quality has been terrible."], ["Warren T.", "What amazing food! The selection is out of this world. Mostly meat items but some really good vegetarian options too. I had grape leaves and the Indian dal. Lots of smoothies too. I got some carrot juice. Yum!I will have to come back to try the other items. I highly recommend you try this place!"], ["Helen M.", "Okay, so I'm not swayed by the music or nostolgia of those good ole' college days when this was just a baby food truck.  No, I'm here for the butter rice and absolutely delicious casual Middle Eastern food they serve everyday.The restaurant itself is cafeteria style: place your order and they'll scoop it up right in front of you. A mini plate portion is very generous, but hey, if you can eat the whole thing, go for the larger combo plates.  I've had really great luck with majority of the items I've had from their fish to chicken dishes, so I highly recommend those.  On random days, they have butter rice - I wish I knew what went into this and when they make it, but alas, I do not... I just know it's delicious.  Sorry saffron rice, you come in second place now. There are certain surcharges for food, such as lamb plates or upgrading from your romaine salad to something else.  While I can't say if the lamb is worth the upgrade as I've never tried it, I can definitely recommend the salad upgrade. I always try to get their quinoa salad and/or olives, which I love.From my experience, the people working here are very friendly, helpful when asked for recommendations or suggestions, and pretty quick with service.  Their healthy drinks aren't bad either, but it doesn't compare to their plate lunches.Super chill atmosphere and very quick, the food is totally worth it for the price you're paying."], ["Lana P.", "I used to love this place when it first opened. However, after getting horrible service and attitudes from all the girls who work there (the guys are usually friendlier) and almost threw up after eating one of their dishes with chicken in it.. I don't think I'll ever come back. I have never tasted chicken so rubbery. I opened it up and it looked slightly pink as well. I tried eating the other pieces of chicken, hoping that the other ones were fine, but they all tasted and looked questionable. I had to throw the whole thing away after two bites. BUT I will add that their red snapper and dishes with fish in it are usually better, and taste fresher. And this is why I gave them 2 stars instead of one. Beware of their chicken.."], ["Jasten M.", "[When i'm lucky]: They serve Moroccan chicken. They serve Egyptian chicken. They often serve eggplant parmesan. There are smoothies too. It's all superb.  I usually order the small plate. It really is da spot. That is all."], ["Larlar S.", "I am local and sometimes I get bashful when I say the name of this restaurant.  I just cannot speak pidgin.  I am not bashful, however, to stuff my face at DA Spot.  The food here is amazing.  All the entrees are extremely delicious, fresh, and healthy.  I usually get the mini, and for less than $7, I get two scoops of rice (brown or saffron), an entree, and a refreshing side salad.  I always feel so good after I eat here!  Lately, I have been trying to be more conscious of what I eat (because you are what you eat) and this place makes me feel guilt free!.....unless I tank one of their delicious smoothies in addition to my meal.  I looooooove their peanut BUTTAH smoothie!  During the summer, I would crave this creamy peanut butter banana concoction every day.  Broke. da. mouth. They also offer refreshing sorbet in various flavors and pretty colors! If I was forced to say one downside about the food here, it would be that a lot of their entrees taste the SAME.  The curries, the Egyptian chicken, Moroccan chicken...  It is as if Da Spot is messing with us and putting different labels on the same dish.  I am kidding, but my taste buds do forget how to distinguish many of the entrees apart.  However, at the same time, I guess you also cannot go wrong if you order any of those dishes because they are all very tasty.Oh yeah...da parking sucks.  I sometimes have to be a rebel and steal a parking space at Longs across the street when I am desperate. Bottom line: This place hits Da Spot."], ["Amy Y.", "Bookmarked it for months and finally I'm here?! Why didn't I try here sooner?! It's a healthy food place, didn't know it was Mediterranean style. I came with a friend on a Friday night for dinner. The line wasn't too long. The menu was big. This is a order and seat yourself place. I was eyeing the smoothie menu. 30 something flavored smoothie...gosh, it looks so good. I ordered the Egyptian chicken with brown rice and salad with papaya dressing. Also got the #25 Amazon Wave smoothie: haupia and acai sorbet, soy milk, mixed berries and strawberry. The chicken sauce was kind of salty but good. Chicken was soft and tender. My friend said the dressing doesn't taste papaya-ish, more like a thousand island flavor. It doesn't really bother me. I absolutely love the smoothie! I can taste the soy milk with berry fruits. I love soy milk!I want to come back to try the acai bowls."]], "Sarentos Top of the Ilikai": [["Dave M.", "Ask to be seated in Alan's section. My wife and I went here for our dinner a few nights ago. We are staying at the hotel so looked for something close and a little fancy. We were seated with no reservation almost immediately and the overall service of the whole meal was amazing. We each had the filet along with some wine pairings and appetizers. The ahi bruschetta was amazing. Alan's service is what made our stay much better. He held conversation with us and gave us honest opinions of our food choices along with the perfect pairing choices. He made us feel very welcome and relaxed.Live music almost every night. Jazz band on Wednesdays. Live pianist every other weeknight."], ["Artemis H.", "We actually spent a NYE dinner here once but the menu was specialized for the night so we thought we should return on a normal night and see if it was just as delicious. Needless to say, they fell short, as in way way short of our last spectacular visit. The normal menu is unimaginative at best. The only thing they did right was my negroni cocktail (which was probably one of the best negronis I've ever tried) and sitting us by the main window were we had a fantastically clear view of the Friday night fireworks done by the Hilton Hawaiian Village.Aside from that, eating through their menu was like forking through mud, trying to find good edible bits. They go well on presentation but the food was honestly, just boring tasting. Didn't amaze, which you'd expect for the price. It felt like they were pumping out a template of service as opposed to treating every plate as special. For appetizers, we ordered bocconcini (bufala mozzarella wrapped in speck & grilled over tomato) and roasted portobello bruschetta (marinated portobello mushrooms & artichoke sun-dried tomato puree). I thought the bocconcini sounded great...it just didn't taste all that great...it lacked so much flavour it was so plain..what happened! My partner despised the portobello bruschetta so much he didn't even eat the second slice, and he eats anything.Entree was veal cotolette capricciosa 'durini' (milanese style, roma tomatoes, bufala mozzarella, arugula & spicy orzo) and handmade pasta & filet mignon meatballs (herb tagliatelle, rustic chili pomodoro & parmesan shavings). To be honest, I ordered the pasta because I was curious to see how they were going to murder a top shelf piece of meat and turn it into a mere meatball. Sure enough they delivered on that crime. Filet mignon meatballs my rear end. I thought the pasta would make up for that because I like the tagliatelle style but low and behold it was undercooked. Come on!Desserts was cheesecake, which their daily selection was strawberry (staying in theme with their unimaginative style) and triple layer chocolate cake (oreo cookie mascarpone & brandy chocolate glaze). My partner loved the chocolate cake, apparently this was evenly well done. The service was attentive but a restaurant isn't all about service, especially when they class themselves as fine dining. Makes me wonder if the service and presentation was simply a mask to cover the bland food. Either way, I'm pretty certain we won't be coming back."], ["Kristen M.", "Great service - very boring food.  Uninspired.  For an Italian restaurant to have awful bread is criminal.  The bread was awful.The fish from the seafood plate didn't taste fresh to me.  I am very picky about fish and seafood though, so keep that in mind.  I ordered the chicken penne with vodka sauce.  It wasn't vodka sauce, it was pomodoro and it was startlingly boring.  The chicken was very dry, which is almost unforgivable considering that it was in a sauce.  I think there was some sausage in the dish too.  My husband had the filet and it was ok.  We had the volcano cake and loved it.  But I am not sure if our enthusiasm stemmed from disappointment with the rest of the meal, or if it really was good.The view was awesome. The staff were exceptionally attentive, and the restaurant was clean.  I can't bring myself to give two stars but it's a very close call."], ["Abby S.", "Come for a drink and small plate during happy hour. 40% off your food purchase (one item) if you order a cocktail. Not a bad deal.Sarentos has a lovely view of downtown Honolulu, where you can see skyscrapers and the ocean together. And there's air conditioning, which is much-needed on a hot summer day. This is the type of place where you order a lemon drop or dirty martini and take in the scenery. On this particular visit, we got to watch the sun set and chat with a group of friends. I can only imagine what it's like after the sun goes down and the piano player gets started. Classy, indeed.With the happy hour special, drinks and food are incredibly affordable. Bartender was a little off, but the rest of the staff were very nice and welcoming. Just as one might suspect at a Hawaiian hotel. A-OK for a start to your evening."], ["Sasha S.", "Went there for dinner in April 2015.  Have to say, the manager on duty was unbelievably arrogant & abrasive.  The place was practically empty and he was not comfortable with allowing us to chose our own table. He sat us in the back of the restaurant near the kitchen!   When we asked to be move to another table with a harbor view or city view, he simply refused.  He did not provide an explanation nor an apology.  We got stuck looking at another hotel all through a very expensive/over price dinner.Definitely will not be coming back.  It's unfortunate because this place does have potential otherwise."], ["Lance M.", "This will be my review of \"Sarentos Top of the Ilikai.\" I see a lot of mixed reviews, but personally my experience was lovely.-Parking: There is parking behind the building I believe for fairly cheap. I think it was a dollar (or maybe less). I chose valet this time because it was raining and with validation it came out to 5 dollars which is cheap considering its in Waikiki.-Atmosphere: You take an elevator from the hotel lobby to the top and the view was breath taking. The lights turn off and the open glass view showed quite a lovely view. The restaurant was gorgeous and definitely shouted fine dining as you look around. The views are definitely what set the mood for the night!-Drinks: I did have a bottle of wine, but it turned out to be fairly pricey. The half bottle prices and cocktail menu seemed to be upped a little but its Waikiki. The clientele is most likely your upscale diners. But, you don't go to somewhere like this solely for just drinks, or you can just sit in the bar area.-Food: The food was the absolute best part. The fresh focaccia bread with a mango/lilikoi butter I believe was light and vibrant. It had just the right amount of sweetness, and it wasn't heavy at all but very light in fact. We then proceeded to the appetizers where we ordered 2 oysters which were fanny bay that night I think. The Lilikoi mignonette paired well with the ahi tartare and truffle oil, it made the oysters delicious. We had a shrimp cocktail as well, and I can't ever say no to a horseradish sauce! We also had the Osso Bucco potstickers with a gremolata and orange saffron vinagrette. I've never had something quite like this before. The crispness of the potstickers was just right and with the Osso Bucco against the sweetness of the orange saffron sauce made it just delicious. The Caesar salad came on the whole head which is looking to be the norm lately for fine dining. The flavor was there but, cutting a salad with a steak knife just seems weird to me honestly. It seems like a bit too much work for just a salad, though presentation made it look nice. Finally, the star of the night which was the veal! It was nice and had a crisp and outer edge which had a nice a spicy flavor to it. The balsamic reduction on top of the arugula and the bufala mozzarella cheese paired with the veal was delicious! It all came together perfectly. Overall my experience has been a pleasant experience. The prices are a bit much for me being just the normal local folk. But, for special occasions, or dates I'll definitely put this up there for consideration! This won't be my last time here!"], ["Jennie M.", "So apparently Sarentos has been around for years, and according to our waiter, they are really pulling up their socks (culinary wise) as of late. With a vast and unobstructed view of the Pacific Ocean that is simply stunning, this is now my go-to Italian restaurant in Waikiki. Located on the very top floor of the Ilikai, this Italian eatery is the perfect spot for a romantic meal. To start I had the Pacific Oysters accompanied by Lilikoi mignonette, ahi tartare and a white truffle oil. The oysters were from off the coast of British Columbia, and they were fresh, plump, super tasty and overall, simply outstanding! Then on to the main: I very rarely order spaghetti and meatballs. Why you ask? Because I really, really love a really good, high-end spaghetti and meatballs dish. And too often I am disappointed. Not here, the filet mignon meatballs were incredible! Dear lord in heaven, these could be the best meatballs I have ever had! Wowza! And all on top of perfectly al dente spaghettini with a fresh pomodoro sauce, and healthy amount of pecorino-romano. Bellisima!"], ["Jaime M.", "One of the best restaurant views I have ever seen!  We had an excellent table looking out over the evening sunset.  The waiter was fantastic!  I had the pasta with filet meatballs and the amount was so huge I could barely finish it.  They had a great cocktail and wine list to choose off of.  I didn't care for my gin martini so the waiter replaced it without charge with a glass of wine.  I would definitely recommend this restaurant to anyone looking for a nice place to have dinner overlooking Waikiki."], ["Sherylynn S.", "I went there on my first date and it was a real incredible experience.  As we walked in from the valet area, it is like an entrance to the hotel but they have an elevator that takes us up to the top.  An elevator ride were really awesome with a nice harbor view.  We have a reserved table with the best city view on the other side.  It was a very quiet environment and the light were dimmed like romantic light.  The service were very well and making sure we are well taken care of.  We feel like a king and a queen.  Wine were so smooth and delicious.  Food was really pricey but worth to eat on a special night . Thank you all for making our night very special and will never forget this night. Parking is available but I suggested Valet parking."], ["Bombiz V.", "Last night are with my wife thinking that we were going to enjoy a great dinner.my wife ordered the chicken and I ordered the lobster paella. This dish had no flavor had to add salt to give it a bump. I never add salt to anything I order at a restaurant. Waist of money."], ["Mimoza M.", "I love this place for the views of the sunset ...but you need to book a table as its busy and popular . The food was small servings but very tasty and delicious . My cocktail was good and the wine list was overpriced but Interesting selection of wine from US , Italy and even New Zealand which was really nice surprise . The only downside of our amazing experience was the fact that the air condition failed and was very hot and stuffy . We were bathing in sweat as guilty of crime :-) Oh yes and the manager was dressed very well ...credits to him :-)"], ["Dawn A.", "My husband and I went to Sarentos for our night dinner in Hawaii! And I'm sure glad we did. We made sure to go right when the sun was setting, as Sarentos is on the top floor of the Ilikai, the perfect location to see a great view of the city and harbor area. We had be eye-balling their menu which was located outside of our hotel room all week and we knew we had to try out their cuisine. Unfortunately, at the time the glass elevator that goes straight to the restaurant was under going maintenance, and we didn't get to use it...but it was beautiful view once at the top.Although we didn't have a reservation, we decided to sit at the bar, which has the perfect round-about-view of the city scape, as well as, the sunset over the water. We each ordered a speciality mixed cocktail, just in time for happy hour. And for our meal we ordered a few small plates options, as we really wanted to try a few different things: the filet mignon meatball slider, calamari and osso bucco potstickers.  Each plate was better than the last. Keep in mind that the prices of the food can be a bit pricey, but it's higher quality food and the ambience you can't beat.All in all, I would love to dine here again in the future."], ["Shay F.", "I've been to Sarentos before and thought it was just ok, but I just went again the  other day and oh my, I'm very impressed. The food, the service, and the view (we went during the Friday fireworks) was all awesome. I guess it helps when I go into a place with low expectations. Anyways, I'm picky with my food and couldn't really find anything on the menu that I wanted. It wasn't a problem here. The waiter asked me what I wanted. I said I just want a simple veggie pasta. The waiter said it shouldn't be a problem and BAM I got what I wanted. Something that wasn't even on the menu. Impressive. The service was good too. Our server was quite cheerful and for our dessert, the one with the flames and strawberries, he made art work on our plates! I thought it was so cool! A very nice touch. And of course, we planned to go during the Friday fireworks. Oh my, what a sight! Totally loved it. Yes, it can be a bit $$$, but totally worth it."], ["Rob S.", "I got their specialty veal shank. It was so greasy. My mom got the veal. Also really greasy. It is very expensive $160.00 for greasy very soggy  rice pilaf. Fish over-cooked. Very bad food for an expensive price."], ["Dennis C.", "I haven't been here in like ages and i have to say the view is amazing.  Having to ride the elevator up directly up to the restaurant is a plus.  We arrived early but they were able to take us in.  Seated with a view facing ala moana beach, i felt like we were isolated from everyone else but i guess its part of the experience.  Eventually there was a couple seated next to us.  Ordered bartender crafted cocktails on there drinks menu but i wasnt happy with my drink so our waitress was nice enough to get me something of my tasting.  Ordered appetizers and got oysters and escargot.  Oysters were ok but escargot was delicious.  For our dinner, my wife had the porkchops which was delicious.  i had the lobster paella, which had clams,calamari and shrimp, but it wasnt a traditional paella that i was looking forward too.  It was more like wet rice with seafood on top.  It was ok but was looking forward to more traditional.  Desserts on the other hand were pretty good.  We had the tiaramisu which was complimentary since it was our anniversary and we also ordered this chocolate cake with cheesecake.  Not sure if i will be back, too pricey just for an ok meal."], ["Donna L.", "I made dinner reservations for my birthday and requested a table with the harbor view. Once we got to our table we literally got the harbor view. The view was incredible, our reservation time was at 6:15pm so we got to see the sunset and it was so beautiful! And the food was amazing! I highly recommend this place for a special occasion."], ["Nadia K.", "The place is romantic and classic.Our server he's such a sweethearts. Attentive, kind and polite. The appetizer is the best. Had raw oyster and snail with cheese. It's so delicious. The drinks (alcoholic cocktails) it's ok...I am not a fan of it. The seafood pasta that we used to love is not here anymore..so sad....However I we order the fillet mignon, it's tasty. Then my bf had seafood risotto and instead of getting risotto we switch it to the pasta.  The lobster and huge prawn is delicious. Since its my bday we got complimentary desserts a slice cake. Then I got to watch this amazing fire show front he server Michael. It's so exciting.....two glass of alcohol pouring into each other and then cinnamon spice o keep the flame huge....I was so happy...it's a nice birthday dinner. We got a $60 groupon and still paying $120+. As you can see its very pricey"], ["Rhonda H.", "We had a very memorable, romantic Anniversary dinner! I had a tough time choosing which restaurant to go to for our wedding anniversary and I'm really happy that I went with Sarentos. We had a beautiful view of the Waikiki coastline lined with the city lights and could see all the way down to where we got married at the Outrigger Canoe club near Diamond Head.Our servers were very professional and really made everything special for us. The food was to die for including the best creme brulee that I've ever had. What an unforgettable experience!"], ["D T.", "Complained about the food. No response. I left a message with the manager 3 times. Not even one response."], ["Raquel T.", "I tried Sarento's again after forgetting about it for a few years.  Despite all the reviews and great view, I still find it forgettable.  Such a great opportunity for quality service and foods, left wanting.I had a multi-course meal, while sitting at the bar area in a booth.  I did enjoy the bread basket but was presented with the meat carpaccio which was thick pieces of meat that were so tough I had to send it back.  I didn't want another appetizer, as nothing interested me on the menu that night, but the server surprised me with the ahi bruschetta.  Much better, but not perfect.  Definitely better than the meat crudo though. My server let me know that the crudo was removed from my bill and apologized for the inedible meat.Next was the house-made pasta and filet meatballs, so covered in goop I had to scrape off the sauce to the side to find the delicate pasta.  What a shame to cover up fresh pasta with so much sauce.  Have they ever been to Italy?  Doubtful, since this is an Italian-American dish, in Italy meatballs are their own course as well as pasta and the pasta is the star - not hidden under heavy sauce.  The meatballs, however, were very well made and the highlight of the meal.  I ate one (they are huge) and put all the scraped off sauce on the others to take home, eating the pasta as plainly as I could to appreciate the effort placed in a fresh noodle.  My servers, Nick and Mason, were very helpful and listened to my reviews and did their best to help, I would have sent back the pasta to be remade with sauce on the side, but didn't want to send back two dishes the same night.Almond-scented towels came out warm to freshen up - nice touch.  I watched the manager walk past my table about 3-dozen times (it was in his path), so close I could touch him, but despite my server alerting him to the issues with my food, he never looked at me, talked to me, apologized for the flaws, didn't do a table-touch AT ALL!  Something that would have been so easy, given his path, and should be done with every table regardless - especially when there have been complaints.  He was a mess, arrogant and useless - Adam I believe?The hostesses were great, they anticipated my walk about as looking for the bathroom and walked me to the area - nice.Next came the dessert, a poor attempt at a classy dessert for such a nice interior.  Another goopy, over-dressed dessert (everything was very heavy-handed, no nuance or finesse).  I ordered the Chocolate volcano - I love molten lava cakes.  The menu reads: \"dark chocolate center, chocolate pudding cake with salted caramel gelato\".  Sounds yummy, right?  Not so, soufflé dish with average chocolate cake, overcooked - so no lava - with a scoop of vanilla ice cream on top and salted caramel and chocolate sauces poured all over the top and the plate with lots of mac nuts all over too.  What!?!  No mention of nuts on the menu, what about nut allergies.  Fortunately I don't have one, but I dislike mac nuts immensely - pecans would have complemented the dish better, but still NO MENTION of NUTS and there were about 1/3 cup of them on my plate - overkill, again, and allergy issues.  A lose-lose.  Also, no finesse.  I would have sent it back but the manager had been such a waste of time, why bother?  Just never return and ensure my friends don't make the mistake of going there."], ["Kehau K.", "What else can I say but they are AWESOME in every way. Great! From star to finish everything was great.  The service has always been very attentive every time we have been there,  This was the first time we took our niece who is 11 and a very picky eater. She ate all her food from start to finish.  They have never been a disappointment."], ["Natalie C.", "Great view. Fancy restaurant but nice and helpful staff. Our waiter was down to earth and helpful. Food tastes great, portion sizes were decent. Your paying for the view and ambiance, there was even a piano player. It was a nice experience but not a restaurant I must return to."], ["Taneesha H.", "Same day reservations. Beautiful view, awe inspiring, breathtaking.  Awesome funny waiters.  Bill $142OrderedCalamari-  the sauce was great, the calamari was average.  Nothing to call home about.  Pot stickers- not the normal Asian style or stickers but they were good.  Show cooked veal with a little gravy taste.  Wouldn't order them againFilet mignon, mash potatoes, green beans good not greatDouble pork chop, goat cheese mashed potatoes, Brussels sprouts -AMAZING, this dish is a must have.  If I hadn't ordered the pork chop we would have thought the steak was amazing.  It was tender, and juicy.  Yum!Dessert: pudding, chocolate cake, both deliciousDrink: papa something, it was strong and good"], ["Adrianne S.", "Dined at this restaurant July 12 2014, with a party of 10. Attire: upscale, classy, dressy-casualParking: Valet, first 4 hours are $5.We didn't bring our kids, but it seems that they are welcome. But they might not enjoy it as much.Good for: romantic date night, business, groups, etc.Where to go: inside the hotel is a private glass elevator that takes you straight to the restaurant. At night, the elevator is dark with sparkling light ceiling.We were scheduled to be in a private room with a beautiful view. Since we arrived early before our reservations, we waited at the bar. The drinks were mediocre, but the service was great. There was a guy playing the piano as well, so it really set the tone for the night.The food was average, especially at the prices they charged. The service was very great. Our waiters were very attentive and prompt with our order, food, and refills. Overall, my group enjoyed themselves. If you want to do a night cap afterwards, the Modern Hotel has a late night bar/lounge called the Study. Hope this helped."], ["Liz R.", "My husband and I expected quite a bit from this place since this was our belated Valentine's Day dinner on Friday 2/20/15 and our friends told us they had great dinner here while back.The view was spectacular and the service by  the waitstaff were attentive and impressive.But the dinner items that were served to us were very disappointing.Appetizers/small plates: 1) Oyster with lilikoi mignonette sauce was great! Sad to say this was the only good thing we ate this evening.2) Escargot was bland. A little salt could have been great.3) Frutti di mare seafood sausage also lacked seasoning and very dry.Dinner:1) Osso buco was very dry. I swear this was cooked previous day and then reheated for 5:30 dinner service. Risotto also lacked seasoning. $44 for that? I could not justify it2) Seafood Fra Diavolo was below average pasta. Definitely not a pasta dish that the restaurant can charge 30+ dollars.Dessert: after disappointing meals, we elected to pass. We could not rationalize how we were going to spend anymore money here. We are sorry if you have a fabulous pastry chef.We will not return."], ["Mickey M.", "This place was absolutely AMAZING!!! The food, service, ambiance, live piano.Got the Australian rack of lamb medium rare with a 5oz lobster tail. My partner got the veal and we also got a nice bottle of white wine. The food was delicious and the waiter would never let our glasses go empty. Attended us when needed but didn't over do it. The dessert we got was spectacular they lit our strawberries ON FIRE!!!.... ON FIRE!!!!!!...was awesome :) The dessert alone gives this place a 5 out of 5."], ["Gayle C.", "We were here to celebrate Christmas. Been here quite a few times. Food and service has been up and down.  But we keep coming back so obviously we enjoy our meals on the most part. So this review is about our meal last night. Easy to make reservations on open table. The views are spectacular. The wait help was attentive. Very accomodating about sharing a salad. The salads came on time as expected along with their delicious freshly baked bread with extra virgin olive oil and balsamic vinegar.  Then we waited and waited and waited.  This has never happened before.  We finally wave down a waiter and our meal arrived 5 minutes later. Had the osso bucco and though the portion was generous, the flavors were lacking. Have never been so disappointed!  Overall the food was lackluster and not sure when and if we will return. Also, no Christmas tree in the entry way. It is 10 days to Christmas! !"], ["Melanie K.", "My husband and I thoroughly enjoyed ourselves here. The elevator ride up and down, the adorable friendly hostess, the romantic ambience, our awesome waitress, the runners that would keep our waters filled, the delicious food, and the KILLER VIEW really wowed us tonight. We ordered 6 different appetizers, a salad, and an entree and shared everything and there literally wasn't a morsel we did not like. And yes, we can EAT! Everything was wonderful. Even got a free tiramisu dessert with a lit candle for my birthday and it was divine as well! Definitely a great place to celebrate a special occasion. We will be back!"], ["Michelle T.", "LOVE this place! Amazing service, best food in town and wonderful views as you dine. Among our very favorites on Oahu!"], ["Brittany T.", "This place was magical my review is late but I still feel te ambiance as if I was just there yesterday. Drinks. Food. Service all 5 star! Our view felt like a dream!! I'm coming back!"], ["J L.", "This place was okay to me. Nothing spectacular. Making reservations was easy and I told them it was for our 2 year anniversary. Came in and hostess seemed kinda meh. Not very friendly. We literally I think was sat at the worst table in the restaurant. There was a giant pilar blocking the view of the restaurant and when I looked outside, you could just see a lagoon. It was still nice but I wanted a better view. A PLUS FOR MAKING MY DRINK STRONG LOL that definitely gets a star. Food was pretty good. Ahi bruchettas were good, my pasta was good, my bf's pasta wasn't that good. Can't exactly remember what they were called though. We also had a chocolate volcano cake for dessert. That was just okay. Nothing special. Service was meh too. It took a really long time for the waiter to get to us, he seemed friendly though, but didn't really come throughout the meal. Other people seemed to check on us. Didn't get anything for the anniversary? Yet the table next to us had one, and they got a small cake? Not sure if they forgot or whatever. :/ Overall, I think it would have been a lot better if we didn't sit where we were sat, but oh well! The ambiance was still nice."], ["Alvin J.", "Finding an appropriate restaurant for your milestones within a relationship is always hard. I read countless reviews of this place (the good and bad) and this establishment deserves nothing short of 5 stars. It could have just been the emotions speaking for me as I got to celebrate with my significant other but I'm sure the service, food, and ambiance spoke for itself. As a first, The elevator ride up to Sarentos teases you for the beautiful view that awaits your special night. When you arrive you're greeted promptly after the elevator doors open. You're soon seated and I would suggest ordering an appetizer because the main course may take a while but who could get mad with the beautiful view surrounding you. I would recommend placing a reservation just as others have suggested to ensure you're seated upon your arrival."], ["Wayne S.", "Great place to eat the chicken was great and the drinks were strong,   Great place to take somebody to celebrate."], ["Carolyn I.", "My man and I took my mother to this establishment last night for her birthday.  She had never been here before and was clearly enamored by the gorgeous view and swanky feel of the place.  My father came along too and was more shocked by the sticker price, but since we were covering the meal, we told him not to worry about it.    Between the four of us, we enjoyed some delicious lavosh and rustic-style fresh bread  and Cesar and Greek salads to start. For our entrees, we feasted on filet mignon meatballs and spaghetti, the double pork chop, the tiger prawn shrimp scampi, and the osso buco, which was my delicious choice.  ALL of the entrees were absolutely ono and amply-portioned.  Prices for entrees start at the low $20s here, but our waiter kindly informed my mother, who is a little woman to say the least, that she could order a half-sized plate of pasta for half the price, which was a very reasonable alternative.The view is gorgeous, so try to get a table at sunset.  We came just after the sun went down, and we weren't disappointed.  The service is at a very lax pace here but not because the staff is inattentive; this is a place where you drink wine and linger over deep conversation, so lovers won't miss being pestered by their servers every five minutes.  The atmosphere is very romantic, so gentlemen, if you don't want your ladies thinking that she's headed into a proposal, definitely stay clear of this place.  Expect to pay a pretty penny here (our bill came out to just over $200 with the tip for a party of four and no alcoholic beverages).  It's well worth the investment, however, because you'll walk away with a full stomach and a doggy bag.  We'll be back."], ["K C.", "The only redeeming factors of our meal was the server we had and the ambience of the restaurant. As a \"high-end\" Italian restaurant, you would expect every pasta dish to be equally amazing and flavorful, but both entrees we ordered feel short of that mark, especially my own. I ordered the penne calabrese, it had an interesting flavor, but not the appetizing kind that makes you want to keep eating. The homemade Italian sausage was extremely dry and the eggplant was overcooked. My boyfriend ordered the chicken rigatoni alla vodka which had a nice, light flavorful sauce but the cubes of chicken were pretty dry. The drink I ordered was extremely strong, the alcohol overpowered the other flavors. Our appetizers were pretty good, we ordered the calamari fritti (a little on the salty side) and the bocconcini (simple and tasty but make sure to cut it in half as it is a large bite whole). The Cesar salad we ordered was alright, I've had better. For dessert I ordered the strawberry mascarpone cheesecake which was pretty yummy. My boyfriend ordered a latte which wasn't bad. It just took forever to come out. The only reason for the third star is that we felt very well attended to throughout our meal, the view from the top of the ilikai was amazing and the live piano player made for a romantic setting."], ["Vince B.", "Oh man...I love roof top restaurants...and I enjoy special occasion meals...and I kinda liked it there. It was A-OK and a pleasant experience. I've been there twice and I might go again to listen to music in the bar and have pupus there. I might go back for dinner if someone else was paying. For me, it just didn't deliver as a special occasion meal. Whether you are a tourist or a local you deserve to know what you are really going to get for your money.Anniversary:  As we are going up in the private glass elevator my wife says  \"We've been here before.\" As usual she was right. Someone invited us to dinner here before. I honestly forgot it completely until my memory was refreshed. So it was kinda of forgettable that first time too. Table: Most of the tables arranged to take advantage of the view. Nice view that is for sure.Drinks: I had a nice house red wine. Wife had a speciality drink listed on the menu and liked it. Daughter had a non alcoholic drink recommended by the waiter. She didn't care for hers. Waiter didn't offer to replace it even though he suggested it and she wasn't drinking it.Service: Hostesses who were efficient. Friendly experienced waiters who had been there a while and knew the menu well. A little confused as to why we had two separate waiters who were never seen together. For a while I felt like we were on that TV show where they switch waiters to see if the customers noticed. Fine dining experience? No. Bit of a disappointment on the service. Food: Appetizers were #1 calimari. I've gotten more quantity and better quality for half the price at a food truck. For real. #2 Asparagus pizza because it sounded good to me since I'm a vegetable fanatic.  It was A-OK. I liked it but was barely enough for a couple of bites. Main course: When I go to an Italian Restaurant I want Italian food which usually means pasta of some sort. I had the mushroom \"fungi\" pasta. It was good. 3 stars good. My wife got the fish special pasta which was recited by the waiter #1. I think it was Opah fish. Sounded great and the $36 price seemed fair for excellent fresh fish. The fish was shredded into the pasta. Not what I was expecting from the description. She liked it and was not complaining. I tasted it too. I was not at all impressed. But, I'll go with her 3 A-OK stars. Daughter had Chicken Pasta and she enjoyed it too. I tasted it too and it was a full 3 Stars too.Desserts: Tiramisu and Chocolate Volcano. They were also 3 stars.Enjoyment factor: We were all in a good mood and looking forward to a special occasion meal. We were not going to let a 3 star dinner get us down. We enjoyed the evening because it was special to us. We enjoyed the view. Going back? Perhaps I'll forget again in a few years."], ["Kenneth D.", "My wife and I dinned here before the Diana Ross concert, and really enjoyed everything, especially the service from Chad. He is a total pro. Not overly attentive, just enough. Very well informed on menu, specials, wines etc.. When I do return I will certainly request him as my server, and I suggest you do the same. But all in all was a enjoyable evening."], ["Sidette S.", "Went to Sarento's last night for a birthday party, the food and drinks were good. Our server was awesome, but when it came to wanting to have a birthday cake we bought in from Liliha bakery so the birthday girl could blow out the candles and sing Happy Birthday. The server informed us we could sing and blow out the candles, but the General Manager would not let us cut or eat the cake since Sarento's serves desserts. Really, not to mention we also purchase desserts off the menu, had a party of 15 and our tab was well over $700 in a pretty empty bar. No Aloha, will not be going back to this place. Shame on you General Manager for treating locals like this!!!"], ["Cody M.", "First time dining at this location and was quite impressed with the level of service and professionalism the staff had shown. I was not staying at the hotel, yet used this fine restaurant venue to delivery a memorable birthday experience for someone I love.         The price of food here is quite high, but it is Hawaii and that is pretty normal in my opinion. The selection of food is broad enough to manage many different appetites. There were certain items not listed on the menu as specials-- I sadly was not able to try them during this occasion.     The only downside I felt was the excess charge to bring in my own personal cake for my guests birthday. I understand it being a place of business, but if the restaurant does not have the available dessert-- I think it should be acceptable to allow entry for special events as it would have made the night much more spectacular.    The view from this location was quite astounding. We didn't get to see the sunset from which I requested during my reservation, but I did still get a view of diamond head and a show from the top of one of the facilities near by.     The food quality had definitely met my standards as I am not an avid fine diner. The grilled ahi was quite pleasing with the zesty flavors on top of very tender seared ahi. The veal Osso Bucco was quite soft and tender also as it was promised. I didn't find the sauce to be very unique or special, but hit home well as my guest did appreciate the taste of beef stew which had similarity.    As a student studying customer service, I will definitely give Sarento an A. The servers were very prompt and courteous-- I almost felt sometimes they came around \"too much.\" I do appreciate that they did offer my  guest a dessert provides from them since I wasn't able to bring my own. I would gladly recommend this venue to others for a fine dining experience and also as a place of outstanding customer service. P.S. I would give this place an A+ if they would use more employee empowerment to make special arrangements for events by allowing special requests to be taken."], ["Kathy M.", "We had dinner here two nights ago. The minute you depart the elevator you are treated to the most magnificent city views which really set the stage for your meal. My Osso Bucco was delicious and my husband's seafood stew over linguine was fabulous.     My only complaint was that there was a group of 6 men at a nearby table who were pretty liquored up and very loud causing 2 groups of diners to move to another area of the restaurant. If we had been with another couple we wouldn't have been able to hear each other across the table. Perhaps the manager should have kindly intervened on behalf of the other guests. Just a suggestion."]], "Döner Shack": [["Joy N.", "This is a small hole in the wall right off of Fort Street. If you blink, you may miss the entrance. As soon as you walk in the door you're greeted with, \"Hi. Welcome back!!\" I thought that was really nice. Even though it was my first time there, that greeting made me feel much more welcome and at ease.I love places that use different colored chalk for their menus. It makes it seems that there will always be something new to try. Their menus are up above the register and everything sounded delicious. I ended up with a small mixed meat Doner. (See picture) I like that they use tortillas instead of pitas. It was soooooo yummo!!! The meat is soft and juicy and the sauce is not overpowering.I will definitely be back to try their Downtown Doner and maybe a salad."], ["Kristina V.", "As my boyfriend would say, \"it's all about their sauce.\" Boy, he couldn't be more right. I was recommended this place by a friend of ours and I couldn't stop noticing people walking around fort street mall with brown bags with burrito-looking things in them. I took the suggestion and followed my nose. Their menu is very limited, which is a tall tale sign that their food items are good. I've tried everything and they're all delicious! Their lamb... Ugh to die for. Their salad/Vegis are so fresh and crunchy and their sauce, oh my! Just be prepared to wait a while because everything is made, to order, and it's very popular. Oh yeah, you can leave your card at the office because, CASH ONLY, but it's reasonably priced. Especially for the quality food you will be getting.  Other than that, this place is magnificent. I'm guessing you figured that out by now."], ["Marissa H.", "The last time I ordered from here I had the shack salad with Lamb. The salad was great! I didnt need to add any dressing to it. They put a yogurt sauce over the meat and it was awesome. The meat comes from kabob and some parts are soft and others are crispy, but it definitely tastes great! If your looking for healthy options in downtown this is place is a good choice.My favorite item is the downtown döner with lamb. Thats a wrap filled with fresh vegetables: lettuce, tomatoes, cucumbers, and lamb. It comes with their special sauce that the rest of the wraps don't. The small is huge like about 6 inches long and a few inches thick! See my pics!!!Also, during lunch hour they get pretty busy and their arent many seats so id  recommend take out."], ["Faye M.", "This is another downtown haunt that has long lines, and the food is pretty good.I've had their wrap, sandwich, and salad (one each on separate days!) and the meats are soo good! I usually get mixed meat, which is the beef and chicken..,grab some hot sauce too.The sandwiches and wraps are pretty messy, so you can't really eat like a lady or gentleman...just try not to spill any of the tasty goodness on yourself or floor!To be honest, I've waited for more than 15 minutes for my lunch order more than once and I get a bit irritated, but after I get back to my office and take a bite - I'm slightly a little happier.I swear, they move kinda slow in there and there's always a new person working who kind of slows things more, but I'm still giving them 4 stars ... I'm kinda addicted."], ["Mailin C.", "Love it! Finally found a Döner in Hawaii! Just wish now they had this awesome huge fluffy pita bread that I'm used to from Germany & Turkey, aaaand if they would be open on the weekends or evenings too that would be great! Any time I get a weekday off I'm sure to get lunch there. Definitely give it a try! Generous portions of meat too!"], ["Stacey W.", "Seriously one of my favorite places for lunch in downtown. I've tried the doner wrap and the doner salad, both with mix meat (chicken and lamb). The food itself deserves 5 stars. The only downsides are that the restaurant is not air conditioned, and they only accept cash, which isn't such a bad thing since their prices are reasonable. I don't know how the workers can spend hours on end with no a/c! I can barely stand to wait in the restaurant for my order so I usually end up waiting outside. There is usually a line so I try to get there by 11:30am or I wait until after 1pm. Once in a while there's not much of a line during lunch rush. They take phone orders but it's tough to get thru when they're busy."], ["Phuong M.", "Thought I already wrote a review but this place is absolutely delicious and simple and yummy and guys are so friendly! The service is quick! They sucker me everytime I walk by because the lamb and chicken on their grill overwhelms the area and automatically I'm hungry and my mouth salivating! I always get the Doner Wrap and it's plenty big and filling! While waiting in the long my tummy growls as if I haven't eaten in ages. They really do a great job at luring you in cause in starving and can taste the yummy goodness already. Can't wait to dig in!"], ["Tze M.", "Saw a post on Instagram and I had to ask. I LOVE LAMB!! So I made my way down to downtown, found a meter stall and hobbled my way to this hole-in-the-wall.You would find this place off Bethel Street on Pauahi going towards Fort Street Mall. There's a few tables and chairs, and order counter, and a chalk wall menu up above the kitchen.I ordered the rice plate with the lamb (7.50). An option to mix chicken and lamb is available. It comes with a salad on the side, pre-dressed. The lamb was very tasty, it was a little too dry, but good. I think the next time I'll get the salad and the hot sauce on the side."], ["Syvannah O.", "Follow your nose to Döner Shack, a hole in the across from The Fix in China Town. There's is no street parking. It was convenient for us b/c we live in China Town a few blocks from hereFinally got a chance to try this place my Other half eats here at least 3Xs a week and now I know why. Cheap and delicious! Be sure to go early b/c they do sell out. I got a chicken salad with a pita on and everything was delicious. We got two salads with meat and a pita for under $17. You rarely find great meals for 2 under $20, especially in Honolulu. I was surprised how great everything taste, I never expected it to be 'that' good! I will definitely be returning."], ["Brandon Y.", "I have to give this place 5 stars because it's one of my favorite places for lunch and I eat here more often than anywhere else downtown. I want to say 2-3 times a week usually. They're located    on Fort Street right next to the Subway. The food is really simple and they only have a few items on the menu but the items are done so well.Everything revolves around their Doner Meat. You can get Chicken or Lamb or a mix of both. I usually get a the Downtown which is a flour tortilla filled with Meat, Yogurt, Hummus, Feta, Lettuce, Onions, and Tomatoes. Even the small size fills me up.  If I want to be healthy I'll order the Shack Salad which is pretty much the Downtown minus the tortilla and the hummus."], ["Nicole K.", "I first tried doner kebabs in Japan (random, I know...) and continued my love affair at Spitz in LA.  Craving the tender slivers of lamb and beef again, I quickly searched Yelp for a suitable substitute.  Thank goodness for Doner Shack!Located just blocks away from my office in the Fort Street Mall area (right around the corner from Subway) is a small little shop rich with the fragrant smell of slow roasting meat!  Their menu boasts an array of wraps, rice plates, and gyros all for under $10!  I ordered the Doner Rice Plate with Lamb/Beef which came with pilaf rice, a generous portion of meat topped with yogurt garlic sauce, and a side salad lightly dressed.  The portion was HUGE!  The meat was tender and well-flavored and the side salad added a refreshing taste to an otherwise flavor-packed meal.  At just $7.50, this is definitely on my list of great lunches for even greater prices!I arrived a few minutes after 12 to find just 2 or 3 people in line in front of me, but as I waited for my plate, the line swelled to about 10 people.  My order was ready within 5 minutes, but I am not sure how long other patrons had to wait.There are a few tables pushed to the side of the narrow restaurant if you wish to eat there, but since it is a rather small location I chose to take my lunch back to the office."], ["Jhoren C.", "a Bang for your buck! tried the doner wrap (small 10\") versus the normal 12\" wrap. got the mixed lamb/chicken....this was very filling add lot's of HOT SAUCE for that extra kick, only dissapointment was they used regular tortilla in replace of Pita. I know they aren't Leo's but I prefer my wrap with Pita! Eat outside because there is no a/c and this place is tiny. The cook/workers there are very friendly and quick!"], ["Russel M.", "I remember a couple of years ago the Trailer directly across from it's present location which is on the Subway side almost diagonally across behind Cake Envy on 79 Pauahi St. Everything is good especially the Downtown Donner and friendly service. Hours are 10-3p M-FHighly recommended.."], ["Shruti J.", "This is my go to middle eastern place in downtown Honolulu! Great and quick service, delicious food and easy on the pocket. Meat lovers should definitely try the Lamb here. Their portions are huge and everything is super fresh. You can literally see them make your sandwich (I usually prefer such places where I can see how my meal was prepared). The only thing I suggest they improved was their mode of payment. Currently, Doner shack accepts CASH ONLY! Other wise, this place has the best meat shawarma on the island."], ["Chastity C.", "We had a hard time finding this place just based off the address listed on yelp. Be sure to put the South before the street name. However, it was worth the wait. Service was great, fast and friendly. We had two wraps with mixed meat, hummus, and a pita. The wraps were delicious. Clearly the lamb is better seasoned than the chicken but overall it was delicious. I will certainly come back and try more of their menu."], ["Marc C.", "Be prepared to wait for your food. It took them 25 mins today to make my Dohner. They didn't even put my order on the list. This spot is near my work I have eaten here several times. The Food is ok, I usually get the Downtown Dohner.  Which has been hit or miss for me. The place however is super hot, small and unsanitarty. I have seen roaches running around the open kitchen area. I don't recomend eating at the location. It gets very crowded around lunch time, so if your in a rush don't expect to be in and out.  Not happy about forgetting my order and making me wait."], ["Tiffany B.", "Prepare for a nap after consuming one of these bad ass gyros! & please, get it w/ the imported German bread & not tortilla (if that's still an option). Don't do chicken, gotta get the beef & lamb meat! Do it this way, & it is sure to hit the spot!"], ["Lillian H.", "Have I really not given a five star review for Doner Shack yet? I've been a regular for almost a year now. They know me by name. I always order the chicken rice plate w/hot sauce. Their garlic tzatziki sauce is AMAZING!! Beware though, your breath will stink!I pick up lunch from Doner about once a week, which I know is probably overkill. I love the taste of the rice plate (one of my fave dishes ever), but another factor that always keeps me coming back is the service. Fact is, everyone makes mistakes, but not everyone fixes it (willingly/happily). If something ever goes wrong or is not up to par, the owner ALWAYS makes it right for me, no questions asked and no grumbling. They definitely stick to the mantra, \"the customer is always right.\""], ["Arlene A.", "The meat.... The bread... The sauce... Perfection!Everything taste fresh. Don't expect super friendly service when you go doing their lunch rush. But who cares! Their food is good. Like can't stop eating my sand which till I'm stuffed good. Like fresh baked bread and succulent lamb good. I might need to come here every week and try one new thing on the menu, which is not large but it doesn't need to be."], ["Darin O.", "I know there is not a good place to get great Gyros here in Hawaii.  Greek Town in Chicago has great Gyros.  Here - you just have to try to juicy meat that is a Doner.  I am glad I tried them.This really is a small business that is the little engine that could - try - try try try and then try again.   They were in a ton of different places all along the HPU way downtown before getting this place.  They really believe in their food and I like to see that.  IT isn't McD where it all tastes the same- it is unique meat.  It has flavor and just know that it is independent of the mainstream.  Great place to grab a fist full of meat for lunch."], ["Gary C.", "Excellent food and very reasonable prices. We ate lunch here yesterday and  had one lamb/beef plate and one chicken plate.They were  both great and the  portions were large.Highly  recommended."], ["Jenny C.", "I saw a picture of their rice plate and fell in love. I just had to have it. So I did. We made the trek over to grab some lunch. It's a risky move especially with the parking situation in Downtown. Was it worth it? Ah...so close yet so far.Salad - Awesome - refreshing and the dressing is seasoned perfectly. Light and not too zingy.Lamb - Awesome - luscious slices of lamb, deliciousGarlic Yoghurt Sauce - Garlic, how can you go wrong?Rice - Crunchy...what?I love rice and they did rice wrong here. Maybe it was an off day but our rice was undercooked with not enough water. It was more and more upsetting as each crunch came about because the plate would have been damn near perfect had the rice been cooked properly. Sorry, this doner was a downer."], ["Ben L.", "I visited Doner Shack in early May with some friends. I never got a chance to taste the food because I ended up finding a live cockroach in the bag with my food. I also noticed dead and live roaches running along the floor boards and along the windowsill. This place has a serious vermin problem. If there are roaches crawling around during daylight hours then this place must have a nest of them in the walls and in the kitchen. The proprietors need to get rid of the vermin post haste. I read that they had good food but I couldn't even eat the stuff that I paid for because of their issues with roaches."], ["Jennifer S.", "A solid take-out lunch option in downtown. I was excited to see a return of döner just off Fort St - Downtown Döner closed not long after I started working downtown, and I never got to try it. Therefore, I have no opinion whether it's the same or better or worse.If you like gyros, you'll enjoy döner. Meat shaved off a rotating skewer that's been cooking all morning, plus salad vegetables and sauces. Usually served in an overstuffed pita.$4-9 lunches, including small size and vegetarian options. Seems a bit healthier than the döner joints I've been to in Germany. I skipped the Downtown Döner wrap because it's in a tortilla, not pita - though they do have a pita option. I didn't want the mess. I opted instead for the rice plate. Generous scoops of light-yellow rice, equally generous salad (romaine, cucumber, onion, tomato - none overpowering) dressed with a tasty vinaigrette, and my choice of meat (chicken, lamb/beef, or combo). $7.50. Next time I'll try the $2 pita/hummus/drink add-on.6 tables-for-two in the narrow space; not a ton of room to wait for take-out at 1230p. Expeditious service, maybe a 5-minute wait for my food."], ["Carly H.", "10.3.13.I was wandering around aimlessly, trying to find someplace with milk tea... I decided to check this spot where Pacific Rainbow Cafe used to reside hoping that maybe the newspapered windows I saw the other week were just a temporary thing...While it's sad that PRC is no longer there (bye bye milk tea--WAHHH), the Doner Shack is (back) in town! I write \"back\" because I believe this might be the same operation that used to run \"illegally\" out of a cart/small stall in the streets of downtown under the name \"Downtown Doner\". They also have an item on the menu called the \"Downtown Doner\" (12\" tortilla, meat, veggies, feta, sauce, $8.25). There is also a Downtown Wrap; I believe it was $7.25 & is basically the same thing as the Downtown Doner but there's no feta cheese. There's also a Downtown Sandwich and a couple other options... A \"small\" size (10\" tortilla) is also available at a cheaper price for each menu item, but why not just go all the way?In my opinion the food was great--it was made fresh & it was tasty! The workers also clearly bust their butts--that rent space is HOT inside--I guess my only concern would be that they were sweating so much & wiping it across the back of their hands...& then touching my food...maybe use some gloves? Overall, I was happy that I did come by here again to discover this new occupant. This place is def a step up from their previously unpermitted operation. Continuous improvement people--like!!Yelp 365 Challenge: 275/365"], ["Freida G.", "Love it!! Best Shawarma so far! I've been to many gyro places and always ordered their version of shawarma but non of them captured it, this one is the closest to authentic that I could get.  Very fresh and refreshing!"], ["Tori B.", "It was yummy. Yummy!Crispy and tender meat. Fresh greens and an al dente rice pilaf that could become addictive. Their hot sauce is the bee's knees. The aroma inside the place is so inviting. I am already planning my return. Great prices. Large portions. I am a huge fan. I had the beef and lamb. I plan on chicken next time. I plan to update this review after future visits. For now though, just know it is the perfect example of a hole in the wall. Small, cheap, easy to miss if you are not looking. Delicious. Hole in the walls are the dive bars of food. Perfect for those who know. Now you know. Try this place. Did I mention it is yummy?*Edit: UpdateAfter another visit with my spouse, I have raised my rating to 5 stars from 4. My spouse had the chicken. I got the lamb with extra meat. Both were rice plates. We got extra meat for $2.50 more each. It was TOO MUCH FOOD! I am pregnant with food now. You can not beat the price and the serving size here, especially when you consider how good the food really is. I will have to try the wraps next time. I wish they were served in pita but, oh well... you can order a pita on the side. I am in love with their hot sauce. Authentic Mediterranean food is hard if not impossible to find on this island. This place is no exception. It is not perfectly authentic. That said, it fills the authenticity gaps of some other local places. Their meat is cut in perfect strips which just feel right. The fragrance coming out of the place is an inviting flashback. I used to live in Astoria NYC which was filled with Greek food. Other Middle Eastern/Mediterranean places on Manhattan almost spoiled me. It is so nice to have a place here that really reminds me of these places. Something about the lack of decor, the fragrance, the lack of good AC really fills a void I have missed. Like I said before, it is a hole in the wall. I am fine with that. I will be a regular here."], ["Andrew W.", "There are very few places that I have the urge to constantly visit over and over again and the döner shack is surely one of these famed places. Almost every week there's a little voice inside my head that urges me to head down the street to this glory of an establishment. At this place I am torn between the rice plate and the downtown döner. Both prove to be filling but both taste beyond awesome. To compromise I sometimes get the downtown döner and add rice inside. I truly love this place and will forever savor the succulent mixed doner wrap for as long as this establishment will live. 6 stars, the very best!"], ["Wina G.", "Haven't been here since they were in that little doorway by FIXX in a little side street off of Pauahi. That's many moons ago. Now I find they're in a permanent spot with tables steps across where the original spot was. Food still delicious and satisfying- that hadn't changed. I had the lamb sandwich. Big portion. Can't beat this deal. Made fresh for you so it may be a by of a wait but so worth it! CASH ONLY."], ["Roydon Y.", "Food here is amazing. Good portion sizes, and it all tastes really good. Very simple menu: meat, rice, vegetables, sauce. They also have drinks and wraps.I've come here two days in a row now after discovering it, will be back in the future.Older guys in front are very friendly.Ps. Writing this as I eat my lamb and rice plate. Hard to type when each bite tastes so good."], ["Amber C.", "Great lunch spot. The downtown doner is really good and huge. The hummus is also very good. This place is becoming a favorite of ours!"], ["Kelly F.", "Overall good product.  I really liked the lamb (more than the chicken).Why not 5 stars - It wasn't super authentic especially as the wrap part was really just some random just ok flour tortilla - but overall it was pretty flavorful and I would return on occasion.Decent price.  Wish they took amex. Not great seating."], ["Jennifer C.", "Like Latin food, Mediterranean food is one of those cuisines that is hard to find on Oahu.  It was one of my staple dining out cuisines, as it is both delicious and healthy.  So, I was super disappointed when I moved to Hawaii, and had trouble finding the good stuff.  Doner Shack helps fill the gap during my downtown lunch adventures.  This place always smells so delicious whenever I pass by, and I decided to give it a try; so glad I did.  I always get the mixed meat salad.  All the meat is seasoned very well and you get a generous portion.  I never really liked chicken shwarma, but it's good here, and I actually prefer it over the other meats.  The salad includes greens, cucumbers, tomatoes, onions, olives, feta cheese, yogurt sauce, and balsamic dressing on the side.  It's a pretty sizable salad; on some days, I actually can't finish it!  All this for $7.50 - so worth it!"], ["Taryn M.", "My first time eating here and I just got the mixed meat rice plate. Sooo good! I love the yogurt and spicy sauce together. Can't wait to come back again.Items I recommendd:-Mixed meat rice plate-Mixed meat salad-combo with pita bread, hummus and drink-get the spicy sauce"], ["Robert L.", "The food was very good the first time I went there, I waited outside while my friend picked it up. The second time I went inside, roaches on the menu board and peeking their heads out from under the board. I left couldn't order. Today gave it another try with friends. Saw a roach on the wall above the cash register fall into the paper bags that are served to the public. All three of us left. Clean the place up, close for a few days,fumigate, do whatever you gotta do, Clean up!! Could be a great place."], ["Ko L.", "I'm totally addicted to the rice plate here and the prices are really decent for the amount of food you get."], ["Austin B.", "I'm pretty picky when it comes to German food because I grew up there. The döner kebab is Turkish, which is popular in Germany, and the version they serve here is supposed to be like the one they sell in Germany. I can see this place serving a decent sandwich, especially if you're looking for something other than Subway. Comparing it to what I grew up with, there are some things lacking.Likes: The servers are friendly. They messed up my order so they were willing to make it up to me. I would also pick the beef & lamb over the chicken because it isn't as dry.Dislikes: Watching them work, they do things rather inefficiently. Because of that, service can be slow here, especially at lunch time. Cash only :(.If you're looking for something different and never tried a döner kebab, you might like this place. For me, it's missing a few things: 1) The sauce isn't creamy and garlicky enough. Needs more garlic and maybe more mayo 2) add lightly brined sliced onions 3) add lightly brined shredded cabbage. I might give it one more chance though."], ["Richard M.", "Eat there about 3 times a week - I think I'm addicted.  Mixed rice plate with their hot sauce is awesome!!!  Long lineups but they move fast."], ["Moad A.", "Honestly, they're amazing!. Food is just tasteful n amazing. It's very cheap comparing to any other lunch place near by. Portion is relatively big n mouthful. The wraps  here are so juicy n big (that's what she said). The fact that am writing this review while am eating their food should tell u how great it is haha. Try the plate w basmati rice ... good stuff yo!!I gave 4 stars because they ran off lamb early (I really love their lamb), but chef gave me extra chicken to compensate. Mahalo! They sometimes get super busy and line can stretch all the way outside."], ["Joyce G.", "I was really excited when I found out about this place.. It's kind of a hole in the wall.. Very small, no AC & not the cleanest. BUT, their food was pretty dang good. We got the beef and lamb doner sandwiches. Super good and filling. They are very generous with the meat which I like! The hot sauce is great, it added an extra punch! We will be back again but doing take out from now on. Prices are about average for a decent sandwich/burrito/gyro type meal. I did notice they use tortilla for their wraps, haven't tried it but i def would prefer a pita instead."]], "Bella Bistro": [["Tiffany D.", "Fresh. Friendly. Relaxing.My four year old daughter and I truly enjoyed the fresh food offerings made by a very sweet and friendly chef. Our server was prompt, positive and helpful. The location is great with outdoor seating right next to kawainui marsh and there is ample parking. The wine and desert made the night perfect. We will be back thank you"], ["Galia W.", "I've been in Hawaii for 34 days and ate out for 32 of them at least twice a day, sometimes three. This was by far the worst (AND most expensive) restaurant out of the approximately 70 restaurants I've tried. No kidding. My friend is sitting here next to me nodding her head yes. We've eaten at food trucks and dives but for our last meal we decided to splurge. Oh the irony. Even the cheesecake and tea were bad! Both of our meals and dessert went mostly untouched. I will however say that our waiter was wonderful. Very friendly and attentive. We arrived towards the end of the night and never felt rushed. He was pleasant to talk to and was the best thing about this place. Too bad he's not food though."], ["Megan W.", "Small menu but good food. They have at least one vegan dish and a few vegetarian dishes that can have seasonal veggies added or proteins. I like being able to upgrade my dish or not have to pay for proteins that I'm not going to eat but $5 extra for protein or veggies seemed steep. The marinara sauce is a tad spicy and they put a lot of sauce on the pasta. I asked for my linguine with light sauce and it was perfect. The seasonal veggies included asparagus, zucchini, onions, whole mushrooms, and bell pepper. One person in our group thought the sauce was too spicy for them. One thought the creamy pesto was bland. Nice place to enjoy a meal outside in the coveted area. The table bread us rosemary focaccia and delicious."], ["Mich C.", "Enjoyed the food!  Excellent portion size, flavorful, great service.  Would give this 4 stars but was disturbed by the street traffic.  Even on a weeknight, Hamakua Street is busy and so doesn't make it for a nice ambience.  Go for the food, reasonable prices too!"], ["Nadia K.", "Came here on a Saturday night for dinner with the girls.  Immediately loved the open air ambiance of the restaurant.  We started off with calamari and the chop chop salad and I ordered the chicken parmesan.  The salad was delicious as was the focaccia which is from Agnes' bake shop.  While my entrée portion was generous, I thought it was just okay.  I thought the linguine had too much marinara sauce which made the pasta a little mushy.  My friends loved their dishes, especially the lemon caper sauce that accompanied the chicken piccata. For dessert, we shared the house made cheesecake and the flourless chocolate cake.  Both were yummy.  The service here is wonderful.  Great place for a relaxing meal."], ["Mona C.", "It's the night before a holiday, and my family wants Italian for dinner... heading into Kailua, I remembered I'd wanted to try Bella Bistro,  but thought there was no way we'd get a table. Nontheless, I gave them a call to inquire on their wait, and to my surprise, was told they would be able to accommodate us immediately! We got there just a few minutes later, and the hostess noticed we weren't quite dressed for the breezy, open-air dining area. She graciously offered us a larger table that was tucked a little more into the cafe. Perfect! Stephanie, who I learned is the manager and wife of Chef David, was wonderful. She paid special attention to my children, especially my daughter who fell in love with the beautiful brass pots and pans hanging above the kitchen window. Our server Meghan was friendly and attentive and explained the menu to us. We decided on the Calamari appetizer ($14), Chicken Parmesan ($17), Linguini with Garlic ($12) with meatballs (+$5), Eggplant Parmesan with a Ceasar salad ($17) and a child's Flat bread Cheese pizza ($5).The house bread was hot, light and had a crunchy crust on the bottom. The creamy herbed butter spread that accompanied it just made it melt in our mouths! So delicious, we accepted a second loaf!The calamari was delicious, seasoned and fried perfectly. My kids immediately dug in, tentacles and all quickly disappeared! Our entrees followed shortly thereafter. The chicken parmesan came with a pile of pasta with a slightly spicy marinara sauce and assorted grilled veggies. My husband loved it!My son had the linguini with garlic and meatballs... one bite and he was hooked... his big eyes showed me all I needed to know... this just made it onto his favorite pasta dish list!My daughter had the flat bread cheese pizza... she's kind of a cheese pizza connoisseur,  and her big smile showed us just how delighted she was with her choice. My eggplant parmesan came with a large Ceasar salad on the side... I ate the salad, thinking it would not survive a take-out bag, but saved space for a few bites of the eggplant... wow oh wow it was 3 large slices stacked up with motz cheese and marinara... yummy goodness!All the portions were large, so we brought home quite a lot of food. Very, very happy with our experience, we decided we will go back again for more,  soon!"], ["Blake R.", "Good foodDon't eat here if you are in a rush. It takes about 40mins to receive your food. Very limited beer selection (very)"], ["Trenton N.", "The waitress was really friendly and extremely helpful. She definitely made the experience a lot more satisfying.The food was decent. We started with a basic house salad. One order we had was The flatbread pizza and salad was GIGANTIC, it was definitely more than just an appetizer.Had the chicken and lemon with rice pilaf and grilled vegetables. On a scale of 1-10, a 5. Vegetables were extremely, extremely dry, borderline inedible.Last dish was linguine with vegetables. Saucy and satisfying.Bread and butter was good!Ample alcohol menu.Ambience was nice!"], ["Gary P.", "My rating is based on my last two meals at this location. Had a great dinner last night with my wife. I haven't had anything that I didn't enjoy at Bella Bistro in any of our visits. Last night we started with sherry mushrooms served with crostini. Another appetizer we ordered were crab cakes. They have good flavor though they do have a little more bread crumbs than I prefer. The crab cakes are served with a salad of mixed baby greens, spinach, red onion, and calamata olives. We had French onion soup next. It's flavorful and delicious. Rather than a beef stock flavor it seems to have more of a sherry base for the soup. It's topped with cheese that's melted perfectly across the top of the bowl. The soup I think could be improved by adding the crouton sometimes found under the cheese. My wife ordered the lamb and polenta. It was delicious as I got to try several bites. The lamb shank was braised and fall off the bone tender. The polenta was made with a little basil and mint. I'd never had polenta prepared this way and thought I might not like it but the herbs weren't over powering and tasted great. I had the Alfredo Campanella with a side of meatballs. The pasta was cooked perfectly and covered with a smooth cheesy delicious Alfredo sauce. The meatballs were moist and scrumptious. We were too full for desserts."], ["Christine E.", "Yummy yummy! A trip to the new Kailua Target store resulted in a lovely dinner with my husband at Bella Bistro. It was our first time there and we found it by busting out our handy dandy Yelp app and looking for food nearby. It is a small-ish (maybe seating for like 40) outdoor dining restaurant. There is no indoor seating so please please please bring a jacket! Last night was cold! Our server was super nice to us, and we noticed she recognized and took care of the regulars really well as well. The bread they give you at the beginning of the meal is delicious, soft, crunchy, with some kind of garlic butter. We shared the french onion soup which was sooo good on a cold night! Super cheesy, dark, oniony goodness. I had the NY Strip (which is listed on the menu as Ribeye but that night they didn't have that cut), I didn't mind it was still yummy! Nicely charred, cooked to my requested doneness, and came topped with mushrooms and onions that were cooked in some kind of sherry sauce. The potatoes it came with was AMAZING! - super crispy on the outside, soft on the inside, hint of garlic. So yum! One downer to my steak (which is totally not a downer to me, but could be for some), was that there was a good amount of oil/butter on my plate under the steak - being the fatty that I am, I used that to dip my cut pieces of steak into. But some people are healthy and don't like the oil/butteryness of it all, so if that is your thing, then maybe avoid the steak? I thought it was great though.Hubby had the linguine with italian sausage. The italian sausage was good, the marinara sauce or whatever on the linguine was standard. He loved it. I thought it was just normal. Not bad, not amazing. We ended the nice with the flourless chocolate cake, they were out of vanilla ice cream so they gave us their coconut gelato and it was a delicious mix! This flourless cake wasn't dry like some that I've tried at other places, and we ended up eating the whole thing even though we thought we were \"stuffed\". Next time we'll try the cheesecake! ;)Overall there was nothing about this meal that I did not like - even with the cold winds and torrential rain that was going on around me. Super friendly and quick service, good food, ample parking. We'd return :)"], ["Wendy H.", "The French onion soup the best ever had, a lot of crispy cheese on top, and more gooey cheese below, lotsa melted onions.crispy calamari was tastey didn't even need the dip. The pasta was a little too aldente for me but the pesto sauce was yummy & got 2 big meat balls to go w/it. Will be back another time to try their dessert . The portions are large so easily family style dining."], ["Jessi C.", "This place was honestly awful...I don't know what any of these other reviews are thinking...The Alfredo dish they offer shouldn't be called Alfredo....it's noodles with heavy cream and garlic and no flavor. The chicken parm is mediocre at bestThe French onion soup was good But the service was awful...I've been out of water for about 20 minutes and there is nobody here  Don't waste your time. It's also expensive. I recommend Aunti Pastos in Kunia. That place rocks the house."], ["Mak L.", "Went for lunch and I was impressed. We started with French onion soup. It was so delicious! A must have indeed. I had the grilled fish sandwich with salad  and my friend had the eggplant parm with caeaar. I tried the eggplant parm and it was very flavorful! My fish was perfectly cooked and season. I didnt care for the salad or the dressing though. Maybe i am just not a fan of tomatoes and olives. But overall the food was great.  I will definitely go back to try more selections. Parking was pretty easy. The service was good. I think there was only 1 server to run the whole place. I think he did great because the place was pretty packed."], ["William G.", "Decided to drive through my hometown of Kailua the other day. Passed by this place and decided to drop in and grab a bite to eat. Let me just say that this was the best decision I made all day. It was a sunny Saturday afternoon and I was greeted by the owner Steph. She welcomed me and sat me down and recommended a few drinks. I ordered the Greek Bella Burger. The toppings and sauces used in the burger were just right. The french fries were crisp and delicious. It was so good that I decided to come back this morning and try their Sunday Brunch. If youre in Kailua, this place is a must!"], ["Chris C.", "Wow! Decided to try brunch here and couldn't have been happier. We were seated immediately, and given fresh coffee and muffins right away! They have a comfortable outdoor dining area with a nice breeze (I noticed some space heaters too in case of a \"chilly\" Kailua night.)We ordered a veggie omelette and french toast. The omelette was delicious, with crisp potatoes on the side. The french toast was also great (made with Portuguese sweet bread!) and came with fresh strawberries. Not only that, but the presentation of the food was beautifully done. Definitely a top pick in the Kailua brunch scene. A combination of casual atmosphere and gourmet dining. Looking at these other reviews, we'll be sure to come back for dinner!"], ["Robin K.", "The best dinner I have had out in a long time! Amazing rib eye cooked to perfection.  Salads were exactly the right size although larger than most.  Our waitress Jade was incredibly tentative and we didn't once have to look for her. She was perfect. Love that the owners were available and paying attention. The entire staff looked like they were excited to be here. So rare these days!Thanks for wonderful surprise! Bella bistro is a hidden gem in Kailua town! Robin and wade!"], ["Rob B.", "Food was excellent, from the blue crab artichoke dip, to the fish specials, to the delicious deserts.  The parmesan opah was especially tasty.  Nice size portions and well priced!  Highly recommend this restaurant and can't wait to go back!!"], ["Val G.", "We had a very large party last night and we were not all able to sit together. Our servers were really nice, CAN'T say that about the food!!!!! If it wasn't for the entertainment JP Smoketrain we would've left!!!!! Thank Goodness for the entertainment. I will not go back there again!!!! I'll sit outside and listen to him jam"], ["Weier A.", "This is the first italian restaurant on island this island that I love!! The food is so flavorful and delicious. I had the chicken picatta and the sauce was to die for. The environment is layed back and relaxing with outdoor seating. We will definitely be back!"], ["Nicole K.", "Bolstered by wine at a wine tasting earlier, my friends and I were craving some SPAGHETTI!  Unfamiliar with Kailua and what it has to offer, our resident K Town friend suggested we head to Bella Bistro.  Thank you Lindsey S. for introducing us to this Italian gem in Kailua! Located on Hamakua Drive, Bella Bistro is a cute little eatery with outdoor seating, twinkling lights, and AMAZING food.  There was ample parking when we arrived and we were seated immediately upon entering.  The menu listed a variety of pasta and main dishes - all of which looked drool-worthy.  I am definitely going back to try their Alfredo Campinelli!  My friend and I decided to split the Braised Lamb Shank while our two other friends ordered the Grilled Seasonal Fresh Vegetables with Polenta and Flat Bread Pizza of the Day.When our order arrived, I was pleasantly surprised to see that the waiter had already split our Braised Lamb Shank into two separate plates, each garnished perfectly!  What wonderful service!  The braised lamb was so flavorful and tender.  And even the polenta, which I am not a huge fan of, was gone by the end of my meal!  Everyone at our table seemed happy with their meals and especially happy with the service!  If I'm ever in K-Town again, I am definitely stopping by."]], "Leo's Taverna Express": [], "It's Good and Healthy Café": [["Cynthia N.", "I haven't eaten here in a while and I didn't know they changed owners since I was last there. I suspected something different after a couple bites. The hummus has a sour after-taste as though it was old, and it was served cold. The pita bread was not warm; it was stale. My chicken kebab tasted like it was pre-made and re-heated in the microwave. Only the salad was enjoyable. I didn't have to wait as long for my order to be ready, but for the quality of food I got and the price I paid, I won't be back. Wonder why the previous owner left??"], ["Lyn S.", "I was very disappointed on my visit today. I don't know what happened w/ the quality of food, but it used to be so good. The rice was bland, the hummus was runny and the tabbouleh was more like a mound of minced parsley with the after thoughts of tomato and lemon juice. This is my second negative experience with the food since the change in shopkeepers. Sad to see the food quality go down in comparison to before."], ["Nadia W.", "Food was very good. Portion was huge. I noticed after i had placed my order that smaller portions are available which I will order next time."], ["Jan H.", "What happened to this place?! My favorite dishes have changed (for the worse) and the prices have gone up.  My beloved chicken tarna is dry and over seasoned.  The rice that is usually a bit mushy (but in a good way) and full of flavor was dry and hard.  And the salad dressing? No flavor, just oil.  This food wasn't bad, per se.  But, it's not the fantastic lunch spot I knew and loved."], ["Nikki V.", "Great spot for a delicious Lebanese lunch! Look for specials (which always come with mini size as well). Usually less crowded after 12pm though anticipate a rush prior to noon."], ["Denby R.", "Review 5 of 31 for the October yelp challenge (started late so catching up)I have been here a couple of times now......If I worked in town or if they were open on weekends it would be MUCH more frequent......but now I have to scramble downtown any chance that I can on a work day. I love the Vegetarian Plate (see picture). My husband and I were sitting there one day, enjoying our lentil rice,  tabbouleh, and falafels when these two girls walked in. They ordered their plates without hummus. The younger guy behind the counter asked why they didn't want to have the hummus, to which they replied, \"it's gross.\" He asked if his hummus was gross. They admitted that they had never had his hummus, but other places they have tried before was less than desirable. He brought out two spoons of hummus and asked them nicely to try it. They did...and both ended up ordering their plates with the hummus. They sat outside around the corner, and as we left they were both slathering their pitas in hummus and grinding!Anytime someone (and their food) can change a person's mind (or people's minds) about a type of food that has a negative stigma, without belittling their feelings, is a wonderful thing to watch. The guy was smooth in promoting his product and providing a great customer service....the girls now know that hummus can be delicious.Reuben M. said it \"great food + great service = great rating\""], ["Julie E.", "Stopped here for lunch the other day and got the Chicken Tarna as recommended by some other yelpers. It was pretty good. The hummus was delish and I got double salad instead of the rice. Chicken was well seasoned (a tad dry) and the side of pita was fresh!I would call ahead if you are getting close to their closing time (3:30?) because I think they close early if they are running out! A couple small tables to eat at if your lucky. I will come back and look forward to trying the Lamb Kabob next."], ["Ryan M.", "I go through different lunch phases and right now I am on a Mediterranean phase.  I have been hearing about friends and co-workers talk about this place from time to time but I never really (as Wayne S. says) \"pulled the trigger\" till now.  Food - Good-The first 4 people in front of me all ordered the: -Gyro Pita Sandwich yelp.com/biz_photos/QiiQ…I wanted to be like the cool people in line so I decided to jump on that train too. The gyro sandwich overall was pretty good. The best part of it was the pita bread.  It comes out at the right temperature and is toasted perfectly. The gyro meat and the yogurt sauce were both good. The only down side of  this sandwich was the amount of lettuce they use.  As you can see in my picture its over loaded in my opinion. On my second visit to this place I got the:-Vegetarian PlateI am super duper far away from being a vegetarian but I was really curious about the stuffed grapes leaves and the falafel so I went for it. Holy COW it was super duper good! The falafel, stuffed grape leaves and rice were great. The pita bread and hummus was good as usual. The salad thing was okay but not my thing. They give a lot and it fills you up. Service -  Great-The guy that runs the front who is (supposedly) the son of the owners was just as friendly as all the other yelpers said. When I arrived there was a bit of a line but it moved very quickly. He has a way of taking charge of the line while still being really friendly to you at the same time. Meaning, I didn't feel rushed. Food comes out very quickly as well. I was watching (Who I think is) his mother make the food and she was moving at lightning speed. This place is about an 8 minute walk away from my office and the total round trip took me 20 minutes with a line. That is exactly the kind of quick service you need when you are on a lunch break. Environment - Tight-They are located on Merchant street across from the CPB and Great Harvest Bread Co in an alleyway of eatery's. That alleyway can get pretty crowded during lunch hour so make sure your standing in the right line if there are lines. They actually have a few tables in there and a few on the outside but it seems like most people do take out. If you don't work or live in downtown then you will have to do street parking. Overall, I'm glad I finally tried this place. Will be coming back for the plates."], ["Lori G.", "What happened to this place?  The food used to be very authentic and it was operated by a hard-working family which really reflected in their great food!  At times, I would have to wait in line but it was worth it.  Today, I find out there is a new owner.  Food is not authentic and was warmed-up in the microwave as partly-warm, partly-cold.  The flavor is gone!  Where did the new owners go?  They were the people to follow!"], ["Lora H.", "Now under new ownership.  It is definitely not the same anymore.  The Lebanese family who used to own it no longer does.  Not sure where they went... The food is not the same, the service is not the same.  I went to get their Greek special.   It usually comes with falafel, grape leaves, couscous, babaganoush, tzatsiki, and hummus.  The guys tells me they are out of grape leaves and if it would be okay for me to have extra falafels instead.  I agree.  So I wait for my plate.  I've been here before and I know how many falafels I'm supposed to get on my plate.  I see the plate come out.  And the plate comes out with the extra falafels as it was supposed to.  He opens the plate and I notice he takes the extra falafels out.  I thought, perhaps I had extra extra.  So I take my plate and walk back to my office.  I get back to the office.  I have two falafel.  Um... that's it.  No grape leaves and two falafel.  Yeah.  Totally ripped off.  In addition to that, I'm also missing my hummus and my tzatsiki.  I walked back and took my plate back to him.  He doesn't apologize.  Gives me attitude,  like I'm wrong.  What a jerk. I'm NEVER going back to this place again."], ["Jennifer S.", "One of my favorite lunch spots downtown.  Best hummus on the island!Located in a hidden shopping arcade between Alakea, Richards, King, and Merchant, near the downtown Post Office.  Family-owned, and the family has a lot of personality.  Lunch plates (protein with rice, salad, hummus, and pita) run $9-10, sandwiches $5-6.  They do take credit cards, and have apparently updated their system since a prior review, because they do now allow you to write in a tip if you use plastic.I've had the chicken tarna plate, which gets glowing reviews here but has been my least favorite item so far.  The felafel is delicious, either as a sandwich or a plate - but go early because sometimes they've run out (which is how I wound up with the tarna).  I prefer to opt for the plate, because hummus!  Don't expect an ordinary rice pilaf - Good & Healthy's rice pilaf is a very soft rice-and-vermicelli mixture that is closer to a risotto.  The combination kebab plate is perfect if you can't decide.  My favorite (besides the felafel) has been the Friday special steak kebab plate.  No matter what you choose for lunch, definitely add an order of baklava; it seems to be much less buttery than is traditional, but no less delicious.  Perfect balance between shatteringly crisp and syrup-soaked.Some tables/seats inside and outside, but most of their business appears to be take-and-go.  Efficient service, so if the line extends out the door, do not fret - you'll be in and out within minutes."], ["Lai T.", "I was so happy to have finally made it in time for lunch at It's Good and Healthy Cafe on last Friday.  Even for a directionally challenged person, such as myself-it was rather easy to find.  The shop is small and the employees there are friendly.At $9.00 (Gyro Plate) and $9.25 (Chicken Tarna Plate)-my initial impression was that the food was a bit pricey.  However, I could not finish all of the food on my plate in one sitting.  I had a small bit of the Gyro meat because I'm not really a fan of lamb (their Gyro meat is a mixture of lamb and beef).  While the meat wasn't overly gamey, I was glad that I had opted for the Chicken Tarna Plate.  My bf seemed to enjoy his Gyro Plate.The Chicken Tarna had a small hint of lemon to it which I really enjoyed.  Underneath the chicken was a bed of soggy rice.  I know my description of the rice doesn't make it sound too great, but I actually really enjoyed it.  Because it had absorbed the chicken flavorings, the rice tasted like rice that had been cooked in chicken stock.  I piled my pita bread high with a little bit of everything (Chicken Tarna, soggy rice, Tabouli) and it ended up being quite a tasty mouthful :)I also ordered 3 Falafels ($1 each) and they were okay.  A bit on the dry side, but not horrible.  Not sure if I'd order them again though.The food came out quickly.  While I was standing there debating on what to order, a lady smelling of cigarettes walked past me into the kitchen.  I was a bit alarmed that she was the one working the kitchen-but she did have gloves on and the shop is very clean (they even have a large hand sanitizer bottle in the front for you to use) so in the end, it was no big deal. Since this is off Merchant Street, I opted to park at the meters in front of the post office nearby.  Note-those meters max out at 30 minutes.  I totally goofed and kept feeding the meters, thinking I was dropping in the wrong coins :p"], ["Leslie A.", "I was surprised when I walked in and there were new owners.  The menu is exactly the same.  I ordered my usual, the chicken tarna plate with tabbouleh.  The chicken tarna tasted the same as before, so I was happy that I got my tarna fix.  I was a little disappointed with the rice -- it wasn't as flavorful and the portion of rice was about half the size as before. The tabbouleh was a little denser than I remembered -- lacked bulgur. Still an a-ok place to eat."], ["Rni M.", "I learned that this restaurant is under new ownership and food isn't as tasty as before.  I was disappointed to hear the former owners retired and moved to the mainland.  I've always ordered the chicken turna and yes, portion size is not the same."], ["Will L.", "A few weeks ago, a friend of mine transplanted from the mainland wanted to have lunch but said in desperation, \"can we go somewhere that's not miso, shoyu or teriyaki based?  I'm tired of eating this 24/7 for every meal.\"  We wound up going to Downbeat Diner.  I didn't think too much of his comment but he must have planted a seed in my mind as yes, today, I had a thought that I did not want to eat anything with the miso/shoyu/teriyaki tinge.  On the other hand, I wanted to eat something healthy, which is hard to do in downtown with a sea of greasy plate lunches.I've eaten here before but perhaps my jaded mindset for Asian food allowed me to see Good and Healthy Cafe as an oasis.  I started off thinking I was going to go to The Deli and grab a gyro sandwich (I've reviewed it and it's delish) but The Deli doesn't take credit card so I opted to go across the arcade hallway.  Good and Healthy Cafe is a Lebanese place but has general Mediterranean fare (kebabs, gyros, falafel, lamb, etc.).   Not sure if the meats come off a schwarma (the rotisserie spits that you see at Middle Eastern places) as I did not peer into the kitchen.     Well, healthy non-miso based food, get into mah belly.  I ordered a chicken kebab combo for $9.25 and it  was righteous.  There were two gently spiced skewers of chicken, a decent salad with three big slices of tomatoes on it (which helped with the notion that this wasn't a throwaway salad), an ample side of hummus, and the skewers over a bed of rice that was perhaps buttered or marinated with olive oil (not sure what it was but it was flavored; if buttered, the healthy quotient goes way down).  Add in a pretty big piece of pita bread and we have a happy Yelp reviewer today.  See my pic of my plate.  I'll probably be back eating some terikyaki BBQ chicken at Sushi Kahuna or spicy ahi bowl at Ahi and Vegetable soon enough, but today was a nice diversion."], ["Justin U.", "regular  Adjective - Arranged in or constituting a constant or definite pattern, esp. with the same space between individual instances.Noun - A regular customer or member, for example of a bar, store, or team.Synonyms - adjective.   ordinary - normal - usual - steady - orderlynoun.   patron-------------------------------Yup, that's me alright.  The man knows my order down to the 'no cheese, extra dressing' request."], ["Amy P.", "Amazing food, friendly and quality service! Definitely a local secret! Will be coming back during our visit!"], ["Scott H.", "New owners.  Used to have the best pita and hummus.  Now, the hummus tastes store bought and the pita is terrible.Gyro meat was alright, but everything tasted store bought.  Can't recommend this place anymore.  Sad."], ["Caroline F.", "My go to spot whenever I'm craving a Gyro!I'm so happy that it's just across the street from my work building. Literally just a few minutes of walking.The place is a super small joint, about 3 tables of indoor seating and a few more along the hall outside. Of course, the outside seats are limited since they share the tables with other food businesses located within the halls as well. I've always ordered the Gyro Pita Sandwich.. So I can only rave about that dish. And let me tell you.. It is delicious. It's also priced reasonably - $6.50 not bad. I'm still debating whether or not to try another dish, but I really love my Gyro!! Maybe someday I'll be brave enough.. We'll see.The cashier guy who took our orders is really nice too. My friend had to use the restroom and although it's for employees only, he let her borrow the key to use the restroom located upstairs.I definitely see myself eating here more often!! Just thinking about this place makes me want to eat here for lunch tomorrow!!"], ["Kekhili A.", "I used to eat here quite a bit.  I have not gone for a couple of months because its a few blocks from where I work but today I was in the mood for a gyro plate.  I think they changed ownership because when I walked in I did not see the usual family or any of their pictures on the wall.  The menu is still on the wall.  My food was not very good.  I didn't eat very much of it.  The rice was very soggy and the hummus did not taste right.  The beef/lamb meat tasted like it was either undercooked or reheated or something :(  I am very sad because this used to be one of my favorite spots to eat.  You could always expect exceptional service from the man who used to take orders and their baklava was excellent.  I will not be returning."], ["Carly H.", "2.4.13Honestly, I was reallyyyy craving pizza today...but that didn't happen and I'm SO thankful that I didn't pursue that craving because I never would have discovered this little piece of Lebanon in downtown.Not quite a \"hole in the wall\" but nonetheless this place is tiny! It can be hard to find if you aren't working/living in the downtown area. Its located in the building behind the Hawaiian Electric building or across from the Central Pacific Bank building in an \"alley\" of eateries called The Arcade.When I first walked in I was kind of surprised. The interior was decorated in what I assume was an attempt to bring a little bit of Lebanon to downtown; ivory walls that were painted to look like worn stone, brick molding and a couple posters and pictures--all of this effort made me like the place instantly. If you've read the other reviews, the seating area is somewhat cramped and awkward--I would suggest take out. There really are only two tables that are a few feet away from the deli-style counter.Aside from the cramped conditions, the father & son run operation also makes me a fan of this place. Both gentlemen are super nice (and obvi they make great food)! If you pay with your credit card (Visa/Mastercard), they'll refer to you by the name on your card haha.On to the food...basically, if you haven't been here yet bookmark it! After reading a couple reviews my craving for pizza was forgotten and I couldn't wait to sink my teeth in a yummy gyro! If you can't decide what to order from the other helpful reviews and pictures, there are also pictures of the plates at the cafe. I went with the gyro plate ($9 even) and comes with everything you need to make one loaded gyro. If I were to order this again I would order a couple of extra pitas because for me, this thing could have made three decent sized gyros. This plate comes with a salad with some sort of awesome dressing and tomatoes, hummus (unlike any I have ever tasted before), 1 pita bread, and 6~7 strips of lamb over a juicy, moist rice pilaf.I can't wait to come back here again. I don't even want to think about trying the Greek place across the way! I guess I'll have to see :) hahaYelp 365 Challenge: #035/365"], ["Sarah K.", "We stopped by here right after lunch to get some greek food. We are both new vegetarians, so we were hoping for some great veggie options that didn't make us crave gyros so badly....We arrived right after lunch rush, which apparently can get pretty crazy. The man behind the counter is also the owner and he was very helpful and friendly. They had sold out of a few things, including the falafel by this point, but he had what we were looking for. We both enjoyed two different veggie plates and they were both delicious! I truly enjoyed the tabouli I had and we double enjoyed the baklava. This place is small and they can only fit about two tables inside the small shop and a few outside. So, if you arrive at lunch rush, you can use that opportunity to eat the dish outside in some of the parks around the area. Bottom Line: I recommend this place for Mediterranean food. With great food and good service, it's the place to go for this."], ["Fabian S.", "Good portions at a decent proce!"], ["Andro T.", "Junk falafel, junk hummus, what happened?Went in based on good reviews here on yelp - falafels were very dry and tasted like frozen ones. The gyro plate was so so, the meat was not moist at all.  Most distressingly, the hummus was thick and very dry and the pita bread was chewy and thick.Overall, very poor showing, especially in comparison to other similarly priced Mediterranean options within walking distance.I'm going with the harsh one star because like all lunch spots downtown it is very pricey, I might give  two stars if each plate were in the 6 $ range for value."], ["Julia S.", "Just ate here today with the boyfriend and loveddd it so much I wanted to yelp it! It took us a while to find it with all the one-ways chinatown has. It's INSIDE of a complex, so find street parking nearby and walk inside! The building has a list of the mini stores located and the last one listed is this place.It's small, and got packed quick since it was around lunch time, but they're pretty fast at bringing out your food! Since it's a family business the service isn't the best since they have to bring out food so quick to hungry people. But the service isn't what you come for. (They were super nice though if you were wondering).I got the lula kebab plate and he got the chicken tarna. With a diet coke and pepsi, the bill came out to $18! So good :)There's outside seating along the hallway so we ate out there. OH JEEZ so much food! And yummeh food! Our plates came with rice pilaf which was perfectly seasoned, thick piece of pita bread with LOTS of hummus, and a nice greek salad. We only finished half of our plates and saved the rest. Best greek food i've had so far on the island! The hummus and pita was so good on it's own! Definitely worth the hard to find parking, and the walk you'll probably take will be nice after the big meal!"], ["Est T.", "I'll consider myself an expert due to the fact that I'm Armenian. :) I must say, their food is pretty spot on! The spanakopita is always so tasty and fresh. The rice has a nice buttery flavor but it's not overwhelming. I've noticed that they recently started having baklava, which I need to get ASAP (maybe even tomorrow).  The dude who is always working during the week, is super friendly! My onlyyyy complaint (and just because I'm obsessed with them in general) is that the dolma is just mehhh. It might be canned...but I'll still eat it!"], ["Hillery P.", "Haven't been here for a while but was craving their vegetarian plate so I headed down here looking forward to the combination of lentil rice, stuffed grape leaves, falafel and hummus. Surprised to see new owners and was wary that it would not be as good. Turns out it was worse than anticipated. The grape leaves were so tough, you could not bite into them. I opened them up to get to the rice stuffing, which had half cooked kernels of rice in it. The falafel had no moisture what so ever. The lentil rice is lacking in flavor and half the amount. The hummus is still good. I haven't tried Leo's Taverna in a while. That's where I'm headed the next time I want a gyro. RIP the old Good and Healthy. I will miss your food."], ["Jennifer K.", "Yummm! I love Meditteranean food..I'm gonna try to keep this brief since I'm reviewing this on my lunch break..i know..most of my posts are the opposite of brief -__-This place is right across from work (diagonally) so I'm glad to find it. The portions are huge (for a short Asian girl at least) and delicious. The guy there recommended I try the chicken tarna so that's what I got and NOW i'm gonna recommend you go and try it..comes with a mushy rice (i'm assuming it's meant to be mushy and I'm just not cultured enough to know) and pita bread and hummus and a salad..and the chicken too of course. Now i'm not sure how to eat it but no matter how you eat it, it's good. You can be like me and rip up the pita into small pieces dunking it in the hummus and piling it with chicken or you can be cultured and eat it the way you're supposed to (let me know how!!)..Be regardless of how you eat it...TRY  IT! :D okay im done..brief right? :POh you might want to know how to get here...haha that would prove to be important. It's across from Central Pacific Bank on King St...look for the Subway next to the building with the blue overhead things (I'm not sure what they're called) and it's a few shops down from Subway in the little alleyway."], ["Maka K.", "I had the hardest time trying to find this little place, but I was really intrigued by the other reviews and their menu options, so I put in the effort to walk around and try to find the place (thank god for yelp and pictures that people post). It's a seriously tiny little place. Inside the shop, there are only three tables, two chairs per table, and the chair nearest the door props the door open, hahaha. But there a couple more tables just outside their door, so it's fine. BUT the door is down a hallway in a building that I would have seriously passed right by if I wasn't actually searching for this place.Also, they're only open for lunch hours (11am-2pm) during weekdays (M-F), so if you're going to go there, make sure you give yourself enough time to find parking and walk there before they close.That little issue aside, the food was great! I ordered the mini chicken tarna plate, which came with rice pilaf, tahini, hummus, half a pita, and a small salad. My dad got the mini falafel plate, which came with twice as much salad as mine (instead of the rice pilaf), half a pita, hummus, and twice as much tahini as mine as well (mine came in a small plastic container, his filled up one of the side dish wells of the plate). I don't normally eat rice anymore (too many carbs...), but that rice pilaf made me wanna eat all of it. Other than what we ordered, they also have a vegetarian option. I also just have to say: It has been SO LONG since I've seen those grape leaf rolls and baklava! LOVEWe had a chance to speak to the owners while we were there. They legitimately moved to Hawaii from Lebanon, make all their food from scratch (you can taste it), and they're very friendly! I will definitely return one day soon"], ["Alexander G.", "Healthiest and freshest Mediterranean food in the city! Great value for the money, friendly staff."], ["Fe B.", "I was shooting recently at the heart of the financtial district in Honolulu and found \"it's good and healthy Cafe\" this is the real deal, home made lebanese food. They even make their own baklava! A must try!!\"It's good and healthy\" is a family owned business, mom and dad are the cooks. Hovig, the son runs the biz with extraordinary customer service.  Food is delish! They deliver around down town."], ["Jeremy N.", "Against my better judgement I went back to this place.  I've had the falafel before and it was dry, lacked flavor, and was cold.  Those of you who've experienced falafel outside of hawaii know that it can be the food of the GODS if done correctly.  Anyway, I was checking Yelp and saw that they have 4.5 stars.  SURELY I must be missing something, I thought.  I'll give them another chance...Bad idea.  I got the gyro sandwich.  The meat was cold and seemed like it hadn't even been cooked on a spit.  There was no juice sweating from it, no char or crust; nothing to indicate that a pre-cooked slab hadn't just been left to thaw on a kitchen counter and had pieces hacked off of it and directly put in my sandwich.  They even had a spit on the counter up front that was conspicuously empty.  Well surely the home made tzatziki must have been good, right??!  I literally did not see a drop of sauce on the entire sandwich.  Fool me once, shame on you.  Fool me twice, shame on me."], ["Little D.", "One of my favorite lunch take out restaurant.  There is a slight price change recently, but still, you will be pleased by the quality and the quantity you get for the price.  The sandwich is the right amount for one meal.  The plate lunch is for two, you could eat at once but you will be sorry, and I have been sorry for over eating...My favorite order: Lula plate lunch or Vegetarian Plate.  Bakalava!  Customer service:  Very goodI wish they are open on weekends. YELP 365 - 337/365"], ["Michelle G.", "Enjoyed our meal here; hummus is tasty, but I've had better at Leo's TavernaIt's a small \"old in the wall\" type of place; which is my favorite kind of place.  Worth a stop if you are in the area."], ["Sarah S.", "We used Good and Healthy to cater lunches for the summer camp I work at, and it was a nightmare!  Good and Healthy consistently delivered far less than the promised amount of food.  For example, for thirty people, we occasionally received thirty pieces of pita bread, but sometimes we only received fifteen and with our last delivery we only received four!  We stopped using them before the end of the camp because of their poor service, and I only wished we'd stopped sooner.The quality of the food wasn't the main problem, but it definitely wasn't too high.  Extremely dry falafel, an unrecognizable baba ghanoush...the shawerma at least was tasty.I don't know how the restaurant experience is, but think twice--then think a third time--before your order catering from here."], ["Liz S.", "When I went most recently, I learned that the cafe was under new ownership.  Figured it was still worth a shot  to order the falafel sandwich since I was already there.  Unfortunately, after tasting it, I felt as if I had wasted my money.   Rather than being crispy, it was soft and did not taste good to me. Never went back so my updated review is based on just one visit under the new ownership, but there's too many other good places to eat downtown for me to revisit this one."], ["Stefanie D.", "I just want to write another review commending the exceptional customer service and staff here. Today my friend managed to spill her entire brand new venti soy macchiato concoction from Starbucks after just one sip--EVERYWHERE!!---during our lunch. Even though this place is tiny and there's a line out the door at its busiest time, the man always behind the counter here (forgive me!!! but I can't remember his name) came right over to us with a cloth towel, napkins, and paper towels and quickly cleaned it all up and if he was at all annoyed by the accident, it never showed. Thank you again for delicious food, great, prompt service, and the friendliest staff."], ["Alice B.", "I have been waiting for them to reopen, and I finally got a chance to try it. I got their spanakopita which had a little more pastry and a little less filling than it probably should but it was good all the same. Solid pita and hummus as well as a really nice garlic and oregano dressing on the side salad. All together a good lunchtime meal for $7.95. I am keen to try their combos especially as I saw they do minis."], ["Joy N.", "I really like this little hole in the wall lunch place.  This is run by a family and they treat everyone like family.  I LOVE their gyro salad and side hummus."], ["Tiffany L.", "Tiny little hole in the wall deliciousness especially if you're craving middle eastern food. The plates are large and filling definitely enough to break into three small meals. The hummus is great. I got the chicken plate but definitely gonna try the gyros next time."], ["Chris Z.", "New ownership. Food quality has quickly fallen from good to not passable.  The meat Portions on the sandwich was much smaller.  I miss the old owners and hope they are going well.  Too bad as this was one of my go to places"], ["Nicole R.", "I love this sweet little family-run lunch spot. The food is EXCELLENT, the service couldn't be more friendly and it's super convenient. I just walk down the street from my office and in 5 minutes I have some of the very best Lebanese food I've ever had.I'm a bit of a repeater-eater so I almost always get the same thing here: chicken tarna with a substitute of extra tabouleh and salad instead of rice. This place is definitely good and healthy! Plus the prices are great - my lunch plate is just over $7. Total bargain!"], ["Thea B.", "This place is awesome! I was craving Greek food and decided to try this place because of the reviews and I've never had Lebanese. If you don't know where its located that can be a small challenge.. its down a hallway of the corner building and that hallway is open on both sides. super easy to order because there is a photo wall.  They do take cards visa and MasterCard. We ordered the chicken plate and the veg plate with a side of couscous. All the food was delicious and the bread so fresh! My boyfriend had never had Greek or Lebanese food and can't stop talking about it. He's into healthy and said this food was filling, flavorful but didn't give you the gross feeling of eating shitty. I also got desert on the way out...the baklava...it was fresh;) soooo good! Will defiantly come back."], ["Janelle K.", "This place is my GO TO for lunch.  If i could afford to buy lunch every day, it would probably be a gyro salad from here.  The vegetables are SUPER fresh from the romaine to the cherry tomatoes and cucumbers and red bell pepper.  It comes with a generous portion of feta cheese and two kinds of dressing - a feta vinaigrette and a tzatziki type yogurt dressing.  I love this salad especially in the summer on hot days when you don't feel like eating a ton of grease and then having to go back to work!  This is a family owned and run business - mom, dad and son - that are very friendly.  There are only 2 tiny tables inside so most people takeout.  At lunchtime, there is a line out the door because everyone loves this place.  If you haven't tried it yet... what are you waiting for?????  ;)"], ["Z Z.", "Temporarily closed with no explanation.  Hmmm. I wonder if they were forced to close."], ["Brian A.", "This place is an awesome hole in the wall with the best falafel I've found in town. All kinds of delicious Mediterranean (their sign says it is a lebanese cafe) dishes, I've never tried something here that I didnt love. Watch out though, its a lunch place and right around 11:30 people start piling up out the door (there's pretty much no space inside the cafe, just the counter and like 2 or 3 tiny tables). Lots of regular repeat customers (like me) who all seem pretty happy.Small, family owned, extremely friendly, and delicious. Can't ask for much more in a lunch cafe."], ["Da H.", "Decent food.  Wonderful customer service.  They were very helpful, positive and helped me get a discount online."], ["Natalie K.", "NICEST family runs this place!  Also, this was, sincerely, teh prettiest food I've ever received in a styrofoam take-out box.  Very delicious, I will be back as soon as I can (in town on a weekday)."], ["Satoru Y.", "Great Mediterranean for the downtown crowd.I really miss this place.  I'm rarely in downtown during the workweek nowadays, and this is definitely one of the regular spots I miss.  I love the Tarnas plates, and it's also a great place for Gyros.  Of the daily specials, the ones that I love the most are the Euro Salad (Gyros, tahini sauce salad), Couscous (great flavorful couscous), and the Tri-Tip Shish Kebabs.The father and son who run the place are very personable; more the son since he's in the front more.  The place also has great veggie options too.  This was one of my fave 3 (now 2) Mediterranean places downtown: The Deli and (now closed) Kafe Europa.A great treat for anyone in the area during the work grind."], ["Rissa M.", "Found this place on yelp, because I was sick of all my usual places in Down-Town (yes its possible).  MmmMMmm Mediterranean food ya say?  Hawaii doesn't have many options for it, so I decided to take my chances here. I ordered a Falafel Plate, and it came with a slice of pita Bread, tomato, lettuce, a whole compartment (refer to pictures) of Hummus, and a whole compartment of tahini sauce.  They give generous portions here, and the prices are very reasonable.  The falafel balls were like half the size of my fists! Humanggussss.  I couldn't even finish it all. And that is saying a lot for me, because my appetite is more appropriate for someone who is twice my size and weight! All this for only $8.50.The falafel was so good.  Kinda dry, but actually I was recently reading up on the correct way to make falafel, and the drier it is, the healthier the falafel is for you (aka. did not deep fry in tub of lard). Didn't really matter to me, because the tahini sauce was a bit tangy, and mixed with the hummus..it was perfection. I've definitely had better falafel before on the mainland, but seriously, it's Hawaii and people here aren't exactly \"cultured.\" (I'm not).  I think this place did a good job of simplifying the dish, and making it less intimidating, while staying true to the flavor.The staff was super friendly, and my food came out literally in a minute! (probably because of what I ordered)Some side notes: 1. This place is hidden in the arcade area along with other little grab-and-go food places.  You will have to walk through a hallway to find it.  Just look for the Subway off of king st, and go through the entrance there.  2. Parking is a pain... but if you work in downtown, it is very convenient! Very pleased with this place, but I will have to try more of the items on their menu before they can get a deserving 5-star."], ["Gloria S.", "I liked the friendly service and the healthy food!  Come early since they have limited seating area.  I had the Combo Kebab which consisted of a boneless chicken kebab, 1 marinated beef with onions kebab, Babaghanoush, rice pilaf, hummus, pita bread for $7.95.  The rice pilaf is on the sticky side. I highly recommend the chicken kebab!  Yummy! I also had a taste of the Baklava and that was good!  They don't put honey on their Baklava, but it was amazingly delish!  I'd walk over there just for that!"], ["Tania N.", "I used to have lunch at this place at least twice a week.  Unfortunately that has changed.  Today I thougght I should give it another try, after all what can go wrong with a Gyro Sandwich?? Well, it can!  The gyro sandwich had cabage mixed with the salad and very little meat.  If they could just be consistent... I really wish they could get this fixed, because we do need more Good and Halthy places downtown, but this was my last time!"], ["Fareeha K.", "I am in town for business and was craving some greek or middle eastern food, so I was quite happy to find this place a few steps from my office. I got the lula kabob plate (ground lamb/beef kabobs) and they were juicy and fresh.  I also got some falafel a la carte (the owner let me sample one since I am a bit of a falafel snob) and they are authentic and fresh - unlike a lot of restaurants that try to pass off boxed falafel mix (super gross).  I will definitely make this a go-to lunch place when I am in town.  Hopefully they have grape leaves next time for me to try (they were out today)!  Note: this is not the best lebanese food I have ever had so I would normally give it 4 stars; BUT it is the best you will find on the island so that is where the 5 stars comes from.  Enjoy!"], ["Austin B.", "I'm not sure how healthy this place is because of the amount of food they give you in a plate, but I shouldn't be complaining. This place serves good food, and the owners/workers are really nice.Likes: They give you generous portions here. When I get a plate, I can  eat about half to 2/3 of it and save the rest for an afternoon snack. They also serve a lot of the dishes with their excellent hummus.Dislikes: If I had to nitpick, I'd say the yogurt sauce they serve with the gyro plate is a little too minty for my tastes, but that's just me.Favorites: I like the gyro plate, even though the sauce has a stronger mint flavor. It comes with some salad, gyro meat, rice pilaf, a pita, and best of all, their excellent hummus. I LOVE their hummus and I order a side of it once in a while to mask the carrot sticks I force myself to eat. If you're looking for some good Greek/Lebanese food in the downtown area, this is a great place to go. Friendly workers, generous portions, and deliciously smooth and tasty hummus."], ["Leimalani F.", "Its good and Lebanese!That's right, Lebanese also eat hummus and stuffed grape leaves - imagine! I basically am in love with the plates here. $9 for a gyro plate teaming with tasty beef/lamb gyro meat, rice, salad, hummus and pita. It's a no-brainer win win ovah here! Yes, you can get a gyro without the sides, but why? After all, hummus is the most important meal of the day! I also like to order this with all salad (instead of rice) and tabbouleh. Lamb kebab is $11 and includes the same as the gyro plate only with 2 lamb skewers instead of gyro meat. I only wish they made the Lebanese rice that has the noodles in it...Veggie plate is BOMB! They make fantastic babaganoush and the falafel is forgetaboutit! I also really enjoy the special that includes babaganoush, couscous, falafel, eggplant salad, and pita. Gyro salads are HUGE. If you haven't found this tucked away gem downtown, seek and thee shall find the bestest Mediterranean food Honolulu has to offer.NOTE: 3 tables inside and 2 tables outside. Eat your lunch outside one of the historic buildings downtown or eat with people's butts at eye level. Your choice. But if you do dine in, they serve your table and bring cold water. Parking... where? where? This is downtown Merchant Street, but meters are usually open at the Post Office which is only a 1/2 block away. Get some gyro and get your grin on!"], ["Roy J.", "For lunch I usually eat the usual two scoops of rice, mac salad and a fried meat of choice but I am on a diet now.  I have had salad the past two work days, while good, I am sick of it now.  A friend told me about this place and based on the pictures, it was exactly what I was looking for!  Healthy, but not salad!Even though there were a few people there, my food came out quick!  By the time I sat down, put my head phones on and selected a song, my food was ready.I got chicken kabob which was great.  I enjoyed everything on my plate, hummus, salad, chicken, except the.. rice.  The rice was like baby food.  I have ate at quite a few kabob places but this mushy rice was new to me.  It helped me avoid the extra carbs though.  In my opinion, most places in down town and Hawaii in general, do not cater to people trying to shed a few pounds, so this place gets extra points for that.Overall, this is an excellent place for lunch and a place I'd go back again.  Their menu is basic but everything seems good.  Next on my list is the gyro.  Finding it is a bit tricky because it is not visible from the street.  Once you locate the building, you have to go inside this corridor looking place, where you will find a handful of other lunch places.  Once inside, it is as small as a shoe box.  Any more than 2-3 people in the entire restaurant will feel crowded.  Definitely a take-out place."], ["Awesome 8.", "I think 3 stars is a tad too low for this place because it was pretty good and If I could I would give it a 3.5. I had a Gyro and falafel and both were good but the falafel was definitely better then average. I hear this place has other great items but until I try them this place gets a solid 3.5 and a repeat customer. Ohh and the price is great for downtown Honolulu"], ["Stephanie H.", "San Francisco Salad Co.,are you taking notes? Because this is how a salad should be done. Refer to picture of Gyro Salad above if you are more of a visual learner. Wednesday's special at Good & Healthy Cafe is the gyro salad, and holy mother is it awesome! Tender, juicy, seasoned gyro meat piled high atop their humongous greek salad. The salad itself consists of lots of feta cheese, cucumber, tomatoes, greek olives, bell peppers and it comes with their greek dressing and a side of tahini sauce. This thing is massive! Please do yourself a favor right now and go to Good & Healthy for their gyro salad and you can thank me later. Not only is their food awesome but the service is always great. It is family owned and operated and they are the sweetest people imaginable. It's always the same guy taking orders and ringing people up. Even when there is a line out the door he still manages to be warm and personable. Not only that but he also likes to see how people are enjoying the food in between customers. Today when I couldn't finish my salad not only did he offer me a bag but he wrapped it up for me and threw in some fresh napkins and plastic-ware. It's nice touches like this that allows Good & Healthy Cafe to always have a special place in my heart."], ["Scott D.", "Excellent food. Caring staff. Inconspicuous locale. Found this restaurant through Urban Spoon. The restaurant is located in the breezeway of the Arcade Building. Had to have Google Navigation direct me from the corner of Alakea and Merchant. There are about four tables, but I was able to sit at the restaurant. The order taker recommended the chicken. I got a side salad, hammus, pita marinated chicken and rice, with a can of Coke. umm, umm good. All about $11 Both the order taker and the owner asked how I liked my meal--they seemed to care. Would definitely  go back but limited seating could be a problem if you prefer to eat away from the office."], ["Sara T.", "My new favorite lunch place!  I'm working in Aliiolani Hale for the summer and this is one of the closest restaurants to me in downtown.  It's right next to Sushi Kahuna, so I sometimes have a hard time choosing between the two, but I always know I'll get much more full and satisfied at IGAHC.  I usually order the Gyro Sandwich with two falafel on the side (less than $9) or the Gyro Plate (a bit more than $9).  You can also get a Mini Gyro Plate ($7.75), which has all the same items, just smaller portions.The Gyro Sandwich is a perfect meal - wam, delicious pita, lettuce and tomatoes, tzatziki sauce, and some of the best gyro meat (beef and lamb) I've ever had.  It's not too salty or gamey, and it is never dry.  The falafel are pretty big (a little bigger than golf ball size) and so tasty with the tahini sauce - they complement the meal perfectly.The Gyro Plate is HUGE.  When I first ordered it, I was shocked when the manager handed it to me and it was way heavier than I expected it to be.  The entire plate lunch container was packed with food!  It comes with a generous portion of gyro meat, a green salad with tomatoes, a compartment full of hummus, pita, and \"Lebanese rice pilaf,\" which is a soft white rice made with broth and little cut-up noodles - not what you would think of as \"rice pilaf.\"  The tzatziki sauce was so good with the pita, gyro, and rice.  The older dad/chef is a bit gruff and kind of off-putting, but the younger owner/manager is extremely nice and a good businessman.  He even came outside by the tables to ask how my food was.  They also accept credit/debit cards.  The food is consistent, the service is fast and friendly, and the value is amazing.  There are not many places in downtown where you can get genuinely full for under $10, but this place never disappoints.  Just try to avoid the lunchtime rush hour (12-1), and get there before 1:30 if you want falafel, because they sometimes run out!"]], "Greek Marina": [], "Yamas Mediterranean Cuisine": [], "The Greek Corner": [], "Leo's Taverna": [["Whopper C.", "we once bought falafell's on a cold NYC day on the street for $1.50 , so good so, the chicken gyro and falafell sandwich are very yummy here.  to me, the food will always be fast food, and should be under $5.of course were in honolulu, so along with indian food, we must make do. owner seemed nice, and greek, somehow i like the type of food to be directly overseen by someone who is of the same nationality  myself ......"], ["Curtis C.", "From what I can tell, most of their products are shipped in already prepared from a franchise-like company called Kronos Gyros. Leo's along with several other Greek places on the island use the same company. So if you feel like you've tasted it before, you probably have! Nothing special in my opinion, I would much rather spend a tiny bit more money and go to the Olive Tree."], ["Rebecca C.", "love me the gyro value meal. but usually get it with a chicken sandwich. it is a bit pricey (more than a plate lunch). but can't go wrong with a greek sandwich, garlic salt fries, and a drink. only thing is that I think they water down their sauce now..."], ["Brian A.", "The Gyros are the thing to get here. Of course tzatziki sauce makes the gyro and it isn't too bad here. It was pretty filling and not too bad of a price.Inside is a bit dingy, but then again what place downtown isn't? Parking, well what parking?  This place is more for the downtown business lunch crowd. You can try find a place along the street, but good luck with that."], ["Jane S.", "If you are seriously jonesing for Greek food then maybe this place will do the trick but don't expect to get full off their menu.  The portions are pretty puny and the prices could be better."], ["Brent S.", "I never thought I would find a good Greek place right in the heart of downtown Honolulu.  But Leo's is actually pretty good.  I love a good Gyro and theirs is one of the better ones I've had here and abroad.  Good, inexpensive lunch."], ["Keoki H.", "Price was fair. I thought food was good, Okay good not Okay good Greek. My Falafel was almost burnt black yet inside was not hot soooooooo to hot oil and a frozen Falafel??????? Dare I say???????Pita Bread was so small. Salad was just mixxed greens. HUMMUS was purayed to a liquid. mmmmmmmm come to think of it why did I give this place a 3 star after reading my own review? I enjoyed the Greek spice smells in the air. I would return they were very busy that day, perhaps my order was rushed. Possibly lost because my #48 was passed up by several other orders numbers way past mine.I thought they were clean. Place was older and stained but  clean. I was impressed when the order taker whiped the sweat off his head with a towel then turned around and washed his hands right away with a different towel. So points there. Just no parking. Ride the bus. Not good for groups only one table for about 6 people.Kids may like it. Won't find a hamburger here. Be prepared for Greek local food. You can enter from either Bishop st. or the back door off the mall walk way.Everyone rates a second chance. I will eat again and write another review."], ["Miki L.", "Mighta been what I ordered, a chicken pie. The sign said it was made of shredded roasted chicken (their specialty, I think),  cheese and spices, wrapped in layers of phyllo.  The pie pieces were flat, not that hot and greasy.  If there was chicken in 'em, I missed it. After several bites, I stopped eating, deciding I could do without the empty calories and to give myself a chance to keep find something somewhere else more satisfying."], ["Stacey K.", "Had delivery from here for lunch today and it was horrible.  I had the falafel plate and it was inedible.  Just nauseating... GROSS! Stay away from here!! The WORST Greek food I've EVER had."], ["beth c.", "To be honest, the food is pretty good. The only reason I rated this place with 3 stars is because the establishment seems a little dingy and is kind of dirty. There are always garbage trucks driving by and the stench kills. I usually take the food out. But recently a friend of mine, let me know since she knows that I really like the food, she basically told me that she sees rats running around in the restaurant. Of course its not surprising since it is in an area known to have high rat and roach traffic. There gyro plate and chicken kebob plates are good, but I have a hard time going there because of the cleanliness."], ["Leslie G.", "For the price, you get a lot of food that is very delicious. One of my favorites when it comes to lunch downtown. Also, I like that it has a lot of tables and seating, for those days when I don't want to eat at my cubicle."], ["Jennifer D.", "Fought the lunch hour crowd to satisfy my gyro craving.  Finished my meal and still felt hungry...and it wasn't a cheap eat."], ["Nicole K.", "i found this place while hole-in-the-wall searching around HPU.  i like greek food, and i think that they do a pretty good job at making gyros.  i haven't really tried anything else, but i go back for gyros all the time.  the price range isn't too bad, and it fills me up"], ["R M.", "Pretty damn tasty gyro.  Hours are typical chinatown m-f lunch only."], ["Michael E.", "I have been coming here for 8 years, I absolutely love the food. I used to get some good Greek food back in Chicago, so this is pretty good. Portions are a bit small for the price, but it's not too bad for getting Greek food in downtown Honolulu I guess. The fries that come with the Gyros value meal are probably the best fries around seriously. I have tried just about everything they have, and I have never been disappointed. It's a must if your looking for good Greek food."], ["Al D.", "Falafel plate is pretty good.  And the price is good.  good downtown lunch option."], ["Gabby V.", "Leo's Taverna is a quaint hole-in-the-wall Greek restaurant in downtown. It's small but serves great and authentic Greek food. I'm a fan of the Spanakopitta which looks like a turnover stuffed with spinach and feta cheese and comes with a side salad. I also fell in love with the Falafel which looks like meatballs but is actually a mixture of fried vegetables and spices. It also comes with a side salad, hummus, and pita bread, both dishes under $10. Don't let the location discourage you, the food will speak for itself."], ["David G.", "I think the food is pretty good here! They offer many dishes one would expect from a Middle Eastern restaurant.  The owners are very nice and are always around to make sure things are running smoothly.  If you are in the down town area and are looking to eat something different, by all means check this place out.  Make sure to study the menu because some of their items are not as good as others! Parking can be a pain."], ["Tiffany G.", "This is the place I first experienced Greek food and let me tell you that I LOVED it. I got the half chicken. It was seasoned perfectly with some type of heaven and had hummus, salad, and amazing rice. I ate the entire plate and still wanted more. The service was EH, but the food was good enough for me to ignore it. I've been waiting to go back to this place, begging my boyfriend. Last time was December 27th, 2011 and I'm still begging to go back! YUM!"], ["Henry T.", "Good Greek grinds Downtown!"]], "Kan Zaman": [["C L.", "This is a YES!! great for date night. Good good and nice atmosphere.I looovvvvveeee this place.."], ["Amy M.", "I enjoy Mediterranean, Lebanese, and morrocan food. So I was pretty psyched on trying some of the food at Kan Zaman. It was also on my bookmark list to check out. Yea! Eating to yelp and just gained a pound;)  I walked in around lunch time, and it was relatively packed. It was a small restaurant holding about 8-10 tables. I wonder if it opens into a back area? The establishment also looked clean and inviting.   I had in mind to order the chicken kebab sandwich. It came with a salad and a side of vinaigrette. My body just thanked me for the healthy portion. Lol Once the order was brought to the kitchen, I took a seat and waited. Within a few minutes my takeout was ready.Well, I must say the marinated chicken kebab was very dry. There was no yogurt dressing on top, which I have seen being posted by fellow yelpers;( I wanted so badly to love this sandwich. The pita was nicely grilled, but the hummus was scarcely spread. I then tried to add on some of the greens, tomato, and onion to the chicken. It was still hard to revive. I had to take several gulps of water. I'm not sure if it was worth the twelve bucks.   I'll still come back and try their other dishes. Maybe, I came on a off day......"], ["Jennifer S.", "Kan Zaman has been on my to-try list since they opened a few years ago.  I finally went for dinner.  Largely positive experience, and I would return.My date and I LOVE Persian food - so much so we often make it at home and try nearly any Persian restaurant we find when traveling. So it's inexplicable that it took us so many years to get here!  While not a true Persian restaurant, it is Moroccan/Lebanese, which certainly share a heritage.Reservations were easy-peasy using Open Table.  We requested a seat outside since everyone raved about the patio in reviews.  I was a little underwhelmed, which wasn't helped by the hot, sticky night - I was sweating by the time dessert came, and not in a good way.  The inside seating looked perfectly acceptable.We started with salad and hummus.  The salad was a heaping pile of greens!  Huge.  Dressed in a light vinaigrette-style dressing, very subtle.  Tomatoes and cucumbers, too.  Hummus and pita were good, but not my favorite on-island.  Our server rattled off the specials and immediately I knew my date would opt for the special of lamb on saffron mashed potatoes.  I would have ordinarily ordered a kebab, but instead went with the merguez couscous.  I couldn't believe how my dish stayed piping hot through the last bite (probably contributed to the hot-and-sweaty as described above).  Seriously, the specific heat of this couscous was off the charts.  Anyhow, I enjoyed the lamb sausages and the vegetables were delish.  The couscous was more risotto-like than I was expecting, but I was okay with that.I love love LOVE all things orange-blossom.  Seriously, I would bathe in orange blossom water if I could.  Instead, I just keep some in my kitchen for cooking.  So Orange Blossom Cheesecake on the menu?  Um, YES PLEASE.  It was good, but I couldn't detect any orange-blossom in it at all.  Granted, I know you have to use the stuff sparingly or whatever you make tastes like soap.  But I had higher hopes for the cheesecake, which just didn't deliver flavor.  What did deliver, though?  The server came around with a sprinkle of orange blossom water at the end of the meal.  DOUSE ME, GOOD SIR.  I couldn't stop smelling my hands.  BYOB, no corkage fee (sweet!).  Friendly service."], ["Leah S.", "My favorite of all foods, in the entire world (that I've tried), is Moroccan. Absolutely, with no question. When we moved to Oahu, my husband surprised me while we were staying on the Honolulu side with a dinner at Kan, and it was not at all what I was expecting.We didn't have a reservation, but they they took us anyway and seated us on the outdoor terrace which was lovely. We put in an order for the hot tea ($6) and the Sampler ($16.95), and relaxed with our menus. I was interested to see if they had my favorite food of my favorite foods, which is the Bastilla or B'Stilla, but sadly they did not. We ordered the Lentil Soup ($5.95) and the Chicken Tajine ($17.95), and set to our Sampler. The hummus here had to be some of the best I've ever had, but only because of their incredibly savory and rich olive oil, which I sopped up jealously with my pita bread. Everything else was ok, and I even ventured to try some of their bell peppers which is heresy for me because I hate them. They were actually not terrible, which is saying something in Leah-Land. Sadly this is where the evening took a turn.The falafel were overcooked and dry, the dolmas were on the boring side, and the pitas were chewy and dense instead of fluffy and soft. On top of that, someone somewhere was lighting up a joint and the smell was noxious and overpowering. By this time the seating had filled up and we couldn't move anywhere, and it was making me uncomfortable because I don't smoke. Then the soup arrived and it was watery, tepid and tasteless, and the chicken was under-cooked and drowning in oil that was dripping off the fries piled on top.Saving graces were the oilve oil which I'm still thinking about, the tea, which was a luscious blend of orange, rosewater and mint, and the hand washing at the end with orange blossom water. I would not likely return, knowing there's another Moroccan place in Kailua to still try, but I'd kill to know what type of olive oil they use on their hummus! Sinful! :)"], ["Michael O.", "Kan Zaman is a Mediterranean restaurant with savory and complex flavors that are sure to delight.The portions are very filling, and the lunch specials are affordable while still being practically plated as sandwich variations incorporating lamb, seasoned beef, etc. Side salad (Spring Mix from Costco which is common around town now)...but seriously, try the Kofta Sandwich....just delicious...probably the best and fattest burger with delicious gooey cheese I've had in a long time."], ["Angela C.", "We had so much fun tonight at Kan Zaman. We loved the middle eastern decor, the nice atmosphere, the friendly and fast services, the belly dancing, the music, and the Food!Saw on Yelp that Kan Zaman has Belly dancing tonight, we decided to ride bikes out there to have dinner. The restaurant has inside and outside seating. We sat inside because outside is full. Next time we will try to sit outside because it is even nicer in the back Garden.The lamb Tajine was so moist and tasty, with large beans around it. The Maza had two hummus, a roasted tomato and pepper and two piece of grape leaf rolls, it is also very good. The iced Moroccan mint tea was delicious.But don't order the mozzarella appetizer, it is not good, expensive, and not authentic. Hubby lived in Lebanon and traveled to Morocco, he liked all the dishes at Kan Zaman, except the mozzarella appetizer. He said they don't have raw mozzarella dishes over there. Plus, it is really not good. The Belly dancing made up for mozzarella appetizer. She was really a good dancer, and moved her body in unbelievable ways to the fast beat of the music. Her costume was very bright and pretty.Overall, we will enjoyed our night at Kan Zaman!"], ["Amy Y.", "I bought a groupon $12 worth of $20 food here. It was definitely worth it. Of course, a good deal has it's rules. We can only use it during weekdays Monday-Thursday between 1:30pm-4:30PM. That did not stop me. I made a reservation (required, and stated on the groupon) 2 weeks beforehand, just in case it got busy. I cannot risk pushing the dining date later because of my busy work schedule, and finding someone to eat with is definitely a struggle. When I made the reservations, the guy didn't sound like it was necessary. But I did, Monday at 1:30PM.On Monday, it was really empty. We went in a little before 1:30PM and got seated right away. The decor was really Moroccan-ish? It was a little dim. We had a choice of sitting inside or outside. I didn't want to be sweaty out in the sun nor get mosquito bites (cuz they love my blood). So we sat inside cuz it was a little bit cooler. Though I wish I had chose outside. On my way to the bathroom I passed by the outside dining and the view and set-up was really beautiful. Darn, wish I said outside. Much regret. *sigh* To the food: I ordered Chicken Kebab sandwich $12~ and my bf ordered the lamb kebab sandwich kebab. Both plates come with salad on the side. The server told us the dishes were the most popular. Wow, what a surprise. The food came out pretty quickly. It was of course hot. It was a lot of filling to wrap and to hold with hands. The chicken was stir fry? The spices mixed with the chicken was ooooo so delicious. It wasn't too salty, but just right. The lamb kebab was sooo yummy with the blue cheese. The meat was tender. The food was amazing and filling.  The guy server was really attentive and nice. After our meal he poured us drops of this flower scent aroma. I guess its to cover up the food smell when we were using our hands? I would love to come back for more."], ["Luis R.", "So I go back to Kan Zaman after a year hiatus and while the food did not improve in any significant way (see previous review) I had another issue.    Unfortunately I paid with my debit card and left a cash tip.   For most customers, paying with debit is standard practice but after a couple of days I looked at my online statement and I was overcharged by $6.00.  I called my bank to dispute the charge but since it was on debit it makes things a bit more challenging.  FYI.  Use credit as it makes it easier to dispute charges should issues arise.  Well, lucky for me I had my receipt and I called the restaurant.  To be honest, they were pretty proactive and refunded me the total charge and then gave me 20 percent off the original bill.  This was a nice gesture on their behalf.  I just hated the fact that I had to go through this. Maybe I will give them another shot in the future."], ["Kaori I.", "Another great dinner at Kan Zaman  before 4th of July fireworks. We got there before 5 so it wasn't too crowded yet and be able to get cozy sofa in the lanai to enjoy beers we brought.We started with Lentil soup and today's special Mussel stew. They were both great but we loved especially the mussel stew. Its rich tomato sauce had a great essence of seafood and so delicious! We shared today's special Lamb chop and my favorite there Lamb Kebabs. The lamb chop!!!! It was so tender and nicely seasoned with authentic herbs. It was a good portion and so tasty but priced just 20 something I think. So reasonable!! No need to mention about lamb kebabs. Always GREAT here! Kebabs could be too salty for me but not here so I can eat a lot!! Great food in affordable price and BYOB!! The servers are always nice and friendly and I love the lanai tables there.  Nothing fancy decor but really cozy lanai.  It's one of my favorite spot."], ["Nat N.", "Maybe Moroccan/Lebanese food is not my thing. Never tried it before so I have nothing to compare it to. That being said, my review is really just my gut talking about what it liked/didn't like.The best thing about Kan Zaman is the portion sizes. Wow. It's been a long time since I've walked away from a restaurant uncomfortably full, especially after lunch.  While most restaurants scale down their portion sizes for lunch, Kan Zaman does not.   The lamb kabob sandwich was pretty good. Bread was nice and soft, and it was topped with a heaping amount of lamb.  In fact there was so much on there that I had to eat this sandwich with a fork and knife. My sandwich came with a salad, but I really wanted to try their fries, so I asked the server if I could get fries instead of the salad.  \"Sure, i can do that for you\". What he didn't tell me was that he was going to charge me $2 for this substitution.  I hate being blindsided like that.The baklava seems to be loved by many on Yelp, but not by me. It was cold and overpriced at $6 for two small triangles. It's a rare occurrence for me to not finish my dessert, and in this case, I left a few bites on my plate when we left. If you're coming here for lunch, dress casually and comfortably - it's hot in here."], ["Alexander G.", "Amazing food, lovely ambiance, and friendly service make this a must-stop restaurant in Honolulu!I have been trying to eat here for months now, but the stars have not aligned until last night.  The wait was worth it!  Nestled on Nuuanu in an old Chinatown building, Kan Zaman has a cute and tight feel in their small storefront.  The big windows and decor are welcoming.  Despite this, we opted to sit outside in their peaceful courtyard.  Surprisingly green and open for Chinatown, the courtyard offers a serenity and freshness in which to enjoy all their incredible fare.  I noticed the soft strings of light, that gradually added to the coziness over the course of dinner.  The seating area is a small wood area with nicely spaced tables.  I liked the comfortable seat covers and table cloths.  The waitstaff was very professional, efficient, and more friendly than I've experienced in a long time.  They made my birthday special, thank you JC and Samantha.  With the Chinatown location, parking is a bit of a hassle, but there is a municipal parking garage across the street with reasonable charges.  It is also just off Hotel Street's multiple bus lines, and easy to walk from A'ala Park, Downtown, or Chinatown areas.  The restaurant is traditionally Middle Eastern, so they offer various teas to drink.  If you're inclined for alcohol make sure to plan ahead and BYOB!For dinner, my dining companion and I ordered many small dishes and one entree to share and enjoy together.  We had the Mezza Sampler including stuffed grape leaves (my favorite), babaganoush, hummus, and peppers.  We tried the delectable felafel with tahini. The lentil soup was so flavorful, a true dish to nourish the soul.  My favorite salad, tabouleh, was lightly refreshing with a hint of citrus.  Our main entree was the lamb couscous; the lamb just fell off the bone and was so tender and lean.  Served over a bed of saffron couscous, the various vegetables were just as soft and nutritious.   I ate a lot but felt more content and happy than anything.This is definitely one of my favorite restaurants in Honolulu; I'm happy there is an authentic Moroccan/Lebanese/Middle Eastern restaurant so close by.  Definitely give this place a try if you're looking to try something distinctively not Hawaiian!"], ["Samantha R.", "Last minute recommendation for my husbands Birthday as the Belly Dancer was performing... Dinner and a show why not but best part is it was a hit even for our kids. Dinner was great large proportions big enough for each of us to share- sorry i didn't take pictures of our food as we were so entertained we forgot- we'd most definitely be back for the show and dinner again"], ["Dawn K.", "This is my first Yelp review. Typically, I prefer posting yummy pics to IG with concise comments on my culinary thoughts and experiences. However, I was so impressed with the impeccable service I received at Kan Zaman that I was prompted to post this review so I could properly credit the staff at this amazing establishment. I threw a surprise birthday party for my SIL at this restaurant. As a former executive assistant, I've planned many events at a variety of different venues from intimate gatherings to full-blown galas. I worked with Kamal the manager for this particular party. I found him to be one of the BEST I've had the pleasure of planning with. He was clear and professional in his communication, he responded quickly and politely to my inquiries and questions, and he made me feel at ease that my party would be a success every step of the way.He helped to arrange a henna artist and a belly dancer since we had the party on a night that they are not regularly scheduled at the restaurant. I didn't have to lift a finger!! My wish was his command...Kumiyo, our henna artist, created unforgettable henna art on my guests. Malia, our belly dancer, was so magnificent it took our breath away and got our blood ready to party. It was the first time most of my guests had the opportunity to experience these things. So fabulous to be able to offer them this and to share in it. All this and we didn't even order yet!!We had a party of 11 and Michael and Samantha served us with exceptional care. They were polite, attentive, and very fun!! We stared with our BYOB cocktails. The restaurant supplied the stemware, but we also brought cups as well. They even provided ice. Did I mention no corkage fee?!?!Then, the food came...for many it was the first time dining on Moroccan meals. Every one enjoyed their dishes with delight and vigor!! I actually picked up my rack of lamb bone with my fingers and \"indulged\" and others did the same. We could not get enough. And, the atmosphere made it feel appropriate to be \"primal.\" My SIL who had lamb the week before at Hy's said she enjoyed her shank at Kan Zaman more than her rack at Hy's. And, she'd never pick up her bones at Hy's. Nothing against Hy's. It was just everything...the flavors and the flair of the atmosphere that made every bite unbelievably memorable!! Portions were generous but most of us licked our plates clean. The rack of lamb, the lamb tajine, the seafood special...all were truly \"special!!\"They helped us serve the bday cake and brought out dishes for us to use. A very nice touch. Again, no extra charges. After dessert, they sprinkled a scented water on our hands from a decorative silver decanter. It topped off the meal so perfectly!! Finally, they served a marvelous Moroccan tea. The fragrance from this warm brew filled the night air and tickled our tongues with its delicate flavors.I will definitely be back to Kan Zaman!!! It was like an oasis in the heart of downtown yet they treated us like guests in their home. Most importantly, my SIL and my guests all experienced a very magical Moroccan evening under the moon that will be a lasting memory for all of us!!"], ["Alison S.", "Came here around 5 on Saturday for a late late lunch/pre dinner. After seeing the review and looking at all the pics and menu pretty much knew what I wanted us to order! We started out with the sampler for an app and split a dinner special they had....rack of lamb with a sauce and saffron mashed potatoes. We also got their mint iced tea. I don't normally drink sweetened iced tea but it's mint and lightly sweetened and refreshing especially on a humid day. So good!! The sample was ahhmazing!! Hummus, and babaganoush, and grape leaves with rice, and red and green bell peppers with lots of pita! So tasty. The entree which we split was out of this world. The gravy sauce was so good and I can't even tell you what flavored I tasted cause I would prob be wrong. Lol. The mashed taters were yummy! Never would've thought to add saffron to them. We ordered the orange blossom cheesecake to go. Will have to update on that later....it's still in the fridge. Lol. But from the reviews it sounded good which is why we chose it! Will definitely come back to try their other dinner entrees! Oh and Samantha was our waitress and she's awesome! Super sweet and friendly and helpful! We didn't have a reservation which I guess on a Saturday is prob helpful but we beat the dinner rush so we had time before the reservations came. We sat outside and it's a cool little patio area with music and lights and lanterns. Ambiance is 100%"], ["Stephanie L.", "This place is so good, I almost don't want to write a review....FOOD:Excellent excellent Middle Eastern food. Will absolutely satisfy your cravings, or turn you on to something new. I've been multiple times, and each time I've thoroughly enjoyed the food. Their baba ganoush, hummus and tabuleh is especially worth noting. SERVICE:Also wonderful. This place is routinely packed on weekends (which is why I hesitate writing a review... I want to keep it low key), and yet the staff always try their hardest to squeeze us in. The indoor and outdoor eating options are both great, and create a cool atmosphere. PRICE:Okay... it's pricey ($20 per person) But worth it! Try their lunch for more budget-friendly options."], ["Krysten I.", "Kan Zanman is a nice little Moroccan/Lebanese place in Chinatown. I'm not really sure how the combination of morocco and Lebanon came about, as morocco and Lebanon are not even really close to each other, but hey, the food is good, so I'm not complaining. I've been here a couple times, both for dinner. Of the menu items I've tried, I particularly like the Orange salad, the Orange blossom cheesecake and the babaganoush. I'd be back to try the lunch specials, as the entrees are a little pricey for dinner.For drinks, Kan Zanman offers a yummy sweet mint tea!! It's so refreshing and perfectly sweet. They offer one free refill too!! If you're not into tea or prefer your favorite wine with your Moroccan/Lebanese dinner, Kan Zanman is BYOB!The service is good, nothing special; the waiters and waitresses are nice, but not particularly attentive, especially when it gets crowded. Apparently there is an outside seating area, but make sure you make a reservation if you don't want to eat in the main restaurant.  I also follow Kan Zanman on Instagram and look forward to their specials. However, my one complaint is that the prices for the specials advertised on Instagram do not match what you actually pay. Boo."], ["Michael C.", "A recent conversation between M=Mike, and A=Yelp FriendM:  Where are we eating dinner?A:  Ala Kazam! M:  Huh?  Do you mean Kan Zaman?  A:  Oh......??  Yeah, I meant Kan Zaman.While this particular convo was initially confusing, all of our dinner group (thankfully) ended up at the right place for dinner.  No spells needed.Kan Zaman is a restaurant in Downtown Honolulu specializing in Moroccan and Lebanese cuisine.  I've had this restaurant bookmarked for centuries it seems, and I'm grateful some fellow Yelpers extended a dinner invitation recently.  Truth be hold, I dined at Kan Zaman two weeks in a row for dinner as I enjoyed the food, ambiance, and company (of course!) very much.PARKING:  Street or nearby municipal lots.  Be sure to check the signs for restrictions if parking on the street.SETTING:  Our group sat in the front section of the restaurant on both visits.  Additionally, I was told there is also a section in the rear past the kitchen area.  The front section is cozy, neat, and simply decorated.  There are various color and black and white photos adorning the walls, and I must admit I found one of those to be very captivating.  NOTE:  BYOB!  No corkage fee!  I freely admit we took full advantage of this circumstance as each person brought one bottle of wine.  Cheers everyone!FOOD:On both visits, we ordered the babaganoush to share.  Yes, admittedly this appetizer has a very peculiar name, but this mixture of eggplant puree, lemon juice, and olive oil was a pure delight.  I highly recommend it.  Make sure to ask for extra pita bread, you'll thank me later. For dinner entrees, I have tried the lamb tajine and lamb kebab.  Firstly, I absolutely loved the lamb tajine.  The meat was incredibly tender, the sauce flavorful, while the white beans and herbs complemented the dish well.  I would order this dish again on a future visit.  The lamb kebab was a very generous portion served with rice pilaf, hummus and pita bread.  Overall, I liked the dish as the lamb chunks were a decent size, and they were not skimping on the sides.  Sadly, the lamb was slightly salty and for that reason I chose not to finish my entree.  I am entirely not sure if that is the traditional way this dish is prepared, but I do wish I could have eaten more.SERVICE:  Very good.  The staff was friendly, polite, and very patient with our boisterous group.  As the evening progressed and the restaurant grew crowded, we did have more of a difficult time catching the attention of a server.BOTTOM LINE:  Cozy restaurant in downtown.  BYOB is a plus for sure.  The babaganoush is a true standout on the menu."], ["Travelmeister T.", "Returned three weeks ago with a friend.  Reserved a table outside -- thank goodness since it was so hot inside.  The food and service were excellent.  The lamb kebab is fantastic!  And BYOB!  Love it"], ["Rusty B.", "The lamb was amazing. Very tender and flavor filled. The atmosphere was very nice as well and the smell of rose blossom filled the air. I highly recommend this place for a nice evening meal."], ["Trisha G.", "My first time having Moroccan/Lebanese food.  I know, I know.  I'm a local girl that likes what she likes.  So when someone suggested this place, I figured I give it a try.  And guess what . . . Yum!  I am so excited to add this place to my list of go-to restaurants downtown.   There were so many choices on the menu and I had no idea how to choose.  So, I relied on my fellow Yelpers and went with the Chicken Taouk.  For me - rice, in any form, can't be a disappointment.  This rice had great spice and was topped with two kabobs of grilled chicken.  Yay!  Add hummus and tabouleh with pita bread and another creamy dipping sauce.  It's like a delicious mediterranean deconstructed burrito.  Delicious.We shared a pot of mint tea, which I didn't care for hot, but I later saw that they serve it iced as well.  I think that would have been better.  We also shared two cheesecakes - chocolate coffee and orange blossom.  Both to die for.  Apparently, Wednesday nights are belly dancer nights.  The performer was really entertaining and it added to the ambiance.  It was pretty busy for a week night.  I can't wait to take other people here."]], "Olive Tree Café": [["hisako s.", "This is my favorite place.Taste good, healthy and high cost-performance.No credit card. BYOB, no corkage fee.Very casual. Find a table first, then order at the counter.Cheers!"], ["Diane K.", "For a few years, I lived with a friend who is originally from Larissa, Greece and quickly learned to love Greek cuisine. Spanakopita. Souvlaki. Pilafi. Feta! Olive Tree Cafe brought me back to the time my friend's Mom visited and I ate non-stop Mediterranean and savored every tzatziki-infused moment. Everything on the menu is of quality and impeccable flavoring. If it weren't so busy all the time, I'd have to eat here everyday. This is no exaggeration! It. Would. Be. Done.They have a few odd rules like no change (yes, no coins), no credit cards and paying AFTER your food is ready (not when the order is taken). Oftentimes, genius is accompanied by quirks. Any other place, no. For Olive Tree, anything.Musts:Dolmades - stuffed grape leaves with tzatziki dipping sauce. Chicken souvlaki - chicken skewers wrapped in fresh pita bread, served with greek saladFish souvlaki - fish skewers wrapped in fresh pita bread, served with greek saladIf I wasn't filled to capacity with delicious food, I would've ordered the hummus and the tomato salad. Next time, my plan is to order take out (EVERYTHING on their menu) and have a heavenly week of Greek delights. I love you, Olive Tree!"], ["Dap C.", "The food is excellent . It taste fresh and healthy. I really love this place. The staff there are very friendly and happy. Treats customers great. The customers are a different story. Seem to be a snotty and if you're a local be prepared to feel a little Uncomfortable since some of the customers there can make you feel out of place. Let's just say some of the customers had there nose in the air so to speak. Other then that the food is great and the staff are totally awesome"], ["Gene H.", "Good:  food is always awesome.  My wife loves the specials.    I think the eggplant is Wednesday's.  Killa!  I always get the fish Slovakia and grape leaves.  The lemon soup is pretty good, as well.  BYOB  is another perk.   BAD: cash only, this might help keep prices down being Kahala, so I don't mind too much. Parking sucks!  I started parking at BOH in the evenings.  I hope I never get towed, hasn't happened yet."], ["Jennifer S.", "I've driven by this place for years and I've always heard good things.  Every time I've been by, they've been busy.  So they must be good, right?  Well I finally had the opportunity to try it.  We went on a Friday evening at 7:30 and the tables were full and there was a line for the food.  Luckily, people were leaving and we got a table fairly quickly.  You'll have to stand in line to place your order with the friendly staff.  And you don't pay then (which I thought was a little strange).  They take your name and will call you when you're food is ready.  I think it took about 20 minutes for us to get our food.  When they call you, that's when you pay.  Cash only oh, unless you carry personal checks around with you.  We ordered the rolled grape leaves dish (Dolmades), the babaghanoush, and I had the fish Souvlaki.  The grape leaves were yummy, bite sized morsels with a rice mixture in the middle.  I'm not a fan of eggplant so I didn't really care for the babaghanoush.  The fish Souvlaki was great!  Next time though, I think I'm going to ask for the sauce on the side because it was a little messy with it in there.  Actually, next time I'd like to try the lamb Souvlaki.  Free refills on your sodas and they sell Aqua Panna bottled water.  Another plus, it's BYOB!!!The parking lot is small and now that Wahoo's isn't there, there's a little more parking but it does fill up.  Restrooms need a key (at the cashier) and is located up the stairs."], ["AJ L.", "Best food I've had in Hawaii this trip. It's been here forever and I never knew it! The food is fresh and fabulous. Snag a table before you order because it is always full. Order from the counter and they call out your name with your food. you go in, pick it up and pay. By the way, the same people own the wine shop next door and will add your beer or wine to your order. I can recommend the fish souvlaki and the falafel souvlaki. We also ordered an appetizer of the beans that came with warm pits bread. It's cash only by the way. Oh, they discourage lingering, but I do not. They do not take big groups - just so you know. But still, this is a fun place!"], ["Mahina C.", "This place is by far nothing short of delicious.  Everything from soup to salad to main dishes, i always leave here full and yet keeping a lingering feeling to come back for more.  So after coming here a few times, let me break down Olive tree etiquette...This place is BYOB so alcohol is always welcomed! if you come empty handed, good news that there is a store next door to buy some! After ordering at the register, which I highly recommend the Shawarma, they'll call you back up to pick up your food, then pay.  Cash only!!! so make sure you stop by the ATM beforehand.  There is seating outside & in, and it's not a huge place either so it's always a take your chance to eat here kind of deal, but it's definitely worth the wait for parking, seating & of course the food!"], ["Bogdan K.", "Omg!!! The service is so bad.....   Ordered by phone the second time. Was told 5:25 and writing this review at 5:45p while waiting in line to get takeout.  Last time we came here we were told they forgot to place our order !!!!    There is really no reason that im back here, perhaps that's my own fault.  The food is good, but be prepared to wait for hours and get some stupid excuse when it shows up incorrect or cold !"], ["Lael W.", "Always good, unique flavors, simple menu. It gets crowded so order take out ahead of time and eat on the beach! Love it."], ["Patrick G.", "What a lovely low-key, no-fuss, Greek restaurant we have ourselves here.  The food was very good, and the atmosphere was very casual.  Two things that I enjoy when experiencing new restaurants.The restaurant itself is tiny.  I mean four cramped tables inside and 10 cramped tables outside crowded.  The parking lot is also extremely small.  The good news about this aspect is that there is always plenty of parking at the Kahala Mall or on the backstreets around the corner.  Once inside, diners get to experience the act of ordering at the counter and patiently surveying the land until a table opens up.  If a table does happen to open up, or if you are lucky enough to arrive and spot an open table, pounce on it as soon as you can.  There will be many potential suitors vying for this tables hand in dining, so you better act fast.After you are made to work for a seat, diners will be notified by the PA system or by a yell that their food is ready to be picked up at the food counter.  The food was great.  I had the hummus and the cornish game hen special.  It was stuffed with artichoke and feta, and it was served with potatoes, salad, and pita.  It was a great all-around meal.  I definitely crave it sometimes - including now, since I am writing about it.Some other quick kills when describing the restaurant include: BYOB - there is even a wine store in the same shopping center; cash only; be prepared to pay for cups/ice, the staff were friendly and took the time to explain specials in great detail; if you don't want to wait, order take out; the only negative was the perception of being a little dirty.  Overall, this was a great restaurant with a casual atmosphere.  Prepare for lots of people, but lots of great food."], ["Raelyn B.", "I came here on a whim, because a friend suggested it. Apparently it's suppose to be really good, but you know it's never better than the original? I visited greece about a month back and the lamb there compared to here, is a lot more better. I don't think I've never tried lamb anywhere else on the island but here.I swear we waited ten minutes at the front of the line to take our order, then waited another half an hour for our food. Maybe 15 minutes to find a table. People actually brought out their own chairs to sit outside. I got Shaorma, a lamb patty in a pita bread with their special sauce and tomatoes. I've had better, if it wasn't for the bread, I wouldn't have rated it 2 stars. I'll come back though, try something else. I won't give up. It just won't be any time soon."], ["Missy G.", "Omg sooo yum! Our group shared a bunch of appetizers. The Greek caviar was the best thing ever. It was basically tons of garlic and olive oil which I love. I pretty much ate that app myself and would recommend it to anyone, especially garlic lovers such as myself. The hummus was good. Definitely homemade, but a bit grainy for my liking. All of the pita was warm which is a must but worth mentioning. The feta and olives were good as well. I liked that they give you a big block of feta rather than feta pieces.Regarding the entrees, there was a slight mixup. They accidentally made me a lamb plate instead of a fish plate but they were able to quickly make a fish plate for me before everyone else was finished eating. The fish was fresh though a teeny bit dry. The sauce was sooooo good. Super delish tzatziki!!! The side salad was super yummy too. I really liked the dressing and all of the veggies were fresh. My bf really enjoyed his lamb plate. This place has downsides tho. The cash only is antiquated and the fact that they don't even have an ATM in the restaurant is annoying. Also, we came on a Sunday night and it was a 35 minute wait for our food. We were going to take the food to-go but we were lucky enough to score a table outside. It's also annoying that you pay after your meal. This place just seems really backwards. We had 45 minutes for dinner and that was not enough time for this place which is silly considering it's a casual dining establishment. The walk to the ATM, the mess-up on the entree, and the paying upon pickup of the meals just slowed everything down when it was already busy."], ["Adam K.", "If you have 4 hours to kill, cmon in and order. But If you want to eat within a normal timeframe order ahead. It legit took about 1 hour to get the food from the time we ordered it. Place was PACKED, we had multiple patrons try to vulture our chairs. I noticed a trend in Hawaiian service, there is no multi-tasking. Food was good though, but not great. Hummus was two scoops put on a plate. That took about 1 hour. Then the entrees came out, after another 30 minutes. I am ordering ahead of time if I go here again, right by the movie theater though."], ["Ella H.", "Great service, the cashier lady was very friendly and professional. The food was superb, we had to order more! Definitely coming here again. It's very crowded around dinner time, between 6-8pm, and parking is limited. But it's definitely worth the wait."], ["Lina P.", "Its Cash Only, and theres no obvious signs that will tell you. I read it on yelp!Its BYOB, bring your own cups (or its .48cents each) and wine key if its not twist off.You get inline, order, give your name, and they'll call you to pick up each plate over the intercom. On your last entree, they'll ring you up, so have your cash on you.They're super busy, especially with take out orders, so you gotta be as efficient as possible (know your order, how much silverware you need, extra plates, cups).Good beginners order are the egg lemon soup, hummus, and fish soulvaki.It was good, but I have to admit that I've had better hummus. Thats just me though..."], ["Lindsey S.", "I've been here so many times I can't even count. I love everything on their menu. I've had everything at least once, or tried it from someone who shared with me. FAVORITE: Main: FIsh, they always make it amazingsides: BABAGANOUSH and FETA...!so good!The one thing that i don't like is how much sauce they add to the meat in the pita... waaay too much i always scrape it all off.. I've asked them not to add it and it only worked once =/ BUT its still amazing melt in your mouth crazy good! I'll miss this place in 3 months when we leave to Virginia =(Also.. the seating is sooo limited we opt to take the food home sometimes and have a nice dinner at the beach or home."], ["Amy Y.", "Wow, this place gets really busy during peak hours. Must be really good. I came here around 7ish, danggg...it was full. It took us awhile to find a table since there was like 5 of us. Anyways, I order a mahi mahi souvlaki, includes the pita bread and the salad with dressing. I didn't like the dressing because it was really sour. The mahi mahi was really good with pita bread. Mmmmm...definitely will come back to try some thing else. My friend told me on Tuesdays, there are specials..not sure what it is though."], ["Lien V.", "I have a love affair with Olive Tree Cafe ever since the summer of 2000. I love coming here on a regular basis and back in the day, I used to walk to OTC for my weekly dinner meals. It was always a treat to eat here and I really enjoyed walking back home after I \"pigged out\". The walk back home would only take less than 10 minutes in this neighborhood but I figure it was better than driving such a short distance but more than anything, walking gives me an excuse to eat more here... hehehe. The food was amazing then and is still amazing now. I have not had a bad meal here at all. These people know what they're doing and they do it extremely well. The menu is small but what they make, they make it good. Olive Tree Cafe has it down to a science. Located across from the Kahala Elementary School and adjacent to McDonald's, Olive Tree Café is a small restaurant with mostly outdoor seating but there are some indoor tables where there is AC but it is too cold for me. The décor is really cute and you can see the Mediterranean influence, including the Greek music playing in the background. Since it is BYOB, you can pay 50 cents to use their little glasses for your wine. Ordering is at the counter and you pay when they call your name. It's cash or local checks only. Kitchen is small but the staff is extremely efficient but sometimes you might have to wait a little longer for them to wipe down your table. My \"must-have\" staples when I get here: baba ghanoush, Greek salad, New Zealand lamb souvlaki, mussel ceviche and tabouleh salad. This is Greek food at its best; the flavors are so phenomenal! Since I am not a fan of hummus, baba ghanoush (roasted eggplant instead of chickpeas) is my ultimate answer to hummus and I could keep eating this all night long. Their house made pita bread is so good and addicting! Then, there's the authentic Greek salad, it's out of this world and I love their homemade dressing (which I have not been able to imitate as to date) and I feel good eating this salad. The entire garden seemed to be packed in this plate of fresh lettuce, yellow bell peppers, red onions and grape tomatoes. As far eating lamb goes, I don't order it unless it is not gamey. I do order the lamb here and enjoy it more than I expected so now the lamb souvlaki is one of my favorite selections. Lamb kabobs made here (perfectly grilled on a skewer for hours) is not gamey but very tender and juicy wrapped up in that warm pita bread. It is simply delicious served with the tzatziki sauce and the accompanying side of fresh salad. Another great dish is the mussel ceviche. When I first ordered their mussel ceviche, a light bulb went on in my head :-) This is a fantastic, healthy source of protein for my dinner because it is not a red meat. A hint of fresh ginger served on top of the mussels really make this dish. Another yummy salad I'm totally a fan of is the tabbouleh salad; it has the perfect combination of bulghur wheat grains, minced parsley and mint herbs, lots of diced cucumbers, tomatoes and onions served with their lemon vinaigrette dressing. So tasty and satisfying. What is nice about coming here is that if you forget your wine, you can walk next door to their market and buy a bottle of wine or beer. They even sell cheese, crackers and of course, their yummy halva. This Middle Eastern confection known as halva (made from sesame seeds mixed with honey or sugar) taste almost like fudge, is such an awesome and addicting dessert; I prefer it over baklava.Coming to eat at Olive Tree Cafe is always a treat for me and I think it is the best Greek restaurant in Hawaii and even better than some mainland Greek restaurants.Parking could be a problem sometimes since they share the parking lot with Subway and Wahoo's Fish Tacos. But I've always found parking along side of Pahoa Street or Kahala Mall. Olive Tree Cafe is my must-go-to-places to eat good at anytime."], ["Mark S.", "Great neighborhood restaurant in Kahala, tucked in a strip mall. Don't let the location fool you. There is a wine shop next to it owned by the same guy. BYOB/BYOW.The menu hardly changes but the food is always consistently great and fresh. The organic chicken souvlaki is a favorite and the falafel is a good vegetarian option. The New Zealand mussels are great with a dash of lemon and capers. The tabbouleh salad is light and refreshing, but if you're ordering a souvlaki skip the salad unless you're really hungry (small salad comes with souvlaki entree). But don't skip the baklava (made fresh daily) because it's probably the best I've had on the island.You can either sit inside or if you're lucky, get a table outside where it's more of a relaxed and casual atmosphere. Cash only."], ["R W.", "We arrived at 5:20 pm and they open at 5 so we thought we would be arriving before the dinner rush. There is minimal parking and you have to wait in line for a long time to place your order. Once you place your order you must find a table in the small indoor space  (6 small tables) or outdoor space (11 tables some medium size) and then you sit and wait an even longer time for your food. Once they call your name over a loud speaker you pick up your food at the counter and pay. The amount of time that we waited was ridiculous!!! The food was ok and had small portions sizes.....but not worth the wait. We ate our food and waited an additional 20 minutes just for them to call our name so we could pick up our baklava dessert at the counter. Their ordering processing needs help. We won't be back. Disappointed."]], "Mary's Mediterranean Kitchen": [["Jack W.", "We have been Mary's a few times, and have never been disappointed. When we arrived we did not realize it was close to closing. The staff and chief seemed flustered that we arrived before they closed. I got the Ahi belly Gyro, and my wife got the lamb Gyro. Both where slopply put together, and haphazardly. The fries where kinda limp, just everything seemed rushed. If you are going to take my money at least make me feel like i got something in return."], ["Dawn H.", "Just ordered some pita,  tabouleh,  and baba ganoush. After just eating at Kan Zaman I'm addicted to these 3 items. I'm very pleased with my purchase. The pita is not made in Hawaii and according to the packaging it's distributed by a New Jersey based company. Fanti  Foods Inc. was established more than 100 years ago in the U.S. Fantis Foods imports and distributes fine Greek/Mediterranean food and beverage products throughout North America and as I now know to Hawaii as well. The pita that I ordered was a package of ten. When I got home I was pleasantly surprised  to find a warm pita wrapped in foil on the bottom of my bag which allowed me to immediately test out the baba ganoush and tabouleh. Oishi!!!Nice touch just like the prize on the bottom of a cracker jack box. thank you!The pita is delicious, the tabouleh is soooo fresh, and the baba ganoush tasted more like hummus and not an eggplant/hummus dip thing but very very tasty nonetheless. I've already shared this place with a number of people and nice thing for me it's right down the road. Great place to pick up something different to take to a tailgate, potluck or any occasion. Variety they say is the spice of life. Don't know who Mary is but I like your food. Made with Aloha!!"], ["John K.", "Authentic Greek food that doesn't disappoint.  I stop by here if I'm in the area.  The other food stalls can't compare."], ["Ryan M.", "I found Mary's through the Monocle feature on the yelp app. I was shocked to find out it was located in the 99 ranch market in Mapunapuna. We go to 99 ranch all the time but I never knew this place existed here. That's probably because its located all the way in the back and I never go past Imari's.  I don't eat greek food very often (unless you count just eating pita chips and hummus) so I wasn't familiar with the food on the menu. However, I try to eat healthy on the weekdays and I know greek is supposed to be healthy.   After about 10 minutes of looking at the menu and asking a few questions we finally order. Food - 4 StarsI end up choosing something that I was familiar with. Yes, of course, the Gyro plate. yelp.com/user_local_phot…I came here to be healthy and I end up choosing one of the more unhealthy of the greek dishes hahah.. oh well, so much for that plan. The food turned out to be pretty good though thank goodness. The plate came with the gyro meat which is a mixture of lamb and beef (in case you don't know), toss salad, rice pilaf, hummus, pita bread and the yogurt sauce thing. The meat was very tasty and they were very generous with their portions. The only very slight downfall for me was that it seemed just a little bit dry for my liking. Everything else was perfect. All that for just about 8 dollars.Service - Good/Standard Its a fast food stand so service was standard. They were friendly and happy to answer whatever questions we had. Environment -  The location that its in is where the grocery store used to be so it's the most spacious and always the most empty part of 99. So empty that I think you can hear an echo if you speak loud enough. There is also a huge video being played on the back wall that plays Filipino programming. I positioned myself to be facing the video when I ate so I could watch the show. It wasn't subtitled so I didn't understand a word they were saying but that's okay because it's something about watching TV and eating that makes the experience more enjoyable for me. Overall, I think I found a new place to eat in 99 and would definitely come back again. Next time I will probably choose the other unhealthy of the greek dishes...the falafel."], ["Chris L.", "It has been way too long since I had a falafel.  I'm am so happy that I happened to find this place.Ok it wasn't the best falafel I've ever had, but it was pretty dang good.  If I could make it better, I would spice it up to add more kick.    I will come back next time I have a craving."], ["Neeko M.", "I've only had the falafel from here but I must admit that it was pretty damn good. I haven't been to a whole lot of Greek restaurants but I'm not complaining especially because it's fairly close to where I work and i feel like the airport area lacks variety."], ["Christopher K.", "Love the food here.  The Gyro was very good and worth the money.  The garlic fries were very delicious.  I dont like an overpowering garlic taste and these fit the bill.  Add in that the place is close to me who could ask for more?"], ["Janice S.", "I asked what the most popular dish was and the guy there replied that the gyro plate was. I asked because there were too many choices that looked good, and also a beef tongue special (yech). Anyway I got the gyro plate and it came with gyros, rice, a small salad hummus and a warm pita bread. I was thoroughly satisfied and would definitely recommend Mary's."], ["Kreston K.", "The food quality is good but not a big bang for your buck. The servings are small and leave you needing more. The bread is great and the gyro is very tasty. A convenient location for somebody who works in the area but not worth any lengthy drive."], ["Pomai S.", "I tried their Falafel, and I'll have to admit, Da' Falafel King in the Waikiki Trade Center has them beat as far as fast food Mediterranean goes, mainly because D.F.K. uses a wider variety of fresh and pickled vegetables that go into the sandwich, along with of course being certified Kosher, which is VERY rare to find at Honolulu eateries.Still, Mary's Falafel delivers the goods quite well, having an almost \"meaty\" characteristic to it with its complex blend of spices and herbs mixed with the ground chickpeas and onions. My only complaint is that they were slightly overcooked in the deep-fryer, with the crust being a bit darker in color and flavor than \"GBD\". Not really a problem though, as the absolutely PERFECT Hummus and more mild Tahini Sauce picked up any slack in that regard, giving this Falafel Pita sandwich a truly exotic flare, packed with spices and herbs, rounded out being creamy, earthy, and ultimately very refreshing.Best of all, being meatless, you feel so light, vibrant and full of energy after eating it. My friend tried the Gyro value meal combo, which for $8, you get a fully-loaded Gyro, \"Garlic\" Fries (or tossed salad) and regular drink. He gave the Gyro itself a big thumbs-up, while the garlic fries were perfectly cooked with nice cut size to them. The only drawback is that they use bottled Garlic Salt, and not real minced garlic, which is how it SHOULD be made.Overall, well-executed, very fresh, good quality ingredients and very authentic tasting mediterranean fast food."], ["Keith K.", "Updated Post 2/16/2014Came back here for lunch today.  Had the exact same thing I ordered a couple of weeks ago.  Ya know what?  I'm knocking this place up to 5 stars.  For the type of food Mary's serves [Greek to go], I think it's really good.Original Post 1/31/2014Our office cleared out for lunch today and headed down to 99 Ranch.  Most of the eateries in this place have Asian foods, but Mary's was quietly waiting for me over on the other end of the building.  I have no idea what they named what I ate, but it was #13 (lamb in pita bread; tossed salad and bottle of water).  Rang out at $8.95 and I have to say I got my money's worth.  I'd give this place a 5 for lunch, but would expect more for a dinner meal.  Lamb was tasty and really enjoyed the sauces on the pita and tossed with the salad.  Quick service, affordable and tasty. Good deal.I'll remember this place."], ["Christine L.", "Boyfriend and I were apartment hunting in Salt Lake last weekend, otherwise I may never have found this gem. Jumped on Yelp to find a lunch spot and saw that Ranch 99 Market has closed and the inside has become an interesting food court. I saw there was a greek place and I've been craving it for awhile so we tried it out.OMG!! DELICIOUS!! This is my new fave place to eat. And luckily its right down the street from our new apartment! Boyfriend had never tried greek food before so we both got lamb souvlaki plates, and then a side of garlic fries. The lamb plate is amazingly yummy and huge for the price ($8.95). It comes with two lamb skewers, rice, salad, hummus, and fresh pita. The lamb was juicy and delicious, especially dipped in the side of tzakiki. And the fries are my kind of garlic fries. Not topped with huge chunks of garlic, but more of a blend seasoning. They were scrumptious and served with packets of Hunts ketchup (the best kind).I am so stoked I have a new greek place!"], ["Krysten I.", "I love greek food. I've been on a couple mediterranean cruises and the Greek ports are always my favorite because the food is soooo delish. I am always on the look out for good greek food and although Mary's isn't the most authentic GREEK, this has become one of my new faves.I had decided I was going to get a gyros plate because I was super hungry. I walk up to the counter and the girl takes my order. *Okay, time for a tangent: I have a little card purse thing that I have my car keys on. My friends call it pouchie. Pouchie has become my wallet. Idk how, but I manage to fit my driver's license, credit cards, starbucks card, and a few stamp cards in there along with some money. The problem is, since I dont usually wear clothes with pockets, most of my change gets jammed into pouchie too.* As I pull out some cash to give her the $8.58 I owed her, change comes rolling out. I have enough change, but not 58 exactly. The girl notices I'm struggling and offers to exchange my coins for bills!! SOOOOO SWEET!! New bestie. I waited maybe 5 mins and my food was ready, as I go to the counter to pick it up, my new bestie asks if I want some baklava.....hmmmm tempting.....as I'm seriously thinking about spending $1.75 for a slice (HUGE DEAL! I love BAKLAVA aannnnnd it's a way better price than the fat greek's $5 bakalava), BESTIE just hands me a slice for freeee!!!! I wanted to hug her. My other friends should take lessons from her.  I sit down at one of the many plastic tables and open my bag of goodies. The plate came with rice, meat, salad, hummus and a pita bread. I ate maybe a third and was full.....I took the rest home :) Baklava from the nice girl behind the counter who so generously offered to give me bills for my coins = true love. :)p.s. They are located close to where the bathrooms are....there is usually a projection of ESPN on the wall next to it too."], ["Tamra P.", "(text conversation)Me: \"This old 99 Ranch Market turned into food court place is the most random joint ever.  I feel like I'm in some Asian bizarro land.\"Emi H: \"The Mediterranean place is good.\"Emi H never steers me wrong.  Mary's is hidden in a corner but truly a hidden gem in somewhere I would have never thought to go for food.  They have a ton of options that are under $10, fresh, seem to be pretty healthy, made fresh, and tasty.  I got the lamb shwarma (sp?) plate that comes with rice, salad, hummus, and a fresh, warm, pillowy pita.  I could have wrapped myself in that pita and take a nice little nap but no, I had to devour it.  I love the fact that as soon as I requested no rice they instantly asked if I would like extra salad.  Yes please!  I do like my ruffage.  For a fast food plate, while simple, the ingredients seemed like there was definite attention put towards freshness and quality.  The salad was very fresh and crispy.  The lamb kebabs were pretty decent cuts of meat, tender but cooked through, and not too salty.  The pita was lovely.  Overall, great new find!  (texting con't)me: \"That's where I ate!  There was also some random dude wearing a soccer shirt doing a one man band thing with his keyboard on stage!\"  (And he played a number of songs one of my fave groups Pink Martini does.  Even more random!)Emi H: \"That's amazing.  One man bands are so underrated!\"Bizarro land.  But in a \"yeah, I'll come here again\" kind of way."], ["Noa F.", "Decent Greek food at a decent price. I am not Greek so I could be completely wacky here. I had a gyro with garlic fries and a water.  The cashier indicated that this combo was their best seller. The taste was not bad and the yogurt sauce was good. I did think the meat was a bit dry, but not terribly so. I did enjoy the garlic fries, nice and crisp."], ["Bobbie W.", "Why have I not tried this place until today?! Loved my gyro. Pita bread perfect and warm. Can't wait to try other items. Loved the customer service too!!!"], ["Caryn W.", "I was having my car serviced down the street so I decided to go to 99  Ranch food court to check this restaurant out.  I'd read positive reviews on Yelp and was looking forward to eating a gyro.  I decided to get the gyro combo deal for a little over $8.  This came with a gyro, choice if salad or garlic fries, and a drink.  After I put in my order, several other people came to order as well.  Oh and I saw the Yelp sticker on the tip jar!  Waited for a few minutes and took my food home to eat.  Opened the foil on my gyro and said, \"woah!\". There was a lot of meat!  The order of fries was generous as well!   Really enjoyed every bite if my food and was sad when I was done.  Guess that says a lot..Would definitely return when in craving a gyro!  It's much closer than Greek Corner, so it's more convenient for me.  :)"], ["Angela R.", "Moving from downtown Honolulu to Salt Lake there were a lot of things to consider and it was obvious that my life was going to drastically change mainly regarding food choices. I was afraid that my only option for Greek grinds close by would be the little kiosk at the Navy Exchange food court. Thank goodness for Mary's Mediterranean Kitchen! The food here is tasty and seasoned well! Not only that the portions are generous.  I tried the combo and the gyro plate.  When I opened up my gyro plate I remember telling the hubs, \"holy sh*t! look at all this meat!\".I also ate the dolmas wow that yogurt sauce is yummmm!  The workers are delightful so it's always a pleasure to eat here."], ["Sharon P.", "Great hummus, pita bread, gyro meat, and chicken souvlaki.  Just be prepared...for garlic galore, especially in the chicken souvlaki sauce.  It tastes wonderful, but you will reek of garlic--at least that is what my sister told me (then again, she has always had an aversion to the smell of garlic).  The owner is also very nice.  If it isn't busy, he will go out of his way to make sure his regulars are appreciated.  That is how we were introduced to baba ghanoush (eggplant mush...tastes great though). He gave us a container for free!  He has also thrown in extra pitas and free drinks on other occasions.  You have to try this place at least once to experience his Lebanese style of food.  It will remind you of other countries' cuisine like Greece, Egypt, and Turkey, but hey, that is why it is \"Mediterranean\" food.  And don't forget what I wrote about the garlic...make sure you have mints (or a sister who isn't so persnickety)."], ["David C.", "Arguably the best Greek Food on the island. It's the soft warm pita bread with an amazing hummus! I usually get that stuff to go and then buy more for the house."], ["Quyen N.", "I love Mediterranean food! And I'm a sucker for the veggie plates since I like variety! I first visited this place when it first opened up in the old 99 Ranch, but wasn't in the mood to eat Mediterranean then. The second time I made another mental note when my sister and I checked out the place while wandering around the old 99 Ranch. The third visit was the charm for me - wanted to whet my appetite before I got some good Mediterranean food during my upcoming trip to the mainland. I settled on the veggie plate, which includes: tabouli, falafel, hummus (and baba ganoush as I requested, just split the hummus spot into 1/2 hummus on one side and 1/2 baba ganoush on the other), grape leaves (probably my favorite of all things Mediterranean). The pita bread was warm and soft. The plate also comes with tahini sauce and yogurt sauce - most likely not vegan. The portion was big for me - I ate half that day and the other half the next day.I will be back again when I'm craving Mediterranean (and I'm feeling lazy!). This place is so conveniently located in my neighborhood!"], ["Eric B.", "Avengers Assemble! Thanks to Tony Stark, I have become a fan of shawarma. Don't catch the reference? Watch Avengers. It'll be some of the most entertaining two-and-a-half hours of your life. And if you're not entertained, you'll at least become as knowledgeable as me about shawarma.Residing in the spot of former Ranch 99, Mary's Mediterranean Kitchen, or MMK for short because I didn't really like typing Mediterranean, is a little greekfest in the middle of industrial Mapunapuna. My dish of choice is the chicken shawarma, which resides on a bed of rice, and comes with a small salad and hummus. A warm, fluffy piece of pita bread joins the dish, which I usually dip in the hummus.The top part of the chicken shawarma is unfortunately a little bit on the dry side, but once you get to the lower pieces, a couple of juicy morsels can be found. The hummus is typical, meaning I find it tasty, along with the pita bread. Not much to say about the salad. It is what it is, green and more green. I'm not a big fan of veggies, but I try to eat them when they are in front of me. To give myself that false sense of eating healthy, but not really, since I usually have a can of Coke to accompany the meal and can see myself getting two scoops of French vanilla ice cream from Baskin Robbins right after.Supposedly the food here is more on the healthy end, probably from the way the food is prepared. The chicken is very sparse in grease and fat, and you really can't go wrong with the salad and hummus. Rice is rice, and you can never really go wrong there either, right?"], ["Bliss T.", "I've been to MMK several times. It's tucked away in a corner of Moanalua 99. It's a bit hidden but what a gem!!!!  I love the food here & so does my family. I like the chicken & beef suvlaki & the chicken shawarma. The food is always tasty and seasoned nicely. Love the sauces they serve with the plates. The rice and hummus are delicious too. There is a bit of a wait for the food but i don't mind the wait at all. I think the people who work here are the owners or perhaps family. They are always lovely and service here is always friendly."], ["David T.", "I recently started working near mapunapuna, so I started coming for lunch at 99 ranch once or twice a week and have been wanting to try all they have to offer. The first few weeks I missed this place, it's tucked away in the back corner next to the fresh fish counter. I finally gave it a try yesterday and was not disappointed. I ordered the gyro sandwich special that came with a gyro sandwich, garlic fries, and drink for around $8.75 or so. It may not sound like much but the gyro is pretty big. I really enjoyed it, everything tasted fresh and they didn't skimp on anything, not the meat, sauce, or vegetables. It was really good. Their fries were great and freshly fried, though I would have liked to see real garlic on their garlic fries (I think they just use garlic salt). My only complaint was that the place was deserted but it still took 15 minutes to get my food (I ordered for here) and I only have about 30 minutes to eat before I have to drive back to work, so I had to eat pretty fast. I'll definitely phone order next time. Overall, it's not bad for the price of a plate lunch and a good change of pace from the usual offerings of the area, nothing greasy or msg filled here. They offer sandwich wraps with various meats as well for around $6.50, which is definitely healthier than grabbing a mini plate lunch. I want to try some of their other dishes and will definitely stop by again."], ["Kate T.", "Best greek food on island!! It's cheap and soooo good! The pita bread is soft and the meat was tender and flavorful. I would definitely get a gyro. It is the best gyro I've ever gotten. I wasn't a fan of the salad though. It came with a salad dressing that was super acidic. Every time I had a bite of the salad I made a sour face. It made my husband laugh at me. I wish this place wasn't so tucked out of the way or I would come here again. If you are coming here for the first time it's in the 99 ranch market. Park and go inside!"], ["Stephen H.", "Sorry Mary's.  I really wanted to rate you highly.  Hey.  As far as I'm concerned, everyone should have a Mediterranean-food joint 10 minutes from home, and 15 minutes from work.  Alas.  A convenient location does not a 5-star rating make.Had the gyros plate for lunch.  Though shaved nicely, the gyro meat was dry, and the predominant flavor was salt.  I dipped them in the tzatziki sauce, but the combo didn't work.  The tzatziki was too mildly flavored to harmonize that of the meat.  Plain yogurt and salt meat taste is not amusing.Good hummus and pita bread.The saffron rice was.....forgettable.  I'm not sure why Mary added \"angels hair\" noodles to the rice.  To simulate saffron stigma's maybe?I'm afraid I'll have to look farther afield when I'm jones-ing for Mediterranean food."], ["Mike And Leslie B.", "We've eaten here a lot.  They have tasty food with descent serving sizes.  It's located inside of \"Ranch 99\" in Mapunapuna.  Plenty of seating inside."], ["Misty P.", "Hidden in the back of 99 Ranch food court in Mapunapuna is a hidden gem. Mary's Mediterranean Kitchen has everything you would want for fast food Mediterranean/Greek style - Greek fries, hummus, soulvaki (beef, lamb, chicken), Greek salads, baklava and gyros just to name a few. The prices are reasonable from $6-$8 a plate but they are very generous with their servings. I ordered the beef soulvaki. It was well seasoned and had a good grill taste. I got two sticks of beef, underneath was a generous heap of rice pilaf, a fresh salad, hummus, yogurt dipping sauce for my meat and a whole side of warm pita bread. The man behind the counter was very nice and gave me my drink on the house. Another lady gave a free sample of tabouleh which was awesome.I will definitely come back here again and I'm craving more as I type!"], ["Mike M.", "I remember finding this place a couple months back when they were still putting up the signage for it and i remember thinking to myself \"wow now that's different\" considering the fact that a good majority of the vendors at rach 99 were primarily asian food. Fast foward the tape to January 2011, I just finished work looking to head home on salt lake bvld. I was driving home only to find heavy traffic so I decided to pass up on traffic and  get something to eat at the 99 ranch.  As I walked in I remember finding Mary's and decided to give it a try. I remember meeting Varouj the owner and asked him \"if it is one thing I have to try here, what would it be??\", he then offered their mix plated special with a choice of 2 kinds of kabobs and the rest was as they say...HISTORY.The food was outright AMAZINGLY DELICIOUS!!!  Their kabobs were JUICY, TENDER and very very FLAVORFUL! I'm so glad that I took a chance on this place because I have found me a new comfort food!  The owner Varouj was very friendly and welcoming, infact he added an EXTRA CHICKEN kabob to my already plentiful order of BEEF AND LAMB KABOBS with the RICE PILAF and PITA BREAD. I'm usually a tough tough critic with my food and I honestly have nothing bad to say about this place other than HE NEEDS TO HAVE MORE LOCATIONS! Support this man's recipies and hospitality by TRYING HIS FOOD and bringing a friend with you because Hawaii needs more diversity in it's food and he surely delivers! You'll NEVER REGRET ever trying this place, trust me!"], ["Paola R.", "I recommend their gyros with lamb. It's a little over $6 for the gyro a la carte, but you can get it with a drink and french for a little over $9. They're not my favorite gyros on the island (that dubious distinction goes to the gyros place at Don Quijote in town), but they're a close second."], ["Dan F.", "*Update 11/12/13*After posting my review, I immediately got this message from the business.\"\"\"ShawarmaAloha Mr Dan F, thanks for stopping by and trying my restaurant dishes, I really appreciate it. The sandwich comes with lettuce,tomato, onions and tahini dressing. the salad comes with vinaigrette dressing, i do not have thousand island in my restaurant. to warm up the pita bread takes about 3 minutes, and yes the chicken shawarma was cooked already. To cook the shawarma i need at least 60 minutes and i don't think customers can wait that long for their orders. Hope this message help you about the preparation . Any suggestion that helps to improve more to satisfy customers please feel free to contact me. Mahalo and have a great holidays.\"\"\" **In response to the message**I'm not sure why the Shawarma I had didn't appeal to me in flavor. Maybe it just lacked the right seasoning. It's understandable that the owner mentioned that Shawarma takes hours in preparation and cooking, but if it tasted well I probably would've ignored the temperature of the food. The salad did had vinaigrette dressing on it since the liquid was transparent and not opaque like thousand island (which I made a mistake when writing my review). It was still too tangy for me so I drained out half an ounce of the dressing but it was still all over the salad. If there's a dish that is significantly better than what I ordered, drop me a message again and I'll be sure to drop by to try it. ***My original review***Ordered the chicken shwarma (Shawarma) sandwich which came wrapped in a pita bread. The chicken was bland, the vegetables were mostly lettuce, but the pita bread was soft and warm. The lettuce salad I got was fully drenched in thousand island (Vinaigrette)  dressing. I tried draining it but it was still overpoweringly tangy and I couldn't finish my salad.My order came out in 2 minutes. I'm assuming that everything was cooked ahead of time."], ["Jon A.", "Delicious and reasonably priced. The best Greek I've had on Oahu by far. Even the general weirdness of Ranch 99 doesn't ruin it. I usually get the chicken shawarma wrap."], ["Kat W.", "I really love the hummus and enjoyed the chicken kebab.   Would like more lamb choices."], ["Lori W.", "\"What is this? 'Mediterranean' (with finger quotes)--what's that? Lebanese? Greek? Lebanese? Cause this tastes Lebanese...\" says Mr. Man as he's eating his food. Sigh.Sometimes, travelling/living abroad sucks, because when you get home, you get cranky when you expect something and don't get it. So to be fair, we had kind of high expectations for this shop. In the end, very nice owner manning the front; OK food. If you are more interested in Greek, this is not your place. If you're OK with more pan-Mediterranean inspired with a leaning towards Lebanese flavoring, you'll be alright. Hidden in the back by the bakery. Went here just before the New Year.+Tzatziki sauce was decent--much better than many other fast-food type places, as it actually used yogurt you could taste and had good body with a soft mint back. A little more seasoning would have been welcome, though.+Saffron rice was plentiful and had flavor, but could use a little more salt for our taste.+Beef kebab was good, but not as tender as we'd hoped.+Pitas are soft, but taste like they *might* be bought vs. handmade. Very consistent texture, shape, and size. Very kiddie-accessible, much more so than the shawarma this day.+Chicken shawarma was coated in dressing, but luckily the dressing was wonderfully spiced. Make sure you like cumin and turmeric. We do, so it was a good moment for us.+Hummus was nicely presented, with the paprika dusting and olive oil. Not too salty, but we would have liked more acid to it--maybe a skosh more lemon?+/-Value is average for what you receive, although the portions did seem a touch small compared to other places we've been. Perhaps they were doing larger portions earlier in the business.+/-Garlic fries were fried to order, but needed much more seasoning and more garlic flavor, for us. Another kiddie-accessible food, if you let them eat fries.+/-Falafel is organic when they can source the ingredients, if you're tracking that kind of thing. They usually advertise this. Ours was overcooked and small, but had decent flavor. Not as good as we hoped, though.-No spanakopita.-Lamb was OK, but tasted more like goat for some reason. However, was lightly seasoned, tender, and a good size for the mouthful.-No Turkish coffees; all can drinks and bottled water. However, the cans and bottled water are very reasonable and aren't gouging you like some other spots in 99 Ranch. No juices, though, so if you have kids--get the juice somewhere else. Café Ivy has some, in the back by the photography place.We didn't try the dolmades (stuffed grape leaves) because we were so bummed by the spanakopita not being available, and it seemed like a place that was more inspired by Mediterranean flavors rather than committing to a distinct flavor profile. Maybe the owners are adjusting to local palates and so tweaked their home recipes, but we would have loved to try the food the way they make it for themselves.Overall, nice for something different but not our go-to for a quick Mediterranean or even just Greek, despite the plentiful parking and convenient location of 99 Ranch. Sweet customer service. We'll probably try it one more time or so, in case this batch of falafel or kebabs didn't really rep the place."], ["Reimi D.", "I had the beef suvlaki pita and it was pretty tasty. I was going to try their gyro but I'm not a big fan of the gyro (any gyros...something about the texture that I just can't get into). I was pleasantly surprised. I've been here once before and had their stuffed grape leaves and those were good too. I think the next time I will try the beef and chicken combo skewers. The prices are reasonable and there's always ample seating at Ranch Market. My only issue is the garlic fries are made fresh--though they're good, they just taste like regular fries--can hardly taste the garlic. They also have a vegetarian combo--hummus, grape leaves, falafel, and something else, I can't remember. Comes with a salad and drink for $9.00.Oh, and their baklava is pretty good too. Overall, I was satisfied and will likely return again."], ["Adam G.", "Everytime I drop by I always get their Chicken Shwarma Plate.  Way too good to pass up!"], ["S M.", "Beef tongue plate was delicious - tender and flavorful, and a pretty decent price at $10.99."], ["Amber S.", "I'm in love with this place. I'm so happy I live right down the road. The gyro plate is so delicious. And the gyro sandwich combo with garlic fries never disappoints either. Sooooo good!!"], ["Emi H.", "If there's one word to describe Mary's, it's VALUE! Ordered take-out for dinner because I have three kids and I'm tired. The last thing I want to do after working all day is cook. Mary's is located right next to my kid's gymnastics class and I was really WOWed by what you get for $8! I ordered the gyro plate which is thinly shaved beef & lamb on a bed of rice with salad, hummus & pita bread. My BF is a big eater who needs a lot of meat in his meals, so I was worried about whether or not a gyro plate would suffice. There's a ton of meat on the plate and he was stoked! I really enjoyed the hummus and pita bread!I met Mary (who is actually Filipino) and she was nice enough to give me a sample of her chicken shaorma special. It was decent but I decided to go with the gyro plate which is a mainstay item on the menu. I also got the chicken kebobs for my kids because they're very picky eaters but will always eat chicken and rice.They cook your food when you order it, so be prepared for a 10-15 min wait or call ahead. Mary's is located in the old 99 Ranch Market in the corner. For $8 you really can't beat how awesome her food is and the fab portions. I'm stoked because I've found a delicious dinner option for those days when I just don't have time to cook! Yelp 365 Challenge: #10/365 (The Hummus Hands)"], ["Kris A.", "Love love LOVE THIS PLACE! Went in again, and I always get greeted with a big smile on the owners face. And I just found out that I could cater, omg gotta get my family into eating here now. :)"]]}