{"Ilc International": [["Kitaru I.", "I like this place.  Resonable places to choose from and they have all their ducks in a line.  Also, it's located near Don Quijote and Wal Mart so it's pretty centrally located for easy payments.When calling, they respond pretty quickly too so that is always a plus"], ["Laura R.", "This company is extremely racist. If you are not White or Asian, you will be treated with disrespect and disregard. I am a Latina woman, and I arrived at the location with my best friend, who happens to be a Caucasian lady. I want to add that there is nothing ghetto nor poor about me or my appearance. I carry myself with class and and I am never offensive nor abrasive. I introduced my friend to the man who showed the apartment, and I mentioned that my friend came with me for support. He jokingly said \"and she probably came with the checkbook\". I guess he thought this was funny, because he apparently assumed that I do not make much money because my skin is brown. The truth is that I make VERY good money, I work very hard, I pay all of my bills, I go to school and pay my OWN way through it, and I do not deserve to be belittled. Moving to Hawaii was a decision that had a great deal to do with comments like this from white people that I had to suffer almost every day of my life on the mainland. I am TIRED and EXHAUSTED of being treated as if I am broke, ghetto, poor, a lesser human being, or not worth being considered because of my skin complexion. I LEFT the mainland, so that I did not have to suffer that here! I am utterly offended because he had no right to disrespect me!On top of that, I voiced my concerns to the manager via email, and I have never even received a response back from them. Please do NOT let this company prosper with your money. Racism should have been abolished along with slavery a long time ago!! It is appalling that there are companies that still treat people like this. I am shocked, offended and exhausted of this treatment. I've suffered enough racism on the mainland. I refuse to suffer through it here. This is supposed to be a land of Aloha. I work hard here,m and I give back by doing a whole lot of volunteer work for the less fortunate and for the animals here. I do NOT deserve this!!Since I received no response, I forwarded my complaint to the Better Business Bureau, who in turn told me that this is a federal offense and that I can actually sue! I am going to go through the process of suing and at least I will feel confident that I made some type of difference by at least taking action!!!NO ONE should suffer racism. Whether you're white, black, hispanic, asian, indian, arab, or anything else. It is a disgusting feeling and it should NEVER be felt. By ANYONE!!"]], "Himalayan Kitchen": [], "India Cafe": [["Sara L.", "This is my favorite food in Hawaii.It is really delisious.I tried spicy fish today, it was spicy enough."], ["Megan W.", "Wow this place has so many vegetarian and vegan options and everything was delicious! With the veggie plates, you can choose up to three options, which includes seasoned rice, salad and soup! We each had two options and that was plenty. You can also add bread appetizers and chutneys to enhance your meal.There are only two small tables inside and two tables outside so if you have a bigger group, take out is a better choice. They have group meals that would be a good option too. It was delicious and wish I could have tried more dishes. The watermelon juice was also very good. They also have other protein dishes if you are interested in that. The girl taking our order was very friendly and helped us decide what to order."], ["teresa v.", "Got the Raja Kings Dinner Special for 4 for take out, decently priced but the food is just mediocre. The best was probably the samosa, the batter is almost croissant-like and different than I've had.Would recommend the okra, curry chicken, and spicy curry shrimp.Would NOT recommend the pork (we don't remember ordering this, but the container was labeled as such) or the tandoori chicken (super skimpy portion and super dry).Considering this is the only Indian place around this area, would only go back if I'm desperately craving Indian food which is unlikely to be anytime soon."], ["David F.", "If I could give you zero stars I would. I love.. love Indian food... especially vindaloo.. I ordered a take out of fiery  lamb vindaloo, cheesy naan, and garlic naan... what a pathetic excuse for lamb vindaloo... I had more fat than actual lamb.. I spent more time spitting out fatty tissue than I did actually eating lamb.. and let's talk about your portions.. I paid 37 dollars.. including tip... for half a bowls worth of vindaloo.. now I have small shallow bowls, and it filled up half... the onnnllyyyy thing I can even give praise for was it actually being spicy... now the naan.. like I said I ordered garlic and cheesy... annndddd wait for it.... I got... regular naan... this was my first and last with this business. Not a chance I will ever waste my time or money with such a low grade vindaloo and a  pathetic excuse for a serving compared to price. Seriously do not waste your time."], ["Ian G.", "Spot on indian food. I had the chicken tikka, and it was delicious. My friend had the lamb curry, and he raved on how tender the lamb was, and how flavorful it was. The food is vibrant and exciting. In addition, it was served quickly. The only negative thing i have to say is their drink selection is rather limited. All in all though, a great dining experience."], ["Christine L.", "Here's the thing. The food is really good. I'd say definitely 4 stars. But the service is so slow and so lacking that I refuse to come back here.Came in for lunch today and there was one guy in line ahead of me. It took the cashier 10 mins to take his order, ring it up, realise he was out of what the customer wanted, refund him and make idle chit chat. I'd really like to order please. It's ridiculous for it to take ten mins.Finally I get to order. There's a sign behind the register that says fresh naan takes 10 mins to make. I order some and the cashier informs me it will take 30 mins. Are you kidding?? So I say I'll just order my plate without the naan. The cashier spends a longer than necessary amount of time counting change as I pay and he says it will take ten mins. Ugh. When I finally picked up my food I realized the whole ordeal from entering the cafeTo picking up my food is 25 minutes. That's just ridiculous for a cafe that doesn't even have customers in it. And I get home with my food to find out that I didn't even get the raita which my plate is supposed to come with. Food may taste good but not great enough for me to waste my time coming back. Also they may want to cut down on their \"smoke breaks\". Bloodshot eyes give it away every time."], ["Russ R.", "Service is everything, and the white girl in the front was probably the most rude, incompetent server/cashier ever. When she took our order she didn't seem to know what she was doing. We ordered the curry and masala, then she asked which vegetables, then she stammered that \"you can't order two, they come with one\". I gave her each order separately. Then we order the naan and she said that their tandoori oven broke 20 minutes ago. No politeness whatoever, just snapping at us as if she was trying to defend herself. They don't answer the phone even though they aren't that busy, we tried. I hope the food is that good. The food is great and the other server was exceptional. The constant bickering in the back also was distasteful. When they got our order wrong we could hear the white girl slandering us in the back. She is not meant for people service."], ["Felix T.", "Being a half Indian from Malaysia, i know what Malaysian food is and i know Indian food as well. When these guys were a mobile vendors their Roti was better and came with a better pricing combo years ago. Their Roti Paratha now was unfortunately worse than frozen pre package ones imported from Malaysia. A good authentic Roti should be hot, buttery, fluffy and soft, served with a good flavorful curry. Their curry was okay, i would still eat it if it was the last curry in this earth. I expected a lot more, with owners being Indian. If you think you'd like something exotic and this is a different fare than your regular meal and wouldn't know any better for comparison then it's not a big deal. The naan was nothing like a real naan, i am sure it never saw the end of the tandoori oven. The cheese topping on top of the naan is a pathetic touch trying to mark up the profit for a non fresh naan is unacceptable. Entire time spent at the shop about 1 hour, service was extremely slow but it was good, server had good manners and did his job well but what was going on in the back, i wouldn't even want to imagine. A lady walked in said she had already phone ordered and still had to wait 45 minutes and the server told her that they had a sudden rush and they were sorry, as long as i've sat there i did not see any \"rush\" and a few people walked out on them and 1 even said to give his meal to the next person because he couldn't wait any longer. I hope the management would find a way to resolve their execution method to maximize their revenue if they even care. Me and my family for one, will not be coming back which is really sad."], ["Jennifer L.", "I've been here three time now over the course of the past four months and have always tried something different on the menu. I have never had any Indian food (Northern or Southern) like the kind of food served at India Cafe and have always been slightly underwhelmed with most of the options. It's fine when you need an Indian fix on the windward side, but definitely not the place if you're looking for true, flavorful Indian food. Unfortunately, the most recent time I was in (on a Sunday night) it took an HOUR for my food to be ready. The customers who came in after me eventually just asked for a refund and left without their food. This place is essentially grab-and-go fast food so to wait an hour with no explanation and no complementary appetizer or drink thrown in was just poor service. I'm sure I'll be back, but I won't be in any rush."], ["Dr Rakesh P.", "Being from India I was quite enbarrassed when the uncooked pancake came to my table when I ordered a dosa.  Lack of good taste or consistency.  It seems the staff was not taught much about the real Indian food.  I wonder if the owners are aware?"], ["Zar A.", "Get the eggplant side! It is spicy and delicious!I stumbled upon this eatery while thinking about food while shopping at the grocery market next door, Times. The sign they displayed outside of their restaurant looked enticing. I decided to give them a shot and ordered their lamb masala. The girl taking my order noted to me that the eggplant side was going to be very spicy. Acknowledging the danger that was to come ahead, I took the risk anyway. Later, a bit into the eggplant side, and I need some milk to tame the fire! Anyhow, it was all worth it... The eggplant side was delicious, the lamb masala was incredible and the meal left me dancing!I came back another day and gave their chicken curry a try. In my opinion, the masalas are definitely better than the curries. The Indian rice that comes with each plate is very flavorful! Thumbs up. This is a small eatery with about 3 or 4 tables. But the masalas are yummy!"], ["Brian R.", "Meh. Rice was rice. chicken masala is decent. Chana masala had no flavour whatsoever. Raita was watery and bland. Potato/pea was super bland.I don't think they know how what chilis are. The chicken masala was tasty and had creaminess but no spice nor heat whatsoever. Got chilis? Please?Chana masala was bland bland bland. Raita was more water than yogurt and forgettable. Potato/peas were decent consistency wise but lacked a thing called flavour. Bland bland.Pretty sure they're not cooking with ghee, chilis or adequate amounts of spices. It's kinda like making a milk shake with nonfat milk and stevia. Sure it's kinda the same but who wants it?Oh and the roti? Yeah that's not roti, it's some kind of bastardised thin naan. I love naan but it's not roti.Samosa with Thai chili sauce? No thanks. That said I can't give them 1 star because it's not truly terrible. I'd give them 2.5 stars if I could because it's definitely edible, it's just not any good. It's like airplane food - nourishment divorced from joy, elevated only by the thrill of travel to an exotic destination. Except your flight got diverted to O'Hare."], ["Mickey V.", "I am very shocked to see some of the reviews on here. I have been here a few times and just went there for dinner tonight. I am always very happy with the food and the service is always good. The Caucasian lady that was working tonight was extremely helpful and took my experience at this restaurant over the top and that is the reason I am taking the time to write this review. I will be back again and again I highly recommend this restaurant if your looking for good Indian food with great service."], ["Jennifer T.", "Always so Ono. The kids request to stop by the India Cafe quite regularly. It's a good place to get an Indian curry fix."], ["Amanda D.", "Coconut Curry, that is where it's at my fellow food lovers. This is no ordinary curry...spices blended so perfectly you'll never want to try anything else. There's no overuse of one spice or under usage of another, it is just right and more than you'll expect. The chicken was so tender it fell off of the bone, does it get any better than that? No. The zitti, which was my veggie of choice, was soft and delectable but not mushy. They even had an awesome homemade vegan salad dressing that was light and refreshing for these hot Hawaii days. I have been back time and time again and it's always as amazing as the time before!Not to mention I'd love to run my fingers through (who I assume is) the managers blonde curly hair...mmhmmmmmm ;)"], ["Mim L.", "Prices ranged from $2.95 for the naan to $13.95 for an entree.  This place was for carry out only, not for eating in.  There is just one table and chairs which seemed to be for the people waiting for their orders.Wanted to love this place because I love Indian food.  I'll start with the good: The woman taking my order on the phone and handing me the food at the counter when I picked it up was very pleasant. The naan was really good, perfectly cooked. Chana Masala had the right flavor and texture.The rice had the right texture and flavor.Not so good: The samosas were not cooked all the way through (raw dough just under the crusty outside). They were served with Thai sweet chili sauce (?) instead of chutney.Chicken Tikka sauce was too sweet (like cheap spaghetti sauce) and the chicken had a \"I've been frozen more than once\" texture. The Saag Tofu was so salty we couldn't' eat it. The Coconut Fish Curry (the specialty of the House) was just basic and not great.I was disappointed and I don't think I'll be going back. :("], ["Mel A.", "I first ate at this restaurant during my trip to Hawaii back in 2006. 7 years later I revisited and it was just as good as I remembered!!! LOVE LOVE LOVE their food. The flavor is amazing! I don't think I can decide on a favorite dish (I tried about 4 different entrees). The service was also wonderful, very friendly. Also, very very clean! I was a little nervous the food was not going to be as good as I remembered, but IT WAS BETTE"], ["Yarin P.", "Doesn't taste like Indian food.more tamarind taste than anything else. Is you are from mainland , this will compare to the worst tasting Indian food you might have had back home."], ["Isha B.", "Good food..we had spicy tofu sambal, coconut fish curry and chicken tikka..loved all of them..specially the coconut fish curry. Fresh asian catfish. They serve good portion of yellow rice  and curry with side of lettuce with indian chutney. And the staff was super friendly and helpful. Highly recommend this place to grab some good indian curries."], ["Rhonda B.", "We purchased four different vegetarian dishes, and naan.  First I have to preface that I am always looking for the best naan, their tasted like they sprinkled sugar on top, so I was not a fan.  The main dishes were alright.Its a very small place, two/three tables inside, two small tables outside.  But for take- out.I'm glad my husband and I tried it, but most likely not going back."], ["Andrew T.", "Plus:  I enjoyed the food and the vegetarian options, pretty good value and flavor.Minus: just felt like the owner is not present enough.  The cashier was pleasant but wearing an old grimy baseball cap that just didn't help their brand. Our order was wrong but corrected quickly with no argument.Summary:  I would go back, but haven't rushed back."], ["Richard H.", "Great tasting, fast Indian Food, right in the middle of Kailua Town!  Small, but nice store front, with very limited seating area.  As the other reviewers mentioned, this place is meant for take out, or seating in the shared outside table space in front of Coffee Talk or Mexico Lindo.  By the way, they have a Yelp sticker on their front door, so I am sure that they are attentive to our reviews :)Upon walking in, we were greeted by a friendly counter person, who asked if this was our first time there.  He generously provided a small sample of their 4 main curries:  Coconut, spinach, sweet tiki masala , and a brown Madras curry. We selected the Coconut curry with shrimp and choice of fried tofu as the side.  The coconut curry is spicy, creamier than the other curries, and contained sweetness from the coconut.  Completely different from Japanese, or Chinese types of curries.  They also added large slices of tomatoes, which added some tanginess to the sauce.  Nice sized shrimp that paired well with the complex flavors of the curry ingredients.  There is no way that I could cook this dish at home.  We loved the fried tofu cubes, which was the side order selected for our entree.  Generous amount that filled two compartments in the Styrofoam lunch plate.  I loved the taste and smell of the yellow aromatic rice that they provide with your meal.After tasting all four samples, I also ordered the spinach curry with chicken plate with the spicy eggplant as the side order.  This curry was more similar to a Hawaiian entree, squid luau, minus the coconut milk.  They included (3) small chicken thighs with your plate, and the aromatic rice.  The spicy eggplant is over-the-top hot, and I don't recommend eating this dish for anyone under the age of 26!  Downside - the tiki masala tasted salty and looked a little greasy.  The tandoori machine is also broken, so no Naan orders.31 YELPS REVIEW CHALLENGE #14/31"], ["Natasha W.", "I have to start off by saying I have no idea why people have given less than 5 stars. The Samosas are so tasty. The chili sauce, although it may not be what is typically served with a samosa, is mind blowingly good. Im drooling all over my keyboard...Chicken Tikka Masala was mmm mmm mmmmmmm. I am going to beg the owner for the recipe. I love that he asks you to contact him personally if there are any issues. I love that he is so connected to the customer and wants to satisfy them. The last time I went the man behind the counter was so upbeat. He was extremely busy and I sympathized with the chef. Around twenty-thirty people came in and out as I was waiting for my food and they were helped very quickly. I talked to the man behind the counter and he had been there all day and had lost his keys and he was really hungry but he was soooo nice regardless of his situation. My boyfriend and I wish we lived in Kailua so we could eat here more often. We do ride the bus from Waiahole just to eat there. By the way people, small restaurants and holes in the wall are the best places to eat. Its like eating in moms kitchen. Its like you are enjoying your meal with family. I love India Cafe."], ["Wenesh R.", "So the food here is always good! But the service has always been atrocious. I've been ignored and pushed away every time I come in here. It always takes way longer than the \"10 minutes\" they predict too. It was dead slow and it still took them 30 minutes today! But the food is always tasty!"], ["Emma P.", "I don't require ambiance if the food is a hit (hole in the wall, schmole in the wall), but for me, this place was too much off the mark. The curries had a really sweet tang to them, and my beloved naan bread was doughy... as in, dare I say, undercooked. I'm not an expert by any means of regional differences in Indian food -- I just know that I like it prepared a la Cafe Taj Mahal/Cafe Maharani. Our cashier was very friendly, though, and portion-wise, you get a good deal of food. I just wish that the food suited my tastes!"], ["Jessica S.", "As hubby and I are Vegan we were looking for a vegan friendly option to enjoy! We also love Indian food (Or any food, really) so we thought this would be a good option! We called in our order a head of time, and when I got there the service was very friendly and quick. Always a plus! As others have mentioned the place is small, but you can eat just a couple stores down at the tables outside - which we did. It was quite nice. We ordered the curried potato masala and spinach tofu korma, both of which were okay - but honestly nothing to write home about. The spinach tofu was better then the curried potato masala though. To be honest - I wouldn't go out of my way to come here again. If I was in the area, I might stop. Especially since they do have more vegan options that we didn't try today."], ["John R.", "The food here is okay, but is a bit pricey for the quality. There was a short Asian girl working the front counter when I went here and she just has atrocious customer service skills. Maybe I'm used to a higher standard being from the mainland, but I expect friendliness, attention to detail and earnestness when being served in any establishment. As I was eating the girl was rude to each customer who came in."], ["Lia V.", "The kitchen here is disgusting! I walked around in between the restaurant and times to throw something away in the dumpster and was horrified by what I saw in the kitchen. Dirty pots and pans stacked on the floor which was not clean at all and even things stacked outside on the ground next to the dumpster. If you want clean food, don't eat here.  Seems like the staff doesn't care at all about cleanliness. Next time you want to eat here, take a short walk around back."], ["Jeremy H.", "Well never had Indian food quite like this. Different from the many Indian food restaurants I've eaten at but it was hot and delicious!  Chicken tikka- sweet spaghetti like sauce with chunks of chicken. Very deliciousMix veggie- kindve coco nutty but reminded me of loaded mashed potatoes.Samosas were good but maybe a little undercooked.The guy ringing me up was beautiful so ya:)!!"], ["S M.", "I've eaten here twice and both times were very disappointing. The food was bland and just didn't taste good.  The pre-made bags at the grocery store taste way better than their food."], ["Chris C.", "This review is for the India Cafe food booth at the Farmer's Market in Kailua on Thursday nights located in the parking lot by Longs and Whole Foods.  I visited this booth last Thursday around 6:00 p.m.  The line was pretty long, which I took for a good sign.  I saw a picture showing a large, tall cup of fresh watermelon juice for only $3.   I ordered two cups of watermelon juice, one for me and one for my boyfriend, along with a plate of butter chicken masala which cost $10.The young woman helping us was extremely pleasant and friendly, and the service was quick.  However, the food and drink were a huge disappointment.  The watermelon juice was served in tiny, short plastic cups instead of in the tall cup clearly shown in the advertisement.  The chicken - a huge shock for Indian food which is normally so flavorful - was the blandest food I have ever tasted.  It actually tasted like there were no spices at all in the sauce.  None.  The yellow-colored rice was extremely mushy and overcooked.  The \"salad,\" while fresh and crisp, consisted of a very tiny portion of greens only with no other vegetables - hard to call it salad, more like lettuce.  The zucchini side dish was very soft and mushy, but it did have a good flavor at least.  I found myself filled with regret that I did not order something else from one of India Cafe's many neighboring booths at the Farmer's Market, and wishing I could turn back time."], ["Quyen N.", "India Cafe hits the spot when I'm windward side hanging with the boyfriend far from my favorite Indian restaurant on King St. I hadn't realized that India Cafe has a food cart in the NEX food court, which I've been to. This restaurant location is tiny with a few tables and chairs indoors but plenty more outdoor eating. It's really a takeout restaurant inspired by takeout places and eateries in Malaysia per the website. The boyfriend and I shared three vegetarian/vegan specialties: spicy eggplant (super spicy, too much for little old me, but still good), chana masala (my staple! always good), spinach tofu korma (boyfriend is a fan of korma, I'd only recently tried). The plate comes with rice, raita, and dal (kind of bland that day). We also ordered veggie samosas, which were a little different from the ones I've eaten before, maybe more like a flaky pastry on the outside. The dipping sauce was sweet chili sauce, which I am familiar with but do not typically pair with samosas. Interesting combination! I like! I want to go back and try other veggie options!"], ["Kannan M.", "Avoid at all cost. It's quite difficult to make Indian food taste so bad. Naan bread is either undercooked or roasted like a cookie. Rice had no flavor or even salt to it. Butter chicken tasted like tomato cream soup with chicken. Vegetarian entries are the worst. Everything appears to be made from frozen entries. You have better luck cooking those yourself....Just dumped 25$ worth of food in garbage...and yelping for a good restaurant."], ["Sarah G.", "Okay, first of all--I don't know why this place only has 3 stars. Maybe it's because people can't handle a little spice; and India Cafe sure brings the spicy. Secondly, I actually like this place a lot. Yeah, I'm a haole, so people are probably like \"ohhh you don't understand Indian food. blah blah blah\" but you know, I spent two weeks in South India, I teach in a school district in PA that has a huge Indian population, my students' moms send in food with their children to give to me because they know I'm addicted to Indian food, AND I spend a lot of time looking up recipes from Kerala and trying to recreate them in my home--so I needless to say I have some foundational knowledge.  Third: I was reading some reviews where people were saying \"oh I heard the chef talk about adding tomato paste\" or \"they don't seem to use fresh spices.\" --folks, folks...let's be serious here IT'S A PLATE LUNCH PLACE. It was not meant to be 5 star dining xD So given all these pieces of information, I think that India Cafe is pretty swag for quick, cheap S. Indian food. Now, on to the important part--what I ate from India Cafe. 1. Spicy eggplant. I ate this in a house with no a/c, during the hottest part of the day with almost zero trade winds. I'm good with spice, I really am--but it was the perfect storm of scary spice levels and super hot weather. I may have almost died--but it was worth it because the eggplant was soooo good. On an island where people think tabasco is super spicy. . . this was refreshing (kind of like the two bottles of water I consumed after eating it).  I'd eat this again. . . as long as I had a/c ;) 2. Channa Masala: This is pretty much why I am giving this place a 4 instead of a 5--too much salt :(  It was really overpowering to the rest of the flavors in this dish and that disappointed me a little. 3. Vegetable Sambar--So this must be a Tamilian dish (at least I think it is) because it's not like the sambar I ate in Kerala and. . . after going on India Cafe's website, I noticed they had a thing about Tamil new year, so I'm just going to assume (I also looked up recipes for Tamilian style sambar soooo...:P). It was pretty nice. I enjoyed eating it to wash down the eggplant and channa.  I just really, really like sambar though. Take me back to the days of eating sambar and idli (or vada, I prefer vada) for breakfast and I'll be happy.Next time. . . I'm going for the masala dosai :)To finish this off. . . I am going to confess one thing: I am incredibly partial to S. Indian food. I like it more than N. Indian food and so . . . the fact that India Cafe sells a lot of S. Indian inspired stuff, it just gets brownie points in my book. Not to mention it's plate lunch style---so it's quick and easy. If you are just looking for quick, tasty, spicy, S. Indian food, India Cafe is a great place to go for lunch :)."], ["Andrea H.", "I was disappointed with the food. The samosas were too heavy on the filo and grease with very little filling. The rice was flavorful, but it was clumped together as if it had been sitting out for hours. The Korma Chicken was served on the bone in a pool of runny sauce. The only palatable item on my plate was the cauliflower cabbage dish. The amount of food would easily serve multiple people; although I was only ordering for one. The price is too expensive if you are ordering for one. I ended up throwing away most of the food. Single servings for one person and a corresponding price should be considered.I had planned to dine at the restaurant, so I was surprised when my order was served in multiple, styrofoam containers and packed in a bag to go. Fortunately all of the food was piping hot. Seating space is limited at the restaurant with only two small tables inside and two small tables outside.Based on the quality, taste and texture of the food, I will not come back here."], ["Jeffrey H.", "Pleasantly surprised. Small restaurant in a strip mall, with only three tables. Meal was excellent. Looks like mostly takeouts."], ["Dee D.", "Unlike other reviewers I had good service for a take out place.  The clerk was friendly and polite.  Food was pretty average at best.  I had lamb masala okra curry and nan.  I love Indian food and wish there was a better option in kailua."], ["Ryan P.", "Found this gem while wondering around in Kailua  They have  Awesome food! There's a shortage of Indian food on Oahu and I was so happy to just find this place. My friend and I  ordered the okra curry along with chicken curry, chana masala,garlic naan, roti, dosa and mango lassi. The chicken curry was aromatic and flavorful. The lassi was sweet and delicious with bits of mango. The roti and naan were crispy with a delicious light taste. All the curries were spicy with just the right amount of salt. The staff was super friendly and relaxed, I recommend this spot to anyone who is into Indian food."], ["CT C.", "Had the dinner for 2.Samosas were good. Kinda like a buttery flaky crust.Chicken tika and curry were both flavorful, kindve a yellow rice which I've never seen before.It was great, naan and roti bread good."], ["Amanda Z.", "Whoaaaa, I can handle spicy, but this place was outta control. It was like someone dumped hot spices, but there was no other flavors/spices at all. I couldn't even bring myself to finish, and I really dislike wasting food. Was a decent amount of food for the price, but just not enough balance/handling of spices/flavors that would make me want to return to spend my money on."]], "Komala Curry House": [["Eric X.", "Based on reviews, I made special effort to get here for lunch.Chicken korma with naan.  They microwaved everything in front of me and threw it in, that's right, a styrofoam effing container.  The sauce was oily and bland.  The chicken was fatty and hadn't spent much time marinating.  The best part was the daal which was still mediocre at best.I used to get $9 all you can eat indian buffet in SF which had salad, rice, tandoori chicken, 3 kinds of curry, samosa, pakora, naan, masala chai, dessert, daal, and various vegetables in a sit down restaurant with silverware and real dishes.  Here I pay $11 for the aforementioned and a snapple.  It's just saddening."], ["James B.", "I was so disappointed with this place because I work close by and thought this could be one of my go-to lunch spots.  One of my co-workers brought it in to the office the day before I tried it and it smelled delicious, if only my food tasted as good as my co-workers smelled.  I ordered 'spicy' chicken korma, spicy it was not, bland it was.  I also had some vegetarian entree with it which was also 'spicy', not even close to spicy, I don't think it could have been any more mild.  Besides not being spicy it just didn't have a whole lot of flavor.  The naan I got was good but obviously made with a TON of butter/oil, if you put that much fat in anything it will taste good.  The portions are good but who cares if you aren't enthusiastic about finishing your plate.  Not too stoked on this place, I probably wont come back"], ["Derek K.", "Quick, tasty and reasonably priced Indian curry.  I had the chicken curry and tofu stir fry, both were flavorful.  If you're craving Indian curry on the go, I'd definitely recommend komalacurryhouse."], ["Vic M.", "I ate this on a whim... and loved it.  Looks like home-made dishes, meaning it looks nothing special, but man I love it.  Get the yellow rice...forget what it's called.  For some extra/small sides they have the flat paratha bread which is also good.  And the fritter...yum yum...and the turnovers...yum...I've never eaten anything here that did not taste good...and I'm a picky eater..though I have not eaten their seafood stuff...cuz that's where I'm picky...ha ha..."], ["Warren K.", "I want to like it, but being a fan of Indian food, I have to be honest.  Looks like a leftover feast from another Indian restaurant.  The lady drops cooked chicken in sauce, which seems to be made from left over spices.  It may not be so bad if you never at at a decent Indian restaurant, but you get warmed up, mediocre food in a styrofoam plate.  The lady seems really worried that she'll put in too many pieces of chicken on your plate."], ["KT R.", "i thought the prices were ok, and bonus points for no line at lunchtime on a friday, but the food itself was kind of blah.  it was ok, i guess.  the predominate spice they used (at least in the dishes i tried) seemed to be salt.  not really what i'm used to for indian but i guess in hawaii, you take what you can get..."], ["Dan G.", "This place is outstanding - best Indian food on the island, by far.  You can get a huge vegetarian lunch for about $7.50.  The food is already prepared, but it's made fresh every day and is the closest thing to \"authentic\" south Indian food Hawaii has to offer.  The yellow rice is crazy good!!"], ["Thi L.", "I usually order the regular vegetarian plate.  I've had the lentil ball which sounds weird but is actually pretty good.  The curries are also good...usually a little spicy for me but I've become a lightweight in that department.  I just like the yellow rice."], ["Michelle L.", "maybe i've expected too much because this place didn't quite hit the spot for me.  i love veggie korma.  at komala, it wasn't as sweet and flavorful as the other ones i've tried.  the only thing i truly enjoyed about the meal was the mrs. cheung's soymilk :)"], ["Jennifer M.", "It's all about expectations.  The lower they are, the more likely you are to be pleased.  While in Honolulu for business, the majority of my food experiences had been mediocre to moderate at best considering the amount of tourist-style restaurants and chains. However, I can honestly say that Komala Curry House will get my business again.  ( I wasn't expecting great Indian food in Hawaii.) And, as such, I was pleasantly surprised by my vegetarian lunch of Cauliflower Korma, Spicy Lentil Balls and veggie Samosa. The spicy lentils has a bit of a kick, not much, but enough to say it was \"spicy\" with a nice flavor and the Cauliflower was good. The Samosa, although a bit greasy, had a tasty filing of potatoes and other veggies. I'd give it a thumbs up and I'll be back again for lunch."], ["Jocelyn L.", "\"Decent take-out in a pinch, esp if you're craving Indian that day. a tad expensive. or maybe i just don't think it's That great value\""], ["Demur E.", "This is a great place to get tasty, hearty Indian curry for a very reasonable price.  It's my current go-to place for lunch and has never let me down.Food:  Delicious.  They have lamb, chicken, fish, shrimp, and vegetarian curries all with varying heats.  The \"spicy\" has a slow afterburn that nudges at your palate for attention rather than taking it over like a coup invasion.  My favorite is the Masala Chicken.  So many chunks of chicken and some vegetables.  The lamb is also good, very tender.          The curry comes with this awesome yellow rice with little black seeds(?) in them.  I could just eat the rice by itself, it is so flavorful.  With the curry, it makes it even more ono.          A pleasant surprise is that they also sell salads (small and large).  They have lettuce on the bottom, but are topped with cucumber chunks, tiny fresh mozzarella balls, peas, carrots all in a mediterranean dressing.  They also have salads with beets and peas and one with curry chicken salad.  All terrific.          I usually get a small plate of curry and a small salad all for under $10.  I always have half my salad left to eat the next day or for dinner.Service:  The guy that works there is really nice and he is very accommodating if you have questions or want suggestions.  Komala operates cafeteria style, where you can see all the dishes available that day and they will scoop it up in front of you.  (Portions are generous).  It's more of a take-out place.Ambiance:  Clean, small, no place really to eat (in the Topa Tower location).Overall:  If you like Indian food at all, check this place out.  The curries are so good, the salads are fresh and the price is reasonable.  They also have samosas or other side items (bread) available.  The only reason they did not get 5 stars is because I wish they had a little more variety (tandori chicken, etc.)  But having said that, I would not want the quality of their food to decrease because they started adding a bunch of stuff to their menu.  Try Komala, I don't think you'll be disappointed."], ["Mark G.", "Komala Curry has good flavor and a reasonable price but their rice is always stone-cold each time I have visited.  Their \"spicy\" is not really that spicy.  I'm not an expert of Indian cuisine but based on the few times I've have Indian food, i'd venture that this is middle-of-the-road, which is ok because it's not too expensive."]], "The Curry": [["Kelly M.", "Very good deal for very good food.  Easy, inexpensive and tastes really good.  Located in the food stalls and stands lining the front of Don Quijote.  Costs $6.75 - $7.50.Menu is a series of choices:1) Pick your curry - soup, Thai yellow, Vietnamese, or Indian.2) Pick your meat - vegetable, chicken, shrimp, or beef for the Indian only.3) Pick your spiciness - not, mild, medium, hot, fire (there may have been a hotness above fire, but I'm not going there!)4) Pick your rice - white, brown, sticky (was there one more?)I asked for recommendations and the lady helping me says she likes the Thai Yellow shrimp and the Indian chicken best.I went for the Thai Yellow shrimp.  It had 4 big shrimp, carrots, potatoes, and cabbage.  It was really good.  Curry was in a Styrofoam soup bowl.  There was plenty of it.  Sides (2 scoops rice, mac salad, and green salad) were in another to go container.  Bit by bit, I spooned my rice into the soup-y curry to let it soak up the great sauce.  Yummy.  It's nice to know there are great local alternatives to McDonalds.  This place is oh oh oh so much better.I will definitely be back."], ["Victoria C.", "I have passed by The Curry many times on my way to Don Quiote and have always been curious to try it.  I was kind of skeptical at first but I was in a curry kind of mood today so decided to give it a try.I ordered the Thai chicken curry in hot.  I really wasn't expecting much from this little curry place but I was quite surprised that it was actually pretty good.  The curry had just the right amount of hotness to it.  It was filled with lots of chicken and veggies.  I also like how they put cabbage in it which I don't normally see in Thai curry but I love cabbage so it helps.  The plate lunch also comes with a side of mac and a really small salad... wish they would give more salad cause I liked the dressing!Although the curry was more on the watery side.. I didn't mind it.  It was kind of like a soup curry.  They have an actual curry called \"Soup Curry\" so I'm guessing that's a bit more watery.  It looked really good and am eager to try it next time!For the price you pay, this place is a great deal especially if you're craving for curry.  They have pretty much every curry possible.. Japanese, Indian, Vietnamese.. etc.  You can also choose the level of hotness and the what kind of rice you want.  I will for sure be back to try the other curries!"], ["Ira J.", "Everything in life comes down to compromise and sacrifice.  What are you willing to sacrifice to get what you want?  What compromise are you willing to make?If what you want is a substantial serving of pretty darn good curry for a low price and you are willing to sacrifice pretty much everything else; I have just the place for you: The Curry at Don Quiote.At The Curry for $8, you get a substantial curry meal including a large serving of your choice of rice (white/brown/sticky), a small salad, a scoop of mac-salad, and a canned soft drink.  The curry comes in 4 varieties, 3 choices of protein (w/ a $.75 up price for shrimp), and three levels of spiciness: if you're keeping score, that's 36 different curries you could get from this one outdoor food court booth!Today for lunch, the three of us each made a different choice and were each pleased with what we got.  I chose Thai/Chicken/Hot.  I've paid a lot more for curry in much nicer establishments that wasn't nearly as good.So, is sitting down to eat on a picnic table in front of Don Quiote with the pigeons and no service a sacrifice you're willing to make to get a generous serving of appetizing curry for a low price?  If so, maybe I'll see you there!"], ["Ko J.", "Not a bad spot if youre in the area and need something reasonably priced, quick, and pretty tasty.  Their vietnamese curry is probably best, then the indian and thai curries; not a fan of the japanese curry...  Just as a caution to visitors- they are not very accommodating.  If you have any kind of health sense, you will need to pay extra to get what you want at this spot.  They do have brown rice and a vegetarian option but they seriously skimp on the veggies :-("], ["David Y.", "You have to come here if you are a curry lover.  The place is located just right next to the Don Quixote store.  The food are inexpensive and tastes very good. They have Indian, Thai, Vietnamese and their house special Japanese soup curry.  For the month of December, they also serve Laksa curry (Malaysia/Singapore/Indonesia) curry.  I came here twice and each time I ordered the mild Indian chicken curry and the portions were big.  It also had big chunks of potatoes and carrots in it.  You can also pick either white, brown, sticky rice or rice noodles.  The second time I decided not to have the mac and green salad and the lady gave me another (3) scoops of rice.  You can't really beat that $7.07 incl. tax price.  I love their Indian curry but definitely will come back to try their other styles of curries"], ["Ngan W.", "Got the beef indian curry with sticky rice. The curry itself was delicious and i drank the rest of the curry. Love the fact that there's no msg and it's only $7.07 after taxes.Only got 3 small pieces of beef but the potatoes being so soft made up for the lack of protein. The sticky rice was hard, so will forego that for regular rice next time.Definitely will be coming back to try the other curries"], ["LeaDan Y.", "If you are just in the mood for 'ono curry, then check this place out.  They have a variety of curry styles that you can choose from, though the Indian curry doesn't taste authentically Indian.  You can even order your curry baked.  A nice alternative to The Curry House, comparable rates but better taste."], ["Gary F.", "CURRY how i love you. I have been waiting for a place like you. Fast food with flavor. I had the Indian curry, mild (what a whimp). I like the way they serve it to you in a seperate container. Bown rice and salad. Nice for the price. They have Thai, Indian, Vietnamese and Original Curry. I want to try the soup curry and will report back soon. More on the soupy side. Not super thick curry sauce like Curry House.I'll be bac :-)G"], ["Yellow J.", "Seriously I love this place.  Their indian curry is really my fave but it's not THAT Indian-ish but i dont care as it tastes so good.  I would order Indian curry with beef, spicy level 5 and white rice and it would come out to $7.07 including tax.  I mean c'mon this is a real good price for the amount of food they put in one order.  Cant complain at all.  Man just writing this review makes me drool already.  Look no further and just try their curry."], ["Quijana B.", "I love a place that knows how to spice a bowl of curry!  My friend and I happened upon The Curry one morning, and were so happy to see that their heat rating went up to FIRE.  She ordered the Indian curry as fire, and I ordered Vietnamese curry as medium-hot.  Both were delicious, and both would be ordered again. There was a noticeable difference between the two spice levels.I look forward to eating here again, though next time I will ask them toskip the mac salad and the thousand islandish  dressing on the green salad."], ["Olivia D.", "My co-worker said she was going to check this new curry place out, so I gave her some money and told her to order me the spiciest curry. She tried calling in her order to save time, but they didn't answer their phone, so she finally just went over.$6.75 gets you original curry soup, Thai yellow curry, Vietnam curry, or India curry. For the India curry, the choices are beef, chicken or shrimp ($7.50). For everything else, you get either vegetable, chicken, or shrimp. No beef. :(My co-worker picked up the Thai chicken curry for herself and the Thai vegetable curry for me. The first thing we noticed was how thin the sauce is. I liked how it wasn't too fatty or full of coconut milk, but the flavor was also thin and the sauce too salty. Her curry only had a little bit of chicken and some potatoes--maybe a few carrots. My veggie curry had carrots, potatoes, broccoli, cauliflower, and basil. I wish they had used some root vegetables like pumpkin or taro, like they do in Thailand.They serve the curry with your choice of rice, tossed salad, and--get this--MAC SALAD!!!! Mac salad and curry . . . not my favorite combination . . .P.S. The name of this place sounds like it should be a horror movie"], ["Lily L.", "this place is good for a quick pick me up soup curry :]service is awsome and served fast, and i like how she has such a simple menu with one main dishCURRYthere needs to be more places like this how they specialize in one dish and make it to perfection for each indivisual persons tastes:p"], ["Gabriel T.", "I recently came here for lunch for a lunch break out of work one time.  As I was walking through the many eateries that they have around the Don Quijote Kaheka area, I stumbled across \"The Curry.\" I decided to try it out and it was pretty darn good.  I tried the Thai Chicken curry with brown rice and hot chili sauce level.  They have all kinds of curry Indian curry, Thai curry, Vietnamese curry, soup curry, and yellow Thai curry.  You can choose different meats chicken, beef, and shrimp.  The chicken and beef curries are usually the same price, about $6.75.  Anything else with shrimp costs more about $7.50.  They promote healthy eating with no MSG with their food.  All of the curries come with toss salad (with thousand island dressing on top) and macaroni salad.  Although the portions may seem small, it is very filling and satisfying.  I find it pretty cool and interesting that there are different levels of chili pepper heat hotness that they put in the curry which are mild, medium, hot, extra hot, and fire! I like my food pretty spicy so I went for the hot level and it wasn't so bad.  It was pretty hot but I think I could handle extra hot or even fire.  For me, the hot level kept the spiciness satisfying.  I think this place has one of the best curries I have tasted.  I am going to come back for sure when I am in the area."], ["Alex C.", "Good but salty. Very salty."], ["Terri W.", "I am giving this place 5 stars because it fits my picky palate for the right price.What makes this place great are all the choices!  There are 4 different curry types (Thai Yellow, Indian, Vietnamese and Hokkaido curry -- the latter two are more soupy).  They also have different types of starch, (white rice, rice noodles or brown rice -- my favorite), 5 different levels of heat, and choice of protein (beef, chicken for some, shrimp and veggie for others.)  All selections of curry come with mixed greens (not the cheap kind either) AND Mac Salad (though I always opt to get all tossed greens, no dressing -- just my own personal preference).  All this for $7 - $8??  Even better!I've had the Indian, Thai and Hokkaido curries and they are all very good.  The Hokkaido curry is especially good on a cold day.  The different levels heat offer something for everyone, even those who like their food REALLY spicy (I even made the gutsy mistake of asking for hot -- level 3 of 5 -- in my Indian curry and it was TOO hot. The medium suits me perfectly.)Located next to the Don Quijote store on Kaheka Street in town, it's definitely worth checking out if you like curry!"], ["Ikki V.", "Tried the chicken curry soup (Japanese version) and hit the jackpot!  Yes, curry soup.  It's not as thick as curry...or even a curry ramen base...it's...SOUPY!  And flavorful so don't get turned off by the fact that it sounds like a watered down curry.  For $6.75 + tax, I got a nice bowl of hearty (onions, broccoli, cilantro, daikon, potato, carrots, and a boiled egg) chicken (veggie & shrimp also available) curry soup, 2 scoops of brown rice (white rice, sticky rice, and rice noodles also available), tossed greens, and a scoop of creamy mac salad which compliments the spiciness of the soup (I ordered medium which was just the perfect amount of kick).  I wasn't that hungry but the soup was so good I ended up eating most of it in one sitting!  There were generous servings of the fillings - in fact, I ended up with leftovers of the potato and carrots and was left wanting more soup!  Definitely my go to soup place from now on.  My friend ordered the vietnamese chicken curry soup and if you like lemongrass (kind of like Tom Yum) it's definitely worth trying.PART II:  Went back for more and ordered it mild this time.  If you can handle spice (i.e. tabasco, etc.) get the medium spice!  Definitely more flavorful."], ["Jeremy W.", "Great place! I wanted something soup-like on cold rainy day so I stopped at The Curry. I like their set up. Ordering is easy and straight forward: You pick curry type (Thai, Indian, Vietnamese or Hokkaido curry-soup) starch (white, brown or sticky rice, or rice noodles) and heat level.I got Vietnamese curry, medium spice, with rice noodles. I was very impressed. The broth was amazing...hints of curry and lemongrass. It was just what I wanted- warm soup with exotic flavor. The green salad was a nice touch (made with fresh-looking mixed greens, not iceberg lettuce) The mac salad was decent but I felt like it could have done with less mayo.Price with tax was $7.07, which I consider a good deal. I will be back to try some of the other offerings."], ["Jim C.", "This is been my \"soup shop\"of choice, since I first happened upon it a few weeks ago. They offer four types of curry: Thai Yellow, Indian, Vietnamese and Hokkaido.Indian curry --- I love you too damn much! I could eat here every day if I had the time.I particularly like the fact that they offer eight levels of heat. Today, I had the \"level eight\" which is also known as Extra Fire. Talk about truth in advertising! When I first put it in my mouth, it seemed to be the usual fare. Nice and spicy, but without the extra kick that I was expecting. Five minutes later, that situation changed! After a few minutes for everything to get working properly, I broke out in a sweat --- and had that wonderful orgasmic feeling that one gets when they have just eaten one of the best damn curries in the world. Talk about a sneak attack! Loved every delicious second of it . . .The woman (sorry, don't know her name yet) who runs this place is extremely attentive and polite. The place is clean, well-organized, they give very fair sized portions for the money asked, and the food is terrific. This place has truly earned their five stars, and a steady customer."], ["H. K.", "Pros: choose spicy level.Selection of ricesFriendly staffCons:Lack of indoor seatingBirdsNotes:I ordered the spicy indian beef curry. The spinach and micro greens salad was a nice touch, but they drowned it in dressing.  The cutter was basic with white potatoes and carrots with beef.  Nevertheless, it was the right level if spice."], ["Wing L.", "Me and my best friend wanted to go to Donqui today. Then afterwards we got hungry and I wanted to eat something. He suggested, The Curry. At first I was skeptic about their menu selections but decided to trust him anyways. What caught my eye was the baked curry because I LOVE CHEESE WITH MY CURRY.CHEESE.Anywhooz~ I didnt even know they have a place to eat inside. It was fairly small with 4 chairs but who gives. The place is empty. Its just the two of us. I ordered the baked curry beef with sticky rice, spice level is hot. He ordered Indian curry. They served a small salad and mac salad for you. I didn't touch the mac salad because I'm not a fan of them. I ate the salads however. Dressing was pretty nice. Lord and behold our curry. First thing I noticed is that I have a raw egg on my curry. Ew? But its okay. I probably didn't see the picture clearly to know that theres a raw egg on top. That was my fault. Next time I'll remember to let them know to cook it for me.While the bowl is still hot, I drowned the egg towards the bottom to let it cook.After 5 minutes I started eating. Where is the spice level?So I looked at my best friend's curry and got a spoonful of curry sauce to try how spicy his is. I can feel it but it wasn't spicy at all. Mines? It was like its not even there to begin with. I was sad.But I finished it. And it tasted very good and delicious despite the raw egg and the non existing spice level. I will come back."]], "Gourmet Lani, Indian Kitchen": [], "Cafe Taj Mahal": [["Erica W.", "Where do I begin?!?  I decided to come here one day with my parents because although I love the food at Maharani, I was getting a little tired of the service there, or lack thereof.  That and the fact I don't like the parking situation nor the fact that if you don't show up as soon as they open (if they bother to open on time) you are s*** out of luck of scoring a table. So I decide to visit Taj Mahal.  Granted their parking situation is not  that great, but there are parking lots across the streets (that after 5pm, just pay a nominal fee to a cash box based on your parking stall).  To begin with, the decor is like any other Indian Restaurant I have been too plus there are a couple of tvs playing bollywood music videos (basically the song and dance numbers from various movies).The food is great and the portions are huge.  Like you will have leftovers for 2-3 days after visiting for a meal.  Plus the employees are AWESOME!!!  It's a family owned restaurant where the parents work the kitchen and the sons work the seating area.  Everytime I go I always get the son with the glasses and he is super personable and attentive."], ["Mai Mai H.", "+ Servers are nice and friendly+ Portions are very generous + All food is made to order and fresh+ Im obsessed with their mango & rose lassi"], ["Miriam W.", "Horrible parking situation. Excellent service, exceptional food. The food here is very similar to cafe maharani. Both places serve exceptional indian food."], ["Marcel C.", "Food tasted pretty authentic, and fresh. Not a ton of flavor. The lack of A/C made a difference. Not sure if I will go back."], ["Kevin P.", "Great food. Parking is bad but just go across the street, but watch out for/enjoy all the feral kitties. And I hope you enjoy bollywood because it's you're evening entertainment. =)"], ["Karan M.", "This is the only Indian place we could find open in the afternoon on a Monday. Warning , if you are of Indian origin please do not visit this place. It will absolutely spoil your appetite for Indian food in the future. The chicken korma had a weird taste to it, I barely ate few bites and left it alone. The after taste still remained in the mouth. The naan was raw and looked like cooked in the regular oven or packaged naan. The rice that came with the entree was the only thing edible. There are not many options for Indian food in Hawaii anyway, if possible give this a miss and satisfy your Indian food craving when you are back to home base."], ["Michael H.", "Great food in an unassuming decor. The spicy lamb curry with potato stuffed naan bread was incredible. The amount of spice was enough to stay on my palate but not effect my desire to eat more. The prices were very reasonable and the server was extremely friendly and helpful. I would recommend this place to anyone looking for authentic Indian cuisine at a good price."], ["Ramesse M.", "Went to go eat here and showed up at about 140 the wait staff told us they are closed for lunch. The sign outside clearly says 2:00."], ["Yazan M. A.", "Worse food ever! Just paid 20 dollars for chicken masala, it was so bad that McChicken would've tasted better! Gosh unbelievable..."], ["Jensen S.", "This place is the second Indian food place that I tried right before I left Hawaii for the mainland.  Portions are satisfying.  Taste is slightly better than mediocre.Atmosphere is a little frantic and busy like since the place is so small but very popular.Parking is well below average since I only knew of street parking, not sure if there is a secret lot or parking garage.Overall, I probably wouldn't come back.  I can get the Naan bread from Costco.  That is the only thing worth going to this place for...  Sorry"], ["Glenys Mae D.", "Lamb vindaloo was so good!!! Beef samosa too. The place is great to chill with friends in. Relaxed atmosphere"], ["Schon H.", "Grease,  greasy rice greasy chicken grease laden sauce.   Something has gone wrong at a once favorite restaurant.   New cook maybe?   bad...BAD, Oh MY If You WANT Burnt Tiny, no, Smaller Than Tiny Pieces Of Cheese With your bland spinach, try the pitiful excuse for palak paneer.  However,  they make the most wonderful Nan bread and vegetable samosas on the island."], ["Sherylynn S.", "This is a great place to eat! The food were awesome, gotta love Saffron rice and Vegetable Samosa!  Another reason is that you can BYOD (Bring your own Drink) so I had a nice white wine along with my dinner plate :)The server, his name is George, did a wonderful job.  His vibe were very considerate and positive so he deserved a well tip :)"], ["Ruchin G.", "SIMPLY AVOID AND GO AT YOUR OWN RISK 1)Very very slow staff2)Very rude ,non-professional and impolite 3)Wait 30 mins for getting anything 4)Waiter will forget your order 5)Will not recommend to any sensible person 6) they included tips even though the service was so shitty 7) Worst experience in HAWAII"], ["Emi L.", "Combination for Two includes:-Giant Samosas with 2 types of chutney-Naan Bread (generous portions, more than you know what to do with)-Basmati Rice-2 EntreesWe got the Beef Curry Masala & Chicken Korma.  Both were delicious, but Beef Curry Masala was my favorite!  Huge portions of each so that leaves tons for leftovers.Also, BYOB with no corkage fee but $1 charge per wine glass.Parking situation is tricky.. it's right next to/behind The Fat Greek, so there's the tiny lot right in front.  Or there's the paid lot across the street but it's pretty pricey from what I remember (numbered stalls, pay machine)."], ["Christa Lei S.", "My brother loves this place, but it's a \"meh\" for me. It's not bad-- they're very kind here, and they have decent Indian food, and a really great glass of mango lassi. But the wait is KILLER! We went here during lunch and it took us an hour just to get our food. They also screwed  up my lassi order, but it's okay-- I don't mind getting mango lassi, I just wanted to try the rose lassi. We got the order for 2-- which is MORE than enough for 2 people. I wish they had the butter chicken for lunch time-- then I'd spend more money lol. I've been here a couple times before and I've had better experiences. This last time put me off for some reason though. They really need more waitstaff, and the lamb chunks (lamb tikka masala) were too big, and for some reason not too flavorful. The chicken korma, I understand, but for lamb tikka masala-- I expected more. Thankfully the lassi and the naan more than make up for it. Also: PARKING HERE IS A NIGHTMARE. You're better off parking across the street."], ["Sonam S.", "We had the vegetarian lunch (matar paneer with chana masala and garlic naan) with papadam and vegetable pakora as starters. Also had the hot masala chai.5 star for the masala chai, garlic naan and matar paneer5 star for the excellent serviceThe vegetable pakora were overdone.Would definitely come back here if we are in the neighborhood."], ["Helen C.", "This review should really be a 3.5 star, but I'll round up because the positives triumphed.The food was awesome. I wiped my plate clean! I had the Curry Chicken Masala, Lamb Saag, Buttered Nan, and a half order of rice -- all of which I happily recommend. This was way more than enough for a two person meal. I took it home and had leftovers for lunch the next day. Still good when heated.Negatives: Parking was pretty horrendous with the really tight lanes and limited stalls shared among five different restaurants. I parked across the street in the paid public parking by City Mill. $5 for the entire evening =/. Service was quite slow for a Friday night (8 - 9PM) but our waiter consistently checked up on us.This isn't a good choice if you're starving and expecting a quick meal but it's otherwise a fantastic option for Indian food."], ["Nica N.", "Everything was just okay. Maybe I'm spoiled because I grew up eating great Indian food. I had the chicken korma and beef masala curry with the naan and rice. I thought the curry tasted fine, but it was really oily. The naan and the rice was good."], ["Geoff G.", "I normally order take-out from Cafe Taj Mahal as it's my local Indian restaurant. The food has always been tasty and piping hot and it normally takes around 20 mins to get ready. If you order a combo for one it's usually enough to feed three people, if you get another portion of rice.Being from England, I've grown up on curry and this is a good try. Not quite 5 stars but very close."]], "Monsoon India": [["Dhruv S.", "Best place to eat India food. Giving 5 star on basis of following:1) Location : At heart of wikiki beach2) Food quality and Taste : good3) Service : Good and less wait time4) Menu and food choice : Plenty"], ["Brittany K.", "When my husband said he wanted to go to an Indian restaurant while visiting Oahu, we started to search and found several to-go places that sounded all but apetizing. Somehow, we stumbled upon Monsoon and the fireworks we saw on the drive over must have been a sign of how our meal was going to go. Upon walking into the place, we were pleasantly surrounded by the smell of Indian spices and calming atmosphere.The food delicious! My husband and I shared vegetable samosas, chicken tiki masala and the bread basket (with three types of naan). We had leftovers, but would've eaten it all of we could have. Having eaten authentic Indian food in Africa and India, we both knew this was the real deal. The staff was friendly and the food was killer. We are definitely going back the next time we are in oahu."], ["Naveen K.", "Veg food was awesome, kadai paneer was really good. As everyone else mentioned naan is good.If you are an indian better ask them to make it spicy.Prawns biryani was the only reason for the rating of 3."], ["David R.", "When the wait staff greets you with, \"Hi guys, welcome back!\" it's save to assume you are a regular. There's a reason we come back - the food. Simply amazing. We've tried many of the selections on the menu, and have yet to be disappointed. First timers, try the samosas to start. Then go for the chicken tikka masala. The naan here is also fantastic. Wash it down with a mango lassi, and you'll be hooked. Monsoon India - it's where to go for authentic Indian food in Waikiki."], ["Zeenat G.", "Was craving for Indian food..saw this place we were 11 in our group...ordered a bunch of different things...was very good...only thing Naans were a little thicker. We definitely enjoyed the food in Hawaii."], ["Morgan C.", "We were sat down at a table outside which we thought would be nice for a change. Ended up that we saw our waitress once, to take our drink orders. (We ordered water.. Which took 8-10min for us to receive) finally got the chance and ordered our food and received it 45 minutes later. Water refills came right before the end of our meal, after being without it over half the meal. We ordered the chicken Marsala which was good and the cheesy naan which is even better, BUT the naan came in a woven basket COVERED in mold. Disgusting! Sorry but this place just lost my business."], ["Gursimran K.", "I think this place is now called Bombay palace. Nevertheless being Indian I love Indian food and I had definitely to try this one . First the ambiance of the place was very good. Which is lacking in most Indian restaurants. Good selection of alcohol I'm not a beer drinker so not sure what they had there. Food now I would rate pretty good it was pretty close to food back home. Portion sizes are decent. For all non Indians I would recommend spice level mild I tried medium and I had a decent time next morning ... Overall was happy with the restaurant..."], ["Kim W.", "Food was authentic and excellent. The service was flawless.  Pricing was a little high however the location was probably responsible for that more then anything else.  The only thing stopping me from giving this 5 stars is that it wasn't very cool.  I think they need better AC although I was not uncomfortable.  I recommend this to Indian food enthusiasts!"], ["L T.", "The service is a little slow, sometime they don't answer their phone. The food is really good, I am a regular customer, their Masala sauce is awesome, the sweet Lassi is pretty tasty, the mango Lassi is good too! I always order 2 order of the rasmalai, dint like it  at first but I love it now!"], ["Tee H.", "My family and I came here after the huge disappointment at Cafe Maharani. It's nice,  decor is very homey to the Indian culture. It was great to be serviced right away, which caught us by surprise, we were expecting the long wait as if we were at Maharani. One thing that amazed us, was 2 of the chefs were Samoans, how nice,  yet awkward. It was awkward for them too to see samoan ppl come into an Indian restaurant lol. I would definitely  come here again!"], ["Matt B.", "Really outstanding. The garlic naan was the best I've had. The lamb vindaloo was spicy, but not over the top and had plenty of meat. Service was friendly and efficient. Great find."], ["Aramya T.", "I went to Monsoon India on my first full day in Hawaii. We were in a rush as we had booked some submarine excursion that we had to go to within two hours. Because of this rush at a small restaurant with our large group, our overall experience was sub par.The food was actually okay. Their naan is fantastic, probably one of the best I've ever eaten (and I'm Indian). The butter chicken was not the best, but still okay. Relatively, the other curries were better, but still fair at the highest mark. The plain rice we asked for was severely undercooked.A large problem of this restaurant was the service. There was only one server and one cook. As our group had a lack of time, this led to a lot of panic, as the food took a really long time to come. The kitchen also lacked simple supplies like spices for the biryani we ordered or even mangos (I had ordered mango lasso, which I didn't get because of this). We had to pour ourselves water, and get napkins and utensils from nearby tables as the server ran around trying to support our big groups. I felt bad for the smaller groups around us who waited a long time just to receive any attention.While my experience was poor, I still believe that this restaurant is still not as bad as how I remember it. There are definitely better Indian restaurants in the area which you should look at."], ["Jordan S.", "Let me start off this review by saying that I backpacked around india for a month last summer, so I am very familiar with authentic Indian food. Monsoon India was amazing! It Absolutly exceeded my expectations. My boyfriend and I are both vegans and the server was super accommodating about us asking the ingredients in almost every dish (sorry!)We ordered pakoras, veggie samosas, Chana masala, roti, and one other thing that I can't remember the name of and it was all fantastic! We ordered it medium instead of spicy and I'm glad we did! The total came out to about $50 so it's not super cheap but you're paying for authenticity and quality!"], ["Murali R.", "Average food. Horrible service. One of the waiters that served us was not courteous at all. We asked for the size of rotis there and she said it is small. But when we got it, it was a big tandoori roti with two halves. We had to ask to box the rest of it, and buy additional curry for it. And then, when we were about to leave, we noticed that they didn't even bother to box the rotis. Seems like small things, but the way they responded overall left a bad impression."], ["Pam A.", "The Tandoori chicken came sizzling hot & is very good, basmati rice cooked perfectly. Ron's Butter Chicken is very good as well.. Love the garlic naan! Chai tea made fresh and is delightful!"], ["Tiffany B.", "Monsoon (soon to be renamed Bombay Palace so I'm told) is my favorite Indian Restaurant. I have had a heck of a time finding Indian Cuisine that meets my standard since first encountering an Indian family owned restaurant in Germany. Must Have: Chicken Tikka Tandoori OR Masala w/ your favorite naan. Add on raita (yogurt sauce) & mango chutney for the full experience!"], ["Steve B.", "Good food, actually great food"], ["Adam K.", "Food was mediocre. And I have had mediocre indian food. The Naan was good. Service was bad. Had to flag down people to get more water, add more food, etc. Ambiance was weird, why were the lights pointed at the AC grate? not at the pictures on the walls?Food was OK, really salty. Not a great place."], ["J And K A.", "I can't actually tell you about the food.  For the record, we didn't even make it that far.  We went on a Sunday evening, and got moved tables after being seated, because a large tour bus group was coming in right behind us.  They didn't tell us it was only buffet this evening, until it was too late and there was 30+ people crushing the buffet. The entire buffet was 5 pots of different curries that actually smelled pretty good.  But after being moved tables, no drink order, no heads up that it was small buffet only, and then being told we just had to wait until the tour group cleared out... we decided to just get up and depart.  Very frustrating.  For the record, my wife and I have NEVER just gotten up and left a restaurant.  Take this for whatever its worth."], ["Mathew L.", "This is our go to Indian food place on Oahu. Pretty good food and good service. Plus parking is not too bad if you get it validated ($1). Also they have beer and wine. To make it even better, most times there is no one there, so it's quiet. Not a bad choice for take out either. I like it!"], ["Lynn V.", "Outstanding! Best authentic Indian food I have had in too long and it was found in Hawaii. Service was good and the food was melt in your mouth delicious!"], ["Dream N.", "I want to give it 2.5 honestly. I wanted Indian food while I was in Waikiki . This was the closest place that was walking distance. I'm spoiled because I'm from mainland usa And chicken tikka masala that taste great runs on average around 14 dollars. I would've been fine with paying 20 dollars for chicken tikka masala if it was good,  even 30. We asked for spicy. It wasn't bad, but it wasn't good. For some reason it came out kind of sweet. I don't recommend the place if you want good chicken tikka masala. Not to mention they give you a small bowl of rice. The garlic naan was good . I wish they would cut it up though."], ["Thomas R.", "We were quickly seated.  Nice cold beer.  Good roti, veggie pakora patties with nice sauces.  Rice was well spiced.  Service was good and the food came out quickly.  This is a nice area with  many options for a mixed group.  Waiter is helpful with adjusting the dishes to Vegan."], ["Greg D.", "I have been to quite a few Indian restaurants here in Hawaii and as far as New York and I gotta say the food was just ok. I ordered the Chicken Masala and while it was good flavor, I felt like I was eating Tomato Bisque soup with some chicken mixed in, it doesn't have the texture and flavor ive come to expect by other places such as Maharani. So its a good place for a quick bite of indian food but yea...."], ["Lisa A.", "Really nice vegetarian options! I highly suggest: the mango lassi, cheese naan, and veggie samosas. Yum!"], ["Dee D.", "Wow. That is all I can say.I almost wish this were Ancient Roman times, where someone could puke me, so that I could carry on eating forever. I never want the flavors in my mouth to end. I would pay money to never have this end.In other words, this is an absolute favorite for Indian food in this town."], ["GA H.", "We ordered take-out through a delivery service for work yesterday and were very impressed with the overall quality of the food, having ordered a varied assortment of naan, curries, vindaloo, etc. . .  I'm very glad to know that good Indian food exists in Hawaii as a few of them have come and gone."], ["Ryan E.", "Nan bread & Jasmine rice was good. Lamb was dry, spices were crazy in flavor, forever changing between the bites. The kitchen is so load the entire meal. Not the people but with cooking, pots and pans. Plus a blender."], ["Rama P.", "Had been to monsoon India twice at our stay at Honolulu. This an unique indian restaurant with open kitchen with chefs cooking before you. You can see your order being made fresh and hot before your eyes. Ambiance is great, is at a great location, seating is good, service is excellent and importantly food is great. Service is good May because it's at a vacation island. We ordered biryani, Nan's, curries and desert all were excellent. Prices are high but again you are at the most beautiful ace on earth so be prepared to shell out more money for everything :) they have another restaurant with same name at Maui too and we tried that one also. This is good restaurant which will make you happy and feel good after your lunch or dinner!\"The best indian restaurant on Hawaiian islands\""], ["Crystal S.", "So I've never really had INDIAN food. I've always wanted to try but I'm not so crazy about curry and I know they're well known for their curry! So a friend of mine decides he wants to eat some Indian food and I agreed to go. You have to try something atleast once before you hate it I guess? Lol We arrived at monsoon. There was no one in the front. We waited for maybe 5 mins not too bad and that's when our hostess/waiter came out to greet us and sat us down. Checked out the menu (I had no fuccin clue what I wanted to eat!) my friend told me to try out the samosa and the chicken masala. They sounded great so I ordered them. Food took about 20-30 mins not too bad but they had only 1 waitress server and she waited like 3 tables by herself while our hostess waiter wandered off somewhere thru out the night. Anywho so the food was..ALRIGHT. My chicken tikki masala (never had it) was really, SWEET and TOMATOEYY and the chicken was...tiny! Lol size of my booger. But it was good. The samosa was very delicious tho. But over all my food was an experience for me. I won't b coming back to monsoon tho. I'll probably try another Indian joint. Overall food was ok. Service was blah ( y'all need more staffs) and....y'all need some fans or a better workin AC it b hot af in there"], ["Tabatha P.", "This place has very high quality dishes. The vegetable korma is amazing. I enjoy the Waikiki setting and they were catering to my son. Their garlic naan was perfect and not burnt like many places accidentally do. I'm a huge Indian food fan and this place is delicious. They could probably get a lot more business if they went down on their prices slightly. Otherwise though, very awesome way to have the finishing meal to my busy day!"], ["Nick M.", "This was my first visit to an Indian restaurant and I was very impressed and satisfied with my order. The coconut curry was very flavorful and filling. The chicken tikka was just as good. The staff was very courteous and helpful. My 12 yr old nephew loved it and it's a must visit in the Waikiki area.  5/5 stars."], ["Riss R.", "Had dinner here last night. Once again the entire dinner was phenomenal. Service is so friendly and quick. Ordered the lamb josh rogan again and it was delicious. Husband ordered the lamb vindaloo which was also great.  The cilantro rice that comes with your curry order is so good I want the recipe. You have to order the naan basket to dip into the curry. Parking is validated. I love this restaurant."], ["Wesley S.", "First time eating Indian food and I was pretty impressed. Good presentation, a bit pricey but it's Waikiki so that's to be expected. The food was great. My friend loved Indian food and she was very satisfied. I would recommend this place pretty highly."], ["Chris L.", "We like this place.  We have been here several times and are always happy with the food and the service.  Good food, good flavor, good price.  As far as Indian restaurants go, sure there might be better ones out there, but not around here.  We did have an issue with one of our dishes last night (that happens sometimes), the sever was extremely apologetic, and she tried to comp our whole meal.  I told her no way, that we wanted to pay, so she ended up taking a percentage off the ticket instead.  She got a FAT tip out of the deal."], ["Santosh A.", "We came here for lunch during our Hawaii trip and were dejected with the food served  at Monsoon India. The food can never be called as Indian Food.Naans were fine but the curry we ordered was tasteless and the service was even pathetic. The biryani they served did not even use Basmati rice and it was like cooled over rice mixed with some bland curry and served.if you are looking for good indian food then please avoid this restaurant."], ["Amanda L.", "I would give this place a five but the service wasn't to great. If we were in Germany or something the service would be acceptable. We had to flag down the server for almost everything. The food on the other hand was great! The best Indian food I've had on island. I got the chicken vindaloo and I will definitely be going back based on that. The mango lassi was delicious as well as the chai tea.. takes a while to make because that make it in house. Over all... we'll be back next week."], ["Db M.", "Extremely rude owner of the restaurant.  We are a group of 4 visiting Waikiki and we have a little kid with many food allergies.  We unfortunately made a mistake to try this restaurant while walking on the street on a gorgeous Friday evening after having a wonderful time on Waikiki beach . We ordered some food and few minutes later a gentleman showed up at the table literally yelling at us for bringing in a sandwich for a small kid with many food allergies. Really ? DO YOU HAVE TO YELL AT US ? We later learned that he was the owner of the restaurant.  The food was ok.  Extremely rude owner with a very hot temper.  Its needless to say that the entire evening was spoiled."], ["Susana K.", "Great food, great service. We had samosas as an appetizer which set the tone. Flavorful and tasty. The naan is amazing as are the lamb kebabs, and curry chicken. We will definitely be returning!"], ["Joshua S.", "My wife and I just got back from a lovely dinner at the Monsoon.  Very good butter chicken, rice and naan.  I don't care about ambiance if the food is good, and it was. I've eaten Indian food in at least a dozen countries, and this was up there.  I left so full I could barely walk back to my hotel."], ["Gabrielle W.", "Since, my fiance and I moved to Oahu a year ago, this restaurant has been our favorite place! The food is delicious! We love specially the 'palak paneer' and the 'paneer makhani'. We must have tried almost all the vegetarians dishes, and they are all fresh and very well prepared. The three stars they have isn't fair! The service is pretty good as well, we never had any problem. The food comes out fast and they also do take out orders."], ["sukhpreit s.", "Being indian and moving to Honolulu we have been needing to get our indian food fix. Oh my gosh this place is awesome. We have never actually been there but order from aloha2go all the time. Yummmmm. Not your everyday indian food as it is quite creamy, but delicious flavors. My fave are the lamb rogan josh and paneer kadai. I wish they made manchurian but they don't. Naans can sometimes be a little in the underdone side but I get them crispy in the oven at home. Overall great! Had gone to maharani on king street and thought it sucked in comparison, not sure why that place has gotten better reviews."], ["Anoop G.", "I ate dinner here several times because it was the only Indian place within a short walk of the Hilton Waikiki.The service is somewhere between OK and slow.  Basically the place is understaffed (both servers and kitchen) and the servers are not very friendly with communicating their limitations.  It takes a while to even get acknowledged for being seated, especially when busy.  If they were more friendly about it (e.g. acknowledge people that entered and say you're busy and it will take a few minutes to be seated), it would make the experience a lot more enjoyable.Due to the kitchen being understaffed, several things on the menu are not available (e.g. rotis and parathas).  The rice was somewhat dry.However, they were willing to make food for me without onions and garlic.The food taste was extremely consistent across the 4 times that I went there.   At some places the taste of the food varies a lot, but here, even though it was just average, it was consistent.  There's something to be said for that.  You can go there knowing what to expect."], ["Sarah N.", "My husband and I went here because we were craving indian food! We walked in and the host forced us to wait over 10 minutes even though the place was super dead (I think there were only 2 tables with people for dinner) The place also had a weird odor. The host seemed like he hated his job and our waitress wasn't friendly. My husband asked if we could substitute the rice for naan and she kept saying they don't substitute anything on the menu which seems super weird because we've done this at every Indian restaurant we've been to. The food wasn't very good. They advertise being an \"Indian restaurant\" but the owners/staff are Paki and the food tastes like its from Pakistan. (I would know, being I am from Pakistan myself) I ordered the chicken tikka masala and it tasted like tomato soup with chicken. Not pleased!! When my husband asked the host if this was a Pakistani restaurant or Indian restaurant, the host hesitated and said Pakistani food and Indian food are the same thing and use the same spices. He also told the host the service wasn't very good and he responded with how they were so short staffed that night. Well it wasn't busy at all so his excuse was obviously BS. Never coming back here again. We ate at Cafe Maharani a couple days prior and it was 10000x better than this place. The service and food was better than this place, costs the same and the portions are WAY larger. Save your time and go to Cafe Maharani instead!"], ["Veggie E.", "I am one of the most compromising and easy to please people when it comes to food. we were served old rice maybe a week old or more, all veggies tasted the same. It was like they were using a common spice mix for all....really bored and uninterested servers, loud noises from the kitchen... Food obnoxiously priced for the quality they were serving!Pathetic! Would never go again!"], ["Ankit G.", "Great service. Very hospitable. Excellent food. One of best ones. Easily accessible in Waikiki. Ambience was nice and clean. Servers served food with great appreciation.we even had food for take out which remained tasty and fresh till next day. Definitely  recommend shahi paneer.Enjoy!!"], ["A R.", "Customer Service - Almost all the staff (including the kitchen staff) seemed nice except for the person who waited on us. He did not introduce himself neither did he talk much to us while he waited on us. when I asked him a question about an item on the menu, he just nodded his head and acted as if it was too painful for him to talk to us. Plates - We were a party of three that included my son who is seven years old. They gave him an appetizer sized plate to eat his meal. It was very difficult for him to eat his rotis and curry in that small plate. I wish they would give kids regular plates.  Food - I would have overlooked other issues if the food was at least decent. I am an Indian who can cook good Indian food and can honestly say that the food here is not good. It is stale and tasteless."], ["Luis R.", "The wife and I decided to stop by this place and give it a try.  We had the chicken tikka, chicken vindaloo and some garlic naan.  I am a fan but it is quite pricey compared to other Indian restaurants in Honolulu.  The Chicken tikka had more of a tomato based taste but I enjoyed it.  I did not try the chicken vindaloo as I couldn't handle the hotness.  My wife says it's very good though.  The only negative thing I have to say is they skimped on the chicken. The garlic naan was delicious; perfect amount of garlic for the naan. Conveniently located in Waikiki near Red Lobster and the Outback Steakhouse."], ["Lily L.", "Very basic home cooked Indian food. Nothing too fancy, but great taste. Great customer service."], ["G T.", "Really bad food. The lamb was undercooked, the potatoes were raw, and you could taste the tomato sauce. That's not how to make vindaloo. The samosa was good. Food was grossly overpriced."], ["Blanca C.", "Omg, where to begin. So, let's give some positive feedback: first restaurant looks nice and clean. Friendly staff, seated right away. Now the bad news, as we started to eat when a roach walk across our table, my appetite went out the window. The food was alright, spicy as most Indian food but the quality was poor. As someone who has consumed lost of Indian food, in a scale from 1-10 I give them a 2. This place has great presentation but when it comes to the food Maharani is by far the best, this guys aren't really a competition. As far as the price, it's overprice when u compare it to other restaurants in the area."], ["Melanie B.", "Came in for lunch.  The pros:  the server was friendly, and I could tell that she genuinely wanted to make sure that I was satisfied with my meal.  She kept my water glass full and came by to check on me as needed. Both the chana masala and garlic naan came out piping hot and had great flavor. The cons:  I was seated at a table next to a wall, and the walls look like they have not been cleaned in some time.  There was a bit of what looked like dry food splatter and several hairs stuck to the wall, and I feel like if that hasn't been cleaned, it makes me wonder about the rest of the place as well as the kitchen.  Though I was only one of three tables dining, it took an inordinately long time to receive my check.  Actually, I had to ask for it, which didn't make sense, as the server was not that busy.  Even though the food was tasty, the prices are substantially higher than Maharani (chana masala is 11.95 there compared to the 14.95 at Monsoon), and to me, that difference doesn't necessarily manifest itself in markedly better cuisine.  Portions at both are the same size, so why is this chana masala $3 more expensive?  Also, there were no napkins...I had to ask for one.  Seems like something basic that should be provided at a table when you dine out (especially with Indian food, or any kind of food where you have sauce the potential to make a mess). Bottom line:  If you live in Honolulu, you're probably better off going somewhere else, especially if you are looking for the most bang for your buck."], ["Nimbus G.", "So, we were in town for a convention and after having been here for over 4 days, were craving some desi food. More reviews on Yelp for another local Indian joint prompted us to go there first. That place was tiny and did not take reservations.  We had a group of about 15 folks and we decided on Monsoon India. Turns out this was around the corner from the Hilton Hawaiian Village where we were staying.  Although we showed up late, they courteously seated us and served us well.The wine selection was good and  food was fresh. The service was personable and overall a fantastic experience."], ["Praju S.", "We have always been a fan of Monsoon India and took some non-indian friends there and it was a wonderful experience.  Our favs are chicken tikka masala, paneer korma and lamb rogan josh.  However, the special family rogan josh recipe was DELICIOUS!! thank you for a delightful evening with great food good service. my only humble suggestion would be to add some color to the walls...deep orange or red and some indian-inspired pictures.  it would really add a great deal to the experience."], ["Gauslin J.", "Despite some of the reviews, the food and service was very good. We had the lamb and the tikka masala. The server was nice and professional. I would have preferred spicier but I didn't say so. We liked it and We will go back."], ["Brian A.", "Lat time we visited Monsoon about 18 months ago, it was great. This time it was very poor, cold soggy Samosas which we refused to accept (they were then replaced with freshly cooked ones), and a watery chicken curry that contained a miniscule amount of chicken. The drop in quality is just unacceptable, and we will never return. All cost cutting will eventually come back to bite you Monsoon, it certainly has this time."], ["Muriel M.", "First meal on the island and we had an Indian food craving (of course;) and this place was conveniently located within walking distance from our hotel. Ambiance was very pleasant, the environment was very comfortable and the food service was very quick.  We ordered the vegetable samosas, garlic naan, Chana masala and lamb biriyani. The food was very good, but we had to wait a bit for the garlic naan. They didnt ask what spiciness level we wanted and they were not very attentive to keeping our water cups filled.  When it comes to Indian food, spiciness varies, so you should always have water in hand just in case.  It was a bit busy, so perhaps I will return when it is not too hectic."], ["George R.", "Mediocre Indian with unusually bad service..30 minute plus wait between dishes from same order, flat soda.. forgotten order..They were trying but Just very unorganized.On to the food:Nan.. DecentCurry excellent Lamb chops.. DecentSaag .. DisappointingChicken tandoori.. No good"], ["Sasha L.", "Five stars because this is the only Indian food place my boyfriend will eat at in hawaii.  Had the chicken masala, chicken vindaloo, plain and garlic naan, and it comes with a bowl of rice.  The chicken vindaloo was sooo tasty, perfect for dipping naan in!  My chicken masala was unfortunately too sweet for me :( I prefer the one at maharani.  All in all very glad we came here!!:)"], ["Reen B.", "Great food! Very flavorful. For the four of us we ordered one Chicken Tikka Masala and one Kadahi Chicken (chicken with bell peppers/tom/onions), 4 naans and one dessert - the Rasmalai.The also gave us a bowl of rice with the entree. The quantity for dinner as a whole was sufficient for all of us.The service was quick for how busy it was in the evening (they had one waiter) it was a pretty clean restaurant over all and they were playing nice (new) romantic hindi songs.The only con I have is that the women's bathroom was not very clean and smelled horrible. Nothing a little deep cleaning can't fix though!"], ["T M.", "All sauce and no substance... Literally. We stopped by with an open mind and fairly low expectations, in the mood of being pleasantly surprised. It was more than disappointing. Besides the staff being disorganized, forgetting my drink, and getting some of the food order wrong, (Young male owner type) the dishes were mostly full of oily sauce. We got a half order of malai kofta, which consisted of exactly one kofta in a dish full of sauce. Cost $7.95.After spending $70 on this dinner, with only one drink, we decided we cannot recommend this place. The decor is shabby, the prices are crazy high, the food was not tasty or substantial, and my hubs did not feel well the rest of the night.By far the worst Indian food on the island.Yuck."], ["Sarah S.", "Every time we travel to Hawaii, we LOVE coming to Monsoon. We immediately noticed on our most recent visit that the restaurant was under new management and no longer served alcohol (They literally have a hand written sign in window saying 'We allow BYOB') The food is good- not great, but the portions are half the size of what they used to be and with the same price! We ended up having to order more food because what we normally ordered wasn't enough. I was really bummed to see this restaurant go downhill."], ["Mary D.", "Revisited Monsoon India last weekend. Wow, food is still overly salted and greasy (Baingan Bharta), but this time the onion kulcha was under cooked and doughy,  and over stuffed with onions to where it fell apart when you went to eat it. The rice was so dry, old and stale that I did not eat it. The best part of the meal was the fresh onion salad with onions, fresh jalapeños and spices. I really hope this place works on the food quality because they need to remember they aren't \"the only show in town\" and there are plenty of other Indian restaurants a short drive away."], ["Alex M.", "Amazing food! Beautifully presented! Great customer service! They are good about vegan food as well! Delicious! It's a shame they're not as busy as they should be! The food is authentic and delicious! :) Yummy!"], ["Angela K.", "Best \"authentic\" Indian food in Honolulu. Bring your wine.I'm vegan food's great. They do make non-vegan meals too. It is authentic and not \"fast food frozen\" Indian that's served up in many East Coast restaurants... and was introduced to the place by a business man who travels to India."], ["Angela M.", "Dear Monsoon India,Your service was kind but not particularly attentive as we lacked both water and utensils.  However, you did notice the hyper spastic little human who was on a mission to crumple her paper placemat into oblivion, and provided us with crayons with which I was forced to draw about ten whales of various size and engage into a serious sketching contest with my drawing-impaired husband.  Thank you for that.Your pakoras were good (though I've nothing to compare them with as you were my first) and the little human ate them so that's something.  The samosas were on the smallish side and edible but I prefer them elsewhere.  Bread basket with plain naan, garlic naan, and onion kulcha was lovely, particularly the garlic naan with it's nice crisp center and chewy edges.  Vegetable coconut curry was rich and sweet and delicious, the sookhi sabzi (mixed vegetables) was excellent, and the basmati rice so ricey.Servings were rather small, prices were rather large, $73 with tip would have stung a bit had we not had our $40 PlayHawaii voucher to cushion the blow.  Still, a good dinner, delicious, and we may return someday when we're rich.Here's the deal.  How could your waiter possibly say that my husbands crayon rendition of a pine tree was even remotely as good as mine?  It was a squiggle.  A crappy squiggle at that.  Mine had definition and shading and branches and closely resembled a real tree.  I know you are probably not inclined to insult a customer and perhaps India lacks pine trees, but it needs to be said that his tree sucked.  Your dishonesty caused unnecessary gloating and glee when we all know his drawing skills are on par with our 5 year old son.  Except my son draws better trains.  And flowers.  And boats.At any rate, you have good food though pricey and are a definite recommendation for tourists and even locals who enjoy vacationing in Waikiki.  You are NOT a good place to hold a drawing contest as I question your waiter's artistic judgement.Sincerely,Angela"], ["Jaymie K.", "The curries at Monsoon India were delicious! My favorite was the traditional lamb curry because of how tender the lamb was and the curry sauce was amazing. I also enjoyed the naan basket which came with plain (salt), garlic and onion naan. Coconut shrimp curry was my second favorite! They have several diary free options which was great since my mom is very sensitive to cream.  The staff was welcoming and friendly and came around constantly to refill our waters. Another plus is that you can BYOB! Love places that allow you to do that! Overall we had a great dining experience!"], ["Daniel K.", "I guess the owners wanted to make this place feel like India where eating spicy food in a warm and poorly lit restaurant is the norm. During the lunch time visit, the restaurant doors were wide open and a/c and lights off.  Even with the Groupon, I had to fork out $20, because the deal required an additional entree order.  And the entrees, even during lunch, are $15-18. Food is good, but unless you have a Groupon type deal, I would continue walking and head to Buffalo Wild Wings.  Maharani is definitely a better choice if you want good Indian food."], ["Kim S.", "Like a lot of reviewers on Yelp, I had a Play Hawaii coupon for here. I was quite skeptical about this restaurant because of all the bad reviews I've seen. Regardless, we went in, and left speechless. And no.. not in a good way. Horrible service! It was a Monday night, with about 5 tables in the whole restaurant and they still couldn't handle. There's a huge lack in communication between the workers. We ordered another side of naan, and had to wait about 10-15 mins because the waitress forgot our order... We sat there waiting for our food longer than we took to actually eat our food. Food portions are tiny! $20 for a small pint sized bowl of curry & $8 for 4 pieces of naan. However, the only upside of the night was how the food tasted. The chefs special curry and cheese naan was really really good. In all, I would not come back here. The portions are too small for my hungry stomach and broke wallet, and the service is ridiculously bad. The only reason that kept us from walking out on them the first time is that we had a damn coupon that we already paid for..."], ["Jonathan P.", "MMM Indian food~ one of the few types food Hawaii is lacking in. I've discovered my love of Indian food ever since eating at India Cafe during freshmen year at UH! And since then I've been on the search for other Indian restaurants in Hawaii.So Monsoon India is located on the 2nd floor in the Discovery Bay Center in Waikiki. But the main problem is parking! The structure of Discovery Bay is really tight..literally! Plus someone banged my car's door =( Even though parking is validated you still have to pay $1 so if you do see a street parking I suggest you grab it!Okay on to the food! So there was only two of us but we were STARVING! So we ordered Meat Samosas-$7.95 yelp.com/user_local_phot…Naan Bread-$2.95 yelp.com/user_local_phot…Lamb Biryani-$20.95 yelp.com/user_local_phot…Coconut Chicken Curry-$17.95 yelp.com/user_local_phot…and the Monsoon Kabab- $19.95 yelp.com/user_local_phot…Boy it sure does add up quick...The food was pretty good. The Samosa's had a nice tamarind sauce and a mint/cilantro puree which was pretty good. The only problem was that one of the two samosas were really oily (on the inside). The lamb biryani was alright, but I didn't care for the yogurt-like sauce. However I LOVED mixing my biryani rice with the coconut curry!! The coconut curry itself is small, but its rich and very filling. And for the monsoon kabab...what's not to like? A little bit of everything; chicken, prawns, and lamb (the lamb was my favorite maybe I'll get a kabab with just lamb next time). What I didn't like was that you have to pay for rice or naan bread. Luckily we had a rice dish (the biryani). But we did order the plain naan. Unfortunately I didn't like it. There were 4 pieces and it was very oily to touch and was soggy/flimsy...Service was pretty good considering there was only one server for the longest time! They had one lady taking orders, serving, and filling up  water! Poor lady...but she did an amazing job. The meal was pretty pricey but I guess it's around the average price other Indian restaurants charge. Luckily I had a groupon coupon! I wouldn't mind eating here again! But I don't really want to use my car and park in Discovery Bay...So I guess that means I'm not driving next time!"], ["Tracie F.", "I really wanted to like this place. I promise. I tried. I really did. It just was not that good. We came because we got a group on deal and we love Indian food. Choices on the island are limited so we were hoping this would be a new option for us. Nope. We won't be going back.Prices are crazy high. I know we are in Waikiki but most tourists do not travel across the pacific for naan and samosas. It would be smart to have something for the locals. Something that didn't cost an entire paycheck. Dishes come with nothing. Not even rice. Portions are teeny tiny and the food is just mediocre. Service was quite friendly and actually quite quick. Too quick in fact. We asked for our Naan to come out first. It didn't. It has to be eaten hot and that meant that our main dishes were getting cold.Bottom line...go to Cafe Maharani."], ["Michael S.", "I'm no connoisseur of Indian cuisine, but I think this place is pretty on point.  My friend from India introduced me to this place about two years ago, and this became our biweekly dinner spot.  I have tried other Indian places on the island, but this is consistently the best.The atmosphere is nice, but not gaudy.  There are select times it can get quite crowded, but usually there is no wait.  The service is very good and attentive.  They come around enough, but not too much.I have tried a variety of the dishes, and they rate at an average of 4 of 5.  It is a BYOB, and they will provide you with bottle openers and wine/beer glasses.The price is a little expensive, but you're paying for large portions and the nice downtown Waikiki atmosphere.Bottom line, I enjoy coming here and would recommend it to anybody!  I would especially recommend it for a first-time Indian cuisine experience!"], ["Lizette A.", "Had dinner here a few times under different management each time. Went from great to bad. little to no taste. They  added too much hot spice to a veggie dish. Seems like they don't make many vegetarian dishes since mine came with hardly any veggies !They could pay more attention and add more vegetables than just the hot spice.The spinach was mediocre too."], ["Kenneth A.", "Always incredible flavor!   This trip we had the lamb korma and Rogan josh.  Both were fantastic."], ["Bruce C.", "The price is my number one gripe, but I guess it comes with the high expenses in Hawaii. The food, otherwise, was good. Loved the Naan. We ordered one order of regular naan and one order of garlic naan. Fresh and hot! The chicken tiki masala was good. The tandoori chicken was pretty dry...I remember having much better TC elsewhere. We also ordered lamb curry, which was okay. In all, it cost $80! Ridiculous. Hate that they included tip in the bill too. Geez. Its not like we had a huge party or anything..."], ["Jennifer T.", "Used Groupon here last night and was impressed with the food.  We ordered lamb vindaloo and lamb saag with a side of regular naan bread.  I asked for the saag extra spicy.  Both dishes came out SUPER spicy hot, normally that would be a-ok with us, but the restaurant was soooooo hot inside no A/C I guess and I was seated with my back to the kitchen, so it was actually hard to eat in there cause we were burning up!  Its BYOB so that is good, but between the flush from the wine and the spicy food, we barely made it out of there before we melted completely.  Maybe next time we will just order to go and eat it in our air conditioned apartment.  Problem solved."], ["D W.", "Service was very, very slow. Food was bland. Tikka masala tastes like tomato soup with cream added. Nan was ok if a little dry. Rice ok. Many customers complaining about slow service.Another poor chap asked to change table as the light above his table was flickering. The woman denied the light was flickering rather than help him out. I know it's hard to run a restaurant but an apology or a request for patience goes a long way.I wont go back but wish them well - or a change of management."], ["Andrew H.", "Great chicken korma...still a great take-out option for those at neighboring hotels who are sick of paying high street prices for tragic food.  This place is solid...not spectacular, but for half the price of the resorts you'll get 4x the flavor."], ["Russel M.", "We frequent the other Indian Restaurants in Town and really like Maharani but hate the wait so we decided to try Monsoon. We ordered the Onion Kulcha Naan , Chicken Tika Masala, Lamb Vindaloo (very spicy) and Eggplant Veggie dish. We liked everything but felt the Chicken Masala was way too sweet. Next time we go we'll go with the Reg Chicken Tika. Overall a very good experience. Excellent Service."], ["William L.", "I came here quite a bit when I lived in Waikiki only due to my consistent urges for Indian and the restaurant being located downstairs of where I lived in Waikiki.  The convenience and decor was easily 5 stars but I wasn't quite satisfied with the food each time I went.Through my visits, I have tried almost everything on the menu.  Overall, flavor and spices were above average.  However, the meat of choice is always cooked poorly- chicken is dry, lamb is tough, you name it.  I always come back thinking and hoping this seemingly simple thing (perhaps not that simple) would be fixed but I leave each time wondering why I would think that.Unlike the main dishes, the naan is perfectly done. Garlic and cheesy naan gets an A.Its a BYOB place, so that good old indian beer to compliment the meal requires a little leg work to arrange. I never did bother, but it would have helped to offset the food had I been able to drown it down with some good old Taj Mahal.I have moved out of Waikiki for a year and have yet to return to Monsoon.  I no longer walk by it everyday and those same urges for Indian now take me elsewhere.  If I were you, I too would let your urges take you elsewhere."]], "Curry Cafe": [], "Masala": [], "India Café Curry Express": [["Gabriel T.", "I actually went down and ordered India Cafe Curry Express from the HPU downtown campus for the first time, not from UH Manoa where you usually see them.  It was kinda weird since I go to UH way more than HPU but at the time there was an event on campus so they were there.  I got the Chicken Curry bowl for about 8 bucks.  It had two pieces of chicken, red curry, Jasmine rice, salad, and your choice of a side which is either beans or okra.  I choose the okra because I love okra.  They had 3 other plate lunch plates but I didn't really bother looking into it because the chicken plate was the cheapest at the time.  They also ask if you want a side of their pastele bread for a couple dollars more.  They let you try samples of their entrees for the plates too.  The food is pretty good.  I kinda hope they would give more portions thought, especially the rice.  To me the cost is a but pricey for the plate lunches but it is satisfying nonetheless.  I should try the one at UH and even their restaurant.  The curry is very tasty and pretty unique from other curries.Yelp 365 Challenge #265/365"], ["Diane Y.", "I love that this place is a little cart operating on campus at UH. The food is spicy heaven, and I always indulge in the roti bread (it's sort of like a flattened croissant, but Indian rather than French). Portions are large: a mini plate is enough for me and a friend, and only costs something like $6.50. There's also a loyalty card - buy 10 plates and get 1 free. Pretty exciting stuff. I wish every restaurant did this.It loses one star for the rice. It's highlighter yellow, which I'm guessing means it's supposed to be saffron rice, but it doesn't taste at all like saffron. I suspect it's just regular rice with yellow food coloring or something. The rice is pretty much always clumpy, mushy and overcooked. The rest of the dishes are so good that one may be able to overlook the sorry, smushy rice."], ["Krys Y.", "This place is always really crowded when classes are in session.I went on an off day when there was hardly anyone around. There was still 5 or 6 people in line, waiting to order from here.I got a mini plate and they actually give a lot of food for it being a mini. They also have a lot of ways for you to get some kind of discount by internet somehow. I tried to do the 10% off discount, and when I did and showed it to the guy on my phone, he was asking what it was and I said \"it's for the 10% off you guys have listed right here\", and he didn't even look at my phone screen (which was what I was showing him with the 10% off thing) and he was like \"oh okay\" (like he barely knew what I was talking about but was taking my word for it. Then he manually calculated it in his head, and just rang us up at some price (which was a little less than 10% off, but he was really busy and was trying to get to the next customer, so I let it slide.Not so organized, but the food is good and plentiful! Oh, and what they say is \"spicy\" is actually very spicy. I love spicy food, and most spicy foods are mild to me, but the food here is actually spicy!"], ["Lauren W.", "Winter break at the University of Hawai'i Manoa is the WORST time to try to find a decent lunch!  Lots of the dining halls are closed and only a few of the kiosks are open.  Thank you, India Cafe, for saving me from the box of Christmas cookies left over from last week!I've seen a lot of reviews that complain about how India Cafe's food doesn't taste Indian at all.  In fact...it shouldn't.  Their website says that they serve food that is a blend of South Indian and MALAYSIAN flavors.  Ok, so maybe the name of the place is a bit misleading....how about changing it to \"India-Malay Cafe.\"I got the mini vegetarian plate for $5.75 (A little pricey it you ask me, but my last name 'aint Chang for nothin').  IT came with two HUGE scoops of Indian yellow jasmine rice, a scoop of coconut cauliflower and a spicy eggplant curry.  But just be careful, when they say \"spicy\" they aren't joking around.BONUS: I found a coupon online that you can print out and you get a free plate every time you buy 10!  We love free!"], ["el s.", "One of the best butter chicken masala! And I've had many BCM before to say this:) very good portion and even a better price. Just can't believe the food on campus can be this awesome!"], ["Jared D.", "Take it from an Indian: this place is nasty!!!"], ["Ashiyan R.", "Cheap mini plate for about 6 bucks. 3 choices of vegetarian curries (somewhat sweet,  not very spicy). An OK quick lunch."], ["J A.", "This isn't the best curry I have ever tasted but when you're hungry and it's a few steps from where you are, then it's as good as it can get.  Their spicy dishes aren't nearly as close to the spice that I prefer and I especially like their mixed veggies plate.  Their chicken curry also hits the spot.  What I especially enjoy is their naan bread.  It's so soft and buttery but comes at a steep price for one piece."], ["Samantha V.", "I really had high hopes. I'm a Big fan of indian food... this place was Horrible!  I ordered the chicken tiki masala, vegetable masala and an order of naan.  The chicken Tiki Masala was somehow bland...I know indian food right? supposed to = rich flavorful spice filled food.  The only real flavor was sweet and extremely unsatisfying! I think that the spices are only added for color. I thought that the vegetables  were a safe bet... NO, they looked and tasted like canned carrots and green beans and once again were extremely bland.  Now the Naan, that should have been fail safe, nope, it was oily and doughy on one side and burned on the other. I ended up throwing out my $13  lunch and will not be returning. So sad I really wanted to like this place.Having pics of your family in indian clothing doesn't guarantee good quality and tasting food.  Perhaps it just shows that they are trying a little to hard to convince us that the food is authentic."], ["lindsey m.", "yummm indian food!i've tried the calamari, fish, egg and chicken curries from here. They are all good but i like the egg the best. the calamari is super spicy! like a happy bon fire in my tummy.my favorite sides are the tofu... one is red and spicy and the other is green. The rice is good too... it is bright yellow like a highlighter.... but don't let the color scare you! it's good! sometimes if the really nice guy is working .. he will give you extra curry on the rice. =)Also I finally filled up my stamp card so I get a free plate on my next visit yipppieee!!"], ["Kaileen Y.", "If you like Indian food, check out India Cafe! I've never been to the one in Kapahulu.  But, according to my friends, this express location on the UHM campus is sooo much better.  The curries aren't as good as other restaurants, but it works if you're looking for something quick and need to satisfy your craving for Indian curry.  My recommendations are: -for the veggie option, the mixed veggies are good...& if u like ur spicy foods, you should try the spicy eggplant..or something a little more mild & sweet, try the coconut cabbage. -for the meat options, i usually go for the chicken curry or spinach chicken."], ["Mandolin D.", "I am definitely an Indian food enthusiast, so when a co-worker told me there is an India Café Curry Express in the NEX it made my day! How close and convenient to work. I've heard about India Café the Restaurant and visited the website that boasts they were voted \"Hawaii's Best Restaurant in Honolulu 2005-2009\". The vegetarian items on the website look amazing so I was ready to eat!I ordered the spicy tofu which was okay. It had a little kick to it. The yellow rice was nothing special and for some reason the vegetables reminded me of Elementary school cafeteria vegetables. Weird! Perhaps it was the lima bean that did that. Also they ran out of naan. BOO! Overall I was a little disappointed. This is only the Express version though so my hopes are sky high for when I try the actual restaurant."], ["Hanna M.", "I love India Cafe food.  The mini plate is more than enough for one person and regular can feed two comfortably.  All of their meat dishes are simply wonderful.  I like very spicy food and if that was more readily available at their express locations i would give them 5 stars."], ["Tom S.", "hit or miss. sometimes really spicy, sometimes not spicy. a bit pricey for campus food."], ["Jen H.", "Spicy shrimp was SPICY - loved that part. But, the shrimp portion itself was not plentiful at all. If you take into account the sauce, it looks like a good size but, it's really not. Also, the shrimp was a bit overcooked. Now, the sauce itself was AWESOME. Dipping my nan (flatbread) into that sauce was heavenly."], ["Ali B.", "Alright..so had a few experimental bites at the NEX one Good god I didnt think curry couls get so bad..it was narly..so bad...sosososo bad...I really should have known better indian from a cart. ugh Im not guna waste my time with the food. But honestly people if you have had REAL indian food...for example Cafe Maharani in honolulu ( amazing by the way) I dont see how in hell you could like this. The frozen indian food is better."], ["Kevin W.", "I stopped by the UH lunch wagon location.  2 large scoops of yellow rice 1 tiny piece of meat and 1 large scoop of WTH bean vegetables for $8. NO Substitutes and they make sure you understand it.  The taste was good but the attitude and portioning just bad. I'd rather walk to somewhere else to eat."], ["Selene B.", "I get excited whenever I go to campus (once a week) b/c I plan on getting food from here. I usually stick to the veggie mini plate & that's a lot of food for me already. I LOVE LOVE LOVE their roti. Can't get enough of it. Tried the chicken masala which was okay. Can't wait til Monday so I can satisfy my cravings."], ["Frederick W.", "This is a review of the Kilohana Square location.  I have eaten here for years, and as a Peace Corps Volunteer, spent two years in Malaysia, while many people expecting \"Indian food\" are disappointed I have never been.  First of all, there are so many different types of Indian food that is foolish to have a single expectation.  This is a blend of Malay/Indian influences from a family that has roots in both places.  The service, food, and ambience are all top notch, vegans can thrive here, the byob is appreciated.  Nothing to not like."], ["Angelica A.", "My fiance and I are huge indian food lovers...so when we heard about the new India Cafe Express in Kailua we couldn't wait to give it a try.  We are frequents at Cafe Maharani and have never tried India Cafe before so we decided since its closer to us we'd give it a try.  We decided to order take out so i called them up and i guess since they're an express the menu isn't the same as the restaurant.  Which caught us off guard because we chose things on the menu for the regular restaurant.  The menu here is mostly specials and seems to change day to day.  So i called in the order and i was sort of confused because there they serve the indian food like plate lunch style but we are used to ordering it family style.  So i asked to have everything ala carte.  The employee on the phone must have been new because he didn't really know much about the food or how its served so i didn't get a lot of help in that department.  Anyway we decided to order the Chicken curry, Spicy Eggplant, lamb curry and 2 orders of Roti.  When we went to pick it up we realized that their ala cart portions are manini and are more like sides so we had to order another spicy eggplant and lamb curry.  I wish the person on the phone could have explained this to me but oh well their new so i let it slide.  As for the food it was pretty good, i really enjoyed the eggplant...i think that was my favorite part.  But i must say it sure doesn't beat Cafe Maharanis eggplant tikka masala...my absolute favorite and a must try!  Overall it was ok, the lamb was a little dry and the chicken curry was nothing to write home about.  This was the first time i tried Roti and that was pretty good.  I think i'll give it a few months before i go back though so they can work out the kinks.  Cafe Maharani is just so good that it makes it hard to eat at other indian restaurants."], ["Jen T.", "I really like this place.  It's pretty convenient (for all you UH students), different food.  Sometimes I'm just sick of like gross Subway sandwiches and whatevz, and so I go here.  The meat curries are okay, not really that spicy, but then again I love love love hot foods.  Usually I just stick to chicken or fish...  Not sure how i feel about eggs or calamari in my curry yet, but one day I'll get more gastro-intestinally adventurous.  I really, really like their vegetarian masalas.  Need my chana (chickpeas), spicy (and they mean it!) eggplant, or tofu masalas or else I get bummed and wanna cry (and that usually happens if you're grabbin food at around 2pm...they run out early sometimes).  Also, super tasty deep fried samosas ($2.25)!  These go really well with the curries, give it a try!  At $8.25 per regular plate (1 large serving of meat, 2 side veggies, 2 scoops rice), it's a little steep for campus food, but to be honest, I can usually make two meals out of the plate.  Nice staff most of the time.  There's one guy that gives insane helpings.  Props to him for being the best.  Overall, pretty decent campus food."]], "Cafe Maharani": [["Liliana U.", "THE WORST SERVICE I HAVE EVER HAD ! After almost a month I have decided to finally write a review. This truly was terrible service. My boyfriend & I waited for a little over an hour to be seated, which was fine, we were expecting that. What was a little upsetting was that we were seated at a table that had been empty for at least 45 mins. Okay, fine. At that point we were still excited.  We were given a menu and we were super excited to finally try food. 15 mins go by. No one checks on us & we get no water. Now we understand this place is busy but there were at least 3 servers standing behind the desk laughing & talking. We looked at them the whole time hoping they would check on us. Another 20 mins go by. Nothing. Eventually after being seated for 45 mins a server comes by and asks us If we'd been help yet? Uhhhh no. I also mention that we've had no water either. She doesn't even apologize she simply says \"what would you like\" FINALY !!! We order & ask if we could have water please. She says she'll be right back with our waters. Another 15 mins go by & no water. We weren't upset of not having water. We were upset at the timing & the fact the we were watching her talk to a coworker at the register. We give her another 5 mins. Nothing. At this point we are just upset & hungry. We decide to leave. I think she saw me getting my bag off my chair back because she hurries over with water. We meet her half way & you can tell she's flustered. She looks at us confused & I just tell her \"We are leaving\". She mumbles a sorry & that she hopes we'll come back. Uhhhh no. Never. If you get fired than maybe. We understand that they are busy. Especially considering my boyfriend works at a very busy restaurant in Waikiki. We get it. What I don't get is how they can just stand around & completely ignore us for that long. I wouldn't waited happily that whole time, still excited for food, if we had just received good service. WE WILL NEVRT COME BACK"], ["Keanu M.", "Saffron Rice is Awesome!Best in flavor, but the place is a little to small to eat inside and parking is bad. Take out would be your best betDefinitely can't wait to go back"], ["Richard M.", "Food is dirty like the owners and sucks!!!!!!!Go to Taj Mah Hal and don't  follow the unknowing people that eat in this dirty place. SUCKS SUCKS SUCKS"], ["Jin M.", "This is one of the best Indian restaurants I've been to in my life. That includes 5 different States, including New York & DC--- and one of those restaurants won a James Beard Award last year! So I ain't lyin' when I say this place be gewd. Let's break this down--FOOD: Fish Masala Curry is deeeelicious. Soft sea bass in flavorful sauce, the fish just melts in your mouth. Eggplant Tikka Masala is my favorite dish here. SO amazing, full of flavor, this is most definitely a must-get, even if you're strictly a meat eater. Doesn't matter, this will probably still be your favorite dish. Trust me. Everything is ala carte, so you have to order a rice dish or naan separately. I always get both. What can I say? I come here prepared. ;) Saffron rice, plain (or buttered) naan, garlic naan-- get 'em all. It really brings all the dishes together. DRINKS: BYOB! Any restaurant that has BYOB deserves 5 stars. Also, the cups they give you is this cool looking gold goblet that makes you feel like royalty while drinking cheap beer from it. hahahaAMBIANCE: It's rather a small restaurant but with beautiful decor. It's a good place for a small group (3-5) because of the size. Or else you'll probably have to wait awhile for a larger table. Good place to bring a date! SERVICE: Well, they won't entertain you, but they fill your cup with water constantly & bring your food out quickly! Perfectly fine by me! I suck at small talk anyways. PARKING: Small lot behind the restaurant, usually full. There's a Long's across the street so you can park there for free. They don't take reservations and the weekends are busy as heck, so try to avoid the busy hours. I came here on a Wednesday dinner time and we only waited 5 minutes 'til we were seated. Another time I came here on a weekend, and ended up waiting 45 minutes. And that's lucky! But the food, oh the food, is worth it."], ["Kris B.", "So many reviews obsessed with the naan here... Well, let me give you some loving advice: don't get naan, get the BUTTERED PARATHA. Just trust me - get one per person, okay? Well ...maybe get one naan for the table. Message me if you think I'm wrong.I ALWAYS come here and eat until I feel like I'm gonna die and/or I need to be rolled out of the place after paying. And I get almost the exact same thing every time I come here - no regrets! 1) Start off with the Eggplant Pakora - fried but comes with great dipping sauce!2) Tandoori Fish - comes out sizzling hot, fish is tender, sauce is amazing, and yum crunchy bell peppers.3) Lamb Madras (new addition for me) - this sauce is definitely the tastiest, so why not add big juicy tender pieces of wonderfully cooked lamb? 4) Buttered Paratha forever! (Or garlic naan I guess.) And add some Saffron Rice to top it off. Used to come here several times a month, might have to pick it up again ....Only negatives: not much parking (I park by Bubbie's and walk) and the service is usually  really quite terribly slow. But the food somehow makes it worth it..."], ["Mel B.", "I didn't want to wait in line, they open at 5:00 pm.  We parked the car in the back at about 4:40pm.  There was a couple ahead of us.  Mission accomplished.  We'll be seated right away when they open.First time here but no rookie to doing a recon before deploying, we decided to order the following.Raita - Carefully seasoned yogurt with chopped cucumbers carrots, tomatoes, herbs, and fresh mintTandoori Mix Grill - An assortment of Chicken Kebab, Boti Chicken Kebab, Chicken Shish Kebab, Tandoori Prawns, Boti Beef Kebab & Chicken Tikka served over grilled onions, bell peppers & tomatoesAlthough the tandoori comes with naan, from past experience I believe you never get enough so I order a stuffed naan with cheese as wellLassi - Refreshing sweet yogurt drink with flavorsWe order the Mango Lassi for me and my gf orders the Indian Rose and these were brought out fairly quick.  I taste it and I know the mango they use is not hayden, my favorite type.  That's all right because it was still refreshingly delicious.  Tasting my gf's indian rose was a treat.  Just as refreshing, just a little sweeter and very good, better than mine for sure.  As i've done in the past, I ask her if she wants to trade in case if she likes mine better.  She decides to keep what she's got.  Fine.We're waiting over 30 minutes for our food to come.  I knew the tandoori would take a bit.  There are 3 other tables occupied and they have received their food. I wait patiently talking with my gf and watching the tables fill up with more guest arriving with their bottles of wine.  I was thinking of doing that too but decided to try their drinks this time around to have a better experience.  When our fooddoes arrive I know it was well worth the wait.  The hot plate is smoking going fully  into my face.  I can't move.  I just sit there taking in the entire fumes like an addicted junky reaching for that high. When I come out of it, I don't know where to start.  I just stick my fork in and pull out.  I get a tender, moist chicken. I don't know which one but I enjoy it.  Most of the meats are tender except maybe the beef but it still was good.  I loved the prawns the best.  My smile is carried out through out the whole meal as we attempt to eat everything.  Not possible.The raita's cool yogurt helps to bring the heat down so the meats are bearable to eat while adding another depth of texture and flavor.The naan with cheese was brought out a little later as planned to give us time to eat the regular naan.  This we could eat alone by itself it was so good.  The exotic decor with the dim lights transported us believably to another land.  A land we hope  to travel to some day.  MTV India was playing on the big screen showcasing a world of beauty and delights remembering stories  and movies of Sinbad and Aladdin. And, as this exotic adventure was coming to an end, we were already planning what we would like to try next on our next trip."], ["Kimo K.", "BYOF ... Bring your own food ... To eat while you wait in line because as described by everyone else who has written a review they do not take Rez and the wait is over an hour on Weekdays with 2-3 empty tables and WtF attitude service.  It's almost like they don't want to be backed up in the kitchen so they leave tables open?  Good things come to those who wait.  Maybe drink out back while you wait? no no there's no excuse for this repeated style it Is just hindi food and its not cheap... clean the tables and seat people ... They must think that it's cool to have people waiting over an hour like some New York club.  Well if you no like wait take to go and piss off people waiting for table while you get your order to save 20%"], ["Victoria A.", "Nickel version for those who want the cliff notes for this place:- Minimal Parking at the rear - street parking available but be prepared to walk.- BYOB (bring your poison...one of the many good things about being in the 808)- Dinner only (5-10 p.m.)- Call 30 minutes out before getting there to get on wait list, then wait some more- Take out available- Line starts at the rear (by register)- HUGE portions- OMGoodness NAAN Bread- Superduper-califriggindelicious EATS! So if you're still reading this you're probably still not sold about coming here nor have a clue what Superduper-califriggindelicious EATS means. Well Cafe Maharani boasts 810 (i make the 810th one) reviews all raving about the food and experience. While my eating budding was chanting about Nirvana away in her head I broke out with, \"girl you know it's true....true-ooh-oooh-oooh it's TRUE!\" I hadn't read all those 809 reviews but word is out - EATS here is good!! Well worth the anxiety of finding parking, waiting, then waiting some more and more waiting for....wait for it - WAIT service. Amazing Vegetarian selections - literally a whole section so it's pretty painless trying to decipher which dishes don't have meat in it. Also, if you're an Atkins eater - too bad so sad, you're going to have to break the rules this one night - NAAN (plain or stuffed) is really divine - flavorful, soft, gooey (if you choose the cheese stuffed one), garlicky bread! Warning though...you will reek of garlic thereafter. I took the chef's recommendation of Vegetable Navrotton Korma, chock full of veggies and the sauce was dimensional, rich and hearty. I enjoyed the tidbits of sweet fruit and nuts in every few bites. Again, portions are HUGE here. Take out boxes are a must and the leftovers made for the perfect meal the day after (it fed three grown adults the following day).So to echo what everyone is saying - WELL WORTH THE WAIT to come and eat here. No pain no gain. If you don't know - now you know. All in all a very enjoyable meal that well overcompensated the understaffed and tightly weaved dining space."], ["Jesse C.", "I almost gave up on Indian food years ago due to some bad experiences, then my wife introduced me to this place. Now we order take out from maharani at least once a week (usually twice). We've eaten in the restaurant a few times and it's so crowded due to its popularity that we usually just get food to go to skip waiting in line and avoid the crowds. The chicken coconut korma is hands down my favorite thing here, super tender pieces of chicken in a light curry sauce with vegetables and coconut milk, The tikka masala is also top notch. The coconut rice and saffron rice are great and the potions are huge. I'd have to say this is easily the best Indian food on the island. Also, you can't go wrong with any naan bread on the menu but the garlic is by far my favorite."], ["Raina M.", "Horrible food and experience! 1. Everything was extremely oily (dripping)2. Portion sizes are huge (than normal) something the server should inform so that the right portion sizes can be ordered3. Waiting time- 1.5 hours4. Hygiene issues?- noticed cockroaches near the exit door.To be fair- some of the servers were friendly.Overall- a No-Go!"], ["Tiffany L.", "Hands down the best Indian food in Waikiki! You will not be disappointed! The restaurant is very small and they don't take reservations. It is a fist come first serve basis. So if you plan to eat there I would suggest to show up at least 30 minutes prior to opening. And trust me you will find a line! That just tells you how amazing the food is."], ["Johanna M.", "I have been here several times and have had a good meal each time. I will say that I prefer Himalayan Kitchen over Maharani's, but Maharani's is a close second. I like the flavors of the food here, though some of their dishes have been inconsistent from visit to visit. My favorite dishes at Maharani's are the chicken tika masala, the eggplant tikka korma, and the lamb vindaloo. I try pickle do not like lamb because it is so gamey, but they do it right here. It's really soft and yummy. Their chicken tikka masala is really tasty as well, it can be sweeter from time to time (which I love), and other times, it's been more savory. In terms of the eggplant, this one is a surprisingly good one. I didn't think I would like it as much as I do. It's sweet, crispy, and the sauce is so good. The naan at Maharani's is also really good. We always order the garlic naan and rice to accompany out dishes. It's always crispy around the edges and soft enough in the middle to scoop up your food. The staff here is sweet, the decor is colorful and bright, just as if imagine India to be. I also love their dishes. They have really nice dishes, which are a detail often overlooked by some places. I'm serious. They have chalices! I love drinking water out of chalices. I feel like Little John in India. Good stuff."], ["Raelyn B.", "I happen to absolutely LOVE spicy food and there's just something about Indian food that brings me back to my more adventurous moments. Being on Brick Lane all the way in East London is something else. It's not everyday where you get an Indian man standing in front of his family's restaurant asking you to marry him... Not Cafe Maharani is NOTHING like that. lolLet me break it down:Parking: Not really. It's a small lot but difficult to navigate. Best bet is to park on the street.Exterior: Unless you're really looking you'll find it, I'm sure. If not, you could miss it 100% It's a really small restaurant.Interior: I have a weakness and it's Bollywood movies. Not only do they have one small tv setup near the register and the kitchen playing nonstop Bollywood movies of attractive god like indian men body rolling but you can make yourself feel like you're in one. Sure it gets hot, but it's probably from all the spices you're eating (or how you feel about watching bollywood movies that just get your temperature up) but it's really hot in there. LOL It's also VERY tight. Although it's definitely doable, don't expect to have much movement when you're with a big party.Service: Like everywhere else, make friends, I've friended a few of the waiters because hey, I've seen them around the UHM campus and I'm just an outgoing person. What's the golden rule? ... exactly!Food: Don't worry if you don't like things spicy, they have something for everyone, even the uber vegetarians. Indian food became the best choice for our family because it had a bit of everything - vegetables, naan, spicy, lamb and \"feel it on the toilet spicy\" as Sarah M would say. You can't get naan of this anywhere else. Enough said.There aren't very many Indian restaurants on Oahu but Cafe Maharani makes my top no. 01 spot."], ["Tracy K.", "How is it that I have lived across the street from CM for five years and have NEVER eaten here until now??Blasphemy.Good job Denby R. and Iris K. for our GDO (Girls Dinner Out, not Girls Night Out because I'm an old lady)! Whenever we get together, there's always deliberation on where we'd like to munch. And thankfully, my hubby Ikaika O. is not too fond of ethnic dishes like Vietnamese, Thai, Indian, Ethiopian, etc., so it makes a great dinner date excuse with the ladies. It was Monday, and we were walking to a Peruvian restaurant that so happened to be closed on...you guessed it, Mondays. Heads turned left, then right. After a few mutters and restaurant names being thrown out, we started looking toward eateries by Down to Earth. As I regurgitated all the foodies in that area, I quipped, \"You know, I've never eaten at Maharani.\"It was as if I said the Earth is SQUARE.\"WHAAATT???\" replied Denby. \"You've NEVER eaten at CM??\"As I fumbled for reasons why I could be so negligent like \"well, you know, the wait is always so long, and the parking, gosh...\"...Iris added, \"I've never tried that place either!\"Oh, it was on.We beelined it there and Denby had the higher intelligence to make a mad-dash call (using our beloved Yelp app, of course) to see what the wait time was. It was easily close to 6pm at prime dinner hour. BUT! As luck shined in our favor, the owner said that there was ONE table open and NO waitlist if we could get there soon. SHYAAA!!Empty tummies barreling to CM could be seen from space at the rate we were going. And there it was...a big four-top table--empty and waiting to support our derrieres.I was in awe at the decoration. From the outside, everything looks so modest and unassuming. Inside, the chairs look like they would seat a Maharaja. The mirrors are bejeweled with rubies. And the cups added to its authenticity! I felt like I was at a Disneyland attraction in an antiquated version of the Mumbai Tower of Terror. I have heard how good the food is. I have seen the leftovers my coworker would bring home. And NOTHING could prepare me for how delicious everything actually was!We ordered three 4-combination plates and a side of Raita (fresh yogurt) to temper the heat. You are only allowed to order certain meats and veggies with the combination plate. So we strategized on which veggie and meat dishes we each wanted to try, and did a switcheroo when the plates arrived. We decided on:1. Chicken Masala Curry- Like Yellow curry is to Thai, this was a staple dish. Popular and savory with huge chunks of chicken, moderately spiced.2. Chicken Makhni (Butter Chicken)-Don't let the name fool you. The flavors are more of a tomato base and rounds out a smoother, milder acidity with the butter. Easy to eat and minimal spice.3. Lamb Saag- Creamy spinach and cubed lamb makes this a House Specialty.4. Vegetable Jalfrezi Masala- Another House Specialty, and a delightful combination of all different veggies with moderate spice.5. Dal Sambar- Lentil and veggies cooked in cream had remarkable taste (careful with the chilis!)6. Vegetable Korma- Hearty chunks of stewed veggies...let's not forget the cardamom!7. Palak Paneer- CHEF'S SPECIALTY of homemade cheese and creamy spinach. Tasty, however not on the top of my priority list.Everything, and I mean every last morsel was well rounded with exceptional flavor, including the buttery soft naan bread (ohhhh...). You will not be disappointed with whatever your heart chooses. And I had leftovers for lunch the next day! It was a win-win evening! Yummy Indian food and no wait. \"Dhanyavaad\" (Thank You), Cafe Maharani!"], ["Robert S.", "This is some of the best Indian food that I've had. The chicken manchurian is amazing. Lamb madras and rogan josh also very good. I love that it is byob. 5 stars for food. However, their service gives it negative 3 stars. It is impossible to get them on the phone for take out. If you do finally get them on the phone to order take out, you get ignored frequently when at the desk waiting for your food. It can take forever to pay even when you see your food right there. If you eat in, the waiters tend to be pretty good, but the wait times are very unpredictable and there isn't really a place to wait. There are nice people that work there but there are also some very rude people that shouldn't be in the service industry. The food keeps people coming, but this place has so much unrealized potential. The poor logistics of this place is well documented throughout these reviews. If only Maharani were run professionally, it'd be one of my favorite spots on the island. I'm not the first of my friends to give up on this place."], ["Mark O.", "There aren't many Indian restaurants in Honolulu which is to be expected. Of those, Cafe Maharani is probably the best option if that is what you are looking for. Located on King st near University, Maharani is a small restaurant with somewhat limited seating. I'm a fan of Indian food and once in a while I definitely crave a good lamb dish with some garlic paratha. Tonight we got some takeout (which I recommend considering how crowded this place gets) consisting of Chicken Malai Korma, Lamb Vindalo, Eggplant Tikka Masala, Garlic Naan and Garlic Paratha. The eggplant dish is one of our regular favorites and was enjoyed by everyone. We ordered the lamb to be 8/10 spicy and it turned out fairly well. The chicken dish was average and not that well received. We all wished that instead of one naan and one paratha we had instead ordered two (or three) parathas. It was just that good.Overall, Maharani is probably the best Indian food on the island, although that's not really saying much since it doesn't have much decent competition. I generally like eating here and \"I'm a fan.\""], ["Mariesol W.", "Let me preface this with, I honestly really wanted to love this place but it fell supremely short. After reading the reviews my boyfriend and I decided it was best to come early to avoid a long wait time on a Saturday evening. We were able to be seated right away upon our arrival about 20min after they opened. As previously mentioned in other reviews here, the space is very limited and crowded. That didn't bother us at all but what was irritating was our seats. If you lean back, there are jagged plastic edges on the chair back design that poked through our shirts. Even then, we tried not to be bothered with it and just sat forward all dinner. Our waitress was quick and friendly so no complaints there, but our food was not very delicious. Actually, the food didn't taste bad either. What's worse was that the food was completely bland. It needed a bit of spice or some salt or anything really but there was no flavor. They overcooked the lamb to the point that I thought it was beef and the chicken masala curry had absolutely no taste except for a hint of tomato. We should have known when we received our food because there wasn't an aroma coming from any of our dishes or our neighboring tables' dishes. Even the mango lassi I had was bland and fairly gritty. I am so disappointed. In addition to our chicken masala curry and vindaloo curry, we ordered the garlic topped naan and the cheese stuffed naan. Either the kitchen or a runner forgot our order so had it not been for us asking the status on the naan after 40min since taking our order, we would have never received it. Actually, we never received the garlic naan but we didn't want to ask our waitress again because we just wanted the check already. The cheese naan was good, we'll give them that, but that's pretty hard to mess up cheese with naan. When we got our check they charged us for our entrees, drinks, and the two naan. Since we only received one of the two naan, we just added that to the tip we left in addition to the cash amount to round the tip off at 20%. Like I said, our waitress was nice but the others seemed a bit aloof. Oh well we got lucky with ours. Long story short, we were very let down with our experience. We would always drive past and see the long lines so we were very eager to love this place. Sadly, we will not be back."], ["Jon C.", "Not that Maharani needs another review, but as my favorite Indian food place since moving home from Washington D.C. in 2006, Maharani has been my \"staple\" when I get those Indian food cravings.Located on S. King Street, just before Down to Earth on the makai side, it is opposite Long's Drug (formerly Star Market).  Parking is limited to the street, and a small parking lot located on Hausten Street.  It only has about 15 stalls and gets very crowded during peak dinner hours.I recommend going early when they open at 5 p.m. or later (after 9 p.m.) if you are going on a Friday or Saturday night as it gets very busy.  Many of the seats are communal so be prepared if you are a party of two to share a table with another couple or party.  Bathrooms are located outside the restaurant and shared with Subway.  Finally, the a/c is not very strong in here so I recommend dressing in comfortable clothes (especially if you are eating anything spicy).My fiance and I have been ordering the same thing for years, so I can say much but our friends who are regulars have said most of the food is very good.  I normally order the dinner for two, which is a great deal considering the price ($40.99).  It includes two veggie samosas (HUGE!) or onion/eggplant pakora, two entrees ($2 extra for one lamb dish), rice, and naan bread.  We normally order the lamb vindaloo, which is delicious, not gamey but very tender and spicy, and the eggplant tikka masala, which is eggplant cooked in a flavorful tomato curry sauce & topped with fresh tomato and cucumber.  The portions are VERY generous and it usually ends up being lunch the next day for both of us.Final comment, its BYOB! Highly recommend a wheat or IPA or some german riesling or cava to compliment the food."], ["Shahzad A.", "This place is a 5 star for taste and food. Zero stars for service. The owner doesn't understand the simple concept of taking or not taking reservations. The owner said that he does not take reservation on the phone but when we arrived we noticed that he was seating people that came after We did. When I asked he said they asked to put their name on the wait list. If you put name on lists ahead of time then tell people that when they call for a reservation or tell the people to all ahead to be put on the list! We stood in the line for an hour and a half while he kept taking people that came after We did. So I recommend the food but call ahead and put your name on the list!"], ["Denby R.", "I saw my BFF Tracy K. write out her wonderful review and I realized....wait, I haven't revved CM? how is that possible? I had heard for a while that CM was the place to get good Indian food. I have gone to most of the other ones on the island and had left feeling \"meh\" or sometimes with a greasy belly (or shirt...I'm not the neatest eater). But when I finally got through the line at CM my tastebuds did the happy dance and so did I. First time I went was with my husband (Henni R.)...and we thought it would be perfect for my family to try. Only problem is the wait...Henni and I were lucky enough to get a table within 15 minutes, but when I took my family there we were waiting one day outside for over 45 min and watching other people eat. Family lost their patience and we went down the road instead. So next time....I listened to Emi H. and did take out...called from work and picked up without much problem. My family LOVED it! I even heard whispers of \"it would have been worth the wait\" yesssss!Fortunately there have been people around me who are willing to wait it out with me when take-out isn't an option...so I have gotten to eat at CM relatively often. But as Tracy K. mentioned....when we had our tastebud adventure GDO, she and our BFF Iris K. admitted to being CM virgins I was shocked! Then totally happy that there was a table ready for us when we got there. we ordered the combo plates...passed around the Naan and small dishes of the sampler plates. The company was happiness for my soul, the food was happiness for my stomach. The servings are deceivingly LARGE. I have not walked away hungry from here! Wish the wait wasn't so long and the table got turned over faster so us CM fan-atics can get seated quicker....but patience is a virtue and I can be good at waiting.Learn from the wise Emi H....DO TAKE-OUT....trust her. And they are BYOB"]], "India Cafe Express": [["Joanne V.", "I've been wanting to try India Cafe Express for a while, but every time I tried, the one employee working would be on break. Luckily, westbound traffic brought me to NEX at dinner time & I was able to finally get a taste of my favorite Indian entree, butter chicken! I loved it! The chicken was tender & the sauce was flavorful. The saffron rice looked so bright & was cooked nicely too! I got a mini plate of the butter chicken & I'm sitting here... Super stuffed, but wanting more. The one guy working here tonight provided wonderful service & wasn't frazzled at all by the growing line of people waiting to order. I will definitely return & I I'll prob order a regular plate next time around... Maybe sample everything too :P"], ["Mark H.", "Whoo ha!  I haven't had roti in a hit freaking minute, so when I spotted it in the NEX food court, I had to give it a whirl.  Glad I did too because it was scrumptulescent. I got the butter chicken with coconut cabbage and two roti.  Delicious and highly recommended."], ["Daniel K.", "Wow 4 pieces of lettuce for salad, one piece zucchini for curry and potato curry labeled as pork. No complementary water. More than $10 for a plate."], ["Masato I.", "My favorite spot in the food court.  They usually have a couple of chicken curry options which are always mild.  They sometimes have a veggie curry that has a little bit of kick if you want something spicy.Always quick and easy and the service is usually attentive.  If you want to try before you commit, they'll usually let you have a taste of a few.  The mini is usually adequate to fill me up.Obviously there is no tandoor oven here, so you wont get that smokey flavor and no naan."], ["Lisa T.", "I'm no Indian curry expert but the partner in crime has introduced me to the India Curry Express located in the NEX food court.The kiosk is located near the escalators across from McDonald's. I've only tried a couple dishes which include the butter chicken, the okra, the eggplant dish and their roti bread. As this really is my first Indian food experience it was good. The eggplant was hella spicy and we ended up not finishing it. Not sure if that is normal but if you like spice that may be your dish. The butter chicken was good and made with nice pieces of chicken thighs. I'm not a huge okra fan but I actually enjoy their okra dish. The roti bread is served warm and buttery. Overall, for the price of a plate, it was enough for my partner in crime and I to share and came out to $12.13. Not bad for a quick cheap dinner :)"], ["Michael C.", "I am pleased to report that the terrible review I had originally written I can now modify. We used to be absolute fans of the curry, and not only was the food great, but we got to know many that worked there. You could tell they were proud of their product, and I even considered them friends. Around the beginning if this year it all seemed to change. Those we knew were gone, or almost gone, working a single shift a week. The good became worse and worse until we just stopped considering curry as a stop. Today we gave it a try and we pleasantly surprised. We will continue to monitor and sample with caution, but we are hopeful the quality of the food returns to what it was last year. We are looking forward to being able to add a star in the near future."], ["Brandy W.", "This inspection is a tad inflated, mostly because after 4 long years in hawaii, my taste for Indian food has degraded just like my taste for mexican food.  Located in the NEX food court as a kiosk, this is the closest Indian food I can find, beyond University and Kailua.  They usually have 2 chicken curry dishes, one vegetable dish and a salad available.  The curries are usually some sort of tikka masala or korma dish.  Do NOT expect tikka masala or korma when you order.  This is spiced curry with huge chicken breasts thrown in.  Not chicken chunks slathered in creamy peanut or tomato based curry.  Whole chicken breasts with some seasoning.  The rothi is standard thawed rothi, and has nothing wrong with it. Ultimately, I just crave Indian food and find myself here.  If I lived closer to cafe marahani, I would definitely be there ALL THE TIME, but unfortunately I'm not. :(  India Cafe Express it is."], ["Katherine R.", "Pork Masala was cold and the rice was barely warm. Also asked for roti but they didn't have it any which was disappointing. Flavour was satisfactory for a food cart. Customer service was also average. Worker looked like they didn't want to be there. Maybe having a bad day."], ["Thomas O.", "Indian food is my newest obsession! And for those who know me...I can get really obsessed about things. Like Aspergers status obsessed.Anyways, I work near the Navy Exchange and never have time to make lunch for myself in the morning or the night before. I'm on the go constantly...in my car by 7:55 am and home around 1 am most nights. God bless my youth. Since I'm always on the road, I'm always looking for places to have a substantial and healthy lunch--without having to visit a drive thru. I must admit, the food court at the NEX is pretty fucking terrible. No offense to those that work there or run it, but honestly I'm kind of tired of all the fast food eating places here...Can you be more like Yataimura in Shirokiya?! Is that so hard??So with that, I must thank them for having India Cafe Express...my new go-to. They have rotating specials everyday from Butter Chicken (Tikka Masala) curry to Chickpea curry, and even Okra curry. You can even add some tasty roti flat bread, which is a MUST for mopping up leftover curry. There are mini (1 choice) or regular plate (2 choices) options and prices range from about $8-12. From what I've gotten, chicken is really tender and I'm a fan of all the veggie curries...their spicy is INDIAN spicy, but their milds are more my temperature...especially if I have to walk back to my compound in the hot sun. I just have issues with the richness of the flavors...they could definitely be more robust and...INDIAN, ya know? The prices are a little steep as well for curry...they could also be a little more temperature hot. I want it STEAMING on my plate..although I understand since they are just a cart and not an actual restaurant."], ["Jando S.", "Without being among America's Finest (i.e. vet credentials), my experiences at the Navy Exchange Mall was limited to their food court. Naturally with my love for all things Indian, India Cafe Express and its array of pre-made curries tickling my aromatic senses into wanting more.The menu tacked on the outside of the kiosk is pretty simple. There are daily specials which range from vegetarian to meaty options. Most of it is northern Indian inspired, along with a nod to some of the local dishes (oh hai, coconut shrimp). While most Indian food court spots will automatically serve naan as a bread accompaniment, it should be noted that this joint also serves roti as well.If one should choose the veggie + meat combo, I think there is no better combination than the chicken curry and bindi masala. Chicken curry is as staple as it gets, but this version from I.C.E. offers some real kick and a sauce that isn't too overbearing. The chicken is chunky and on the bone, which is a plus flavor wise. Bindi masala is the veggie dish all health nuts can appreciate, but the spicy creaminess of the masala combined with the fresh eggplant is very decent.I can't sing the praises of their navratan korma, which was a bit too chunky for my tastes and a tad on the bland side. Chicken tikka masala is a little sweet and their seafood selections (fish curry, squid, etc.) are always a toss up between subpar and sublime. For a city as expensive as Honolulu can be, a $10 lunch plate here is not the worst thing in the world, especially when the cuisine is Indian.The guys behind the counter are nice, which enough warrants the multiple returns. They've taken the feedback well with every visit, which I'm hoping will be implemented by the time I find myself back in the mall. I'd rather eat here than shop for discounted senior citizen gear anyway."], ["Quijana B.", "Spicy eggplant is the best thing on the menu.  It is a pity that they don't serve it every day, but I can forgive them.  I love spice.  I love spice that is filled with flavor and isn't just \"hot\" or \"salt\" pretending to be spice.  What is the difference?  The difference is Tobasco (hot) vs Sriracha (spice) or plain cumin vs curry powder.  The spice in the spicy eggplant is exactly the way I like it.  Hot enough that I have to eat it slowly, thinking about each bite.  Hot enough that the cucumber dressing on the salad is a welcome moment of cool on my tongue, helping me decide that I can brave the next bite.  I stop by the NEX once or twice a month for one reason or another.  I do my best to time these visits so that I can eat at India Cafe Express for lunch or dinner.  I try to remember to order the plate \"to go\" so that I don't feel the need to finish the massive plates.  I sometimes forget, and then am forced to decide whether to concentrate on the chicken or the veggies.  The veggies almost always win.  The prices are higher than most of the other food stands at the NEX, but the food is so much tastier.  The NEX food court is open to everyone, not just military.  No need for ID cards or escorting a \"guest\" to the counter.  Bring your friends, but warn them about the eggplant!"], ["Jennifer L.", "I am very pleasantly surprised! I was here and needed a quick bite. I LOVE Indian food but usually make my own. $11 got me curry chicken, rice, salad and curry potato's plus a side of Roti. For an express it was tasty! The guy that helped me was named Ricky and he was very nice (good service is a big one for me). Thanks!"], ["Jennifer C.", "I find that Indian food is hard to come by on the island.  So I was super surprised when there was an Indian food stall at the NEX!  I had the eggplant curry with an order of roti.  It was spicy deliciousness.  I used the roti to absorb all the yummy sauce.  For under $5, too!  I will be back to try the other dishes for sure."], ["Chanel H.", "So I have heard people say that this is the best place to get some Indian food and I thought I might give it a try. So after all the questions I asked I proceeded to order the butter chicken only to be told she didn't have anymore and yet the sign was still up. I was very disappointed and had my heart set out on it. Needless to say my first and last time coming here."], ["Jennifer L.", "As I'm lying here in pain, suffering from a horrible bout of food poisoning, I'm also kicking myself for eating here for dinner last night. I've had Indian food many times in the past, & although I wasn't too thrilled at the sample I was given, my hunger took the best of me & I ordered a plate of the butter chicken curry - a milder, slightly sweeter Indian curry than I'm used to. I downed my food at home & immediately regretted it. I begin to feel a bit sick right as I finished, kind of like there was a brick of curry not wanting to digest. Numerous hours later, still sick & still bloated. I opted to drink some herbal tea & try to sleep it off. A few hours later, I awoke to horrible abdominal pains & feeling as if I had a fever. I dragged myself to the bathroom, did what I had to do, & dragged myself back to bed. Flash forward to the present & I regret everything. I still have horrible stomach pains, feel terribly weak, & have completely lost my appetite. DO NOT EAT HERE!!! Or if you do, stay clear of the butter chicken curry. Don't repeat my mistake & end up in pain like me :("], ["Dez H.", "I have seen this cart in the NEX food court forever, and after todays lunch, dont know why we never ate here before!  I specifically wanted something very spicy so the guy suggested the fish samba. I got a mini plate which came with rice, the spicy curry fish, and one veggie choice. I got the curry potatoes. And since he was making fresh flatbread, i got one of those as well. Now THAT is how spicy i love my food!  It was refreshing to actually order something spicy at a restaurant, let alone in a food court, and actually have it come out spicy!  There were small pieces of fish and shrimp in the red sauce on top of my rice. It was truly delicious. The potatoes were mild and good and i thought balanced my flavorful fish samba. The roti bread was soft and freshly cooked. It was so light and flaky, like a flattened croissant almost, but thats a good thing!Pricing was worth the amount of food, especially for a mini, but mostly because it was really good. Next time you're in the NEX food court, try this place. Not your ordinary fast food."], ["Lori W.", "So the guy said the spicy eggplant was spicy, really, really spicy. And in my head, I said, \"yeah, whatever, I've eaten something called 'homocide wings [FYI: 'suicide wings' just kills you; 'homocide wings' kills the people around you, they're so hot...so says the menu. I tell you that to tell you why I thought I had the gonads to just shrug at the man's description of the food], so bring it, Chuckles.\"I was an eeeeeee-diot. Should've listened to the guy. Because he was right, but also because after eating these things, my hearing started to fail. It was that hot. Really, really, really hot. Super hot. I drank someone else's milk from the table because it was that hot. It apparently gets spicier and spicier as it sits on that catering burner. Don't go at the last minute (aka after 8pm) unless you're truly in a risk-taking kind of mood.In summation, the roti is good if you're there before 5pm. After that, it's soggy and weird, like an old ear slathered in butter. Yeah, eeewwwwwww. The chickpeas are good and tasty, but not as flavorful as you'd expect Indian food to be. The coconut cabbage blows the house down, it's so dang good. But the eggplant? My friends, the eggplant almost put me in the ground.Like the other reviewers said, listen to the man when he says it's spicy. He ain't lying.The price point is pretty out there, especially for a place that gets its food driven in from the brick and mortar Kailua location in the morning and reheats what it's got throughout the day. A star less because of the cray-cray markup for what is not the most expensive of world cuisines to prepare. I'm shaking my finger at yoooo-uuuu, India Cafe Express.But where are you gonna find Indian food on that side of the island? So yeah, I'm going back.Tip: sign up on the India Cafe website for a $5 coupon you can use at your next visit. Use it fast, though, cause it expires a few days after you get it.Oh, and my hearing did come back eventually. My dignity has yet to be found."], ["Regina T.", "I came here for a quick lunch...I know how you gonna do a quick lunch with at all the food?  Well I was very careful when I drove home...I got the veggie dish and super spicy eggplant ...ugh it was sooooo good!  When I want spicy I don't want any cheezy hot I wanted the hot that makes your nose run and sweat and it did!Haven't had a chance to go back, but I will the next time I'm there."], ["Ira J.", "The India Cafe Express food cart inside The Mall at Pearl Harbor serves up a pretty awesome lunch.  Their dishes have a ton of flavor and their portions sizes are not skimpy.  You'll pay a little more than you might do at the neighboring food carts/stands, but I believe it is worth it.This brings me to a point I need to stress: From my experience, one should order the mini-plate instead of the regular sized plate for better value.  With the mini-plate, you do not get a side veggie, but you do still get a plate full of food.  Once, in fact, I ordered the regular plate and when I compared it to my dining partner's mini-plate, he had more food!One more point that needs mentioning: when the guy or gal at India Cafe Express tells you that the spicy eggplant is very spicy, you should believe them!"], ["Scott K.", "Most people know India Cafe.....from its cart on the University of Hawaii, its original location in Kilohana Square, its other location in Kailua and its Food Truck. Yes they are everywhere so why wouldnt they be in the Navy Exchange Food Court.I love indian food for its flavor  but in not sure i like pre-made. I normally visit the Kilohana location where everything is made fresh and to the spiciness that you like.I had the Chicken Curry tonight with the spicy vegetables.....the chicken was great, soft to the touch of my fork with just the right amount of curry. The spicy vegetables....its SPICY! I had to have a cold Thai Tea to help sooth the hotness.This cart has maybe 6 or 7 items so you dont get the full menu like its brick and motar locations. It does however give you a sample of what they offer."], ["Al D.", "This place has gone downhill.  The food is just of poor quality.  The mixed veggie dish is like generic frozen mixed veggies (corn, diced carrots, green been, lima beans) in curry sauce.  The okra was way too salty.  And the eggplant just meh.  Overall the food was like slop. The roti was cold and strangely sweet.  The worker didn't even notice I was standing there and seemed to be doing something where she was crouched down behind the kiosk.  I was hoping she would wash her hands or use hand sanitizer before serving me but she didn't.  Her attitude was like whatever, she could care less if she got any business, and from the looks of it, they are not getting much business.  The plates should be $2 less than what they charge.  Avoid!"], ["Dennis P.", "Mujhe pine ka paani chahiye dis stuff is hot!  If you want it hot... if not, its not, but delicious.  A quick stop, if you don't mind the parking... Chala!"], ["Angel F.", "I love this little food cart! I am vegetarian/pesca and love that they offer veg options!  Their mushroom dish is so good that if you don't get it early they sell out like last night but it forced me to try something new.  The spicey calamari! That was delicious as well as the spicy noodles that came with it.  And I recommend getting the roti uncooked in the packs they sell and cook it at home. The guys that work there are very friendly too!"], ["Erika A.", "I m not an Indian food expert but i sure do like this place. I have never been disappointed with their food and service has always been excellent."], ["Utkarsh P.", "The worst indian food I have even had. The management should be ashamed to sell this crap as \"Indian\"."], ["Quyen N.", "Very pleased to find a vegan-friendly place at the NEX (and Indian fare to boot)! Today's lunch menu offered three vegetarian (even labeled vegan) options: chana masala, mixed vegetable masala, and a third one (cauliflower something, I think, didn't try this one, warned it was spicy). I enjoyed the first two options. Spicy but not hot spicy, flavorful, not salty. The portion size for the two-option lunch plate was pretty good too. I probably should've opted for takeout instead of eat-in so I wouldn't feel pressured to finish most of everything on my plate. So I dig! I'd eat there again! Maybe try the other vegan option as well as the bread next time."], ["Tawny A.", "oooooooh yes. oh. yes. i eat here like a starving pregnant woman. every time. curry, check. more curry? check check. roti servings for 3? check. all to be consumed by this here fatty? check.yum."], ["Hazel T.", "I tried the #1 South Indiana Chicken Curry. It was delicious I must say. Once I entered the second floor of NEX I immediately smelled curry and had the taste for it. Since it was my first time, the worker kindly gave me a sample! There mini plates was a good size for its price! I'll be coming back for my lunch break :)"], ["Reuben R.", "I've never been to India Cafe, except for its express carts like this one and the one at school in Manoa.Today I got a mini of the special. It was a bit more than $7, and today's choice was curry shrimp. It wasn't too spicy but it had enough flavor in it to touch the palate. I wonder how much better it'd taste if it were fresh and not on a heater in a cart, however express is what it is, and its pretty good for just that."], ["Fred M.", "I've been to this place twice and I like it. This place is located inside the NEX building and in the area where people does not have to show their military ID card.The price seems OK only because there is only two places that serves India food on the island. There nan bread is disappointing, when I asked for one he took one from the top of stack nans that looks like its been sitting under the heat lamp a little too long. I took it out of the foil after he wrapped  and the surface of the bread already started flaking. This cart also serves hot spicy curry mixed with a mixed vegetable (I think it was chopped eggplant), I just asked for one piece of that vegetable but he ended up giving me small scoop for free as sample which I though it was cool I get a little more than what I paid. Now I'm not the type of guy who can handle really spicy foods maybe only at a Tabasco spicy level but this curry was way too spicy to eat and I couldn't finish it not without a full glass of milk and more bread.This place has a small menu selection but the amount of food they will give you will satisfy you. Another thing about this place is that I noticed every time I come around here I always see the same guy serving on this stand."], ["Gizelle M.", "Its a little stand in the NEX food court on the second floor. I ordered the butter chicken and it was good, not spicy enough tough, but I would have regret having to eat it if it was spicy since it was blazing hot out side of the mall. It cost me about $13 for a drink, a piece bread and my plate...not worth it in my opinion."], ["Margaret W.", "Fabulous!  I always get whatever is vegan that day. My favorite is the chickpeas or the okra dish. I have never craved chickpeas before I tasted them from here. So hearty and wonderfully spiced. The mini with salad and rice is a good deal and very filling."], ["david j.", "The best curry ever!!  I eat a lot of local style curry, but nothing compared to the authentic style.  If you want curry this is the place.  Great price and great food."]], "India Bazaar Madras Curry": [["Kimo K.", "$8 Curry plate 4 items is a deal no MSG and no meat-no need spicy healthy and enough for two.... Many years this place the son now the chef.  Not much Indian food to go in town find while waiting at Sweet Home Cafe."], ["Doris D.", "Great spot for simple and inexpensive Indian food.  We went for lunch and it did the trick.  I got a mini plate with yellow rice, chickpea curry, and coconut curry with vegies all for about $6.50.  Although one curry was noted to be mild spice and the other curry was noted to be medium spicy, neither of them were spicy at all.  But definitely not a bad deal compared to the other Indian joints in town."], ["Amara E.", "Stopped in here for a quick bite at lunch. Unlike your usual sit down restaurant, you have to order food at the counter.I ordered the chicken plate, which comes with rice, chicken and two choices of additional vegetable sides. I also ordered the coconut curry and vegetable curry. The most surprising thing about this place is how muted their flavors are. I'm used to \"spicy\" Indian dishes hitting you in the face, but with this one, their spicy vegetable just, IMO, had a slightly spicy flavor. I would go so far as to call it mild. However, apart from that, their coconut curry was creamy and delicious! Loved the flavor and the fact that the coconut was very subtle, not overpowering at all! It's a nice place to stop by for a quick bite to eat, but if you're looking for really flavorful Indian dishes, I would recommend going elsewhere."], ["Masato I.", "Ready to serve Indian curries.  My dilemma with Indian food is that curries are better the longer they stew, but the buffet and plate lunch style Indian food, never has enough kick for my spicy-minded palate.The dishes appear to be South Indian vegan dishes, with a chicken option for the carnivore.  The prices are extremely fair and the flavors are every bit as good as the other Indian spots in Honolulu.If you like your curries with a kick, they have a few for you and you can top off with some siracha or ask for some indian pickles.  Recommend adding the roti bread, if you like naan with your curries, like I do.They take Square Wallet, located in Old Stadium Mall (by Sweet Home Cafe and Pizza Hut).Nothing fancy on the inside, but service is friendly and fast, 5 stars for the quality at such a low price!!"], ["Heather M.", "If you want something fast. This place is it. The food is already cooked and have in the front. The food was ok if i wanted a quick fix of Indian food. The sitting area is small and they have shelves of interesting books that you can go through while waiting or while eating. Not bad."], ["Little D.", "Their phone has been disconnected for years but the restaurant is still standing!Tiny Indian restaurant for lunch plate setting, easy take out.  A few little tables to dine in.Mostly vegetarian, only one meat choice \"chicken\".  I liked their taste a lot, but still Maharani is the best for my taste.  Less than $10.00, without waiting for food to be ready, no complaint.Parking area is always congested when I go.Warning1: if you want a super spicy food, you will be disappointed.Warning2: if you like meat, you would not be satisfied here."], ["Michael M.", "Quick! Where can you find a healthy vegetarian meal for under $10 that you can get in less than an hour even if you work downtown?India Bazaar is a good answer.This place has been open for years. It is a subtle Indian restaurant in Old Stadium Square near Kozo Sushi.When I was in graduate school, I used to eat here almost daily. That's because it was healthy and inexpensive. I was happy to see that the prices for a plate lunch of 3 vegetable choices and curry rice has remained relatively unchanged in the last 10 years--about 8 bucks. The recipes come from the family that owns the restaurant. The owner who is a very nice Indian lady now runs another restaurant downtown, and her son manages this location.I have never been to India, but I imagine that this would be like a restaurant there. Sparse, simple, peaceful. There is a very mellow vibe that permeates this location. The food is excellent. A fan favorite is the Coconut Cauliflower Korma. I like the Tofu and Peas Curry and the Tomato Dahl. They even have chicken if you don't want to go all veggie. It sells out fast, but India Bazaar has homemade Paratha bread which is the best in the islands. Since the dishes are served cafeteria style, there is very quick service.Heads up that this is a cash only place. Namaste"], ["Charlie G.", "Not a bad place pretty decent food at a good price. It was however a little bland and surprisingly not spicy at all even the \"spicy\" dishes were not at the level most would consider medium. The lady behind the counter was really nice though. If you're in the mood for some super quick Indian food this might be your place."], ["Barry L.", "We've been coming here for over 20 years and the food is fantastic.  Never been disappointed.  The value for the dollar is very good.  Yes, it's a whole in the wall, but that's why they can charge as little as they do.  You won't be disappointed."], ["Ione F.", "This 'hole in the wall' might be the best Indian Food in Honolulu.  It certainly is the best bargain.  Not much to look at ambience-wise but the food is out of this world.  Limited selections but they have both meat and vegetarian fare.  Most is vegan and gluten free. They also have mild, medium and hot so something for everyone. Great place to stop by for take out or bring your own bottle for a nice low key dinner."], ["Tiffany L.", "Great food, but the portions on the chicken just get smaller and smaller. They need to give larger portions of meat, less of the sides or raise their price. The ratio is about 2 scoops and side veggie to less than a chicken breast."], ["Romano G.", "Love the food from this family chain. There is one at Topa and another near Remington in downtown. I just wish they also served lamb but chicken will do because of the good sauces.  All 3 locations are closed until the 25th of June, apparently the family went on vacation.  I can't wait to get my quick indian food fix."], ["Caroline P.", "My boyfriend and I came in to eat for lunch today. We both ordered vegetarian meals we got three sides with saffron yellow rice. We both enjoyed it  The decor inside is a bit hodge podge with Indian posters and books and mismatched tables.  Also they have rice bags for sale. But the food was awesome and good price. We will definitely go back there again."], ["Marc T.", "My first time here & I have mixed feelings. Good setup and there are many vegetarian side dishes but only 1 protein-chicken. It was good but I wish there was lamb, beef or some other kind of meat choice. I will go back but now I know not to expect."], ["Anisha D.", "Went to this place to get my Indian food fix. It was okay. I give it four starts because the customer service wasn't so great. First I asked for brown rice and he said not today. So then what days? And I asked for yogurt and they were out of that as well. Tried to sub the rice for something and would not do it. Oh well. I wasn't too upset because the food was delicious! I got spinach lentils and cauliflowers. Awesome! Wish I could try some other dishes!"], ["Greg P.", "Our go to for Indian food. Not the most for atmosphere, but the food is great! Colorful and flavorful!This is also great for a vegan diet as there is only one non-vegan dish."], ["Randi R.", "Need a fast, affordable and delicious curry fix? This is the place! Very vegan friendly!"], ["Mikala L.", "Prices went up to almost $10 & they serve LESS food now, esp if young man with zero personality serves u.  Also when asked if this was his normal portion/serving size, he said \"Yeah, always.\"  Fortunately his coworker eventually gave a lil extra chicken bc said they didn't want any unhappy customers.  Yet owners son is very stingy so prepare to wanna order paratha which u can buy in the frozen section of the Indian Market 2 blocks away for 50cents/each.  The only good thing:  it's faster than fast food.....now, 2 years later....the portions are larger to match the increase in price BUT the taste has been modified in the yellow rice, chicken masala and potato.salad.  New cook?"], ["Janet K.", "Don't come here thinking it's going to be like Himalayan Kitchen or Cafe Maharani.  That's like comparing Yummy's BBQ to Millions or Kozo Sushi to Sushi Sasabune.  This is \"take-out\" Indian food. For $8-$8.50, you get a three choice meal that comes with yellow rice.  It's not the BEST tasting, but hey, it aint that bad for the price.  I've tried all their dishes and they're all pretty good so don't be scared and just go for it.  I ordered one of those sauce thingy that's on the side for $1 because I was curious and I didn't care for it too much.  It had a weird flavor and I wasn't sure what I was supposed to eat that with.  Oh well, live and learn.It's located in the same complex as Sweet Home Cafe so be prepared to drive in circles looking for parking.  Oh, and bring cash."], ["LeaDan Y.", "Cheap eats, tasty, and healthy.  Great parking.  I dont feel I need to say much more."], ["Sayaka T.", "My mom and I came here hoping to eat some quality Indian food. Since I was visiting from the bay area I guess I had high hopes since there are some great Indian restaurants in the bay we regularly go to. I hate to give the place one star, but I have to. It was horrible. I couldn't even finish my plate it was so bad. The food was pretty flavorless and their selection was very limited. The bread they had was a sad excuse for naan. It was small, flat, tough, rubbery and greasy. I have no idea how anyone could rate this place 5 stars. I felt sick after..."], ["Carika S.", "I love this food.  Totally authentic.  I know the real stuff.  The meat quantity is too small though.  I put up with it bc the food is fresh and homemade.  Just like mom would serve."], ["Sree K.", "Was not a very good experience eating here. chapathis were just frozen ones taken out and heated. rice was bad."], ["Jennifer L.", "Good taste dishes hidden in a shopping center across from home sweet cafe! Located on King street across from old stadium.  I used to come here often during college years since its a 5 minutes drive from the University of Hawaii at Manoa area.  Its a small whole in the wall not too many tables, you walk up to the counter and order.  There are a handful and a half vegetarian dishes, i believe one chicken and a few variations of rice.  Last time I came here, I ordered the yellow rice with two vegetables and finished my food in 8 minutes and 1 breath!"], ["Lori I.", "The \"Panda Express\" of Indian Food.  Good, fast, relatively cheap Indian spiced food to go. You choose 2 veggie curries/sides and chicken curry (so basically 3 choices) on top of rice. $8.50 + tax.  I got there at 10:55am, the guy said \"we aren't open  yet, but you can come in\". (+1 star...Panda Express would have made me wait until 11!) So I went in and I was out of there before they officially opened at 11am with two meals under $18.I am not a vegetarian and there are no other meat choices besides the chicken curry, so there is no reason for me to go back to try more things for a while. However if you just need a quick meal, this is a good change up from the greasy Chinese take out."], ["Julie M.", "The food didn't taste the best, but the lady who served me was nice."], ["Lisa K.", "With the ancient cinder block walls, no-frills handwritten signage, and strip mall location, you don't go for the ambiance; you go for the value and love of all foods Indian.  We stumbled upon this little joint while searching for somewhere new to try and were surprised to learn they've been around for almost as long as I've been alive. The reason? They've mastered a formula that works. You choose 3 dishes + rice from the vast menu selection and they load up a plate for $8. We ordered 2 plates with different entrees to divide and conquer, and were pleasantly surprised by most. Overall 3.5 star average for taste and quality. The chicken and spinach lentils were exceptional, the coconut curry, unfortunately, wasn't worth eating.They really shine for customer service. Unaware they only take cash, we were short a couple bucks after we already ordered. It was late, they were about to close, and rather than make us haul it to an ATM and back, he said to pay them the difference next time. Good thing, 'cause now we have another reason to go back. Check 'em out, especially if you're either vegetarian or love spicy food. They have a great selection of both."], ["Linzy L.", "Food was delicious!! Price was perfect!"], ["Ryan T.", "This is a great place for anyone with a hankering for Indian food who does not want to spend a whole lot of money at a sit down restaurant.  All the veggie selections that I ate were just delicious.  When I went there, I had the veggie masala, potato stir fry, and the spinach lentil.  What I also liked about this place was that the food was not that spicy. My only wish would be if they offered some drinks like mango lassis.The only other place that I have had better Indian food was in London where all the dishes were a lot spicier."], ["Tammy T.", "Thanks to Aaron and Brooke as soon as I read they were open I drag my friend with me to eat there.Located in that small mini cluster store area across from Stadium Park. Near Kozo Sushi.-Cash or Check accepted. Yes Check. I know. Unusual.-Parking can be difficult if you go during peak eating times.-Quick, fast, and under 10 bucks for a plate. 8.00: 3 veggie and rice. 8.50: 2 veggie, chicken (it's sort of shredded looking) and rice.-Simple seating inside. -Baby cups for water can be found at the \"very slow giving\" water cooler. If you have been there you know you gotta stand there and push the button for days.-I recommend getting it in a take out container just in case you can't finish it there.-All choices are labeled and rated (mild to spicy) so you don't have to ask. -I always have their veggie potato anything, I tend to stay away from too much soupy stuff. Makes my rice all mushy. 2 drys and a wet make a nice mixing with rice consistency. Sorry just not a fan of lentil.Really, it's as good as is gets for quick, good, easy to order food."], ["Varun A.", "I absolutely loved the food they have. They have a decent menu and the food is one of the best food I have eaten. I came from CA and I must admit that the food I have eaten is even better then some of the best restaurants back in CA. I visited with my family and they loved the food.Now question is why 4 stars only??? The only problem is with the amount of vegetables they give the portion of rice is too less to eat. We had to order roti/parathan with the sabji. I would request them to increase the portion of rice. If I visit Hawaii I will definitely visit them again and would recommend them to all my friends visiting Hawaii too."], ["Cin A.", "This is a pathetic excuse for Indian food. Raised on Indian food I definitely know that this is utterly bland half-assed schlock suited for bland American taste buds frightened of unusual seasonings and spices. Or perhaps it's just a mixture of not actually caring about quality dishes, unable to be creative and using the lowest quality ingredients while over charging. The last time I had the chutney I was convinced it was marmalade since it was so awful. Even if I'm desperately craving Indian food I wouldn't waste my money on this garbage.I'm only giving it two stars since they are one of the only Indian restaurants in town to include side dishes with entrees which is the common practice in India. That's the only thing they have that is worthwhile."], ["Traci H.", "Think of the place as more of a takeout joint than a restaurant.  The menu is whatever you see in front of you in the warmers, so don't expect fresh food. It looked kind of nasty since it was just sitting all there but it wasn't bad.  I'd compare this to a Komala curry type of place; but better.For $8.50 (plus tax was $8.90) I got a plate mounded with the yellow rice, chicken curry, lentil/eggplant--spicy, and a spicy potato dish (1 chix, 2 veggie + rice).  So a good amount of food and it wasn't bad.The flavors don't remind me of the Indian food I fell in love with but they're not bad; the rice was probably the best flavored thing on the plate.  The chicken curry wasn't much of a curry but a lot of chicken thigh meat with a little bit of sauce (some people would LOVE that, but I wanted curry!). The veggie dishes were ok though.It's a no frills place--walk in, random tables and chairs, you walk up to the counter and order from behind the glass and then pay cash at the cash register.  Down home, relaxed, casual. don't expect waiter service and fresh food though.  Not a bad indian takeout option for the value.  Parking is free at the stadium park lot thing, but at peak dinner times man, that place is crowded because of all the other restaurants but a spot finally opened up for me.  I was wondering because this place was empty but apparently people were buzzing around the other restaurants and filling up the parking lot!"], ["Grace N.", "I used to frequent this place a lot. However when I went to pick up lunch recently the food tasted really bland and watered down. They had re-decorated the inside which was nice, but I was really disappointed with the food. So averaging out my previous experiences being 4-5 stars with a lunch that ended with losing my appetite, I rate it 3 stars. Hopefully I can bump it up again soon."], ["Gspot H.", "Amazing. Easy Parking. Quiet Place. and great for take out"], ["Brad N.", "India Bazaar Madras Curry is probably my second-favorite Indian restaurant in Hawaii, second only to Cafe Maharani. It's much better than India Cafe or Himalayan Kitchen, and at half the price. I love to hit up this place when I feel like spending $6 to $9 on Indian food instead of $15 to $20.The vegetable plate is $8 for 3 vegetarian sides and rice. The chicken plate is $8.50 for 2 vegetarian sides, rice, and chicken curry. You can also get a plate with only chicken curry and rice for $5.50. My biggest gripe is that their closed on Sundays. They have plenty of vegetarian options and I have never tasted any MSG here."], ["Aaron L.", "India Bazaar was the first Indian food I've ever eaten and I judge all other Indian food based on the Bazaar taste. If it doesn't taste similar or better than Bazaar then it's not Indian food to me. I've eaten at several Indian restaurants and there are some really bad ones out there, but you'll never go wrong with the Bazaar.I love the coconut cauliflower curry, spicy tofu curry, and the spinach lentil. You can't go wrong with this selection. They are generally open during lunch and early dinner. Be sure to call and see what their hours of operation are so you don't make a trip there just to find out their closed."], ["Noa H.", "Well I finally got to try India Bazaar today for lunch. I found this placed based on previous yelp reviews and I love Indian food and am always willing to try a new place. Kiss a lot of toads kinda thing. So went there today with my girl friend because the impression I got was that this is great Indian food for very cheap price. Unfortunately this is not true, hence the three stars.I submitted photos of the counter which has six or seven vegetarian dishes to choose from, in addition to a pretty good chicken curry. We ordered the plate with chicken curry, two veggie choices and each had a Paratha. $22, w/ no drinks... It was good but for the $8 more we eat at Himalayan Kitchen and get nice ambiance, variety in the menu, a smile, and sorry to say better food...I hate to write negative reviews but I was disappointed and put of by the lack of friendliness and feel $22 bucks for lunch I should at least get either ambiance, good service, or great food. TIPS: Bring your own knife(they only have plastic forks), bring your own drinks, cash only"], ["Shelley K.", "I've been here once before when I was little, but at that time I was a picky eater and didn't like anything ethnic besides my own ethnic food. However, I was just there the other night and I was pleasantly surprised. First off, I LOVE Indian food, but it gets hard on the budget to eat at Cafe Maharani and other places. But this place is great! Its affordable!For $9, you get a choice of going with 3 veggie choices with rice or chicken, rice and 2 veggie choices. I had the chicken and rice with the potato-mushroom curry and the veggie masal. Delicious! I also like the lentil masal from my bf's plate. Definitely going back here again for Indian food when I'm on a budget!"], ["Brooke M.", "Update 1/8/10:Alright, I don't know who the dummy is that reported this place as closed, but they are most certainly NOT CLOSED!  I just went there today to see what was going on and I talked to the owner.  She said they haven't had a phone in many years.  I told her I was so happy they're still there!NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!!!!!!  I just called and I reached a number that has been changed or is no longer in service! WTF!!!!!"], ["Gizelle M.", "The first time I've been to this place was 10 years ago and it still looks like a cheap hole in a wall place. The place definitely needs some cheering up and need some improvements on the place alone. However, the food was good but not for the price."], ["Lndn O.", "My cuddy spot to get my grub on some good ol' curry. In other words, this is my favorite indian food joint on Oahu."], ["Matthew P.", "Man, I miss this place.  My favorite Indian food by far when I lived in Honolulu.  Don't sleep.  Also, don't forget to get the paratha, the mango chutney, and especially the pickle*."], ["Jennifer L.", "The curry was yummy, though I wish they had a couple more options too.  I also wish they have more mild options, as I'm still working my way up to spicy level.  I did try the paratha, which was all right...it was yummy with curry but I feel it's a little too greasy for my personal taste.  (Not greasy enough for me to complain about it, but just saying.)  The parking sucks.  When I walked in (my first time), I bee-lined to the curry, of course.  I was standing for a bit and the guy behind the counter seemed to just stand there waiting expectantly so I asked him how they sold this stuff.  Instead of any verbal response, he simply pointed to my right, which had 2 signs (poorly displayed signs) of their prices and how they plated.  That's fine, since it answered my question, but I find this common habit of lots of hole-in-the-wall customer service to be quite off-putting.  I'm not offended, but it's just kind of like, \"Really?  I clearly didn't see the tiny signs, especially since they were facing UPwards toward the ceiling and not front-wards towards the customer...would it be that much more difficult to just answer my question?\"  I think the entire transaction went without him saying a single word.  He might've grunted assent at some point but whatever.  I'm not taking this personally since he treated the next customer the same, but I'm just wondering what's up with people's customer interaction abilities these days.The curry was good, though, so I'd come back - if I was feeling for Indian curry."], ["Shane T.", "It's not Maharani, and it doesn't pretend to be. The food is good and the price is reasonable."], ["Eileen V.", "Cheap, delicious, and excellent customer service... Everything you want in a \"take out\" restaurant. Although I don't consider myself an expert on Indian or Middle Eastern food; I do enjoy this type of food and know that India Bazaar always satisfies my appetite. Of course it's not as fancy as some of the other Indian or Himilayan places around town, but hey; it's not as pricey or hectic to get in either! This place is definitely my \"go to\" place for quick, easy filling vegetarian food. The great smiles and friendly staff are always an added bonus! Great job Shaun and Harmony!"], ["Kellie V.", "If you love indian food as much as me but hate the HUGE price tag you will love Madras curry!!!!  Don't expect flavors like maharani or taj mahal, but for the price it is awesome. For under nine bucks you get a big plate full of food. The chicken is fantastic and I loved the coconut veggies. The spinach dal was a little bland...but tasted great when I mixed it with the spices of the the chicken. Definitely recommend coming here. The staff is uber friendly. We went right when they were closing and they were still happy to serve us. Cant wait to go back and try their samosas!"], ["Ang R.", "SO glad I finally tried this place. I wasn't even that hungry but I finished the whole (generous) plate with room for more! Great value and super delicious, will be back once a week for the rest of my life!"], ["Tessa t.", "went here on friday....yay!!!so happy that i did...you can get your indian food fix for waaayyy cheaper!$8 for rice and 3 veggie dishes$8.50 for rice, chicken, and 2 veggie dishesi got the chicken, potato stir fry, and another spicy potato curry-ish dish...yum. yum. yum.nom. nom. nom.they have this bread as well...its not the usual naan bread...i can't remember what it was called but it is oober good....it's really buttery though so i can't eat the whole thing without feeling like i have to run 10 miles at the gym :/so...if i can't make it to cafe maharani cuz i'm low on cash...this is where i will be :)"], ["Vishal H.", "So so.. not bad at all."], ["Jefferson W.", "I love this place.  I live on Maui and go to Oahu for business about four times a year.  I stop there every time for lunch.  I won't re-write what all the other have about price and quality, just know it's all true.  Find it, eat there, you'll be happy."], ["Frequent D.", "Tasty dishes. Lots of spice and flavor. The portion sizes are a little bit too small for the price you pay."], ["Andy D.", "After coming here for lunch on a few occasion, I gotta say this is my favorite place for Indian food.  They have a good variety of options and all the items they serve are delicious.  The veggie masal is still delicious. The lentil tomato curry is also really good.  All the food here is vegetarian with the exception of the chicken that comes with the chicken plate."], ["D L.", "Honest delicious healthy food at fair prices."], ["Mrs. B.", "It was a good value, but the food wasn't anything special."], ["Pars L.", "If you are a student or a person with a mission and you want some ono Indian food that you don't have to wait for, then India Bazaar is the place to be. Vegetarian options... yay! I get the spinach lentil, coconut curry, potato stir fry and the veggie masala with cumin seed papadum or paratha- oh, and chutney of the day. Great Vietnamese smoothie and bubble drink spot next door is great so hit that up too. Family owned and they have been there for many years. Delish. Friendly vibes. :)"], ["Scott R. D.", "Tasty enough for a steam table place. Not a lot of selection. Mostly vegetarian, one chicken dish.Updating this review: I've been back twice more and the food is bland and boring."], ["John O.", "This is the best and most authentic Indian Restaurant you will find on the island.The place is very small.  There are only maybe six tables with plastic chairs.  No atmosphere what so ever.  They have a couple of pictures on the wall but that is it.  This place is not for gourmet dining. You pick and choose what you want from a line of steamed trays.  It is a family run business.  The people that work there are very nice.  I am already looking forward to my next meal there.The only bad thing is that they are only open until 3pm."], ["Sita L.", "I have been going to India Bazaar for over 20 some years. I love the owners and I love the food. Nothing pretentious, simple tasty curries. Yes, its simple, yes it's not adventurous, but does it need to be? There have to be places, like Zippys or the little corner Mom and Pop shop that just serves good and consistent food. This is one of them. You want a good curry, here is where you go."], ["s o.", "Great Indian food, great prices, selection, nice owners.Get the samosas and paratha and the yogurt sauce.  I don't like rice very much but the rice they serve is delicious."]], "Ruchi Indian Food": []}