{"Chiba-Ken Restaurant": [], "Yanagi Sushi": [], "Sushi Sasabune": [["Cat N.", "A coworker of mine recommended Sushi Sasabune as a place to try in Oahu. I love sushi and this place definitely DID NOT disappoint. It's an intimate, somewhat romantic, sushi bar/restaurant that specializes only in omakase. This means, you must trust the chef to serve you what is freshest and best for you. Oh, and dress up when you dine here. We didn't. We unexpectedly stopped by in beach attire with sand all over our feet -_- However, staff were very nice, accommodating, and welcoming and served us unbiasedly.Thirteen courses. Man, we were totally stuffed, but it wouldn't have made sense to stop the omakase at the 10th course because EVERY course was so amazing we didn't want to miss out on the next and I know there's no way to get something this awesome in L.A. without paying an arm and a leg.Amazing. Amazing. Amazing!"], ["Clay O.", "First time visit here so the recommend the omakase. I am not a huge fan of omakase, since I like to choose what I am in the mood. However, I still must give 5 stars. Everything is very fresh and well prepared. Service is outstanding. Try this place, but do expect omakase and expect to drop $250-300 for 2. Love the tastes experienced here.Dress states business casual, but dress is all over the place. They control the flow of seating, so even with reservations you might wait. If they seat of group before you.. they will have you wait. Parking is out back for $1 per hour prepaid and there is security. That generally gives you an idea of the area."], ["Linh V.", "We came here on our first night in Hawaii.  Despite being told that parking was free behind the restaurant, we were charged by the new parking company that had just coincidentally taken over the night before.We arrived 10 minutes early but could not be seated right away despite the restaurant being half empty.  When they finally seated us, I asked if we could go omakase but unfortunately, all the bar seatings were already reserved.  But then the only other option was Chef's Special anyways, so it didn't really matter.Once we were seated, we were asked what our food allergies were and what we did not want in our food.  My friend and I both said wasabi and her, sesame seeds.  Then the food started coming.The first dish was amazing - albacore in ponzu sauce.  It was so fresh and light!  I could've eaten that forever!  And then squid stuffed with blue crab.  Though the squid was perfectly done, the sauce overwhelmed the dish (I think it was eel sauce).  Then two pieces of toro - whaat?!!  Best toro I've ever had!  Now, comes my warning.  I am a sushi eating novice - I spend more of my money on nice cuts of meat rather than fish.  I wanted to savor my sushi by eating it in multiple bites but was quickly scolded by staff that the chefs were \"requesting\" me to eat it in one bite.  I realized later that these are instructions they normally tell their patrons at the beginning of their meals but for some reason, were not conveyed to us at the start of our dinner.  I glanced over to the chefs and one of them was giving me the stink eye!  Perhaps that's the way he always looks?!So I brushed it aside and continued eating.  But then our next dish, halibut and snapper, contained wasabi.  My portion contained large amounts of wasabi, so much so that it made my eyes water.  My friend joked that perhaps the chefs were mad at me.  But I think they were!  And I had to eat this all in one bite!  Wtf!  But I continued eating because it was an expensive meal and I was not going to let pettiness (if that was indeed the case) ruin my trip!Our next 9 dishes consisted of:  hamachi/salmon; scallop; 3 oysters (mine came with a live fly in the middle of my plate); sweet shrimp; spanish mackerel/albacore belly; snow crab; negitoro; lobster tail; and eel and tamago.The reasons for the four stars despite my negative experience were because (1) the seafood was the freshest I've ever had and (2) the servers were attentive, nice and tried to get to know us.I plan to go to the original location in L.A. with the fiance so hopefully my experience will be much better, especially now that I know the \"unspoken\" rule."], ["Jackie M.", "The quality of fish is certainly good. I dont however like that they force omakase. I like to spend lots of money on the fishes I like. Eating here, I was forced to eat a bunch of fishes that I didnt care for. This place is very similar to Sugar Fish By Norizawa, which is a small restaurant chain. They serve fish on warm rice. I like this place, but I really have to come here hungry with no preference of what I want to eat. If im feeling picky that day, I cant come here. WADA is still my #1 in Hawaii"], ["Derek W.", "3.5 star reviewI remember when I first dined at Sasabune when it was still operating out of the little house on Sawtelle.  I went there with a friend and was reminded why I haven't been back though they've expanded to a huge location on Wilshire and I guess out to Oahu.Was really hoping that the dining experience here would've been better but I was disappointed.  The dishes came out quickly and often times the waiter brought out the next course when we weren't even done with the previous one.  A big no no in my opinion.  On to the food...Albacore w/ ponzu sauce yelp.com/biz_photos/sush….  Though the albacore was fresh and sweet, I found this dish to be disappointing as it was swimming in ponzu sauce.  Would recommend skipping but they have a set menu so maybe ask for the ponzu on the side?Baby squid stuffed with crab yelp.com/biz_photos/sush….  This was actually a good dish but I'm not a huge fan of eel sauce as I find it too sweet for my liking.  The squid and crab combo was good but the sauce killed it for me.Two variations of toro yelp.com/biz_photos/sush….  One toro was drizzled with a fish stock soy sauce which I found to be really fishy thus taking away from the true flavor of the toro.  The other one was a condensed soy sauce which didn't taste any different than the soy sauce on the table.  The fishiness of the fish broth lingered which I had to cleanse by eating the ginger.Tai and hirame sushi yelp.com/biz_photos/sush….  Both good but once again nothing that blew my mind.This was the first dish that came out while we were still eating the hirame and tai and therefore missed what kind of fish they were yelp.com/biz_photos/sush….  Again decent but nothing specatacular.Steelhead salmon and some sort of scallop yelp.com/biz_photos/sush….  The salmon had some sort of think kelp which I thought was fishy but the scallop was sweet and tasty.Kushi oysters served 3 ways yelp.com/biz_photos/sush….  Not a fan of oysters but decided to try one and it was fishy.  Passed the other two over to my wife for her to enjoy.  Since I had passed over the oysters to my wife, the waiter brought over the next course which was aji and a new caladonian shrimp yelp.com/biz_photos/sush….  This was the second course which I thought came too quickly as my wife was still eating her oysters.  Yes I was done but one could clearly see she was still eating her previous course.By the end of this dish we were stuffed and had to call it quits before the lobster and the anago tamago dish.  Overall, I think they need to work on the timing of the dishes since they demand such a steep price for their omakase.  The fish served wasn't anything special nor do I think I'll be back or recommend this place to other friends."], ["Joseph B.", "My opinion, the best sushi spot in Oahu. Been to several places and always find myself back at Sasabune. Just like my experience in Japan...consistently meticulous about quality, presentation and delivery. Arigato gozaimasu"], ["Kenneth N.", "A tight 3.75 stars, I'm just being a tad tight, compared to similar omakase sushi bar tasting menu.First off, the food quality is definitely there, service and knowledge of the different servers dropping off 13 plates is impeccable, though a bit more interaction would've been nice compared to what we experienced at the bar.  It was full there so knew that over the phone, sat a table a few feet away.For the price, Vancouver has the Iron Chef, Tojo's, which offers better option in terms of setting your own budget, starting at $100 pp...but here, they were quite vague, 'all up to the chef'...while the bill came to close $300 which I had no issue, the experience was there: I'm just too spoiled lol.I fought valiantly not to post so many pics again (overkill) but needed to keep track.  Best highlights: red snapper, scallop, squid/crab, unagi/tamago and seaweed wrapped sweet onion albacore..."], ["J W.", "Red flag immediately went up with the first dish of the omakase, tuna completely drowned in ponzu and unfortunately things didn't get too much better throughout the meal.  Disappointment culminated with the tiny dried lobster tail at 18 dollars a piece which tasted like rubber.  The negiri was decent although vastly over piced. There is nothing magical about the about the omakase here, basically you are just letting the sushi chef pick dishes off the a la carte menu for you without any clue as to what you prefer(he never asked at any point during our meal). At the prices they charge, might be a better idea to just ask him what's fresh and order off the a la carte menu yourself.   Another disappointing 4 1/2 star yelp black pearl in Hawaii, which happens way more often than it should. Over 300 bucks for 2 person lunch and very minimal alcohol.  Definitely does not live up to the hype. Try Gaku or Torae Torae for a similar meal at probably 1/2 the price."], ["June W.", "This is the PLACE for the true sushi lovers!!Defiantly a very special treat, must try and must trust!!The chef takes his career very seriously, it can only be the best when there is pride with the job!It is the BEST SUSHI ever, and I'm in LOVE with SASABUNE!Special Thanks to Sadabune family for being and serving in Honolulu!"], ["Chantee F.", "This is a late review as I went here a while ago but they are worth the wait. I had the omakase and it was a culinary adventure. If you are open to all types of sushi and the best in quality then check out this place. You will not be disappointed. Simplicity and excellence its best."], ["Debbie L.", "I've heard so many stories about this place. I love sushi, but I wasn't sure about not being able to pick my own food, especially if it included food that I didn't like. My fiance took me here for a late Valentine's Day dinner for their omakase.As we walked in, the host greeted us and took us to our reserved seats at the sushi bar. In fact, with everything I had heard, I was really nervous, not sure what to expect. Thankfully, we had a choice between the western style or the eastern style sushi. I opted for the western style which consisted mostly of tunas. I wasn't ready to try exotic foods just yet.The sushi was amazingly delicious! I have never tasted sushi like that in my life. The fish was a perfect cool temperature, while the rice was nice and warm. It instantly melts in your mouth. This was the first time I have eaten eel.. and it was delicious! In fact, every single one of the 13 dishes were amazing! If I had the chance, I would definitely return. However, I was unaware that we didn't have to do all 13 courses... so when we left, I was uncomfortably full. Next time, I'll know. :)The BEST sushi I've ever eaten! Sitting at the sushi bar definitely makes the experience worth it."], ["Alyssa R.", "Just delicious! We visited Oahu (we are from Los Angeles, CA) and wanted to find the best sushi on the island. Guided by the yelp reviews we chose Sushi Sasabune. We ordered Omakase, and were so happy with what we were served. The sushi was melt-in-your-mouth delicious! Presentation was beautiful, waiters were attentive. We were served 13 plates and were full by 11. Mind you, we eat a LOT of sushi when we have it, and so it was surprising we even got full, but if you can, make it through all 13 plates!! They are each unique.My only regret was that we weren't dressed up a little nicer to show our respect to an amazing restaurant and delicious meal (we were just coming from snorkeling that day!), but know that we were impressed and would love to recommend this place to others who will visit the island. Thank you!"], ["Lonny K.", "The best sushi I have ever had in my life is a place called Sushi Yasuda in midtown Manhattan near Grand Central. The second best is... Sasabune! (It is a distant second... but there's even more space between Sasabune and whoever is third... so that should tell you something about the Yasuda joint!)Interestingly, they're quite similar in concept. My first time at Sasabune, I found it a little off-putting; but over time, I think that's actually part of the allure. Of course, what I'm referring to is the meal-accompaniment affectionately referred to as the  \"sushi nazi.\" And if you don't know what I'm referencing with that comment, then just read a handful of the other reviews here, and you'll get the jist of it. Yasuda has their own; as does Sasabune. But I get it now... I really do! To these master sushi chefs, their dishes are not mere dishes... they are works of art; they are masterpieces... each and every one of them are unique (Yasuda more so, because they customize EVERY SINGLE CUSTOMER'S omakase, if you can imagine that!). That said, if you're an artist, and someone buys your painting... how would you feel if they immediately painted over some piece of it because they didn't like the tone or the hue of something. It might be offensive. That's how these chefs feel when you plop down their masterpiece into a brownish-green blob of shoyu and wasabi. In their eyes, you just ruined the work of art.  So that little rant aside - if this will be your first time at Sasabune, and you opt for the omakase \"chef's special,\" then expect that you may be told how to lift the sushi with the chopsticks so it sets delicately atop the sticks without the rice crumbling out, how to devour it in one bite (as opposed to biting it in half), and yes - even which sauces to enjoy it with. But...... if that sounds a bit off-putting, then think of this: there is no way any food establishment could get away with that and continue to be busy night after night UNLESS THE FOOD IS EFFING AMAZING! And it is! If your best sushi-dining experience is Genki, or Kuru Kuru, or for the high-rollers, perhaps something of the Doraku or Shokudo variety... then expect to get your mind blown by the simplicity and purity and depth of flavor of a place like Sasabune. Now of course, as other reviewers have stated... this place is not for everyone. If your idea of great sushi means add sriracha and chili-mayo and unagi sauce and dynamite sauce on EVERYTHING... then this won't be your cup of tea. You're better off sticking to Ninja Sushi by the airport (which isn't bad at all when that's what you're craving). This place is NOT that! It is soooooooo much better. Final note - if you bring a date with you, then plan to feel like a baller (even if you don't want to)... because you're about to spend like one. Two omakase's and a couple wines will easily take you over $300. Again - this is not the case UNLESS THE FOOD IS EFFING AMAZING! And it is!"], ["Anthony P.", "I'm a big fan of the omakase at Sushi Sam's in San Mateo, CA. This means that I am constantly looking to find a place that can do better. Sushi Sasabune was recommended when a good friend and I were visiting Oahu, and I've gotta say that this place is worth checking out if you are hungry and don't mind dropping ~$150 person as the omakase is mandatory. I'll just go into the highlights since the reviews I've seen on here seem to say a lot of similar things.Prepare yourself and come hungry!- I can't stress this one enough. I thought I was hungry and was feeling full around course #7. My friend was full around #5. I also fell into the trap of helping her with some of her food because she wasn't a fan of some of it. The couple next to us started 15 minutes after us and they were struggling too. I gave the guy advice not to eat his date's food so he would have room to try the rest. The wait staff will advise you on how to eat certain dishes.- We were told not to use soy sauce for some of the sushi. Not uncommon for omakase style meals since they preseason everything for you. - This one is kinda funny, but the waiter told my friend to eat certain pieces in one bite so that you could get all of the intended flavors.Did I mention to be hungry when you go here?- I was ready to tap out around #10. My friend had given up and was just taking one bite out of everything. I saw some reviews later on that mentioned you could ask to not have every course, but I can't confirm if that's true or not and how that would affect pricing. Would I go back? Yes! Food was high quality, the staff was attentive, and there's a certain Wow! factor to this place. Good for special occasions or a very nice date."], ["Jeff L.", "This place was a breath of fresh air compared to 4 star yelp rated sushi places on this island, but that's expected when it is a bit more expensive. But even accounting for its price point and for the name's reputation it did well. And the service was very attentive.Sitting at the bar, we were offered a choice between \"Eastern\" and \"Western\" omakase. The more adventurous (ie do you like uni and ikura?) are encouraged to pick the eastern omakase.  There were 5 of us and three who like uni, but only two eastern courses available. My little brother got the short end of that stick.The people eating the western courses had a good time - they were more straightforward fish and oyster dishes and many of the 13 eastern and 13 western dishes were actually the same.The red snapper nigiri garnished with fermented fish intestines was really good.  Score another one for Tyler Cowen's point about how if something sounds disgusting but is still served in the restaurant it must taste really good to make up for grossing out a certain percentage of guests who never try it. There was no food menu at the bar but if you somehow have room for a la carte orders at the end see this dish is available!This place is relatively strict - no soy sauce was even on the table for a customer to potentially ruin the fish. When one person was getting full and trying to eat just the fish from the rice they were chastised by the chef who told her that the experience was how the fish balanced with the rice - but then he offered to make most of the rest of her courses sashimi when they involved merely fish and rice.Four stars instead of five only because there were a few too many merely good courses and not enough bites like that snapper (the abalone served in the eastern omakase was also great). It's definitely worth the trip here vs going to the slightly more than moderately priced sushi places preying on tourists in Waikiki."], ["Victoria R.", "This is our second time dining at Sushi Sasabune. We made our reservation online but the restaurant prefers an additional confirmation as well. I phoned in our confirmation and requested seats at the bar. If you don't make a specific request, online reservations automatically get table seating. We arrived on time and only had to wait a couple minutes to get seated.Our main sushi guy was Kyle (aka Shinji/Shitake) who was wonderful. He was super fun, knowledgeable, and explained everything. The food was great and since it has been described in depth in so many reviews, I won't repeat all the same info. Suffice it to say, the fish quality was excellent and though sushi on hot rice isn't what we're used to, it really works. Service was attentive and the food came out extremely quickly. Last time we ate here, we ate the full omakase menu. This time, my daughter and I tapped out after 9 courses and my son did 11. Our bill had one error where we were overcharged for something we didn't get but they corrected it when we pointed it out. We only drank water and had no dessert so after a $70 tip, our total bill was around $430 for a party of three.The spoiler for us was near the end of our meal. The host seated a party of four right next to us. I smelled them before I saw them. The overwhelming stench of cheap perfume was like a slap in the face and it actually made me gag. We were at the end of the large empty sushi bar. I do not know why the host seated them RIGHT NEXT TO US. I don't hold the restaurant responsible for the inconsideration of its patrons but the host should not have ruined our evening by placing them adjacent to us instead of in any of the other empty chairs farther away. Instead of having a wonderful, memorable meal, I spent $430 and I'm miserable and upset because I can't get that stench out of my nose (hence four stars instead of five as in my previous review of this restaurant)."], ["w t.", "What happened to my once all-time best sushi place ever?!  Even my friends who have been there recently mentioned that quality has dropped off.  Jamaican lobster was overcooked (where's the South African almost raw lobster?). I know it's omakase but big dropoff in quality. Albacore roll at the end - maybe slightly better than something you get out of canned tuna. There were 3 other dishes which weren't quite up to par.  Yes, I'm being hard - but I'm hoping that our Sushi Nazi will step it up again."], ["Andy M.", "Omgosh, just trust them. They will not steer you wrong! After I came back from being in Japan for a summer (specifically Hokkaido where sushi is beyond amazing), I was told that I was ruined for all sushi in the US. This place has done me in; I will never eat sushi again without dreaming about sushi sasabune.If it melts in your mouth, you know it's legit. At the end of the meal I felt like I could just fall asleep satisfied while sitting upright in my chair. The dessert...oh the dessert. Try the house made green tea flan (pudding). Delicioussss and a perfect item to complete the meal. Omakase all the way. For two people going 8-10 rounds, it only cost us $150 (incl. tip). We thought it would cost wayyyy more. Also, sit at the bar so you can talk to the chefs and watch them work their magic. If going here on a date, be sure (guys) to dress nicer (like long pants, not board shorts like the guy sitting behind me with the girl in a really nice dress). Just a side thought."], ["Alice C.", "Sashimi was my version of baby food as a child, and I've continued indulging in sushi over the years. I can say with confidence that Sushi Sasabune not only has amazing service, the food itself is indescribable. Nigiri sizing, rice to fish ratio, cut of the fish, quality of the ingredients; you can really tell that the chefs are passionate about their work and strive for perfection. I am not a big fan of their more western-inspired sushi dishes, but the staff is very open to your taste preferences --just let them know ahead of time."], ["Shawn J.", "I want to give this restaurant both 5 stars and zero stars for different reasons!  Five stars first:Fabulous food: 4-5 elements on each sushi pieceGreat attention to customers - they ask about allergies, things you don't like etc.A heavenly experienceTips:Make a reservationTraditional style 'chef's choice' - no menu, just the freshest fish and the chef's creationZero star:Sasabune served Blue Fin Tuna - this is shameful and a horrible blight on an otherwise fabulous experience!The UN has been trying to ban the catch of Blue Fin Tuna in resolutions since 2009 because it is between greatly endangered and extinct!!!"], ["Eugene B.", "First make sure you have a reservation. This place was packed. I walked in and luckily there was only one seat available. Thank you to the hostess for allowing me to have that seat. The restaurant sign says \"trust me\" on it, please do so those chefs were outstanding. Highly recommended."], ["Vanessa M.", "So ridiculously happy that I got to eat here and have the amazing sushi. You would never think in a tiny restaurant in a strip mall on King street that you would be transported back to Japan. We took on the 13 course Omakase. I have to say we were told there is not any noodles, no tempura, it is sushi so if you are looking for a variety, go elsewhere. The chef provides what he believes you would like. You don't believe that sushi would fill you to the brim but it is a LOT of food. It felt like going on a tour of the world with all the different fish. The first bite I knew it was going to be amazing because the plate of sashimi just literally melted onto my tongue. The service was really superb, on point but the guys weren't stuffy and would crack a smile every so often. They moved quickly around and took plates, filled glasses and I liked how they took the job serious it made me appreciate it even more. We sat at the bar and I was mesmerized by how deft Chef's hands were at forming the sushi each one right after another. Yes it is going to be on the pricier side of sushi but like the sign said....Trust me. I did...and happier for it. Felt like we floated out the door. I hope Chef enjoyed his beer."], ["MR T.", "Simply amazing. I don't know about all the hype of the chef being a nazi but the food is amazing. Thought San Francisco had good sushi this blows the socks off it all hands down. Cool to see the chef get into his zone rocking back and forth creating his master pieces. Definitely recommend this place and the otoro is wow!"], ["Diane N.", "Go here for dinner.  Recommend getting: omakase and making reservations"], ["Je S.", "We came here to celebrate my boyfriend's birthday and wow...what a fantastic experience. I had never been here before, but always heard wonderful reviews from friends. When I made the reservation over the phone, the worker suggested we sit at the bar to fully experience Sushi Sasabune. He also suggested we order the omakase, \"trust me\". I can say, that both suggestions were spot on and I would also recommend first-timers to do the same. First off, sitting at the bar allows you to watch the chefs as they make the dishes. These same chefs also serve the food to you and explain exactly what you are about to eat and how to eat it; usually in one bite. Secondly, ordering the omakase and not knowing what dishes we were going to be served was very exciting. It was sort of like receiving 13 gifts! That being said, although the sushi was great, I do need to say that some pieces of the sushi were loaded with wasabi and definitely made my eyes water and sinuses clear up! Overall, a great experience at Sushi Sasabune. Service there is outstanding! The staff are so attentive and so polite, 10 stars for them! Lastly as far as cost, we paid about $300 for the both of us, including tip, a little pricey, but it's definitely worth it."], ["Charo S.", "I enjoyed the Chef's Omakase special. Me and my husband ordered the Western version of the Omakase and it was really good. The salmon and scallop sushi stood out as they were so soft and tender. Also, the squid was also really good. The quality of the fish is really soft and just melts in your mouth. There were some that was ok. I think people hyped this place up a little too much and I expected a lot more. It was good overall. I think I may choose to do ala carte next time as I wanted to try other things not on the omakase (I was too full after)."], ["Michael W.", "If there is not a Sasabune in heaven then don't bother sending me.  The omakase (chef's choice) menu may concern some but don't worry, they take allergies and 'isms (vegetarianism, pesca, etc) to heart and work that into the menu.The typical dinner is 13 \"courses\" but you can stop earlier or have them bring more of what you really liked from the 13.  Each course is a couple pieces of nigiri, about the equivalent in sashimi, a roll, a small lobster tail half, something like that.  They are exceptional in presentation, taste, and uniqueness.I have been twice now and will indeed make this a place I go every time I am on Oahu.  It is among the very best sushi places I have enjoyed and they have ranged from Tokyo to San Francisco.  It's amazing.  Go try it."], ["Veronica P.", "Back to one of our Fave spot in Oahu!!Celebrated my better half's (kyle) birthday last night and we knew that it will be a HIT again just like the last time we were there (sometime in August 2014).  He did the Western style Omakase and I did the Exotic style; Indeed, we were impressed once again with all this amazingly fresh exotic seafood from all over the world from Albacore (to mention the liver), Spanish Mackarel, Sea Urchin to Oyster.  Yes, we went all the way to 13 course and we enjoyed every bite of it.  We will be back again for sure.And the Sake was perfect! **good pick on the Sake bottle honey!!"], ["Steve L.", "Overall, one of the best meals during our honeymoon in Maui and Oahu. I can't give it 5 stars since I've had better sushi in Tokyo and the SF Bay Area, but Sasabune definitely serves great quality fish (and rice)!We managed to get through the entire 13-course omakase meal; when you factor in the fact that each dish contained at least 2 pieces of very fresh, high-quality seafood, the omakase actually is a great value! While Sasbune doesn't serve Americanized jive rolls, they also don't serve completely traditional sushi as some pieces have other ingredients (such as fried garlic chips and specially-ordered-from-Japan hot sauce) to complement the flavors of the fish. I'll spare you a fish-by-fish account and just summarize with: great fish; we preferred some dishes over others, but have no real complaints.We sat at the bar and service was great as we enjoyed chatting with the assistant sushi chef (as the master chef sternly and quietly observed). I tried offering them sake but that apparently is not allowed in Hawaii - go figure. :) Regardless, I appreciated the generous pours of sake they gave me, haha!One of the neat things we learned is that they don't accept random drop-ins at the restaurant: they prepare a set amount of rice for the exact number of guests for each meal. Talk about keeping high standards!"], ["Leslie B.", "Recommend sitting at the sushi bar & enjoying the Chef's creations. We enjoyed every dish that was presented & liked how each dish was explained. The staff were very attentive & added to the whole experience. We'll definitely be back!!"], ["Max S.", "Omakase is the way to do it.  For two people after tip it was around $330.  Wow, expensive.  The chef selects about 13 dishes for you.  The funny aspect of it is that you are warned sternly for some of the courses to eat the course in one bite, without wasabi or ginger, or else the chef will possibly use the samurai sword sitting in front of the entrance.My wife was scolded for pulling out her phone and calling someone.  Refrain from any communication in this restaurant, except for chomping or swallowing sounds.This is an experience not to be missed.  Make reservations.  Then eat at Bubbies for some awesome ice cream where you can eat food slowly and talk on your phone."], ["Augusto T.", "Professional yet relaxed service, calm atmosphere, and delicious sushi.I was looking forward to my visit to Sushi Sasabune for weeks. In terms of sheer quality, it is possible that it is up there for the best sushi I have ever eaten. Was it the definitive sushi experience? I am not sure. I still think sushi can get even better. That said, in the end I was pleasantly surprised that dinner did not break the bank, and thus is definitely worth a visit if you don't mind spending a little more for a good quality meal. I had some beer and also shared a bottle of sake and the final bill seemed more than fair. I ordered the Omakase, and thus what I tried was up to the chef. The dishes received varied from classic nigiri to sashimi in ponzu and baked clams. Some general observations: the rice was nearly perfect, the wasabi was extremely delicious, the fresh fish very tasty and subtle. If I had to express one small critique it would be that a lot of the fish dishes were topped with ginger, shiso leaves, and green onions. These bold flavors, while a good compliment, did mask some of the more subtle flavor of the fish. If you are a fan of sushi and are in Oahu, it is likely a must-visit."], ["Angie H.", "My husband took me and our son (7mos old) there for a dining experience.  We certainly got what we asked for.  The food was delightful, however, they did not have any high chairs for babies so we had to hold our son on our lap throughout dinner.  Not ideal.  Then, about half way through, a waiter came to our table and scolded me for taking bites out of my sushi.  He said, \"Excuse me but it is considered bad etiquette to bite the sushi.  You must place the entire piece in your mouth.\"   I laughed but soon realized that he was dead serious and was really giving me a warning.  This restaurant is known for asking people to leave if you don't follow their RULES.   Needless to say, this left a bitter taste in my mouth after paying a $150 bill.  Screw that!!!!"], ["Kaimera F.", "Sitting at the bar and letting the chef decide was really great. I highly recommend it. I was hesitant at first when my friend suggested it but it was the best experience ever."], ["Samantha P.", "Feels like a gimmick. 13 bite sized pieces for $100. Seriously? Use to feel like they were picking the sushi just for you... Know it's a conveyer belt. Don't waste your time or money. The interior is dark and lame and now the food is too."], ["Reid S.", "Okay I wish I used my yelp before I went to Sushi Sasabune (meaning I wish I wrote a review when I actually went). A week ago, I wrote a review about Mitch's, but now it's time for me to review the sushi mecca of Hawaii. I believe I went to Sasabune 2 years ago, it was a present from my dad because I was leaving for school. I wanna leave Hawaii with a bang! So he said that I was ready for Sasabune. A lot of pressure I have to admit. It just so happens that my childhood study-abroad sister, Naoko moved from Osaka to Honolulu permanently, and works as a hostess here. So I was excited to see her once again! My dad made reservations to sit at the sushi bar, which made me a little weak in the knees because I have heard about the Sushi Nazi himself. The last thing I want to do is insult him in any way. But I broke it down: I love sushi right? Yes. I'm honored to be eating here right? Yes.So I saw no reason to be nervous. Just enjoy and appreciate the food.Branching off of my last sentence, I love that Sasabune truly teaches customers how to appreciate sushi. Sushi is not just fish on rice, it's art, it's a lifestyle, it is to be respected. So when I hear people complain about how they couldn't eat some of their sushi with shoyu, I have this to say: when you spend money to eat at a place like Sasabune, what must be understood is that the menu was precisely calculated to present the food in the best way possible, according to the Chef's ideas. So, if the instructions are \"no shoyu with this,\" instead of letting our 'food-egos' get in the way, just respect the fact that maybe shoyu isn't actually necessary here. Maybe it is better without shoyu. But I get it, no one likes to be told how to eat something, but at the same time, if instructions are to enhance the flavors and experience, why not just eat it the way the chef wants you to? Otherwise, you're not really tasting what the chef prepared. But I know most people don't struggle with this problem, I'm just...putting it out there. #RespectTheChefWhich is why you taste food before you dump salt, pepper, tobasco sauce, etc. all over it. So rude. lolOn a side note, I'm noticing that most of the bad reviews for Sasabune were from out-of-towners. Maybe it's not Hawaii, but where you're from? Food for thought. Our Japanese food in Hawaii is better than almost every establishment I've dined at on the mainland. Bold, but I completely stand by it. Anyways, I got a little off topic. We ordered the omakase, of course. And one by one, the dishes of sushi arrived. You know you're about to eat something incredible when your heart starts to flutter a bit from excitement. Well, I felt that all night. And then the food arrived:1) Abalone with Ocean Seaweed Salad2) Toro Nigiri prepared in two styles3) Hamachi Nigiri4) Aji + Saba Nigiri5) Salmon + Scallop (with yuzu) Nigiri6) Amaebi, Hirame, and Raw Oysters7) Soft Shell Crab, Taco, and Ika + Mentaiko Nigiri8) Uni + Ikura Nigiri9) Egg + Cooked Anago10) Negitoro Roll11) Prawn Miso Soup 12) Green Tea + Azuki Bean Ice Creamand my dad ordered saké from Nagano and Hiroshima, appropriate because my mom's family is from Nagano-ken and my dad's family is from Hiroshima. Too bad I was under 21, but at least my dad enjoyed it.All 12 courses were scrumptious. It was like a tour of the ocean. Brutal maybe for the ocean and its creatures, but pure heaven for me and anyone who eats at Sasabune.After eating at Mitch's I realized that Sasabune has them beat in the sense that there is concept and aesthetic here. You know and feel that you are eating the highest grade seafood, and in the midst of it all, the sushi chef observes his restaurant, with his arms crossed and a stoic look on his face. He rarely smiles, but somehow you know there is so much passion within.  When we were finished with our meal, my dad and I bowed towards the chef and his sous chefs, thanking them for a brilliant meal.  By far, one of the best meals of my life. And I have a feeling it will be difficult to top it. 6/5 stars."], ["Tweet T.", "I have had a lot of sushi in my life from other cities and countries; including Japan and boy o boy this place deserves a 5 star. It was quality fish, smooth like butter.I ditto the other reviews i.e. parking, not being seated immediately, no talking on phones etc. The service was clockwork smooth! Staff was knowledgeable!If I have to say something negative is that head chef doesn't like to smile!Worth the stop. ENJOY!"], ["Eric T.", "The food is not bad, the only thing I cant stand is chef's attitude and service.Who want to pay for horrible service?"], ["Jack L.", "Despite some reviews, incredible service. Amazing help with pairings and explanation how to enjoy every bite... quality of fish was outstanding. The best on the island"], ["Chay S.", "Took my girlfriend here for our anniversary dinner and I was simply blown away.The sushi here is of very high quality and extremely unique. We went for the Eastern course which I believe is a bit more exotic than the Western but everything tasted amazing. The service was spot on, food was amazing, and it does get a little pricey but I do believe that you get what you pay for. I will hope to be back very soon."]], "Doraku Sushi": [], "Kin Chan Sushi": [], "Izakaya Torae Torae": [["Kira K.", "For our anniversary dinner, my bf and I wanted to try something different.. But since he didn't get off work until 10, our options were limited. Luckily I found this place This place is located right next to sushi company on McCully... However at night, it is very hard to see their black sign! We had to call the restaurant to ask where they were because we didn't see it lol!! Luckily, we were able to find parking in that tiny lot.When we arrived, we were hungry and quickly ordered: truffle teri edamame, ahi poke, spicy tuna tartare, kikune pork belly, Cali roll, bakudan maki, chawanmushi, and I also asked the server if the chef was able to make the dashimaki tamago... And luckily he said ok! TRUFFLE TERI EDAMAME: SO insanely addicting!!! I never would have thought to pair teriyaki and truffle oil on edamame... I loveee truffle oil so I was happy that the truffle oil was noticeable (unlike some restaurants where uou taste nothing).. We loved this so much, we ordered 2 orders  lolSPICY TUNA TARTARE: this dish was creative and unique and the flavors matched so well with each other! Spicy ahi on top of guacamole accompanied with a small raw egg on top and served with deep fried nori \"chips\". I was a little hesitant with the egg, but it was good...so good that my bf ordered one just for himself LOLAHI POKE: nice and fresh CALIFORNIA ROLL: basic but delicious, the spicy tuna roll was accidentally given to us for free but that was good too. My bf loved the Cali roll so much as well, that he ordered another oneCHAWANMUSHI: reminds me of my childhood...even with all the delicious food, this was one of my top favorites!BAKUDAN MAKI: filled with seafood and is filling, but to me I'm not a fan of deep fried sushi so I found it a bit heavy and it tasted like there was cheese in it? Which I didn't care for with the seafoodKIKUNE PORK BELLY: by the time this came out, I realized I was full and my bf and I realized we ordered too much lol!! Anyways, I still took a few bites, and the pork belly melted in my mouth and went great with the onsen egg. The white thing in it (not sure what it is but it tastes pickled) tasted weird to us and we didn't eat it lolDASHIMAKI TAMAGO: unfortunately since we ordered too much, and since this dish does take awhile to make, we were stuffed when it came out! However, I ate one piece and it was delicious! The egg was light, airy and a little sweet and it was filled with unagi and cheese that oozed out. It came with mayo, dashi, and green onionOverall, this place was SO good! And I think my bf and I found a new favorite. However, next time we know not to order more than we can eat (at least we had lunch today lol). Also, service here was great, and the server (I think her name was Sunnie) was really sweet and even packed our food at our table even though we said we can do it. We got all of the above food, plus a 2nd order of the edamame, Cali roll and spicy tuna tartare for about $66"], ["Nancy K.", "Great food & service, almost everything that we order are so great and all stuff are very friendly.Just croquette are little cold inside and we order take out Donburi without Uni, but it was with uni and $6.95was more charged. That was to my daughter who does not like Uni, so I have to take it out.(But I love Uni, so I ate it.)We enjoyed our dinner very much.We will be back with rest of family."], ["Cara F.", "I love this place. The atmosphere, the music and the food. You can see the chefs working their magic while 70's 80's rock music is playing in the background. The seafood shooter is a must. Raw oyster, uni, ikura and a quail egg in ponzu. Eat it with your eyes closed its just heavenly. We also had the nigiri platter, lollipop roll and the pork kakuni, all excellent dishes.I can't wait to return."], ["Justin C.", "1. Great place for happy hour.. They have a pretty extensive food and drink list!  I dont remember all that we ordered.. But there was nothing that was remotely unappetizing 2.  If you are not coming here for the happy hour.. there are a bunch of good selections also! My memory is fading since my phone was not out to capture what I ordered.. but I do remember wanting to come back and try everything else on the menu."], ["Saxon S.", "You guys open till 12am!?  I'm soo there!  I dropped by last night at around 11pm ready to eat.  I was pleasantly surprised to see that they had a happy hour menu.  There were soo many options that looked great!  I ended up trying the crab croquette, ahi poke, chirashi bowl, ahi tataki, Hamachi carpaccio, pork belly kakuni, and taking buta!  I enjoyed the modern Japanese décor and friendly staff.  Parking could be an issue during peak times however I had no complaint when it came to the food and service.  I'll be back soo to try more items from the menu."], ["Stephanie L.", "What a great sushi find!! This restaurant is very popular with locals and tourists alike, but I still deem it a find since there are so many Japanese sushi places out there. I made reservations for 6:00pm and I'm happy to say that even though I was a little late, there were still plenty of tables available. Our waitress was very nice and suggested some popular dishes for us to try for our first time. We ordered the Spicy Tuna Tartare, which was delicious and came with too few seaweed chips to dip in. The spicy tuna roll was also very delicious! The Pork Belly Kakuni was like butter, super tender and flavorful. We also indulged and ordered the o-toro, which was super fatty and fresh, although a bit sinewy. My favorite of the night, however, was the hamachi carpaccio! Melt-in-your-mouth good with a nice kick to it! One thing I do want to mention is the amazing decor around the restaurant. I guess the artist is a friend of the owner, but her work is amazing! If I had money to burn, I'd definitely buy a piece! Reservations are recommended, as I hear it gets very busy. Parking is extremely limited, so come early or risk having to look elsewhere. I can't wait to come back with more friends so I can try more popular dishes!"], ["Michael O.", "Went to Torae Torae after a long while and it was even better than I remember...to me a true Izakaya have to do two things really well - have a wide selection of delicious Japanese bar food, including unique signature dishes, AND they need to do liquor and beer well. If the beer isn't iced down and super ice cold, in frosty mugs, that's already not authentic...many lower caliber izakaya in Hawaii will only refrigerator chill the beer...that's not enough. Torae however does beer right, including frosty imported Asahi draft beer...a true taste of Japan which is great.The food is fairly priced but uniquely and expertly crafted...for instance, all Izakaya have gyutan, but only Torae places 8 thin succulent slices on a large bed of thinly sliced white onions...you pinch the onion between a a slice of gyutan, dip in the sauce and it's heaven.Their sushi is delicious but also beautiful...they're not trying to whip them out too fast where the rice isn't even pressed and holding together well...they craft with care and it comes through in the balance of vinegar, shoyu, and that hint of wasabi...just enough to make your nose tickle...but not enough to make you tear...Nigiri sushi is buttery and melts in your mouth...truly delicious and the right hand pressed temperature so the subtlety of the fish and flavors pop just at the right moment...you sigh a relaxed and satisfied sense of relief that it's as delicious as you expected.It also helps that the izakayas owner us the lead sushi chef and is front and center ensuring his patrons are tended to and happy...his serious sincerity shines through and makes the amabiance alive with authentic Japanese craftsmanship.and quality service...Torae Torae is now in my top 3 favorite izakaya in Honolulu...but one star off for horrible parking."], ["David Y.", "Great service and great food. We didn't bother looking at the menu, instead looked at the photos from yelpers and went with all the favorite dishes. Tried to order the Dashimaki Tamago but the chef wasn't making it tonight. Overheard another table wanting the same but was told the chef made 5 the previous night and decided to take a break for tonight. For two we ordered 9 items. Turned out to be one roll too many between a light weight and a heavy weight. Originally I had the Pork Belly Kakuni and the Pork Belly Don on my list but was told by the waitress to just order one since they're both similar items. The broth in the Kakuni was good but with the soft egg, the don would have been better. Pork Belly Kakuni: Tender pork with a nice melt in your mouth belly fat. The pork was slightly tough but still very good with the broth. 8/10Spicy Tuna Tartare: The spiciness is very subtle and does not overpower the dish. Melt in your mouth texture. The guacamole under the tartare added additional creaminess to the dish. 10/10Hamachi Carpaccio: Melt in your mouth Hamachi with right amount of green onions and a hint of spicy pepper on top. The Hamachi was the star. 9/10Ahi Tataki: Essentially Ahi tuna carpaccio. Better than the Hamachi as the Ahi tuna was like butter. The freshness to this dish is unbeatable. 10/10Snow Crab and Corn Cream Croquette: Real snow crab meat mixed in with some corn in creamy potato with the consistency of puree. Two comes on a plate with half of each drizzled in a katsu sauce. The sauce gave it more flavor, otherwise the croquette was light on its own. 9/10Mini Negitoro don with Uni and Ikura: This is more of a customized donburi with the addition of uni and ikura so the price was adjusted for the customization. Fresh and buttery. Rice was cooked to perfection with just the right amount of rice to mix everything in with ponzu sauce on the side. 10/10Jidori Chicken Karaage: Good but nothing to write home about. If you've had good chicken karaage before I'd skip this and order another spicy tuna tartare. 8/10White dragon roll: Like another reviewer said, the garlic chip overpowers the hamachi. Actually the truffle oil overpowers the garlic chip. This would be a good option if you like the taste of truffle oil. Good roll but not as enjoyable for me as the Red dragon roll. 8/10Red dragon roll: spicy tuna inside and unagi on top. The spiciness of the tuna is very subtle. The sauce that's drizzled on is spicier. 9/10The rolls portion of the menu just had the names without the description. Our waitress had to explain to us what consisted of each roll. In the end it came out to be about $65 per person. We could have done without one of the rolls. Not a bad price for great service and quality. Come early for the limited parking spaces out in front."], ["Jenna D.", "This place and chefs are amazing, the food is fresh and innovative. I was so hungry after being out all day and skipping lunch, so ordered something pricey off the nightly special menu with uni and fish eggs. I love both ingredients because they offer bold and incredible favor. The chef prepared a special sauce to compliment. It was so worth it. Best meal of my trip and they are open late which is nice for the area!"], ["Sasha L.", "I almost don't want to write about this place, because it don't want it to get crowded when I come back for late night happy hour or dinner.. ;___;  darn it..I called the restaurant around  10pm to ask about their late night happy hour.  The girl answering the phone was really friendly and gave me directions to the place and told me they had open parking in front of the restaurant.  Woohoo!The same girl who gave us directions was also our server.  I didn't get her name, but I heard her coworkers say two girl names, Alyssa and Kera?  Either way, she was really sweet and nice to us, even though we came in pretty late for their happy hour (it starts at 10pm and we got there at almost 11pm).  I really appreciated that she was so nice, despite us coming in so late and ordering off the happy hour menu.  REALLY great service!  I had looked at a bunch of yelp photos (it was my first time here) and based on this, ordered the hamachi carpacchio, potato salad, ahi tempura, and spicy tuna tartar.  Off the happy hour menu, we got the kakuni and gyutan shio. Good god, everything here is delicious.  I am usually very picky about my food, and everything here was so good.  From the dishes we ordered to the onions that garnished our food..everything was on point.   Even my iichiko yuzu and hot sake was so good! My boyfriend had Asahi draft, and for the price, it was a very generous serving.Also to note, our waitress was the best.  I just finished a shift and came for after work drinks and snacks (so I know how hard it can be to serve a late night guest when it's late) and she treated us the same with our late night tab as if we had ordered a $500 check.  Checked up on us a lot, drinks were never empty, and we never felt rushed.  Service industry or late night people, this is the place to go!  Hope it's not harder to get a table, but not regretting this review.  This place is a hidden gem, and I highly recommend it!"], ["Shayla W.", "If you're looking for something different and love sushi then try it! Similar to Doraku, regarding portions but much cheaper and much more creative ideas; especially the lollipop roll. Hands down: one of my favorite sushi places on the island! Everything is reasonably priced too! Been here multiple times and their consistency has always been on point. We've ordered:-oyster shooters ****amazinnnnnng! -maguro natto don-stamina don -bara don-chirashi don-ama ebi (sweet shrimp) ebi-jidori chicken (ume)-lollipop roll-saba-chawanmushi Everything is so good. I would say skip dessert because you're really there for the food. Make sure you get reservations because this place is kind of small. Happy hour starts at 10! We'll definitely be back again!!"], ["Ericka B.", "Oh my glob! One of the very best sushi spots I've been to on this island. I cannot stress how freshness plays a key ingredient especially for sushi, and I was thoroughly surprised how amazing my experience was! Cute little sushi bar next to a to-go sushi joint (oh the irony). Parking and crowd was not at all a factor on my weeknight I attended. We were seated immediately. First order of business was to get some ume wine and ahi taretare for EACH person on the table. (hey hey hey I don't like to share this & neither will you!). Awesome spicy ahi taretare with a fresh quail egg and deep fried nori chips. Proceeded to order:+ Sweet botan Shrimp (sashimi style, fry the heads). Seriously--- fry the heads! So crunchy and yummy. + Ikura and Uni donburi. They had special uni from Japan that night which was $3 more and I never hesitated to say YES! The ikura wasn't overly salty like most places, it was actually quite pleasant. Uni was amazing. This would be my 2nd time trying uni and it's easily becoming one of my favorite seafoods. Comes on a bed of rice, seaweed strips, shiso leaf, wasabi, and ginger. + MANGURO... BRAHHH---- the best I've ever had. Amazingly THICK and well worth the price. Must try! Try it also with the housemade soy sauce. Manguro heaven. I also tried alot of my friends food and all were really good! Awesome experience with awesome people. I definitely recommend this place :)"], ["Sylvia G.", "My friend and I came in for their late night menu specials on a craving for sushi whim.  It wasn't that busy as I remember it being when they first opened but then it was close to 10pm.  We got their special yummy ichiko drinks in lychee and white peach...so light and refreshing with a little bubbly.  The hamachi carpaccio and spicy tuna tartare deserve special mention.  We also asked if the chef can make the unagi tamago dish that everyone raves about.  We waited and waited after we cleaned up everything else and it finally came. So worth the wait!!!! It was so creamy with amazing texture and the perfect flavors. We devoured it so fast burning our tongue and of course it was gone before I could snap a pic of it.  Trust me, ask your waiter and cross your fingers that the chef will make it. Prices were reasonable for their late night menu too."], ["Traci T.", "My friend suggested we try this place.  After reading the reviews and looking at the pictures, I was immediately game to check it out.  Thank goodness I read the reviews ahead of time so we knew to make reservations ahead of time.  When we made the decision to come here, it was a Tuesday.  Unfortunately, they are closed on Tuesdays.  Therefore, we had to wait until Wednesday (the day we planned to have dinner) to make the reservations.  Luckily, my friend called earlier in the day and someone answered the phone!  We were able to make a reservation at 6:30 pm for 5 people.  The one drawback about this place is the parking (hence, the minus of one star).  There is a small lot that you can park in for free (right in front of the restaurant), but it fills up pretty fast.  The other options are street parking (which is also limited) and a parking lot across the street for Central Pacific Bank.  This lot has a pay box that is $3 from 7 pm to 6 am on weekdays.  We were there a little before 7, but decided to just chance it and park in the lot.  Luckily, our cars weren't towed away!  Tip:  A security guard mentioned to us that we need to make sure that our money is fully in the box.  As the box says, use a key to push your bills inside.  The security guard said that homeless people come around and try to take money out of the pay box.  Then cars get towed away because the money was taken out.  How unfortunate!  My friends and I ordered:1.  Spicy Tuna Tartare (DELICIOUS!  My favorite of the evening.  We needed to order two of these for our group of 5)2.  Snapper Carpacciao 3.  Cream Corn and Crab Croquette4.  White Dragon Roll (thought the garlic chips on the top threw off the flavor)5.  Red Dragon Roll6.  Lollipop Roll (riceless sushi)7.  Dashi Maki Tamago (Yay!  We were fortunate that the chef had time to make this for us.  It was slightly busy, but we just asked anyways.  We didn't care how long the wait would be...haha!  It was so nice of the chef to do this for us.  I heard there were 5 other orders also put in for this popular off menu item.)Overall, we all enjoyed the dishes.  It's definitely a place we would come back again.  And we did!  Our first group of 5 people finished at a little after 9.  We walked back out to the parking lot and said goodbye to 2 people.  The 3 of us that were left just talked story until our 2 other friends came at about 10:30.  We then decided to go back and try out the Happy Hour (10 pm - last call).  Luckily, it wasn't too busy and we were able to get a table right away.  On our second visit in the evening, we ordered:1.  Pork Belly Kakuni (I didn't try this personally, but my friends said it was orgasmic!  Haha...they ordered a second one, but it never came)2.  Ahi Tataki3.  Ika Shiokara (which basically looked like fish bait)4.  Asari Sakamushi (steamed clams) (My friends raved about the broth)5.  Iichiko6.  Chu-hi (I ordered the green milk tea...yum!)Last call came around 11:30, so we needed to move on to a new venue to hang out.  Both visits were spectacular!  The food is delicious and the servers were very friendly."], ["Kelsey O.", "Really great late night happy hour! I would recommend the ahi tartare and ahi carpaccio. Also the seafood shooters! They can be pricey ($8 normally and $5 during happy hour) but they are so delicious. Small place like most izakayas but I promise it is worth the wait especially if you go during late night happy hour!! Staff is great too."], ["Tisha N.", "So here's a quick review for those of you (like me) who isn't into sifting through diatribes for the good parts...SERVICE: Excellent. From the time we sat down, we were happily greeted and served promptly. Always someone asking how things were, taking orders, water glasses refilled and empty plates a trash removed quickly. AMBIANCE: Beautiful art throughout the restaurant and even the restrooms. Really clean and fun atmosphere with the open kitchen and cool music.FOOD: Absolutely delicious! Nothing on the menu I didn't like. Portions were big and quality was on point. Just try it...you won't be sorry.PRICES: Super reasonable. I mean, there was an uni ikura don (sea urchin roe and salmon eggs rice bowl) with a very generous portion of uni and ikura for only $12.95. As we all know, that kind of seafood is not the cheapest on the menu. Yet, they're charging only that much. Score!LOCATION: Conveniently located and although parking can be a pain in front of the restaurant, there is ample parking across Young Street in the Central Pacific Bank parking lot for $3 (look for the payment box by the bank). If you don't want to pay, you can try and find on street parking in the residential area. Now, go eat!"], ["Jordan N Rachel M.", "We love this place! We go here as often as we can. We love the casual setting and good service. Try the lollipop roll, spicy ahi tartare and ahi tataki.  The food here is better than other places that'll charge you twice as much- no joke! The sushi chef and his team take great pride in their craft and it shows. Be ready for fresh fish served with a side of throwback grunge/alternative rock. Sushi+Kurt Cobain= winnah."], ["Dianna N.", "I came here with some friends that had this marked as a \"must try!\"  Parking is very limited, but we were able to find a spot on the side road a block or two away. The restaurant is very tiny and packed. Which could be good or bad.  Reservations are definitely recommended. Luckily we had them so we were seated fairly quickly. Looking at all the patrons plates, I was very excited. Everything looked great. I have eaten a lot of sushi, but honestly, mostly from places the conveyor belt or the fast food sushi. I have not been to many authentic (for lack of a better word) sushi restaurants, so I was a bit overwhelmed by the choices.  I wish there was a picture menu to help guide me in my choices, instead of ordering blindly. I did open up my Yelp reviews and used the pictures from there to guide me (thanks Yelpers!). That yielded me 2 great choices, 1 ok choice and 1 glad I tried, but I'll never order that again choice. All said and done, I really enjoyed this place. I gave four stars because of the lack of parking, the menu and the fact that my king salmon nigiri I ordered was delivered at room temperature. Again, I mentioned above that I have not been to a lot of sushi restaurants, but, I have always believed the fish should be cold.   The warmth of the fish made the texture very weird in my mouth and I was not the biggest fan."], ["Paul C.", "After a good but somewhat disappointing dining experience here I made it back the other night.   I had assisted a friend  with his taxes in the Kapiolani area and wanted to grab an early dinner.   He wanted Japanese food and I wasn't keen on going to Waikiki so we came here.   What a great decision that was.First of all, this place opens from 6pm so we arrived about 20 mins prior to opening and decided to wait.  I was quite surprised to have seen so many couples come for an early dinner only to realize they weren't open yet so we waited patiently.At 6pm the mad rush starts and about 2/3 of the restaurant fills up.  We didn't have any reservations so we didn't mind sitting in front of the sushi counter.  Personally, I enjoy seeing the sushi chef in action and I get to spy on the fresh seafood for the day!They no longer have OMAKASE courses where I didn't care for them as I prefer traditional Japanese food without teriyaki sauce, mayonnaise / aioli dressings so this time I ordered ala carte and had:1) UNI & IKURA donburi (5/5)OMG - - this is almost better than you know what!!!!!!  Talk about having a foodgasm at the sushi counter  They had Japanese UNI that day, where the roe is smaller but so rich and creamy.  I personally think the Japanese UNI is more flavorful so this was a home run in my books.  The IKURA was really fresh and enjoyed the roe popping in my mouth.  I'd give this dish 100 stars!!!2) KAKUNI (5/5)I've been told by the head chef Hideki Yoshimoto that his sleeping time is cut short due to making this dish.  I realize this is a time consuming dish and wow, this was also a winner.  Huge chunks of belly pork have been simmered for a loooooon time to have it melt in your mouth.  Served with stewed DAIKON and a soft boiled egg.  So refined.  So tasty.   WARNING:  There is a limited amount of this dish each day so I highly suggest you pre-order if you want to eat this.3) Grilled SABA (5/5)Although this fish took quite some time to come out of the kitchen, it seems that it is grilled-to-order.  It came out piping HOT and the outer skin was so crispy.  Served with a lemon wedge and some grated DAIKON and ginger, all you need is a bowl of rice to make me happy.Because the 1st time dining here was so disappointing I wasn't keen on rushing back so it took about a year to try this place again.  Food was EXCELLENT and I see myself wanting to dine here again.Service that night was excellent as the waitress came back to check on us repeatedly and refilled out water and tea cups.  Overall, a SOLID 5-stars.  I highly suggest you make reservations when dining here."], ["Vivian L.", "Izakaya Torae Torae is probably my new FAVORITE Japanese restaurant on the island. I made reservations here for two the day before for 6 p.m., and to be honest, we (as in us and the restaurant) did *not* get off to a great start. We arrived at 5:45 but got parking right outside since we were early. The restaurant opened at 6 p.m. sharp so we went in to get our table. When we gave them our reservation, they couldn't find us on the reservation list. I am not a patient person when it comes to dining, so I already felt myself easing towards irritation. Their manager (I believe) came over to apologize for the mix up and told us she could not give us a table. Then she asked if it would be okay to seat us at the sushi bar counter. I said it would be okay and they added an extra chair for us. It was a lot squishier than I had liked.Despite the mixup, the service we received the rest of the night was impeccable. The same woman who seated us took our orders. Although it seemed as though she was rushing us to put in our orders, she kindly let us know that she wanted to get our orders in so we wouldn't have to wait for the food when the crowd comes. And (of course) the crowd came. The restaurant filled up in 30 minutes.For appetizers, we ordered the Lollipop Roll, Ahi Tataki, and Spicy Ahi Tartare. I loved how refreshing the Lollipop Roll was, with fresh fish and the strong taste of shiso wrapped with cucumber. The Ahi Tataki was amazing, too. For our main dishes, we ordered the Red Dragon Roll and White Dragon Roll. The Red Dragon Roll tasted very similar to the one at Doraku Restaurant. However, the White Dragon Roll with the hamachi and garlic chips was out of this world! I really enjoyed it!I can't complain about the prices either! Worth it for the quality and amount of food. I was very pleased with my first visit and can't wait till my next one."], ["Stefanie C.", "For someone who is not from Hawaii, THIS is fresh sushi. Make a reservation or call ahead to make sure there is a table available, especially if you are bringing more than four people. Go for an early dinner because Izakaya gets busy closer to 8:00PM. Once you are seated, the fun begins. Prepare to pamper your tastebuds!I would highly recommend the Hamachi Carpaccio and the Lollipop Roll to start. For a group of six people, we also ordered the assorted nigiri and sashimi. Those dishes were enough. Honestly I think you could get anything from the menu and it would taste freaking amazing. I would say you end up waiting a little longer than your average restaurant for food, but that's the price you pay for fresh fish. Our waitress was incredibly educated on the menu. She could tell us where all the fish was from (local or imported) and gave us suggestions on what to get. We ended the meal with black sesame ice cream, which was okay. Always good to end meals with something sweet. I'm definitely going to try other sushi places on my next visit to Hawaii but if you end up coming here, you will not be disappointed!"], ["Trung L.", "My GF and I came here on a saturday, they take reservation.  I've been into trying Izakaya places as of late, and this place certainly hit the spot.  Fresh fish, creative dishes.Dishes that we had that I liked:Hamachi carpaccio - Presented nicely, and tasted just as goodBeef Tongue - Lots of flavor, could prob go lighter on the peppers though.Otoro Nigiri - Melts in your mouth Toro, was delicious.Uni nigiri - Good Uni.Hamachi Kama - Go for the Large, was grilled nicelyDishes that we tried, but didnt hit the spot:Agedashi Tofu - was kind of bland, could have given us a spoon to eat with though.Tako Wasabi - Raw RAW RAW, and is very strong with Wasabi.  Cold, slimy, and  had alot of Wasabi.Watercress - was a cold dish, didnt like it as much."], ["DrAl 8.", "Wanted to try this new izakaya for over a year, just never could get a reservation due to its small amounts of seats available and limited parking.  Finally get a seat for us tonight.  Menu:Shio TongueHanpen CheeseWhite Dragon rollSpicy ahi tartare Hot udonPork belly donStamina donChiwamushi Overall food is 5 starsService 4.5Limited seats 3 starsParking 3 starsTherefore 4 star experience. Will definitely return:)"], ["Tammy T.", "Best sushi I've had in Hawaii so far:pThe fish is fresh. Sushi tasted so good!!It is a little bit pricey(around 150 for two) and the service is kind of slow. However I will definitely come back here for their tasty sushi!"], ["Amy G.", "UNI and IKURA don! That's the one thing I crave for. Their spicy ahi tartare is another favorite on the menu. These two items to myself and I'll be smiling all night long.  I've had other things on the menu but those two dishes are what I come back here for. Make reservations or there is bar seating and if you're lucky, there is a few unreserved tables, but reservations are a must if you really want to eat there a certain day."], ["Diana L.", "I walked out of here completely full and satisfied. I've had this place bookmarked for a while now and finally made it out there since I was craving for some Uni and Toro. First tip: make reservations! I called them before they opened and they had countertop seating open. If you have a larger party, I suggest you call several days ahead. Parking is limited. There are a couple of stalls of to the side of the building reserved for Territorial Bank, but only until 6pm. There's always street parking, you'll just have to walk a little. The service was great. My waitress was attentive. Always came by to check up on me. But not too excessively. Which is a good thing. Sushi chef was also very attentive. Would check in with me every now and then to make sure I had what I needed. Great job for service. Now let's get to the food I ordered: - Tako Wasabi: Interesting taste. It's raw. Soaked in wasabi. Not that it was spicy, the texture was interesting. Slimy and chewy, is how I'd describe it. - Tan Shio: Of course I'd get this. I love beef tongue. Grilled nicely, ponzu on the side. Spritz a little bit of lemon on top and you're good to go. I did enjoy this, but it wasn't outstandingly memorable. - Uni Ikura Don: If you love Uni, you'll be sure to like this. It is a very generous portion of Uni and Ikura served over a bed of rice. It totally hit the spot with my Uni craving. - Spicy Tuna Tartare: I love spicy tuna. I love avocados. Great combination. The fried nori and crispy won ton made it even better. Definitely try this out. And yes, I did get my O-toro fix satisfied too. Although I will say, it was good, not great. Not memorable. I've had better. All-in-all, I had a good evening. The prices are reasonable. Food was good. Place was clean. Service was excellent. I'd definitely come back. Enjoy!"], ["Grace L.", "After my second experience, I unfortunately had to reduce a star.  The food is still AWESOME, the uni is extremely fresh and everything is still so good.However, the 1 star reduction comes from service and cost.  I really think Torae needs to hire another host/server because there was only one employee tonight and she was really busy. We asked for green tea at the end of our meal but I guess she forgot because it was so busy.  It is understandable given the dinner rush but I mean if you're so busy that you're forgetting orders, it probably means you need more people working.Last time we went, which was about 6 months ago, the uni/ikura don was $10.  I thought that was really well priced for the portions and I was so happy that I could get my uni fix without breaking the bank and also getting to taste other appetizers because the portions are smaller.  The price has gone up to $13.  I suppose $13 isn't THAT expensive for an uni/ikura don but a $3 increase still seems pretty large to me.  I'm not entirely certain but based on that alone, I assume other dishes had a price increase as well.My friend and I tried some new dishes (that I didn't try last time): Hanpen cheese, crab croquette, and dashi tamago.Hanpen cheese: Fish cake with american cheese ($5).  I thought this dish would be awesome because hello, everything is greater with cheese!  Unfortunately it was nothing special and it tastes like regular fishcake with melted american cheese.Crab croquette: I really enjoyed the rich creaminess of the inside of the croquette.  You could tell there was real crab inside instead of just fillers.  The outside was nice and crispy, which complimented the crab mixture on the inside.Dashi tamago:  We honestly just wanted tamago.  The sushi tamago that is apparently traditionally served as \"dessert\" at Japanese sushi restaurants.  I never order tamago nigiri but I just wanted the fluffy egg cake (minus the rice).  I guess we weren't clear on what we wanted because the dashi tamago was NOT the sweet egg custard we were thinking!  It was made with the same tamago but stuffed with cheese and unagi?  Don't get me wrong though, we may have ordered the wrong thing but this dish was DELICIOUS.  Only downside is that it was $9 for 8 small pieces.  I would definitely still order it again though!We realized that you could park at the bank across the street if there is no parking in the tiny/terrible torae parking lot.  Make sure you have dollar bills because it's $3 for night time parking.  It's worth it I suppose if you really want to eat here and/or you get parking anxiety because that tiny lot kind of sucks.The food is still pretty good but I'd say service has gone down and prices have gone up.  That combination definitely can't be good..."], ["Noel H.", "Overall, good food and service, but unfortunately, they were out of ama ebi! Anytime I go to an Izakaya or sushi restaurant, I have to get ama ebi sashimi and munch on the fried head! Maybe it was because we went on a Sunday, but they were also out of the regular uni (we had to spend a dollar extra for the \"one from Japan\") and regular sized Hamachi Kama (normal price ~$15; we had to pay for the \"large\" for $20). Don't get me wrong, everything was delicious, but I was pretty disappointed that we had to be flexible with our desires. So, if you're expecting a full menu, you may want to call before making a reservation and ask if they're sold out of anything you're craving!"], ["Roy M.", "Simple, good food. Should get reservations if you don't you will be waiting and go a bit early since parking can be weird there. But its worth itThis place is everything an Izakaya should be - Unpretentious atmosphere, delicious food, familial hospitality. It's filled with local regulars who stream through the door the minute they open and they know each other and know the owner and everyone is smiling and happy.Only thing I didn't like was the owner/cook should dress up a bit he was wearing shorts and a polo collar shirt which he was very nice and smiling but it makes a rest look better if it was bit more classy.This place would be good for first date night outing. Again don't let the unwelcoming location and limited parking in the lot stop you. There is street parking on Young St. or CPK parking for $3For the small, rather hole-in-the-wall joint, they could rival any big establishment in terms of quality and service. My friends and I loved Izakaya Torae Torae! Will definitely be back!"], ["Kelli-Ann M.", "My boyfriend and I came here on a whim. We were in town on a Sunday afternoon and decided to have dinner somewhere. We both were craving some kind of sushi and my boyfriend saw pictures from this place and he was convinced we needed to go there. He called around 5:30 pm asking if a reservation was needed. Since they opened at 6:00 pm the lady said the sushi bar was only available. Okay, perfect we love sitting at sushi bars.I swear I've seen this restaurant so many times as I drive home on McCully from work but for some reason, I couldn't picture it in my head. As we started driving up McCully, boom there it was. On the right side, right before the Shell gas station. The parking here is really tight and I can't imagine if we came at a later time, where we would have parked! But lucky for us, there was a parking stall right in front of the restaurant. As we walked in, I was surprised that the restaurant was half full. I swear it was only a few minutes after 6:00 pm. We got quickly seated at the sushi bar. They handed us a menu and asked for our drink order.We looked over the menu several times before finally deciding what to order.Things we ordered:Snow Crab and Corn Cream Croquette $9.95 - this was amazing!!! I don't really care for corquette's but this thing was delicious. The crab and corn was a perfect mix.Saba Shioyaki $6.95 - can't go wrong with saba. pan fried seasoned with salt.. perfectly seasoned and delicious! however, if you don't like the real fishy taste, you might now like this.White dragon roll $12.95 - YUMMERS!! this sushi roll was amazing. the truffle sauce made the sushi taste even better. this roll had hamachi on top and shrimp tempura inside. this most definitely was one of my favs.Daily special: Negi otoro ikura uni quail egg don $14.95 - my boyfriend was in heaven. All of his favorites, in one bowl! He absolutely loved it. California handroll - plain and simple. Can't go wrongAnkimo - monkfish liver. (not for me)Several pieces of Kampachi sashimi Some kind of sakeOverall, this place was a great pick. It could be a little pricey but what sushi place isn't. If you haven't gone here yet, you should most definitely give it a try. Call ahead and arrive early because like I said, parking can be tight."], ["Kristine Q.", "If you plan to come here, make reservations! The place is a bit small and can get real busy. Lucky there were seats open at the sushi bar for us. We were greeted right away.The food was really good. I was so sad that they ran out of the hamachi kama! They only have a few so order it once you sit down! Vegetable Tempura ($8.95): carrot, zucchini, shiso, lotus root, shiitake mushroom, and Japanese pumpkin served with tentsuyu sauce. The batter was light and crispy. It was really good.Jidori Chicken Karaoke ($6.95): Free range jidori chicken battered and deep fried. This was alright. I wouldn't care to order it again.Seafood Shooter ($8): Oyster, scallop, sea urchin, sweet shrimp, and ikura served in a ponzu sesame sauce. It tasted good but the shooter was extremely small. Tan Shio ($8.95): Grilled Beef Tongue. I love beef tongue! This was really yummy. It comes on a bed of sliced sweet onions and a dipping sauce. There were about 4 or 5 pieces. I wish the portion was bigger.Ahi Tataki ($3.95): So good!! You gotta get this! Ribeye Steak ($19.95): 8 oz premium ribeye beef served with a special garlic onion sauce or teriyaki sauce. I felt like we waited forever for our steak to come out like at least 30in. It came on a sizzling platter on a mix of grilled onions, bean speouts, and lettuce. There was a lot of flavor in this dish and I would definitely order this again. Shiromi Nigiri ($3.95 for 1 pc): Yum!!Overall the food is pretty good but I just wish the portions were a bit bigger. They have a late night happy hour I believe. I definitely would be back for happy hour."], ["Shandis C.", "This is a wonderful little mom and pop Izakaya.  I'm not 100% certain that this is a family-run business, but in the few times that I've eaten here, that is the feeling I got - like I was a guest in someone's home. The service here is always warm.  In fact, there first time I ate here, the way the spoke to me really had me wondering if I already knew them and that my memory was just really bad, haha!Besides the great service, the food is just as great.  The one thing that I always order here is their White Dragon Roll! Tempura, avocado roll topped with hamachi, aioli, ginger sauce and crispy garlic chips!  It is the best Dragon Roll that I've ever had, and it's only about $12!  Other dishes that I like here are the ahi nachos (crispy seaweed chips to go with it too!) tuna tataki, and hamachi kama.  The crab croquette is good too, but a it's pretty rich so I would suggest ordering it, if you will be sharing it with a few other people.  If you can handle rich and greasy foods, then definitely go for it!  There are no pictures on this menu, so if you are like me, and look at an Izakaya menu not really knowing what to expect, then be sure to look at the pictures on yelp before you order.    The prices here are very good, compared to other izakaya's, IMO.  I feel like we order what we want, without worrying that it will burn a hole in our wallets.  Reservations are highly recommended as it is always packed. If you like izakaya, then you must add Izakaya Torae Torae to your bookmarks, because it's sure to become one of your new favorites!"], ["Beverly N.", "Just amazing. Located on mccully street and young street. It's a small place with limited parking. I always come here after 10 becus of happy hour and last call is at 11:30. Uni is awesome, but i only order it if its from japan for i believe $8-9. Sushi is really good and fresh. Bf gets the hamachi sashimi every time at 5 pieces per order. And the pork kakuni don is very flavorful. Comes with an egg and a piece of daikon. I get the bara chirashi don(cubes of raw fish and ikura) from happy hour and the ahi tataki. The ahi tataki has dried garlic and garlic mayo drizzle and its addicting. I even put the garlic mayo on my chirashi don.  This meal can be very cheap or very expensive depending on what you order. Its very reasonable pricing.The interior is very nice and modern, a little traditional. They have paintings of female silhouettes doing different things which i think is awesome. Id buy some paintings if i had extra money. Over $100.The chefs and waitresses are all pretty young and they give us amazing service every time! I highly recommend it. But remember, if you go out to eat, leave at least a 15%+ tip!!!!"], ["Shayna K.", "I am addicted to the Uni Ikura Don. The stuff is so rich, fresh, delicioso...I try to get in almost every Friday just to order that. So. Much. Uni. So. Much. Ikura. So. Ono. I think I counted six big pieces of uni in my last bowl. That's unheard of for only like $12! Amaze-balls. That's my new name for ikura. Amazingness bursting out of a little red translucent ball. Uni Amaze-balls Don. And you wonder why you can never get reservations on a Friday night. Hint: call earlier. I can't believe I just told you that."], ["Lei L.", "My awesome hubby took me here for Mother's Day since I've been wanting to go for weeks now. Torae Torae did not disappoint. 5 stars sake & beer selection 5 stars for their grilled snapper with ponzu reduction - corn & cucumber10 stars for the seafood shooters5 stars hamachi carpaccio 2 stars for the pork kakuni We opted to sit at the sushi bar & I highly recommend that...lots of action & fun convo with their crew. Look on the specials board --they seem to have a lot of great things on it nightly. Parking was easy at 6, but difficult after 7pm."], ["Aaron T.", "Food is innovative and amazing. Late night happy hour incredible. Service on point. Everything we could eat and two rounds of $4 Asahi drafts - bill was $50. Wow."], ["Alysha K.", "I love Izakaya Torae Torae for a multitude of reasons. Hide is so passionate and creative at what he does. He is always trying to perfect his dishes and comes up with something new often. The prices are very reasonable for the style and quality of food, and he appeals to all types of sushi and izakaya eaters. Everything on the regular menu is very flavorful and delicious. Some of my favorites are the hamburger cheese steak, pork kakuni, chawan mushi, ahi tartar, cream corn and crab croquettes, and anything raw - sashimi and sushi. However, my ultimate favorites are whatever's on his specialty menu of the day. I remember specifically going one time to literally only eat one thing because of his post from Instagram - it was the wagyu topped with uni and ikura (BTW if you don't follow him yet, his IG name is @hideyoshi808). If he's not super busy and able to do special requests, I suggest getting the dashimaki tamago, negitoro with uni, ikura, and quail egg served with fried nori, king salmon ikura sashimi salad, and pan fried snapper in ponzu butter sauce, or ask if he has any omakase's planned. I love that Hide is always trying to find the freshest ingredients and fish that's in season. He recently did a special omakase on Matsutake mushrooms since they are in season now, and you can only get it two times out of the whole year. I'm so glad Izakaya Torae Torae is right down the street to where I live, because it has now become my go-to when I'm craving sushi, sashimi, sake, or just a fabulous meal in general. I recommend making reservations because it does get crowded, especially on weekends. If you have a small party (2-3 people), ask to sit at the bar so you can talk to Hide himself!"], ["Kenson K.", "Came here for a business dinner and thought it was quite good. The service here was very attentive. The kakuni pork belly was very tender and flavorful. Winner. I also enjoyed the hamburger cheese steak. The Hamachi Carpaccio was also very good and had lots of flavor to it.  My least favorite was the lollipop roll. It was essentially a California roll but instead of nori, there was  cucumber outside. Other than that, everything else was delicious."], ["Mike T.", "This is by far the best place for the price and meal for izakaya in Honolulu.  I have never been there for happy hr.  Parking can be hassle but you can park behind the street. We will be back"], ["Blair K.", "We came here based on a fellow yelpers review. This was a perfect spot for us because we wanted to take our friends who live in pearl city to place that they haven't been before. Everything was great, and was the perfect place for us since it's kind of like a tapas style. I am not going to bore with every item we ordered  but will give you my recommendations. We started off the hamachi carpaccio which was served on top a bed of sweet onions with a ponzu.  The jidiru chicken karaage was another great dish. We loved the seafood shooter that had bits of oyster, shrimp, salmon eggs, uni with a ponzu sauce which was so delicious. You can taste all the unique flavors mixing together. The sashimi platter was beautifully presented and everything we ordered was outstanding. Especially the chu toro and amebi shrimp. If you get the sweet amebi have them deep fry the head. Pros:The sashimi was so fresh and tasty. Loved the seafood shooter. Service was fast and the servers are efficient. Ambience has the feel of a younger and local crowd.Cons:Not much parking. Overall:Highly recommend coming here. It's a great place for groups as you can order tapas style and everyone gets to get a little bit of everything. The sashimi is really good and loved their Chu toro and sweet amebi. I wasn't to impressed with the rolls. But everything else was great."]], "Mitch's Fish Market": [], "Sansei Seafood Restaurant & Sushi Bar": [], "Tokkuri-Tei": [], "Sushi Izakaya Gaku": [["Dwayne Y.", "This place is amazing.  My favorite Japanese Restaurants on Oahu are Gaku, Nonbei, and Imanas Tei.  Gaku is my favorite though.  The food is amazing!"], ["Victoria C.", "We really enjoyed our dinner at Gaku. Everything we tried was delicious. It can get a bit pricey but worth it for all of the fresh and tasty food. I really enjoyed the fried pumpkin. So different than anything I've had before. We also really liked the oyster and toro sushi specials. The California roll was also very good. My husband had a full fish (forgot the name, but it is a fish only found in the pacific) and thought it was prepared perfectly."], ["Nana K.", "I just found out that my favorite sushi man Manabu san opened his own izakaya.  I went to check it out and had a great time.  Manabu san is still the same and his spicy tuna is as good as ever!!!  I can eat his inside out spicy tuna roll with Avocado for every meal.  The place was really nice, sushi chef's outfits were awesome, food was on point.  Congrats Manabu san on your success!!!  I am going again before my trip is over for sure :) And I did."], ["T L.", "Went back for a 2nd time and just didn't wow me like it did the first time. Kinda let down but nonetheless, still a good place to kick back and enjoy some delicious Japanese plates.Omatsui Natto was still delicious, the fresh tofu was refreshing and delightful, and we had various sushi which was good too. We had plenty of dishes but still walked away feeling slightly hungry.Also, the male host needs to smile more."], ["Derek W.", "Not sure what happened to my original review of Sushi Izakaya Gaku but here comes the second one. I was sorta disappointed with my original visit here two trips ago since we weren't able to make reservations, I was determined to try this place out and ended up waiting close to 2 1/2 hours for a seat.  I guess that left a super sour taste on my tongue and really didn't think the food lived up to the hype.  However, I still thought some dishes were unique and was worth checking out again with the wifey.This time around, I made reservations a month out in advance and requested the sushi bar.  Arrived and scored parking in the back.Spicy hamachi tartare yelp.com/biz_photos/sush….  This dish was what brought me back here.  The combination of the hamachi and their spicy sauce was simply awesome!  A definite must order when dining here.Wife loves natto so therefore ordered this natto, uni, ikura, okra, and yamaimo salad yelp.com/biz_photos/sush….  She thought it was hella good.  Guess you have to love natto and yamaimo to enjoy this.Kabocha karaage yelp.com/biz_photos/sush….  Lightly battered and fried kabocha squash which I thought was just ok.  Karaage chicken yelp.com/biz_photos/sush….  Not sure why I always crave some sort of protein after diving, but I was craving this and was not disappointed.  Perfectly fried to a golden brown this chicken karaage didn't disappoint.Hokkaido scallop sashimi yelp.com/biz_photos/sush….  Was surprised they lightly grilled the scallops which added an awesome smokey flavor to the already sweet scallops.  A definite must order!Seared toro sushi yelp.com/biz_photos/sush….  Yes I know very non-traditional sushi dish but it is one of my favorite since the torch brings out some of the oil from the toro which just adds so much flavor to the already tasty fish.Will be back but will need to make sure to make reservations waaaay out in advance to avoid the 2+ hour wait.  People seem to just hang out here at this place so don't expect a quick turn-around."], ["Sasha L.", "Gaku is my favorite Japanese restaurant, hands down.  I've tried sushi everywhere and nowhere in Hawaii compares to the otoro (fatty tuna that melts in your mouth like butter) that they have here.  Came here last night and had otoro nigiri, ikura wrapped in otoro, garlic seared otoro and otoro sashimi..it's the best!  Also, we had hamachi kama, uni tofu jelly, dried sting ray, ikura wrapped salmon, coffee jelly with ice cream, and some sake, beer and iichiko Mizu wari.  This place is consistently the best Japanese food I have found.  The only bad thing is that they're always booked, so after 7pm they don't take reservations and you can walk in and put your name down.  I can't wait to come back again!"], ["Johanna M.", "What a great spot for a date night.  This little gem serves some of the best sushi I've ever had. Everything was so fresh, and the presentation of all the dishes were so pretty.  I almost didn't want to eat some of it because it was so beautiful.  My hubby and I went on a Saturday night so they were pretty busy.  We made a reservation about two weeks before our visit, and our table was waiting for us when we arrived.  Our waitress was so sweet.  It was our first time there and she made some great suggestions.  She recommended their shumai, which we might have just glazed over upon reading the menu, but it was a great addition.  The shumai was big too...this isn't your ordinary shumai.  She also suggested this really tasty deep fried pork cubes, which were really tender and well seasoned.  We loved them.  They were small, but pack a big punch.While their sushi is divine...do try their tofu jelly with roe...so dope.  The negihama tartare was also really delicious and fun to eat.  The otoro is also amazing...so soft, so yummy.  One of my favorite items was the miso soup with the shrimp heads...it was sooo good.  The shrimp was slightly sweet...it might be the best miso soup I've ever had.  My hubby and I also ordered a plate of sashimi, and I loved the shrimp.  It was sweet, and so great.  I am usually not a fan of raw shrimp, but this shrimp was so tender and slightly sweet.  If you want to splurge a bit, come out to this place.  It is a little pricey, but well worth it.  I will say, we were still hungry after we left, so we grabbed some food at the next spot.  Maybe eat something before coming here, so you're not starving when you arrive."], ["Sheila K.", "Tonight's omakase was outstanding!  The sushi chefs are so delightful!  Probably the most authentic sushi outside of Japan.  The dashi Ikura, kampachi and unni were some of the best I've ever had!!!  It was a great place to go for a special celebration.  We ate so much and the price was even less than I had spent at other sushi bars!  Definitely coming again!!!"], ["Jennifer D. L.", "Malibu was out sushi chef and he was friendly & amazing! The moi was so soft and delightful. The Japanese snapper was also amazing! I thought I didn't like snapper because it's been a bit fishy in the past, but I was pleasantly surprised :)Ambiance was relaxing and the vibe was on point! My date was great too :)"], ["Mike C.", "My new favorite izakaya in Honolulu.  Up there with my favorite places in Honolulu to get sushi, too."], ["Tommy C.", "Overall excellent dining experience. Sashimi, steak, oysters...all skillfully prepared.  Premium quality and freshness. Excellent service.  Not really good for groups or kids. MAKE RESERVATIONS."], ["Glenn C.", "Best sushi I had in a long time!!! Time and effort goes into everything they make. Got super lucky and was able to walk in, however, reservations are usually a week out. 7pm-Closing is first come first serve and wait could be hours. Worth the wait, or show up exactly at opening and hope they let you in."], ["Lyn L.", "Another fun evening with \"the girls\"....Five of my lady friends get together and the \"birthday girl\" gets to pick the place.  Well, this time it was Izakaya Gaku...We had a Japanese table where you sit on the floor with your legs and feet in a \"pit\".  The table is above floor level so it is pretty comfortable.Remember to remove your shoes before you enter the room and wear slacks...not really pretty watching a group of older ladies get up and down from the floor.  We kind of had to gather ourselves up, roll over and then get up, some with the help of the wall or door...well enough said about older people sitting on the floor.The people were very nice, be prepared for a strong Japanese accent, the servers are authentic!We started out with miso soup, not the fancy one, just the basic.  It was hot and delicious with a piece of wakame, love it!  Next came the house salad..really nice and the dressing was perfect.  Then we had the karaage chicken, nice and crispy and delicious.  Spider roll came next (deep fried soft shell crab in a roll), that was so delicious and what we loved is the roll is small enough to be one bite...so you are not biting on it and the sushi is falling apart.  We had miso butterfish, TNT (their version of dynamite), both very good.  The TNT had nice chunks of scallop, mirugai (king clam) and clams, I think.  Flavor was good!We also had the fried moi and even an order of the deep fried bones, oh so nice and crispy.Finally was the dessert.  A couple of the ladies had the green tea ice cream, one had the azuki beans with mochi balls and one had the special flan.  I had the custard which was delicious, not sweet....they topped it all off with a special dessert for the birthday girl...it was fun...they turn down the lights and the waitresses gather around and announce the birthday.  Then they get the whole restaurant singing Happy Birthday...my girlfriend was really embarrassed, but it was still a fun event for the ladies.Gaku is on the pricey side, but I guess considering all that we ate and the quality and the special dessert they provided, it was all worth it!"], ["Joanne Y.", "I'm a sushi snob, and have been spoiled by the plenty good fish from living in CA and visiting Japan. Taking Japan out of the picture since that's just not a fair comparison... this place is good. It's solid, but it's definitely nowhere near my top 5. The fish quality is good, but by no means top-tier. The small plates we got were also solid dishes, but nothing in my mind really stood out. For the price it was pretty average - I would say they definitely can satisfy a good sushi craving, however don't be surprised if it doesn't blow you out of the water."], ["Micki K.", "One of the best Japanese restaurants that I oh so love! Been a customer ever since 2012, and still not disappointed! Although, one of my favorite waiter disappeared :(Food is delicious, the flavors and texture is on point! I always get the fried kobocha and garlic steak. Besides that, everything else is good. Though, the bill can get pretty high fast. Dessert is a must, I love their custard pudding. Been my favorite ever since I first came here. Parking is limited and tight (risk getting your car scratched/dented) inside the building. Or you could just street park, if there is.Definitely a must try, you won't be disappointed! Forever your loyal customer :)"], ["Roger A.", "I ate here last night with three friends.It is traditional Japanese seating, that is remove your shoes.We spend $500 with tip. Two bottles of sake, 4 beers, a few entrees, and many sushi later...The fish was fresh.  The service was good. I would recommend this place."], ["Marie I.", "Anytime there's an opportunity to eat dinner at Izakaya Gaku I jump for it.  I like to go at 5-ish so I can take one of the few parking spots in the back (where I also check out the veggies they grow).The energetic, Japanese speaking staff are friendly, helpful, and attentive. They have very creative and unique dishes, my favorite being their spicy hamachi tartare w negi and a raw quail egg yolk, eaten with crispy nori catapults me into heaven.  I never leave without having this dish!"], ["Maria G.", "I am so conflicted about Gaku. On one hand their dishes are really tasty, on the other hand their prices just seem too steep for what you get. Don't get me wrong, I'm willing to drop $ on a good meal, but when you charge me $20-30 for an appetizer that is so small, it just doesn't seem worth it, especially if there are other places that serve izakaya fare just as good."], ["Good A.", "Even though this is an expensive place, they are totally legit, they actually speak Japanese.  The food here is exceptional, fish is very fresh, much better than that overrated San Sei place in Maui.  These small restaurants are a dying breed, and very hard to come by, seems like a local spot that have not been tainted by us mainlanders yet.  The service was exceptional as well, no rush service, table was ready when we walked in and as with any quality Japanese establishment, all workers greeted us when we walked in...  Overall, a fine dining experience, out of the touristy area of Waikiki..."], ["Jackie M.", "One of my favorite authentic Japanese restaurant. I went there for late night snack and the nigiri was very fresh. I had the Otoro nigiri, tuna tartare, and beef tongue. It was delicious..."], ["Connie H.", "- TLDR -If you like Japanese food, Sushi Izakaya Gaku is THE place to go!- FOOD -I'm generally not a fan of Izakayas because the sashimi tends to not be of the best quality, but this restaurant proved me wrong. We ordered quite a bit, but the following were the most outstanding: + Spicy hamachi tartar. If you come here and don't order this, you might as well have not come at all. The tartar is soaked with flavor and comes with a stack of fresh seaweed on the side. Wrap the tartar into the seafood for the extra crunch and voila! Best tartar ever. + Uni wrapped in hirame (thinly sliced halibut) - for the uni lovers, this is a must try! Definitely on the pricier side, but totally worth it. + Seared toro sushi with garlic - tbh I can probably eat 10 of these.+ Gyutan (beef tongue) over a bed of thinly sliced onions with ponzu sauce. The beef tongue was flavorful and the onions added a crisp, refreshing taste. My dad's favorite!! - SERVICE & AMBIANCE -Excellent service, chef came out a couple times to personally serve the food and give us more recommendations. We were there for around 2 hours and was not rushed to leave by any of the staff. I would recommend making a reservation because it is a small restaurant and they were not taking many walk-ins the night I visited."], ["Rosa W.", "Just go and let you mouth feel the fresh and the sweet of their fish. Just amazing good!"], ["Betty C.", "We found this place because of Yelp and we would definitely be back when we are back in Oahu. We were greeted by the entire staff when we first arrived and so there's a very welcoming atmosphere. We sat at the sushi bar and ordered a variety of sushi including their daily specials. Everything was very fresh and well prepared. I wanted to keep on eating the otoro and the uni! We would opt for the omakase next time because everything was so high quality. Tip: They do take reservations but were fully booked when we called a few days ahead. We were able to walk in around 9:30pm and had no wait even on a weekend. Walk ins are accepted after 7:30pm."], ["Lenny B.", "Since it was Christmas, we supper club ladies of four wanted something to indulge.  The food was excellent but since it was our first time here, we wanted help with the selection of food from the waitress..... wrong!! I think it was the language barrier lol.  I know fine Japanese food serves small portions, waitress could have recommended we order two or three servings as there were only two pieces per dish.  Not racist but I think our experience would have been better if we had the better English speaking wait help who could have given us better recommendations  and would have given this place a five star.  The selection of food was excellent and sashimi platter was ONO, specially the uni, one of the freshest I've tasted. I know fresh as I grew up eating it fresh from the ocean :-).  Save your tummy for dessert!! Definitely be back but will try the bar seating next time...."], ["Nadia K.", "This is my most favorite restaurant!  They have a very extensive regular menu as well as a changing menu of specials that coming here once a month ensures us that we will have our favorites and be able to trying something new too.  Win, Win!For those of you who don't know, typically when dining at an izakaya, the food is normally ordered slowly over several courses rather than all at once.  The dishes also come out when they are ready and not all at the same time.  If in doubt and want to let the sushi chef decide for you, order the omakase sushi and/or sashimi!  Our sashimi favorites are the otoro, uni, saba, moi, and kinmedai.  I also love the seared toro with garlic and the king salmon nigiri.  We always order the stellar bay oysters and the spicy negihamachi tartar.  The uni shooters and the carpaccio are very delicious as well!  If raw fish is not up your alley, then order the pumpkin kaarage, kurobuta sausage, miso butterfish, hamachi kama and chicken kaarage.  All excellent!If you are feeling adventerous, ask for the hone (super thin and crispy fried fish).  It tastes like chips and goes great with that bottle of Asahi.  For desserts, I recommend the zenzai.  It is the very best!  Their house custard is also really good.  Be sure to check out their dessert special as well.  We once ordered 3 of the Japanese style pancake with ice cream.  It was that delicious.  And I miss it.  Please bring it back.  If you have a small party, be sure to sit at the sushi counter where all the action takes place.  The sushi chefs are amazing to watch and so friendly.  If you have 12-14 people, ask for the tatami room!  Their tatami room has space under the table for your legs so it's very comfortable.This is one of the best restaurants on the island and perfect for any occasion.  Bring your friends, your family, your out of town guests here and have an amazing experience!There is parking in the back, street parking, or pay the box across the street in the same buidling as Cafe Sistina.  Definitely make a reservation!  They take reservations for dining between 5pm-7pm and then its a wait list.  Closed Sundays and Mondays."], ["Joyce L.", "The last time I ate here was about 4 years ago. I'm not much of sashimi eater but I do like shellfish like king clam, abalone, oysters. I ordered king clam and abalone without wasabi. Yeah, I don't do wasabi either. But they forgot my request and I thought I was having a heart attack and a big crocodile tear rolled down my face. They did fix my order. I'm sure sushi chef thought what dummy eats at sushi place without wasabi. I wasn't upset at all. I really came here to feed my husband. I can't tell you how sashimi was. My husband prefers Mitch's though. Shhhhh. Their dessert was pretty good. We had mochi with Azuki, guava and peach jelly, vanilla ice cream for my boring son. The atmosphere is nice and cozy. People are laughing having good old time. Personally, I rather eat at Sushi King. To me, it's about the same since I don't eat sashimi."], ["Vivian L.", "When you're only in Hawaii for 24 hours, you need to be efficient, organized, and hungry to be able to do as many of the greatest hits as possible.Our objective was to have fresh fish (specifically Toro) while in Hawaii. Sushi Izakaya Gaku was an easy decision. It offered sashimi and unique small plates izakaya style. It's a favorite among locals and tourists.We took a cab from Waikiki Beach, and it was kind of difficult to find, even after putting in the address in the GPS. There's a big, bright Japanese restaurant right next door, and we thought that was it, even though the GPS said we already passed it. The entrance is not really lit, and you have to look carefully for the signage. We called in for reservations a couple weeks prior just in case and we opted for a table instead of the sushi bar.I knew I had wanted the toro for sure, and also the spicy negi hamachi tartar after looking at all the yelp photos. We also ordered a rockfish carpaccio, seared garlic Toro, and steamed sweet potato manju with pork. Spicy Negi Hamachi Tartar+ The spicy negi hamachi tartar was our favorite that night. The bowl of tartar sits in a bowl of ice, and they give you sheets of nori to wrap the tartar with. After mixing the egg into the tartar, it becomes savory, creamy goodness. We wanted to order another one, and almost did as our dessert...Rockfish Carpaccio+ The rockfish was so fresh that it was almost crunchy when biting into it, it had such a springiness to it. It didn't have much taste to the fish itself (which was rather mild), but it was quite tasty with the sauces, oils, jalapeño, and garnishes. It was more about the texture of the fish than flavor.Oh Toro+ The plate of oh toro came with 7 pieces for $40. Honestly, and surprisingly, I was disappointed. I expected a creamy, butteriness since it's the fatty belly of the tuna. Instead, it was juicy. I don't know how to explain it except to liken it to an under ripe avocado. It's watery, and bland (but very fresh). It was wetter than sashimi that I've had in the past. I didn't care for it very much at all, and I still prefer sake sashimi.Seared Garlic Toro Nigiri+ We also got two pieces of seared garlic toro nigiri, at $14 for two pieces. I liked the seared toro more than the sashimi. It brought out a little more butter flavor, and I always like the smokiness of the blowtorch on my sushi. However, I didn't notice the garlic taste.Pork Manju+ This was our \"wild card\" and ordered it as something different to try. It was so good! the manju is a big ball of pork inside a soft, mushy mochi skin sitting in a puddle of warm flavorful broth. It was delicious.We wanted to order one more thing just to push us over the threshold between content and satisfied. We almost ordered another negi hamachi tartar, but asked our waitress for fresh fish suggestions. She asked us what types of fish we're looking for, we said something fatty. She brought out two slices of local fish (sorry, the name escapes me) and it was so much better than the toro. I usually don't like skin on my sashimi, but I couldn't even tell with this one. Overall, if you have the means and ways of getting here from the touristy beaches, please do. While you're in Hawaii, you gotta have fresh fish."], ["Kim M.", "Everything I've ever had here = great, delicious, worth every penny. OMAKASE is absolutely fab. I totally recommend it. Especially if you aren't a picky eater and you LOVE to try new things. ;)#lovethatomakasedoe: yelp.com/biz_photos/sush…yelp.com/biz_photos/sush…On my most recent visit, my 2 male friends and I ate and drank about $650-worth of scrumptious Gaku eats and SAKE. We really take that whole \"saké till you maké\" thing seriously.(That wagyu nigiri is bomb, BTW.)Oyster shooter: yelp.com/biz_photos/sush…I'll keep this short and sweet bc Gaku is an experience to be had over and over again. Reviews don't do this place justice. Make sure you go with great company and adventurous eaters.FYI - Walk-ins welcome after 7PM, so get there a bit before 7PM (early enough) to save your place in line / put your name down and give your number."], ["Mido U.", "The best sushi in Hawaii.  I am not sure why i haven't reviewed this place before.  it is the best.  it is hte go to.  there is nothing like it.  they are not pretenious.  there food is amazing.  the uni shooter is to die for.  the sushi is top notch.  the sting ray is amazing.  trust me.  uni shooter, sting ray, and you really cant screw up the rest of your order if you get those two and they will keep you coming back!  only gripe is that the parking is terrible.  try to find street parking is the easiest"], ["W L.", "Ordered the omakase which was $60 per person and received one dish with 11 pieces of sushi. Don't know if I'm jaded from having omakase from the mainland but I usually expect more than just one dish with multiple pieces of sushi. Granted, the one piece of toro was excellent. I appreciated the small mound of rice that accompanied each piece of fish. The uni had a watery appearance (sucked). Overall, it's okay. It's a bit far from the strip of hotels to command Waikiki prices so a bit overpriced. Stick to ordering rolls and a la cart. Pro tip - if you get the ama ebi with your omakase, better ask for the fried shrimp head from your waiter otherwise you forfeit that."], ["Ada F.", "Hands down better than Sushi Sasabune. Last night we dined there so everything is quite fresh in my mind.We ordered:Fresh scallop sashimi from Hokkaido - they must have grilled it over wood because there was this smokiness to it that made it amazing. Never had fresh scallops that way.Very delicious!!!Seared toro with garlic sushi - my hisbamd's favorite. I did not try, too full from my natto, but if he is particular about his sushi so if he says it is good it must be. Spicy negihamachi tartar - yellowtail & green onion with Gaku's original spicy sauce. Super delicious!! A must order!!!Omatsuri natto - natto with uni, ikura, ahi, ika, yamaimo, okra & quail egg. If you love natto you will LOVE this. Natto and yamaimo are two things I love so this was heaven for me. Another must order!!!Kabocha karaage - so so. I expected more. I love kabocha and this disappointed me. Gaku's tori karaage - good flavor! I'll definitely be back for more. Make reservations ahead of time or you will be waiting for awhile. There is street parking and a tiny lot in the back."], ["Regina B.", "Tried this place for the first time and mmmm so good! Read a bunch of yelp reviews to decide what to order. A lot of ppl say it's expensive but it really depends on what you order.  Ranges from $5 to $25 for single dishes and higher for combinations/omakase. We were a party of 2, ordered 6 dishes and 2 desserts, came out to $130 after tip.Negihamachi tartare and tofu jelly with uni- loved! Both served chilled, very refreshing. Could prolly order 3 each!Ribeye with garlic(bfs fav)- was iffy about ordering steak at a sushi place but so glad I did! Very tender and packed with yummy sweet garlic soy flavor. Seared garlic o toro and wagyu beef- was super excited to try these but thought they were just ok. Maybe my palate isn't sophisticated enough to appreciate these pricey items. Wagyu- intense marbling, red meat is tender and yummy but the fat is very chewy, to the point where I just swallowed it cause I was tired of chewing.Butterfish was good but they serve this everywhere so i would try the more unique items... Overall the food was very fresh and tasty, would def return. Service was good, a little slow but workers were sweet. I recomend making reservations on a weekday around 645pm. Metered street parking right outside the restaurant opens at 630 and is free.. didn't bother looking at their provided parking as yelp users say it's few and cramped"], ["Mel S.", "This is my latest favorite sushi restaurant on da island! It's so perfect, super fresh and perfect omakase! Also enjoyed the uni with gelatin, otoro, and the ikura with sake flavor is a master piece! Parking can get challenging but it's worth it and try to make reservations!"], ["Aireen M.", "Baked king crab was good Garlic rib eye steak Soft shell crab roll was good too Definitely we'll be backKinda pricey thou"], ["KoBBella K.", "Very good restaurant. Although it needs an hour waiting, the staff there is so kind to call me whenever the seat is ready. Food is very fresh and tasty, especially the toro( def worth the price). Wonderful grilled moi too!"], ["Austin C.", "Maybe they are the best in the area. I can't really say because I'm just a tourist but I thought it was good. Nothing special. The sashimi was nice and fresh, I am not a fan of uni and now not a fan of raw scallops. Both taste just like sea water to me, but some people like that. I wouldn't say this is a 3-4 person platter although it is good for sharing but as you can see, some items have 4 pieces, some have 2. So if you are getting this for 3-4 ppl, a couple will just have to miss out on a few items. If you are thinking that it will be a lot of food, it's not. 1 person voice of easily finish and eat more. The tartar was good and there are quite a lot of items on the menu I didn't get to try. I wouldn't say it was out of this world amazing but it was good. I would venture here again to try other things but not in a rush. Too many other food places to try. Service is excellent and always s a pleasure eating Japanese food. I wouldn't say it is more expensive than other places, but you get what you pay for. Go cheaper, you'll prob get less quality."], ["Denise L.", "This place is superb, it really is. Their sashimi is of excellent quality and our waitress even informed us that some of the fish the chef prepares is straight from Japan. Can you get any more authentic than that? Even though Hawaii is known for having outstanding Japanese food, Izakaya Gaku is pretty much at the top of the pyramid. Seriously, if you're a tourist and you're trying to figure out a place to get BOMB ASS SUSHI (please excuse my enthusiasm), this is the place to go!!!  It's kind of a hole in the wall but a walkable distance from Ala Moana too-- which is great, because what better way to help the economy than to treat your taste buds to fresh, buttery sashimi afterwards? Oh, and you get the cutest, cheeriest/spirited greeting from the chefs when you walk in too. I have no idea why, but that always makes me :) get it? And it might be a good idea to make reservations unless you want to chill on their bench outside."], ["Ryan F.", "Wife and I haven't eaten at gaku for quite a while and decided to treat ourselves to what we remembered was some good quality Japanese food.  We ordered several plates of the seared toro sushi, spicy Hamachi tartar, king crab cakes, grilled moi, tanuki udon, and the seafood dynamite.  Hands down the 'wow' dish was the seared toro.  The dang pieces of fish just melts in your mouth and almost has a beefy taste to it.  I told my wife I would have been completely satisfied eating just 4 or 5 plates of the seared toro.  The spicy Hamachi tartar was good, but I've eaten some good spicy tuna bowls and sushi at other places so the spicy Hamachi didn't give me the same wow effect.  The king crab cakes were ok.  Grilled moi was moist and delicious.  The seafood dynamite was the only disappointment for me.  Just didn't care for the large chunks of squid and tako they added to the dish.  Overall the food was great, service was ok.  Took off one star due to missed order. (ordered 2 more toro sushi, but server forgot to place it) and the seafood dynamite.  Would recommend this place to friends."], ["Sharon H.", "A lovely and extravagant choice for izakaya dining in a traditional setting, complete with the shoji doors, low tables and open kitchen with delicious, sizzling aromas wafting throughout the modest-sized restaurant.From the polite and refined servers to the river stone chopstick holder, the attention to detail made Sushi Izakaya Gaku a four-star experience for me. After a long day of shopping, it was so nice to sit back and watch with awe as one dish after another arrived at the table. For starters, a dashimaki tamago served cold was simply presented with a generous scoop of grated daikon. While Fran C. and our friend Cathy dined on oysters on the half shell, I munched on kabocha karaage with it's delicate fried crunch giving way to a meltingly soft pumpkin. We all shared the chicken karaage with a squeeze of lemon, perfect alongside a hearty bowl of udon noodles bathed in hot broth. The two of them also indulged in sushi and tempura, signatures of the restaurant, while I was content to finish my bowl of udon and contemplate dessert.Parking is in a tiny lot adjacent to the restaurant, and we were one of the lucky ones to find a space, though most folks will have to make a few passes along King Street or Sheridan Street to find an open space. I want to go back, only next time I'd prefer someone else to drive!"], ["Rachael O.", "I am in love! With a sushi place, of all things.  You see, I was not a sushi fan before.  But my date suggested it and he was a darling person, so I decided to make the best of it.  It turned out that the food and the experience were fantastic!We arrived right on time for our reservation to a hearty greeting from the servers and sushi chefs.  Don't let the location fool you.  The interior is warm and inviting.  I'm not sure why, but our reservation did not guarantee us a table, only two seats at the bar. While I enjoy sitting close and seeing the chefs in action, my date was recovering from being hit by a car while riding his bike (Don't text and drive, folks!) and sometimes sitting up high at a bar is less comfy than a table. These bar stools were comfier than most, so all was well.I didn't see the bill, so I can only comment on the quality of the food, which was incredible, start to finish, as was the presentation.  We enjoyed oysters served on a bed of ice (super fresh and slightly briny, just like I like 'em), the thing with the quail egg on top (hamachi tartar?), otoro, a savory custard, cold, pickled spinach (or some other greens), green tea, cold sake, and a not-overly-sweet mousse like dessert topped with fruit.The service was gracious and impeccable.  The staff was knowledgeable but not obtrusive.  I never thought I'd say it, but I now have my very own favorite sushi spot."]], "Hawaii Sushi": [], "Odori-ko": [], "Yohei Sushi Restaurant": [], "Hawaiiana Cafe & Sushi": [], "Akasaka": [], "Sushi Ginza Onodera": [], "Sushi ii": [], "Ginza Sushi": [], "Morio's Sushi Bistro": [["Michael O.", "Morios is an institution. The go to sushi spot for highly affordable, super fresh, and creative sushi. No chili oil over everything here...just delicious slabs of fish...and baby fried tako of course.The hype is real...hard to make a res unless you're a regular, you stalk the open times, or a friend gifts you their res cause they sick. But once you try it, and you share a beer (green bottles only please) or a sake shot with Morio, you're changed forever.Whether off the menu or omakase...all good. And free ice cream drumsticks at the end! ;)"], ["Josiah S.", "Morio is the Rock N' Roll Hall of Fame of Sushi, if it was located in the Wild Wild West, and had it's own fishing boat.  Lost? So am I, and so will you be if you are trying to score reservations (they have 2 seatings a night, 16-20 people per seating, and are booked months in advance). But keep at it, be flexible, and you will find yourself enjoying some of the freshest sushi in town!The best part about Morio's isn't the fish - though the fish is fresh and fantastic - it is the setting. Since it is BYO you can roll up with a cooler of sake and beer and enjoy yourself silly, but bring some to share with your fellow diners (it is quite close-quarters), the staff, and Morio himself! There is a tendency for the fish portions - always expertly sliced and prepared - to get even more generous as Chef Morio enjoys a Coors Light or two. Omakase is quite reasonable and has a few levels, one of which includes the live lobster sashimi and lobster miso soup (You have to order this ahead of time). Tasty, but I admit I had some cringe worthy moments as my lobster tried to escape to freedom right off my dinner plate as I was enjoying his tail meat. Excellent rolls and nigiri, with lots of options and a constantly updating menu (with plenty of revisions on the wall). My favorite Morio moment has to be my first time - the staff brought us complimentary shots of sake that they were passing around to all the customers - and then Morio even sent over some complimentary oysters which I had attempted to order, but which had been unavailable to those not doing the omakase (I wasn't). Turns out he found a few extra, and I got my oyster fix! That is the kind of place Morio's is - small, and hard to get a table at, but oh so worth it for the food you will eat and the people you will meet. Keep calling for that rezzy, and go go go!"], ["Lee Ying K.", "All the majesty and deliciousness of a $100+ per-head omakase, minus the high falutin and denial of soy sauce.  The fastidious eater who has always aspired to experience an omakase, and has at some point pored lovingly over Sasabune's Yelp reviews, only to sigh as she remembered sadly the spectre of student loans looming overhead can now do so, at a veritable bargain.  Don't grip your pursestrings so tightly, my dear!  Morio's Sushi Bistro is ideal for someone who craves the quality of a \"high-end\" sushi omakase, but is discouraged by the price.  Morio's is also perfect for you if you're not down with the idea of submitting yourself to sushi chef nazis who dictate the precise manner and timing by which you eat their creations.  Location/Ambience:  Morio's is located in the small, nondescript building right before Jack in the Box on South King St.  There is a parking lot provided in back. The place itself is very cozy, and it's pretty much like walking into Japan.  Food:   Varieties of fish and ingredients will vary from meal to meal; Morio himself is a fishmonger by day and sushi chef/comedian by night.  He'll only serve the very best, and being well-acquainted with the fish business in Hawaii, he knows how to get the best.  Here's what an omakase is like at Morio's, course by course:1) Hamachi Kama - cooked to perfection, graced with a lemon wedge.  The meat is so moist. A great prelude to an even better meal to come. 2) Chawan-mushi - a seafood chawan-mushi.  Soft, savory, hot custard with mushroom, shrimps and topped with tobiko.  I don't care for chawan-mushi, but this was tasty.3) Raw oysters - lovely and fresh, served on a bed of ice. 4) Sashimi - Morio will take note of how many members are in your party and serve you a sashimi platter accordingly.  Ours had maguro, salmon, hamachi, and another unidentifiable but delicious fish.  The freshness of the fish was even more pronounced because it was served cold.5) Lobster Sashimi - chopped up tail meat, served in the shell of the lobster tail.  Great texture; no sliminess.  6) Deep fried Flounder with bones - Fantastic.  No hint of oiliness at all.  The meat was great; moist and flaky, but the bones were the real star.  They were fried to the point where you could eat them like chips, and I wish I could, every night with a glass of wine and Netflix. Then the actual sushi:7) Rockfish- very good.  The vinegar in the sushi rice is calibrated to perfection, and it's as much a joy to eat as the fish itself. 8) Chutoro - fatty, fatty.  Don't ruin the flavor of the cut by drowning in shoyu. 9) Hirame (Flounder) - one of my favorites of the night. lightly dressed with ponzu to bring out the flavors even more.  10) Shima aji - delicious. 11) Awabi - abalone, served in its own opalescent shell, accompanied by mustard.  My first time having raw abalone.  Great texture and taste. 12) Engawa - possibly my favorite of the night.  I am verklempt, and that never happens. 13) Uni - I'm not sure if my appetite bested the length of the actual omakase, but at this point, Morio asked if I was still hungry, and I earnestly requested uni.  It was some of the freshest, most delectable uni ever.  14) Negitoro - chopped tuna and green onion sushi, with a gratuitous pile of extra negitoro on the side.  So generous!  If you don't finish all the little extras he gives you ... I don't know about you as a person. 15) Lobster Miso Soup - Miso soup made from the leftover lobster shells.  A bit salty, but what miso isn't?  A nice way to end the meal, while you finish up the last of the Sapporo and sake you brought.  (It's BYOB here) 16) Complimentary post-meal Nestle drumstick - so adorable I had to mention it. The singular gripe I have with Morio's is that the wasabi could be more potent.  That's it!  Everything else was marvelous.Reservations are necessary.  You will be disappointed beyond belief (not to mention embarrassed) if you attempt to walk in without one.  At that point, you can't do anything but temper your shame with an even more shameful sourdough jack w/curly and buttermilk next door at your friendly neighborhood Jack in the Box.  Morio's has a two to three-month waitlist, and deservedly so.  The little sushi restaurant that could houses only sixteen patrons; eight at the bar, and four each at two small corner tables.  I will be dreaming of going again."], ["Anna K.", "Morio's has a special place in my heart. I started eating at his sushi joint about 5 years ago. At that time, there was no seating time and the restaurant was tucked away in a Waikiki health food eatery that closed at night. Morio's was a sushi pop up 6 days a week. If you got a seat, you were pumped. If you didn't, you would be wait-listed and pray to God that you'll get a phone call to inform you that a seat was open. If you didn't get a call... \"ahh next time maybe?\"5 years later, his restaurant is still going strong with reservations booked months in advanced. There is 2 seating times, at 6 and 8:30 which allows more people to dine at his place The restaurant is still small about 16 seats, which adds to the cozy, fun atmosphere that Morio's is known for. The food is still fantastic and insanely fresh. I went there recently and had the omakase. There was sashimi (lobster, hamachi, salmon), miso lobster soup, chawamushi, hamachi kama, raw oysters, various nigiri (scallop, uni, crab with kani miso, filet mignon), etc. I ate so much I could've slept at the restaurant. Talk about a kanak attack!The restaurant is still BYOB so don't forget to pack extra to share your drinks with Morio and the other patrons. Prepare to laugh, chat, eat, drink and repeat until it is time for you to leave."], ["Chad Y.", "Oh Morio...your name invokes epic stories of how your sushi is among the best bites ever created by man. How your omakase menu can't be beat by some of the best restaurants in Japan. Or how the wait for a reservation is practically impossible, yet when you do finally get a reservation on the graduation of your first born child, you skip said child's graduation for a spot here.So the question becomes...is it a legendary as others have said.Yes.That's all you really need to know. Because words can't describe the silky texture of the maguro or perhaps the fresh crisp flavors of the uni. Nor can you ever forget how bites that come out of the kitchen are just down right epic. Its a small place. Yes. So you get to know people rather intimately. However, that is part of the nostalgic charm that helps define Morio's. You aren't going to get to know the stranger next to you...well, unless you are sitting at the bar, which are some of the best seats in my book. Service is good and the staff are great at helping make suggestions and bringing food out in a great orchestration that doesn't overwhelm you.So...yeah, it might blow your mind. Simple. Classic. Quality. That's all you need when it comes to a great Japanese experience."], ["Shanisse I.", "Morio, Morio... wherefore art thou Morio?I'm being selfish and put off writing a review because I don't want all of you guys coming here ^_^ There's always a three month (minimum) wait for the next reservation so I don't want all of you guys extending that wait ^_^... But this place is amazing!I've only been here twice (for now) and I've had nothing but a fantastic experience. They have two seating's, 6 and 830pm.. I've always had the 830 seating and I think that's the better one.. Only because you don't have to rush and you can sit down and enjoy your food.. My first time, we did Omakase and the second time we ordered off the menu.. Omakase was great, we got uni, ahi and salmon sashimi, oysters, hotate, amaebi, toro and a bunch of other stuff I can't remember. But what I do remember was that each bite was amazing. Ordering off the menu, we got uni, salmon (I always need salmon) spicy tuna roll, onion salmon roll, hamachi kama, we even got a crab roll (poor morio, majority of the people in the restaurant ordered off the menu AND he had to omakase for two parties)..it took a while to get food but it didn't bother us at all.. we had a blast just watching him make the different dishes!!.. Plus its hilarious watching the playful banter between him and some of the other patrons. I cannot say this enough.. Morio is awesome lol!Oh yeah, you have to get the baby tako.. It is so yummerz.. Just do it. It is BYOB and sharing with Morio is always a plus.. I always see him drinking while making the sushi that I'm amazed he can do this every night. He does like to share his drinks with the ladies (he's a true gentleman) The restaurant is small.. a bar and three tables... leads to a more family/relative's house feeling. He's a blast to dine with.. and he always tells everyone to come karaoke. If I didn't have to work, I'd be down to go lol. He's always nice enough to provide dessert.. We got mochi ice cream the first time and drumsticks the last time we came.We wrote our name down for a reservation in December.. We figured three months would be a decent amount of time for us to start craving Morio's.. Pricing??.. Compared to other places I've been to, this place is well priced!..When we did Omakase, I was like \"where's the rest of the bill?\".. I've payed double elsewhere but the experience was so boring compared to Morio. At Morio's you get quality food and will always walk out happy. I'll be sharing my pictures soon"], ["Shannon E.", "If you don't know where to look, you'll miss it.  I drive by Morio's at least twice a week and until tonight, I had no idea that's where it was. Thanks to friends of mine that know people, I was able to snag the last spot in their reservation for the 6pm seating.  I left my hubby at home for this meal because it would've been completely wasted on him since he doesn't eat sushi or raw fish (I know, crazy right?!).Since the entire seating was a group that knew each other, the atmosphere was lively and fun.  It was a given that everyone was going to do omakase - and it was just so exciting to see what was brought out next.  I couldn't get myself to eat the uni, but everything else was outstanding.  My personal faves were the toro, deep fried flounder and chawanmushi.  We also ordered a few rolls off the menu which were equally delish.  Having recently lived in Japan, I can honestly say that eating at Morio's felt like I could've been at a restaurant in Japan because of the quality of the food.Tips:  BYOB and be prepared for cozy seating.  Also, as others noted you should call at least 1-2 months in advance for a reservation.  For those skeptics out there (as to whether they really are booked that far), I watched a server answer the phone, actually look at the reservation book and then respond that they were booked until the end of September.Definitely a must try for sushi/sashimi lovers.  Hopefully I will be back soon!"], ["Deb K.", "Morio's is a reliably fun, tasty dining experience. You're likely to make fast new friends at this friendly joint so be prepared to share some of your BYOB with Chef Morio and fellow diners. The omakase menu is one of the best deals in the state so it can be difficult to get reservations. Tip:   call right before they open to see if there are any cancellations that night."], ["Jenel O.", "Morios has renovated - there's now more counter space to watch Morio in action! The food and service is still equally good, if not better!We decided on the omakase this time as opposed to ordering off the menu like last time. There were a few surprise delights for me - the fried flounder (so good!) and chawanmushi. I don't usually care for chawanmusi that much but this one was SO good and tasty!All of the fish and shellfish is really fresh and it's still BYOB (bonus!).Only two seatings per night and they book up months and months in advance -so call now!"], ["Kevin C.", "What can I say about Morio's that already hasn't been said? I mean, almost 500 reviews and 4.5 stars? The guy has to be doing SOMETHING right!There are only two things you need to worry about when dining at Morio's: reservations and BYOB. Getting a reservation is the most important and difficult thing about dining here. Their books fill up fast and they fill up months in advance. I made my reservation at least 3-4 months in advance. You can call and ask what months they are taking reservations for or what day they will start taking the next round of reservations. This place is BYOB so please B your own B and then some more to share with Morio. Sake is always a fan favorite but just about anything you want to have with your meal is fair game. There are two seatings per night, 6:00pm and 8:30pm. In total, our meal took 2 hours but could have lasted longer if we opted to continue on. We ordered the omakase (chef's choice) meal. There is a stopping point where they ask if you want to continue or finish off your meal. Pricing will vary from that point for everyone. Our 12 courses included hamachi kama (collar bone), chawan mushi, assorted sashimi, teriyaki ahi, lobster sashimi, deep fried flounder, oyster shooters, snow crab and mackerel nigiri, scallop and flounder nigiri and lobster miso soup. The lobster miso soup was amazing. Savory miso soup with chunks of lobster that fall right out of the shell! The entire meal was delicious and a great value. Our omakase was $60/person. STEAL!Service was very attentive. We had a bucket of ice to keep our beers cold and waters were always filled. The joint can fit only 15 people so it's a very intimate setting. Parking was not a problem for us as there is a private lot in the back. Just don't miss the driveway!"], ["Moli Y.", "So, this teeny tiny sushi bistro can be easily missed driving down King Street.  It is hidden between this green wall and Jack in the Box, so be sure to drive slowly or you can miss the parking lot in the back.  Street parking is also available, if you are lucky!I am no sushi aficionado, but this sushi bistro is truly a hidden gem!  Never have I tasted fresh and delicious variety of sushi delicacies right in my backyard!  My taste buds were exploding with flavors after each morsel.  Few fishes that I have never heard of were the highlight of the evening and familiar ones with a Morio's twist were so scrumptious.  Sorry Yeeps, but I could not remember any of those Japanese dish names, but will definitely make you order and go with the OMAKASE.  Be ready and adventurous to try new things!  Because what is life without a few surprises, right?Fresh oysters, monk fish liver, Ume flavored jellyfish were just a few ones that made me crave for more!!  Our party of 8, yes the loud ones and probably drunk half way through the meal, enjoyed everything Morio offered to our table.  The staff service was ... how I can say it in Japanese....  SUBARASHII!!  They were all really awesome with spot on service.  By thanking Morio, we shared our BYOS as in Bring Your Own Sake, as our grateful gesture for serving us an evening of wonderful sushi, fun entertainment and sharing the scary looking house snake sake that a few of us dare to try!  It was the most fun sushi dining experience our party had and truly a wonderful evening our friends will be raving about for years to come!Visit Morio by making a reservation WAY ahead of time.  The place holds less than 20 people and they are only two seatings available.  I preferred the last sitting, since you get to take your time to enjoy the experience."], ["Paul C.", "As I mentioned in a previous review (Char Siu House to be exact), businesses, just like human beings will have OFF days.  Not one individual is perfect so we need to give second chances.After a disappointing experience last year, I really thought Morio's was overrated.  A year ago I walked away stunned with sub-par food quality after reading so many great reviews.  When fellow Yelper Victoria M. told me that Morio's is outstanding I disagreed.  She kept on telling me how great the meals are at Morio's and I kept on shaking my head.About a month ago she invited me as she made reservations.  For those of you who don't know, it's difficult to get a reservation here.  It needs to be made far in advance OR you can test your luck by hoping someone cancels and you can snag those open seats!  Hmmmm...available seats.  Victoria kept on RAVING about here so I decided to try them once more.  Victoria M., Chef Morio and his staff made me a believer.Since my initial visit, Morio's went through renovations and now has LESS seats than before.  Does that make sense?  You would think a popular restaurant would EXPAND with more seating.  The sushi counter now seats 9.  His \"regular\" dining tables sat an additional 8 so it was a FULL HOUSE with 17 diners.Most of us had OMAKASE course.  I also had this last year but it has changed a bit.  Here is what we had:1) Boiled Soybeans (EDAMAME)  3/5Standard appetizers.  Nothing special.2) JUMBO Grilled Hamachi Kama  5/5Grilled to perfection, this HUNK of fish was divided by 3 people.  The outside was charred slightly and lightly seasoned.  Very flavorful and moist.  Chef Morio hit this one out of the park.3) Chawanmushi  4/5This traditional savory Japanese custard was served in a very small cup and was packed with flavor.  Chicken, shrimp, fish roe and Shiitake mushroom in this light custard.  Damn thing disappeared so quickly. 4) Sashimi  4/5This time around I was served better cuts of fish.  No sinew or firm end pieces. A trio of AHI (tuna), NARAIGI (swordfish) and SHAKE (salmon) were all flavorful.  I'm NOT a fan of AHI but still ate it.  I prefer SHIROMI (white flesh) over AKAMI (red flesh) any day.5) Fresh Oysters  5/5The Kumamoto oyster was shucked and served raw on a half-shell.  Packed with great flavor, I could have eaten 6 of these easily.  Meal came with only one oyster.  Sad face...6) Karei Karaage (deep-fried flounder)  5/5The fish came out piping HOT.  Unfortunately, a small fish was divided by three so one piece per person.  The bones were deep-fried to a crisp which all of us enjoyed.  Executed very well.7) Lobster Sashimi  5/5Live Maine lobsters were prepared in front of us.  They were served in front of us which one of our friends squirmed.  The meat was firm and very flavorful.  It was shared between 3 people so each person had about 2 pieces of raw lobster.8) Assorted Nigiri  5/5We were given such fresh ingredients of HOTATE (scallops), UNI (sea urchin from Hokkaido), KANI (crab) with KANIMISO (tamale) and HOBO, or Sea Robin.  Each piece of sushi was so darn good!  Lucky for me, David T. doesn't eat UNI so I had his piece.  SCORE!!!  Morio hit 4 home runs with this selection!9) Deep Fried Baby Octopus  4/5These little suckers were also cooked until perfection.  When you overcook seafood they become tough, chewy and dry but these suckers were tender and delish!  I only had a piece and gave my share to David T. as he gave me his UNI nigiri.   10) AMAEBI (Sweet Shrimp)  5/5Who doesn't like head?  They were lightly floured and deep-fried until crisp.  Low on calcium?  Have some head Yeeps!!!  The shrimp had a firm texture loaded with flavor.  So fresh!!!11) Lobster Miso Soup   5/5This time the soup was PIPING HOT, the way miso soup should be.  The broth was so bold in flavor and what a way to end this OMAKASE dinner.  Pieces of the lobster were in the soup so you could eat whatever meat you could find.  Very tasty.As complimentary dessert he provided us with MINI drumsticks, either vanilla or chocolate.  What a nice touch for sweet tooths like myself.It's still BYOB here and throughout the night patrons were offering Morio SAKE and SOJU.  There are still 2 seatings (6pm and 830pm) and I'm not sure if Chef Morio was a little buzzed or not.  The atmosphere is considered \"rated R\" so expect some f-bombs being tossed here and there.  After tax, the meal came out to about $64 per person.  Add on tip, expect to pay about $76 per person where alcohol is NOT included in meal.  In addition to great food, the night was shared with 8 other fellow Yeeps, who I have developed great friendships with.Good food.  Good company,  Good times.  Good memories.Thank you Chef Morio and staff.  But more, thank you Victoria M. for being instrumental in convincing me to give this establishment another chance."], ["Sasha L.", "Thanks to my friend Liz, I've had the opportunity to go to Morio's since he was located in Waikiki.  Hands down the most well rounded Omakase ever.  My friend asked for the \"fancy\" Omakase for our group of four and we were lucky enough to sit at the bar!  I like that Morio's isn't fancy, but rather it feels more cozy.  BYOB and don't forget to pour Morio a shot!  I will include photos to show how amaaaazing this meal was! I can't wait to go again when their reservation list opens up!"], ["Peter C.", "I finally can say that I dined at this hole in the wall gem, which I have been trying to get into for some time.  As you probably have read from other reviews, reservations are made 3 months out and you have to call exactly on the day reservations open up to ensure you get a table.  There are two seating times, 6:30pm and 8:30pm.  I prefer the later reservation time because you can dine till late at night without the feeling of being rushed.I order the suggested pre-set omakase menu, which was a great deal for $60.  See my pics.  The plus to coming here is not only the great food, but it's BYOB. Morio and his staff will drink with you so feel free to bring something for them.  This is a great hole is a wall place for a deal of  price.Note:  Make future reservations while you dine here."], ["Ryan K.", "What can I say about Morios that hasnt been said in over 470 prior reviews?  Not much,  but heres my rundown:If you like head... amaebi head that is, then this is the place for you.If you like lobster sashimi, ankimo monkfish, abalone, oysters, ika, uni, negitoro, saba, flounder, moi, hamachi kama, tako, and assorted sashimi, and sushi then this is the place for you!  The chicken karaage here is good too, but if you dont like seafood then dont waste your time and another persons valuable reso coming here.  Its high quality Japanese food / seafood at a great price for what you get! You must make resos 2-3 months in advance, sometimes more... no joke!  The place is small and is not good for groups larger than 6, so plan accordingly.They also have a pre-set omakase menu, a great deal for $60.  If you want this, you must order it in advance.  If you want Lobster sashimi, you should order it in advance too.Its BYOB, so bring beer and good sake and you must share with Chef Morio and his staff.  Morio will sit and have a drink with you if you ask.And last but not least, if you are celebrating a birthday or have a newbie in your party, ask for the \"snake alcohol\" shot (see my pic).  Ive tried it and survived...barely. Parking is in the back lot of restaurant or on the street.  The restaurant is on King Street right before Jack-in-the-Box on Piikoi Street.Its a pain to get in here, its a hole-in-the-wall place,  but I am giving 5-stars for the price and quality of food."], ["Paolo F.", "Can't really add anything more than all of the glowing reviews already written. They're all right!  Morio's is a reflection of the man himself and he's truly genuine in his desire to please his patrons. Don't be shy. Interact with the other patrons (and Morio of course) it's very much a cosy intimate gathering of people rather than individual parties. (That and if they have sake, they'll share!)  Easily the best dinner experience my wife and I have had. We were lucky and got a reservation for two only three weeks out. Currently the website lists 6 weeks out. 10th anniversary. A special dinner indeed."], ["Liana H.", "I had the privilege of eating here one day and there are no words to grasp just how awesome this place is. The overall restaurant is small with maybe like 15 seats max. Although this doesn't allow for more reservations a night, the limited seating ensures that each table gets Morio's personal attention. More importantly though, it gives patrons a chance to talk to actually talk to him and realize how hella funny he is. Not only him though, but his staff too. They were cracking jokes all night and I was constantly laughing.  Okay and now lets talk about sushi. His sushi was probably the best I've ever had in my life. Everything was so fresh and melted like butter in my mouth. We tried probably everything he had that night like: ama ebi, uni, toro, oysters, baby octopus, hamachi, and much more that I can't remember. But the best and most interesting thing I've tried their was something called \"ankimo\". Its monk fish liver that tastes like seafood foie gras. It came in a pate form and it was AMAZING. Definitely give it a try if you like that kind of stuff. If you love sushi and love a good laugh definitely give this place a try. Btw it's BYOB so bring lots of drinks for you and Morio and his staff. It'll make it feel like a party=)"], ["Inthira M.", "I used to go to Morio's for every special occasion, but then one day I called and they said they were booked through the end of the year, and then I called back and they said they were full until summer... and then I called back and they said they'll start taking reservations around a certain time of month for the next 3 months.  So, I decided to be more diligent and marked my calendar off to remind me to call.  The day they started taking reservations I called.... and called.... and called.  But finally got through and was able to book a few reservations.  I had to call back again as they could only take two at a time as it would be unfair for other people calling (legit reason).  Finally the day arrived and I was so excited!  We chose the omakase.  A little after 6:00pm the doors opened and they started seating everyone.  They already had waters and edemame out on the table for everyone and they started promptly serving us.  We had a grilled Hamachi collar, chawanmushi, ocean salad, another type of fried fish (so good, but I forget what type of fish), assortment of sashimi, fresh lobster tail sashimi (killed right in front of you... cool!), oysters (1 per person), ama ebi, and then he started serving us nigiri sushi.  He takes suggestions, but the best fish he gave us was the blue fin (at $20 for 2 pc nigiri it was worth every penny!).  Whenever you're full you can say to stop otherwise he does last call around 8:00pm and the meal ends with a soup made from the rest of the parts of the lobster.  You pay per dish for the omakase.  The bill for (2) came out to about $180.  A little more pricey than I remember, but for omakase I'm sure he wants to give you the best cuts of fish that he got that day so do you blame him?  Can't wait for the other reservations I have!!"], ["Emi H.", "My fiance finally popped my Morio's cherry. And unlike the first time for \"other\" things, this one did not disappoint! There's a four month wait list at Morio's and as fate would have it one of our friends had a reservation but gave his spots to us because he wasn't feeling well. We showed up for our 5:30pm reservation only to find out that he had given us the wrong time and it was actually for 8:30pm. Dismayed we returned home and came back three hours later.I'll be honest in saying that I wasn't expecting much from Morio's because reality rarely lives up to the hype in most situations, but I had the BEST TIME I've had in a long time! Not only is the food fantastic but it's a STEAL! We ordered an array of sushi, sashimi and hot items. At the end of our meal we were stuffed and including tax + tip our bill came out to $40 for each person in our party. Are you kidding me?! That's pure insanity.Morio's is not just great because of the food but the service is stellar and Morio himself makes a really fun drinking buddy! This is the blessing and curse that is BYOB. You drink more than what you'd usually consume at a restaurant because you're the bartender. I wasn't planning on drinking much when I got there but somehow I got carried away somewhere between glasses of red wine and shots of sake with Morio. You know the saying, \"When in Rome, do as the Roman's do.\" Well in this case it's \"When with Morio, do as Morio does,\" and you had damn well better be ready to drink, drink, drink, drink, drink. I'm not the young belle of the ball I used to be and I can most assuredly tell you that it took me a good two days to recover from my Morio induced hangover. How do you do this two seatings a night Morio? Tell me your secrets and I will make an infomercial for the masses. Next time we've decided we're going to reserve the entire restaurant,16 seats total, and it's going to be on a Friday night so I have Saturday and Sunday to recover. If you have the chance to get a reservation, visit Morio's and bring lots of friends who love to drink. Be sure to bring lots of sake to share with Morio. You will have a blast!"], ["Alan V.", "Nestled in McCully on S.King St is this very personal sushi joint that should not be judged by it's appearance prior to entering.  Permanent sidewalk residents a few feet from the front door does little to affect Morio from getting his tables booked a year in advance. Counter seats provides a very personal experience for curious eyes guessing what the Master has in mind for his salivating guests.  You won't be disappointed with any dish placed before you where prices are  determined by the current market.  BYOB and do show your appreciation to the Man and his staff who do not show any effect of the tremendous amount of sake that they so politely accept throughout our 6 o'clock seating.  I'm certain that after the 8:30 seating departs a private party continues to who knows when. Kanpai!"], ["Sam Kwang P.", "Where do I begin??? We didn't even look at the menu because we were there for a special event and omakase was what everyone ate. And let me tell you additional items were not necessary! There's a reason why this place is booked solid for 3 months. This food was a gustatory revelation. We started with edamame. Simple enough. But then out came the Hamachi kama. SO TASTY. SO JUICY. No shoyu needed. Then out came Canadian oysters....made Yanagi sushi oyster shooters look like garbage. Deep fried flounder with ponzu next. Crispy bones like potato chips. Then a sashimi platter to DIE FOR!!  LOBSTER SASHIMI!!! And then several types of sushi maguro, Hamachi, salmon, clam, amaebi (with deep fried heads), A few others that I didn't know but still was so good, so fresh. And then the piece de resistance..... LOBSTER FUCKING MISO SOUP. the broth was a miracle. SOOOOOO MUCH LOBSTER MEAT!! THE STUCK A WHOLE LOBSTER IN THE BOWL!!!! and then when you can't take anymore... The very attentive waitstaff asks chocolate or vanilla??? And you receive a drumstick Lmfao HIGHLY RECOMMEND THIS PLACE!!! As far as I'm concerned this is THE BEST SUSHI IN HONOLULU."], ["John N.", "Hurray! I was finally lucky enough to try Morio's Sushi Bistro!Morio-san has eluded me for years. His reservation list is often months long and I now can see why. This spot easily represents the best of what Honolulu has got to offer.I came here for a birthday party of a fellow Yelper along with many other awesome Yelpers and friends. There is nothing better than great company and food. There is ample parking for everyone in the back since the restaurant isn't too big. Our whole party went omakase!Starter salad and edamame - It is like Morio deliberately lets you down with the first 2 items because, worry not, everything else that comes out is good. This is your standard greens and sea salt edamame.Chicken Wings - Its fried chicken wings and drumsticks. Standard appetizer fare.Hamachi Kama - Large piece of hamachi collar. Not the best I've had but one of the top 3.Sashimi Platter - Easily one of the best I've had. Every piece was obviously fresh, well cut, and simply delicious. My favorite was the salmon and hamachi.Lobster Sashimi - Lobster tail sashimi with rest of the body kept alive. The lobster is still moving and while some people might be skirmish, this represents how fresh the sashimi is prepared. This was my first time trying it and I loved it! The texture reminds me of shrimp.Deep Fried Flounder - Best fried flounder I've ever had. It is smaller than other restaurants that serve the same dish, but flavors are much better. The flesh is completely moist. Remember to eat the bones like chips!Hamachi and Salmon Nigiri - Two of my favorite fishes! Fresh and delicious. Not the best I've had but very good. Perfect amount of wasabi between the rice and fish. Also, the nigiri was served in a very proper temperature.Asari Drunken Clams - A Japanese favorite dish. The flavors are subtle which allows you taste the natural flavor of the clams. Clam sizes were smaller than average. Uni Nigiri - The amount of uni was quite generous. Not overly rich and sweet like some places,  but just right. If you have the same taste I have, you would definitely enjoy Morio's uni.Ebi Fried Heads and Shell - Eat the shells like chips then chomp on the head. Not a large fan of the shells, but I love the heads! I mean, who doesn't like head?Ebi Nigiri - Since the heads and shell is used in the previous dish, this is what is left over(or originally intended). Love Morio's ebi. Just melts in your mouth!'Negitoro Maki California-style - Negitoro didn't have the usual negitoro flavor. Forgettable.Lobster Miso Soup - As said in countless other reviews, the lobster, minus the tail that was used for sashimi, is made into Morio's famous miso soup. This was the highlight of the meal. Morio's Sushi Bistro represents what's great about eating out in Honolulu. In big cities, the restaurants that are normally booked for months are either highly regarded, expensive, top of the class, type restaurants. Morio's is different. It is a small restaurant, serving great food(although not top of the class), inexpensive, and with great service."], ["Dex N.", "This is a great little sushi bar!  Prices are very reasonable; however, because of the limited seating reservations need to be made several months in advance.  What makes this sushi bar even better is that it is BYOB.  We ordered the omakase and wasn't disappointed.  Dinner started off with a salad, fried karei and Hamachi Kama.  The nigiri sushi offered aji, salmon, tai, hamachi.  The sashimi platter included lobster, maguro, mirugai, and salmon.  Once the lobster sashimi is finished, the lobster head is taken back to the kitchen to become miso soup.  Of course you cannot eat sushi withou eating some uni!  The portion sizes were generous and I think prices are very reasonable...way cheaper that Mitch's and the quality of the seafood is not much different.  I think you can probably walk away from this place satisfied for about $60 versus $100+ at Mitch's.  It's also better to go in as a pair because you'll get more lobster from your omakase dinner.  I think bigger parties have to split fewer lobsters..."], ["Diane K.", "A friend took me to Morio's first location years ago and it was such a memorable experience.  I haven't been back since because I could never get a reservation!  I had originally planned to take my parents here for their anniversary in March, but May was the earliest and I called in FEBRUARY.If you want to try this spot, their books are filled until August.  In a day or two, it'll spill into September.I took my parents here last night to celebrate my Mom's birthday.  I've been raving about Morio for years and was thrilled to finally share the experience with my family.  Everything was AMAZING.  Freshest fish that MELTED in my mouth.  My FAVORITES:- Mix Fish Poke!  Oh dear!  This is heavenly!!!  *** MUST TRY!!!  This is a special, so look out for it on the white board.- Hamachi and Onion roll- Sashimi OmakaseThe two tables next to us made their reservations IN AUGUST almost instantly after they took their first bites.  Seriously, get on Morio bandwagon NOW!!!  Soon, it'll be more likely to travel to the Moon than snag a reservation!  Don't be foolish, make the call!It's BYOB here, we brought a 6-pack of Kirin Ichiban (my favorite beer) and shared it with Morio.  He really is the sweetest man, I love him!"], ["Emi L.", "Can't eat here without a reservation (months in advance, but it's worth the wait!).  And do not leave here without getting the Hamachi Kama & Lobster Sashimi!!  Trust me.  But call ahead of your reservation if you want to get these items, as Morio needs to know ahead of time before he goes shopping if you want to get these.  (But already included if you're doing omakase--so only need to call ahead if you're doing ala carte).The Hamachi Kama melts in your mouth & when I come to Morio's I usually get one order just for myself!  The Lobster Sashimi comes out so fresh (as in, the lobster was probably alive a few mins earlier) & it's moving around on the plate while you eat the sashimi!  Ours seemed like it was trying to crawl off the plate, no joke.  This order of lobster sashimi comes with lobster miso soup to conclude the meal, which is equally as delicious.Also, BYOB & make sure to bring extra sake for Morio!  He'll love it."], ["L L.", "Disregard this, tried to edit my review for our dinner Saturday 9/5/15 and somehow hit updated review by mistake.  Please refer to my previous review which has been edited.  We have only been to Morio's once so far.  Gomen Nasai."], ["Mark H.", "After reading much fanfare, I came here expecting great sushi, and Morio did not disappoint... Me and my friend sat at the counter for the omakase.  I was charged a bit higher than my friends and other yelpers have reported ($62.50), but when I consider the courses offered, this is still a good value.  Morio's is def the best bang for the buck!I recommend sitting at the counter if ordering the omakase as you can interact and engage in conversation with Morio.  This enhances your overall dining experience because it adds a fun factor.While we brought our own bottle of sake and shared with Morio and Jacie, they still offered us beer.  Awesome!  I am definitely going to bring ample alcohol the next time I come (in March--booked it while dining).  You rarely find this in a byob establishment where they provide alcohol to you so that you can enjoy yourself more!Why 4 stars and not 5?  Problem is Sasabune set a high bar for a 5 star rating for sushi....Tip: come with an attractive female.  I didn't and I think it would have came with added benefit!  LoL!"], ["Andy S.", "Writing about this place doesn't make it justice. Sushi is fresh and prepared with love. Staff is friendly and Morio is just an amazing host!! A must if you are in Oahu."], ["Philip T.", "Great sushi here.  I didn't particularly like the lobster sashimi  but everything else was so good!  Enjoying every morsel I ate everything I or the chef could think of. Fresh seafood right out of the styrofoam containers.  We ran out of our sake and the chef offered us his cooler of  beer  and even his ice cream bar in the house.  Seating is tight and reservations ha ha ha   Good luck!"], ["Alysha K.", "Morio's is not just about the food, it's a freakin' experience! I had the 8:30pm seating and didn't leave til almost midnight! It was such a blast!Tips & Recommendations:*There are only two seatings: First one at 6:30 (I think) & second one at 8:30pm. I highly recommend the 8:30 seating because 1) the 6:30 one you have a time limit and can only stay for 2 hours. 2) 8:30 gets personal ;)*It's a tiny ass restaurant that can only accomodate ~20 people (only 4 at the bar) so make your reservations a month or so in advance*If you can, sit at the bar so you can have more of a one-on-one interaction with Morio*BYOB and share with Morio and his staff! *Get the omakase - we had fried ahi rib cage, sashimi platter with live lobster, lobster miso soup, sake clams, nigiri plate (toro, uni, aji, salmon), and ankimo. I was soooooo stuffed! He offered ice cream but I could not do it.*If you're a boy, bring a lady! You get bonus points ;)*Prices are so reasonable! For two of us our bill was only $93!*Know the Gangnam Style dance. That is all ;)"], ["Liana F.", "Hmm. I've waiting 4 months to come and dine in at Morio's. I still don't get what the hype is all about. I came here couple nights ago for my birthday and i wouldn't say this is the best place for sushi. I've had better. Quality of their fish isn't quite there, but staff and Morio, of course was very friendly. Ordered most of the popular dishes here and it was decent. My favorite dish was the hamachi sashimi.  Other than that, the price is reasonable! I'll come back again, but def not worth the wait."], ["Jacob N.", "If you get to dine here you're lucky. Not because it's extremely expensive, or a members only place like Vintage Cave, but because they're always fully booked!OH YEAH!!+ Fresh ingredients+ Attentive staff+ Morio himself+ Reasonably priced+ Great omakase spread+ Cozy, personal atmosphere+ BYOB+ \"Best (Amaebi) head in town\" OH NO!!- Very limited seating (about 2 dozen seats)- Always fully bookedOh My!?~ The restroom out back has a ridiculously tiny sinkI've been fortunate enough to dine at Morio's several times and each time was great. Most times I had the omakase, or chefs recommendation. This is a predetermined meal of assorted dishes selected by the chef. No thinking or decision making involved, and you get to try a nice variety of things. If you're interested in this you'll have to let them know ahead of time, like when you book your reservation, or at least a week before should probably be ok. Each time I've gone with the omakase option it came out to roughly $60 per person. Not a bad deal! Keep in mind that process will vary depending on which cuts of fish and other seafood is used, and if you have any special requests to add on. A typical omakase meal here starts off with a green salad and edamame followed by a pan fried hamachi kama (collar). You'll probably get an assortment of sashimi, live lobster sashimi and some asari (Manila) clams in a light broth. Yes, that's right. I said live lobster. The thing is still moving around as you eat the tail meat (for that dish you only eat the slices of tail meat). Now that's fresh! I know some people who don't like this dish because of that, so if it bothers you I'm sure you can ask for the moving parts to stay behind the counter with Morio. Towards the end of your omakase meal the rest of the lobster will revisit your table, but this time it'll be chopped up and cooked in your miso soup, but before that you'll be dredged up an assortment of nigiri sushi. Lately there has also been simple desserts offered at the end of the meal. Just something small and sweet like a Good Humor type drumstick, or a fresh cold slice of watermelon.You can also just order things off the menu if you know that you want specific items. Keep in mind that although the ingredient are fresh, and the dishes are wonderfully prepared, it's not mind blowingly out of this world. It's, for the most part, relatively \"traditional\" Japanese sushi and sashimi. Some have written that out lacks the \"wow factor\", but to me that \"wow factor\" isn't really needed here. It's perfectly fine the fine it is. Where the simplicity is what's amazing. They don't serve alcohol here, so it's BYOB, so be sure to bring some cold beers and sake to enjoy with your meal. Also, don't forget to bring something for Morio and the staff too. They really appreciate it. In case you're planning to follow that little bit of advice Morio likes drinking Heineken, and Miller Lite, but his favorite is Echigo. He also likes dry sake the best. The wonderfully fresh seafood, and the BYOB goodness aside the thing that really makes Morio's Sushi Bistro one of my favorite restaurants is the man himself, Morio. If you get to sit at the counter and chat with him you'll find him to be a very funny and entertaining guy. As long as you've got a sense humor I think you'll enjoy the conversations. However, during the first seating of the night Morio and crew are usually a bit more serious since they're under some time constraints with having to serve everyone in the first seating with enough time to get the place reset and ready to go for the second seating a mere two - and - a - half hours later. During the second seating everyone is usually more relaxed and things more easy going since they don't have to worry about getting the place ready for another seating afterwards. If you're thinking that you want to check the place out you'll need a bit of luck on your side. Currently they're completely booked through September, and won't be opening reservations again until maybe some time in August (is June right now!). You can also try giving them a call randomly to see if there were any cancellations. Sometimes it happens, so if you try for that may the odds be ever in your favor!If you do manage to land a reservation and need to fill a seat, let me know. I'd be down for another visit to Morio's!"], ["June K.", "I LOVE this place! First of all, you wouldn't expect to find such an amazing establishment on a bustling King Street of all places, right next to a Jack in the Box. But trust me, it's there and if you want to reminisce your memories of Japan, this is the place to be. Second, this place was BYOB! Sake all around please.  Don't forget to serve the chef!We parked on the street not knowing there was a private lot, but didn't want to move our car.  A friend invited us to join their group, but you can try your luck to walk-in.  Goodluck! As the wait will be 3 months long....  Our friend made the reservations in November 2014 for January 2015 and we were only able to get the 2nd seating at 8:30pm.  The sushi quality was excellent, while being reasonably priced.  We ordered omakase and the chef did not disappoint.  To start off, the staff served edamame during our wait.  The first dish to arrive was chawan mushi, and it was the best! So smooth and flavorful.  Next was the hamachi kama fried to perfection.  The chef served a whole lot of mouth watering sashimi, amaebi, abalone and live lobster.  The amaebi heads were fried crispy.  We were served hotate and kani as well.   Everything was so fresh that the lobster was still moving!   I'm sucker for eggplant and the chef served a batter fried eggplant with citrus tartar sauce, which was unbelievable.  We also ordered fresh oysters and buttery blue fin toro.  If you've never had blue fin toro, it's better than yellowfin!  The last dish was the lobster miso soup.  Everything was delicious and I could eat it everyday.The max capacity at about 16, which is good size for the chef to manage.  I don't want to share this place with anyone! But it's not a secret anymore as you can tell by all the reviews of this place."], ["Kahoku T.", "I have never heard of this place before until my cousin had called me up literally 2 hours before the reservation. After reading reviews about this place and how hard it is to even get in, I can definitely see why now. The restaurant seats about 14 or 15 people at a time. They have 2 seatings at 5:30pm or 8:30pm so they would only be able to feed about 30 people per night. We had the omakase (set menu served) which is like a 10-12 course set menu that the chef serves to you.The service is great which can sometimes make or break one's experience, but the one waitress who was serving and Mo (Morio - the sushi chef) is one character. Always cracking jokes and talking stories with us like we've been friends for years. The food was out of this world. This was the first time I've tried uni (sea urchin) and natto (fermented soy beans), which are delicacies in Japanese cuisine. It was fresh and delicious and I couldn't have imagined it tasting that good! He brought out live lobsters and opened it up right in front of us and served lobster sashimi while the rest of the body was still moving... SO COOL! Then he roasted the shell and remnants up in a miso soup. OISHI!The restaurant is casual and very small, so don't be afraid to wear shorts or even slippers. It really is all about the food! Don't forget that this place is BYOB! And please please don't forget to share with chef Mo, cuz he'll be your best friend. This is no ordinary sushi place, so don't expect a genki style conveyor belt. The omakase menu is probably about a half compilation of sushi, unless you order more sushi off of the menu which we didn't do. We had brought our own sake and umeshu which we ended up sharing with Mo, who gladly shared his as well throughout the night. Such an awesome experience that would definitely be worth the wait.The approximate wait for reservations would be about 4-5 months, so be sure to book early!MAHALO MO! We'll definitely be coming back!"], ["Ward K.", "If you love fresh sushi and I mean fresh, so fresh that you would swear that it was still moving on the plate,(in some cases it will)  then you will LOVE this place!  We ordered the lobster sashimi  and I swear it tried to get me with it's pincher.  Yes the buggah was still moving.  Now that's fresh!This place is BYOB and there is no corkage fee.  Like how others have written, it is a good idea to share your liquor with Morio and the staff as it makes them happy and a happy chef will make you happy with his creations.  Everything I had tried here is a winner and was an OH MY MOMENT!!!  I'm starting to drool just thinking about the ultra fresh hamachi and toro just melting in my mouth!  I took Dave F recommendation of trying the chicken karaage and the tofu for starters and yes it was an excellent choice.  I highly recommend that you call ahead and make reservations as they have been known to be booked as far as two weeks out since it is a small place.  Yes dial these digits (808) 596-2288 and make your reservations now. WHY ARE YOU STILL READING?!?!?!  Hurry up and just make your reservations.  WAIT, there are two seating times: 6:30pm or 8:30pm so if you even have the pleasure of choosing a time (yes it is that good so take the first one they can give you).  Make sure you arrive promptly as they might think you are a no show and give your seat away to someone like me that is praying for a no show and to take your place (don't say you haven't been warned.)  lol  If you're the early seating, expect to finish your meal by 8:15pm so they have time to clean up for the 8:30 seating.  I prefer the later seating so you don't feel rushed.  Tips: 1) Make reservations!2) Bring some drinks and share with Morio and the gang.3) Especially if you are going to the 8:30 seating and you know what you want it is best to tell them so they can \"try\" and make sure they have it for you that day. Things like their specialty items, lobster, crab, and certain types of sushi you might like to eat and of course if you want an omakase platter. 4) Make sure you are not in a hurry as Debbie R pointed out.... \"This is a dinning EXPERIENCE\" and not some fast food place to eat and run.  Plenty of parking, great food, awesome service, this is five stars in my book all the way!!!"], ["Darren M.", "This place is amazing! You definitely get your money's worth! You have to make reservations far in advance but it's worth the wait. Omakase is the way to go! And lobster sashimi with the soup at the end. Winnahs!"], ["Nolan V.", "Sushi makes me SO HAPPY! Best sushi of my life. O yessssssssssssss sir.Wise master will tell you, plan ahead! Few months in advance! Call in.Be kind. Enjoy your food.Savor every bite.Think about it!Continue to eat.Enjoy your company.Best things in life, are things like this. Eating at Morio's."], ["Danny C.", "So before you get upset at the stars let me explain. This is second time to Morios and here is a break down of why the best part of the dinner yesterday was the byob sake. 1. Food was bad and I mean real bad. For the omikase price Morio is asking of diners I expected at least average to above average quality. The hamachi collar was cold, the cuts small and seemingly not fresh and the uni just topped it off as all I could taste was iodine and rotting uni.  This was a huge slide from the previous meal. For the price this should get one star, much much better places for that price point.2. And this bothered me more. It was a mainland guy who made the res for 6, last time I was there with the same amount of people and we got twice the amount of sashimi and 2 lobsters for sashimi. The only difference was I went with a local family last time. I think this a slippery slope, I mean sure an extra order of collar or tempura but one less lobster and sashimi platter for six people for omikase price, something wasn't right. We had to each grab one small piece if lobster and that was it.  Two star for valueSo there you go. Maybe it was an off day, but a couple more reviews like this and word of mouth will begin to spread."], ["Richard K.", "I have been here a bunch of times now, enough to give it a rave review. The food is great, staff is awesome and the times are always good.Eating here isn't so much as just dinner; it's more of a dining EXPERIENCE. The space is small and intimate. Everyone is usually in a good mood and the whole restaurant is buzzing, not confined to conversations at your own table but with the place as a whole. Eat at the sushi bar and enjoy joking around with Morio and the others at the bar or grab a table if you have a larger party. Again, this place is small so make reservations (pretty much required unless there is a cancellation). BYOB is definitely a plus and encouraged. Don't forget to bring some for the staff and Morio. Sharing is caring. So far, the sashimi omakase is my favorite. Red dragon roll is also ono. Still have yet to try the lobster tail but heard it's as fresh as can be (ie. still alive). Complimentary appetizers are also nice to get yourself started while you're deciding on your order and popping open the drinks."], ["Sophia M.", "I truly enjoy this establishment!! I have attended a few birthday celebrations as well as coordinated a girls night out that was fabulous! Definitely recommend to try the omakase ....you will not be disappointed. The prices are extremely reasonable, the quality of food is excellently prepared, atmosphere is relaxing, and I leave here fully satisfied every time.The restaurant is very small but i like that intimate arrangement which probably allows the chef to make sure everyone is happy. Chef morio will make jokes and the waiters are extremely attentive. You do have to make reservation in advance...I think they have seating for less than 25 people at a time so space is limited. Many acquaintances of mine will reserve the whole place on a monthly basis for the 8:30 seating so that is probably why it is so hard to randomly enjoy but I have requested them to contact me if they had a cancellation during a week that I had a friend in town and I was lucky...they phoned! We got a table for 4 and had a blast!If you want to enjoy alcohol, make sure you BYOB! Also, there is ample parking in the back.  Highly recommend!"]]}