{"To Thai For": [], "Thai Chili": [["Eric G.", "I'm so glad I just noticed this new Thai place to the area. It has a nice Thai atmosphere and clean. The service was friendly and accommodating to special requests. I ordered a red curry dish vegetarian style. My order arrived quickly and it was very good. It was very authentic Thai curry like the kind you get in Thailand. I look forward to trying other dishes in the future. I will definitely be back. Don't believe the haters reviews. This place is a must try and very friendly and accommodating."], ["Jenel O.", "Thai Chili is a relatively new Thai restaurant located on Kapahulu near Yakitori Glad. The owner is the same as Nana's Deli in Topa Tower in downtown.The stars of the show here are their noodle dishes like pad thai and pad woon sen as well as their pad ga-prao (I've seen this as pad ka pao in other thai restaurants). The food seems very authentic and also not as oily as other places I've tasted. The curries and stir fry dishes are $13.95 each and come with your choice of rice (including sticky rice as an option at no additional charge).The other dish that didn't disappoint is their green papaya salad, it's really tasty! It's $8.95 and the serving size is a little on the smaller size but the quality is on point.Nana is just the sweetest server - I used to go to Nana's Deli when I worked in downtown and I remembered her sweet demeanor from there. Service is great and fast.Parking is located in the back of the building. They have a small lot as well as a small (tight) structure. The directions say to pay the pay box but if you tell Nana your stall number, they will make sure you're covered.Don't forget to follow their IG account @thaichilikapahulu for new dishes, specials and more!"], ["Ryan K.", "Just a few doors down from Yakitori Glad on Kapahulu Avenue is a new Thai restaurant called, \"Thai Chili.\"  When I gave them a try, they had only been open for a week.  Like their name,  a number of their dishes have a nice spicy kick to them.  Its not anything too overpowering, so those who cant handle the heat need not worry.I tried the Green Curry with Chicken and Bamboo Shoots, Pad Thai with Tofu, Fish Patties, and Thai Iced Tea.  Everything on the menu was flavorful and delicious.  However, I thought Fish Patties were quite tasty!For dessert,  I tried the Tapioca and Sweet Corn.  Ive never had anything like this before.  Its almost a guilt-free dessert simply because youre eating lots of corn in your dessert.Portions were generous and I had leftovers for lunch the next day. The staff was very nice as well.  Like many Mom & Pop eateries in Kapahulu, its street parking on Kapahulu Ave. or the surrounding side streets. I enjoyed my Thai Chili experience and Ill be back!"], ["Daniel G.", "Moved into town recently, and was looking for a decent Thai restaurant to eat at near my apartment. I found Thai Chili while on a date with a friend, and fell in love with the food and service. The owner, always greets me with a smile on her face, and goes above and beyond what is expected of her as far as customer service. Her food is genuine Thai, not like many of the \"posers\" that have graced Kapahulu Avenue in the past. If you're looking for a great meal, for a great price, with even greater customers service - please, visit Thai Chili! You won't regret it!"], ["Ou S.", "Came here on a Friday evening for dinner. We made reservations for 5 at 8pm. We all arrived at exactly 8pm. The restaurant was full and was told that we had to wait another 15-20mins. Luckily, there was a really nice couple that was on a date and moved their table allowing my party of 5 to sit. It took 15 mins for us to order our food. There was a couple that arrived and was seated at a dirty table with dirty dishes. We were served part of our order and didn't even receive water. We had to ask for water and waited another 10 mins to received our water. This place needs to hire another employee to deliver service. There is one cook and another employee who does cashiering, busing, ordering, and serving the food. All of this waiting and horrible service, only turned out for us to enjoy mediocre Thai food."], ["Piper O.", "My girlfriend and I come here for take out all the time, even after moving out of the immediate area. There's no other place we would rather go for Pad Thai Woon Sen (with beef of course!). Take out usually takes about 10 min after ordering and is always fresh and delicious. The service is always amazing too. Come see for yourself!"], ["adam m.", "Outstanding thai food. U can walk or cab it from Waikiki.  Worth the effort compared to the mediocre thai places in Waikiki."], ["J D.", "We had our worst Thai meal ever.Most of the reviews were favorable which is why we went there.Our curry (yellow, very sweet and off-tasting with questionable shrimps) was served first with soups and a delicious roti; Tom Yum soup had white mushrooms in it and tasted nothing like the real thing; american spicy looked like they used red pepper flakes instead of real thai chilis and tasted like an italian soup; the chicken was well cooked; soup was edible. Thick coconut soup was barely edible.Another problem came when the sticky rice was served 10min after curry had been on our table (cold by then) and rice was mostly hard. We were surprised they even served it. Its like we were eating uncooked grains of rice.Overall way over priced for what we got. Portions average. Service was okay.May we recommend Mauna Kea marketplace (think its called Tuk Tuk Thai) for lunch. For dinner options, may we recommend Thai Kitcken in Waipahu, Thai Lao in Kapolei and Siam Palace previously on Waialaie opening soon on Kapahulu."], ["Jalin T.", "Delicious Food! Best Thai Food I had so far and the service is excellent :) Nice amd sweet lady, I'll come back the next time I'm in Hawaii!"], ["Mindy S.", "I usually save the energy when writing a bad review but I thought I should save you the trouble when trying to decide where to eat Thai FOOD. I'm From Thailand and lives in California for over 25 years. I'm very disappointed in this place - everything from the service, management and food quality. Many folks on yelp is raving about the food here but I would disagree. It was too bland to be called \"authentic\" Thai. For the portion size, they need to lower the price by $1-$2 and For the LACK of Customer Service, another $1. This restaurant needs a complete reassessment on operation and management in spite of how nice the 1 Lady who works in the front by herself. This is NOT a good place to eat with a family, a date, or if you are in a hurry. They DO NOT have a BATHROOM for Customers - Use the bathroom before you dine here!!! The STICKY RICE came way after our 3rd dish and the rice was COLD and HARD. :( so many things went wrong here. Save yourself the trouble and eat somewhere else. IT's TOO SMALL for dine-in. Probably capacity is 10-12 comfortably but still lacks workers."], ["Cindy L.", "I placed a take out order for Thai red curry with shrimp.  I was utterly disappointed by the quality. It was $12 for a watery curry with no substance.  In addition, the container for the curry was burnt, so you can taste the plastic every bite.  It was a lemony plastic detergent taste. Yuck!  I was hoping that this could be my quick dinner fix stop, but obviously Not going back."], ["Cat K.", "Very authentic, super nice people, delicious food! Eating in you get your meal served in dishes with silverware! My favorite is the Pad Thai. I've tried almost everything and it's all yummy!"], ["Cassie H.", "Amazing service and food. Server even gave us free dessert! I am from Michigan and had a local friend take me for dinner."], ["Ivy Lou H.", "Thai Chili is located on Kapahulu Avenue but it's in a tucked away spot so it's really hard to notice it.  I've driven past it a million times and if it wasn't for Yelp I'd have never found it.  It's just a small little cafe with a few tables and it's nice and clean.  The owners and staff are very prompt and friendly and you can tell that they take care of their customers and value us.  The food is good but not great.  I'm picky when it comes to Thai food and I found the Panang Curry here to do the job just fine but it didn't blow me away.  This is a good option if you're in Kaimuki and need some Thai food to go."], ["Lan F.", "I was so not impressed with the food. I was looking forward to some good Thai food, but it was not to be had at Thai Chili, unfortunately. We ordered two curries which were pretty indistinguishable other than a couple of ingredients. The consistency of the curry was liquid, like broth. I was picking lemongrass out of my mouth with every spoonful. The pad thai was a little gooey. The tom yum soup was the worst--it was not yum at all. It was sweet and not in a good way. It was not a flavor I was expecting nor wanting. I normally love tom yum, but not this one...There was a couple who left after the woman had a bite of food. She had her hand over her mouth for a long time. We don't know if they paid or not, but if they didn't, who could blame them??"], ["Hun B.", "The owner is very nice and friendly, I ordered the papaya salad and larb and it was very good, great portions, I'm def going back"], ["Roxanne H.", "I enjoyed eating at Thai Chili and will be back to try different curries. I ordered green curry and a Thai ice tea. They didn't have brown rice, but the hostess (who was very kind) informed me that they will have brown rice in the future after they get more customers (they have only been there for 6 months). The green curry had bamboo and a  Thai eggplant (size of a small tomato). I did not think the curry was too watery as others have reported. Portions were plentiful, similar to other Thai places."], ["Mary Z.", "New discovered, it's a small family type business but have both good quality and quantity, 3 month old restaurant. I tried green papaya, Noodle with tofu, and Thai tea, yummy! As a Thai food lover, I recommend to all Thai food lovers!"], ["Katie T.", "Soooooo delicious! It tastes authentic and healthy...not super oily :) My boyfriend and I loved it.  The red curry was super good and just the perfect amount of spicy.  My boyfriend got the fried rice and loved it :) we didn't have any food left , we ate it all!!  The roti (like a pan fried smooshed croissant) was amazing...although i didn't get much of that because my other half inhaled it lol lastly the service was wonderful and kind.  My only suggestion is parking is hard to find, so maybe try one of the side streets."], ["Jaime C.", "This is one of my favorite neighborhood places!!! She is one of he sweetest ladies of all time and her food is extremely tastey and authentic. Go there and you wont be disappointed."]], "Siam Square": [], "S&S Thai Kitchen": [], "Thailand Cafe": [], "Thai Village": [["HighStandard S.", "Located in a neighborhood outside of Waikiki in a strip mall complex dense with other local businesses, this place is worth the drive. Good value: 2 appetizers, 2 entrees, 1 thai iced tea, easily enough food for 3= $41The special:My litmus-test Thai dish is fish cakes because it was something I was served at my first home-cooked Thai dinner, and it was unforgettably delicious and comforting. Most Thai places in the US do not have \"tod mun pla\" on the menu, so their very existence is always a sign of authenticity to me, and I always order them. Thai Village's tod mun pla comes closest to those homemade wonders I experienced 21 years ago. Just try them. Not spicy.The good:Huge servings. Shredded cucumber salad was refreshing and spicier than it looked. Evil Jungle Curry (creamy coconut red curry with an earthy base from peanut butter) with seafood and shredded cabbage was a winner. Dinning room is clean and bright. Parking is easy and free. The ungood:Lost a star because of rancid peanuts. I ordered Pad Thai made with wide noodles and was surprised when the dish came with no crushed peanuts on top. Perhaps because of the prevalence of peanut allergies these days, the peanuts are offered as an option. Each table has little jars of hot sauce and crushed peanuts. Nuts exposed to air go bad quickly, and the jars are not completely covered, thus the nasty tasting peanuts.As other reviewers have noted, rice is extra and \"medium spicy\" here = hot compared to mainland restaurants."], ["C.A. Ferreira T.", "Great food!  Ordered the usual suspects, spring roll, green  curry with shrimp, and pad thai with chicken.  Portions were just right for two hungry people. Tasty and just the right spiciness. Place is clean and service was fast and friendly. Will definitely be back!"], ["Brad P.", "Good food and a nice place to eat.  I will definetly go back again in the future."], ["Warren N.", "Went here for dinner. Had the Look Funn Pad Thai, eggplant with chicken and evil jungle curry with tofu. Everything was tasty and tasted great with the brown rice. the evil jungle prince was a tad salty, but other than that their sauces are very tasty and not overly spiced.What impressed us the most was the friendly wait staff and the cleanliness of the dining area. It was spotless!!! Kudos to the servers and staff for maintaining the place very attractive and clean.A good alternative to the usual Bangkok Chef fare in a convenient location with lots of free accessible parking in City Square.Next trip back will be to try the pho!"], ["Shannon C.", "I had lunch there this weekend with a couple of my girlfriends and we really enjoyed it.We ordered the spring roll, papaya salad (Lao style), look fun pad Thai with chicken and a shrimp dish with long beans (forgot the name of it). The restaurant was new and clean and the service was fast and friendly.  We will definitely be back again."], ["Sam M.", "Great aspects:1.  They give a lot of food2.  Take out was prompt while I waited.3.  Friendly wait staff4.  Very tasty foodNot so good:1.  Thai coffee was ok.2.  I ordered the food medium spice.  I can handle a lot of spice and man, this was SPIIIIICCCYYY.  So order mild.  I deducted 2 stars for that.  It was crazy hot.  I couldn't even eat the leftovers."], ["Avery D.", "i love everything about this restaurant. although the place is small, it is very cozy...i love their food specially pad thai and the sausage..."], ["Brooke M.", "Went back a second time and it was excellent again!  Their pad kee mao is perfect and the iced coffee was yummy.  The curry noodle soup I had on the first visit was so good I'm still dreaming about it!  They actually have four locations: this one, Waipahu, Waipio Gentry and Kunia.  Can't wait to try the garlic curry next time!"], ["Nealan I.", "Ran into this place a while ago. Glad to see it show up on yelp now. Really good food ( I recommend the curry pad thai) for a pretty decent price. Been goin here almost once a week. Sometimes twice. Awesome."], ["Brian L.", "hesitant to try it based on location. happily surprised at the meal.  This is one new place that we found via those groupon type deals.  we've gone back 3 times since.  The last, we were thinking about Ha Long - but just somehow found us sneaking over.  staff seems friendly - it seems to be getting busier and busier, which is bad for me - as i'm not a fan of long waits."], ["Carol W.", "Passed by this place and saw the grand opening sign so went in to check it out.  Ordered some chicken sa-teh, pineapple fried rice, and Tom Yum for lunch.  Everything was flavorful and the decor is nice and clean.   Menu is pretty similar to other Thai restaurants with the various appetizers, curries and rice/noodle dishes.  However, I still prefer Siam Garden on Nimitz as my go-to Thai food restaurant."], ["Ulanka B.", "Mmmmmmm, mmmmmmmm good so flavorful & yummy.  Timely & friendly service with a smile.  Not to mention it's all soo fresh, I had to push away from the table to keep from over indulging."], ["Cody C.", "It was just alright. Price was decent, service was good, but food was just alright. I've had better. It was more on the salty and greasy side."], ["EMILY H.", "I come over to order take out.  This is their 2 locations and their thai food are better than in bangkok chef locate across from best buy at Iwilei.  The pad thai noodles, pad kee mow, spring rolls, and panang curry are my favorite. :) Love their taste and good location where there are lots of parkings."], ["Franklin H.", "Went there twice only, both times for  Beef Long Rice Salad and Sticky Rice.  First time ordered medium, was a teeny bit too spicy, however flavorful, but needed to take home the rest.  too much to handle in one sitting.  Second time ordered mild.  Not spicy enough, but had chili you could add, but still very flavorful.  Best part are the waitress, so friendly and smiley, dressed in Thai influenced clothes which adds to the ambiance. Flat screen play video or had photo of artist singing in Thai.  Language is soft and easy on the ears.  From before, I like the Thai version of Japanese Enka, Yume Oi Zake, better because of the softness of the language.  Nice Thai furnishings, Silver Elephant, carved wooden Thai women, etc.  I think waitress told another they were actually Laotian, (which is same as Keo's and Phuket Thai).  Oh, was a bit skimpy on the rice though. Need to try other dishes, I know, but my weakness is for the beef salad, not barbequed, but most places don't seem to do it, except with Thai Kitchen, but they changed hands."]], "Thai Issan Cuisine": [["Inthira M.", "My journey with Thai Issan started off rough with me practically writing it off after two tries.  But, with my friend insistent that it was because I wasn't ordering the proper dishes that I decided to give this place another try... and boy am I glad I did.Ever since that third try I have been hooked!  What was it that I got that totally changed my outlook on this restaurant?  It started on a cold night where I was craving Thai food, but really didn't want to go to a place too far from my apartment.  So, I thought, fiiine... I'll try Thai Issan ONE more time.  So, with my friends suggestions in mind we ordered the Tom Kha soup with chicken, house fried chicken, and the fried rice with pork.  I've tried Tom Yum before and thought it was too sour, so I was excited to try this soup.  It was a pleasant change and I loved it!  I've gotten almost every time I've been here since.  The fried rice was a great accompaniment to the house fried chicken which is the star of the show and a staple with any of my orders.  I don't know what they do to make it taste so good, but it's a generous portion of fried chicken served with a sweet chili sauce that once you start eating it you can't stop (literally) until it's all gone.  Other things I've gotten that are great are the stuffed chicken wings (who doesn't like a stuffed chicken?) chicken larb, drunken noodles with pork (amazingly good), and my friend swears by their spring rolls.I can't wait for my next outing here to try other items on their menu now that I know this place is legit..."], ["Kai S.", "Favorite thai place on the island. Much better than anywhere else we have been. Always impressed with the quality of the food and the authentic taste. Everything we have gotten we have really liked. Reasonably price and very nice staff.Highlights are the pad thai, pad seu, spring rolls, red curry and panang.It's byob too."], ["Roan P.", "Fast service! LOVE Thai food and this place does it SO right! I ordered the Kee Mau tofu veggie drunken noodles again with a medium spice level. Excellent again!"], ["Sasha L.", "Got some beef pad seiew and tofu ton yum soup for take out to battle a cold, and perhaps later the toilet.  The soup is good but the noodles are AMAZING!  I'm glad everyone wrote such good reviews for this dish, I will definitely be back to order it again! And maybe next time I will try those chicken wings!"], ["Terri L.", "I ordered their tom yum soup and really did not enjoy it."], ["Maya H.", "I am surprised at the level of wonderful goodness this restaurant is. We ordered the beef salad,the green curry, pad Thai and the chili dish. The chili dish comes over rice just so you know and the egg adds a wonderful touch to it. It is like a Thai version of a loco moco. I would definitely come here again."], ["Neot D.", "If it were not for the green papaya salad I would not have even wasted my time regurgitating the negativity about the staff that already exists about this place. I have reluctantly been here a few times on special assignment in search of quality spicy Thai Green Papaya salad and each time am met with the same eye rolling, \"why are you bothering\" me attitude from the staff members.Despite ignoring the obvious immaturity, and smiling politely in an effort not to have any \"additional ingredients\" put into my food, the younger staff members cant seem to refrain from the condescending \"I'm so beautiful and into myself I don't have time for you\" overtone.While waiting 20 minutes for my single take out plate, the guy behind me even mentioned that the staff are related to the owner. I guess that explains it.Yet, the food is actually pretty good.Worth it Factor...?If you have a thick skin, and are not going to be perceived as more attractive than any other 3 inch fake eyelash wearing person out there, or don't mind being giving dirty looks for smiling, being polite and saying \"hello.\" It may be worth it. If you take offense to people expecting you to read their mind and know when your take out is ready, or what comes with a the dish you have never ordered before in your life but just wanted to try out something new that is \"Thai,\" it could be worth it. As for myself...The last dollar I will spend on this place will be via my monthly internet bill I am currently using to submit this review. Too bad the owner doesn't read Yelp, if he did he would see that for the most part the food is great. Its the staff that sucks.For that alone, this place is definitely not worth leaving with that kind of taste in your mouth."], ["Liana F.", "Favorite Thai restaurant in town! They are located next to Foodland in Market City. I'm here once a week and I'm a fan of their Pad Thai w/ pork. The service and food is excellent. Most places uses so much msg in their cooking, it overpowers the real flavor & ingredients -- and this restaurant is the only thai place I've tried that doesn't give me the numbing after taste. I hate having to drink tons of water after eating a meal because the msg. Legit thai food here! 1) deep fried whole flounder with garlic chili sauce 2) stuffed chicken wings 3) pad thai with pork 4) chicken red curry 5) springs rolls 6) sticky mochi rice 7) evil noodlesnever can go wrong with any of these!"], ["Lily L.", "I went to tried the Pad Gar Pao with pork with rice, sticky rice, and fried chicken. All three items are delicious. I like my food spicy so to me Pad Gar Pao was very mild to my taste but to those who cannot handle spicy food it may be a little spicier to them. You may able to handle it. I find sticky rice a bit tough and not soft to chew. Pad Gar Pao was a little bit salty to my taste since after eating less salty things it changes my taste buds. Maybe to those who eat heavy salty thing the taste will be good for you. The elderly couple that worked there seem kind of friendly and able to make food ready during the time he or she specified for you to wait to pickup the order.  Either way I still enjoyed the items I ordered as take out."], ["Jim M.", "Thai Issan definitely rates as one of my new favorite Thai restaurants.  They have been open almost a year and I have been at least 10 times.  My favorite dishes are the Pad Kee Mao Noodles and Pad Thai, but all of the beef and chicken dishes I have tried have been yummy.  The Tom Yum soup is good, though a bit spicy and hot for summer weather.  It is good on a chilly Hawaiian night.  :-)   One of my Thai friends loves the Pad Gar Pao and their Kahuku Shrimp dish. I have found the service to be friendly and consistent.  They are not super fast, but I have never waited more than 15 minutes to get my food either. Parking in this area is tough.  The mutants in the parking lot at Foodland making parking a challenge.  You might want to park in the lower parking lot and walk around the building rather than wait in the madness out in front of Foodland. They are BYOB, so bring your own wine or beer."], ["Doris D.", "Pretty good Thai place at the Market City Shopping Center. I got the Penang curry with fried chicken which was delicious - I ordered it spicy and it came spicy.  My husband got a stir fry with ground beef and basil (I forget the Thai name) which he also ordered spicy - very good, lots of flavor. The only thing is parking can be a little dicey at this shopping center especially at peak times."], ["Savannah P.", "I got mixed feelings about this place. The food was just okay, but the service sucked.We ordered tom yum pineapple soup,  stuffed chicken wings & a spicy seafood dish with a small order of rice. When we walked in the waitress didn't bother to say hi, or anything, just placed two menus in front of us didn't ask us if we had any questions, & took about 20 minutes to take our order. Definitely felt like we got cold shoulder from the waitress and set for a poor dining experience. On to the food: the chicken wings were HUGE had a nice crunch to them on the outside, but not enough flavor on the inside with the stuffing. Just some carrots and cabbage. The soup was good and probably had the most flavor. And the spicy seafood dish was also juat okay, I wasn't \"wowed\" by it.I'd like to go back and perhaps try something different,  but not with that kind of service."], ["Cathi S.", "Wonderful! Authentic Thai food, full of flavor and served hot. Table of 3 ate family style. We had  delicious spring rolls, stuffed chicken wings that were amazing, Thai ginger, red curry, green curry, sticky rice. Make sure you order not spicy if you don't like hot lips.  Atmosphere is rich with beautiful Thai artwork. Very inviting dining area. Helpful staff. Served with a smile. Really an amazing experience in this little out of the way place. We were so happy with our visit. What a find!"], ["Shaun G.", "This is my new favorite Thai spot. They have amazing soup and I usually get the Pad Thai and ask for it spicy.Never ate inside the restaurant but they do take-out orders pretty fast. Portions are nice and at a decent price."], ["Leslie M.", "Service has improved from my last review.  I do take out since it's quick and easy.  The food quality is consistent in yummy-ness.  I usually order the yellow curry, pad thai, and their house special fried rice.  All winners in my eyes!  I will definitely be back for more."], ["Krysten I.", "My mother has been on this United Airlines Mileage Plus dining streak....I have no idea why, it's not like she gets all that many miles from dining at restaurants on the list, but I tag along because I'm a poor college student and I won't turn down free dinner. I had actually dined here before (and I swear I wrote a review.....Idk where it went though). I remember not wanting to return because the service was non existant. Apparently they changed ownership since then, but I couldn't see any differences. The service was still lousy.Onto the food. Thai Issan serves pretty authentic thai food. In terms of the food, Thai Issan is probably one of my favorites for thai food on the island (behind Champa Thai and Pae Thai). Green Curry is a little spicy, but super flavorful. The fishcake was good, Pad See Ew (the noodle dish made with fat rice noodles) wasn't the best and the chicken sate is pretty hard to mess up. Thai Issan is BYOB, which is nice since Foodland is right next door, but you'll have to ask for glasses and an opener (asking if a place is BYOB and leaving to return with a bottle of wine apparently doesn't translate to needing glasses and an opener for the workers here)."], ["b t.", "3.5 stars. Good for bigger groups with children. They always accommodate our large party well with good but not great service. The food is consistently good."], ["Myong C.", "I didn't even know this restaurant existed until a friend very nicely offered to take me out for dinner last week. I hadn't had Thai food for a while so was really excited to check it out.First of all....BYOB. Winner! After ordering our food, walked into Foodland for a six pack of beer and when we returned, voila! Our first order was already on the table.We didn't get too crazy with our orders, just the usual Thai staples everyone's familiar with.Started with the stuffed chicken wings, 4 pieces per order. Nicely stuffed and flavored, a great start to the meal.Then came the pad thai, ordered with chicken. I thought it was seasoned perfectly - not too sweet...not too rancid...but jus' right, ya! We finished this dish clean.Last was the curry. I forget exactly which one we ordered but again, very tasty. We asked for medium though and I think there was a mistake cuz it was a lot spicier than I thought it would be. Good reason to polish off the beers! Or maybe that's just how spicy they make their food.Service was acceptable and they even let us borrow a bottle opener for the beers.I would not mind going back for another meal."], ["Asia D.", "This place has great quality Thai food and decent pricing, but don't try to go sit down within an hour of their closing time. I came here with a friend and we were rudely told that we would have to order to go if we wanted to eat.. Well it says you close in an hour so we can't sit down?? That's some bs. I guess I would come back here for the food and since it's so close to where I live but I'll just have to remember to come earlier"], ["Jon W.", "The food is very good at reasonable prices and decent sized portions.  Drunken noodles, green curry, papaya salad, and stuffed chicken wings makes me say \"Yay!  I'm a fan.\"  Service, with few other diners, left me saying \"Meh.  I've experienced better.\"  Had it been busier, it's would have been more like \"Eek!  Methinks not.\"  No \"how is everything\" or \"let me refill your water.\"  For Leeward Diners, food and service is a step beneath Thai Lao, but fills the void for Thai, when in town."]], "Pho Pad Thai": [["Veronique S.", "Kam and Mike are the owners of this Thai restaurant.  They also have a little thai take out space in chinatown in the food court, which is also VERY good, Kam is the chef and in my opinion she makes the best thai food in Honolulu.  She is Thai/Laotian and the food is very authentic.The food is inexpensive and always has a lot of flavor.  I am a professional chef, and I know food.I highly recommend this new restaurant they opened a couple month ago.  You won't be disappointed.Check it out!-Chef  Vero"], ["Will P.", "Great hidden thai food. Try the long fried rice. This place is worth it if you want thai food on the island..."], ["Andrew C.", "What a great little place!  The owner/cook is makes very authentic Thai food, and is very friendly and I always enjoy my meal.  She also has a spot in Chinatown which is equally good.  Try Pho Pad Thai!  You will be a returning customer like me!-Andrew C."], ["T O.", "I agree great place!!!Green curry with authentic taste!  Please don't miss a chance to try.  Also another surprising dish is the combination vegetable flash stir fry broccoli, carrots, cabbage, and mushroom with have you seriously contemplating wether or not to have a second helping of the main dish or another one of this tasty veggie delight.Parking can be a challenge grab some on King St. or also 'visit' a parking lot for another restaurant (on the down low)."]], "Noi Thai Cuisine": [], "Club Pattaya": [["Shawn K.", "Last night, my husband walked over to Pattaya to pick up dinner for us to enjoy at home.  It was our first time to check out the place.  Our curiosity was peaked by the new signage; it looks so much better, and is definitely eye-catching as we drive by it almost daily.  He said the person who took his order was friendly and helpful.  After placing his order, he also ordered a shot of Patron - ($8 - fair price).  He brought some reading for while he waited.  It took a while, but it must have been made to order because everything tasted extremely fresh.  Next time, we will probably call in the order ahead...unless he just wants another shot and some reading time.  It was around 6PM, so it was still a bit quiet (3 people at the bar and 3 others at a table).  The food was DELICIOUS!!!  My favorite dish is the cashew nut chicken (super tender, excellent spices, plenty of chicken and vegetables and nuts).  I wanted to hide it from my husband after I tasted it, so I could have it all....yep, THAT GOOD.  We also had the yellow chicken curry (he ordered it medium - the way we normally order from other Thai places, but it was too hot for my taste - we will order mild next time).  He had the evil beef curry since other reviewers suggested trying the evil curry.  He was not disappointed.  We ordered the mixed vegetable stir fry - VERY TASTY.  He finished off the chicken on sticks before I had our plates set out.  His comment, \"Generous pieces of chicken.\"  I'm looking forward to bringing some of the dishes to the next pot-luck dinner for my book club friends to experience.  I'm so happy we tried it.  We will be regular customers from now on.  I noticed the chicken with cashew nuts wasn't on the website menu.  I hope it's available for us (we will each get our own order) and for you to try it too."], ["Andrea C.", "This is now my favorite Thai restaurant! They use clean, simple and fresh ingredient that you can taste. My favorite dish was the crispy rice salad, it was so delicious. The service is awesome and the prices are good!"], ["Krisha W.", "I work in one of the surrounding businesses from Pattaya and eat here often for lunch.  The food is wonderful, it's fresh and spicy! Yuri is so nice and always grateful when I stop by to grab lunch :) Their thai iced coffees are great as well!"], ["Chelsey O.", "Spontaneously went to Pattaya Club while walking back to my car in the rain from a different bar and was pleasantly surprised!  Walked in on a Monday night to grab some food and as soon as we walked in, we were greeted and seated.  The owner, Yuri, came to our table and took our order. She suggested ordering the Crispy Rice Salad because it was featured in the Honolulu Magazine.  We ended up ordering the Crispy Rice Salad, Evil Curry (Spicy), and the Pad See Ew Noodle, which was enough for the three of us and more.  Everything we ordered was VERY tasty and the BEST Thai food I've had on the island. We even asked Yuri if she can cater food for our office party and she was more than happy to explain the menu and what they offer. They also have Karaoke that starts at 8pm and you can even rent the entire bar or part of the bar for private parties. This place is a MUST try if you want to eat THE best Thai food!"], ["Terrance Y.", "Went there with my work buddies while actually walking down to the diner down the street and spied the Grand Opening special sign so we walked there to check it out Ooo! Curries for $6.75 special that got my attention so in we went. Oh geez it looks like a Bar, oh well gotta do something during the day yeah? So I ordered the Green Curry on the Hot side :-) cause I love it Hot! My coworker ordered the evil Jungle Curry regular but for him that was too hot lol! My Green Curry was Hot but just the way I like it Hot but still able to taste the food it was pretty good, decent amount of veggies and chicken and good sticky rice. Now parking I would think you have to find somewhere on the street as I didn't notice any parking for the establishment (but I really didn't look we walked) although the place looks like a bar I would go back as the food was pretty good, near by and the service was pretty quick."], ["Brandon S.", "Came here b/c we had a flyer dropped off at our office.  The flyer itself was of poor quality so I was a bit hesitant to go but my co-worker said this is the only Thai place he knows of that serves Khai Jiao. Khai Jiao is a Thai omelette....and he loves this stuff from our days in San Francisco.  Yes that's correct he works with me but we also hung out when we both lived in SF in case you thought I miswrote that.I'm pretty indifferent about the omelette but needed some time to stretch my legs a bit so we walked the 5 blocks up to Queen Street and entered what looked like a bar to me.  And that it was, a karaoke bar.  You can get that right away with the booth-like seating and the bar in clear view when you enter the restaurant.The mama-san is very friendly, when she heard my friend order the Khai Jiao her eyes lit up b/c no one ever orders that let alone know what that is.  I for one didn't fee like eating an omelette so I got the Pad Sew Ew which was pretty good.  I'd go back here no problem.  The meal also came with 2 free spring rolls.  This was not their best stuff but the Pad See Ew was good enough for me to come back again. I'll try something else next time."], ["S A.", "Best chicken pad thai.  I've been to Siam Garden, Phuket Thai, etc but nothing comes close to Pattaya.  Their new chef cooks it like the locals in Thailand.  And for $7, you can get a huge plate during lunch.  Or you can go with their Evil or Yellow curry.  You can't go wrong for lunch.  Now to the pad thai.  I get mine sa-picy!  Some like it hot (me), some like it mild...they can do it to your liking.  The noodles are seasoned perfectly, not too dry.  Mix it up with the chicken, peanuts, and bean sprouts and wash it down with a cold thai coffee or iced tea."], ["Gabe K.", "The green curry pork was damn good and the employees were very friendly. It was also happy hour so beer was cheap. Some diners started singing karaoke which was entertaining. If u want to go somewhere casual with good Thai food then come here."], ["Wesley A.", "Very delicious food with very good prices!Evil curry, pad Thai noodles and green papaya salad are the best on the island. Lunch is the best deal in kakaako!"], ["Michael R.", "After reading the other reviews, I feel like I need to start by saying I came because my girlfriend lives next door, she had a coupon, and the bar was open late night after I got her out of the hospital. Stop judging me.That said, my experiences were fun without being too shady, which I suspect is either because: a) I came with mixed-gender groups so the hostesses made no attempts to solicit \"buy me drink\"s or b) I have a higher tolerance for shady than other yelpers. Let's hope it's a).They serve dinner until midnight. I've been twice, and quite enjoyed the crispy rice salad, the soups, and the yellow curry. I did not enjoy the pad thai, but pad thai generally bores me. I thought the prices were fine, and I loved that they had some thai dishes I did not know.The ambience is....interesting. They have a jukebox, karaoke, and thai videos playing on youtube, which are (to my uneducated eye) bizarre and hilarious. For the first time, I found myself grateful for a television in a bar! The hostesses also danced around to the music, which was weirdly entertaining. I was sad when the Thai pop videos stopped and karaoke started, though the other mixed gender groups were partying and singing quite well, and everyone was quite forgiving of my attempt to sing \"broken wings\" to my girlfriend on crutches (get it? ugh. drunk humor is the worst).Anyway, we had a totally unique evening, the other patrons were fine, the music videos were hilarious, we ate some new thai dishes (yay!), and the service was attentive. And all for 25$! Would come back with a mixed group."], ["Freaky S.", "Yes its a bar and yes you can buy the staff \"drinks\" but don't let that fact scare you from trying the food.  The food is amazing, waterfall salad, evil curry, tom yum, and crispy rice salad are delicious! Other favs are all the omelets and all the curries. The staff if you're in here to eat treat you professionally and for the most part it is quiet, however there are times it gets rowdy and if that ain't your thing take out because the food is awesome!"], ["Jennifer G.", "I happened upon this place on my way home from work and decided to pick up some food to-go. I ordered the spring rolls, chicken Larb, and papaya salad... Here goes:First let me say, nothing was bad. The spring rolls were my least favorite part, and had a gooey filling over powered by celery. They reminded me of the cheap frozen kind you'd get in an airplane. The super sweet dipping sauce also left little to be desired... The Larb was pretty good- nothing memorable, but not awful. The papaya I wouldn't kick out of bed either (though I wouldn't take it home to mama...lol). All in all, if you just need a spicy fix, this place ain't the worst. At least the staff was super sweet!"], ["Terry H.", "This has become my favorite place for Thai food. I drive all the way from Aiea for it!  The food is delicious and the staff are always extremely nice so stop by and check it out!"], ["Candy T.", "This is no restaurant, this is a hostess bar! If you ever walk in there, ladies are always crawling over the men and asking for a \"free drinkie!\" They have private rooms as well for special performances \"if you know what I mean\"! Dirty place, gross, don't know what type of sick/cooties are on those chairs! Don't recommend this place!"], ["Gail Y.", "Funny how lounges that have that stereotypical bar ambience often have awesome food.  My husband and I would see the \"lunch and dinner\" sign, but thought, \"Nah, cannot . . .\" because of the door that seemed to open up into darkness.  But, surprise, surprise!  We took a deep breath and stepped in because nothing in the area was open.  Talk about \"not judging a book by its cover\"!  There was a small bar, all seats taken, Christmas ornaments on the ceiling sparkling in the light of the karaoke machine, mirrors on walls, just what you'd picture a town lounge to be.  We were welcomed in and sat at a table meant for eight.  We were there just for take out.  No problem.  She enthusiastically offered suggestions from a menu stacked full of dishes.  We ordered a red curry and the pad thai.  I have never eaten pad thai before because I am not a great noodle fan, but even though the portion was large, I nearly finished it all.  My husband said that his curry was one of the best he's eaten.  He couldn't finish it all either, so the portions must be large.  Lucky for me  because I could enjoy his leftovers the following day.  Very flavorful!  Who would have known?!  We went back about a week later and tried the spring rolls and crispy rice salad.  I loved the texture of the rice--kind of like rice that is about to burn on the bottom of a pot.  So delicious!I am so happy to have found such good food so close to home.  As Kaka'ako over-develops, I hope we preserve the awesome food places like this hidden hole-in-the-wall."], ["David L.", "This is like what recent posters stated. First it is a HOSTESS BAR with lots of middle age women trying to push drinks on you. At first when my party came in it was all about the food. After that the pressure and constant lifting of my beer bottle to check if it was empty came. She kept asking \"you want 1 more?\" Then these women prance around talking loudly in Thai and laughing like it is a playground. Then 1 of them sat at our table and she asked the three of us what would be a good costume for all the girls to wear. I sat there and said wear \"nothing\" she began to tease like she was taking off her top then laughed loudly and went away. This happened a few times hinting maybe we should invite her to join us 3 men and buy her a beverage. I was there with friends and could not play grab a$$ with her (she grouped me first) so this made it uneasy at the table.Now the FOOD experience:Pad thai $12.00 we had to order two. 1 order is small. it is enough for a child.Evil Curry $12.00 ea we ordered 3. 1 is not enough for family style.Crispy Rice $12.00 ea we ordered 2Spring rolls $10.00 Total food for 3 $94.00  our drinks $85.00 drinks for the Hostess girl $60.00 3 drinksTotal visit $239.00 plus a $35.00 tip = $274.00Was it good thai food? yes  Was the beer good? like every other bar. Was the Hostess girl friendly? Yes real friendly  Would I go back? Not for the food maybe to drink with the extra friendly girl to see where it goes.We normally eat at Bangkok Chef and the same thing cost us $37.00 not $ 94.00 like at this place.  The food taste better at Bangkok chef but they do not have girls that might take off their top. LOLConclusionI am not going back to eat there as for value and taste. Hands down Bangkok Chef taste better and the portions are two times what is given here. THIS PLACE IS BAD NEWS."], ["Curtis C.", "I've been going to Pattaya Club off and on for about a year and I would say it is a hybrid not for kids restaurant/karaoke/hostess bar.  I would say that it holds only about 50 people including bar seating.  Most recently, my friends and I held our annual Christmas get together there. The mama, Yulie, is very accommodating and let us reserve seats even on a Saturday.Food-The menu is relatively small, but all the dishes are authentic Thai dishes.  The level of \"spicy\" can be adjusted from mild to Thai spicy.  Hostesses- Very beautiful and nice.  The main difference between this bar and Korean bars are the girls that I've experienced are not pushy about buying drinks.  They just seem more fun than the normal KB.Karaoke-As expected, there is a plethora of contemporary Thai songs which the hostesses can sing and dance to.  The English songbooks are a little dated, but you can sing the standards as well as Hawaiian.Now open for lunch 11am to 2pm."], ["Daris A.", "I had no idea this place existed, until a friend mentioned that he wanted to check this place out.  I guess from what ive been reading, it is under new management, and the name of the place has changed, but he wanted to see if the menu was still the same as before.I guess it is... he got to order his crispy rice salad. Its not on the menu they hand you when you sit down in one of the booths, but it is listed on the take out menu. I have no clue as how this dish is prepared, but all i can say us YUM!!! I would definitely go back for more.  We also ordered the tom yom soup, which was  deliciously spicy. We tried the fried papaya, which im guessing is deep fried papaya with strips of deep fried chicken and a tomato/green bean dipping sauce.  (This dish reminds me of vegetable tempura, but it was too much fried food for me...say what??!!) They only serve the deep fried papaya for dinner...The drawback, it is a bar, and i get the feeling its a hostess bar... but hey, i could be wrong, but the bartender/waitress keep hovering asking if i needed another beer...when i was barely finished with the first.Parking is a little bothersome, we went around 7pm, and we parked about a block away, which worked out nicely because we discovered other new places we didnt know existed in that area.All in all it was a very pleasant first intro to Thai food for me."], ["Roger P.", "Another fun small neighborhood Thai karaoke bar.  Authentic Thai food, friendly staff and a good selection of Thai and American karaoke."], ["Antonio H.", "This place is pretty fun, the bartender is really cool and the bar seemed so forign which is a nice touch. I came here to grab a few drinks as i waited for my cab with my buddy and ended up singing kareoke for 3 hours and disreguarding the cab comepletely. I didnt have time to make an order here but i did see some others buying things off the menu. They looked pretty satisifed from their facial expression on the food quality. I might try this place out again, i wasnt hard to find, this was the first time ive been to a tai bar and i had a wounderful experiance."]], "Malee Thai Restaurant": [["Peter O.", "Love this place. Family owned friendly and great prices. Try their red curry chicken with sticky rice. Seafood fried rice is amazing too. Never had a bad experience here. Thank you"], ["Stephanie L.", "I plan on coming back.Papaya Salad: THICK julienned green papaya! I actually prefer my papaya salad this way so there's more of a \"crunch\". The sauce was tasty and not too spicy (ordered medium). What was unique about this papaya salad was the abundance of roasted peanuts, quartered tomatoes, and cabbage wedge! The salad was very refreshing!Green Curry (with seafood): The curry was creamy but not too rich. There was plentiful bamboo shoots and fish in the curry. Green curry is my favorite type of Thai curry and this dish did NOT disappoint at all! Also, I love bamboo so I was happy with the amount of bamboo used in this dish!Pineapple fried rice: Yummy and not oily at all! This was the first time I tried pineapple fried rice and I was definitely happy with my decision! The rice is a little sweet, a little tangy, but definitely savory! And to my surprise, it tasty pretty darn good with the green curry spooned over it!Thai Iced Tea: NOT TO SWEET! AND I LOVED IT! For my preference, I prefer drinks that are not too sweet so this was nice and balanced for myself.Portions: These above items were split between a friend and I for lunch and we were stuffed and had leftovers (enough for one more meal). I personally believe the portions are a good size! Not too little and just enough if you have a big appetite! Decor: The bright orange walls gave my mood a boost and the tables were nice and clean! Service: Our waitress/ cashier was nice, but there were times where were we left unattended when we were one of three tables dining at opening."], ["Lyla D.", "If you've been traveling on Keeaumoku Street, you've probably passed this little, er, not so little restaurant many times.  It's located right next door to Masala Indian restaurant and near the entrance of the Sam Sung Plaza. The other evening, we wandered about the Ala Moana neighborhood and started to consider dining at Masala again.  However, we saw the sign for Malee Thai and quickly changed our minds as Thai cuisine is one of our favorites.   When we walked in, we noticed that the smallish entrance belied the depth of this restaurant.  It was bigger than we expected.  We were greeted by a friendly, gracious and smiling female server who introduced herself as \"O\".It was our first time to dine here so we asked her about their signature dishes.  O politely said their appetizers/salads, curries (notably, their curry stir-fried crab) and their noodles were all popular.  Um, with that thought, we decided to try a couple of dishes as we looked the menu to find them to be reasonably priced.THE FOOD:- Thai Fried Chicken:  we debated between ordering the stuffed chicken wings aka Angel Wings (peek kai yad sai) and this item.  O recommended this item as it features the chicken thigh (dark meat) and is meatier.  The golden brown crackly crust used very little cornstarch or flour to crisp.  The chicken had been marinated in various Thai seasonings with just a mild kick of chili pepper.  It was served with a sweet and spicy sauce.  My husband was very happy with this choice as it satisfied his fried chicken cravings.  I was pleased with the flavors, crispiness and non-greasiness. $8.75- Seafood or Calamari Salad:  we chose calamari instead of the seafood because for us, the test for proper preparation is the tenderness and crunchiness of the calamari.  The calamari (strips & tentacles) were tossed with roasted chili paste, tomatoes, cucumber, onion, mint leaves, lettuce, vermicelli and house dressing.  The house dressing was fresh tasting and not didn't have an overpowering fish sauce flavor.  The salad was served warm yet it was refreshing to our palates.  $10.50- Drunken noodles, basil noodles aka Pad Ki Mao:  a rather hefty plate of Chinese-influenced sizzling stir fry of ground pork, garlic, basil, beansprouts, chilis, egg, fish sauce and broad flat rice noodles was served to us.  The flavors were on-point without being overly salty or fishy while the broad rice noodles were soft and supple.  It was delicious and very satisfying.  $9.50We ordered all of our dishes MILD as we weren't sure about the spice-level...um, we've been \"victim\" to having our lips burnt off with Thai \"medium\" before.  But, at least this way, we were able to control the spice level by adding their chili paste or sambal oelek (not the Huy Fong Sriracha).  That sambal oelek was plenty spicy and I only needed to just dab to add some heat to my portion.  I don't consider myself a \"chili wimp\" but compared to my husband, I am!O told us that her family had just taken over ownership of this site as their original restaurant was located in the Maunakea Marketplace.  Parking can be found in the Sam Sung Plaza parking lot or along Keeaumoku Street at metered  street stalls.  We can't wait to return to try more dishes.Come on, let's go to \"Thai one on!\"  Speaking of which, this restaurant is a BYOB without corkage fee.#453"], ["Angela C.", "So good and delicious. I ordered the chef's special curry stir fry crab. It was so flavorful. The sauce was sweet, salty, gingery, and the crabs were succulent. There were at least 5 large pieces of crab. Perfect for someone that has been craving for crab for a while. The crab tasted fresh and juicy.My hubby's peanut curry was equally tasty. The sauce was so flavorful. It actually doesn't taste very peanut-ty...and i liked it that way.The summer rolls were fresh and healthy. The Thai ice tea was very good."], ["Amy M.", "Thai food is just one of my favorite meals to eat. I had worked up an appetite after my bootcamp class. During my workout, I was thinking about what to eat for dinner as I completed a push-up;) Well, I have been craving Thai for a few days now, and it was time to give in. I had bookmarked this eatery, so I was pretty excited.   It's hard for me to try something new when I have been ordering the same thing for years. I looked through the menu, and I kept to what I was comfortable with. I ordered the basil chicken noodle extra spicy with green chicken curry. I also opted for a side of brown rice.      The green curry was spicy, and the coconut milk made it very smooth, aromatic, and flavorful. I mixed in some of the rice into the sauce with a piece of chicken and basil. It was wonderful, and I couldn't stop eating it.  My tastebuds were celebrating in my mouth. I had to pace myself since I wanted some of the noodles.    The basil chicken pad Kee Mao was good. I felt they were too soft to my liking. I tend to eat my noodles al dente.:) The colors of the basil, green peppers, red chilies were vibrant in my dish. When it comes to Thai, I order my food very spicy to the point of having tears coming down my face with a numb tongue. I could tell they tried;) I had a good amount left over and was pleased overall. The food was delicious."], ["Adrian T.", "The parking here is free, you just need to get the ticket validated here. However, the parking is a little bit cramped. Malee Thai is located right next to Subway near Ross. If you're going down Keeaumoku, you can't miss it. The place is nice and comfortable. The way it's set up almost seems like a hole in the wall. The lighting is okay and the table and set ups are nice. They are clean for the most part.We tried 4 dishes while we were here. We tried the fried chicken, fried fish patties, pad thai, and the garlic stir fried. The fried chicken was good but not too special like other Thai joints. The fried fish however, was very interesting. Can't describe the taste but I thought it was really awesome! They both come with sweet and sour sauce. The pad thai was good and the texture perfect like how it's supposed to be (sweet, sticky and delicious). This last dish was the most interesting to me and my gf. The chicken in the garlic stir fried had this after taste like how you eat BBQ that's been smoked for many hours and you taste the wood it was cooking on. I thought that was something special. You could also taste garlic in every single bite of mushroom and chicken. The service here was good and they were very respectful of everyone. They were attentive to filling the cups with water and always asked if we needed anything. I also love how this place isn't as pricey as other Thai joints on this island. 4 dishes here was around $40 with tip. Other places are $50 without tip. If price and Thai food is what you're looking for, I recommend coming here."], ["Riawahine D.", "My friend and I flipped a coin because we were undecided--Thai food or Indian food. We ended up choosing Thai food and we are both so glad we did. We ordered Thai tea, chicken satay (peanut sauce was perfect), crab curry, and Thai hot basil (veggie style). We were served pretty quickly, and the food came out nice and hot. We both were quite satisfied with the presentation, serving sizes, and flavor of our food. In addition, the staff was really nice and attentive. Great experience! And, they validate!"], ["Kevin T.", "After a couple years of visits, it was time to updateMalee Thai...and happy to teport they still can deliver the goods.Varied menu with all the 'essential' offerings. Portions are respectably sized, so its easy to have some leftovers for taking home. They all share fresh, vibrant flavor & attractivly served. Excellent, friendly service every time. Favorites are the Som Tom, Laab, Penang Curry, Pad Thai, Thai Basil stir fry...the lust goes on.Appetizers that rock are the Summer Rolls, the satay,  and the fried calamari. They are very accurate in your spiciness request. I've been here numerous times with those ordering mild to medium to Thai-hot (for me) and the cooks here are pretty accurate to your request. Penang Curry is my worldwide litmus for Thai places and gggg hits the target spot on with a rich, flavorful sauce, perfect consistency and presentation. The Thai Basil stir is really, really ggod here and superior to any other place in recent memory. Usually opt fr the pork, which here is ground. The sauce, the flavor and the brilliant, vibrant ingredients vare just plain off the hook good.Everyone's favorite of Pad Thai is an easy homerun at Meena. Say hi to Bia & see you there."], ["Andy F.", "Maile's Thai? No!!! Malee Thai! MALEE! Not Maile!Now that that is out of the way. Malee Thai is truly a hidden gem. It is located in the Samsung Plaza facing Keeaumoku, right next to Subway. You can park in the lot, and it is free with validation. I came here for dinner with a sickly friend who was dying for soup. This place is very small, so be prepared for that. When we came in at around 7pm, it was pretty empty, but picked up along the way. Take out is seemingly popular.  As the night went along with other patrons coming in to dine, the odd thing was that I was the only Asian person in there for the longest time, especially dining in the heart of Koreamoku. Now, I am not sure what that truly indicates, perhaps it shows this place caters to a wider clientele? Anyway . . .. . we ordered the Tom Yum (Spicy Sour Soup) with Chicken, mild (You can choose mild, spicy, and extra spicy). It comes with mushrooms, lemongrass, cilantro, kaffir lime leaves, and galangal in a clear broth. The portion is huge, and it is more than enough to feed 2-3 people. The broth was clean and flavorful, and had the perfect amount of sourness from the lime juice. The other ingredients were all fresh and really stood out in the soup. The herbs gave off a very fragrant aroma and distinct flavors in the broth. All in all, it was a very pleasing soup with a multitude of flavors from sour, sweet, spicy, bitter, etc.We also ordered the Larb or Larp (Noo, not Live Action Role Playing ;p), which is Minced Meat Salad, spicy. You can choose from chicken, beef, or pork. We opted for the beef. It came with scallions, white onions, cilantro, and mint all on a bed of fresh cabbage. Everything was mixed in with spices without the fish sauce and lime juice (like the Lao-version of Larb). I really enjoyed this dish because each ingredient was fresh and fragrant, and stood out individually with everything working collectively. Also, the beef was not overcooked! All the herbs and spices made this dish very flavorful, and at the same time, very light.My dining partner just recently vacationed in Thailand, and she said the Tom Yum here at Malee is exactly the same there. That right there shows this place is authentic.The service was very good. The lady in glasses was very patient and attentive, and the food came out at the right time, not too fast or too slow. The prices are really good, especially with the amount you receive. We were both very full from just those two dishes.Overall, I'd come back to this place in a heartbeat to try all the other Thai dishes. This place is truly authentic Thai. Each dish provides a multitude of flavors with fresh aromatic ingredients that each stands out and works well together."], ["Ray L.", "They are so friendly here and truly is a \"mom and pop\" run operation.  The service was spot on and everytime my water glass got empty, the woman was there to fill it up.  The portions are very decent and prices very fair in comparison to the nearby competition.  This is one of the good choices if you are shopping at the nearby Walmart or Sams club and looking for a meal."], ["Kit W.", "One of my colleagues is a Thai food enthusiast and highly recommended Malee when it first opened. His description of his experience almost made me drool and I have been meaning to come here since!  I got to catch up with a friend over lunch here today. We were able to find street parking and the restaurant only had two other parties when we arrived a little past noon. We could choose our own seats so we chose the table closest to the entrance for the natural lighting.We ordered summer rolls, pineapple curry with pork, and pad thai with chicken. The summer rolls were packed with fresh veggies and I liked the accompanying peanut sauce. We went with mild level of spicy since our waitress said even the mild's a little spicy. We should have gone with medium--I didn't really taste any spiciness in the curry. Although the curry was tasty, it didn't blow me away and lacked the vibrancy and consistency seen in other Yelpers' pictures. The pork in the curry was also dry, which sadly detracted from the value of the dish. The pad thai was a saving grace--it had great flavor and the chicken was cooked well. The portion sizes were good and the prices were competitive. With tip, our meal came out to $35 and we left very full.The service was pretty good. Our water glasses were refilled and the food came out quickly. We were checked upon periodically and the check came as soon as we asked for it. I would come back to try other items on the menu."], ["Cora D.", "Very cute place. Very small but they use the space very well so you don't feel cramped dining in. We had Summer Rolls and the Pad Thai. Summer rolls were pretty big and the peanut sauce was very yummy. Pad Thai was soooo good! Tons of flavor and good quantity! I got to eat it for lunch the next day too!"], ["Mel B.", "I was sad when the owner of the Malee Thai told me she was closing business at the end of the year to retire.  Only for moment.  Then she gave me the business card to her daughter's restaurant.  Looking at the address I see it has easier access and closer to my location.  I started smiling.The owner greeted and escorted us to our table.  Our mouths were already salivating because it's not the same menu as her mom's.  I'm set to order the basil beef and my lady-love wants the green curry.  But wait, I see something on the menu I don't normally see and it's something I enjoy immensely.  Thai spicy clams.  We had plan to order only 2 dishes but after seeing that I get the O-K to add the spicy clams as the 3rd dish. As I order I am told the basil beef is made with ground beef.  Not good.  She saw my disappointment and offered to make it with strips of beef. Better. This is savory dish for me.  The ground beef does not pick up the sauce and flavor as well as beef strips.  We order everything spicy with the sticky rice.The green curry comes first.  It smells divine and tastes fantastic.  Happy about that.  Next comes the basil beef and I am pleased with that.  Plus there's a nice amount of basil there.  This is one of my fave Thai dishes.  That  hit the spot for my Thai food craving.  Next up, the spicy clams.  This put it over the top.  It was so delicious.  I could taste all the flavors there swimming in my mouth.  Although this was the priciest of the dishes  it came with a generous amount.  Well worth every penny.  I highly recommend those clams if you've never had them before.  I had other people tell me they don't particular like clams but those they will eat.The owner finally came by our table once we were slowing down and there wasn't much left.  She asked if we were from here and we talked about her mom. I told her I love the clams and she said it was her favorite dish.  The conversation enhanced our evening meal the better.When that Thai food urge shows up again, this is where I'll be.  Good service, good food, fair price... that's all I need."], ["Richard H.", "Located across the street from the Keeaumoku Walmart in the Samsung building.  Same great quality as their sister location in Chinatown.  The place is very small, and the design appears to be former Ramen restaurant, rather than a Thai restaurant.The entire staff was very friendly throughout the entire dining experience.  The hostess stopped by our table several times to ensure that we were pleased with our dishes.Calamari salad, which was more like squid, long rice over lettuce.  We ordered this dish spicy and loved every bite.Jasmine sticky rice served in traditional Thai containers.  Perfectly cooked and a great compliment to the green curry.Green curry with sliced beef - delicious, well seasoned, and creamy coconut milk.  Feature item - fresh crab curry dish for $13.99 this is a steal!   Amazing!"], ["Krysten I.", "The sign out front says S & T Thai, who I'm guessing were the previous owners, so don't get confused. This little restaurant is located between the Ross and Samsung Plaza on Koreamoku st. There is usually street parking if you go during lunch, otherwise you can try park at Ala Moana or Walmart if you're daring and willing to walk a little. I liked the ambiance; the walls are painted a nice, bright orange and the waitresses were all very nice. Even though the restaurant is oddly shaped, they make it work. For being such a new restaurant, they were surprisingly busy with families and rando tourists on a weekday for lunch. The service was excellent. The waitresses were very attentive in refilling water glasses and bringing our check. One of their young sons was in the restaurant and my friend and I watched as the waitress tried to train him to work. It was cute. I like the whole family-run business idea. My friend and I shared a green curry, pad thai and the crispy chicken wings, all of which were delicious. We were a little too ambitious and ordered too much, so we took home a lot of left overs. Like many Thai restaurants, they offer a variety of curries, noodle dishes, and fried rice. I would also recommend getting the Thai iced tea. Prices are comparable to other Thai places, and I definitely enjoyed what we ate. I'll probably be back soon (since it's so convenient) to try other things on the menu."], ["Jessica-Nicole U.", "Wow! Wow! Wow! Soupa (not sure how to spell it) was amazing! Very friendly, courteous & helpful with all our questions. It seemed she really wanted us to have a great experience, which we did. They have authentic Thai plates not really common. We had the guy jub (soup with intestines), it wasn't my cup of tea but I know many ppl who would like it. The red curry was one of the best I had. We also had the chicken sticks, which was great! Everything was really yummy and presented pretty well. From the minute you step into this restaurant, everything is just wonderful! The place is extremely clean, cute and lovely. Even the cups for water is perfect. It def has $ prices but it is of $$ caliber restaurants because of every little detail. The prices are ridiculously low for the quality of the food and the beautiful, comfortable ambience! I'm kind of hesitant to even write this review because it's such a hidden gem and no one knows about it yet! It's only been out about a month, located right by subway & Hiblend on keeaumoku. It's the old S & T with new owners. I don't impress easily but my experience was so great, I would recommend to everyone with great enthusiasm. Perfect for a date or outing with friends. And I would recommend meeting soupa, she's awesome! Thanks so much soupa! Will see u again and try some of your other new plates. Thank you thank you thank you for opening! I'm excited to have a new favorite Thai restaurant I can go to for my Thai food fixes!!!"], ["Chihiro A.", "Visited for late lunch with my husband and 1year old daughter around 2pm. Food was very good. Ordered long rice salad and Shrimp green curry with sticky white rice.  All are Very tasty. Come back soon :)"], ["Mei-Lan C.", "came here the first time .ordered long rice salad with minced pork and shrimp 9.50 $ and  pad ki mao  with beef 9.50 $ .both dishes were nicely seasoned  and tasty ."], ["Jenet Y.", "Order some delicious curry,  but when we returned again for the some of that same deliciousness it was way different. It lacked the basic massaman favor and was met with offensive attitude. They told us to come back so they could fix it ... Then wouldn't take back the sticky rice...what are we suppose to do with just the rice?...Then the huge fight about $2.50?  Ok...anyway.  Sorry we didn't like your food or the attitude.  ;/"], ["Jennifer O.", "The tom yum was delicious!  We parked at Walmart across the street (since we were going shopping there anyway) and walked over for dinner at Malee Thai.  The service was good, the restaurant was clean and the food was delicious.  My mom ordered the rice noodles and my brother got the garlic pork stir fry and both were happy and full when we left.  there was so much food we got to-go boxes for the leftovers.  I'd come here again."], ["Sivilay T.", "Picked up take outs earlier today.  Ordered a crab papaya salad, beef salad, basil chicken and deep fried chicken wings with 3 orders of rice.  The lady who answered the phone told us it would take about 20 minutes, but we waited for about 40 minutes.Food isn't as good as it was under the previous owner.  A little on the salty side.  Portion is reasonably priced.  Probably won't be coming back here for Thai food"], ["Andrew T.", "Honestly the food was excellent it was the service that sucked. The servers family came in and me and my friends were eating at a table all the way in the back! She only refilled our waters when we shook the ice, and never checked up on us to ask us how things were. We had to ask her for hot sauce. Food was very good, the service was horrible! When me and my friends were leaving the waitress and her family just stared at us in silence and we're talking in Thai. How rude was that?! So sad, I'd come here to pick up food, but service wise it sucked. There used to be a sweet server that was phenomenal where did she go? You need her back! This lady served us like she had something stuck up her butt that it distracted her so much That she forgot her job!"], ["Ricardo A.", "First time at this location and right off the bat I noticed the following things:Positive:Clean restaurant Greeted Immediately  Pricing is not bad at allThe ladies working there are friendly and polite.Food was delicious. Parking is freeNegatives:There is a small language barrier between a couple of the back staff, no big deal tho. I give them 5 stars! Will come back!"], ["Cullen K.", "Stopped here to try something new with my boyfriend. Glad we did because the food was AMAZING! Very flavorful dish after dish. The papaya salad here was probably the best I've ever had. I got medium which was just enough spice to keep the original flavors without overwhelming it. And that pineapple curry- MUST TRY! I never would have thought this would be so delicious but its so good that's the only thing we wished we had lol. Something about the sweetness with the spice and cream...... MMMMM... I could have lived without the stir fry veggies. Same veggies in the curry so it wasnt as satisfying. The steamed mussels were good as well. I love me some Thai basil with the spicy sauce served on the side. Service was nice. It's byob so i brought my own wine and the server chilled it for me. She was polite throughout the meal and smiley. I only put 4 stars because 1. The air condition wasnt on so it was a little hot. And 2. After reading that the tapioca was complimentary and it not being on the menu, i was a little upset that I got charged for it. I wouldn't mind usually because i pay for it normally because i ALWAYS order tapioca, but because i heard her OFFER others i felt offended. Either way, i tipped 20%. The food was good, service was good. The meal was great :)"], ["Vivian K.", "My favorite A hole-in-the-wall Thai spot in the middle of a busy strip.  This spot has changed ownership numerous times.  Wasn't a fan of the last round of S&T Thai (the use of paper plates was a big turn off), but this owner is bringing the good thai spot back!  The penang beef curry was on point with the right amount of flavor.. great with sticky rice too!  Service was attentive for a small restaurant and it is very family oriented.  I was asked several times if I need my water refill.  I will definitely go back there again for more authetic Thai dishes!"], ["Vanessa B.", "I ordered the Red Curry and it was very good. I had no problems with it. The sitting area is small and whatever. Parking isn't that great but if you go into Samsung plaza there is some parking. I usually just walk there from work."], ["Rhegan L.", "Tried this place because I'm always in the area (Walmart & Ala Moana!) and was not disappointed. Love Thai food and Thai iced tea. We tried the pad Thai, panang curry with sticky rice and chicken satay plus my Thai tea. Everything was yummy and you can customize your spice level. Very similar to Siam Garden on Nimitz but more convenient for us, definitely our new favorite!"], ["Cindy Y.", "Well, it is nice a restaurant, but after I sit and the service only gave me menau and didn't give me the water. Another guest came after me, she got the meau and water! Also after I take an order, the service take away take out meau from me. I need that take out meau. She didn't ask me and she is very rude! She has very bad attitude!"], ["Jj J.", "What I would expect from a Panda Express if they did Thai. Very low quality noodles. Not a lot of flavor. I've never tasted black pepper as a primary seasoning in Thai food before and the dish was loaded with it and it was swimming in oil! I ordered the pad see ew and won't be back. I would rather pay 1-2 dollars more for a good quality dish! There's too much great Thai on this island to return. Sorry!"], ["Michael G.", "Superb!  Excellent food and excellent service! We had the pad ki mao, curry, and summer rolls. The summer rolls are unique with more crunch than usual."], ["Tracey R.", "We have been eating at Malee's in Chinatown for over 16 years; always good, always satisfying.  We learned that they have moved out of the Maunakea Marketplace and is now on Keeaumoku Street.  We thought they were just opening a new 2nd location.  Good for us because it is now closer to home.  I ordered my favorite, Pad Siew; I think it is the best Pad Siew out of every Thai restaurant I have ever eaten at.  The thick noodles are chewy and soft, the Chinese broccoli bright green, crispy egg pieces so yummy, the sauce flavorful and not too salty.  I usually get it with tofu for a vegetarian meal.  To complete the dish, crunchy fried garlic pieces are scattered throughout.My husband tried the Pad Ped that is a stir-fry of eggplant, long beans, carrot, onion, basil, and red curry.  It may also have some other veggies and he ate it with brown rice and added tofu.  It was also delicious.Wait-staff is very nice and the food came to our table in a timely manner.  Both dishes were hot and flavorful.  The restaurant is long, narrow and if you have a large group, it may get cramp and you might take up most of the restaurant. There is validated parking to the right of the restaurant in a lot.We are so happy Malee's is still going strong and that we can continue to enjoy her onolicious Thai food!"], ["Jason R.", "This place is awesome!  I highly recommend this place if your next to walmart on keeeaumoku.  Almost as good as siam garden"], ["Marlene A.", "Love love the Thai food here!  The curry dishes are delish. My fav is the peanut curry. The fish cakes r great too. The nurses and the doctors at kapiolani med Ctr order there for lunch frequently.   Try everything there. Soo delish."], ["Nathan W.", "So I arrive just around opening time this morning  and I can see they are working on a huge take out order. As I sit down the workers and from what I found out later were the owners were yelling at each other. The girl who gives me my menu walks up to the table yelling over her shoulder \"No. You are stupid!\". I couldn't  believe it. I let it go but they still continued to yell at each other. Granted I wad the only one there but it was still pretty ridiculous to be arguing in front of a customer.  I ordered and it took 25 minutes  for my food to come out. I asked if they could check on my order and one of them said \"we have a big to go order.\"  That being said, wouldn't you make sure that you cooked the one order for your customer that was there? The food was good and probably one of the fish patties I have had but the service was so bad I would rather try another place."], ["Al D.", "Had dinner here. I liked it. The restaurant is a bit small and the service could use improvement but the food was good. It's BYOB, which is always nice, and they validate parking. The panang curry was delicious. The fried beef jerky was interesting. The green papaya salad, fried calamari, and pad Thai were all good. I would return."], ["Janessa M.", "I was extremely impressed with the quality of food and the price! We had dinner here earlier this evening and it was delicious. The red curry and and calamari are wonderful! Great service as well! Will definitely be back."], ["Roan P.", "I ordered a noodle dish similar to drunken noodles. It wasn't spicy at all. The waitress never asked me how spicy I wanted it so I forgot to say something. I ended up just adding chili pepper sauce which made it better. Then, after enjoying my dinner, I came across a piece of chicken!!! I was so disappointed. I'm pescatarian so that just grossed me out."], ["Rich L.", "I have been in the past but will never again. The food was very average tonight for some reason. The pad Thai had zero flavor and the fresh rolls while good were served after the entrée arrived.BUT THE MAIN REASON I WILL NEVER EVER EAT HERE AGAIN....AS I WAS CHOKING DOWN THIS MEAL A DEAD RAT WAS CARRIED OUT OF THE KITCHEN IN MY VIEW,! HOLY CRAP! Talk about loosing your apatite. They tried to lie to me that it was a bug...bugs don't have fur and long tails. God I am sick thinking about it. I swear to you all I'm telling you the truth. They hurried the thing out to the dumpster in a black bag, and I got the guy to admit that it was a rat. He told me I was tripping too much, that it was no big deal. But YES IT WAS? Ugh..I never want to eat out again...."], ["Christian G.", "This is a great little Thai restaurant with a simple menu. My girlfriend and I ordered a summer roll and the pad se-ew. I recommend both dishes. Prices are great. The waitress was polite and friendly. I will definitely recommend this place to friends."], ["Jeff W.", "This new gem of a restaurant just opened up a few months ago and it is really good!   Not only was the food delicious but the atmosphere is very relaxing.  It's owned and run by a family who obviously take a lot of pride in their cooking and hospitality.  I can't wait to go back!"]], "Siam Garden Cafe": [["Josiah L.", "I'm a huge fan of Thai food so when I needed something to eat after a late game night, I was pleased to see that Siam Garden was both nearby and still open.  It's a nice restaurant and service has been good on all my visits.Now for the food.  They've got pretty much all the usual Thai dishes (noodles, curries, soups, etc.).  I didn't see anything particular special or unexpected on the menu, but they have pretty much every dish I'd want, and all at pretty reasonable prices.  The curries are excellent and the drunkard's noodles are pretty great too.  Be carefully though, as their \"medium\" is on the spicy side.  They've also got a good Thai tea and I was pleased to notice that their brown rice is actually more of a red rice (which I love, but rarely see in restaurants).I wouldn't say that it quite hits the level of my favorite Thai restaurants, but not many places do.  Really though, I can't complain about Siam Garden.  I may have originally gone mainly because they're open late, but I'd be glad to return at any time of day."], ["Adrienne B.", "In what appears to be our mission to try every Thai place in a ten mile radius before 2014, we found ourselves here Friday night. I came in with high expectations after seeing so many good reviews from fellow Yelpers, especially since this place is one of the top rated results when looking for Thai. Surprisingly they were not very busy when we arrived and we were seated immediately in a window booth with a \"quaint view\" of the parking lot and Nimitz. Our server came quickly with menus and water, and I was a little surprised that she did not ask us if we wanted to order any additional drinks. Our water was warm which is a pet peeve of mine but not a deal breaker. We ordered the summer rolls, chicken pad see ew, and basil chicken with brown rice. The summer rolls were good, but were a little dry and tasted like maybe they had sat out a bit or were uncovered (the wrapper). The pad see ew and basil chicken were both delicious. With perfect flavor. When we were done eating I was surprised that we weren't asked if we wanted dessert and she just brought us our check, but I'm still giving four stars for food taste for the entrees alone. They could definitely use some improvements in the customer service department, but we will definitely be back for the food."], ["Keith F.", "My brother loves this place. Could be the waitresses, but the food is good too.First itme here and will go back to try other dishes."], ["ShaSha 2.", "This place is my favorite. I love their shrimp bean casserole,  cucumber salad Lao style, garlic fish filet *sauce on the side, Laab, endless because everything is sooooo good."], ["S R.", "We love their shrimp bean casserole, cucumber salad Lao style, Garlic fish filet *sauce on the side, laab everything is so good. Wish there were open Sunday for lunch."], ["Amanda P.", "Best Thai food on the island. Fast and delicious. I love the pad Thai and any of the curries. You get so much food you will have lunch the next day! Great deal, great service, mind blowing food for take out or dining in."], ["Nicole B.", "The best Thai I have tried on island yet. I love the decor and the service is generally on point. I highly recommend eating in! Try the drunkard noodles and the super crispy chicken. Awesome!"], ["Philip G.", "So my wife and I have been looking for a good thai food spot other than Bangkok chef near Kalihi. Decided to give Siam garden cafe a try. I called my order in cause it was just me this time. Didn't want to go there and sit alone. I ordered 4 things that totaled to $34.52. Spring rolls, spicy sour soup with shrimp\"HOT, massaman curry with beef\"HOT\", and a side of sticky rice. So the spring rolls was not impressive at all. The soup was real good. I liked it a lot. The spice was okay but not HOT. It had a good amount of shrimp and tasty mushrooms too. The massaman was good but not spicy at all and too sweet, also I thought there was too much onion and not enough beef. Although the dish was tasty and the beef was fall apart, soft. It went well with the sticky rice, which was good by the way. I think I might give them another they and eat something else. When I went to the restaurant, the inside looked clean an they a had a nice Decor going on. The staff was nice and the food was made fast. I could see how parking could be a problem though during the day. But I went at night and had lots of parking to choose from. I will post the pictures. Go find them and see for what they look like."], ["Meg M.", "This place is kind of a hole in the wall off of Nimitz Highway but is a contender for my favorite green curry on the island!Justin U. loves this place and I was skeptical at first.... I LOVE Thai food and it is the favorite of my foods to eat out. (I have NEVER successfully made Thai food on my own!) ... But I am kind of picky. Luckily, this soon became our favorite spot! The helpings are big enough that I always have left overs for work the next day and every dish we have tried has been flavorful and decadent! They also have a good section of wine and beer. I would recommend: - Fried calamari.... Surprisingly good!- Drunken Noodles with shrimp.... Spicy but well worth your mouth being on fire. The wide, flat and doughy noodles make this dish awesome!- Green curry with tofu.... It's packed with veggies and is the perfect creamy consistency! Remember your side of rice  I have to say though that the service makes this place lose a star. It is inconsistent at best.... Sometimes you get a great waitress and then sometimes you have to wait ten minutes for your empty water to be re-filled!  The most important ingredient is great food though.... And Siam garden has it!"], ["Aline T.", "This is my favorite place for Thai food. You want a full Thai dining experience with pretty waitresses, who may or may not provide good service depending on the time of day, the position of the moon, and if they put on enough blush? Then come on down!The food here is great. I'm not sure what Mama-san (or former inhabitant of a small island in the western Pacific Ocean) they have working in the back but s/he can cook. Everything that I've tried, which is a lot, because I've come here for work lunches and just-because dinners, is yummy. The service...ah, the service.  I'm a very easy-come, easy-go type, so bad service like not smiling, or forgetting to bring a menu, or having to stand up and walk up to the person for attention doesn't bother me, but consider this your warning. ;] Parking is aplenty.  There's parking in the front, and there's a parking structure with two levels. IS IT WORTH IT?! YES. YES, IT IS. Now, go, my child!"], ["Jayson L.", "Who wants to eat some Pad Thai noddle with some green curry. Me myself and I...I only started eating thai food for pass few years and i learn to really love it. Thai food has some really wild flavor. some dishes can be very spicy and some dish can be very nut flavor.Most of the food i eat are Asian food and i like to eat thai food once every month. if i had to pick where to eat thai food is siam garden cafe.This place is along the alamoana blvd by best buy and it's hard to miss the restaurant since you can see it as you drive.They have big parking lot in the back so don't worry about parking when you come eat here.They have great and friendly  service and food taste great. they have everything on the menu and ask for Thai hot if you love put your thong on fire. the place isn't so big so if you have more then party of 6 i think you need to call to make some reservation.I really enjoy green curry with sticky rice. they have sticky rice come in this bamboo looking pot with ziplock bag inside . when you pull it , it comes out like popsicle which make it easy to put it on the plate.Don't forget their sticky rice desert. i believe they have few flavor so please ask the worker."], ["Rylee T.", "Came in on Friday at 830pm since we had a lay over from the outer island before our final destination to the mainland. The place was probably about 65% occupied. Aside from the water on the table, no waitress came back to see if we had any questions or if we were ready to order for just about 20 minutes. We were pressed for time and decided to order take out instead to eat at the airport. Since they were so slow, we assumed that the kitchen may be just as slow and didn't want to risk waiting.This review is solely based on customer service. The food however was great. 2 stars deducted based on service alone."], ["Stacy B.", "We eat here about every other week.  I have never had a bad dish here.  My favorite dishes are pad Thai, panang, sticky rice and spring rolls.  The food is so good that all the negatives are forgiven - limited parking, not the most attentive service.  But it's open all day and the prices are reasonable."], ["Michael H.", "Their green curry is great.  Seven of us went there for lunch, the wait was a little long, but definitely a good Thai food Place."], ["Roan P.", "I love the atmosphere and my Pad Thai was delicious. If you want some spice, which I was expecting, make sure you tell them beforehand. My Pad Thai had no spice to it at all. However, I'm giving this place 3 stars for my first time experience here. First, my order took a while to come out and then before I even took a bite, I found a chunk of beef on top of my noodles which tells me they do not take into consideration cross contamination when cooking a vegetarian meal. I requested Pad Thai veggies with tofu. Second, the service is very slow and negligent. I had to get up and tell the bartender that there was meat in my food. She took it to the back and they brought me out a new plate...not sure if they actually cooked me a new plate or if they just removed the chunk of meat. I'll give this place a second try since I'd like to have their Pad Kee Mau (drunken noodles) and Massaman Curry."], ["dayne k.", "I've come here about 4 times because my gf really likes Thai food. We only come here because they're open late. She thinks the food rates 3 stars, I say 2. Service is consistently HORRIBLE. it seems to get worse with every visit. This last time will be my last time here as I cannot take being treated like this anymore. It seems like we're bothering the server who is here all the time. The other 2 servers were a little more friendly but seemed to keep \"forgetting\" to give me things like utensils or napkins. Asked each server for napkins. They each said ok and walked away and never came back. 5 min later I walked up to get it myself. Brought our entrees before appetizers."], ["Ryan D.", "We come here quite a bit and I think we are going to stop. This place is very inconsistent. The summer rolls are hit or miss. The yellow curry is different every time we come. They don't seem to understand that you can have vegetarian with out tofu.The stuffed chicken wings were good the few times we got them. The Thai iced tea is good. Atmosphere is expected. Customer service is standard.Just not worth the price and varying taste and quality...You will be missed. Time for a new Thai restaurant.(Phone review)"], ["Linda M.", "I've been craving coconut soup so ordered take out and got the chicken larb, seafood tom kha gai, and brown rice.  It was my first time there. Super cute restaurant. Nice but casual. It would be a good place for a date night. My order was ready after 10 minutes and the little service I required was quick and friendly. The tom kha was delicious, full of seafood, and big pieces of shrimp. I just wish they would strain out the inedible pieces of lemongrass and Galangal. The larb was ok, but it was a little bland. The piece of raw cabbage that was included was the bottom core with hardly any leaves attached and it was black on the bottom, a little gross. I guess I'll get the tom ka here but the larb at Bangkok Chef."], ["Heberto G.", "Quite possibly the best Thai restaurant on all of Oahu. Everything we've ordered has been excellent. We especially like the seafood dishes and they spice it to your liking. Easy to park your car there, unlike most other restaurants on the island that have very limited parking. Additionally, the restaurant has a lot of tables, easily accommodating many patrons. The waitstaff is prompt and courteous. We find any excuse to go eat there. Try it, you won't be disappointed."], ["Lisa W.", "The food is great!  Tonight we had the stuffed chicken wings, pad Thai noodles and fish fillet!  All yummy!  We've been there three times in two months already.  The service is great with one exception.  The waitresses don't offer dessert to you.  They just bring you the check.  I know they are busy and have a crowd waiting, but sometimes I would enjoy a dessert if offered."]], "Phuket Thai Restaurant": [["Ryan L.", "My wife and I got the calamari to start, which was OK but not spectacular. On the recommendation of the waitress I got the crispy chicken, expecting it to be similar to some crispy chicken or pork I've had before. This was much closer to American southern stylr fried chicken. Which was good for what it was, but definitely not what I would expect at a Thai restaurant. To be fair, my wife had the Thai Garlic with chicken, medium spice, and that was pretty good. If I was  rating her meal I'd probably give it three or even four stars based just on the main.Be warned that the portions are huge. Most people could easily share a main dish."], ["Joyce L.", "Phuket Thai has been around for a long time. This place used to be busy. Tonight however I was the only party dining in. Where is everyone?Service used to be like fine dining too! Servers used to be neatly dressed and treated you like you were at 5 stars restaurant. They would check multiple times if you needed anything. Fortunately food was the only thing that was same as I recall. I think they used msg cause my family were super thirsty after dinner. So I did give 3 stars. Do you remember I said I was the only party dining? 2 of the server were unprofessional which I won't go into detail. I had to ask for takeout boxes for my leftovers. I missed the old Phuket Thai."], ["A S.", "the original still has the best service and food--Mililani could give it a run for the money and Ward area one suffers from too much bar focus and not enough back to roots that Made P Thai an island charm.Last visit to this location was 4 star --eggplant and tofu always a pleaser......"], ["A V.", "I go here often. Like, so often I'm a little ashamed. So often that they KNOW my order when I walk in. I need to chill on the pad Thai.Food: I always get the same thing soooooo it's obviously awesome. Chicken pad Thai, no bean sprouts, no chives (clearly I am a weirdo veggie hater) I love the spring rolls, I love Thai tea. Sometimes I do chicken satay but that can be hit or miss. Service: attentive and fast. I can run in during lunch, mow down my food and be out in 20. Not great for digestion but great for a lunch break. I've been here at dinner time too and they're on it then as well. The space is cozy, it would be good for date night or a family outing. It's BYOB so that's awesome. Thank you Phucket for feeding my addiction to pad Thai, you're my fave."], ["Betsy P.", "I ordered snow crab legs, it was described to be in a yellow sauce. They brought this red, runny, eggy, tomatoey sauce instead. I tried to eat it, but it was not tasty to me, besides the point, it is NOT what I ordered not what was on the menu. I wanted to say something but we were in a hurry and I was let down, it was a lil pricey for lunch too ($15 not including rice). I guess I should have spoke up, but I  kind of expect to get what was on the menu . Plus we never get to go out to eat so I really wanted it to be yummy"], ["Nicholas L.", "Let's be real about this..Phuket Thai is maybe the 4th best Thai restaurant within a 3 mile radius.  It's a fair place to dine in or take out, but there is nothing compelling about the menu that makes you say, \"we gotta go back and get that one dish again.\"So if you're in the mood for Thai, Phuket Thai is just that.  It's BYOB, which is a bonus, but I'd only go out of convenience, NOT because of the menu."], ["Meemz S.", "Wish the spice level here was consistent. I come here ALL the time, different times of the day. I Some days I order Thai hot and I find myself having to add more heat. Some days they're WAAAAAY hotter than normal.  I know everyone's spice tolerance is different, but if the establishment could agree to the same level of heat,  the consumers know what to expect. There's another Thai place I go to and I know what to expect when I order Thai hot and I can handle, but here, like I said, some days it's not so hot, some days (like today) it's waaaaay too hot.... Three stars for service and taste. Staff is very accommodating. Parking is... Tight."], ["Jeremy W.", "I am sad to leave this 2 star review for Phuket, since in the past I once considered them to be my favorite thai place on the island. After my experience last night I don't think I will be going back.I called in a phone order for takeout. It was so loud in the restaurant I had a hard time hearing the girl who answered the phone and she seemed to have a hard time hearing me as well. The first thing I ordered was vegetarian yellow curry with tofu. She told me that there was meat in the sauce, and asked \"is that ok?\" I thought I had misheard her, so I asked for clarification. As best I could understand apparently the curry has shrimp sauce in it, which really disappointed my vegetarian father who has eaten there 10 or 12 times now. I tell the girl on the phone that I would call her back. We discuss it and try calling back. Its still equally difficult to hear anything over the din of noisy diners in the background. After much communication difficulty we find out that they can make the yellow curry without the shrimp sauce. We order that, plus two other dishes and even repeat the order multiple times to make sure she understood it and got everything right. I would like to add that the girl on the phone was very nice (and I don't blame her for the horrible background noise that makes her job nearly impossible to do.)So we arrive at the restaurant 25 minutes later to pick up our food. Turns out that she totally couldn't hear us and screwed up the order. In fact, the only thing that was right was the vegetarian yellow curry. Our order of long rice salad turned into a long rice strie fry, and somehow our order of seafood with spicy lemongrass sauce became tom yum soup with shrimp. We let them know about the mistakes and they comped the soup for us, but we were still disappointed that we weren't getting what we wanted. I think they should have comped both the messed up orders. If they had they might have retained me as a customer. We took the food home and pledged to make the best of it. Leaving the mccully shopping center took 10 minutes because the nightmare parking lot gets pretty crazy on friday nights. Finally, the vegetarian curry was pretty bland. I suspect it was the lack of shrimp sauce that made it less good. So in a way, it was out own fault for ordering it without, on the other hand the restaurant should have a tasty recipe for vegetarian curry that DOES NOT include meat or seafood products. TL;DR- Vegetarians beware of this place; All others make sure they read the order back to you at least twice when ordering takeout."], ["Kathy Y.", "Had the yellow curry, pretty basic. I ordered it mild so it didn't have much flavor... Partly my fault I guess for not ordering something with more spice. Seemed pretty popular with the locals. Price was OK but if you wanted rice that was an extra charge."], ["Izumi K.", "I like this Thai restaurant because it is BYOB and food is reasonable. Everything is good. I recommend their green curry with sticky rice. They can make it mild if you don't care for spicy food."], ["Violet T.", "We came here for the dinner without reservation. Just waiting for 1 minute. This is the third time I've been here. The food is delicious. Good services."], ["Darin O.", "I came here a few times with work friends.  I am not a Thai person and would not chose a thai restaurant if I had the choice to eat there or somewhere else.  I would literally chose somewhere else if it were up to me.So- one needs to take my review with a grain of salt and a spoon full of rice to help calm down the spice pallet.We ordered as a group, red and green curries, 3 different pork, 3 different chicken, one beef (I wish there were more beef on our outings but it was what they like and I kept my nose out of it regarding ordering) and spring rolls, noodles, thai noodles, rice noodles and noodles- what up with the noodles- and ohhh yeah jasmine rice for good means and measure.  The curries were on the hot side- not a tastey meaty taste to the dishes- even the beef.  But a hot spice taste.  I do not like that and was glad that there were rice to cool down my tongue.  The inside is cozy- read small.  Tables are well suited for dating couples not really outgoing groups from work- you get comfy and cozy with your coworkers if you do though.There is usually a wait time that is ridiculous for the quality of the food IMO.  It is a small restaurant and it is understandable that people have to wait at the peek hours which we seem to always go at even though we know it will be crowded.Parking is a pain in the butt.  The parking has only gotten worse with more traffic.  Service can be hit or miss- there must be a cultural aspect that I am missing- but we are in HI and people can just be rude or busy sometimes.Again- I would not go in by myself but if it was a date or a special event from work- sure- I can eat and nibble and not make a fool of myself even though I think the food is spicy."], ["Fran C.", "The very first time I ever ate at a Thai restaurant, I ended up at a place called - Keo's Thai Cuisine. One of my good friends decided to treat me for a Thai meal, and I guess due to my dining experience at Keo's, Thai food was definitely off my list for a very very loooooooooooong time.This all changed after one of my good friends, Byron turned me on to - PHUKET THAI!When I first dined here, I still had my reservations about Thai food, until my friend told me about their lunch specials that they offered at the McCully Shopping Center location.When I had one of their lunch specials (see pic) which consisted of - FRIED CHICKEN (Bing, Bing, Bing, Bing, Bing!!!!), Mixed Vegetable Stir Fry, and Rice (your choice of Brown, Jasmine, or Sticky Rice)...........I was totally hooked!I think I was mainly hooked once I got a taste of their Fried Chicken, cuz I'm a hard working, Fried Chicken eating kinda guy! Lol!They offer other fixed lunch specials, but basically I'm here for this particular lunch special which cost just about $10 bucks! How can you go wrong????The chicken is crunchy on the outside..........and all so juicy on the inside. They give you two pieces of deep fried goodness! As for the veggie stir fry, they offer it mild, medium, or Hot spiciness........and I'm talking so HOT, that it will make you sweat like a pig when you eat!It is quite entertaining when I took my co-workers here to eat two Friday's ago.......... We all ended up taking the lunch special, but I was the only smart one who took my veggie stir fry with the medium spiciness.Both my co-workers took their veggie stir fry to the maximum HOTNESS, and I had the pleasure of watching one of my co-workers sweat like a pig while he ate his meal! Also, they couldn't fill his glass of water fast enough due to the spiciness of his meal! Everyone ate up, and enjoyed their meal...........we will be definately coming back for more in the near future! Just a tip, there is not too much parking in the open air parking lot of the shopping center, but for you folks that don't know this...........there is an underground parking lot under the building. You have to past the taco-bell at the corner, go up the street just past the side of the building where you will see a ramp, which leads to the underground parking. Check 'em out gang!"], ["Johnny C.", "This place had a junk chef. I ordered basil green bean and tasted no basil. Too much oil in their stir fried dishes. Ong choi was oily. Ok basically This Thai place is like a chop suey chinese place with some Thai spices. Phuck it Thai is the perfect name for it. God I'm so tired tired of going to crappy food places . It's like playing Russian roulette. The owner or host had some issues too. Just not very friendly.  Parking sucked a fat one too."], ["Liana F.", "5 stars my first visit and it keeps going down every time I'm here. Absolutely dislike the service here. They're not knowledgable at all. I asked for what kind of whole flounder they have, the waitress answered me back, \"I don't know.\" Okay, so who tells their customer they don't know what they serve?Portions got way smaller my last visit here. I was hoping to really enjoy this place because their food tastes authentic and it's flavorful!"], ["Leelu L.", "Best chi tea in town.  Service is amazing.  Loved the curries.  This is the first place I've been that I had to go back to in a matter of a few days.   I'm in love.  Oh and the spring rolls are killer."], ["Dulce R.", "Why yes I've been eating so much Thai food lately.My friend and I took another friend to eat Thai food for the first time and I'm so glad that she enjoyed her first experience!We split the ordering to stuffed chicken wings, green curry with tofu, and pad thai with beef.  Although tofu is not listed on the menu, you can ask them and they'll be able to provide it for you!  The stuffed chicken wings were ono and thoroughly cooked.  Green curry is my usual and doesn't disappoint.  Although it was a bit runnier than I wished, the proportions were enough to make me feel guilty for eating too much.  When ordering sticky rice, I suggest to not order too much (especially if you have another starch).  Two orders were ordered and it came out to be a big bowl.  My friend eating Thai for the first time took her first bite of the pad thai and said that it was so good, she tried to hold herself back.Our waiter was very respectful and did his job well.  If anything, maybe it wasn't his day because he seemed a bit grumpy.  We were able to split the check equally in threes.Enjoyed my experience this time and I will come back here again.  (Hopefully my service won't be as bad as the other reviews given.)"], ["R C.", "OMG Can we say disgruntled server??? We were sitting there and we almost walked out. First off when we first got there, he said \"can I help you?\" Which in code was like, get the *&^% out b/c I'm really busy right now.As a patron, I am soooooo accomodating and really do not like to bother servers when I see they are busy, but this was unacceptable. The guy was banging all the fridge doors and banging all the glasses in the back as he was getting our drinks and he was dang cussing! Even the table next to us gave each other a look  and was like \"what the???\"I don't know if he was pissed off bc they were short or he was having a really bad day. Wow, it was so not welcoming at all. Aside from that, the food was great! Would definately go here again. We had red curry, fried chicken and a rice noodle dish and everything was excellent. I would have given them 5 stars but the waiter was totally unprofessional and made me very uncomfortable while there."], ["Craig H.", "Granted everything in Hawaii takes a long time that's just the way things are and you learn to accept that but there is a difference between acceptable and waiting one hour for a total of two entrées one of which was soup.  Overall for Thai food this place is pretty average and the prices are average as well unless you have a lot of time on your hands I do not recommend coming here you can only wait so long for your basic Pad Thai dish, especially when the servers don't come over to tell you they're running behind or apologize."], ["Tori B.", "This has been one of my favorite Thai restaurants on island for the last seven years. There really is something for everyone. They have the most extensive menu of any Thai place I know and really, everything is yummy. Sure, I have some favorite dishes, and I do return to them frequently, but this is a place where I consciously try new things because I trust they will be very good even if they are not my favorite thing ever. Their spring rolls and stuffed chicken wings are my favorite appetizers. If you like curry, you can't go wrong. It seems they do something special with each of their curry sauces so they do not taste the same as anywhere else. I think the Massamun Curry is my favorite, with its healthy serving of large, melt in your mouth cubes of beef. Panang Curry is a close second but really, I have returned to all of them more than once. My spouse loves the Green Curry. Their servings of fish, seafood, shrimp and beef are more generous than most other places and well worth their extra price. Other dishes worth note include Thai Elegant, anything cooked in their lime sauce or garlic sauce, anything with basil in the name. They have a seafood soup that is overflowing with fish, shrimp and crab that is quite the filling bargain. Desserts are worth saving some space. Tapioca and sweet sticky rice being my favorites. Writing this review, I realize I need to try more of their noodle and rice dishes. They are usually my go to dishes if I am at a mediocre place, and I have never felt the need to fall back and try them here. I bet I am missing out. They are a vegetarian's paradise. Many options, in fact, almost any dish can be made vegetarian if requested. The service is usually best at dinner time but the lunch specials are the best deals. Also, they do not close in the middle of the day, so when you want food between 2-5, you can count on them. My main minus? The kitchen can be a bit inconsistent depending on who is cooking and sometimes I have to beg them to make my food spicy, and I mean nuclear spicy. Like too many Thai restaurants, they just do not seem to believe me when I say, \"I have never sent a dish back for being too spicy and I never will.\" The servers who have already served me once, they remember how hot I want it. Getting a new server to convince the kitchen you want it Thai hot however, can be an exercise in futility. A tip, if you like it hot, ask for the pepper cart after you have been served. They tend to remember you after that. One other minus, this place lacks the family touch that can make many other Thai restaurants special. You know what I mean? It isn't like mom is in the back room cooking something special just for you. That one little detail has us venturing out to other places and giving them a try. That is not a bad thing. There is a lot of good Thai food on this island and it is worth the quest to find your favorite. In my experience, Phuket Thai excels at the most things while playing it safe enough to introduce people to Thai Food. It is our go to place to bring friends who do not know their way around a menu. If you are looking for a three course family meal, or just an order of curry and rice, they do it right. The general rating seems low for Phuket Thai but you will see after a quick search that most Thai places have similar ratings. People really do have their favorite places and if another does things different it just does not stand up in their eyes. I respect that. Thai Food is like jazz. People cook around a theme but everyone does it their own way, perhaps you like Davis better than Coltraine. Fine. I can dig it."]], "Bangkok Chef": [], "Keoni by Keo's": [["Brian L.", "I ate here a few times just because....and after a few weeks in Wikiki I have to give Keoni some shout out props after experiencing food out for a few weeks this place was a pleasant surprise. The breakfast ...  The food came quick the service was very good and the prices were sane for Wikiki. A good quiet spot for breakfast and  the lovely well endowed naked mermaids you notice later whilst sitting at your 80's glass top table are a treat. The Dinner ... The food came quick the service was again very good and the prices were solid  for Wikiki. I enjoyed the Pad Thai and salad wraps. Keoni is just  a quiet relaxing place to eat while everything else seems crazy overpriced and touristy with long line ups wait times for no reason other then it's 7 pm and everyone wants to eat. So ... If that's you and it's 7 pm and you just don't feel like fighting the fight for stardom and fame in a well know hotspot for recognition that you ate there status updates on Twitter and Facebook. Look no further than Keoni!!!"], ["chris m.", "curry. solid and tasty. good heat on the medium spice. we loved the crispy noodles. pad thai was okay but medium heat lacked any real spice. oddly. the side deck is nice but was too windy to continue. service was great."], ["Binnie N.", "My boyfriend and I tried this place for the first time at kind of an odd time. We were the only table there. It was a late lunch/early dinner meal. We both got curry dishes. My boyfriend's green curry with beef was really good while I had the yellow curry with chicken and greenbeans. Service was obviously great. I recommend sitting on the patio to people watch. =)"], ["C. C.", "Really not super impressive for the price we paid. And when you automatically get charged 17% tip for a party of 3 adults and 2 children it kinda ruins the experience!! I understand we were a party of 5 but we didn't even order any drinks and only 4 meals! And again for the kids ... Really? Oh well"], ["J G.", "First off the breakfast was pretty good. I wish they served a little more but it does kindve fill you up. I had the 3 egg omelet with a side of pancakes. If you're having the pancakes, get the coconut syrup, it's the bomb and you'll thank me later. The omelet was stuffed with cheddar cheese and Huli Huli chicken! Mmm mmm mmmmm. Try it if you're in town some time."], ["Karen C.", "First timer during a staycation. Had brunch and unfortunately during our stay the weather was not the best (humidity at its worst) So ordering yellow curry may have not been the best choice but besides the heat food was excellent. Special #3 - 3p French Toast, 2p Bacon & 2 eggs:I love me some eggs and bacon. Plus I hear good things on their coconut syrup so I had to get my usual breakfast go to, French Toast. In general breakfast taste pretty much all the same however, this breakfast tasted more homemade - reminded me of my moms cooking. And they were right syrup was on point! It's actually addicting Yellow Curry with Crispy noodle:I'm not so big on curry (probably because I can't handle much on spicy food, seriously Italian sausage on pizza for me is hot!) but I will always try something and this was Good! Just enough spice that I didn't need an entire glass of water to tank down. Decent portion. (Lunch starts at 11pm). Over all great experience, friendly staff, tables were clean however, floors were a little on the sticky side."], ["Erin A.", "Just happened upon this place because everywhere else had a wait on a Thursday night. Sat us fast and provided deli our drinks and food for the 9 of us."], ["Grace M.", "Delicious food and friendly staff. I enjoyed the pad Thai noodles. My husband enjoyed the drunken noodles... Even though it was not on the menu the chef was happy to accommodate his request. This is our 2nd visit to the Restaurant and when we return to Waikiki we will be sure to go back. We sat on the outside tables... Very private and beautiful."], ["Vicki s.", "First what is not to like about this beautiful Stylish open air restaurant. The staff is absolutely friendly, they recognize you each time you come, making this very inviting. The Breakfast is fantastic! They have fresh banana pancakes with either regular syrup or the famed Coconut Syrup. Macadamia Nut pancakes, best I've ever had. They had FRESH Blueberry cinnamon pancakes that were amazing. Side items like hash browns, bagels, cereals, meats. All at very reasonable prices compared to other places around Waikiki Beach. They have amazing Omelets, which the staff is eager to help you make it exactly like you want it. They have a large varied Lunch and Dinner menu as well.Great breakfast prices starting at $4.50 for a huge plate of pancakes! The food is great, the staff is great, the owner was there most mornings and a pleasure to see and speak with. Highly recommend this restaurant!"], ["Ed L.", "Keoni's by Keo is noted for its great & cheap breakfast, but I was here with a friend on a Saturday before the 2014 Honolulu marathon for a late lunch. Being that we both are Thai junkies, we made our way here for some awesome Thai cuisine. I learned that my friend had lived near Bangkok for a few years, so she knew a thing or two about Thai spicy hot. I later learned, through the menu, that only a bunch of dishes were Thai, and everything else was a hodgepodge of dishes from various parts of the world.With that in mind, we were craving Thai cuisine and needed a spot close to the Hyatt Regency Waikiki hotel, within walking distance. We even asked the hotel concierge for help, but without avail. Enter Yelp. We searched for a good Thai place and came up with Keoni's by Keo's. We walked here from the Hyatt Regency Waikiki and it was just about 2 short blocks. There wasn't really any places to park, so best bet would be to walk it, if you were staying in at a property nearby. If not, the public transit would be your best bet. Bus routes #2, 8, 13, 24, 42, 19, and 20 runs and services through Waikiki. This is my first time here, so I read the reviews and hope that it would be a good one. And it turned out it was good. My friend and I arrived here around 2pm, after a morning session of the Honolulu marathon expo. We settled down into the restaurant and chose a spot next to the entrance, so we could people watch as well. Keoni by Keo's is a small restaurant, but a nice restaurant to be in. Nestled in the heart of Waikiki at the Outrigger Ohana East hotel on Kuhio Avenue, there wasn't any line to speak of. Probably because it was already 2pm and the lunch crowd had left and gone. Keoni's by Keo accepts major credit cards, so that's always a good idea.  The menu here is not as extensive as I previously thought, but there was some Thai dishes here. They even serve Pho, a Vietnamese dish, which was a little surprising. While I probably won't come back here just for the Pho, knowing that they do have it here is good to know for the future. The prices here are decent, comparable to other options outside of Waikiki. While this place is not your idea of fine dining, it's definitely a good choice for your cravings for Asian cuisine.The service here was pretty good and typical. My friend even made small talk with our server, and I just smiled. While we were eating here close to 2pm, the wait for the food was about 10-15 minutes, which wasn't that terrible. The restaurant ambiance was definitely casual comfort, which made everything just happy and easy.  I ultimately ordered the eggplant tofu dish, thai hot, with sticky rice. I figured that would just be the standard for anything that Thai food lovers can enjoy. I know there's the Thai curries, but almost all Thai restaurants I have frequented have some sort of eggplant dish, so that's that. Lol The portions here are limiting for the prices, which could be considered overpriced. Then again, the dish was delicious and definitely worth the spicy taste. The sticky rice hit the spot. Haven't had that taste in quite a while, so that just made me smile even more. The overall experience at Keoni's by Keo's was nice. Quiet ambiance, since the restaurant wasn't full, so it was just a nice lunch with a friend of mine.No Pad Thai. I found that kind of odd, but whatever.Support local!B"], ["Tommy G.", "Someone recommended this place; it's supposedly good. I was starving so I opted for this Thai restaurant that's close to the Hilton. Well, my blond waiter is unwelcoming (no smile! And seems perturbed when I asked something on the menu), no one was refilling my water or asked if I need something else,there were tables around me with no food from 20 mins of ordering, i was ready for the bill & no one seems to notice that I'm done eating, the food is OK. If the service was good, I would have been fine with the mediocrity of the food. I miss the #sanfrancisco #siliconvalley #California great restaurants with great service. This one is not a Thai restaurant IMHO:..and as of this  writing, a lady is upset that no one came back for her bill so she went directly to the counter. I should also mention that my left over fish salad was not boxed for me!  I hardly ate the dish! My waiter took it back to the kitchen and never came back with my left over (pictured). I ended up leaving without it. Argh!! This is one expensive $50 meal/dinner for a sad experience. And just to let you know, I still gave the waiter a 10% tip because I'm considerate."], ["Tootie A.", "I came here a couple times for breakfast mostly because of the convenience of the location being right by the hotel I was staying at. The breakfast here is very good. I had bacon, eggs, rice, and french toast. The service was good and the prices are reasonable. I would come here again."], ["Krysten I.", "I've been to Keonis a few times now. I've only ever been here for breakfast, and I always feel rushed in and rushed out. There is a big menu board out front, where the happy tourists like to gather and make the place look like there is a 20 person wait. In fact, the restaurant is quite large and every time I've gone, despite the throng of people in gathered near the entrance, I've been seated immediately. I wouldn't recommend getting seated on the \"ground floor\", as the birds like to jump on the unoccupied tables and eat the crumbs on the tables closest to the open doors. The tables aren't wiped down before people are seated too.....kinda gross. The boyfriend ordered the eggs benedict with a side of bacon and I ordered the All American breakfast with bacon, eggs, rice and toast. The food was okay, prices are on the higher side, but that's what you have to expect in waikiki. Like most places in waikiki, there is pretty much only street parking, so it is very difficult to park. Luckily I live in waikiki, so I can frequent Keonis and not have to worry about parking. I don't think I would have gone as often as I have if I had to find street parking.Service was hit or miss. The waitresses aren't very friendly. There is one hostess that is sweet and pleasant, but the others make you feel rushed. I want to come back for the Thai food during lunch or dinner sometime. I love Keo's, so I expect it to be similar. However, the service is probably not as good at Keonis."], ["Emme K.", "Great spot for breakfast open early. Service was friendly and quick and I got my fill of fried rice and french toast with coconut syrup. Variety of Breakfast specials to choose from."], ["Yuna D.", "Please don't come here if you're looking for an extensive list of Thai dishes; there isn't that much. It's just stereotypical things like Pad Thai, Green Papaya Salad, and Panang Curry. Drunken Noodle? No. Pad See Ew? No. Pineapple Fried Rice (esp. since you know, we're in Hawaii?) No. They don't even sell Pho everyday (there's this stupid green side, pink side menu that people can order off depending on what day of the week it is). Pad Thai was typical...definitely not memorable. I got the Thai Basil with Beef, and didn't get that much basil. Medium Hot was way hot, and that's a lot considering I'm Korean. Crispy Spring Rolls wasn't memorable either. Cashew Chicken seemed like the most decent thing to eat on the menu because they use an a lot of cashews. Yum.Service was decent, but the items are quite pricey given the type of food they put out. Also -1 star for having rice (2.95 for white rice) a la carte. I don't think that's ethical for some reason...lol.tl;dr missing lots of core thai dishes. Rice is a la carte. Kinda pricey too."], ["Jared K.", "I can't wait to go back to Oahu just to eat breakfast at Keoni. We ate here every morning, and I agree with the other reviews about the awesomeness of coconut syrup... hmmm..."], ["Rory K.", "Walked in at 1130 am for early lunch.  Had Panang Chicken  curry - asked for it to be hot.  Was absolutely perfect.  Nice guy running the place - menu will work for anyone - American and Thai.  Definite return."], ["Barry S.", "We've been coming here for years but no more. The food was fine. The waiter was the most incompetent idiot ever. 3 requests for cutlery delivered one fork - for two of us! He returned from the kitchen to ask what we ordered - despite writing it down. We had to walk through the restaurant to get the drinks which he forgot to deliver despite being asked twice. Finally on our departure we complained to the manager who gave us attitude. Don't go here."], ["Kristine C.", "**Review is based on breakfast**I've always wondered about this place since I walk pass it all the time. From what I've heard before coming here, the over all experience is suppose to be Thai food dining. And so a couple of friends and I decided to try this place for breakfast.First, customer service is on par. Our server was prompt with everything we needed and is definitely friendly. I liked the variety of their breakfast; however, the breakfast was according to a semi Americanized/local/Japanese style cuisine. I was a little disappointed because I was expecting a Thai breakfast style for my first dining experience here. However, I had the pleasure of trying their Mahi Mahi breakfast which contains two egg battered Mahi Mahi (side of tartar sauce), two sunny side up eggs, white rice (or you're also able to have corned beef hash). The Mahi Mahi lacked taste to me so I had to get my side order of onions to add taste to my dish.The prices were not bad. If you ask me, I would prefer breakfast elsewhere and will for sure be back here for the actual Thai dinner experience. Breakfast may not be their forte.Please stay tuned for the dinner review."], ["Tim S.", "I have enjoyed Keoni's on several trips to Hawaii.  Just ate there again this week (July, 2015).  It was as amazing as ever.  The food is outstanding.  The Crispy Noodles are unbelievable - and the curry is fabulous.  Don't miss it."]], "Chiang Mai Thai Cuisine": [["Al D.", "Not my favorite Thai but still very reliable. I like their satay tofu and their green curry. Cute but dated seating area. Parking is so so."], ["Florence K.", "Once upon a \"Thai\"-me, my boyfriend and I were looking for something to eat one night and he wanted Thai food. I was really hungry and perhaps just lazy and \"Thai\"-red to look for a place, I picked the first restaurant that showed up in my search for Thai food. Chiang Mai came up first and to Chiang Mai we went. Parking is plentiful behind the building, but for those who are a bit scared, there are tents up that the homeless live in lined up on the sidewalk. We entered into a pretty empty restaurant and sat down next to the windows, where the seats are traditional Thai triangle cushions.For our appe-\"Thai\"-zer, we decided to order the Chiang Mai BBQ Cornish Hen (Gai Yaang), because it would be something new. Cornish hen?! Is that good?! Let me tell you, it was so delicious!! The meat was so juicy and had good flavoring, but when you add the sauce they give you on the side, it was to \"Thai\" for. Yup. I could've eaten this whole dish as my main meal if I hadn't ordered something already. That sauce killed it though. It was just \"Thai\"-riffic. It was like a mixture of fish sauce, lime, cilantro, and Thai red peppers all mixed together to form a heavenly dipping sauce. I HATE cilantro, but I loved this sauce. P.S. Does ANYONE know the exact recipe to this? I want to my own supply of this, enough to make a \"Thai\"-ranosaurus Rex full! I don't know why, but I ALWAYS order Pad Thai whenever I go out to eat Thai food. I don't know if it's because it just always sounds so en-\"Thai\"-cing, or if I'm just so lame I don't want to \"Thai\" something new. So...I ordered the Pad Thai here, medium spicy. It was good, a although not the best I've had. The dish was a little sweet for my liking and definitely could've used some heat. I also got to try a bit of my boyfriend's chicken pineapple curry which had really good flavoring. The food with the glasses of yummy wine we ordered as well as great service made the en-\"Thai\"-re meal amazing. I'm definitely coming back to have some more of their food. But for now, my tongue is getting a little \"Thai\"-d up trying to say these Thai puns."], ["James F.", "Kind of disappointed in this place. I always like to support the businesses in the hood but not the best experience here last night.  The food and service here are fine I mean its pretty hard to screw up thai food if your a thai restaurant right?  Green curry, red curry, yellow curry... but when you have a special card taped on the menu and hand written on the \"special\" board at the entrance of the place its kind of important to not screw it up. \"Dungenous crab curry\" was the special I zeroed in on. Pretty specific right ? It didnt say crab curry, snow, blue, king or otherwise it said clearly Dungeons.  So when they served me a pile of onions and peppers dripping with oil and what appeared to be a broken curry sauce with snow crab parts under it all, I had to ask the waitress \"is this dungenous crab?\" She replied with little hesitation \" no its not, we only serve this kind of crab here anymore\" and so it went... I do not hate snow crab so I decided to give it a try instead of returning the order.  Bad idea :( I tried to eat a bit of the crab but gave up after realizing the amount of oil I would have to consume in the process would not be worth it.  I will be hard pressed to give them another chance. It just seems like bad business to pull this."], ["Anna R.", "Got seated right away. Started off good, but went down hill. We ordered, I asked for no peanuts sprinkled on top, she said sure no problem. When our food came there was peanuts sprinkled on mine but not my friends. My friend told her it was backwards and the lady told us we were wrong and started to argue and what did it matter, I could scrape it off, and she walked away. Seriously? That was her idea of good service. It wasn't busy so they could have easily made another. Not wanting to be confrontational and end up with who know what in my food, I decided to deal with it. My food was ok. My friends food was barely warm. The peanut sauce was not good. For a place that is supposed to be authentic Thai, it was not good. There are many other places I have been in the local area that are 100% better."], ["Jozlyn H.", "I love how they have the option of choosing medium, hot or thai hot...... hot is perfect... I was tempted to try thai hot.  Maybe next time.  Service is great, environment is nice, food was awesome and prices are reasonable.  There's ample parking in back and lots of street parking. Not sure why I haven't frequented this place more."], ["Olivia M.", "First time here, lounge-y booths and bomb food. Got the vegetarian curry noodle and the spicy tofu dish. Amazing... Can't believe I've never been here when it's so close to my house."], ["Jolene K.", "Great location. I was told that there's a lot of parking in the back of the building, but we had walked here since our apartment is nearby. Food was great here! The spring rolls were my favorite! We had asked for a medium spice level because that usually would be enough.. but we couldn't taste any spice at all! Next time we'll order spicy!"], ["Bbq J.", "Came in and got seated instantly. Had to wait a while for the server to come over and just take a drink order. Ordered the green curry and chicken pad Thai and a soft drink. Food was good but over priced for the small portions. It's slightly better than Bangkok chief but twice the price. Also no free refills on sodas???? Really?"], ["Ann N.", "I've never had the green papaya salad here and I am a lover of it. Unfortunately, it was only so-so. Heavier on the nam pla (fish sauce) and not much lime tang. I also like my papaya more smashed so all the flavors get inside the papaya not just sits around or under it. Not so here. :(For green papaya salad that's yummy, go to Pho Tri. They add shrimp in theirs as well."], ["Lydia T.", "This review is long overdue!   My husband and I have been eating here for years!  The food is soooo delicious!  We are always greeted warmly and needless to say, the service is outstanding!   We always take out of town guests here, and our daughter looks forward to eating here when she flies in from California.  I prefer to eat here rather than some other $$$$ restaurants where the food is not as good and the servers are arrogant.   We love the Spring Rolls (crunchy and filled with deliciousness), pad Thai/pad Siu(you will want get a second helping), crispy stuffed chicken wings (delicious), eggplant with tofu, on choi with black bean sauce!!!  Don't forget to have the warm tapioca for desert!Never a problem finding parking in the back or on the street."], ["Geno P.", "Held off a few months to write a review, but now after our fifth visit I can honestly rate a fourth star for this awesome Thai restaurant!!! This is easily our favorite Thai food on the Island, and we drive all the way down from the West side to eat here.A large factor is the owners are from North Thailand, and you can taste the difference between this food and a lot of other Oahu Thai joints, which tend to be owned by Laos. Recently we had guests in from Thailand for a week, and after we took them here, they insisted on returning every night for dinner. They loved it that much. It's also notable to watch yourself when ordering spices here. This place is NO JOKE. We brought one guest here who prides herself on handling the spice, and they kicked her mouth in the ass! And she still raved about the food and took home the leftovers!Highly recommend the Evil Beef, Pineapple Fried Rice, and Thai Noodle dishes. The eggrolls, as well, are exceptional. The service is prompt and friendly, and the decor is about perfect. Our only criticism is how the restroom is outside the restaurant. Just can't give it a fifth star if you don't have a 21st century restroom.Otherwise - do not miss this place!"], ["Roxann P.", "Tried it but struck out.  Thai iced tea, bad, not sweet.  Spring rolls, bad, no taste but, yuk.  Basil Chicken, not good, no flavor.  I love Thai food but I will never go back there. Parked on King St. and walked past a bunch of homeless people in the park.  The bathroom was on the outside of the building and had about a foot or less between toilet and wall.  I am only 5 ft. 3\" and it was a challenge.  The décor in the restaurant was nice, with flowers and table clothes but still an old building and just OK service.Maybe we had the chefs night off or something, but it didn't taste like Thai food to me."], ["Jaswant A. S.", "Came here with some folks on a Sunday evening and we had a reservation for 7pm. Place was packed and even though we came on time we still had to wait till they cleared out a spot by the window facing King Street. No big deal though - this place has been around since before Thai food was even a \"thing\" or a standard ethnic food category expected in any US city. Just the fact that they're still around now that there is competition on almost every street corner means they must be doing something right. We ordered spring rolls as an appetizer. Those didn't last long as we were pretty hungry. For main dishes to share we ordered Red Curry with Shrimp, Garlic Shrimp, and some noodle dish that I can't remember the name of. Noodles were ok - I wasn't the one who chose it so I didn't partake too much anyway. Red Curry was awesome even though it was not too spicy - had to tone down things as I wasn't eating alone. Garlic Shrimp was tasty but it was a tad on the salty side so it ended up the last dish to get fully devoured. We enjoyed the meal and there were no leftovers - a good time was had by all. Service was adequate - a little slow but the place was packed so I can understand. Parking is plentiful along Stadium Park if their little parking lot is full - free if you come around dinnertime (past 6pmish I think) but rustle up some quarters if you're here for lunch."], ["Denise K.", "I absolutely love their fried spring rolls here. I don't know what it is exactly, but those little rolls are TASTY! They also give you a generous serving of lettuce, mint springs and cucumbers to wrap up your spring rolls.I also like their pad thai and their curries. The green and yellow curries are delicious. I've tried their pad see ew and I'm not a big fan of how they prepare their flat noodles, but overall, it still tastes great. The servers are pretty friendly and the girls wear traditional Thai dresses. They're so cute! There's a small parking lot in the back of the restaurant."], ["Anthony R.", "Excellent food! Second time here and will keep coming back. Try the green curry."], ["Chris C.", "This is my favorite Thai restaurant on this island.  I have been here a number of times and have always had a good experience.  There is a parking lot behind the restaurant and ample street parking on King Street.  The food is always consistent and nicely spiced, without being too crazy.  We always receive good service.  The stuffed chicken wings are to die for!  I am surprised that this restaurant is not more crowded, since it's so good.  Most of the time it's not full to capacity, and is a quiet and relaxing atmosphere.  The restrooms are a little weird since they are outside, but this isn't a fancy place."], ["Stephen C.", "Very good Thai food in Honolulu, the best we have had so far, after visiting 3 other places, we were beginning to lose hope about the Thai food here, hope restored, my wife got the Som Tom (papaya salad) which she said is really good, and she is picky! Also the Tom Yum Goong is really tasty, I got garlic beef and it is very good, warning if you don't like mushrooms let them know, because they load them on, staff is very nice also, definitely recommend!"], ["Marina S.", "When I was going to UH, this was one of my regular places.  Prices are good (especially for Hawaii), and the food was always good.  Whenever I go back and visit, I make a special trip to this place.  It's also a good place to escape from the high prices and generic restaurants of Waikiki."], ["Sharon H.", "A neighborhood gem that I had almost forgotten about, Chiang Mai once again is back on my radar as a nice spot for dining with friends in a soothingly Thai ambience.Familiar items like the stuffed fried chicken wings with a sweet chili sauce were happily still on the menu, and we also enjoyed the summer rolls with a delicious peanut-tee sauce.  To round out dinner for four, a medium-hot yellow curry accompanied by sticky rice and the ever popular pad thai noodles.  Portions could have been bigger, or maybe I was just being a little piggy, though we did leave feeling satisfied and with enough room in our rounded bellies for dessert. Pricewise, our total bill came up to $16 each including a glass or two of wine for one of the imbibers.  That left us with just enough cash to hunt for dessert in the neighborhood.  Parking after 6 pm on King Street is free, or Chiang Mai has a private lot behind the restaurant.  Check 'em out!"], ["Lori I.", "I got a surprise PM from Val Y. \"Hi Lori I., I am curious to see how similar or different the reviews of two Yelp strangers of different backgrounds, age and sex would be, after experiencing a restaurant together. I picked you because you are one of the few Yelp women with the balls to \"Y\" me in public. Respectfully, Val\" I pop him back this PM: Dear Val Y., What makes you think I would want to eat lunch with you? WHAT WILL PEOPLE THINK IF THEY SEE THE TWO OF US EATING TOGETHER!? You're lucky you are a FUCing[1] yelper, and since you have enough balls to ask me to have lunch with you....\"game on\". Name the place! -Lori\" [1] FUC=Funny, Useful, CoolJust trying to pick a place to eat with Val Y. was such a pain in the ass! He initially suggested Peace Cafe, so he obviously doesn't even read my reviews since I mentioned more than once that I am a CARNIVORE and that place is vegan! Strike ONE. Then he suggested Dee Thai but didn't bother to check if they were even open for lunch (they're not). Strike TWO. So I picked Sala Thai, called them to confirm that they would be serving lunch  @11:30 (sign says open 11:00am-2am)\" but when I got there, the gates were padlocked shut at 11:34am. Strike THREE! By this time my stomach is growling and I'm slightly annoyed that restaurants don't open at their posted times. I told Val \"FINE. We can eat at Peace Cafe\", his original suggestion. But as luck would have it, there was horrible traffic and by the time I got to Peace Cafe I was way too hungry and grouchy, and vegan just wasn't going to cut it (sorry Peace Cafe, maybe another day). Lucky for me, Chiang-Mai was right next door! BINGO. Located on King Street just past the McCully library, Chiang-Mai has been quietly serving Thai food for longer than most Thai restaurants, so they must be pretty good to survive this long, right? Val suggested ordering two dishes each to share family style. Okay, this is finally off to a good start - 4 dishes for 2 of us! After I started stuffing my face, these were his exact words: \"whoa girl, you can really eat!!\" (If you actually read my reviews, you'd know that I can eat...a lot) What did we eat?? Oh yeah: Papaya salad $7.50 yelp.com/user_local_phot… This was Val's choice since he likes healthy stuff. I've never had papaya salad before so I have nothing to compare it to, but it didn't taste anything like papaya and I don't think I'll ever order that dish ever again. But thanks for sharing. Evil Shrimp $12 yelp.com/user_local_phot… This was Val's other choice. Shrimp with bamboo shoots in a reddish curry sauce was good but not evil like Phuket Thai Evil Jungle Prince. The server never asked us how spicy we wanted anything so everything was pretty mild. Green Curry with chicken $9.50 yelp.com/user_local_phot… Bite size chicken with eggplant in a creamy green curry was my favorite dish of the meal. It was really yummy over the jasmine rice. Which brings me to my next point:Rice $2 I thought the rice came with the curry!? (I just ate at Sabai Dee and paid $7.95 and got curry AND rice). Pad Kee Mow with chicken $10.50 yelp.com/user_local_phot… The flat chow fun style noodles topped with eggplant-jun (?) and other veggies looked spicy when it arrived but it was all just an illusion. It was good, but not spicy and there was NO BROCCOLI! You gotta put broccoli in this dish! Pad Kee Mow was better at Sabai Dee. The place is cozy and cute (I could use more A/C though, it was hot), service was good, my water was topped off quite often, and I was happily stuffed when I left the place. However, I would rather go a few blocks down the street to Sabai Dee Thai, which had better prices, easy parking, bigger portions, lots of broccoli, and free rice.Definitely a dining experience that deserves a yelp review! Now go read Val Y.'s review of Chiang-Mai and see how the events unfolded in his eyes! P.S. If you are still reading this, I will tell you exactly what people thought when they saw the two of us eating together, because it just so happened that my friend Jessica arrived and got seated right next to us and said: \"Hey Lori! Are you having lunch with your father today!?\""]], "Pad Thai": [["Bradley A.", "This is our favorite Thai restaurant on the island. The staff is very friendly and the food is always good. My kids love the Pad Thai and fried rice. My wife and I love the curry... just pick one they're all great. If I had to pick a favorite I would choose the Evil Jungle Curry, but it's not by a large margin. I have never been disappointed. The restaurant is fairly small and the parking lot is tight at times, but that's common on this tiny island."], ["James P.", "Food - below average for a thai style restaurant.There are only a hand full, if that, here on the island. So sad indeed. I would recommend Siam Square on Lewers street in Waikiki. Avoid the Siam Garden cafe in Nimitz.The service and quality of the food is not consistent as Siam Square.Good Luck!"], ["John N.", "Being a resident of Aliamanu/Salt Lake, I always welcome new businesses to our decrepit Salt Lake Shopping Center. Tucked right between what I call \"Ghetto-way\" aka the worst Safeway in Hawaii and a worn but decent Longs Drugs Store, this restaurant isn't too hard to find. Inside, it is clean and welcoming. As I had a craving that night for some curry, I checked the Yelp app for any information. Surprise! A Yelp Deal. I've had good experiences with Yelp Deals before and this one isn't too bad so what the heck, lets eat here.I walked in about 20 minutes prior to closing and they haven't closed their kitchen yet. I basically committed a \"sin\" in the eyes of my dad, who is a chef, by coming to a restaurant this late. They were welcoming and kept the kitchen open for us. Our orders were a Evil Jungle Prince curry and basil chicken. Evil Jungle Prince - Next to Massaman curry, this is my second favorite type of curry. It is supposed to be a party in my mouth. Unfortunately, this wasn't the case. There was curry, there was the veggies and meat, but they should have mixed the cabbage with the rest of the dish, not pile it on top a la L&L Drive-Inn lunch plate style. Taste was a little off.Basil chicken - Barely any taste of basil chicken. Chicken was salty and overcooked. A bit rubbery in texture.The service was decent as the waitress did accomodate us and provided good service."], ["Justine C.", "Tried this place for the first time tonight, and it was awesome!  We ordered quite a few things:  chicken pad thai, chicken fried long rice, shrimp pineapple curry, fried stuffed wings, and chicken sateh.  My kids loved the sateh and the fried long rice.  I tasted both, and agreed whole heartedly.  The stuffed chicken wings were not the best I've had on island, as the stuffing was different from the stuffed wings I tried from another Thai place.  But they were still delicious and I would order them again.  The pad thai was also excellent in flavor.  I've never had thai curry before, but the pineapple curry was intriguing to me, so I ordered it.  I loved it!  The curry flavor wasn't overwhelming, the pineapple added a touch of sweetness, and the heat was just right for me.  My only disappointment with that dish was there was not enough shrimp in it for me.  However, next time I order, I'll order it with chicken, and hopefully the meat to veggie ratio will be much improved.Overall, I was very happy with the service for the take out, the price, and the quality of the food.  I will definitely be making this my go-to takeout place."], ["Trisha G.", "Having been on the Thai food kick lately and the location of this place makes it very convenient for me.  I've been there a few times now and often call in my order right after my late night class & rush over to get my regular fix of chicken red curry.  The Chicken Red Curry even at the mild heat level, is pretty spicy.  (Note that I'm not a spicy lover, so take that into account when ordering).  One negative is that rice comes separate and you have to pay extra for it.  I have also tried the Green Papaya Salad.  I am generally a fan of the dish at Thai restaurants, but when I ordered it for take-out, there wasn't enough fish sauce.  (Easy fix as a part-Filipino with patis in my cabinet).  Other good picks: Summer Rolls with peanut sauce was delish.  Stuffed chicken wings were also a good side dish to share.  Panang chicken curry is also a good pick.Because it's so close to my house, I bought the $20 for $25 deal.  This was a great deal except I usually buy only for myself.  I was told that I had to order more than $25 of food to use the deal.  I had to wait for my family to visit me in Oahu in order to get that much food. Overall, my frequency here is more about the convenience.  But the Chicken Red Curry (with eggplant and bamboo shoots - my fave) will keep me coming back."], ["Nat W.", "It was the worst Pat Thai I have ever had.  The portion was huge but the seasoning was just not right and so bland.  Edible at best.  I don't know how they can't even make Pat Thai right.  Search continues to find a good Thai restaurant in Oahu."], ["Marie M.", "First time here.  I usually only order curry, specifically Evil Jungle or red curry, when I get Thai food.  Was oddly craving something different, so besides my usual order of evil jungle, I also ordered Pad Thai, which I have never had.  Thought it was appropriate to order my first pad thai from Pad Thai.  Order of Pad Thai, Evil Jungle Curry, & side of Jasmine rice came out to $20.40.  Not too bad for Thai food.Have no reference but the pad thai was tasty to me.  The evil jungle curry however was not.  It was soo salty, & not creamy/coconut-milky like I'm used to.  Even eating it with the Jasmine rice didn't cut down the saltiness, that's how salty it was.  Totally inedible. :/ which is sad because what a waste of $9 & food/ingredients, & I was really craving some creamy evil jungle goodness.  Maybe I'll try this place again, because it's so close to my house but idk...probably only as a last option."], ["Mac J.", "Terrible summer and spring rolls!!! If this Thai restaurant cannot get these appetizers right there's little chance they'll get the main dishes right. The summer rolls were missing some ingredients and really lacked shrimp in proportion. The dipping sauce missed a beat somewhere during its creation. It tasted wrong. The spring rolls were crispy but lacked flavor. How do you make a crispy spring roll that's bland? This place figured it out. The dipping sauce was too sweet. It also missed a beat somewhere. Sadly, the crushed peanuts were the only thing that tasted right. I was worried but glad they didn't ruin crushed peanuts. But I didn't come here for peanuts. I was craving Thai food. This was the closest place. It looks clean and smells right but the flavors are wrong. I lost my appetite and my craving for pad Thai with chicken. I took my pad Thai to go. I'll donate it. If you're craving Thai food in the Salt Lake area, DO NOT even try to satisfy your curiosity here. Learn from my mistake. There's a first time for most things. This is definitely a last time for me."], ["Chan G.", "They were sooo good when they first opened... Now it's aight. I'll drive to pearl Kai for some bomb.com"], ["Jorel L.", "A few min from my home. They have excellent curries! They are also open to creating the curry you want. I always request a yellow curry with chicken breast, chopped peppers, onions, potatoes, and pineapple."], ["Christine E.", "yay! a place for Thai in Salt Lake! I've been here 2xs so far and I gotta say, I like it. The food is pretty good, prices are reasonable, and food comes out FAST! Do I think it's the best Thai I've ever had? no. BUT, it's pretty dang yummy and flavorful, and it's located 2 minutes from my house so it gets bonus points. haha This is a small restaurant located in Salt Lake shopping center near Longs. So far I've had the fried chicken, chicken panang, spring rolls, pad seeow, and the stuffed chicken wings. My favorites are the panang, chicken wings, and definitely the pad seeow. The panang is yummy, nice and creamy and peanutty. They ask you what spice level you want. I hate spice, but I still ask for a medium. It's not too spicy, so if you like spicy spicy, tell them! The fried chicken has a good batter, very crispy and delicious. The spring rolls were just \"ok\" in my opinion. It didn't have as much flavor as I would like. The stuffed chicken wings are really good. It kind of taste like a springroll/chicken-noodlemeatball, on a stick (aka wing tip), that's then battered and fried. And they give you this thick peanut sauce (which tastes like concentrated panang wonderfulness) to dip it in. I loooved that sauce. The pad seeow is definitely one of my favorite things. The noodles are super thick and flavorful, with TONS of garlic, beef and broccoli. It's so good. My mom hates Thai, but she'll eat up a whole bowl of their pad seeow.I'm definitely a fan of this place, if you're ever in Salt Lake....try it out! Much better than McDonalds. lol."], ["Cindy B.", "I live close by Salt Lake Shopping Center and decided to try this place out! Since I have tried this place, whenever I am craving thai food, I make a stop here. It's close to home and I don't need to drive into town for good quality thai food. The prices here are very reasonable and portion sizes are excellent! I usually order the pad thai with tofu. I love that they have a jar of crushed peanuts and chili sauce for our use on the table. I also get the basil chicken, which to me, is by far the best dish! Must try! Other dishes that I have tried were the yellow curry, fried chicken, and chicken skewers. All were delicious! The staff are also very friendly and attentive. Restaurant is very clean!"], ["NC D.", "One of the better food places in this shopping center in my opinion. It can get busy during lunch time so come early or be prepared to wait. Or call ahead and do take out! I'm not a fan of their pad Thai. To me it's just okay. If I had to recommend dishes, I would say the pad kee Mao, Thai fried rice, pad prik khing, and the house special fried chicken are worth checking out."], ["Szymon K.", "My wife and I stopped there for lunch. It is a small restaurant run by a family. For an appetizer we ordered spring rolls which were really good, they came with vegetables and dipping sauce. Our main course  was cashew chicken and yellow curry. Everything came out really fast and tasted outstanding. The service was really friendly and attentive to customers needs. I did not run out of water at any point during my meal. We absolutely loved It! We definitely will be back to try out some new items on their menu."], ["Ramon B.", "I really love being able to walk three blocks to get some Sateh Chicken!  Hell I was born in the south we devour chicken but anyhow this is my cheap eats Thai Place when I wanna just munch and go with loosing one appendage or washing dishes to pay for my tab.  The Staff/ Owners are always nice I really love that.  Spending time in Pattaya had left me with a test for Thai food.  You can take out or sit and eat.  It's nicely situated in salt lake shopping center.  When I come here I go for Yellow or Green Curry!  Out of all the Thai places I dine at they are the only ones to put Bamboo Chutes in their green curry with is really really good!  I never thought I could eat such a diversely used plant lol.  Also the Chicken Sateh is tasty as well.  One pointer I would give them is to make their Curry Thicker.  I think when it's more thick it sticks to your pallet longer hence increasing the flavor BAM all in all I give them 4.5 starts but hey that options not available !"], ["Megan T.", "I love thai food so I finally decided to try this place out! The girl who took our take-out order wasn't very friendly but she seemed really busy so we were understanding.  The only thing I really enjoyed out of our order was the sticky rice and green curry. (Green curry is bomb, you have to try it.)  Everything else, even the spring rolls, weren't that good and I'm not sure how you can mess up a spring roll. I would come back if I really wanted Thai food and didn't want to drive far to eat."], ["Chaddy B.", "Good food jus small location.. Going about lunch time is nuts cause all da military eats their..."], ["Arthur G.", "My coworkers and I come here from time to time for lunch, and service is always lightning fast. We always have our food within 5min of ordering. They have a wide selection of items with many healthy choices (and not so healthy). If you are looking for Thai Hot, like me, they actually do it well (many places say it is hot, but it isn't). Since this food is hotter than normal, my wife actually couldn't tolerate the medium. We just wanted to clarify that she got the right plate, but they very graciously offered to remake her plate entirely. That's top notch customer service."], ["Kent T.", "While waiting out the traffic, I decided to venture off the beaten path and decided to not return to the freeway after dropping off a coworker. Instead, I asked him about nearby places to eat and ran into Pad Thai. The restaurant itself is very quaint. It has nine tables (three two seaters and six four seaters) and a regular flow of take out customers. At one point in time, the waitress had difficulty returning back to the back of the restaurant because the line was so long. My typical question when going to a new restaurant is what would you recommend. I was thrown off that the first suggestion was Phò (especially for a place called Pad Thai), but was also offered a few more suggestions. I decided upon the Tom Yum Soup with Seafood at medium spice level and a bowl of sticky rice. I have a medium palette when it comes to chili pepper spicy so my lips were consistently tingling and nose was watering as I ate this soup. The soup had a delicious flavor with a few mushroom and tomatoes thrown in the mix. I wish there were more seafood though: two shrimp, few pieces of white fish, and a scallop or two was in the bunch. There was also an abundance of non edible flavor additions (lemon grass and some sort of husk thing). Aside from that, the flavor of the soup was tasty enough to disregard them (or was I supposed to eat them to follow tradition). The way staff looked younger, but they were friendly. The tables were cleared at a medium pace; faster as more customers came in for dine in. Would I come again? I would. I am curious to try the other offerings (maybe even try the phò)."], ["Marian S.", "First time in, not bad... Owner appears to be Lao and most employee spoke Lao.. Good Lao food in a Thai Oriented restaurant... Clean and friendly."]], "S&P Kitchen": [["Matthew B.", "Hands down the best Thai food in the island, and I MAY venture to say that this is quite possibly my favorite place to eat on the island... Second to the Proud Peacock, but a very close second.       Nice and quaint and the food is top notch. I attempt to try something new every time I go there and it's never disappointed me.      Love this place, and it's totally deserving of 5 stars. I've not done that once since arriving a year ago."], ["Scott B.", "My wife and I  split an order of the green curry with pork and a sticky rice. It was not the Thai green curry that we are used to. It was lacking that true \"Thai\" taste and had no \"Thai\" spicy goodness. In fact, the curry was a bit bland.  The sticky rice was good though.The restaurant is clean, bright and has a nice ambience. Casual and homey.S&P Kitchen offers a good value and service was prompt and friendly. A solid three stars."], ["Stephen H.", "\"So what's S&P stand for?\" I ask the pretty Ms. that waits on my co-worker and me.  \"Are you S or P?\"\"Salt and Pepper\" she tells me.  \"For me and my husband.\"Ha ha ha.  \"As long as you're not O&W---oil and water.\".....[crickets].....\"Oooh-kayyy.\"  She either doesn't hear me or pretends she doesn't hear me.  I hope she doesn't \"accidentally\" kick up the \"mild\" heat level we've ordered to \"Thai hot\" for my failed attempt at humor.We ordered Spring rolls (6 pcs. for $7.00), drunken noodle w/ shrimp ($9.50), green curry w/ chicken ($9.00), and 2 bowls of white rice ($2.00 per).Everything was A-OK.  The drunken noodle was especially tasty.  S&P certainly doesn't skimp on the flavoring in this dish.  And MSG; judging from the amount of water I had to drink while and after eating it.  We needed a little more heat in it and the curry tho'.Restaurant is neat and clean.  Parking is a bit of a challenge.  There are 2 dedicated stalls behind the building down a narrow side street or street parking.\"The best Thai food\"?  No, but it's a'ight."], ["Andrew G.", "Hard to find but once you do find it well worth it.  We are just looking for something to eat before getting on our plane and came across this place.  So much better the phucket thai in waikiki.  Street parking only though."], ["Jaimie C.", "Good Thai Food.yummyyummyyummyyummyyummyyummyyummyyummyyummy­yummyyummyyummyyummyyummyyummyyummyyummyyummyyummy­yummyyummyyummyyummyyummyyummyyummyyummyyummyyummy­yummyyummyyummyyummy"], ["Harlien S.", "Butterfish & chicken and beans bento for $5.00. Like the price. Portion of the butterfish could be more but you get what you pay for."], ["Mark N.", "Absolutely the best Thai food on the island!!! My coworkers and I often drive from the other side of the island to eat here. This place has the best curry I ever tasted!!! I also recommend waterfall beef salad. I am suprised  that food network or some tv show hasn't featured them yet. The place also has excellent friendly service from Sally who I think also owns the place."], ["Mark C.", "I have eaten here four more times within the span of two weeks because a friend came out here for vacation and we absolutely love this place! I have been pleased with everything I have ordered. My favorite has been the cashew stir fry with chicken. The ginger stir fry and garlic stir fry is delicious as well. Just keep in mind that their hours are only lunch Monday to Friday now! I wish to they were open for dinner so that I could go more often!"], ["Quijana B.", "How many times have I passed this restaurant?  One gabjillion times.  Pretty sure.  How many times will I pass it now that I know it is there?  Not as many, because now I will know to stop in once in a while.Parking will be an issue here.  There is enough room on the street for three or four cars, but I saw no other parking within a block.  I was lucky enough to park directly in front, though, and one space or another was available throughout the hour I spent inside.Which brings me to the next issue.  This was not a fast lunch.  The restaurant was staffed by only two people.  One stayed in the kitchen, and the second worked the entire front of the house, and ran and helped in the kitchen when he could.  I entered behind a table of six, and ordered immediately after they did, so was served immediately after they were.  One dish at a time.  I was happy that I was with someone I like, and that we had time for a nice conversation.Once we had our food, though, we were very happy.  My husband ordered Drunken Noodles with shrimp, and I ordered Long Rice Salad with mixed seafood.  Both dishes were ordered with medium heat, and both had a nice, but subtle kick.  On a different day I would have added some spice from the jar that was delivered to the table along with our food, but today a calmer spice level was just what I wanted.  yelp.com/user_local_phot…I did not see an air conditioner (not that we've needed one for the last few weeks!) but there were fans mounted on the walls above the tables.  Ours was set to \"low\" and created a very nice breeze throughout our meal.  I believe it would still be pleasant on a much hotter day. yelp.com/user_local_phot…S&P Kitchen won't be a destination restaurant for me, but it is a place I will visit again.  I'll keep my eyes open for empty parking spots, and will suggest it to others who find themselves in the area."], ["AG 3.", "Come here during lunch , I always get the spicy Tum yum soup best on island . Come hungry big portions ."], ["Wanda W.", "Yum yum yum!!! I had the spring rolls, drunken noodles, pineapple fried rice, fried crispy shrimp and crispy calamari. EVERYTHING was delicious. Everything!!! My kids loved the shrimp and spring rolls and it was a great size for kids. This place closes early (2:00pm) so if your near by it's a MUST! My girlfriend is a local and lives in Kaneohe and she says this is one of the best  places to eat!"], ["Liana E.", "The best pho on this island! So good you crave and think about it every day! Call to see if it's available, as it may have sold out, being that it's fricking amazing and all. My other faves are the stuffed chicken wings, panang curry and spring rolls. Everything is fresh and made with the best quality ingredients. The portions are very generous, you really get your monies worth. They also cater and make awesome bentos. Hours may have changed so I suggest you call first."], ["Joseph B.", "Great Thai food but if u like medium spicy I recommend the mild.  We've been here about three times and this time both curries ordered (red and green) were mild.  I like gringo spicy at dinner but prefer to eat fast during lunch, so mild is spicy is just right."], ["April K.", "Fave dishes: Fried Tofu with the S&P sauce, Papaya salad and the Drunken fried rice. Good quality Thai place that knows spicy. This Mom n Pop place has such wonderful people there."], ["Brian C.", "Ok. I had the fried rice. Seemed a bit moist.   Was average at best. Some of the other Thai food looked pretty authentic. Something to check out next time.  Biggest gripe is the pretty shady parking."], ["Leslie W.", "This is the best Thai food you can get!  It is simply amazing!!  I normally get the drunken noodle but have tried many of their dishes and you can't go wrong!! Please don't pass this place up, it is too good to miss!!"], ["Jamila J.", "This was a pleasant surprise.My coworker suggested walking to lunch. There aren't so many walking places in the neighborhood I work in so I was a little like, \"we're exercising before we eat?\"  I was wrong, of course.  And I couldn't believe this place was so close and I had never seen it.  Literally drive past it every day.  I'm glad by walking I finally saw it.The restaurant is off the middle street exit on School Street.  There's not much parking, hence walking.  It's got a good amount of sit down space and they do take out.  It was really cute inside, typical Thai decor.I had the Yellow Curry Chicken and Spring Rolls.  Service was quick and everything I ate was tasty.  The servings are also massive!  Like big.  Good for sharing.  I wish I went with a larger group so we could just order family style.  There was a lot I wanted to try.I'm slowly becoming a Thai food lover.  And S&P is a good spot to have some that's cheap, quick and decently priced."], ["Claudia M.", "Their food here is so so. And their service is lacking. It took forever for them to refill our water and receive our food. Probably won't be showing up again."], ["Peter H.", "Great authentic Thai food. Place is clean and plenty of seatings.  This is great for a lunch meeting.  Location is convenient with street parking. Price is about right. Would definitely come again."], ["Gaelen L.", "This place was great! The location is close to my work and the food is always amazing! They offer spicy and mild with everything they have on the menu. I would recommend it to anyone that likes Thai food."]], "Fort Street Café": [["Jo C.", "I've been coming here for years.  Usually the college kids and people who work downtown come here.  The food has been consistently good.  I usually get the chicken Pho, Garlic Chicken Salad, spring rolls or curry when i'm in the mood.  If you see a long line dont get discouraged, it moves very quickly.  The owners are a couple and the husband works the cash register and the wife is awesome and efficient and will take your order in line so that by the time you are paying your order is already ready!  Garlic chicken here is a winner~! fast and friendly service."], ["Maile K.", "After perusing the photos and business on Yelp my brain decided we were going there for food today. @ 7am, when I was so rudely awaken by Mr. sunshine, my brain was screaming \"Garlic Chicken!\" However, the rest of me thought it would be better to stay in bed where it was nice and warm. I couldn't turn the brain off or shut it up and decided it was alosing battle. Parked at Walmart, free on the weekend and ran my errands.  Now it's  time for some Garlic Chicken. So far so good. Found the place at almost the opposite end of Fort Street Mall, but after a brisk walk, I arrived. I ordered quickly and had a seat outside. Those dining in ordered at the counter and were served water and food on eat-there dishes. Clean establishment, even outside eating area. Now for the food part. I ordered the garlic chicken as the photos people posted looked so yummy. And there are a LOT of GC photos! It is served over Jasmine rice, with tossed greens and a small scoop of potato mac salad, a very disappointing scoop. Good flavor, just not enough of it to last the whole meal. The greens have a dressing on it, I think, which is tasty. Tastebuds have woken up and seem interested after the first bite of salad. Now the chicken. Tastebuds are fully awake now and screaming for more. The garlic sauce isn't as garlicky as I anticipated, but very nice and light. The chicken is cooked to perfection, and there is a lot of it on my plate. It is anything but greasy. Loving it a lot! I'm done with this review. I need to inhale the rest of my lunch!!! Bye!"], ["Hilton L.", "If you've been working downtown for a while and haven't yet tried the garlic chicken and panang curry combo at Fort Street Cafe, there is absolutely something wrong with you.Maybe you hate children. Maybe you don't help old ladies cross the street. Maybe you don't donate to Salvation Army. Maybe you have an uncontrollable urge to turn off the internet when you see pictures of cats.I feel sorry for you.I'm eating your share.Bye."], ["Sean D.", "Located on Fort Street Mall in the historical Blaisdell Hotel & campos of Hawaii Pacific University, they feature Vietnamese & local favorites!You'd need to park around downtown (Marks Garage is the next street over), as Fort Street is a pedestrian street.I suggest their Curries, Thai Fried Chicken or Garlic Chicken (or combo of them all)."], ["Nancy V.", "I found a roach ):I love their tuna rolls, so cheap and good portion size BUT I found a little flattened roach in one of the rolls. I know that every food place probably has roaches but I prefer when it's not in your face (or on your food).I still won't give up this place but I will notify the place and hope they take action in better pre-paring the food."], ["Alysia T.", "\"Wow that was unexpected!\" Is the first thought I had when I took a bite. I had to take a closer look at my meal at that point. I dunked my little plastic soup spoon into the Styrofoam Bowl of curry a few times and pulled up hot chunks of chicken, eggplant, carrot, green bean, and bamboo shoots. Impressed I began to pour spoonfuls onto my brown rice. My journey towards becoming pescetarian just became a little more challenging. This meal is so nourishing and hearty after a power workout at the fitness center next door. Suddenly the employee who took my order is by my side with a smile and an acrylic cup of ice water. Awesome! I reach into my plastic take out bag for a napkin. The spice level is my favorite! Flavor I can still taste even with the nasal drippage. I'm gonna need more napkins for the leftovers."], ["Rachel I.", "Yelp 100 Review Challenge 2015: 10/100Friendly, fast service and sizable portions!I ordered the all beef pho, and to my dismay, I was given just a few pieces of beef:(Four stars for:1. Cleanliness: Clean tables to sit at and open breeze restaurant which is nice because no one likes to return to work smelling like what they ate?!2. Affordable prices: I haven't seen any pho in downtown for $7.16! 3. Service: As mentioned above, they have very friendly service and the food came out QUICK!...like too quick. So if you're in a rush but still want Vietnamese comfort food, I highly suggest this place!4. Because they accept credit card and their easy to find! You'd be surprised some of these hole-in-the-walls still don't take card and are hidden gems.It's not a 5 star in my books due to the fact that I have had better pho in downtown for just a few cents more! It doesn't leave me begging for more. And my boyfriend demolished his Spring Roll dish which is never a good sign as far as portions go. But its still very good! *thumbs up*"], ["Kat K.", "Can't go wrong with anything on their menu.  Love their green curry. Served only on Thursdays and Fridays."], ["Shane C.", "This place is legit. I came here on my lunch break the other day on recommendation from a friend.  I ordered the Pad Thai Garlic Chicken, also on recommendation from a friend. The Pad Thai sat on the bottom of the plate, with the  chicken cut into thin-to-medium sized pieces, placed nearly on top of the bed of Pad Thai noodles. The noodles had a kind of light ketchup colored look and taste to them and were delicious. As for the chicken, it was as you would expect from Garlic Chicken, and definitely met if not exceeded my expectations.  What I really paid attention to was the streamlined service that this place gives.  The system that they have to get you in and out of the place, especially if you're a bit short on time, was great. Before I even walked through the threshold of the place, a lady took my order, as well as those of a few people behind me and took them into the back to place them.  I recall only waiting about 5 minutes or less for my food, with it being ready immediately after paying for it.  This place is great for lunch if you're in the area, give it s try.  I'm excited to try other things on the menu"], ["Denalee C.", "\"There's a place downtown, I don't know what it's called but it has the best pad thai on the island.\" says my brother. When you make a statement like that, I become instantaneously intrigued.  I made him take me there the next day.  He said you have to go early or else the line is insane.  He said it's a young couple that runs the place.  He'll take your order and she'll bring it to you.  My brother said she's got some ridiculous memory that puts Sheldon Cooper to shame.  She always delivers the right order to the right customer without writing anything down.  And she's always right. Always. And if you haven't showed up in a while, she'll ask you how you've been. I found it strange that it was Thai + Vietnamese + local food. Most joints just stick to one kind of food.  But my brother said it's all good.We got there around 11: 20 and ordered garlic chicken, pad thai, summer rolls for here  and curry to go. We debated whether or not to wait to order our curry to go with the rest of the meal.  I convinced him if the line gets crazy, it's not worth waiting.  Well. At 11:20 there was no line.  But around noon, the line was out the door.   Anyway, back to 11:20.  We ordered our food and it arrived before we could even find a place to sit.  I swear the moment we found a seat, she was there with cups of water and in a flash, our food.  Pad Thai: Pretty good.  It was a little more saucy than I like (my brother said that was unusual) but the flavor was there.  The noodles are thinner than other places.  There was a cut up boneless chicken thigh on top which I liked better than small shreds of breast in the noodles.  Can't agree it's the best on the island but it was good.Summer rolls: Two large rolls for about $5.  The taste was to be expected-a good deal for summer roll lovers. Garlic Chicken: wow.  sweet. crunchy. generous portions of sauce.  juicy. delicious. The rice was more like Chinese rice-not fluffy and moist and the salad and mac salad were just OK but the chicken was the star of this plate.I'll definitely return, and next time I'll try the Vietnamese side of the menu."], ["Karen T.", "We came by while we were in the Chinatown area and tried the pad thai with garlic chicken ($7.16) and garlic chicken and panang curry combo ($7.50). I loved the combo - they gave a generous portion of the panang curry (I hate it when you have a lot of rice with just a little bit of curry and here I had the opposite problem!) and the garlic chicken was also very good. The panang was a bit salty but I think food in Hawaii is just salted more compared to my standards. On the other hand, I absolutely hated the pad thai. It was dry and really salty and oily. Service here is good and fast. It is a very simple shop with most people taking their food to go. Prices seem reasonable and I would come back for the curry combo."], ["Stephanie K.", "Garlic chicken, garlic chicken, garlic chicken!!The reviews don't lie! I stopped by today on my way home from KCC. Fort Street Cafe is right next to HPU and surrounded by other hole in the wall restaurants, varying from Mexican, Korean, and even a crepe cafe. I decided to go with the reviews and ordered the garlic chicken, a spring roll, and a Vietnamese iced coffee. After a short rate my order arrived (I had asked for take-out) and I couldn't wait to try it.That garlic chicken was amazing. Most likely the best I have ever had. The spring roll was nothing amazing, but delicious nonetheless. I can't wait to try all their other dishes. I love that this small cafe combines Thai and Vietnamese cuisines. It's the best of both worlds. Yum!"], ["Mel O.", "I'm giving five stars for their tuna rolls. Omg. I could eat those things for days and days. It's not just about those rice paper rolls of noodles, lettuce, cucumber and carrot juliennes, tuna from a can and mint. It's really about the magic dipping sauce. Ok. It's some kind of fish sauce, vinegar, veg strips and whatever else but it changes the whole dynamic. Oh yeah. Sounds lame, but you just try it. Dare you. And THEN, let me know what you think..."], ["Michelle E.", "Fort street cafe is another awesome hole in the wall eating establishment that offers local traditional Thai, and Vietnamese cuisines like your Thai curries and Vietnamese pho bo but they also cater to local tastebuds where they offer fried rice and local breakfast plates like bacon eggs and spam or garlic chicken. Which is a plus for those student who goes to HPU. It's located inside fort street. If you're around mcdonalds or Ross all yiu gotta do is walk down. I've been here many times because this is my \"quick go to spot\" when I'm craving some Thai curry and pad Thai they're local plates are pretty good too. Especially the fact that the price range is suitable for broke ass college student lol. You can't get this quality for this price at like an L&L. I've personally ordered their pad Thai and what's good about it is you choose what type of protein you want in it. Ranging from chicken, pork, beef, and shrimp. I always order the shrimp pad Thai because I love seafood. Their pas Thai is sooooo good. Most places I go too majority their pad Thais are soaking wet. At for street cafe it's a perfect balance not too wet but still moist. I've also ordered their Panang curry I've ordered it with shrimp, chicken, and pork. All  delicious. For those who love to try new food but are afraid due to spice/heat no worries fort street cafés curries are not spicy at all mane a little kick but it subsides right after.No worries as well to those who are vegetarian they also offer a range of vegetarian dishes. So if you're in the are and looking for cheap eats and want your money well worth try visit fort street cafe I'm sure you will not be disappointed. Not only because all their dishes are delicious but the staff are kind and generous they treat you like family."], ["Alexander T.", "Had the Panang Curry Combo the other day... What I noticed was that there was a COCKROACH in my food! I got my money back, but the place NEEDS to become more cleaner...looks so dirty...and who knows what happens backside in the kitchen. I am so suprised that the Health Department of Honolulu have not closed this place jet! I was not the only one that had a cockroach in my food, there were a couple of other people that also got it, also when we went to another restaurant a couple of streets down, the workers there told us that Fort Street Cafe is known for that!! OMG! KEEP URSELF AWAY FROM THIS RESTAURANT!"], ["Rebecka A.", "Great quantity for the price! Nice little booths inside. We ordered the summer rolls as an appetizer (mmm peanut sauce) and I got the lemongrass chicken with rice and salad (the salad was a little sad), and my boyfriend got the barbequed pork with spring rolls.  I had a bite of his barbeque and it was great! Nice rice noodles too. Very affordable tuna rolls by the register-- like 3 bucks for a half order! #100in2015 (#2)"], ["Marty B.", "Garlic chicken is insane. Best grinds recommend anyone downtown eat here.  Fast service and huge helpings."], ["Jimmy L.", "This place really is something special. I could probably eat here every day if my pockets weren't so shallow. Or well, I literally had a hole in one pair too, but that's a story for another time.Service 4/5:Line is long. Don't get me wrong though, because it is worth it. The good thing is, they will start taking your orders before you even pay. That way, the food is being made while you wait in line. In some cases, the food will come out right after you pay. I do, however, have a problem with their credit card payment system. Manual input is a risk that I have had too many experience with. Pay with cash if you can to avoid (human) errors.Food 5/5:Amazing. I feel like the quality of their food is so fresh and you can really taste it. Their garlic chicken is definitely one of my favorites. Though I've tried everything from their pho, spring rolls, and even their short ribs. They are all good. ALL OF IT. Even the salad that comes as a side is good. People who have known me for half my life know that I refuse to eat salad because it won't help me get any bigger/fatter, but JUST because theirs tastes so good, I'll eat it. The extra sauce from the garlic chicken that leaks over to the salad? EXTRA GOODNESS.Overall:I would recommend people to come here, for sure. The people are really nice and the food is really high-quality for the price. Beats eating junk food all the time. Trust me, I know."], ["Mark H.", "Keep in mind this is fast food SE asian so temper your expectations...Pad thai w/ garlic chicken seemed to be a popular choice among yelpers so went with the safe pick....Satisfying flavor. Pad thai not oily which leads to clumping but at least the noodles can better absorb the flavoring...  Healthy portion of pad thai. I was stuffed after lunch!Throw in a healthy share of garlic chicken (good garlic crust and tender--not fried to a stiff crisp), garnish with peanuts, lemon, and cilantro, & the total damage = $6.75 w/tax?  Good value!I will definitely be a repeat customer!"], ["Daizha C.", "BOMB BOMB BOMB! So good. I love this place. Been coming here for years. Garlic chicken pad Thai is amazing."]]}