{"Bavette's Bar & Boeuf": [["Bill P.", "There's nothing I would change about this charming spot! From atmosphere to music, to the delicious drinks - you'll love the experience. I had the salmon tartar and just about died; it was so good! I then enjoyed the best homemade meatball I've ever had! It came with their house made fettuccine and tasty sauce. My server/bartender, Jay overheard I was moving, and even brought out a sparkling scoop of vanilla ice-cream and hot fudge to celebrate. AWESOME service!"], ["Anna K.", "Came here for a drink before dinner in river north. Sat at the bar and loved it, can't wait to come back again for dinner! The decor is dark but makes you feel like you've traveled back in time and are at a supper club. Removed a star since it's slightly overpriced, but it's river north. My boyfriend said it was the best dirty martini he's ever had-- and my cocktail was pretty delicious too. The bartender was friendly and gave good recommendations, I loved how she tried every drink she made to make sure it was good."], ["Tracy H.", "I know, I know! I keep reviewing here, I don't care. I will always update this review. Had a truly wonderful b-day dinner here Friday night. Service was superb. I had one of the best meals everrrr. Got the petite filet mignon and honestly, I'm pretty sure it was the best filet I've ever had. Got an excellent sazerac (you don't see this New Orleans cocktail many places, and this one was excellently crafted). My guy got the double-cut pork chop - to die for. What else ... oh, right! The chocolate pie. You must do this, I promise you won't regret. Only drawback? This place will set you back - a lot. So just know that going in. But for a special occasion, it's worth it, and Bavette's is officially my favorite Chicago restaurant."], ["Mouse C.", "A perfect rating indeed! Bavette's NEVER disappoints. Say it with me now..N-E-V-E-R  disappoints. Ambiance is old fashioned steak house meets the contemporary coolness of all Brendan Sodikoff's establishments. Bavette's encompasses all that a steak house should. The man and I came here last Monday for a much longed-for second meal here. We were seated upstairs this time and just a tip, if you can, request to sit in the \"parlor\". It's super sexy and you won't regret it. Moving on...food/drinks:The mans went with his usual - old fashioned. Very yummy and had great, smooth flavor. Also, they give you just about any option for your old fashioned to include bourbon, scotch, whiskey, cognac. I mean, it's legit. I was interested in a robust, yet not punch you in the face red. I opted for the Sangiovese and it proved to be perfect for what I was feeling. Appetizer - garlic shrimp de jongheMains - short rib stroganoff and the bone in dry aged rib eyeSides - elote style corn and roasted tomatoesDessert - lemon meringue pieI have not one bad thing to say about any of it. I can't, it would be a sin. If you are getting steak, don't even think about looking further than the rib eye. Stroganoff melted in your mouth and fell apart just by looking at it. Corn was so creamy I couldn't even handle it. The pie was hilarious, it was 15 feet high with the whip cream. In short, anything and everything you get at Bavette's will knock your socks off. Love love love...one of my fav spots in Chicago!!!"], ["Dalia M.", "Sat downstairs - I made reservations almost two months ahead and it's all I could get for our Friday night dinner!We were seated right away. Had the salmon with toast, steak, and wine. We all liked our food. It reminds me of the restaurant group - gilt, Maude's. It was pretty pricey but good.Our server was a bit odd / intense but other than that we had a good evening. Makes a good date spot like the Library at Gilt.Enjoy for a special occasion."], ["Nancy Y.", "Why no sear on the ribeye steak?!  Why no crispness to the roasted chicken skin?!  And why did they take my steak knife away because I really could've used it to eat the chocolate pie?!The first two are huge strikes for me as I thought those would be no brainers for such a successful and hyped restaurant.  The chocolate pie, though, was practically inedible... the crust was so hard that I had to wrap my fist around my fork and stab straight down into it to break it apart several times, and the fudge filling was immensely thick and sticky.  It was all around uptight and needed to unwind a bit, you know?But the rest was good, like:- complimentary brontosaurus sized slices of warm bread & butter- crab stuffed avocado salad was refreshing and actually quite a deal for how much crab meat you get- pomme frites with garlic aioli are the same as Au Cheval's and very consistently delicious- loaded baked potato - the only amazing thing about it was the bacon (same as Au Cheval but possibly more peppery?)- classic cut ribeye - even though there was no sear to it whatsoever (note: RPM Steak did it perfectly when we were there just a few weeks ago), it was a very tender hunk of meat and cooked to the correct temperatureSo 1 salad, 2 entrees plus added mushrooms, 2 sides, and 1 dessert later... it was about $150 before tip.  If I come back again, maybe I will just get the Au Cheval griddled burger because I trust they can always do that right."], ["Adam B.", "Very good steakhouse that lived up to the hype. I think I maybe have outlandish expectations when it comes to steakhouses and I'll not dare say this place didn't live up to the hype. We were very fortunate to know someone who was able to get us an early reservation for which we were thankful.Pro tip: Take the kitchen staff a bottle of JamesonWe noshed on goat cheese and bacon while we picked our main courses over Chardonnay. Both were great with the bacon being of a thick, peppery cut hinted with maple that finished very sweet. Of course it was hard to not go Chicago cut ribeye so I did. I wasn't let down. Next time I will opt bone-in but still the steak was prepared well and very tasty. I think the sides and service really won. The corn was creamy and spicy, very good. And the cream spinach was nothing to overlook.Fine job to all who helped put this meal together for us and your accolades are very well deserved.Cheers!"], ["Veronica P.", "Great atmosphere and nice ambiance.   We had the seafoodTower which was excellent, a Caesar salad, two steaks, the Mac and cheese and potatoes on the side, all were great.  We love the fact that this place is a byob but u must share a glass w a Stranger.  Pretty neat idea. Def will b back soon!"], ["Heather G.", "Amazing food and romantic dimly lit atmosphere.We were bummed when they didn't not have any reservations left on a Monday night, but they did have a bar area and often save a couple tables for early walk-ins.  We showed  up at 6pm on a Monday and were able to be seated at a table with no reservation!!!  Portion sizes are huge!  We got almost full from our duck/goat cheese appetizerWe did not get steak but loved the meatloaf and beef stroganoffWell worth the money!  Great for special occasions!"], ["Stephanie L.", "Okay one word: YUM.Came here on a Sunday evening with a party of 4 to celebrate a friend's birthday. I have never been here before, but I've heard great things. And sometimes when you hear great things about a place, it's hard for it to live up to your expectations, but this was absolutely not the case here. I'll start with the service. First of all, they do not seat people unless your entire party is here. Not really a pro or a con in my opinion, but just something to be aware of if you're dining with a large party. Anyway, we were seated promptly once everyone had arrived. We got one of those nice round booths, which are VERY comfy and made me real sleepy and content after a steak, superb sides, and a glass of syrah. Our waiter (forgot his name) was attentive (but not overbearing) and friendly. He had great recommendations and helped us order the right amount of food for our group of 4.For the food, I ordered the petite filet mignon (6 oz) and our party shared the thick cut bacon, Brussels sprouts, fries, corn, and crab cakes. My meat was a PERFECT medium rare, which as a steakhouse is really important to get right. The meats don't come with a lot of seasoning but they do bring you it on the side. I kind of prefer this because I like the natural taste of my filet mignon and I find that often times the seasoning can hide that flavor. But this is of course a personal preference. As for the sides, the fries were good, but nothing super spectacular. I didn't try the bacon because I'm not a big fan of bacon and especially not of thick fatty oily bacon, but if that's your thing, then this is the side for you! The corn was very creamy and flavorful. So delicious. The crab cakes were done very well. A great texture and a lot of crab. Definitely one of the better crab cakes I've had in my life. But my favorite side was definitely the sprouts! I'm a huge fan of sprouts and these were done so well! They were well seasoned and properly cooked and I could not stop eating them. I also LOOOOVE the sourdough bread they bring out for you, and I even had to bring a box home with me :) Honestly, I was really pleased with everything that I ate that night.Finally at the end of the night, our waiter brought us ice cream to celebrate my friends birthday. This ice cream was UH-MAZING. It's pretty hard to impress me with ice cream just because a.) ice cream is not usually my dessert of choice and b.) I've had a LOT of good ice cream. But this one was very creamy and smooth, and they chilled the tin ice cream dish it came in, which kept the texture and temperature perfect. I highly recommend ordering ice cream as a dessert! You definitely won't regret it. I don't give 5 stars a lot, so this is a big deal. I will absolutely be coming back. Worth the hype!!"], ["Lisa H.", "I heard so many amazing things about Bavette's Bar & Boeuf from friends, co-workers, and fellow Yelpers, but trying to make reservations for dinner was always a hassle.  Finally, I scored reservations for dinner on a Friday night for two.  It was three months out, but nonetheless I was finally going to experience what the hype was all about.  I decided to invite my sister since she appreciates food as much as me.Like always, my sister eats with her eyes rather than what her stomach can handle.  But what the heck....we ordered:Baked Crab Cake: baked crab, preserved lemon, and remoulade.  It was such a breath of fresh air to see the crab cake was not deep fried or full of fillers, but baked with fresh crab meat instead.  This was a simple crab cake, but it surely didn't lack any flavor.Baked Goat Cheese: served with red sauce and garlic bread.  There is just something about goat cheese and marinara sauce together that I yearn for.  The red sauce was hearty and full of bold flavors which complimented the smooth and creamy goat cheese perfectly.6 oz Filet Mignon - Petite Duchess Cut:  served with roasted tomatoes, béarnaise sauce, and watercress.  With all the food we ordered, I was so glad the filet mignon was only 6 ounces.  It was the perfect size for little old me.  The cook and the seasoning was spot on.Double Bone Berkshire Pork Chop: served with herb jus and lemon.  This was my sister's entrée.  She really enjoyed everything about this pork chop.  She stated that it was really tender and juicy.  The herb jus and lemon was the perfect topping to enhance the natural flavors of the pork.Elote Style Corn: chili, lime, cilantro, and parmesan.  I'm always reluctant to order elote style corn from any restaurant because it never tastes the same as the street vendors and it is just way more expensive.  But everyone was telling me that I had to try it here, so I again went against my gut and ordered the corn.  It definitely didn't taste like the authentic elote, but Bavatte's spin on it was still good.  The corn was creamy and the lime and chili gave it an extra zing. Chocolate Pie: this was the perfect ending to our feast.  The crust was rich and buttery, the filling was smooth and full of chocolate flavor, and the whipped cream was light and airy.Overall, many kudos to the chefs at Bavette.  Everything from the appetizers to dessert was perfectly cooked and flavored.  The service here was also phenomenal.  Our waiter was attentive without being too intrusive.  I can't wait until I have a chance to go back."], ["Joy M.", "i love everything about this place. came here for a nice fancy date night with my girlfriend to cap off a fun weekend getaway in chicago.the dim lighting and decor was very Mad Men-esque, like a 1960's lounge/sexy office mashup. definitely a place that you take someone special to as there is a huge selection of wines, beers, and liqueurs as well as a great menu for whatever you're feeling: oysters, salads, steaks, fish, chicken - it's all good.highlight of the night: their Oaxacan Old Fashion'd: a delightful and smokey twist on one of my favorite drinks. the tequila + mezcal went amazing with my steak.such a fun locale. definitely my favorite restaurant in one of my favorite cities.-civilities."], ["Danielle P.", "I really enjoyed my evening here. The restaurant has a chill, yet classy, speakeasy type vibe. Everyone we encountered from the hostesses to the servers were super friendly and welcoming. The drinks were really good. I ordered the short rib stroganoff and my friend for the spaghetti with the giant meatball. The portions were more than enough as neither of us made a dent in our meals. I also had a wedge salad and my friend had the trout Caesar. I got a green tea and my friend got coffee after dinner. The coffee is french press and our server noticed that there were some grounds.. Without a seconds hesitation she apologized, offered a replacement and took both beverages off of the bill. I've heard they specialize in steaks, next time, and there will be a next time I'll try the none in rib eye."], ["Lisa S.", "The service started off slow, however our server apologized several times and made up for it. Everything we ordered was phenomenal! Started off with large, thick slices of warm sourdough bread. We shared the fries with garlic aioli, the short rib stroganoff and the spicy fried chicken. Be sure to make reservations though! It was packed on a Sunday night."], ["Jason L.", "We recently took my parents here. We all loved loved it and I think only one person had steak.  Our waiter was awesome (I'm sorry I can't remember his name), and from the moment we sat down he was attentive but not overbearing. He was super knowledgeable about wine and food and made great recommendations. The byob \"fee\" is great and makes the restaurant even more charming.  We started with oysters, which were super flavorful. I had the fried chicken, which was moist and crispy. Everyone loved their meal and I did think the food was worth the cost. Add that you can bring a bottle of wine and it really makes this restaurant a great deal."], ["Holly K.", "Bavette's is my absolute favorite steakhouse in Chicago. From their over-the-top friendly service, to their old Chicago atmosphere, BYOB policy and the pheNOMenal food... everything is spectacular. Highly recommend this restaurant for anyone!A few of my favorite dishes on their menu:- Fresh Oysters - Classic Ribeye - Elote Corn (must try!!!)- Pommes FritesOne of the greatest features of this steakhouse is that you may bring one bottle of wine for every two people in your party. This way, you can avoid the 300% mark-up and enjoy your fine wine at a reasonable price! The only ask Bavette's requires is that for every bottle, you \"send a glass\" to another table in the restaurant. It's best to send it to someone who also has a bottle where they too need to send a glass. :) What are you waiting for? This place is a must try!"], ["Ricardo B.", "Came here on a Sunday night and the environment was perfect. Different types of people but not packed. Service was quick and complete and the food was excelent and in good portion. Wine selection was fantastic and the dessert don't even get me started. Definitely try the whiskey ice cream, I can say is one of the best tasting ice cream I have tasted in my life ( I am an ice cream lover ).Our server was very comfortable presenting the menu and explaining the option. Came to Chicago from Atlanta and me and my gf made this place an official place to come in our next visit."], ["Tim L.", "I definitely underestimated Bavette's! I honestly didn't have any expectation for Bavette's since it's a bar/restaurant. My friend insisted on checking this place out so we ended up making reservations. We arrived 15 minutes before our reservation and went to the bar to grab a drink. We were lucky to grab seats at the bar and the bartender told us that we could just eat at the bar if we wanted to. Love that this place has an extensive list of entrees including steak, chicken, lamb, fish, pork chop, and etc. I guarantee you'll be able to find something you like at Bavette's.Had no idea what to order and the bartender recommended the filet mignon. He told me it's the best filet mignon in Chicago. Who wouldn't say that about their own restaurant though right?! Didn't wait long before my filet came. Cooked to perfection (medium rare) and the meat just melted in my mouth!! Bartender mentioned sprinkling a pinch of sea salt for flavor if needed but no garnishes/sauces were needed for this filet. Full of flavor and felt like I was in heaven for a few minutes!! Hands down one of the BEST filet mignon's that I ever had in my life!Great ambiance, service, and lastly incredible food! Chicago has some amazing restaurant, but this one knocks it out the park! I would recommend making reservations in advance since this place is popping. Coming back next time I'm in town!"], ["Terrel K.", "Very nice establishment.love the dark intimate look.drinks were good,had the gimlet and another \"dark\" drink.the shrimp dejongh is to freaking good,it could be brought as the main meal as far as im concerned twice.the spiced chicken is ok..to bad they are using thigh meat now making it tough to eat.the steak was top notch quality meat with a nice flavor.will be there quite often."], ["Mac R.", "Honestly, I could not find even a tiny flaw in anything here! Gorgeous speakeasy style space with perfect mood lighting & stellar service. We started with old school prohibition style cocktails: Belle Mead Old Fashioneds for my dining companions and a Dark & Stormy for me. No complaints here! Appetizers of the sweetest oysters, crab cake loaded with lump crab and peppered duck pate enhanced with an apricot sauce that were all expertly presented and prepared. My filet was like butter! So flavorful, tender and perfectly medium rare with sides of maple peppered bacon, wild mushrooms and corn unlike any corn I've ever tasted. It's called Elote Style Corn with chili, lime cilantro & Parmesan and it's killer!Our family members have been here a few times and insisted that we should join them during our visit to Chicago. You know, they're seriously onto something really good here! Loved it!!!"]], "Chez Moi": [["Marcia S.", "Out of it.  That's the only way I can describe this restaurant last Friday evening .  Although it was only 6:15, they were already out of the rack of lamb and the only fish that sounded interesting.  So I settled on the coq au van, which tasted like it had been reheated from the day before... hard outside, dry and tough inside.  The mashed potatoes, lumpy the way I like them, were cold in the middle.  I was luckier with the mussel appetizer, which I love and almost always order if it's on the menu.   The mussels were very fresh, but arrived with almost no broth (perhaps they were out of broth, too).  My friend had the steak au poivre.  She'd asked them to go light on the peppercorns, but it arrived smothered.  (Obviously, they were not out of peppercorns.)  Said her beet salad was perfect.I normally have no problem sending a dish back to the kitchen if it's as bad as mine was.  In fact, many restaurants welcome an opportunity to redeem themselves.  But we had tickets and not enough time.   Another thing the restaurant was (almost) out of was heat.  Granted it was a freezing night, but it was so cold in the main dining area they were moving everyone to the back room, where we still sat with our coats over our shoulders.  The front room was filled when we left, and a little warmer because of all the warm bodies.  We were really disappointed we hadn't had a chance to enjoy the awesome ambience there.  Love the amazing orbit light fixtures!  No comparison to the back room, where we ate staring at a TV showing a fake fire.  Their fixed price dinner is a good deal if you order before 6:30.  Because we had to move rooms and servers, we missed the cutoff by five minutes.  \"No exceptions\" we were informed. And that, as they say, was the icing on the cake for us.  We won't be back."], ["Jane M.", "Enjoyed a pre theater dinner with my husband.  We ordered glasses of wine based on recs of our server, excellent choices.  I was debating between the lamb shank and the cassoulet.  He recommended the cassoulet as I was not likely to make it at home.  It was outstanding, so flavorful!  I also had the salad with fried goat cheese that was great!My husband loved his whole red snapper and his spinach soup!   We had great service from our waiter and the wait staff!  Very welcoming restaurant with many choices! Will return for sure!"], ["Adam B.", "Very authentic and pretty traditional French bistrot au quartier, in other words, a little neighborhood joint with well-considered and well-prepared food. Warm, cozy, not pretentious at all. Lively on Saturday night without being too loud, certainly not hipster or trendy (although I seek those out too, but that's not Chez Moi).The first thing I noticed, food-wise, was the absolutely outstanding bread. This, I learned from Chef Dominique, the owner, who spent a long while chatting with us, is custom-made just for him in a two-day fermentation process. It's really outstanding.The menu is fairly large for a bistrot, with many French classics. For starters we enjoyed the escargots and tarte à l'oignon aux lardons, which was nearly a meal in itself. The steak aux poivres was classique; the confit de canard (a special) was two full cuisses (leg & thigh together) with subtle orange sauce.All-in-all a very nice meal. Prices are a little on the high side if you don't choose the prix fixe, just the same as in France, come to think of it."], ["John I.", "Someone's gotta say it. \"Chez What?\" That's what I felt in the middle of the meal tonight. I walked into the restaurant with high expectations. I love simple but well-prepared bistro food. Would I have the steak frites, the cassoulet, the boef bourginon. Perhaps the onion tart or the onion soup? The server couldn't have been more pleasant, with her mastery of the language from living in France and some exploits on a California farm growing organic vegetables. Not versed at all on apertifs, though; so I just went with some bubbly and gin (French 75), which always goes down well. I had the French onion soup, which was tasty, but the broth was missing some complexity that I find elsewhere (you don't have to ask me twice to run, not walk, to La Sardine to have their soup). We shared an onion tart, one of my favorite French bistro dishes, but there was too much bacon (lardons), and it overpowered the onions and seemed to compact the buttery, puff-pastry  crust. A little Cotes du Rhone and we were starting to hum. I decided to risk my heart and soul to the red meat. Would I go for the Boeuf Bourguignon, the prime rib in pastry crust or the classic Steak Frites? I decided to be boring and go for the Steak Frites, partially because of the Yelpers that seemed gaga about the frites. Rare please. (Remember that, Yelpers; that's foreshadowing.)What are the chances that you're a restauranteur and you have a Yelper in the room? In my case, the odds were 12.5% of my table, because I happen to Yelp, and my friends do not. And what are the chances that one of eight people has a horrible experience with their food and the others appear satisfied with theirs? The steak came, and while it was about an inch thick, it was cooked to the consistency of boot leather. Even if I had ordered it well done, it would still have been overcooked. The poivre sauce probably tasted good, but it really needs a penetrable steak to go with it. I should have read the menu more closely as well, because the wonderful fries that the Yelper's were talking about were not these \"home cut\" French fries, that were OK, but nothing like the wonderfully-crisp, thin frites one might expect. One of the worst meals of my year, in November, no less.Why, you ask, didn't I send the steak back? I probably should have taken the nice waitress aside and told her to take it off my bill. But I definitely didn't want to turn into the center of attention while everyone was finishing their meals before they got me a new one. Been there, didn't like doin' that.Finally, I don't know if it was because we were in the back (former Red Rooster space, anyone?) or because someone was playing a twisted psychological trick on us, but there was a song playing that must have repeating again on again that we probably noticed after 10 times & then couldn't keep our ears off of. I found the lyrics and determined the song, \"J'appelle,\" by Alain Souchon. How did I know? The chorus of the song went, \"J'appelle, J'appelle, J'appelle, J'appelle; J'appelle, J'appelle, J'appelle, J'appelle; J'appelle, J'appelle, J'appelle, J'appelle; J'appelle, J'appelle, J'appelle, oh J'appelle...\" Literally. Make sure you get that \"oh\" in there at the end, otherwise it will sound tedious or grate on every last one of your nerves."], ["Azra H.", "We came here with a Groupon on a Sunday evening and it was really lovely (make sure you make a reservation since it's a small place). The food is well portioned (though plan on coming on hungry, especially if you like bread!), wholesome, and delicious. We loved the atmosphere as well - really charming and quaint. All that with nice, non-intrusive but helpful service made for a great date night :-)We had the vegetable tagine, salmon, onion soup, and creme brûlée. All lovely. However without a deal, this place is rather expensive."], ["K M.", "I love this place! I've been here twice with my parents and had great experiences both times. Really warm and polite service and elegant yet cozy atmosphere. All the food that I tried was amazing. The bread and butter they put out at the beginning is so yummy but make sure you save room for the real meal! The salmon was cooked so perfectly it just melted in my mouth. I also got the frog leg special, and while I realized I wasn't a fan of frog, it came on a bed of mashed potatoes with buttery lemony sauce that was heavenly. My mom got the cassoulet both times we visited because she loved it so much. I really enjoyed the French onion soup the first time I ate there too. For dessert, both times we had the Brittany cake that comes on a bed of salty caramel sauce. It's apparently their most popular dessert and I can see why. Next time I want to try the apple tart or crème brûlée :)"], ["Cedric L.", "Good food, it's always nice to get back to my native food.I had the frog legs, and Cassoulet.The cassoulet wasn't the traditional as it was a little bit revisited by the chef but still very good and not as rich as it usually is.Going back !"], ["Natalia K.", "I would give the restaurant and the food 5 stars, but I ate here with the prix fixe tasting menu groupon and it was extremely overpriced. You're paying $99 for what is supposed to be a $160 value. You receive 4 courses per person. No way does each course average $20. Sure, there are quality ingredients involved, such as scallops, and duck, but you are receiving smaller portions of them. And there is no wine included. Our meal, with the groupon value, came out to $180, including tip- and all we had extra were three glasses of wine. Not worth it. The new groupon, which allows you to order off the menu and gives you $65 worth of food for $35 is a much better deal because you are getting what you are paying for. So yes, please do come here, just not with the tasting menu groupon, if they ever offer it again. Buy the other one. Or go with their happy hour prix fixe menu for $30 a person.As for the food and experience, it was exceptional. Each of our courses was artfully prepared and delicious. The asparagus and tomato salad as the first course had a gorgeous balsamic reduction for a dressing and shaved parmesan. The scallops over mashed potatoes drizzled with honey was the second course. I didn't love the honey, but the scallops were cooked perfectly. The third course was duck leg with braised carrots. The carrots were nothing special, but again, the protein was cooked perfectly. Our dessert was a slice of shortbread cake with vanilla ice cream and burnt caramel sauce. It was the flavor of creme brulee with a shortbread cookie and some ice cream to bring it all together. The cake was a little too shortbready and I would have preferred something less crunchy, but I loved the sauce and the ice cream.The service was attentive and polite, not taking our plates until both of us were done, and not rushing us. The decor of the restaurant is lovely and romantic- the chandeliers are especially beautiful. Ideal place for a date."], ["Daniel J.", "Overpriced and tasteless food!The server seemed like he wasn't interested in us whatsoever!! The drinks seemed like it was watered down!Maybe next time but I doubt it!!"], ["Sandra F.", "I had dinner here last night with a friend prior to going to Steppenwolf and I have to say, we thoroughly enjoyed it. We started with the charcuterie appetizer which was plenty for two. I had the wild mushroom ravioli which was a beautiful presentation and it was very tasty. Plenty of food, even though there were four they were large. My friend had the skate special and it was excellent as well. We finished with coffee which our waiter made fresh (even my decaf) and the Breton cake which is amazing but totally filling, even though we split it. I love the rooms there and the ambiance. Will return again!"], ["John R.", "Recap: Liked it alot, great food, great service very good advice on wine pairings.My wife had a date night the kids were away at a sleepaway camp thingie in the winter (didn't even know there was such a thing).We had our usual \"debate\" about restaurants. I'm the picky one, so I was pleasantly surprised when she said \"Julie met the owner of Chez Moi on a flight back from Paris, we should try it.\"  Yay French food, one of my favorites.Checked the Yelp reviews, looked promising.Later as we pulled up to the address we were both remembering having dined at that address before... Was it called the Rooster or something? To our delight our server was Michael who had worked at Cafe Bernard and its caboose the Red Rooster. We remembered him.Chez Moi has different ownership than Cafe Bernard, my understanding that the chef was formerly with Bistro 110.Starters: Escargot. Garlicy. Hot. Good. I ordered a glass of Pinot Noir that struggled to stand out against this spicy dish. Next time I would order a bigger win.Main: Beef Tenderloin with Phyllo Crust. Perhaps a take on Beef Wellington? I liked it. Wife stole half of my mashed potatoes. Dish was hot and perfect. Mike suggested a Cab/Merlot blend that kept up with the dish.Final: Wife ordered Creme Brulee, I ordered the Profiteroles and pretended it was her idea. Very very good. The latter come in three, and should be shared by two people. The creme brulee would be hard to share.On our way out, chatted with India who along with her husband Dominic owns the restaurant. Nice to chat with you.I really like French food. Really want to get back sometime again before spring."], ["Nora F.", "Wow. I rarely ever write reviews on Yelp, but this is a MUST after last night's experience.I went for dinner with a friend to celebrate her birthday last night. We ordered the mushroom cigar (amazing) and each had the French onion soup (best I've ever, EVER had!) My friend had the mussels, which she loved, and I had the Oeuf Muerette (to be honest I didn't even know what this was... and still don't... but it was phenomenal.) We each ordered a side of veggies/mushrooms.All of our food came out in a perfectly timely manner, with the exception of the vegetable sides which never showed. Since we wanted to get home to *cough* watch the Bachelor *cough* we asked to take the sides to go. I thought the man who checked in on us was going to cry when he found out our sides never came out. He immediately had the sides boxed up, and brought out a piece of their unbelievable Gâteau Breton Salidou (Brittany cake with salty caramel sauce and ice cream) with a candle and \"Happy Birthday\" written in chocolate. Then our sweet waitress (apologizing profusely for forgetting our sides) helped us pick yet another course to take home so that we could get the full value of the Groupon.I left with 4 boxes of food, completely full and satisfied, with a grin on my face. Such a great experience and incredible food."], ["Melissa S.", "One of my favorite spots in Chicago. Every time I have been here I've only sat outside so I have no idea what its like inside. I definitely recommend the croque madame for brunch! I still need to check it out for dinner, I'm sure its fab!"], ["Mandy W.", "good service, the waitress was very attentive and sweet. The mussels, casoulet and duck in orange sauce were good but they were not very impressive.  Yet, the dessert was the main part.I ordered the Brittany cake aka Breton gateau which was sooo delicious tbh, I wanna like that plate xD. Would definitely come here just for dessert =)"], ["Brittney H.", "I dined here in April for my birthday. While I don't remember all of the beautiful food I had (just that it was tasty), I have to point out that you must go and order the Filet de Boeuf en Crote. The portion is huge, so come with an appetite or share with a dining partner. The beef wrapped in phllo Crust is so addictive, this mixed with the red wine sauce and vegatables was one of the most rich, delicious dishes I've had. A very cozy/romantic atmosphere. The chef made appearances and thanked us on the way out!"], ["Sam B.", "I only wish I had discovered this French treasure earlier. My new go-to brunch restaurant. The open kindness and attention are somehow topped by the decadent cuisine. Ask for Tony as your waiter and prepare to be impressed. C'est Magnifique!"], ["Josh G.", "I've been to Chez Moi twice since it opened.  Once last fall for brunch with the kids, and two weeks ago for dinner with friends.The brunch was not that memorable.  I enjoyed my omelettte but the kids were not that thrilled with their food and I don't think we'll bring tem again for brunch. Maybe it's too adult for them.  With two college age boys and two pre-teens, maybe they were looking for more pancakes, skillets and French toast.  I get it.A few weeks ago I made plans to meet friends from school, who were both running late.  I actually arrived about 10 minutes early, so I had about a half an hour to wait until they arrived.The wait staff made me feel very comfortable waiting for my friends, giving me just the right balance of attention and space.  I enjoyed a glass of wine or two while I waited, and watched he room fill up with patrons who were as happy as I was to be there.  It was a gold night and we were all happy to be inside from the cold.I ordered the mussels and trout.  The trout was spectacular!  Pan fried on a bed of greens.  I can't wait to return and have it again."], ["Ritu R.", "What an adorable little French place.  Very warm & comfortable space.  We both started w/lobster bisque which was filling and perfectly seasoned.  We also ordered roasted garlic cloves to have with our bread.  Quite tasty also.  I had the scallops & the hubs did the cassoulet.  Scallops were amazing! Perfectly prepared in a creamy sauce w asparagus.  It's filling and something I'll remember about this place for sure.  The hubs cassoulet was perfect for a freezing snowy January night.  Hearty.  \"Perfect after walking 2 mi in the winter night\".  Also quite filling.   Split the special gâteau dessert and it's like a  bite of heaven.  Great experience. We will be back."], ["Brian S.", "Really like this place as a neighborhood date night spot.  Great cassoulet.  Need I say more?Sit outside on a nice night (there are usually 1-2 a year in Chicago) and you will be in heaven.  Nice wine list as well."], ["Barbara O.", "Went last Saturday. Overall the experience was fine, I won't be rushing back. Had mussels to start sharing with my husband, I adore mussels but these were not great at all in my view. Steak frites for main, was nice but nothing special. Desserts were good. Atmosphere wasn't great, place was only 1/3 full. Was hoping for better. In future I'll go back to Le Bouchon or Mon Ami Gabi for my French bistro fix"]], "Bistro Voltaire": [["Anita G.", "My husband and I had a 7:30 dinner reservation here. Three long hours later, we were finally able to leave, and that's only because we asked that our dessert be packed up in a to go box. I can appreciate a nice, drawn out romantic dinner, but this one was far longer than expected, and I was so happy when we could finally get out of there. The only reason I'm giving 2 stars is because the food was good and came out fairly quickly. Needless to say, we will not be returning."], ["Ali C.", "Spectacular - outstanding scallops and strip steak.  Must return.  We loved the bar with the french music.  Service was outstanding.  A reminder of France while in chilly Chicago."], ["G R.", "Review 500! Well had to pick something special, and Bistro Voltaire fits the bill. I got to the restaurant a bit early and sat at the bar, while waiting and enjoying a glass of wine I conversed with the owners and bartender, very friendly and relaxed chit chat. Relaxed, efficient and delicious would be the way to describe this bistro.I could go on and on above the perfectly done medium rare steak, or tasty onion soup, or my friend saying that her pork tenderloin was just as perfect, but I won't. Let's just say everything was as it should be, being a server in what seems to be a past life I could usually find something to pick apart, well I couldn't. Merci!"], ["K C.", "After returning from a recent trip to Paris, my hubby and I wanted to relive a classic French restaurant experience. Bistro Voltaire and it's owner Ned couldn't have been more perfect!  Cozy atmosphere, yummy Bordeaux, salad with mustard vinaigrette, butternut squash soup, chicken, beef bourguinon n pear tartlet were phenomenal."], ["Catherine D.", "My husband took me here for our anniversary. We had driven past it countless times, and I'm so thankful we finally walked in! We received high quality service from Steven the entire duration of our stay. We enjoyed french onion soup, pork tenderloin, and their famous chicken. It was all fantastic and surpassed expectation. Our night ended with complimentary champagne as we shared two desserts that had been beautifully prepared: apple tart and classic creme brûlée.Great service, great ambiance, great food, and excellent wine. I will absolutely return."], ["Amy R.", "Went here for restaurant week. The service was great! I ordered salad, salmon, and chocolate lava cake. Everything was decent, but I've had MUCH better french fare. Of all the \"Bistro\"s in Chicago, I probably wouldn't go out of my way to eat here."], ["Mark M.", "Thoroughly enjoyed our Valentine Dinner last night. Both the pork tenderloin and the cassoulet were delicious. Our waiter paired glasses of wine for each of us for each course. Try the Chardonnay. What a wonderful way to get a head start for our special day."], ["Helen S.", "I've never been to France before, but eating at this little restaurant in River North was how I imagine a meal at a quaint little bistro in France would be like. You got the black-and-white checkered floors, delicious food, and the sweetest server with the heaviest French accent.We used a Gilt City offer and started off with a champagne flight, which came with three half-flutes. I'm not quite sure how champagne flights are supposed to be done - are you supposed to drink them with your meal like wine, or all before the meal itself since they gave us the flights at the very beginning? I ended up sipping my champagne with the courses but I'm pretty sure that I was doing it wrong.We both ordered crab cakes for apps, which were great. Very heavy on the crab meat and barely any filler, yum. However, the crab cakes sat on a bed of thinly sliced root veggies that were strangely sour and tasted a little weird. We also each got a $1 oyster which were super fresh.For my main course, I ordered short ribs in red wine gravy on a bed of mash. The delicious meat was fork tender and the gravy complemented it well, plus the mash soaked up any extra. My bf got the salmon, which was cooked perfectly but I didn't think that it was well seasoned (then again, I'm biased against salmon this week since I've been eating it for the past few days). My dessert was profiteroles, which were three cream puffs filled ice cream and covered with chocolate drizzle. My bf got the chocolate cake, which turned out to be a chocolate lava cake much to our surprise. Both desserts were delicious but super heavy. I came into this meal reasonably hungry, but was practically bursting near the end. Service was great - our waiter was super quick and just the most adorable person really. He made sure when we were leaving that we didn't trip on the awkward step outside the front door, and I wanted to give him a big hug right then and there because I trip quite often. Overall, good dining experience with solid food."], ["Myco N.", "My boyfriend took me here this past Saturday for my birthday. Being an avid (if not obsessive) Yelp reader, he reassured me that it would not disappoint! And it didn't, or at least the food didn't, but I'm getting ahead of myself. SETTING - very cozy and cute atmosphere. The place is unassuming from the outside, but quite lovely on the inside, if not a bit small. The Frank Sinatra and Edith Piaf songs floating through the air and romantic ambiance more made up for it, so go with someone cute and cozy up. Try not to sit by 2 very loud and immature college girls talking about their boobs, if you can manage it. It'll make for a much more pleasant experience. FOOD - The food was delicious! We started with escargots and a perfect mini loaf of baguette. I must say they are prepared with a bit of puff pastry on top which I wasn't used to, but yummy nonetheless. Wish it had a bit more garlic butter. I proceeded to polish off my duck breast in record time, while my boyfriend died over the pork tenderloin. We both loved our meals, and if it wasn't so unacceptable, we would've licked the plate. We didn't. Instead we opted to be normal people and ordered creme brulee for dessert. Which was great as well, but if you're a French restaurant, I more than expect you to not screw that up. DRINKS - I nursed a Moliere while my date sipped on his Manhattan throughout dinner. Nothing special. I would stick with wine next time instead of cocktails. They were rather unimpressive. SERVICE - The only area I was sorely disappointed in. Our waiter, though polite, was nothing short of curt and unattentive. He was dry, to-the-point, and appeared only to take our orders, deliver our food, and take our bill. We didn't get a smile, or so much as a \"How is everything tasting?\" I'd like to think it was because I inhaled my duck so fast he didn't come back in time, but I doubt that. I've gotten better service at restaurants where my bill wasn't $150, so when I walk into a fine-dining establishment, I expect the wait staff to ask me if the duck was too rare, or if I'd like more baguette (yes, in fact, I would). The same waiter took care of the 3 tables next to us, and paid more than enough attention to the others. Maybe he just really enjoyed the college girl boob-size conversation piece...OVERALL - I'll give it another go and not let a poor service experience get in the way. The food was good enough to warrant a 4-star rating. A bientot!"], ["Ian L.", "Food, 4.7 star, rounded up because there were no flaws.Service, 4.5 star.Went for Restaurant week with the partner, I thought it was incredible.First off, I had the mussels in garlic butter, a very generous portion for restaurant week. It was perfectly seasoned, fresh. She had escargot with bread crust. Slight edge to the escargots.For mains, I had Beef Bourguignon which was good quality, well balanced and seasoned.  Hers was again the winner, pork tenderloin medallions on asparagus and caramalized apple.Dessert was a standard chocolate cake, extremely rich and OH SO GOOD.We loved it, will definitely be checking out their regular menu."], ["T N T.", "Came here on a Monday night for my birthday dinner with a friend. I was absolutely enthralled by the food and the service. Steven (sp?) was extremely entertaining and very knowledgeable about the food and the wine. I had the Coq au vin, escargot, salmon tartare, and chocolate souffle. I loved all of it. At the end of our dinner, we were one of the last 2 tables left. When the other table was leaving, they actually sang happy birthday to me! I assume a little bird (aka Steven) told them that it was my birthday. Made my birthday. I will definitely be back when I'm in Chicago again."], ["M P.", "Disappointing. Scheduled a romantic birthday dinner for my husband and the evening was a let down. We started with the cheese and meat plate, the menu said it came with pâté but when the plate arrived, no pâté. We mentioned it to the waiter and he said the plate shouldn't come with pate but if the menu says it does then he would get us some, I appreciated his promptness in addressing the issue... But still a little weird that it's listed but shouldn't be? We then had a salad which was fine, a little too heavily dressed for my personal taste and then French onion soup. The soup was very tasty BUT it was all cheese! I wish there had actually been more soup under all of that cheese to enjoy! At this point the evening has been fine but this is where it starts to go downhill....My husband ordered the short ribs and I ordered the braised lamb shank at the waiters recommendation. The lamb shank was literally the most unremarkable thing I have ever put in my mouth. It tasted like mystery meat, if you closed your eyes you would have no idea what it was. It lacked any kind of seasoning, I took a couple of bites hoping it was just that bite, or just that bite, or just that bite..... But, alas, it was my whole entree. My husband tried it and felt the same. On the flip, his short rib was delicious! I feel like the lack of flavor in my lamb shank can't even be captured with words, it was literally one of the most bland things I've ever tasted.... I must believe there was an error in making the dish that night, no restaurant would intentionally serve this night after night, nor a server recommend it.We left the lamb shank plate nearly full and when the server came he didn't even inquire if we liked it/if everything was ok/if we were done, he just picked the plates up off the table. We then order the chocolate lava cake and some coffee because they were out of port. When the cake arrives it is smashed open with the ice cream placed over the broken cake, already melted. I love chocolate lava cake and order it frequently, no one serves the cake already open.... Part of the appeal is cutting into the cake and opening up the gooey middle.... If you look through photos of the dessert on yelp you'll see they traditionally serve the cake whole. It was so obvious they broke the cake and then just tried to cover it up with the ice cream. I understand it tastes the same (although the ice cream melted much faster being placed on the hot \"lava\" before being served) but I think it says a lot about the restaurant.... Clearly no one tasted the lamb shank, they make an error with the dessert and serve it anyway.... And we didn't receive our coffees until after we had finished our mutilated dessert. All in all, it was a memorable evening but not in a good way.  We will not be making a return visit. Now I'm off to try and add flavor to the giant take home container of braised lamb shank I now have in my fridge...."], ["Ashley S.", "I've heard about this place multiple times and never took the opportunity to make a reservation. Luckily a date made it for me and we loved it. We were the only table besides people at the bar at 8p on a Thursday night. But I have a feeling our server would have been awesome sauce even if the place was slammed. But maybe don't pick it if your companion is conversationally challenged. Let's break it down:Didn't offer tons of wine recos but I loved the Malbec we had and the server'sMussels - Huge and surprisingly tensor. Great startPork - I don't eat enough protein so I went with the other white meat based on the server's reco. It was tender with a capital T. I should stalk the chef to train me. Salmon - The crispy skin and excellent temp  blew my date away. Plus a dude that likes salmon is a bonus for me. Creme brûlée - Complimentary from the chef. Boy was I not sad. Cleaned the plate. Sorry I'm not sorry. But seriously, super creamy. Surpassed my expectations. Great hidden gem. Will be back."], ["M K.", "I went to Bistro Voltaire during Restaurant week and really enjoyed it. I have yet to return to to this French Bistro but I definitely plan on doing so. This is another place that I did not have a bad dish. The salad to the steak was prepared to perfection. I would advise making reservation, it is not the biggest space."], ["Bert C.", "We spent Valentine's Day 2015 dinner @ Bistro Voltaire, and enjoyed it thoroughly. It has a small, but charming, dining room and we were quite cozy with our neighbors at adjacent tables. We sat up front, near the front door, which made it a bit cold when the door was opened. We had excellent recommendations and service from our waiter, Steven, and opened with the Salad de Chèvre, which was spectacular, and the Lobster Bisque, which was good. The bread was hot and right out of the oven and we could have eaten an entire baguette, hard on the outside and soft and warm on the inside. Our main courses were the duck and the bouillabaisse, both of which were fantastic! We finished with a flawless creme brûlée and the soft in the center chocolate cake. It was a wonderful dining experience, although I would suggest asking for a table towards the back of the restaurant, if possible. We would not hesitate to return."], ["Teresa C.", "I had been meaning to try this place for a while. Atmosphere was typical French bistro, service was exceptional, and the food was great.I want to go back to make sure it wasn't a one time thing!If you are looking for a quiet meal with a friend to have great catch up conversation, or are looking for a quiet date spot where you can actually talk and hear each other, this is a great place to consider."], ["Duke P.", "Came here on a Gilt deal a while back. Definitely worth a visit! Cozy little place with authentic French food. Service was top notch, our waiter (Steven) was excellent, very attentive, polite and accommodating. They had a decent drink menu as well, we had 2 mixed drinks and wine and were really not disappointed. Really pretty happy with our visit here. Will definitely be back for another go at dinner."], ["Joe D.", "The restaurant has nice ambiance, the food was decent, but the service was awful (other than getting drinks at the bar).  We ended up waiting about an hour for our table despite having a reservation.  It seemed as though they were understaffed, which can happen.  I get that.  However, it also seemed like our waiter was inebriated.  I obviously don't know for sure, but he was slurring his words, forgetting things we ordered, and making inappropriate comments.  At one point, he claimed that he adopted my wife and I as his children for the night... the whole evening was just odd."], ["Titus A.", "About as close as one can get to a true French bistro experience.  Have eaten here twice in the past few months, and found the service warm and welcoming, the atmosphere Provence-ish, and the food succulent. Have eaten at over a dozen French places in Chicago, and Voltaire is easily the best.  The tarragon chicken and magret du canard were fantastic, and la tarte a la pomme was orgasmic.   We stayed til after closing both times, and we never felt rushed.  Will return again in a heartbeat."], ["Lixi L.", "Came here for my sister's birthday. It was a couple days before Christmas and we didn't make a reservation, big mistake. But fortunately we got seated at the bar table and the bartender, who was from Paris, was very poised but approachable. We started with some mussels (fantastique!) and wine, then headed for entrees, duck confit and salmon, and finished with warm chocolate cake (highly recommended) and espresso (pretty smooth and not bitter). The salmon was delicious but the duck lacked a bit of freshness and flavors to me. (but the server has warned me that duck wasn't in season so I can't  really blame anybody.) I must say I had better food else where in Chicago but the ambiance made it up for me, the room was dimly lit with candles and very cozy, just wished that they played French music instead of English. It was overall a pleasant experience, can't beat the free champagnes for birthday (the servers like to do a little something extra for special occasions), will come back for the mood.Atmosphere: 5 starsFood: 4 starsWine: 4.5 starsService: 4.5 stars"]], "La Sardine": [], "Paris Club Bistro & Bar": [["Leana D.", "Earl was an amazing server - we had a group of 11 and he made it painless to dine with such a big group!I loved loved loved the appetizers - lobster scrambled eggs with black truffle oil with toasted baguette...heavenly!!  The pate and escargot and little gem salad were also all noteworthy and impressive.  My dinner entree was the steak frites and also good, but I ate too much during the appetizers and could have skipped a main course.  The only thing annoying was that my kir royale was served at the bar in an open glass, instead of a champagne glass, which pretty much ruined it for me.  I commented to the bartender that I didn't like his glass choice, and he really didn't care.  I would have just had a glass of wine if I would have known the kir royale was going to be served like a margarita.Overall the Paris Club was very accommodating and helpful with our big group.  A great spot!"], ["Scott K.", "We so wanted to like this place when our local friends asked us to meet us there. They remembered it from way-back-when and clearly it's changed a lot and not for the better. The hostess at the door greeted us with less than a smile when we said we had reservations. Bear in mind, it wasn't busy at all. Once seated, the service was curt at best. They may have been understaffed but if I am spending several hundred dollars on a meal and drinks with friends I'd like a little service. Courses were slow to come out and overall the service quality was very poor. The food was pretty good though. The steak frites was solid. As was the duck. The fried oysters were ok. However, as sometimes is the case, this restaurant has fallen into the \"truffle trap\". They have it on everything and it's so over done. Pro-tip: if you are going to do truffle on a dish, pick just ONE and do it really well. This place did not."], ["Greg T.", "I actually made my new yelp account which took me several minutes to do in order to tell the public about my experience here. So I'm a teacher, I bought an rv to travel across America with. In Chicago I heard excellent reviews about Paris Club.  I then met a promoter during my diner at 51 pub and he had told me I would get free admission if I mentioned his name. I then went to Paris shortly thereafter.  The bouncer/check in person was white and in his mid 20's of decent build.  He then preceded to tell me \"if you get a girl I can get you in for free\" \"we are not trying to have any guys in here\".  \"It's 20.00 cover\"So I just traveled 800 miles to experience this...You can make your own decision based on my real life experience."], ["Lauren S.", "Authentic French food and wine!, this place has the perfect combination of ambience; French music, deemed lights, great deco. If you want to spend quality time with a special someone, or simply have a nice conversation while enjoying the exquisite food, this is the place! I will be back next year!"], ["Justin W.", "I went for dinner with a friend recently and really liked this place! There service was excellent and the food was good... though perhaps a little too good. I don't eat right food very often and didn't feel so well after, though only because I was so stuffed. Definitely ask the server if certain items are shareable. We got a pumpkin risotto which was phenomenal, but even between the two of us was a lot. The escargot were delicious, and the ONION SOUP... you have to get it! In all, I'd go back, but I might eat a bit lighter next time."], ["Angela B.", "This is a review for my overall experience: Service and FoodFood alone was 4 stars.My boyfriend and I came here for chef's week. We ordered: Escargot, French Onion Soup, Skate Wing,  Kir Royale, another strong drink with campari (cannot remember the name, but it was delicious),Steak Frites,  chocolate mousse, and profiteroles.The Steak Frites were DELICIOUS. The steak was seasoned perfectly and the bearnaise sauce was also really good and the fries were warm and crispy. The skate wing was also very delicious but the portion was smaller that we expected and I preferred the  flavor of the steak and fries (if I come again and want a light dinner, I'll definitely order skate wing). I've never had escargot before, but it seemed to be cooked appropriately; I really liked the sauce. The french onion soup was a bit cheesy for me, but it's the perfect thing if you like cheese. The mousse really was not good at all (very dense and boring) but the chocolate sauce on the profiterole was AMAZING and went well with the caramel (I was scraping the plate when we finished).The service left much to be desired. We dined on a Friday night and there were probably 3 servers in the entire restaurant. After the host seated us, we waited for about 20 minutes and no one came over. Another couple was seated next to us and were served automatically, when I objected the the server apologized and said \"Oh have you been helped?\" We explained the situation and she apologized and filled in, but it left a bad taste in my mouth. Also, because she had so many tables she was not very attentive....it just wasn't good service."], ["Allison M.", "We came here one New Year's, and it was absolutely unreal. They have a dish that includes scrambled eggs and lobster, and it may have been the best entree I've ever had in a restaurant.They were incredibly accommodating to our party of six, the wait staff was friendly and excellent at coping with a very full restaurant. Plus they're Lettuce Entertain You, with all the perks that come with that!Unforgettable dining experience, even months and months later. This is a fabulous destination for special occasion dining. I know I'd appreciate a birthday dinner... and an anniversary dinner... and a date night dinner... and a \"just because\" dinner here...!!"], ["Nishan P.", "Paris Club has the warm feel of a classic French bistro with dark wood, red leather booths, and piped in jazz.  The atmosphere is intimate and relatively quiet allowing for easy conversation.   We were delivered spinach and gruyere profiteroles, compliments of the kitchen, soon after we were seated. For our main courses we both elected to get the national dish of France: steak frites.  She picked the béarnaise sauce and I went with the bone marrow bordelaise.  The skirt steaks and French fries arrived at the table piping hot.  Both sauces were good but I preferred the béarnaise to the bordelaise.  The fries had a meltingly soft interior and with a crisp crust. They were well seasoned with parsley and a good salt.  The dessert of salted caramel profiteroles was served in a warm dark chocolate sauce.  One portion was more than enough for two people though I could have easily consumed it by myself. I tend to be extra greedy when it comes to desserts.The service was attentive. Our waiter was very knowledgeable on items offered by the bistro from the special wines to the La Colombe coffee.We had a very enjoyable experience at Paris Club Bistro.  Two return visits have already been planned."], ["Bethany W.", "Would have given it 5 stars but the hostess was a bit rude and unwelcoming. As for my dinner experience that was fantastic. This was my 1st time back since the remodel and it definitely feels more like a cozy spot in Paris than it did before. It tried the mushroom risotto which was creamy and delicious. The shaved cheese on top game those bites just the right amount of sharpness that I like with the creamy mushroom flavor."], ["Jasmine B.", "My group found ourselves at Paris Club late on a Sunday night, for drinks and desert only.  This review cannot speak for any main course or appetizer.Lets start with the atmosphere, it is just beautiful!  Dark, romantic, luxurious feel the second you step inside.  The restrooms are just single stalls, so be prepared to wait a bit.  Ladies, no need to use the restroom in groups.Our server was lovely, giving us suggestions as necessary and making sure we had everything we needed during our late night visit.Two of my counterparts tried champagne drinks, I cannot recall which ones, but they noted they were just OK and nothing spectacular.Unfortunately they had run out of my desert of choice, the salted caramel profiteroles, but they graciously offered a substitute desert at no charge.  I chose the tart, and it was quite tasty, not too tart, not too sweet.  Thank you Paris for being a gracious host, as a last minute substitute for our cancelled reservation elsewhere.  The next time I am in Chicago I will be stopping by to try your food."], ["Joseph D.", "So disappointing. Really wanted to love this place but sadly, cannot recommend it.  5 stars for cocktails, 1 star for service and 3 stars for food but given the prices, I expected better so I'll have to round down on my review.We had a reservation for 8 on a Saturday night and were told it would be a little while before we were seated. No problem, we went to the bar and not two minutes later were told our table was ready. Thing is, the expertly crafted cocktails (try the Sazerac - amazing) take a long time to make. So there we stood with the hostess kinda hanging around with us in an awkward trap.  Someone should have said - no problem - we'll bring your drinks to your table. instead we let the ladies sit and by buddy and I waited for our drinks. Thankfully they were worth the wait.Our server was very inexperienced and that really played a big role in my dislike of the place. Just because you put a dress shirt on a 23 year old and give them a white apron to make them look like a Parisian waiter, does not a great server make. She was hard to find, had to ask for bread twice, good luck getting your water glass refilled and a replacement fork was no where to be had. When you spend you time looking around the room hoping your server will stop by, instead of chatting with your friends, that sucks.The one time she did stop by was right as our food was placed down. Kinda hard to know if everything came out OK if you haven't given me a chance to try it. I should mentioned the place was busy but not crazy busy.The food was hit or miss. The apps like steak tare tare and the scrambled eggs with lobster were great. The entrees were so-so. My Duck a l'Orange was meh. And for $38 it was ever more disappointing. other reported their dishes to be decent but nothing to write home about. All very pricey. I get it, it's River North but c'mon, at least make it good!We had desert (the eclair) and it was good so at least we needed on a high note. But gotta say that service (or lack thereof) really did it for me. I may try it again on a less crowded night and see if I do better but for $38 I better at least get a clean fork!"], ["Libby B.", "I ordered the roasted chicken and chocolate mousse from grub hub. The food is worth 5 stars - the chicken with mashed potatoes is just the home-y delicious meal I was hoping for and the mousse is absolutely incredible (this from a serious chocolate lover) - but the portion of mousse I received is ridiculous! It's incredibly rich, but the 5 bites in the container are not worth $8.95. Paris Club Bistro is expensive, but the food is good enough to warrant an in-person experience, in which (I would hope) the mousse portion is more reasonable for the price."], ["Tricia D.", "If I were to sum up this experience in 1 sentence, it'd be: better than any meal I had in the actual Paris! (Ok, that was actually a fragment, you grammar nazis out there.)With the exception of this bizarre incident (story coming), everything was fantastic!  I was waiting for my friend at the bar, and since all the seats were occupied, I was standing on the far side by the dining areas with my drink on the bar top.  Somehow, this oblivious blond waitress moseyed in between me and my drink, completely blocking me off!  Wth?  There wasn't even that much room in between my body and the bar, and she wasn't even doing anything of value for the time she stood there, just gabbing away with another staffer.  Anyway, after my small, but mighty punch cocktail, I was feeling pretty good.  My friend and I shared the mussels and frites with the 10oz burger.  Delicious!  I believe the waiter said the broth was a white wine base with some sweet vermouth in it.  You know I slopped up that juice with the baguette!  Burger was juicy, flavorful, and hit the spot.   P.S. I give the waiter props bc he was friendly, informative, energetic, yet not overbearing!Even though our pants were starting to feel tight, we opted to share the salted caramel profiteroles for dessert.  I must say that was a superb choice on our part.  Hands down, best profiteroles and salted caramel sauce (served piping hot tableside by a manager) I've ever had!"], ["Michelle H.", "Out of all the French restaurants I've been to in Chicago, this one remains the worst in my memory.  It's been a few months since I went and can still recall the experience well.  It's right next to a club=noisy.  The hostess acted awkward towards us, as did the waiter.  The food was very disappointing and the atmosphere was not enjoyable.  Cannot recommend."], ["Norman W.", "Brought me back to my time in France. Say hi to Zane for me. He surprised and delighted us with awesome hospitality."], ["Steve A.", "This is a classic French Bistro with a beautiful interior and a traditional menu. The highlight of their food offerings is the Spiced Duck for two. It's beautifully browned and coated five spice, which fills the table with the most amazing aroma. Served with crepes, julienne vegetables, and a delicate (not overly sweet) orange sauce, it was some of the best duck I've had.The wine list is mostly French, and there are a few nice offerings from good vintages, although you get what you pay for (and vice versa).The next time I want duck, this is definitely where I'll be."], ["AV G.", "You will not have a bad meal at a LEYE restaurant.  The food was fine.  Place is very expensive for what it is.  Portions are small.  Had to beg for some bread when everyone had ordered a salad starter.  Many better choices (including other LEYE spots) within inches of the PC.  By the way, I have been to a number of work related events here, and it was very good.  PASS on this one..Nice job on the re-model--much more attractive"], ["Mihir P.", "Excellent classic / comfort French dishes with a slight spin on them.I recommend:- Steak Frites: as classic as it gets! Thin yet moist with thin crispy fries- Crispy Duckling: though I wish they had it \"a la orange\" style, this is tasty and a bit healthier.- Burger: I preferred with when they served it plain with their strong dijon on the side, the Saint Germain sauce is tasty but a bit rich. The meat is lightly seasoned, juicy, and  delicious.Service ranges from friendly to socially awkward."], ["T. L.", "Ducked in for a quick week night dinner, first time since it was converted from its original larger, more trendy space.  Definitely a cozier, more French bistro vibe that's a nice addition to the area.  Had the onion soup ( very good - will be returning for this when the weather gets chilly again), frites ( good but nothing special) and the little gem salad ( fail, weird 1000 island like dressing with salsa on a pseudo caesar).  Would return to try out other items on the menu..."], ["Dan R.", "This was my first time at Paris Club.  Please take in consideration that I am NOT a party girl, so it is very complicated for me to compare clubs.  But I know this: wherever the music makes me feel good and people are nice, that's the place I want to be! First of all, I didn't even wait in line. I know it sucks when you are standing in line or pay to be at a place and someone gets there and just completely jump in front of the queue.  That was me last Friday night.  The girl in a sweater and flat boots jumping in front of you who spent \"45 minutes to get all dressed up\" ( yes, quoting Partition from Queen Bey here) I was twice as awesome people were so nice.  Sipping champagne and dancing like there was no tomorrow.  I can't believe I stayed there passed 2am. I really enjoyed this place, but yeah, some variables contributed to my experience. I know that this place is rated as one of the hottest spots in Chi so if you are a out of towner you should most definitely check it out!"]], "Cook Au Vin": [], "Chez Joel Bistro": [], "Les Nomades": [], "La Petite Folie": [["Susan G.", "In addition to their lovely restaurant, La Petite Folie does great catering. We use them whenever we have a special occasion and the food is always extremely tasty, beautifully presented, and imaginative.  Mary will customize a menu that works for you - and their prices are very reasonable. So, if you're tired of cooking yourself and want to impress you guests, call La Petite Folie!"], ["Doug Y.", "My wife and I lived in Hyde Park 30 years ago when I was a student at UC.  Back then, there wasn't a HP restaurant like this, had to go near north to get bistro type food (this is not a slam on long standing HP dining institutions, Ribs N' Bibs, Harold's Chicken Shack - both great but a different dining experience).  We went on a Thursday night and it was pretty busy.  Wait between courses was not long and food was well prepared and pretty tasty.  I had shrimp crepes and enjoyed it, not Michelin 3-star, but certainly worth the visit.  Service was a little odd, waiter came to take food order and never asked about drinks/wine.  Had to flag down someone down to order wine.    Despite these not-that-negative comments, we should all support owner/chef restaurants that are trying to offer something a little different."], ["Melissa H.", "I think this restaurant is cute! Yes. It IS in a shopping plaza BUT can you think of a nicer location considering that it IS Hyde Park? I wish it was a bit bigger. A little awkward with the coat check being right next to the door and right next to someone's table. Whatever. On to the more important stuff. The food was delicious! We started with a salad and soup then the wild mushroom tart and the lobster medallions....then it was on to our main courses which we had the filet mignon and the scallops. For dessert we had the chocolate bombe.  The wine was St. Veran which I loved so much I went to Sam's to pick up a bottle the following week."], ["Angela K.", "Didn't think the food was worth the price."], ["Kate L.", "La Petite Folie catered our rehearsal dinner and wedding last weekend. It was perfect. The food was melt in your mouth, lick your plate good. The service was excellent. We also had the most painless, helpful planning experience thanks to the amazing owner, Mary. She gave us a wedding experience people dream about. If you are considering using their catering service, do not hesitate. If you are considering having a meal at the restaurant I highly recommend it. Best meal you can find in Hyde Park."], ["Alan M.", "The food was more comforting than adventurous.  The service was good, the portions perfect, the presentation appealing, and the overall experience satisfying.  The pastry in all its forms was excellent.My only concern is that it is slightly overpriced.  On the other hand, I've paid more at inferior establishments, so I think that this is a safe choice."], ["Derek S.", "in an area with few options, this is a classy and comfortable place to get a great meal at a reasonable price.  it's usually very busy with academic types, so don't plan on an empty restaurant.  it's not necessarily a place i'd go out of my way for, but if you're meeting someone from U of C for dinner, it's your best bet."], ["Britt C.", "I have never had French food before trying this place, so I went in expecting things to be meticulously prepared and presented, with a few unusual menu items.  For the most part, I was not let down.  Everything was generally beautiful and delicious, but seemed overpriced to me.  The food was excellently prepared, but still had a couple misses.  I started with a field green salad with grapefruit, grapes and walnuts that was good, but for the $7 price tag, it was tiny.  The presentation was a little fussy for my taste; it had a lengthwise slice of cucumber propped up and wrapped around a handful of greens, with two slices of grapefruit and a couple of walnuts and grapes on the side.   For the main course, I had a breast of pheasant that was perfectly done, and it came with a corn flan that was amazing.  The leeks that came alongside, well, I think I could have done better.  For $27, I just expect that everything should be PERFECT, and while it was good, it didn't knock my socks off.  I will say that the service was unbelieveable, though the decor looks like it hasn't been thought about since the 80's.  I guess it is ok for the mostly gray-haired set that seem to frequent the place.  Maybe I'm just a snotty twenty-something, but I'd prefer to go to a more relaxed place where the food and atmosphere are a little more exciting.  Would I return?  Sure, if my mom who adores this place pays again.  But not on my beer budget."], ["Steve M.", "Love the food, but questionable service.  I'm a great fan of the prix fixe menu, and every course was simply great, subtle, refined flavor.  The three courses are in perfect proportion.  But the butter dish had a chip in it the size of a silver dollar, and the waiter slopped wine around my place setting.  In general I found the wine service too formal and old fashioned, with the presentation of the cork and offer of a taste.  The wine was not opened at the table, so offering the cork seemed odd, and maybe I am too sensitive but the whole cork-and-taste bit seems a little gendered in the 21st century.  In general we saw far too much of the waiter, who kept popping up and repeatedly asking if we \"had any questions\" in a sales clerk sort of way.  The prix fixe menu is mostly a bargain; I would actually be willing to pay more for a flight of wines with each course.  I will definitely be back, but I hope LPF works with the servers a little more and reviews basic things like making sure the table is properly set with non-broken dishes."], ["Marissa D.", "this restaurant makes me :(that being said, i am (clearly) not a fan of la petite folie. it is trying way too hard to be something it's not. the atmosphere is blah. the service is not good - they weren't rude, they just clearly weren't trained to be working in the type of restaurant that petite folie is trying to be. the food is edible, but overpriced. my steak looked like something they would serve at a retirement home (no offense if you live in a retirement home). it was very sad looking, and very bland tasting. it all just made me so glum because i really like eating and i really like french food and i really wish things could have been different. there are better options in hyde park. go to them, not to here."], ["Darlene L.", "My party of six spent a wonderful Valentine's Day at this restaurant.  We enjoyed a special fixed price menu with a variety of choices.  There were  great offerings among 5 or 6 appetizers, salads, entrees, desserts.  Everything was delicious and beautifully platted and served.  The fresh asparagus with hollandaise was just right in texture and flavor. The salmon en croute filled the plate with tender salmon encased in a light puff pastry.  One diner raved about his beef tenderloin and others about their lamb chops.  The desserts were a bit on the very sweet side but great V Day splurges including cheesecake, strawberry tarts, and apple pastry.   I brought two bottles of wine: a champagne and a French Burgundy which complemented our dinners.  The corkage was $20 per bottle.  This would be 5 stars but the service does not match the fine dining reflected in the atmosphere and food.  We had to ask our server to pour the champagne and chill it. She removed the glasses later in the evening before we finished the last of the wine. We had to request a decanter.  Servers need some training. However, this is a hidden gem in Hyde Park and a place to visit again."], ["Andrea G.", "I wouldn't go the restaurant. It's in a lousy location, and the restaurant itself isn't that great looking. However, the food is FANTASTIC. I've been to a few events where they were the caterer and they're AMAZING. No way this place can get away with being fine dining in hyde park."], ["Patricia B.", "Acrually four and a half stars is more accurate - this is an excellent French restaurant!  Having been here before but not lately, it was a wonderful experience to re-acquant myself with this hidden-away gem.  At lunch, the prices were very reasonable, and the food terrific.  The salmon, quail, and duck salad received raves from all of us, and the desserts were exquisite.  Everyone loved the butternut squash soup.  Wines by the glass are a good value, and the service was friendly and well-paced.   It is worth the quick trip to Hyde Park from points north for this excellent culinary treasure.  Come to think of it - this is very nearly a five-star place."], ["marie n.", "My daughter and I had dinner before Court Theater recently.  The presentations were gorgeous and taste commensurate.   Our wine was very good and not expensive, room quiet, elegant, soft classical music, pleasant server---look forward to returning"], ["Audrey J.", "La Petite Folie translates to \"the little madness,\" and man am I mad at whoever told me that this is \"fine dining\" for Hyde Park, let alone Chicago.Food: Average-to-good. 3 stars.Atmosphere: Below-average-to-average. 2 stars.Service: Average. 2.5 stars.Value: Below average-to-average. 2 stars.Living up to expectations: 1 star.Food: The food was decent. The bread and butter were excellent, quite possibly the best part of the meal. I had the prix fixe meal ($30 if you go between 5pm and 6:30pm), which is a starter/appetizer, an entree, and a dessert. The asparagus soup (the soup du jour) was good. Slightly bland, my friend and I both needed to add a little of the salt/pepper on the table. For my entree, I had the lamb, which was served with an interesting (in a not-so-good way) spicy bean salad side and steamed and buttered broccoli. The broccoli was good, but the bean salad did NOT do it for me; its spice was just overdone and it was a little too salty, too. There was just TOO much going on in the bean salad. The lamb was good and tasty, not gamey, and seasoned effectively with cumin. For dessert I had the pear fruit tart with a helping of ice cream. It was quite good, and it appears to me that the chef knows breads because the crust was yummy and flaky. Overall, hits and misses, nothing too spectacular (except the bread and butter, which strikes me as somewhat telling).Atmosphere: Ehhhh...for an expensive-ish French restaurant, I expected more. Sure, there are crisp white tablecloths, expensive-feeling silverware, and bud vases on each of the tables, but that doesn't blind me to the other odd things decorating the establishment. Perhaps they were going for a French provincial look (which I'm admittedly not very familiar with), but it was just plain odd to have what looked like a welcome-mat-quality rug hanging on the wall. I guess you could say the decor was just pretty eclectic, and I'm not sure if it all worked. On the plus side, the bathroom was nice, well-maintained, well-decorated, and well-stocked with Williams-Sonoma hand soup and hand lotion. On the minus side, the ceiling was really a disappointment. It reminded me of an office building (with those long rectangular slabs), but they were textured b/c they were concrete. All of it was painted white. Oh, and the large, square-shaped, slatted air vents were very noticeable on the ceiling.Service: Our server was friendly and helpful. When my friends wanted wine suggestions, he had them. Good job with that. Other stuff was not so great. There were just service issues that would not happen at a top-notch restaurant. We drained our water glasses a number of times and had to wait a bit for refills. When they served our food, only the one server would be serving, so our food came not all at once, but in the waves in which he could carry it. (I went in a group of seven.) So two people would get their food, then three people, then two people. All in succession, but only by our one server. We should have been served all at the same time, especially as the other servers who were there were just watching our server go back and forth. This appears to be a training issue, so maybe the owners have not caught onto this? Or maybe I'm just too fastidious in my expectations? Also, when we ran out of bread (as a table of seven would when given only one bread basket), I had to ask upon receiving my soup if we could have more bread. Shouldn't bread be refilled? Maybe I'm expecting too much here.Value: The quantity of food is very good for a French restaurant at the price that we paid. That being said, the overall value, considering the quality of the food (hit or miss) and the price paid, is really not that great. I'd much rather spend another twenty bucks and get the prix fixe lunch at (yeah yeah, you know they're my favorite) Jean-Georges or Bouley.Expectations? Totally NOT met. I expected more from \"fine dining.\" But I guess people don't have many options in Hyde Park. Eh.Overall, the food was okay and the restaurant staff friendly, but the experience is just not worth the price you pay to have it, EVEN AT the prix fixe price. I can't imagine coming here to eat off the regularly-priced menu."]], "Mon Ami Gabi": [["Tom B.", "This is Chicago fine dining at its best. We come here every year on the weekend before Christmas. Mon Ami is a small, intimate French bistro, and the ambiance is definitely part of the experience. It's located across from Lincoln Park Zoo, in the Belden Stratford building. The Belden is now a luxury apartment building; they stopped being a hotel a year or so ago, which was a tragedy. Regardless, Mon Ami Gabi has a a relatively small menu, but each item is carefully crafted. I got the 22oz bone in ribeye, which is pan fried and comes with fries (frites). This is one of the best steaks you'll ever have. A terrific French wine selection rounds out the menu.  Mon Ami is without a doubt my favorite Chicago restaurant."], ["Austin D.", "Great authentic French food, get the French onion, tastes just like home!"], ["Ann M.", "The food MAY be good but the people who run the restaurant are impossible with whom to deal.  They won't work with you and are not accommodating in the least.   Called today to see if 4 of us could eat at 5:30.  Yes it's a last minute request but the person on the phone simply didn't try & wasn't interested in working anything out.  This comes on top of an experience several years ago when my college educated multi-lingual daughter applied for a hostess job.  The hiring person promised she would call on one particular day.  Nothing.  It's simply just rude. And hurtful.  Am back to boycotting Mon (not) Ami Gabi."], ["Jack M.", "Highly recommend--love the atmosphere and the area. John was an amazing waiter. Food speaks for itself, cocktails were great. Excellent experience and will be back soon and recommend to every friend."], ["Dalia M.", "I'm unsure the last time I had a quintessential French meal out but this place was pretty delicious.It was super busy on a Friday night. We waited for our reservation for about ten minutes. The bartender is pouring drinks for everyone and he was pretty awesome with given me a niiiiice glass of Mccallans.Once seated our table of four split the mussels. Excellent. Save the baguette for the broth. We all ordered a variety of steak frites. I was unsure what to get and always get filet mignon so wanted to be a bit adventurous and  I ended up getting the pepper steak and it was really good. The fries were good, just not my favorite frites ever. Paired with a Bordeaux, my meal was trés bon.I will say my friend got a filet mignon with the Merlot butter and my goodness I will be getting that next time. I really enjoyed this place!"], ["Sean G.", "Pure French comfort food that's a bit more elevated than expected. My wife and I have been here a hundred times. It's on our regular restaurant circuit and we always come here for special occasions because they just do it right. Overall, this is my favorite restaurant in Chicago. It's situated in the Belden-Stratford, across the street from the Lincoln Park Zoo & Conservatory. Going for a stroll through the zoo, then coming here for dinner is my favorite thing to do on a Saturday. During the holidays, Zoo Lights and dinner at Mon Ami Gabi is a tradition, but reserve early - it's also the tradition of many others!My wife and I honeymooned in Paris, and the first time we dined at Gabi's, we were immediately transported back there. There are a few clichéd things about the decor, but it's tastefully done. The bench seats are surprisingly comfortable, and even though it looks like you're going to be cramped, you are never intruded on by other diners and the theatrical touch of pulling out the table for you to sit is always a treat.As for the food, I've tried just about everything on the menu, but they specialize in Steak Frîtes - and have many options to choose from, which is really unique. I do have to recommend the Dijon, Classique and the Bordelaise treatments - mouthwateringly delicious and tender. Now, if you've never had a classic, Parisian bistro steak, you will be in for a surprise. Unlike American steaks, they take a strip and pound it thin. If that sounds weird, don't let it deter you. It's super tender and every bite is exceptionally flavorful. The frîtes are unique, and can take some getting used to (think of large, crispy potato sticks instead of traditional fries), but are a wonderful counterpoint to the tender steak.Other stars on the menu, which is seasonal for all non-steak choices, are the traffic-stopping Beouf Bourguignon and Braised Shortrib during the colder months. I often get the Trout Amandine, which is amazingly delicate and extremely flavorful, but this last time I ordered the Lemon Salmon... it was the best salmon dish I've had this side of Paris and was beautifully presented. Perfectly seasoned and seared with unbelievably tasty thumbelina carrots and a lightly minted pea purée with both peas and pea pods in it. I thought I died and went to heaven. Also, the Country Pâté is a special treat, but if you are a fan of Escargot, as I am, just get it and ask for extra bread - you'll definitely want to dip it into the garlic butter sauce after! They are simply perfect. It's very hard to go wrong here, even their soups are fabulous - their soup specials are invariably extraordinary and you'll love the presentation. For dessert, they have the usuals like an excellent Chocolate Mousse and Crème Brûlée but get the Crêpes Suzette if available. You will not be disappointed.The only thing I feel are a miss are the Mussels Marinìere. I used to live on the Atlantic coast, and really acquired a taste for small, meaty mussels. What they have here are the big, fleshy ones in a white wine sauce that doesn't work with my palette, but I've seen many others enjoy them.They have a very nice wine list, and even have excellent choices by the glass in their wine cart, unlike many other restaurants. Their house Pinot Noir is a solid choice, but I prefer their Côtes du Rhône when not having my usual. Speaking of which, I've racked up quite a martini body count here. Because their bartender makes them so perfectly, it's hard to limit yourself to 2... even though you should!Final thoughts are to come here for a great experience: delicious, upscale, comforting food and impeccable service. Every server superlatively executes their craft, but Amber and Vincent really shine. They are a Lettuce Entertain You restaurant, so if you become a regular - and you likely will - pony up the $25 for the frequent diner card and sign up for the text promotion program. It is worth it."], ["Aashish J.", "Great food, good service, perfect for date nights! I really liked Mon Ami Gabi.Thumbs up:1. Food: Scallops Gratinees: Superbly delicious! A must appetizer.  Bordelaise Steak Frites: One of the best steaks I have EVER had. Really good. Also tried Chicken Grand-Mere. Usually I don't eat chicken outside of my house because it is so bland. Who eats chicken if you can eat steak, really? But here I did and I have no regrets. Definitely recommend this dish!2. Wine: A great wine selection at moderate price ranges.3. Location: Not close to the train stations which is a bummer but can be reached by bus from downtown. However, walking distance away from the Lincoln Park Zoo. Wonderful for a stroll after dinner.4. Great service!!!Thumbs down:1. Food:      a. French onion soup: Blah...tasted like onions and soysauce. Why anyone eats this dish is a mystery to me :P2. Space: The tables are so small you feel like you are going to knock some glassware down with the oversize menu. No privacy at all :("], ["Craig D.", "(3.75) ~ Good Overall Food & Service.  Located in the Hotel.OUR MENU:DRINKS:* Various Red Wines = (4.25) Very good* Water(tap) = (3) ok...needs to be filtered* Coffee = (3) ok...maybe offer \"French\" PressedFOOD:* Bread & Butter & Asparagus Pesto = (4) very good* Kale, Bacon, Salad w. Poached Egg = (4) very good* Pork Tenderloin Tomahawk = (3.5) good* Chocolate Mousse = (3.5) good"], ["Farman P.", "We just went to this place yesterday. The food was so good you will definitely have no problem finding something worth eating and it's top notch place. They have amazing appetizers and awesome desserts. My only problem with this place is that the service was semi annoying. When I called on the phone to double check to see if my reservations were good, the lady acted like I was wasting her time and she rushed our conversation. The waiter we had didn't even introduce himself which I thought was really odd since that's how all restaurants are. Fortunately this did not ruin our night because the goodness delicious! Wild Boar Ragu was a great dinner choice; the meat would fall all over in your mouth. The appetizer was baked goat cheese with bread and marinara sauce. It's divine! I couldn't stop eating it. Depending on what day you go, double check with what the specials are. For some reason, we weren't told what it was, but there's a board around to show you what they have, but it's not all over their wall so Id recommend just asking the waiter instead.This is the second french restaurant I've been to and one thing I notice is that they love to fill up their space. It looks cramped, but it doesn't feel that way. The interior design has that kind of ambience of how you would want your romantic night to be. So, not everything can be perfect but Mon Ami Gabi will deliver to your standards. They might not be the most welcoming or friendly (like being on your phone at the front desk), but that won't ruin your night whatsoever. I want to stress that this place was still a favorite of mine! I hope it will be for you too."], ["William C.", "Solid restaurant. The same great quality you come to expect from other Lettuce establishments."], ["Jeff S.", "I've been to Mon Ami several times for dinner. This is my first time for brunch.  We sat outside and the patio was very nice. The bloody Mary's was delicious.  The food was fantastic. Highly recommended."], ["Robert B.", "I really would love MAG to be better.  On the plus, the onion soup, if you can afford the calories, is very good.  Positives for the warm bread too.  The frites are great too.  I guess if you stick to steak and frites and onion soup, you can't go too far wrong.  Just don't touch much else.  The nicoise is forgettable as is almost everything else I've had."], ["Marci O.", "First of all, clean the floor, folks! The floor was dirty, sticky, and slippery (and this was before one of the guests dropped a drink on the floor).Our large party had a pre-set menu that included fruit platters sprinkled with chopped mint, tasty salads with dark greens and frisee, crusty bread and butter, and entrees of French toast or quiche or steak frites. Dessert was chocolate mousse. The fruit platters and the salad were good. I didn't have the French toast or quiche so I can't comment on those entrees. Can't comment on the mousse either because I don't like mousse.The steak frites was described as \"family style.\"  The steak was a long, thin piece of meat topped with a large piece of butter that I think contained minced parsley and garlic. It was very good, despite being so thin. The accompanying frites were almost addictive and some of us wondered if the delicious taste came from being fried in duck fat.Staff members were polite, helpful, and accommodating. I liked that the bloody Mary came with a skewer that contained an olive, a small chunk of pate, and cheese. However, the bloody Mary mix was thin and watery. Minus a star for that and minus half a star because of the dirty floor, so 3  1/2 stars that I'll round up to 4."], ["Kat G.", "Had a fantastic dinner here! With a reservation, we were seated very promptly. All of the staff members were very welcoming and attentive.Started off with the onion soup and kale warm bacon salad. Both were excellent. I had the peppercorn steak frites--loved the spice. Husband had the dover sole, which he enjoyed very much. Ended with the profiteroles.Overall, great service and excellent food. Would definitely come back and try more of their offerings!"], ["Haley C.", "I had heard great things about this restaurant so I made reservations here for Sunday brunch. I was extremely disappointed. First of all, they have a huge menu, but they don't offer it during brunch. The brunch menu is really small and there's nothing on it that differentiates it from any other breakfast place in Lincoln Park. The wait staff was pretty stuck up and they forgot to bring us 3 things we asked for. As far as the food, it was fine, but just fine. I had the salmon salad which was a piece of salmon on spinach basically, very underwhelming. My boyfriend had the steak and frites which was oily and the frites were awful. I would not recommend this restaurant. Save your money and pass on this restaurant."], ["Jean L.", "I first came here with a group of 10 and received spectacular service. The steaks are thin, which I don't know if it's a steak-frites kind of thing, but it was definitely different. I got some kind of mushroom sauce on my filet and subbed out my frites for a salad. I left full and satisfied. We also ordered muscles, snails, and french onion soup (which apparently they're known for).As for the second time I came here, I was without a reservation, on a Friday night, at 7pm. The hostess was super nice and said that her 6:30 reservation still hadn't shown up, so if I would bear with her for another 15 minutes, she would see if she could squeeze me in. I waited, and luckily the no-shows never showed! This round was also very good.To be honest, the food, while good, was nothing to-die-for, but I LOVED the cocktails!! They were strong, traditional, and pleasant. Hell, I'd go back for the bar alone."], ["Jialing L.", "Celebrated my 22nd birthday here last summer. The restaurant itself has a great atmosphere and the service is amazing. A couple of my friends were running late but they still seated us and kept bringing us bread as we waited (seriously, we had so much bread. it was so good). My friends ordered the escargot for me to try since I had never had any before and it was an interesting experience. Too garlicky for my taste but it was good. I ordered the bordelaise steak frites for my entree and really enjoyed it. The steak itself was very flavorful and the portion size was huge. The frites were fine but not my favorite type. They also brought me a chocolate cupcake for my birthday and it was delicious. Really glad i chose this place to celebrate my birthday."], ["Nick D.", "Mon Ami is always great.  It's in an interesting building (look up at the ceiling fresco in the lobby).  You can make a great night of it if you head an an event at the zoo and then pop in for some steak frites."], ["Jenny S.", "Great service, atmosphere and most of all, food! Definitely will come back again!I came with a few friends for restaurant week and had a delicious meal and overall, wonderful experience. Our waiter even overheard my love for Julia Child and commented that the iconic gastronome and francophile once visited the restaurant in the 80's and that he had actually served her! He described her as a incredibly pleasant woman (and lush).Then, I definitely geeked out. Holy Moly.I wanted to eat everything, of course, but had to settle on my own, singular meal and just taste the others my friends had ordered.I would reccomend the friseé salad, beef bourguignon,  and chocolate mousse! Trust me! And if you love dry, full bodied red wines, try the Bordeaux Supérieur. Excellent! I should've gotten a bottle.It's a cozy, casual, romantic atmosphere tucked away in a cute boutique hotel. People are seated somewhat close to each other but of the 3 other tables that surrounded ours, everyone was extremely friendly and cordial throughout the night even though there was a degree of bumping eachother between servers and bathroom breaks.Whether its date night, girls night or dinner with the family, this is a very good bet!"], ["Mike S.", "This place got really busy quite quickly on a Sunday night. I would definitely recommend placing a reservation. The seating on the inside was really tight with the tables all really close together which I typically don't mind but it can be awkward for strangers to be a part of your conversation. The food:Fresh loaf of French bread-delicious and warm. French Onion Soup-very good but is a large portion, I would split with another member of your party if possible. Roquefort Steak Frites-delicious steak that was cooked perfectly with blue cheese sauce drizzled on top. Pommes Purée-very good and creamy, however the portion was a bit smaller than I was hoping for. Bananas Foster Crepe-delicious with ice cream in every bite"], ["Lissa S.", "Late review, but my boyfriend and I came here during restaurant week back in February. The food was delicious, the atmosphere cozy and romantic (the \"cozy\" part may have been largely due to the massive snowstorm outside, but I plan to go back sometime this summer, so I'll let you know), and the wait staff very kind and knowledgeable. I have no complaints and certainly plan to return! Great spot for a nice dinner date out."], ["Perry R.", "Sunday Brunch was great. Although the menu selection was limited all the choices were interesting and well priced. Our server Amber was knowledgeable and followed up at appropriate times. French kiss sandwich was tasty and omelettes were full of tasty bits as promised on the menu. While the red wine bottles sat outside for single pours they were chilled to ensure they did not pick up the heat of the day. Only minor complaint was that the frites were warm- not hot - probably sitting too long under the warming lights."], ["Greggory H.", "The food here is absolutely fantastic! Sure its a chain of sorts, but the steak and steamed mussels are to die for! The classic French bread served with the meal is something special. I have even visited just for the bread to bring it home (since I live in the building that the restaurant is located within) for my own home cooked meals."], ["Mark C.", "Absolutely amazing food, and service was spectacular. Fantastic wine selection and perfect ambiance"], ["Michael B.", "I've eaten at the one in Oakbrook before which was a little too suburban shopping mall, concept-ish for me.  I'm generally not a big fan of these theme or concept restaurants owned and managed by large restaurant groups and they can often prioritize being businesses first and restaurants after that, versus establishments that truly take pride in their food, food sources, service and customer experiences.  Not always, but enough that's I'm cautious. That said, I was there as a guest for a birthday party in a private room with limited menu choices.  What I ordered, mushroom soup, salmon, root vegetables were all pretty good.  I know the French like to slather everything in butter and add lots of salt, which helps but not really my thing, but, hot and tasty it was.Service was professional. Good buzz, looked like a local and Sat night date crowd mix.It's not in or on the top of my rotation, but for those living in the neighborhood, it seems like a nice place to have in the hood."], ["James Z.", "I normally enjoy Mon Ami Gabi, but the service on Sunday 6 September was uncustomarily unacceptable. We had a reservation -- it was an anniversary -- and a decent table was not to be had. We were begrudingly seated at a small table by a very loud (bar-crowd-like) party, then re-seated at a table that would barely hold a sandwich, let alone two plates. We were told by the manager Whitney that everything else was booked. And yet the good tables were empty. The refusal even to attempt to accommodate us set the wrong tone, and even then, it would have been nice if Whitney came around to check on us, The food: It was not a stellar night either. Why anyone would serve pate with iron-hard bread escapes me. Some of the usual staff do not seem to be there, and I hope management will remedy the situation for its remaining customers. You might get away with this kind of service in Lincoln Square or Andersonville, where new places start up, but not at a place that had been solid."], ["Liz K.", "To be honest, I was disappointed with my recent experience during Restaurant Week, mostly due to the service perspective and less due to the food aspect.Two of my girlfriends and I met at Mon Ami Gabi for a dinner reservation this past week at 7:00. We ended up waiting past our reservation time because the hostess offered us a better round table by a window, if we were willing to wait (which we did). It was nice to be at a table that was off of the beaten path of the restaurant, but my complaint about the table itself is that it was round and the white paper on top was square and was jutting out. It was an annoyance for the entire meal, even after I adjusted my seat. Our waiter just seemed rushed and disinterested in our table the whole night. When we weren't ready to order the first time he came by, at least 15 minutes passed before he came by to check on us again. I asked for a small substitution with my salad, just balsamic vinegar and oil dressing instead of the dressing from the menu. When our food came, the salad wasn't dressed and there was no balsamic vinegar and oil. It was a runner who brought the food and our waiter didn't check back for another 5 minutes after we had already started. Although we stayed for over two hours, the waiter never once spent more than 30 seconds at our table explaining the menu, asking us how our dishes were, or otherwise checking in on us. I was very disappointed considering the good impression I had of Mon Ami Gabi before this experience...but since my friends' dishes looked good (and I didn't have anything but a salad), I may be back at another time to try it again."], ["Mike D.", "Went here with my friend on a Wednesday around 8:30. I figured we could walk in and get a table for 2 no problem, but that was not the case.  The restaurant was busy and slightly smaller than I imagined. We were given a 45 minute wait, so we grabbed 2 of the six seats at the bar.The bartender was super cool. I tried the gringolandia beer, a Latin-Chicago fusion beer that I hadn't seen anywhere else. After about 30-35 minutes we were seated.  We tried the butternut squash soup but ended up splitting the onion soup instead, which was a bad decision. The butternut squash was wayyy better. And the french bread they provide is perfect for dipping in the squash soup.We ordered a bottle of dark red wine from the south of France, which went really well with the filet mignon. I was extremely happy with my entreé selection: The filet mignon grilled medium rare, with a side of sauteéd mushrooms subbed for the fries. (Tip: most restaurants will allow you to sub a side for the 'steak frites' or whatever they have, which is basically just a fancy way of saying steak and fries).   Also important to note was that I chose the merlot butter option, not the other filet option. My buddy got the regular and when he tried mine he knew he had muffed that one.All in all, a good place for a semi-special occasion or just for your average bro-date!"], ["Rebekah L.", "Overpriced and insane delivery fees for piss-poor portion sizes and cold food. They gave us a \"free\" stale baguette, which sucked. I was so disappointed with my delivery order I won't be bothering to go in-person."], ["Linz M.", "Easily one of my favorite restaurants in Chicago. It is a go-to! The food is always delicious. Personal favorites include Caesar salad, French onion soup, steak frites bordelaise and the salmon. For dessert you must order their portfolios-so decedent and delicious-it is big enough to share!"], ["Alexandra H.", "I haven't been to Mon Ami Gabi since I was 16 with my parents. I live down the road now, and my husband and I have been wanting to try it again. I was very happy with the results. The mussels were delicious. Definitely dunk the baguette in the liquid- the best part. Steak Bordelaise is one of my favorites, they cooked it to perfection. Often when I order medium-rare, it will be too rare for me, but this was just right.  Husband got Steak Bearnaise, he loved it although I did not try it (rare for me, but I enjoyed my own so much that I just didn't have any desire to steal off of his plate!). Drank a bottle of Bordeaux, paired nicely with our steaks :)We ordered the Banana Foster Crepe for dessert. I'm still dreaming about it. Our waiter was great. The one draw back was that when he came around the first time we weren't ready, and then it took him a bit to get back to us again. But honestly not an issue, we just had a late reservation so we were starving! Definitely will go back again when craving steak frites!"], ["Stephanie S.", "Hosted my best friend's bridal shower. Super cute inside but... Working in the FOH at a French restaurant myself back home, I was a little disappointed. I ordered a Kir Royal and they had some form of blackberry liquer but not Creme de Cassis. I had the Croque Monsieur which was just okay. The back room was freeeeeeezing. The main server was delightful (I didn't catch his name), though."], ["Alice D.", "I enjoyed this place, though I had chicken, at the suggestion of my sister-in-law, instead of steak; my wife did too, a different kind of chicken, a breast flattened and seasoned. My brother-in-law, who visits often, ordered everything except the entree, so life was good. The burgundy was excellent. Appetizers included crab cakes, flattened and exquisitely seasoned, salmon tartare and avocado served as if ceviche, and scallops in melted cheese in a scalloped serving dish. All wonderful. The manager and waiter were full of stories that they shared; John, the waiter, a singer, has a small cake and pastry business called Vincent Van Dough, specializing in a 6-layer Pride cake, and if the cookies he served us with other desserts is any indication, he must be doing gangbusters. It was a great meal. I'll be back to try the steak-frites."], ["Liz H.", "My boyfriend and I came here for dinner on Wednesday night, we were promptly seated at a table for four even though we were only a party of two to allow us a little more space. A baguette and an amuse bouche were brought out after being seated, both were delicious and on the house. John was our server and he was amazing, he allowed us the perfect amount of time to look over the menu and was attentive without being overbearing. We order the mussels to start, they were fantastic - I highly recommend. For our main, we split the seafood platter and for $50, it was well worth the money. We both also had dessert, I the lemon creme brûlée and my boyfriend, the chocolate soup - a whimsical take on a very simple after dinner treat. All in all the entire experience was a wonderful one and we will definitely be retuning."], ["Nathan S.", "I didn't have dinner, but I came but I came for desert. And I have to say it was amazing, I tried the Chocolate moose and Peach Melba, so good and they made sure it was gluten free. Also the server I had was funny, nice and helpful, made it a way better experience. And because it was nice out I dinned out side and the outside patio was amazing great summer dinning."], ["Alexander J.", "As a next door neighbor, I have dined at Mon Ami Gabi and it's predecessor for decades.  However, service on last 2 visits was substantially worse than past experience.  On one visit, despite a reservation, we were kept waiting for over an hour.  The host in this instance did offer apologies and comped both wine and dessert, which was appreciated and appropriate.  The next visit we experienced poor service again, this time with both waitstaff and long delay (1 hour) for our main course.  The host apologized and promised to follow up, but has not done so."], ["S T.", "Terrific French food like a genuine Parisian bistro. Classic steak frites was just right, as was the version au poivre. Steamed artichoke with a Dijon lemon sauce was outstanding. Crime brûlée also excellent. We sat it in the outdoor courtyard on a cool summer evening, walked the gardens afterwards. Service was attentive and not intrusive. Worth every penny."], ["Barb R.", "Went to Chicago a month a go with a friend.  She loves doing foodie things and let me handle our dinner plans for our 4 night stay.I LOVE French cuisine.  When I stumbled upon Mon Ami Gabi and Chez Moi...I was torn.  I decided to go with Mon Ami Gabi.We arrived about 15 mins early for our reservation and was told it was going to be about a 30 minute wait.  That was fine - it was a Saturday night and the place was fairly packed.  We sat up at the bar and ordered glasses of Beaujolais Villages. We were seated about 30 mins later.Our server was Ryan and he was FABULOUS!! We didn't feel rushed or neglected.He brought us a warm petite baguette with this pickled carrot slaw.  We didn't want to fill up on bread so started to look at the menu.We started with the warm brie accompanied by black pepper honey, hazelnut and croutons.  The brie was creamy and mild and the honey and hazelnut balanced the dish out very nicely.We ordered and split a frisée, kale warm bacon salad and it was heaven!  Wasn't drenched in dressing, right amount of everything and we both had a poached egg on top.For dinner, I had the chicken grandmere with a side of whipped cauliflower.The chicken was SO moist and tender and bursting with flavor.  My friend thought I was being inappropriate with my food with all the noises that I was making...LOL ( she was teasing of course)She had the caramelized sea scallops.  There were 5 huge nice and sweet tender scallops on her plate.  It was SO good. (she shared)We finished our meal off with a bowl of pear sorbet which was very refreshing.If you love French cuisine, you'll love this place...however...if you're in a hurry this is not the place for you.  This is a place to actually enjoy your meal and life!Bon Appéit!"], ["Melanie S.", "Every time I come back to Mon Ami Gabi, I enjoy it more and more.Last night was the restaurant's 15th anniversary, and as part of the celebration, they were offering LEYE Frequent Diner cardholders triple points and free gift cards just for having dinner there. I'm a total points whore, so I can never pass up an offer like this.Other than a few missteps from our server (he just seemed a bit out of it), it was a near-perfect evening; from starting out with a flawless French 75 (who doesn't love a cocktail named after a firearm?), to ending with one of the best desserts known to mankind.Our appetizers were a half-dozen fresh oysters from Prince Edward Island, served with mignonette, cocktail sauce, and fresh horseradish. We find cocktail sauce a great accompaniment to shrimp, but way too sweet for oysters, so we asked for some hot sauce (when we placed the order). The oysters came without the hot sauce and the horseradish so we had to remind our server, and he brought them out quickly. One of the oysters was \"funky,\" and no one wants to end up sick over a questionable oyster, so that one was left uneaten. We also enjoyed the soup du jour, which was a chilled asparagus soup. I've never had a cold asparagus soup before, and it was absolutely delicious. It was the embodiment of summer in a bowl.Our mains were steak frites, served with bernaise sauce, and the trout almandine (with the almonds on the side). Again, these were near-perfect. The trout was flaky and delicate, and had a light brown-butter sauce and some haricots verts. I'm not a huge fish lover and I gobbled this up. The steak was cooked perfectly, and it was marbled, so it had tons of flavor; the naughty bernaise sauce only added to it. I'm not a huge fan of their frites; they're too thin and crispy, almost shard-like. I prefer matchstick fries over these.Desserts are another area in which MAG excels. Years ago, they used to have a dessert I so loved called strawberries Briand, which was fresh strawberries in Grand Marnier, and sour cream sorbet, sprinkled with some brown sugar. Then they took it off the menu and I cried, so when I spied it back on the menu last night, I was overjoyed. It was even better than I remembered. Strawberries (from nearby Green City Market) in a pool of luscious juice, nicely offset by a tart, refreshing sorbet. And of course I can't not get profiteroles, and they allow you to just get one, instead of the three that typically come in an order.Prices are surprisingly reasonable as well. My trout was $17.95; I've paid more than that for fish at Dunlay's (which is a neighborhood place), and the steak wasn't priced much more than that.I also adore their patio, which overlooks beautiful Lincoln Park. On a summer evening, it doesn't get much better than sipping a cocktail or glass of wine, eating a delicious dinner, and watching people and dogs strolling by.This isn't quite a five-star review, but it's much closer to five than four. I just love this place; it never disappoints."], ["Lauren M.", "Went here for a birthday dinner last night.  If you're looking for a celebration dinner that's not too stuffy, you should go here.Escargot was good, although I don't have much to compare it to.Bread and butter tasted actually French.I had soup, husband had salad -- both were good but not outstanding.Entrees were excellent.  I had the \"Chicken Grandmere\" -- really really delish.  Better than just any old chicken.  Hubby had the steak/frites with Dijon -- delightful.I'd go here again, but if I were looking for French steak/frites, I might be more likely to choose Bavette's (yelp.com/biz/bavettes-ba…)"]], "Le Bouchon": [["Jeff H.", "We recently ate at LeBouchon in Bucktown and loved it.  The atmosphere is wonderful...not too loud and with a lovely, low key bistro flair.We ordered the roasted duck for two with sauce bigarade.  It was by far the best duck either of us had ever had and the sauce was very rich, but not over bearing.  It came with farro and cider turnips  which were a nice contrast to the duck....ahh..!We also had the creme brulee.  I often make cb and it was very good and a nice cap to a wonderful meal.  Next time in Chicago, we're heading back."], ["Gregory S.", "My wife and I came here in February.  Phenomenal restaurant.  We got the mussels as an appetizer and the Cote de Boeuf for 2 as an entree, coupled with sides of pomme frites and green beans.  The beef was cooked perfectly, sauce was delicious.  The service was great, and our waitress was extremely knowledgeable about the wine selection and paired it perfectly with our food.  Can't wait to come back!"], ["Mina I.", "Food:The appetizers that we ordered were classic French bistro fare, moules marinieres (mussels in white wine with herbs) and escargots. For someone who had been craving simple French food, it was heaven. Plenty of fresh bread came alongside to sop up all the delicious sauces. The main courses that we had, though tasty, paled in comparison to the simple dishes that preceded them. I had a braised duck leg that was good, but it was served with too much sauce,and I thought that the presentation could have been better. My companion had rabbit, and pretty much had the same reaction. Over all, the main courses were well prepared, as well as a pleasant diversion from the ordinary (when was the last time you had rabbit?). The appetizers were spot on, we could have been in Paris.Drink:An ample wine list for a small neighborhood restaurant. The focus was most definitely French, as it should be, and both the glasses of white and red were great. You paid the premium for the French imports, but it definitely enhanced the overall experience.Service:There were only 2 waiters, and at least 15 tables, maybe more. That being said, they did a great job making sure we were taken care of. We had a reservation for 7:30, and were really hungry, so we showed up at 7 and wereseated immediately. As the night went on though, the place was definitely packed. It wasn't the sort place that you'd expected to be waited on hand and foot, and in turn, it wasn't. The tables are packed in pretty close together in asmall space, and you have to embrace the bistro atmosphere.Scene- If you want to be whisked away to a small bistro in (almost) Paris, than this is the place for you. The food is good, the service is ok, and the scene is cozy. Probably a great place for a third date where you want talk, drink and get to know one another. This is the sort of place, just outside of the hubbub of Wicker Park, to start the evening, but it won't be enough to make an entire evening.Dress:Casual, jeans with a nice shirt, a jacket would be fine.Occasion:Craving French bistro food and atmosphere?  This is the place for you. Start the evening here, and move on to more engaging venue south in Wicker Park.Cost:Appetizers $10, Entrees under $20. Reasonably priced wine list."], ["Emily S.", "On a cold, rainy Friday, we managed to tear ourselves away from the Boston bomber standoff coverage and make our way over to our favorite cozy French bistro for some food, sans reservation.This turned out to be a great choice.  I know, it seems like the opposite of a good choice to walk into a tiny restaurant at 8 p.m. on a Friday without a reservation, but hear me out.  The guy at the door said he was about to seat a group of 6 girls who were taking up 3/4 of the seats at the bar, and if we were OK with eating at the bar, give him 2 minutes to set the table.Well, it turns out that on Fridays, Le Bouchon has $1 oysters at the bar only.  We ordered up a dozen, which were really fresh, briny and ENORMOUS.  We then shared escargot (my favorite) and I had a Lyonnaise salad while my husband had the monster French onion soup with about a pound of cheese on top (no one complained).  Properly topped off with a bottle of Cote du Rhone, we toasted to the bomber's eventual capture with our bartender and fellow oyster eaters.You'll find us at the bar on Fridays in months that contain an \"R.\""], ["Patufla P.", "Delicious, consistent and authentically prepared French food and atmosphere. We love going to Le Bouchon and to the the sister restaurant, Le Sardine. Both places have great, but different atmosphere. If you are with a bigger group, go to Le Sardine and if you are on a date, or with good friends, go to Le Bouchon. Oh, do not forget to make reservations, since it is very difficult to get in otherwise."], ["Seth W.", "I went here for the first time a week ago on a date. This certainly was a charming date place with a great atmosphere. The tables are close together, as in a typical French bistro, but not so close that I felt uncomfortable. Our waiter was extremely friendly, attentive, and knowledgeable. The manager/owner checked on us and talked to us a couple of times, and made us feel welcome. The place has a very casual, inviting, accessible feel to it--no need to feel intimidated if you're not knowledgeable about French food.The food is the reason I'm giving Le Bouchon four starts instead of five. We split a French Onion soup as our appetizer, which was delicious, and then ordered a very expensive 32 oz steak special along with a glass of red wine. The steak was good and the wine went well with it, but the steak was a bit undercooked and I didn't feel it was anything special. It came with a couple of sides--cooked vegetables and fried potatoes--both of which were good, but not great. Le Bouchon is a cute, unique place with a great atmosphere and friendly staff, but the food just didn't blow me away."], ["Jody B.", "We had a wonderful evening! We took my BIL here for his birthday (his pick). Hubby and I had never been... but Sis and BIL have loved this place ever since Sis went for her b-day.It was so convenient. As we drove up, we parked and the valet was johnny-on-the-spot. We walked in and were seated right away for our reservation. We had an attentive, yet not overbearing waitress. After drinks, we picked the escargot for a shared app. Hubby won't eat them, but the other three of us gulped them up. The best part was soaking up the garlic butter with their WONDERFUL bread. Mmmm-mmmm.Three if us had the salad Lyonnaise and one had the goat cheese salad. Both were top notch. The egg was prepared perfectly to melt into the salad and provide a tasty addition to the dressing and lardons.BIL had the bouillabaisse, Hubby had a steak frites, and Sis and I had salmon. All 4 of us raved about our entrees. The salmon was tender and not overcooked. It had a very refreshing sauce with tomato and cucumber. Sis and I have the prix fixe menu: salad, salmon, and dessert all for less than $30!!! So I ordered the apple tart, and she had the chocolate ganache.  BIL got a lemon tart (with a candle!) and Hubby got berries with a vanilla sauce. Everyone seemed satisfied. I thought my tart was good, not great.So... wonderful food, impeccable service, convenient valet. The only reason it is not 5 stars (I would have given 4.5 if I could) is the dessert was just good, and the noise level was very loud. They even play some loud music. I think if they played something quieter, we could have heard ourselves talk.But that won't stop me from going back!"], ["Brandon F.", "Fantastic.  Wonderful first time dining there.  The food was by far the best French I have had in Chicago.  It was quite busy and service was a little slow, our waiter gave us free drinks to compensate; classy move. The only thing I can knock them for is that the two top tables are so squished together, you literally have to pull out the table so the person against the wall can get out.  Give it a try, I loved it."], ["RJ W.", "Great food, intimate atmosphere. The only reason I am giving it 4 vs. 5 stars is the staff seemed to huddle around the bar gossiping as opposed to being on point.  As dinner was over $200, I expect more intuitive service vs. having to ask for it."], ["Katrina S.", "French Onion Soup!It is the BEST I've ever had. Ever. E.V.E.R. I think about it often. I'm thinking about it now.I took one of my best friends who lives in Spain. She often spends time in France and said it is better than any french onion soup she has ever had in France or anywhere else.I just treasure Le Bouchon. They have it down pat ,don't change and are expert at what they do. This is why they've been around so long. Dear Le Bouchon: Please don't ever leave. Summary: Do yourself a favor and try Le Bouchon. Order the French onion soup and a glass of red. Thank me later..."], ["Abby T.", "I really liked Le Bouchon!  Such a cute place that you really feel like you are at a restaurant in France....it steers clear of that over-managed Chicago restaurant feel, which is nice to get away from every now and then.  It was so small, however, that we felt quite in the way whilst waiting for our table. Small price to pay.  Don't come starving and enjoy a drink at the bar while scooching over here and there for a server.The best thing to order in my opinion is the prix fixe which is any appetizer, entree and dessert.   The mussels were very good.  The salad left something to be longed for. Good wine and beer selection -- they have a nice international selection that you don't see everyday."], ["Allison C.", "Blandblandblandblandblandblandblandblandbland.Overpriced.  'Nuff said."], ["Richard R.", "I have been eating at Le Bouchon -- mostly for dinner -- for over a decade and it remains one of me and my wife's favorite restaurants anywhere. The food's quality and preparation is excellent and the value of the wine selection, which includes aged second, third and forth growth Bordeauxs for prices that are less for what you could  buy them retail, is the best I've seen. Most the waitstaff has been there for years and exude the professionalism fitting of a traditional French restaurant. I would highly recommend Le Bouchon to anyone who likes french food."], ["Olivia M.", "I took my boyfriend here for his birthday and, well, meh.The place is incredibly small and somewhere I would avoid in the winter because if you get placed near the door you're going to freeze the entire time.The food is okay, and nothing spectacular. I've had better and cheaper home-cooked meals and have been to places with a similar menu and better prices. I will admit that I really enjoyed the fries though.Anyhow, the service was decent. Our waitress told us about the specials, made sure our water was refilled, but asked if I wanted a cocktail/glass of wine at least 3-4x throughout the 1.5 hours I was there. I said no each time, and became increasingly annoyed. I don't drink because it makes me sick, and I felt as though I was continually being put on the spot and encouraged to drink when I don't care to."], ["Ermelinda C.", "We gave this place a try a few weekends ago and it was A-OK. The food itself was very tasty and we enjoyed it, but the place was very small, and the service was OK leaning on the rude side. I went with the fixed option and it was a great option to try an appetizer (the frog legs), the steak and fries entree I had wanted to try since we dined at Mom Ami Gabi a while back, and a dessert (the cremebrulee, which was really good). My husband went with the regular menu and he was satisfied with his choices as well. Worth a try, but I probably will not go back here."], ["Anna B.", "I don't know how I missed writing about this place.  I dined here in September of 2011 with a pair of my girlfriends.  One of them recommended this place, and it did not disappoint. Sadly, it has been way to long for me to remember the names of my actual entrees.  I ordered everything off the daily special menu.  I think I had a lobster bisque which was illegally good and a stingray type fish as my main.  Delicious! They also have very tasty cocktails :)  The service was incredible.  We added a girl last minute and they kindly moved us to a larger table."], ["Glo K.", "I came here with two friends (Katrina Epperson and Sam Juna... shout out. lol) for a birthday celebration. We didn't plan on coming here but we somehow ended up here because it was the first restaurant we saw on a rainy day. I believe it's the \"1/2 off bottle of wine\" advertisement at the entrance that got us. I thought the interior was great! I felt as if I just stepped into a mini France! It was quaint and wonderful. The tables were small and limited so there was a wait for a table. Le Bouchon seems like a place where people don't just quickly eat and go. I think the intimate, cozy atmosphere encourages their customers to relax, dine and enjoy a fabulous evening out. My friends and I waited at the bar and was greeted by the bartender. We popped a bottle of exquisite wine to start off the birthday evening. We waited for awhile and the bartender encouraged us to dine at the bar because the tables weren't moving. My friends and I were getting hungry so we did and it was actually nice to receive such quick service at the bar. Also the bartender was very polite to make my friend's birthday evening special with a birthday drink and free goodies. I ordered the rabbit for the first time (Lapin Sauté Chasseur  $19.50). I've never had a rabbit but the guy who sat next to me at the bar recommended it and told me tasted like chicken. It did. The rabbit was sauteed in a white wine sauce with vegetables. It was actually delicious but the meat was a little too chewy. My friend Sam had a lovely salad and mussels. I had a chance to try the mussels and I thought it had a nice flavor to it. The birthday girl had the free-range chicken which was great too. The entrees on the menu seem to be generally on the heavy side which is expected in many French cuisine but the food was very comforting, and every bite was satisfying. Overall, I think my friends and I enjoyed our time at Le Bouchon and hope to come to experience the intimate atmosphere, laid back staff, and the comforting food in the near future."], ["Josh K.", "I went with my ladyfriend on a normal weeknight and we pretty much had the place to ourselves. We asked a lot of questions, but our waiter had a good attitude and even taught us pronunciations. It was refreshing to experience good service in a French restaurant without the snobbiness, so that's a big plus for me.We began with a couple cocktails, whatever mine was tasted good and was not light on the good stuff. The onion tart good, but not spectacular, the dough needed to be flakier. I had the bouillabaise and was extremely pleased. The broth was luxurious and rich and full of flavors like saffron and tomato and seafood. The fish were also cooked beautifully. My ladyfriend had a special, a blackened walleye if memory serves, it was so good it turned her from pretty much a vegan to a seafood is always a good thing. And I know it's lame and stale, but I can't get enough creme brulee and they delivered, the sugar was beautifully bruleed and the creme a perfect texture.The price is steep, but it is a nice treat."], ["Jonathan L.", "French fusion.  It's good.  For the price, it's actually quite the value.  Recommended."], ["Donna C.", "I would love to say I have eaten here but can't because the hostess was so rude and pretentious that we left and went to bistro Campagne where we were welcomed with open arms and had an amazing dinner."]], "Brindille": [["Tracy F.", "My husband and I went to Brindille for our anniversary/New Year's Eve.  We love Naha and had heard great things about Brindille.  First, yes, the restaurant is absolutely overpriced.  Our bill was $280 for the two of us.  We had 4 glasses of wine, 2 apps, 2 entrees and 1 dessert.  That being said, it was one of the nicest experiences I've ever had.  The server was knowledgeable about all the dishes/ingredients & drinks.  He didn't shy away from recommendations and stopped by the appropriate amount to check on us.  The maitre d' was also very friendly, as was the bus staff.The food:Appetizers:Fois Gras: Large portion compared to other restaurants.  Deliciously prepared with a nice onion relishCream of Onion Soup:  Granted, I switched out the roquefort for parmesan, so I'm not sure what affect that had on the original taste.  It was just a bit bland (but still relatively good).  My biggest issue is that I like my soup hot and this soup was served warm.  This dish kept the restaurant from having a 5-star rating.Entrees:Lobster Brindille: This is the best lobster dish I've ever had.  By far.  The entire lobster is removed from the shell, making it a hearty portion.  The flavors of the dish were wonderful.  I would definitely recommend this dish.Dover Sole:  I didn't taste this, but my husband said it was one of the top two fish dishes he's ever had (tied with Roy's butterfish) and definitely the best Dover sole.Dessert:We had an almond pastry.  The way it was described by both the waiter and on the menu, we thought it would be a cream filled pastry, almost like an almond croissant.  Unfortunately the pastry was without any moisture, so it was super dry.  It was served with a scoop of ice cream, but it didn't help the pastry by itself.Overall, it was a fantastic meal.  We would love to go here again, but will probably stick to Naha simply because the food is just as good but the bill is about $75 cheaper."], ["Apu B.", "Experienced exceptional, attentive, personable service by Jeremy and Sergio who made every effort to accommodate our every whim with a smile and a sense of humor. Each dish was a culinary adventure that tested our taste buds and always pleased our palates. Cocktails, wine and drinks were fabulous. Desserts were varied and well-made but we wished they were sweeter (this seems to be an unfortunate trend in dining establishments across the city which cannot run its course soon enough!) We had the best seats in the house to appreciate the subdued yet elegant atmosphere, but no need to worry this was not a stuffy establishment. Great for any occasion as long as you embrace  creative culinary experiences."], ["Kenneth C.", "Since it was our wedding anniversary, to celebrate we tried their tasting menu. It consisted of one appetizer, 4 small entries and desert selected by the chef after considering our preferences and any allergies.  The food was outstanding!  Each course was introduced by the wait staff.  First we had the hand cut noodles with snails.  We then had the four entries, Lobster Brindille, Dover Sole, Grilled Lamb and Roasted Quail.  Each were wonderfully presented, tasty with wonderful herbs and seasoning. For desert we had the Tarte and the Clafoulis.  Although both deserts were good, we would have preferred to try the Chocolate Entermet, Fantaisie au Chocolat or the Crème Brulee that we saw other patrons order. I highly recommend this restaurant."], ["alexis K.", "This place is overpriced, the food is terrible , the service is unfriendly and they have now idea how to treat a customer that pays $49 on an entree. Don't go here. It's another one of those rip off places. Bad, bad, badThis place is overpriced, the food is terrible, the service is unfriendly and they have now idea how to treat a customer that pays $49 on an entree. Don't go here. It's another one of those rip off places. Bad, bad, badSo as we wanted to leave the restaurant the manager came over to us to tell that he saw our Yelp review, which we posted after receiving our check. He complained that we didn't give them a chance to make it better.  Sorry but was too late. And now here is the best. The flamboyant manager started arguing with us and calling me the boy friend of my wife of 10 years.  He started insulting me, that I had a t-shirt on, instead of apologizing for the bad food. We go to restaurants nearly weekly and have never experienced anything like that. So if you want to spend a lot of money on bad food and bad service and get insulted at the same time, this is the place to go."], ["Anne M.", "Generally when I spend this much money on dinner and drinks, I tend to think, \"Wow, that was really worth the coin\".  Brindelle was good, no doubt, but I'm not sure it was really worth the price.  The small plates/appetizers (particularly the carpaccio, foie) and the cocktails are a different story; delicious, rich, high quality and very inventive.  A pretty room; really striking light fixtures.  I felt our of place in jeans, so be forewarned."], ["Jackie G.", "As huge fans of Naha, we were anxious to try Brindille and it certainly did not disappoint. We were very impressed to say the least.  We ordered the tasting menu and loved each and every bite. Food was fresh and beautifully presented. Service was excellent and  ambiance serene.  We shall look forward to returning withmore friends."], ["Janet S.", "After looking forward to the Nahabedian's new restaurant, we were both thrilled with the food but, disappointed in the service.The starters, oysters in a marvelous eggy sauce with osetra caviar and the asparagus, were excellent.  I coul have eaten a dozen of the oysters.The main courses, French turbot and duck with fois gras, were outstanding in presentation, flavor and complexity.Our waiter was kind and tried to be informative.  But, he is definitely in need of some help with his communication skills.  Five minutes of superlatives does not neccesarily describe an entree, starter or dessert.  He proved to be more of a distraction than a help.Also, clearly no one was paying attention to our dining pace.  After waiting for some time for the starter, the entree then arrived within 2 minutes of us finishing the first course.  No time to rest, enjoy a glass of wine, etc.  Not what I am used to in a restaurant of this class.We'll wait awhile to return as we have confidence that the food will still be top-tier and the service will have improved.  Perhaps that is why the restaurant was only half full on a beautiful Friday night in Chicago!"], ["Eric W.", "Outstanding food; exceptional service. A real education in dining. A quiet find, but one of the city's best."], ["Desiree N.", "Definitely a must try here in Chicago and one of my favorite meals I've had in the city.  My friend and I had been looking to dine and were lucky enough to get a reservation. The decor was beautiful, service was never intrusive and very professional, but the food...wow. I started with the crab. So beautiful and the flavors were exquisite. I then had the lobster Brindelle...this dish is a MUST try...My friend had the sweet breads and the duck...he also raved about his meal. The wine list has something for everyone. I plan on returning and trying the tasting menu next time. Congrats, on opening yet another rave worthy restaurant here in Chicago."], ["Eric M.", "As a huge fan of Naha - it's my favorite restaurant in Chicago -  I am very excited that Carrie and Michael have opened a new concept and I was eager to check it out. My dining companion and I ate dinner early (6pm reservation) on a Sunday night.  I'll start by saying the service was very good - I have no complaints about that.  It was unrushed, very informative when asked to be, and very pleasant.  It seems to me that with Brindille, Carrie may be aiming for 2-Michelin-star status, and I think the service component of that is on the right track.  I think there's a little room for polish, but for the short length of time they've been open they're clearly doing the right things when it comes to service and I have no complaints at all about that.We started with the frog legs for him and for me the broccoli soup.  I loved the soup - I think the soups at Naha are awesome and I\"m glad to see that skillset made it here, too.  The frog legs were nicely pan-fried.  They came with a blanc-manger, which I guess they should be dipped in, because the legs themselves were only very lightly seasoned.For the main course, we had the monkfish tail and the guinea fowl.  My dining companion ate the monkfish tail and it was quite substantial, with a lot of good, meaty fish on the bones, and a lot of flavor with the vegetables that came with it.  I had the guinea fowl based on the waiter's recommendation and, to be honest, it was quite disappointing.  My biggest complaint was that it was on the cool side of room temperature.  It wasn't exactly cold, and it didn't really help that the A/C system was blowing cool air directly from the ceiling onto our table, but it wasn't what I'd consider to be an ideal eating temperature.  It also seemed like a bunch of unrelated items on a plate instead of a cohesive dish.  The monkfish had a lot of things, too, but they all interacted well together - that wasn't the case with the guinea fowl.  The cockcombs didn't seem to add anything.  The morels were overpowered by the cooking liquid and quite acidic and just sopping, squishy things - not the more firm, mushroomy ones I enjoy.  I would not order the guinea fowl again - for this level of dining it was, in my opinion, a disasterous dish.  I know they can do better, and I'm confident they will, but this dish, as served to me, was a terrible showing.Finally, for dessert we had the Paris-Brest of strawberries, and the roasted pineapple.  The strawberries were very nice - we both enjoyed those.  The pineapple was ok, although I guess I expected it to be roasted further than it was.  There weren't any of the complex caramel flavors I would expect seeing \"roasted\" in a description of a fruit dessert.  It was nice, it just didn't live up to what I would consider its full potential.  But, for all I know, that was the goal with the dish, to be lightly roasted and still have some of those fresh, brighter flavors pineapple brings to the table.All in all, I will almost certainly be back after a few months to see how things are progressing.  The guinea fowl was a real disappointment, there were a couple other things I think will improve with time, but overall I was satisfied with the meal.  My dining companion was not an experienced fine dining gourmand, and is always complaining he doesn't understand why people pay so much for fancy food.  But he managed to enjoy himself, which I think speaks to the fine service we received and that most of the dishes were well-executed."], ["Diana Z.", "Amazing meal in a beautiful space.  We started our evening with cocktails at their comfortable bar.  The gentleman behind the bar was friendly, knowledgeable, and helped my husband select the perfect aperitif (or two).Our dinner was outstanding, and the standout dishes were the steak tar tare, lobster entree and lamb entree.My only criticism, if you can even call it that, is that the waiter could have offered a bit more explanation of the dishes when our plates were served.  This was certainly one of the more expensive meals we've had in Chicago, but it's well worth the splurge for a special occasion.  My husband and I will be back :)"], ["Katherine H.", "So good! Polished romantic, great service. You must try the lobster brindille!"], ["Nancy C.", "This is a 4.5 star review.  The experience was very near perfect. The space is lovely. Understated, grays, browns, blacks.  Very large window up front, comfy booths and chairs.  Lavender sweaters on the staff. The service was so spot on.  Witty, charming, knowledgeable and efficient. Rob was a star!  The appetizers were excellent. The hand cut noodles, chanterelles and snails for me---a heavenly dream appetizer!  For him: the scallops.  Also superb, much lighter and beautifully executed with the unique addition of uni.  Mains: Lobster for me, duck for him.  Here is where a minor slip occurred. The food was very very good. The lobster was plentiful and accompanied by truly amazing flavors. The duck and foie gras were beautifully cooked (absolutely perfect char on the foie).  The slip was that both plates (meaning china) and the food were not hot.  In fact, they were below lukewarm.  Can't figure out what happened.  The place was not busy. Our waiter seemed very efficient.  The food just wasn't the right temperature.  So, a little point shaving for that.  The second issue was two gnats that were hovering around the table (made more noticeable by the impeccable white table cloth-love the beautiful gray napkins, by the way).  Gnats in a restaurant, especially one of this caliber, are troubling to me.  Had to keep shooing them from my wine glass.  Wine?? Ah, yes, wine.  Back to the positives.  The wines, while expensive are really well thought out and quite good. And the staff is very very good at recommendations and their are some unique finds on both the bottle and by the glass lists. The pairings were perfect. Whites for me, white and red for him.  Terrific choices by Rob.  Champagne by the glass a bit pricey.  OK, dessert.  Dessert is something I sometimes enjoy and other times can pass on.  I am SO glad we didn't pass.  The Warm Baked Cherry & Almond Clafoutis IS NOT TO BE MISSED!  It is light, airy, deliciousness.  If the plate hadn't been so hot (funny, I know) we would have licked it.  Truly amazing! I will be back here.  Next time I really want to have the Dover Sole Meunière, one of my favorite dishes.  And TWO of the Clafoutis!!!!"], ["Joanna K.", "Really a 3.5. Went to Brindille; admittedly high expectations given the great food and service at Naha! Had a drink at the bar while waiting for my friends -- had a gin cocktail wth currant caviar, which was strong and delicious! Started dinner with the oysters -- these were beautiful, delicate, delicious. Would order again in a heartbeat! Ordered the crab and the duck for main course; this is where the problems started. It took a long (long!) time for the entrees to come out; when they finally came to us, my duck, while perfectly medium-rare, was cold. I really really don't like cold meat, and that hadn't been mentioned in the menu, so I asked if it was meant to be served cold. The answer was no, so I requested that it could be fixed and heated appropriately. What a shame, because it was so beautifully prepared. My friends ordered lobster -- that, while tasty, was also borderline cold, which led us to believe that these had possibly been prepared correctly and then sat out for a while. My duck was then returned to me -- now overcooked. :( They did ask me how it was; I didn't want to complain again so I said it was OK. (yes, yes I know I could have complained again, but there's only so much complaining one can do in a restaurant). I appreciate that not everything is always perfect, but at close to $40/entree they need to be able to execute and coordinate well. (without putting the onus on the diner to be the \"complainer\"; I am not sure how my request was presented to the kitchen, but any chef would think that what was sent back out to me the second time was overcooked.) To the server's credit, he did \"top off\" my wine since it was almost drained during all the waiting for the dish! Dessert was divine; we tried the clafoutis, the chocolate fantasy, and the Paris-Brest wheel pastry (wow!) Food is top-notch; service needs some work for coordination. Not sure if I'm going to return; they need to work out the kinks first."], ["Khloe K.", "Sophisticated, modern, elegant.  Oysters were fantastic.  I could of had a dozen on my own. I'm craving them right now as i write this review.  I unfortunately wasn't as wow'd by the King crab appetizer, monkfish and guinea hen They were good but perhaps my expectations were too high.  I'd like to return and try some other things on the menu .....and hopefully get those oysters again"], ["Michelle G.", "Amazing! This is the first time we've been to a restaurant the first week it opens, but this wasn't much of a gamble, given that Naha is amazing. Brindille is definitely meant to be a dining experience, but we had theater tickets so we had to rush a little. We had the king crab appetizer, which was awesome. I had the Dover sole, which was wonderful, and my husband had the rib of beef, also wonderful, as was the glazed potato concoction that came with it. We didn't have time for dessert but the Fantaise au Chocolat looked incredible. Quite pricey, but a great place for a special occasion."], ["Nancy K.", "We like to \"graze\" around town and get appetizers/small plates at the bar at a few places on a nice evening.  When one of our favorites was already too crowded at 6:30 we aimed for the new Brindille.  We never moved on.  Chatted with bartender Steve and enjoyed a quick talk with Carrie N!  We are fans of Naha and she has outdone herself here.  Best Steak Tartare ever.  Fois Gras, crab and sweetbreads made for an incredible meal."], ["Ann M.", "Dinner tonight- I am giving them 5 stars because they were are the best restaurant I have ever been to that has only been open 2 weeks.  The service--Jeffrey our waiter whom we remembered from a prior circumstance (and who remembers their waiter?--yes, he is THAT GOOD)--was wonderful; attentive without being obsequious.  That attitude was prevalent from everyone there--they ALL wanted to make sure that we had enjoyed ourselves.  But the food speaks for itself.  I had the Guinea Hen with morels fava beans and sunchokes--because Jeffrey told me to (I had planned to order the Dover Sole Meuniere--will have to go back) and if i could have done so unobtrusively, I would have licked my plate.  I wanted a pint of the sauce to go.  My husband had the Duck with wheatberries--the duck was cut from the center of the breast and cooked perfectly.  We had the King Crab appetizer--delicious, but we shared it and it was too small to do that--note: Jeffrey warned/mentioned that, but we ordered it anyway.  Had the cheese course and some port for dessert; and it was a very ample cheese plate that we split--probably 12 small slices with a full range of cheese choices.  Truly enjoyed the food, the decor, and the service.  For those who might find NAHA slightly loud, this was a more controlled buzz and we could easily talk to each other.  BRAVO--a wonderful addition to the Chicago fine dining scene.  Cant wait to go back."]], "Brasserie By LM": [["Silvia T.", "Service is not their best starting by the host who is not very good at customer service. Not enough umbrellas for sun coverage in the outdoor.   Food was just ok so very likely not coming back.  Not recommending it to my friends."], ["Montel E.", "I had really high expectations for this place because of the looks and decent reviews on here. I do see this place as having good potential but my experience was awful. I came here with a lady friend (who is French, reason I chose this restaurant ) and when we walked in we were not greeted for exactly 5 minutes. There seemed to be only two people working at the time, and finally when we had someone tell us to choose our seat they had a very nasty attitude. It took over 20 minutes for someone to ask us if we were ready to order. The waitress that served us treated us like complete children, making jokes about ordering alcohol, making jokes about the restaurant, and kept on referring to us as kids.Shortly after we placed our order a group of obviously foreign men came in and were confused as well because they were not greeted.  Our waitress told them to have a seat and when they did not understand her well, she was very loud and disrespectful to them repeating herself. The wait for the food was very very very long when we were told it would take no more than 9 minutes. Overall, the food was delicious. I ordered steak frites and my guest ordered the croque madame and we were both pleased with our dish. This place definitely has potential, but i'd try and avoid the early afternoon staff\\management.. They really made our experience awful."], ["Eleanor C.", "This is great place, kind of a well kept secret. Hard working staff in a snow storm and the food is fantastic !"], ["Courtney J.", "Checked out this place for lunch and I doubt I'll be back the service was god awful which is crazy because it wasn't busy at all. Out party of four was seated by a busser who also got us water then we were ignored for 20 min until I flagged another server to see who was supposed to be helping us. We order drinks and burgers the drinks take another 15 min to arrive and the burgers maybe 15 after that. When we needed anything we had to aak random people walking by us to help or find our server all and all burgers became a 2 hour process where we were constantly trying to find help right up until the check where two different servers were trying to help we didn't even know who we were tipping since we worked with so many different people. I really hope the service here gets better as it has a lovely ambiance and could be a great lunch/after work drinks place"], ["Shanti N.", "This restaurant is located in the Essex Inn. I'd filed this spot away last spring when I was walking by, but didn't have the opportunity to stop in until last week. I was looking for a low-key spot to have a glass of wine and bite to eat, and feeling exhausted by the usual suspects that I frequent. The interior is reminiscent of a classic brasserie,  and floor-to-ceiling windows afford views of Grant Park. I was able to get a seat at the bar right away, as most of the patrons were seated at tables, seeing as how I came in during the dinner hour. As a bonus, a pretty decent musical group from Columbia College was playing. I found out that the restaurant has partnered with Columbia College to provide a live music series, and that musicians from the college play on select Wednesday evenings. How cool is that? Additionally, specials are offered most days of the week. When I stopped in, wine bottles were 1/2 price. I ended up with a glass of tempranillo (a Spanish wine, I know) but I was in the mood for something different. I paired this with a version of the croque monsieur - a variation that included brie and vegetables. I must say that a generous amount of fries (aka Brasserie potatoes) came with the sandwich, which was an unexpected bonus. I will definitely be back here, possibly for lunch or brunch."], ["Susan C.", "I went here twice, the first time with my best friend since she recommend it and had a coupon for the place. The second time with my husband. Each time I had a great experience with the food since the food is delicious. The service was good since gbe waitstaff was attentive and friendly. It's in the heart of Michigan ave not the far from symphony center. I have yet to try their brunch menu and I will definitely go back their for dinner and try their les moules and frites which is all you can eat mussels and fries."], ["Aleah A.", "I can't remember having better service! The waiter was unbelievable. Even though we had 12 people in our group we had everything we needed when we needed it. the owner hostess or some really nice lady also came over and made a few jokes. It felt like home. The burger was really really great and I will definitely be back"], ["Ronald C.", "I've been patronizing this restaurant loyally since it opened, and have actually frequented this location since 1987 when it was operating under a different name entirely.Of course, as Brasserie, it is currently enjoying it's best incarnation.  The food is superlative, the service is generally attentive and I come here at least bi-weekly for dinner, cocktails (or both) and on weekends for brunch and the bottomless mimosas. The mixologist is about the best in this neighborhood, plain and simple.One thing that recently gave me pause, however, was Sunday July 20th, when I invited a guest to meet me here for brunch.  I live just two blocks away, so it's often my first choice given the usually exhaustive weekend lines/waiting at Yolk restaurant, situated next-door to my apartment building.I walked into Brasserie that morning at around 11:00 a.m., and stepped up to the hostess' desk to check-in and secure a table for two. The woman at the desk looked up from her seating chart, pointed her finger up into the air as if to gesture \"One moment,\" walked to the back/kitchen area and never returned. She didn't greet me civilly or say anything at all to me verbally. Five minutes went by, then ten, then 15 and finally 20 minutes without a single word from anyone.By then, the line of people waiting behind me had grown to about 12. Wait staff strangely began the tactic of coming up and greeting white people in line behind me--as if I were invisible or something--and seating their parties. Those who didn't get seated right away, at least had information. Yes, there were two marathons going on in downtown Chicago that morning, and everybody and their mother had the same big idea of having breakfast on Michigan Ave.  It was frightfully busy, and confusing, and I get that.Even so, I was just hoping for a single table on a sunny Sunday morning, at a place I have come to for decades. That shouldn't be too much of a stretch.  The inside was pretty full, but there were about four tables available outside on the sidewalk.Staff virtually broke their necks to quickly accommodate the marathoners, and the predominantly white hotel guests spilling in the front and side doors from the Essex and Hilton Hotels, but looked right through me, the first person in line. After that 20 minutes with my jaw on the ground, I pulled out my smartphone, searched for another nearby restaurant and walked out.I still support the ownership's vision and dine here, but with this key learning in mind."], ["Kyrie C.", "Sunday Funday! First experience. Janet and David were so attentive and fun. I dare you to go there and mention the 'white flag challenge' to Janet! Good Luck!"], ["Lena T.", "First off yes the food was perfectly fine. Nothing amazing, but nothing bad.And yes we were a large group but the service was seriously problematic. Food & drink service was very slow and it took us an hour just to get our bills after we had finished eating. The poor waitress was stressed out as hell and apparently the credit card machine broke. But what was the ridiculous part is that instead of informing of us they just kept us waiting. We knew there were a lot of us and if they had just said they were having issues, we could have figured out how to pay in cash or something. I could chop this all up to the \"we were a big group\" issue, but as we were waiting around for everything, we saw multiple small tables (groups of 2 and 4) get up and leave and at least a few people standing and looking around for waitstaff. They SEEMED to be well staffed for a quiet evening - the place was not even half full. By the time we managed to basically run out the door (we were now quite late for something else) we had been there for over 3 hours. Nope."], ["Edward S.", "HORRIBLE SERVICE!!Stay away!After my last visit I will never go back. I was sort of a regular, mostly on weekends. I've been served by mostly every server in this establishment. Lewis was my regular server, he was fantastic- disappointed he quit. I still decided to continue going, the food is good but not great enough to give them more stars. As I waited for my guests at the bar, I witness servers drinking!!!!! Drinking behind the bar- what restaurant lets their servers drink during the job? I would understand an after work drink but during, no wonder the service is bad.  Once my party arrived we were seated and that's when it all went downhill. We waited a good 20 minutes for a server to notice us, when she arrived she had an attitude that we sat in her section.  Very rude and extremely unprofessional.  We asked for coffee... 5 min later nothing...10 min still waiting..15 I had to get up to flag a different server.  I should have drank my coffee black because we asked for cream but it didn't arrive for a good 15 minutes.  We asked our server to speak to the manager.  She said \"She's in a meeting\". Really? In a meeting on a weekend brunch? I'm not stupid. Instead of staying we decided to leave without eating. We took the red line up north to a different restaurant. I'd rather travel outside my neighborhood then come back to this establishment.  I wonder how many reviews will it take for them to change their service staff or even management?"], ["Dana B.", "I hesitated giving 2 stars, but only because there was no option for 1/2 a star. I've been here 4 times in the past week. The first time, I sat at the bar and had no issues. The other 3 times, service was so slow that I wanted to leave. I've read all the reviews and there seems to be a common theme of BAD SERVICE. I see the owner/mgr comment, yet, BAD SERVICE is still an issue. Giving a customer dinner on the house doesn't fix BAD SERVICE. Training fixes bad service. Here's a tip, walk directly across the street to Kitty O'Sheas. Prices are cheaper and service is actually good."], ["Allie M.", "Such delicious food, the service was a little slow but attentive when we voiced our needs."], ["Gina B.", "Brasserie is walking distance from the Blackstone Renaissaine Marriott on Michigan and is a great spot for breakfast and not too bad for lunch.I'd give it a solid billing for brekkie. They do a $25 all you can drink mimosas and 1 entree on the weekends. Really a reasonable deal. My salad for lunch wasn't super filling. I felt the piece of salmon was incredibly small. While it was tasty, I was still hungry and didn't feel it was worth $12.As with most restaurants in Chicago, the outside doesn't do the inside any favors. We were pleasantly surprised when we walked in to find updated decor. The service was a hit for breakfast and a miss for lunch. Depends on who you get. Shouldn't take 45 min to make a salad I would think."], ["Xavier A.", "This place is an embarrassment. We came for the $25 brunch and it couldn't have been a worse experience. Even though the patio had open tables, we were told it'd be a 15 minute wait. Okay, maybe they needed time to catch up. We waited roughly 25 minutes, still with tables open, before we asked how much longer it would be. We were then immediately sat in the patio. Then why the 15 minute wait? After nearly 40 minutes, our brunch came out. One of our plates was cold, and the toast wasn't even \"toasted.\" After sending the plate back, we were told that they were making a completely new plate. The same plate came out with the same untoasted bread, cold eggs, but minus the potatoes (which were supposed to be included). After sending the plate back a second time, the manager came out and comped the entire meal, and provided a voucher to come back. After today's train wreck, we're not even sure we'd want to come back. However, we do give credit for the manager doing what was right."], ["Thuong V.", "Nice people, very good food. But sadly understaffed. Wish that I would come back but can't see it. Mussels were great. Steak frites well done. Deserts fantastic. Our waiter was courteous and drinks were hip. Need to increase staff to bring to next level"], ["Stephanie M.", "Very solid food at a great location. And i was super impressed with the $5 kids cheeseburger! I would totally order it for myself if there wasn't an age requirement (12 and younger)."], ["Kevin O.", "Arrived for Brunch on a Sunday. Restaurant was  very busy, but we were seated after a short wait. The Brie Croissant and Egg Benedict by LM were ordered and were excellent. Place had a relaxed feel, server arrived a few times to check/provide water/coffee  refill. Overall, we had an excellent experience. Foods were excellent, server was very courteous  and friendly, price was very good and the atmosphere  was  very relaxing. The manager/owner came to see how we were doing and we feel like we were very much at home. We would definitely  return and recommend  to our friends Brassiere  by LM. Thumbs up! 5 Stars rating from us!"], ["Sandy S.", "Had breakfast here on a Sunday. $25 for bottomless mimosas and any menu item. Had the ham and cheese brioche. Was very tasty came with large fried potatoes. Service was a tad slow but the food and mimosas made up for it. Very close to the Chicago Hilton"], ["Randall S.", "Best brunch I've had that came with bottomless mimosas, minute hiccups notwithstanding. Great, helpful and courteous staff, DELICIOUS food (I had the American which is eggs, bacon, potatoes and toast. My partner had an egg white omelet with potatoes and sausage) and the bottomless mimosas. Great views and ambience, great service (we had Steve, a true pro). I had eggs that I love runny but came hard. I mentioned it and they took care of it right away. Not too busy, not empty though, very chill and in a great spot in the south loop, a few blocks from me but I never knew!We will be back. Five star brunch spot. 10/10 will recommend!"]], "Bistrot Zinc": [["Natalie C.", "Came here for my 26th birthday celebration - the restaurant was great about accommodating our larger group (no need for a food/beverage minimum, they didn't mind that some of our party was exceedingly un-punctual, allowed us to pay with multiple credit cards and cash - all while providing quick and friendly service from when we were seated to when we cheerily moved on to post dinner drinks).The food was delightful - I taste a few different appetizers, the mussels were cooked perfectly and in a delicious cream sauce (soaked up the broth with a lot of bread, yum!), the pate with little gherkins, and escargot (happy garlicky wonderfulness).  I had the calf's liver - it was cooked perfectly and served over mashed potatoes and topped with fried onion rings.Definitely recommend this restaurant to anyone in the area looking for great French food and exceptional service.  Will be back!"], ["ML ..", "Service was rough, neither professional nor pleasant.  My onion soup wasn't all that great.  I've definitely had better.  I can see why they weren't packed when all other restaurants nearby were filled to the max."], ["Anthony S.", "Great place for fun French food with a pleasant atmosphere. Arugula with dates/bacon/Parmesan and lemon vinaigrette was a light and unique appetizer. Salmon over roasted fennel with smoked tomatoes was amazing. Fennel melted in your mouth and tomatoes were sweet but smoky. Dessert was fabulous mascarpone with berries and mint tea. Felt satiated but not stuffed. $80 for two not including tip."], ["M A.", "Great breakfast, amazing French toast. Excellent service. We've always had a good time here. Kids friendly."], ["Haley S.", "Excellent french bistro.  Well prepared steak frites, excellent red wine.  My friend and I shared the banana and nutella crepe which was mind blowingly yummy.  A good spot for a nice low key dinner on a Saturday night."], ["Brittany G.", "Ian was a fabulous server. The ambiance was smooth music with dim lighting. Perfect for intimate dining"], ["Danny D.", "Took the gf here for her birthday.  Booked it on opentable and me tioned it hthere that it was her bday.  Two hours before our reservation I had to push it back a couple of hours and so I called and the hostess made it happen which was great  - especially since it was a Friday night. Upon arrival the host and hostess wished my gf a happy bday which was really nice and they saved a table for us in the very crowded restaurant right next to the window.  Well done Zinc peeps!  The Pork Milanese was amazing.  The gf had the trout on spinach and she liked it as I did, but she liked my pork dish better.  Chocolate cake was great and came with a birthday candle too - very classy.  Great atmosphere and experience - we will be back soon."], ["Robert L.", "Honestly the place is awesome. My gripe is that the food is expensive, but you do not get that much of it. I guess it's a French thing, but I didn't feel I got my money's worth."], ["Lesley G.", "I think the reviews here are a bit critical; loved this bistro and food was great. We came for a late lunch and split the escargot, frisée salad and croque Monsieur. All were very good and our waitress knew well enough to space out the order so that my husband and I could enjoy each one. Each was perfectly cooked and came out piping hot. Wine was delicious and reasonably priced (for all the reviewers out there - a decent glass of wine will be between $8-$14 in Chicago...)Great food, great service, cute ambiance - will be back!"], ["Wes Cole C.", "This bistro was very patient with me when I tried to perform a magic trick, yanked the table cloth, and sent all of the glassware crashing to the floor.   The milk here is good. I like the French fries."], ["Shan D.", "Underrated spot for brunch. I love their mushroom and Brie crepe. The French toast is great if you want something on the sweeter side. You can also order lunch items if you're not in the breakfast mood. Sadly I haven't been here for dinner."], ["Eve Laure R.", "Two nights ago, my father reserved us a table at the Bistro Zinc for yesterday night. As we came in, there was nearly no noise level and the waiters were extremely nice as they even let us switch spot due to a little inconvenience. We were really happy to find on the table real bread and real butter à volonté.As we ordered, we took a full course starting with the appetizer: my father took the Salade d'Endives which was very good. My sister took a Gratin de Pommes de terre et fenouille to die for. As for my mother and I, we shared the Moules marinières who weren't Marinières but more crème de Safran; not being disappointed though because the taste was new and as a different style.Next was the entrées. My father took a steak   Frites and was mostly satisfied with the meat but the frites were extremely salted. My sister took a Croque Monsieur which totally dissatisfied her because the bread was not grilled as it needed due to it being stuffed and puffed with the Cheese or the Béchamel they put in.My mother took a Quiche du Jour which was quite nice except it was enormous- frankly I have never seeing anything like that- and the crust was overcooked.As for myself, I took the Tagine de Légumes which greatly satisfied me. The taste was smooth and well put together an the plate was not as big as my family's. The entrees being big made us a bit disappointed because it doesn't show the true French cuisine. By that time more people arrived making the noise level higher and in between supportable and headache maker. But what happened is that the waiters were overflowing with work making them have little time for each table they serve.Lastly, the desserts which were the Baies à la Mascarpone and the Gâteau au Beurre d'Amandes. We were very glad we took them and let our bellies pop out! The fruits were tasty and not atomic and full of water. The Almond butter cake was warm and the dishes were small. I was delicious.As a French person, I was quite satisfied with my food but my parents and sister weren't that  happy with their experience and we were all a bit disappointed I guess. But way to go in trying!"], ["Connie Y.", "Food was really good!  I was pleasantly surprised given that my experiences at any French restaurant is typically met with a bit of disappointment.  Went there with some friends for brunch and got the french onion soup and lamb sandwich with grilled onion, watercress, and rosemary aioli which were both delicious.  It was quite filling as well.  The ambiance was nice for a Saturday morning.  There were not a whole lot of people which is a nice change from most other brunch places where it can be loud and difficult to hear people at your own table due to all the noise.  The overall staff was quite nice.  Our server was okay.  To be honest, not as great as I would have expected from such an establishment."], ["Michael C.", "I really enjoyed the bistrot zinc, pretty fancy looking golden interior with the service staff dressed in all white. We came in 10:30 on a Sunday morning and we happened to be the only ones in the restaurant. Pretty unexpected awesomeness since brunching in Chicago can have nightmare waits. We were seated immediately and brought our menus. The selection is nothing spectacular but had some unique things- the croque monsieur and a lamb sandwich as breakfast dishes which my girlfriend and I both shared. The croque monsieur was a fluffy french toast hamd and cheese sandwich. Very savory and the cheese used was quite sharp- tasty dish. My lamb sandwich included thinly sliced lamb piled on and had a good charred favor. It was definitely different and I appreciated the smokiness although I don't think I would ever get it again. What was disappointing was that it came with chips instead of french fries! Luckily my girlfriend was nice enough to share hers with me (they came with croque monsieur). My friends at the table got a mushroom crepe, a quiche, and french toast. All seemed very pleased with the meal. Afterwards we split a banana nutella crepe which was divine! Stuffed with bananas and oozing with chocolate, we ended breakfast on a definite high note.Overall I would recommend this place for its great service and pretty solid food!"], ["Rebecca R.", "I like this place but I'm not blown away either. It's a little overpriced but it's still has a nice ambiance. I went the other night with a friend and we ordered the scallops as an appetizer. The appetizer cost $13 and we got TWO scallops. So basically each scallop was $7.50. I figured we'd get more than two for that price but we didn't...I ordered the pork milanese which was very good. It came with a small tomato heirloom salad but overall it was one big piece of pounded meat. Good food, a little overpriced, romantic ambiance."], ["Samantha H.", "I love the classic French bistro flare of this place.  The atmosphere is cozy but still busy and bustling.  The wine list is quite approachable as well.  You have to ask for butter with the bread but the bread is yummy.  Our server was Ian and he was just excellent as well.  One criticism is that the menu does not say what the dishes come with.  They are actually huge portions.  I did not realize mine would come with a large portion of mashed potatoes as well as the main so that could be described a little better.  But overall the experience was great and I'll definitely be back.We started with some venison terrine and escargot.  I feel that for escargot it really matters about the texture and if you get some sea flavor from the snail as anything in a bunch of garlic and butter will be awesome.  So I usually am underwhelmed.  These were actually really good.  Not quite Maudes, but my second favorite I've had.  They had a perfect crunchy crust on the top and the snail flavor actually came through.  The venison was just okay.  There were very large pieces of pistachio in there that made it a bit difficult to eat.  I also am a huge fan of venison and I didn't get that much true flavor.  The cherry stuff they served with it was awesome though.  I got the skate wing, which was prepared phenomenally.  Skate is so easy to mess up and many times when you order it, it comes mushy and lacks the delicacy that makes it so succulent.  This was the perfect balance of tender meat with the light, crispy skin.  It came with mashed potatoes that were dynamite as well.  My husband got the special stew, which was a chicken and tomato stew that he said was awesome.  I was so stuffed I couldn't try it.  Yet I tied the profiterole, which was very tasty, despite me not being a dessert person.  So nothing was bad foodwise but some things were stand outs.  I look forward to trying some other things next time and being aware of portion sizes for my next visit."], ["David S.", "Went last Friday evening for a nice dinner with my girlfriend, we live right down the street and hadn't been there yet (even though we've lived in the area for about a year), ambiance was great, servers, bussers were great, food was ok.  For the price, the Steak Frites was a total rip off I thought and I am not some rich yuppy.  The steak had the consistency of hamburger meat and was really, really thin.  My girlfriends meal was good however.  She had a ham and cheese melt of some kind.  I would return, however, not for the occasion of a nice dinner.  If you want a great French dinner, try Mon Ami Gabi in Lincoln Park."], ["Chris T.", "Stopped by for brunch and left satisfied. I'm not usually a fan of french cuisine (sacre bleu!) but the food, ambience and service were all magnifique. Food: I had the Lamb Sandwich, and the meat was tender and delicious. I ended up taking out the onion from the sandwich, which made it much better in my opinion; the onion was particularly strong. The quiche of the day was also quite good. The day we were there it was bacon and leek quiche. It fills you up!One of the best parts is that when you checkin through four square you get a free cocktail! So don't forget to."], ["Sujin Y.", "Went for Valentine's day. Good thing we made reservations because it was very full. Escargot (7/10): I've had better escargot in other French restaurants. Cooked well but overloaded with garlic.Lyonnaise salad (7/10): Missing a acidic element. Need more citrus. Greens were too bitter.Puff pastry with chicken stew (9.5/10): Dish of the night! Too much puff pastry and mashed potatoes overwhelmed the stew. Almost perfect! Braised beef short ribs (6/10): Sauce was too salty and the short ribs weren't fall apart yet. Needed more cooking time. Chocolate mousse (7/10): A bit too over whipped. It affected the texture. Also the chocolate had a very bitter and sour aftertaste. Service (7/10): Our waiter was slow to come back to our table. Just an inconvenience when we wanted to order and such."], ["Nigel P.", "My partner and I have a tradition:  we come here for lunch on the last day of our annual visit to Chicago.  Consequently, I have bittersweet memories of Bistrot Zinc as we always hate to leave.  For our next visit I am determined to have dinner here on the day of our arrival.  It only seems fitting to do that which one loves as soon as possible, and we love Bistrot Zinc.  Come for the martinis (always perfect) and stay for the food (always fabulous)!"]], "Bistro Campagne": [["Cameron H.", "It has been so long since I've had French cuisine!  I cannot believe I have never been to this place.  Everyone raved about it and I am always in the area but have never gone.  Shame one me!Very cute place.  Small and very intimate seating/surroundings!The food was delicious, wine perfect, dessert just the right size.  I started out with the escargot.  I mean, you cannot go to a French resto and not order the Escargot. Then for my main, I ordered the Truite Grenobloise.  This trout was perfect.  The crunchy skin, moist fish, great flavor.  For dessert, I cannot believe I've never had this before, but we shared the Pot de-Crème au Chocolat.I'm sold."], ["Donald C.", "Another great evening....French Onion Soup, Amish Chicken, Hanger Steak, 2 bottles of wine plus another glass each. Absolutely delightful, memorable, and wonderful dinner."], ["John Y.", "Went to a wedding here.... Cozy and charming bistro with outstanding food, presentation and attentiive service.  Our wedding couple selected a fine place to host their special day..."], ["Shuangshuang W.", "Based on the brunch we had, I would give food 3 stars. Duck confit was still disappointing( have never gotten good duck confit in Chicago) others were just average. I took one start out because of the service. Horrible service!!!!  The waiter was rude and unfriendly. Let us sit there to wait for check for 20 mins when the restaurant was not busy at all with empty seats around us. In the end, we went to the bar to ask for bills... Get your ass together please, for your reputation."], ["Issy G.", "My husband and I were running errands on Sunday morning.  We decided to grab a late brunch after our errands ....originally we were going to go to a different place but we parked in front of Bistro Campagne.  We looked at the menu by the door and took a quick peek to see if there was a wait....luckily there wasn't.  We were seated right away!   We were lucky because within 5 minutes of us being seated a line formed.  I was digging the atmosphere .... I have lived near Montreal and have visited Paris several times so this place gave the same vibe.  Oooo was it a vibe! I had the Duck Confit and my husband had the Brioche French Toast.    Both were outstanding!   I can't wait for the weather to get warm so we can sit outside in their little garden for dinner and sip wine while we feast!"], ["Marybell P.", "What a delight!!! My husband and I have been wanting to try this place out for sometime, we decided to head for dinner on a Saturday night, and ended up here by a pure fluke! No dinner reservation, just walked in and the hostess immediately made accommodations for us to be seated. She first sat us outside on a cute side bench, it was perfect for drinks and appetizers (very romantic) I was pretty satisfied. A few minutes later she came back and wow had a table for two ready in the outdoor patio! Very, very country french setting, my husband and I even joked and said it felt like we were on a vacation. Our drinks came soon after, I had their French Manhattan very tasty with a rich taste. Our waiter Patrick was most helpful and was on point with recommending only the best on the menu, he really knows what drinks complement each dish. My husband had the Hanger Steak and frites and was Patrick's suggestion even though it was 10.00 dollars less than another steak dinner on the menu. The steak was a buttery, mouth watering delight! (a had a few bites)..... I had their fish special and was very pleased with it as well. Go here! you will not be disappointed!!!"], ["Dawn F.", "I've been wanting to come here for a long time. Last night 6 of us dined here. The restaurant is charming, good wine/drink menu and good food.  The reason I gave this a 3 is we were seated in a room with another table of 8. The table of 8 were the most loud and obnoxious adults we have ever encountered.  They were all yelling including the high pitched shrill women.  Our tab was substantial and after working all week this is not what we wanted to experience. The server and management should have said something to the other table."], ["Erin Y.", "This is more of a 3.5 star review. I love French bistros and this was one of the only ones open on Sunday, so we decided to come here. The restaurant itself is insanely quaint and feels just like the French countryside. The outdoor patio is beautiful and the wood floors and little nooks indoors are very charming. While it's not your traditional tile-floored bistro, it's a great atmosphere for any special occasion. As for food, we started with the brandade (salted cod fritters) and the escargot. This was probably my favorite part of the meal. The brandade were delicious and the escargot was as good as it gets. No complaints here. For my entree, I had the steak frites with hangar steak. The steak was cooked perfectly. Loved the thin and crispy frites, the herb sauce, and the bordelaise. However, the dish was on the salty side, and I have a pretty high salt threshold. I also tried the roasted squash entree which had a bitter taste to it, not sure if I could have eaten the whole plate. That said, the person who ordered it loved it so it could have just been that bite. For dessert, we had the profiteroles and their special apricot tart. The profiteroles were very good, though it's hard to mess up profiteroles. The apricot tart was tasty, but the puff pastry was just a little too soggy. It was sometimes hard to tell that there was a tart under the apricot, but other than that, it was tasty and not too sweet. Overall, this is a tough one for me in terms of star rating because I did enjoy this place. It was a very solid meal across the board, no major flaws. However, I would go elsewhere next time I'm looking for a French bistro. There are too many places in Chicago to get this kind of food, and while I liked this place, I didn't love it enough to come back."], ["Dan M.", "Consistently Good Every Time. Chicken With Mushroom Ragout is as SENSATIONAL Today as it Was 15 Years Ago!! Steak Frites Was Outstanding! All The Food Was Amazing! Gorgeous, Intimate Room, Beautiful Garden, Terrific, Enthusiastic Servers (And Beautiful on Top of Everything Else). I'm Never Disappointed Here!! A Perfect Place For a Special Occasion!"], ["Bridget D.", "Lovely little place. Had the hangar steak frites (cooked perfectly), mussels (divine), and pot au chocolat. Decent service, appreciate the somewhat laid back atmosphere. Will definitely return. Patio looked super cute; I enjoyed the view from inside the air-conditioned restaurant."], ["Stephanie M.", "Everything was wonderful, we did the wine pairing during restaurant week.. I  enjoyed my friends roasted chicken dish more than my steak Frite.. the mac and cheese was divine.. I'll be back again soon! Ambience was quaint and romantic"], ["Anthony C.", "Wonderful space - looks like an old home inside with great lighting and a total relaxing vibe. Service was fantastic throughout the meal.Went with another couple and it was the first time here for all of us. We all tried different menu items including: mussels, salads, steak tatare, potato leek soup, the bistro burger and a couple of fish dishes. Everything was very good and the prices were not too bad for the quality of food.I do prefer the German hackepeter tatare to the French version served here but it was very good. They did have some pretty good bottled beer but one star off the review for no draft beer."], ["Verushka P.", "The ambiance of this place is gorgeous and cute. It's always busy and service is great, unfortunately the flavor of this supposedly French food was so average. That's only reason I gave it a poor rating! For a person who has tried french food from all over Chicago, to Willmett and Barrington... The standards here are not great at all. Fried onion rings on a serving of chicken?!? Like who does that???.... The flavor was mostly salt and onion. french cuisine is suppose to be rich and flavorful with the use of herbs or other ingredients beyond just salt. Sadly they haven't been able to allow their menus to match the authentic French places like Michaels in Willmett, IL or Froggys French cafe in Highwood,IL... I guess both those places are run by REAL French people! French cuisine should NEVER be butchered!! The effort is what makes the food delicious and that didn't happen at this place!!  Great location tho!"], ["Dave L.", "Bistro Campagne does not disappoint. The multiple room restaurant with pockets of tables throughout makes it feel like a true French Bistro.  It's menu is limited but what it lakes in quantity is makes up for in quality. Their wine list is also carefully selected and equally impressive. I thoroughly enjoyed the french onion soup, it was balanced (not too sweet like most places) and had a great cheesy top.  I ordered the Trout for the main course along with a side of fries. We finished with the chocolate pudding. Overall, I thought all the food was incredible. That said, it is quite an expensive restaurant as everything on the menu is a la carte."], ["Riley N.", "Excellent cocktails, delicious food, and attentive yet not overbearing service. Love to start with the charcuterie--there's always something good to try from classic chicken liver mouse to something new like duck and pistachio pâté. And no matter how full I am, it's difficult to resist the creamy and rich pot de crème!"], ["Peter O.", "Appealing rustic inn exterior and interior, above average brunch food. We'll give it another go, and look forward to warm weather's return and eating in their charming al fresco dining area.The food was really quite good, an easy four stars. My Quiche du Jour was creamy eggy smooth and delicious; S's typical scrambled eggs, meat and potatoes were as good as they could be, with Nueske's applewood smoked bacon thick and yummylicious. House-made breakfast biscuits were as delightful light and flaky croissants in biscuit form, gifts of the gods really, and sweet butter was room temperature. Very fresh fruit cup was large. We commented favourably on the excellent, creamy quartered potato wedges. Creme brulee and house made lemon sorbet were above reproach and coffee and espresso drinks were superb.~Peter O. and S."], ["Eric G.", "Great meal and the prix fixe (especially with the wine pairing) is a great bargain! We went here for my birthday with my parents and decided on the Wednesday prix fixe meal. Having had other prix fixe meals elsewhere I was expecting less, but in both quality and quantity Bistro Campagne delivered. The Poulet Rôti Forestière was cooked perfectly with a very nice mushroom cream sauce and my wife's Rushing Waters trout was nicely brown. Brandade de Morue en Croquette (cod fritters) were very tasty. My daughters hangear steak was cooked perfectly and the pomme frites were very good. The wine pairings were done very well, to the point where I was taking sips after every bite. Opt for the Pain Perdu at dessert and you won't be disappointed.My actual rating is 4.5 stars, the small mark is for the food being a little more of the American variant of French classics, versus the authentic preps that I was expecting. However, the quality and flavor were superb.This is a great place for a quiet night out, good for conversation, and relaxation. They've got a first-come first-serve patio as well. We will definitely return!"], ["Jimmy F.", "This place is yes.I have been there for brunch and for dinner, and have never been disappointed. The service is always gracious without being overwhelming, and the food is great. Their drink list is also very good -they even have V.E.P green Chartreuse, my favorite!While we go for dinner only on special occasions, their brunch is what I crave every weekend. I wish they offered it on Saturday! If you go for brunch and have a bit of a sweet tooth, try the crepes suzette. Honestly, even if you don't have a sweet tooth, give them a shot. They are very well executed, and the caramelized brandied oranges are delicious. The atmosphere is cozy, and fairly quiet, which I also love, and I hear that their patio is great, though I haven't had a chance to go in patio weather. I highly recommend this place."], ["Victoria R.", "I love this place. Everything here is amazing. The ambiance is perfect for a romantic dinner or and intimate night with friends. The service is also exceptional and knowledgeable. I would highly recommend this bistro."], ["Colton R.", "Very pleasant experience. The service was attentive without being annoying and our waiter was very kind and entertaining. The food was amazing. The restaurant itself is very quaint and romantic. I definitely plan on returning here the next time I'm in Chicago and I would highly recommend it."], ["Bart H.", "My wife and I have eaten at many of Chicago's finest restaurants and after celebrating our wedding anniversary as drop ins (no reservation) on a Saturday night when the restaurant was full, we now have a new favorite. The hostess seated us quickly when I told her it was our 45th wedding anniversary and she actually apologized for giving us a small table in what was the rear dining room of several. We have since been back twice and were lucky enough to get the same table each time. We loved each experience. The servers are knowledgeable, the wine list, although limited compared to Chicago's finest, is terrific and affordable. The food has been consistently excellent and the service all three times, has been very good. We look forward to more meals at this Chicago gem."], ["Chris M.", "Only went for brunch once. The blonde waitress was pretty bad and ignored us for virtually the entire meal unless we flagged her down as if my hair was on fire. I ordered the crabcakes and the cakes and poached eggs were cold by the time they arrived which was a considerable wait. Boyfriend had a hair in his food but did not want to make a big deal about it, so we just chalked this one up to a 'do not come back' unless there are no other options (in Lincoln Square that's not going to happen). Nice cozy space though."], ["Charlotte J.", "Wonderful!  Warm and inviting atmosphere.  Friendly and attentive service. I've have never been served anything that wasn't either very good or great... salmon, steak, liver, salads, sides, escargot, mussels, brunch, wines, cocktails...you name it. Each time I walk in I have high expectations and am never disappointed."], ["ashley r.", "Our visit was prompted by a school assignment for a French Course I am taking. My boyfriend stumbled across the menu online and figured because most of it was in French, it would be a good candidate for the authenticity my paper required. Lets start with how wonderful, Patrick, our server was. We told Patrick what prompted our visit and he truly delivered such great service by going out of his way to explain every little detail he knew about any \"authentic\" French dish. He even taught me a few things I didn't know which landed me a great piece to my paper. We ordered the Strudel à l'Oignon Caramélisé, Patrick said that was the most popular appetizer on the menu and we found out exactly why. Then, of course, we carried on to our main courses, which were also fantastic. Patrick also recommended his personal favorite for desert, which I loved! Overall, everything was great from start to finish. I must say, Patrick is a true asset to your country feel French cuisine, as he knew everything on the menu and offered such a personable and friendly experience.We'll be back for your brunch option very soon!"], ["Yvonne K.", "No words can express my love for this place.  I have been a guest since they opened.  Living in California now, I still go there when back in Chicago every chance I get.Service, ambiance and food all amazing, every single time."], ["Andrea H.", "My husband and I were looking for a quiet restaurant with great food, to celebrate our anniversary.  We found Bistro Campagne, and both the food and service were beyond our expectations. It is a delight to find a restaurant not far from our home that has the flavor of France.  The restaurant reminded us of a restaurant on the Left Bank of Paris where we also celebrated our anniversary years ago."], ["Sam D.", "Much of the time, after the first few bites of a wonderful dish, it will begin to lose it's initial splendor. But not here. Every single bite of my Croque Madame (yes, even this simple of a dish!) was incredible.  My companion ate the Almond French Toast and had the same experience. The atmosphere (inside and out) was lovely. We enjoyed a walk through Lincoln Square after our meal. It was a phenomenal experience all around. Highly recommend."], ["Krista R.", "Absolutely adorable restaurant. The food I sampled was average (fresh tuna salad), but the ambiance, service, and coffee were fantastic.Menu options that may get me back in the door: crepes, frites, cocktails, beef bourguignon, streak, duck, mussels. Trendy and hip, great for a small group or a date."], ["Jonathan L.", "It was very good and the service was friendly.  My only reasons for marking it down a bit were:1) The escargot and steak and frites were heavy on the garlic for my taste.  Yes, those are both garlic dishes but I thought they overdid it a bit.2) The service was a bit slow, especially for the restaurant being fairly light on customers while we were there.  (Admittedly, the restaurant may have adjusted staffing accordingly.)  That was not terrible and a leisurely meal is in the spirit of the restaurant.  However, the \"bottomless\" mussels special effectively was not because by the time the server came over for a possible refill, we had lost interest."], ["Brynn M.", "This restaurant has been recommended to me dozens of times over the five years that I have lived in Chicago, so my family and I decided it was time that we try it out.And I have to say, I was really disappointed. The waitstaff was relatively unfriendly, the food pretty bland (and I got the trout, which was the waitresses top recommendation) and the prices way too high for the experience.There are much better restaurants in Lincoln Square, in my opinion."], ["Stafford M.", "French factory. In and out in less than 70 minutes. Very friendly service. Beautiful ambience. My complaints - the speed and the food. The latter being rather crucial. The escargot is cooked in Pernot and the sauce is a corn starchy thick and has a strong alcohol flavor, rather than the clarified garlic butter it sound be. Although flavorful, the boef was very tough. It may have come directly from the refrigerator to the oven, without time to reach room temperature. Perhaps the most impressionable was the efficiency in which the tables were turned at $125 / hour."], ["Jack C.", "Simply great. Wine, escargots, steak tartare, fish, beef, lemon tart. The steak tartare starter was exceptional -- even better than I've had in Europe. Try to get a table next to a window. Nice place for a romantic evening."], ["Sarah C.", "I went in last night for my anniversary and was wonderfully happy with the entire experience. Walking in to such a warm, beautifully lit, cozy place was exactly what I was looking for. Our waitress was an absolute doll and made wonderful wine suggestions. We had all of our courses paired with a wine that was more delicious than the last. And the food - my my - something to write home about. I am so very happy this is the place I picked for such a special evening. If anyone at the Bistro is reading this, thank you very much for such a wonderful experience."], ["Petya Krasteva L.", "Not sure where to start. Beautiful and romantic summer garden. Restaurant itself has a romantic and classy look. It reminded me of a restaurant in downtown Chicago. Fell in love from the first visit. Service was good and the food was so delicious. I go there every time I can and can't even wait for summer time to experience dinning in the garden again."], ["Victoria W.", "This restaurant is very beautiful, with good service. However! I couldn't believe how bad the Gratin de Macaroni was. I'm a huge fan of fancy Mac & Cheeses, my current favorite being the one at Hot Chocolate, and I figured for $18 Bistro Campagne's would be a worthy competitor.It *looked* good, all crispy and slightly burnt on top, but it tasted ridiculously bland, and beneath the crust it was barely creamy at all. It was as if they'd tossed macaroni noodles in a little butter, put cheese on top, baked it and that's it. Maybe for a little $3 side dish to more flavorful food this would be okay, but for $18 I was really expecting something that was at least *delicious*, if not jaw-droppingly so.Also, they initially overcharged us $1 on the pommes frites. As in, the receipt said \"Pommes Frites -- $5,\" so the error was in their system. Not a big deal, but I had to wonder how many people had been paying the incorrect price before we mentioned it."], ["Dilaun W.", "Restaurant Week really put this bistro on my radar. It's a great spot in Lincoln Square just up the street from Old Town School of Folk Music not too far from the El. It was very lively on a Thursday night. Our server Lindsey was outstanding, very friendly, joked around with us. Every one on staff who came to our table was just really cool. We did 3 course meal. I would recommend every dish I had... caramelized onion & gruyere pastry, steak frittes and fig bread pudding. Cute French bistro with outside dining as well. Two thumbs up!"], ["Elina S.", "Came here for a special occasion on a weeknight and had a very nice time. I haven't been to too many french places in the city, and we heard quite a few good things about this place from friends so we knew we had to give it a try. It's very charming inside, simple tables with white table clothes give it an appealing elegance. Their patio is absolutely romantic and also charming, but make sure you come here when it's really warm out to enjoy it. It even has hanging lights, so definitely a pretty spot. We asked for a nice table inside as it was chilly out and they gave us a perfect table in a corner away from the crowd. It was dimly lit and cozy so you get very comfortable right away. It was a Tuesday night and when we came in most people had mussels on their table as it is a special I suppose, something to note for the future and they did smell yummy.We ordered the escargot to start. Let's just say I wasn't the biggest fan of it, but maybe it's just not my thing. We had it at Paris Club and I think they made it a little tastier because it was in a puff pastry where as Bistro's is more garlicy and authentic. Now I had no idea what to do for my entree and since there were no diets that day, I went with their burger coupled with onion frites and I'm soo glad that I did. It was one of the best burgers I've ever had (see attached pic). Wow, good quality beef with onion jam and brie cheese, absolutely delicious. It's also huge so I could only eat half of it, but I definitely recommend it. My hubby got the steak frites with the hanger steak as everyone recommended it with the french fries. I had a bite and he ate the entire thing so it is definitely tasty. But their onion string frites are amazing, better than the pommes frites so definitely get that if your dish doesn't come with it.By this point we were stuffed but how could we not get some dessert, it's me we're talking about here. We went with the creme brule and it was amazing, one of the best I've had, not overly sweet, and the top was the perfect caramelized crunch. They even gave us a candle with it, so that was sweet on their part. Our server was good and friendly and everything was brought out correct and timely. We were definitely impressed by it's non pretentious vibe in a good neighborhood. I'll have to do some other French places before coming back, but I'm happy we came here."], ["Kathy L.", "The food was good.I had the special cassole and escargot, and a salad. very filling. the service was just ok. Our waitress really only paid attention the the guys. The big thing was my feet were freezing! We were in the back room and there was a breeze on my legs the entire time. I know it was cold but this really made me uncomfortable. Be prepared for tight quarters too. Tables are very close to each other. The main room was probably ok but they have a table near the door and I think that had to be cold as well. I think it is better to come when the weather is not so much a factor. The food is very good though."], ["Rowena M.", "This place has been on my list for some time and boy, am I glad I finally had the opportunity to visit!  Lovely, romantic ambience immediately hits you as you approach the facade of this charming bistro.  While I know that one of the draws is their outside seating, I was ok with being seated inside and found it to be a very lovely experience.  We were greeted with a crusty, warm loaf of French bread with REAL butter!  For starters, we had escargot and a goat cheese salad.  I can bathe myself in that escargot sauce - rich and flavorful without being too overpowering and made a great accompaniment to that crusty bread!  Hubby ordered the pork chops which he stated as being in the top 3 of best pork chops he's ever had in his life.  I had to beg him not to gnaw on the bone like a content puppy!  As for me, I was hesitant to order such an ordinary dish like the Amish chicken but there was nothing ordinary about the dish as it was prepared perfectly - tender, flavorful and made even more sinful with the mushroom sauce and onion frites on top!  Because we are gluttons, we also ordered a side of mac n'cheese and mushrooms and yes, you guessed it - those were sinfully delectable, as well.  Even the dessert was amazing; we ordered the seasonal special which was pumpkin panna cotta served with a side of pumpkin spice bread - très magnifique!  I am getting hungry just thinking about this place and cannot wait to return!"], ["J M.", "My husband took us here for date night one day, and it still remains to be one of our most memorable. Every single thing on the table was impeccable. From the bread, the recommended wines, the steak frites. Romantic and a wonderful, charming energy and ambiance."]], "Chez Simo Bistro": [], "Avec": [], "La Crêperie": [["Tracey H.", "I decided to give this restaurant another try and I was able to get a seat on the outdoor patio in back.  My seat on the shady side of the patio was apparently near an ants nest because 4 of them crawled across the table and several of them took to biting my ankles and legs. :(  I had to hold my feet above the grown to keep my tasty limbs from being bitten.Unfortunately, the ants weren't the only problem.  As I started my meal with the soothing sound of the fountain in the background, one of the staff members turned on a foreign language music CD so loud that I couldn't drown it out with my headset. *sad face* My food was good but I opted to skip dessert because I could only hold my legs up for so long and I preferred a quieter space.  If I come back, I'll sit indoors."], ["Anthony S.", "This spot in Lakeview offers up nice wine selection from France, crepe galore, and a great back patio. All of the waitstaff in La Creperie were young which made me skeptical of their knowledge of the menu (sorry for marginalizing young servers...I once was one too) however they totally exceeded my expectations and were on point! Of course, I had to order a French red to start off my dinner, and I followed it up with their hot leek soup. The soup was absolutely refreshing, creamy, and delicious! Next, I went with the vegetarian crepe and the mix of cheeses which was my best decision of the week :-) The environment, food, and staff were all a treat. We had a great dinner here, and I look forward to recommending this place to my friends in the Lakeview area. Next time I am in the neighborhood (from Denver) I will surely be back to this spot."], ["Steve C.", "My favorite pre- or post- movie dining when I see a flick at the Landmark Century.  Crepes are delicious and the ambiance is perfection."], ["Yasmine B.", "I was a little disappointed in the crepes given it is this place's specialty, a little too greasy, too tick and too salty for my taste. But I am kind of a crepe snob and have definitely had better savory crepes elsewhere. On a better note the ambiance is good for small groups, if you are looking at a smaller neighborhood brunch place, and the service is good."], ["erica m.", "I've been here twice already and both times the food was nothing less then amazing. Their crepes weather you go savory or sweet will not disappoint you. Parking in the area can be kinda rough depending on what time of the day you go but over all had a great experience and would likely recommend it"], ["Treyson D.", "I enjoyed my crepe ugh I forgot which one I had but it did have strawberries and this angalies sauce spell check. Lol anyway I am glad I stopped in."], ["Su C.", "Best crepes I've had so far. We just made a trip to city to eat here. It was completely worth the commute.  Place is small and can get little crowded on weekend mornings. Have plenty of options.  We ordered ratatouille crepe that was best salty crepe.  We also had apple butter (or something like tht) to satisfy our sweet tooth. It was perfect combination of butter and sugar with cinnamon.  I can't tolerate when sweet things r just loaded with sugar n u can hardly get the taste of fruit, but I loved this sweet crepe. Would surely visit again."], ["Carol K.", "Oh la la!  La Creperie is tres bon!We stopped in late on a Friday night. We were warmly greeted at the door and, given the place was almost empty, we asked if they were still open.  We were assured they were although the fabulous patio out back had shut down at 11pm.  Know that the hours vary by day so be sure to check before heading there.This place is darling.  It's like the second you pull open the door, you have been transported across the ocean to one of the quarters in Paris, almost expecting to be greeted with \"Bon Soir\" instead of \"Hello\". There is soft music playing, french posters lacquered onto the wooden walls and little tables scattered about.  I was a happy girl,as my love for all things French was being met.Our server, Mark, went out of his way to make sure we loved this place as much as he does, from showing us the intimate patio out back, to explaining the limited late night menu to heping us navigate the specialty cocktail menu.  We put ourselves in his competent hands allowing his to choose our drink (some vodka concoction with Earl Grey tea, delicious!) to crepes for two (a wonderful ham and cheese to nibble on and a sweet strawberry crepe for dessert) and he even made our night just that much more special with a little champagne.  It was the perfect ending to what had already been a lovely evening!My friend kept suggesting to me that we needed to come back when it is busier as the hustle and bustle, as he described it, really brings the place to life.  Maybe we can show up on a Tuesday night when they have half price bottles of wine . . But in my mind, this late night stop, filled not only our tummies but our souls.  And as we walked hand in hand across the street, I swear I saw \"la tour Effiel\" in the distance and heard Edith Pilaf crooning \"la vie en rose\" in my head.J'adore!"], ["Anna L.", "Still the best onion soup around in my opinion.  Enjoyable cocktails. Best of all, a real bargain."], ["Natalia K.", "I came here again recently after years of not having been and tried the chicken and mushroom crepe for the first time. I should have stuck with my go to chicken, goat cheese and tomato crepe, because this one wasn't to my liking. I still cleaned my plate because I walked 3.5 miles to get here and I was starving, but it was way too heavy on the cream. I wanted more chicken and more mushrooms. The mushrooms are simply spooned on top rather than in the sauce, which might have taken away from the creaminess and been a better meal overall. We shared a banana sara crepe in the end, because I am no longer as gluttonous as I used to be in my younger days and didn't want a dessert one just for myself. My waistline can't recover from such indulgences anymore. It was delicious and redeemed the restaurant. If I come here again, I think I will either have my goat cheese crepe again, or just a dessert one."], ["Shweta S.", "This is supposedly the oldest crepe place in US! Located in Lincoln Park/Lakeview area, its a very cosy, romantic restaurant with the walls covered in French posters. Oh, and did I mention they have an outdoor seating - perfect during summer time! I tried their Ratatouille (savory), Suzette á la Germain (sweet) crepes and they were absolutely delicious. Also their Java coffee was really good.Would definitely go back again!"], ["Adam A.", "Great experience.   Dropped a little since it re-opened.  Still good ."], ["Rits M.", "Pretty good place for brunch. I got the complete crepe and it comes with the egg in the inside. I think tho that I would prefer the crepe and egg and bacon separately since the crepe stays crunchier that way.  there is a good amount of butter in the crepe- makes it delish! And I would get mimosas here. They are light and not too heavy on the booze. They also have cocktail specials that are seasonal. They open about 11 for brunch so if you come by 1130 there usually isn't a wait"], ["Gabby R.", "French Onion soup and a Fosters Sara Crepe. Soo good! We come here all the time after going to the movies because you get a free chocolate crepe if you show them your ticket. Our server Jeremy is always very attentive and cheerful!! The atmosphere is also cozy without seeming crowded. Will always be one of my favorites in Chicago!"], ["Paula P.", "My sister and I stopped by on a Tuesday night and ordered the La Noix de Coco as well as the Suzette la Germain. The first was filled with a spread of Nutella and toasted coconut, extremely sweet. The second had pretty much no filling at all - however, it was nice and buttery, soaked in a mixture of orange and Grand Marnier. When combined, they balanced each other out pretty well, as the La Noix de Coco was just too sweet to eat on its own. I will definitely come back to try the other things on the menu, such as the Escargot, perhaps other crepes as well. The look and feel of La Creperie was utterly French - very cozy and romantic. I loved the atmosphere and can definitely see myself dragging my boyfriend and friends next time around. Professional, prompt service and subtle French music playing in the background made this outing a very enjoyable experience :)"], ["Tim S.", "I finally have had a meal here after so many visits back in the 90's for wine with friends. It's an institution, so much so when they tried to close it and retire back to France they were not allowed... well not exactly prevented from leaving just had a change in title but the menu, front of house presence, and chef are the same. Availed myself to some Soup a l'oignon gratinee, Boeuf bourguignon, and split a chocolate crepe for dessert. No complaints here, perfect place for a quick meal before a visit to the Landmark Century Theater. Do yourself a solid though, while we did get seated and they accommodated us well I would call and make a reservation before heading there in a weekend."], ["Sarah C.", "So surprised!This looks like a tiny little storefront on Clark, but I was very surprised to see how big it really is. My boyfriend and I went in before a movie across the street late Saturday morning. When I walked up to see that the place wasn't crowded in this busy neighborhood, I'll be honest, I was skeptical. Come to find out, this place is HUGE! There is the front dining area next to the bar, the back dining area, and then a great patio! It was like the never ending building. Of course, the back patio was full on such a pretty day and my skepticism was put to rest. We were both tired that morning, so we opted out of booze and went for their cappuccino and we were not disappointed.  We did see other people get drinks and I really want to go back just to try them. They looked so amazing in their elegant glasses. I failed the girly test and didn't get the nutella crepes. Instead, I went for the poulet au curry and it was really tasty. I would have loved a little more flavor from the curry, or maybe punched up in flavor another way, but in general it was very good. My boyfriend got the bouf bourguinon and I was actually jealous of his dish. It was absolutely delicious! It was so good that I was silently bummed that he didn't get too full and I got to take it home for left overs. All in all, the place is charming, the food is great, and the waitstaff was very sweet. I will deifintely be back."], ["July H.", "First of all, they stay open pretty late. Up to 1 am, I think. So I'm liking them already. Anyways, the ham & cheese crepe and Nutella crepes are delicious. Do not order the snails. They're not bad, but you'd be better off buying something else with the money. The Grey Etoile cocktail is a slice of heaven. Overall, they're quite expensive. But they're a great place to take your date."], ["Sadia H.", "Visiting Chicago and hydrate this place has the best crepes. I enjoyed the savory crepes but the sweet banana chocolate peanut crepe was terrible! It tasted like salty peanut butter! The caramel crepe was nice but I didn't see what all the hype was about? They make good crepes not great."], ["Greg F.", "We mostly came across this location randomly and I was very excited by what we got! Not just a place for crepe, but a seriously legit french restaurant that features a variety of savory and classically sweet crepes. I would suggest both the chocolate and beef bourguignon crepes. (not eaten exactly at the same time of course)"]], "Maude's Liquor Bar": [], "Cochon Volant": []}