{"Dawali Mediterranean Kitchen": [], "Kurah Mediterranean": [["Connie Y.", "I had been craving some good Mediterranean food for a little over a week and was looking for a place to go to for a farewell dinner with some friends who were moving out of Chicago.  Had seen this place before a few times riding on the bus and saw that its reviews were pretty high so thought - perfect!  The service was pretty good and I loved the ambiance of the place with the decor being very unique from most other restaurants - it is lovely inside.  As for the food however, overall, it was only okay.  We ordered the falafel, spicy hummus, biryani, lamb and beef rib-eye kabob platter, and the lamb and beef shawerma platter.  The lamb was pretty dry as I thought that they were overcooked, although I did enjoy their chunks of beef.  The vegetables that the platters came with weren't cooked all that well and the rice (even though it's just rice), was only okay as well.  I was really looking forward to finally having some falafel since I hadn't had any in awhile.  They too were only okay.  They were a little harder than I would have liked.  Their hummus was good as well as their pita bread which was soft and warm upon serving it to us.  Basically, we had a whole lot of rice despite having ordered a lot of food for the five of us.  I'm afraid that the food didn't live up to the expectation."], ["Avery V.", "Kurah is a great small plates find in the area. Perfect date spot as the atmosphere is very cozy. You can usually walk in on a weekend if you have a small party but might want to make a reservation. The bacon wrapped dates and ceviche are two of my favorite apps. Everything I've had on the menu is seasoned very well. The service in the restaurant is great too! They give good recommendations and don't rush you. The only negative is that they don't have a double door so it's pretty cold inside in the winter from the door constantly opening."], ["Colin W.", "Bacon wrapped dates, hummus, mussels, etc. OMG! Everything was excellent!! The downside was that we were in town for a work convention (all 7 of us) but they would only allow us to use 4 credit cards. Our employer is kooky about expenses. This put a damper on the evening."], ["Comensal A.", "When I last visited Kurah a little over a year ago, I thought it was OK, but maybe needed a little more time to work out some kinks. The concept seemed promising, so I was eager to give it another try. Sadly, things were no better -- in fact, I liked it less this time. The décor is charming, but the food was hit-or-miss and the service lacked any sort of polish.On our last visit, we especially liked a complimentary starter of pita served with olive oil, za'atar and olives; this time, it was not complementary and was way too salty. We ordered two share plates -- beef & lamb shwarma was tasty but quite gristly; maldoum was tender & flavorful, though the somewhat mushy couscous could have used more seasoning. For dessert, we had a fig & pistachio phyllo purse; we liked it last time, but this time it was dry and very chewy.Service was a letdown in that only one server seemed knowledgeable and attentive -- others lacked any hint of grace or polish (language/culture issue?, lack of training?). Another flub was that an umbrella stand in their outdoor seating area was pushed up against the side of the building adjacent to our indoor table, and was banging against the window due to the wind; when we brought this to the server's attention, we got a shrug, but he didn't seem to know what to do about it.I won't be back. It's a shame, since the dining scene in the south Loop is so dismal (as bad as Hyde Park, in fact)."], ["Basia U.", "Cute, cozy place perfect for a romantic date or just a casual lunch. Small delicious   plates great for sharing and the food quality is better than I expected. Our server was very helpful and friendly. They offer amazing wraps for lunch specials at reasonable prices."], ["Julia K.", "Beautiful ambience and excellent service. The taboulis are to die for. And they always have sangria! I bet the upstairs would be perfect for private parties."], ["Lauren G.", "I love this small neighborhood spot! The space is inviting and intimate, and service is very polite, efficient, and helpful. By far, my favorite item I have tried is the spicy hummus. This is not your average hummus - the spice is unreal! The falafel is also nice - they're smaller sized falafel, and taste fresh. In one visit, my table also tried the Middle Eastern cheese flatbread, which was decadent, totally unnecessary, but delicious all the same. In other visits, I have tried the tabouli and the ceviche, which were decent but not my favorite. As far as main plates, I've only tried the chicken kabob plate, which I remember tasting fresh and delicious. I have yet to be disappointed in the food! At each visit, my table has ordered carafes of sangria. While the red sangria tastes like your average sangria, I suspect it must be pretty full of juice or whatever they use to make it, and not too full of wine. I always expect to feel a little buzzed, but always end up just feeling full of sugary juice. That said, I have yet to go to Kurah and not order sangria so...Overall, great experience. Keep up the good work!"], ["Hiroki K.", "Pretty meh. Mediocre food for the price. Also, my waitress kept disappearing. I liked some of the decor (e.g., the upstairs area) but other parts of the restaurant weren't decorated enough, making it feel imbalanced."], ["Saahithi G.", "One of those randomly yelp find of mine for a spontaneous dinner with friends on a Saturday night. The moment I walked in, I felt I walked into some ethnic middle eastern world. Took a long half an hour wait although we had a reservation. We ordered almost every dish on the first page of appetizers. Falafel was great tasting, and the best hummus I ever had. My friends rated the bacon wrapped dates and lamb chops are finger licking good. Few of the bad choices were the squash and the stuff grape leaves. I recommend not even both to taste them. Almost forgot, the mussels are a plus as well. Spicy potatoes are nothing but tiny fries but tasted good."], ["Shannon S.", "We went on a Saturday for lunch and were the only people there... for the whole time.  I expected that the place would fill up but nope.  Not a soul.  Weird.  The interior is super cute, new, modern and clean.  I really liked it.  The bar looked nice and the industrial drop ceiling was covered in Edison bulbs - really funky, Chicago vibe. But, the food.  It just wasn't there.  The hummus was better than average.  Not great.  Better than good.  The tabbouleh with pom dressing - no.  I shouldve known better.  That dressing shouldn't be on anything. Ever.  Get rid of it.  If you want to add pom to a menu item, add pom seeds.  we had one bite each.  The bacon wrapped dates were sweet enough to be dessert.  The pita was delicious.  The wrap was gigantic (another high point of the meal). It was definitely worth the $12 because 2 of us chomped on it and took 1/2 home. The mussels were full of sand.  All of them.  And that's sad because the sauce was good.  Oh, and my water glass was dirty and the server saw it but filled it with water anyway :( I think there's a lot of promise.  There was another gentleman working and I think he was the owner - he seemed highly invested and he was very nice."], ["Ahmad A.", "this restaurant is not that good , and it's very expensive, they serve 4 pieces of Kupah for 12 USD !!"], ["Johnny A.", "Holy smokes! This is THE BEST of the best Mediterranean spot ever been to! If your in the area definitely stop in, totally worth the time! Fairly priced, stellar service & the best chicken schwarma wrap & hummus!!' A two thumbs up five star kinda place!"], ["Miriam S.", "I visited Chicago for a week (business and pleasure) and had so many ridiculously delicious meals. Unfortunately, this one was probably my most disappointing. I love Mediterranean food and this place looked like a modern spin on some of my classic Arabic favorites. I ordered the waiter's recommendation of kebbah and the fattoush salad. Both missed the mark. On one hand, they weren't close enough to the traditional version, but on the other, they weren't far either enough to make anything delicious and modern. So disappointed! I don't understand all of the good reviews here."], ["Matt H.", "We live in the neighborhood, and Kurah is in our regular rotation for take out or random dinners when we don't feel like cooking.  It's a good change of pace when we're in the mood for a warm meal that's not pizza or Thai/Chinese.  The dining area is nice and airy with vaulted ceilings, and they have one table for 6-8 people in the back corner has the feel of a private dining room (though note that it's bench style seating without back support in case that's a problem for people in your party).If you walk down 14th, you can peek in the window and see the kitchen, and they have a small outdoor dining area along 14th in the non-winter months.  We've tried most things on the menu and have yet to find something we didn't care for.  We keep coming back!"], ["Mary K.", "I ordered takeout here and the food was delicious --I had a kibbeh and flatbread and my friend had the beef skewer. I look forward to dining in here."], ["Joel R.", "Great tapas place, would highly recommend sampling the small plates. The house made cocktails were very fruity and delicious. Service was fast and friendly."], ["Anil P.", "Absolutely enjoyed the food. Great service. Nice ambience.Went here for lunch because Yelp said it was good, and sure it was great."], ["Jamal Z.", "This place is really good. I loved the flavors in the food at Kurah and the food was very authentic. I ordered the hummas and kabab and loved both. The ambiance at the restaurant is surprisingly nice.  I have been to almost every restaurant in the south loop and this was easily the nicest looking one. Very classy looking."], ["Dimple M.", "Good food and easily accessible by the L."], ["Janelle C.", "The food and service at Kurah is excellent! The dishes are so flavorful and unique. We especially loved the Biryani rice, beef dumplings and quail. I loved that hot tea service came with refills. Our server was knowledgeable about the menu and very attentive. The dining room is chic and comfortable. I'll definitely return."]], "Roti Mediterranean Grill": [["Anamaria H.", "Roti Mediterranean Grill is as Mediterranean as Taco Bell is Mexican. I have standards for my Mediterrranean food - this place didn't live up to those standards. I think my main issue with this place is that everything is preprepared and sitting in mettle warmers like how they do it at Panda Express or Chipotle. Nothing is freshly made so everything tastes a little old, a little overcooked, a little bland. I ordered a wrap with chicken and basically everything else and just found it disappointing. The flavors you expect from Mediterranean food were just not there. It tasted like a normal sandwich. The hummus was no better than the generic hummus you can get at the grocery store. I guess if I was a professional always in the area I would value this place for it's fast service and it's uniqueness (meaning it's not a Panera, Corner Bakery, McDonald's or Chipotle). And if you haven't really had Mediterranean food before you would probaby find the $10 meals a great value. But I've been to better places for cheaper and I don't work in the Loop so you definitely won't find me here again."], ["Bitty L.", "Love this place! My chiropractor is right down the street so I always go here after an adjustment. Everything is fresh & healthy, quick service, good price, not stingy with the servings. I wish there was one in Lakeview. Love the chicken roti salad! Delicious! Employees are friendly & efficient."], ["Daniel S.", "I've been here twice now, I got the chicken sandwich and a side of falafel the first time, and then the steak rice bowl the 2nd time, i enjoyed it each time, i admit idk too much about mediterranean food but i had no complaints, a bit cheaper than naf naf, the other mediteranean chain in downtown chicago"], ["Sarda P.", "This is the Chipotle of Middle Eastern Food. The restaurant was clean and the staff was friendly. The food was flavorful but over all okay....all the food is kept cool, so nothing u eat will be warm. I ordered the rice place with falafel as my protein - I got 3 sides/topings with it and 1 pita bread. I took the cucumber & tomato salad, couscous and eggplant curry. And also took addition sides of onion and hummus which were 50 cents each. The Falafel was unique since they don't completely mash the chickpeas. Compared to other express cusine like Chipotle, Piada - found this to be okay ...maybe worth trying once but nothing I will crave!"], ["Jennifer H.", "This Mediterranean chipotle like-chain is very good. Fresh and delicious ingredients, with good sauces that make it stand out. Yummy and healthy. The falafel could be improved- too greasy when we were there.  Wish we had this back home in Ohio. Would like to add the manager at this particular location is super nice and professional."], ["Jamie B.", "Now this is what lunch in the loop looks like!Fast, quality tasting and fresh, happy employees and cha-ching!! A meal under $8.  New Roti fan here!"], ["Emily R.", "I have to start off by saying I am a huge fan of Mediterranean food. This restaurant is kind of like the Mediterranean food version of chipotle. You have a ton of options of what you want on your plate, sandwich, or salad. They have a huge variety of sauces, meats, and toppings. The employees are also really great. If you are skeptical of the food they are more than willing to answer questions about how spicy the sauce is or what the falafel tastes like. It is difficult to say whether I like Naf Naf or Roti better. I think I like Naf Naf's pita's better, but Roti has a bigger selection which is better if you are picky when if comes to your food. Overall, great experience with great customer service."], ["Jeff F.", "I'm addicted to the steak rōti in a laffa wrap with couscous, feta, and olives. I love it. It's different but not crazy, a nice break from the saturation of sandwich joints right up the street.The service is quick, and the lunch rush is no exception. It's set up like Blackwood BBQ up on Lake (another spot I highly recommend). You can get in and get out without much of a fuss; the line moves quickly because you order your food and toppings as you go.It's a great spot when you want to break up the monotony of the common restaurants in the area."], ["Jess Y.", "For a fast casual place to grab a tasty bite under 10 bucks, I was pleasantly surprised at how good the food was. I had their Sultan Sandwich - chicken (grilled?) with some delicious spicy sauce (you can choose to nix this if you're not a spice fan), hummus, tomato and cucumber salad, lettuce, and red cabbage slaw. They also have other dressings you can add, like dill yogurt or tahini. Note I ate this pita \"sandwich\" with a fork - it's one of those places where they layer things so if you want even tasting bites, you have to mix it up yourself. The pita bread was soft, moist, and denser than I expected. Chicken had great flavor, possibly due to the spicy sauce. Veggies looked and tasted fresh.Extra points for happy hipster background music - Passion Pit, Coldplay, Ben Howard - this was my first time at a Roti and I wouldn't hesitate to go back."], ["Meg S.", "One of my favorite lunch spots in the Loop.Food is always fresh, flavors are consistent and and unique. Service is always friendly. And it's never that busy. I always order the chicken kabob rice plate. The portion size is pretty decent and the prices aren't bad. It's a great place to try out if you're in the area."], ["Kendrick W.", "Roti is pretty solid.  All of the food tastes fresh and everything is well flavored.  They're a little stingy with the meat, but other than that, I really have no issues.  However comparing them to some of their competition like Naf Naf, I think they might want to be a little more generous.  It would also be nice if the pita was warm."], ["Kenneth Y.", "good for lunch at work. The portion size is great and nothing short of cutting you out of the picture with the food. I liked my dish and the pita pocket that came with it. Overall a place to grab lunch that is filling and successfully satisfying to a certain extent."], ["Austen H.", "Great place for a quick lunch. The Mediterranean equivalent of chipotle. Very good hummus and chicken and a very friendly staff. If you get the salad you get as many sides as you want whereas you only get three with the rice bowl."], ["Dave M.", "WOW This place is a powerhouse factory that pumps out orders before you can even think what you are going to order. FAST FAST food that is very tasty"], ["Shawnee M.", "Looking for a fast healthy option for lunch while traveling in Chicago. Boy did we hit the jackpot. This place was delicious. Generous serving of food and so so tasty. The hot sauce is actually very hot - a major plus for me. I fell so in love I found another one to go to when traveling to DC for work. Really wishing we had one of these back home in philly!"], ["Lyndsey M.", "One thing I didn't expect coming here is that it's a fast food joint. Think Qdoba or Chipotle with Mediterranean food. That being said, it was very tasty.I had a rice plate with veggies, hummus, cous-cous, tomato-cucumber salad and pita. It's a ton of food, and I didn't even come close to finishing mine. The cous-cous was my favorite. Kinda sweet with raisins. I would have liked a bigger piece of pita. My S.O. had the beef & rice plate and enjoyed it. Pretty affordable and yummy. I think ATX needs one."], ["Melissa F.", "So good. I like a nice healthy chicken lunch or dinner but hate bland chicken. This is not a problem at Roti. The other ingredients are also delicious and packed with flavor, like the olives and the creamy hummus. The spicy sauce (schug?) is not mind-blowingly spicy, but it's very good nonetheless. Also, I was pleasantly surprised to see that this Loop fast-casual restaurant is open until 9pm. I expected it to be closed around 7pm last night, so I was in for a treat. :)"], ["Jason G.", "We went here last night for dinner after visiting the Christkindlmarket. The food was excellent.  Our only disappointment was that we received a very unwelcoming greeting from the female manager...she could have cracked a least a little smile...I mean it is the Holiday season!  As we had our two little ones in tow, I was happy to see all the extremely healthy options (nothing fried!) and the remainder of the staffers were very pleasant and helpful...this was our first go round.  It is reminiscent of a Chipotle where you select all of the options as you move down the line.  For $7.99 a plate, it was a steal!"], ["Vince L.", "Ok, so it was late and I was getting hungry.  This place got OK reviews so I thought I would try it out.  When I went I was 1 of 4 people in the place (not counting the workers).  I don't look at that as a bad thing but as an opportunity to talk to the staff.I asked the young lady behind the counter to help me pick out something tasty and unique.  She suggested a mix of the chickens and a bit of ALL the toppings.  The only sauce I added was the cucumber based one.  She was a hoot to interact with and it seemed she, as well as the other staff folks there, liked working there or at least with each other.The place was clean and empty so I got to sit where I wanted - by the window.  I love people watching.  I cut my wrap in two to get a good photo and the stuff just started falling out.  The flavors were wonderful .  Not to spicy. Not bland at all.  I ended up needing a fork to get all the stuff that fell our.  Didn't want to waste any of it! Yum!It sort of reminded me of Qudoba but with a Mediterranean flair.  They don't have these in my home town but if they did I would  be going there."], ["Martin P.", "The service is fantastic and lovelyThis is like chip tole for Mediterranean food. I recommend the rice plate with the chicken plate.The red sauce or s'kug sauce is saucy good accompaniment. Try the grilled vegetables and tomato-cucumber salad to even out the taste palette of plate."]], "Troy Mediterranean Grill": [["Brandy K.", "I love, love, love this restaurant. The food is good. The service is great. It's BYOB. And now I'm totally in love with the owner--we were out late, stopped in for dinner, stayed a lot longer than imaged and he was nice enough to escort us (with a baby in tow--don't judge :)) back to our cars. Talk about going over and beyond for your customers! A little kindness always goes a long way, and this really made our day. This was my second time dining here and it def won't be my last."], ["Mike S.", "I ate myself stupid here.  Seriously--I tried to stop eating but I couldn't.  ANd I just kept ordering more--that's how good it was.  AMAZING food, inexpensive, great atmosphere, super friendly owner, and BYOB.  It doesn't get better than this.  Lakeview is in desperate need of more restaurants like Troy.The food was insanely fresh, and I couldn't believe the prices given the portions.  Everything including the bread is all handmade and as good as it gets.  I don't normally seek out Turkish restaurants as usually my default \"go-to\" restaurants usually some sort of asian, but man am I glad I gave this a shot.The haydari appetizer is very light and goes great with the bread.  I then shared a combo platter of kebabs that were all very flavorful, and we also had a beyti kebab.  GET THIS.  The beyti kebab has this great lamb filling, but it is wrapped in a very thin fresh dough type rap with a sauce on top.  It almost looks like turkish sushi the way it is cut and prepared.  So good.For dessert, you simply must, must, MUST get the kanafeh.  Picture two thin layers of a crispy, crunchy pastry noodle pancake with mozzarella in between that is then baked with a syrup poured on top and pomegranate seeds as garnish.  I have eaten a lot of very unique tasting food in my life, but I have NEVER had anything like this.  Ever.  I don't care how much you eat or how you \"aren't really a dessert person.\"  If you come here and don't order this you have just missed out on an amazing life experience.So that was the food.  The service was great, and it truly has that \"mom and pop\" local feel.  There really aren't a lot of places like this any more, and it is a real shame.  Everyone was so warm, and when it was the birthday of someone there, the owner turned off the lights, and put on birthday music while the dessert came out with a candle in it while everyone sang.I'll be going back and bringing anyone I can.  Do yourself a favor and go here before it gets more press and becomes impossible to get a seat at."], ["Kelly F.", "Have been here several times with a girlfriend and also with my sweetie and have always enjoyed the food and the service.  Their lentil appetizer that they bring you is amazing and is offered for free -- it is so good, I went ahead and ordered a larger dish, gladly paying a few dollars for such great food.Go with someone whose company you enjoy with a leisurely bottle of BYOB!"], ["Max C.", "Remarkable! Superb, nutritious, delicious foods. Plenty of vegetarian and also gluten totally free possibilities! Great assistance plus a wonderful chef/owner that arrived on the scene to confirm people too. Even enjoyed Pleased Wedding once they determined there were any birthday young lady with us.Everything has been fantastic. Don't skip that position."], ["Jane S.", "My boyfriend and I have walked by this place a dozen times and have never noticed it until my son picked up one of their menu's (good taste runs in the family apparently :)). From the first time we went here I was incredibly impressed. The food is good and authentic. The ambiance is pretty romantic, especially if you ask for the table at the window & bring a bottle of wine (it's BYOB). The place is pretty small and if you don't want to wait for 30-60min, a reservation is absolutely necessary. The service is excellent and for the most part you see the same people serving & taking orders (all very friendly). A few of my favorite items of the menu are hummus for appetizer and this eggplant-lamb dish (don't remember the name but it's the only eggplant-lamb dish on the menu!). Their house marinated kabobs are amazing as well!! I will definitely come back to this place again and again and it is on my permanent favorites list."], ["Tim W.", "We live right across the street, and were a bit leery of this place, but it couldn't have been better!  The food was delectable, cheap (for the neighborhood), and BYOB with no corkage!  They don't play it up, but it's actually a Turkish restaurant, which for me was a selling point; I've had Lebanese and other general \"Mediterranean\" food before, but this was slightly different.  The appetizers were great, and the food was delicious.  Definitely check out Troy, the food is really worth it."], ["Arjun M.", "Everything about this place is great. Great food, great wait service, great music, great prices and it's BYOB. I really enjoyed the: Filet Mignon sish kebabTroy Pizza appetizerAverage dishes: Falafel Sliced Tomatoes and Mozzarella Will it blow you away? Probably not but you will have a worthwhile meal here. I'll be coming back frequently."], ["John T.", "Great food, great service, great people. Best Falafel I've ever tasted. The chef came out to talk to us -- definitely a guy who is doing what he loves. I will go back soon!"], ["Jonathan H.", "Probably the best med food you can get in lakeview.  Troy does not disappoint.Also, prepare yourself for the persian disco music.  A nice touch that makes you feel like you arent in Chicago."], ["Barri S.", "Good food, great for sharing. Everything was delicious and good service."], ["Daniel C.", "I haven't been this pleased with dinner since a charming little restaurant on IBIZA's coast.I've been here twice and both times had amazing food.  The first time was with a group of friends for a birthday.  Excellent service and everyone raved about how good the food was.  Was there again last night and sure enough the food was excellent.  If you're looking for great food, great price and good atmosphere this is it.Will be seeing this place again soon."], ["Andy A.", "This place gets better every time I eat here. Friendly staff with amazing and authentic food at really reasonable prices. Love it!"], ["Curtis H.", "Ate here last night with a friend on a Tuesday and had a very nice time. The restaurant was small and quiet. The server was very attentive. We ordered the cold sampler platter which was quite yummy. We shared the beef/lamb and chicken kebobs. You get plenty of food, and the meat was tasty and well-seasoned. Overall a nice place for the price and worth a visit."], ["Lb I.", "Came by a couple times and the food is great! One of the top Mediterranean restaurants in the city and is definitely a spot to grab lunch or dinner at.  Waiters and owners are very nice people.Recommendation- The chicken kabob plate. Well cooked and the rice tastes amazing."], ["David S.", "WOW! Went Wednesday at 6 and had the place to ourselves. Best Turkish meal I ever had. Lamb shishkebob med. rare and bulgar wheat. Excellent yogurt and cucumbers.BYOB. Very reasonable.Wonderful place to eat before Timeline Theater. Everything is prepared to order.Try it or it won't be there for long."], ["Amanda C.", "Great BYOB place with awesome food. I went here with a group but it would also be a good date spot.  There were a few groups there for birthdays who were serenaded by the staff and brought desserts.  The restaurant is pretty small, and warm and inviting. I like the exposed brick and was surprised to learn they only opened in May since they seem well-established.We had the hummus to start, which was awesome, then I had the lamb skewers which IMO was the best thing out of the group. They were so good! Served on rice with a side salad and plenty of food for leftovers.  The servers are very helpful in making sure your drinks are always opened. I would definitely come back here!"], ["Alexa M.", "I very much enjoyed the food, but the service was ok... server forgot to put in one of our appetizers orders and my boyfriend practically had to go to our server to ask for a water re-fill. I would still check this place out one more time since the food was delicious, but the service definitely needs to be improved."], ["Joy E.", "What a great find! This is a wonderful place  where the food is delightful (as my elderly father termed it) and the decor was welcoming. I would recommend it to those wanting to try Mediterranean cuisine for the first time as well as those with a seasoned palate. Chef Apo stopped by our table to meet and check if we liked the food - a nice personal touch that seems more and more rare. Worth visiting!"], ["David B.", "I live across the street from Troy and it is one of my favorite places in Chicago.  There Lahmacun (Troy pizza) is one of the best I have ever had.  My family has a favorite restaurant that we always go to in NYC called Turkish Kitchen, the lahmacun at Troy was better.My mom came to town and was blown.I love this place. Go if you have the chance!"], ["Mindy S.", "I know what you are saying to yourself: \"How can the first 3 reviews of a brand new business all be 5 star reviews? These people must work there\"While I cannot speak for the other 2 reviewers ahead of me, I do not work there - but my 5 star review is sincerely written! I have a fancy for authentic, Mediterranean food, local establishments, and excellent food.Troy Mediterranean Grill fits the bill! I am very excited that it is in the neighborhood, as I see myself picking up dinners here often.  The food was wonderfully seasoned, and the portion sizes were spot on.I sampled the cold eggplant appetizer, and it was delicious.  The lentil soup was nicely flavored, and very light.  The shepard's salad was yummy as well, with just the right amount of flavors, olive oil, and proportions of tomato, cucumber, onion, and I think parsley.  The Troy Pizza was superb - think thin pizza with ground lamb.  Top it off with their homemade tzaziki sauce and you have a winner!! The lamb kabobs were excellent, and I recommend 1 kabob per person.  And finally, after all of that food, I still had room for their homemade rice pudding dessert - soooo good!!Bottom line - Troy Mediterranean Grill has fresh, homemade food that is sure to win you over.  Check them out!! Bring your favorite bottle, as they are BYOB."]], "Old Jerusalem": [["Nish R.", "Stopped by for a lunch on a weekday. So the palce was pretty empty. Seemed like a no nonsese kind of a place. Food came amazingly fast. I had the Veggie combo and a fresh carrot juce served with lebonese bread. Food was really tasty.Service was a little business like rather than friendly but it was very efficient. So no complaints here."], ["Rachel R.", "Excellent food. The Greek salad was absolutely perfect from the freshness of the produce to the light, yet tasty dressing. The falafel was wonderful as well. The only con was that delivery took nearly 1.5 hours and the lady who answered the phone when I called to get an ETA wasn't very friendly (although the lady who delivered was very sweet). Will try dine-in next time, but will definitely be back."], ["Shan D.", "Thought everything was just average. The falafel is overcooked, and the hummus is just bland.  I'd look elsewhere if you're craving middle eastern food."], ["Neal N.", "Amazing food, amazing service! The best middle eastern food I have ever had in my life."], ["India B.", "Very impressed with Old Jerusalem. We ordered in, so I'm sure it would be better if we ate in the restaurant. The tebouleh, feta cheese,  vegetarian combination platter, and shawirma  were good. We will be back!"], ["Sid P.", "Ordered the lentil soup and Musaheb. Lentil soup was great but the Musaheb was meh! Chicken was really dry"], ["A C.", "Their chicken with hummus  is good, and pita bread is fresh. I like the coffee as well."], ["Son N.", "The highlights include hummus and baba ganoush (both contain just the right mix of spics without having one overpower others), tabouleh (salad-like and not soggy like at many other joints). The entrees don't stand out as much, but most people will like the generous portions. If you like desserts, their kenafeh is da bomb. Last but not least, patio seating (summer is coming!).What could be improved: the room-temperature pita and inconsistent service - I suppose it comes with the territory of running a mom-n-pop establishment in the high-traffic Old Town.Recommendation: give Old Jerusalem a try. For a casual date night or a group dinner over decent Middle Eastern fare + BYOB wine, you could do much worse than this homely restaurant."], ["Alicia D.", "Really great food! Quick delivery- about 35 minutes. Quality stuff. I found my new place!"], ["Larry L.", "We had many options in \"old town\" but picked Old Jerusalem.  What a treat!  The falafel plate is excellent and the lamb too!  The family run restaurant is like being at home with welcoming hosts and friendly service.  We dined, had great conversation and could bring our own wine!  Do not miss this jewel!"], ["Jennifer P.", "I'd rate it as 2-3 stars. Service was okay, nice people but not great service-wise. The food was fine, but I've had a lot better. The price is what brings this place down. Its quite expensive for the food quality."], ["Katherine G.", "After having friends recommend the place for some time I finally gave this place a try. My dad was in town from the burbs so I dragged him along for lunch. I was expecting slow service,but we greeted its as soon as we walked in, and the service remained attentive it entire visit with it making us feel rushed.We split the an appitizer and then we both got sandwiches. Everything was flavorful and not over or under seasoned. We both enjoyed everything and we'll likely be back. For the food I would likely go 4 stars, but factoring in the price it gets bumped to 5. With tax and tip it was under 25 which can be hard to do in the Gold Coast/old Town area. Not much ambiance, but I am okay with that for solid food and service."], ["Kymberly J.", "I've been here a few times and have always been satisfied. This place has some of the best lentil soup around. It's so comforting on a chilly Chicago day! I take a star off because the service is so very much served without a smile. And not in a mean way like I want to stiff her tip, it's more like in a sad way. I feel sorry for the woman who is always my server. Maybe it's because she is never allowed a day off but there is something about her that makes me feel like she might not want to be there or she is overworked. Anyway, lentil soup, tabbouleh salad, falafel sandwich, whatever you get you wont be disappointed."], ["Emily J.", "Great spot for lunch in Old Town. It wasn't crowded at all when we went and the food is tasty. Its like a second version of Mona's in New Orleans - which I used to frequent when I lived there."], ["John G.", "good byob spot, i enjoyed the apps & the lamb was excellent. friendly service too!"], ["Peter C.", "Definitely could have been better. I had my expectations high from previous reviews and the traditional ambiance. To start, the bread was cold and my yogurt appetizer was watered down.  Had the shawarma plate for a main. The meat was dry, and the rice and lettuce that came with tasted store-bought. The tabbouleh was the saving grace. Not too grainy, with a nice onion flavor."], ["H. V.", "Quick delivery service via GrubHub. Service in restaurant is slower than it should be (especially for premade items ie:hummus), especially when the weather is warmer and they have the outdoor seating. I will say: I keep trying their delivery and every time something is off. This time it was hair in my tabbouleh :( But. When the food is on, it's on!"], ["Rick T.", "Pret-ty, pret-ty, pret-ty, pret-ty good.Standard fare. Well prepared. Family run. Eat in to watch as the the family members wander to and fro, seeming to multiply from a mysterious room beyond the doorway at the back of the dining room. Waager with friends on how many different people will enter and emerge from the mystery room during the course of your meal."], ["Steve M.", "Solid chicken schawarma sandwich as well as entree.  The chicken is juicy and spiced mildly - none of that over-the-top turmeric seasoning here.  Tahini sauce is creamy and mild as well.  This is good stuff.  Delicious hummous too.  The proprietors are some of the nicest around too.  All of the ladies are friendly in that \"stern but nice grandmother\" kind of way.  Do it."], ["Sarah P.", "Lentil soup. That's all I ordered and all I was craving the entire day. Old Jerusalem has some good lentil soup. They are located in the Old Town neighborhood in Chicago. Their prices are very nice given it's in the city, and they offer outdoor seating with an awning overhead so you can sip your soup outside while it's raining."]], "Zachi": [], "BenjYehuda": [], "Zaytune Mediterranean Grill": [["Xi Z.", "Got so much good food here for a decent price!I ordered out on a Sunday evening and boy am I glad I did. I was craving lamb and very purposefully ordered a braised lamb wrap with a side of herb fries. It came out to a little over $10. The service wasn't too friendly but not rude either, short and succinct.I got my number and waited at one of the tables. Most of them seat 2 and there's quite a few. The wait was around 10-15 minutes. When I picked up my order, I was surprised at how heavy it was - they definitely aren't stingy with portions. The wrap was close to the length of my forearm. I'd say the best part was the flatbread, grilled to perfection and oh so soft. I may never go back to hard, tasteless burrito wraps. The lamb was the perfect texture, but not the most flavorful. Maybe a little salt would have helped; I applied the spicy sauce it came with liberally. The wrap was well-balanced, the crisp veggies setting off the soft flatbread and lamb delightfully. I also have a problem with Mediterranean wraps getting too soggy towards the end, and happily did not have this issue with my Zaytune's wrap.In my humble opinion, the herb fries were disgusting. However, other reviewers seem to love them so maybe I just caught them on an off night. Mine were drenched in oil, soft and soggy, though the herb seasoning was scrumptious. I'd pass instead of risking that again.If you have even the slightest affinity for Mediterranean food, you HAVE to try Zaytune."], ["Lily Z.", "I came here with a friend on Friday and I loved it.He ordered the lentil soup and baba ganoush. I ordered the grilled kaftka wrap and herb fries. Baba ganoush - Loved that they provided warm bread to dip! I've never had it before so I can't compare it to anything else.Grilled kaftka wrap - Surprisingly large and fresh. Herb fries - Very well seasoned. Maybe a little bit too salty. Everything tasted fresh and delicious. I was very surprised that I liked everything. I'm usually pretty picky. Haha. I'm glad that I've found a closer and better version of Pita Inn."], ["Lyndon M.", "Fries were epicness. Had the chicken grill platter and it was quite good. Will get this next time I'm in the area."], ["Unknown K.", "Good food, especially the herb fries. They didn't have kafta and offered no reason why. The workers were more focused on ogling certain customers than helping all. The pita is made fresh and was very nice as were the sauces."], ["Debbie E.", "We have yet to have a bad experience here.  Great \"fast food\" Mediterranean.  The wraps are the way to go ... much better value than the platters.  My husband and I usual order one and split it.  Herb french fries are delicious!  Always nice and crispy and served with a wonderful kalamata olive dip.  Red pepper humus is also a must have.  Fresh made pita served with the wraps and humus have just the right softness and chew and hold up to the ingredients in the wraps.  Down side is the place is small and you have to clear your own tables."], ["Elaine N.", "Falafels are salty as fuck. I used to get them all the time and as of December/January, something changed in the recipe to make them completely inedible."], ["Shirley W.", "I love this place. It's good Mediterranean place close to home. Their portions are VERY filling, I'm the type of person who eats a LOT. But I can't even finish their salad sometimes because it's filled with meat. Great price great portion great food. Try their herb fries, it's awesome ."], ["Dominique R.", "Seen the reviews and decided to try it out today. They have great grilled chicken breast wraps and herb fries."], ["Yuehao B.", "This is a nice small place. Prices are reasonable and portion is good. I recommend the steak shawerma platter. The problem is that this place is not good for groups."], ["Glorinela D.", "My husband and I decided to drive from South Bend, just to try Zaytune, after watching an episode of Diners, Drive-ins, and Dives.  This place did not disappoint at all!!! We both ordered the steak Shawarma and falafel.  Everyhting was so delicious...the steak shawarma melts is delightful!!!  I highly recommend this place!"], ["Adriana A.", "I whent to the restaurant and I was pleasantly surprise by the friendly employees. I ordered falafel with tabouli salad and fries. When I sat on the table I was overwhelmed by the tasty flavor of the fries and everything else I have on my plate.   My mouth is watering with just thinking about it...Excellent food and environment. I cant wait to try the other items on the menu."], ["Sonny S.", "Shwar-ma, sha-war-ma, shar-wilma...whatever way you pronounce it, shawarma is insanely delicious and so is just about everything else at Zaytune! And I'm so glad that it's so close to where I live because I can get my middle eastern food fix whenever I want now! My friends and I decided we wanted something a little different for lunch besides the typical rice boxes from Chinatown (don't get me wrong - I LOVE those rice boxes along with a side of fried chicken wings...ooooh really hits the spot, but I digress - I was just in the mood for something else!)I've had take out and dine in and both were pretty damn good. The restaurant itself is pretty small with maybe 10 tables...maybe. The menu is posted on the wall and you order at the counter. The staff was really helpful when it came to explaining what certain dishes on the menu were and offered great suggestions. This isn't a fast food joint, so don't expect to get your food in 5 minutes. They make everything to order so expect our meal to be fresh and hot! Even the flat bread is made in house daily!Here's what I usually get: -braised lamb leg shawarma wrap ($7.75): think of the wraps as middle eastern burritos loaded with lettuce, parsley, onions, cucumbers, tomato, hummus and tahini sauce wrapped with grilled flat bread. The braised lamb leg was really tender and succulent. The portion was large enough for me to eat lunch and dinner and I consider myself a big eater. The wraps come with hot sauce as well, but I suggest asking for extra tahini too. This was my favorite!-chicken shawarma wrap ($6.75): the chicken wrap contained similar ingredients as the braised lamb, but just different protein. Pretty good as well. The chicken is grilled nicely and juicy.-falafel ($3.50): I've tried a lot of falafel and this is some of the best. The outside is a crispy golden brown layer and inside is soft and flavorful. It comes with a little hummus to dip.-herb fries ($1.95): I call these crack fries because they're so damn addicting! Paired with the kalamata sauce (purple sauce), it's a spectacular combination. I asked for extra sauce because it's so delicious. The fries come out crispy, hot, salty (in a good way) and are seasoned perfectly. This is a MUST TRY!-baklava ($2.65/3 pieces): The walnut baklava was sweet, flaky and yummy. Not the best I've had, but they're decent.There's a good amount of street parking in the area, as well as some spots in the residential area. Overall, if anything, just come here and order the herb fries!"], ["Josh S.", "They do a good job. Nice lean cuts of meat and great service. Prices are fair, would also recommend to anyone who likes to eat healthy."], ["Anuj S.", "Pretty good first experience at Zaytune.  The location is not the best and we went recently so the streets were these small side streets which were snow-filled.  I guess they hadn't cleared them yet.  They've done a nice job of building the place out on the inside.Being the first time, I didn't know which way to go, so we went with falafel platters.  For the extra $4, you don't really get your money's worth.  We also ended up getting a falafel wrap, which was much better.  All the same stuff, minus bland rice and a couple of grilled veggies on the side.  The wrap is a MUCH better deal.  Well, I'll know that for next time.The food itself was fine.  I came in with very high expectations.  With that, I think the bread could've been served warmer.  The falafel were good.  This place is good. I think it's going to be even better on the second visit with better weather and a better understanding of the menu."], ["J P.", "haven't been disappointed here. try the chicken shawarma, and ask to mix in a little falafel to get that extra yummified, over the top deliciousness."], ["Danny M.", "This place is literally about 2 blocks away from me and I have never came here until recently. I pass by this place many times and the vet I bring my dog is right across from here. I love Mediterranean food too, so I do not know what my excuse is for never coming here, but I sure do regret it. That is all in the past now because this place is yummy.I came here with my gf on a Sunday afternoon and it was kinda slow. We ordered herb fries, falafel wrap, and grilled steak shawarma. Everything was yummy and full of flavors! The herb fries is a must get. I always have a hard time deciding between the falafel wrap and anything else here because everything taste pretty good that I have tried so far."], ["Courtney G.", "There are very very few fast casual places that will offer braised lamb as a meat option...AND! At the same price as chicken or beef. With that said....GET the lamb! Its amazing and very flavorful. Restaurant was clean, service was quick, and food was delicious."], ["Char Y.", "Came after many positive recommendations and orderedHummus - ok seemed to be missing somethingBraised lamb platter - tender juicy lamb piecesBeef kebab - juice and we'll seasonedNaan - different texture from ones in the north side. Soft and grilledGood middle eastern food in a pinch"], ["Chloe F.", "My advice is to call in and order then pick up because every time I walk in to order for carry out as lunch it takes a long time. I usually order several items (wrap, platter) but I feel like by the time I get the food and eat it, it's already cold waiting for the entire order to be ready."], ["George H.", "Still hit up this location about once every two weeks.   Still great recipes and great ingredients.  When I have a taste for it, the Kafta wrap is really good.    The ground lamb and beef are well seasoned.    They make everything to order, so it does take a little longer than you might expect.   But, it is worth the wait."]], "Sultan's Market": [], "Ameer Kabob": [], "Greek Islands Restaurant": [], "Zizi's Cafe": [], "Olive Mediterranean Grill": [], "Taza Cafe": [], "Naf Naf Grill": [], "Sayat Nova": [], "Koko's Mediterranean Grille": []}