{"Bom Bolla": [], "Emilio's Tapas Sol Y Nieve": [["Mc C.", "This place screams decadence. The food is outstandingly fresh and the service is perfect. Our server Nico was impressively knowledgable about the impressively extensive wine menu. The real MVP is the \"sorpresa de chocolate\" aka \"chocolate sponge cake\". It took everything I had not to order 7 of them. Try it with the white sangria, you won't be disappointed. I think one of the most impressive things is the prices. They are reasonable for the city. Try this place and enjoy."], ["Saba A.", "Emilio's is located in Streeterville area- an area I never go to unless I have a doctor's apt at Northwestern but it was nice to go here for a group dinner on a weeknight. The prices are great, the place is authentic- i felt like I was in Spain, and the space is large enough for a group gathering! We were greeted by two busy hosts, and got seated on a large rectangular table in the middle of the dining room. Our waiter was nice- took our drink orders quickly and our tapas orders were brought in quickly. A wonderful tapa's menu - the patatas bravas were spicy and perfect. One of our beef dishes was full of strong rosemary flavors. The steak dish was generously plated. They were friendly with bringing out extra bread and refilling our drinks quickly. I did a Yelp check in and mis read when we could get a free bottle of house wine- so they brought out complimentary tapas dishes for all of us instead. The strive on being FRIENDLY so it's definitely a warm and welcoming environment. They were happy to split checks even though we requested it at the end. Great food, friendly service, wonderful menu. Was a great place to check out and I wouldn't mind visiting in the summer and sitting on the patio."], ["MT W.", "Open since 1988, almost 30 years, that's a time.Situated in the center of the city, next to Magnificent Mile. We were wandering around Chicago in the day time looking for a place for a small bite and a drink. And we saw this one. We sat outside in the patio, so I have no idea how the place looks inside. But outside it's very Spanish. A nice restaurant and wine bar, offering different varieties of cold and hot tapas and paellas. In their specials they have grilled Octopus, it's amazing. Spanish people know how to cook octopus right. Calmares were a little bit rubbery and oily. Tortilla a la espanola, pan con tomate, jamon serrano, queso de cabra, ensalada catalana, gambas al ajillo - the menu is all in Spanish and sounds so native. But underneath you'll find the translation and the explanation in details of all the dishes of course. On weekends they have special offer for paellas: if you order one (they have four different suggestions: mixed, seafood, vegetarian and chicken with vegetables ), you'll get a free bottle of wine. But some people might think that the wine they give for free (it's two options of white and two for red to choose from) isn't good enough for them and would want to order something more extravagant and fancy.All wines here, except of one which is Malbec from Argentina, are from Spain. A decent selection for reasonable price, interesting choice of cava. For desserts: profiteroles, strawberries with ice cream, fresh Peach casserole under streusel topping with ice cream etc. The Peach casserole was a ok. I have some doubts that the peaches were fresh, looked like canned to me. But still, pretty delicious. And they offer a variety of dessert wines by the way. The server was attentive and helpful.Not luxury place, but delicious, very reasonable prices and good for lunch or just a small bite and drink during your summer walk around the city."], ["Kyle D.", "Overall: 3.5 if I could. Good, well sized tapas, but there's better in the city.The good: Tons of options to choose from, with all sorts of seafood, meat, and veggie items. Good atmosphere and service to match. Prices are reasonable. Lots of seating.The bad: Paella was lacking. Some of the tapas could have been hotter. Took awhile for them to come as well. There's better food elsewhere.Atmosphere: 8/10Service: 8/10Food: 7.5/10"], ["Aurora A.", "It was wonderful to see and reunite with very good friends with a very good place and excellent food.The service is extraordinary . Kudos Herdilberto!"], ["Maria O.", "Ridiculous wait times!!! Waited over 2 hours before I finally complained, I was told that my food would be on its way in about 40 minutes! What!!!! Is my food actually coming from Spain?! Restaurant was completely unapologetic, so add poor customer service to excessive wait times! If you are hungry go anywhere but here, if you want to spent 3 hours waiting for food have at it!!!!"], ["Iryna Z.", "Wonderful atmosphere, with classy service and incredible food.We were looking forward to Spanish cuisine for a while, we gave Emilio's a try for a romantic night out. What a lovely, authentic restaurant. We made reservations for outdoor seating and even though its on a busy street/touristy it was intimate and romantic. Bottle of fantastic Reserva, small tapas, and seafood paella were to die for. All of the above were very tasty, filling and presented with taste. Service was top notch, starting from lovely hostess ladies to our server. After our dinner we got caught in the rain, so we decided to go back inside the restaurant and hang out at the bar. Again, we were not disappointed drinks were incredible, bartender was entertaining and we got small dish of goat cheese. It was just divine."], ["Deborah K.", "Emilio's is the perfect stop before or after going to the movies at the AMC 21 which is only a few blocks SE of the restaurant.  The food has been consistently good and we recommend starting with the garbanzo and eggplant.  Two terrific dishes -- sorry I don't remember their Spanish names.  There's a very reasonably priced wine list and if you're looking for a red, we recommend the Los Dos.  The staff is helpful and friendly.  Check it out!"], ["Brenda D.", "YUM! I was in town for a convention and it was late when we sat to eat so we ordered a bit of this and that.  All of it was delicious!  Thanks for letting us in the door at the last minute and serving us like we were your 1st table of the night."], ["Steve A.", "Wow, this place was packed, even on a rainy Thursday. Great vibe, just like Spain. The menu is a bit more limited than some Tapas places, but there is a nice variety. We really liked the beef dishes; very tender and good quality. There's also a nice selection of Spanish wines. Service was very friendly, and noise levels are reasonable, even when busy, particularly at the window tables."], ["Lucy W.", "The food is worth a solid 4 stars, add 1 more star for the service.We ordered the smoked salmon appetizer, the lamb leg and the soft shell crab with rice. All three dishes were delicious - lamb was tender and flavorful, the rice in the soft shell crab dish was really good (just wish it's bigger).Oh the smoked salmon appetizer was definitely our favorite. It came with a white sauce, but I think the dish without the sauce is better. The service is notable. We checked in for a free bottle of wine, and apparently it was supposed to be valid only on Sunday, but the server ended up honoring it and took the wine off. During the whole meal, he was also very attentive. I'd come back for the salmon appetizer and the service."], ["Iman W.", "If you sit in just the right seat outside, you'll have an awesome view of Whole Foods. I know, I was  excited too!First things first, service was great. I was with visiting friends who'd never had tapas before and the waiter was pleasant, he explained how tapas typically works to them, even made some recommendations. He had the patience that I don't, so kudos!The food was okay. I feel like I've enjoyed my meals at Cafe Iberico more, but it was still fairly good. I like the dish with the pureed garbanzo beans. There was another dish made with chorizo that was really good. And rarely can you go wrong with patatas bravas. I ordered the empanada del dia as well, it was probably my least favorite, I felt like it was a bit bland. I honestly found this place just by walking in the neighborhood and if I happened to grow hungry while in that area again, I'd come back (hopefully with more adventurous diners). But I can't say it would be my first choice if I specifically wanted tapas."], ["Trevin S.", "Last night's dinner adventure took us down the magnificent mile on a search for an open table. After two failed attempts and frustrating crowds, Yelp directed us to Emilio's. The restaurant was about 75% full which was a relief from the 150% slam packed restaurants in the sounding area. The decoration was nice and not in your face. Music volume was perfect and not obnoxious. Finally the wait staff seamed genuinely nice and engaging.Three different plates were ordered and the three of us were completely satisfied. Also the servings were not ginormous and a refreshing size. No complaints here."], ["Chuck B.", "We found this place through Yelp, and since my wife and I enjoy tapas places, we figured we'd give it a go.The atmosphere is warm and inviting, the servers were friendly and attentive, the prices were completely reasonable, and the food was excellent.  You can even find reasonably priced bottles of wine on the menu.  I thoroughly enjoyed the visit, and would recommend it.  Would definitely go again."], ["Elsie Y.", "Hanging out with ladies. Very nice place and very delicious food! Garlic potato is my favorite!"], ["Evelyn P.", "Went in yesterday and asked for a table for one. The hostess and another employee looked at me like I was crazy shook their heads and rudely told me the only place I was allowed to sit was the bar. They pointed and didn't even give me a menu.I understood it was Valentines day and probably would have to sit at the bar, which I didn't have a problem with, but I the attitude wasn't needed.Never going back there!"], ["Sawsan S.", "Went here on a date night with my husband, food was excellent we had seafood mostly everything was cooked to perfection also had dessert was excellent definitely will recommended ,definitely will be back to try more different plates"], ["Lavi W.", "Came here for a dinner event and they brought out endless Tapas to us!!! I was stuffed. The service was amazing: our waiters were funny and knowledgable & the food taste really good!"], ["Abrar S.", "Good outside seating...that's about it...Menu does not have a ton of things I would like to order.  Ordered Spanish omelet, chicken skewers, garlic shrimp, and spicy potatoes.  Everything was just average except shrimp, which was above average.Pricy.  But so are all tapas places.I will not go here again."], ["Sheila B.", "We are always looking for a good tapas experience, Emilio's didn't disappoint. Try the Lamb meatballs and the white sangria."], ["Jorge M.", "Searching for a a different  place for a sangria beside cafe iberico I decided to try Emilio's and to be honest I wasn't impress at all. First I ordered a sangria and once again it was bad tasted like a cheap red wine and watery. Then I ordered patatas \"bravas\" and def weren't brava  (spicy). Nice patio but food and drinks were not good  at least for me."], ["Brian M.", "Heriberto is an incredible waiter. The tapas are so good!! Highly recommend. Everything we tried was delish. We sat outside and our waiter was so attentive"], ["Shayna B.", "The best Spanish Tapas you can find in the city... I love the idea of being able to eat smaller portions of more dishes. On a typical visit, you should get about 2-3 small plates per person. A few favorites- the garlic potato salad is a must have, as long as your date agrees to eat it with you (or doesn't mind extreme garlic breath). The tuna canoli also from the cold tapas is absolutely delicious. From the hot tapas, the Bacon wrapped dates are the perfect combination of savory and sweet, but let them cool before digging in, they're super hot! Grilled shrimp, grilled calamari, and the chicken brochette are also fantastic. If you like octopus, go for the Grilled Octopus under the specials, absolutely delightful- crispy grilled octopus that melts in your mouth. The red sangria is also fantastic, get the pitcher. Oh- can't forget about the banana dessert.... Incredible."], ["Stephen L.", "Great iced tea. Pretty good tapas. Goat cheese dish is better elsewhere. Championes Rellenos were good. Went in the door at 1 pm. Had diarrhea at 2:30 pm."], ["David Z.", "excellent tapas dishes and flan. Special bread pudding was great too."], ["Chris K.", "While it seems a bit pricey, it was very good. Wait staff was friendly. They also had a special with a free bottle of wine. Even though we didn't take advantage of it I don't think I've seen something like that before."], ["Starstimes2 S.", "The sangria comes in bottles with no fruit. They give you glasses instead with fruit and ice. The sangria was ok but wish it was better. Had the Spanish potatoes which was so much better than I expected. The vegetarian paella was pretty good too. Some of my dining mates had seafood and thought it was good too. Liked the ambience. All in all, definitely worth a try or two. And the dessert options were all great too!"], ["Lynette H.", "This place is good.. Not as good as some other Tapa's places in Chicago. My Husband and I live in the area and decided to check this place out. Their sangria is excellent. Definitely order it. The food is good. Can't exactly remember what we ordered (not a good thing) but I was mildly satisfied with everything on our table. The accept reservations.. Thank god. I hate places that are walk in only!! They have a huge restaurant and tables on the patio for summer and nice spring of fall days. Great for people watching. I wouldn't necessarily go out of my way to return unless a group of people decided to go. With the big space it's ideal for a group lunch or dinner.I originally have them three stars.. But since the sangria is so good and they take reservations I bumped them up to 4!"], ["Antonio V.", "Nice atmosphere, great sangrias, too many flies for my liking, both regular and fruit flies. Makes me wonder what's going on in the kitchen. Btw we ate inside..."], ["Claudia Z.", "Great service and good pulpo. The tortilla espanola was a little soghu wit that the salad dressing...."], ["Rachel G.", "Great tapas, AMAZING (strong) Sangria - we hit this place every time we're in the city.  Order the Sangria by the pitcher, and be sure you have a designated driver (or walker if you're staying close by).  The grilled calamari with lemon is amazing, and the garlic potato salad is a classic.  Great tapas!"], ["Joe T.", "Great tapas and sangria. The bartender was super friendly and fun to talk with. They bring out tapas samples every so often. Great place."], ["Chuck M.", "What a remarkable restaurant. This was my first visit, coming with a large party of 20 auditors...all of whom can be critical and obnoxius as hell...!!!Eleven small plates (yes...11 ) were delivered to each individual... in some planned order... each with a different food... culminating with two remarkable desserts.Service was spot on...foods couldn't be any better...the atmosphere was remarkable. I can think of nothing needing improvement... it was a very enjoyable evening...!!!"], ["Amy S.", "They have a great little patio, with individual umbrellas and the street is tree-lined. (Our Chicago standard) The food was great! The Sangria is really good- not too sweet. We got the pitcher for 26$ and each had about 3 glasses. Our waiter was really great, too! Wish we had a place like this close to our place at home."], ["Kate K.", "Went here with a large group (there were 9 of us) on a Saturday night.  We got there early and started at the bar, then moved to our table which was ready right on time.  We ordered a big selection of tapas and enjoyed every dish.  The calamari was possibly the best calamari I've ever had.  If you don't try it, you're missing out.  Other group favorites were the wonton chicken empanadas and bacon wrapped dates.  Service was friendly and attentive and the flow of food was well timed.Everyone in our party was really happy with the restaurant and food!"], ["Nerina M.", "Excellent food and superb service!  Seafood paella was excellent and being of Spanish decent we are harsh critics. Ordered olives and Spanish cheese tapas and they were also great.  Topped it off with a delicious custard.  Our server Ivan Perez was the best.  review helps others learn about great local businesses.Please don't review this business if you received a freebie for writing this review, or if you're connected in any way to the owner or employees."], ["Shambavi K.", "Came here a month ago for a friend's birthday. We ordered quite a variety for our party of 7.  it's a good place to gather people and the ambiance is great.Foodwise, I feel like I have had better. We ordered a paella, shrimp scampi, scallop, eggplant something. a cold tuna dish. beef carparccio. They were all okay (nothing bad). As I am trying to recall, the only thing that stood out to me was the cold tuna cannoli. usually i don't like this dish and had low expections. oddly, I enjoyed it because it was better than cafe iberico. I won't be rushing to go back here but this is a good place to gather people. The ambiance and service was good too."], ["Grace L.", "Delicious food! Different than all the Italian places in the area. Best restaurant all week we've been here! Moderately healthy (still has carbs I.e. Paella but so good I can't restrain myself!). Not too salty. Server was friendly. Nice relaxed atmosphere, could be romantic, could be for families or group of friends. Not too quiet and not too loud."], ["R S.", "Blah.  Paid $55 for a menu of cold and hot tapas, plus paella, when a group from a conference went here.  It was pretty far below average.  1.  The tapas were all greasy.  Not authentic at all.2.  The tomato bread was horrible; like tomato paste on bread, rather than being rubbed and drizzled with olive oil.3.  The paella:  Absolutely horrible.  Mushy.  Tasteless.  Not a hint of saffron (yes, we notice, especially when we pay $55).4.  Sangria:  I tried the white and the red.  It was chunks of apple and a bit of orange dumped in wine.  Period.  Nothing more, and it was bad wine, to boot.  $10 a glass too.  That's expensive wine with apples (apples?  Really?  Come on!)"], ["Emma K.", "I came here with my Mom when she was in town and staying just down the street at the Doubletree.  The outdoor seating is really nice, and is a great place to people watch.The food was delicious.  I got the Tostada Campera - toast topped with a marinated beef mixture.  It was yummy and large - I would recommend sharing this dish with someone.  I also had the Gambas a la Plancha which was a favorite of mine when I studied abroad in Spain, and this dish did not disappoint.  Simple grilled shrimp with the most delicious garlic lemon butter sauce.  My mom also had two dishes which were specials, and i was jealous after trying them.  The only reason why this is 4 stars instead of 5 was the service.  Our waitress was not particularly helpful with suggestions on how much we should order, and then after we were done eating, it took us a good 15 minutes to be able to flag her down and get the check."]], "Quartino": [], "Mercat a la Planxa": [], "Tapas Valencia": [["Mitesh P.", "This place is great for family dinners.  The dining room environment, menu options and price is worth another look.We ordered about 10 tapas dishes and a few drinks, total bill around $140 excluding tip.  I would recommend both the hot chicken tapas dishes; Pollo a la Parilla and Pincho de Pollo.  Unfortunately the Sangrias were disappointing."], ["Jeni H.", "On Sundays they have all day $3 tapas menu at the bar. AWESOME DEAL! The scallop dish so good we ordered a second one. They give you FIVE scallops - what a steal for $3!  They were super tender and yummy.  I also got seconds of the steak with potato and mushrooms. Chicken skewers came with a yummy sauce. Mussels were very fresh and had BIG bites in every shell - also a steal for the price.  Toast points with cured meats and cheese was nothing unique - exactly what I expected but gotta love it. Two things I would NOT get again: Mushroom salad was mediocre and a bit too oily for my taste.   Grilled portobello mushroom served in a roll was a disappointment.  I love mushrooms too so these two were a bit of a bummer.  But the seafood and steak dishes more than makes up for it.  Looking forward to the next visit!"], ["Rachel A.", "This place is great. We made a last minute reservation on Open Table and went on a Sunday night. There were plenty of open tables and we chose to sit outside. The servers were attentive to us outside and our waiter told us what his recommendations were. We got 4 tapas... Pipirrana de Buey- Steak with blue cheese, the steak was cooked well and was tender, great flavors Croquetas de Jamon y Pollo- Ham and chicken croquettes! I love croquettes and these did not disappoint Queso de Cabra- This is described as goat cheese and garlic bread but it comes with a delicious tomato sauce that is almost like a tomato bisque to dip the bread in Calamares a la Plancha- Grilled squid... I do not like grilled squid typically because of the texture but I tried it and it was pretty good! Sangria! We got both white and red sangria.... the red tasted like it had more alcohol but I liked the way the white tasted better! Free dessert with a check in on yelp!  I chose a chocolate pecan cheesecake and it was really good! They have a rather large selection of desserts, included different kinds of cakes, flan and ice cream."], ["Khiang S.", "Had a great time here celebrating a birthday. They have prix-fix menu (min 2 ppl) as well as a regular menu. We had 5 ppl, 2 ordered the prix-fix menu ($35 each) and the rest ordered 7 items to share. That's plenty of good for everyone. It was hard to stuff in dessert. Place - nicely decorated with Valencia tiles on the wall - imagine yourself in Parc Guell. Drinks - tried the mango margarita and cava sangria. Have to say I have had better ones else where. Food - excellent. The beef tenderloin were tender, scallops were fresh, crepes were thin and crispy. Very tasty all around. Dessert was good too! Not the usual super sweet type. Bonus - free dessert with yelp check in and when I told the server we were celebrating a birthday, he came out with a ice cream puff with a candle on top!Highly recommended and will return."], ["Qianwen G.", "I ordered delivery, but they did not give me forks and napkins. The food is good but tiny size. The bacon wrap are very sweet which I did not expect. Others are fine."], ["Riva L.", "At first, I would have given this four stars because the first three tapas dishes we had - the goat cheese, the tilapia, and the chicken - were all good.  The tilapia and goat cheese were the best: the tilapia was thin and crispy and nicely flavorful; the goat cheese/ bread dish was so tomatoey and super savory.  The chicken was a little dry, but it was not bad.  However, we ordered the seafood paella and everything about it was wrong.  The seafood was overcooked and rubbery.  Scallops should NOT taste like that; I shouldn't choke on squid (or octopus) rings; shrimp shouldn't be rock hard; mussels should not be tiny and shriveled inside of their shells.  The seafood itself was a total, overcooked, nasty disaster.  The paella itself was bland and had nO crispy bottom or anything like that.  Nothing about this dish was good and we paid $20 for it.  What a waste.bright side - good sangria, and if you check in on yelp, you get a free dessert -- the pecan cheesecake is to die for delicious, not too sweet and very tasty."], ["Ruth B.", "Super fun restaurant - great food and delicious sangria. Good happy hour deals too!"], ["Ivy Z.", "Being so in love with tapas I am surprised it took me until now to try Tapas Valencia. Located in the South Loop (sort of near Chinatown) I was surprised to find a tapas restaurant there, but I really am glad I did. This might be my favorite tapas place in Chicago for now.I highly recommend the $35/person prix fixe menu because you get to taste so many of the best dishes they have to offer. Here are some of the highlights:- Jamon Serrano: Just how I had it in Barcelona!- Tostadas de Centollo: My favorite cold tapa. The crab was delicious.- Vieiras al Albariño: By far my favorite warm tapa. Perfect scallops and great flavor.Ambiance: Fun, decorated with some tiles that seem to be Gaudi inspired. I would say Cafe Babareeba is a little more girls-night-out and fancy atmosphere than Tapas Valencia, but I would definitely pick here for the food.Drinks: Sangria was a little bit of a let down compared to some others that I've had, but the food really makes up for it.Definitely will be back!"], ["Samantha H.", "Can't believe I've lived here for 7 years and never been to Tapas Valencia.  Overall I like the place but none of the food blew me away.  The decor and ambiance is very cool and the server we had was outstanding.  Half price bottles of wine on Wednesdays?  Yes, please!  They give you some olives to start as opposed to a bread basket or chips and salsa.  The food came out at a decent pace, slightly too quickly.  I like that they have fresh plates and forks right at the table cause that is always the problem with tapas.  We started with the serrano ham.  The dish was prepared nicely but the serrano itself was just meh.  We got the empanada.  It is one, huge empanada so not optimal for sharing.  It was also soggy.  The flavor was pretty solid but not a fan of the way it was served.  We got the grilled shrimp with lemon butter, which was my favorite dish of the night.  We tried the scallops which were okay.  The spicy potatoes were decent.  I know we got some sort of beef or lamb but that is not not memorable it was that I can't even remember which.  Overall, not a bad spot and none of the food was bad but nothing was awesome either."], ["Maxine S.", "I came here on a Friday for the start of a girls night out and thoroughly enjoyed myself! the atmosphere is pleasantly and lively and the food was DELISH!! we had the scallops and coucous, shrimp with lemon butter, tiger shrimp with spinach, the king crab and avocado over toast, and the stuffed mushrooms, the pomegranate and regular red sangria and everything was good. I will surely return."], ["Rick F.", "The south side has really changed, love the area, loved the service, the decor was exciting, the staff seemed to be having a great time, laughing, playing and making sure we all were well provided for. I'm a fan of tapas and they did not disappoint. Cheese fondue was great. Paella was excellent. My favorite was the skirt/flank steak with mashed potatoes simply amazing"], ["Carolyn A.", "Nice location close to home in the South Loop. Our waitress gave very good suggestions, and the desserts were delicious!"], ["Insa E.", "Had dinner there just last Sunday night (btw, Sunday drink specials are $5 for Cava, Sangria, Mojitos or Margaritas).  My son and I split the calamari, duck confit, stuffed peppers, goat cheese crepe and the empanada.  All were delightful and had a deep savoriness that I associate with Spanish food.  Then, to our surprise, the waiter comped us a dessert, apologizing for the slow service.  It wasn't slow.  In fact, service was excellent and team based (everyone taking care of us) but we didn't complain about the free dessert :).  I'm from out of town, and would definitely come back here again."], ["Pawnster B.", "Awesome tapas place. Very spacious and unique decoration. Food is awesome. The best dishes are the shrimp and squid tapas. I'd go back for sure. A bit on the pricy side for the small serving size but worth it."], ["Marilynn P.", "FOOD- The tapas were pretty delish. We ordered mostly hot tapas since it was a freezing Chicago day. The menu is pretty extensive but definitely overwhelming to look at. I think we ordered a little bit of everything. Items that really stood out for me: Gambas ajillo, queso de cabra, crepe rellena, and Chorizo y morcilla (was so excited that morcilla was on the menu! I haven't had it in years and the last time I had it was in Madrid!). For dessert the platano con helado was my favorite. AMBIANCE- The space is well-designed. The decor reminded me of Spain and felt very culturally authentic. The mouthwash in the bathrooms were appreciated. But something was definitely missing though. It felt weirdly quiet... perhaps the music could have definitely been louder. Maybe the lighting/temperature was off? I just didn't feel cozy and comfortable being in the space. SERVICE- The service was alright. The waiter suggested we order a few tapas and after those came out we could continue ordering. I think that is a good approach to tapas dining, however not when dining with a large group (we had 10 people). We ordered 3 tapas to start with, and they were devoured in 3 seconds. Then we waited for a while before the next round came out, etc. The wait period was too long for me between rounds of tapas. I just prefer when everything comes out all together. Overall it was a good experience. I'd definitely come back with a smaller group. Making reservations was easy. ALSO- check in on yelp once you are there! There is a free desert coupon! =)"], ["Jordan P.", "So I wasn't really that impressed with this place. The food was good, but nothing to write home about. The service was ok. The best thing I ate all night was a dish with crab and avocado. We ended up ordering about 3 of those. The fish that one of my dining companions had was also pretty good. It had some sort of pineapple butter on it, which was amazing. Everything else was meh. Also, the sangria was terrible! It just tasted like straight up wine. If I'd wanted wine, I would've ordered it. Then at the end of the meal the server apparently gave us the wrong check, but none of us noticed. We paid the bill, left the restaurant, and next thing we know someone is running down the block screaming for us to come back. When we get back we were told we were given the wrong check and of course the correct check is more expensive than what we originally paid. Now, I have no problem paying for my meal, but if I've already left the restaurant then that's on you. I really think they should've just eaten the cost. Anyway, I'll be back if I'm in the neighborhood and I don't have any place better to go, but won't be going out of my way to eat here any time soon."], ["Joyce W.", "I haven't been this disappointed in a restaurant in while. We usually rely on yelp reviews but this time yelp, you were really off the ball. We ordered the prix fixe menu and a few a la carte items. The food was mediocre at best for the extravagant prices and portions tiny. Our bacon wrapped dates were served to us burnt, something like that should've never left the kitchen. They did come back with a new plate as requested, but these were no better (and in fact smaller) than the ones we have made at home. Even the desserts couldn't save the night. Nothing to write home about. Could've spent our time and money more wisely elsewhere. Left disappointed."], ["Sabah K.", "A very nice experience! I thought it was slightly expensive for tapas, compared to other places, but the food was extremely flavorful and the server was really pleasant. I will definitely be back!"], ["Chary H.", "Amazing tapas. They are fresh and made with quality ingredients. They have a vast variety of hot and cold tapas and there is definitely something for everyone. They have vegetarian options as well and plates are reasonably priced."], ["Hannah P.", "Great food, awesome service. Very attentive and we had the best drinks.  We ordered tons of stuff: blood sausage and chorizo, garlic potatoes, octupus, queso de cabra, dates wrapped in bacon, paella, salad, pepper studd with crabs, etc. Everything was good. I was too stuff to eat a lot of paella but what I noticed was that there was alot of seafood on it...at some places, it's mostly rice."], ["Sujin Y.", "All of our food came out cold. Our waiter was never around.I've definitely had WAY better tapas. Will not be coming back here. So disappointed."], ["Felipe V.", "Amazing! We have tried restaurant week  for the past 3 years and this was the BEST! Tasty quality food that was well thought out. The staff is so friendly and very informative. Upbeat and Picasso-esque atmosphere!"], ["Janet P.", "Enjoyed the food, atmosphere and fun flamenco music and dancing.  Hard to find decent tapas outside Spain but they did a good job."], ["Sasank N.", "Amazing food and great service. Wide variety of delicious tapas dishes. Highly recommend the scallops, stuffed mushrooms, and lamb. This place deserves 4-5 stars"], ["Saif A.", "Best potatoes I've ever eaten in my life. Every single item was amazing, but the portions could be bigger. The Flamenco dancing and signing was a treat! Highly recommended :)"], ["Christine U.", "Very good food. Lots of choices. Service was good in the beginning and then fell off when our server got a large group. Overall good experience and I would definitely go back."], ["aloha g.", "Found on Yelp, WOW. 4.5 stars. We had the chef's fixed menu of like 10 items for I think about $55 or 65 per person. It had most popular items. Incredibly tasty and well done. Only reason not 5 stars is I don't think every dish was 5 stars worth. Had a mango sangria which was also really good. Very friendly. Great place. Definitely will come again."], ["Isabella W.", "A group of 6 of us went here on a Friday night. I made reservations for 7:30 and a table was promptly ready for us. The atmosphere is very relaxing and the place is very clean!I will start off with the drinks. Of course we had to get sangrias! The first one, made with white wine, was a little weak. We told the waitress, but she insisted that it was strong. I guess we are a bunch of alcoholics that have high tolerance. The second sangria we got was made with champagne and this time, it was a lot stronger! The third one was made with red wine and it was very tasty and pretty strong as well.The food was really tasty! We got the Taste of Spain option since it is a little bit of everything that is popular, and some other small plate (that's why it's a tapas place lol). The presentation was very nice and everyone loved the quality of the food! I think my favorite one was the squid. It was very fresh! The spicy potatoes, something that I always get at a tapas place, was just spicy enough, yet not blazing hot, which is what I like. The dessert was unbelievably delicious! We got a tray of different ones, since it came with our meal. The flan was soaked in a coffee cream...fantastic! We also got some chocolate custard pie, vanilla ice cream, and the waitress was nice to throw in an ice cream pastry puff on the house. When we finished, there were nothing but empty plates and satisfied customers =).I would definitely come back! The service is very attentive and great and everything is super clean and organized...even the bathrooms! I would say this place compares to Cafe Iberico or Café Ba Ba Reeba. However, those two places have things on their menu that I love, but I cannot find in Tapas Valencia. Come check this place out if you have a chance! There's paid meter parking and valet if you don't want to drive around. But beware! DO NOT park in the residential area! There is a sign posted that you need a permit, but it's really small and if you see tickets on other cars, that's usually a sign that you can't park there. I would love to try their goat cheese next time I come back. I usually order that dish every time, but no one in my group likes goat cheese."], ["Dan L.", "My wife and I have been here on a number of occasions and each time we're always really impressed with the quality of the food. In my opinion, its actually the best Spanish Tapas restaurant in Chicago-land...food wise. I would highly recommend the olives, stuffed mushrooms, and the Talapia.The ambiance is a little more low-key than some other tapas restaurants, but that actually makes it a great place for a romantic date or to get a large group together where you can actually talk. Service here is always fantastic and the manager always seems to make it to every table to see how things are going. The only downside is that being on south State, its a little more out of the way and not as central to the rest of the city. You wouldn't go to dinner here and then wander to a nearby pub or bar. With apps like Uber or Hailo though, its pretty easy to get a cab and get back to more lively parts of the city."], ["Jules H.", "Terrific food. Everything we got our tapas on with was delicious! Olives, a nice salad with octopus, beef brochette, chicken brochette with chorizo, nice sized portions for tapas, well priced!Service was good, but a tad off. One minute we couldn't get our water glasses refilled, and then 10 minutes later the waiter, water refiller, and food server would all appear at the same time asking if we needed anything. They were all delightfully nice, but need to space their table visits.Valet parking! Miro-esque murals on the walls. Good tapas spot!"], ["Monica M.", "Great food and atmosphere was very inviting. I've had better but this spot was pretty good."], ["Heidi L.", "This restaurant is one of the biggest tapas restaurants I've ever been to! It has a different feel than most tapas places--a bit more loft/industrial, which was kind of an odd atmosphere for tapas. However, overall we had a good experience. There was a slight delay in getting waited on, but the eventual waiter made up for it by giving us a complimentary dessert (which I really appreciate--it seems like a lot of places now don't care if they give you bad service and won't even think about comping you with anything). The food was good and the portions were large compared to most tapas places. I would recommend."], ["Liz K.", "I came here when it first opened and then recently with a big group. It was a Saturday night and well most of us know Saturdays are busy (we had reservations though) but wow the service was slow and a bit off. The place is decently sized with a great big bar and well that night almost every table was taken. Now I LOVE Tapas & Sangria. I just loved getting a little bit of everything. :-) I had:Setas Salvajes= Yum!Pincho de Pollo=OKEnsalada Pollo Marbella=Good!Tortilla Espanola=Very GoodPatatas Bravas=Umm no thanks I have had betterOne thing about this place is the sangria is Gooood! Now I was expecting a pretty big bill since I felt like we all ordered so much...but in the end it wasn't bad at all. At least not for what we felt like we ate. Overall, the experience would have been better if service was better. We kept getting food we didn't order and then had to wait forever for some of our dishes. Now I remember it being way better when we first went about 3 years ago...or maybe I just had too much Sangria that day. ;-)"], ["Pan F.", "Street parking was surprisingly easy, and they have valet. Flamingo on Saturday nights I went to, and the dancing sure added flavors to the meal. Great place for informal gathering, I don't think it's as loud as some of the tapas restaurants downtown. Service was great, and the food too."], ["Joyce D.", "Happy Hour is da bomb! $3 tapas and $5 mojitos! Great mojitos and I love the patatas bravas.  If you don't eat pork like me, then options are somewhat limited but there is plenty of seafood.  I had mussels for the first time and enjoyed it!  The patio is open in the summer."], ["Julia S.", "I have been here 5 times. Clearly I keep coming back! Most of the servers are incredible. We have only had one instance in which service was very poor. That was certainly the exception. Each time we have gone the food has been very consistent. The tasting menu is wonderful to get an idea of which plates you enjoy and is reasonably priced. Our favorite dishes are the Tostadas de Centollo (toast points with crab and avocado) and Tarta de Chocolate y Caramelo for dessert."], ["Stephanie M.", "From start to finish, the service and food was impeccable!  Jose was the manager on duty and he truly made our night special.  My colleagues and I went for a girl's night and was instantly enchanted by the decor of this restaurant.  They have this beautiful mosaic tiling all along their walls giving the whole restaurant a Barcelona feel.  Being recently back from Barcelona, it felt like I was transported back to my favorite European city.  Jose introduced us to the specials of the day, and gave us a moment to look over the menu.  We were interested in the wine, however very unfamiliar with Spanish wine.  Jose narrowed down the choices to then his top 3 favorites of the menu.  We had the bottle of Rioja \"Conde de Valdemar Reserva\" and two bottles of their new Toro that was off the menu.  He wanted to gather our input on what we thought of the new wine and if they should keep this brand.  I thought that this was a great marketing strategy on their part and a great treat for us.The food was equally amazing.  He helped us pair our meal with the different tapas that would go well with the wine selections.  Everything felt very European!  He didn't rush us during the dinner event.  I say event because we savored every moment of this meal without thinking of rushing out that door.  After our few courses of tapas, we ordered additional dishes.  To start, the jamon de serrano platter is a great sharing plate.  Great thin slices of the traditional Serrano ham with monchego cheese wedges and fresh bread with pesto.  I also highly recommend the bacon wrapped dates and the grilled calamari.  Fantastic!  Everything was absolutely fantastic. For dessert I had the tarte de chocolate y caramelo.  Wow~ talk about heavenly decadence!  By the way, you won't want to share this dish.  I also tried the platano con helado.  This is like thier version of a bananas foster.  If you wanted a lighter dessert, this is a very refreshing dessert."], ["Allison M.", "Love the $5 margaritas, and the friendly wait staff who didn't even mind when I had to plug my dying iphone in. I also love that this restaurant really doesn't have much around it, makes it clear that it is worth going to as well as much-needed in the neighborhood.  The food is good too: my favorite (unsurprisingly-- it's always my favorite at tapas places) was the Queso de Cabra.  We also tried the Pimientos del Piquillo which were super tasty.  I think we also had a rolled-up eggplant sort of thing, but it's hard to remember now... those $5 margaritas hit hard!I appreciate the number of vegetarian items on the menu, and the prices are fair.  This was definitely a winner!"], ["Mark Y.", "Love this place so much. Diverse fantastic food, service, location, ambience. Perfect place to bring a group or out of towners!.. Just wish they still had the tudella salad;)"], ["Jessica S.", "Made a reservation for a quick dinner here last night, pre-Beyonce/Jay Z, knowing that it would be busy. It was about 80% full, but we experience horrible service (and I say this knowing what it's like to work in the service industry for 10+ years). Waited nearly 40 minutes for our third round of drinks. Another server who was helping out with our table told us he would get the manager to come over because he could sense our frustration, while our own waiter was oblivious. I had to hunt down the manager after 10 minutes of waiting to request that we receive our drinks immediately so we could cash out and leave. He took the final round of drinks off the bill but didn't seem too apologetic that we were neglected for about 40 minutes. Instead, I saw our server running around filling up waters instead of leaving that job to the busboys, which is the norm at most restaurants.The food was good, nothing incredible, but solid tapas food. And I really really enjoyed my mojitos (only $5 on Thursdays along with martinis and margaritas) but I really can't imagine ever coming back to deal with terrible service."]], "Black Bull": [["Walter M.", "As I stated in my Bordel Review I love Spain, but it's the food that to me is the selling point. I was a foodie before a cocktail guy.There is 1 thing that irks me, is how everyone and their mama calls appetizers or small plates the blanket term Tapas, none of them ever been to Spain or even really know what they are all about. To put it more lightly it's like going to a steakhouse, ordering a 45 day dry Prime Ribeye Tomahawk and saying \"I'll have the beef\" as if to differentiate it only from the pork or chicken or fish like at some wedding.This is what I was looking for, a place that differentiates between tapas and pintxos and the prized jamon iberico.I went with the Boquerones, white anchovies and chips, light fresh anchovies. Hontadita de mohama twas but a bite of tuna belly, complex. Langos a ala plancha, squeeze of lemon and ditch the salsa, perfect with your first beer. Mejillones con chorizo was tasty, but could use imo some shallots. No way was I paying for $9 shishitos though. Flamenquines and pulpo a la gallega were great. Serrano and manchego 2 classic Spanish flavors and the garlic chips set it off, needs a sauce to round it out. Octopus was fresh, not chewy, seared well, again missing a sauce.Paella. I was so happy to see they used Bomba rice, offering a negro version and had rabbit offerings. I went with both. I was pleasantly surprise dot see monkfish and baby scallops in the negro, not soupy at all like some other places make it. Cochinillo took a confit suckling pig which is rich and fatty and flavorful and paired it with berries and squash mousse which looked great, but ultimately didn't compliment the flavors. I would have gone with a  wood ear mushroom and sous vide carrots which gives you the color and texture contrast you are looking for. I was a little bit off put seeing the beloved Iberico ham use to make hamburger patt's, seared and wrapping dates. To me it's like taking caviar and putting it on hot dogs, just watering out it's flavors and pure essence. Next time I come I'm coming for the seafood. Cockles, razors and chipirones. Décor is great, service is excellent, but I earned the servers respect early on and was actually greeted by the chef. Great job on some of the dishes, This really makes me miss Spain."], ["Kara B.", "Husband and I had totally planned to go to a different restaurant for dinner, but as we were walking down Division, we both decided Black Bull is a place we had wanted to check out for awhile and it might as well be that night!We were warmly greeted and offered a great table in the back. I started with sangria which was phenomenal and I wanted a porron to myself. (Tip: Wednesdays and Thursdays I believe have half price porrons of sangria!). We started with the tabla mixta which was just a plate of cheese, fruit, and meats and some herb that was on fire, so that was fun. We split a bunch of other tapas...all were excellent and the service was great. The head chef was in the back cooking himself too which I always appreciate!Will definitely be back here, especially for their happy hour deals. Seems like they have a happy hour deal most nights of the week, sometimes including food!"], ["Lex B.", "The food was pretty good,  and the waiter gave great suggestions for food (because they have a brand new menu so I couldn't look to yelp for assistance).  Sangria was also very good. I was surprised at their service.   My date had made reservations, and we were seated but nobody came to get orders.   After about ten minutes, we asked the host where our waiter was.   Our drinks were finally brought to us,  and nobody opened my date's beer.   Good thing I had a bottle opener on my key chain.   They also forgot things like spoons for our gazpacho.  And we always were the ones having to flag our waiter down.   But I do have to say that the free dessert with check in was delicious!!"], ["Morganne B.", "Black bull has some of the best tapas in Chicago. Tabla mixta=da bomb. Octopus... Yeeeeup. Croquettes? Gimme some of dat. Brussels sprouts with quail egg? Please. Suckling pig was the winner... Yum yum yum. We made a reservation for 4 at 9 pm on Saturday and somehow still had to wait until 9:20 to be seated. But they have pretty tasty sangria served from porrons to keep you occupied if you need to wait. Service was okay but we didn't mind with the amazing stuff going on in our mouths. A little more timing between the dishes would have been nice because we all felt a little rushed but better to get food faster than have to wait I guess. Go upstairs to Bordel afterward for another cocktail in a porron (these are much stronger than sangria though) and some great live music."], ["Bao L.", "Black Bull is a great place for tapas. My friends and I had a reservation at 9 pm on a Saturday, yet we still had to wait 15-20 minutes before we were seated. No worries, we just passed the time with a porron of red sangria and some lively banter. We ordered a ton of dishes, but here are some of the highlights:-Tabla mixta: a great combo of cured meats,  cheeses, fruits, and olives. They light some rosemary on fire that is stuck inside the cheese to give off a nice aromatic smell-Pulpo a la gallega/grilled octopus: tender and not overly grilled/chewy-Cochinillo/suckling pig: the star of the night! The meat literally falls apart when you put your fork to it. It also has a nice, fatty texture to the skin (my friend isn't a fan of fatty skin texture so she ended up giving me her share, too - talk about a win!). The squash mousse and berries play well w/ the pig. Suckling pig...you the real MVPSadly, we forgot to order the patatas bravas. Guess we gotta go back to try em!"], ["J. A. L.", "The new menu has far fewer items. BRING BACK THE QUESO DE CABRA! The pulpo (octopus) is phenomenal. The tabla de queso, including blow torched sage, is also very good. Enjoy a nice cocktail and sit in the sidewalk area. ¡Salud!"], ["David C.", "I had seen this place about a year ago driving by and only noticed the black sign that says bar for tapas. A closer look will reveal the shape of a bull hence the name black bull. That took a lot of work! Now the place was nice but we preferred to sit outside in the patio. He had some cocktails that were fine but not memorable. We ordered 4 tapas to share between 2 people: the berry and beet gazpacho tastes like strawberry yogurt, the croquetas de jamon y pollo and the daitles con tocino were what you would expect, but the highlight was the flamenquines...i wanted more!!! We ended the meal with a complementary dessert for checking in Yelp which is always nice. I am looking forward to going to the speakeasy Bordel to check that out...but don't plan to return for tapas...there are cheaper and better tasting alternatives in the city."], ["Elizabeth E.", "More authentic than babareeba but i am not sure that the food is better...Love love loved the bar bites, the $2-$3 items you can get to start are fantastic and should be tried. Loved the tortilla espanola & the pan con tomate. This to me felt like real Spain.They were out of dates, so no bacon wrapped dates :( that was a huge bummer. We had the octopus, jamon croquettes & the cochinillo - the cochinillo was fun, reminded me of my college days studying abroad in Spain. It was a bit salty for my liking but enjoyable non-the-less. The Octopus was good, not too chewy - croquettes were what you would expect.We split churros for dessert, these were only so so.Overall, the service was pretty slow and we were some of the only people in there. Wish I could give 3.5 stars but overall would round down to 3. This was A-OK... could have been slightly better, but it could have been worse too. Since I am a neighbor I'm sure I will go back again but not in any major rush."], ["Nancy Y.", "More like 3.5 stars because I liked the atmosphere, but for the variety of food we ordered, I didn't \"love\" more dishes than I hoped to.  Note the starred(**) dishes for my recommendations.  Overall, average to good food, great presentation, but slow service.We ordered the following:Aceitunas (olives) - according to Spaniards, olives should really be free, but they charge $2 here.  Don't pass up eating the garlic clove!Escalivada y Anchoas (anchovy \"bruschetta\") - taste was slightly off-putting, needed more lemon juice or somethingPan con Tomate - like bruschetta w/o the basil, and the tomatoes are grated**Tabla Mixta (\"charcuterie\") - highly recommend!Patatas Bravas - thick red sauce then topped with a foamy garlic aioli.  Overly done up and nothing special.Pulpo a la Gallega (octopus) - wasn't expecting nor a fan of the red sauce (I guess that's the Galician part), but pieces were very tenderCroquetas de Pollo - filling was a little too oozy**Paella Valenciana - fave for others**Arroz Negro (squid ink & fish) - fave for me & husbandLangostinos (prawns) - the brain juices were black and way too marine life-y!Tataki de Atun (seared tuna) - recommended to us by our waiter, but we were not impressedPan con Chocolate - bite sized savory crackers with a chocolate stuffed raspberry and dehydrated cheese and olive oil.  Didn't really fit in the menu and was just ok.A few things to note:- They have a section on Conservas (preserved and canned seafood), which is actually popular in Spain.  We didn't try.- There are 3 choices of paella/arroz, and you must get a minimum of 2 servings; however, the prices on the menu are per person (ex: $13/pp), which is misleading since you have to get 2.  $26 for a small cast iron pan (which is 2 servings) is hefty!- Service was really slow, which is good if your group wants to stay and hang out.  But our waiter wasn't very attentive.- We got here around 6 PM on a Friday, and it started getting busy around 6:30 - 7.- They have a nice outdoor patio.- They have quite a few cocktails, two kinds of Alhambra beers, and Spanish cider.After tip, it was $45-50/pp with 1 drink/pp."], ["Andrea H.", "Came last night for a friend's birthday dinner and while it was overall an ok experience, there was a few snags that were seriously annoying. The waiter was great. He was the right amount of passionate about the food and the restaurant's concept without being annoying. He also immediately fixed our table which was rocking all over the place. We proceeded to order a pitcher of red sangria and i had a Gin and Grapefruit tonic. The drinks were refreshing and interestingly presented in a medicine vial (Sangria) type thing. Thank gosh the waiter poured them. We also got an assortment of tapas, including the Empanada Gallega, Pulopa a la Gallega, Croquetas De Pollo & Jamn, Vieiras con Jamn Ibrico (scallops), Dtiles Con  Tocino, and a brussel sprout salad topped with Quail Egg. This was split between five girls and we probably could have ordered a few more dishes as I don't think anyone left feeling super full. Everything was flavorful and nicely presented but several dishes (like the brussel sprouts salad especially) were served lukewarm. Also the bus boys were overly zealous and kept yanking plates out from underneath people, it was seriously annoying. I literally asked the kid \"where are you going with my plate??\" when he took mine away. Really?? I didn't understand it because the restaurant was NOT super busy so I don't think we needed to accommodate the next reservation or something. Nothing was really amazing in my opinion except for the free deserts we got. One was free for the yelp checkin (Blueberry Cheesecake) and the other was a lava cake for the birthday girl. The Lava cake was amazing. There was also a few drinks on the menu I would not have minded trying. I may come back for the ambiance and to check out more drinks and hopefully for that cake! Next time I think we'll sit at the bar which looked like a lot of fun and check out Bordelo upstairs."], ["Gabriel H.", "Stopped in for some sangria and ended up ordering food. The food was delicious and the service was really good."], ["Ty R.", "We ran across this place by accident, but we had a great experience! The waiter Alex was absolutely amazing he took the time to explain the menu to us and made recommendations based on what we told him we were in the mood for. It is a little pricey we had a party of 6 people so we ordered a variety of tapas, a couple of entrees to share 1 bottle of wine and some sangria and the bill was $325. But then again you are in Chicago so if you're used to dining out this may not shock you."], ["Maggie M.", "My husband (Spanish) and I (I've lived in Spain) ordered the sangria and a beer to start. The sangria was good and there was a lot of it for the price. We ordered the croquetas, pulpo a la gallega, and patatas bravas. The croquetas were good (but you can't really mess those up). The patatas bravas were not great, they lacked flavor and we're just ok (nothing like the real Spanish patatas bravas. The alioli lacked garlic). Then we ordered pulpo a la gallega.... Complete disaster. It looked and tasted nothing like pulpo a la gallega. There was so much... Way too much paprika, the chunks were so so small and the actual octopus was not fresh.The service was Just ok. The waiter seemed distracted and not very attentive. The owners (or managers) were drinking sitting at the bar on their computer not going by the tables to see how things were (they were Spanish, so maybe they didn't speak English but we were clearly speaking Spanish at the table). The lady (owner or manager) did not come by our table once. (There were literally three tables taken in the restaurant). I've worked in restaurants for many years.. And I know that when service is slow... You have no excuse for bad service. The decor was great, and if you aren't accustomed to authentic Spanish food, than give it a try!! But for us, we're still on the search for an authentic Spanish restaurant in Chicago."], ["Evie H.", "I came with two of my co-workers after a full day of not eating anything. Our waiter was really great and attentive to the needs of three people about to pass out. Brussel sprouts, beets, quail egg - I can't say that I'm a fan of brussel sprouts or beets but eating this dish did not change whether I liked these ingredients more or less so A-OK. The quail egg gets its own +. My friend who loves brussel sprouts said that these were just okay. Crispy Potatoes with salsa & aioli - I enjoyed the crunchy exterior of the potatoes and the soft interior. Salsa & aioli helped the potatoes along quite a bit. Mini hamburgers with spicy potatoes - Hands down the best dish of the night. Pricey for two hamburgers that are smaller than the size of my palm but 1) They are adorable 2) Taste delicious. Again, a + for the quail egg (can you tell I like these?) Spicy potatoes were fabuloussss. I need someone to cook this for me. Grilled octopus with potatoes - I'm happy to say that I tried this even though octopus freaks me out. For octopus lovers, you might like it. It's like calamari, just not fried. Blueberry Cheesecake - Um, choose 1 free dessert for checking in on Yelp! This was a great ending to our late afternoon sidewalk meal. It was not too sweet nor was it too dense for a cheesecake. Perfect. Tapas dishes are all great for sharing with 2-3 people. 4 might be stretching it if people are hungry."], ["Angie K.", "Black Bull is all Bull.I was so excited to try another tapas spot and made resos for Mr. K and I on a Friday night. We love Division St and the tons of restaurants in the area, and we expected to fall in love here as well. Unfortunately, we only came across pure bull**** here.Don't get me wrong, the decor is cute, with red walls with funky artwork hanging and the crowd consisted of couples, happy-hour parties and girls night outings which is the norm for this area. Our server took a while to approach us and I noticed she had a Spaniard accent which probably helped her secure the job. I say this because she was MIA most of the time we needed something. We ordered a sangria (which was good, not extraordinary), she forgot and went somewhere for like 15 min. When she returned, we ordered pulpo (our fav thing), queso de cabra, patatas bravas, clams and datiles which were subpar. We wanted to order more food and drinks but our server must've found something better to do because she never showed up to take our order or check up on us. I got so frustrated, I had another server bring our check so I can gtfo of there before I went bullfighting on her.Thankfully, my Friday night wasn't ruined since we were so close to 20 other bars/restos, we got to check out another new place. Sorry BB, I won't be back. You can keep the bull."], ["Gina W.", "Great food! Great service and very cool atmosphere. Can't wait to go back and check out their other restaurant upstairs!  Very sweet and friendly staff.  We had about 6 different things off the menu and all were fantastic. Try the canning! I had the sardines and they were amazing!"], ["Jami S.", "My maid of honor and I went here after our wedding makeup trial.  We did eat at the bar and we didn't get any alcoholic beverages.  But the bartender couldn't have been nicer and told us to come back and try a couple of his favorites.  The food came out quick and tasted great.  Always a fan of shared plates.  The vibe is very chill and I heard there is a great lounge upstairs.  We will have to go back and give it a try."], ["Julianne Y.", "I love this place, great food and ambience.  Very cute and dim, perfect date night.  Tends to get noisy and crowded and impossible to get a table without a reservation."], ["Juan A.", "The service was spot on. The octopus was great of the bat and I just added some like to take it to the next level. Great wine selection of Spanish wines. Great atmosphere with Spanish and Latin music. Will definitely come back."], ["Mahsa T.", "Such wonderful and welcoming service for our private gathering at Black Bull. Great ambiance and they had a flamenco band and dancer performing just for us, which was a great treat! Once you step inside, the decor, the music and the people make you feel like you're not in Wicker Park anymore, you feel like you've stepped into a cute little tasca in Spain. Plenty of well-made sangria to go around and I had a chance to sample the paella, which was awesome, I inhaled it.I will be back to have a sit-down meal and really experience the food. They have a lovely outdoor patio and I'm looking forward to the opening of their new upstairs lounge which will be called Bordello!"]], "Azucar Tapas Restaurant and Cocktail Bar": [], "Avec": [], "mfk": [], "Cafe Ba-Ba-Reeba!": [], "Paola's Vinum": [], "Vera": [], "Twisted Tapas": [], "Salero": [["Alex B.", "I recently had a lovely lunch at Salero, just on the western edge of the loop.  Close enough to walk from my office, far enough that it was not crowded.  A pleasant, calm interior and attentive wait staff made for an excellent business lunch.The 3 course prix fixe menu was lovely.  I had garlic soup - light and flavorful with a delicious poached egg which thickened the broth when its yolk mixed into the soup.  Gulf shrimp a la plancha were also lovely.  Delicately flavored with sherry on a bed of tender grits.  Great dish.  Dessert was Flan de queso fresco with Blood Orange.  Also delicate and refreshing.This is a terrific spot for lunch - great for conversation and food which is delicious and perfectly balanced for lunch, not too heavy and very flavorful.  Can't wait to come for dinner."], ["T. L.", "Finally made it here after this place being on the list for months and glad I did!  Food was all good with flashes of brilliance: Apps- started with quail (good but better in concept than execution, the flavors didn't quite meld), burrata ( yeah it's burrata- pretty hard to mess up), octopus (good flavor but thicker pieces were not quite tender enough), piquillo peppers (one of the best apps, meat was well seasoned and tender, slightly spicy), shrimp ( 3 in the order, fantastic flavor), scallops ( very well prepared, lightly seared and flavorful)Entrees- duck breast ( good but fat wasn't totally rendered so skin not as crispy as it should be), steak ( good but nothing that made it standout), cod ( very light and broth was delish), lobster ( holy crap, absolutely best dish of the night- the flavors melded together in creamy loveliness)Dessert- semifreddo, churros (heavenly, light and amazing), olive oil cake (ok)Food and service was good, atmosphere was ok- we were at the front of the restaurant, not in the main part of the restaurant so maybe that would be better.  Seafood is definitely their thing, would be willing to do a repeat visit..."], ["Bridget D.", "Our group shared several tasty dishes, and enjoyed great service and cocktails. To start: barrata, shrimp a la plancha, stuffed peppers, chorizo stuffed quail, octopus. All delicious with quail and peppers being my favorites. Entree favorites: lobster with chorizo and rice, cod with white beans, hanger steak. Dessert: churros are all melty and to die for."], ["Shawn S.", "We stumbled upon this place after a meeting in Chicago.  It was only 5:30 so we were able to be seated but had we shown up later it was packed.  Our server was great and very helpful explaining items on the menu we were unsure what they were.  Presentation was great, actually large sized main menu portions, and cooked to perfection. We had the scallop apps along with the shrimp apps and then I had the fish of the day and followed it with chocolate dessert."], ["Mehran F.", "(edited Sept. 6, 2015  another dumb message from the same idiot associated with the restaurant.  Somehow they don't understand it is better to listen to customers, accept a 3 star feedback, rather than put customers down and get lower rating).(edited on Sep 2, 2015  my original review as below was a 3 star review but yesterday i received a bit of rude sarcastic message from someone who seemed to be associated with the restaurant...so i'm now making it one star.  This person only has one review in their profile and it is a rude response to a reviewer of this restaurant...so if you're gonna be jerk about it, ....)*********** original review ********OK food, a bit confused (not me).Chorizo stuffed quail 2/5. When i see quail or chorizo, i jump on it. This was nothing memorable.Tripes: description was great. Result 1/5.Scallop: 3.5/5Lobster: 3/5. but its risotto was bad...mainly tasted the canned tomato sauce like bad wet Mexican rice.Green salad: I did not try it but one of my friends did. It looked real good.Olives. NiceOlive cake:  I have a weakness for it but this was 2/5 mainly because of good presentation, fruit and no powder sugar.Flan: 2/5. too sweet.Chocolate mousse/brownies/whatever it was: 2/5Service by Christopher: very good, non-obtrusive, professional. All staff were good and kind.Our friends/company: 5/5 and made it a real fun and pleasant evening, even though i did not think food was anything to write home about. Hence a 3/5 for the restaurant, else would have been a 2/5.While there, a bus load of people came for dinner. I reckon this place is more for such crowds not real foodies."], ["Tracy X.", "Food was ok, and it was pretty over-priced, so overall I'm not that impressed.I like the decor and the ambience. It was definitely nice, but also pretty casual. Appetizer:We shared the octopus. It was very sweet of them to just split it into 2 plates for us so it was very easy and clean to share. I wasn't thrilled about the food itself as it I found it pretty lacking in flavor.Entree:- Pork Collar - it was a very tender and well roasted piece of pork indeed. Not a fan of the dead looking vegetables on the side.- Lamb shoulder - same thing. The actual chunk of meat was cooked to perfection. The lentils that came with it? I think not. Normally I think the side things a main dish is served with should bring out the best of the dish, but here somehow they achieved the opposite effect?Dessert:Olive oil cake! It was decent, nice and spongy and not too sweet, topped with some cream and rasberries for a contrast in flavor. Didn't blow my mind though.At the end we each had a drink, shared the appetizer, each had an entree, then shared a dessert. Nothing was spectacular. The bill came out to be $120 before tip. I'm all about shelling out for food, but at that price I can have a lot more bang for my buck elsewhere."], ["Melissa N.", "Came here for dinner on a Saturday night. Food and service were very good and ambiance is okay. I think the food is a bit overpriced even by Chicago standards, though, hence my lack of enthusiasm. Drink prices are good but extraordinarily high. We couldn't find a bottle of red that looked good for under $50. We lucked out on the appetizers: the burrata, the octopus, and the watercress salad were great. The sausage pepper dish was good but not as good as I expected (not a fan of soggy peppers). For an entree, I had the grilled hanger steak, which was excellent. We shared flan and a spiced cake of some sort for dessert, and both were lackluster (the cake was especially blah: super dry). Overall, I had a nice evening but things just didn't live up to my expectations."], ["Kevin T.", "After recent visits to other highly touted restaurants that failed to meet my expectations (looking mainly at you, Parachute), my expectations heading into this place were cautiously optimistic at best.Once our appetizers arrived, all doubts about the place melted away.  Every dish I tried was delicious and presented beautifully.  For myself, I had ordered the grilled pork jowl and it may have taken the spotlight from even the entrees.  Amazingly tender with the perfect balance of flavors. I'm drooling just remembering it (I shouldn't be typing reviews just before lunchtime...)The other dishes I managed a taste of were the serrano, the scallops, and the tripe.For my maincourse, I had the whole lobster over rice. The lobster was a bit overcooked for my liking, but only slightly.  The flavor of the dish overall, however, was phenomenal.  My dish may have been slightly overshadowed by my friend's duck dish.  The duck was perfectly cooked and the foie gras was maybe one of the best I've ever had in this city!Overall, Salero has found a place in the heart of my belly.  Recently, there has been a lack of restaurants I've tried that I would want to revisit again so soon, but Salero seems to have bucked that trend."], ["Lorenzo L.", "The food we ordered was nicely prepared, and beautifully served.  And in all honesty, I really enjoy a place where I can eat an awesome dinner, and go dressed in jeans.  But the service at Salero was not commensurate with the prices.  There is a certain modicum of service most of us  expect when a la carte entrees range from the mid $20-$30 and the wines by the glass are from $14-$23.  ( I'm just saying...OK?)  Granted, we dined here on a Saturday night.  I call it amateur night, because  if a place has any flaws, they will always creep out  on a busy night . That exact scenario played itself out on our visit,   I phoned to let the house know that we were running a \"few\"  minutes late, and was queried abruptly as to \"how many minutes?\".  When we arrived, the host at the door had the same  imperious attitude .   It must have been the same person I spoke with on the phone a few minutes prior.  Our server came to the table within 3 minutes, and asked if we were ready to order dinner.  We hadn't even seen the wine list yet or ordered a cocktail!   I had to flag him down to get his attention after we had perused the menu and made some decisions.   Between the abrupt host and the frenetic server, I have no hesitation in saying that Salero has some issues with the front of the house that need addressing.   The kitchen has it together."], ["Jackie M.", "I went there for the prefix lunch - 3course for $25. OvHere is the combo:Jamon Serrano with manchego cheese and marcona almonds -Grilled pork belly with braised kale, hazelnut -VerFlan de queso fresco with fresh cheese infused custard with blood orange gelandSopa de Ajo- garlic soup with poached egg and toasted breadScallops with roasted califlower, pepita pesto, rains, and roasted squash romescochurro with milk jam and espresso puddingOverall, it was good, fast, and attentive service. For a spanish cuisine, the flavor was light and not full of spice.  The food presentation was beautiful. The pork belly was very lean and not fatty at all. The flan was very smooth and flavorful. It's one of the better flan I've ever had. The garlic soup is more of a french onion soup, except the base and the flavor is lighter and not salty. For the scallop, it came with 2 jumbo scallop made medium and just right. It taste like regular seared scallop where you can order from any better seafood restaurant, (except here for a better price) where the flavor was accented by the pesto sauce. The churro was fried fresh which it took awhile to prepare. Otherwise it was a very enjoyable lunch."], ["Juieta C.", "I love Spanish food hence was quite excited to check this place out. Luckily we had a reservation since this place was packed on a Friday night. We tried the jamon Serrano from the pixtos menu,  King crab and burrata for appetizers, lamb shoulder as the main course and churros and flan for dessert. Out of these 6 dishes, I thought the crab and the flan was okay. Rest - meh. Burrata wasn't creamy, jamon was cut too thick, lamb somehow didn't hit the spot and the churros (which I I came here) wasn't as crisp as I would I liked it. On the positive though, service was good."], ["svetlana k.", "Cozy Spanish restaurant, great date spot. A bit expensive. For two drinks, two appetizers, and two entrees= $122 without tip. The food also did not stand up to the prices. The cocktails were reasonably priced at $12 and were probably the best part of dinner. Started off with grilled octopus ($14) and sweetbreads ($17). The grilled octopus was served with foam on top. I hate foam, it looks like spit and the texture is awful and it has NO place on an octopus. Definitely not visually appealing. The octopus didn't have that grilled crisp skin or that charred flavor that I love. It was a bit too soft in texture but at least not rubbery. It was served with flash cooked quinoa, actually really good much better than the octopus itself. The sweetbreads dish was tiny, especially for $17. Sweetbreads is the cheapest portion of \"meat\" you can purchase, for that price there should definitely be more served. The sweetbreads themselves were fine, nothing out of this world. The carrot purée it was served with was delicious. I would have rather ate the carrot purée and I do really like sweetbreads in general. For entrees, my friend and I ordered pork belly ($25) and a seafood stew ($33). It wasn't a typical pork belly, more like an actual piece of pork meat, not very fatty at all. Unfortunately, it wasn't falling off the fork kind. Had to actually use the knife and chew through it, wasn't melting in my mouth, had better pork bellies elsewhere in the city. The seafood stew was pretty large, came with scallops, fish fillet, mussels, and some fingerling potatoes. The seafood itself was cooked perfectly but not much flavor. There wasn't much soup happening in the dish. Overall, it was a tasty dish but nothing to write home about. It left me begging for more flavor. It would have been better if served with bread to soak up some of the liquid. This restaurant left me begging for more flavor. I can't say I was impressed or that I will be rushing back to come back and tell all my friends about, unfortunately. I will come back for a drink at the bar as it is super cozy and they offer bar bites. But I would recommend skipping the dinner itself."], ["Jaclyn H.", "Excellent!! The octopus, scallops, burrata, lamb, oxtail were all delectable!!! And the churros was amazing! The classic gin and tonic was incredible.The service was attentive, knowledgeable, and friendly. Very clean and nicely decorated. Job well done!!!"], ["Rich M.", "Food 5 starsService 2 starsI write this review to hopefully help this potentially amazing restaurant. Salero is at a cross roads and can either continue to soar or drop off Chicago's crowded restaurant scene.  This place has everything it needs to succeed, great atmosphere, good location and amazing food.  The one thing it seems to lack is front of the house management and service.  We went for dinner and ending up leaving after a few starters even though the food was delicious! The service was friendly but lacked training.  The bar was out of several drinks and we tried to order something off the food menu and the server came back and the kitchen was out of that.  The women's bathroom was a mess.  The server comped some drinks even though we never complained.  It was appaernet that the service was not properly trained and we actually just felt bad and left.  I really hope they get on the right track because I would love to go back and try more of the flavorful and inventive dishes.  Good luck Salero:)"], ["Katherine G.", "I love a great Spanish restaurant & this lived up to the hype. The location is a bit out of the way from the other West Loop restaurants, but once you get inside, it's a cozy little spot, nice bar to wait for friends and great ambiance. The food was spectacular and authentic, there was a great wine list & the waiter made great recommendations. I highly recommend the octopus and shrimp with heads, I split these with two others, and then split an entree which was delicious and well sized for the three of us. It's a bit pricier, but worth it for the quality."], ["John G.", "First of all the food was wonderfully prepared, however, the spices were on the edge of my comfort zone. The octopus was a favorite with a nice char over a delicious salad. The sepia was out of my taste zone but others loved it. The shrimp with heads was also quite good. We split the Lubina, which was perfectly cooked but had that taste of spices that kept throwing me throughout the meal. The deserts really shined. The flan with blood orange was outstanding and the churro were light as air. Drew did a great job of explaining our meal and made good suggestions. They had a nice selection of Spanish whites and our favorite was the Eidos."], ["Blake M.", "This is my wife's favorite restaurant. I agree with her that this is an awesome place. Chef is clearly very talented and food selections are absolutely spectacular. I've never had a bad dish here yet and we've been in 5-6 times. Wine list is awesome and servers are extremely friendly, helpful, and not all over you like some places can be. For dessert you must order the churros and glass of PX. Best pairing ever."], ["Paul W.", "Quality service and exemplary food. We were delighted by our first visit to Salero.Cocktails and wine selection were interesting and good.Even the salad was distinctive. Nuts, blue cheese slices, and freshness that is not to be taken for granted. The trio of rabbit made an intriguing entree, including a homemade sausage, a fricase of the leg, and a tender breast. Delicious vegetables and a beautiful presentation.Our server was professional and friendly, too. She offered advice without steering."], ["Sofia J.", "Just the fact that their dinner menu is far superior to lunch menu takes away a star (based on my lunch experience I wouldn't come back or recommend, but having looked at the dinner menu I'm very eager to return).Garlic soup - tastes more like an onion/vinegar soupAnchovies (gilda & boqueron pintxo)- gave anchovies another try, still turned off, too salty, especially when paired with salty/sour condiments. If you order this, ask for bread.Cabeza croqueta - deliciousBurrata - great combination w/sweet blood orange preserves, buttery endive, & morcilla- just wish it wasn't on toast - the bread was too crusty, biting through the incredibly soft toppings and creating a mess/ripping apart your upper palate is undesirable. Halibut - enjoyable light dish (great use of fresh spring vegetables), but not something I would order again in a restaurant, too simple for my taste. Flan de Queso Fresco - outstanding, GET THIS. Blood orange, caramel, and fresh cheese flavor and texture bomb. Best part of our meal.On a service note - lunch took too long. The first few dishes came out quickly and then we waited a while before the entree came out (acceptable for dinner, not for a weekday lunch). Our busser kept forgetting to bring silverware with the food, adding to the wait time (I would rather wait 5 extra seconds but get the utensils required to eat the meal with).LOVE the decor!"], ["Katie P.", "I am a small person, but I eat a lot of food.  This was not the place for me."], ["Mark A.", "It would be in poor form to start off this review and not compliment the service. We had a fantastic waitress who knew the menu and drink list, and I always appreciate front of house staff who demonstrate they are familiar with each plate/glass.So Salero has a good PR buzz going on right now, and what made me book a reservation was its inclusion in Eater's \"must eat right now\" spots in Chicago.Some reviews have said this is the \"King of Spanish Cuisine.\" And on the Salero FB page, it calls itself a Spanish Restaurant.My friends, Salero is a contemporary American restaurant with some Spanish touches. It is far from being a Spanish restaurant. (And there's absolutely nothing wrong with this, but I don't appreciate the \"lie\" -- if it quacks like a duck, and walks like a duck, then it's a duck.)The menu has small plates/starters and main courses sections. And each dish tends to have something Spanish about it, whether that be saffron, sherry, manchego, or chorizo. But they're not necessarily Spanish dishes, if that makes sense?Ok, I'll stop whining about the bait and switch. Let me talk about the food:- Olives = fine.- Morcilla/Foie Gras = good; deconstructed so it was challenging to get all the flavors in one bite (which is what makes the dish good)- Scallop crudo = smelled horrible but tasted fine; good flavors- Chorizo stuffed quail = looks great on paper, just average in person- Duck Breast = cooked to my liking (rare), skin was soggy (if I'm going to eat fatty duck skin, I like it crispy), croquette was boring as was the mushroom preparation- Txuri = average; it wasn't bad, but nothing I'd ever crave- Zarzuela = again -- average, somewhat bland, but if that's what you want in a dish, it's probably okAgain, I need to reiterate the service was very good. But even if I know the nicest waiter in the world, if he/she works at a restaurant I don't like, then I probably won't be seeing them much.The food was ok (also, I'm a Wood fan), but I fail to see how this could be in the same category as Iberico/Mercat/Vera as a Spanish competitor. I won't be rushing back and probably won't recommend it since there are much better places in Chicago."], ["Meatdowntown C.", "Undoubtedly, the best Spanish recipes ever!  The duck a la plancha is phenomenal. You can also never go wrong with the scallops. When it comes to drinks, I have not tried the Sangria because they have such a good selection of wines that keep changing when I come here. Also, the \"churros\" are a MUST try and they are not very big so don't worry about your calories so much.They are simply delicious.Great food must be always paired with good wine and most importantly GREAT service.  I must confess that Salero has the three elements well dominated: excellent dishes, great wine and five star customer service!"], ["Olivia B.", "We came here after dinner on a Sunday night for some drinks. I will say 1 thing: GET THE CLOUD 9. That cocktail is AMAZING. Refreshing, a bit sweet, just so tasty. As the host warned me, they \"go down like water.\" ;)Anyway, we ended up staying for a few rounds of drinks and the bartender, host, and servers were all very fun, kind, and chatted with us for a bit. We had a great time.Even though we had JUST had dinner down the street, we ordered a few plates: olives, sepia a la plancha, pan con tomate con jamon, and the croquettes. We enjoyed everything very much, and especially enjoyed their \"pintxos\" menu for our time at the bar.We'll be back!"], ["Tawanna W.", "Ambience, service, food and attention to detail was amazing! Chris, who I later found out is the wine director, was our server and he was amazing! I was a server many moons ago and Chris seamlessly handled the bulk of the tables in the rear of the restaurant. I came with my husband to celebrate our anniversary and we were treated so thoughtfully and kindly! Happy Anniversary was printed on our menu's and Chris wished us a happy anniversary as soon as he came to our table. The food was excellent! There were many layers of flavors to each dish as well as thoughtful surprises on each plate. We had a four course meal but the food was so light that we didn't feel stuffed and heavy. We ordered the flan for dessert and it is the freshest and most flavorful flan I've ever had! To top it off Happy Anniversary was scrolled in chocolate on our dessert plate. Prior to getting our check we received two delicious mini almond chocolate cookies. Salero is now our go to restaurant for special occasions and when my friends and family come to town from NY.We ordered: -Chorizo stuffed quail and crab for the appetizer (explosions of flavor) -Hangar steak and duck for our entrees (cooked to perfection with wonderful vegetables and sauces to accompany them)-Flan for dessert (fresh and flavorful) *Hubby had an epa and ipa to drink with dinner while I had the still rose and coffee with baileys (to accompany dessert). Everything was absolute perfection and we would order it all again if the menu didn't have so many amazing options to try."], ["Adrian J.", "We had a chance to try this place out on a Friday night. I'll be pretty short about it. The dishes are good but the portions are pretty small for how much you're paying. The service, as has been mentioned it previous reviews, needs improvement. Our waitress walked up and filled our water glasses without saying anything then launched into a greeting . A bit awkward. She was professional but just didn't seem friendly or happy to be there. My drink was empty for a good 15 min before she noticed it and asked if I wanted another. In addition she just assumed we wanted to see a dessert menu without asking us. This place has some potential but for the price they're charging it's not living up service wise. Seeing as there's lots of other places within walking distance I probably won't be coming back for a second chance."], ["Stephanie L.", "Wowser....this place was unexpectedly, amazingly, delicious food.Atmosphere was bustling on a Wednesday night.  Slightly rustic...slightly crisp...kind of a great mix of both.  GNO for my belated bday dinner.Service was good.  We ordered in pieces and our server was a little busy when we wanted to order our main, but overall she was exceptional and knowledgable....not only about the food, but the yummy cocktails my friends ordered.Drinks were amaze!  Gin, tonic, grapefruit like thing in a huge goblet wine glass....refreshing.  Also another friend got a different drink...can't remember the name but she loved it.  I think you can get your fill of wine or cocktails at this place....there was a book for da drinks.  The smallsMackerel was delish.  Crisp, light with the right amount of zing.Octopus was cooked to perfection and again, the right amount of tart to savory.Beet and shallot salad was good...nothing amazing but you have to get a dose of veggies.Pork confit was my fav of the small plates.  Savory and rich, but not too much.  Fried up wonton-like potstickers were a great compliment.The bigVENISON-do it, please...just do it.  It was a generous portion.  The meat was cooked to a perfect medium rare.  It sliced like butter and melted in your mouth.  Not gamey at all.  One of the top pieces of meat I have ever put in my mouth...so good.  Salivating while I'm thinking about it.DessertCHURROS!!!  Were the Heros!  Soooo good.  Came with an ice cream and cream sauce...a little salty, a little sweet, a little crunchy...it couldn't be beat.Damn, it was great.  I was expecting really ok and I got my socks knocked off."], ["Carol K.", "Checked out Salero the other night which is the newest restaurant to come from the same people who run Wood up in Boystown.This sleek, Spanish restaurant is in good keeping as it's neighboring restaurants are Avec and Blackbird.  We went on a recent week night and were impressed with the service, food and ambiance.If you were here when the space was Alimentari Osteria, you will recognize nothing about the space as it has been totally redone.  The bar area is now in the front serving great wines and pintxos and in the back in the actual restaurant area.  The space is a bit stark with rustic tables and chairs.  I loved the ambiance that the candles lining the east wall bring to the place (Hmm . . .wonder who has to light those each night?)We were on our way to the Opera and they did a great job of getting us in and out but never making us feel rushed.  Our server was great and made sure we knew about the various specials and was quick to describe his favorites on the menu.We started with a couple of the special appetizers of the day, a Hamachi crudo which was delicious and then some percebes.  What?  You don't know what a percebe is?  Well neither did we and since it is not often I get stumped at a restaurant, we just had to order these little Portuguese barnacles.  They were as odd tasting as their name and I doubt I would order them again but fun given we didn't even know how the heck to eat them!For our entrees- I had the pork belly with crispy kale and my friend went with the lobster and risotto dish (his was the clear winner!)  But both were quite good.Dinner for two with a couple of glasses of wine ran about $127 so not too bad for the quality of the food we received.  And if you drive- know that there is valet parking out front shared with Avec and Blackbird.If there was a down side, it was that the space is a little loud as there is nothing to block the noise from reverberating in the space.  There was a table of men who were obviously going to the hockey game sitting down from us and their conversation was pretty easy to hear.Check out this newest addition to the West Loop dining scene.  Even if you just sit at the bar and enjoy a few little bites with a glass of wine, the experience is well worth it!"], ["Christina D.", "The restaurant has a contemporary modern feel, dimly lit with intimate surroundings. We shared the jambon with tomato garlic bread, it was delicate yet full of flavor. Then we had the duck with fois gras and crispy rice. This dish was excellent ! It was a rich dish but not over powering. The duck was perfectly prepared. I prefer the duck dish at Salero than I do at Blackbird.  It was birthday and they very kindly offered a glass of champagne on the house! Our waiter was very knowledgable about the food and it's origin. He was also friendly and welcoming.We had a great night! I will definitely be returning."], ["Zsiberian N.", "Helped me discover Sherry, which is a bit more fortified wine but not quite Port. Took amazing care of us and when they found out we've just made it official made a wedding cake for us out of their desserts! On the way out the owner was greeting a couple with \"you're back again?\" And then replying that yesterday wasn't enough.Look forward to being a regular. Highly recommend."], ["Sarah H.", "My friend and I went to Salero last night and had one best meals and evenings I've had in awhile!  Rex, our server, was very attentive and we had no unmet needs.  He was fabulous and funny.  We both choose to go with $75 tasting menu.  At first, I was nervous it would not be enough food - boy was I wrong!  I should say this because my last outing with this friend we went to Boka, where each plate was a mere 2-3 bites.  I'm happy to report, this was not the case at Salero.  Each course was full of beautifully prepared proteins (very well portioned) and memorable flavors.  I think we high-fived one another a few times during the meal because the food and drink (and of course, we were truly enjoy the company and beautiful spring day on the patio) were just that good!   My favorite course(s) was the mackerel and steak - immensely flavorful and beautiful to the eye."], ["Ani L.", "We popped in expecting nothing and got everything and so much more! We enjoyed some white sangrias  and ordered the tasting menu. Our dinner was a plethora of tapas, seafood, oxtail, pork, and dessert (cheese, honey, CHURROS and hot chocolate). All very good and well proportioned. Stop in.  I'm sure you'll be pleasantly surprised."], ["Brit N.", "A little disappointed at this place. It was in some food article on top chicago places to eat and I don't agree at all. Yes, the food was delicious (4 stars), but the service was horrendous! It took us 40 minutes to get WATER and finally order our cocktails. Then another 15 minutes on top of that before the waitress came back and explained the menu. She was not attentive at all. They screwed up our order and said I ordered the veal sweet bread (which I didn't do). So they took it back, but they she charged us twice on our bill for the veal sweet bread (an additional $30). She asked if we wanted dessert and when we said no she literally ROLLED her eyes and said she would go get the check. Seriously?? I'm sure the dessert was good but we had enough of the service and just wanted to leave. I've seen a few comments below about how bad the service was and I wish I would have checked yelp before I went there. Not sure if we are all talking about the same waitress or if your service sucks all around. Either way, figure it out or that place won't stay in business. Also - there was no music in there which was awkward. Just a ton of people talking. Maybe add sounds barriers and some music to help with the overall atmosphere."], ["Sebastian S.", "Great, tastefull and creative food. Cocktails and Gintonics are good as well. Service was very friendly, and very attentive! Some music would help to improve atmosphere a bit, but would definitely come back anytime!"], ["Jennie M.", "We had a myriad of dishes and everything that came out was delightful. If you live in Chicago, make it a regular event. If you are visiting, take the time to enjoy a meal or three here."], ["Stacy N.", "My fiance and I went there to celebrate some minor life victories, so we were ready to spend some cash. It was a Thursday night and we had made a reservation so we were seated right away by the nice man at the door. The place was pretty busy for a Thursday.Love the decor and environment. Urban yet sophisticated. No complaints about the food!! Everything was delicious! We had olives and the Spanish mackerel to start then moved on to the duck breast and the lobster. The flavors and portions were perfect. Finished it off with the churro. Fried deliciousness. Out bottle of wine was really great as well. Ok, the service. That is my reason for 3 stars. I don't know if she was new or what, but she wasn't great. She wasn't super attentive or friendly and when we told her we needed just a few more minutes, she didn't come back for a good long while although we could see her at other tables. I had to set our menus out on the end of the table so she could get a clue to come back. I used to be a server myself so things like this really bother me.Another thing is that she hardly looked at me once. She spoke only to my fiance whenever she was at the table. RUDE. She even had her body facing away from me and towards him the entire time. I know he's cute, but COME ON.Every other person who worked there seemed extra friendly to us except for our server. I am definitely open to returning because the food and wine was stellar. Hopefully we will get another server."], ["Marcio R.", "This is a great quality Spanish restaurant. Not your usual tapas place. This was our 3rd visit and it was PERFECT. Appetizers: oxtail and pulpo. Main: duck (awesome). Desert: churro. Waiter Christopher was highly professional and generous."], ["Mihir P.", "I had a wonderful lunch here at Salero. The decor is modernly rustic if that makes sense? Probably not.I really can recommend everything we ordered including the MARCONA ALMONDS, JAMON CROQUETAS (loved the smokey romesco sauce), and SCALLOPS A LA PLANCHA. My friend had the special short rib grilled cheese I think, and she loved it.Our server was very friendly and knowledgeable. They also have a nice bar area, so I'd come back."], ["Polishbadger D.", "This is an overdue review, so here we go.  I have had drinks and pintxos twice here and each time the service, beverages and food were delectable.  The location is clutch, near the el and tucked among other great places in the West Loop on Randolph Street.  Between my two visits I ordered every pintxos that was on the menu (minus the anchovies, can't do it). Top 3 faves are the QUIMET & QUIMET, PAPAS BRAVAS and JAMON IBERICO.  As for drinks, I stuck to my old stand by (dirty martini, vodka, up, olives), but others I dined with enjoyed a variety of the cocktails offered.After my first time here, I noticed that some people would go in a separate door and up a staircase.  Of course, curiosity got the best of me, so I inquired what was going on over there.  The lovely owner, Franco, came over and told us it is a private event space and offered to let us check it out.  The timing was perfect, because I was looking for a smaller venue to hold a professional event for work.If you are looking for a unique, ideally located, versatile, but not too huge space to host an event, you  must check this place out.  The event coordinator, Ashley, is a cut above the rest when it comes to planning and making your event perfect down to  the last detail. She is easy to get in touch with, has great ideas and in general is a fabulous person.  Pricing is very reasonable, especially for the neighborhood."], ["Ben K.", "Wow. Every bit of the night was amazing. The cocktails before dinner were delicious without being overpowering. The bar appetizers were phenomenal especially the Jamon croquettes. So delicious. The rest of the dinner continued to be above expectations. The small plates were terrific and I really loved the scallops. My favorite large plate was the rabbit though it's perhaps discontinued. The salmon was also tremendous. The three desserts we had were amazing. If you're looking for a great dinner in a relaxed environment you should check this out. Great for a romantic dinner or for a group outing. It's really perfect."], ["John S.", "OK, the food here was truly wonderful.  Appetizers included the grilled octopus, jamon and the quail.  It was very flavorful, nice presentation and good portions.  For our main dish, we had the halibut and the whole lobster, all perfectly cooked and accompanied.  The wine and cocktail menu was extensive, and the servers were very attentive.  I look forward to returning someday soon!"]], "Cafe Marbella": [], "Bulerias Tapas Bar": [], "Papa's Cache Sabroso": [], "Café Iberico": [], "La Taberna Tapas on Halsted": [["Mironda R.", "Warm greeting, warm decor, live music, attentive staff, a variety of options. I wanted this place to be good. I wanted it to be great. It has all the makings of awesomeness, but it fell short by accounts of the food and unfortunately the sangrias.My friend and I tried to move across the spectrum from the daily specials, to frequently ordered tapas, to everything else.. and mostly were disappointed. We had:Fried smelts with smoky chipotle aioli - *shakes head*Chicken Croquettas - the fillings went soo wrong herePatatas Bravas - *sighs*Grilled Chicken Breast with yellow curry with saffron rice - *winning*Shrimp Ceviche with malanga chips - the chips were the best part. It wasn't terrible but it was bland in a sense.Flight of Sangrias - nice way to see the offerings, the classic is the best.Empanadas de Manzana with Vanilla Bean Gelato - *heavenly*The only thing they nailed was the chicken breast/yellow curry and the dessert. I would soo go back for both, but maybe after having dinner in the area. The musicians were great also.Looking forward to trying some of the other recs from the yelpers."], ["Julie M.", "This is a great modern tapas spot. I went to high school right around this area, and I was shocked that in the past ten years that so much has changed. The area is busy, but not so super-crowded that I wasn't able to get a parking spot right near the door. We arrived at 7 for a birthday party and by 8 most of the tables were full. I liked their twists on traditional tapas, like adding spicy mayo topping to the tortilla espanola. It isn't traditional tapas, but there are many other spots in the city for that. In addition to sangria, I loved the lime in the coconut cocktail, cider vodka and champagne margarita.We had a large party with multiple tables and they brought out our pre-ordered tapas quickly, but after that service was spotty. I think it was pre-arranged to go the bar for drinks, so I just did that. But I know some in the party complained because the server didn't come back to the table to get their drink orders. I wished that the server had come by more to check on us, because I was thinking of ordering more tapas, but I didn't have the chance. I will just have to go back another time."], ["Brooke B.", "Went here for a quick bite on Memorial Day...on off-hours, around 2pm. Sat outside on the balcony. There were about 4 other tables dining and a few people at the bar.La Taberna sangria...good choice. Mondays have $4 sangria and I was all over it. It was yummy, would've liked more fruit though.Got the ceviche, which another Yelper described as a bottled shrimp cocktail. I'd have to agree. It was a little sweet, which was strange and had the consistency of something between salsa and tomato sauce. WIth bits of shrimp...I don't even think there were pieces of fish in there.We also got a cheese plate that was served with \"fig chips\". Really, there were no crackers and no bread served (we had to ask). The fig chips were more like something you'd find in the center of a Fig Newton...nothing to scoop and hold. Also a disappointment.Service was mediocre. We were brought the wrong dish, but sent it back before touching it...from someone like a bus boy. And we had two different servers that obviously weren't communicating, as they replicated their service to us. This place wasn't busy enough to have a day of bad service on top of everything else.The lowlight of our meal was the Duck, off of the Entrees from the Grill. It states that it's grilled duck, served with carmelized figs and asparagus, and spicy raspberries. Sounds good, right? Uh, no. The duck was so overcooked we could hardly chew it and struggled to even cut it. Actually, it looked like it had been cut a long time prior to us being served it (like before it was even cooked). For pre-summer, this would've been lovely with fresh raspberries, but instead we were served a warm raspberry/strawberry/blueberry liquid that reminds me of the stuff you defrost from the grocery store to put in smoothies. Absolutely no flavor, completely flat. And figs? None. The asparagus was good to me, but my fiance thought they were overcooked.This place looked like it had potential. A cool, inventive drink menu...that alone may bring me back for a drink. But so, so disappointed in the food. There's too many other options out there to be served food this crappy."], ["magic g.", "Decor n service is great.Food on the other hand ...Sorry to say, but after living in Basque Country for 6 months and have tasted so many delicious tapa and fusion taco places in Chicago ... this food might be made from Spanish recipes, but by a gringo chef. The finishing touch is missing the flavor or even salt! Calamares a la plancha were tough. If you want Rioja & real spaniord food go to Cafe Iberico"], ["Bettina S.", "This is a great place for a group because there are so many items on the menu, and although it's centered around small plates, it's great for sharing.  The flavors are different than most other tapas that I've had although they do have some tried and true favorites.  If you have nothing else, please please try the flight of sangria.  It takes delicious to a whole new level. I make a pretty mean sangria, but they put me to shame with two red and one white wine selection.  They also have a nice little outdoor patio which is perfect for a warm day.  The staff is friendly and very helpful with making selections.  I will definitely try La Taberna again."], ["Steph V.", "My new favorite restaurant!!! Loved the food it was amazing! Queso fundido was amazing, as well as the sangria flight. The bartender took care of us at the cocktail table and she was so friendly!!! Great service, nice romantic spot with a guitarist that plays live. Loved it!!"], ["Mariya S.", "I decided to talk down the street and have some tapas to go. My experience was not great at all. I have ordered the meatballs that were very very dry. The potatoes with the octopus were loaded with oil, literally a full think layer of oil at the bottom. It was gross! last but not least I ordered the calamari that were super rubbery and impossible to chew. The only reason this place is even getting a star is because the one good thing they had was the apple turnover.So save yourself some time and money and go to a better tapas place!!!"], ["Heather L.", "Went to this place with my girlfriends for dinner today - it was a pretty heavy disappointment. A genuine tapas place in University Village would have been a hit. However, the owners are doing themselves a big disfavor by skimping on.... pretty much everything.(The staff and the live music was the only plus.)First of all, it would be a good idea to get a real sign for the front of the house, the plastic banner is getting old.Secondly, the food:- When you advertise \"Black Tiger Shrimp,\" I did not expect shrimp poppers from Popeyes.- The Dates were okay, not mind-boggling. Again, I get that this is tapas, but don't serve three or four fingerling sized, microwave quality amuse-bouche for $10.- The flavors of the Queso de Cabras were not very well coordinated - goat cheese on tomato soup, eh.- The La Taberna Paella is dry and tasteless. Is there even saffron in it?Not too late to turn this new place around, but there is a LOT of work to do."], ["Annie R.", "I've been to La Taberna twice, and I had a great experience both times! The sangria is definitely my favorite part of this place. I tried a variety of tapas, including patatas bravas, gambas al ajillo, and la taberna paella. They were all delicious! This is a great spot in the neighborhood, and it's something different instead of another sports bar. During the summer, they open up the patio - lights are hung all around and sometimes have a live entertainment. It's a really relaxing and sweet experience on a beautiful summer day. Don't forget to try the seasonal sangrias!"], ["Liz K.", "Nice looking place...Great drinks & Sangria (loooved the sangria flight). At first I did not want to try the flight because they said that one of the sangrias had like jalapenos...but it was sooo good.Like most places the Bacon Dates were great.....The patatas bravas were averageThe grilled eggplant was very goodand from the other tapas we ordered...well I cannot rememberFrom the food and service nothing really stood out as amazing(I have been to many tapas restaurants)...but I really liked the sangria."], ["Steven N.", "We've been here a few times now and we confirmed that, ironically, their tapas just don't hit the spot for us. However, we like everything else about this place...especially their paellas and desserts. Like one reviewer said, it's a quiet, non-super busy place and that's part of the charm. They have live music on the weekends and it just adds to the relaxed atmosphere of this place. This is a great neighborhood gem, I hope they stick around for a very long time so my wife and I can get our paella fix whenever we feel like it!"], ["Oceans L.", "So this place recently started to do delivery via DiningIn.com, and that's how I've tasted their food so I cannot rate on their in-house service or anything.But I ordered their delivery, which arrived on time to what was promised on the delivery site, so I'll give them a star for promptness (Although I don't know why it actually had to take that long since I literally live 2 blocks away. Yeah I could have picked up the food but I'm lazy and it's cold right now).Anyway, I ordered the Taberna Paella which was DELICIOUS. LOVED IT. WILL ORDER AGAIN. But I am a paella whore and love paella in general... But here are the star winning points for the paella anyway:Quality of seafood and ingredients was terrific, which is what wins this place 4 stars on a very shallow experience:Mussels were NOT overcooked = tender and juicy, not rubbery or too raw.Shrimp was soft and flavorful, not watery nor bland.The paella rice was not mushy which can often happen, but this came fluffy and well seasoned.Also ordereed the taberna flatbread pizza, which was flavorful, although the bread was slightly soggy because it's delivery but I'll deal with that. No stars off.Overall, I had a good experience with their delivery. Will look to order from them again and also this makes me actually want to go into the restaurant to eat their food!"], ["Tina O.", "I'm hesitant to write a review ONLY because I want this to remain a quiet spot where I don't have to wait for a table!I went with some friends for a celebratory dinner and had a GREAT TIME - it was highly recommended by one of my friends who comes here often. The chicken curry is great (really almost everything is), so are the drinks, and everything is reasonably priced. Live music on Sat nights and great for groups... basically it was a great time with good food and drinks. What else can you ask for?!?"], ["Katie R.", "the back story to how we got here is probably better than the review, but i'll go ahead anyway... (backstory: didn't feel like waiting at lalo's after finally getting in because we were \"underdressed\"  -- all nurses wearing scrubs after a 13 hour shift in the ICU -- the manager chased us out after we decided to leave, then said \"i own a spanish restaurant right around the corner!\" and proceeded to bring us there).so, sangria was good but very sweet.  but strong.  so that is wonderful!  the potatas bravas were decent but nothing to write home about.  same for the goat cheese.  i've never had ceviche before, but the shrimp were super chewy.  the chips that it came with were very yummy as well as beautiful.  the paella though.. what a shame.  was there even saffron in that???? i honestly don't think so.  i could have made some rice with veggies at home without burning the crap out of it.. yeah, no thanks.also, our waitress was SLOW and very inattentive.  i am giving an extra star because we got the potatas bravas for free after leaving lalo's, but i'm not exactly sure which restaurant that star belongs to.."], ["Eduard Z.", "Very average. Iberico or Ba-Ba-Riba much better"], ["Ronda P.", "I was here a few months ago on a Saturday afternoon for a late lunch with a friend.  I thought it was FABULOUS and it definitely was an experience.  Our waiter, Michael, was amazing.  He walked us through the menu and explained all the dishes to us (as we were tapas virgins).  We wanted to try everything, so we ordered 4 hot tapas and 1 cold tapas, as well as the vegetarian paella.  The paella was freaking amazing!  Michael told us that they were known for their paella and I can see why.  Delicious!  Every tapas dish that we had was a treat.  Even if we were unsure, we just tried them anyway and were not disappointed.We also ordered a pitcher of Sangria.  It was LOADED with wine.  I thought I was drunk on the first glass!  This isn't the sweet, Americanized version that I'm used to...it was very authentic.I would definitely go again and would recommend it to friends.  Ask for Michael!"], ["Lana M.", "I love tapas so the hubby and I decided to give this place a try, I'll admit that I rarely ever go to this area of the city but  I'm so glad I did. One word for our experience....YUM!Every dish we had was good even the sangria flight. My favorite was the bacon wrapped dates and the croquettes ( not sure how to spell it) We had the paella was cooked perfectly- honestly one of the best we ever had! The live music was a bonus because we weren't aware of it until we got there. There was not a long wait for our food and the service was great.I would definitely go here again."], ["Miguel B.", "I went here with some friends that were visiting from Dallas.  They wanted to try tapas here in Chicago because apparently the tapas in Dallas suck....lol.  I didn't feel like going through the whole ordeal of taking a party of 7 to Ibericos so I opted for something closer to the South Side of the City.We tried three different sangrias and my guests were not disappointed.  The tapas themselves were very much to my guest's liking.  One of the favorites was the morcilla and we ended up ordering two orders.The patatas were also popular.  My personal favorite were the mushrooms.  Not many places are able to make this fungus palatable but La Taberna certainly has a knack for it.Executive Chef Enrique Cortez ended up stopping by out table and inquired on our dining experience.  He offered to answer any questions on any of the items on the menu and to let him know if we are discontent with any of the items.I will definitely be back."], ["Charlie G.", "By far the best Tapas restaurant I have ever been to. New on the menu are delicious pork belly tacos that go nicely with their spicy papas. Nice wine selection, amazing sangria and great service. Nicely decorated restaurant with outdoor patio and live entertainment on the weekends. One of my favorite places to dine at a reasonable price."], ["Nina S.", "I LOVE LOVE LOVE Tapas and really, who doesn't? But I was THOROUGHLY disappointed by this place. I came on a Friday during 1PM and it was not busy with only a handful of tables occupied. I decided to try the lunch special, which comes with a serving of Patatas Bravas, 2 choices of tapas and the dessert of the day for $12. Sounds good! While the staff was friendly, the food (which is why you go to a restaurant) was SUB-PAR. I don't know who the chef in the kitchen was, but he/she may not know what salt is and therefore almost everything I tried was grossly under seasoned. Patatas Bravas: the only good thing I ate here.Crema de Champignones (mushroom soup): an overwhelming olive oil taste, really did not taste like anything else besides.Queso Fundido: tasted like they used some fake cheese, no seasoning whatsoever, the only saving grace were the ancho and chile sauces.Flan: I'm guessing since this is the free dessert that you get, they totally skimped on ingredients and/or made it first thing in the morning because it was just a gelatinous mass of yucky. So gross I didn't finish it.It also took FOREVER for me to get my check to pay and was truly an inconvenience since I had someone waiting for me. Safe to say, I will not be coming back. There are far better tapas places to go to in Chicago and surrounding areas. If you really want some truly tasty tapas just  go to Tapas Valencia."]], "The Purple Pig": []}