{"Friends Sushi": [["Marilynn P.", "Shereene M and I checked out Friends one cold Chicago night and her review pretty much covered it. I give it 5 stars because I thought the sushi menu was innovative. I've been to several sushi restaurants and I felt the ingredient combinations of their rolls are VERY unique. The only thing we ordered that I did not like were the soft shell crab buns. But the sushi and the shrimp chips app was bomb. See ya soon, Friends!"], ["Julia K.", "Truly disappointed. It's been difficult to find fresh, quality sushi in Chicago. We came here for Halloween dinner since we wanted something light and fresh. I ordered the chirashi since that is a good indication of how fresh the various fish is. Texture of the fish was rough and was not fresh. Only one of the yellowtail pieces was buttery and delicious but that is one out of about 15 pieces of fish. My friend got two rolls and was also disappointed. Considering that my meal was over $30 for poor quality fish, I would not recommend this place. Ambiance was dark, loud, and the furniture was weirdly shaped. It's a hip place but not a romantic Japanese meal I was looking for."], ["Kulsum J.", "Cute place. Sushi is pretty good. My fav was the tiger eyes. Their peach flavored jelly saki was good when chilled. However, did not like that my calamari was never served to me because the waiter brought it to the wrong table. They didn't even acknowledge the mistake until I mentioned I never received the calamari.If you're looking for a moderate style sushi experience. This is the place."], ["Saba A.", "What a nice hidden gem off of Rush! And what great prices and food too. So glad I came in here at 6:15 with a girl friend. Best time to come will probably be before 7 regardless on the size of your group! They don't take reservations. It's been awhile since I have seen a creative sushi menu. The place is intimate with dim lighting, white seats all around. Many people were in 'after work groups' or on a 'first date' to a small gathering of friends. I started off with some hot green tea (the flavor was very light) but that's okay because it was less than 3 dollars. I also had chicken soup and my friend had miso soup. Both soups were not salty, filled with great broth flavor, and my chicken soup was shredded, breakable, and there was tons of chicken in there! For 6 dollars it was a perfect way to start. I wasn't watching my calories so I ordered a creamy spicy tuna roll. Yes, it was spicy - and that's exactly how I wanted it. They didn't binge on any of the ingredients. Nicely cooked rice, a flavored mayo sauce, a good amount of tuna filling and lots of it. I was impressed. For 10 dollars, you will get your fill. So choose what sushi you want wisely! Service was great. Quiet, quick, and friendly. Will come back."], ["Elizabeth T.", "I'm a sushi roll lover so I couldn't leave my visit to Chicago without trying a place. My friend settled on this one from reading reviews. The place is small but cute and stylish. The seats were surprisingly comfortable and almost felt like you were at a modern home.We started with some waters. I really feel like water should always come with lemon! Takes away the tap watery flavor and the water here definitely had that taste. We reviewed the menu over and over trying to finalize our choices and landed on three: Fire Wing roll to start with. It sounded great on the menu but it was so basic--not worth the price. I wouldn't get it again. Lacked combination of flavors that I look for in a roll. Big Friends was next. This one was very delicious. Had a great combination of flavors and texture. I would get this one again and highly recommend to others. Can You Handle It? was our final roll we shared. I love spicy food and this was a spicy roll. I liked it but not too much. I would say if someone sounds intrigued by it from reading it on the menu then you should try it. If i come here again I probably wouldn't get it again. There were other rolls that I would try if I could fit more down my belly. I noticed that a lot of rolls included cream cheese which I'm not keen on much of that. The service was interesting, I couldn't really understand the girl that was serving us. I wanted to ask questions but that wouldn't have gone smoothly. It seems fairly popular as it started to fill up on a Tuesday evening after people were getting off work. Also the weather was perfect on this day!"], ["Zewditu D.", "What an interesting place. I was recently in Chicago for a conference and my boss suggested this spot for dinner. Since I wanted something light, this was a perfect choice. It was a quick walk from our hotel. But we had to look around quite a bit to find the restaurant once we found the corner provided in our directions. You walk up a few steps and enter the restaurant. So crowded! Man they pack you in there like sardines. I was seated in the aisle and it sucked having to watch out everytime someone was walking by. The tables were so small, as well. I didn't like the atmosphere at all to be honest.We ordered edamame to share. Very good. I also ordered aspargus beef roll. Mmmmm. I am not a frequent sushi eater, but I am getting used to it more and more. This was an excellent choice for me. Our waitress recommended this over the bun since she said the buns were quite small. The price was affordable and would definitely visit again given this and the great execution."], ["Morgan F.", "Our last night in Chicago with nine girls, and we were looking for something on the healthy side near our hotel for our last meal.This isn't necessarily a spot you can make reservations and arrive early to enjoy a drink at the bar, especially not for a gaggle of hungry girls. Our table wasn't quite ready yet when we got there a little early but they appeased a handful of the girls with edamame. It has this almost retro-futuristic Star Trek, I could be on the inside of a boat OR a spaceship feel with nice comfy white chairs. Our waiter was very sweet, and we did our best not to be \"those girls\" and pooled our requests together so only one person was spouting off the order which was about 10 or so rolls, a handful of appetizers, and dishes. One thing I think that would benefit this place is the paper sheet menu that they do in other sushi restaurants to tic off your order, but maybe that's just not their bag. Thank you to my fellow Yelpers for the photos of some of the great sushi rolls to help us make our choices. Top rolls were the Friends Roll and Devil's Tuna but I think they did a great job with your usual rolls like the Rainbow roll, and have two options for spicy tuna rolls, creamy and crunchy, which I like! For ordering that much it came out in a timely manner, and we were all able to fill up. I did think the Yuzu Ceviche was a little small for the price, but had some of the girls that wanted to order it anyway. Not much for sharing for more than two people, just an FYI! Our bill was around $50 per girl for apps, food, and drinks. I would say Friends Sushi is great for a few friends, but you're pushing it when you get past 6 hangry girls since they are a smaller space!"], ["Natalie M.", "Very meh.Disappointed but really nice place. The decor is pretty nice. I got the octopus sushi and a yellowtail sushi that contained some cilantro in it. They were both just okay but nothing spectacular. The service was great but I wouldn't want to come back here again...nothing amazed me. It tasted fresh enough but the octopus was chewier than I would have liked."], ["Somchai S.", "Nice modern decor.Great location.Intimate seating.Reasonably priced rolls for being steps from Mag Mile."], ["Shereene M.", "What an interesting place. When you walk in it totally looks different from what you expect. We came in around 5:30 on a weeknight and we were able to get seated right away. The service is really great and the food came out quick so we were a fan. We found some free (I think!) parking on Rush down the street, otherwise you can probably make it work within the $4 1 hr meter. What we had:Shrimp chips app- delish!Soft shell crab buns- meh, I'd skip itFriends roll- yum! my favCrazy winter roll- good as wellJazz Roll- very good!"], ["Eddie C.", "Overall: Mediocre sushi fare for high Chicago prices. Ordered a roll that was a little too sweet...Food: I got the Mad Maki and the Triple, which I shared with my girlfriend. The Mad Maki was weird... It came with like 8 pieces and was drenched in eel sauce and spicy mayo. Like the roll was soaked in a puddle of the sauce on the plate. It also had a weird sweet flavor, almost to the same tune of candy. The Triple was a lot more normal but wasn't too satisfying.Friends Sushi is a weird place. It was packed outside with people waiting on the Sunday night that I went but they seated us immediately. The interior is like a futuristic space bar.. I was nervous that the fish would taste like freeze dried space food. Instead, one of the rolls came out to be soaked in sauce. I felt my blood sugar rise after eating a few pieces. I basically ordered sticky rice with candied eel sauce for 15 dollars.Maybe the other rolls are better here but Friends Sushi was definitely underwhelming."], ["Vyvy T.", "We came here with last minute reservations prior to our comedy show. We wanted somewhere close, but casual and this place was it! Almost everything here is white; the walls, furniture, and sushi bar. Gives an illusion of a larger space because it's in a narrow building. Cute space overall. Restroom includes a TV. What was playing on it? Some spooky ghost show. There was a large mirror in that restroom. Definitely not a great combination. :P (I kid) My companions and I ordered spicy tuna rolls, chirashi bowls, and a couple of nigiris. Chirashi bowls come with miso soup in a large mug. Their chirashi \"bowls\" are huge here! The only difference between the small and large chirashi bowl is sashimi count. The large has three more. Both came in a platter with sashimi placed in rosettes. Though the sushi was fresh and I wanted to love it, but it was A-OK for me. This would be a great place to quickly satisfy sushi cravings. Service is fine. Better for small parties. Parties four or more, be prepared to feel cramped."], ["Emily J.", "I had heard about Friends Sushi from multiple friends and when I moved within walking distance I knew that I had to try it! I would recommend to get reservations if you can as the restaurant is very small and always very busy. Service was excellent-both efficient and courteous. My friend and I share a few rolls and I think the rainbow was my favorite-everything was really fresh and flavorful. This is not the quality of sushi you will get somewhere like Sunda but it's still delicious and honestly a bargain for the amount of food you end up getting! Would certainly recommend and I love that the crowd is pretty much 100% local too, so hard to find so close to Michigan Ave."], ["Amy N.", "What a little hole in the wall! I did not expect this place to be as good as it was! The outside is definitely deceiving. The hostess and the waitresses were so sweet to us. We started off with the seaweed salad $5. Really tasty and refreshing. I also ordered the Unagi with cucumber. The texture and taste was on point. Unagi was rich and buttery.We also got the Deluxe Sashimi Combo ( comes with Miso soup). OH SO GOOD AND WORTH IT. The pieces of sashimi were fresh, perfect size and the quality was kind of amazing. So yummy I would definitely come back."], ["Keisha F.", "I am from out of town, I ate here a few years ago and absolutely loved it. Came back recently and it is still as good as I remembered. Everything from the miso soup to the Friends Sushi roll. Delicious and nice atmosphere!"], ["Troy C.", "The good: Service was prompt but there weren't many people thereFood was not bad and the menu selection was also decentPrices were not bad either and good selection on the lunch specials. The not so good:Nothing really bad but if I had to say anything it'd be to change the decor. The seating seemed very dated. I'd eat here again if I was in the area."], ["Maggie H.", "The decor is very old futuristic - lots of white, bubbly looking things like you're in the Jetsons or the 5th Element. I think it has the same owners as the Thai restaurant at the same address (the employees are all Thai.) /Coming from LA and being a sushi snob, I didn't dare try the raw fish here just based on the look and setup of the restaurant, and went with the oyakadon (chick and egg bowl!). It was not the most authentic, and the rice was on the soggy side, but it hit the spot and I left satisfied.Given that you're in the heart of Chicago, I would say skip this place and keep looking for your authentic Japanese fix.If you're not picky though and just want something quick for lunch, this is an okay option."], ["Lisa G.", "Once again, popped into this place on a whim ( actually was so hungry didnt even yelp it).  The place was a little dated, with it's white decor. Had the Gyoza as an appetizer, very tastey. Liked them alot. Sushi, had the Fire wing Roll.  It was good. Nothing out of this world but nothing to complain about either. Waitress was real sweet."], ["Shirley J.", "Upon arrival on a hot Saturday night, I sat on their bench waiting to be seated and fanned myself vigorously with a Whole Foods coupon booklet that I snatched up on the way to Friends Sushi. Why, oh, why didn't Friends Sushi have A/C??? I sat there feeling like I was going through a menopause hot flash. I stopped by the restroom before being seated, which to my surprise actually had A/C. A/C in the restroom but not the rest of the restaurant? *Palm to face*Anyways, we opted to sit in the outdoor dining area. It was cute and small. I do want to mention that two homeless guys came up to our table separately while we were dining, AND a mosquito managed to have a buffet on my leg, which resulted in a bite the size of TWO quarters.We ordered the following items:- Scallop butteryaki (appetizer)- Salmon nigiri- Yellowtail nigiri- Sea bass nigiri- Can You Handle It signature roll- Spicy tuna roll- Some sort of sweet sakeAll of the sushi and the appetizer were pretty good and fresh. My favorite one is the Can You Handle It roll.The service was okay. It took foreverrrrr to get our food. Fortunately, we were lost in conversation to not care too much. Our waitress was nice, and the employees were pretty good with refilling my water though.This isn't the best sushi restaurant in Chicago, but it's worth a try."], ["Rachel W.", "Having been here multiple times, it's unfortunate that each time the experience has worsened. The quality of the sushi seems to have decreased. The maki rolls we got were overdressed with sauces which might have been an attempt to mask the poor quality of fish. The past times that I've been here, the food has been much better. On the bright side, this was the first time that I didn't have to wait for seating."]], "Yuzu Sushi & Robata Grill": [["Norm J.", "Food = 4 starsService = 2 starsOverall = 3 starsWhen I made the Valentine's Day reservation at Yuzu Sushi & Robata Grill I was told (1) they were offering a special 7 course menu and if I selected to do that option right there on the spot I'd get a 10% discount and (2) that with a 7pm reservation we would need to be out of there by 8:30pm. I was fine with this and confirmed we'd do the menu and be up and outta there at the specified time.Arriving at our reserved time we had to wait 19 minutes to be seated and all I could think about was that 8:30pm deadline. After being seated in a tight space up against the kitchen counter area we waited a good 7-10 minutes before our waitress came to ask if we wanted anything to drink and to explain the menu. Since the place was packed I didn't give her my East Coast attitude like I normally would when the service starts off at a 2 out of 10.After placing the order for the first 4 courses I felt like Ben Affleck in Gone Girl when it came to tracking down our waitress to (a) ask where our food was and (b) place the order for our remaining 3 courses because she just disappeared on us. When our food started coming out it was in such a random order (i.e the 4th course came out before the 1st course). By this time it was about 7:45pm, we only had 2 of our 4 courses and we still needed to order 3 more. By 8pm we'd received our other 2 courses and was finally able to place the ordered for our remaining 3 courses. Thankfully my Valentine was/is awesome so i didn't mind the crazy wait, that much. When course 5 (order of 5 rolls) and 6 (sushi a la carte) came out it was almost 8:20pm so I knew we'd no way/how/chance be up and out by that \"deadline\" I was given when I made the reservations. I sent a silent I'm sorry to the group of 14-16 people huddled near the door waiting to be seated because I knew two of those people were suppose to be getting seated at my table in 10 minutes. In the end we didn't get outta there until about 9:10pm after finishing course 5,6 and 7 which was the dessert.All and all I think the food was really good, but the wait time to actually get the food was terrible. Also, the service gets two thumbs down! I know it was Valentine's Day and they were packed, BUT poor planning on their part doesn't require kind words from this reviewer. Next time they want to offer a 7 course special they should hire more kitchen and wait staff. Course 1: Warm Up*Miso SoupCourse 2: Salad*Avocado Mango SaladCourse 3: Starter*Squash Bloom*WagyuCourse 4: Robata*Hustler Lamb*Pork Shoulder*Beef Short Rib*Scallop Wrapped Bacon*Chicken Truffle Sausage*Tofo RobataCourse 5: Yuzu Roll*Breaking Bad*Popeyes on Duty*Sin Nombre*Pot River*Born to ChillCourse 6: Sushi A La Carte*Gome Ae Nigiri*Tuna Truffle Nigiri*Foie Gras Nigiri*Holy HotategaiCourse 7: Dessert*White Chocolate Yuzu"], ["Andrew L.", "If you are like me and hold a special place in your heart for cuisine from the land of the rising sun, you should dine here.The place was packed, bumpin, and dark, which is exactly what quality food establishments and night clubs should be.  Unlike night clubs, it's BYOB and no cover, for now at least.I've had Robata two other times before coming here in my life so I clearly was a well-versed expert in this kind of food. Still my gargantuan Robata insight was ill prepared for the schooling yuzu gave us. The eggplant Robata was really as good as a plant could ever taste. Maybe if the place were just a little darker I would have believed it was meat. The meat skewers were easy on the eyes, juicy, and had great personalities. Don't tell pork and chicken but I think beef was just too enticing to pass up a second date with. You can't go to a Japanese joint without ordering at least a little sushi, I'm pretty sure it's a misdemeanor in most states actually. So not wanting to spend the night in jail, we got a roll to sample. The fish was super fresh, like it was probably alive a day or two ago fresh. I'm pretty sure the only way you could really have something fresher is to take a bite out of a live tuna but then people might start calling you \"inhumane\", \"murderer\", or \"an insidious creature attempting to conceal itself within the vain appendages of the human skin\". Whatever. All meaningless words that my psychologist throws around a lot for some reason.If I were some super peppy and cliche yelper who didn't understand that 3 exclamation marks per paragraph is too many I might say something along the lines of \"holy mackerel! The mackerel nigiri is to die for! It is a must!\". I'm not and I will not subject you to excited Babel. The nigiri was really damn fishy in taste but me so much in aroma. It was fishy enough to taste a little like the ocean and iron but not enough to be abrasive. The nigiri was like a girl who knows to show a tasteful but still alluring amount of skin. Atmosphere 8/10Food 10/10Service 8/10Side note to the review: We started talking to the table next to us because we're intrusive bastards that don't understand boundaries but one of them was a sushi chef. He said that the sushi was pretty bomb. That is all."], ["Ashley R.", "Udon noodle soup is perfect for cold weather and sharing (it's huge). Whats my name roll and anything with salmon on it is delicious! They take their plating presentation very seriously here, which is almost too pretty to eat."], ["Dominique W.", "Absolutely idiotic. I ordered delivery, my order was wrong (gave me a Philadelphia roll instead of my avocado roll & my cucumber roll, & only the fried tempura broccoli that is supposed to come with Udon noodle...but I had no Udon noodle). I called the business & they said that they would only give me a refund if they could come back & pick up my food to \"show the kitchen what they did wrong.\" What?! Crazy. Who would go out of their way to do that? & their delivery driver asked me for a tip...when it clearly said on the website that gratuity was included. Never ordering from here again...& the fish smells. So I'm not even eating my incorrect order."], ["LaTasha B.", "Soooo good!!! I couldn't stop eating! If you love sushi, you'll love this place. They have a variety of different types of sushi rolls and their presentation is really cool. Great service, loved the music (they play hip hop & R&B top hits). My new favorite sushi restaurant!!!"], ["ChingWa C.", "First time here and looooove this place. My siblings and I took my parents here for my moms birthday. It's a Monday night and there were 6 of us that arrived at 7pm with no reservation. The wait was a little over 45 mins but it's our fault for not making a reservation. During our wait, we saw that everyone was enjoying their BYOB. The interior design is pretty \"rustic\"? (Or didn't bother fixing up the ceiling?) and the lights above us didn't turn on? Haha but it's all good. The ambiance was chill and music was good. Perfect for a group of friends. Just be sure to make a reservation if you have a group of 4+. Food was good (I am not a foodie), we ordered their avocado mango salad, fried pork belly salad, and pork Katsu? We ordered 5 rolls ... They all taste the same to me. And the sashimi platter was fresh.In the end, the waitress brought out the complimentary birthday dessert (ice cream mochie WITH SPARKLER) So cute  my mom loved it. Service was good too. I would definitely come back!"], ["Sara T.", "Yuzu lives up to the hype. I'm already planning my next visit -- that's how good it is! To start, it's BYOB; music to my wine-enthusiast ears.We ordered the shishito pepper skewers for our app, the miso soup, and the pot river roll and sashimi platter for our entrees. Everything we ordered was grade A. I'm convinced you can't go wrong with anything you order. Whatever you order, there's no doubt it will be fresh, flavorful, and prepared to perfection.Be forewarned that due to its popularity and small dining space, even on a Tuesday night, you can expect a 45 min wait around dinner time."], ["Johnny R.", "I've been eating at Yuzu for two years and there's a reason I keep coming back. It is bar none the best sushi for your buck in Chicago. I always leave with a smile on my face, a full belly, and drunk (I guess to be fair, I leave most BYOB places drunk).Whatever you do must start with some grilled stuff on sticks. My favorites are the rib eye, bacon wrapped asparagus, and bacon wrapped scallops. You can find grilled stick stuff at a few other Japanese restaurants in the city but they won't be nearly as good as Yuzu's. Their rolls and few sushi have never disappointed. Massive rolls and beautifully cut fish. My favorite rolls are the Pot River and Black Sea. Service wise, they are usually understaffed compared to their size but I've never felt unattended. They portion out food perfectly and offer buckets of ice for BOYB beverages. I've bought lots of friends here and they have all ended up going back because of how good Yuzu is. I've also brought large parties here and they take reservations.Bring some Japanese whiskey. It's the best thing to blackout with over raw salmon."], ["Heather F.", "Very cool environment. The staff is super friendly. Their sushi is good! My favorite part is select sushi rolls, they do a painting with all different sauces on the cutting board. I made a reservation on a Thursday for 6:15 and there was no wait. In and out in a half hour. Very good but quick bite to eat. I will definitely be back!"], ["Meg M.", "Yuzu is equal parts inventive & delicious! It's my favorite spot for sushi in the city... Not to mention its BYOB! I highly recommend the Mango Avocado salad, #thuglife2 & Boy Meets World."], ["Jamie H.", "Fabulous! I typed sushi in Yelp and this wonderful gem popped up. With 4 1/2 stars it sounded perfect. I made a reservation for five on a Tuesday night at 7:00. We got our table no problem; the place stayed consistently busy for the two hours my friends and I were there. The service was very good. The food was wonderful. I tried the Shrimp Tempura roll, Pot River - jumbo was in the description - that was no understatement and the South Beach. All three were so good. A few of the rolls came out on plates with cute decorations made out of sauce.  The place is very small and i don't think they take parties bigger than six. Fun atmosphere and delicious food! I will definitely be back!"], ["Elsenor D.", "This place is solid for sushi I liked it very much. The BYOB makes a big difference on your tab and the fish is good. There is really no WOW factor to this place. Good sushi, good prices and BYOB"], ["Polly S.", "Have I been living under a rock? How have I not discovered this place sooner? LOVE, LOVE, LOVE Yuzu!Some would say the BYOB with no corkage fee is it's BEST quality, but I contend that diminishes the true star of the show, The Food! You are missing out if you don't order: tuna poke, age tofu, the South Beach and River Walk rolls.Don't go without a reservation - they are small, popular, and strict on canceling your reservation if you arrive more than 10 minutes late. Dump your dining buddies who you know always show up late. Service was great in my experience, but they run a tight ship and turn over tables quickly. This efficiency might rub some people the wrong way but I understand the reasoning behind it.The rolls are larger than your average bear so one per a person is more than enough if you're also ordering a few starter dishes. We definitely over ordered calculating 3 rolls per a couple.The interior of the restaurant is hip, but not overdone. I like the fact that it's on Chicago Ave. and a little removed from the busy dining hubs. New found LOVE."], ["Roger L.", "This is STILL my favorite sushi place in Chicago, hands down. My ONLY complaint is that since they've moved to the latest location, just down the street from where they used to be, the don't serve cucumber water anymore. :'( Other than the cucumber water this place is still A++++++++++++. Great atmosphere. Amazing food. Naruto."], ["Jessica M.", "Yuzu is relatively petite and a reservation is necessary. The tables are neatly and tightly aligned against the wall. There is no room left for coats and bags. Coat hangers can be found in the back but bags will have to sit on the floor or have it uncomfortably rest on your legs throughout the meal. For two, we shared the sashimi gold, grilled lamb, asparagus and bacon, eggplants, pork shoulder, and monster spider roll. The sashimi gold came in a beautifully assorted platter of 12 pieces of raw fish per the chef's selection. It was fresh and generous. Of what I can recall, it came with salmon, tuna, octopus, and yellowtail. The grilled lamb was smothered in a mint leaf sauce. I wished the lamb flavor itself was stronger. The pork shoulder was flavorful but the meat was not tender enough. I enjoyed the eggplants and asparagus skewers the most. The monster spider roll came in five pieces. Judging by the menu description, it probably had the least amount of sauce if that is also what you're looking for. Service was quick and I especially enjoyed how they would take note of when you finish a certain dish before bringing out the rest. There was a good flow of food delivery without feeling rushed."], ["Phil B.", "I never have a bad meal here!  The fish is so fresh and flavorful!The value here is terrific! I had the sashimi bento box for lunch. It was awesome!BYOB and run don't walk to this sushi gem in Chicago avenue."], ["Jacob C.", "Ok, so I have decided to give this place 5 stars. Over my years of restaurant journeying I have learned a bit and I was in the industry for quiet some time. Now I hard about this place from a friend. I called in for reservations and the gentleman on the phone said instead of a 7 o'clock he had a 9 oclock. Well to late for me but then he quickly said, well I have a 6:30 opening but need the table back at 7:30. An hour for sushi, plenty of time. Glad took the reservation and quickly jumped in the car to head south. I live in North center sk new it would be a drive to get there. I got there on the dot at 6:30. Nows where they earned their 5 stars. See my wife asked if we could be seated and the guy asked for the info and then stated \"oh I am sorry your table was given away. We notified you about it through text\". Now I know a lot of restaurants like this new technology yet they must understand not everyone is aware they use it and it was not told to me. I never check my phone while driving, if you didn't know it illegal and unsafe. Now my wife said it's ok, we will just go some where else. I turned and started to walk away as it seemed the guy didn't care. Thought about it for 2 seconds and thought no! No way this is not my mistake. I know they said 6:30 and I was here. I spoke with the guy at the check in and he seemed really not to care (seemed). I requested in talk to a manager as o know what i was told regardless of what some text was after I was finished making the reservation. Clearly I was no aware that's how they confirmed things. After some what going back and forth with him I requested to speak with a manager. The manager comes over and I update her with what has happened. Told her I am not hear to ramble on about what happened but would like it fixed. I know they said 6:30 and that it is ridiculous to think they would make me aware of needing the table back after an hour and half. I know as I have been a restaurant manager for years. I also stated you should have the person make new people aware, I am gonna send you a text confirming your reservation so please confirm your information. All in all she quickly handled the situation politely and got us a table right away. Food was amazing, service was great, can't say enough about presentation. Though I will say this; being from LA I have high standards of sushi. Chicago places usually tend to be over priced for minimal portions. This place is nothjng like that. Though they aren't the cheapest, they are by far one of the best places I have been. If you haven't gone, I urge you to definitely check it out. You will not be disappointed. Just make sure you check your text."], ["Claudio G.", "Great rolls, fantasy and quality in the ingredients. Cool place with young people! Big portions super well presented! Creative sushi at its best."], ["Martin S.", "Been here a few times and the food is always good and they have a lot of different offerings. Not a fan of the cute sauce decorations or in general the whole hello kitty cute. It's weird to me but I'm sure other people like this. Only bad thing about this place is the tables are very close together and subsequently not private. Last time I was here the couple next to me were eating with their mouth open like a cow snapping their gums - very unappetizing to hear this"], ["Trevor D.", "Great restaurant serving some of the best robata and sushi I've ever eaten. They happily took us in even though we didn't have reservation, however I do highly recommend you make a reservation before since they were extremely busy. The ambience inside was definitely catering to a much younger crowd with the rnb and hip hop music playing in the background.As mentioned in the previous reviews the sushi and robata were excellent. The skewers were definitely a must have and compliment to any other item. The sushi was some of the best and freshest I've had in Chicago since they have some very creative roles. Service was excellent however I do have to mention it was at times too dark to see the menu but other than that this place is a must try"], ["Carolyn I.", "I went for lunch on the first day at their new location.  There were a few problems with service, but I didn't mind since I knew they had just relocated.  Food:I was really craving poke and looked around for restaurants that had it.  The tuna poke did not disappoint.  It consisted of Hawaiian tuna, avocado, green and white onions, Japanese chili pepper, soy sauce and sesame oil.  It was delicious and the presentation was beautiful.  Another appetizer I got was the tempura soft shelled crab.  It was crispy and I loved the dipping sauce that came with it.  I ordered the beef short rib, pork shoulder and shishito peppers (Japanese sweet peppers) from the robata grill.  The meat was so tender and flavorful.  I ordered the Japanese eggplant, but they didn't have any so I ordered the shishito peppers instead.  It was my first time eating shishito peppers and I really enjoyed eating them!I also got the unagi roll - fresh water eel, cucumber and sweet soy sauce.  It was good, but my least favorite out of everything else I ate.  I think it needed more sauce.Overall, I think Yuzu has great Japanese food.  I will definitely be back!"], ["Laura F.", "LOVE the bento box lunch deal. Love eating sushi at lunch. Perfect mid-day pick me up. I'm down for sushi anytime but especially randomly on a weekday afternoon when you've been sitting at your desk all day muttering expletives about your boss. Love the cups and cutlery and plates. Love how heavy the chairs are. Cute interior. The only bad thing is that on the Maki bento box, it comes with one spicy tuna roll and one \"chef's choice\" roll. They sometimes bring out two spicy rolls which taste very similarly. Its spicy overload. I enjoy it more when they balance the two rolls!"], ["Sunny H.", "If you're an anime fan, you're going to love the decorations here!Recently moved into the wicker park area and been dying to try this place out after reading the reviews. They have a spicy miso soup that I could drink all day. a Serious highlight of dinner for me, my wife even tried to steal it!All the sushi was good as well. The only thing I did not like about the sushi was the SIZE... holy crap, some of their rolls were so big that they were hard to eat. Tasty food... just tone down the size of your rolls. I'll be back for sure regardless!"], ["Catherine P.", "Yuzu used to be my secret spot, but I have a feeling others have discovered this gem as well. Packed to the gills every weekend, Yuzu finally expanded into a sleek, larger spot that still maintains the Yuzu vibe I loved from the former location. 90s hip hop, stemless glassware, and casually clad servers help to create a unique experience. What to order: first things first... The avocado and mango salad is not to be missed. Generous slices of fruit pair nicely with a spicy, creamy dressing topped with crunchy noodles. The grilled octopus and agedashi tofu are stand outs as well. From the robota grill, I always order a few skewers of pork belly and filet. All I can say is wow. Now for the aspect that sets Yuzu apart from the rest... The sushi. Incredibly fresh, thick cuts of salmon and white tuna sashimi always kick off the second portion of my meal here. The rolls are presented with elaborate sauce art alongside robust, larger than normal maki rolls. See photos below for proof. Yuzu is Byob, casual enough to pop in on a Sunday in your yoga pants, but also vibrant enough for a date or birthday dinner. Beware of wait times... So make a reservation! Dinner for two runs about 70$, but you will leave full and satisfied, with a perfect Instagram shot of your dinner."], ["Tracey S.", "I've been a loyal customer of Yuzu since the first week they opened. My friends actually joke about how often I go there. Unfortunately, I will no longer go back. The food is excellent, but the customer service has simply gone downhill - WAY downhill - over the past several months. From reservation issues, to delivery order issues, to service in the restaurant. I love that they've grown and are so popular, but their service across the board has suffered. I actually spoke with the manager to tell her my experience and it was like I spoke to a blank wall. So disappointing. The two stars is because the food is so good. Otherwise, it would have been one. Chicago is an amazing town with a ton of great restaurants - and many, many great sushi restaurants. Good food simply isn't enough."], ["Bear D.", "Went there for my sons birthday and he we were expecting more.  Lots of flys kept landing on me as well as others so that I couldn't pay attention to the food as I was too busy trying to swat them away.  Service was good, hence the 3 stars.  The food was average but not worth the trip out to the city.  This restaurant was highly ranked but I fail to see why.  It's a nice neighborhood joint but not above average.  We ended up going to another restaurant to try to impress our 11 year old.  To be fair, I may have had too high of expectations and the flys bugged me."], ["Hayley Z.", "My favorite sushi in Chicago. Everything is amazing but the Tuna Poke is absolutely unbelievable and melts in your mouth. Oh, and the Born to Chill roll. You MUST get this roll.Their service is nothing special but the food more than makes up for it. And they just recently moved to a bigger space so it's a bit easier to get a table on a weekend night. If you're looking for BYOB with average prices and above-average sushi then this is it. Yuzu will change your life."], ["Mala S.", "This place is amazing! Great service and wonderful food. I love the Anime decor on the walls and on the restroom doors. When our food arrived, all that I could do was smile as I appreciated the work of the artist that took their time to draw a colorful  fish made of soy sauce and other condiments to go with my sushi. I had the Green Harbor Yuzu Roll which was super delish! I am most definitely coming back."], ["Jen B.", "My dinner mate and I came to Yuzu for sushi and robata this past Friday night. My dinner mate had read the reviews and made a reservation, and we both arrived early and were seated promptly. The tables have chair and bench seating. Bench seating is attached to a wall, and there are hooks on the walls for your personal belongings. Given how cramped the seating is, this was greatly appreciated. Service is attentive, but it feels rushed. The food is beautifully presented. From the fan-shaped avocado slices that accompany the tuna poke to the rainbow of sauces that frame the rolls, the food is exceptionally well-prepared and presented. Tuna poke is a good bet, with a spicy kick and generous portion size. I'm glad we ordered this even though there is a salmonella outbreak associated with raw tuna at sushi restaurants in 9 states, including IL. I took the risk, and I'm glad I did. I liked the inclusion of cilantro in the River Walk roll. The robata reminded me of Korean BBQ. I preferred the sweetness of the beef short rib over the chicken golek, but if you like a wet dressing to your meat, then the chicken golek may be your best bet. Overall, I enjoyed my meal, but I wish the seating area was larger and the service wasn't as rushed."], ["Ashley C.", "Sorry, Yuzu, this is just not working out and you are being dumped.  This is not because of their food, but because of their bad service.  In particular, we dealt with at least two different employees trying to make a reservation.  We were put on hold for over five minutes before we were hung up on.  Accidents  understandably happen so we called back.  My husband was explaining that we were on hold and got hung up on, but without listening, they already put us back on hold. We waited about 10 minutes and nothing.  My husband hung up and called again.  This time the employee was very rude which left a bad taste in our mouth.  We hung up and decided to go elsewhere.  It should not be that hard to make a reservation (get on opentable!) and certainly an employee should not be so rude.  I'll take my business elsewhere.EDIT: I am impressed that Yuzu monitors its Yelp, comments promptly, and seeks to improve.  Given their effort, I will consider returning."], ["Emily C.", "Obsessed with this place. It's a little pricey, but it's consistently delicious and right around the block...what more could I ask for? I love sushi and this place hits the mark every time."], ["Eric H.", "Yuzu is my new favorite sushi spot in Chicago. The menu is always full of creatively named and crafted specialty rolls, great appetizers, and an delicious selection of robata grill items that I like to add on to my orders for a little taste of something I may have a craving for. The staff is always helpful, kind, and accommodating. For instance, one time that I went, a roll took longer than expected to come out (about 10 min after the rest of the meal), so our waitress gave it to us for free. The late roll was the most expensive roll of the meal, so it brought our total for two people with appetizers and rolls to about $60 (a total steal for the quality). Most importantly however, the sushi is just amazing. Everything is so well balanced and made to taste and look perfect. Plus there are unique items on this menu that you just can't get as good anywhere else that I've found.Pro tip: get the Mango Avocado appetizer. The balance of spicy Ponzu, creamy avocado, and sweet mango is unreal.Highly recommend."], ["Ali D.", "This modern Japanese restaurant lies at the nexus of great taste, cool ambiance & solid value. Definitely worth a check out! Try their unique signature rolls."], ["Larry F.", "QUICK HIT (Must Go vs. Consider Checking It Out vs. Pass/Don't Bother):  Pass/Don't BotherI came to Yuzu Sushi for lunch this past week. It had been on my \"need to go to\" list for awhile, but due to the size of the restaurant, securing a reservation had proven difficult. Regardless, I ordered two orders of the short rib (seemed to be a Yelp favorite), and three sushi rolls (black sea, what's my name,and chicago spring). The short rib was quite good: flavorful, tender, well cooked. With that being said, its $3.50 for one skewer of short rib (yes, one skewer), and the quality did not justify the pricing. The sushi, which is what I truly came for, was unimpressive. I wanted to like the sushi, but was legitimately underwhelmed. The fish did not seem fresh, nor did the flavor \"wow\" me. Very disappointed. Perhaps this was because it was lunchtime, that I am unsure of, but nothing provokes me to come back at dinnertime to find out."], ["Greta D.", "I love this place. Best sushi in chi ago area. I always get sashimi bento. I was so happy when they reopened after the fire. I was starving for weeks;)I will be back , and back and back. My kids love I too, or thing that bothers me ....closing after lunch before dinner. ...; ("], ["Nadi S.", "Food is delicious but had to give it only two stars because THERE WERE WORMS IN OUR SOY SAUCE! Sorry Yuzu! Please make sure you're hygiene standards are higher! This is just gross.UPDATE: Thank you to the staff and especially the manager for taking care of us for this incident. Our meal was complimentary and we truly appreciate the service. This is what good customer service is about and we will be coming back. This is STILL my favorite sushi spot, but I can't give it full 5 stars because of what happened. I will update this on my next visit."], ["Dalia M.", "Sushi craving so decided to try this spot.I liked:-The sashimi platter: fresh, sizable pieces and they listened to what we didn't want -BYOB. Duh.Rolls: pretty creative but not overwhelming for the most part-Decor: rustic, manly, modernService: Nice and fast Didn't like:-Overtly loud dirty rap that made me feel like I should stop eating and start grinding on someone or something-Rice. Too much on the rollsCan they turn down the music, please? I would've enjoyed my meal if I wasn't yelling over it and debating a twerk the whole time.Good, better than Butterfly but Coast is still #1 for sushi in Chicago in my book."], ["Rachel B.", "I have eaten at Yuzu twice and ordered takeout probably six or seven times. They really have the best affordable sushi in the Bucktown-Ukrainian Village-Wicker Park area. So many creative rolls! As someone who has to eat gluten free, I love that they don't lean too heavily on tempura to make their signature rolls interesting and tasty. Means that I have a lot more options to choose from! I love that they are BYOB, and they were great about letting me bring in my cocktail-in-a-jar the last time I ate in. My takeout is always ready in less time than projected too. The staff have always been very helpful and pleasant. I am knocking off one star because they have been a little inconsistent lately. In particular, in my last takeout order, the cucumber-avocado roll contained no cucumber, and the avocado was quite underipe. That said, I'm sure I'll be back - Yuzu is so good that I will happily ride out the rockier moments in our relationship!"], ["Jill J.", "this place is delightful! friendly service, great atmosphere, and really legit food. fresh and tasty with INCREDIBLE presentation! heads up...the Breaking Bad Roll is crazy spicy lol. love all the skewers too.really love that it's BYOB. this totally cuts down on the bill at the end of the meal!"], ["Shahzad A.", "This is an awesome place with great sushi that is economically priced. They do a great job with making their food look good. The food is very creatively presented. One complaint I had was that the space was very tight but they recently took care of that problem by expanding."]], "Kai Sushi": [], "Toro Sushi": [["Claire L.", "There are literally thousands of options for sushi in the city but Toro sets itself apart for a few reasons. Love the quiet, intimate setting of the restaurant - it's a great place for a date or to catch up with friends. I also love all the different sushi options they have and combinations of things I've never see anywhere (cream cheese, jalapeño, fish eggs, etc). I've also tried the chicken teriyaki and it was fabulous, super moist and great flavoring. The service is on point and the waitresses are attentive, I never have to wait for my water to be refilled or to order more edamame. Final tip - come early or be prepared to wait, it's small and they don't take reservations."], ["Monica H.", "First time trying out this place after looking at the reviews aaaand it was delicious! We had the oh my god roll and the tipsy trixie. I wish we would of taken advantage of the byob! Service was awesome. Definitely trying it again."], ["Mary S.", "Total let down.For years I've heard about how great this sushi place is, how fresh the fish is, blah blah blah. Came by right at opening on a Saturday night (with a short wait in line outside, you'd have thought you were going into the hippest new club downtown) and quickly got a seat and was greeted with menus.Tried four different rolls and honestly didn't think any of them had much of a taste (the husband agreed and he can be a sushi snob). You do get a decent sized roll for the price you're paying, and they're fairly quick in getting it to your table, but nothing had a taste!I think this place has a lot of hype because it's so small and doesn't take reservations, so by the time you sit down you think you've made it and automatically begin thinking the food is better. Almost like people who think the more expensive a bottle of wine the better the taste.Save yourself some time and try Wakamono up the street from here instead."], ["Regina G.", "Best sushi in the city ! Mitch always makes you try something new and it never disappoints .. Must try if your a sushi lover in Chicago !!"], ["Laura M.", "This is a great no frills BYOB sushi place in Lincoln Park and one of my favorite sushi places in Chicago. They have really high quality ingredients, and cool specialty rolls.  The restaurant is very small though, and the wait is usually pretty long - usually over an hour.  It's not a big deal though because you can leave your cell number and they will text you when there is a table ready.  There are lots of good bars in the area so you can just head to one of those for a drink while you wait.  Then after you get some awesome sushi, I recommend that you walk a couple blocks down Clark to Molly's Cupcake for dessert!"], ["Becky P.", "I had heard this place has amazing sushi. I was fairly let down. We ordered sashimi and the salmon was still slightly frozen. I also think the rolls have far too much going on. We decided to try a roll that had bacon and scallops thinking it sounded interesting. Bacon just didn't go well with sushi and there were large pieces of carrot in the roll which destroyed the texture once you started chewing. I would probably go back, but order simpler rolls and not sashimi. If you have to wait more than 20 minutes, I don't think it's worth it."], ["Emma K.", "I've only eaten from here once, and it was takeout, but I can already tell you it's one of the best if not my favorite sushi place in the city.  Everything was absolutely delicious.  Fresh fish, good size rolls, rice that wasn't dry in the slightest.  I thought it was extremely reasonably priced, and the takeout was ready when I arrived.  Chicago has a lot of OK sushi, but this sushi is amazing.  It's dangerous how close I live to this place, so I know I'll be back soon & often!"], ["Rona L.", "I had the green mussels, kamikaze and CRAZY horse. Great tasting sushi and fresh fish. Glad that we came earlier and found street parking as it could get really busy in that area.Sat at the bar and Mitch the main chef was an awesome guy. Really friendly and great at what he does. I'd say that the fish can be more varied, no albacore on the menu, but I'm surprised with the quality in Chicago. Fair price worth the quality.Will definitely come back in the future."], ["Eric C.", "Excellent all-around no-frills sushi/sashimi/maki place. Reasonably priced, high-quality, creative rolls with complex flavors and ingredients (e.g. try the grilled octopus roll). Come with at least 3 or 4 people to maximize the number of dishes you can order. NOTE: they will not seat you until all members in your party has arrived"], ["Radha K.", "I was in the area and ordered from Toro for pick-up and was not disappointed! I ordered the El Fuego (w/ jalapeno) and the Spicy Crunchy Tuna. Both were pretty dang good, even after waiting about an hour to eat after I got home. I definitely want to come back here for dinner!"], ["Becky C.", "I absolutely love Toro sushi. I use to live in the building across the street so I still try to go as often as possible. Their sushi is amazing and they are very accommodating with BYOB. If there is a long line, it can be kind of a haste because there's no where to wait and you can just give your name-- no reservations.That being said, the service is great and the owner and/or head sushi chef is so cool and makes you feel great with a fist bump upon leaving. Their bento box is my FAVORITE if you are splitting with 2 people and don't want to leave stuffed. All in all ,very quality, fun, and welcoming sushi restaurant!"], ["Hana M.", "Love this place. I only come here for lunch since dinner here is always packed. I normally get their lunch option and a special maki. Lunch is only served on Fridays and Saturdays. Lunch options are all served with miso, salad, and rice  Bento Lunch A = $6 2 side dishBento Lunch B = $7 1 side dish 1 main dishBento Lunch C= $ 8 1 main dish and 2 side dish Their side dish can be sashimi!!! worth the cheap lunch cost!The super white crunch is amazing and their hand rolls are great! Place is small so get here right when they open!"], ["Chuck S.", "came here basically off the yelp reviews cause I had a sushi craving and wanted to go somewhere new. Not disappointed! Delicious.Got there early enough that there were plenty of seats (7p.m.) but by the time we were finished there was a line. we eat at the bar, but it didn't bother me. we had a great time just watching the main guy make the sushi and talk to us around the bar. When we walked in, he wanted a fist bump, which I obliged, by the end of the night everyone was doing it. So that was cool!As for the rolls, I don't remember LOL. I know I had the spicy tuna, which had a kick to it but was not too spicy, loved it.I tried the roll with 3 pieces of fish, which was amazing. Had one of my dates rolls and it was also good.Would definitely go back here.Obviously by previous reviews we got there early, so should you."], ["Jialing L.", "My favorite sushi place in Chicago. One of my college friends was back in town visiting and we decided to come here since I'd heard so many great reviews. It did not disappoint. We ordered 4 rolls (the names are a little out there so I can't remember exactly what) but they were all so good. The fish is all really fresh and the other fillings matched and complemented the fish perfectly. We also each ordered the tempura green tea ice cream and it was both filling and light. Absolutely loved it. We came for a Friday night dinner around 6:30pm and was seated very quickly. The service was also great. The one thing is that the restaurant was kind of small so you don't really have much room to move. But the food trumps everything. Definitely worth a visit!"], ["Ada H.", "Best Sushi in Chicago There's nothing I can say that hasn't been said before. But seriously there's a reason that Toro has such a great rating. The food is amazing and Mitch (owner and head sushi sensei). My favorite rolls: spicy tako, ahi salad roll, kamikaze roll, and the hot finger roll appetizer. I've tried most of the menu and you can't go wrong with any selection. No matter how long the wait is, trust me it's worth it!"], ["Rebecca C.", "Most unique and best sushi I've come across. We got to chat with the owner Mitch who was a great compliment to our delicious dinner. We ordered the Awesome and El Fuego rolls. I will definitely recommend to others and return for my next sushi craving!"], ["A. J.", "Would give zero stars if I could!This place is ridiculously overrated. I came at 5:05 to insure I'd get a table, and was one of the first tables here. Fast forward to almost 50 mins later, I've had excuse after excuse why my simple order hadn't arrived (2 hand rolls, 2 pcs nigiri, and one small roll)... even after I asked the server to please stop making excuses, and just bring my food when it was ready.She ignored me, and just repeated, at length, the same excuse, 3 or 4 times: somehow a hand roll can only be rolled by the main chef, but 4 people work on the rolls, which was, of course, not mentioned when I made my order. Though I didn't say so, that doesn't even make sense: then have these four guys do the myriad rolls being delivered, and have the main chef do only the things only he can!After all this, I was treated as if I was the problem for not being satisfied with the situation and the excuses. Lack of listening & customer service were the issue, but she was completely oblivious.Meanwhile everyone around me is happily eating.When my order finally came 5 minutes later, it wasn't even correct: I ordered mackerel nigiri and they gave me salmon. I was done... I just asked them to bring the mackerel I ordered, a box, and the check.They couldn't even do that right... bringing a box that would hold barely one hand roll. When I protested, they took my food, packed it up, but didn't correct the incorrect nigiri. Now I had no nigiri in my box, had to reorder it and pay for it separately, adding further to my negative experience.I waited tables for years, and would never treat anyone the way I was treated! I guess they don't care, because this place is packed, but it would have been nice for someone, anyone, a manager perhaps(?) to try to make my experience better. Guess that's just not in Toro's DNA.Went home and am glad I have my own chopsticks, because there were none in the bag. See my pics of the broken looking mackerel and falling apart negi maki... nothing tasted fresh, it even smelled fishy,and I live right around the corner. I will never never eat here again!SIDE NOTE: After I left I couldn't shake the thought that the Escolar they were touting as \"Super White Tuna\" on the menu was something I'd heard about on the news... a quick Google search confirms it: several sushi places have been outed in Minneapolis for passing Escolar off as Super White Tuna, however it is not, and those in the know call it the \"ex-lax\" fish... Even the non-GMO regulating FDA warns about eating Escolar, as it contains a non-digestible compound that can cause \"nausea, diarrhea, and cramping...\" Thanks but no thanks!"], ["Lei L.", "Awuful bad service. Sooo rude! Both the manager and the waitress. Unbelievable ridiculous!!!"], ["James T.", "Food = 5Price = 5Experience = 5Great sushi... menus could have been a little cleaner... but, my bento box for $8 was so good."], ["Winnie T.", "The sushi I ordered are all delicious here and the chef Mitch always be nice to his customers... And, it's BYOB, but I forget to bring my wine there... Ahhhh, i want to talk to Chef Mitch: could u plz don't make your sushi too salty next time? I am an Asian from China, in my taste, I think the sushi is a little bit salty.. Maybe other American like it to be more salty... Anyway, I will inform to the server next time... And I give 5 stars, because they got really good sushi here... Thanks chef Mitch again~"], ["Veronica K.", "The hubby and I were in town for the weekend and craving some sushi. We looked on Yelp and and Toro happened to be nearby with fairly good reviews, so we took a chance. It was crowded and the prices looked reasonable.It's a pretty small place and kind of cramped inside. The server was friendly. They didn't have pork gyoza, which we thought was kind of strange. They only had vegetable gyoza that came deep fat fried. So we passed on that. I had a side salad that was drowning in ginger dressing. Hubs had miso soup. It's still hard to get used to the BYOB policy that a lot of restaurants in Chicago have. Being from Des Moines, we don't have that rule. It's kind of annoying if you don't want to bring your own liquor.I got a Philadelphia roll and a crunchy and spicy California roll, which were both pretty good but not anything better than I could have gotten in Des Moines. My husband got a Crazy Horse roll and some mackerel nigiri which he thought were just ok; nothing special. We've had some really great sushi in Des Moines that we expect better quality sushi when we go to a bigger city like Chicago. Toro's sushi wasn't bad, but it wasn't great, either.We probably wouldn't come back here again just because we thought we could probably find some place better."], ["Matt D.", "Toro Sushi is easily one of my favorite restaurants of all-time. The rolls are all incredibly creative and delicious, although spicy tako, kamikaze, and best of both worlds are on an entirely different level. And for the sushi purists, the sashimi and nigiri preparations are also noteworthy. Make sure to get a seat at the bar because Mitch, the owner and head sushi chef, is one of the most friendly and personable people you'll ever meet. On top of all that, the restaurant is BYOB, and who doesn't love that? They don't take reservations, but the waits are usually not too long and worth every second. Do yourself a favor and try this place out immediately."], ["Nanny G.", "Kamikaze and El fuego! WOW! Great customer service. Thank you so so much, Mitch! We had a fantastic time! We'll see you after our wedding :)"], ["Jackie M.", "Bigger does not mean better .. the sashimi and nigiri is very generous In portion. Too generous to a point where it's just too much raw and it's not balancing with the rice. Fish is quite fresh and there is an extensive choice of Maki. I'll pass on the Miso soup because it's too salty. This is a very small place with prob about 10 seat counter and able 8 small tables. This would be one of the better choices for sushi fix if you are looking for generous portion. I'm seeking for a nigiri that gives me the orgasmic bite!"], ["Meena A.", "LOVE this place! This is by far the best sushi place in Chicago. We ordered five rolls and each one of them is amazing. Make sure you try southern gals best sushi roll I've ever had!"], ["Svilena B.", "This place is really worth the wait to get seated. I came with a group of 6 on a Thursday night and the wait was about an hour. The sushi is delicious and you can tell that the ingredients are fresh. However, our waitress was not very friendly, did not answer our questions about the menu very well, and we had to wait a while for her to take our order. I would go back because the food was worth it but don't expect amazing service."], ["Caralyn O.", "We had an incredible night at Toro Sushi - well worth the wait. Mitch was wonderful, the fish was super fresh, and as it's BYOB it was a great value. We tried a mixture of special and regular rolls - even the basic salmon skin was memorable. Definitely worth a try! A new favorite."], ["Carolina N.", "YES! This place is excellent. My favorite sushi in all the city. The prices are reasonable and it's also BYOB. It's a bit crammed in there and the wait can be long but fairly so. Some of my favorite rolls include the sunshine roll, the OMG roll, and the ninja!"], ["Rachel R.", "One of the best meals I've ever had. A bit of a wait, but the food is well worth the wait. We sat at the bar and got to talking with Mitch - the man behind it all. We ended up asking for his recommendation, but ultimately we asked him to just give us whatever he wanted too. We were not disappointed. Each roll was better then the last, and Mitch's friendly conversation & attitude amplified the experience. I would recommend this place to any sushi lover in Chicago!"], ["Amanda T.", "I have worked in the service Industry for over 10 years. I was appalled at the customer service at this restaurant. Stopped in to this place to grab some dinner with a couple friends. One was on his way. Maybe 5-10 min away. We were STARVING and ready to throw down on some sushi. There were at least 7 open seats at the bar and 3 empty tables. They refused to seat us even though we wanted to order right away. They would not even let us sit at the bar and order anything. Can't tell you how good their sushi is however if you are looking for a pleasant dining experience this is not the place for you. I will probably never return here because of the bad taste left in my mouth."], ["Melissa M.", "Toro was the first sushi place in Chicago I tried, and it was outstanding. Every meal here is presented with the utmost care in aesthetics and taste. The rainbow roll was my favorite, but everything here is great. Make sure to bring your own wine!It can get a little loud here when it's packed, so I wouldn't recommend coming here for a date. But regardless, it's a fun, relatively standard spot for good sushi in Lincoln Park.Also of particular note: I REALLY appreciate the fact that Toro is closed on Sundays. Any sushi place that is open on a Sunday just makes me confused. (You don't receive deliveries on Sundays, so why would you serve day-old raw fish?) Anyway, thanks, Toro, for doing it right!"], ["Minh D.", "Get the nigiri sushi or sashimi. You won't regret it. This restaurant serves top notch fish and their fish slices are abundant. Rice is expertly packed with the right amount. The rolls (i.e. maki rolls) are ok. Unlike most suhi joints in the city, they do not skim on the fish of your nigiri pieces. This is easily one of the better and more reasonable sushi spots in the city. The restaurant is very small and always packed to the rim.... it is almost certain that you will have to wait for your table when coming here. Despite the wait for table, we will definitely come back."], ["Kara E.", "Came here on Friday with a friend at 6:30.  We waited about 20 minutes for a table.  Brought a bottle of wine and they had glasses for us right away.  I expected the service to be at least pretty slow but the waitresses were great, our food was brought out quickly and we never felt rushed.The sushi itself was good.  Nothing amazing, not the best I have ever had, but what we did have tasted fresh.  We got I believe  two simple rolls and one specialty roll (the sun one or something?).   We enjoyed our sushi and our wine.I'd recommend trying once, but its not a must-try."], ["Christopher V.", "Solid sushi.  Volcano & This is How we Roll were probably the best.  Nothing was amazing, but worth checking out if you're in the area.  Skip the chicken teriyaki.  Not marinated..just grilled chicken doused in sauce."], ["Rosalie S.", "The atmosphere and food are simply put, unique and fun. It's perfect for a casual but \"try something new\" date or a girls night out. They don't rush you even though the wait builds up. The rolls are extremely unique and I wish I could try more! Oh my God roll was my favorite. Sashimi was very fresh. Hopefully I'll be back!"], ["James I.", "Why 5- stars ?Because at the end of the day, the fish is so darn fresh and tasty that the annoying niggles are overcome.I swear that my studio apt in Chicago was bigger than the dining area. Also, I would recommend coming here on a weekday and early b/c it suffers from popular restaurant syndrome-  i.e insanely popular+ tiny interior.  Groups larger than 4 may find it difficult to get seating.The fish is VERY fresh and melts in your mouth like butter. I've had the Spicy Tako, OMG, and Crazy Horse. All excellent IMO.Service is decent, but nothing to write about. They have BYOB like so many Chitown restaurants.This is a few feet from Molly's Cupcakes, so it makes it a special end to your night in Lincoln Park. This is a restaurant where you would bring someone who HATES fish and watch them convert to the Synagogue of Sushi.It's moderately priced too which is nice.  :)A Chicago staple. Run, don't walk to this gem."], ["Coco Y.", "Very bad service. Very rude attitude. Nobody served us water ever and nobody checked if we are doing alright. In the end, they asked \"do u want to order more?\" We said no cuz we were still working on what we had. Right away they were like \"ok here's the check plz pay now\". And they automatically added 20% tip already. We questioned \"why u so rushing???!!!!\" They said oh you see so many customers are waiting. After we expressed our anger, they're like \"you see, we had so many Chinese customers before and they never complained\". Plz tell me WHAT THE HELL THAT WAS????? Plus one, very plain good, nothing special."], ["Diane G.", "I'm saying \"A-OK\" because the sushi was fresh and delicious, and the service was friendly, but I don't understand the 2-hour wait..My friends and I had no problem getting at seat around 5pm, but the last time I tried to come here the wait was literally 2 hours. With so many options that are up to par (Green Tea Japanese restaurant, or Kai Zan or Yuzu if you're out West), I don't understand the hype. I had scallop nigiri and the salmon crunch roll, both of which were fresh and good, but nothing outstanding. If I were in the area and there was little to no wait, I'd go, but I wouldn't wait for an obscene amount of time to go here!"], ["Chris T.", "Ok I have to be a little bit of a snotty spoiled Californian... ready? Here we go: this place is good, for Chicago. I haven't had the most luck in terms of sushi here so far, but this place was decent. Yes there is a looong wait and the location is small, but coming from San Francisco I expect that. The wait for 4 was an hour and 20 mins.What's good:My fave was the Super White Crunch RollMy friend loved the Tipsy Trixie roll, I thought it was good too.Decent: Kamikaze rollOh My God RollSpicy Tako roll (you better like octopus)I wouldn't rush back to this place, but I wouldn't mind going if someone was dying to try."], ["Avery A.", "I took my girlfriend here for Valentines day. The wait got up to 2 hours, though we put our name in early. It's a small, quaint, Japanese restaurant, though I would surmise that most only come here for the sushi as their menu isn't extensive otherwise. For Chicago, this is pretty good sushi for the price. They have great speciality rolls with beautiful presentation (see pic). Not the best sushi (even for its price) that I have had in Chicago, but I think it's a solid place that is worth coming to if you don't have too long of a wait. I really thought they did a great job with the artistry and sushi combinations. If you're from New York, Japan, or somewhere with truly great sushi, this may not be fulfilling to you."]], "Shiso": [], "Sushi Dokku": [], "Umai": [["Heidi L.", "Stopped by on a chilly day - which meant I was trying to decide between sushi (my original plan) and ramen. I ended up getting both -- a spicy tuna roll ($7) and the garlic pork spicy miso ramen ($14). The spicy tuna came in 8 pieces -- the tuna wasn't chopped tiny and there was no mayo, so +1. As for the ramen, the noodle texture were more like egg noodles (full disclosure: my guideline for ramen is Santouka). As other reviewers have noted, the spicy miso is not all that spicy (more like a layer on top of a miso) -- and the broth is not very porky, but on the plus, there were plenty of scallions and the egg was done perfectly. As for the meat, I think I would have preferred more of the spicy ground pork and less of the belly, which definitely felt out of place (probably placed in last?) and not as tender as I would have liked.My friend had a chirashi -- at $25, it was quite large -- the size of my ramen bowl -- and she had trouble finishing it. There was a good variety of fish (eyeballing it, probably 8 or 9 kinds with 2 to 3 pieces each?) and the salmon in particular looked quite fresh.The garlic pork ramen is good for folks who like lighter broths, and it hit the spot for that particularly cold day. That said, I think I would probably get a couple of rolls next time. This is a pretty good option for South Loop."], ["J M.", "If you're looking for a good Japanese restaurant in the South Loop, Umai is THE Place! Ate at Umai twice in 1 week (lunch and for dinner) and both times had exceeded my expectations.  Good service, great ambience, easy parking, and of course... good quality food! They have Lunch sets ($10 - $15) & is enough food to put you into a food coma!Their soup noodles are all really good - Beef Sukiyaki, Tempura Udon & Pork belly Ramen are all a must try! The nigiri are very fresh and they are large cut, draping over the rice.The grill selection is not many, but the Beef tongue & Pork shoulders are very tasty.Will definitely come back!"], ["Reinhardt V.", "I only ordered out...I want to eat in next time.Food - My wife and I got the Sloopin, Mexicana, and the Philly roll. It was delicious, the fish tasted fresh and the combo of flavors made every bite worth every penny. Every sushi bite stuck together and never fell apart which is a huge plus.Service - Host was extremely friendly and food was ready fast. Everyone seemed to want to help. I will judge eat in service next time, but it seems people generally feel the same way.Atmosphere - Nothing out of the ordinary and kind of in step with any other higher class sushi bar. Regardless, I still felt a desire to want to eat in.Food - 2/2Service - 2/2Atmosphere - 1/1"], ["Matthew M.", "I eat here literally once a week. Being an Amli resident this place is not only convenient but tasty as well. Menu ranges from steaks to great ramen & of course sushi."], ["Nicholas K.", "Stopped by this spot because I was craving sushi. I ordered the omakase, which was the chef's choice selection of fish. While I'm no expert on sushi, I was a little disappointed with the quality of the fish and the tamago. Tamago used to be a defining line for the ability of the sushi chefs and Umai's tasted like nothing but sugar with no hint of mirin or sake. However, the fish was cut well, was warm, and very aesthetically pleasing. Overall, I'm not sure if I'll return because the quality was so disappointing.Service was fine. Waitresses checked up on me occasionally and were very kind."], ["Gene L.", "Slightly above average. Hamachi collar was good and so was the lunch salmon teriyaki. Lunch chirasi for $18 has only about 9 thinly sliced pieces of fish on top of the sushi rice. which is less in quantity and higher priced than other places that I have been to. Service was good so bumped from 3.5 to 4 stars."], ["Riva L.", "The food is good, but the service is so bad!!  I went here for sushi and the waitress did not bring me a drink menu - totally fine, I look pretty young.  However, I wanted a beer, so as I ordered my meal I asked for the drink menu.  She didn't bring it over for almost fifteen minutes!  By that time, my food had already come, and I didn't see much point.  The sushi was very good.  I ordered the Chicago roll and it was beautifully presented and very yummy.  The fish and all of the ingredients were fresh tasting and well-prepared.However, once I said I didn't want a beer anymore, my waitress disappeared into thin air.  I am not kidding, I did not see her ever again.  I finished my food and sat with an empty plate for quite a while.  Eventually, the host came and removed my plate and gave me my check.  The one good thing I can say for the service is that I forgot my wallet, and as long as I left my bag with them, I was very politely and kindly allowed to go home and get it!"], ["Jie S.", "Yes, a happy lunch on a cold day. Even it is late April, the tempature is still below 40F. I really needed a warm noodle soup.Umai is on the corner of Polk and S. Clark. Very comfy and earthy lobby. We did a bit research before hand so quickly chose Ton Katsu Ramen and Winter Ramen. Both were served in the huge bowl. The Winter Ramen appeared in a spicy broth which was actually not as spicy as it looked. I liked the proached egg and ground pork sauce on the top. Thin sliced beef was OK. The soup is slightly on the salty side. The noodle was cooked right with a bit chewy. An awesome bowl for this cold day. My friend's was pretty good too. She liked the pork belly a lot. The soup was also a bit salty for her. So both of us drunk a lot of tea and walked out with a round belly.We also tried a piece of Unagi which is average. Service was fine without much delay. Would come again when the weather allows a nice stride outside. May be some summer noodle soup next time."], ["Jennifer M.", "3.5 stars.  The good: the servers are friendly / the service is good. The space is large, and accommodating to large parties. The not so good: the fish (I got tuna and white tuna) didn't taste as fresh at it looked. Minor let down. The ramen (spicy garlic) was too salty and just average tasting."], ["Emily H.", "The Unagi don was good, the sukiyaki is very so so, too salty, filled with soy sauce.The best thing I had there is probalby the garlic ramen, other than that, it is just an average Japanese restaurant.For the price, i think it pays for the environment, as it is quite nicely presented. Food-wise is just so so."], ["Laura M.", "My husband and I order from here often, and the food never disappoints.  Last night, we had the tempura platter as an appetizer, which is one of my favorites here.  Mixed vegetables and shrimp fried to perfection with a tasty dipping sauce.  We then ordered one of the evening specials: the king crab miso ramen.  It was fantastic!  We each ordered one but weren't able to finish it because the helping was so large.  In the past, we've also had a variety of their sushi offerings, which have always been terrific.  The price is reasonable, and the service is good.  The restaurant is always full with other patrons, but we've never had to wait long to be seated.  We will definitely be eating here again."], ["Hera J.", "It has been a long time since I been at a place where every single thing I ordered, I didn't want it to end. It's just that good!!! We got the lychee martini which was soooo smooth. Wasn't too sweet and was refreshing.We also got the Chicago roll, which contrary to other sushi places, it has much more fish than rice. The roll was a decent size and perfect to split with 2 people as an appetizer. I can't explain how good it tasted! Now RAMEN! I had the ton katsu ramen which was amazing! The broth was sooo on point! The pork was so thick and had great flavor. The egg was perfectly done where the yolk was still runny. My bf ordered the spicy roasted garlic ramen. Don't let the name fool you. The garlic flavor was not overbearing. Balance was perfect! We recommend both! We will definitely be coming back soon."], ["Mike M.", "I came here for dinner on a random weekday, and it was literally in the same building as one of my friend's apartment. It was pretty dead inside so it was no problem getting a table. The inside looked pretty nice. It had that simple yet modern kind of feel. There were wooden tables, wooden floors and big windows along the walls.I didn't get to try too many things on the menu since there was just two of us, but I thought the food I ordered was really good. I got the spicy roasted garlic pork ramen. The noodles were somewhat forgettable, but wow that broth was amazing. It was rich and had that deep pork flavor. Throughout the ramen was little bits of spicy ground pork and on top were a couple pieces of nicely charred pork belly. The runny egg was also cooked perfectly. The best part though was the strong garlic flavor. I haven't seen too many ramen places where garlic was a dominant flavor, and being a garlic lover, I couldn't get enough of it. Overall it was a very solid bowl of ramen, surprisingly better than some of the other places I've tried around Chicago.For dessert we got the green tea creme brulee and strawberry mochi ice cream. The mochi was pretty standard, but the creme brulee was a nice unique dessert. It had a nice caramelized top and sweet green tea flavored cream underneath. I don't know if I'd go out of my way just to visit Umai, but the food was tasty and I'd probably go back if I was in the area."], ["Cherry L.", "I tried their lunch ramen with some agedashi tofu... Great portions and price, however, the food really was just okay. They taste fine, just not the most authentic I have had... But it has a pretty chic decor and a number of large tables, so a great place for a bigger group for drinks and some light food."], ["Kim L.", "In town for a conference. Ordered delivery since I have been feeling under the weather. Besides having a hard time communicating with the woman who took my order (cell phone issues?), the ramen was good. I would order/ eat here again."], ["Quoc N.", "It was a frigid (to me) 35 degrees and I wanted something that would soothe my soul a bit. Naturally, pho would do it but since I was more than 2000 miles away from sunny SoCal, I had to choose an alternative.  Umai ultimately became the lucky winner for my gastronomic adventure for lunch.I had the roasted spicy pork belly ramen and thought it was perfect considering how hungry I was and how cold I felt. Noodles were still a little al dente so to speak, which is something I prefer, and it also had great texture.  This isn't your normal dry ramen from college so expect to pay a little more, its definitely worth it. Also, if you're a fan of spicy, then try their spicy edamame. I'm not sure what they sprinkled on but those beans tasted pretty awesome by themselves."], ["Kiujoy K.", "I was brought here by a friend during my stay in Chicago, and this restaurant, hands down, is a new favorite for sushi and noodles. Our dinner started off with \"LOLLIPOPS CHICKEN\" as the appetizer. They were near perfectly fried and the accompanying mayo dipping sauce was spectacular as it complimented them so well. Following the appetizer, we were given our sushi orders, \"NAKED,\" \"MEXICANA,\" and \"DYNAMITE.\" Their presentation for each dish was brilliant. The Naked was unique as it was not wrapped in traditional rice or seaweed, but cucumbers that offered a slimy and soft texture and taste. The Dynamite, with its sweet potato tempura and kani kana, offered perfect texture and heat. The Mexicana was beautifully decorated as the avocados and fish were an unbeatable combination. After sushi were the noodles. I ordered the Winter Ramen while my accompanying party ordered the Ton Kotsu and Spicy Garlic Pork Ramen. The Winter Ramen was great with soup that looked red but not spicy. It had a mild or close to no heat along with, perfect for my taste buds. I had a spoonful of the Spicy Garlic soup too, and the soup of that was even better than the Winter. I never had a taste of the Ton Kotsu, but according to my friend, she claims it's the best one of all. Umai is a great getaway restaurant for a date, family, or friends. It offers beautiful sushi and the ramen and udon is an extra bonus. The waiters and waitresses are all great. Although there were a couple parties present in addition to the other groups seated at tables, our waitress was always there when needed. Good time. Good vibes."], ["Angelique A.", "Very good value for lunch. We got ramen and the bento box and throughly enjoyed all the offerings. Everything was fresh and cooked perfectly, the spicy tuna rolls were huge and the fish was actually spiced nicely!  However while I could appreciate the quality of ingredients, I was not super fond of the miso and ramen but maybe they were healthier than those of a regular ramen place. Definitely could have used more flavor development in my opinion with the soups. A friend told me later this place is great for curry, I would return for the value and try that instead."], ["Yiwen T.", "I have been to many ramen shops in the US and have not found a bowl of ramen that has a wow factor. I was hopeful to try out another restaurant that serves ramen. Since it was lunch time, my friend and I order their lunch special ramen, chashu ramen. The toppings were great. The chashu was tender and the bamboo shoots were flavorful. However, the broth was very salty and heavy while the noodles were tough. Broth and noodles are such important components of a noodle soup and should be able to stand alone. After this experience, I have officially given up on ramen and will no longer go out of my way for it. Maybe I will give ramen another try if I ever travel to Japan. I also ordered the sashimi bento. The sashimi tasted very fresh. My favorite sashimi was the escolar, which was tasty and buttery!"], ["Carolyn A.", "Wonderful, classy sushi place in the South Loop. Went here on a first date and keep going back for date night regularly. It's easy to get a seat if your party is two people, but definitely make a reservation if you have three or more - I had to wait over an hour to be seated with three people once. The waiters make great suggestions on which specialty rolls to try - the Mexicana and Chicago rolls are delicious. I always get warm sake and miso soup with my meals. I recently tried the seaweed salad, and it was a great appetizer as well. The atmosphere inside is very lovely, not too loud, and intimate."], ["laura c.", "this place was GREAT! I was in Chicago for work and craving Japanese food at lunch... and once again I got a great suggestion from yelp!My friend and I both love Japanese but hate seafood (because we're crazy).  she got potstickers and a cucumber roll, and I had avocado roll and miso soup and an asparagus tempura roll.  I have never had an avocado tempura roll before, and let me tell you I was a happy girl.  It was so yummy!Also, I was having a bit of food regret because the people next to us were eating ramen that looked AWESOME.  I wish I had more time in town and could have come back!"], ["Natasha R.", "Umai is a perfect little date night spot in the South Loop area. I've been here twice after walking around the city all day. The first time I was here it was raining really hard and it was incredibly cozy looking out into the world while eating delicious food. My second time here was a couple of weeks ago and we had a chance to sit outside on their patio - probably one of our last outdoor dining experiences this year :( I forgot what I had my first time around, but after looking through my Yelp photos I realized that I ordered the same thing both times, which I find hilarious. I had one of Chef's specialities - SukiYaki which is thinly sliced beef loin, with shirataki noodles, mushroom, grilled tofu, and a delicious sukiyaki sauce. It's so good that I might have to order it again when I go back to Umai. We also had a couple simple but very fresh  sushi rolls that are priced fairly good. I like everything about this place - from the food/service to the nice decor that's not overdone or boring. As I said before, the prices are fair, considering Umai's location and how excellent their food tastes. My fiancé loved the food as well and we both agree that it's full of flavor and different than most Japanese restaurants we've been to. I love exploring and checking out new cafes and restaurants, but it's also nice to have a place you can go back to over and over again and know that it will be consistent and enjoyable. Umai happens to be that one place for me and I can't wait to eat there again!"], ["Avi B.", "Had much better Japanese food in Chicago.  Came in after reading the reviews in Yelp and went for the safe bets (seaweed salad and two half rolls) but the rolls were way below average for a restaurant that gets this high reviews in Yelp. The service, however, was attentive and knowledgable. Pleasure. I wish the kitchen lived up to it  Dear Yelpers, we are here for each other, please be less \"nice\" in your reviews so we can all know what we should expect when going to a place. Cheers!"], ["Caitlin L.", "This was my first Japanese food experience and I loved it. I had the Udon Kare and Shrimp Tempura roll. Delicious! Fun atmosphere and kind servers."], ["Gregory C.", "Great atmosphere, great food.  There's a reason this place is busy every day of the week!  Nigiri is fresh and generous in portions. Udon and noodles are very tasty.  Most importantly, wifey loves it so I can always bring her on a winning date and look awesome. Everyone I know loves it, I love it.  Share the love."], ["Erayna G.", "Sushi rolls are delicious and fresh. Ramen is a nice serving size but spicy one didn't have much flavor."], ["Jake B.", "So good. I was here recently with a large group and I think everyone thoroughly enjoyed the food. We had the lollipop chicken, beef tongue, and beef hanger skewer as appetizers, based on our waitress' recommendations, and they were all delicious, especially the lollipop chicken. We also got the Chicago, Umai Crunchi, one of the house special rolls, and various bowls of ramen (yeah we ate a lot), and they were all so good. Finally, the lychee sorbet / ice cream was just amazing. I've never had it before, but now I want it all the time. Service was attentive, nice, and helpful. The place was clean and modern. It's rare to find a Japanese restaurant that does both sushi and ramen well, and Umai nails it. I'm definitely coming back."], ["Stacy D.", "Ordered delivery 3 times and been here once.  Great food and worth the 1 hr wait for delivery.  Love their agedashi tofu, order it every time.  Really tender pieces of tofu, covered in a crispy yet chewy shell, plus great dipping sauce.  It's my favorite agedashi in Chicago.  Saving their dipping sauce and trying to replicate the tofu part at home, not sure if I can do it as well!"], ["Nia M.", "Waited a bit to be seated. Waited a bit more to be served. But the sake (Homare Nigori) was pleasant. Strong and delicious. We got the White Tuna Jalapeño and Spicy Tuna as well as the Ton Kotsu Ramen (Chef's Recommendation). The White Tuna Jalapeño was my favorite, sweet and fresh. The complimentary Miso soup they gave us for the wait was also delicious. Comforting. As was the broth in the ramen. It started raining a lot so they gave us a free bowl of green tea ice cream. That was awesome. I'd come here again. It was crowded for a Tuesday. But still a welcoming vibe."], ["Sangwoo K.", "Let me start by saying that this place deserves 4.5 stars. I just couldn't give it 5 stars because it's not \"as good as it gets\", but it is definitely better than 4 stars. My girlfriend and I definitely over-ordered, but that means we got to try a bunch of different things as I describe below.First, the interior. It is clean and not too loud. Lots of natural sunlight. They also have really nicely placed mirrors so the restaurant looks a lot bigger than it actually is (I almost walked into one on my way to the bathroom). Oh and the bathrooms are nice and clean.1. Ton kotsu Ramen. DELICIOUS. Not only is the meat super tender and flavorful, but they also give you a lot of it. I would eat this everyday if I could. Highly highly recommended. 5 stars.2. Sukiyaki. This is amazing. The broth is the perfect balance between sweet and savory and the vegetables were cooked perfectly. The meat was a BIT on the fatty side, but man was it delicious. 4.5 stars.3. Tempura Udon. Standard and nothing special. But it was clean and they give you a pretty large serving of both udon and tempura. 4 stars.The table next to us had the soba and it looked bomb. WHEN (not if) I go again, I really want to try to gyu-don and lollipops chicken (great name and it looked amazing). Highly recommended. Also, I made a reservation for a friday evening dinner, and I was pretty glad I did because it filled up pretty quickly."], ["Jon L.", "Had dinner with a friend here.  We both ordered the chef's recommended ramen which was huge and consisted of a number of tasty ingredients including seaweed, medium-boiled egg, and braised pork belly.  I also ordered the green tea crème brûlée which I thought was an impressive effort for a place that doesn't specialize in French cuisine."], ["Manpreet K S.", "Umai has minimalistic beautiful decor!! Love the patio seating as well. They have great menu to select from but my favorite from our visit as follows:Spicy garlic pork ramen- NYOM, I highly recommend this Lychee martini- I am biased but it was great Sushi fav- goosebumps roll and chicago salmon something Looking forward to our next visit soon!!!!"], ["Nicholas T.", "Quick, friendly, reasonably priced, with good food. What more could you ask for in a local sushi spot? For the residents of Printers Row, this is a nice change from the limited options that exist within a 2-3 bloc radius. Where this place really shines is its take out business. Anything on the menu is ready in under 20 minutes and tastes just like it does at the restaurant. My go to has always been the Salmon Shioyaki."], ["Chris T.", "My continued hunt for great Ramen in Chicago brought me here. Joined by my grouchy friend after a terrible day at work, a plethora of appetizers and cocktails turned his day around. This place was recommended by him and a few others I know, and I've had it bookmarked for ages now. Overall the meal and the service was great.The food:Wasabi Shumai - definitely has a kick to it... which I should have guessed by the name alone. Loved it.Age Dashi Tofu - interesting textures. As a chopstick novice it was a bit difficult for me, but the pieces I did end up getting in my mouth were great.Pork Shoulder - Definitely recommend this one. Just sad that there were only 2 pieces.The Spicy Roasted Garlic Pork Ramen was, of course, great. Not the best I've had but probably the best I've had here in town. I only wish there was a little more of everything in it, the bowl looked a bit bare when it arrived. I totally recommend my fellow Ramen-addicts to try it out.My only complaint were that the cocktails were a little too sweet, but that's probably our fault for ordering the girliest, most colorful cocktails on the menu (Sex and the City style). The service was great, and the outdoor seating was much appreciated on a perfect summer day (which are rare these days). I'll definitely come back!"], ["Laura W.", "Love the ramen!  I usually get the Ton Kotsu with extra Shashu.  I have tried a few rolls and some appetizers, all very good.  Just moved to South Loop from burbs where the two top ramen places are, but their ramen did not disappoint.  I will be a regular here for sure.  Atmosphere is very nice.  I always make a reservation, even for 2 because I hate to wait!"], ["Janet C.", "Came here mainly wanted ramen, so this review is based on that. My husband ordered the ton katsu ramen and I the winter ramen. I quite like the broth of mine but I was hoping it to be more spicy. The beef was tasty and tender. I was quite disappointed with the texture of the ramen because it was like packet ramen that you can buy in supermarket. My husband liked his choice but it wasn't anything special. Anyway, the reason we came here was because Ramen Takeya wasn't open and we found this place on yelp. It was much closer to where we lived so we decided to give it a try. I am giving this place a 3 star because it was alright but nothing special. I would come if I really didn't want to cook and really didn't want to travel far. But otherwise, I'd definitely pick Ramen Takeya over Umai."], ["Keely Z.", "The atmosphere and services were nice and relaxing. But the food on the other hand was not so great. We ordered the spicy  garlic pork ramen and the broth was so SALTY; and the noodle was hard. We also ordered half the le bonki and half of Chicago roll. The salmon on the le bonki was not fresh. The only decent dish we ordered was the Chicago roll."], ["Karen T.", "Tempura udon is very delicious !!!!it is my favorite meal~It is lots of beef in Udon Kate~tasty~If u like udon,u must go to umai"], ["I. C.", "This restaurant may not be good for sushi (from other guys reviews, I haven't tried) but if you want to have other Japanese foods with a reasonable price, this restaurant would be a good choice. I like their Katsu Kare and ramen."], ["Chendidi L.", "pho is good, just became a bit salty after a while. Pork is thicker than average. I got the suggested noodles for $13 but they charged 20% tips!!"]], "Kai Zan": [["Marcus O.", "/TL;DRSuper accommodating with great service. Spectacular food. Best gem is when you ask the waitstaff for their recommendation, and they lock up because they have a hard time telling you which one they love most.Since we were in the loop, getting here required taking a bit of drive with Uber to get there. Well worth it though./ATMOSPHEREOne way to describe this place would be small. From the outside, it looks it. Inside, it's perfectly cramped which creates a type of intimate surrounding. The booths near the sushi bar are private in a way since the walls are very high. The decor was quite warm and inviting./FOODWe went with the recommendation the waitstaff provided. It was on point. If you need an idea, go for the pearls. We couldn't decide between the escolar or maguro pearls so they split a single dish. Honestly, it was the best thing we ate there.I don't know though. I mean... char siu? Ridiculous. So damn good. We also had a selection of maki rolls. They were probably my least favorite but still definitely memorable./SERVICEExcellent. Attentive. Knowledgable. A little slow at times... but Kai Zan was packed out! They were gracious with accommodating our late arrival. Glad, too, since it turned out to be one of the best sushi meals I've ever had.HOW TO READ MY REVIEWS:1 Star - Does not approach edible. Enter at your own risk.2 Stars - If I'm in the area, I'd pick something else.3 Stars - I would stop by if I happen to be in the area.4 Stars - I would pick this place out of other places nearby.5 Stars - I would go out of my way to dine here."], ["Michael P.", "Yelp needs to have an extra credit rating or something, because I cannot praise Kai Zan enough.  We ended up here for my girlfriend's birthday.  She used to live over this way, and when we started dating and were comparing \"This is the best sushi place in the city\" stories, she mentioned Kai Zan and stuck to it.  Every place I mentioned, she would just say, \"I want to take you to Kai Zan.\"  I put her off long enough to make it part of her birthday evening, and I am kicking myself for waiting so long.  This was the best sushi experience I have had in the city, period.  We started off with some chutoro, then dove into the Omakase.  The chutoro was delicious, better than the otoro I have had some places.  I will not recount each and every course of the Omakase as that has been done ad nauseum, but I will point out some highlights.  I would make a meal out of the escolar and maguro bites.  Delectable.  A close second in the \"eat this until I'm full\" was the maguro stuffed with crab.  The shooters course included one with oyster and one with uni and scallop.  Both had quail egg.  The uni/scallop shooter was the freshest, most oceanic thing I recall having ever tasted.  The only courses I would not rave about were the roll and the sashimi plate.  The roll was a good roll, but it was still just a roll that didn't really showcase the fish.  The sashimi plate was excellent save for the maguro which inexplicably did not seem to be of the same quality as that which had been used in the other maguro courses.  It was still better than what you get at most sushi restaurants, but by the time that course (the 10th) came, I was getting spoiled.  The service was just fine.  Very pleasant, described each dish well, answered all questions.  Only complaint is that the meal was a bit rushed as compared to other Omakase dinners I have had.  A few times the next dish was brought right as we were finishing a course, and once we had two on the table at the same time.  And I am not a slow eater.  I can be quite the pig, if I have to be honest, so I don't feel bad saying I felt rushed.  I really cannot understand any of the reviewers who have expressed disappointment with the prices at Kai Zan.  $60 for an Omakase of this quality is an absolute bargain.  Try getting all of those same dishes at Arami, Katsu, Macku Signature, Momotaro, whatever your favorite sushi place is, and I feel safe saying it's going to cost more by a decent amount, and there are not more than a handful of sushi restaurants in Chicago where the quality will be in the same ballpark. I have other daily drivers I will continue to go to, but Kai Zan just secured a position as the place I will go to when I really want to do it right."], ["Vicki P.", "My husband and I went here a few time, it has always been wonderful. This last visit a few weeks ago I was ever so slightly disappointed in a piece of sashimi we got, I mentioned it to my husband and as it turned out, the manager over heard me and brought us a new piece. I asked her why she did that and she told us how important it was that we got what we expected and that the experience was a good one.  I was truly impressed by this actually... here is a place that always gets great reviews, is always busy, but still found so much value in making sure we were happy, even without us asking. Love this place!Vicki"], ["Gina V.", "I love the food here. The best sushi in Chicago is very fresh and authentic.  The chef came to our table to tell us that he had personally prepared the salmon skin himself.  The deserts are so delicious too."], ["Broc K.", "The food is very delicate and special. From their appearance, you will feel its super delicious.Every dish, the chef will give his unique skill to perfect it. It is more than a food, more like art.Really recommend it."], ["Matthew D.", "The food was terrific. However their slouchy long-haired waiter rubbed our entire party wrong with the lax attitude rubbed us entirely the wrong way. He had no opinion on any of the dishes, made us feel stupid for not knowing the portion sizes, and made no efforts to make first time visitors feel welcome. Also, their wait staff picked up two dishes which weren't even completely finished. Hey! We still have ginger on the plate asshole! Michelin rated for the food, not the service. This food was AMAZING but find some new employees"], ["Anna P.", "Best Japanese in Chicago. Three tips for when you visit:1. Get the omakase. Kai Zan chefs know what you want more than you do. Trust me on this.2. Make a reservation. You will never get in without one. And be prepared to get up and leave after 90 minutes; they're strict here.3. If it's not on the omakase menu, do yourself a favor and add on an order of the escolar pearls.Prepare to have your mind blown!"], ["Sarah M.", "SO GREAT! Amazing small dishes with so much flavor. I recommend the green monster roll, but you really can't go wrong."], ["Farha K.", "2 days after eating one of the most spectacular dinners of 2015 yet I'm still dreaming about every course served up at Kai Zan. I try to keep up with the foodie scene in Chicago even though I moved out to the east coast a year ago and stumbled upon Kai Zan's instagram page about a month ago. Kai Zan isn't your momma's sushi restaurant so check your expectations.. and everything you know about sushi at the door. Now step in. The decor will quite literally set the tone for the rest of the night, it's dark..moody...sexy... you may blush a little when you step in even. The staff is incredibly friendly though and you'll feel at ease immediately. If you're lucky you might get seated at the bar so you can watch the magic happen, but the cozy booths lend themselves to a more intimate seating if you're there as a couple or a small group and want your privacy. While stalking Kai Zan's instagram I basically had my heart set on trying out their Omakase menu ...but literally everything screams to be eaten and the choices are insane! how do you pick one over the other?? the Omakase is a 10 course hand selected menu by the chefs which really does introduce you to almost everything on the menu. It's special.. it truly is special. We started off with the Japanese Red Snapper wrapped around toro and topped with basil miso olive oil and tobiko... and ZOMG!!! I may have had a moment ... wink wink ....followed by more amazingness.. but my personal favorite had to be the Oyster and scallop shooters topped with ponzu sauce and fresh Uni.. how is this even real life? So glad we got 2 shooters each cuz there's no way I would have settled for just 1. I think the chef over heard me gushing about my love affair with Uni, cuz he ended up treating us to an extra course of hamachi with uni on the house.. over this amazing sweet mango sauce of some sort.. I stopped paying attention to every detail after some time.. you'll see the pictures on my IG and know what I'm talking about.  I just wanted to enjoy each bite and every moment. By the end of dinner we were sufficiently stuffed..split dessert between the two of us and had a couple drinks. Definitely made for a fun girl's night out and you really do need to go here with someone who appreciates sashimi in its best form. Save this one for a special night... but make it happen soon!"], ["Chandni K.", "Some of the best sushi I've had! I would highly recommend the Omakase for the value and variety. You get 10 courses, some of which are 4-5 bites of food. You won't leave hungry. If you're not a picky eater and like surprises, this place is awesome. You don't know what you're going to get until it's sitting in front of you. Everything was good, but I do have some favorites - the escolar pearls, uni and oyster shooters, angry crab, and fiesta maki roll. For dessert we had the seasonal mochi (sweet potato and brown butter) and the cashew panna cotta, which are good if you're not into really sweet desserts. Overall, an awesome meal and a really fun experience. Can't wait to go back!"], ["Jasmin T.", "People love this place and I always wonder why. We went up eating here when we are starving after work and the portions are not enough and the prices are sky high. Sure it's cute, but there are other places that you can go to get some great sushi. The staff is really friendly and help you make some smart choices. If you do do I recommend the calamari strings and whatever the chef's special role is. I didn't like the limited dessert menu. As someone with a big sweet tooth that is a must!!"], ["Shradha A.", "As a vegetarian, they had very limited selection so I couldn't rate this high from my point of view. I have heard amazing things from others, as the Yelp reviews indicate, for non-vegetarian selection. We had the agedashi tofu, a maki roll with some pickled vegetables, and a mushroom skewer. Request the booths - the ambiance there is quite cool. We were sat at the counter, so it was fun seeing the colorful preparations designed quite well."], ["Amy S.", "Magnificent! I came here with my boyfriend, sister, and brother-in-law. It was an early celebration for my sister, who happens to be a chef, so I was trying to choose the best meal in Chicago that wouldn't break the bank, and a place that we all haven't been to yet. And what do you know, Kai Zan was just that spot!We all got the Omakase Chef's Choice 12-course tasting. This is basically a surprise tasting, where everything is left to the Chef. Of course if you have any restrictions or allergies, the Chef will adjust the menu accordingly. I have to say, without exaggerating at all, this was the best seafood experience I have ever had in Chicago. Every single course contained the freshest and highest quality fish. I am super picky about sushi and especially sashimi, but this literally melts in your mouth. Every course was full of surprises and full of bold flavors. I have attached all of the food from the courses to this review if you want to check it out. It's BYOB but the corkage fee is $15, which has gone up from when they first started. The Omakase 12-course menu is $60/person, which is very very reasonable for the amount of quality food you get. Although the neighborhood seems sketchy, it's really not bad. Plus, parking is plentiful which makes it easier to get to.The one and only thing I would change is incorporating 1-2 dessert courses at the very end of the meal because after the \"main course\" there are more maki and sashimi courses."], ["Jeff P.", "I wasn't totally impressed with the food we did the chef's tasting menu... meh... also service was so-so we had a 10:15pm reservation which maybe contributed to that but still.... meh.... better options for a $200+ dinner for 2."], ["Maggie Z.", "The waiter that took our order wasn't friendly. He looked like he was constantly despising other people and treated us like 2-year olds. But.... the food was great! So good that we could completely ignore the waiter as he ignored us. We ordered a $70 omakase ($60 if you don't want to share), 2 chutoro nigiris and a chicken teriyaki. I can't say I enjoyed all of them, and because there was no desert so it didn't feel like a complete omakase meal, but some of the dishes were AMAZINGLY Delicious.A lot of the things were not on the menu. But if you have sth you want in mind, you can always ask them to prepare it for you. (Here's our waiter trying to look like a pro: \"I mean, if you're a sushi bar, you have to have those things.\")"], ["Rebecca W.", "The food was amazing! We ordered the chef's choice and each dish that came out was presented beautifully and tasted delicious. We were stuffed when tenth course came out.The atmosphere was very cute, great for a date or small group. My only complaint was the courses came out so quickly, sometimes before we had finished the present one on the table. I know this place is popular and reservations are difficult but the two hour time limit on each table made us feel rushed. We would have finished in under two hours easily but I was very aware of the time. Outside of that I will check this place out again. Also, the sake selection was superb!"], ["Huong N.", "The service is spectacular. Although we were designated with one server, multiple staffs check in with us and brought our food. Water was always filled. They had complementary green tea. It was amazing to sit in the bar because you will have the experience to watch the sushi chefs and cooks make the food for you. It was very enjoyable to watch. They take their time and are so careful with their food. I would suggest getting  the omasake if it's your first time. It's a sample of all their specialties for $60 which included about  9-10 courses of food. Personally, I thought the cooked food was alright. However, what was really delicious was the sushi and fish. I have never had fish this fresh. It's so fresh that it doesn't even taste like fish. Once you eat here, you'll realize what you have been missing your whole life. I love this place and recommend everyone to try this place. You will not regret! Proceed with caution as you will get addicted."], ["Angie M.", "Kai Zan.Man.It's one classy restaurant.I love the private booths.  I love the regular tables, too.  The staff is nothing short of exceptional.  Accommodating, enthusiastic and wanting to make your experience amazing.And the experience is serious.  When I have brought people to Kai Zan I've preempted our visit by explaining that this is not your typical sushi experience.  Yeah, they have a few rolls, but you're not getting a spicy tuna roll.  You're getting shooters with oysters and raw quail egg.  You're getting interesting sashimi selections.  Not for the sushi virgin, probably, but definitely for those with adventurous palettes looking for something... different.  And exciting.  And most of all, really yummy.Best bet is to go for the chef's special, which will be a tour of what's freshest, best and most exciting that evening.  Be sure to tell them what you like and what you don't like.  They'll accommodate.  And you'll be glad you ordered it because you pay $60 and just get a bunch of awesome plates.  Definitely the way to go.Despite having a less than stellar reaction to uni last weekend (apparently it happens), I still rank Kai Zan with 5 sexy sushi stars.  They're awesome."], ["Jeff W.", "Man!!! This hit me right on every level. I love Asian food. Kimchee, sushi, bibimbap, sashimi, etc.  This place has it all. And they had amazing service. I went with the Chef's Choice. 10 amazing plates. I was stuffed. Tip: get the pickled vegetables...they were electrifying."], ["Laura O.", "Everything we tried was spectacular, service was incredible. My second time here and will definitely be back for more!"]], "Sunda": [], "The Sit Down Cafe & Sushi Bar": [], "South Kawa": [], "Osaka Sushi Express & Fresh Fruit Smoothies": [["Aly A.", "Summer time? Avocado smoothie with tapioca all the way! It sounds like a strange combo, but it's refreshingly delicious. Also, you could split any of their smoothies between two people - in fact, you probably should if you don't wanna be so full you can't move. They have a website to order online for pick up or delivery, which is super convenient. Last I saw, they offered 10% off your delivery order if you place it online. I usually order a crunchy shrimp roll and grab one of their (huge) ginger dressing side salads for about $10. You can order a roll off the menu, or if you're in a rush, they have a small cooler with rolls and sides ready To Go. I think they have reasonably priced and amazingly delicious rolls. I eat there once a week in the summer and a little less in the winter just because it's a bit of a walk from my office. Highly recommend!"], ["Meghan D.", "Very happy to find a place near my hotel that had inari rolls ( hands down my favorite). When I went in I asked them if they could make a cream cheese roll since they had it as a side, and they did. I wasn't a fan of the rice on the inside but once i started chewing I didn't notice the difference. This place in my opinion was a perfect spot to grab a quick lunch and I thoroughly enjoyed my meal."], ["Katie Y.", "I was in Chicago for four days and went to this place three times.  So...  I guess I liked it.  Here's why:(1) Good prices.(2) Diverse sushi menu.  Yeah, it's not the freshest fish EVER, but for Chicago sushi, it's solid.  Plus:(3) The sushi is cheap, and:(4) The smoothies are made with REAL fruit.  Like, they threw an ACTUAL PAPAYA into it.  There's not enough seating, the staff isn't that nice, blah blah blah.  I don't care.  I love this place.  And I'm going back three more times the next time I'm at a conference in Chicago."], ["Kelly G.", "Was starving after 5 hours at the Art Institute of Chicago! Ordered 2 rolls to tie us over to dinner. The fish was ok freshness, not the best, but not terribly fishy in smell or taste. Prices are a little higher than I liked, but the portions are decent enough for sushi rolls. Wait time is a little longer for the rolls, so be prepared."], ["Kimmie R.", "This place looks and feels like a fast food joint with the pricing of a regular sushi restaurant. You don't have waiters, the seating is dingy and uncomfortable and the cashiers are not helpful. Each customer is handed two packs of soy sauce and chop sticks with their orders. If you try to get an extra pack you get this look like woooooah there this stuff isn't free for us to just give away! :) ha ha ha If you are NOT grabbing sushi to go please avoid this place, because it's not the type of place you are going to find an above average dining experience. About the food: It was good. We shared several rolls and every bite was delicious."], ["Michelle Y.", "You get what you pay for. With that being said, this place is my \"budget sushi\" place. Sure the rolls are cheap, but customer service and quality here is also discounted.The girls taking your order look like they hate life. It doesn't hurt to crack a smile or at least use a tone that sounds like you're remotely happy. They're not rude, but they do seem miserable.I knew I was taking a gamble with the fish, and I lost the last time I ordered from here. My spicy tuna roll had a weird stench right when I opened the box. I ate one piece and couldn't finish the rest. The vegetarian rolls are safe though. Some rolls are pre-made so be careful with that."], ["Mike L.", "This is a good lunch spot for sushi. Everything was tasty and fresh. The prices are fair given the location and quality. Seating can be a little tight but the park is right across the street."], ["Ademola A.", "Sushi is within my budget and it's good. Its not the best sushi I've had in my life but it gets the job done. I haven't tried their smoothie yet but from what I've heard it great. I always get the crunchy shrimp rolls and sticky tuna."], ["Natalie D.", "Went back again today.Ordered the \"my best friend\" roll. It was awesome. Totally perfect! Only thing was that I was in a rush and my food was ready but I had to wait for one of the cashiers to notice. Not a big deal I was just starving so I'm sure I waited maybe a minute or 2 but in my mind it felt like an eternity. Lol"], ["Juhui S.", "Usually places near the central part of the city are meant for tourists and therefore, overpriced and not worth your money. Or so I thought. Osaka is a quaint little restaurant in the busy center of Chicago. There is rarely a wait because it is an express sushi place. (Another surprise, breaks negative stigma of express sushi restaurants.) of course, it is no \"unforgettable\" experience, but the quality is well worth the price. I had the salmon don and strawberry watermelon bubble tea. It totaled around $18, but there are other options for $10. The rolls range from $2,80-$10. There are vegetarian options and cooked options. The Salmon don came with eight fresh, meaty pieces of salmon sashimi. The bowl was $12, something I would probably get for $20-25 at a regular sushi restaurant. It also came with a pretty big bowl of miso with LOTS of tofu (heart heart thank you).The restaurant is very clean and the food was delicious and filling. Will be back for more. Nom Nom. Four stars because relative to other sit down restaurants, the food isn't specially creative. BUT for an express restaurant, it was definitely top notch and worth a try."], ["Brooke K.", "My roommates and I ordered in from Osaka this weekend. Got a bunch of different rolls and was extremely pleased! The rolls are priced really well so it allowed us to get a bunch to try. The rolls were great size too. Usually when you order basic rolls they can be small but these were great! The Spicy miso soup with seafood was surprisingly great. We also got the spicy tuna roll, spicy yellowtail roll, spicy white tuna roll, 1 fish lovers roll and a regular spicy tuna roll. Needless to say we were extremely full and satisfied! Will definitely make this place my go to sushi delivery!"], ["Tina M.", "The smoothies are delicious! You can definitely tell that they use fresh fruit. You can even get extra fruit pieces added on top for an additional charge."], ["Nina W.", "Just horrible. Fish is not fresh and they forgot to take away the scallions on my seafood soup (although it was actually pretty good.) Still broth in a cup does not make for the atrocious fish, no matter how good it may be."], ["Austin Y.", "4.5 stars! I've been here over 10 times, Osaka Express is my favorite casual restaurant around. Sushi is always fresh and cheap; although nothing is mind-blowing, the special rolls are creative and preparation has always been consistent. Having tried almost the entire special rolls menu, the Fish Lovers and Firework rolls are my favorite, followed closely by the Fantastic and Lets Roll. Whether it's a blistering summer day or the middle of a dreary, freezing February, I'll always get a fresh fruit smoothie - best I've had in Chicago. Get the mango kiwi or mango coconut and never look back."], ["Sara F.", "They've made an effort to always make my order quickly. They say hello when I come in, they seem to remember me, and seem to have extra staff at lunch time. Again, great for takeout, maybe too small to dine in. My coworker raves about their smoothies."], ["Tiffany S.", "Oh, I foresee many trips to Osaka in my future. The prices are great, the location easy to get to and the service is efficient and quick (in a nice way). The fish is great quality and the prices are excellent. I always look longingly at combinations in other restaurants and think \"I want all of those things, but I can't eat 3 or 4 rolls by myself...\". Osaka solves this issue by offering combinations that have 3-5 pieces of various rolls. Yay, I can still have diversity even when dinning alone! The also have a spicy seafood miso for under $4 which is a steal. It has pretty sizable chunks of a variety of seafood in sirachi-miso broth."], ["Tina P.", "It's cheap, it's a short walk from Millennium park, and it's decent sushi. You order at the counter and they call your number when the food is ready. The only downside is that everything is served on styrofoam throwaway plates which makes my little green side very sad. Oh, the miso soup has a lot of tofu in it!"], ["Mansi S.", "As a vegetarian i was not a big fan, the avacado \"roll\" was more like a \"maki\" - not a big fan. But my husband loved it! He got the spicy miso soup, which was truly spicy and he loved it! He said of all the items, the crab salad was the best! He also got taco octopus hand roll, which was good."], ["John I.", "The kids have taken over the kitchen, and no hot surfaces to hurt anyone. The kids are alright. I stop by here every once in a while for a snack, and it hits the spot without hitting the wallet too hard. It's not the best sushi in town, but it's still fast, tasty and inexpensive. Counter service, not a lot of places to sit and not comfortable-enough to linger--a few high-top tables and counters along the windows--but plenty serviceable for a snack. I like the youthful energy. For some reason I haven't tried a bubble tea yet, but it's on my list."], ["Carl P.", "Good. Fast. Inexpensive. In the loop there's really nothing better than this place where I can get a light dinner rather than heavy food in the rest of the area. Come in and get friendly service and a smoothie ta'boot!"], ["Keishana M.", "This is my favorite place to get Sushi, I frequent Osaka's quite often and I highly recommend the Spicy salmon rolls. I am very happy to say, the sushi is always, always very fresh! If, the quality of the sushi, smoothies or cleanliness were the only deciding factors, I would have rated a 5.But, because the workers faces have changed several times and with that change, the pleasant customer service has gradually decreased. The service isn't alarmingly bad, it could just be better."], ["Shawn R.", "Excellent food and smoothies.  I guess I didn't articulate enough when I said lychee smoothly and they gave me a peach and that's what the receipt said.  But hey if I was working in Japan is want some leeway too.  Surprisingly,  the prices were reasonable considering how outrageously priced beers are in this area.  I would like to say I'll be back but there are just too many great restaurants in the area."], ["Vaibhav V.", "Excellent! Nice little casual restaurant right next to the Art Institute and Millennium Park. Don't expect paying anything more than $15 here -- even if you get sushi and a smoothie. Pineapple Honeydew Smoothie with Tapioca: 4/5 -- Very, very solid smoothie with less than lackluster tapioca. The tapioca was unfortunately delated and less chewy than I expected. Nevertheless, the smoothie itself was fantastic. Avocado Strawberry Smoothie: 4.5/5 -- Amazing! Avocados go so well in smoothies. Definitely recommended! Firework: 4.5/5 -- Very creatively made. Would have preferred the tempura to have a larger presence in the roll. Nevertheless, full of flavor! Fish Lover's Roll: 4/5 -- Yellow tail, fresh salmon, spicy tuna... What else do you even need?! Loved it. Fantastic Roll: 4.5/5 -- At this point, you have to realize that you cannot go wrong in ordering at this place. Try anything and you'll be pleased! There were so many more rolls that I wanted to try (getting the Fantastic Roll next time around), so I'll definitely be back for the rolls!"], ["Karen E.", "Delicious. Busy place for good reason. Great for take out. Staff was courteous and efficient. I would go back again."], ["Samantha C.", "Osaka was quick and really great sushi for the price. I would definitely order from them again next time I want delivery to my hotel when I am in Chicago."], ["Liezl A.", "Sushi is fresh for the price you pay. My bf and I always get the platter and split it between eachother whenever we have the chance to come here and were never disappointed yet.  First went to the one at UIC but I think this it's their only location now.And dare I say the smoothies are better here than a popular contender in Chinatown!"], ["Stephanie L.", "Well, I used to love this place...but we just ordered take out and it was disgusting.Unagi pieces were so disgusting.  They still had the gross slimy skin on them.  Very fishy tasting.  Also, they were all over everything.  Also, the other rolls that we ordered were meh at best.  Did not taste as fresh as I had remembered.It was fast but this will be the last time we order from here...very disappointed"], ["John J.", "Smoothies are awesome. I had the watermelon with coconut & fresh fruit smoothie. Not too expensive @ $4.97"], ["Yatou Z.", "Only those who had never had real quality sushi before would give this place more than 3 stars. Well, you get what you paid for."], ["Jon L.", "I ordered several sushi rolls from here during my stay in Chicago; all of them tasted pretty good and I have no complaints.  I recommend any of their fresh fruit smoothies, especially ones with kiwi as one of the flavors.  The consistency of the smoothie is excellent, the tapioca pearls are good, and the smoothie itself is very refreshing."], ["Ricky B.", "I ordered a simple Rainbow Roll and I gotta say, I will definitely come back for more. The cuts of salmon, tuna, etc looked prime and tasted delicious. With some ginger on top and dipped in soy sauce, a delicious treat indeed. The strawberry smoothie I ordered tastes as if I put my own strawberries in a blender and did it myself, in other words, amazing. A little on the $$ side but for $14, it was worth it."], ["Kacy Young-won J.", "First time coming here... but heard a lot of great things about it from friends. Ordered Sample D & strawberry mango tapioca 10min before closing. Got the food super fast. We ate outside in a park across from the restaurant. It was... DEEE licious.Reasonable price, fast service.  Definitely will be back."], ["Erika K.", "Probably my favorite sushi place so far in the city, I guess it helps that it's only about a 10 minute walk from my apartment, it's crazy awesome cheap, and the sushi is actually pretty good, too. I had two orders, one salmon, one salmon-avocado, and it came out to a total of only about $8! I'm personally more of a spicy salmon gal, so the plain salmon tasted a little bland, but I certainly plan on going back soon to try the spicy salmon and one of those smoothies. Really, if you're looking for a good deal and some tasty sushi, I can't recommend Osaka enough. Even though the place is a little small, it's perfect for two people or to take-out and eat at home. Perfection."], ["Vivian H.", "Albeit a good \"cheap\" sushi eat in the Loop area (and for the prices, fresh enough), the staff there are among the rudest I have encountered so far (even for primarily Asian/Chinese run establishments). The first few times I had been there, the cashier simply didn't smile and was rude with the order taking (which is fine, whatever). Usually I order the sushi to-go because by the time they make it, I don't have time to sit down and either it there. However, one time they were faster than usual and I decided to sit down and take my time (since I was early). Little did I know, the next time I went and said I wanted my sushi to-go, I was REFUSED! The lady behind the counter said because I \"always\" (which was an exaggeration it was just once) took it to-go but then ate it there, I wasn't allowed to take it to-go unless I made sure I didn't eat it in the establishment. What kind of requirement is that?? I told her \"id actually get it to go if it wasn't done in 5-10 minutes\" to which she rolled her eyes and insulted me in Cantonese (which I unfortunately for her, understood). TLDR; the service is god awful. Be prepared to get cheap (but not even super fresh) sushi with eyes glaring at the back of your neck."], ["Rochelle W.", "Once again, too much fish for the rice.I went from a roll to a bunch of sashimi.I'm talking thick, long pieces of salmon.Sigh, I love Osaka."], ["Alex J.", "If I'm thinking sushi, I'm not generally going to go out of my way to get to Osaka. The smoothies, sushi, and periodic soup options are, as Yelp describes my 3-star review, \"A-OK,\" and I can't say any of it's terrible. Since the place is so close to where I work and the service is generally pretty quick, I end up grabbing a lunch combo or quick smoothie to mix it up. There was one instance where there were weird plastic shards in my friend's smoothie, but he attests that this was a one-time whoopsie and has not been a repeat offense. The fish itself is generally pretty fresh and lacking in odor, but the prices are also a little steep for the quick, simple spot that Osaka is. All in all, in short, \"A-OK\" - it won't ruin your day, but it also won't give you any sort of mouthgasms."], ["Samantha T.", "I lived in Chicago for three years and I can't even count how many of Osaka's delicious smoothies I've had. It was my breakfast quite often. Now that I live in California this is one of the places I have to go when I'm visiting Chicago. Sausage pizza at Lou Malnati's and a strawberry peach smoothie from Osaka!"], ["Grace H.", "I stayed in the Hilton that is rather close to this place, because I walked past it every time from the metro station to the hotel. Decided to give it a try.  The place also serves up fresh fruit smoothies starting from $3.5 for a plain smoothies, and also have smoothies with green jelly (extra $0.50) or with additional mix  fruit on the top of the smoothies  (extra $0.75)This is a very small place and had a few seating.  The sushi is ok for what it is, the lunch combinations starts from $4.95, the Salmon Avocado Roll and Tuna Avocado Roll 4 pieces each was $7.60.  There is dinner combination rolls or you can order the roll on its own.There is also Rice dishes like Unagi Don, Salmon Don ...etc. A very reasonable priced place in a rather expensive district."], ["Annie W.", "I'm very happy when I find Osaka sushi express. I am able to eat Sushi in Chicago. Yeah! The ingredients are fresh. Salmon, Yellow Tail, and Tuna. Personally, I like to eat traditional sushi nigiri but Chicago roll in this restaurant changes my mind to new type sushi. Osaka sushi express is in my restaurant list. :) ^_^"], ["Marie J.", "The only place in the Loop for sushi and smoothies is Osaka.  I love this place.  It's very close to work, so I am there at least twice a week for lunch.  Is it the best sushi in Chicago?  No, but when I need my sushi and smoothie fix, this is my #1 go-to place for lunch.It is very convenient for me to place an order online and have it ready for me to pick up.  Plus, you get a discount for orders placed between a specific time.  I am a huge fan of their smoothies, because you can ask for less/no ice, less/no syrup and extra boba."]], "South Coast Sushi": [["Jenny C.", "One of my favorite sushi places in Chicago. I have been coming here for years. I like coming to this location because it's in a not-so-busy part of Michigan Avenue and I usually can find street parking. They have their own parking lot, but the spaces are kind of tight. I love the ambience and decor of the place. They offer really good appetizers and salads in addition to their complimentary fried seaweed. The maki rolls are a decent price and aren't too crazy with multiple ingredients so that you can taste the fish. They have good drinks too. Definitely recommend."], ["Jacob J.", "The Saturday past we decided late in the game to head out for sushi. Coming from the Bridgeport area, many sushi bars were quoting hour long wait times. Here we were able to score a table within twenty minutes.In attendance were six adults and three kids.  After seating and handed menus we didn't see the waiter again for over fifteen minutes.  A busboy stopped by with water right before our waiter returned.  The late timing of our waiter would be repeated constantly over the course of our dinner.  The place was moderately busy but most tables were on the tail end of their meals.Later evening on a Saturday night, the lights were dimmed to a level where we needed to use the table votive (light) to see the menus.The place is decorated quite nicely. I guess it could be a fine dining option with friends or on a date.  The front area of the restaurant could be used as a meeting place, if professionals aim to meet clients for a meal or chat.We placed orders for 3 - 4 appetizers, 8 - 9 rolls of sushi, we had some sashimi, a couple bottles of hot sake, some noodles and a few more items.  Many of the rolls ordered were off the deluxe sushi menu.  All but two types of rolls were average stuff.  The appetizers weren't memorable except fodder for my review. For example the shrimp dumplings, which I expected to be more than a large triangle dumpling filled with a single piece of boiled shrimp.  At a cost of 4 pcs for $10.50!, we should have gotten the gyoza instead or a few pieces of ebi.  I don't mind spending money, but there should be a value realized when tasting.  For instance, the noodle dish which I want to guess was yakisoba with chicken (?) A good selection, everyone thought the noodles were tasty, however I think a bowl went for almost $13 dollars.  (Yikes) Service was so slow.  Alike another review that recalled the experiences of a large group dining, they mentioned their food arriving slowly, the same I would relate about this experience.  Slow, hard to find staff, when I called for someone to come over they motioned for us to wait for \"our\" waiter.  Wonk, wonk, wonk.. Okay experience which I probably wouldn't repeat right away.  If I'm in the hood, it wouldn't be my first choice.  But if others wanted to check it out, I'd probably join in."], ["Alexander G.", "Place was really nice - sushi was also really good - i eould come here again - I was lucky i didnt have to wait really long until i got a table, drinks and food!"], ["Amy H.", "I really enjoyed this place!! Saw the reviews online and we decided to come in!! We did a whole bunch of apps but the rock shrimp and beef wrapped asparagus were on point! I'd come back just for the beef!! We did several rolls ranging from tuna, to rainbow to the scallop roll all were great! The portions were a tad smaller than most sushi places but really good!!!"], ["Martha D.", "We recently celebrated my friends birthday here on a Saturday night with a party of 9, our reservation was for 7pm and we were seated promptly. We enjoyed their complimentary seaweed along with a variety of delicious sushi and their service was excellent! I would highly recommend this place to anyone who is looking for a place to accommodate a large party. Our reservations were made same day without any issues. Make sure you leave room for dessert, they are deeeelic!"], ["Andre W.", "This awesome sushi place has been on my Yelp bookmark list since 2009 and I finally got my butt over to 1700 S Michigan to try out the raw here. Free parking across the street if you are driving so you don't have to fool around with the meters and they offer 5% off of your meal if you pay in cash. We started out with their complimentary fried seaweed which was decent. We then got their off the menu specialty appetizer, the super white tataki which was nice...the big cucumber at the bottom made it quite the challenge to pick up with the chopsticks but we managed. LOLI have to say, the sushi here is exactly what everyone says it is...very good!We figured 3 rolls would be enough so we went with the following:Salmon Poke - remarkableRainbow - pretty damn goodWhite Dragon - off the damn chartsThey make the best pear martini here as well!The people that work here are quite conversational and good at letting you know whats worth getting especially our server Koi and the girl behind the bar. The 24 Knots wine was a good choice to go with the maki rolls."], ["Nina L.", "Cozy little sushi place in the south loop. The food is great and the service is very friendly. I've had most of the sushi offered and a few appetizers, all of which were fresh and tasty."], ["Jade W.", "It's been over a year since I have been back....and wow...that year certainly made a difference!  Service has greatly improved!  I was in shock when we received the amuse bouche so quickly.  Then the food just kept coming. My friend & I were pleasantly surprised.Thank you for stepping up with the speed of food service.  I won't wait a year for my next visit!"], ["Angela H.", "This is the cutest lil spot for a lunch me and my boo came here for. A cocktail and decided to eat after smelling the heavenly smell of fresh seafood oh my the bartender was great"], ["misbah s.", "When you live at 1720 South Michigan for over a year, and have family in the South Loop, this is your go-to local and phenomenal sushi joint.  Come Wednesdays, when the amazing mixed drinks are half off, and walk out full with some amazing rolls. They switch up their menu a little, always give you a few starters from the chef (free) and you keep working on their phenomenal rolls.I've been here over a dozen times.  There is no other comparison in downtown Chicago, so don't spend too much on pricey downtown sushi, when you can get a parking spot, without having to pay 20 bucks to go back and forth from downtown to your apartment in the South Loop.Great for dates, large parties, girl's nites, best friend's nites, quick walk-ins, and in-need-sushi-fixes.  Tables are always available even if you don't book a reservation.  That isn't to say that it's a bad place.  No, don't think that.  It's not \"popular\" to head to the South Loop which is good, we don't need any Streeterille losers here anyway.  Look no further, South Coast is the place to hit up.  Thank me later."], ["Zoe D.", "White tuna is tasty which make u feel so happiness! While, one thing I can hardly understand is a sushi bar offered this kind of Gari!!! Please make sure to Ask for FRESH Gari! Or they will offer u overdue ginger which taste yucky and even hard to eat one piece of sushi! I can hardly believe that a good restaurant with all reserved table will offer overdue food!!!Btw, the chair at sushi bar is reallllllllly uncomfortable!!!! I will leave right away if I went there by myself, no matter how tasty the food is!Please have a seat and try if u r a customer and think about if u wanna stay on the chair for a dinner!The recommendation is only because of the food here is ok, please do not ruin reputation because of the small but important things!"], ["Leslie W.", "Very cool ambiance in this place. Came here with a group of girlfriends on a friday night and everything was delicious. Make sure you try the jello sake! Mmmmm! The seaweed appetizer was also quite delicious;). I'll definitely be back to try some of the other menu options."], ["Garvin W.", "Service was awesome. Hostess and server was very friendly and free appetizer starter! (a piece of tuna sashimi)Nice interior design with dim lights. A little chilly inside and the music was different (some EDM type of music) Was a bit disappointed with the sushi. Ordered a few specials such as dragon rock maki and south scallop maki, then had a dragon and spider roll. The spider roll and dragon rock maki was okay, the other two was a no. The eel on the dragon roll was too crisp and burnt as if it was in the oven for too long. While the south scallop maki was similar to a sushi sandwich and I didnt taste anything special about that. Comes with only 4 pieces as well. Probably will not be trying this place again on my next trip to Chicago."], ["Brittany P.", "Great experience here! Staff is super friendly and knowledgable of menu items...we had trouble figuring out what to order and the waitress knew right away what to recommend/ answer our questions. 100% recommend getting the white dragon roll (I could eat like 5 or these!)  Great interior as well"], ["Stephanie K.", "Overpriced, average sushi. I have mixed feelings because we went here 2 years ago and enjoyed it a lot. We all agreed that the rolls were tasty and fresh, although still slightly more expensive than what you could get in the area(and not as good as the original Coast sushi). However, I liked the ambiance and they had good cocktails.Maybe things have changed? Or maybe things are different in the delivery world. I just ordered delivery and was disappointed. The popper roll was $15 and was smaller than any California roll I've ever seen. I didn't even realize there was fish in it until I examined it closely. The unagi roll was meh. Sloopers, I would stick with Kai sushi or Umai instead."], ["Matt L.", "Had an amazing time at South Coast last night. The food was outstanding ... but the service was even better. Our server, Joseph, provided some of the best service my wife and I have ever had. I would highly recommend requesting a table in his section if you go to South Coast!"], ["roy b.", "Great food great service!!!Spicy misu soup was spicy and sushi was amazing!!!  Thank you!"], ["leah b.", "Food was awesome, very nice atmosphere. Decent prices. Great location in south loop. I recommend the Appetizer yellow with jalapeño. It melts in your mouth."], ["Kadee D.", "I was quite impressed with this place .... It was decently priced and the atmosphere was great!My friend and I were in a rush and the service was fantastic at taking that into note. We ordered the spicy crab hot appetizer (which was to die for) and their new special tuna/jalapeño maki roll and spider roll. The spider roll was not bad (I'm not a fan of what's in it) but the special was awesome - such a burst of flavor and great twist, think jalapeño popper chilled with spicy sweet accent and super white tuna! The only draw back was they do not have soy paper as an option but I would have to say their seaweed wrap was not raunchy like most places.... We also got crunchy seaweed fries as a complimentary appetizer which were light and perfect for an appetizer!"], ["N G.", "The food was good, but for the price was expecting a little more.The ambiance was great.  The wait staff was nice, but took a bit to get to us and serve.  It was not that busy."], ["Nekia N.", "I'm in LOVVVVE with this place. I've been here several times and they never disappoint.  Awesome & strong drinks. Some of the freshest sushi I've had.  They're a little on the pricy side but it's worth it. The ambiance just sets this place off along with your scrumptious meal.  If you're looking for a place on the Southside to get some extraordinary sushi-- this is your spot.  I'll be coming back for more!  Yum yum!"], ["Tan L.", "Never had a bad experience here.  The food is decent but more than anything they treat you so well you d want to keep coming back here.  To me it s not just about the food, it s a total experience when the service is fast and people are pleasant.  Highly recommended !"], ["Shan D.", "Great sushi spot in the south loop. I Always order more than I can eat.  Not sure if it's still BYOB, but that was a major plus because the sushi is pretty expensive."], ["Joel R.", "Sushi is excellent. Tuna on top is perfect. Prices are a downfall. Yes you can find cheaper sushi elsewhere,  but taken a chance is not worth it."], ["Christian W.", "Just as great as their location on Damen. Witholding the fifth star because the Damen location is BYOB, but the South Loop location is not. Otherwise, it's fantastic!"], ["Steve S.", "I really wanted to love this place and make it our favorite sushi restaurant in the city but our first visit just did not go as perfect as I had hoped.We had 6:30 reservations and were seated immediately.  Place was about half full but it filled up as the night went on. Our server was very good and she won extra points later in the dinner.  They seemed a bit short staffed so drinks took a while.  Not a big deal.  We received the complimentary tempura seaweed/kale thing.  it was tasty but you really can't go with wrong with anything that's been \"tempured\".  We started off with the Tuna Tartare, Volcano and Spring Maki.  The tartare was good but, just like Hub51, they serve it with a Styrofoam like sesame chip.  House made won ton chips are the ONLY way to serve tuna tartare or poke, people! The Volcano was good but the snow drift like tempura crumbs added nothing to the dish.  The spring maki was just okay.  Our 2nd round was the spicy tuna, crunch maki and super white tuna and Toro Nigiri.  For the first time for me, I liked the nigiri better than the maki. The toro was excellent and was the star of the meal.  The super white was also good.  The maki kind of feel flat and didn't have enough taste.Then came the biggest misstep of the night.  We were drinking Belvedere martinis, straight up with a twist.  Our 2nd round of drinks were taking a long time. Our waitress finally brought our martinis to the table and apologized.  No problem and we took our first sip and my partner and I just looked at each other.  Is there Sprite in this we both asked? It might've been tonic but the vodka was carbonated and sweet. It's bad when you go in for your first sip of a drink and taste something totally unexpected. We flagged our waitress down and told her the drinks weren't right.  She apologized and then shot death looks at the bartenders.  I'm guessing she had previous problems with them that night.  She apologized and said she would take these back and make the new ones herself.  Great move! She came back with our new drinks and they were perfect.Maybe we needed to go out of our comfort zone with the maki and try some new stuff.  Maybe they were short staffed or the room was \"star struck\" since Blackhawks Jonathan Toews and Patrick Kane were dining right behind us.  Who knows.  I wanted to be \"wowed' and I was just \"content\" by my meal."], ["Neema P.", "I wouldn't say this is the best sushi I've ever had. I've had better and waiting over an hour for my 2 rolls of sushi def made me deduct stars. Hopefully I'll be able to done in and my review change."], ["April M.", "First time coming to this place. Food was good - they have huge California King maki rolls and they are delicious! Service good. Dinner environment is between casual and dressy with dime lights and candle lit on table.Overall it's good and I'd come back again."], ["Colleen R.", "A long time favorite that I am finally taking the time to review.  The sushi is high quality, creative, and above all-delicious! The decor is trendy and fun.  The staff is warm and go above and beyond for their diners. They were so welcoming when my husband and I dined with our 8 month old.  My only request is that they should have a changing table in the restroom."], ["Nidhi S.", "Outstanding! I went here with a friend and we were blown away by both the ambiance & the food! Highly recommend!!"], ["De L.", "The sushi at South Coast is serviceable, I've gotten take out from South Coast on roughly half a dozen occasions, primarily because it is close and convenient. As such I've sampled a good portion of the menu, including the majority of the specialty maki rolls and sashimi, nothing has stood out in particular as a stand out dish that I would go out of my way to eat. The quality is solid (which is pretty relative for sushi joints at this price point) and consistent, but in my opinion there are better sushi places in the city at a comparable dime. I recommend Juno on the North side and Nabuki of you happen to be out in the western burbs (Hinsdale)."], ["Kay K.", "Great south loop sushi bar! A little pricier, but the ambiance is wonderful, the food is delicious, & the service is good, too! Even love the drinks and desert! And they are constantly giving complimentary starter plates!"], ["Alice H.", "I like this place for a weekday night.  I'm a really big fan of the BYOB original Coast sushi in Wicker Park, but this place is closer to where I live.  I think the sushi overall is pretty fresh.  It's not the best sushi I've ever had, but it's pretty good for what I've had in Chicago.  Like most sushi restaurants, I do think that the proportion of much rice to fish is a bit high so sometimes the flavors get lost with all the rice.The other thing I don't love is that the temperature of this restaurant always seems to be ice cold.  I think that the way the restaurant is constructed, every time the door opens, a huge draft flows through the place.  And in the summer time, they always seem to have the AC blasting.  But the one thing I do like is that I've never really had to wait for a table, and the service is pretty quick.  They also often give a complimentary appetizer/salad with a miso dressing, and a seared fish on top, which is really nice."], ["Bernice R.", "Got the works... Apps, Drinks, A Couple Rolls, and Dessert. I don't usually do this but it was special night since good friend from California was in town.  And heck, Yelp doesn't lie about awesome restaurants such as this, so I went all in!My cocktail was light and refreshing, but surely if I had a few, it would due me in!  Our complimentary app, tempura fried seaweed strips with two dipping sauces, was very good and got our taste buds ready and eager for our entrees!  I had the White Dragon and Spicy Hamachi rolls.  Both were fresh and outlandishly fantastic!  I could have eaten 5 more rolls of those alone but I saved some room for dessert: banana maki and their special cake for the night. PERFECT way to end the meal.The service was top notch... especially the water guy... he was on every table like white on rice!  My water cup never went dry. Good job sir, good job!  Further, the wait staff was very attentive and the hostesses were very nice.I'd definitely come back for another special night on the town!"], ["Olga B.", "I just went here yesterday and am still thinking about how good it was! I got the rainbow roll and my friend got nigiri; we were both very happy with the quality of the fish. They also gave us a complimentary appetizer of seaweed tempura with two delicious dipping sauces, a horseradish one and a chipotle (I think) one. It was a perfect starter. I got a lychee martini and I am in love. It was perfect. Not too sweet, very aromatic and a hint of tartness. Yum!! I am definitely coming back!! Also the atmosphere was very elegant; great for a nice night out with friends or a date. Just an update a year later.. still love this place! My favorite sushi (and martini) in Chicago."], ["Kristin H.", "I went to South Coast while visiting Chicago. The staff was super-friendly, food was excellent, great atmosphere and all at a reasonable price.  The sake bomb with quail egg was very tasty!!We'll be back soon on our next visit!"], ["FoodLover Z.", "Ordered delivery from South Coast Sushi today. The rolls were hit and miss. The Tuna Crunch roll was awesome, while the Dragon role was terrible. The Kani Ceviche was also lacking in flavor. Next time, I'll order the more basic roles like Spicy Tuna and Spicy Salmon."], ["Morgan C.", "Love the food here! Sushi is fresh and delicious. Great miso soup! The decor is also really cute and cozy"], ["Adi O.", "I went last night. The sushi was just okay. The service was ok. They DID NOT have AC. However they did have 3 fans. Honestly I think they need to change some of the menu items.  There was not enough variety and pizzazz. The decor needs a little tweaking. This place has so much potential but for now it's just okay."], ["Marisa A.", "South Coast was better than I expected in a lot of ways. Yelp was making me think that this place was just whatever, but it's not. It's pretty chic inside, with dark wood decor and artsy chandeliers. Their dinnerware (can't believe I just said that) is modern and trendy, and their plating is thought out. It's like your neighborhood sushi bar, turned up a notch or two. I think it would be a great place for a date-- nice enough to feel special but not stuffy enough to feel awkward. I went with a group of three girls. We all got martinis and all of them were simple and good. Don't expect any crazy mixology. The seaweed salad we got to start was everything you'd want in that dish: super fresh, a little acidic. It came with a little cucumber, too. The tuna tartare was great as well. The tuna was diced and mixed with ginger and white soy, then served with a crispy sesame cracker. The waitress also brought us a complimentary appetizer-- I think it was deep fried seaweed. It came with two super yummy and fatty mayo dips that we ended up dipping everything in. We had two maki rolls, the Crunchy and the Dragon Rock. The Crunchy roll left a little to be desired. It was covered in tempura crumbs but lacked the texture you'd expect from them. The Dragon Rock roll was savory goodness, but I'm not sure how you can go wrong with a deep fried roll filled with shrimp, avocado, jalapeno, and spicy mayo. I also had a piece of tuna nigiri (my first nigiri!) and I really enjoyed being able to taste the freshness of the fish by itself. That wasn't enough to fill us up so we ordered another round of food. Whoops. I felt kind of dumb ordering the chicken teriyaki but it was worth it. Super tender slices of chicken covered in a tasty sauce that had just the right of tang and sweetness. We also had miso soup and a side of asparagus (pretty generous portion). The waitress noticed that I was opening a birthday gift from my friend and was nice enough to bring out a little birthday dessert with fried bananas and a candle."]], "Sumo Sushi & Hibachi Grill": [["Gigi D.", "My friend who lives in Chicago proclaimed to be prior to my visit that there is \"no good sushi in Chicago\".... Uh, PUH-LEEZE! Clearly she's busy eating all those Chicago Dogs, that are clouding her sanity... Because SUMO IS THE BOMB! In fact, when we were leaving, she thanked me for introducing her to her new \"spot\". You're welcome. You're welcome. Mission Complete. But seriously, I was extremely impressed by this place and had a STRONG SUSPICION that I was going to love it after I scanned the menu prior to chowing down! Rice-less choose your own fish rolls, um, this restaurant was MADE for me!This restaurant was NOT overly packed, and in fact nice and spacious, when we arrived, which I love because I actually wanted to TALK TO MY FRIEND as well as scarf down the goods... Speaking of goods, here is what we ordered:- Edamame: PERHAPS THE BEST edamame I have ever had, every piece was salty, and there were three pods in almost ever one... And it was almost as if they were slightly roasted. YUM!- Beef Wrapped in Scallions: the beef was good, but the sauce was too much, too over powering. In fact, my friend ate one and then expressed her opinion and the wait staff took it back and wound up not charging us for it! The owner/manager of the restaurant even came over to make sure we were okay... TALK ABOUT AMAZING SERVICE! I love meeting restaurant owners who genuinely CARE about their dining patrons!- Unagi wrapped in cucumber with avocado (no rice)... I ordered this TWICE! I couldn't get enough. It was perfection. Took me to a whole other level of delicious in the sushi world... I will not be ordering this everywhere I go! Sumo, you unleashed a monster! - Salmon wrapped in cucumber with avocado (no rice): this was also extremely tasty and fresh, however the avocado overpowered a tiny bit, but that can easily be taken care of by take some out... And eating it before... After all you don't want to waste that precious healthy fat!- 6 Salmon Skin Hand Rolls (no rice, no sauce, no veggies): I judge sushi restaurants solely on their capability of accommodating this order (I order it EVERYWHERE I go) and... Sumo had ZERO problem doing it... And in fact, got it RIGHT! The salmon skin was super crispy and salty prior to be dipping it in any soy sauce... I ordered three to start but couldn't resist ordering more, and I even enticed my friend, a salmon skin virgin, to give it a go and she ADORED IT! If I could, I would have ordered six more! - Sashimi Deluxe: when my friends entree arrived, I was JEALOUS AF! I wanted that. Dammit, meal envy, even though my dishes kicked ass too. She did let me have a piece of escolar/white tuna and boy was my mouth pleased!!! So succulent, rich and FRESH! Gaaah GAHHHHH! A must order! This feast was phenomenal and considering how much food we got, totally worth the price! If I were staying in Chicago another few days, I probably would go back at least 2 moe times!Oh and did I mention how awesome the waitstaff was... So accommodating, and sure there were two orders that we miscommunicated on, but they were no big deal and without a blink of their eyes... They took it back. Hopefully they got to eat it! Ha Ha. If this place was in LA, Crazy Rockin' Sushi would be in trouble, HOWEVER... I am on the fence of the type of salmon skin I like better, soggy, fat dripping goodness or crunchy, salt scrumptiousness... Guess it depends on my mood!Thank you Sumo for making my taste buds and stomach VERY VERY happy!"], ["Matt W.", "Amazing sushi at a reasonable price and it's BYOB. Our rolls came out on a beautifully presented platter. All was delicious. Dumplings were amazing too. The waitresses were all very friendly and always had a smile on their faces. My complaints are that the menu is a little unclear and did not have the desserts listed. The dumplings were listed as some other Asian named dish, and I had to ask if they had green tea ice cream. The atmosphere is also a little bland. However, if you need a good sushi fix and want to drink too, this a great place."], ["John S.", "Really enjoyed this place. I'll admit I laughed at the sign outside before I knew this place... looks like the sumo is straining to release something... haha.Now that I have that idea in your head, this place is pretty awesome. Its BYOB so we just stopped at a liquor store and grabbed a bottle of wine. Great decision and the wine really helped slow the pace of eating down... so I would suggest you do that. We got the Spicy Roll Combo Dinner (plain, but a lot...) which was good. The other dish we got was the Dynamite roll which was DY-NO-MITE! I think it's a good combo to get a specialty roll and then a generic roll, just to switch it up and get the most bang for your buck.I'll come back for sure. It looked really presentable inside and the bill wasn't expensive at all. Great location and can't wait to try more food."], ["Sophia G.", "Great service and fresh food! Fabulous presentation and atmosphere is warm and inviting. I highly recommend for freshness, meat and veggies sautéed to perfection, served with thoughtful details."], ["Suzannah S.", "Great little BYOB sushi place. Very casual atmosphere, perfect to sit down and chat. The staff are extremely pleasant and gracious. Our prosecco bottle somehow half exploded as we began to uncork it, and the staff quickly rushed to our aid and offered to help us with the rest.The food itself is great for the price. We had eel and avocado, some tuna roll, and the fantastic roll. With that and miso, it was 30 between two people which is really reasonable.I'd definitely come back - great little find!"], ["Lynn L.", "It's my first time to write a Yelp review. Sumo is definitely the place you should try in Chicago especially if you like sashimi and sushi rolls. The food can't be tasteful any more. The Rock shrimp appetizer is sooooo gooood! The presentation is gorgeous. The owner and staffs are supper nice and true. They care about customers a lot, always smile. The environment is very comfortable to talk to friends. I love this little place."], ["Monica S.", "Come here for the lunch special (M-Sat 11:30am-3pm) if you're looking for passable Japanese food in the Lakeview area. At the time of writing, they have 3 options:1. Any 2 rolls for $8.50 and any 3 rolls for $11. Both include miso soup and salad.2. Hibachi lunch for $8-$11. This includes mushrooms in clear broth and salad. 3. Lunch boxes for $7.50-$12. These include 4 pieces of California roll, 2 pieces of shumai (Chinese dumplings with pork), miso soup, and salad.  Note that their cheaper items are vegetarian-based, while the more expensive ones include seafood. To celebrate their grand opening, their website has coupons for 20% off with $30 dine-in purchase.Their interior decor includes figurines and swords which adds to the authentic Japanese vibe. However, the manager and waitress attempted to speak Mandarin with me which somewhat detracted from the ambience. Don't get me wrong though - their service was still very attentive. On average, they either dropped by or asked how we were doing every 5 minutes.The -1 star is because the veggies in my vegetarian hibachi weren't grilled with enough sauce. Without the ginger and \"yummy yummy\" sauces on the side, the veggies would've been bland. I'm not sure if that style of food preparation was intentional, but the veggie fried rice pairing in my order was flavorful. Overall, for the price of the lunch special, I got what I paid for. To be fair, I'd give them another shot and try their other items, since they just opened."], ["Lori M.", "Delighted to finally try last night and look forward to going back! Fabulous menu, great service - perfect!"], ["Tara T.", "Lunch specials Monday-Sunday. 8.50 for miso, salad, and your choice of two rolls. It's a lot of food. Plus it's great quality and service. Charming cute little place. I recommend."], ["J. Spencer M.", "This place is brand new. It's owners seem nice and the staff is getting there. (We went when the Restauarant was just a couple weeks old). The place was almost empty but the decor was niceThe restaurant has no liquor license and thus is BYOB, but we did not know this ahead of time so we stayed dry for the meal. The food, was Fantastic. It tasted great: the chicken/shrimp and fried rice was delicious but unlike most all hibachi places I go to. The food IS NOT prepared in front of your face. Everything is done in the back like a normal restaurant. I may return to this place for the fair prices and the tasty food."], ["Andrea T.", "This is one of my favorite sushi spots in Lakeview. The staff is friendly, efficient, and adorable. The food is always excellent and timely - I've tried the Dynamite, Spicy Girl, and Yummy yummy roll and enjoyed all of them. The presentation of the food is also well done. I'm constantly surprised by the beautiful plates coming out of the kitchen. Overall, I highly recommend this place. It's good enough to make me write my first yelp review!"], ["Erin P.", "Takeout is awesome. Sitting there not so much. Bugs in our soy sauce and hair in our dessert. Won't be going there again."], ["Julia Q.", "To be honest I have never eaten at the restaurant as I live fairly far away in old town. BUT i always always get delivery from here when I want to treat myself. The prices are very reasonable - especially for the sashimi deluxe and the fish is incredible. I always get that with the Shumai and its a ton of food for a very reasonable price."], ["Adel A.", "Best sushi I ever had in America so far. I've been to Japan multiple times - seaside towns as well as Tokyo and Osaka - where sushi is the best in the world, and most US restaurants don't come close. But Sumo was pleasantly surprising in the quality of their ingredients, presentation (impressive considering the medium level price range) and service. They make you feel whatever you spend here is worth the price.The sashimi set is my favorite and will definitely be going back."], ["Brittany C.", "This place was extremely good and fresh. They put little flowers on every plate for decorations and it was the perfect touch. And the MOCHI was amazing. Will definitely be going back."], ["LisaMonique R.", "BYOB! My husband and I wanted to try a new sushi place and came across Sumo Steak & Hibachi! Can I say ...soooo yummy! The service was on point! Super friendly and very attentive! Ambiance was 10/10!!! Great place and great location! Totally recommend this place! Thanks Sumo!  We will definitely see you again!"], ["Zhi W.", "This restaurant is really awesome. During the noon or lunch time, it is very quite. But dinner time is little crowded. Waitresses and waiters are really friendly and keep asking your opinions on food you are having. But some time is little bothering...  for me.Food is delicious. Price is good."], ["Sachin P.", "One of the best sushi we have had in Chicago.  The food did take a bit longer to come, but the wait was worthwhile.  We had miso soup and tuna tartar for appetizer and  tiger roll, sumo roll and dynamite roll for the main course.  Sushi were very flavorful without much rice and other fillers.  We loved tiger roll so much, we ordered one more even though were were already stuffed.  They also have BYOB without any corkage fee. We are going to be regulars to this place."], ["John J.", "We order gyuza, sp tuna, eel and shrimp tempura all taste good and beautiful decoration on the dish. But the importance thing. The servers they very nice and very good service!!!"], ["H H.", "I've lived in the Lakeview area for over 6 years now and am always up for trying new sushi places. This one was not a priority on my list as I already had so many favorites. Boy am I glad we came here. This is now in my top 3 sushi places in Chicago. Amazing service, presentation, and taste. They were so good I couldn't even decide which I liked best between the spicy girl and tiger. The spicy tuna was great as well! BYOB and no corkage fee! I'm in heaven. To finish we got the lava cake (not the best I've had but tasty... Would have been better if server hot) and vanilla ice cream (it comes with sprinkles!!! So wonderful! We will be back!"]], "Momotaro": [["Talia G.", "Confession: I've never actually eaten upstairs at Momotaro, so this review is only for their downstairs bar and happy hour. DAMN their happy hour is good. For $23 you get a three course meal that is surprisingly substantial, plus a cheap tallboy beer (like PBR or Tiger) and a shochu shot (essentially fruit syrup). You could also get the two course version for $19, but that seems silly. I always get a cocktail and leave having had an amazing meal at Momotaro for under $40. Appetizers: I've only ever had their deviled eggs with crab, because there's no reason to get anything other than this. It's two pieces of deliciousness with a crunchy chip on top.Entrees: I have tried three different entrees and my favorite is by far the clams in a delicious broth with super buttery toast. Ridiculously tasty and a decent sized plate. The pork tonkatsu with cabbage was tasty, although I admit that I don't have much to compare it to. The only other place I've had tonkatsu is in a financial district lunch spot in SF. I also have had their cold noodle dish, which was huge and quite tasty, although it paled in comparison to the clams. I actually took home leftovers!Dessert: I DREAM OF THEIR BLACK SUGAR ICE CREAM. Yes, that deserved all caps. It's a small dessert with just a quenelle of ice cream atop chocolate feuilletine streusel, but it is ridiculously delicious. I've been back several times just for this dessert. I'm obsessed.One day I will make it upstairs in Momotaro, and I'm sure it will be amazing. But for now, the happy hour downstairs between 6 and 8pm is making me a very happy girl."], ["Maggie Z.", "I had always known this restaurant. But we had never been there for lack of excuse for dining at such an expensive place. Finally the excuse came!We went Saturday night with a reservation. The staff were friendly. My first impression was that the table layout was beautiful, quite Japanese. After reading the menu, we asked the waitress for recommendations. She knew the menu really well and we took some of her advice.Then the food came. They were all good! I especially like the tomato beef tartare. It's called beef, but it's really dried tomatoes disguised as beef tartare. The taste was fresh and the idea was so creative! I also really loved the nigiri sushi. The rice was compact, flavored and toppings were delicious. I have been to more than 10 well-known sushi place in Chitown, this is definitely Top 1 or Top 2. I'm not sure about this because I cannot forgot sushi in Japonais by Morimoto: heavenly good!"], ["Annie K.", "Underwhelming.I tried to get a dinner reservation for 2 for a Thursday, but alas, the only available time was either 5:30 or 9:30. Hey, this place must be cracking! Wrong. I chose 5:30 and walked into a a ghost town of a restaurant. The main floor was empty with the exception of 3-4 tables and the place wasn't even close to full by the time we left. I'm pretty sure they could've accommodated my reservation request for 6:30. (Perhaps all those tables and chairs are for decoration..?)The food was decent, but as previously mentioned, underwhelming.We started with the momo-something roll (no, that's not what it's called), which was pretty standard as far as rolls go.The nigiri omakase was good. It consisted of nine pieces of mid-range fish, and I enjoyed the flavor combinations. The scallop and uni combo was my favorite.Unagi don-standardWashugyu (skirt steak with foie)-tender but barely warm.Last but definitely least, the chili mentaiko spaghetti. This was my \"wtf\" dish. I love mentaiko, especially over rice. This dish, however, was just pasta slathered in globs of mayonnaise and raw egg. The instant I took a bite, all I could see was pre-diet Paula Deen shouting \"hey y'all!\" while I struggled to swallow my spoonful of mayo. Where is the chili? And where is my mentaiko??Conclusion: Don't think I'll be back. No mo' taro."], ["Carol K.", "I came.  I saw. I loved!  And obviously everyone else is still loving this place after being open a year or so, as at 8pm on a Tuesday night, it was packed!  And if that isn't enough proof, someone loved the place so much they \"stole\" our reservation and sat down in our place.  But Momotaro rallied for us when they realized the mistake and we were seated at a prime table shortly thereafter.The space is lovely.  Located in an old historic factory building, the space is contemporary and welcoming with an open kitchen in the back, sushi bar in the center and the bar at one end.  There are huge globe lights in the center (love the symmetry of those) and free standing panels that divide the large space into more intimate spaces.  And check out the bar menu that is posted.  The prices are posted in Yen as well as dollars.  And if you are there on Wednesday through Saturday night, there is a more casual Izakaya down in the lower level.We wanted to try a range of the menu which has the items from the kitchen posted on one side, and the sushi and sashimi posted on the back.  There also have a speciality cocktail menu that I usually forego for my old standbys, but our server, Alla, did such a great job describing them, I tried the \"proverbial life\" with tequila, bitters, cassis and lime which instantly made this my new favorite drink! So on to the food.  We pretty much went with Alla's suggestions from the dungeness crab with shishito peppers (definitely one of my favs), to chicken hearts, beef tongue, chicken meatballs, and wagyu beef and shishito peppers from the \"coals\" menu.  These are small skewers with two per order perfect for sharing.There was one dish that we are still asking \"how'd they do that?\" which was a tomato tartar which had the consistency and almost the flavor of a beef tartar but was entirely vegetarian.  It was amazing that Japanese tomatoes, dehydrated and rehydrated with spices and chopped could taste like this . . . .WOW!We also had the king crab (a large portion for the $26 price and it comes on a little hibachi grill as did the kuro buta pork chop (bone in and sliced another one of my favs).  Since so many had raved about the chili mentaiko spaghetti we had that too and it was worth the raves!Finally, we turned the menu over and ordered a few of the rolls from the back side including the chili mama, tuna saga at the eomomaki.  All were large, with an interesting mix of flavors and really fresh.  But if you go here and just order rolls, thinking this is \"just another sushi place\" you will have missed what makes Momotaro so special.Our server, Alla, was great, offering up many suggestions and even helping us to understand what the name Momotaro means and the story behind it (something to do with a peach and the folklore of a little boy being found in a peach by an elderly couple).  She was great in describing the items we ordered and made sure we knew that things would come up when they were ready which was fine given we were sharing everything anyway.  My suggestion is to do what we did and share otherwise some may be eating and others not.I am so glad I went with a group of 4 as it allowed me to taste a wide breadth of the menu on one go around.  So many interesting flavor combinations, and so authentically prepared and served, it reminded my friends of their recent trip to Japan.Will I be back?  You betcha.  There are still so many things I want to try off that menu and I've got to check out that more informal izakaya on the lower level.  It looks super cozy and authentic as well with the bar in the center and little seating clusters around.  Japan is on my \"go to\" list and I hope to get there next year.  But until then?  I'll just experience a little of the food culture right here at Momotaro."], ["Coleen K.", "This review is for the Izakaya at Momotaro.I've been here twice now, each time for the Happy Hour Special they have on Wednesdays thru Sundays. Both times, I was blown away by the quality of the food and service. The happy hour has a really nice variety of options, including a two course meal for ~$20, and a three course meal for ~$29, which includes a choice of starters, a choice of entrees, and an optional dessert (3 course option) as well as a tall boy beer and shochu shot. The first time I came in was with my boyfriend, and we tried the noodles of the day, the tonkotsu, deviled eggs and the ice cream dessert. Everything was awesome and really ample portion sizes. You'd be hard pressed to find a better deal! On my second trip to the Izakaya, I came with a business friend and we tried two of the three sake flights, as well as the chef's sashimi of the day, which was a yellowtail, the clams, and the fried chicken starter. The clams were to die for, and came served with this delicious dipping bread. These are a must have. To top it off, the Izakaya has it's own beverage coordinator who visits each table and introduces the flights of sake. This provided added fun and insight into the experience, as we learned about the origin of the names. Flights were large portions and paired very well. Really great place to come for both a date and a work meeting. Atmosphere is more laid back than upstairs, and in my experience, less crowded. No reservations necessary."], ["Lynn T.", "Made a reservation at 8:15pm and were seating at 9:00pm... was not happy about this but they gave us each a glass of champagne for the wait... that slightly made up for it... Aside from that, I loved the lively ambiance and modern decor. Momotaro is contemporary Japanese. It is very Americanized and \"hip\". Great place for a date or with a group. What we ordered: - Chef's seasonal nigiri selection: Very good and nice presentation. It comes with 8 pieces, one of each kind. I recommend it as sashimi since it comes in a decorative ice bowl which looks very pretty! - Baja Uni: Purple sea urchin. They had ran out of the Hokkaido uni so we opt'd for this. This uni was a bit bland and not as flavorful as I'm used to.- A5 Miyazki beef tartare: Loved how strong truffle taste was! The raw quail egg on top was a great touch.- Negi toro: Fatty tuna belly sushi rolls. This came in 6 pieces but the rolls here are pretty small.- Smoked bacon and eggs: Quail eggs wrapped in bacon on a skewer. The eggs were cooked very well. I've never had a quail egg with a runny yolk!- Washugyu: Wagyu skirt steak and foie gras on a skewer. Good but I could hardly taste the foie gras :(- For dessert they were nice enough to give us complementary sprinkled pocky sticksOverall, fun place for dinner. I would recommend this place to others."], ["Dan M.", "Date night atmosphere and terrific japanese-leaning entrees make this a weekend choice. The small omakase is one of the better sushi offerings I've found in Chicago. A terrific choice for west loop dining."], ["Ted T.", "Inconsistent service mars an otherwise excellent restaurant.I have been to Momotaro and its cousin, the izakaya in the basement, several times each. I have had consistently excellent food yet wildly uneven service. The service has ranged form excellent and professional to comically bad.  On one occasion they brought us the wrong order. It was 100% the servers or the kitchens fault but not ours. The server literally argued with us then walked away. The food runner apologized and said that he would get the proper order and to enjoy the incorrect order on the house. Before we could do anything the server re-appeared, snatched the plate away and said, \"well someone will eat this\" before storming off.  It was one of the craziest things I have ever seen happen at such a high-end place.It's too bad because as I said the food is excellent, though pricy. The sushi is wonderful and though I would not call any of the food truly authentic it is certainly creative and has flair and is delicious. The atmosphere is fun and well designed and quirky as well.  I really love Japanese food and culture and I enjoy everything about Momotaro except for the roulette wheel you spin when it comes to service.  Most of the time it is serviceable to good but I have had other sub par service experiences there as well.  So 1 to 2 two stars for service, 4 to 5 stars for food and I end on a 3 star review.  I hope they improve, as it would be an easy recommendation at that point.Also heads up... they used to serve the full menu in the izakaya, now they don't and they will not budge on that.  Oddly the menu downstairs has no sushi aside form a couple of maki rolls, but no straight up sushi.  This is a major oversight as sushi and a beer in an izakaya can't be beat."], ["Rosanna L.", "Eating delicious and fresh sushi can run you a pretty penny and at Momotaro it's worth every dime!All I've thought and dreamed about since I've visit Momotaro is the otoro (fatty bluefin belly) and it's melt in your mouth, foodgasmic deliciousness. Although I can't forget about the baby ika (grilled baby squid), kani karaoke, A5 miyazaki wagyu, okay just about everything we had was so freaking good! I also had hokkaido uni (sea urchin) for the first time and it was definitely an experience, but yummy.I didn't care for their desserts or oysters and the uncomfortable chairs we had to sit on for a 2 hour+ dinner.However, the otoro alone will have me coming back. I'll like to try the omaske next time."], ["John S.", "So I've gone back. Instead of visiting at a prime time with others I went early and solo, 5pm when they opened. I got a nice seat with plenty or room and a great waitress who was very helpful. They changed the menu, removed a bunch of items and made it a single sheet, double sided. It's far easier to navigate than the book they had before. This time I went straight sushi. Started with 4 common types that I order at every place to judge the quality of the fish. They were all very good. Next I did 4 items from the more creative section of the sushi menu, although good I didn't like them all equally. The King Crab & Aji were my two favorites and consider them A+ items. I had a couple glasses of the \"German Style\" beer from Japan and it was also excellent. I far prefer it over the Sapporo & Asahi style of beers, especially with the sushi.Since I was now enjoying myself here, unlike the first visit, I decided to get some carry out from the kitchen. A few simple item that would travel well. The grilled Ika, Grilled chicken skewers with green onion, & the Miso Cod. All were very good, Cod was a bit over flavored but still good with a bowl of rice.So I am upping my rating a star for a good visit. Momotaro is still super expensive but it's also different than anything in Chicago."], ["Carla Z.", "TLDR: Does it live up to the hype ? Not really ..I really wanted to love this place and made a point to come here while on business but the whole experience just felt off to me. I was seated promptly and ushered off to the sushi bar. I was confused why it was empty--true sushi fanatics know the sushi bar is where you want to be seated anywhere that serves omakase. Unfortunately for me at times it felt like my server forgot that I was seated there. I ordered a Yamazaki 12. Delicious and fine. Then the server disappeared again...For the food I wanted to try a little bit of each type. I had the raibu kani, toro tartare, nigiri pieces: Hokkaido uni, sake, & otoro, momomaki roll, wagyu don buri & caramel budin for dessert. The raibu kani was a Dungeness crab salad. Or so they said. The proportions were unbalanced... There was a huge pile of shisito peppers at the bottom--I felt duped. The crab was delicious but felt like it was too covered in mayonnaise goop. The toro tartare was fine but not mind blowing. As were the nigiri pieces. But I maybe it's only because  I compare all supposed amazing sashimi and nigiri to the two Michelin starred ichimura in Manhattan. Momomaki roll was, according to my server, the favorite on the menu. It was very bizarre to me. Although the spicy octopus inside was good it felt clunky with big eye tuna on top and a square of lotus root--neither served a purpose at least to my taste. Wagyu don buri was good for the first few bites. Then the ginger and soy based sauce becomes way too sweet and unbalanced. Not worth the price imo. The dish also needs a texture component. Finally dessert. The caramel budin was good. It's weird I think caramel and popcorn is the new dessert trend. Overall I don't think the food warrants the prices. The venue is beautiful though and the ambience is good for a date you're trying to impress."], ["Maria D.", "TAKE TWO: Our second dinner at MomotaroI was genuinely impressed when Adam with Momotaro's management reached out to invite my husband and I back to show us that they can do better! This gesture tells me that they take pride in their work and truly care about their reputation. Some of you might think that during this special visit the experience must have been staged and visitors off the street can't count on getting the same treatment. Not in this case, and here is why. When we arrived we were seated just as quickly as the first time and the service was just as impeccable, please note that we ordered right off the menu. The only difference was Emilio who was absolutely fabulous! He didn't just know the menu, he listened and aimed to please. We told him about our preferences and he delivered. Every single dish was fantastic, of course some absolutely stole our hearts. Among those winners were short-rib meatballs, skirt steak and shishito skewers, their unique (magical!!!) miso soup, ground pork shoulder curry ( a perfectly executed fusion of Thai Curry crossed with Tagliatelle in Bolognese Sauce)Lastly we tried two desserts, but one was absolutely mind-blowing. If you read some of my other reviews, you'd know that I don't usually care for dessert... But their chocolate cake with black cherry gelato, crispy bits and hot ganache had me scraping the plate and making inappropriate noises with my spoon - bravo!!!! Yes! We will return!!!"], ["Amanda N.", "I stopped by here on a Thursday evening thinking there would be available seating. I was told they were no longer taking walk ins because they were booked for the night. I called in the next day to see if there were any openings There was just one opening at around 5 which was just an hour later. I had just ate but I really wanted to try this place before my vacation ended. As I walked in to the restaurant there were many open tables even towards the end of my dinner which was around 630, there were plenty of seating. I guess they always want to seem busy.  The decor seemed like an upscale casual, and I noticed there were lots of employees. My server was very helpful, and attentive. Everyone seemed on point. We ordered a couple of items which came out in this orderWashugyu- sirloin steak with green peppers on skewers. The meat was tender, the peppers were tender. Buttery texture, lots of flavorSmoked aji not a fan of the smoke flavor but something I guess you have to experience and try yourself.Momo tartare- light and refreshingWasabi salmon roll- very basic, we were told this was the most popular roll. Don't get it if your trying to experience new and unique new things.A5 Mizyaki sirloin wagyu- the most expensive and the one dish that made my experience a whole lot better. It made up for all the other dishes. Juicy tender melt in your mouth beef.Curry udon- if you've ever had Japanese curry, it's udon smothered in this stuffAlmond crumble with peach sorbet- green peaches, delicious sorbet on top of almond crumbles. So good I ate it in two bites.Overall my experience here was great. But with the food, the presentation was outstanding but the flavors did not match up. I was expecting more. I'm glad I tried this place but don't think it's a place I'd want to come back for seconds (unless it's for the a5 lol)"], ["Steph U.", "I came here for the mentaiko after seeing Momotaro in the United magazine. Honestly, this place should probably have a 3.5, but I rounded down because it was really expensive and the mentaiko honestly wasn't something I'd come back for; it felt like something I could make at home, actually. We also ordered the uni risotto, which was a special they had that day. Once again it was good, but not something that I'd go out of my way for. The sushi, however, was amazing and actually very reasonably priced compared to everything else. We ordered the momomaki. I would come back just for the sushi and the sushi deserves 5 stars, hands down.My boyfriend and I also ordered some Japanese whiskey, which was good, but a bit strong for my taste.Overall, it was a lovely experience, but much to expensive for my taste, other than the sushi. If there were a special occasion, I'd go back just for that."], ["Jenny K.", "This review is for the LOUNGE. Note that this is a different menu from the upstairs restaurant!So, I wasn't aware that the lounge menu was different so that was a bit disappointing, but then again we were seated right away. Came on a Monday night so they offered an 'Industry Night' special which included a 2 course or 3 course meal. Chose the 3-course of Cured Beef Tongue, Pork Katsu, and the Grape Sorbet. Considering the price, it was a pretty good choice since the katsu was huge. Not much of a dessert person but the grape sorbet was excellent. Apart from the 3-course, I also ordered the Chorizo Uni Toast and the Hamachi Chili Roll. The bread of the uni toast was cut way too thick that it completely overpowered the uni and chorizo...so I just ate the top portion. I really enjoyed the celery pieces on top of the uni. It gave it a small crunch to the toast. The hamachi roll had good chunks of yellowtail with a slight, slight spiciness which I enjoyed. Nothing crazy but enjoyable."], ["Donald C.", "In the west loop and dying for a good cocktail or two or three? Head here go downstairs, grab a seat in the lounge area, and start ordering. The drinks are fantastic. Sushi? Who knows, I just had cocktails...."], ["Kara D.", "Wow. We drove from from Louisville, KY to dine here after hearing all of the hype - it was totally worth it. The entire experience was amazing. The staff was attentive and knowledgable, the concept was true all the way from the menu to the lounge. The food was amazing, great execution and presentation. Great for a date night or girls night. The salmon belly nigiri was amazing, the short rib meatballs were like nothing I've ever had before, and the Alaskan king crab was great."], ["Michelle P.", "One of the BEST restaurants that I have been to... Go! The service:fast,  polite, impeccable The atmosphere: trendyish and lively The drinks: one kid had jasmine, the other green tea. Both loved it.  I had the Monk cocktail with vodka, aloe and green matcha tea.... And then I had another! The food: so many amazing options, I don't even know where to begin.  Many are tapas style, smaller and meant to be shared.  Several vegetarian options for my son too. Best miso soup he's ever had, and he's tried many.  Amazing sushi and sashimi.... So fresh and tender...and beautifully displayed.Go, go, go!"], ["Jared J.", "The problem with this place... the nigiri was so good, other decent sushi places are going to seem garbage in comparison. Great food and great staff. Autumn was able to accommodate our group on short notice and our server took ample time to make sure we understood the menu and were well set with drinks as we assembled our large order. Great overall experience. I'd recommend focusing on the sushi/nigiri menu, by the piece, or chef's selection. The grill items were very good as well."], ["Andrea R.", "My husband and I recently celebrated our 7th anniversary, which fell on a Monday evening. I'd originally made a res at Oak + Char, but a few days before wished I had made a res at Momotaro instead. While I had heard it could be difficult to get a res at this popular restaurant, but I had a bit of hope for a Monday night. When I originally called they told me they were booked, but when I explained it was our anniversary they very sweetly made room for us. That alone deserves an extra star. Most restaurants are empty at 630pm on a Monday night, but biz was booming here. In fact, by 7pm most of the tables in the restaurant were filled with people enjoying fabulous cocktails and food. My husband and I agreed that everything we ordered was fabulous. Per our waiters suggestion we shared a variety of dishes from the menu: a little sushi, Unagi rice bowl, etc. I was full after a few dishes, but just kept eating as the food came to our table because it was so good. Dessert on your anni is a must and we finished our celebration with some sort of butterscotch pudding that I will definitely be ordering again. We should have ordered 2 since I didn't leave much for my husband, but then again he knows I'm not good at sharing my dessert after 7 years of marriage."], ["Leila T.", "So good! The matcha tea alcoholic drink was so refreshing and tasted amazing. We ordered two rolls, one that was $8 and basic and one that was $16 and more creative. Unfortunately the $16 came to our table first, we finished it, and then 5 minutes later the $8 roll came by and by then we were not impressed with the $8 roll since we just experienced the more creative one with more ingredients. Wish they would time how they bring out plates differently or bring them out at the same time! Either way the food was great and the drinks were awesome and it's a fun, lovely atmosphere."], ["Ginny M.", "What a great place. We were a bit confused when we first arrived because this is actually two restaurants within one. We were seated downstairs in the lounge which was quieter and less hectic than the main restaurant. The two restaurants do have different menus and the lounge menu is significantly smaller. We ordered the king crab deviled eggs, spicy tuna and octopus roll, beef tongue salad, salmon sashimi, fried chicken thighs and cocktails. The roll was incredible. I have not seen tuna that bright and fresh in  long time. The beef tongue was prepared like corned beef. I had one of the Japanese scotches and it was surprisingly good! Our waiter, Shane, was very knowledgeable and helpful. Overall a great experience!"], ["Taeho J.", "Great place for a date. Portions are not large though, which are perfect for asian people (I'm asian male)."], ["M O.", "Absolutely outstanding food and service. This place deserves the hype. I don't know where people giving this less than 5 stars are eating, but I kind of doubt its on this planet.The sushi was fresh and immaculately prepared. Legitimately interesting offerings, consistently good. Definately legit sushi, not some fusion or watered down American version.The service was excellent, attentive, detail oriented, not intrusive, everything I want in service."], ["Tia K.", "The vintage cocktail lounge downstairs is what I came for and I loved it. The decor is cool without trying too hard, and the drinks were unusual and delicious!"], ["Susan C.", "We had a 9:15 reservation. We are still sitting here waiting for someone to speak with us. It is 10:52.We had a 9:15 reservation. We are still sitting here waiting for someone to speak with us. It is 10:52.It's 11:29. We've had edamame. It was edamame. Our cocktails were very delicious. The food is fantastic. The service, however, leaves much to be desired and the staff failed to make us feel as if the delay concerned them in any way. The waiter failed to come over for at least a half hour after we were seated. It was an \"also manager\" that finally took out order.I have dined at most of the \"best\" restaurants in Chicago and understand that things happens and sometimes you cannot accommodate everyone. However, I have never dined at a restaurant that made me feel as if service was less of a concern. Even though we fully enjoyed the food, with all the other amazing options in Chicago, I don't believe I would willingly return. To be fair, Adam - one of the managers - spoke to us at the end of the night and was very receptive and respectful. That conversation alone is reason to give it another shot."], ["Alex R.", "Momotaro is a new addition to the Boka Restaurant Group's growing culinary empire; and it's a hit.  Fresh and delicious menu items, great service, and a cool atmosphere combine to make this a must-visit spot for those craving excellent Japanese food. Sushi has become ubiquitous.  Make no mistake, this is not your run-of-the-mill restaurant where you'll find rolls liberally covered in spicy mayo to mask the lack of freshness. And while that may be enough to satisfy most cravings, you aren't really tasting the fish.  Not so at Momotaro; everything tastes fresh. The Sushi Omakese is sure to please.  The dish comes with eight pieces of the chef's choice sushi.  Don't be surprised if you're tempted to order another; it's that good.  The Fu Roll is another popular item, though I wasn't as satisfied as I was with the Sushi Omakese.  While the flavors were great, I didn't care much for the crunchy bite you get from the beet inside. Other standouts from our meal included the Chili Mentaiko Spaghetti and the A5 Miyazaki Wagyu.  The spaghetti was delicious and creamy without being heavy.  For $21, you get three very small pieces in the A5 Miyazaki Wagyu (Santa Barbara sea urchin, shiso ohba), but it's worth every penny.  The silky texture alone is enough to warrant the price.  The Washugyu and the Gyutan (\"From the Coals\" menu) were also excellent.  We tried one of the Donburi Bowls, essentially deconstructed sushi similar in appearance and texture to risotto.  It was delicious, but I wouldn't say it stood out.This place is highly recommended for great food and drinks.  Some might bristle at the prices, but they are well worth it for the delicious high quality food you'll get at Momotaro."], ["Renaud S.", "A must-go place in Chicago for Japanese food lovers. Food is delicious, reffined, slightly spicy sometimes, always flavored. Broad choice of wines - we had a red Australian wine which went absolutely well with the meals.I particularly recommend their Momotaro tartare: exquisite!"], ["Laura K.", "Cool atmosphere, extensive menu, and great service.We came in for the sushi, and got talked into a few items on the other parts of the menu. Everything was good, but wished we had just stuck with our original plan because the sushi was good. The sashimi omakase was excellent and we wished we had both gotten our own. The chef selection sushi (the signature maki rolls) were all good, but the options were more limited than I would have expected. I would recommend Momotaro for a solid Japanese meal and would recommend to focus mostly on their sushi."], ["Matt R.", "Expectations were high for dinner last night but things got off to a rocky start. We had a 9 pm reservation and arrived on time. Unfortunately our table was not ready on time. We went to the lounge and were seated 35 minutes later. Along with a few other couples in the same sectionWe didn't have an opportunity to order until 10 pm. I would understand if the place was packed and it was a Saturday so they were busy but we asked the host if they had been slammed unexpectedly and he said the night was very normal and manageable. So maybe they are always late seating their guests?  A good host would have apologies for the delay without needing to be prompted.  We received no real apology.  Food was good but timing was off. We had a lot of dead time between coursing that made us feel like the expediting from the kitchen was off. I would give our wait staff a solid 4 stars as they seemed very knowledgable and did their best to make sure we had a good experience. When shelling out $200 for a romantic dinner I expect the experience to be better given all of the choices in the city."], ["Dr. Wendell P. W.", "We have always had great meals at the magical restaurant creations of Boehm and Katz ~ Girl and the Goat, etc.  However we were not prepared for the absolutely incredible delicious dinner we were in store for at Momotaro.  Perhaps it's because we are blessed with so many good Japanese restaurants in our home bases of California and Hawaii.Momotaro is located in a hot new area on Lake Street west of the loop.  You could tell it was built in an old warehouse, but as soon  as you enter, you're stunned by its exquisite and beautiful three story open design.  Then comes the creative and extensive menu.  There is something for everyone from sushi and sashimi to robatayaki and yakitori hot dishes accompanied by a nicely selected sake, wine, beer and Japanese whiskey menu.  Our server Paul and the attentive team were never intrusive, but extremely efficient whisking away chopstick wrappers and filling water glasses.  Now on to the dishes we selected.A delicious miso soup with two types of high quality tofu and kombu.  Next we ordered ebi tempura made with fresh spot prawns which is one of standards I use at Japanese restaurants. They were \"spot\" on.  The Momotaro tartare made with fresh tuna had a nice balance of shallots, tomato, shiso, capers with dollops of Maui onion mayo was very good, as well as Mentaiko spaghetti subtly with fish roe and a raw egg ~ like a fish egg carbonara.  The chicken meatball skewers were good, but the Wa Shugyu skirt steak wrapped around foie gras with grilled shishito peppers  just melted in your mouth.  A nice and unique dish was the Aji Yakusigi which was smoked jack mackerel artfully presented in a closed bowl releasing an aromatic smoke when removed.  It was Oishi!  We finished with the cedar roasted whole sea bream with shiso dressing which was amazingly juicy and flavorful.Because many dishes had two items per order for the skewers, you could enjoy working your way through this creative and diverse menu.  We can't wait to return."], ["Kateryna G.", "The review is for the izakaya downstairs.The food: 2.5/5. We had gyoza, chicken karaage, spicy beef ramen and pork tonkatsu. The good: chicken karaage and tontaksu. The bad: gyoza and beef ramen. Chicken karaage was excellent, very tasty breading and no grease. It came with some kind of wasabi(?) dipping sauce, which was ok. I also liked the tonkatsu, although it was a little on the dry side, but again they definitely got the breading right and it was excellent without any grease. Gyoza was ok, nothing to write home about. I wish they would make it the traditional way like Ramen Takeya next door. Now...the beef ramen they have is a travesty. What was that? They say it's served with \"Nagoya\" beef which just means a high quality beef, but it looks and tastes like bland ground beef. The broth is somewhat spicy, but there is absolutely no complexity to it. Sure, the broth doesn't have to be your common tonkotsu or miso, but if it's the spicy ramen it should be a balanced taste of sansho, firm noodles, textural nuts and crisp veggies. The noodles didn't have the right texture either, as they were overdone. Overall, not your traditional izakaya and the food wasn't impressive. On a side note, I was impressed with their selection of Japanese whiskey.The service: 5/5. This is where Momotaro exceeded my expectations. Our waitress was very attentive and knew the menu very well, being able to explain every dish. Once she saw I barely touched my ramen, she asked me why I didn't like it and then took it off the bill. Overall: 3.5/5. I wasn't impressed with the food at their lounge, but the service was excellent, so I'll come back to try their sushi menu."], ["David L.", "Of all the restaurants that I've been to at Chicago so far, this is by far my favorite. Yes, it's on the pricier side but rarely do I get the sense of \"wow, I'm getting my money's worth\" with every bite. Came here with the Lady for dinner and sake, left satisfied beyond expectations. Ogo (seaweed salad): 4/5 (Just the right amount of \"salty sea\" flavor)Unagi don: 5/5 (I love eel, that is all. Seriously)Smoked bacon and eggs: 5/5 (Pleasant surprise as the flavors worked very well together)Angel prawns: 4/5Tare smoked duck breast: 6/5 (The BEST duck breast I've ever had, EVAR)Bara chirashi: 4/5 (Different take on the traditional chirashi bowl but enjoyable nonetheless)Aji yakusugi (smoked mackeral): 6/5 (Impressed with the preparation. They actually smoke the fish with a piece of charcoal/wood chip prior to presentation)Ootoro (fatty bluefin tuna): 5/5 (Who doesn't like tuna that melts in your mouth?)Momomaki (big eye tuna and octopus roll): 5/5Chili hama (hamachi): 4/5Chocolate sponge cake: 4/5 (Very sweet)Citrus jelly cake: 5/5 (Refreshing palate cleansing dessert)Water Lilly sake: 5/5 (fruity, smooth, less dry)Demon Slayer sake: 4/5 (still fruity but more dry than the Water Lilly IMO)Strength and Longevity (gin): 5/5 Merchant from Kyoto (gin): 4/5P.S. Our waiter went outside in the cold to flag us down a taxi when we finished dinner. Never have I seen that before. Pretty bad ass if you ask me."], ["Karen C.", "This was one of the best meals I've had in all of 2015. Granted, it's only April, but I have eaten some insanely good shizz these last few months. Anyway...We arrived on time for our reservation, but they said our table wasn't ready yet. Normally, this would really irritate me... a reservation is, you know, a reservation, an agreement that we will be there at said time & our table should be there at said time. But all crankiness aside, we went downstairs and grabbed a cocktail at the basement bar while waiting for our table. I love this basement bar & I would have had no idea this even existed had our table been ready on time, so I guess I'll chalk that up to a win. The service was impeccable... our waitress helped us out SO much and was super personable while doing so. She carefully explained the concept, the items on the menu and how to order. When things started arriving & all of us were overwhelmed & forgetful about what we had ordered, she was right there to tell us again what everything was and who got what.The decor is on point... from little details like the flatware being awesome, the menus being beautiful & the lamps being amazing, I love the style/vibe of Momotaro. The concept... I love the idea that everything is small and you can get whatever you want, but at the same time it was a smidge confusing. For instance, I don't eat beef, but other people at the table eat beef. Some of the items are sold by the piece or two, so you could order exactly what you wanted, but half the time we felt pressured to order enough for the table, even though not everyone would eat the item. It's weird to try to explain, but it can get a little crazy when everyone (myself included) wants just a few specific items for themselves.The food... holy mother of God the food. We ate all the things & I loved everything. The tuna was some of the best I've ever had in my life... melt-in-your-mouth amazing. Everything was seriously so good. Order it all. The only big thing I'm bummed about is that, we ate so much dinner-type food, that there was no room for dessert! Next time, next time."], ["Giorgio F.", "Absolutely delicious.  The presentation of all the dishes is perfect.I found this restaurant to be in direct competition with Roka Akor.  Roka is more modern, Momotaro feels more authentic Japanese but the dishes look and taste just the same as Roka is not better!I attended on Saturdya May 30th, during a birthday party so I had the chance to try many different plates.  The fish was very fresh and tasty.  The steak with soybean paste was my favorite of the nightI will return to this restaurant in the future!"], ["Sheila C.", "It's a head scratcher really...this place is being hyped up all over the place ... All my girlfriends are talking about it ... That one friend from high school who blogs is reviewing it ... Chicago Magazine distinction...Blah blah blah ... And here's the deal ... It is simply AVERAGE ... Essentially a Suburban sushi joint (think FAR west suburbs ... Practically Iowa) dressed up in a Fulton market neighborhood disguise ...Crab salad dish tasted like Hellman's mayo and crab salad from Costco mixed together...no depth of flavor...no surprise notes - nothing ...Sushi Omakase was so mundane...a piece of salmon plain on rice with no garnish or flavor is your chef's very best on a Friday night?!? The coal dishes were so boring in presentation and taste that even wagyu beef managed to disappoint ... And wagyu beef cooked on hot charcoal should never disappoint ... EVER ...Overall Momotaro is \"NO-NO-taro\" for me ...strip mall sushi joints work harder than Momotaro at a 1/4 of the price ..."], ["Angelo L.", "One of the best restaurants in Chicago. Best Japanese food. The grilled items are amazing, especially the gyu-tan and the wagyu. The sashimi is solid, though I would order the other items next time because they are just so good. The Japanese steak was not too oily and was perfectly cooked. I enjoyed the steak and toro tartares too."], ["Franklin M.", "We were super excited to try this restaurant after reading so many glowing reviews on Yelp. So, it's likely that our expectations may have been at a whole nother level in anticipation of our Valentine's Day dinner but we left not feeling impressed even though we really wanted to like it a lot. Before the Momotaro groupies go berserk, I want to make it clear that our dinner was a pleasant experience, but the wow factor was just missing. Food/Drink:- Monk's journey: this was light, refreshing and a good way to start the night if you enjoy vodka cocktails.- Warlord's bounty: my wife wanted a sweeter cocktail so this is what our server recommended. She liked it, but I was not a fan.- A5 Miyazaki Wagyu: you receive three tiny, bite-size pieces for $21 and you're left wondering where the rest of it went. It was good but I'd skip this if you're looking for something more substantial. - Washugyu: two skewers each with a couple pieces of skirt steak wedged in between shishito peppers. Foie gras is supposedly part of this dish as well but it probably forgot to make an appearance on mine or maybe I scarfed it down too quickly to savor the taste as I was still really hungry after the first dish. - Smoked bacon & eggs: two skewers each with three quail eggs that I think were either wrapped in bacon or doused in some other flavor to make you think it was bacon. I'll admit I was still really hungry after the Washugyu so I devoured this one so that could be why I didn't notice whether the bacon was real. Plus, the richness of the quail eggs overpowers your senses. If you're not a fan of quail eggs, avoid this one. Thankfully, I do like quail eggs but the mix of flavors was not a tasty combination for me. - Glass of riesling & gruner veltliner: we both finished our cocktails by this point and were thirsty for more so we each ordered a glass of white wine before the sashimi omakase came out. These were nothing special.- Sashimi omakase: sushi chef's choice of 9 pieces of sashimi. They split whole pieces into two since we only ordered one for both of us. The highlight was the hamachi (yellowtail) along with the chutoro and ootoro which were medium fat and fatty bluefin, respectively. This was our first time trying bluefin sashimi and we were both very pleased! All of the pieces were very fresh though very thinly sliced.- Diver scallop: once we finished the sashimi omakase, we both looked at each other with that hungry face look and took another spin at the menu. We landed on another dish highly praised on Yelp. This was good but it's basically just one scallop sliced into four pieces along with some uni and ikura so this definitely didn't fill us up. At a $12 price point, I would not order this again. - Momomaki: since we were still hungry and wanted to try more from the rest of the menu, our server recommended this from the makimono (sushi roll) list. We're glad we ordered it as it was our favorite dish of the night. It has big eye tuna on top with spicy octopus rolled into the middle. Pure deliciousness!- Una-Kyu: we were almost at that point of feeling full but still wanted to try one more before moving onto dessert. So, our server asked if we liked unagi (eel) and we both said yes! This had barbecued eel along with cucumber and a spot of some avocado-like sauce. The barbecued eel straight from the coals is what made this one delish...definitely our second fave dish of the night.- Shittori citron cake: a yuzu cake with some yogurt and blood orange. It was light and not too sweet so it was a perfect way to cap our dinner.3 out of 5 stars with the sushi rolls being the highlight. Service:Lisa was great. She walked us through the menu, provided knowledgeable recommendations and was very cheerful and pleasant. The busboy never let our water go empty and the courses came out in a timely fashion. At the end, she did take the signed receipt before we left so I didn't like the strong hint to leave so I'm deducting one star.4 out of 5 stars. Ambience/location:Being situated in the west loop, this place has some stiff competition. It's also right next to the train so if it wasn't for the music and loud conversation noise, we probably would've noticed the train more. The tables are really close to each other though with three floors, you'd think they'd have better spacing. Overall, it still has a cool date night feel but not overly formal so you could definitely rock the jeans here. 3.5 out of 5 stars. Overall, rounding down to 3 stars due to cost/portion sizes. We also went to their lounge downstairs and enjoyed a couple more glasses of wine along with a cheddar and bread dessert. So, we left feeling super full and needing a wheelbarrow to carry us out after that but definitely worth checking out their lounge if you're looking for a chill place to hang out or a nightcap.For my money, I'd rather have the omakase experience at Juno in Lincoln Park any day over this place though"], ["Neeharika V.", "LOVE this place! Been here 5 times since January 2015 .... mostly because my first time there was so good that I wanted to keep going back. Great selection of liquor, amazing sashimi options. I'm pescatarian and by mistake gobbled down wagyu sashimi which was so tender that I never got to know it was wagyu .... ok maybe I shouldn't have mentioned this :)You can not go wrong here!"], ["Susie C.", "My husband and I came here for dinner on a Friday night at 630pm. We made reservation a month in advance. Very pretty interior, dimly lit, and busy! Service is great! Our waiter was very attentive of our needs and made sure we were taken care of. The hospitality overall is very good. Onto the food... Small portions, big price tags, but seriously good. The cheapest item we ordered was the seaweed salad at $6. Even the miso soup was $9. It' Was a loaded miso soup with fried tofu and other veggies inside.  The seaweed salad was good. We ordered the wasabi salmon roll which was fab, had 4 pieces of the fatty tuna and 4 pieces of hamachi nigiri...which were buttery and tasty. We had the FU Roll which was $45 for 6 pieces. That's crazy! Each piece has a specific fish/seafood... Shrimp, scallop, fatty tuna, Santa Barbara uni, Unagi, and king crab with wagyu beef inside the roll. I really enjoy the combo texture of all the stuff inside my mouth. My husband thought it was overrated..there were too much favors inside his mouth that he wasn't able to identify the fish goes eating. We also had chirashi which was good. The chili spaghetti was very good. One of our favorite dishes for the night. It was definitely my husbands fave. We also had the ribeye donburi which was so good. It was sweet and a runny yolk that you mix with the rice and ribs. So delish!We ended the night with two desserts- the shittori blood orange cake sorbet and the chocolate cake. Love the chocolate cake!The bill came out to be $235 for the food (without tip) we ordered and it was just two of us. Definitely will come back! All so yummy!"]], "Coast Sushi Bar": [], "Kameya": [], "Roka Akor - Chicago": [], "Nami Sushi Bar": [], "Ora": []}