{"Butterfly Sushi Bar & Thai Cuisine": [], "Opart Thai House Restaurant": [], "O'Cha Thai Cuisine": [], "Thai Aree House": [], "Sticky Rice": [], "Ruk Sushi and Thai": [], "Sticky Rice Chiang Mai": [], "Joy's Noodles & Rice": [["Allison F.", "My go to quick noodle.rice shop in the neighborhood. Always get the cucumber salad (sometime the crab rangoons) and chicken fried rice. Service is blazingly fast, everybody that works there moves as if they are continuously fed red bull throughout their shift. Ambiance is okay, nothing special. Food is solid, if unspectacular. But great value, inexpensive and fast.Ooh, and it is BYOB if that is you thing. Big open windows weather permitting and nice (great people watching) sidewalk cafe. Supposed to be a patio in the back, but I have never seen it."], ["Courtney L.", "I had shrimp pad thai and a thai iced tea ordered for pick up. It was ready when I arrived and still hot when I ate it. I gave 4/5 only because there is another thai restaurant I recently ate at whose shrimp pad thai was amazing and this dish was at that level. However I did enjoy and eat every bite. Staff is friendly and the restaurant is nice."], ["Shayna Y.", "This place is solid for carry-out thai food.  Do not go here if you have a strong gluten allergy (I only have an intolerance) as they didn't seem to know what I was talking about.Some of my favorite dishes are: Panang Curry (w/ rice), Spicy Basil Leaves, and Pad See Eiw.If you eat in, it is BYOB.  A solid, casual thai joint."], ["Erin S.", "The food is fantastic!!! When I called to place an order, it took a while to set up an account, but the guy who delivered our food actually walked to our door (vs calling so I could meet him --may have recorded the wrong phone number) made up for it after a day long of moving in from out of state. Amazing food!"], ["Lee R.", "Solid Pad Thai and Tom Kha Gai soup at a good price. Def a good spot."], ["Matt H.", "After walking by this BYOB restaurant many times over the years, we finally ate at Joy's this week. I liked this place! Even though I found the staff to be a bit stiff when I was there, the place was clean and the service was very quick. I haven't eaten much Thai food during my lifetime but I found everything to be quite tasty. I ordered the Shrimp Won Ton soup for starters and felt very healthy eating it! :) I enjoyed the plentiful amounts of cabbage. I decided to try the Drunken Noodles for my entree and am very happy I did! Noodles were cooked perfectly, delicious pieces of chicken, and lots of carrots, snow peas and corn. The prices are very reasonable for the amount of food that you receive. We will return! xoxo"], ["William B.", "I realize my last review was hardly a ringing endorsement, but I still fear it may have been a tad overenthusiastic.  There's no papaya salad, even though that is half of the charm of the \"nearby decent noodles\" genre; the pad thai has no vegetables in it at all, not even scallions or shredded carrots; and honestly, I would rather they weren't BYOB.  I'm still sure I'll come here plenty, but Sala Thai it ain't.[Updated to add, apparently I was wrong about whether I'd come here plenty --  over eight months since writing this review and I have not been back.]"], ["Rochelle O.", "Joy's Noodles and Rice is one of those last resort restaurants when you're REALLY CRAVING Thai, but you're too lazy to go out of your way for BETTER Thai food.  I went by myself and ordered one thing: the Pad Thai which was supposedly one of the more popular dishes there. I was disappointed the moment they placed the dish on the table because they had already mixed everything for me. THAT'S THE MOST SATISFYING PART, THE MIXING OF THE NOODLES AND SPROUTS AND PEANUTS AND ALL OF THE ABOVE!!!  I also noticed the lemon wedge that was a substitute for what was supposed to be a lime... sigh... But for what it was, it was fine.I'll go back and try other things when I'm really craving Thai again."], ["Max B.", "This my favorite Thai food in all of Chicago. Great customer service with very reasonable prices.$11 for large portion of carry out chicken pad thai.Great deal"], ["Sergio J.", "I should have known better to not go back to this place.  I went in yesterday, and remembered why in 2010 I said I would never go back.  I figured that after a few years of avoiding this place, that it would be worth the visit since they are still in business.  Just like the previous times I got sick again.  Every time I go here I get sick.  And just like the last time, I had to re-order my drinks because they forgot I ordered drinks. I'm sorry I wasted my money at Joys, and it reminds me to never go back."], ["Kara B.", "Came here recently after visiting many times. Our whole party felt sick after leaving... I probably will not be back."], ["Tony H.", "Time after time I find that the food at Joy's is pretty so so. It's a fine enough place and I like the space itself, but there are so many other Thai restaurants to eat at that run of the mill Thai seems unnecessary. They could really amp up the flavors and I'd be much happier. Coconut milk with just a little curry in it isn't that exciting."], ["John M.", "This a family favorite for Thai cuisine that has never disappointed. The food is probably 4.5 but I rounded up for consistency. Patio seating is fun on a summer eve but the inside seating is more comfortable when it's humid. All the standard fare is available and made with fresh ingredients. Their \"spicy\" is for American palates so don't be afraid to try those dishes. Tom Kha soup is excellent and big enough for two to share. Entree portions are also generous. Carry out is surprisingly quick and you get a 15% discount for ordering online. Noodle dishes, curries, rice plates: everything we've tried has been tasty and filling. Not quite as good as I've had in Bangkok but one of the best places for Thai in Chicago."], ["Sarah Y.", "I had a crave-worthy garlic chicken noodles, which is egg noodles in a garlicy umami sauce with some chicken chunks. My boyfriend had the thai basil chicken, which was not very good. It was also chunks of chicken sauteed in veggies. We had both thought it was going to be ground chicken with better seasoning. The spring rolls and yom kha soup that we started with were good though. Everything was quite flavorful, even the disappointing thai basil chicken."], ["Patrick W.", "My boyfriend and I arrived at Joy's around 9pm. The posted hours say they close at 10. The person who greeted said the kitchen closed in 10 minutes. We asked if it was okay if we still ate, he said it was fine. I had the chicken coconut curry. It was very good. The curry broth was nice, but could have been a little spicier. The fried noodles weren't my favorite. The boyfriend had Lard na. The noodles seem deep friend instead of pan fried which has happened a couple of places in Chicago. I had never had it actually deep fried anywhere else but Chicago. Not sure if that is normal. It was good though. The server was kind of rude and closed the windows by where we were sitting halfway through the meal. Sad. Food was good. Service. Ehhhh. Will go back but probably for take out."], ["John H.", "My favorite BYOB in Chicago!  Fresh food, great service and always a treat!  The crab raccoon is delicate and the sauce is nice and light!  Best I've ever had!"], ["Randy P.", "Joy's is and continues to be a favorite Asian joint in Chicago.  Been frequenting since 2006 and always fresh, delicious, consistent, quality selections.  If you want it, they got it!  The Pad Thai, Curry Chicken, and everything else is amazing.Don't forget to BYOB for an added touch to your dining experience.  If you haven't been here or are debating trying Joy's, GET THERE TODAY!"], ["Ilana B.", "Within 2 months of moving to this neighborhood this has become my go-to take out place! I love their dishes and how easy everything is. Great Thai, Fast, Reasonably Priced and just so darn delicious!Try the spinach noodles :) They're a great treat."], ["Katt C.", "I don't think that the people that left great reviews for this place have experience with Thai food. This place has Thai food that has been prepared like cheap Chinese food. Greasy, bland, and just an extremely disappointing way to waste my money. Drunken noodles, panang curry, and egg rolls. Barely touched our food. What a shame."], ["Megan P.", "I moved to Lakeview a year ago and ordered Joys the day I moved in.. BEST decision ever. They are fast, great prices, and amazing food. Chicken Pad Thai out of this world. Beef Garlic Noodles I crave someday's because it is like nothing I have ever had. ALL the appetizers are the bomb.com I have nothing but great things to say about Joys."]], "Royal Thai Restaurant": [["MacKenzie F.", "Try the sesame chicken (which is pretty much yummy orange chicken with sesame seeds) with a Thai Iced Coffee! SO. GOOD."], ["Liz M.", "Went here with my fiance for his birthday. I usually am distracted by the taqueria next door and go there, but this time we headed for Royal Thai with clear eyes and empty stomachs. It was a great choice!We had a few appetizers, which were very nice but not particularly special. The crab rangoons were better than most! I ordered Pad Thai for my entree and my fiance ordered a bbq pork dish. They were the perfect portion size! Best of all, the pad thai was just right. It wasn't overly sweet, which is usually my biggest complaint. it was delicious and perfectly seasoned. Also enjoyed sticky rice with mango for dessert which was delightful!!One comment, they only played music intermittently. It would have really made the ambiance better if that had been more consistent, as it was sometimes weird silence with us and one other group in the restaurant for most of the time I was there."], ["Livvy O.", "This place got a lot of good reviews compared to the other Thai places in the area so when I went I was kinda disappointed. I went during lunch alone and the place was empty. It's a nice, small place. Nice decorations. My food took about 15 minutes to make. I ordered Pad Si Ew with chicken. When the plate came out, it was the smallest portion I have ever had at a Thai restaurant. Usually, I get such big portions - I have enough to take home for a second meal. This was the first time I actually finished all of my meal at the restaurant. On top of that, the Pad Si Ew was not that different than any other place. I liked that they use Chinese broccoli. The grease from the plate upset my stomach for the rest of the day. I don't know if it's just me, but I used to love Thai, but everywhere I go, it all seems too greasy for me. Maybe  a non-greasy Thai place is non-existent!Overall, I would not go back because the food was average and the portions are very small. I like leftover's when I order Thai.One More Note: Now that I'm reading through the reviews, the waitress failed to mention the Lunch menu to me!"], ["Lavinia S.", "Picked up dinner pad thai and royal thai noodle. Tasted great! First timer. Will order again!"], ["Angus W.", "Gushing. That's how I left this place.It's BYOB, the pricing is very reasonable and the food...phenomenal.Let's start with my only real negative and then we can get into the nitty gritty. The satay was just ok. It has that same over flattened quality that you find in lesser Thai places and the flavors are not that pronounced, also.. there are only four of them on the plate. Peanut sauce is very good and the Cucumber salad was pretty good, certainly presented beautifully. Montri Thai in Warrenville, Banana Leaf in Dallas and the stalls in Singapore all have much superior Satay.We tried a second appetizer just for fun (we had been bike riding all day along the beach and we were seriously hungry) The Spring rolls with peanut sauce. These were excellent and different than others that we've had. What was cool is that they were cut into smaller pieces and easy to manage.. we ate them throughout the meal and they really seemed to compliment everything.So, we got kind of carried away with noodles.. in fact we accidentally ordered ALL noodle dishes... here's what happened:We ordered Pad See Ew with beef (we always do, it's a staple) it was excellent! Just enough of that slight tangy sweetness and crisp veggies....really, really good. As good as any of our other favorite places.We ordered Panang Curry with Chicken (we order this everywhere.. it's one of the ways we judge our Thai places)  so... normally we would get rice.. and I looked at my wife and said \"wait a minute\" a Yelp reviewer said \"don't think about it, just get the Panang Curry with noodles\" So we did. It was awesome. We asked for it very hot and it was pleasantly spicy (we have a very high tolerance for spice) I highly recommend this dish although next time we will get it with rice.. just to break things up. They put the appropriate veggies in the curry (bell peppers are the ONLY appropriate veggies in Panang curry) Did I mention that it was delightful?Then came the third option.. This is where we usually experiment.. sometimes it's Pad Thai.. or sea food or whatever looks good.. this time we got the Crispy Pad Thai with Pork. OMG, what a delicious surprise! I took my life into my own hands when I reached for an extra taste of this.. my wife had chopsticks and she knows how to use them. Traditional Thai decor, not fancy and only one small bathroom. Very polite service. The food presentations are beautiful.If we lived closer.. we would be here all of the time.We are soooo going back here. Our bill was around $44.00 and we took home a few leftovers and fortunately for me, Lisa left the dangerous chopsticks at the restaurant."], ["Shahzad S.", "I really liked their beef fried rice for the beef noodle dish and the appetizers they really had a good taste to them and they were quite spicy which is awesome"], ["Juan A.", "I Was Looking for pad thai and a Royal thai far exceeded my expectations! Plus i came here during lunch so definitely appreciated the lunch special.  Overall experience was Wonderful, the owner/host was very attentive and every thing from the crab rangoons to the pad thai was superb! Definitely come if you like great tasting thai food"], ["Shambavi K.", "Well based on reviews, I wanted to try this place out. It was okay to me. The service was professional and friendly. The food was ..fine. We ordered the royal catfish off their recommended sign on the wall, pad kee mao, and nam tok. Nam tok - beef salad was flavorful. I found the ground rice to be a bit gritty but I think that's how it is supposed to be. royal catfish -  this was tasty but didn't seem much like a Thai dish. it reminded me more of Indo-Chinese food...like chicken Manchurian. it wasn't spicy either.pad kee mao - it was forgettable. I felt the dish has the same veggies as the catfishThe BYOB part made the meal more enjoyable. For 2 people, the entre portion can be viewed as \"just the right amount\" or smaller than expected.I would go back to try other things like the curry but I won't be eager to back either."], ["Eric R.", "Consistent, consistent, consistent. No matter how many times I've ordered either in the restaurant or for pick-up/delivery (which has been a lot) the food is ALWAYS the same excellent taste and quality!"], ["AV G.", "i have ordered the chef special seafood stew at least 10 times.  I went home and threw up.  Go figure."], ["Veronica G.", "I go here just about every 2-3 weeks, and I really have nothing negative to say about this place and have never had a bad experience. The food is some of the best Thai I've had and is always consistent. I love their tofu tom yum soup, the crab rangoon, and every dish I've had - although I usually go for chicken pad thai. Here is why I'm giving this place 5 stars:1) Very delicious and authentic2) I've never had to wait for a table even though the restaurant is tiny.3) The service is very quick and friendly (sometimes the food comes out too quick where we haven't finished our appetizers or soup yet).4) BYOB (no corkage fee and no bottle limit)5) Cheap (usually my boyfriend and I get an appetizer sampler for 2, 2 soups, and 2 dishes, and it comes out to $30-some.)6) DeliversLove this place :-)"], ["Hannah P.", "THE WORST SERVICE EVER! It's busy which is great but they dont bother to hurry a little even with your water. They are nonchalant like you have nowhere else to go. There's one person serving which is fine because it's a tiny place but they just don't care or value you're time. Gazillion Thai places in Chicago...next!I don't even remember how the food taste because after about 2 hours waiting I didn't care what it tasted like. Don't get me wrong Ive been to a restaurant with my friends and spent almost 3 hours there but at least we were served and they asked how you were and checked up on us. We didn't have to call the person to come and get us some water or ask where our appetizers are."], ["Heather M.", "Just want to say that I still love this place. We frequently drive from the West Loop to get takeout from Royal Thai because there simply is no better Thai nearby. The panang noodles are soul-warming delicious, I love the tofu peanut sauce spring rolls, the chive dumplings are great... I can go on and on. Enjoy!"], ["Amy K.", "Best Panang curry I've had since going to Thailand a few years ago.  Delish!  And good service, will be back."], ["Andy W.", "More like 4.5 stars.My partner and I eat here all the time. I think what we love most is the consistency. Our food (no matter what we end up ordering) has always been good, fresh, and hot. Even when we get our food to-go or delivered, the quality does not suffer. The restaurant itself is small, about 10 tables or so. Usually busy around the usual lunch/dinner hours, but we've only had to wait for a table once I think. Check this place out if you're in Lincoln Square and want good Thai food--it's better than Opart in my opinion."], ["Laura N.", "Updated review : Lost a star because they lost our reservation and were really unapologetic about the whole thing . I get it - misunderstandings happen. But say you're sorry and see what you can do to right the situation That said- there are thai places all over the city but I have to say this place is definitely not your average thai food joint. The pad sew ewe ( spelling?!) is probably one of the best I've ever had and the fact that it's BYOB makes for a delicious but affordable night out"], ["Melissa C.", "Best Thai food in Chicago and surrounding suburbs. PERIOD. My favs are the spinach soup, chicken potstickers, royal Thai noodle, pad woonsen and pad see ewe. Oh yea and the mango with sticky rice and the Thai iced tea."], ["Turkey B.", "Now, if you haven't noticed the Northside is saturated with Thai restaurants. Most of them are mediocre. However, this place certainly deviates from the typical, bland food that you can find in North Center's New Thai Kitchen or Lincoln Park's Noodles in the Pot. If there is a Thai word for gringo, I'm sure they're muttering it under their breath at me at the aforementioned places. This is not the case at Royal Thai. The food is full of flavor, and if you request it spicy, you won't be disappointed. I've probably tried each curry dish here, and the seafood ones are special standouts. Red Curry with Talapia and the Green Curry with catfish are the true gems of their menu. What the staff lacks in timeliness, they make up with personality. The waitress is pretty hilarious. I asked her about the dinner-plate sized goldfish swimming on the back wall. She said it was convenient to have them nearby in case the kitchen runs out of fish. The wait staff other Thai places should take a hint from her. Lighten up and crack a smile every now and then. There are only two factors preventing this place from earning five stars. 1. Some times they can bring members of your group their meals considerably longer after one person in the group has been served. That's a bit weird. 2. They don't accept AMEX."], ["Dallas M.", "The food here is delicious! My favorite is the masuman curry. I also have ordered the sampler which has the chicken egg rolls, fried shumai, crab rangoons and pot stickers. All delicious. It's a BYOB place so make sure to bring a bottle of wine! The staff is also very friendly and helpful. Nice table next the window as well across from Lincoln square."], ["Nicole R.", "I love this place! The food is always perfect. The service is great. I have two thai food places in walking distance from my house, but I would rather drive here. They don't deliver to my house so I am not sure about that experience. I can say that the dine in experience is always fantastic."]], "Bodhi Thai": [], "Noodles In the Pot": [], "Opart Thai House": [], "Krung Thep Thai Cuisine": [], "Khaosan & Taylor": [], "Sala Bua": [], "In-On Thai": [], "The Snail Thai Cuisine": [], "Silom 12": [["Jen M.", "Delivery was extremely late, my bubble tea was on it's side and extremely frozen. I've had better orange chicken here before. I'm rating 3 stars to give them the benefit of just having a bad night."], ["Ming F.", "We went there around 12pm when the restaurant just opened and there were just us one group there, we waited for like 40 mins to get our food. One star off for the wait, but the food is really good. We all liked our dish. I ordered red chili pepper curry and it's incredibly spicy, which I didn't expect in Thai restaurant. I am a big fan of spicy and I handle spicy pretty well, but this spiciness is too much. My fire was literally on fire the whole time. But I love it. So if you are ready for some real spicy food, this is your choice."], ["Laila C.", "LOVE THIS PLACE!Cute BYOB Thai place that's actually nice and open inside. We went on a Saturday night with 10 people and I couldnt' believe they weren't packed!  The food was delicious, everyone loved their food and it was unbelievably cheap for the quality. I LOVED my green curry, and I'm generally not a Thai food enthusiast.  Can't wait to come back here, they're so accommodating and I can't say enough nice things.  Also, there's tons of street parking but it's still close enough to walk to the heart of wicker park. Awesome!"], ["Ingrid S.", "The food at Silom 12 is very high quality and made with care. I have never had a bad meal here. We dine in occasionally, but usually take out about once a week. I always get the Vegetarian Panang Curry with tofu, and while the veggies may occasionally change the sauce, spiciness, and preparation of the tofu are always very good.The ambiance of the restaurant is very nice, and classy-- a bit modern but comfortable. It would be a nice place to go on a date, or out to dinner with friends. For the price and consistency of the food, there is really no other Thai/fusion restaurant that I'd prefer to go to. Definitely worth trying."], ["Uri M.", "We found Silom 12 on Yelp and it lived up to our expectations. Everything we ordered was perfect, the place was really nice and the service was great. When we went the place was almost completely empty which we felt bad about since this place should really be always packed."], ["Gayatri W.", "I absolutely love this place!!! I love thai food and BYOB! And this place has best of both!! The ambiance is really nice and so was the service! Added bonus, its jut down the road from my favorite ice cream place- Margies!! I'm surprised it took me this long to come by Silom!! You must try this place if you love either thai or BYOB!"], ["Ashley B.", "Probably one of my favorite Thai restaurants in the city. My boyfriend and I drove by this place all the time and just randomly thought to try it the other day and let me tell you, this place is seriously a hidden gem!To start off, the atmosphere is really nice. It feels like a trendy Japanese sushi restaurant or something. I was kind of amazed at how NOT busy it was on Friday night. In fact, I even hesitated reviewing this place and giving it 5 stars in fear that it will start to become another Nori or Cumin, because that's where it's headed.We started off with a couple drinks. Mine was a ginger vodka with iced tea and my boyfriend got a Long Island and they were both great! Our crab rangoon came out quickly too and it was delicious.Next up, I got the panang noodles and they were AMAZING. I always crave curry, but I love noodles, so this was a perfect fit. My boyfriend was jealous and I think we'll probably both order it next time. He did get a really amazing seafood noodle basil dish though, but the curry noodles were off the charts!I definitely want to come back, and I could not be happier that I'm moving to this neighborhood!"], ["Ann P.", "Right in the middle. Ive eaten here many times, gotten take out and dined in. Service at the restaurant is mediocre, but I keep coming back because they are close by and the food is consistently slightly above average. Its nothing I would rave home about, but a good go to place when you want a real meal delivered. Ive recently discovered they deliver ramen, and am pleased to report that its pretty good. A little on the salty side ( adding a little rice vinegar or lemon will take care of that) but when youre craving ramen and dont want to dine in at wasabi or oiistar its a decent alternative. The noodle texture is good and the broth is nice and hearty. Ive also heard pleasing reports on the curry, and ive had the chow fun-which was also good."], ["Jason A.", "More of an Americanized Thai spot, super approachable.  I'm a huge fan of the spicy tofu, spring rolls, masaman, and orange dishes.  They've changed their preparation a couple times which is annoying but they are generally consistent. Don't eat there, get delivery from here if you want to try Thai food for the first time."], ["Nancy B.", "I'm only giving 4 stars because I've never dined in, but it sounds like the atmosphere would warrant 5 stars! I've ordered carry out via Grub Hub twice (in one week) and it's been phenomenal. We've found a new favorite spot. The food is absolutely top notch. From the appetizers to the curry to the Chef Specialties and the sticky rice (gotta try the sticky rice). Everything has been awesome. The Osso Buco is veal shank and the bone marrow (according to my boyfriend) is incredible...smooth and buttery. It's probably one of the best dishes we've ever ordered for take away. Our next step will be visiting the restaurant since they gave us a $5 coupon when we dine-in (clever!). They're definitely doing something right. ...go here!"], ["Joshua M.", "YES. YES YES YES YES YES.I randomly decided to order from this place on GrubHub without checking the reviews. 7:55PM: Place Order, Delivery estimate 8:55PM7:56PM: Walk Dog8:15PM: Return home8:16PM: Phone call from (really friendly) delivery driver that my food is there.8:30PM: Thai Bliss.The food was REALLY good. One of the best Pad Thai preparations I've had in the city. Their Pad Woonsen was out of this world. I think I found a Thai delivery restaurant that will make me start ordering Thai food regularly again. And now we mourn the death of my disposable income."], ["Amanda P.", "Ordered through Grub Hub tonight for pick up and it was very fast! Our order was ready in about 10 minutes, which was great! It was reasonably priced, and the food was delicious! This will be our go to Thai place from now on!Crab Rangoon: 2/5 -- very small little purses with thin dough which was nice, however they were lacking any flavor other than cream cheese. The sweet chile sauce to dip in was good though!Cashew Stir Fry with Beef: 4/5 -- The sauce in this dish was delicious; typically sauce in a cashew dish is very thin. This was a nice, rich, caramelized brown sauce that enriched the flavor of the veggies and went perfect with beef. The meat could have been a little more tender. Pad Thai with chicken: 3/5 -- Good as far as pad thai goes, definitely ask for spicy if you like a little heat. We found it to be bland. There were LOTS of peanuts though, which was great!Massaman Curry: 5/5 -- Absolutely delicious. Just the right amount of coconut flavor to compliment the curry. The sweet potatoes were creamy and perfect with the other flavors. We will order from here again and again!! Can't wait to try out the BYOB!"], ["Jason P.", "Best Tai in Chicago."], ["Katie K.", "SO SO SO impressed with not only the prompt and polite delivery on a Friday night, but the pad thai was to DIE for! So fresh! First timer at Silom and it won't be the last!"], ["Van V.", "I only had the calamari but it was excellent. The Bartender is a little inexperienced as he kept referring to a cheat sheet to make menu drinks."], ["Benjamin B.", "I have always been a frugal sort of man... and seeing the cost of delivery for this Thai/whatever venue... fended me off for a few months. But one fine evening of Maker's consumption led me to throw in the towel.If you prefer generic, Americanized, predictable, normalized Thai dishes, like Pot Pan, Penny's, and Thai Aroma... Silom 12 is likely not for you.The flavors are highly Earthy, basic, and unpredictable. The Summer Wraps, Gui Chai, and Banana Wonton all have a flavor that you'd never expect... not naming anything in particular, but their tastes are unusual, satisfying, and unique.Their main courses, by delivery, are a fair sum above average, but are not truly different enough to call them out on a higher level that is worth discussing on any long term basis.It is my opinion that the chefs/cooks/etc here are amazing and have a large amount of potential to create truly groundbreaking cuisine... but may have a management level that prevents their primary initiatives from hitting their highest caliber.But, like most ethnic foods of Chicago, I cannot hold much against minor imperfection, so... and so, with a shot of Maker's Mark held high, I rate Silom 12 5/5 despite its shortcomings."], ["Emily C.", "Best thai food in the area!  Everything I've ordered here has been good (Paht Woonsen, different curries, Basil Shrimp), but the best dish we've tried was the Green Curry Fried Rice with catfish.  Our friend ordered it, I never would have even noticed it on the menu, and it was fantastic.  Really amazing flavors - I'm definitely getting that the next time.  Our starter of summer wraps was really fresh, but I wish the peanut sauce were a bit more flavorful.  We LOVE the fried shrimp chips with chile sauce that they bring out when you get there.  Amazing.  They serve alcohol now so now charge a corkage fee - $2/person.  Seemed reasonable to us.  They are also really attentive when it comes to re-filling the water if you order a spicy curry!  Street parking is usually pretty easy.220/365"], ["Jackie W.", "Since 2011 I would stopped in every week or two for a reliably delicious thai meal, but changes over the last 6 months or so have prompted me to find a new thai spot. Prices jumped and less and less vegetables in the dishes. I used to explore the menu but they are only doing the basics well now -- drunken noodles, paht thai, green curry."], ["Anu N.", "Consistently awesome.  Ruined other Asian takeout places for me."], ["Isabella K.", "Best thai in Bucktown/Logan/Wicker area for sure! The pad thai is great. If you are a vegetarian, order with vegetables instead of tofu because their basic pad thai already has tofu in it. My favorite dish is the green curry. Make sure to upgrade to sticky rice, you won't be sorry. I mainly get delivery, but it is fun to go in too because there are not usually too many people there (I think their main business is delivery)."]], "Dena Kitchen": [], "Star of Siam": []}