{"Sweet Ginger": [["Stephanie V.", "I tried this place based on reviews. The reviews are nothing but true. I was pleasantly surprised by the quality, quantity and price of food. They deliver, too! A definite must try!"], ["Jessica M.", "Scrumptious stuff!After eyeing this place for sometime, the hubs and I finally stopped in for a late lunch after browsing the Cherry Creek Arts Festival. The servers are speedy and very friendly and the sushi rolls we had (spicy yellowtail) were spot on. They also let us sit on their patio with our pup, so that made it extra enjoyable.They also have Sapporo on draft for $2.50 a pint! Bonus!"], ["Jacob V.", "Had a great time, the food was delicious. Especially the sesame seed chicken. The waiter was very amiable and extremely polite; he wouldn't let our drink reach halfway before coming to refill it :) Very nice environment, including the outside. I definitely recommend this place for those unfamiliar with the area and a crave for Chinese food or if your looking for something new."], ["William J.", "This has to be one of the best Sushi places in Denver...Outstanding!"], ["Geoff G.", "Sweet Ginger is an Asian food potpourri. From Sushi to Pad Thai and just about everything in-between. I have only ordered delivery. There was a problem with one of my orders and I went to the restaurant a few days later and the issue was rectified. I'm consistently surprised at how good everything tastes, regardless of county of origin. The food arrives quickly and it's hot. For the amount of food and the quality of the meal, it's fairly priced. My favorite is the crab rangoon appetizer.  It's a lot of cream cheese. I haven't tasted much crab, but I love cream cheese.  Although I've never eaten in the restaurant I will soon now that the weather's better. There's alfresco dining and the interior is nicely appointed with a sushi bar at the entrance. Good stuff."], ["Ashlee M.", "Would not give them any stars... Here's what I would say here...the service was good but our meal was spoiled by a large number of hairs underneath the entire plate of $120 worth of sushi.  The female owner/manager (this is what she called herself last time we were there) tried to negotiate with us as to how much of the sushi and sashimi had hair under it to reduce that much of bill would be credited back to us.  Needless to say, we got a little more queasy at that point as she actually admitted that there had been hair under all or most of it by doing that.  And we had actually consumed some of the hair and sushi already so couldn't possibly expect to have more of a credit back to our card.  I'd been to sushi places on 3 continents and hadn't heard that before so thought we should accept most of meal's cost for the hair and all, and then leave so as not to create a scene.  Maybe you won't have same experience but suggest you check underneath sushi on plate and bottom of sushi itself to ensure you don't have same type of stomach upsetting situation.  Also, at least the hair was same color as sushi chefs'."], ["Michael G.", "We LOVE Sweet Ginger and have been going there and ordering take out since they opened.  The owners, Julie and Joe, couldn't be nicer and so on top of there service.  The food, whether Chinese or Sushi never disappoints..... and we're Sushi Den regulars so that says a lot!I have read some of the reviews here and the rare FEW that have offered negative reviews must be positively impossible to please, or just career grumps....... simply laughable.We suggest the Masman Curry with chicken.  Sweet Ginger tonight! Yum! Michael & Zoe"], ["David B.", "Amazing rolls and sashimi!  Very reasonably priced and very good service.Highly recommend yellowtail jalapeño sashimi and salmon belly.  Super good."], ["Thieny T.", "Delicious sushi, and spectacular service. My favorite part of sweet ginger in the summer is the patio where you can dine outside under the stars. Rolls and sashimi sushi are all great, tried the ahi salad today and it was also delicious. Fresh fish and good atmosphere, what else can you ask for in a neighborhood sushi joint?  The prices are also very reasonable for their location in Cherry Creek, this is definitely a spot to try if you are in the area and feel like Asian food!"], ["Lesya L.", "Nice place, tasty food, reasonable prices. Staff can be slow at times but otherwise great casual spot."], ["Dave B.", "4 stars for food.4 stars for overall ambiance. The patio was very pleasant on a Saturday afternoon.1 star for service. Slow. Painfully slow.I never did get the W-Fi password.Our appetizer arrived way after our main course.My food grew cold while I waited for a beer.Solid Walco flatware.Cloth napkins.Sapporo beer: 16oz for $2.50 USD. A good deal.Tasty Panang Curry. Just the right amount of mild spiciness (for those who like mild).Good Spring Rolls.Very good value for the money.The music was all wrong.Not Thai, but some USA pop."], ["Felix R.", "Sweet Ginger is our go to spot for Sushi in Denver. They have a great selection of rolls and the owners are very cool and friendly. The plates are delicious as well if your not feeling sushi. However if you are in Cherry Creek and craving some sushi this is the spot to go."], ["Jocalyn E.", "The sushi was pretty good. Typical swanky sushi rolls. The noodle and beef entrees lacked flavor. Seriously. Stick with the sushi."], ["Kelley H.", "Really really bad pad Thai.  Not even sure the chicken was even chicken.  Egg rolls were burnt.  Gross!!!"], ["M L.", "The food was meh, and the delivery guy was worse.  I wrote a specific note, \"The street address is on Jackson Street but it's easier for me if you come to the door on Harrison and call me when you're here.\"  Simple right?  I get the call, he says he's here, and I confirm that he's on Harrison Street. I walk downstairs, and of course he's not there.  So I walk all the way to the opposite side of the block, and he's at the main entrance.  He says \"I've been waiting a long time, here's your food\" and walks away angrily. Yeah."], ["Ryan W.", "Great delivery SUSHI! Yum! Bomb.com! We found this place on yelp and were so excited to try! We ordered over 40.00 of sushi (it adds up when your hungry and want sushi delivered to your door) if you order over 25.00 they throw in edamame. It was at our door pretty quickly too (I would say under 30 minutes) we got a largo miso soup to start which was great. The sushi was actually really good!"], ["Lindsey B.", "Timing is everything. We received their menu/flyer in the mail and I wasn't in the mood to cook, so we headed over! Great food, awesome customer service. I was worried it wouldn't be ideal for my 11 month old son, but they were very accommodating and friendly. We will be back."], ["S C.", "Overpriced Asian cuisine with nothing special. Terrible service: the waiters and waitresses seemed to be flighting against each other and no one was willing to serve."], ["Tracie B.", "The food at Sweet Ginger is excellent. The service is usually fair to good however we did have slow service on our last visit was very slow, apparently Sean was short staffed. I highly recommend the Thai Spring Rolls - very large and fresh. The accompanying peanut sauce is so good you might just be tempted to lick the bowl clean. Also excellent is the Chicken Lettuce Wraps appetizer (I often order this as a lunch item). The Panang curry lunch portion is large and very flavorful with lots of chicken, snow peas, broccoli and potatoes. I've never ordered anything from Sweet Ginger that I haven't loved. The dining room is pleasant but the below-ground patio is great in the summer-time."], ["Amisha R.", "Food is just about OK. The ambiance was good. So may return if I am in the area, but definitely would not make an extra trip to dine at this place."]], "Star Kitchen": [["Josh Z.", "Really great authentic chinese restaurant.  The food was outstanding.  We had, amongst other things, Wor Wonton soup, a french cubed steak (it was as soft as butter), and honey shrimp (perfectly cooked, not rubbery), and veggie fried rice.  All were excellent.  Outstanding place."], ["Airelle S.", "Super authentic restaurant. I ordered the Mongolian beef and sesame chicken. I enjoyed both thoroughly. Although, I wish I would have known the Mongolian beef was going to have huge slices of ginger in the dish. I love ginger, don't get me wrong; it was just a bit much with all the other flavors the dish had going on. I honestly can't wait to come back and bring some friends. I would love to try some other dishes on the menu."], ["Alyssa D.", "Two words...Dim Sum!Make sure to come with a big appetite .it's hard to resist all of the delicious dumplings, buns and small plates being rolled around on carts in front of you.Some of the best dim sum I've had it so good that I haven't ordered anything off their menu yetThe weight can be long during peak hours and on weekends but its well worth the wait"], ["Rachel B.", "Good dim sum.  I've had better but I like the selection here. I forget what you call the mochi beef balls but they're delicious. Don't go during lunch hours as you might be waiting a while to be seated."], ["Cool K.", "I love the authenticity of their food.Everything tastes great.However, the restroom is falling apart and it does not feel clean.Please clean or refinish the bathroom.If people don't like the bathroom at the restaurant, they will run away."], ["Q N.", "For those that have not had dim sum in Hong Kong or NY City, I suppose Star Kitchen would be outstanding.   I have eaten dim sum in HK  and NYC, so I am wondering what the big deal is.  The long wait for do so dim sum is not worthOn Federal St  around the corner is a street full of fantastic Vietnamese food.  I know it's not Cantonese dim sum, but I rather eat good food than settle for the dim sum at Star.  It's not terrible  but not worth the long wait."], ["Flora W.", "Just by looking at the Yelp ratings you already know this place is good. But here are a few things to keep in mind. SMALL parking lot, long wait and the food is good. You HAVE to try the pineapple bun (no pineapple chunks) as soon as they come out. Oh and if you go on the weekend, get there at LEAST 30 mins before opening. If you don't, brace yourself to wait at least 30 mins for a table. Yep it's that busy."], ["Rachel M.", "I am so a fan.  Everything we tried was delicious.  Can't wait to go back! I wish I didn't live 200 miles away."], ["Zen T.", "OMG. This place was BOMB DIGGITY!Went here with my fam bam for lunch today. Ordered dim sum and was definitely very satisfied! The restaurant is very clean, food is delicious, service is great, and the price is right! We got like 5 different dim sum trays and the bill was only $26. OH YEAH, you read that right. INSANE. I am definitely going back to Star Kitchen - my new favorite spot."], ["Chanh T.", "If I can give negative stars I would. Took some friend out of state but the service is horrible. Not coming here again or recommend this place to other people."], ["Crys A.", "This was our first visit. As soon as we sat down we were bombarded with two carts and two women asking us if we wanted everything on it. We didn't know what anything was, nor could we really understand them, but we ended up selecting a few things we could recognize and a few others, just for the hell of it. For the most part the food was quite good, although my husband enjoyed it much more than I did. My favorite was the shumai and the bbq steamed buns, but that's not very adventurous. My husband loved the calamari and the cilantro-and-shrimp steamed dumplings. I probably will not go back; he probably will. There you have it."], ["Julie L.", "Amazing place. I was impressed with the wide variety and fresh flavors.  The servers were very hospitable. Be prepared for a long wait.  Remember that good things come to those who wait. I really enjoyed the dumplings... :-)"], ["Sasha W.", "Sketchy neighborhood, best Dim Sum in the universe! Other connosiers concur with me. Go early, parking fills up FAST."], ["Aren A.", "Easily the best dim sum I've ever had. The SGV just cannot compare (unless I've been going to the wrong places).Everything is fresh, clean, and not oily/greasy. I usually have issues with dim sum because it's really oily and unhealthy, but Star Kitchen is churning out great dishes.We ordered about 12 plates of food between three people and the bill was under $40.Steamed pork buns, regular pork buns, shrimp and cilantro shu mai, this and that. my goodness!The neighborhood is a bit seedy, but no matter. The food more than makes up for it all."], ["Farooq K.", "Coming from what I consider the Mecca of dim sum (I'm making a bold claim for San Francisco, I know), I was skeptical what landlocked Denver could offer.  Thankfully there is a vibrant Chinese community here (many of which were at star kitchen, a very good sign) that can also prep a mean dim sum.  I noticed a large table of Chinese folks (20!) and they only took items in steam bowls (dumplings, chicken feet, etc) ... And these happened to be the tastiest.  The offerings of fried rice (meh) and other semi greasy items were OK but if I were you, stick to the food in the steam bowls.  You won't be disappointed.  A tip:  Get there before 12pm ... We left at 1pm and the horde had arrived.  Arrive later and be prepared for a massive people mess."], ["Lulu N.", "Long overdue review. Boyfriend and I stopped by here last week on our cross-country road trip as I was craving dim sum. Needless to say, I was very disappointed. As a chinese person myself, I have high expectations when it comes to dim sum. The food wasn't good but it wasn't horrible either; the dumplings were remarkably soggy but I'm at fault since I went there around 3pm. The place only had a few customers in there, yet took them over 20 minutes to take our order.The host, a middle aged man, showed annoyance as soon as we walked in the restaurant. I was appalled at his rudeness. I will give this place a 2 star,  just because the person at the register was somewhat nice."], ["AJ P.", "Great authentic Dim Sum! We barely made it for the Dim Sum (around 2pm) and I was so glad they were still pushing the carts around. However, they stopped at around 3. Great service and the tea is wonderful. I would definitely eat here for Dim Sum again. The prices are average and the quality is good. Worth the drive from Fort Collins, which is really lacking in great Asian cuisine."], ["Phoebe N.", "I have to say I'm  impressed! Good dim sum. Huge selections. The shumai is excellent.  I also like  their taro bun, bbq bun, and fried -rice cake. They have a deal of buy one get one free lobster. Sweet!!! Service is quick. The place was packed on Saturday morning but we got seated within 5 minutes. Definitely go back."], ["Broarquello A.", "Oh my!...I did not think I could find anything close to the food I had in Hong Kong or Singapore here in Denver... I was wrong~This is the closest I have found! Delish!!!"], ["Elisabeth C.", "This is, hands-down, the best Chinese food in Denver. I found out about Star Kitchen from a Taiwanese coworker at my old job, who I affectionately called my 'Chinese mom'. Being a bit of an Asian food (and strange food) aficionado we'd often talk about things like perfectly-cooked chicken feet, or how we best liked sea cucumber, you know, typical work conversation. When she asked me if I'd visited Star Kitchen and heard I had not, she was appalled- and would ask me relentlessly until I finally went.Star Kitchen was not a disappointment. There's not much I can add beyond what other reviewers have said- their dim sum is excellent (and inexpensive), they're known for their seafood- which is all fresh and expertly prepared, and food quality is consistent. I've been here more times than I can count, and I've never had a bad meal.Service can be slow, especially on busy nights, but I've never had bad service. Even if I did, I'd probably continue coming back, simply because the food is so good.Once you come here, you may never want to go back to another Chinese restaurant. Star Kitchen is the closest thing to a Denver 'Chinatown' experience as you're going to get. I miss living in giant cities with expansive Chinatowns (London, Chicago, New York), but the food here is as good as the best places in any of those."]], "Imperial Dragon": [["Mandy R.", "After receiving their menu in the mail and then hearing my neighbor rave about this place, I decided to try it. It's now my go-to for Chinese delivery, and their Thai food is great too! I've ordered three times, and everything has been amazing! Unlike most other Chinese restaurants, the sauces here are not heavy and it's clear that each dish actually has its own sauce. And the spicy dishes aren't just \"hot\" because a bunch of red pepper flakes are dumped in (a big pet peeve of mine). They have actual distinguishable flavors. So far, the mongolian beef is a favorite (the beef is really tender, and the sauce is balanced just right, with a nice peppery finish). The drunken noodles are great too though, and the jalapenos are a nice touch in that dish. Delivery is fast, and the prices are good. I seriously tossed all my other Chinese and Thai delivery menus. This place is it now! An unfortunate side note: steer clear of the egg rolls. Sadly, they're just awful -- all cabbage and absolutely no flavor. Hope they change this!"], ["Molly G.", "This place is the best. Delicious food (we like the chicken lo mein and crab, cheese wontons the best) and super fast delivery. Highly recommended!"], ["Lily S.", "1.5 stars. I almost turned away when I didn't see any other diners in the restaurant, I mean, it was completely empty! We were the first ones for the night. At least the place is clean and the decors are nice, so that earned 1 star. I'm really fed up with the waiter all night long, excuse my language but I can't think of any other word but \"stupid\" to describe him. He spoke both broken English and Cantonese so it was kind of difficult to communicate with him. When we requested password for wi-fi, he gave us two random numbers that of course lead to nowhere. What kind of places give out fake wifi passwords?!!?When I inquired about substitutions, he said no, either the restaurant doesn't do it (but it's unconsiderate not to do it to accomadate people with food allergies!) or he refuses because it'll make his job easier! I do not like him!Then came the food, portion wise it was good and the Pan Fried dumplings were probably the only average thing for the night, thus earning the other half star. We also ordered Curry Shrimp and Twice Cooked Pork, both contain some stinky smelling bamboo shoots, making the food taste un-fresh. Talking about freshness, we're Chinese, and it's stupid for them to think they can fool us with some BBQ pork in place of real, twice cooked pork! I'm sure they just used the leftover BBQ pork for the dish because they didn't sell out. That's unethical, and I'm totally disgusted at the end of the night. Will never return no matter what!"], ["Waldisa M.", "Food was good , but honestly delivery driver took it on himself to take a tip  gave me less change and the soup was tipped over dripping all over the  bag he just left horrible"], ["Shannon P.", "Great food! Great service. Always hits the spot when I am craving chinese food, especially shrimp. Wished it was more popular. I would share this magical experience with them!"], ["Pamela M.", "I love this place!  It's probably one if my favorite Chinese restaurants.  Granted it's far from fancy and the ambiance is pretty non-existent but I'm here for the food, not the decor.  The egg drop soup is fabulous!  Especially when you're coming down with a cold, it soothes your throat and tastes good too.  I guess my favorite dish here is the Spicy Pork in Garlic Sauce - can never go wrong if you order this."], ["Jenaya B.", "Friendly staff, clean, fresh and delicious, best egg rolls, chicken fried rice and cannot go wrong with any of the lunch specials! Highly recommended."], ["Andre M.", "Been a customer of this treasure for over 16 years. It is a fantastic place. The food is always fresh and full of fantastic favor. Service is kind and steadfast. I would reccomend the sesame beef and cashew chicken."], ["Todd D.", "We order delivery from here, and while the food is very average, the speed and friendliness of the employees helped them earn a 4-star from us. Food always arrives piping hot!"], ["Robin M.", "I've eaten here on and off for years.Service is quick, friendly, and efficient, and the food is always good. We've never had a bad dish from the extensive menu. I'm always glad they include free tea.One thing that's a standout is their sesame beef -- but don't order it to go. Fresh out of the wok, it will steam itself in the to-go container and lose the delectable crispiness which goes so well with the hot sweet sauce. The dish is quite amazing when eaten at the restaurant. You can carry home the leftovers and they will be fine. I usually avoid chow mein, but the chicken chow mein here is tasty, fresh, delicate, and satisfying -- really good for an upset stomach, a picky eater, or the non-adventurous, and it's a real crowd-pleaser.The tofu and vegetable soup is simple, elegant, and delicious, plus you can feel virtuously healthy. It's another dish that's great if your stomach is a little iffy. At dinner we usually order from the entrees that come with soup and egg roll, and we ask for fried rice instead of steamed. If we order an entree per person, we will definitely have leftovers that quickly disappear. Mmmm, mmmm."], ["Laura S.", "Best Chinese food in all of denver. Their beef and broccoli is amazing, and their spring rolls are to die for. Also the chefs specials or whatever they're called are just boxes filled with meat. I think I had maybe three broccolis and a carrot. I'm pro that."], ["JT G.", "I'm sorry having been new to the area I used yelp to find this restaurant and thus far most of my dining recommendations from yelp have been dead on.However if this is what constitutes as excellent Chinese food, I won't be eating any Asian anymore.The service was fast and friendly but the food leaves much to be desired.   I had the almond chicken and the Mongolian beef.  Both had very little meat, and was very bland.   I'm not a bug fan of heavy sauce but I like my stir fry to taste like something.After opening the chicken and tasting it, my wife and I ended up putting the majority of it in the garbage as it didn't taste or smell \"right\".Of all the area eateries I would not recommend this restaurant."], ["Victoria B.", "I'm going to be fair, I do like Chinese/Asian food, and, honestly this isn't Denver's Best Chinese, but it is good, and if your in the area it is worth your while. Some of the bad reviews on this place are flat out horribly mean. I don't care how little they know about their food, you do not call a girl, especially a young teenage girl \"slutty\". That is not okay,  your acting like a 13 year old girl yourself, it's flat out fowl and made me entirely disregard anything you have to say, it's also horrible to call someone stupid because they don't fluently speak your language, it took me YEARS to fluently learn French yet when I lived there everyone was very kind to me, they understood that I was learning.  That said the wait staff were friendly to me, and the food was good, very good for that matter, it wasn't as seasoned as other places, but it was still nice. Great if your in the area and need a quick bite. Most people have a \"go-to\" place for Chinese food, and honestly this isn't mine, but it isn't horrible by any means."], ["Jenna M.", "I am a very picky eater when it comes to chineese food. Imperial Dragon is by far my most favorite place to eat. WHen I go to other places I usually dont care for the food much but I can ALWAYS expect to have a good meal here!!! I Love the sesame chicken it is not too crispy but just crispy enough to still have some meat JUST PERFECT!!!! The sweet and sour shrimp is also to die for!!! I think I had one out of MANY visits in the last 10+ years coming here where the waiter may have been having a bad day but the food is sooo delicious and the service was always so exceptional I was able to bite my tounge!!!!!  I love this place and would recommend this place to chinese food lovers!!!!"], ["Kim D.", "As I sit here eating leftover Chinese from a different place (it's a long story), I am reminded how much I LOVE Imperial Dragon. We eat take out from here regularly and we love their Orange Beef and their Pork Lo Mein. Their food is excellent and we always get it quickly when have it delivered."], ["D H.", "This is our go to Chinese takeaway.I have had many dishes, but the ones I always fall back to are the Pu Pu Platter and the Hunan beef.Great food, Great service and really friendly staff.Highly recommended"], ["Sara H.", "Typical Chinese restaurant.  Fast service, call in your to go order and it is always ready in 10 minutes.  However, I am in love with the Hunan Beef!  They only have it for dinner, as a part of the chef special.  so it comes with soup, egg roll and the entree.  It is crispy yummy spicy goodness.  Hmm, I am feeling a craving coming on!!"]], "Pho 38 and Noodle House": [["Stephen T.", "The restaurant name has the word Pho in it but there is literally only one choice for it Dac biet only but over fifty chinese items on menu. sorta odd. Like going to hamburger joint and there are 50 types of sandwiches but only one burger available. I cant speak for the chinese food because I felt like eating Pho but the Pho was Just Ok."], ["Cj Q.", "Transplant from Chicago looking for some phō and this hit the spot.  Vietnamese egg rolls (veggie) were great, not greasy, crisp shell and vegetables.  The large phō was surely a large, boasting plenty of noodles and abundance of steak.  Don't pass this place up if you need to get your phō fix!"], ["Donovan S.", "Go to spot for good Pho and excellent Chinese specialties.I particularly enjoy the Singapore style rice noodles."], ["Leroy D.", "This is a great family run restaurant the atmosphere is casual the staff is always friendly. We've been coming here for years we've never been disappointed and we've always felt welcomed and like part of the family. All the dishes here are great and reasonably priced."], ["N D.", "Quality seemed very low. Not authentic Vietnamese. Egg rolls seemed reheated. Meat quality low. Nice server. More of Asian fusion which is no good if you want PHO. Ordered Vietnamese coffee and was horrible. Came already poured and coffee was really bad."], ["Elizabeth A.", "I want to like this place more, but the food is just a bit lacking. However, what the food lacks, the family here makes up for as they are so sweet. We do come here because it's a bit closer than the Alameda/Federal area, but every time I do, I wish I had just gone to Hong Kong BBQ. Just had their Wonton here again, along with their dumplings, and greens. Their Wonton comes in the Pho broth...It's not terrible, and it's kind of like getting the good of both worlds (not the best), but it's just not real Wonton soup. The Wonton themselves are ok, and the dumplings here are actually really good. Overall, Pho 38 tries to do Pho, but the owners are the nicest Chinese family so it's really a Chinese restaurant. As for their Chinese food, it's pretty good. However, with the close-ish proximity to the great places on Federal and Alameda, I'd rather go there. For a neighborhood asian restaurant though, they do the job just fine."], ["Kate U.", "loved the family run, friendly atmosphere. While we ate probably a dozen people came in that were clearly regulars and recognized by the staff. Homemade dumplings brought me back to my days of living in China. Price, while not quite as cheap as China, were very reasonable. 1 order (steamed) per person at least, and frying these steamed beauties is a crime. skip the spring rolls thoughPho was tasty, good broth, meat is a little meh but overall a great meal an we will be back. A little drafty to sit inside in the winter but perfect for take out."], ["Tom N.", "Pretty average for a Chinese restaurant with passable pho. An extra star for being in our neighborhood and the really friendly service. Very clean."], ["Peter T.", "Pho-king delicious! This place is great with authentic cuisine, mom and pop shop atmosphere and a general quirkiness that I love in a restaurant!I'll definitely start coming here more often!"], ["Nick S.", "Singapore noodles and steamed dumplings were absolutely amazing, flavorful, and super fresh! Not a bit of it was over-cooked and I will be back soon to try some of the other offerings! Great food!!"], ["Pete S.", "Much better than I was led to believe.  Great portion size and delicious pho for a really reasonable price.  Has a great noodle bar type feel to it.  For sure worth a try!"], ["Tomoko K.", "Love this place and the husband and wife team that runs it. We've lived in Sunnyside for about 18 years now. This was originally a \"scoop\" place. And not a bad one either. I was a little worried when they changed formats wondering if they were going to lose their clientele. Well they did. And got a much better one. This place is always filled at dinner time when we get our carryout. The pho was a little inconsistent initially. But they seem to have the \"secret sauce\" dialed in now. Their quality and price can't be beat!"], ["Suzannah F.", "This place is awesome! Friendly, great food and no MSG!! The Pho is the best in the LoHi/Highlands area!!"], ["Aaron W.", "Good solid Pho at decent prices.  Going to go back and try the Chinese dishes as well. Nothing fancy just friendly service and solid food."], ["Ron M.", "went here and got realll aggressive with the boys for a multi course food bender... won ton soup, beef pho, dumplings (3 orders haha), hong kong noodles annnddd something else that was really good too... we fed three people for $50 in disgusting stoner fashioni usually am the biggest hater on pho but this rocked and the wonton soup is the best ive ever had. my new #1 pho joint and 2nd best dumplings in denver so far"], ["Tyler J.", "Ordered beef pho, broth wasn't the most flavorful, the basil in the table salad was old and has black spots all over it. Soup came out fast and hot."], ["Jake J.", "I dig the Pho at Pho 38.  It's consistently good and consistently served in a timely fashion which I appreciate on a busy day when I need a quick fuel up.  Dabbled in some of the other dishes and found them pretty average but the Pho definitely keeps me coming back.  It's just an unassuming strip mall type setting which works just fine.  Room is clean, staff are friendly and prompt and the price is very reasonable.  Definitely recommend Pho 38"], ["Kate G.", "We used to frequent this spot when it was Sing On, the pay-per-scoop Chinese place. It was our guilty pleasure hangover fix. The same owners still run it but they switched to pho. We were craving pho yesterday and the big bowls here totally hit the spot. I had so much leftver from my large pho ga (&7.50) that I could barely fit it all into their tall (and reusable!) plastic takeaway tub. The broth was great and the toppings were plentiful. We even had a whole lime to share. We also split the Vietnamese egg rolls (3 for %4.50) and they were crispy and delicious. Service is very friendly. I'm happy these guys are doing well! It's a great spot close to my house for when I don't want to go too far down Federal, and it's better than the nearby Pho Fusion."], ["Ikaika F.", "Awesome mom and pop noodle shop.The soup was awesome and the pho looked good too. Staff was very nice and they served the food quick.Definitely our new go to restaurant for noodle cravings."], ["Christy V.", "Since moving to Colorado I have learned not to judge a restaurant by its placement in a strip mall. But in this case, I have to say I probably should have gone with one of my other noodle soup choices. The family that owns this restaurant is sweet and so accommodating. We had a lovely time at lunch but quite honestly I was not super-impressed with the food. I would have loved some additional Vietnamese selections besides the pho, which was fine but really not great or remarkable. The rest of the menu is essentially fast food Chinese and that was really not what I was looking for on this day. Inexpensive and filling, however, so that can definitely be taken into consideration."], ["Alisha C.", "Location can be key.. and that is the one reason why this place got four stars as opposed to three.There is no Pho place up in the Highlands where I work. Sometimes during the work week a nice bowl of Pho is what I want, however, driving to South Federal is daunting especially on the cold days where Pho is usually the craving. I am glad that this place opened up and is up to the challenge to fill this void here in this neighborhood. The options are not as varied as you would find at the South Federal joints but they cover the basics. The broth is rich and hits the spot on a cold snowy day. There are other menu items that I have not tried but if you are not in the mood for brothy soup. I will say the people who work they are incredible nice and welcoming. They care about their business and want to make sure you are enjoying your meal. For something in this neighborhood, with a great price tag to match, Pho 38 is not too shabby."], ["Shon R.", "Great Pho! Unfortunately just a little limited in their selection. I wish they would add more options,but it definitely won't keep me from coming back!"], ["Celia M.", "Love the Hong Kong beef stew noodle soup!! Great customer service, warm and nice vibe. No frills, just great food."], ["Kostya Y.", "Ate here twice during my stay in the Denver area. The pho beef noodle is excellent value for money and super tasty. Highly recommended!"], ["julie n.", "I have been here 3 times since my initial review...1)Wonton soup was very good.  I love the wontons but this time there was no chinese broccoliSpring rolls were ok, too many noodles2)Fiance and I both had pho.  It was pretty good.  I added a teaspoon of regular fish sauce and it was perfect.  The combo pho comes with meatballs, rare steak, tripe, and some other meatEggrolls were kinda blah.  Not really Vietnamese egg rolls but not Chinese either.  They use wonton wrappers that are pretty thin so that's a plus.3)I had the combo pho but it didn't come with tripe. Boo!  Fiance had rare steak with extra rare steak.  The rare steak is sliced slightly too thick.Spring rolls were ok, too many noodlesI don't like using wooden chopstix for pho but what can you do.  Overall a great little place with nice people serving you."], ["Portia H.", "The veggie Pho at Pho 38 is quite good. I like that the tofu is steamed rather than fried. Also, they have veggie broth if you would like it, which is nice.The staff at the restaurant are VERY sweet and accommodating. The service is excellent."], ["Frank S.", "The Food: The food is some of the best in terms of quality and price. The cooks and owners are authentic central mountain region Chinese folks. Their Chinese dishes are excellent, large portions that even I had leftovers to take home (whereas usually I have to order for 1.5).My beef was done perfectly with a great portion that is about double of what you get from elsewhere with same price. Broth was also done just right, not too salty or oily, and definitely not bland retaining a good balance of flavor. One sip and you can feel it's nutritious. The wontons are all shrimp-filled and tastes fresh. Pho 38 has become my go-to default place to dine.The Service:The staff was very impressive in their ability to bring me what I want without me asking. Mr. Peter can read your mind. On my first visit I ordered a bowl of beef and wonton noodle soup. That's all I asked (and was charged) for. Peter brought me some hot sauce from the kitchen, a spoon with it, glass of ice water, chopsticks, complementary egg roll (\"You gotta try our egg roll, here's a free one!\"), and a fork with a large slice of lemon cake (\"I just bought this, have a taste\"). Near the end of my meal before I thought I was finished, he brought a to-go kit with everything necessary, including pouch for cake, even a small sauce container for the spicy sauce.More on the service. Throughout my dining time I heard him speak to various customers as if they're all good friends or regulars. The owner came out to say hi and thank me for my compliments, and we struck up a conversation. I'm definitely coming back not only for the large portion of goodness (at $5 to $8), but for the warm reception. These guys know how to do business the old school way.Every restaurant has to push those soda drinks and I particularly enjoyed the way Peter did it. Instead of the usual \"Would you like something to drink,\" he had this slightly excited look on his face and said, \"Hey! We got some soda back there, want me to bring you some?\" I almost said yes even though I never drink that stuff."], ["Gena L.", "I found this place whilst looking for a pho place, then came here and did not order pho. Why? Because the menu is packed with Hong Kong style Chinese cuisine. I ended up ordering the Hong Kong style dumpling soup, which was absolutely delectable. The broth competes in complexity with your finest pho broths, the dumplings were delicious and there was a lot of it. I also shared an order of Vietnamese spring rolls, which were kinda your standard spring rolls, and some crab cheese wontons that were pretty good. My friend did order pho, however, and she said it was fine.... but it looked a bit disappointing. Too many noodles, not enough broth. I am totally going back to this place, and won't even bother with the pho... I am just pleased to find a Northside source of Hong Kong style Chinese food!"], ["Karen C.", "We came for pho but realized it was more of a Chinese restaurant so we ordered Chinese instead! And since they were Chinese, I figured their cuisine would be better. The gentleman running the restaurant was really friendly and I could hear him giving recommendations to the other customers. I ordered the sesame chicken and it was pretty good. My husband ordered the Kung Pao but he thought there were more vegetables than chicken. It's nice to have this option in our neighborhood. Overall service and food was pretty good and we will return!"], ["d v.", "Went on a whim, hungry for pho.I'd say the pho was pretty good, just limited options, like; meat combos, sizes, etc,. But my girlfriend skipped the pho and went for the Pad Thai, which was awful! It looked and tasted like cafeteria asian food. I felt so bad for her, but she wouldn't let me complain and order something else. The staff seemed nice enough. But, I probably won't go back for anything but the pho, and only if I'm too lazy to drive to a true vietnamese noodle house."], ["Broarquello A.", "Small, but incredible service&quality ~ I got their large chicken pho when I was ill and couldn't have found better. No MSG and the taste is amazing!"], ["Jennifer Y.", "I got the family happy-go-lucky vibe as well. The wife came out and talked to my mom in Chinese. (I'm Chinese). She was very friendly and even gave us crab rangoons on the house. That was such a lovely gesture. The pho was pretty damn good. The broth was very flavorful. The Singapore rice noodles were OK. I am used to having char-siu as the meat but this was chicken. The noodles were a bit more \"wet\" than I'm used to, too.The Hong Kong style wonton noodles were good. The wontons were packed with shrimp and perhaps pork? Fried dumplings were very good. Some of the best I've had in awhile.So good food overall. Prices were decent. Owners very accomodating and encouraged us to take our time."], ["Josh S.", "Went for the first time and the pho was as good as most and the service was amazing."], ["Wesley C.", "We LOVE this place - hungry for Pho and wanted something closer to where we live in the uptown area so we took a chance at Pho 38.  The people that work here REALLY CARE about your experience, that the food is tasting good, portions are perfect, water is full, etc.  Either we came when they were all feeling awesome or they just ARE awesome - i'd go with the latter.  The food was excellent, we had pork dumplings (steamed), Pho Combination (small), and pad Thai - all well worth the money and prepared beautifully.Highly recommend this restaurant."], ["Holly E.", "Very good pho and closer to my house than the good pho on Federal. I ordered a small seafood and enough for two meals however they didn't give me as much herbs as I like. I'll know to ask next time. Good broth and seafood was a refreshing change. Service was good as well. The girl working was very nice."], ["Tara M.", "Friendly service. Prompt delivery. Amazing pho. Might have to make this a new Sunday ritual to accompany RedZone."], ["Steven H.", "This place has a warm feeling keeps me coming back. The owners work there and care about the customer, charge reasonable prices and the food is great. The only reason I am giving it 4 instead of 5 is I feel the pho broth is hit or miss. Some days it is as good as any place on S. Federal other days it's glorified beef broth. I can't figure out the logic why it differs so much but for a place 5 min from my house that is so friendly, it can't be beat."], ["Rashad K.", "Got some takeout from here last night and liked what I got.  Egg drop soup was great and so were the singapore noodles.  Definitely just a takeout place for me, good food at a good price.  Next time will try the Pho."], ["Aaron C.", "This place is awesome! The owner is incredibly friendly. He opened the restaurant an hour early to feed us :) I highly recommend this place to anyone who enjoys a well run business with delicious food! I'll definitely come back"], ["Rachel R.", "Not so great anymore.  I used to love their Pho, the last 2 times the broth had no flavor and it was just so so.  I used to order from these guys more than once a month.  Today I called for delivery and she said they no longer do delivery but if I come and pick it up she would give me a free appetizer.  So I get permission to leave work and call back to order and she says \"all I can give you is a free egg roll\".  What is the point of offering a free appetizer if you are going to turn around and say never mind??  The one thing I have never liked at this place is the egg rolls, they just are not good."]], "Golden Village Restaurant": [["Amy W.", "I am blown away by Golden Village!I was driving along Monaco the other day when the pastel pink exterior of this restaurant caught my eye. I initially thought it was a Middle Eastern restaurant because of the architecture, but quickly realized otherwise when I saw the sign proclaiming \"Chinese Food: $1.69 per item.\" As other reviewers have said, it's not the most freshly painted establishment, but even so, I was coming home from work tonight and thought, what the heck? I'm hungry and I want Chinese, so I'll try it.There was no line when I got there, and I was immediately greeted and served by a friendly, smiling employee. I'm pretty sure you can eat in the restaurant, but I elected to take my chicken lo mein + beef and broccoli to go. It was fresh, hot, and under $4 for a generous portion of both items. Golden Village is perfect for when you don't feel like cooking but don't want to spend a ton of money. I will definitely be back!"], ["Jared K.", "Yeah I am very confused how this places is receiving such high reviews. I was very excited to check this place out but extremely disappointed by how bland it was and how low quality it was.It was honestly worse than Panda Express. The chicken was fatty and just hard to eat. I won't be back."], ["Sam V.", "It's incredibly dangerous to live so close to Golden Village. It's definitely a hole-- a hole of deliciousness! I never thought to go in even though I'm a few blocks away but one day my boyfriend and I decided to go in. It's not the nicest place, but you're not there for the ambiance, you're there for the food! I love the \"pay-per-scoop\" idea because you can pay for what you want. There's a great selection, but not many veggie options unfortunately. Uhh, did someone mention that the portions are huge?! If you're around the area, it's definitely worth your time to pass by for a quick and cheap bite."], ["Danny Z.", "I come here once a week. The food is tasty, the portions are big and the staff are friendly and nice. The only thing is that the place needs to be renovated."], ["Daniel E.", "The food and service of this place is exceptional, not to mention the cheap price and the huge serving. I had the schezwan beef and fried rice while my gf picked the sesame chicken w/rice. the beef was cooked to perfection, its tender and flavorful.also, the fried rice was a winner. my gf also enjoyed her food. definitely one of the best gastronomic experience I ever had."], ["Kevin C.", "Can't believe you get so much for so little. Hopefully they don't paint this place so they can keep the prices low"], ["Katharine C.", "Don't be fooled by the sketchy exterior of this place. Take it from me - it's way better than it looks! We saw all the 5 star reviews and figured it would be worth a shot, so we stopped by. The building is decrepit and it looks like the place went out of business, but the inside is nicely decorated and is pretty clean! The food is VERY inexpensive and is served up front. I had the sesame chicken, fried rice, and wontons and was very pleased. Great Chinese food in big servings for a great price. Just get through the doors before you decide to turn away!"], ["John B.", "Why is it that the dollar scoop concept seems not to have spread outside of Colorado? Why would anybody not want to buy food, at a reasonable price, by the scoop? It blows my mind. I've been to as many dollar scoops as I possibly could over the last fifteen years. I'd like to think this gives me perspective. My visit to this The Golden Village was overwhelmingly positive. The food was not the single greatest dollar scoop experience of my life, but it was fresh, hot, tasty, and served with a smile. What more could a guy want out of a quick meal?"], ["Brittany V.", "I was a little skeptical at first, but once I read the other reviews I knew I had to try it. Sure the building may not be in the best condition, but get past the door and you're good to go! The food that I chose was schezwan beef, steamed rice, teriyaki chicken, and wontons with sweet & sour sauce. My total was $8.00 for all this food! What?! That's insane. I figured for that cheap, it's couldn't taste all that great. Well I was wrong; everything was phenomenal! I'll definitely be back here seeing as how other Chinese restaurants charge an overrated amount of money for much smaller portions. Also, the family running the place was so nice, they knew most of the customers by name when I was waiting in line. That's always a plus!"], ["Robert G.", "I was blown away that only three reviews have been written considering this place has been around since before 2001. They were the same then as they are now having made an annual visit or two. Consistency really is the definition of this joint. Same type of food offerings, even the same people. The server lady really is as nice as could be keeping small talk to a minimum and just getting you what you want and on your way.They have egg foo young which seems hard to find sometimes (is that really a Chinese dish?) They also have beef strips  on skewers and all the other usual suspects including Hot&Sour and Eggdrop soup. Are they perfect- naw-  maybe better to hope for the best. I figure if they have passed DOH inspections for as many years maybe they are just doing it right- besides, seems cruel really to rate them any lower because of their consistency and serving up fairly good food all this time. They will get their demerits eventually but sheesh only four reviews now?"], ["Camden T.", "I saw this on yelp and thought it was too good to be true because of the good reviews. I mapped directions to this place and was disappointed at first because I couldn't find it. But after a few minutes of driving around I found it (it's a stand alone building right between the two shopping centers)! I got inside and asked them how much it was and they said $1.69 each item (some were 20 cents more, but who cares). I ordered my food and was surprised with the amount of food they gave! The food was good, but not excellent which was probably because they were closing soon and they weren't that busy. Nonetheless, my two entrees and a side of rice was $5.90 and would definitely recommend this place to anyone! I would compare it to a Panda Express because the foods already cooked and you can sample items. The difference is that you get more food for less money :)"], ["Crista H.", "This place is awesome, cheap, hot food, cheap, good food and did I mention cheap? Got a dish, fried rice, and a drink. And with tax only paid $5.45. Love it!"], ["Mari F.", "Best dollar scoop. The food is better tham the other dollar scoop places. Used to live right across the street and came pretty regularly, now I moved to illiff and 225 and even though there are closer dollar scoop places I choose to come to this one. Introduced my boyfriend to it and he got hooked. Only downsize is they are closed on sundays."]], "Golden Shanghai": [["Shea S.", "Since writing my initial review I've been back here many times, and I sit here now craving Golden Shanghai even though I had it last night. So it's time to give them the full-star treatment.Everything stands from my previous review: family meal is a great deal and the wanton soup is still delicious. My girlfriend and I have had more of their sushi and have to say I'm pleasantly surprised every time with how fresh it is. The rolls often have a few pieces that aren't rolled 100% right, but the freshness makes up for it. The simple cucumber roll is still one of my favs, but the tuna, salmon, and shrimp/cucumber/avocado rolls are all fantastic as well. We are more than happy to have their sushi when we don't feel like driving half way across town for the top sushi places.Although the sushi is nice, it's the steamed shrimp shumai dumplings that is the top draw for us. We get at least an order every time we visit, whether ordering regular dishes or sushi. In fact, one of these days we're just going to order 10 of these as a meal. So tender and moist, and that dipping sauce is like crack!As for regular dishes, we've become addicted to the Mongolian Chicken and the Spicy Basil Chicken. The Mongolian is loaded with flavor including black pepper and perfectly sauteed onions, while the Basil Chicken has the perfect amount of spice with that sharp Asian basil taste. And the portions of both often provide for at least a lunch the next day.Golden Shanghai is definitely our go-to Chinese restaurant, and it has essentially become our comfort food. In addition to the great food they also have very friendly service (one waitress remembers us every time) and a surprisingly classy atmosphere. Yup, we're hooked."], ["mike d.", "BEST place ever! Moved to the neighborhood about a year ago and I'm never disappointed. Combination fried rice is a complete meal in itself. Super fast and friendly phone ordering. I get delivered every time. Same delivery guy, always friendly and I'm never disappointed. Looking at my current receipt I see I've accumulated thousands of points and I have no idea what they're for.  Need to ask.Hope this helps and you enjoy this place just like me!"], ["Roger M.", "Golden Shanghai, has authentic Sichuan food, very delicious, portions are on the a small side, but the prices reasonable. The staff is friendly and speak good English and Mandarin, good place to slow down and have a nice meal. It was very busy, but the staff handled it well. The owners greeted us and we're friendly."], ["Lisa P.", "Second time here - this time we picked up takeout instead of getting delivery. 2 chicken sesame dishes and a chicken lo mein with crab cheese wontons. $45 before tip- just seems high for your neighborhood standard takeout dishes. The food was nothing special. Lo Mein had like 3 pieces of chicken and no veggies just noodles. The sesame chicken had soggy broccoli and carrots with it. It was all just okay. Menu prices listed on yelp are not accurate so don't go by those. Not the worst but not the best. Definitely  going to keep hunting for a better place."], ["Victoria N.", "Ordered pick-up Saturday night. We ordered Mongolian Beef and Sesame Chicken. The order was ready in 15 mins, perfect amt of time for us to get there. $25, a little pricey for take out.The beef: was tasty, spicy, mostly onions. I mean it. It was mostly onions, and maybe 5oz of beef. The chicken: breaded, good sauce, white and dark meat, came with a few broccoli tops. I wish there were more vegetables with the chicken, and I wish for half the amt of onions in the beef. Overall, I would order there again, but not anytime soon."], ["Melanie A.", "Does not taste like authentic takeout chinese. The rice was hard and dry. The chicken was too thick and dry as well. Not the place to go if you're craving greasy chinese."], ["Craig S.", "We go there a lot. The dumplings are better than most  other places we've been to. They also have green bean chicken which is delicious and you can't find it at many Chinese places. The staff's is always super friendly!"], ["amy l.", "Since my first review this place just gets better!  I order delivery from here almost once a week so I've been able to experience the significant improvements in their order and delivery system, which has become very efficient by having 3 phone lines and online ordering.  They'll say the food will be delivered in 30-45min, but my food always gets to me in 15-20min max and it's piping hot and fresh!  Don't get me wrong,  we love eating there but the food is cooked and delivered so fast it's like being there.  I really love this place for its excellent food and customer service and am happy for the owner (who is a genuinely nice man) to see his hard work pay off!  I am a huge supporter of this restaurant and hope you all will too!"], ["T M.", "My favorite roll is the Florida Roll!! The wontons are great, too. I love this place. The sushi is always fresh, the staff is always helpful and the restaurant has a relaxed setting. Highly recommend this place."], ["Kokass A.", "The food here and the service are great. The wait staff are friendly and attentive.  The food always comes out hot and the serving sizes are just right - perfect for some of their more untraditionally shaped and sized dishes.  I've tried nearly everything on their lunch menu but I think I like some of the standard fare:  sweet and sour pork, twice cooked pork, lemon chicken, beef and broccoli, and fried rice. I like their take on \"Mongolian x\" it has lots of white onion and green onion and just enough sauce. I haven't tried their sushi yet, but that is just a matter of timing for me.  This place definitely warrants a visit - their lunch specials are nice and, well, if you go for dinner I suppose it never hurts to have some left overs, right?"], ["K M.", "We have eaten here several times. I have had better Chinese food but I have also had a LOT that was much worse. I want to order off the special Chinese menu. Supposedly the best dishes are on this menu. We will be back"], ["Kimberly B.", "Have not been disappointed once!First time here, \"hey this is pretty good!\"Second time with a cold \"Thank goodness for wanton soup and cucumber rolls\"Third time \"Omg I love their Sushi!\"And many more, lost count.Vey unique style being a Chinese restaurant with sushi but oh so good!My favorites are the Mongolian Chicken, Shrimp wanton appetizer, Wanton soup, and most of their sushi rolls. The Ginger is so fresh I have to have a piece with every roll and end up ordering more.Sushi is so flavorful and refreshing taste and does not leave you feeling terribly full.One thing we did notice though every now and then, the Sushi rolls could be rolled tighter, sometimes the start to unroll when you pick them up.The service is wonderful they are always so nice and remember who you are. I would have never picked this little Gem hidden away if it were not for my boyfriend.This is now one of my favorite places to eat!"], ["Jamie R.", "Got a bunch of sushi delivered. Fish was NOT fresh - none of it had much flavor and all of the rolls fell apart. Disappointed."], ["K J.", "My wife cannot get enough of their Thai basil fried rice, she demands I drive here every chance I get, even if we are both getting off of long shifts and just want to collapse in the floor. My daughter would eat the Miso soup(extra extra tofu) every day as well. The wife also swear by their \"spicy\" dishes, and it's hard to please her on that front."], ["David C.", "3.5 stars is the consensus review for this restaurant, and I agree.  Though mostly Chinese in nature, they also have some other Asian dishes, such as Thai, Vietnamese and even a separate sushi menu.  While I've not tried the sushi yet, I'd like to, but I usually wind up with one of the Chinese stir-fry or noodle dishes anyway.  Food is freshly prepared and healthy, and you can tell the quality is good.  They are usually pretty fast, but you can certainly sit and enjoy your meal in the larger-than-expected dining room.  Parking is fine in the strip mall that this place is part of, so that's no trouble.  Good solid neighborhood place."], ["Min-Ru G.", "Decent Chinese restaurant for Denver. Has both mild & spicy food. Great for family and large groups. Decent portions of traditional dishes. Large restaurant. Easy to find parking."], ["Riza H. C.", "Friday September 13th 2013.  Things was so hectic and I was so tired to cook, let alone think on where to go etc etc.  So since we are in the neighborhood, we decide to give Golden Shanghai a try for  Dinner.  At the time when we arrived, this establishment was packed with other patrons.  Is this a good sign?  I do hope so.  That evening was about 19:00hrs ish.  Hubs mentioned to me, that this establishment was decorated with all their \"Achievements\" Pictures and Awards when he noticed it walking thru at the Entrance of this establishment.Table # 11 :We choose to seat at one of the empty tables and chair, in between the booth seating and the seats where can fit more that 5 people at one seating.  There are several severs that evening, busy with the Peak Period rush what nots.We were given the Main Menu aka \"The Americanize Menu\".  Took awhile for our server to give us water to our table.  Then came our MAIN Server.  Her name is Fiona.  She comes from Sarawak, and we exchange several conversations.  She also give us the CHINESE MENU since we ask if there is something \"SPICER\".  When we compare both Menu, nothing stood out, though I cannot deny there are some items in the Chinese Menu and some items that are NOT in the Main Menu.Hubs opt for to have Coke Cola ($1.50) for his beverages while I just opt to have water.  From the Chinese Menu, I opt for, I was given a choice of soups.  So I opt to have Egg Drop Soup since the rest of the Soup in this establishment contains Pork.  The Egg Drop Soup though hot, nothing fancy, nothing spectacular, was just A-OK.  Hubs opt to have Beef Curry ($11.25) while I opt to have Gan Gou Beef ($12.95) aka Sechuan Stir Fried Hot Plate Beef.  We specifically opt to have our options to be EXTRA SPICY but it came UNDERWHELMED and DID NOT WOW us as much as we were hoping for.Hubs Beef Curry comes with Bamboo Shoots, Carrots, Red Pepper, and Onions stir fried with a SPICY Yellow Curry Sauce.  Mine comes in a BLACK HOT Plate Of Beef, Fermented Beans, Onions, Jalapenos and Bell Peppers.  It DID NOT comes Sizzling, but oh well since its more like STIR FRIED BEEF.  My Main Entree tasted more like Sweet Beef, sprinkled with Red Pepper Flakes and some salty and sour note from the Fermented Beans.  Definitely Disappointed with my order.  *Sigh*Hence the conclusion, the FOOD was SEMI-OK, its more like a 2.5 to 3 GENEROUS Star review here and the evening Dinner was $35 with tips and tax.  The service given by our Main Server, Fiona was 4 stars.  Maybe we ordered the wrong items from the Menu.  To return MAYBE BUT NOT IN A HURRY.  Sorry Golden Shanghai.@202/2013"], ["Patricia N.", "My uncle loves this place!  Initially I wasn't a fan but writing this review has made me think of this place in a more positive light.  It was the first time I've ever tried beef tendon.  I wasn't too keen on it initially.  But after reading about the held benefits and getting over the texture, I came around to it.  It has a mouth-feel of fat (think pork belly if you have to) without the greasiness.  My uncle said \"gummy bears,\" but that wasn't going to ease my nerves.   It's also 99% fat-free and high in protein.  Appetizer:  Spicy Tendon  (There's a nice sichuan pepper kick that leaves your mouth tingling afterwards.  Very unique!)Sichuan Cuisine:  Double Salted Pork (Pork belly at its finest!)Stir Fry:  Stir Fried Beef Tendon  (Exquisite flavor but I think the texture was a bit more than I could handle.)"], ["Little R.", "Great food...love the basil eggplant...authentic Chinese food...trying new dishes every time I go....most dishes I have tried have been really good...so far there have been two dishes that I was not ecstatic about...the honey chicken and the crispy fish but other then that I definitely recommend this place"], ["Derek H.", "Service was excellent.Prepared dishes were great and priced fairly.Sushi was plain."]], "Man Wah": [], "JJ Chinese Restaurant": [], "Uncle Joe's": [], "Super Star Asian Cuisine": [], "New Peking Restaurant": [], "Hong Kong Barbecue": [], "Hong Kong Cafe": [["V L.", "Okay, so yes- the food here was great * but*  I no longer go because I have lived in this neighborhood for 3yrs now and this place has changed it's name 4 times now! This scares me because the menu items remain the same. This makes me think that they could (a  keep on being shut down by health dept then reopening under a new name(b Simply some type of tax scam going onIt could be anything but I just don't feel very settled with the constant name changes, very suspicious! I'll skip on this place here on out and trust my intuition."], ["Lily S.", "Depending on what you order, the portion size varies! We couldn't help but were all jealous comparing our plate sizes to those at the table over. Curious at the same time what they ordered because it was pretty obvious we're Cantonese and they're not, lol. There are a lot of fried foods on the menu and I can see that being an appeal to the business. We only ordered one deep fried item and that's the Shrimp Toasts appetizer. It was definitely over-fried or re-fried in old oil - did not taste very fresh!The rest of our orders included Beef Brisket noodle soup, Baked Tomato Rice with Pork Cutlet, and the HK Ice Milk Tea were all just fine. Actually, it's easy to make all of these at home. This is HK's version of fast food, I guess. For that reaon, Hong Kong Café does a good job sticking to the mission. I just prefer really good stir-frys in a wok that I can't replicate at home easily."], ["Jamie C.", "The only restaurants of it's kind in Colorado. This restaurant is based on cafes found everywhere in the greater China, especially Hong Kong, Macau, and Guangdong. These places are called Cha Chaan Teng, literally tea restaurant. Here you can find, quick, cheap food, awesome drinks and a western twist. You know they are legit when everyone who works there speaks Cantonese. ;)To start, it is very popular to order Hong Kong style milk tea. I never thought I'd see this anywhere near where I live for a while but bam, of course they have it here! It's known for it's very strong tea flavor and when mixed with condensed milk, makes a creamy, smooth and aromatic drink. This can be served hot or cold.To take it to the next level, you can order something called a Yuan Yuang and that's a mix of coffee and tea. You will need to sweeten this on your own. I found it best with condensed milk.On a hot summer, the drink of choice is simply lemon with water. It's called Ling Mut, Ling stands for the LingMong (Lemon) and Mut standing for Honey. This is usually served cold but can also be served hot.Now onto the food, some must haves for the first time:-Wonton Noodle Soup. They do an awesome job here and if you want to reach the next step of really experiencing the culture, get the egg noodles as lo mein in oyster sauce. This is a unique and fun way to eat it. -Beef Brisket Noodle soup with Ho fun. The beef brisket is sooooo tender and maybe I'm just biased to the whole soup and noodle thing but we live in Colorado! It's a must!-Gon chaau ngau ho, which translates to Stir Fried Beef Flat Rice Noodles or Beef Chow Fun is an all time stir fry noodle favorite. You can actually get this at all the traditional Chinese restaurants like Hong Kong BBQ, New Canton BBQ, Star Kitchen, etc.-Baked Rice/Spaghetti. Here's where the western twist comes in. There are lots of different sauces and different meats you can get with it too. This makes me think about my childhood. I love the black pepper sauce, but fair warning, it's really peppery. I'd start with something simple like the tomato sauce and maybe pork chops.-TOASTTTTTTTTTTTT. This is a must must must must try! There's a list of variations, I'd start with the one with peanut butter, that's the standard or just simply toast and butter with condensed milk.Also, you'll notice that on the menu, they have HK style sandwiches and Instant Ramen for a really cheap price. These are very traditional cafe foods. The HK style sandwiches are mirrored after Western breakfasts, usually consisting of eggs and ham or whatever Western meat they have cooking. Also the instant ramen is not cooked the way packages say, it usually includes some sort of meat, ham or spam or something and eggs. A very homey way and the only way I make my ramen. Enjoy! I know I'll be back and hopefully I'll be lucky and miss the rush."], ["Michael S.", "I love this place for Lunch....Great specials and it's so fast!! I plan on trying the HK style sandwiches, baked spaghetti and the Toast....The only downside is delivery....I will eat -in or choose take-out from now on....just saying....."], ["Claudine M.", "I haven't eaten a lot of Hong Kong style food. But it was blown away on how good this place was! The restaurant itself is clean and can get busy during lunch hours and such. The staff is super nice as well! For the food, my friend and I tried the HK milk tea, flat noodles with brisket, salt and pepper tofu and salt and pepper chicken wings. The milk tea was delicious. Just the right amount of sweetness and great tea flavor (you can tell they brew/seep it and not just use powder). The noodles were great, I love the prices of brisket, so tender and they remove most of the fat as well! Makes me feel better haha. The tofu was oh my goodness, one of my favorites. Crispy and not oily with awesome flavor accompanied with chopped peppers. The wings were nicely cooked and seasoned too. I was surprised on how good everything was actually, and I love how it seems like it was cooked healthier than other places.I can't wait to try more of their food! :)"], ["Anna Z.", "Moving from California to Denver for school, one thing that was starkingly lacking was good Chinese food. Colorado generally has decent Vietnamese and Korean food but I've only ran into a handful of good Chinese restaurants and most of them are dim sum or Szechuan. Therefore, I was soooo excited to see the grand opening of Hong Kong Cafe on Yelp. I immediately bookmarked it.I finally had the chance of trying this place out with my friend today for lunch. When we arrived, there were only 2 other parties but soon after, the entire place filled up and there were alot of people getting take out as well. The owners were very friendly and were able to speak Mandarin which is rare in Colorado. I ordered the Hong Kong Milk Tea which definitely has a unique taste that is very different from your usual Taiwanese milk teas. It's almost like an acquired taste at first but I absolutely loved it here. I got it iced and it was a very decently huge portion. My friend and I shared the flat noodle with brisket and black bean sauce, the fried tofu, and the black pepper and salt chicken wings. The total came out to ~$40 but we had a lot of left overs and were very satisfied.The noodles were perfectly seasoned, had just the right amount of sauce. It could have been spicier tho. The meat might look weird at least and kind of life tofu but they were so tender. The tofu was delicious! They were perfectly square, cripsy on the outside and delicate on the inside. I have no idea how they cooked it. I also loved how they sauteed it in hot red and green peppers which were delicious. It was supposed to come with either steamed rice or fried rice but they forgot to give it to us. It was fine bcuz we were stuffed by the end. The chicken wings were so cripsy and delicious as well! The service was great and they call everyone hun or honey and really try to get to know their customers. They're going to have great buisness because nowhere else in colorado can compete with their type of food. Finally an authentic Chinese place here and I am so happy!!!1"], ["Saydee X.", "My sister has been to this Restuarant before and said it was okay. But I decided to wanted to try since there's not much Hong Kong type of cafes in Colorado. Since I was in the area why not right?The Restuarant is located in a small plaza next to a few other shops. It is a pretty small Resturant maybe with about 8 tables. The decor is pretty nice and simple, gives a very fresh and relaxing feel to it. The walls are a lavender color. It kind of reminded me of Chinese  cafes in LA. We ordered the Hong Kong style milk tea, fried calamari, wonton noodle soup, and the beef brisket noodle soup. The Milk tea was okay, definitely not the best I've had maybe because I'm comparing it to LA quality. The fried calamari was average, it came with a spicy mayo sauce which is a good combination. Wonton noodles was actually pretty good. The wontons was a shrimp filling and it was really good! I think the noodles wasn't that great, if only they would put fresh egg noodles in it, it would be amazing!! Same thing with the beef brisket noodle soup, the dish would be better with fresh noodles. Beef brisket was on point, it just melts in your mouth. Overall I give it a 4 star because this is the closest thus far to LA quality Chinese food in Colorado. I guess this place will do for now until Denver slowly gets more and more diverse in the food market! I would come back!"], ["Charmaine K.", "It's 12:30 am and why am I writing this review instead of sleeping? Because I do not want to waste any time telling everyone how great this place is. This place makes me feel glad that I live where I'm at because of how close it is to the restaurant. Sounds crazy, I know but I'm bias. Being born and raised in Hong Kong, I've have always missed the Hong Kong style cafe in the US. Even living in Hawaii with a large Asian population, I had not found a place comparable to this. Let's start from the beginning.I just so happened to drive by this place on my way to the Mexican bakery in the same strip mall. Attracted by its name \"Hong Kong Cafe\", I slammed on my brakes so hard my bf almost got whiplash. We already had dinner but I just had to go in and grab a menu. I was oohing and ahhing when I was reading through the menu, and squealed with excitement when I saw baked pork chop rice on it. Wasting no time, we met up with two friends for dinner the next day. There were so many things we wanted to have but I just had to do the baked pork chop rice with red sauce. My bf ordered baked seafood rice with white sauce. One friend also ordered the pork chop rice while the other had beef noodle soup. We also had chicken wings as appetizer. For drinks, we had Hong Kong style milk tea and milk tea + coffee. Now let me warn you, if you've never had Hong Kong cafe style food, it's a little different than other Chinese food you've had.  Yes they have sesame chicken on the menu, and I'm sure that's good too, but that's not why we're here. Hong Kong cafe food is a little bit of a mix between Chinese and western (fusion, if we're getting fancy here). The red sauce that comes with the pork chop rice isn't exactly a marinara sauce. It's a little sweater and thicker, with cheese on top and onion mixed in. The milk tea doesn't come with sugar; it's a little more bitter than your normal tea, and you'd add sugar to the sweetness of your liking. The white sauce is not exactly cream sauce you'll have at an Italian place either. But I promise you, everything is tasting as they're supposed to. They're so good, all 4 of us went back the next day for lunch.You heard me right.... in less than 18 hours, we were there twice. This time, we tried the fried tofu as appetizer (crunchy on the outside with a yummy soy base sauce on the side), udon with black pepper sauce (amazing), the seafood tofu soup (so yummy), and baked chicken rice with garlic sauce (can anything be too garlicky? I think not!). In addition to the milk teas, we ended the meal with some delicious red bean ice cream drink dessert. Seeing a trend here? Everything here is awesome, I don't think you can go wrong ordering anything. Their prices are more than reasonable and portions are great. Pork chop rice was about $11 and you'll really have to work at it to finish it in one seating. It actually lasted for 3 meals for me.Besides from the friendly service from our waiter, the owners also came out and chatted with us. He was super nice and friendly, explaining to us his process behind some of his food. There's the quick way of making food, and then there's the right way. They're definitely doing this right. If you want authentic Hong Kong cafe style food, look no further, they got it right here! Actually, if that's not what you're looking for, you still need to go and give them a try... you'll love it!"], ["Annie G.", "Grand opening 5 days ago! New Hong Kong spot, taking over what was previously Tumrup Thai. I stopped by for dinner with my mom, so we only tried two dishes but so far so good! Will have to visit again soon. We ordered the beef curry, which is ok... and the pork chop baked rice with spaghetti sauce, which was bomb! Hong Kong with a western flair! We also ordered the red bean ice drink with ice cream. They forgot the ice cream at first and when I was done with the drink, I saw another table get theirs with an ice cream scoop on top. I asked them why mine was missing and they quickly took my drink back to fix it. So unfortunately, my photo doesn't show the ice cream but you can picture that vanilla goodness on top!"], ["Trey C.", "Great place and service, I PROMISE TO UPDATE YOU AND TRY THE TRUE HONG KONG SPECIALISTS NEST TIME! I have ordered form here a few times and it has always be very nice. Fast delivery, good service, and always hot and fresh !I had: - udon noodle- sesame chicken - Sweet sour shrimp - Broccoli & shrimp - Sesame beef"], ["Annie C.", "A TIP on ordering TO-GO: don't order when you get there, you'll be sitting around for 20-25 minutes for small vegetable egg rolls. CALL AHEAD, or use grubhub. You've been warned. :)I went back to pick up some milk tea and vegetable egg rolls today, and my sister wanted some chicken wings too, so we ordered that as well. We didn't call ahead and ordered when we got there, and the food took 20-25 minutes to come out!! I was extremely upset because all we ordered were three dinky vegetable egg rolls, some chicken wings, and milk tea. There were two parties that came to dine-in after us and they both got their appetizers before us ... What? The milk teas took around 15 minutes to come out, which was also confusing. I would be even more upset if the dinky vegetable egg rolls weren't so delicious!! The wrapping was really light and crispy, and the filling was hot and flavorful. The milk tea was additionally tasty. It had a really bold black tea flavor and was not too sweet. I think my sister liked her salt and pepper chicken wings. Though, the wings didn't look like they were cooked all the way inside. Kind of creepy.I still like this place, though, because their food is incredible. They just need to learn how to prioritize. IMHO. (Am I hip for using an acronym?)"], ["A A.", "Shrimp Rice Noodles Made perfectly from the Shrimp to the noodles. Hot and Spicy Lunch Special with generous portions of fried rice and perfectly made/Flavored Fried shrimp. Cheese wontons: Perfect! Ill definitely order from here again."], ["Stephanie P.", "Everything we try here is top notch and authentic. Im half chinese and am not a fan at all of americanized chinese places like pf changs or panda express. The west lake beef soup here is one of my favorites, as is the Hong Kong style French toast. Came here with four friends and all anyone could say as they ate was \"BOMB.\" This is my third time coming here since Halloween. Service is fast and friendly as well"], ["Starr L.", "Yay!! Love this restaurant that just replaced the old Thai restaurant. They have lots of varieties on the menu to choose from. I ended up with the beef tendon noodle,  which had a gravy laid over crispy egg noodles. Normally,  I would expect a high level of salt,  but they had just the right flavors in it. The beef tendons were tender and delicious. I accompanied my dinner with the red bean drink,  so good. Heads up,  come early,  this place can get busy so you do want to get a seat,  it's not that big,  but it's nice and family ran!  Well have to be back!"], ["Mark T.", "Inspired by the Cha Chaan Tengs (or \"tea eateries\") so popular in the Chinese region for which it is named, Hong Kong Cafe will both surprise (\"What the heck is that doing on the menu?\") and delight (\"Oh wow, this is so yummy!\") you at every turn. And you'll love it.A Cha Chaan Teng is, in a very broad sense, similar to an American diner - a casual restaurant with a large menu catering to those wanting a quick but still tasty nosh. And Hong Kong Cafe is no exception. Begin with some Yuanyang [equal parts coffee and tea], or a nice tall glass of shaved ice with evaporated milk and fruit chunks (or cool grass-jelly cubes, or sweet 'n' squishy red beans) while you peruse the menu. Mmmm, they have borscht - and it's very good - but do be advised that the kind popular in Hong Kong is tomato-based and tangier than its Russian counterpart. Or how about a Spam and egg sandwich? A plate of fried calamari? Some toast with condensed milk and peanut butter [mmmmmmmmmmm]? You weren't expecting any of those were you? And the hits just keep on coming with the main courses.Ooh, doesn't some baked spaghetti sound good right now? And you're in luck - Hong Kong Cafe offers it with no fewer than five sauce options (including chili/black pepper, rich cream, and oniony garlic) as well as your choice of pork or chicken. Another great selection is the slow-braised beef brisket in curry sauce over steamed rice - my mouth is watering just typing that! Meanwhile, seafood lovers (among others) will go agog for the fried fish cutlet liberally drenched in creamed sweetcorn. And we can't forget the duck or pork noodle soup with pickled Gai Choy [mustard greens], or indeed the \"Western-style\" ketchup fried rice either. For the more conservative palates, there are of course plenty of sweet-n-sour/happy family/General Tao's-type possibilities too. But don't let my gushing about Hong Kong Cafe sway you - try them yourselves!"], ["Carol N.", "Authentic good Hong Kong cafe style food. We ordered too much for two people but hey, nothing wrong with having leftovers."], ["Louis C.", "Unassuming hole-in-the- wall Chinese diner in a strip mall. My favorite Chinese place this side of town....outside if Federal and Alameda area. The owners have definitely brought over a little taste of the Hong Kong street fare. Like their HK style sandwiches...nothing fancy, just simple toasted sandwiches with simple ingredients. We sampled their steamed dumplings, which were decent. The stir fry beef noodles was one of the best versions I've had. You must get the salt and pepper tofu...it is my new favorite tofu dish....a little sweet, a little heat. Lastly, I will now always get the red bean ice drink. It's its own refreshing libation.Limited seating, but its worth it if you have to wait."], ["Summer X.", "Was a fan to this restaurant before . Have ordered 3 to 4 times delivery and always recommend my friends go there try their fried dumpling . But today while I order online like usual . It's  make me don't ever want go this place anymore . Ordered a rib eye steak and a ham and egg sandwich . Both of the meat are very old . Steak is hard to swallow cuz the meat is overcooked . No tender at all !! Then I ended up to call them give them this feedback after few bits cuz it's really taste bad. The girl pick up the phone says we can bring the food back and refunded the money but she is in a mood on the phone . What's more horrible happened is while my husband bring the food back to the restaurant same time He ordered a red bean ice cream to go . The girl work at the restaurant says she don't know if she can take our order anymore ?? It's cuz we returned the bad food ? So we should just take it whenever the food have a problem at this restaurant ? Bad service ever . Yes some of your food are nice but if you want make your business last long you should treat customer good . people need good service too !"], ["Qiongxiao Y.", "I have to say this restaurant has been very good at advertising but I think it has been overrated from what I read. It is true there is no such cafe that provides exclusively for Hongkong food in Colorado . Truth is, you can actually get most of the stuff in most dim sum places. Besides, the taste is not as good as it is said. Service is OK.  Price, a little bit higher than expected. I enjoyed the strawberry milkshake and the stir fried rice noodle. The wonton noodle is a big letdown. It may take a long time before I make the second visit."], ["Mylee K.", "Awesome!  New place.  Read the reviews on YELP and the top reviews are accurate...this place is special.  The food is fantastic!  I had hot and sour soup, sweet iced lemon coffee, and salt and pepper tofu.  My husband had spicy chicken wings, papaya milkshake, and the beef brisket noodle soup.  Nothing is greasy, oily or overcooked...super clean, distinct flavors.The hot and sour soup is now my favorite in Denver, and it's vegetarian.  Perfect.  The salt and pepper tofu is extraordinary -- light, crispy outside and molten goodness on the inside.  FRESH, crispy veggies, perfect amount of heat with the jalapeños.  Their cold, sweet lemon coffee is to die for!  This will be my morning coffee for the rest of the summer.  It's incredible.My husband loved his choices, too.  Especially his shake which had the childhood flavor of Orange Julius but in a much richer, creamier, thicker medium.  Service is friendly and gracious.  Very helpful, very charming.The cafe itself is pretty, modern, and sparkling clean (including the restroom).  Not a place we enjoy to sit down to eat, though, as it's totally open (cafeteria vibe) and every conversation becomes everyone else's conversation.  Grabbed a take out menu, plan on returning frequently, and fully intend to try pretty much everything on the menu."]], "Szechuan Restaurant": [], "Little Dragon": [["Brandon G.", "What a fantastic local Chinese restaurant. Been looking for a Chinese restaurant like this and most places in Denver fall short in a few of their dishes. Little dragon has not disappointed! Their cheese wantons come with house hot mustard, their entrees aren't overly greasy and have a lot of flavor, and they even offer fried rice as an option for your side of rice. Come out of my way to drive here all the time now since I live too far away and am impatient. Give them a try! I hope they find a great new location since they have to move out of the strip mall. They will bring lots of traffic wherever they land in Denver- especially since their takeout volume seems so high! Hopefully they stay close.Oh as a bonus, this is a gay-owned restaurant. The owners are so friendly and courteous! They were handing out tea and cookies while everyone waited for their food on a busy Friday night."], ["Jason G.", "Super Disappointed!!!After reading a series a good reviews, I was willing to take a chance on take-out. Sadly my search for decent Chinese food in Denver continues. I am totally shocked by all of these positive reviews! Is it possible that most have never had really good Chinese so this is all they know to be...? I ordered Bbq pork fried rice, Wor Wonton soup, and Triple Delight Chow Fun so I got a variety of dishes. The soup was watered down and quite bland. The veggies were fresh and crisp, but this soup totally lacked flavor. The bbq pork fried rice was awful! The pork was dry, unseasoned, and totally flavorless. The only highlight was that it wasn't oily or greasy, but it also didn't have much taste. And that's plain sad. What's better than a yummy fried rice?!? This isn't  the yummy kind! The trend continued with the triple delight chow fun... The noodles were dry, mostly stuck together, and appeared undercooked. Again this dish was so incredibly bland all I could do is laugh or just drown it in soy sauce. I choose to laugh and just stop forcing myself to eat this horrible dish. I'm not sure if I am missing something here, but Chinese food should be savory, salty, and flavorful. This food was just the opposite-- dry, bland, and totally lacking of any flavor! Sadly in this town of many great restaurants and cuisines, finding a truly good Chinese place is a challenging task."], ["Kimberly I.", "I should just tell you right now, I am pretty much an expert when it comes to delivery options around Denver.  I have probably ordered from everywhere that delivers at least once.  When I am not out on the town trying new restaurants, I still want to explore Denver's restaurant scene, and what better way to do that then on your couch in your underwear!  Though I have not tried to call and bribe to see if these calls will deliver in caphill, ordering from here is a must when I am my friends house in mayfair. The staff is super friendly, they can tell you what you ordered last time, and they are happy to make suggestions on what you might like to try that is new! Their potstickers are delicious and come in a chicken version.  I like this soooo much better then pork/ I don't find it as sketchy as some of the undecipherable meat that comes in dumplings at other places.  It just feels safe here. Their salt and pepper shrimp is also a favorite of mine.  Something I would again, never order because I would expect it to show p soggy and tastless... but these golden crispy fried shrimp are something from chinese delivery dreams. I intend to explore the menu more, but if you have not tried this place out, you must explore.  YUMMMMMO!"], ["Lauren B.", "Little Dragon is great takeout Chinese food.  We just moved into the neighborhood, and in the process of unpacking, we needed some easy dinners for a few nights.  Little Dragon is located in the strip mall in the parking lot of King Sooper's.  We walked in on a weeknight and saw two patrons waiting for to-go orders.  The kitchen was hopping and those guys were working hard!  The man at the front who manned the cashier was incredibly friendly.  He said he'd be right with us, gave us a few minutes to look over the menu, and even made a few recommendations.  One of the women waiting for her order recommended the Kung Pao Chicken, saying it is her go to meal as she lives nearby.  We ordered the orange chicken, kung pao beef, and an order of crab wontons and went for a short walk.  We were told our order would be ready in 10-15 minutes...and it was!The results?  The portions were absolutely huge--both my husband and I had leftovers for the next day at work.  The quality was delicious, for Chinese take out food.  It's not going to knock your socks off, but it's legit.  Greasy, yes.  But what would you expect?It sounds like King Sooper's is their \"landlord\" and they are unsure about renewing their lease.  Really, King Sooper's sounds like they're being the bad guy and hurting this small business.  I'm rooting for a compromise because I'd like to continue frequenting this joint.  Sending good vibes their way!"], ["Laura A.", "Still a great choice for take out Chinese.  I called and ordered food and by the time I got there (and I live just a few minutes away) my food had just been packaged up and was waiting for me. They're friendly, courteous, well organized, and the food is good. An order of any of their entrees is enough for two meals for me.  I really hope they don't leave the neighborhood!"], ["Tiffany N.", "Hi, my name is Tiffany and I'm a recent food delivery addict. As it turns out cooking and/or leaving the house to go to a restaurant is nigh impossible with a toddler and a newborn. In fact most days in that first month home from the hospital I was lucky if I made myself presentable enough for a delivery person. Sad trombone. But, hey there are some silver linings to this cloud. For one, I'm back to a reasonable person again and two, Little Dragon delivery.Little Dragon offered everything Sir Nicholas, Little Man E, and I could want from Chinese dinner. I ordered a lot from their menu, seriously a lot of different things because of how often they delivered to us and I never found one I didn't like. Couple that with really good prices and seriously fast delivery and I'd say that Little Dragon has made a life-long fan out of the family.So thanks, Little Dragon, for being there through the good and bad. You'll be hearing from us again soon. Real soon."], ["Dave H.", "My order arrived completely messed up, I didn't get what I asked for and ended up with a bunch of stuff I didn't want.  The problem was made worse by the fact I called them as soon as I realized but the restaurant had closed so no one would answer the phone.  I called in the next day to talk it over with them, only to be yelled at because I didn't call soon enough!  I explained everything really well to them - or so I thought.  Turns out they have just decided to ban me from delivery.  Very disappointing, screw these guys."], ["Roger S.", "This Little Dragon roars. The food is consistently tasty and the service is friendly. I appreciate the little touches like offering hot tea or water while you wait for your take out order. The menu is organized so you can pair any preparation with the protein of your choice. The combinations are endless and we like to try something new each time."], ["Wookie R.", "This place is amazing!!!Definitely will be ordering from there again Sesame chicken was on point"], ["Amelia Y.", "This place is flawless. It's our go-to when I can't be bothered cooking or when I'm feeling lazy (often). The steamed dumplings are delicious. They do an amazing Singapore noodle and tonight I nailed a Drunken noodle and my world shifted on it's axis a little bit. It was perfect and I'm already wondering if it would be social irresponsible to pre-order dinner tomorrow night from them this evening.The noodles are fresh, the flavors bold but not overwhelming, the meat and vegetables on point. HUGE bonus points because no matter who answers the phone, delivers the meal or hands me my take away when I pick it up, they are always so polite, friendly and cheerful. My day might have been rubbish but Little Dragon is a little ray of excellent service sunshine."], ["Nicholas N.", "Ahh, finally I've found the takeout place I've been looking for.  The BBQ Pork fried rice is just right.  I love the pork, it's not rubbery like a lot of places and tastes rad.  The hong kong noodles are really really good and the sesame dishes are all spiced well to have just a tiny bit of heat with that sweetness.  Frankly every dish I've had has been top notch.They deliver fast and they do it with a smile.  I am absolutely pumped to have found this place and recommend it to all."], ["Sue R.", "I love this place!! They will make my orders gluten free to order!! And it's always good with quality products!!!The owner and folks working there are very friendly and welcoming!"], ["Todd L.", "Great service, great food. The are always quick with delivery and the food is wonderful."], ["Matt P.", "Been in Denver for around 4 years.  I made it my personal mission to find a great Chinese takeaway.  Mission accomplished!This place is fantastic!"], ["Elizabeth O.", "Solid. Our standby meal every Friday night. We live in the neighborhood and rely on Little Dragon to feed us for at least one meal a week. Our son is addicted to their Singapore Rice noodles. They are flavorful with a kick of spice.  I like Broccoli chicken, the broccoli is crispy, not soggy and the sauce isn't thickened with cornstarch.  There are plenty of gluten free options, and the price is right.  Give them a try."], ["Daev B.", "Not perfect, but very good. I am om a neverending quest to find decent chinese food in Colorado and find dissapointment more often than glory. Everything here is well made, not overly greasy. The veggies are fresh. The chicken is clean and not gristly. It is take out or delivery only. Solid choice in the area."], ["Chuck S.", "Little Dragon has become my favorite Chinese restaurant. They have some of the best Chinese food in Denver. The portions are generous, the meat and vegetables they use are high quality, everything is fresh and the staff is fun and super friendly - Mimi and Blake are awesome.My favorite dishes are the Peace & War Won Ton Soup, the Orange Beef and the Shacha Chicken. They also have some great salads.  I often stop and pick up my order but the couple times they have delivered it has been timely and the food was hot.  I couldn't recommend a restaurant more than Little Dragon....Some great people making some awesome food!"], ["Todd H.", "First time here. Recommended by a friend. Ordered the drunken noodles with beef and sesame chicken and it is supper yummy. I am picky about Chinese and this place is worth it!!!"], ["Christine P.", "While housesitting in the neighborhood, I was looking for a some good Chinese. I found Little Dragon on Urban Spoon and was thoroughly impressed. From the friendly staff taking my order, to the delivery guy and finally, the food.The Hot & Sour soup does not contain the mystery meat that you almost always find (what IS that, anyway?) The Crab Cheese Wontons were perfect and the order was very generous.The only reason I didn't give five stars was the entree was a bit bland. I had the Veggie Delight with tofu. It needed some spice to make it perfect. Will definitely order from Little Dragon when in the area again."], ["Charlene B.", "I ordered from Little Dragon for the first time about a week ago. I had the kung pao chicken and brown rice. This was the best kung pao chicken I've had in a very long time. It was a little spicier than most restaurants which was refreshing. The brown rice was perfect. Portions were very generous and I love that they put the peanuts on the side.  There were several sauces included on the side and everything was packaged perfectly. The delivery person was very friendly as was the person who answered the phone when I called. This is definitely a go to for Chinese food when I'm near Downtown."], ["Aaron I.", "I've been here a few times and the food has been decent, but recently, a friend of mine and I both got sick from eating here, and the service was very rude. We won't be going back."], ["Alan K.", "This is the only 5 stars I have given so far. I love Chinese food and this place does it right! Quality ingredients and a plethora of delicious dishes to choose from. I can eat here everyday!"], ["Daniel R.", "This is the best Chinese delivery ever! You can get almost anything you want with tofu, which is amazing. Also, if you ask them to remove something you don't like (like onions), rather than giving you less food, they just replace it with more of the good stuff. We love these guys, and they have been our go to place for over a year."], ["Sloan R.", "Owner's just about the cutest Asian lady you'll ever meet. The place seems to run on her energy. Great menu; not too traditional, not too weird."], ["Ruth F.", "I'm hesitantly giving them four stars because they have Hong Kong Pan Fried Noodles which is a dinner I like to eat. BUT when I asked for Duck Sauce dude is like no we don't have that we have Sweet and Sour. When I asked if Duck Sauce is not popular here because I had always thought it was a standard Chinese takeout item, he told me that Sweet and Sour Sauce and Duck Sauce are the same thing pretty much. That is an insane answer."], ["Michael P.", "I placed an order for delivery and was told 45 minutes; 1.5 hours later I called for an update and was told the food was with the delivery guy. 2 hours after the order was placed I call again and was told the food was still sitting there. No explanation other than \"Sorry, we are pretty busy.\" Ended up finding another Chinese restaurant nearby that is even better. Sorry Little Dragon, I will not be back."], ["Renee B.", "This is my favorite Chinese place! Hands down the best. I only wish they were open for lunch"], ["Leila A.", "Little Dragon serves some of the consistently best Chinese takeout in Denver. Dishes that are supposed to be spicy are actually spicy, the vegetables are clearly fresh, the chicken has none of that weird gristle, and their customer service is always great. We are a few blocks out of their official delivery zone, but for an extra two dollars they deliver to us (we don't mind paying it) and when they give me a time estimate for delivery, they are always within or under that time."], ["Adam S.", "This is the best Chinese food delivery in Denver. They're always fast and delicious. Very generous portions, so much that two people can share an entree. Love it!"], ["Chance H.", "Fav Chinese take out! Plus only place I know in Denver that does cake noodle :) (Hong Kong style on menu) quick, consistent and delicious :) love being able to order and pick up in 15 minutes! Perfect neighborhood take out with GREAT SERVICE! Side note: I'm all about new Dev. But I'd hate to see a super Kingsoopers take away one of Mayfair/Park Hill's gems :("], ["Crystal K.", "I love this place! It's right in my neighborhood, has incredible food and the people who work and own the place are wonderful. Great local place and awesome to have in my neighborhood. The lettuce wraps are my favorite."], ["Michelle S.", "I've now had the opportunity to eat food from here a few times and each time it's been a great delivery option. I wish I'd known about it when I lived nearby. Service over the phone was great. Patient, friendly and happy to answer any questions.Delivery was super fast. The driver got lost, no surprise there. My sisters apartment complex is nutso. Tonight's lo mein + veggie egg rolls were great. The chicken and veggies I've has before are also good. Will definitely order from here again. Yay Chinese delivery!"], ["Meredith O.", "Little Dragon is a gem! Best chinese food around for the service, the speed, the quality, and the quantity! Orange chicken, Kung Pao chicken, and General Tsoas chicken are amazing! Love love love this place!"], ["Rachel B.", "Best.takeout.ever. Bottom line is this is the top of any Chinese delivery/takeout I've ever had!  No MSG; lots of authentic flavor!  Get hot n' sour soup, wonton soup (or just the broth is worth it!), pork spring rolls, general tsao chicken.  Great portion sizes and prices.  Little Dragon is a real treat for East Colfax!"], ["Hal B.", "Growing up we had the neighborhood Chinese restaurant that my father would go to once a week to save my mother from cooking. FINALLY, I live somewhere with such a place right down the street.  And it is really good. BBQ Pork, very special. Fried Rice and Lo Mein, very good. Orange Beef was tender and tasty, but I wish it had been crispy. That was my only complaint.Little Dragon is now on our list of take out regulars."], ["Dee Dee S.", "I just ordered the shrimp fried rice and it was wonderful! I have been to a lot of Asian restaurant's, this is by far the best."], ["Daniel R.", "Love, love, love! This place has the best chinese food in town! Staff is always courteous, friendly, and helpful with any of my questions. I don't understand all of the complaints about the manager. She is always been friendly to me. I'm beginning to think that some of these one star reviews are just morons who don't know how to order or read from a menu. Everything has been fantastic and lovely, Thank you Little Dragon!"], ["Larisa N.", "Love this place! The delivery is fast and the driver is always happy. Even if it wasn't conveniently in my neighborhood I might be tempted to drive anywhere for their Peace Not War soup - sooooo delicious. We have never had a bad meal from Little Dragon. A must try!!"], ["Halena K.", "I highly recommend the little dragon. We ordered the drunken noodles, salt and pepper shrimp, and the hong kong noodles. All were superb. My only critique would be that the fried rice was below average. It was just rice and soy sauce with a small bit of egg."], ["Evan A.", "In my search of Chinese food in Denver I turned to yelp and found Little Dragon. The menu was a little overwhelming but I called and placed an order for spring rolls, a small won ton soup and chicken with broccoli. The estimate for the pick up order was 10-15 mins. It took some effort on my part, I live close to cheeseman park so about 20 mins later I arrived and the order was ready. $20 for everything with a little tip. I started at home with the spring rolls, meh. Average, they tasted pre made and didn't impress me at all. The won ton soup was large portion, good but it's not hard to mess up. Finally the chicken with broccoli was good. An extra $1 for brown rice (boo), but the dish over all was a large portion and tasty. Not overly greasy or anything you find at a hold in the wall. Little Dragon had become a contender in my quest for Chinese food in Denver. I'll have to update my review after I try a few more dishes."], ["Brian G.", "Thank Zeus this place is around.  My wife and I order from Little Dragon once a week and we have been since they opened.My wife loves the Lemon Chicken and she must because it's the only thing she's ever ordered.  The Mongolian Beef is outstanding and it's a HUGE plus that they put sliced potato pieces in the there.  It's an awesome starchy bonus.So far as I can tell, there isn't anything bad on the menu.  The service is great and they are quick.  They always quote 30-40 minutes and but it's rarely more than 20 even in inclement weather.Like I've said.  We order quite frequently and are grateful they are here in the neighborhood."], ["Kristen S.", "The best Chinese this side of Colorado Blvd. The Salt and Pepper chicken is divine. Very fresh vegetables. Chile oil comes with your order! I haven't had it since I left New York. Real hot mustard too! Great customer service, they always remember me when I call."], ["McKenzie G.", "This place is surprisingly awesome! They have this vegetarian eel dish that is out of this world (basically cornstarch fried mushrooms done in a sweet and spicy sauce that is incredible). They use ORGANIC tofu, which is a huge plus. And they know what vegan means. And they deliver to our home! Rockstars."], ["Ann B.", "Still really good. I've recently had the vegetarian eel, tofu lettuce wraps and drunken noodles. The veg eel was good but too rich for me for a main dish - it would be ok as a shared app. The lettuce wraps were tasty - my non-vegetarian husband even enjoyed them.  Drunken noodles had a nice heat and I got 3 full meals out of my order - so, while the prices may seem high to some, you get a lot of food for the money.I've found service to be polite and efficient -- the place has only been open about a year, so the person below who says they've ordered from here for 2 years must have it confused with some other restaurant."], ["Murwa F.", "Had the chicken lo mein and wasn't that great. Still searching for a great Chinese spot in Denver."], ["Amy B.", "I love this place! The only reason it doesn't get 5 stars, is because this place is not open for lunch; I so wish it was! Every time I order from here it is delicious. Their ingredients are so fresh and of good quality. They only serve all white meat chicken and their tofu is organic! Also, I feel as though it is hard to come by great Chinese food with all the right flavors, sans MSG. If I can feel a little bit better about what is going into my body, and it tastes good, I am all in! Their veggies are fresh, the food is hot, and fairly quick to get to my door step. When I have ordered there to take out, it is even faster which I really appreciate, because I am usually in a hurry. I also have to mention Blake; such a nice young man who usually answers the phone, and I believe sometimes delivers my food. He is so helpful, so polite and so patient. So, great fresh Chinese food, with fast, friendly service; what's not to love?!"], ["Kelsey M.", "A friend brought me here while visiting town.  The food was really good and the crab wontons made me want to bring the cook home!  MiMi (I think that's her name) was extremely warm, friendly and funny.  It almost felt like I've known her and had been coming for years.  The place is clean and there's lots of free parking in the lot."], ["Jeff H.", "My favorite Chinese take out in the neighborhood. The meat and vegetables are always good quality, and the sauces and flavors are excellent. My favorite dishes the Orange Chicken, Kung Pao Chicken, Mongolian Beef, Vegetarian Eel, and the Hong Kong noodles. The hot and sour soup and egg rolls are excellent as well. The staff there has always been very friendly and has always treated us very well"], ["Jordan N.", "So yummy. Good customer service and food. We had just experienced a bad Chinese delivery and went here to get some good they were very nice prompt hot good. Offered us hot tea while we waited. We ordered crab cream cheese wonton and general tsos and sesame chicken. All hot fresh delicious. They packed our food and we got a lot of food chould not even finish half. Leftover are the best.can't wait to go back soon. Best food great customer service friendly and lots of smiles."], ["Abby T.", "Oh my gosh.  SIngle WORST experience I've had at a restaurant in a long time.  I have never left a bad review of anywhere...until now.Little Dragon is seriously overpriced for Chinese takeout - my bill for kung pao chicken (no extras) and a can of soda was almost $13.00.  To add broccoli the price was an additional $2.00.  Absurd.Long story, short:This place was a cluster.  Unprofessional.  Overpriced.  Extremely poor customer service.  I will definitely not go back.  I live in Lowry and will be sticking with Moongate instead."], ["Laila A.", "My boyfriend and I order from Little Dragon minimum once a week...we love this place. Not only is the food incredible and always fresh, the service cannot be beat. The staff is very professional,  timely, and never forgets our names. I would recommend this restaurant to anyone and everyone. I personally love the vegetable egg rolls,  wonton soup and Kung Pao beef. My boyfriend loves the Shanghai noodles and General Tso's chicken.  Oh and did I mention how reasonable the prices are for the extremely generous portion sizes? This place is totally worth the money."], ["Steven V.", "\"Little Dragon\" is a local gem in Chinese take out.  My family enjoys bringing home a flavorful meal and watching a movie over dinner. - Steven Visentin (Denver Chiropractor)"], ["Kristin B.", "I have never experienced food this bad and service worse. I ordered for delivery and when the \"food,\" if you can call it that, arrived I was completely disgusted. The fried wonton was so overcooked you could not even tell there was a filling in it. It was just a crispy fried mess. Then when we started on the combo lo mein, it was incredibly sparse in anything but noodles and some carrots. The sauce was disgusting. I figured the kitchen had an off night and called to relay my experience. I talked to Mimi, who I have since learned is the owner. She was receptive in the beginning, but quickly grew hostile. At the end of our call she agreed to comp me the meal. I called about a week later to give it another try. I once again got Mimi, the owner. She was immediately defensive and said \"why would you wait so long to reorder?\" I replied I was not ready to order the next day and why should that matter? Her hostility increased and she became verbally abusive. She was NOT going to do anything about my first service and she made that very clear. When I pressed the point, she hung up on me. When I called back, one of her very distressed employees answered and told me she was in the bathroom. I told him I would hold. He said it could be up to an hour and hung up. Five minutes later Mimi called me and started in on a tirade and then hung up on me. Amazing. She clearly has no idea about how customer service works.Don't eat here or put up with an owner who is so arrogant she cannot put customer first. The food is definitely sub par and not worth the price. Especially when they are trying to nickel and dime you on a combo lo mein. Mimi actually had the nerve to tell me that in a combo you get three shrimp. When I told her I only got one she insinuated that probably I had a shrimp and thought it was chicken. WHAT?? I know the difference between shrimp and chicken. This woman is a complete idiot who intimidates her Chinese staff and doesn't have a clue how to run a successful business. STEER CLEAR!!!!Oh please MIMI. Learn how to tell the truth please. This woman is nuts."], ["Alissa R.", "I am not the biggest fan of typical 'americanized' chinese food. so boy, this place was a nice surprise! delicious and more on the authentic side, a bit pricey for take out but you get a good portion. my current faves are the Singapore Rice Noodles, great kick,  Vegetarian Eel (not actual eel, but yummy shitakes) is really good, and the Peace Not War Won Ton Soup is super cool! (served hot) This is for sure a go-to for anyone  looking for something out of the ordinary chinese take out shack."], ["Katie H.", "I really do love Little Dragon. Now that I've tried the vegetarian eel, I can tell you it is FANTASTIC. I've also worked with them to cater an event for work, and the food was a definite hit with our 100+ attendees, including our vegan and vegetarian guests. Mimi is incredibly helpful and friendly. Little Dragon is a step up from your traditional Chinese delivery. I highly recommend."], ["Justin M.", "Always Dependably Delicious! I'm very satisfied with the price and quality of the food at little Dragon. Great to have a quality, fast, delicious food option in the Mayfair neighborhood."], ["Jenny C.", "We LOVE this place - The veggies are super fresh and everything we've ever ordered has been really good. Plus crab rangoons are perfect. Delivery is quick."], ["Ted C.", "Love this place!!!! Huge portions, friendly staff, and fast. Sesame Chicken is very good as well as the Wontons."], ["Adam H.", "I accidentally stumbled across this place today-- and decided to order takeout for my BF and I. The menu is great, they approach it a bit differently than most places, you don't have to order by the number. But rather, they give you different options on how to have your choice of vegetarian, beef, chicken, shrimp, etc... prepared.The ordering process was easy and timely. The people working were very friendly. And my car smelled like heaven on the drive home. I was so tempted to pull over and secretly chow down myself.Food was excellent. Loved the mongolian beef with potatoes! Best part is, I have left overs for tomorrow!"], ["Elle R.", "Delish!  Easy to get to & great service!!  So happy to have found some great Chinese food."]], "Wokano Asian Bistro": [], "Saigon Bowl": [], "Lao Wang Noodle House": [["Meredith X.", "When I heard that Lao Wang served soup dumplings and other Taiwanese goodies, knew I had to see if this spot could compare to my go to in Chinatown, love you forever Shanghai Cafe Deluxe.Ordered the soup dumplings, dan dan noodles, and spicy cabbage. Soup dumplings were a huge disappointment. Skins were too thick, some dumplings ruptured during the cooking process, those that remained intact barely had any broth inside. Dan dan noodles and cabbage alleviated my despair. Noodles chewy mixed in a spicy, flavorful peanut sauce. Cabbage was the most interesting, packed a ton of heat, sour from the vinegar, leaves still crunchy. I regretted forgoing the potstickers, enticed me with their cornstarch crust. Love the adorable, elderly Taiwanese couple running the restaurant. They don't take no shit, the table next to us ignorantly asked from which Chinese city they immigrated. I'll continue searching for soup dumplings elsewhere but I'll be back to try out those jiao zhi."], ["Allie R.", "Do you like dirt on your table condiments? Do you like being yelled at by a 70ish Asian woman while you order your food? Do you like feeling so uncomfortable while you're eating that you basically eat in silence in fear  that you might make the people cooking your food upset? I don't like any of those things either. But I do love the soup dumplings, pot stickers, wonton noodle soup, and Dan Dan noodles at lao wang. The food is enough to keep us coming back."], ["Rich H.", "After all of the hype, I decided to try this place for myself.  I called around 4pm and found out that they were going to open at 6pm.  We got there about 6:15 and got the last table that was open.  Perfect.  The reviews were not kidding, the place is entirely operated by the two older owners.  Talk about working your butt off!  They greeted, took orders, cooked, served and bussed the tables.  During my visit, the couple was nothing but friendly to us.  We were sat, given a large glass of water and menus and then given some time to decide what we wanted.  The menu is pretty straight-forward so we made our decisions and when they came around to take our order, we were ready.  You act stupid, they'll treat you stupid.  I think it's that simple.The food is what you really want to know about.  What you need to know is that their specialties are dumplings and potstickers.  Stick with those items and you'll be very happy.  The potstickers were seasoned well and fried to absolute perfection.  What makes the potstickers amazing is the way they fry them.  They end up with just the perfect crust on the outside with a great filling.  The dumplings are steamed with the juice inside the dumpling.  That makes them tricky to pick up without bursting, but you'll get better over time...or just use your fingers.So the reason I give this place 4 stars instead of 5 are for two reasons.  First, the menu is a bit limited.  It's not a bad thing though.  Stick with what you're good at. Like I said, stick with the dumpling and potsticker things.  I had the spaghetti stuff and it was...well...just not that good.  The second (and main) reason I took a star off is because the place is tiny and it gets crowded.  I know it's cold outside during winter, but having people stand inside and wait means they are literally standing at your table, staring at you eat or with their butt in your face.  It's just plain awkward.  I don't have the answers to all of the world's problems, but I'm just saying there's gotta be a better way.  One star off still leaves this place with 4 stars.  It really is pretty awesome and I'll be back for sure."], ["kelley e.", "Here's the deal--You want amazing, authentic, well-made, tasty, blow-your-mind dumplings, potstickers, and noodles, then come here. If you want to b*tch about service or atmosphere, then this place is not for you. The owners are old, fantastic cooks who don't put up with nonsense. I find them charming, but I could see how they come off as \"rude.\" Keep in mind, they run this place alone. That's hardcore in my opinion. They don't mess around. I love this place, been coming for years. Show up when it opens, or else you will wait. And honestly, if dim sum is your jam, you better get here ASAP."], ["El G.", "Best potstickers I've ever had, hands down. And super sweet owners who run the place and tend graciously to patrons."], ["Jason R.", "Does grandma need to meet your standards? I dont think so but clearly others disagree and that seems to explain the polarization of the reviews here. Is grandma's pan a little dirty (her house too for that matter)? Probably. Is she getting a little slower in her old age? Definitely. Is grandpa prone to some anger flare ups? Sure but we still love him. Do grandma and grandpa make some damn good dishes? You bet your ass they do so learn to overlook the other shit. For instance my potstickers were unevenly cooked and clearly placed in one big pan all together. They were amazing though. Sometimes I even like a little burnt end here and there, a little imperfection to love. Also, JoeGo 'Togo' pleas go f*** yourself. Grandma doesn't do carry out. You eat at her house bitch. Lastly, to those complaining about the prices... They are in their 80s and still working five days a week and seem to have one employee at most. Their restaurant is in a strip mall. I don't think they are getting rich and their food is great so pay up."], ["Betty S.", "based on the review, I went there and tried their Pot sticker and noodle soup. It was not as what the review wrote about. First of all, no personality at all for that old couple. Secondly, the pot sticker were very dry inside. The beef noodle soup was just tasted ok. Nothing surprise. Even my grandparents can made better than them. Maybe they should consider to open a same kind of restaurant with friendly smile."], ["Rick S.", "Bottom Line - This place is a-ok! You're probably not going to do any better for Shanghai dumplings or potstickers in Denver... it's solid and I would come back.  Shanghai Dumplings ($8.95) - These were solid. I've definitely had better, but was surprised at the quality for being in Denver.Pot Stickers ($8.95) - These potstickers were awesome! I would totally order them again. Steamed on top, crispy pan-fried on bottom, and very tasty!Chinese Style Spaghetti ($7.95) - This was an okay dish. It is basically minced meat in a soy-sauce-based sweet sauce (think loco moco) on top of noodles. I probably wouldn't order this dish again... I was a bit disappointed. The bill came to $34.80 + 2.78 tax + 7.42 tip = $45.00 for our table of two."], ["Dookrz D.", "But the old people who run the place are finicky and can be assholes,food is great but who knows if they are spitting in your food?They are very,very temperamental and they don't give a shit about what you think ,even though you are a repeat customer.I got a hold of them way in advance,said I was going to come in from Bailey about an hour away.They said as long as I called ahead (I did) it would be okIt wasn't at all,I was treated like a beggar on the side of the street! I ordered my favorite items, a new couple came in after I ordered,the old man recommended  an appetizer,that the new couple didn't order (one of which I ordered) and they got it first! This couple make great food but they are shit period,I will never go back,they suck  All you believers have no damn clue until you travel 50 miles and get treated like the cockroaches in the building"], ["Zoe L.", "I do not use capslock casually, but: THESE ARE THE FINEST POTSTICKERS + NOODLES YOU CAN EAT IN A 1,000 MILE RADIUS (unless there's a killer place in St. Louis I don't know about). Anyways, it is a privilege to eat here; remember that, before you complain about customer service. If you want someone to fake-smile at you and refill your water a lot, go to a corporate chain restaurant.Guide for a Successful Dinner at Lao Wang's Noodle House:1. Get there early (call to see when they're opening doors). It's a small place that fills up quickly, and there's no comfortable place to wait.2. Bring friends. Dumplings come 18 on a plate; potstickers, 10. It's a lot for one person.3. Don't be in a rush. This is not fast food. Each time I've been here, the entire operation (kitchen, front of house, busing, cash out) has been handled by an elderly couple who should be spending their days sipping G+Ts, watching rabbits or grandchildren frolic on a sloping grass lawn. They are HUSTLING; please do not keep bugging them with your petty needs. Just enjoy the food; they will come around when they can.4. Parking spaces are tiny; leave your Escalade at home.My fave dish is potstickers (NOT dumplings, NOT xiao long bao). They come crispy, near-blackened on the bottoms, which is exactly how I like them. I prefer the noodles dry (as opposed to in soup), because I appreciate their chewy texture better that way. I haven't tried the beef noodle soup because I fear the price ($16!) will taint however delicious the soup may be."], ["Macy W.", "Phenom! - pot stickers are a tad greasy; but the soup dumplings are perfection...I love this place!"], ["Victoria C.", "It's good if you've never had dim sum before, or if it's been so long since you've had it out in the dimsum desert that is Denver. Considering some reviews in Denver describe dimsum as \"exotic\" and \"adventurous,\" I'm not holding my breath.The elderly couple working there are super cute. And surliness is probably from a cultural barrier, and can be taken more as abrupt and direct rather than rude.I would probably agree that these are good potstickers and soup dumplings within a 1000 mile radius. But it's easy to fly elsewhere so I'll probably just wait to get dimsum on the coasts./Side Note: Nothing to do with the restaurant at all, but there were two drunk/wasted dudes near us, Asian and Caucasian, and 1) first they both kept staring at me openly in a very off-putting way, and then talking about me to each other (as if I didn't understand English?). It might be my haircut, but GEEZ. then 2) the Asian guy told a table full of tattoo'd Caucasian girls that he didn't expect they would like this, as it's \"very unusual to see white people who know about this food\". Ignore the fact that this was most of the composition of the restaurant. The provincial and close-mindedness here (both ways!) really disappoint me."], ["Lisa T.", "My go to place for potstickers! Service is as you would expect from a mom and pop shop but I don't go for the service. Delicious potstickers and xiao long baos. The potstickers are perfectly crispy every time. And the xiao long baos are juicy and flavorful. The wonton noodle soup is pretty good. Light flavors and good broth."], ["Kevin D.", "worst dinning experience ever!me and 2 other friends visited this place on 7/3/15, around 6pm.  Despite of how poorly we been treated while dinning at this place, i had no intention of writing a review, but after seeing all the positive reviews, i feel like im obligated to tell the truth!-things we liked about this place:nothing!-things we didn't like about this place:1. first of all, the place doesn't open until 6pm, so when we first arrived, we had to wait outside. after we entered the restaurant, the owner told us bluntly that we had to wait before we can order our food.  Moreover, the male owner started telling us both of them were over 70 years old, blah blah. honestly, i can careless you are 70 or 17, if you feel like managing a restaurant is too much work for you, shut the place down. 2. on the counter, it clearly states that no credit card under $10, but our bill was well over that amount, but the owner told us they only accepted debit card.  Also, tip is mandatory and the minimal is 15%.Bottom line, for those who are thinking about going to this place, don't be fooled by all the positive reviews, b/c this place doesn't deserve it!"], ["Lily S.", "This place has gotten pricier and pricier over the years to a point of ridiculous, IMO. We still come here, just for nostalgic reason (to see how our old friends are doing) and if we're really craving for someone else's home style cooking. Yes, the noodles are good, the dumplings are good, and the Xiao Long Bao are good too. But with their so many policies and negative attitude toward all mainland China customers, I find it hard to justify coming here as a regular, which is just too bad!"], ["Maxwell U.", "Favorite dumpling spot in Denver.  The old couple are gems as well.  You have to show up early before it gets packed.  Its not the fastest place as well, but you dont go there for speed.  You go there to eat delicious dumplings.  Soup dumplings are amazing here, the pot stickers are so good.  Havent had a bad thing yet there."], ["Chris V.", "Taiwanese soup dumplings are amazing. It took us forever to find this tiny gem!  Only 8 tables but the food is excellent and the owners are amazing. If you are looking for dumplings this is the place to go!"], ["Starr L.", "Sorry to say this, but the only big dish that this place has going for them is the xiao long bao, which is still overpriced. Don't get me wrong, it's really good for what Denver has to offer, but the rest of the menu could use some motivation. I ordered the spicy beef noodle bowl, all it was was a flavorless, chili oil broth. It could have had more potential....so sad. This place run by two elderly Chinese couples, so don't expect warm-fuzzy customer service. They will be blunt and right to the point, so try not to be that needy customer. If you're a rookie, please seek assistance prior to attending this establishment. You won't be getting a Sesame Chicken here or a Vietnamese Pho, so please research prior to going."], ["Steven C.", "Today's trip was with my girl and her lil daughter.  my intention was to try the beer everyone was talking about.  She and I came to this noodle joint before for there home made dan dan noodles and wanton soup.Old man was rude or almost comical in a sense.  Went in there was table for four at the corner but he daid we couldn't sit there. Ended up waiting for him to clean up the small table. Grabbed the high chair which was filthier than other Chinese restaurant. Good thing she brought the cover. He left two menus which was dirty and sticky.  I was afraid to drink the ice water. We flagged him down to order but he motioned to wait. We patiently waited and the mrs. came out to take the order. Food came out in timely manner and as expected,  it was delicious. Beer was very interesting and was worth the trip to this location.  The lady next to us ordered house signature dish and the old man was lecturing her that she wouldn't like it.  This is after he brought out the food. She was kinda confused and asked if she can return back.   He said \"No\"  I was trying so hard to keep from LOL. I was so amazed everyone was so nice to the older couple which was very nice to see.  Service wss terrible,  food was great, place is tiny and dirty.   Parking sucks big time."], ["Mary Beth F.", "The reviews are hilarious and going to this place is equally amusing. We've been a few times and the owners really do raise their voices at customers. We've been there when they close in the middle of lunch, because there is no more food. You may have to wait, you may not get to eat, you may get yelled at, but this place still gets 5 stars. Pot stickers are amazing, soup dumplings are the reason to come here even if sometimes they rupture.If this is your first visit--be sure to order everything you want the first time around because they may not be able to take more orders. If you've been seated, trust that someone will be back at some point to take your order. Do NOT go up to the window by the cash register and start talking to them! Someone actually did this when we were there two weeks ago. Hilarity ensued but I imagine it was really unpleasant for these customers. If you don't know what to get--get an order or two of soup dumplings, an order of pot stickers, and the dan dan noodles. These are the specialties and you'll be super safe with these options. Then sit back and take it in, and the next visit you'll be clued in."]], "Hasu Asian Bistro & Sushi": [["Amanda G.", "The white tuna nigiri is so light, fresh, and delicious here. Highlight of the meal. Happy hour all day on Sundays; ordered one pint of Sapporo, got one pint FREE.The staff is attentive, helpful, and very courteous. Thoroughly enjoyed eating at Hasu!"], ["Cody P.", "First off, food and prices, particularly happy hour, were great! However, the server we had was real bad.  I don't post very many reviews but this visit warranted one.  Maybe he was having a bad day? No idea. Shouldn't matter. Visit was on 10-30-15 around 4:45PM.  Said server had a real bad attitude.  Again, food was great, service left a lot to be desired.  Didn't check up on us not even 1 time after the food runner delivered the food.  Ate our food.  Beer and Sake was long gone by the time food came.  Waited 25 minutes, NOT EVEN KIDDING, for him to return (place was dead) for another beer.  After 25 minutes server showed up and asked if we wanted another drink?  Didn't ask anything else.  I was blown away (not in the literal Denver form). I didn't want to tip the A-hole but my Fiancee' made me.  Try and get one of the women servers, our previous experience was great, this one not so much!  Shape up or ship him out!  You know who I'm talking about..."], ["Eric N.", "I went in with a companion for lunch today.    We'd planned to eat at Continental Deli but they were closed and I remembered they had a good reputation, so we tried it.  We both had lunch specials, a curry and Pad Thai.  Both dishes were tasteless and watery.  The Pad Thai's pork had been incorrectly stir fried so it was chewy boiled-tasting rather than the firmer, more complex flavor you get from a hot, dry stir fry.  The sauce for the Pad Thai was sweet but tasteless and watery, so the dish didn't have that sparkly sweet-sour I expect from good Pad Thai.  My companion made similar complaints about his curry, particularly that it was too sweet and didn't have the right flavors.   Service, decor, menu, pricing were all good so this was a disappointment since we're always looking for a good alternative for lunch."], ["Tom G.", "Wow. Thought it might be touristy since near the mall in a fancy strip mall, but this place is the real deal. Cool happy hour specials all Sunday including bogo Sapporo and sake as well as food. The super white tuna nigiri was to die for, the spicy lobster roll and crazy spicy tuna hit the spot. Daughter liked the Philadelphia (though I hate sushi defiled with cream cheese). The shumai was excellent as well!! All for a decent price. Great service as well."], ["Riza H. C.", "Ooohhh Hasu Asian Bistro, THANK GOD you are open on a SATURDAY!  Well actually I wanted to bring my friend to another Sushi establishment in town which is around this neighborhood but they are NOT opened on Saturdays.  Its their LOST and Hasu Asian Bistro's Gain...Anyways, I guess OLD Habits Died Hard, I tend to order the same things or similar things from the Menu, from my previous visits back in 2014.  This recent visit was on SATURDAY March 14th 2015.  Time was about 11:35hrs ish.Thankfully we are among the few that arrived early, though I cannot deny for a SATURDAY LUNCH, Hasu Asian Bistro tends to be so quiet.  It maybe good for some.  I have no qualms on those, since I like to dine in, with some \"peace\" in mind..  Anyways, from what I could recall I ordered the following items :*  Sea Urchin ($9.00)*  King Crab ($9.00)*  Unagi ($5.50)*  WASABI Flying Fish Roe ($5.00)*  Amaebi aka Sweet Raw Shrimp ($7.95)*  Spicy Scallop ($5.00)*  Spicy Lobster ($5.00)*  Tamago Nigiri ($4.00)My friend, ordered the following items :*  Sea Urchin ($9.00)*  Spicy Tuna Naruto ($11.50)*  Unagi ($5.50)*  Gyoza ($5.95)My friend like what she orders, but she did not fancy the Sea Urchin aka UNI at all.  It was her first time trying though.  At least she tried.  For my order of KING CRAB, they put it on a BOAT SHAPE that is crafted from SOLID ICE.  Hmm, its good in terms of presentation, but I SO WISH, Hasu Asian Bistro will maintain in terms of the QUALITY of SEAFOOD or The Sushi/Nigiri that they offer instead of \"Presentation\" wise.  Hence Hasu Asian Bistro have room of improvement in my books.Then with some of the presentation, they tend to slice out limes that is somewhat \"rotten\".  It so visible from the skin of those limes.  I know we don't consume the Lime itself, but it can cause food contamination for some.That morning/afternoon, the service was just OKAY, though a little too slow to our \"comfort\".  Our Main server answered all our questions we had.  Some items in their Menu were unavailable, but after he gets back to our table, he said, its available.  Hmmm...  It seems like there are 2 different servers handling our food order that LUNCH Saturday Weekend.  From the receipt printed, if I am NOT mistaken our Server his name is KAI.If I could also recall properly, since there is a \"WAIT\" for our Orders to be ready with somewhat an empty dining room at that hour, the Kitchen Staffs offer each of us, a bowl of Miso soup and some kind of Nigiri, in which I forget the name of it.  My Bad.All in all, I don't mind returning.  Maybe that next visit, I shall convince my Chinese friends to come along so I can \"explore\" those Chinese Menu items which have been \"calling my name\"...  Ooohh and not forgetting, while I was about to leave Hasu, one of my Meetup Members said Hello and it seems that Hasu is one of her favorites too.Anyways KUDOS to Hasu Asian Bistro.  Its 3.5 stars in my books.  Hope they will prosper many more years to come in this neighborhood.TB# : C-12 GuestsHASU ASIAN BISTRO250 Steele St, Unit 104Denver, CO 80206Tel : (303)-722-9968Tel : (303)-722-2826Fax : (303)-871-8129hasuasianbistro.com@65/2015"], ["Rayna K.", "To say that the staff at Hasu went out of their way for my birthday tonight would be an understatement. I came in tonight with a party of 8, I made reservations this afternoon and our table was ready well before we arrived. My older sister was seated and had order hot sake when we arrived. My younger sister placed my cake on the table and leaned over without looking... She knocked over my older sisters sake! Our waiter immediately came to clean it up and even replaced the sake free of charge. Later, the tables turned and my older sister knocked over my younger sisters water glass, breaking it. Again, the waiter was fast to clean it up!We asked for the Chinese menu and ordered drinks, there seemed to be a little miscommunication between our servers on who was taking orders and drinks etc, but they got the job done, if not with more ground covered.A couple of strange requests from my family-a couple people with dietary restrictions which were seamlessly accommodated. My sister and I ordered ankimo (monk fish liver) and they brought out one portion for everyone! They were so thoughtful the entire meal. Due to a dental surgery, my father wasn't able to eat any solids besides rice, and they brought him out plenty of miso with white rice. They put our cake in a refrigerator in the back while we ate and brought it out after dinner. Everyone loved their food. Entrees ordered were the Hasu sushi plate, chicken fried rice, Jing jiang pork, cross bridge noodles, sesame chicken, sweet and sour soup, a couple sushi rolls and nigiri. Nigiri was fresh and tasty, not the best but pretty good. The Jing jiang pork & cross bridge noodles were off the Chinese menu and were incredible. The rolls were okay, but I'm not really a fan of rolls to begin with. I would highly recommend ordering something off of the Chinese menu!!I was offered complimentary nigori sake because it was my birthday. With the bill, they wrote happy birthday in Chinese, Japanese, Korean, and English. It was super special and I'm so grateful for everything they did to make my birthday great. Thanks so much, Hasu Staff. We will definitely be back for more soon!!"], ["Diana W.", "Came here on Friday night and found parking and seating for four immediately.  I decided to take my mom here due to hasu being on a list of best Asian places in Denver. Alas, hasu is more sushi with Americanized Chinese dishes than their website led me to believe.Their Mongolian beef was tender with just enough spice and their Shanghai noodles with shrimp and beef was cooked pretty well also. We also had their oysters which were fresh and had this spicy Asian sauce that was really delicious. Although the presentation of their sushi was amazing, it didn't taste any different or better than other sushi restaurants we frequent.  For the sushi we give hasu a 3 and for their Chinese food I would give it a 4."], ["Michael L.", "I was hoping Denver has a Chinatown, but alas, that is not so although I seem to see my people everywhere.  I felt like having Chinese food for lunch so the girlfriend found this fusion restaurant because it also serves Japanese and Korean cuisines.  After we were presented with the main menu I commented to the server that I was craving Chinese food but the menu is lacking in choices.  She smiles and says, \"I will bring you the Chinese menu.\"  I said you have a menu just for Chinese food? And she said in Chinese, \"of course, we are Chinese.\" I grinned like an idiot in hearing my language spoken.  I especially love it when I am on holiday. The girlfriend ordered the Purple Haze Hot Sake to go with the sashimi platter while I ordered Tsingtao.  We liked the food.  The server was super friendly and talked about why she moved from NY to Denver and how much she likes her new home."], ["Frances G.", "With an understated, yet comfortable interior  this sushi spot was surprisingly slow on a Saturday afternoon; however if they keep up with the delightfully friendly service and extensive menu boasting Japanese and Chinese fare. Booth space, tables, bar space, and even high-top seating - the restaurant is set for a big showing and has what I can only describe as 'night club' type decor. But what I will always remember by this spot is the first time I tried sea urchin. I do plan on returning for the vast array of yummy sashimi and sushi...maybe not for urchin :), but I'll definitely be back. The tuna collar and yellowtail with scallion are both divine and the service was great. What's not too like?"], ["Karen G.", "I kind of feel bad giving it 3 stars when everyone else who has reviewed this place seems to love it. I spent 45 on a take out order, I had their tuna salad, and 2 specialty rolls with a Thai ice tea. I simply asked the girl helping me out what were the most popular rolls on the menu and she ended up asking a chef. I went with his suggestion and I thought it was okay sushi but I wasn't impressed. Maybe I just had the wrong items?? The salad was lacking some flavor and for $13 I found it small. I understand its tuna but I know it could of tasted better. Maybe I need to try something else on their menu and then I can update this review."], ["Valerie C.", "Best sushi we've had in Colorado by far. Loved the Crazy Tuna roll and Spicy Tuna appetizer off the happy hour menu, which is all day, every day."], ["Heffner F.", "Great sushi specials! Lunch special is miso soup and 2 rolls ($9) or 3 rolls ($12).  Pretty great deal for good sushi!"], ["Annette M.", "OMG OMG OMG. Do you love sushi? Fellow Yelpers you must come here. You will thank me! They have only been open 3 months so no crowds....yet. Best sushi I have had in so so long. We are talking excellent. fresh. and beautiful. My favorites were the tempura... Extra light and crunchy with killer dipping sauce. Uni was super buttery and fresh, Tri Crunch roll was a new treat and excellent. The Volcano Roll was THE Bomb. The sauce was thick on the plate with the crunchy roll sitting on top. Perfect... That way you get to add as much or as little of the sauce as you wish. It was Sooo delicious I dipped other rolls in it. I can't wait to come back. My new fav spot. Easy free parking in back."], ["Kerrie G.", "Hasu is by far my favorite Sushi restaurant in Denver. I stumbled upon this hidden gem based on great Yelp reviews actually, and was skeptical when we walked in because there was no one there! I think it's the location, and just not many people know it exists. The chef/owner came from a sushi restaurant in NYC and you can definitely tell when you get your meal. It's always exquisite. They have the same exact sushi vendor as Sushi Den, with a fraction of the prices. This summer they are doing happy hour EVERY day ALL day! Amazing sushi rolls on the happy hour menu and a 2 for 1 deal on all drinks. This is the best deal I have ever seen and I feel bad for anyone who doesn't know about it!"], ["Hannah S.", "Amazing. While staying in Cherry Creek on Monday night, we happened to have searched through the endless yelp listings and came upon Hasu Asian and Sushi. From the initial greeting, to the spectacular service, even being greeted and engaged in conversation with one of the owners Hui, Hasu impressed. We had the Toro, and several rolls including the Mummy Roll and Black Dragon roll. All were awesome. But it's the atmosphere and ambiance that make a great sushi place even better. We are definitely spreading the word."], ["Taiwan M.", "When I say Sake you say bomb...  OK, at first blush it sounded like a late night frat party in the dining room, but it turns out this place is friendly and the food is excellent.  The Singapore noodles were delicious, and the portion was huge.  I had lunch for the next day.  The service was a bit slow, so the cooks sent out a small plate of some decadent fried shrimp dish while we waited.  The waiter was attentive, but very careful not to hover.  This was a great experience...once the sake bomb party left their table.  I will be back."], ["Mel V.", "We had a great experience here. We had the seaweed salad and live scallops to start. Delicious. The scallops were delicate and fresh tasting. They nestled them between thin lime slices which added a nice flavor. The dish itself was something to behold. We all took pics of it before digging in. We tried various sushi rolls to include volcano, TNT, and angel girl. All delicious. All fresh tasting. Our server was very pleasant and very attentive. The inside of the restaurant is pretty. There is convenient parking behind the building. We tried their vanilla bean brûlée cheesecake, the raspberry cheesecake and the chocolate lava cake. These were good but not amazing. In fact, the chocolate lava cake's lava was chilled solid. So no lava. More like molten rock. It was still good. The sushi is what spoke volumes for this place. Wish I lived closer."], ["Brittney S.", "We've eaten here many times and each time it's just as great as the first time we stumbled upon this neighborhood gem. The sushi is great and one of our favorites is the Mummy roll. The Chinese dishes are delicious too. To top things off they have fabulous happy hour specials and the service is always attentive and with great recommendations."], ["Priya P.", "This place is fantastic! Went here tonight for girls night and the food was amazing! The sushi was great need to try the mango roll. The atmosphere was very classy. The staff was super nice and overall a great experience. I even told the waitress I would give them a positive review on yelp!"], ["Susan B.", "This is the best Asian food we have had in a while. We had pad thai and basil vegetables.  Both were fresh and bright.  The vegetables were gently cooked -- all the way through but still with a nice crunch.  The service was friendly and knowledgeable.  Even the hot tea was good, fragrant and nutty.  We will be returning."], ["Allison M.", "Very friendly service and fresh, delicious sushi! We were there on an Wednesday night for a late dinner and it was quiet but not at all empty. Will have to go back for their happy hour (everyday from 2:30-6:00). They even have parking available out back, hard to find in Cherry Creek."], ["Amanda S.", "We have always ordered off the traditional Chinese menu and everything has been delicious, especially the tofu skins and vegetarian hot & spicy tofu. The service is exceptionally friendly and very accommodating for vegetarians. We love this restaurant so much that we were moved to write our first Yelp review!"], ["Nadine B.", "This place was amazing! The staff was spot on. The sushi melted like butter in my mouth. Yummmmm-o!"], ["Bridgett R.", "I am an Asian food freak, this place is Amazing!!! The food is probably the best Chinese in Denver! The walnut shrimp is to die for & so is the general Tao chicken! Saw another table with a sushi sampler & it looked like a piece of art! This place is a must!"], ["Yanjie W.", "Love the place! Sushi rolls are delicious! Free parking is available on the back side."], ["Dustin T.", "Friendly attentive service.  Food was excellent.   Owner stopped by the table to talk and was very nice.  We will be back.  Had the thai peanut chicken,  spicy basil shrimp and two sushi rolls."]], "Zoe Ma Ma": [["rachel a.", "Family owned and operated. The egg noodles are homemade, onsite. SUPER FRESH! I also LOVE their no tipping concept. Fast, fresh, and healthy is how it goes down here. Although there are plenty vegan and vegetarian options they need to add MORE veggies. More in each dish and more variety. Broccoli, cauliflower, and carrots would take their noodle dish from pretty good to really good. A vegetarian soup in winter might be amazing too! I'd probably eat here everyday if there was more variety. Secret scallion pancake is awesome!"], ["Govinda T.", "This is the second time eating here. I wanted to wait to see if the food got better, but sadly it has not.I ordered the Vegetarian on both occasions.Their food is drowned in their \"sauce\" (nothing more than reduced onions and ginger steeped in soy sauce) and is incredibly salty.After most literally draining a half-cup of the salty brine, I proceeded to eat the food which was incredibly one-dimensional. Between the sad blanched mish mash of bok choy, bean sprouts, undercooked zucchini and soft, bland, uncooked tofu, I could only get through half before I had to chuck this in the trash.I definitely won't be wasting my money here again."], ["Aly N.", "I love trying new places and Zoe Ma Ma was a new experience for me. One of my co-workers asked if I wanted to go out to lunch and check out something different and five minutes later I found myself at Zoe Ma Ma.The place is tucked among the restaurants at Union Station in downtown and has a very fun cozy vibe. We went here on a gray, rainy day and hot food sounded like the perfect solution. I ordered the house special and a steamy bun. The bun was fabulous - doughy goodness stuffed with meat. The house special was only okay. They are known for their noodles and I didn't love them. In addition, it seemed to be mainly noodles without much meat or veggies. The ratio didn't seem very high with regards to what you got substance-wise. They were good but not my favorite. My only other issue was they seemed to be having computer issues - no biggie I get tech stuff break downs. But the manager seemed to be getting mad at his staff in front of his patrons and I can never agree with someone who gets upset while their employees are trying to do their job. The cashier was trying to take our orders on the working computer while he worked on the other. He kept trying to switch her off and getting irritated when she wanted to complete our order before moving computers. I didn't quite get it. I'll probably be back if my co-workers are in the mood for some noodles; however it won't be my first choice."], ["Wade K.", "Some really good stuff here!  Definitely a go to for a quick meal.  But the dumplings, their staple, are bland and just not very good.  I've stopped getting them.  Their noodle and rice dishes are solid, though.  I also think that their default 15% charge for gratuity and environmental causes is sort of strange.  It's basically forced b/c nobody would ever want to ask them to take it off, especially in front of other people.  If you want to be green, then be green.  Don't charge your customers for it.  Most other restaurants in Denver are green, and they don't charge for it."], ["Lisa K.", "This place serves Chinese style street food.  I have no idea how authentic it is, I've never been to China, but It is delicious.The top reasons we keep coming back:Pot StickersZa Jiang Mian with homemade noodlesChillin' VeggiesIced Green TeaThe menu is small, but there is always a daily special and everything we've tried has been very good.  They are also several sauces to go with/on your meal, they are so delicious.   Everything is homemade and really high quality ingredients (unlike many Chinese style restaurants).  But, we come back for the Pot Stickers and Za Jiang Mian.It's fast casual and prices are very reasonable.  Also, the menu really lets you customize.  You can try several small dim sum items, get a big yummy bowl of noodles or both, depending how hungry you are.They also have a great patio."], ["Sally H.", "Came here based on raving reviews and left here rather disappointed.  I honestly wanted to like this place because the concept was rather cool:  fast Taiwanese street food brought to you by mama Zoe.  However, the food was shy of perfection.My boyfriend and I came here for a Wednesday night date night.  I ordered the Wednesday special which was the Lion Head; a saucy pork meatball with shiitake mushroom, napa cabbage, bamboo shoots, and rice.  My boyfriend ordered the Za Jiang Mian; a classic northern Chinese noodle dish made with egg noodles, ground pork, and julienne vegetables.  We also ordered the crystal shrimp dumplings; which turned out pretty bland.  As for the special Lion Head, there was nothing special about it.  In fact, there were a few ingredients in the bowl that I had bit into and had to immediately spit out.  For instance, the bowl contained large slices of ginger.  The ginger slices are so large that I mistaken it for bamboo shoots.  It wasn't very pleasant.  However, the Za Jiang Mian was good.  I wish I had ordered that instead.For the price point Zoe Mama is decent.  Furthermore, they do add an additional 15% onto your ticket for service/upkeep of the place so tipping is not necessary."], ["Seiji N.", "Not a Taiwanese food expert, but everything I had except the potstickers was super bland. If this is what \"yummy taiwanese street food\" is, then I don't think I want to eat anymore of it. I've had wonton soup several times before, and it was much much better than here. The wonton soup here hardly tasted like anything and was not even worth the space in my stomach it took up. The Lion's head and zi jiang were also bland, but not as bad as the wonton soup. The only thing I found decent were the potstickers, but they weren't even fresh... The customer service was good, the guy working the register was super friendly and helpful. Will I ever come back to ZMM? Nah."], ["Aaron W.", "Overall this place is good but nothing about quality or price is above average. Can't say it's somewhere I'll frequent.The appetizers came out seconds before the main dish.Potsticker is decent. Really good sauce, ok size but not worth $1.25 for one.Hot sour soup seemed off. Was not hot (spicy) or sour. A little sour aftertaste, but different then what expected. Predominant taste is beef and mushroom?Marinated pork bun (bao) was very good. The plethora of dipping sauces helped. Very good bun though a little spendy. Smooth and slightly elastic outside, moist tasty meaty on the inside. Beef noodle bowl, hmmm.  Bok choy is good. Noodles are good but not great. Broth is different then what I was expecting. Very close to the hot sour soup in an odd way. Picked cabbage on top seems out of place, but I admit that I don't like this type of pickled cabbage on it's own."], ["Heather T.", "A friend and I ate here a week ago, neither of us having eating Taiwanese food before. There is a \"secret\" menu so thankfully I overheard the person before me ordering the scallion pancake or I wouldn't have known of its existence.  We ordered our food and the staff was very nice.  The food is brought out to your table so you just take a seat and relax.  Well first you go to the sauce station and load up on delicious sauces for your dumplings and various other items and then you take a seat.The scallion pancake was the first to come out and it was my favorite of the night.  Crispy and salty with just the right amount of onion, this was a home run!  Especially with the sauces drizzled over the top.  I also got the potsticker which was good but not mind blowing for me, the vegan dumpling which was not a winner for me and a steamed pork bun which I enjoyed.For my main, I got the duck soup noodle soup which was fantastic!  I also added some spice and seasoning to take up the heat level.  The duck was very flavorful as was the broth.  And who doesn't love slurping noodles up?  This is the perfect meal for a cold winter night.  Our plates were cleared as we finished them and overall this was a really nice evening to spend here!"], ["john W.", "At the end of the day, not so much my thing. We went for lunch, i enjoyed what I got (which i barely remember, but i know i didn't hate it), but i wasn't something i find myself craving. The dumplings, i remember being tasty, though the curry one was surprisingly bland. The process of ordering is a bit weird, since you order, get your water or drinks, do up your sauce, then sit or stand waiting for your food. If nothing else, it'd a nice place for an afternoon drink and snack, which you watch Union Station foot traffic"], ["Michelle K.", "Ugh so upset I wasted my meal here. Got the chicken noodle soup because they didn't have the beef soup. It was so oily I could barely stomach it. Bland and not a ton of flavor. The glass noodles were such an odd selection for the soup. Do not get.The pork bun was ok. I wouldn't get it again.Shrimp dumplings were also meh. Kind of tasted fishy, not in a good way. Friendly staff, hence 2 stars. Food = 1 star at best."], ["Emily C.", "Oh yeah. That's right. FINALLY some good Chinese/Taiwanese food downtown. True, we live near Federal/Alameda where the Chinese is good and the Vietnamese is even better, but when I need my fix downtown, I'm always disappointed. And I don't like to be disappointed.When I lived in Boulder, I worked right around the corner from the Zoe Ma Ma up there. I got used to my Ma Ma fix--it's hard to go cold turkey off of Ma Ma's food, but I did it somehow. Now that she's in Denver, I'm back on the stuff. Every time I've been there, she's working the line--that woman knows how to run a kitchen. Her staff work it.The food here is amazing. And don't let the 15% auto gratuity get you down. Honestly, if you're freaked out by paying extra at a restaurant, that means you probably don't tip. And if you don't tip, you're a lousy human being anyway who has no empathy for the people who serve you, and don't understand the way the service industry works. I WISH it were 20%, because they won't let you add more gratuity, and they deserve 20%.   /rantI always go for the za jiang mian with rice noodles. Were I not gluten free, I'd be hitting up the home made organic egg noodles on the daily. The sauces are all incredible. For real. Especially the Sichuan pepper sauce. Oooh, it makes my blood tickle and I like it.  The flavors are always so fresh, so crisp and perfect. Yum.The dim sum is super tasty too. Sometimes I come down just to get a couple dim sum bits and smother them in Sichuan pepper sauce. Welcome to Denver, Zoe Ma Ma. I'm over the moon that you're here!"], ["Alyssa C.", "I was excited to finally find a good taiwanese restaurant since Colorado doesn't really have that good of food. I thought this place would be good based on the reviews, but no. In my opinion this place was a little expensive, and the food wasn't that good. I feel like I could of made it at home. I got the duck and wonton soup, a pork bun and a side of rice. Like I said the food was okay. The wontons were good, but didn't have that much filling in them. However, the rice was the worst out of it all. You would think white rice is something that takes a max of 20 minutes, but they used minute rice. No thanks. Also I didn't like how the sauces were sitting out with no tops on.I won't be returning."], ["Angela C.", "You can't come to Zoe Ma Ma expecting your typical Chinese fare, because it isn't. I would also say that it is not a traditional dim sum, so if you are looking to gorge yourself on dim sum, go to Asian Super Star or something. Zoe Ma Ma has a select amount of home-style Taiwanese food, and it's pretty delicious. Note: this is TAIWANESE food, not to be confused with THAI food, which is from a different country (Thailand) and has significantly different flavors. I'm sure you can find cheaper Taiwanese somewhere outside downtown or in a Chinatown in a bigger city, but for the location and the quality of food, me and my family left very satisfied. The noodles are organic and homemade, which are an added bonus. We enjoyed the CPR, Beef Noodle, Za Jiang Mian, some potstickers, and sampled a marinated pork steam bun. It was like eating many of the favorite things that my mom might make, and I didn't leave feeling completely bombed with sodium like with a lot of Chinese restaurant food. I think this is where other reviewers felt disappointed about \"bland\" tastes, but really, most Chinese restaurants probably meet your daily sodium intake in one dish!! The ba bao rice dessert was awesome.Beyond the food, the space is neat and modern, with granite table tops and window-facing counters with stools. The owner was incredibly friendly, and we bonded over our common Taiwanese roots.  Wish I could come here all the time."], ["Holly E.", "I was very excited to have the chance to try out Zoe Ma Ma for lunch today. I ordered the Thur special and was disappointed it was not very special. But I will say the quality of their food is superb.I ordered - Lion Head $7.95Ginormous saucy pork meatball served with shitake mushroom, napa cabbage, bamboo shoots and rice.  Rice noodle and fresh organic egg noodle available. The meatball was delicious and yes ginormous and plenty of cabbage. However only one little mushroom and bamboo shoots were not included. I ordered it with the rice noodles and they didn't skimp there. And note they use bok choi. I didn't realize bok choi is also called napa cabbage. Initially I thought it was pretty bland until I discovered they have 4-5 sauce options on the counter.My meal and green tea ended up being $12.30 because they include a 15% gratuity. I'm ok with this but will likely skip the $2.50 tea next time. Wasn't too impressive.I say all this but I will be back because my friend's food looked more appealing. And I like simple fresh food and do you know how hard it is to make a meatball that size that is still moist and flavorful? I just hope next time they are more generous with the ingredients."], ["Zen T.", "I wasn't really too impressed. I got the special which was the braised beef . The beef I'd actually give 5 stars but the noodles were overcooked and there was definitely not enough soup for the dish. Plus the soup I thought was OK. Thank goodness for the sauces which made it better.Oolong tea was great.The cashier did not know the menu well. Also, he welcomed me to an authentic \"Chinese\" restaurant. Where did Taiwanese come from? OR was that due to his lack of knowledge?The ambiance was great. I thought the decor was very unique, innovative and cool. I MIGHT go back and try something else but maybe not."], ["Hannah W.", "I'm so happy that Zoe Ma Ma opened in Denver! I first came here out of some friends' recommendation. I always struggle to decide what to get so it's helpful that the menu is really simple. My first time here, a lot of the items I had wanted to try (pearl meat ball and hot & sour soup) ran out so I ended up getting the Steamy bun (bao) with pork and potstickers.The marinated pork in the bun is really flavorful and authentic, I wish I ordered another bun... What I liked about the potstickers were that they were crispy on the side. My friends really enjoyed the CPR and roast duck wonton noodle soup. One thing to note is that some of the items are only served on certain days (e.g. roast duck wonton noodle soups are only available Fri and Sat). Besides the great food, I love the atmosphere. The restaurant has a decent amount of seating and cute Asian décor (tea sets, newspaper design tables, etc.). The waiters and chef are super friendly too. My favorite person in the store has to be Zoe Ma Ma though. Because this store is fairly new, she's been at this store making sure operations are going well. The first time I was here, she gave me a goji rice cake for free and talked to me about her new restaurant and what cool breakfast menus she plans to have. Because I didn't get to try to pearl meat balls my first time, when I went back to the restaurant later that week, she pulled me over and gave me an extra one on the house. She definitely knows how to treat her customers and makes them feel at home! (Although I think the fact that I speak Mandarin helps)This place is tucked in on Wynkoop right on the side of the Union Station. If you're looking for a place for Asian food, definitely give this place a try!"], ["Mark T.", "Many, many decades ago, the island of Taiwan was commonly known as Formosa, a term deriving from a Portuguese word meaning \"handsome\" or \"beautiful\". Luckily, the Taiwanese (etc.) food served at the downtown branch of Zoe Ma Ma lives up to such lofty praise.Let's begin with a small nibble, shall we? I'm always a sucker for a good Jiaozi (dumpling) and ZMM's are some of the best I've tried in recent memory. These shrimp/pork/chive-packed wonders are of the Guotie (literally, \"sticks to the pan\") variety - fried on one side first, then steamed to succulence. Speaking of steamed things, their buns (or if you prefer, Bao) are almost as noteworthy as mine (ahem) - the marinated pork (Cha Siu) and curried chicken (Gali Ji) ones stand out in particular as I'm typing this. Zhen Zhu Wan Zi (glutinous rice-dappled pork balls) are another intriguing introduction for you to consider. As luck would have it, these are all so affordably priced, you could even try a few of each in one sitting - and it probably comes as no surprise to hear that I've been known to do precisely that!To continue, how about a little CPR? No, I'm not being presumptuous, so cut that out. Those three tiny letters actually refer to one of the most comforting creations on offer at ZMM - namely, a chicken and potato stew featuring just a touch of ginger and star anise, with plenty of steamed rice (or even noodles if you're so inclined) to soak it all up. On the lighter side, there's always the cold salad called Liang Ban Mian (egg noodles tossed with bean sprouts and cucumbers) to keep you feeling gratified, yet guilt-free. And depending on which day you visit, you might get to try one of their specials, like Niu Rou Mian (braised Sichuan-style numbing-hot beef with noodles) or even Shi Zi Tou (Shanghainese stewed meatballs, colloquially called \"lion's heads\" due to their size). It's all ripe for the picking at Zoe Ma Ma."], ["Hanh P.", "Taiwanese food in Denver?  Originated in Boulder, same menu.  Quick casual dining.  Order and pick up yourself.  Clean and big windows.  Nice atmosphere.Great roasted duck wonton noodle soup!  $13, but quality duck.  Yay for Oolong tea, 1 free refill!!!!  Hard to find oolong at restaurants around here.  Hope to try the Lion Head someday... Need to see how authentic it is.  Great sauces to add to your dishes.  Hope they expand to DTC someday... We could use a place like this for lunch."], ["Nanner P.", "Happened across this place when my husband and I were craving Chinese food and wanted to try something a little different. I have never tried tiwanese food and now I'm depressed my home town does not have it!! It seems like this is authentic Chinese street food and not something at all like Panda Express or PF Changs. (PF Lames) I had the dumplings and the Sunday special (Sichuan Braised Beef Noodle) and it was absolutely amazing! The braised beef noodle was a bit similar to ramen but it had its own really unique flavor. They had about 6 sauces on the counter that we used for the dumplings and they were all awesome :) be careful of ordering too much food because everything looked delicious but entrees are big enough to share between 2."], ["Margaret H.", "Just had lunch here and it was so delicious!  Very quick and friendly service.  I saw the owner there as well.  I was waiting on a specific item and he was quick to perk up and make sure we got what we were waiting for.  I'm sure this will be a regular lunch spot."], ["Doug H.", "I'm so excited that Zoe Ma Ma has opened a branch in Denver.  Now I don't have to drive to Boulder to get a kickass bowl of Chinese noodles!  In many ways, Zoe Ma Ma in Denver is better than the original.  First of all, the space is larger so you don't have to wait in a long line to get your order in, and there are a lot more tables to accommodate the clientele, especially larger groups.  And the space is gorgeous, with an open kitchen, and an eclectic mix of modern stainless steel styling with asian accented furnishing.  It's set up with a bar area and patio as well, so it's really going to be great when the warm weather arrives.  The location is perfect, right in the middle of the Union Station development and easy to get to (just as long as you don't need to park).   And the food--oh the food--is great, and beats any other asian noodle shop in town,including Uncle.  Ma Ma Zoe really exists, and she toils in the kitchen putting out the noodles, bao and dumplings every day.   For appetizers we tried a number of bao and dumplings, both vegetarian and porkfilled. They were delicious.  We all had various noodles for our entrees.   I had the duck noodle soup which was tasty and hearty.  The noodles are handmade in the store, so they have the great chewiness of a freshly made noodle and stand up to the hot soup that it sits in.   I love the beef noodle soup; as far as I'm concerned that's the best Chinese noodle dish extant (and is authentic as what you would find in a street side shop in Taipei Taiwan).  I've even driven all the way up to Boulder in the past just to eat a bowl of those spicy noodles.   Unfortunately, on this night, it was not being served.  Zoe Ma Ma has a rotating set of noodle specials and they serve these specials only a few days of the week.  I also love Lion's Head soup and can't wait to be there on a day when that is being served.  You just have to keep coming back until you can experience the whole menu.  Ma Ma Zoe really knows what she's doing, and according to her owner-son, she's going to be more hands-on in the Denver restaurant while it's getting up to speed.  Lucky us."], ["Mason T.", "Good food and nicest grandma there haha. Decent price and also a nice environment to enjoy your food"], ["Scott B.", "This is a great little restaurant, with a very authentic Taiwanese taste. I have had the Za Jiang Mian, which is my favorite. The noodles are a great consistency, and takes me back to my travels in China. Love the pork sauce and fresh herbs. I crave this on cold days! On hot days, I go for the Cold Noodles. Super filling for a vegetarian dish, and a wonderful balance of noodles, sauce, veggies and herbs. Other things I recommend are the Iced Coffees, strong and sweetened with sweet milk. The vegan pot stickers are also good, but I prefer mine with pork. The seafood soup special is also really delicious, and fresh. It's not too fancy as far as the dining room goes, you order at the front, and pick it up yourself. Service speed is much improved since opening. I like the way they add in the tip for service. I know a few waitstaff who work in Asian restaurants. Tipping can be a real problem, as many of our lovely foreign visitors, do not understand the way it works here in America. People who work there should have benefits and a decent salary. I wont get into the whole thing, and besides, you can opt out. I just like that it sets a standard, taking the guesswork out.The sesame balls look so good, think I'll try them next, so save one for me!"], ["Matt D.", "Very fresh and tasty.  Good variety on the menu.  Extremely friendly staff.  The sustainability surcharge that replaces any tipping is very employee oriented and progressive."], ["Mai Y.", "Having read all the positive reviews on here, I was so excited when we ended up here for dinner tonight but I should have checked out the group of people on here giving this place such a good review. This place was such a disappointment. Everything was bland and flavorless. We paid close to $60 for two adults and two children and I truly regret spending my money here! No matter what sauce you use, they all taste the same. I love heat so when I tried every sauce on the counter and nothing was spicy or had any flavor, I realized why they are downtown where the Asian population isn't very high. The whole time we were there, not  a single Asian person was queuing up to get some \"authentic\" Taiwanese/Szechuan. Who are all you people thinking this is authentic? Just another one of those restaurants that have toned down on their original ethnic cuisines to suit the needs of the white American that cannot handle spice and heat!Ugh, lesson learned! You want some authentic Taiwanese or Szechuan? Head to where their own family and friends would eat there!"], ["JJ S.", "The only place I missed from Boulder was the amazing Zoe Ma Ma. Now she has opened up a Denver location and I get the fresh, clean, and perfect food without having to go up to Boulder. You cannot go wrong with the food here. If you want authentic, delicious Chinese food go on in. Chances are I will be here stuffing my face. PS Friday and Saturday is Duck Wonton Soup. Don't miss out"], ["Allie S.", "Being a dim sum fan I decided to check this place out when I was downtown.  Love the decor and the concept of the place. Plenty of room and enough outlets to get some work done.  I tried the bao pork bun.  While I found the dough to be perfect and definitely freshly made, the pork filling was not that great.  I'm used to sweeter and more flavorful pork fillings than this.  Otherwise service was great and you could tell everything was being made fresh.  Unlike previous readers I really had no issues with the 15% fee as you could tell everything used was of great quality."], ["Alli D.", "Disappointed. $18 for a noodle bowl and tea all that were pretty bland and not much flavor. The duck was just chunks of meat with bones and fat still attached that made it hard to eat without pulling it apart. Not much quality meat and way ridiculously overpriced for how little meat you got. I'm so bummed I definitely wouldn't go back :/ go to a pho place and get more flavor for less than half the price. They say organic and cage free what not so I liked that but they charge you an extra fee on top of tax and don't even tell you unless you read a sign off to the side that explains it. I don't think businesses should ever be allowed to automatically tack on fees to your total without asking your permission. Boo"], ["Rama W.", "Ordered:Sichuan Braised Beef Noodle SoupVegetarian NoodleCool NoodleSteam Boa BunsOriginal Pot StickersOld School Hot and Sour SoupBest dish out of the six items ordered was the Sichuan Beef Noodle Soup. Spicy, tender beef and rich flavor in the broth. The rest of the items were lackluster and somewhat bland. All we can taste in the hot and sour soup was the white pepper powder. The potstickers were under cooked with the pork filling still slight pink and mushy. Lao Wang Noodle House on Federal still has the best potstickers in Denver. The steam bao buns were good, but the dough was undercooked. Cool noodles were ok but still a little bland with the cool noodle sauce. Great concept but was a little disappointing. Curious if the Boulder restaurant is better."], ["J. Chris H.", "Mama cooked us mama rice! Lovely Chinese Asian fusion. Great place next to the train station."], ["Rachel C.", "Despite going to school up in Boulder, I never got a change to make it in to Zoe Ma Ma to try it. I had always been meaning to stop in, especially after studying abroad in China and missing the food! My friend and I stopped in over the weekend for a quick snack after a run through the city. The best way for me to describe the restaurant is long / narrow. There is booth seating along the set of windows, with a view of the open kitchen. They also have a nice sized patio, that once it warms up will provide a lot more seating and space for patrons. The windows open up and let in a lot of light and fresh air which is perfect for summer. We loved checking out all the Chinese movie posters they had hanging up. In terms of service, everyone was welcoming and friendly. It seems like they cook everything to order (greatly appreciated, of course), but our order came out in a very disjointed manner. I think we stood up three different times to get all of our dishes - why couldn't they just call us when it was all ready, or bring it to the table? As for the food, I am sad to say I wasn't super impressed. We ordered the chillin' veggies, cold noodles, pot stickers, and vegan dumplings. My vegan dumpling came out half open and falling apart. I tried a number of the different sauces expecting a diverse set of flavors, but from the first tastes it was tough to distinguish them from each other. Overall, the dishes we had were good, but not great. If it wasn't a freak 80 degrees out when we visited, I would've ordered the special - I'm sure that would give a better sense of the taste and quality of the food. I'll definitely be back to try the braised beef and/or the roast duck noodles and give Zoe Ma Ma another shot. Until then, I'll be heading down to Federal to get my fix."], ["Alex M.", "Overall, very tasty food.  I had the meatball with rice and gravy which was a special for that day.  I liked the sauces they put out there for you to self-serve.Inside was very comfortable, as well.I would go back!"], ["Audrey P.", "Very fresh food! Noodles are fantastic. I had vegan dumplings, veg steam bun and vegetarian noodle bowl....this is my new favorite noodle spot, and I've pretty much covered all the dimsum/noodle spots in town."], ["Barrett D.", "The ingredients were fresh and high quality and I could see this being someone's favorite lunch place - it just wasn't mine."], ["Xylia L.", "It's average by the best, the food here is a bit over priced. Not much variety to choose from. I don't understand why it have such high review."], ["Haden B.", "Reading a few reviews I would have to agree with the majority who feel the food is a little too bland.  I'm wondering if they are catering to the masses or something.  I did go when they had just opened, so perhaps things have changed.  I wouldn't hesitate to give it another shot."], ["R M.", "Delicious Taiwanese food. It was a delicious change to restaurants that my family frequents."], ["Carrie G.", "I stopped in here on my walk home and ordered take out. I ordered the Za Jiang Mian noodle dish, it was amazing and quite affordable. It tasted very fresh and healthy. The staff was very kind and offered advice on what to order for my first time in. My wait was also very short. I would defiantly recommend this place and eat here again."], ["Vickey C.", "Came to the United States for 14 years from Taiwan and is really missing authentic Taiwanese food. I finally found a good place and I can't wait to go back to that restaurant again. When we got there, the owner, mama, is actually there cooking in the kitchen instead of stay in Boulder and just have someone else runing this place. You can also see how mama and other chefs prepare our food, which is pretty cool.I got their Sunday special, beef noodles soup and my husband for their off menu special Taiwanese seafood noodle soup. Both noodle soups bases are super authentic. Beef is really nice and tendered, and it may not be spicy enough for a lot of people, but it is just right for me as I don't eat a lot of spicy stuff. The way they serve scallion pancake is different from Taiwanese way. In Taiwan, in most cases, people get one or more 6\"piece of pie, sort of like a personal mini pizza, and you usually don't share that. Here in this restaurant, they give you one 6\"pie and they cut it into 8 pieces so you can share. As of the taste, it is also a little dry from the standard. I am still happy that this restaurant has it though.We also ordered stream buns and pearl meat balls. Steam buns are general smooth meat buns. Pearl meat balls, however, could be better.Now, the dessert. The restaurant serves goji and raisin sticky rice cake. It is just right amount of sweetness and tackiness of the rice. It is popular among kids and somewhat childish adult like me. I will give this place 4.5 star."]]}