{"Amass": [], "Bistro Vendome": [], "Mizuna": [], "Epernay Lounge": [], "Corridor 44": [], "Detour Bakery": [], "Bittersweet Artisanal Cuisine": [], "JaJa Bistro": [], "A Cote Bar a Absinthe": [], "Euro Crepes": [], "The Plimoth": [], "Opus Restaurant": [], "Pierre Michel French Bakery": [], "La Merise": [], "Bistro Barbès": [], "Coohills Restaurant": [], "Z Cuisine Bistrot": [], "Vert Kitchen": [["Sam F.", "Stumbled upon this place for lunch and it was EXCELLENT. The reviews weren't lying, Vert is TINY. But it sure packs a culinary punch. Thankfully we were able to snag the bar stool table because seats were going quickly! After perusing the menu I decided on the tuna sandwich with the slaw, my mom ordered the L'Entrecôte (steak sandwich), and my dad ordered the curry chicken. Service was fast and friendly, and soon we were digging in. The tuna tasted fabulous; huge flakes that were not overly fishy but still retained the yummy fish flavor. The addition of greens tossed in some sort of vinaigrette and cucumber made it perfect! The slaw was good but I thought it had too much of a peanut taste to it. My mom loved the steak sandwich and my dad enjoyed his curry chicken which is similar to something we have at our local market :) Everything we ate tasted fresh and you can tell the employees take care when they prepare the food and place it on your plate. I love that they source locally and try to provide healthy, delicious food for the nearby residents (and the random tourist that wanders by :D) I would highly recommend Vert!"], ["Tricia W.", "What a gem! Very small, I'd even venture to say, don't go with more than one other person unless you just take it to go and eat it at the park! The whole thing is set up where you order at the counter and they bring your food. Service was super fast but not overly friendly. I had the veggie sandwich and the tomato soup both were awesome, I'd definitely recommend their seasonal choices."], ["Lynda M.", "AMAZING! I've been here three times in the last couple of months and I plan on going back. Here, I am guaranteed fresh food and large portions. It is everything I could ever dream of. If you get a BLT, you get a BACON lettuce and tomato salad/sandwich.... I mean THICK chunks for bacon or whatever else should go on the 'wich. It truly is an amazing meal and a wonderful experience.Friendly staff. Lovely food. What more could you ask for?"], ["Ana G.", "Cafe was located in a residential neighborhood which surprised me. Adorable interior, super clean, sweet decor. Got the braised pork sandwich which was absolutely delicious. I wanted another when I was done. Also got a side of the Asian slaw with peanuts with was very good also. If I lived in the area I would be a regular."], ["Janet D.", "Vert Kitchen is one of those cute finds that I'm so proud of. Listen, they're not only cute they really do make good sandwiches. I think the initial feeling walking in was that this place is legit. Looking at their menu we noticed that they have gluten free offerings. Although none of the extra fee incurred if you want yours that way. Coming from California I see that a lot. I had the BLT. I must go back and have this again. The bacon was thick and crunchy. They use the freshest ingredient and plates their sandwiches so beautifully. It's too pretty to eat:) with your order comes a choice of soup or salad. I had the quinoa. Well made with a good mix of sweet and savory courtesy of a few pieces of raisins. $12.Sun drenched front area was my fist choice although we ended up in the back porch since Adam can't stand the heat. They're equally sweet spots but the back is cooler and a bit more romantic. So Vert in French means Green. Perfect description of the place. You feel that you're eating something healthy even if you're devouring a huge sandwich."], ["Alexandra D.", "Thier turkey sandwich is to die for! Sooo good I always add bacon and extra goat cheese. I also get extra pasta salad its sooo good! I love getting thier sandwiches for lunch and its a super cozy spot to dine in or grab to go!"], ["Morgan M.", "Ummm Yes please. So good. My friend and I split the grilled cheese thing (idk its name was in french) with tomato soup and the steak sandwich. The soup was soooooo good. Rich in flavor but not to heavy,perfect for sandwich dipping. I was sad I split it because I wanted it all!!!! Also on a side note I'm pretty sure the meth head on OITNB was there so that was an added bonus."], ["Annie C.", "Stopped in for lunch with my lovely sister on a fine Friday afternoon. It was fairly busy, and the place is itty-bitty, so it took a little to get a table.On to the food: the sandwiches here are mind-blowingly incredible. I don't understand how a sandwich that sounds so simple can be soo good. Less is more, I guess?!I got the Vegan de la Saison with the quinoa salad on the side. The sandwich had avocados, strawberries, and arugula (from my fading memory). The combination of everything was impeccable. This sandwich is sweeter compared to the other ones, but oh-so tasty with just enough crunch from the bread and just enough flavor to make my tastebuds go for a whirl. (Yes, it was that awesome.)My sister had the Tortilla Espanola, which was equally delicious with a perfectly cooked potato omelette within the sandwich. This one is not sweet like the Vegan de la Saison, so if you go with a friend and go switch half of your sandwiches (like I did with my sister), eat the not-as-sweet one first and sweeter one after!!The quinoa salad was really good, too, with peas, raisins, and other good stuff, but I couldn't finish my sandwich or my quinoa salad so I boxed those babies up.Overall, this place serves exceptional sandwiches and delicious sides for about $10-12 a piece. It may be on the pricer side, but you won't even know what happened at the register, once you take a bite."], ["JT T.", "Stopped by on a Sunday afternoon for takeout.  Ordered the salade du marche (daily market salad).  It was filled with greens, asparagus, and prosciutto.  It was one of the best salad I've ever had.  Asparagus was delicious and full of flavor.  Thicker slices of prosciutto which were salty and meaty.  The dressing was tangy which help balance the flavor.I will be coming back to try a sandwich."], ["Jason R.", "I am not totally sure what all the hype is about. Both of the sandwiches we tried were pretty good. The included side salads were nicely seasoned. The location is kind of cute but... It attracts a lot of dbags. I guess pearl street attracts a good amount of yuppies in general but I feel like the concentration is higher here. My other more pertinent issues here mainly have to do with the pricing. Everything is an up charge and not usually a small one. If you want mixed greens instead of a pre-made pasta/grain salad it's a few bucks extra. Must be some killer mixed greens. I will never know. You can't sub chips for the side salad either. The overall prices for a sandwich with an included side aren't all that bad I guess but I would prefer a sandwich from masterpiece delicatessen anyday.As an unnecessary example of my earlier point, the table next to us spent the majority of their lunch talking about how one of them had to take lots of pictures of swimsuits at the mall so her husband/boyfriend could pick out \"a few\" swimsuits for his upcoming business trip to France. Her taste is impeccable apparently and he always likes her selections.I digress. To their credit, at least Vert Kitchen doesn't seem to have a chomo as a spokesperson."], ["Jerry O.", "Great food from a small unique restaurant. Order from the counter. They bring it out. Their tomato soup is outstanding. Only once has it not been available. I stop in here 1-2 times a month. Parking is limited, at peak hours. And there may be a line. But it's worth it, if you enjoy artisan food. Their veggie sandwich selection is limited, but rotates and has always been delicious. Try it!"], ["Chris P.", "Vert Kitchen brings out the basic white girl in me because like omg it's that good and I can't even. SERVICE: So, so considerate and constantly checking up on you to refill, take plates, etc. without being overbearing. Seriously, everyone there is crazy friendly. I think they put something in their water.. Oh yeah, a delicious infusion of cucumber on a hot, summer day. YUMS:* Curried Chicken Sandwich * This was my second choice as their popular Roasted Turkey Sandwich had sold out, but I would have seconds of this 2nd choice any day. Perfect flavor and all their sandwiches come with a side salad! I recommend the Thai Peanut Salad. Although judging from this one dish alone I recommend everything on their menu. Like totes coming back for more!!MISC: Cute ambience with front patio seating and a back deck. Trés chic;)TLDR: Go. Eat. Be happy."], ["Valery L.", "One of my new favorite brunch spots! The quiche of the day (maybe it was a frittata of the day, I forget) was really unique and flavorful with a great texture. The mimosas were strong and the patio was beautiful!"], ["Amanda S.", "Very cute and quaint breakfast place. My friend and I tried the croque monsieur and croque madame. Both dishes were very filling! A must try! The sandwich comes on top of a salad which was very flavorful. I highly recommend this place if you're visiting Denver."], ["Angela D.", "I like this place but it's way too heavy on the mayo and they don't serve egg whites. Otherwise it's good."], ["Melissa M.", "Excellent! Got the lemon tuna and quinoa and it was the - nice sized portion- very fresh and tasty!  Atmosphere awesome- would highly recommend it!"], ["Stephanie F.", "The service was fast and courteous We had the BLT with Tomato Soup and Lemon Tuna and salad.Both, we agree, were perfect."], ["Katie L.", "Everything was fresh, delicious, and timely. What more could one ask for on a lunch hour rush? The servers were extremely friendly and attentive. Caroline was a great server--very genuinely helpful and funny. She really knew the menu and helped me figure out exactly what I wanted--the vegan sandwich with ripe palisade peaces and fresh mozzarella cheese (yes, no longer vegan but I'm not vegan so YUMMAH). The cashier even gave me an extra chocolate chip cookie with a big smile which (almost ironically) scored major brownie points with me because I love me some chocolate chip cookies. And it was SO GOOD. Overall, I had a very pleasant afternoon eating my lunch and doing some work on the patio. If I had to recommend one thing to improve my experience, it might be to invest in some fans for the back patio. It was well shaded but there's not a lot of breeze coming through so in the 12-1pm time I was getting pretty toasty (but that may just be me). Trey bon & merci Vert!"], ["Kristy K.", "Kristy's Best Sandwich in Denver award goes to Vert Kitchen.  Holy smokes, why have I not been here sooner?  I feel like it is an injustice to my sandwich loving taste buds that I just recently discovered Vert Kitchen. Better late than never, I suppose.  Vert offers the most delicious, freshest, creative sandwiches I have ever had.  Everything I have tried has been superb.  Favorites for me: Curry Chicken, Braised Pork Shoulder, Croque Monsieur.  Each sandwich is so perfectly created.  Never did I think I would \"ooh and ahh\" at a sandwich shop.  Their sandwiches are just that good.  Note to the wise, show up early or late to avoid the lunch crowd.  This joint is small.  I am talking like 6 table small, so if you want a table get there early.  Also, the line can be out the door, so plan accordingly.  The wait at this place is worth it, promise.In sum, this place rocks."], ["Michelle A.", "Great sandwiches. Between 3 of us we had curry chicken, turkey, and the tuna sandwiches. All were really yummy. The 3 different salads were also quite tasty. The chocolate chocolate chip and fruit cookie was rich but deliciousTwo things. We could have shared a sandwich between two of us. So much food and seats are not so comfortable. Going back will be a delight. Love be to sit outside and enjoy a glass of wine with my wine"]], "Café Marmotte": [], "Brasserie Ten Ten": []}