{"Melita's Greek Café & Market": [], "Mecca Grill": [], "Chef Zorba's Cuisine": [], "FelFel Mediterranean": [], "Authentic Greek Cuisine": [], "Axios Estiatorio": [], "Omonoia Greek Bakery": [], "Pete's Central One Restaurant": [], "Yaffa's Savory": [], "Pete's Kitchen": [], "Yianni's Gyro Place": [], "Phoenician Kabob": [], "Athenian Restaurant": [], "Gyroz": [], "Pete's Gyros Place": [["Alicia K.", "Fast, friendly, fresh, and delicious. It seems to be a very regular crowd and it's nothing fancy. For the last year or so, my friend has made this their go-to gyros spot. So I had to finally try it out!The prices seem a tad high, but they do stuff the pita so generously full that you will have plenty of overflowing meat to let a friend try. The service is awesome and the food will leave you craving more. Mmm... they also have thick cut fries and another nice touch are the perfect tomatoes. I also have to add that I love when a place isn't shy about providing you with more sauce. I had devoured my tzatziki and before I knew it, our server was pushing two more little tubs of it towards us. She even gave me a to-go tub, rightfully saying \"you can't have leftovers without the sauce!\""], ["Adi G.", "I'm really torn about this place. On the one hand, the food is really good -- the pita is unbeatable and the eggs are top-notch -- but, on the other hand, their food is undermined by the consistently rude service. Two recent anecdotes to illustrate: A while ago, I was in for dinner with a friend. After placing our orders -- he got the spanikopita, which is a relatively inexpensive menu item -- he was told that he had to order something more expensive, otherwise he could not sit and eat with me.I ventured back earlier this week when my better judgement was overridden by my craving for a greek omelette. I wanted to order it to go, which their website says they allow. When I got there, they wouldn't let me sit down while I waited for them to take my order. That would've been fine if it were an order-at-the-counter situation, but it's not -- i had to stand over in a corner while I waited for a waitress to come take my order and then make my omelette. This might've made sense if the restaurant had been really busy, but it wasn't -- less than a quarter of the restaurant's numerous tables were occupied, so the refusal to let me sit or maybe offer me water while I waited struck me as off-putting. I've yet to have a pleasant experience with the staff here. I would really advise people to go to Pete's Kitchen a few blocks West instead. It's owned by the same people, and the food is equally good, but the service is consistent and much, much friendlier. TL;DR Mean people serving great pita. Go to Pete's Kitchen instead."], ["Valerie B.", "A friend brought us here and I loved the place as soon as I walked in the door.  He said the waitress has been working there since he was in high school (long, long time, in other words ).  The place feels like the institution it is.The food was good - a Greek salad and a special plate.  Hearty portions.  We left sated and charmed."], ["Malika H.", "I came in on a Sunday, quiet and not too busy. I ordered a small Greek salad and a Gyro. The salad was made with iceberg lettuce, but had a lot of great veggies and a delicious square of herbed Feta cheese. (Iceburg lettuce is not my choice of leafy greens in a Greek salad. It ended up watered down.) The Greek dressing was nothing but oil...YUCK!The Gyro sandwich came with plenty of meat, but with half a tomato that was still intact with the stem...really? I should have saved my Feta and put it on my sandwich. There is no bottled water, but I can understand, I guess. To top off my experience, the cook and the owner (heavy set lady with dirty blonde hair), start arguing over hours worked for an employee (whom does not speak English). As the other employee I standing there, the argument got louder and louder until one of the servers had to say...SSSSHHHHH! Very unprofessional to say the least. Sigh...should've gone to Gyroz drive thru...much better service."], ["Nicole P.", "You don't expect much walking in,  but this is def the best Greek food in Denver. We started with spanakopita, which was delicious.  It was a little stronger in one flavor than I'm used to. Maybe olive? Either way,  I almost spoiled my lunch by stuffing my face with this app. My date also got a salad first.  It was a delicious salad.  The veggies were so crisp and fresh and flavorful and the Greek dressing was light but drenching.  Definitely add a salad! Or actual meals were a gyro plate and gyro sandwich. Neither of us came even close to finishing,  they give soo much food.  Everything was flavorful and perfectly cooked,  tender meat, soft pita but didn't fall apart,  and amazing and refreshing tahziki sauce.  So good!  Definitely recommend!"], ["Wife M.", "Hubby leaned towards 3 stars, i gave it 4 stars.  Had 2 gyros and house/greek salad.  It was a 2 dollar up charge for the salad but well worth it.  Gyros were good but a bit pricey at $12.  Im from kansas city and could get the same sandwich for $6 (and my husband liked our place in kc better).  Waitress was pleasant and we were on vacation and not in a rush but service could have been a bit better."], ["Mark S.", "This is my first time in Denver, and I had a craving for gyros. As always, I decided to yelp for something in my area and came across this gem. I ordered the gyros sandwich w/ fries, and I have to honestly say, it was the BEST gyro I've had since I left Chicago. In fact, the waitress informed me that they order their gyros from a Chicago-based supplier. Try this place out and you won't be disappointed. Their gyros is so good it'll make you wanna slap yo momma and yell OPAAAAAA! :)"], ["Casey D.", "We Don't Need Another GyroSorry about that.  I just love the 80's way too much!  Hey, this place is fantastic!!  I highly recommend coming here for a value-packed, taste sensation!Pete's restaurants are a staple in Denver.  Each eatery has a unique flair that makes it special.  Pete's Gyros Place certainly fits that mold.  Here, you can eat like a king and pay like a pauper.  Let me start by saying that the serving sizes are phenomenal!  Your plate will runneth over.  You can stuff your face and still have some leftovers to take home in a doggy bag.  The cooks here aren't serving up Soylent Green, either.  The food is hot, fresh and toothsome.  As if that wasn't enough, the prices are incredibly reasonable.  A+ all the way!!"], ["Florence S.", "We came here because the hubby wanted a gyros. He ordered a gyro that came with fries. I ordered the sampler plate, which came with gyros meat, dolmades, olives, peperoncinis, feta cheese, cucumbers, tomatoes, and a pita. It was so good and service was awesome.  I had to get a to-go box for my food because it was huge. Of course, you have to order baklava, which I did to go, but it looked so good, I ate bites out of tge container box before we got to the cashier counter lol."], ["Jennifer R.", "Pete's is literally half a block from where I work so naturally, I end up picking up to go orders from there relatively frequently. I've never eaten inside the restaurant, but the staff has always been friendly in my brief interactions with them while picking up my food. The gyro meat is tender and flavorful and the pita is soft and delicious. Really the only drawback is the disparity between the \"hole in the wall/diner\" vibe of the place and the relatively high prices. I guess when you walk into a place that is a little \"divey\" you just expect the prices to match the atmosphere a little more. I always tip a few bucks even for takeout, but even without it's $15 (ish I can't remember specifics right this minute) for pita, gyro meat and french fries. I don't know, it just seems a little steep for lunch. Still, I think it's a really good gyro and you have to respect the restaurant empire Pete has built. For real, you can't swing a cat around here without hitting a Pete's something or another."], ["Tom W.", "As usual, another great lunch. I ordered the gyros  platter and requested  only half the fries. My buddie ordered the gyros  greek platter which comes with a salad for only a buck more!"], ["Toby D.", "I love Greek food, so much so I try to eat it 2-3 times a week. Being from Chicago, which is famous for its Greek restaurants, I'm a little picky about my Gyros and will only eat then from certain places, and Pete's will be one of those places for me in Denver. The atmosphere, service and food are all top notch and the Tzatziki sauce is mind blowing. The Gyro plate is one of the best food deals I've had in Denver so far. You probably can't eat it all, and it's all delicious. It starts with a nice sized Greek salad, that was perfect in flavor. Then you move on to the actual plate which is perfectly steamed veggies, fresh cut fries and the gyro meat and veggies with 2 half pitas. I'm trying to finish the last of my food as I type this but don't think I can. I love this place, highly recommended it and can't wait to eat here again."], ["Alicia G.", "This is the first time trying Greek food since moving to Denver and I'm pretty sure this is going to be my favorite. The food was SO good. HUGE portions (which I appreciate a lot) & friendly server (could be nicer, but I don't even care because the food compensates for this place). my boyfriend's salad came out first, which I helped him devour because it was delicious and I couldn't help myself... I had the chicken fajita pita and it was amazing.. My son had the kids gyro sandwich, he's still gnawing on the pita while we're here right now.. I'll definitely be a regular customer. Very satisfying! 5 stars fosho *****"], ["Shea W.", "3 stars for distance from my apartment, customer service, size of plates/amount of food and also price.Minus 2 stars for the gyros.I think the gyro meat is not crispy enough, a little lacking in flavor and reminiscent of bologna, to be honest.However, the stuffed grape leaves are absolutely to die for as well as the greek salad. These 2 dishes are worth a million bucks. Seriously.I was disappointed not to be able to get the chance to try their hummus because they were out...? (Not sure how you can be out of mashed garbanzo beans...seems like you could make more but ok.)I am excited to go back and try maybe the souvlaki or a kabab. Anything but the gyros, sorry Pete.P.S. The bakery next door/attached is the most amazing place I've been in my life. So go there to wash the taste of bologna out of yo mouth."], ["Jeanne J.", "I eat here a lot! The gyros is so good after a night out of drinking . The people that work here are super friendly and just plain nice. I love to go here and relax. The food is always fresh and fast :)"], ["Aaron T.", "A friend, my wife and I dropped in here early one morning after previously-mentioned friend brought it up as we were discussing nearby breakfast spots.  We were both like, \"Gyro in breakfast?  Surely you can't be serious!\"  But he was, and we went immediately.  I had the burrito.  I thought it would be just gyro meat and bacon, cause I was sure it said, \"ham or bacon or corned beef or sausage or something,\" but this thing was full of EVERYTHING plus hash browns, covered in cheese and green chili!  Made me want to move next door!    My wife had the spinach and feta and would not share!  It was good.  Friend had the gyro sandwich which looked pretty big, served with a pile of fresh onion rings.   Coffee came out before I even knew I needed it, service was freakin' amazing.    I love this place."], ["Neil S.", "Been eating at Pete's Gyros Place since it opened - used to live near there.  When in Denver, Pete's is a favorite no-frills, home style Greek food establishment.  Great for gatherings - invite friends and family and then head down there during the week - weekends it's noisy and swamped!  Next door are some sweet and tasty deserts and Greek coffee as well.  Get the platter - it's enough to feed three people.  Always great service - tasty food, excellent value, very casual atmosphere.  For those who remember Pete's steak house this is the next best thing and in some ways better!"], ["Julie C.", "There's ftiendly service here. I got Bud's Greek Salad, it was just mediocre. The gyro meat they used was flavourful but there was just way too much dressing in the salad. I took it to go, I probably should have requested to get the dressing on the side. I th ink the breakfast food might be really good here seems like even for a late lunch people were ordering breakfast foods. Th is place is like a diner."], ["Julie I.", "The hash browns here are my life. Get them extra crispy with a side of feta.It is a diner. It is old school. Don't get the coffee (unless u like 1950's bad coffee), other than that...HUGE portions, great Greek food. Affordable."], ["Justin C.", "Tasty, basic Greek fare."]], "Pete's Greek Town Cafe": [], "Cafe Byblos Mediterranean Grill": [["Whitney W.", "Great service and food. Fresh, nice portions. The owner is happy, the environment vibrant. A dependable spot for any occasion and a great neighborhood standby."], ["Shelley H.", "Last night was the second time I have been there. Overall it is very good. The service was attentive; no complaints. The hummus is delicious. The falafel is excellent, as is the garlic paste sauce.  I have never had this garlic sauce anywhere else and it is really good. A nice large salad with romaine, cucumbers and tomatoes came with our platters. The Chicken shwarma was disappointing. Other diners have had the kofta kebab and the gyro and they liked them."], ["Jordan C.", "I really really really wanted to like this place, but in the end, it wasn't very good. Service was good, though there was only a single waitress for the entire restaurant so sometimes we didn't see her for a few minutes.We each ordered a meal which comes with salad, humus, pita, and rice so there's a lot of food. We also ordered potatoes, mushrooms, garlic sauce and beef balls covered in cracked wheat. 2 of us got the chicken \"schwarma\" .The mushrooms and potatoes weren't especially good. They brought us the garlic sauce but didn't bother telling us it also came with the individual meals, so we ended up without enough to kill a horse. The chicke schwarma was nothing like the authentic kind I've had many times before (sliced off a rotating spit next to the heat source), and was dry and had a sauce that isn't supposed to be on chicken schwarma. I felt awful but I hardly ate any of it. The rice was worthless. The beef balls in cracked wheat was good. Also they don't serve alcohol."], ["Sadie B.", "I ordered the veggie platter & baklava. I love Greek food, so I thought I would try somewhere new.. The baklava was too crispy and super oily, it didn't have any flavor. The rest of the food was either bland or super sour. The place itself was nice.. And the people who worked there were really nice. Overall, I would not go back. The food was not good, I couldn't finish it. A waste of money for sure. The building is also a bit difficult to get to."], ["Leslie B.", "Delish! Came in for dinner, no problem getting a table. Had the vegetarian entrée which is great because it comes with a little bit of everything I like. A good value, really good flavors and garlic sauce ylto die for. My dinner companion had the chicken shish kabobs and practically licked the plate. I will definitely be back!"], ["Amisha R.", "Stay away from this place. The owner is rude rude rude rude!! We came as a group without a reservation to a practically vacant restaurant. The owner made us feel unwanted and told us we could leave if we wanted to. We left without even having a sip of water. If they can't cater to a group of 10 in a restaurant without guests, what is the point of placing so many tables? Worst service and worst place I have been to. I am glad we walked out to True Food kitchen who seated us and took good care of us even though they were entirely booked."], ["Nic Z.", "In life, there are things we choose to do solely to please our parents; eating Greek food is one of them for me. Mum loves it, Dad eats anything put in front of him, and I do it while wishing I could plug my nose and block the taste.Cafe Byblos changed me. It's officially billed as \"Lebanese - Mediterranean - Greek\" on Yelp, but I'll petition a change to \"Absolutely delicious - Delicious - Delicious.\"Drinks are sodas or fruit juices - choose from mango, banana, strawberry, or mix all three! The mango is apparently fresh-made. Sounded great, but we opted not to get it tonight. For the alcoholic beverage drinkers, Cafe Byblos will be getting their alcohol license in two months so, for now, they're dry.We started off with the garlic/yogurt dip and pita bread, fried calamari, artichoke hearts, and sauteed mushrooms. All finger/fork-lickin' good. Side note: I hate anything oily, garlicky, or fried - much less all three - so this means a lot.Entrees were Chicken Shish Kabob and Lamb Shank. The lamb came in a bowl the size of an Olympic swimming pool, and the chicken skewers and rice could easily be lunch and dinner tomorrow. The chicken was incredibly tender and flavourful. Yum!The entrees come with a small plate of hummus, a side salad, and basmati rice. Again, all are fantastic. The side salad, something that is usually forgotten before you even swallow the first leaf - was actually incredibly good. I hate dressing, and this had a barely-detectable semi-dressing that was wonderful. It tasted so fresh and crisp. All of us were laughing at how we almost never touch these salads because they're so bland, but this one was truly lovely.Portions are HUGE - easily 2-3 meals, maybe 4 for me - and the prices are incredibly reasonable considering this (I thought they were already, even before the plates landed on our table).Run, don't walk. Come here and eat everything.____________Update: I took some of the Chicken Shish Kabobs home, and it was still delicious later -- both cold out of the fridge and heated up. Now, that is good food!"], ["Herman G.", "The owner was extremely rude. He spent almost 10 minutes telling us that his restaurant is a \"reservation kind of place\" because we arrived without a reservation, even though my friends had visited before without reservations or problems. It is worth noting that the restaurant literally had one table occupied out of about 20 tables at the time.The owner actually made us feel unwanted in the restaurant so we got up and left before we even ordered our food."], ["Harsh S.", "I'm a fan of middle eastern food and I've been to several here in Denver and then I stumbled on this hidden gem, my god you had to roll me out of this restaurant, it's totally hidden in a residential neighborhood but the food is to die for, never eaten such moist chicken and the kobabs, they literally melt in your mouth and the servings are huge, definitely go with a big appetite, the eggplant appetizer is a must also and the hummus is amazing"], ["G K.", "GreasyWrong seasoningsBread stale and tastes like cardboardThis is not Lebanese food. Just the name says Lebanese but the food ain't."], ["Frances G.", "They have a great lunch special everyday from 11am - 4:30pm. So, I fully intend on returning to stuff my face with their dynamite dolmas and artichoke salad over lunch for the next few days. In fact, it's going to be hard to pull me away from this place. Maybe when I start smelling like a falafel it's time to pump the breaks. But until then - I'm all over their delicious Mediterranean grub. The artichoke heart salad is fresh with plump artichoke hearts bursting with flavor accompanied with a certain sauce that I can't identify. I just know it has a zesty flavor that compliments the flavor of the artichoke heart perfectly. Snag that with a side of hummus and pita bread - and you're set. Unless you crave the meat: in that case I suggest you peruse the delicious looking gyros in the menu."], ["Fred B.", "Vegetarian friendly.  The felafels are among the best I've had: light and un-greasy.  The toum appetizer is amazing!  Service is fast and friendly."], ["Riza H. C.", "WARNING :  This SHALL be a Lengthy Review.Saturday March 30th 2013.  18:00hrs EVENT.A few weeks before that evening, I have called Café Byblos for reservation.  I arrived early so as to make sure things will run smoothly etc etc for the Evening Party.  I was at Byblos around 17:40hrs ish.Café Byblos, THANK YOU.  Bringing 21 of my friends to dine in here its not an easy task.  Luckily, when I called for reservation, our table were ready for us.  The staffs who handled our BIG PARTY that evening of Saturday March 30th 2013, were indeed gracious, inviting and welcoming..To prepare 22 items or more coz some of my friends order several appetizers, and preparing 22 Main Entrée for our group is definitely NOT easy.  Yet Café Byblos managed to handle it.  Kudos to the Chef, the kitchen crew and all the staffs.Though the service was slightly slow that evening, coz there are also other Patrons dining in, who sat at the other side of the establishment, I can understand that.There weren't enough Water Pitchers for the group, but at least everyone managed to get their water, and other beverages that evening.  These include several orders of Tea.  From what I could recall correctly these were the items my friends ordered that evening :Appetizers :*  Falafel*  Dolmades*  Mediterranean Olives*  Kibbi Aras*  Filo Pies*  Several orders of Calamari*  Crispy Eggplants with YogurtSoups :*  Lentil*  Several orders of Lamb TongueWhile for their Main Entrees, if I could recall these were the items my friends ordered :*  Several order of Lamb Shank*  Several order of Mixed Kabob Grill*  Falafel Sandwich*  Byblos Combo*  Veggie Combo*  Shawarma*  Shish KabobAs for me, I ordered these items that evening :*  Calamari ($6.00)*  Gyros ($14.00)and these items TO GO for Hubs :*  Lamb Shank ($18.00)*  Mixed Grilled Kabob ($18.00) of 1 Lamb Kabob, 1 Beef Kabob and 1 Beef Kafta One of my friend ordered the Home-made Baklava.Some of my friends like the food they ordered, some do not.  So I can understand their sentiments.  As for me, the FOOD is 3.5 stars at BEST, coz I like my order of Calamari, and Gyros.  The Calamari comes with the Harissa (Spicy Red Salsa) mixed with Yogurt, that they called it as Marinara.  The Gyros are tender and flavorful.But the qualms was in the packing of food TO GO.  YES, they were put in Biogradeable Disposable Boxes, but by the time, I reached home some of the food, sipped out so fast and make it slightly problematic and I have to transfer the leftover and TO GO food, in our own home containers.Nevertheless, all in all though with slight hiccup with service, aka slow due to our BIG party, Café Byblos DID A GOOD JOB for our BIG group.  A BIG THANK YOU to the server by the name of Bethany too.  Left the establishment at 20:40hrs ish.  I don't mind returning when needed.@73/2013"], ["Jennifer B.", "Looking for a place for dinner after some long travel days and Café Byblos was on the BF's mind and I was intrigued.  Parking is a little tight but I was pleasantly surprised to notice Café Byblos is right next door to my favorite Nail Salon (B Nails).  Place was quiet on the night we went and we sat in the front area.  We were feeling munchy so I think we were ordering more like tapas style so we could have a variety.  We tried the following:Hummus - creamy and deliciousPita - Not the best but it was a vessel for the hummusBaba - TastyGarlic Dip - If you're a garlic lover this is a must tryBeef Shwarma - Tender and succulent beef, good rice, and a tingle worthy spicy red sauce (yummo (channeling my inner Rachel Ray, LOL)Can't wait for this place to obtain their liquor license - what a combination that will be.  It will be the trifecta, service, quality food, and booze.  Count me in."], ["James L.", "Nice selection and servings of delicious foods.  I was especially thrilled to find and eat one of my favourites:  Kobebas (another name on the menu) YUM. try them with a little lemon squeeze.   I found the hummus lacking in character, and my starter plate of it bad.  Starter green salad was most refreshing and perfect!   Wife loved this place, and said she'd return anytime.  Biggest complaint is the atmosphere.  While the restaurant features Mediterranean colours and friendly efficient service, there's a lack of middle eastern character.  Worst was the BLARING TV in the dishroom, overpowering any background music.  I even asked the TV volume be turned down, but no such luck.  My brother visited the restaurant on our recommendation, and reported the same distraction/annoyance.  Maybe take out is our best option next time..."], ["Kristin B.", "Second time here in a week.  I am traveling for business and was in the mood for Mediterranean food and found this gem last week.  Today I was bringing lunch to a group at NJ and forgot to make arrangements beforehand.  I showed up right at 11:00 when the restaurant opens and was expecting time restraints for take out to be a problem.  The owner (I think)  was so helpful and friendly, he said he could make it all no problem.  The food was delicious and the group at NJ could not stop raving about it.  Love the Baba Ganoush, this is my favorite of any I have had.  Can't wait for my next trip to Denver (Feb). for my Mediterranean food fix again.   I will be back!"], ["Julia R.", "The food here is amazing. Got the veggie combo and loved everything, but the baba ganoush was particularly delicious. Everything was cooked perfectly and tasted very fresh. Will definitely be coming back!"], ["David T.", "I should have stayed in bed today.  Everyone has been out to get me - even my beloved Cafe Byblos.  I have been an unabashed supporter of this place since day one.  They're in my 'hood.  Food is good and sometimes great.  It's pretty and clean which is refreshing in a Middle Eastern restaurant (I'm looking at you Jerusalem - eww).Felt like eating semi-healthy and wasn't in the mood to cook.  Cafe Byblos is about four blocks from my house so I called in an order for their normally very tasty veggie combo (small salad, hummus, baba ganoush, a couple of dolmas, a couple of falafel, a spanakopita, lots of tabouleh and tasty rice - $14 - best deal in town and ready in 10 minutes).Me:  Could you make sure they give me harissa instead of tahini sauce for the falafel?  I like the spice.Her:  Not a problem it automatically comes with your order.Get home.  You guessed it, no harissa.  Ice cold pita still in their store bought plastic wrapper, spanakopita soggy.Not their best effort.  I was grumpy before and now I'm even grumpier.  I think I'll make myself a cup of Sleepytime, watch West Side Story on PBS and turn in before anything else can go wrong today."], ["Christie J.", "Well priced, big portions, friendly service and DELICIOUS FOOD! This restaurant is kind of off the beaten path but it's worth the search.Split the vegetarian combo, lentil soup, and Greek salad with my insatiable brother and we were stuffed! The falafels and hummus were the best I'd ever had, and everything was great. Go getchu some."], ["Kristin T.", "The food is delicious, too bad their service and attention to detail sucks.  We order take-out for lunch for our office quite often (at least 1x/mo for 8-10 ppl). They rarely can get all of our orders right.  They are inconsistent with sides and portions.  Today they failed to include hummus with my platter, a main component.  I will be finding another greek place to give our business to.  If I failed at my job as often as Cafe Byblos fails on take-out orders I would have been fired ages ago."]], "Taziki's Mediterranean Cafe": [["Holly H.", "Given that this place is only 8 days old, i had to chime in. My husband and I quite liked this place. Their gyros neared our gold standard gyro place, Cafe Athens in Fort Collins. The sides are unique, which is what ranked them behind Cafe Athens- sometimes, super crunchy shoestring fries can't be beat. I got the beef tenderloin gyro, and I was really impressed with the flavor of the meat. It rivaled the best fajitas I've ever had, though it didn't have a fajita taste. My husband got a lamp gyro, and kept talking about how good it was, so that was a good sign. Their sides are unusual. Not unusual in themselves, but unusual as a side. Basmati rice, roasted potatoes, fresh fruit and a few others I can't recall.The staff was crazy friendly- I imagine that being open for just a week has motivated them to get every customer that walks in the door to come back, which we probably will.I thought they were a bit pricey for a fast-casual restaurant ($9.39 for a lamb gyro and one side), but they did have a nice dining area and I felt the ingredients were good quality. The meat was identifiable, and the tomatoes were actually red. I trust them, which is more than I can say for some Greek places- that meat is easy to disguise. I would certainly recommend this place to anyone who lives nearby and needs a break from SmashBurger."], ["Joe H.", "Ordered the pork loin dinner for four this evening. Added grilled veggies and dolmades. Overall.. It was great. Well worth the price for the amount of food. And everything, including the sauces... We're all solid. In addition, they forgot something in my order that I didn't notice until I got home and they immediately drove it over as well as provided us with some free gyros coupons. Well done. Not saying it's user authentic Greek but it was fresh and tasty."], ["Hal H.", "Really good. Attentive staff. Not inexpensive but a good value."], ["Nathan C.", "Came here for a quick dinner.  Place was clean and the people were nice.Most importantly, the food was delicious and reasonable."], ["Caleb S.", "The food here is excellent. Fresh. Great tasting. Hummus and warm pita bread is about as good as it gets. A little overpriced and the drink refills are too slow for my liking but I have a feeling that the worst offending server won't be there much longer. Try this place out."], ["Mar S.", "Went on a Friday night and the place was dead. That should've been our first clue. I ordered the lamb gyros sandwich and my husband ordered the chargrilled lamb. My sandwich was not gyros but more of a lamb kabob. Both of our lambs were dry and the tzatziki sauce was watery and not flavorful. My husbands plate was small and cost an additional $2. The food is way too expensive, especially for the lack of taste, over-cooked, and small portions. We left disappointed and hungry."], ["Christine T.", "Please keep in mind this rating is based on fast-casual experiences, which was...impressive! Fresh, hand-made ingredients. Soft pita bread and great side options. I visited during their opening week at a slow time and received friendly service and well-executed food. The pesto in the chicken basil pita was freshly made and had a nice basil flavor; the grilled chicken was real chicken cooked well and had a nice flavor to it (not dry.) Great weekday lunch spot!"], ["Bryan L.", "Our first visit to Taziki's was fair. This is a fairly new neighborhood establishment. The waitstaff was very attentive and friendly while offering to answer any questions we may have about the menu. I ordered the Chicken Pesto Gyro with a healthy side. What I didn't know is the Gyro comes with crinkle-cut potato chips and it's not listed on the menu. Not a healthy choice at all... however I was able to substitute fresh cut fruit for .75 along with my other side. The seasoned new potatoes were good at first, but left me wanting something more flavorful. The fresh fruit was out of season, firm and bland. The chicken in my Gyro was only fair. I encountered an extremely long chewy piece of dry chicken that seemed completely out of place in comparison to other tender morsels. The waitstaff and other team members we met do get a passing grade, but sadly the food didn't match their positive attitudes. We'll give it a few months and try again."], ["Debby S.", "I'm a middle eastern woman and food snob and this place just doesn't cut it. Over priced for what the food is and no wow factor the grape leaves are stuffed only with sour yellow rice no meat no tomatoes no nada ;( overall don't plan to be back"], ["Courtney B.", "Meh. The gyro was pretty good, but small for $10! Served with potato chips... Hmm... Strange. I also go hummus which was good, but served with crunchy pita chips- not what I expected so I was disappointed. Overall, it's not bad, but disappointed enough that I probably won't go back."], ["JH D.", "Delicious...and I'm a food snob.  I was hesitant to try since it looks like just another chain, but it was really very good.  We had the Tilapia Fish Sandwich--tasty and perfectly cooked, the Med salad--big and full of fresh veggies, and the Veggie Wrap--good but I'm sure it would have been even better with fish, chicken or lamb (but we are vegetarians).  The portions were large, the entrees were yummy, the roasted potato side was so good, and the price was fair.  And like everyone else said, the staff was super friendly and the inside was cute for an order-sit style restaurant.  We will definitely be back!"], ["Kelly W.", "Dropped in to try the food not expecting much from a fast food kind of place. The service was great and the food was fresh and delicious.  Definitely will be back"]], "Vesper Lounge": [], "Citron Bistro": []}