{"India Tavern": [["Nick V.", "Great food and service. I need to preface this by saying I did not eat at rage buffet. It looked good, but I just don't do buffets. If I wanted food from a communal trough I wouldn't go to a restaurant. A good bonus is that they're open through the through period, that lull from 2pm to 5pm that most Indian and Nepalese places close for. My fiancé and I split a chicken momo entrée with hot spicy sauce, chicken korma extra spicy, garlic naan, onion kulcha, and plain naan. I had a hot chai to drink and they left a tea pot on the table which was excellent, just like the tea. Perfect blend of spice and dairy. The steamed momas were a little dry, like what happens when they are prepared, frozen, microwaved, and then steamed at the end. They did taste great, but could have been so much better. The korma was much darker than most but had great flavour. Not my favourite korma ever, but pretty darned good. The extra hot was not hot at all but korma is a very rare dish to begin with. The naan was a little small but tasted good. They were pretty thin on the scale of naan but definitely leavened. Botttoms ranged from perfect to crispy to black, but that's just extra flavour. The garlic naan used real pieces of fresh garlic which is good. The onion kulcha had red onion I think embedded in it that had a good crunch but we're not raw. They prepared it very well. Overall a great experience. Nothing was the best ever, but it is worth returning."], ["Kara T.", "I've now been to India Tavern twice for the lunch buffet. It's only been mediocre both times. The service was only ok, too. I was pretty disappointed by this since a lot of my coworkers had raved about this place. The first time was just a couple of friends during the work week. There weren't that many people there, and it took a bit longer than I'd expect to get some water and tea. The food was okay both times. By far the best dish was the tikka masala. The other dishes were just a little off to me, or seemed to be missing something. The saag was missing what I thought was supposed to have cheese in it. Kind of disappointing.All in all, if you're looking for a quick lunch and something different from the Chipotle/Noodles-types of restaurants, may as well give this a try. Maybe if you go in with lower expectations than me, it'll be awesome for you!"], ["Lee S.", "Amazing lunch buffet! Great service beautiful decor. I came toward the end of the lunch buffet but it was all still freash"], ["Jen L.", "I had dinner at this spot near my conference hotel and was excited for Indian food since  my hometown is not so well known for that.  We nearly had the place to ourselves and the four of us ordered a pile of food. Everything was tasty and the food came out pretty quickly despite the single server. We shared the shrimp pakora and the veggie samosas and both were tasty. I couldn't resist the Navrattan Korma as my entree and I was pleased that they offered Saag Paneer as a side so I sampled a bit of that as well. All my friends were pleased with their entrees as well. The spices were a little different then I was accustomed to but I discovered that this spot specialized in Northern India cuisine so there you go.My guess is that they are more of a lunch spot and they do have a bunch of steamer tables for their lunch buffet. The staff was really accommodating. One of my dinner companions asked for a non-menu item (by description and not name) and they immediately made up a batch."], ["Priya A.", "I had the buffet which was cold and everything was almost gone but they made no effort to refill. Everything was tasteless, the naan bread was dry, dal makhani had no salt, and I am still not sure whether the one curry they had was chicken or paneer. The appetizers including the chicken tandoori was insipid. It felt like a hotch potch of some curries. Not recommended at all. On the other hand the ambience is really nice, loved the Fida Hussein art reprints. And the cocktail list was impressive."], ["Amisha R.", "Ordered Paneer makhani: bland, tasteless and way too oily. The host did not write down orders. We asked him to write it down when he repeated the wrong order. Said he would remember but still messed up and delivered a wrong order. Had ordered samosas that did not look appetizing at all and the chutneys were so off, I could not palate it. I wouldn't come back to this place."], ["Amanda D.", "Five star just because they use swordfish for their fish curry, rather than those cheap soft fish.  I also had the buffet with big chunck cauliflower steak and all your Indian stables like Saag Paneer and Tandoori Chicken. Very contemporary interior with high ceiling and attentive service. Both food and drinks are on a pricey side well I guess it's for a reason. Overall good experience. Will definitely come back."], ["Kristin M.", "I wish I never had to give a bad review, but not every place deserves a good review.Husband chose this place based on the $20 for $10 deal you can buy via yelp. Good marketing, but I can say I will never go back. I always tell my husband to read the yelp reviews, but he's never as religious in checking yelp reviews as I am.  If you have read my other reviews, you know I judge Indian restaurants by their saag paneer. I cook Indian food myself at home (naan included) so its nice to splurge from time to time at a restaurant because they have access to do many more exotic spices (those that are harder to find and usually out of my budget to buy in small quantities).I would rate the saag paneer a 3; as it had good flavor and ample paneer. Nothing special though with not nearly the complexity of spices found at other restaurants and it was a bit on the thick side.  I wish I could give India Tavern 3 stars based on the saag paneer, but the rest of the meal was not very good. The naan was terrible. Hard and chewy, barely tearing with your fingers or your teeth. Stale, day old is what it tasted like (other revised say the same). I can tell you it's not hard to make naan, so I am not sure what their kitchen is doing here. The chicken vindaloo flavor was good, and very spicy, but the three pieces of chicken were inedible - tough, dry and too many tendons. I think I got one edible piece of chicken.For a $40 tab before the coupon (2 entrees, 2 naan), I felt cheated. I should have spent $15 dollars at Chipotle and left with a smile - even $8 at taco bell would have been more satisfying. On a good note they don't charge extra for the rice here."], ["Sara V.", "Worst lunch buffet, no spice, no variety, nothing.Pakoras were under cooked on the inside. Samosas were burnt on one side,Veggie options: plain dhal, boiled broccoli(wtf), chick peas, plain spinach. All bland.This place's buffet is a shame for Indian cuisine"], ["Jay G.", "Food was OK for lunch buffet ( that's the only reason it got more than one star), but the buffet was poorly stocked. We did arrive at 110 PM, but there is no excuse for us having to repeatedly ask for more bread, more of the only 2 meat dishes and more of the samosas. The second chicken dish was never refilled.  The hot sauce was never refilled and there was no spicy pickle. We tried to use a Groupon, but I made a mistake and missed the clause that said it was only good for dinner. The manager was very rude about it when I tried to use it . Of course he didn't point out his own coupons right on the front counter that would have given me a $5 discount and made me relatively happy. I got a refund on my Groupon as we will not be going back to this restaurant."], ["Kendra W.", "Food was not very good. The service was very slow and only one person was working at the time . I would not recommend this place for dinner. Came on a Friday night and the restaurant only had 3 other couples seated and only one staff member working in the front. Took us awhile to be able to order our food and even longer to get the food. The food was not very great I got butter chicken and cheese nan. The chicken tasted like it had more Mexican food spices in it than Indian spices. Got cheese nan and it had barely any cheese on it and was very dry. Then after eating it took awhile to get our check even though the waiter saw that we were clearly done. Will not go back again maybe there lunch buffet is better."], ["Hanh P.", "Went here for lunch on a weekday.  If you're looking for a place with no wait, well India Tavern will get you right in.  There were only a few tables there at peak DTC lunch hour.  The buffet has a very limited selection.  Really not impressed with the flavors.  Masalaa, saag, naan were all pretty disappointing."], ["Jacob T.", "Not bad for a buffet lunch, but dinner is always oddly empty. The food I find is a bit too watery and mildly spiced. I prefer Little India for the depth of flavor I love about Indian food, and after being in India and sampling a wide variety of Mumbai street food and \"traditional\" Indian dishes, it's hard to return here and settle for their versions of it."], ["James C.", "This is my wife and my favorite Indian restaurant!  The Saag Paneer and Chicken Saag is what we always get.  Oh, and don't forget the chai - BEST CHAI EVER!  The workers are also very nice and will always serve you more chai tea.  Their lunch is delicious and their dinner portions always generous."], ["Teresa M.", "Small cute place that is clean and well decorated.  Had dinner here Saturday night and was seated promptly, it wasn't crowded.  Staff was polite and attentive.  We ordered the saag chicken and korma lamb.  The saag was good, but the korma was amazing!  Rich and savory with a touch of sweet from the raisins.  It was a little slow getting the food but didn't matter was having fun talking with friends.  The food tasted freshly prepared, not like some other places were its been simmering in the kitchen all day. I would eat here again and recommend to others."], ["Kelsey T.", "Great food and service. Enjoyed the Chicken Tiki Masala. Yum! We also shared the rice pudding dessert. We definitely weren't disappointed, and we will certainly return soon! Oh, and let's be real, Nan is always a must. Enjoy!"], ["Jennifer R.", "Just mediocre. A few years ago, this was the best Indian food on the south side of town. Now, we will choose India's Kitchen in Parker or India's Clay Oven in Lone Tree instead. The samosas were tasty, but my chicken korma was bland. My husband's saag was good, but not as flavorful as others we've tried. The naan is really good, but the paratha is not - too thin and greasy. The service is also just OK, as is the atmosphere. It has been really sedate the past few times, which makes a person think it's gone downhill. Too bad!"], ["M S.", "Had the lamb biryani, one of my favorite indian dishes, for dinner and it was a disappointment. There was a lot of rice and not enough meat. The rice was on the verge of being undercooked and the meat itself was bland and dry. Although the serving size could be good for 2 people, still it came up to $21 (including 15% tip), without any naan or even chips to start with!  (It did come with some sour yoghurt which I barely touched). Parking is difficult to find, and for dinner the restaurant was kinda dark and gloomy. The service was not bad. May give this place another try but right now it's at 2-stars."], ["Jessica T.", "Great lunch buffet with hot naan brought to your table.  I really appreciate the extra touch of them bringing the naan to you, all hot and buttered, rather than having to balance it on your plate as you walk from the buffet.They have a relatively small selection, but everything is hot and fresh.  Per buffet standards, the food is pretty basic in terms of spice level, but the saag paneer and chicken tikka masala are staples and quite tasty.  $8.95 for the buffet.I gave them extra star for absolute cleanliness.  And it's always nice dining with a proper napkin rather than paper.  Even the silverware is sturdy and classy. They tend to be pretty quiet during the lunch hour, which is unfortunate, because it's one of the better Indian buffets around when you look at the food, service, cleanliness, upscale decor and price.  I've been here half a dozen times, and will continue to keep them on my lunch rotation."], ["Brittany M.", "Hands down the BEST Indian food in the city!! I've never had a bad meal here and I will gladly drive down from cap hill for the chicken tikka masala because it's amazing! It's family owned and authentic so If you're looking for great Indian food make sure you check this place out!"]], "Bombay Clay Oven": [], "Azitra": [], "Little India Restaurant & Bar": [], "India Oven": [], "Zaika Indian Cuisine": [], "Saucy Bombay": [], "The Taj Restaurant": [], "Little India": [], "India's Restaurant": [["J F.", "Top notch food. Superb intimate service. Warm and inviting atmosphere.Best Indian restaurant in the city - have followed them through 3 locations now.  Chris is the owner and takes very good care of his customers."], ["Hilary K.", "The best Indian restaurant with the nicest owners!I ALWAYS get garlic Naan and Lamb Saag (mild) and it's lovely - usually have leftovers for the next day. I have tried other dishes but love their Saag! Try the chai after dinner, also! Yum!"], ["Ami J.", "My husband and I only come to Denver once a year but India's became a new tradition for us the first time we came here! So last year I got the lamb Josh Rogan and my husband got the Gosht ka Salun. Mine was excellent but I liked my husbands better. This year he got the same thing and I got Naryal Chicken, which ended up being the same coconut sauce. Again, incredible, but I like the Gosht ka Salun better (I just like lamb better)! The naan is great but I do like mine softer and more buttery (probably very American of me). Next year if it's on the menu still, I think I'll try the goat curry! Eat here! You won't regret it!!"], ["Sarah H.", "While the food is delicious, it is pricier and the portions are ungenerous compared to other Indian restaurant. Also, service has definitely improved compared to the past few times we dined there."], ["Hannah Y.", "I decided that it was time to re-review this place since it has moved locations.I think moving locations (for what, is this the 3rd India's location?) and finally building up a place brick and mortar has made this place even better... (If that's even possible). The time I went most recently, my husband and I went there for dinner. We ordered two of our many favorites: chicken tikka and saag paneer. It was like we died and gone to heaven. The flavors made my mouth ridiculously happy. For an appetizer we had breaded and fried paneer (basically Indian mozzarella sticks but 100x better than regular mozzarella sticks). Of course, for dessert we couldn't leave without order their kheer. Oh My Kheer. It hit all the right places! We also ordered the mango custard just because it sounded light and refreshing. We are early birds and went out to eat at 5:30. By the time we were leaving (around 6:40) the place was packed! It's also packed every time I drive by here.I wish I could give this place 6 star but I can't.So, my husband takes me out for a birthday dinner every year. I usually pick fancy/trendy/expensive places but I have to go here this year. I want to have a good meal and I know I can get one from this place."], ["Denise R.", "I have to say when it comes to Indian food this is my favorite place they have a buffet so you get to try everything under $10 everything is so home made to taste .. A definite must try PS they are moving locations real soon here"], ["Mohammed Shakir R.", "Food was good, but make sure you double check the bill. They added many extra things to my bill"], ["Amelia E.", "This place is incredible. The curries are unbelievably flavorful and delicious. The staff is also warm and welcoming. I would seriously cut off my right pinky toe for another meal right now."], ["Jenyfer K.", "Wow. This was really good. Service was excellent the food was amazing. My first time eating Indian and it was fantastic!"], ["Emily M.", "Went here for dinner last night and overall it was solid Indian food. The decor of the restaurant was colorful and tasteful - not overdone. Each dish is made separately, so you can pick the level of \"spice\" you want. I got medium chicken korma and my friend got spicy lamb vindaloo. Each dish came on a tray with a mini salad and bowl of rice. My friend seemed to enjoy the lamb. The chicken dish had a good spice level and a decent amount of raisins and almonds in the sauce. Huge menu and lots of options - I'd like to try more sometime."], ["Michael H.", "Loved the new location, the decor, and the service. One problem it pains me to mention: food seems down a notch from our experience in the past. I had the mixed grill and found the salad equivalent to airline standards (brown and 2 days old), the lamb and chicken dried out. Good news: the chutney, the papadums, the shrimp all just as good as in the past. I hesitate to post this, as this restaurant has long held a special spot in our memory. I think I should have gone with my all time favorite, the shrimp ticca masala, so maybe my fault for ordering the wrong thing."], ["Amy L.", "I'm going to skip right to the food, and say that the Chicken tikka masala is so flavorful and really has that special quality I look for in curry. It tastes even better with a little bit of the white yogurt sauce mixed in. This may be the best chicken tikka masala I've had in Denver. That being said, the proportions for the dish is off. They serve about 2 cups of curry with 1/2 cup basmati rice and 1/2 cup grocery bagged salad. My bf and I decided to order a side of roti to finish the curry. I didn't touch the salad... It wasn't fresh. The servers made me feel a bit awkward as they  would stare and for me to finish my food before taking the plates away. They were very attentive and polite though. I would come back if the price was not so steep since the curry is phenomenal. Medium heat is perfect."], ["StrEats F.", "Lunch buffet was not up to par...items were obviously sitting there for extended periods of time, which became oh so clear with the rock hard naan.  Saag Panner lacked flavor, Chicken Tikka Masala was over salted, no lemons with tandoori chicken, and did I mention the naan?  Instead of coming up to me and asking the generic question of \"Everything good\", walk your buffet line, man!  If you really care about food, as any person working in a restaurant should, you could immediately see what needed to be changed out or at least made look fresher.  The check was delivered as I was on my first buffet plate...Got the point and up and left."], ["Shane J.", "This place is fantastic. I don't eat Indian food often, but I could eat here every day. It's a _must_ every time I visit Denver. I had lamb in a coconut sauce and I couldn't be happier."], ["Lynzi J.", "I really wanted to love this place as a friend claimed this was the best Indian food in Denver, but it just wasn't for me. That being said I have never been to India or have an understanding of authentic Indian. I will say that Chicken Tikka Masala is one of my favorite meals in the world, and I would go to Little India over this place any day.The honest truth is that I would have given this place another go and tried more on the menu had the service not been so terrible. They seem to have no system of who is waiting on you, and I never go a refill on a drink within 20 minutes of asking. At one point I had asked three different waiters for a refill over 20 minutes and still nothing came.I would have given 4 stars as the food was pretty good, but minus 2 for some of the worst service I've had in a restaurant in ages."], ["Valerie F.", "Excellent food! And amazing service! 5 star!!! I ordered the chicken ticca masala with garlic & onion peta bread to dip it in & it was delicious!"], ["Jenny M.", "Still my favorite in town for Naan, Saag Paneer, and Chicken Tikka Masala.  I also really enjoy their extensive hot tea selection.Also I was really happy with the Chicken Tikka salad, its nice to have some diet friendly options.Service can be mixed here but was great this time around!"], ["MC C.", "This is the best Indian food I've had in Denver. We were some of the only customers at the time we went in but the service and food were excellent. We got the onion Bhaji and Samosa's to start. Onion Bhaji was the star. The sauces they bring out at the beginning were definitely the best I've had. I got the Saag Paneer which was perfect. I don't remember what my husband had, everything faded away when I tasted that Saag Paneer but he still talks about this place so I know he liked it. I would eat here every day if I could. And finally, as a Texan, I take my ice tea very seriously and it was also delicious, almost with a chai like after taste."], ["Brian B.", "Food - Best around period. Perfectly spiced and great balance of flavors.I agree with the other comment about the portions. Why do they skimp on the rice so much? Just ask for extra rice. I usually do, but this time I forgot. I am now eating Tikka Masala with a spoon.Also, the price is getting a little high. We may need to add another $ sign to this one. One order of masala, samosa and naan runs $28!!!! There is a buffet up the street for $15 that includes all this, and all you can eat (and all the rice you want!)"], ["Nicholas M.", "The food is decent. But the value isn't there. I felt like the dishes were 3 to 4 dollars overpriced and for the price you're paying it did not come with quality sides.Garlic naan bread is top levelService wasn't the bestBut decent quality entrees"]], "Yak and Yeti Restaurant & Event Center": [], "Mr. India BBQ": [], "Taj Palace Food Truck": [], "Ambli Denver": [], "Namaste India": [], "Yak and Yeti Restaurant and Brewpub": [], "Biju's Little Curry Shop": []}