{"Spuntino": [["Kelly O.", "I love the ambience at Spuntino, and have some decent pasta dishes (and excellent wine, cheese and appetizers). Plus the staff is nice and knowledgeable.Only three stars for the high prices on the pasta--though I love the perfectly sized, smaller proportions (which reminded me of Batali's informal pizza joint, Otto, in NYC), but it's like they forgot to also match the price. Seems like they're about double what you'd pay at Otto for the same amount of noodles."], ["Teri W.", "What a find!  Cozy, tucked into the neighborhood and just such good, fresh food.  I wish I lived in the neighborhood!  We decided to go for lunch on a fortunate day off during the week.A nice selection of panini, salads and sandwiches.  Try the Beer Cheese Soup!  Yum!  The waiter/bartended was very knowledgeable, attentive, and seemed to really enjoy his work.I think we better try dinner next time!"], ["Macy W.", "I've been to Sarto's, which is great. But this little joint is without a doubt the best contemporary Italian in all of Denver. Superb from start to finish. Brilliant atmosphere. Smart wait staff. Creative cocktails. Great wine. Nothing is missed here."], ["Brianna B.", "Spuntinos is a great place to share some small plates. Often an overlooked tasty gem of modern food and wine, you need to check this place out. Even though I stopped in during Restaurant Week, you would never know from the quality and attention each plate gets. Our waitress was sweet and knowledgable about all the dishes and the wine selection. She also help convince my friend to try their octopus and sea vegetable appetizer - which was my absolute favorite. The octopus texture was meaty and no where near the common chewy you often find. We also ordered a small cheese plate, something I will return just to snack on again. With almonds, honey and aged Spanish goat cheese. Yum!Every dish was equally simple in presentation and complex in flavor. Smart cooking and delicious concepts."], ["Michael H.", "My wonderful daughters took me out to eat here for a birthday treat. It was great. We tried at least 25% of the menu. Favorite food items were the octopus, mushroom soup, crispy chicken, tuscan salami. Nice wine list with a range of choices. Service was good and we felt we could stay at our table as long as we wished. W32nd Ave is in an interesting neighborhood. Any gripes? The kitchen was kind enough to split our single order of soup 3 ways, but it was lukewarm, a minor disappointment."], ["Martine C.", "We waited 20 minutes for a drink, 45 minutes for bread. Vegetables on a board tomatoes and mushrooms yummy ,pickled baby turnips ,green beans carrots, eggplants ,a teaspoon of each -so vinegary it hurt.Next came a small tiny bowl of pasta with breadcrumbs and it was so full of anchovies so salty it was like a salt lick literally . Next came a vegetarian dish of crazy salty chickpeas topped with  slices of eggplant my friend had to spit it out she thought it was gross,that was a first. House made ice cream- toasted almond no toasted almonds or even a hint of almond,pistachio no nuts no flavor. Very good truffle! Would we go back, my husband said not a chance.$$$$$$$$$$$"], ["W F.", "They have really gotten their act together. The food is fabulous. I had to try it one more time since I had some time in my hands and they have the best leisurely lunch in LoHi. Their service has improve 100% and the food is still fantastic. I have been back several times and have not regretted it. Dinner is really good too, especially if you get one of their cocktails."], ["Becky S.", "I love this place.  I almost hesitate to write an excellent review, because I love that we have been able to sneak in for a table at the last minute, and I don't want it to get too popular.  I've been to Spuntino half a dozen time, and only once did I order something I didn't care for.  It's just a lovely little restaurant; my favorite place for an intimate dinner with my husband. And as difficult as it is, we try to restrain how much we order for app/dinner, but the sea salt caramel gelato is a must!"], ["Mark S.", "Great Italian meal with wonderful flavors. I ordered the spring squash bruschetta and the Burrata insalata as a main course. Dessert was the caramel-chocolate-sea salt gelato. The bruschetta was outstanding, but I really didn't like having to share it with my dining companions. I wanted more. The Burrata was truly outstanding. Everything was fresh and light. The roasted pine nuts and apple butter spread delightfully accented the dish. The gelato was very good and smooth. However, can gelato get better than actually eating it on the French Riviera? Gelato has more to do with your surroundings than its actual quality, IMHO. Overall I highly recommend Sputino for lunch or dinner."], ["Hilary S.", "Spuntino is my favorite restaurant in this city and at the top of my list when visitors come from out of town. Elliot and his staff have given me impeccable service every time I've been here. I have never encountered an \"off night.\" Anna was our server last time, and she was wonderful! We had the cheese plate and the red pepper bruschetta to start. The cheese was a goat taleggio that I was hesitant about at first, since taleggio can be quite pungent and not for everyone, but it was creamy and pleasing and came with apricots and cherries that were in a light syrup made with alcohol (was it bourbon? I've forgotten..). The bruschetta had a red pepper pesto-type spread on it, with a slight drizzle of basil pesto on toasted bread. Both appetizers were beautiful and accompanied by a fantastic Barolo wine suggested by the bartender.I usually stick to pasta when I come here because they make all of it in house (and its the best pasta I've ever had, hands down). However, the way Anna described the elk... I HAD to try it and was not disappointed. The seasoning and the way they cooked it was perfect! It was served with some cranberries and beluga lentils. My friends had the butternut squash pasta and the pasta special which was fetticuine that had a corn mousse on it. Both were phenomenal. I've had the butternut squash pasta before. I dream about it. Elliot gave us a suggestion for a second bottle of wine that paired perfectly.Then of course was dessert. Orange olive oil cake served warm with pistachio gelato. Need I say more? I had the mint chocolate chip gelato and my other friend had the strawberry sorbet. Both were incredible. We also had the almond coconut macaroons, which were still warm and exactly as macaroons should be. Overall an incredible and satisfying meal. Here's what you shouldn't expect: Olive Garden-esque portions and cheesy Italian decor. Their restaurant is beautiful and will make you feel at home. Yes, their portions are a little smaller, but their pasta is delicate and made with love and care and is way more flavorful than any other pasta you've ever had. Just admit it. In fact, I would pay double for it. Also, you don't come out feeling sick because you've eaten way more than you should. I appreciate a restaurant that doesn't \"super size\" their entrees. What you should expect:A long evening filed with amazing food in a comforting environment with a staff that isn't pushy and knows a lot about what they're serving you. You will be happy when you leave. You should make a reservation on the weekend if you don't like to hang out at the bar and wait.Thank you Spuntino. You are an absolute treasure.XO,Your biggest fan."], ["Bill F.", "favorite restaurant !this is my wife and my favorite place.while the food is amazing we really enjoy the deliberately SLOW pace  - meaning - if youve ever had a long slow meal in Paris with lots of yummy courses, lots of well paired wine/champagne... this is your place, so sit down, have a glass of champagne, work the menu from the top down...enjoy the deliberate slow place and for once ... taste your food, have a good interrupted  meal.Part II: if you're used to your food being dished out on one (1) plate then the check being presented 46 1/2 seconds later so they can free up the table for the next reservation - this may not be the place for you....Part III: the wife and I will be back from date night soon ...  save the table by the window for us..."], ["Jessica J.", "My husband and I had dinner at Spuntino a few weeks ago with a friend and absolutely loved everything about the place. The decor is very rustic-modern and really gives it a neighborhood restaurant feel. For three of us, we shared a bottle of wine, had a selection of bruschetta to start and shared three different pasta dishes family-style. The prosciutto on the bruschetta was salty and flavorful.  The pasta was house-made and cooked perfectly - just slightly al dente. I would put their pasta dishes up against many of the dishes that we had while in Italy last summer. I would suggest having reservations on a weekend night as the restaurant is pretty small. Also, it is not a late night joint - I think the kitchen starts closing up at 10PM, so probably best to make after-dinner drink plans elsewhere.  All in all, great experience. I am pretty sure this will be a regular spot for my husband and me in the future."], ["Joshua H.", "EhhhSuper spendy for what you get!! The service was outstanding and it's a really cool environment, very clean!! If your looking for big portions, this is NOT your place. If you are looking for out of left field small portions, then this is it. I came in hungry and left hungry with 180 buck less."], ["Alicia E.", "Went to Spuntino last night for the first time and had a fantastic experience!! Started with the Happy Hour and then ordered off the main menu. The portions were large and everything we had was exceptional! The octopus and burrata were the standout dishes and the bartenders and wait staff were friendly, helpful and very knowledgeable.  They all made you feel like you were their top priority. I'm looking forward to our next visit."], ["Monica L.", "Pretty close to perfect.  The atmosphere is very cool.  The service (Jason) was great.  The food was awesome.  I had the cavatelli with spicy sausage, cannelini beans and greens.  It was really delicious.  For $12 (at lunch), it could have used a bit more of the fabulous sausage.For dessert, I had the Valhrona chocolate \"melted\" cookie and the chocolate caramel tart with brown butter gelato.  I think the cookie was as good a cookie as I've ever had, and the tart was outstanding.My two friends each raved about what they had as well.Great place!!!"], ["Will F.", "sadly, actually another establishment whose bar staff thinks they are too cool to be attentive to their customers!  My friend an I sat at the bar with out being acknowledged for over 10 minutes.  Ridiculous!  There are so many places now that one doesn't have to deal with disrespectful staff...This place has a great location and menu, it would be great if they could make some improvements in service..."], ["Patricia B.", "Lovethe concept. Good food. We ordered the lunch menu. The soup of the day was so delicious. The portion is a little small but it doesn't bother me because of the quality is beyond. The dessert was good but not great. I've had better. The service was ok, a little slow. Will be back."], ["Cassie D.", "Can't wait to go back!So glad that I found this place via other yelp reviews.  I took my mother for her birthday, and we were both very impressed!  It's such a cozy and inviting atmosphere, we sat towards the back, but there were a few patio tables and some two tops by the window that looked nice too.  We sampled a couple wines before choosing a glass and had the mushroom, arugulua, fondita on focaccia to start.  It was divine!  I tried the pasta special with lamb sausage and my mother had lemon and mushroom ravioli.  The portions looked a bit small, but it was plenty filling with the appetizer.  Gelato and biscotti for dessert, the waitress even brought it out with a candle as we were celebrating!My advice to future diners: street parking appears to be very accessible, try some of the small/shareable spundito dishes or a salad with your meal, and be aware that the restaurant is on the smaller side and may not accommodate larger parties."], ["Stacy K.", "Great little spot near Potter Highlands. Amazing and authentic Italian food. Perfect for a weeknight date. I'm pretty sure the menu is seasonal, but try the Fungi appetizer if it's on the menu, crazy good!"], ["Brian Z.", "The food and service was excellent.  Highly recommend that you try anything with their \"hunt and gathered\"  mushrooms. They types and flavors were spectacular. I had them in a bruschetta type appetizers which was probably my favorite thing I ate here,  The pulpo was great and cooked perfectly.  Burrata was great. The pastas are all made in house and are truly fantastic.  The only dish I had that I really didn't care for was the eggplant which it self was perfect but was served on a bed of carrots, peas,  and cous cous or maybe it was quinoa seasoned with cinnamon and nutmeg... The flavor was more Turkish or middle eastern not my thing."]], "Mici Handcrafted Italian": [["Julie B.", "Had the lunch special, ordered online for pickup. Online ordering was a breeze, my order was ready when I came to pick it up. I had the calzone and it was delicious!! I had to split it in half --it was a ton of food. But no worries, it was great for leftovers the next day."], ["Debra J.", "Food was very good. The service was excellent. The gentlemen were not only helpful in describing the menu but very concerned that I enjoyed my lunch. I highly recommend this location. The lunch menu was creative and perfectly priced. I will have lunch there again"], ["Rita V.", "Visiting from Buffalo, NY (where we've some really good pizza), we were pleased at how delicious even the cheese & pepperoni pizza was! I'd definitely go back or recommend it to others. Quick & friendly service. Dining space only seats 49, so call ahead."], ["Erin R.", "We ordered delivery (a pizza and salad) to our nearby hotel. The food came quickly, but they didn't bring us silverware or even napkins. We're at a hotel; of course we don't have silverware! It just seemed like a no-brainer. The pizza was mediocre (we got the Giadino) and the salad was basic. So I wish we had chosen another pizza restaurant."], ["Warren C.", "I decided to go with the pasta instead of the pizza and regret that decision. I think everyone else here ordered pizza, and seemed to enjoy that a lot more. Pasta is pretty much a pick your sauce and pick your meat kinda deal, and are a bit generic to say the least. I liked the Caesar salad, it was well tossed and not super salty like how it usually is at restaurants. Garlic bread is good too."], ["Meghan D.", "The NICEST staff you will ever encounter. Great food at a very reasonable price. My favorite place to sit on the patio and listen to Italian music at high noon."], ["Bruce L.", "Had very enjoyable lunch at Mici. Palermo Panni was well prepared and tasty at a reasonable price. Very quick custom service. Manager Amy especially helpful and friendly. She was able to help one of our group who generally hard to please find the a great fit with the menu items. Smiles all around with everyone. All menu items prepared on site by an efficient kitchen staff. Great restaurant for quick and flavorful meal."], ["Amy S.", "Mici \"Handcrafted\" Italian? Right. Pizza reminded me of cheap, low-quality fast food (because that's what it was). The crust was mediocre and the ingredients weren't even cooked into it, just sort of thrown on top. I wanted to get a salad, but they don't even make their own salad dressings. The sample I tried tasted like any other bottled variety of mass-produced, high fructose corn syrup based stuff from the grocery store. They also didn't have any local Colorado beers (bottled or on tap). Maybe their other food was good, but I'll luckily never have to return to find out (am visiting for a conference)."], ["Brandi N.", "Listen, I like the food here.  A lot!  For that I would give them a 5.  BUT, at least at the downtown location, they routinely add a little to the bill.  It's always just a tiny amount, certainly not enough to go argue about, but isn't that illegal?  For instance, I ordered a sandwich the last time I was there and the total bill, per the receipt, was $8.50.  I added $1.  Then my credit card was charged $9.64.  Again, it's only $0.14, but this happens almost every time I go there.  Not pleased!"], ["S A.", "The pizza is solid. It's nothing to write home about, but I've never been disappointed.The pasta, on the other hand, is pretty sub-par -- they taste exactly like what I make at home, with the box of dry noodles from the grocery and the canned sauce. Definitely not restaurant-quality food.Next up, I want to try the calzone..."], ["Andy S.", "Better Than Marco's Coal Fired.  And like a third of the price.  You should eat here."], ["Nicole W.", "Hello lunch deal for 7.95! I got a veggie paninn and a house salad, cute outdoor patio, and friendly servers!It is right next to the train tracks - so don't expect a super quiet time!Order inside, enter the line n the back - exit is what is up front!As far as the pannini - i was less than impressed, i'd try the turkey sandwich next time or go for a slice! All depends what the scale says that morning!"], ["Lauren D.", "Super affordable and awesome portions! The staff is always so kind and helpful! The pizzas bomb and the pancetta ravioli is unbelievable! They deliver too and it's always super quick! They have awesome specials if you eat in like a bottle of wine and a pizza for like $25. Such a deal :) love this place!"], ["Diana T.", "Absolutely delicious pizza & salads!Mom & pop owned but with a corporate feel, not in a bad way. The decor and menu makes the place feel corporate but the service and atmosphere are very much warm and welcoming. All their ingredients tasted freshly cut. The dough used on the pizzas were perfectly crunchy and soft. Marinera & Pesto sauces were delicious! Get an extra side for dipping the crust! Salad dela casa was simple yet so yummy. Baby greens, red grapes sliced in half tossed with walnuts, crumbled cheese and a creamy balsamic dressing. 16\" Pizza and 1 bottle wine for $25!!! House pinot grigio was whatever but it gave me the buzz I needed. Pizza was AMAZING. Splittable by 3 adults. You can request different toppings on each half including their signature style pizzas!Great place to sit and chill with friends. I would definately come back here for the food and service!"], ["Cordelia K.", "It's good and very well priced. I appreciate that you can order delivery online. It's consistent and the workers are friendly."], ["Greg B.", "A very good traditional thin crust pizza. Food was prepared quickly, staff was friendly & helpful. I had a very good experience here. If I didn't live 900 miles away I'd come here often."], ["Aus B.", "Big fan of their pies. I've shopped around and Mici makes one of the best pies. Especially for the price.Garlic bread is on good bread and nice  buttery and garlicky. Just the way it should be. If you want healthy order a salad!"], ["Lauren W.", "I had the lunch special. A slice of pizza and tomato soup. Both were really good. The pizza crust was perfectly cooked and seasoned good and the tomato sauce and toppings were excellent."], ["Bobby T.", "Mici, you are so money and you don't even know it.  Or perhaps you do, and that makes you even more money.  I'm half-Italian (the half that likes to eat!) and I just have to have my pasta from time to time.  And red sauce. Meaty, red sauce.  It's like a blood infusion when I'm down a couple of pints.  When I need a tomato-y, meaty, carb and red sauce infusion and I'm working downtown, I always head to Mici.  If the Cortonese pasta is what my body demands, the Cortonese pasta is what my body gets.  The sauce is a perfect meat sauce.  You get the slightly sweet, slightly acidic flavor of the tomatoes coupled with a perfect amount of meat so as to complement but not overshadow the tomatoes.  Garlic rounds out the flavors and gives the sauce a nice tang on top of the acid from the tomatoes.  It's so satisfying.  Add a dense yet perfectly textured meatball, and you have the perfect lunch for this half Italian, half Anglo mutt boy.  Their pizza is pretty good too, although I won't rave about that like I will the Cortonese.  Mici is good for sandwiches, as well.  I've had the Chicken Parm sandwich, and it was delicious.  I can't wait to try their meatball sandy.  I also just found out they do Lasagna all day on Tuesdays.  I wish I had known, I would have tried it out.  Next week!"], ["Jeremy P.", "The food here was excellent...  I really enjoyed the Veggie calzone.  The marinara sauce here is quite possibly the best that I have ever, ever had...  simply amazing.  In fact...  I would be quite content if I could just eat it by itself..."]], "Cody's Cafe and Bar": [["Jamie R.", "What a hidden gem! My mom and I went for dinner and shared the mussels as an appetizer and they were SO GOOD. For our entrees I had the eggplant Parmesan and she tacos and we were both very impressed!"], ["Aaron E.", "What a great place!  Rolling up on this restaurant you may wanna put your blinders on so your not distracted on the end goal which is an awesome meal at a cool little place.  The inside decoration definitely turns around the initial impression and is very comfortable with a cool dark vibe with some pretty sweet artwork adorned on the walls.  I've been here now three times and have had amazing meals each and every stop in.  Lunch is a great time to stop by, since not a lot of traffic and delicious sandwichs are to be expected.  The Chicken Parm, Meatball and rib eye steak sandwhichs are all incredible.  Perfectly cooked and seasoned french fries make for an incredibly affordable and delicious meal.  I highly recommend all in the area or from Denver to make your way out and enjoy Cody's it will be worth the trip!"], ["Dale Z.", "We were looking for a happy hour near Parker Road and Iliff.   After noticing the positive reviews from Yelpers such as Cheryl L. and Mark T., we decided to try out Cody's Cafe & Bar.  This relatively small place is tucked into a strip mall on the north side of Illiff, between Havana and Parker Road.  It may not look like much from the outside, but be sure not to judge this book by its cover.  When you walk through the door, you see nice tables and chairs, a large bar in the corner, and some very cool paintings all over the walls.  There were not that many people in the place on a late Wednesday afternoon.  The bartender was very helpful and friendly.  The happy hours deals were rather good.  There were some great selections of $3 beers, wines, and well drinks. They also had several appetizers (like tacos and bruschetta) on the happy hour list.  The appetizers we ordered were cooked and brought to us very quickly.  We tried the Spinach Cheese Wontons  (stuffed fried wontons served with raspberry wasabi swirl and seasonal fruit chutney).  These were very flavorful and nicely crunchy.  I could have used a touch more wasabi to bring some heat.  The Bruschetta (tomatoes, fresh basil, garlic oil, parmesan cheese on homemade Italian bread slices) was similarly excellent.  I like mine a little toastier, typcially.  The tacos (Steak Taco--thinly sliced rib eye meat with mango pico de gallo, slaw, and guacamole on a corn tortilla) and (Chicken Taco--marinated chicken breast with mango pico de gallo, slaw, and guacamole on a corn tortilla) were very good.  Both of these were tasty.  They were not quite as good as the tacos from Phat Thai, but they were better than the tacos you get outside of a real taqueria (which abound in Denver).  I had a couple beers, which were nice and cold, and also had a top-shelf Irish Whiskey, which while not cheap, was less expensive than I expected.A couple sitting at the table next to us were regulars at Cody's, and they sang the praises of the pasta dishes, including Cody's Spaghetti  (made with homemade pork sausage and homemade all-beef meatballs) and the Lemongrass Sausage Penne  (homemade lemongrass pork sausage, mushrooms, organic arugula, red pepper, and ginger soy).  I will definitely be trying one or the other (possibly both) of these on my next visit."], ["Kelly H.", "3 stars, not for quality and the amazing food, but for lack of good service.  We have been here quite a few times as I will still stand by the fact this is one of the few great restaurants in the entirety of Aurora, but I can't, for the life of me, figure out if the kitchen staff or the wait staff are to blame for such horrendous wait times and inconsistent service.  People come in and are greeted and seated and it can take 15 minutes to get a drink.  The entire meal can have you there 1.5 hours or more just waiting and biding time.  It is the most bizarre thing to me!  As for the food, the specials are worth it and the fresh ingredients are a welcomed change from so much fast food offerings in Aurora.  The desserts are fantastic.  The apps and salads are just okay.  This place should be packed out every night, but given their lack of service, I've seen the patrons fizzle.  We've often thought of giving up a few times as well, but a good meal is hard to find in Aurora."], ["Howard A.", "My husband and I come here every Saturday.  The food is great the drinks are great. The food is something you would expect at a 5 star restaurant with out 5 star prices.  I would recommend this restaurant to everyone who loves good food and drinks.  Also the servers are wonderful."], ["Brian S.", "I really dig this place.  It's not a sports bar, it's not a lounge, it's kind of like a cafe that has decent eats (from what others have said) and a full bar.  They have a couple of TVs but on the Saturday night my friend and I visited they were both on cooking shows, so it's super laid back and quiet enough that you can have a normal conversation without yelling.  They have maybe 6 booths, a bar that seats maybe 8 and a handful of tables so it's not the biggest place in the world, but nestled in an unassuming strip mall it gets the job done for a good after dinner drink.From the outside decor and neighboring businesses you'd think this place would be a dump but it's not.  Super clean and the bartender/waiter was very friendly and had good energy.  Definitely recommended for the post-35 crowd looking to spend time with friends and catch up, not scream at each other and hookup.  Hey that could be a marketing tag line."], ["Alexis G.", "Cody's is still the best kept secret in Aurora. I continue to be blown away by the elegant simplicity of their dishes. We started off the the mussels, which were free thanks to a Yelp! Check-in offer. They were the largest, yummiest mussels I've ever had. For my entree, I had a pasta with stuffed crab claws. Need I say more? If you haven't been to Cody's yet, you are truly missing out."], ["Lee S.", "Another gem hidden in a strip mall.We were looking for a place to enjoy Happy Hour before dinner and stumbled upon this little place.Very tasty Happy Hour Tacos and chips.Good price on the beer and wine..perfect.Now, I want to try them for dinner, then I'll do an update."], ["Angela P.", "Cody's is my Cheers. I eat here so much they know me. When they switched out their tap beers for local microbrews they started carrying my old brand in a bottle just for me! It's a rare treat in this area to find a nice place with really good food that's reasonably priced. I enjoy the salmon, the fish & chips, and many other items on the menu. Surprisingly, they have one of the best bread puddings I've ever had! Don't let the 80s strip mall fool you. This place is a gem."], ["Al J.", "They are trying to be fancy but it just isn't good, the portions are tiny and the prices are high. I was told the sugarcane stick with crab cake was a good size crabcake. The stick is just a waste and the crabcake portion was miniscule and not very good. I had some mediocre fish tacos as well. It was just high priced hors 'd oevres. My friend's soup was too salty. I walked away hungry and the bill was over $50 with tip."], ["Jason B.", "Highly recommend this hidden gem.  Ambiance is excellent.  Food absolutely delicious.   I had the sausage penne dish and can attest that their house made sausage is wonderful.  My friend had the angel hair pasta and loved it.  My wife and his wife both had a daily special, chicken meatballs stuffed with cheese, and they enjoyed that dish as well.  Cannot be more pleased to find this restaurant.  Don't let the strip mall distract or dissuade you from this fantastic restaurant."], ["Michelle A.", "Yuck.  I had a salad with eggplant and wilted lettuce.  I guess.  My kid and my dad shared a Margaita pizza.  It was just ok.  Guess it was not good cold.  I believe good pizza is good the next day without being heated.  We also tried the calamari appetizer.  I have had way better.Our server was great.  The place itself is ok.  It is in a strip mall by Lamar's.  Too bad it was closed or I would have had a donut to get rid of the awful salad taste.  Oh well can't always go somewhere good."], ["Julie P.", "The food was amazing! The atmosphere was cozy, perfect for a date night. Lisa was our server and she was phenomenal. Greg was a bartender and he was wonderful. Overall a really great experience. Definitely going back."], ["Tyler S.", "WOW thanks Yelp for another fantastic recommendation!We checked out Cody's Café on Friday when trying to decide on a place for dinner instead of cooking. I had heard great things about this place and am glad we checked it out. Cody's Café is located on the north side of Iliff tucked away in a little strip mall. Don't let looks deceive you, as this was a pretty good find.The menu is kind-of an Italian-Asian fusion, yet super delicious. When I checked in on Yelp, I was surprised to find out that with an entrée purchase, you get a free appetizer. Our server recommended the crab cakes wrapped around sugar cane, which were ballin'! They were the perfect size and cooked to perfection. I had never had a crab cake that was prepared this way, however, the sugar cane and sauce they added made it very unique and flavorful.For dinner, I had the chicken parmesean while my partner ordered some lemongrass mushroom pasta that was by far way better than my own. I can't complain on my decision, the chicken parm was pretty standard and tasty. The lemongrass sausage pasta was by far crazy delicious. The flavor combinations meld together into a savory, mouth watering plate of awesomeness. If you are on this side of town, Cody's Café is definitely worth a stop."], ["Conor K.", "Who knew that this place would be this ridiculously good! We went for lunch so I don't think we got the full dinner menu, but I will so be back when I come to the Denver/Aurora area again to try them for dinner! The fish and chips were perfectly done and very tasty and the creamy coleslaw was so good, and that was the least of the fair we had. The Kitchen Sink Pizza... one of the best pizzas I've ever had. Perfectly balanced between meat and veggies, it was crazy good! Then we tried what sounded like it would be just too much... it's one of the best desserts I've ever had. The Chocolate Hazelnut Fried Wontons with fresh fruit and ice cream was unbelievably good! The charming waiter was so nice and pleasant and the simple but refined decor was excellent, I also very much appreciated that they displayed local artists paintings for sale, I was very nearly tempted to buy one but had no easy way to get it home.I can't recommend this place enough! The only downside I can say is that they deserve to be in a free standing building of their own instead of the strip mall where they're out now. Everyone should go here to eat so they can eventually do just that! Spectacular surprise!! Can't wait to go back!"], ["Cheryl L.", "Some of the best pasta, sauce and meatballs that I've had in a very long time.This charming little place is tucked into a strip mall between Havana and Parker Rd. on Iliff.I'm not exactly sure what I was expecting but the pasta was cooked perfectly.  The meatballs were moist and flavorful - the right amount of seasoning and the sauce had the perfect seasoning with the right amount of kick.We also ordered the Shrimp BLT Sandwich and it was good, don't get me wrong but the spaghetti and meatballs were the star of the show.  The service was friendly and quick and the prices are very reasonable.So if you find yourself in this neck of the woods, stop in and grab a bite - you won't be disappointed."], ["Dennis W.", "We happened to be in the area and looked at Yelp for a nice bar. Cody's looked interesting. My wife and I drove up to the entrance, it was a strip mall that didn't look inviting. We went inside and were very surprised. It was clean, quiet, and extremely comfortable. Greg was the bartender, waiter, take out guy, he did it all....and with a great attitude and friendly smile. They had happy hour, we did the wontons, absolutely great. The coconut shrimp was outstanding but the pizza was over the top. We had the kitchen sink and I told my wife I'd move to Denver just to be near this place. I don't write reviews but because people before me recommended Cody's I wanted to be sure if you are looking at this you will not be disappointed. We are from Richmond, VA and only want to \"pay it forward\" for a great experience and that was easy on the pocketbook. Thanks Greg for a great night."], ["Donna W.", "Wow, YUM!  This place was actually our back up plan and, thanks to Yelp, it was a home run!  I would have NEVER stopped at this restaurant without Yelp because it's in a very nondescript strip mall.  Being called \"Cafe & Bar\" is very misleading because this has the feel of a nicer Italian restaurant with lots of local art on the walls, nice ambiance, and it's cute and quaint.  It's small so it feels very intimate.  Our server was VERY friendly and attentive.  Oh, and if you show them that you found them on Yelp, you get a free appetizer!The menu was a unique fusion of Italian with some of the dishes having an Asian twist, too.  We had the mushroom potstickers and they were AWESOME!   Their bread is also fantastic, too.  Soft in the middle but just the right amount of chewiness in the crust.  VERY good.  We ordered the Cody's Pasta (spaghetti with meatballs and sausage).  I would NEVER order pasta at a restaurant thinking why would I pay for something I could make (out of a jar) at home?!  Thank GOD my friend wanted to order it and someone here on Yelp recommended it because it was AWESOME.  Great flavor, perfectly cooked meatballs, and just YUMMY.  If I could get that from a jar at home, I'd never leave the house again!We also tried the artichoke pasta with the pink vodka sauce.  That was good, too, but really, I think I was so stuck on the other pasta I couldn't move on.  The prices were about on par with Olive Garden (about $6 for the average appetizer and $12 for the average entree).  They also had a lot of other unique dishes you just won't see on a chain restaurant's menu.  I didn't even know where to start because I wanted to try it all!I would TOTALLY eat here again....I'll probably be craving that Cody's Pasta again tomorrow!"], ["Samantha W.", "Amazing food, outstanding service (thank you, Shawn!) and a wonderful atmosphere. If you are looking for a comfortable place to enjoy a meal this is the place to go."], ["Anne F.", "Hands down the best pasta I have had in Colorado. We ended up here after trying to go to a larger chain restaurant nearby who's wait was somewhat out of control. We turned to Yelp to see what our other pasta options were and happened to be right across the street from this amazing restaurant. Don't let the exterior fool you, the moment you walk through the doors you are transported to an upscale dining experience. We started with the mushroom potstickers. Perfectly cooked with a sundried tomato sauce that doubled as a dressing for the greens the potstickers were served on. I had the Angel-Hair Chicken which was AMAZING. Fresh tasting veggies and grilled chicken rounded out this light and delicious pasta dish. My boyfriend tried the fish and chips. Perfectly breaded the fish was hearty enough to fill him up and the chips were hand-sliced and fried fresh.    Wonderful experience and an afforable price."]], "Shells & Sauce": [], "North Italia": [["Colter H.", "Cool joint, great pizza.Date of Visit: 8/6/15Checked out North with some friends for Happy Hour, and was very impressed. The space is much larger than I expected, and is done in \"farmhouse chic\" (raw materials, metal work, funky lighting), which is a favorite style of mine. That said, the food and service were just as great.We ordered a few of the HH items, including the Chef's Board (meats, cheeses, \"other goodies\"), a few pizzas (Margherita, daily special - Fig/Chicken - pizza). The pizza was fresh and bright, with a light, airy crust that I would put against almost any I've had in the area. The only demerit would be their drink list, which could use a bit more adventurism in the beer department. Other than that, North Italia really hit the mark."], ["Kelly R.", "North just rolled out the new Fall/Winter menu...it's pretty great. If you like some heat, try the squid ink pasta - I can't recall the name of it. Either way, it's hearty and full of tasty sea creatures tossed in a significant portion of black pasta with a spicy thin red sauce. I had enough to take home and WILL be eating it for lunch. I loved it!My friend had the scallops and they were divine. A bit on the salty side for my taste but really good. And LARGE. But the best part of the meal for me personally was the amazing bottle of Amarone."], ["Adam T.", "Do not get stuffed on their appetizers!This place is amazing.  Their food is just so tasty.  You really cannot go wrong, except to get stuffed on the appetizers (guilty).Their meatballs and zucchini chips are a must.  They make all their pasta in house. I had the squid-ink pasta and was mesmerized.The desert was equally wonderful.In short, its an unassuming, hidden gem that I'm glad I found."], ["Allie R.", "I got sick from north a very long time ago and vowed to never go back. I have since recovered from my north \"sickness of 2005\" and decided to give them another try. Our new friends had raved about how delicious their previous meal here was and wanted to try their dinner options. We meet around 7pm on a Tuesday night and the restaurant is packed. We opt to wait on the patio for a few drinks while our table was ready (drinks were a bit weak, although tasty, but with a $10 price tag). They ended up seating us in the back of the restaurant in front of a big window. The atmosphere was perfect. It was not too loud for conversation which is a big plus in my book. We started off with the arancini (risotto balls) and they were great, we enjoyed the zucca chips as well, but there isn't much to them so I wouldn't order them as my only appetizer. My honey and I split the spinach tortellini, which was made in house, it was excellent. Friends enjoyed the lasagna and spaghetti, no one had a bad thing to say about their meals. Last but not least the service was impeccable. Would absolutely return."], ["Janet D.", "If there's one thing you need to know about North Italia is that they make their own pasta from scratch- in house. How awesome is that? It's very difficult to find a restaurant that can boasts of such offer.You can choose to sit outside or inside. No worries if you decide to sit outside. The service is top notch. Fast, attentive and genuine.We ordered a few small plates: Braised Meatballs, Calamari, Truffle Garlic Bread and Caesar salad. The Braise Meatballs came with Grilled Bread and Red Sauce. It was one of the best six pieces of meatballs I've had. The sauce sealed the deal. There's nothing added to it to make it taste less than what it should be. Just red sauce that's well seasoned. The Calamari was perfectly crunchy and was mixed in with fresh arugula lightly dressed in lemon vinaigrette. It's an awesome juxtaposition of fried and healthy. Combined together end result was an explosive great, healthy, guilt free dish. The Truffle Garlic bread came in a medium size skillet. All brown and crunchy with an obvious amount of garlic stuck to the entwined truffle infused bread. The Caesar salad that we shared was lightly moist with dressing and rained on with a good amount of fine mozzarella goodness.Everything was great. I can't pick a favorite. They do carry pizza as well and to that note we decided to do dinner here sometime soon. In this area if you feel like some Ottimo Cibo drop by! I am a big fan!"], ["Sarah C.", "Love it here... Have been here for brunch a couple times and most recently, dinner. Very crowded on a Saturday night; would recommend making reservations or you may not get in. We started with the meatballs appetizer which was amazing. I probably wouldn't have ordered those had we not been with the other couple that wanted them but I'm happy we ordered them as they were flavorful and moist. I had the Bolognese and wasn't disappointed. Dare I say it's the best I've had in Denver? I think so. Hubby ordered the scallops and raved. Awesome wine list and prompt service. All in all, great night. We will be back."], ["Valerie M.", "Everything we tried, party of 10 was really absolutely delicious! Loved the Pasta Bolognese, Pasta w Chicken, Grilled Artichokes, Stuffed Mushroom Risotto, etc. Can not wait until the Newport Beach location opens up!"], ["Matt P.", "Great Italian spot. Started with the meat and cheese app that was pretty good. I ordered the short rib which left something to be desired. My friemd had the Bolognese and it was amazing. Went for my birthday with friends we all enjoyed the Sangria. Service and atmosphere were on point."], ["Sebastian G.", "We heard great things about this place and we were totally disappointed.They call themselves and Italian restaurant but they are more like just a pizza restaurant.Best dish we had : a salad.The lasagna was average and the shrimp pasta was tasteless.Also, how you ruin a restaurant reputation? Letting a waiter stand over a service station (where you have glasses and silverware) with her street shoes - see picture.I am not picky on this things, but considering reputation, food quality, price and location this is a two stars at best."], ["Kim A.", "I went here a couple of weeks ago with some friends because they suggested it as one of their favorite places eat in Cherry Creek. We got an order of zucca chips to start which were delicious! (We all highly suggest them!)Being a breakfast person (as you could see from my other posts) I of course looked right at the breakfast menu (it was a Saturday afternoon). I got the americano which is simple but delicious. Everyone else got a lunch item - most of them had been there before so they knew exactly what they wanted.I think after this visit it has become a go-to for me in Cherry Creek when I'm there shopping! :)"], ["Allie S.", "Good affordable place in Cherry Creek North. Wasn't aware until my visit that this restaurant is part of a chain and not local. However, loved the casual yet trendy vibe as I was in no mood for fancy fake Cherry Creek brunch nonsense that is very rampant during the weekend. I arrived around lunchtime and opted for a Margherita pizza rather than try any of their brunch offeringsLoved the unexpected offering of free bread while I waited for my pizza. The staff was super nice and attentive. The pizza didn't take too long and was a decent size, enough for leftovers. The pizza was great, fresh off the brick pizza oven. Would definitely return to try some of the heavier pasta entrees and desserts!"], ["Rachel H.", "Delicious! Pasta (and everything else for that matter) is made in house. The asparagus on the bruschetta appetizer was unique, but very tasty. I ordered the \"house special\" - bolognese. Did not disappoint! Would definitely come back to try other items on the menu. Or maybe just order the bolognese again..."], ["Elizabeth M.", "Went her for brunch on a rainy Sunday todayFriendly staff, typical clean trendy décor of Cherry Creek. On this cold date I had a latte to fight off the cold which was good and the small plate of Chefs Platter as an entrée which it was surprising for me to order since I didn't know what to get since there were many items I wanted to try and this was not a warm option. It made me think of something that I would actually eat at a café in Italy...very simple, yet great flavors especially when mixed together....While I was trying to stay away from the bread I did mix together a couple of delights with the crusty grilled bread.  The prosciutto went very well with the homemade mozzarella, marinated peppers, delightful fresh parmesan, and fruit spread.  I followed bites up with the roasted almonds and bites of olives.  This simple platter was a dish I was eating slowly and savoring every bite....just like you would do in a café in Europe with no rush.  My husband got the omelet of the day which looked delicious as well with bacon, avocado and cheese.  It came with crusty bread with shredded parmesan and breakfast potatoes.  I would have been stabbed with a fork if I took anything else, but I did have a bite of the potatoes which were flavored nicely that I wouldn't have wanted any ketchup on them.A nice unexpected stop for the day.  I will have to come back to try some of their items as looking at a couple of the other dishes going by they looked really good."], ["Lauren G.", "As a connoisseur of all things happy hour I can say that North definitely has one of the best in Denver. You seriously cannot beat their 'Bottle & Board'. For $20 you get a bottle of house white or red and one of their incredible cheese boards or a pizza. Recently, after having some serioussss food envy over their pizzas (I'm gluten-free and sadly can't partake) I tried their roasted vegetable salad and added a piece of salmon on top... SO good. The salmon was cooked perfectly (nice portion size too) and the salad didn't leave me feeling underwhelmed in the slightest (how could it with avocado, goat cheese, roasted veggies, quinoa and farro for the gluten-eating folks?!) The service has always been on point, even when they're slammed. And best of all... Happy hour is ALL DAY Sunday!!!"], ["Christina L.", "I had a great dining experience here! Everything from the service to the food was fantastic. The waitress came promptly to the table and gave us many recommendations. We took her up on the zucca chips and immediately fell in love- thin, light, and crispy! We also decided to try the bruschetta. Although it was not how I imagined it, I still enjoyed the small dish very much. The flakes of parmesan were an excellent touch along with the grilled asparagus. For my entree, I ordered the seared diver scallops and, wow, were they amazing! They were cooked to perfection and the sweet corn risotto was an excellent touch. My guest ordered the Atlantic salmon and said it was cooked perfectly. We both were so impressed with this place and agreed we were definitely coming back! We even took some zucca chips home!"], ["Michael L.", "What a fantastic location.  The sun was out, the weather was awesome and just another gorgeous summer day in Denver.  Girlfriend suggested grabbing lunch here before heading to the botanical garden.  We both had the Apricot Limonada which gave both of us a little buzz.  I got the Bolognese pasta and she had the Atlantic Salmon.  Mmmmm, deliciousness overall."], ["Erin K.", "Normally I love this restaurant and have great service, but not last night. My husband and I walked in around 8:30 and approached the host stand. The hostess was leaning in the corner doing something on her phone, completely detached and oblivious. At first I thought she must be a customer because she didn't even look up and completely ignored us. I repeatedly said \"hello?\" and \"excuse me\", trying to catch her attention, until she finally glanced up and acknowledged us, finished her text and seated us...it was rather embarrassing for me that I had to be loud and borderline rude just to get noticed. Bizarre."], ["Amanda D.", "I had an excellent dining experience second time around!Was invited back by the GM and me and my friend had received some generosities. Most of the restaurants could have done nothing so I was pleasantly surprised. They also carry the Pinot Noir from Melville winery in Santa Barbara just like true foods. Pricey yet worth every penny. Had to admit I have been addicted to the nutty front note of this red when I usually go for the white.We both got the scrambled eggs. It was quite flavorful and you can't go wrong with asparagus, zucchini, mushroom and spinach. I also had the tomato based seafood soup with a slight spice to it and it was delightful."], ["Holly M.", "I love North...Its been a go to for a long time ..The four star review is because the the parking is so hard in Cherry Creek and sometimes to go orders are lack luster...I must say though the food is too die... My friend and I ate here yesterday and lunch was above average... The bartender (we sat at the bar) was charming and easy to chat with !!!I always order a salad of some sort - Yesterday was the beet salad...Its been on the menu for a long time now because people probably love it..I know I do ...North continues this great service and food they will have a life long customer ....So keep it up !!Also the dessert donuts are so tasty ...if you are looking for a sweet treat and you have a cheat day coming up!!!!Have fun!"], ["Melissa P.", "I'm starting with dessert first, because that was the highlight of my meal. The salted caramel budino was incredible, INCREDIBLE! I would come back just for it (and I probably will!). The asparagus, prosciutto and creamy cheese bruschetta was the best my husband has ever had! I started with the beet salad, and it was okay. I may have rated it better than \"okay\", except I had to compare it to my husband's bruschetta, which was just phenomenal. I am a big fan of homemade pasta, and I feel like that is a rare find. However, I was underwhelmed with the bolognese. The best way we could describe it was being \"light in flavor\", and not in a good way. I know that authentic Italian is different than what we're used to in America, but I thought that had to do more with a light dressing of sauce, but not lacking in flavor. I'm traveling to Italy in April, so I may have to come and revise my review after that trip. ;o)Hubs was pleased with the wine menu. He selected a Malbec (the pricier one; I'm not seeing their wine menu online). As I'm finding is common in Denver, the beer menu was IPA-heavy. I lucked out that the seasonal rotation from Fat Tire was their Portage, so at least I had one dark beer to choose from aside from Guinness. I'd come back. I think I'll try their pizzas next time. I'd love to give another one of their homemade pastas a chance, but I'm afraid it might be a waste of money again. I'll see what strikes my fancy at the time. One thing for sure is that I'll be saving some room for the budino!"]], "DiFranco's": [["Eric N.", "Giving 5 stars is not something I do lightly but it was easy here.   The food is simple,  unpretentious yet also with sophisticated flavors and presentation.   The staff are attentive and ... highly unusual. ... full of heart.   And lastly this place offers value especially compared with so many greedy restaurants in Denver that overcharge for mediocre food. I'll be back. . Many times!"], ["Phil H.", "How have I not rated my favorite italian place in Denver?! This is as close as you will get to east coast italian in the mile high, and it's fabulous. Intimate place, but they just added some outdoor seating in the form of a very cool bar.The staff is young and excited, which is great to see. I know they do cooking classes so  you too can replicate the magic at home. The pasta is hand-made and perfect. You can buy it to take home, if you want to impress your family/friends/pets. The desserts are also homemade, which are dangerous.They have a seasonal menu, so if your favorite isn't there, see if it'll be coming next month. I love their gnocchi and will be eagerly awaiting its return.They also have some awesome artwork, and I've taken some home with me, so that says something!Cheers to you, DiFranco's. Never change, and get in mah belly."], ["Shannon M.", "Watermelon and arugula salad is a must order! The braised beef corn ravioli was also delicious with a ton of flavor;)"], ["Thom R.", "The lunch menu initially seemed to provide a nice selection of entrees but, upon closer inspection, nothing stood out as something I really wanted to eat.  I choose the Spaghetti Carbonara just because I have a very fond memory of enjoying that dish in Rome.  I must say that they did an excellent job on the food and it was very authentic to the original recipe.  The one thing that left me feeling like this had been a bad choice for my lunch break from work was the price. $18 (includes tip but no wine or other beverage) was much too much for a smallish portion of this simple peasant food.  I might have been slightly less disappointed if there had been more pancetta in the bowl, but no such luck.  Even food done well can be overpriced. I do intend to give them a second chance. But on a more special occasion and when I'm dining with friends."], ["Matthew H.", "The sweet pea ravioli was fantastic, but pretty pricey for pasta."], ["Rob B.", "What can I say besides this is the best Italian restaurant in town.  Every time I eat there I feel like it is being cooked in a home kitchen.  The staff is absolutely great!  Every single staff member I have encountered has made me feel right at home.  Try everything!  I have had half the menu and every single item has been amazing.  Take your friends here.  From my experience, they will love it!!  So happy to have found you!! All because of Yelp.  Ok gotta go.   My delivery should be here shortly.   Oh yeah.  They deliver!  One more thing, Wednesday night date night is an amazing deal! Great food, great wine choices and the salads are delicious.  I really can't say enough.  Thanks!"], ["Annalisa S.", "Food here was all pretty tasty! I had the spaghetti and various desserts from the bakery case. My favorite I think was the lemon ricotta cookies, yum! Overall it was an enjoyable experience"], ["Kristen B.", "Excellent! The burrata was perfect!! The meatballs were great and so was the homemade pasta. We will definitely be back! Very good but also casual and easy."], ["Alex G.", "This post is a little late coming, but DiFranco's cannot go unnoticed! Walking up to the building I definitely thought this place would be more of a modern, fusion take on Italian food. Rather, I was unexpectedly and very very pleasantly surprised to find this little gem of Italy right in downtown Denver!! We ordered a full course starting with the burrata as an appetizer, caesar salad, and two entrees-- one of the Spaghetti with Meatballs and then the Chicken Parmesan sandwich. The food was all incredibly fresh. The pesto served with the burrata we ate was homemade prepared right there as we ordered it. And the ciabatta bread was absolutely soft with a little bit of crunch. The caesar salad was flavourful and not dry and lacking in zest like most appetizers. The kicker however was the meatballs! Talking with the manager we learned that the meatball recipe was passed down a couple of generations and has become the staple dish at DiFranco's. The menu boasts that Italian traditionalism and quality as there are only a few entree items to choose from. This made me wary at first, but I see now why they offer fewer entree selections--the meatballs are THAT good. Flavor, spice, and a perfect balance of moistness without falling apart. I can't say enough about this place except to go and order and be astonished at the experience you'll have. Talk with the staff because they know their food! Also I loved the pics on the walls of all the family members who brought these recipes over from Italy. Enjoy!!"], ["Alison C.", "My boyfriend and I came to this restaurant before watching Pippin for a quick bite and it did not disappoint!! I had the sweet corn ravioli and I will definitely be craving that I'm sure. It was perfectly seasoned and the cheese with the corn complimented each other. My boyfriend had the meatball sandwich and the meatballs had great flavor to them and the tomatoes in the sandwich were very ripe and had that pretty deep redish pink color to them. YUM. Just a quick side note, if you've never been here before you can park in the garage right before the DiFranco's entrance(for FREE). It is kind of a weird entrance because I think it may have been designed by someone from Europe. The lanes are opposite of what we are use to here in the U.S. Happy eating!!!"], ["Erin H.", "You must come here!  Or, then again, maybe it's not that great and you should all stay away so that I can always find a seat at the table...I'd had DiFranco's bookmarked for a long time based on the many other glowing reviews and finally made it in and tried the Wednesday date night special.  The only thing more fantastic than that deal was the food itself!  To enlighten you, the date night special involves 2 salads, 2 entrees, 2 cannolis, and a bottle of wine all for $40!  What a steal!  And, everything was wonderful.  The salad option is the house salad and it was very good for what it is - a basic salad.  Next time I'll see if you can upgrade for an extra cost because they had a salad with gorgonzola that was calling my name.  For entrees, my friend and I shared the angelhair pasta in red sauce with a meatball and the penne in vodka sauce.  Both dishes were again very good.  The meatball was absolutely delicious.  If I had to choose, I'd say I preferred the penne because that vodka sauce was so darn good, but both dishes were excellent.  I can't wait to come back and try more of their tantalizing options as it was very difficult to choose.  The cannoli were also pretty good, but cannolis in general are not my favorite dessert.  I know some people absolutely love them.  And, while the wine selection is limited on the special (one red, one white), the red wine we had was also very good.  It's not like they give you a bottle of crappy tasting cheap wine - they've found the good ones.There's one large community table and then two smaller tables in their relatively small dining room.  We arrived super early and were able to snag one of the small tables, but I also think it would be fun to sit at the community table.  Definitely a good experience and I can't wait to go back."], ["Lisa B.", "My boyfriend and I LOVE this place. Amazing every time we go, however, this time, I had the fettuccine and I was pretty disappointed.  It just didn't have the flavor the other dishes have.  My boyfriend had the fresh sweet corn ravioli and I will only be ordering that dish in the future. It. was. amazing.  Tasted like something that would be served at a much fancier restaurant. I found a ScoutMob coupon that gave us 50% off ($10 max) which only just makes us love it more."], ["Emily K.", "The new menu is delicious and beautiful. Last night, I opted for the Tomato salad and was blown away. The salad alternates slices of juicy tomato and thick fresh mozzarella, dressed with red onion, basil and topped with pesto; it was flavorful, delicious, and colorful. Eating with my eyes and stomach was satisfying and fun; I couldn't help but take a photo. Better still was the sweet corn ravioli, made vegetarian on request, and topped with toasted almonds (which I preferred to the pine nuts). Handmade and stuffed with homemade ricotta mixture, Ryan DiFranco got this one right."], ["Erin M.", "DiFranco's did not disappoint. The pasta tastes like it is home made, the sausage is delicious and I could eat the sweet corn ravioli every day twice. The homemade lemonade is also a menu item not to miss. Looking forward to my next trip!"], ["Marty D.", "This place is probably the coolest little Italian restaurant I've ever been to. The date night deal is perfect for a couple looking to spend a fun night out without paying too much. Their menu is small but the choices are as good if not better than places where you can pay twice as much. The cannoli's are delicious, I'm not a chocolate lover but I do love pistachio, and that was off the charts! I couldn't walk out of this place without purchasing some sauce and sausages to have at home."], ["Heather D.", "Fabulous hand crafted Italian food for a great price. I had the eggplant and spaghetti. The handmade spaghetti was amazing and the eggplant was cooked to perfection. No overly breaded oil pile here, only savory, tender, tasty eggplant. I don't know if I've ever had a reason to say so many good things about an eggplant before! Yum! The sauces were smooth yet both robust and hearty as far as flavor is concerned ;-)"], ["Paul M.", "I enjoyed my meal here - fettuccine and wine. But it wasn't worth the price I paid - over $23 plus tip. The portions were relatively skimpy, the food was a bit greasy, and the environment is more like a cafe or fast food spot than a restaurant. For the price I paid you would think it wasn't a cafe environment. I don't like writing negative reviews, especially since, with a little research, you would realize what you're in for. I enjoyed my meal but I won't be returning here."], ["Amy D.", "Well Ive never written a review on Yelp, but after getting take out from here i decided it was time.  I looked at all the reviews and saw there were no negative ratings.  well i guess ill be the first.  My boyfriend and i had never been here so decided to take advantage of the purpose of scoutmob (finding new joints around town).  We went and got take out, we got home and wondered if the 50% off scout mob meant 50% less food.  I had the green salad and had to add extra veggies and lettuce to my salad.  He had a pasta dish that barely covered half of a medium sized plate. My salad was boring and small. We had to make a pizza when we got home, as well, with our tiny portioned dinner from DiFrancos.We were wondering if the portion was smaller because we had the 50% off scout mob app. We had expressed to the cashier that we had never been and new in town.  On a good note, the staff was very nice and the food was ok.  I do not eat  meat but i noticed there were sausages for sale in the deli portion of the establishment and they were frozen.   Not sure if its me, but i thought deli 's had fresh meats and such????? not frozen.  Being from the east coast, maybe I grew up with a different view of the word \"deli\".  I will not return again"], ["Peter M.", "Best chicken parmesan I have ever had.  Seriously.  No seriously!  This is my go-to Italian restaurant in Denver.  And it's more of a cafe / family style place.  Not a ton of seating but you can share one giant long table with all the other guests.  It's seriously a hidden gem.In house made pastas, marinara sauce to die for, super fresh salads, reasonably priced beer and wine... And don't forget dessert (their cannolis being my favorite).  You can feel the love coming out of the kitchen."], ["Jordyn S.", "Love love LOVE this restaurant! A coworker showed it to me and I've been back at least 3 times a week for lunch since and the whole office is hooked. We love that it fills you up but since they use fresh and local ingredients you don't feel bogged down and crash afterwards. They have a great lunch special. The food is fresh and delicious, no matter what you get. I'm usually the person who gets the same thing every time, but I've tried a different thing each time I've been there and now I can't decide what to get because they are all my favorite! I am also known to stop in for an afternoon snack of Italian soda with fresh herbs and some fluffy lemon ricotta cookies. Can't wait to come in and try their date night special!"]], "Angelo's Taverna": [["Caitlin F.", "Chill I-Talian. Oystas and thangsGot some good wineAnd yum lookin wangsSpecialty? The pastaAnd the menu of 'zaPlus menu of appsAnd oysters- not raw!"], ["Jamie G.", "Absolutely love this place! We had the best experience tonight... from our waitress, Margie, to the manager, Karamy, who treated us to the most amazing appetizer. Try the burratta! It's so yummy! Lemoncello is housemade...woo hoo! My entire meal was delicious. I'll be back next time I'm in town for sure."], ["Jason B.", "Exceptional service. Exceptional food. Exceptional wine. Far and away my first choice for date night Italian. Lasagna is incredible and desserts are to die for!!!"], ["Alison C.", "Oysters, pizza, casual atmosphere, and great wine list. This place is such a gem.Angelo's is my absolute favorite pizza in Denver. Make your own and make sure you add goat cheese.Can get super crowded so we often do take-out but if you can snag a table, it's worth it for the buzzy atmosphere."], ["Heather T.", "A friend and I came for lunch Monday. We were quickly seated and the service was friendly and prompt. I ordered the fried oyster po'boy with the Northern bean soup as the starter. The soup was really good with a nice balance of beans and veggies. It flirted with being a tad salty. The po'boy was very good. The oysters were crispy and the remoulade sauce was a perfect pairing. The only thing I pulled out were the fresh tomatoes. Fresh tomatoes just don't belong anywhere on a menu in February. My friend had the Caesar salad with sliders; sausage and meatball combo and was quite happy."], ["Marianne H.", "Last night, we drove from Boulder to go to Angelo's for a family dinner and it was great! Everybody at the table raved about the food. I had the lobster gnocchi and it was superb. The service was exceptional also. We would definitely eat here again."], ["David T.", "Just a quick note to update based on my first delivery experience in case anyone is not feeling like fighting the crowds that have discovered the place - especially HH.I'd received a pamphlet at my door with an offer of delivery which kind of surprised me - seems like they're doing land office business without having to deliver but, heh, if they want to deliver it's more than OK with me.Called pretty early (delivery starts at 5:00pm) and Kyle (very nice guy on the phone) said I'd be first on their list.  Placed my order and it showed up, delivered by a very nice guy about half an hour later.Ordered arancini, small caesar, spaghetti with marinera and a sausage - came with garlic bread, too.  $20.52 plus tip for the driver.  Less than I spend for many less satisfying meals from the local Asian joints.  Spaghetti was a little sparsely sauced but I had some leftover from the arancini so - no problem.  Caesar came with dressing on the side so it wasn't soggy - score.  Only problem was that the requested Parm came in little powder packets (not the wonderful shaved Parm you get if you dine in.)  So, pretty good and I didn't have to get dressed and fight the mob.  Winner winner spaghetti dinner.Just a quick P.S. - had delivery again last night - skip the lasagna (clearly reheated in the microwave) and the cheese was rubber, actually rubber might have been better - tossed it all.  Salad and side of sausages still good."], ["Niki S.", "Drove by this place so many times and finally stopped in this weekend after a long day of brewery hopping. Pasta was Just what we needed it. I didn't think the food was the best but the prices are so reasonable, the portions are large, and the service is friendly. They have a number of vegetarian plates and their drinks are strong and fairly cheap. Overall, I imagine we'll be back."], ["Olivia C.", "I'm sad to give this place a poor review because I've had good experiences here in the past, which is why I made a reservation for my birthday. However, on my birthday it was honestly the worst service I've ever received in my life. I'm mostly writing this review so the management at Angelo's knows what I experienced here and hopefully takes steps to correct it. Until then, I can't say I'll be returning. Here's why: I called in the morning the day before my birthday and told them I would have a large party coming in for drinks and food the next night. When I arrived, they weren't even close to prepared and the server had an attitude. I wasn't upset about that until the rest of the night continued that way.The server, Brittany flat out ignored one of my friends - anytime she ordered something, Brittany forgot her order. She had to wait an hour for her entree after everyone else had gotten theirs and eaten! It took us 20 minutes alone to wave our server down to tell her because she never checked on our table and kept walking by without looking at us. Eventually, I got up to look for her and she was around the corner talking to her coworkers (not about work).This behavior continued when my friend ordered drinks - she would bring everyone else's but not hers. Additionally, she forgot other people's food and drink orders but the way she treated this particular friend was aggressively rude. She didn't even comp my friend's order that was an hour late!!! When any of us would say something about orders she forgot to bring (note: we did so politely because we understood we were a large table and we've all been servers before and get what it's like), she had an attitude with us as if it were somehow our faults that she didn't bring us food or pay any attention to us. We were ordering a lot of food and drinks so she was going to get a big tip from us. She could've been pleasant and somewhat attentive! It was like she didn't even try. In fact, the high school age bus girl was more sweet and attentive to us than our server. (Please promote her to server - she was great! Unfortunately, I don't remember her name, but I would happily come in and point her out so she gets the credit she deserves for being so lovely that night.) At the end of the night, we were all discussing what we were going to tip and everyone said they were still going to tip her a fair amount even though collectively we were all dissatisfied with the server. However, our server didn't give us a chance. She automatically added 20% gratuity - without even telling us! There wasn't a note about that amount automatically added to parties of a certain number on the menu, plus having been a server myself I was surprised they added 20% since everywhere I've worked it has typically been 10-15% with a line for an optional additional tip.All in all, I was shocked at the service from Brittany. I had been to Angelo's before and had great service, but Brittany was so terrible to us that I cannot fathom going back even though this was likely a case of one bad seed tainting it for the rest of them. I truly hope Angelo's considers better training for servers in the future so this kind of behavior doesn't continue at this otherwise lovely establishment."], ["Charles C.", "Wow - those chipotle oysters had a kick! Certainly some of the best I had in Denver. You can go wrong with the pizza. They have some great lunch and happy hour deals so be sure to check out this establishment which has been around for over 40 years. Friendly staff as well."], ["Robert V.", "Nice little place that doesn't seem to get the attention it deserves. Even at what should be busier times, it never really seems crazy busy even though the food is delicious and their oyster happy hours are delicious! Their happy hour includes $1 oysters, yum yum yum! I've tried a few of their pastas including the spicy shrimp dish, Gorgonzola steak, and the classic spaghetti with meatballs. Every single was has been superb. The eggplant Parmesan is great as well, but it can be hit or miss. They don't always fully cook the egg plant well so it comes out chewy. The meatball sliders are adorable and quite tasty to boot. The decor inside is home-y and not too flashy. They hire a great wait staff that are attentive, personable, and pleasant to talk to.They have a larger selection of beers, wines, and drinks on their menu. Yet to try them, but they all look great!Great Italian restaurant to try out, in a town with not many local Italian restaurants to brag about."], ["Rori M.", "This place rocks! $1 raw oysters, $2 chargrilled oysters and a Manhattan Flight plus we were able to watch the football game! What could be better than that?! Everything was delicious and our waitress Kate was awesome!"], ["Bill S.", "Came here with my sweetie for dinner. Very good service. Everyone was very friendly, the manager/owner stopped by to check on us and chat. Offered free desert or wine because we were seated in a back room. Perfectly ok with the seating but nice gesture. We got oysters on the 1/2 shell and calamari for apps. Both were great. Best oysters I've had in a long time and the spicy/sweet calamari was good enough for a meal. Tonya had bolognese and I had pizza. Both were very good. Took advantage of the offered free desert spumoni and carrot cake. If this wasn't so far from home we would eat here often. Try this place you will enjoy."], ["Corey C.", "Delicious grilled Oysters and pizza.Packed during happy hour.  Long wait, but we got a spot at the bar and the bartender was attentive and timely.  We ended up canceling our table and staying at the bar the whole time."], ["Emilee D.", "Love the Sunday brunch here!  Social mimosas for $3?  Bring it on!  We came here for the oysters and did not leave disappointed.  I had the grilled oysters in two different flavors:  Chipotle bourbon butter and Bacon gorgonzola.  These were so delicious!  The icing on the cake is that the staff are very friendly. They also have an outdoor patio that usually has a different theme each month.  I highly recommend this place for Sunday Funday!"], ["Skyy H.", "The happy hour here is simply amazing!! There is a wide variety of oysters that are chargrilled and we tried them all. They come fresh and hot off the grill. The raw oysters were also amazing. Happy Hour 3 whiskey and gingers. We watched the game and ate until we couldn't eat anymore!! Our server Ann was such a doll. .. My family and I will definitely return and will tell our friends!!! This place rocks!!"], ["Amanda T.", "I have had take out from Angelo's on three occasions and it's not bad, but it's not amazing either. It's definitely A-OK. The lasagna is probably the best bet, I've had it twice and it's super cheesy which is how I like my lasagna, but the seasoning is relatively bland. However, the one time I had the Chicken parm the chicken was was super dry and overcooked and I won't order it again.The place is super loud as well. I can't imagine eating there as when I have gone there to pick my food I'm anxious to pay and get out. That all said, it's not bad, the price is reasonable and I probably will grab food from there again when I don't have time to cook."], ["Samantha G.", "Ahh-maize-ing. This place was great... So great that we went back a second time for dinner the very next night. Excellent fresh oysters (according to my boyfriend, I don't care for them and that has nothing to do with Angelos), however the \"original\" char grilled oyster was delicious, and I don't like oysters!! The lasagna was made perfectly with lots of fresh mozzarella. The bruschetta was SO GOOD. I will say the only miss was the pappardelle. I loved the fresh pasta but they added a ton of cream to the meat sauce and it gave it a weird milky flavor. We asked for some fresh Parmesan and it fixed the issue and put flavor back in, but if I ordered it again I would ask for marinara not the sauce the come with it."], ["Matt H.", "We were really excited about the reviews for this place, but not as excited about the hour wait time ( which makes sense for a Friday ) so we decided to do take out. Horrible Idea. My Lasagna was burnt and dry and my boyfriends Alfredo had no flavor. Our appetizers were probably the only redeeming quality of our meal. Maybe the experience is better when you dine in, but I definitely do not recommend take out."], ["Cody C.", "I'll start this review out with the negatives just to get them out of the way...*Ticket times were just a tad bit too long*The tiramisu tasted like something was sour in the cream and when we bought it to our server's attention she said she would check with the chef. She did so and she came back and informed us that there was nothing wrong with the dessert and that it \"must have been a bad bite\".... All three of us must have had a \"bad bite\" then because we all agreed it was horrible. If you claim to be an Italian restaurant, expect Italians to keep you in check. ESPECIALLY with something as simple as tiramisu.*Our server seemed to have a bit of a negative attitude when she would walk away from the table.*Our server switched the tickets on us overcharging one party at our table by double her bill. When this was brought to her attention she immediately snatched the tickets back up to go and reverse the charges. (I honestly think she may have just been having a bad night.)Now the GOOD*When our appetizers did come out, they were amazing*The cocktails were very strong and flavored well*We all had gnocchi (two lobster orders and one chicken) and everything about all three dishes left us wanting more!All in all, we'll go back for the entrees. Not the desserts or that particular server. Fino a quando di nuovo!"]], "Trattoria Stella": [], "Mici Handcrafted Italian- Stapleton": [], "Brava! Pizzeria Della Strada": [], "Odyssey Italian Restaurant": [["Beth W.", "We were visiting Denver and did a yelp search. By accident came across this place.  It was a wonderful surprise.  From theMinute we walked in we were in love. It was a very cosy quaint location. The family feeling was wonderful. The waiter was very attentive and everything we ordered was yummy. We sampled a great bottle of wine and had to have it.  We asked that the food be served family style so we could all share and they were very accommodating. Even though we were full we could not resist the dessert and it did not disappoint."], ["Scott C.", "I moved to Denver almost two years ago.  Never really found any great Italian food till I walked by this place.  Do not let the cheesy facade or the strange name fool you.  This place is great!   It is my first recommendation to people when looking for somewhere to eat.  The prices are great and the interior is very old school Italian joint.  Simply lit with candles and great music.  Place is perfect to get fat on some good Italian food and kill a bottle of wine"], ["Nikole W.", "This was our first time and what an amazing experience, everyone was so friendly. The owner and his son took the time to share the history of the restaurant with us among other stories. The waiter was very attentive, full of charisma and charm, a true professional. The food was delicious and huge proportions. And the atmosphere - relaxed and romantic. Looking forward to going back."], ["Holly R.", "This place is a total gem.The ambiance is quaint and comfy. Its cluttered and a little dark; adding to the romance and authenticity of the restaurant. I am from NY and have many go-to Italian restaurants I frequent and adore. I had a hard time finding a restaurant in Denver that could compare until my boyfriend and I tried the Odyssey. We were warmly welcomed by our server who was knowledgeable of the menu and gave excellent wine pairing advice. We were in the mood to leave stuffed and sleepy and that's exactly what we did. The menu consists of your basics as well as some family Sicilian recipes that came highly recommended. I ordered seafood fra diavolo and my boyfriend, the veal bracioli. Both entrees were served with fresh Italian bread and a caesar salad. My entree had a generous spread of seafood and excellent spice and flavor. The veal bracioli was tender and hearty, served with mixed veggies and fettuccine. Since our first experience at Odyssey we have also tried the fettuccine carbonara which I would definitely order again. It was rich and heavy but the flavor was amazing. We have also tried the classic chicken marsala which was on the sweeter side but again, I was very impressed. This unassuming Sicilian family restaurant is a staple in my opinion. Go check it out!"], ["Morgan S.", "I'd like to keep this place a secret but I can't. This place makes me feel at home. Enough said."], ["John N.", "We parked a few blocks away from this amazing restaurant and began our adventure with no specific plans on where to eat and drink. But as we walked an amazing aroma of fresh baked bread, and garlic filled the air and we were hooked. Walked into the doorway where the hostess asked if we made reservations, cringing slightly I said no. The hostess was very nice and quickly looked for a place to seat us. The owner and chefs son graciously greeted us and shook my hand, escorted us up to the third floor of what used to be a home which is 110 years old. He sat us in a quiet room called the violin room and we had it to ourselves. Shared wine, bread and fantastic Caesar salad with from scratch dressing. Then the owner and chef who is Sicilian came to our table and shook my hand and greeted my wife and spoke with us about the building, the food and beverages as well as a short history of Sicily. He told the waiter to bring us a conolli and his homemade lemoncello at the end of the meal. We each had the penne rustica which had homemade ricotta and some of the best sausage and sauce I've ever had. It was amazing to say the least and the service from Giullermo, the owner and his son was equally amazing. The best part of the night was actually the conolli and homemade lemoncello. I have never had such a quality drink like that at a restaurant ever. All in all it was a great adventure trying a new place and we will be back as it will become a regular place for us."], ["Betsy G.", "Went for dinner last night and it did not disappoint! Great portion size for the prices and the ambiance was fantastic. Plus the staff was super friendly. Definitely going back soon-"], ["Patrick G.", "Great super star Italian! From the warm greeting at the door, fireplace, A+ menu, loud entertaining vibe in a down to earth ahmosphere. Great service, inexpensive menu ($18 plate), with great food. Can't say enough, we just booked our valentines day! Can't wait to come back!"], ["Shawn B.", "Service was great food was great couldn't ask for better. I would also like to add that the price was also very reasonable! I use yelp all the time to find places to eat and I wouldn't steer anyone to a bad place to eat."], ["Camila M.", "It's sad I'm giving this place 2 stars after had searched so much about it and read many compliments towards Odyssey. Let's organize why I cannot go with the other yelpers:- food: I ordered the rack of lamb and my boyfriend the ossobuco. My lamb had the perfect texture, but it was unbelievably SALTY. Let's add in from Brazil, where we do not like mildness when it's about salt. The spices were nice (love rosemary), but after a few bites it was just too much. Disappointing. The ossobuco was dry. VERY DRY, and considering that it was lightly red, it was medium rare, so I'd say it was just bad quality meat. For appetizers we had the fried calamari, we had the house salad and warm bread with our entrees. House salad had fresh and crispy lettuce, our second bread was fresh, too, but the first one was too chewy. Cannoli was very yummy, great texture and flavor. I think I had settled high expectations for it, but not even that explains the 64 dollars+taxes for salty and dry meat. After taxes, it was a 120 dollars check for what I'd pay 60 or so.- staff: another disappointment. They were friendly indeed, but for a Tuesday after 8pm, service was slow. We had to remind them about our bread. Also, when I asked about a sparkling wine, the waitress who supposedly knows wines, brought me a bold fruity red. And I even had said \"maybe something rosé\".- ambience: it was romantic, low light and soft music, but they should pay more attention when they get reservations. After had asked for the most romantic and nice table in the house to celebrate my boyfriend's bday, we were sat beside the noisiest table, with 5 drunk guys celebrating something. Those guys even broke a bottle on the only tight corridor to walk in the restaurant, and the staff cleaned it with this super strong-smelly product. Not the best to have in your nose while having dinner. Maybe they just should separate big parties to what is obviously date tables, once the restaurants has two different dinning areas? Last thing: the kitchen is open to the rest of the restaurant, which made my hair and clothes have a strong fried food smell. Not nice!Conclusion: I will keep the two stars because after the noisy table left our area, we had a nice moment. But can't give it more than two stars because the food was really disappointing. If you really wanna try for yourself, order some pasta. Maybe you get luckier!"], ["Annie B.", "This place is simply fantastic!!! A wonderful neighborhood gem in Cap Hill/Cherry Creek. Beautiful restaurant with perfectly appointed decode. The food was absolutely fantastic and the wine list exceptional. The service was fast, attentive, and highly engaged with their customers. I will be back often and with people in tow!!!"], ["Michael J.", "We had an awesome time tonight. I want to give thanks to our server Gary. Michael you really made it a special evening for us. You are wonderful. The food was excellent. We started off the Rice Balls appetizers. They were to die for!!!  You must try them. Beanie had the Bow Tie Pasta Gorgonzola. She loved it. I had the Veal Saltimboca. The sauce was perfect, the veal was tender. I thoroughly enjoyed. The portions were huge. for the desert Michael put together a Strawberry Flambeau that was heavenly. It was an awesome experience. Ignacio, Mikes dad came and said hello and had the Violinist stop by and played for us. It was a great dining experience, and it was for Valentines day. Michael thank you. It was as you said....Nice ah, nice ah!!!!"], ["Carlene N.", "My husband and I made a reservation here tonight to celebrate buying a home. We arrived and were warmly greeted. A waiter sat us instantly. (I assume there was a hostess so I appreciate that he stopped to help) Everything was going well. We got our waters, and then... some more water...  but no waiter. After 20 minutes, we decided to leave. I'm sure it was just miscommunication upfront and doesn't happen often but it still sucked.It was cute though on the inside. Very romantic. Very quiet. It's too bad we couldn't enjoy it for longer."], ["Deborah W.", "I'm suprised that I had forgotten to review this place. Being from out of town, I was looking for a great Italian dinner when first arriving to Denver. After looking at reviews all over Yelp I stumbled upon this place and what caught my eye was everyone remarking on attention to detail and remarkable personal service. Well the reviews were not mistaken. This place should be highly commended for being a small Italian family run restaurant next two 2 others on the same block. Every smile is genuine and every meal is perfected. We enjoyed a bottle of wine, pastas, and had the best seat in the house! (Right corner booth)They made us feel like we were the most important people there, but I think they made everyone feel that way. Thanks again Odyssey for a great time and when I come back to Denver in 2 weeks I've already made my next reservation."], ["Haley P.", "Went here for first time last night. It is a 109 year old Victorian home and it was amazing!! 100% satisfied and will definitely be back. The food was 10/10, the service was 10/10, the restaurant its self was also 10/10."], ["Megan J.", "Our favorite Italian joint in town! We've been several times and try to order something new each time. We have never been disappointed! The roses, the wine, the food, the ambiance, it's all so wonderful! Order the bananas foster, you won't regret it."], ["Carol C.", "Amazing amazing amazing! The best service and food I've ever had. I felt like I was eating at my great grandmothers Italian home!"], ["Tracey B.", "Cannot say enough about this place. The atmosphere is romantic and upscale while open and relaxed at the same time. Food is amazing and service is first class."], ["Casual Critic D.", "A hidden Denver gem! Odyssey is hands down one of the very best Italian restaurants in the city. Agustini and Michael could not be better hosts or more welcoming proprietors. The staff of Odyssey makes the experience worth coming back over and over again. Genuine Italian cuisine in the most welcoming environment. Great food, great wine, incredible staff, the fun flambé show.....I could go on and on. If you love Italian food you must stop and see the folks at the Odyssey. Highly, highly recommended."], ["Ryan S.", "A rap about this restaurant: I walk into odyssey and what do I see?A bunch of roses displayed so intimately Order your wine from a vast selectionIf you love Italian food, head this direction. While some call it relaxed, the service is slowBut let that deter you, or make you a foe.And like a good show, the best is always last,The flavor of bananas foster in my mouth alasA honeymoon treat this turned out to beA bottle of wine was a gift for me."]], "Piatti": [], "Barolo Grill": [["Erica W.", "I have been frequenting this place for six years now and I cannot believe I have not taken the time to review my favorite place to dine in CO. Valet has ALWAYS- every single time- been welcoming and kind. This is saying something because I have been there on average once a month since I discovered this gem. I love the ambiance. Comfortable and with charming with authentic Italian decor. We always get a booth and have come to love our waitress Erin who not only knows me by name, but also by my wine preferences and food allergies. Her memory for our favorite dishes never ceases to amaze me especially when using her knowledge of my palate, pulling from the current seasonal menu to guide me to a new favorite. The food is superb. The way the chef utilizes different textures is a favorite of mine... balsamic reductions beads, cheese flan ...divine. This truly is my favorite fine dining establishment and Denver would not be the same without them. Barolo Grill you are the best."], ["Jennifer H.", "The moment we walked in the door, we were treated with the utmost hospitality.  From the valet who opened the door for us to the ladies at the hostess stand, it was as though we were Hollywood royalty.  That was just the beginning.  The food was beyond divine.  It reminded me of the time we went to Gary Danko in San Francisco.  The meal was top notch.  If you ever have a chance to try the parmigiano-reggiano flan, you'll think you died and went to heaven!  That was just the beginning of our meal.  I had the Bistecca al Barolo (Manhattan steak),which was cooked to perfection.  My sister had the monkfish.  We each had a tasting portion of primi piatti.  We shared the spaghetti al cinghiale (with wild boar ragu) and the tagliatelle ai funghi. The pasta is homemade, in-house.  My mouth is watering just thinking about the burst of flavors!  I want to go back to try the gnocchi.Because I'm not Hollywood royalty, I did not partake in the truffle tasting menu.  Oh, but I wish. Perhaps another time.The service was fine but the food was better.  It took longer than expected to get my pre-dinner cocktail; however, the food came out at a reasonable pace and the staff was great about clearing plates for the next course.  The waitress wasn't as attentive as I had expected for that caliber of restaurant.  But then again, it was a Saturday night and they were extremely busy (and a major local news anchor was dining at the restaurant and she was waiting on his table as well).  Perhaps he had ordered the truffles!"], ["David M.", "Are you the US government? If so, then lucky you. You apparently get to print all the money you want and so you won't have any problem in picking up the tab at the Barolo Grill.\"Would you like to kick up that mezzaluna pasta and add shaved black truffles to it, sir?\"\"Why that sounds delicious,\" I said. \"Sure. Shave a few of those babies on top for me, purdy please. Ummmm ummmm.\" Turned my appetizer $14 half-order of pasta into a $29 dish. But yikes, that was without a doubt the best pasta I've had that I can remember.And you say you'd like some wine with that meal? Well, you could look through the 33 pages (!) of just the Barolo wines on the list (the wine list is 96 pages long), but it probably would make more sense simply to ask your server/sommelier. S/he won't recommend their $1,200 bottle of 1962 Borgogno Barolo Reserva unless you tell them that you're looking for something truly extraordinary. Now do you have to spend that ridiculous amount of money to have a great meal at the Barolo Grill? Absolutely not. You could go in and have a delicious \"Barolo salad,\" one of their incredible full orders of pasta as an entrée and split their best-in-Denver crème brulee. Accompany that with a very good couple of glasses of wine from their mega-list and you'd probably be able to have a wonderful and special meal for around $50+ per person. Add a nice tip for the superb service and you just will have had one of the best Italian dining experiences Denver has to offer and for a reasonable price.Sign me,Davide \"tutto finisce a tarallucci e vino\" M.Oh P.S. We were celebrating the sale of our loft by taking our real estate agent and her partner to Barolo's for a blow-out dinner so now we're broke and need a mortgage agent (who we're not taking anywhere:).And P.P.S., Here's a tip for you: Ask to sit next to the fireplace. It's a very romantic spot."], ["Alice G.", "It has taken me AGES to make it to the famous Barolo grill which has been a Denver Darling for many years now!  Tucked on 6th, it never seemed to jog my memory at the right time...until now.Yes, we all know the food and service is excellent, the wine list a tome thicker than my thesis, and that the staff heads to Italy or the south of France annually to collect wine and enjoy the food!Finally, the event that brought me here was the stinking Corpse Flower at the Botanic Gardens. Truly.  And Truly Stinking.  After waiting in line for many hours to see the wonder of the smelly plant, the group was exhausted, starving, and UBERING so we said...Hmm, what's nearby?  And Yay! Barolo finally came to mind, and wonder of wonders, they had a table open- so we were on our way!As other reviewers have mentioned, the service is top notch and we were not disappointed with our server Carmen.  The food was divine. The Côtes du Rhône was yummy and complemented our many many courses. We tried the caprese, melone con Prosciutto, the mushroom salad, the duck, the rabbit, and two pasta dishes. The pasta dishes, by the way, were ASTOUNDING and should be the first thing you order here! My daughter even took one for the team with a teeny scoop of gelato at the end.  Bellisimo.Bravo, Barolo, Bravo!  It is nice to find something that lives up to it's name."], ["Kerry S.", "Our favorite special occasion restaurant in Denver. We have been maybe 8 times over the last few years. Service is stellar, supremely competent, welcoming and relaxed. Food is a combination of creative and approachable, perfectly balanced flavors. Salads can sometimes have a bit more sweetness than I prefer (fichi and rucola salad with hazelnuts last night was delicious, wish it had maybe a tad more balsamic).  Mezzaluna cacio e pepe was like a ravioli with melted cheese inside, delicious cheese sauce with just the right balance of some kind of alcohol to liven it up, and liberal pepper ... Truly one of the best dishes I have ever eaten. Since it was our anniversary, they even brought out a little after dinner drink and chocolate truffles for us. I haven't mentioned the other delicious courses, but rest assured you truly can't go wrong. Wine is highly marked up, more than standardly at restaurants, maybe 3-3.5 times retail (a $15 bottle at the store will run say $50 here)."], ["Jennifer M.", "I've been wanting to try this place for years, but they were either not open (they are closed Sunday and Mondays), or fully booked on days I called to make a reservation. I finally got to try this place and I'm so happy I did. The restaurant is intimate and classy, and the staff were so friendly. The waiter did a great job in explaining the a la carte and tasting menus, as well as explain anything on the a la carte was able to be ordered in tasting portions. For an appetizer, I ordered the Crudo di vitello, which was beef tartar served as a flat square the size of a toast, with a quail egg on top, and crispy ciabatta bread on the side. I'm usually weary of ordering beef tartar because of the iron taste in raw beef, but this did not have that at all. I also ordered the Tajarin al ragù di verdure in a tasting portion, which was about 5 or 6 bites. It came with morel mushrooms, artichokes, spinach, thin slices of parmigiano reggiano on top, with a creamy, white sauce. Even though I did really enjoy this dish, I'm glad I did not order it a la carte because it was rich. For me, 5-6 bites was perfect. Additionally, I ordered the Gnocchi con granchio which came with big chunks of delicious crab, parsley, and shredded pieces of celery in a red sauce. The food was magnificent and I really enjoyed my time here. I definitely plan to return and try more from their menu."], ["Jason G.", "There's a reason that many very wealthy and yes slightly stuffy people are frequenting this star of Denver cuisine... If you have a demand for flawless service. I mean perfect service then Barolo will exceed your already other worldly needs for what a dining experience should look, feel, and taste like. Are they the perfect picture of modern food trends? No. They are the perfect picture of a service and quality focused restaurant where the dining experience is second to none. Upon walking in my girlfriend and I who are in our 30s and truly demand quality in all aspects of our life, without acting like spoiled aristocrats were pleasantly greeted and shown to our reserved table. Moments later we had water, menus, and were made to feel welcomed. This was an ordinary night for us. No special occasion no grand celebration. For us this is how we choose to enjoy a Friday night out together.  And enjoy is an understatement for how we experienced our night!Our server named Chris who is a level one Sommelier took the lead on helping us discover a new Italian wine. While he could have sold us a several hundred dollar bottle from the wine catalogue, he brought a very fair priced Super Tuscan. It was remarkable. While it could have used a slight chill, we drank every last drop with glee. Going back to Chris-- he was charming, kind, and a wonderful guide through our entire 2+ hour dining oasis of flavor and enjoyment. This was this finest service we have experienced in the Denver area by far! This is an example of what extraordinary service should look like. Take notes restaurant owners and chefs...When we walked in the door we immediately noticed huge flower arrangements throughout the dining room. I love fresh cut flowers and I think this is a brilliant and tasteful addition to an already classy and warm dining room. I haven't even mentioned food yet and my heart is racing with excitement I feel even just writing this review...Here's a fair critique that they could improve on. The bread sticks and dipping sauce are so 1990's and a restaurant of this level could serve artisan bread and fine olive oil with flaked sea salt and the guests would drool from moment one. In this day and age serving standard table salt on any table should be stricken and removed from practice. Now that I have that out of the way, allow me to rave and I mean RAVE over the food coming out of that star worthy kitchen. Not only did the food come out looking like a photographic tease, it was quick even on a busy night, and the tastes were exemplary in every way. Rather than go for the chefs tasting we opted to create our own food adventure and from the first bite of the asparagus with perfectly cooked egg and yummy goodness we were in our own perfect foodie paradise. Imagine going to a farmers market and selecting the most beautiful ingredients to cool for your dinner guests-- this is how we felt looking and tasting our dishes. The next course was a delightful salad full of shaved veggies and was just perfectly dressed. When we were presented with a gluten free pasta version of bolognese it was nearly a fight to stab our forks into the bowl as we couldn't believe the tastes we were experiencing. It was surreal. Our mains were the Halibut and Duck. Let me just say that this was a dead man walking to die for meal every sense, taste, and mouthful of perfectly cooked food. The plates were gorgeous, the balance of flavors sang out loud, and the meats were exquisite in taste and preparation. Last we were given a trio of homemade sorbets that were the closing grace on an incredible and very memorable meal. Again this is not a place to go for a dinner, it is an experience to have to savor and to enjoy. My truest compliments to the entire crew for a memorable first glimpse of what this kitchen and dining room has to offer guests with a taste and demand for culinary excellence. Please trust me when I say leave the children home, carve out 2+ hours, and treat yourself to some of the finest service and dining bliss available in Denver. I can't wait to go again!"], ["Rachel C.", "I have been *dying* to try Barolo Grill. Despite a number of missed opportunities, I was finally able to visit last night for the Restaurant Week menu. I am a firm believer that Restaurant Week menus should highlight a restaurant's feature dishes, and boy, did Barolo Grill deliver. The food was fantastic, and the ambiance was cozy, friendly, and literally warm (it felt great inside!), while still having that neighborhood restaurant feel. Service was fantastic - our waitress was very welcoming and walked us through the restaurant week menu and answered our questions about the menu and their annual trip to Italy :)First course: Insalata d'invernoSecond course: Risotto ai funghiEntree: Maiale e verdure d'invernoDessert: Panna cotta alla vanigliaOverall, the food was fantastic. Each course was interesting and perfectly balanced - no overwhelming flavors and no lack of seasoning. Some notes:- The risotto was perfectly al dente and had a lot of mushroom flavor. It was delicious.- All of the components of the pork entree were delicious. Unfortunately, one of my pieces of pork was slightly overdone - it must have been an end piece. Still not enough to underscore the dish as a whole. I really enjoyed my restaurant week experience and can't wait to dine in again on their standard menu. Their standard portions seemed incredibly generous and there is so much left on the menu that I want to try!"], ["Melanie S.", "I was visiting a friend in Denver and he took me to this place for dinner. This is the kind of place you go to celebrate something special or to have a nice date. The atmosphere is relaxing and you feel special because the service is great. They have a sampler available for their pastas if you know you can't do full courses."], ["Craig D.", "My wife and I went here for our anniversary - we were looking forward to it.  I'll say this: It is what it is.  We are in our 30's and were by far the youngest people in here.  It's old, it's stuffy, and it's not a very inviting atmosphere.  It basically feels like an Olive Garden, just with really high prices (they even have hard breadsticks!).  I've never and will never spend $25 on 10 tortellini, but that's what I got here.  I'm not joking...10 tortellini.  They were tasty, but I was extremely po'd.  The salad was $15 and consisted of maybe 8 arugula leaves.  I was disappointed and will for sure not come back.  I much prefer a younger atmosphere with fresh, new food.   If you're into this sort of thing, then by all means have at it."], ["Kelly R.", "Exceptional. But extremely pricey. I can't say that the food was as good as the first visit.... But still one of the best spots in town to splurge."], ["kelley e.", "Food: fantastic. Absolutely incredible in many ways. The pork I had was a bit too fatty for my liking, but it was still a great meal. Atmosphere: we had a great table, everything was relaxed and classy. Service: here's where the stars fall short. We saw our server maybe 5 times. He never spent more than 1 minute at the table. He was completely disinterested in us because we did restaurant week. He wasn't unpleasant, but his apathetic attitude was off-putting and arrogant. I have worked in the service industry for many years, I have worked for some amazing small companies in Denver. I'm not a bum or a stoner, I know my food and my service. If your servers are exhausted from restaurant week, I understand. But you don't have to hate on me because I love a great deal at a great place. Additionally, the valet didn't even ask us upon leaving if we had a car, but immediately asked the women that came out behind us. Rude! I don't think I'll be back for their regular menu after being treated as such..."], ["Jennifer R.", "So I've been wanting to eat here since we moved to Denver but could never justify spending so much. Enter Valentine's Day... We never go out on V-Day so we decided to throw fiscal responsibility to the wind and go anyway. Fortunately, we were not disappointed. Since we had reservations we waltzed (no, we actually danced) right in and sat down. The atmosphere is nice and cozy and it wasn't overly loud despite a full house. Our waitress was Erin (I'm pretty sure) and she was very attentive and patient as I asked for the price of every thing before ordering it :-/. They had a preset menu for the big day and after a cocktail it didn't seem nearly as expensive. My husband's old fashion was particularly delicious, especially considering I really don't prefer dark liquor. Each course was very good but not especially mind blowing or noteworthy. I ended up not eating my appetizer because the fish was very fishy, but my husband enjoyed it for me. That being said there was a few standouts and the service was truly impeccable. The risotto, shut the front door! I am a pasta LOVER, but I liked the risotto even better than my pasta dish. The bread... I can't even explain. It tasted like a focaccia bread roll (which is as mind blowing as it sounds.) I could easily eat my weight in that bread. The wine pairings the server suggested were lovely and well matched with the meal. Overall, we had a great time and thoroughly enjoyed our leisurely dinner. We are so glad we splurged! As I said not everything was crazy delicious, but everything was very good. The service was amazing and that bread..."], ["Leah J.", "The service was friendly, the food was delicious but we all left hungry.  Portions were too small all the way around. The atmosphere was oddly formal for food that turned out to be more modern and interesting than expected."], ["Kyle X.", "Went for dinner with my boyfriend. The food and wine were amazing. I had gnocchi with crab meat, my boyfriend had pork tenderloin, with buttermilk chocolate cake for dessert. We were overwhelmed by the 96-page wine list!Two reasons I am not giving five stars: First, we made a reservation through OpenTable and indicated that it was our first time visiting, but at no time was this acknowledged by the host or the server. Second, after our meal, we ordered dessert and an after-dinner drink, but the dessert was brought 5-10 minutes before the drink, leaving us to stare at our dessert while we waited for the drink.Aside from these two small issues, however, it was a great dining experience."], ["Kennen M.", "We heard this is one of the better restaurants in Denver so we were eager to try it while in town.  I can say this place missed the mark we wished we would have had our nice dinner out somewhere else.Upon walking in, this place caters to a bunch of stuffy, pearl wearing conservative folk.  I don't mind who my fellow diners are as along as the food was good, in which this place didn't achieve.  The tables come with a bouquet of crunchy breadsticks that feed your hunger while waiting for your entree.  I ordered the gnocchi and had assessed that it was the worst gnocchi I have ever had beside the stuff you buy pre-made in a box at a discount grocery store.  The gnocchi was slightly rubber with a taste of paste.  Unfortunately the sauce couldn't help save this dish and it was left more than half uneaten.The duck entree was tasty but not to the raging hype of some of the yelpers have proclaimed."], ["shamm w.", "The food here was pretty amazing. If you come here you have to try the Agnolotti Del Plin. It's a pasta filled with veal and has some heavy dark sauce and it's the bomb. Trust you, you will love it. Also they have the best bread ever that has olive oil and rosemary backed on top if it \"I think\". I could just eat the bread all day and be happy. Now, if you are under 40yrs old, you might feel a little out of your element. The restaurant was filled with older people that appeared to have come from old money. Lol. Doctors, stockbrokers, lawyers and so on. There is nothing wrong with that, but if you are a younger couple, you will stand out just a little bit but it's worth it. If you can get a server names \"Mo\" you will be in good shape. She knows the menu like the back of her hand. That's rare now a days. Most people I talk to have to go and ask the chef what the dish is, not Mo. She rocked!"], ["Darika S.", "I don't know why I don't come here more often, (reservation, of course).  We had an outstanding meal, with awesome waitstaff.  The host was very pleasant and polite and were seated about 10 minutes after our reservation.  The bar was out of decanters so had to drink the wine from the bottle.... Of course no biggie, enjoyed a great Côtes du Rhone for under $60.  Started with the 24 month aged prosciutto which came with these delicious bread baked in olive oil, they called them Italian doughnuts, I called them freakin' good oil rounds.  There was plenty of meat too, you could maybe split it with 3 people.  The fruit de mar salad wasn't bad.  The calamari was tender, the octopus wasn't that chewy and had cucumber and melon balls to accompany the seafood.  I'm not the biggest fan of frisée salad.The rabbit pasta was very good, nice pieces of tender rabbit and no bones.  His gnocchi was really good too, homemade marinara with pesto, mmmm.  Our entree was huge and was almost full at this point, but my pork loin was cooked perfectly and his duck was flavorful  Really no apps needed with the duck course.  We ended with espresso and biscotti, (biscotti being like twice the size of a normal biscotti) that was dipped in chocolate.  Overall a great meal and when you don't get all the courses and wine, it's totally affordable."], ["Barbara M.", "I have heard great things about Barolo Grll for years and read many write ups.   Looking at the menus on line, didn't spark my interest much, but this past weekend, all the stars aligned and we went.   Have to say, it was delightful.   The bread/cracker sticks were yummy, the rosemary rolls we delish.  We started with a flan that was interesting.  Delish to one set of taste buds, too subtle to another.   I had the Super Caprese and it was yummy.  Perfect balance of flavors, but the tomatoes could have been bolder.   We ordered an entree of gnocchi to sample for the table and that was by far my favorite.  The sauce was spicy but full of flavor, and the gnocchi was tender.   For dinner, I had the the grilled tenderloin and its was as flavorful as they come!  Highly recommended.  The restaurant is a little loud, but we managed.  It is classy and well spaced.  The service was impeccable.   We will be returning, but this is a planned outing not a spontaneous drop in.   Closed Sunday and Monday and reservations are needed!"], ["Kelli H.", "I went to Barolo for restaurant week.  I had heard great things, and I think I was expecting a new and chic restaurant.  Instead, I found a nice, but pretty standard Italian restaurant.  Nothing was too flashy, but everything was clearly done really well.I ordered off the non-restaurant week menu, because my stomach had been a little upset that day.  I ordered the house salad with petite field greens, d'anjou pear, roasted sweet potato, and banyuls sage vinaigrette.  I also got one of the pastas, with sun dried tomatoes, pine nuts, and cheese.  The salad really hit the spot, but the pasta was underwhelming.I'll give Barolo another shot next year, since the steaks that my friends got looked awesome."]], "The Garlic Knot": [["Krista E.", "Maybe the best garlic knots I've ever had!  The pizza was good, service was good and staff were super friendly. Would definitely recommend this place!"], ["Johan Z.", "Excellent waitress! My fiance and I couldn't help but give a 14$ tip tonight, excellent food, great and quick service, even handled our complicated pizza order! In my top 5 for Denver! We received a free order of Garlic Knots, which were absolutely amazing dipped in the marinara sauce, and we got a half and half pizza. My half was Olive oil base, chicken and pineapple. My fiances was regular with pineapple and garlic."], ["Wayne A.", "This is great pizza place!  Get a whole pie or grab a slice to go.... It's always clean and the staff is great!"], ["Lauren P.", "The service here was excellent. But in general the food here was a definite-- meh. If you are looking for cheap, quick, okay quality Italian food, with great service, go here! If you are looking for something delicious- this is not your place."], ["G S.", "Came back and again, slow service, burnt first pizza.....when we got the new pizza it was very good.  But from a service perspective....I detect a trend."], ["Eric N.", "Excellent food, great service, nice atmosphere and being able to get seated quickly when arriving at or after 6pm on a Friday...can't go wrong with that!!"], ["Kelly B.", "Absolutely awesome for kids!!! They have a little ice cream bar area. You can do birthday parties in the kitchen too!The staff is never bothered by kids which is nice. And they have booze for the parents which a major bonus!!It's a pizza joint. Order pizza and you won't be disappointed."], ["Abby M.", "Ahh the Garlic Knot so delicious and they have wonderful service! They are specialized in pizza and their garlic knots but there other dishes are to die for!"], ["EJ S.", "Great little family restaurant. We have two small children, and the staff are always so wonderful and accommodating, in spite of the mess we sometimes leave behind."], ["Olivia P.", "Delicious. I live right down the street and this is our go-to pizza delivery. It has never let us down!"], ["Laura E.", "This place was rather disappointing. My boyfriend ordered the manicotti, which was admittedly tasty, and we shared some crazy delicious garlic bread, so it gets points for that...but that doesn't do enough to make up for the sad excuse for shrimp scampi I just consumed. There was absolutely no sauce to be found. The noodles were dry, and there was less than a quarter of an inch of water, what I maybe should assume was the sauce? It was more likely just shrimp juice that tasted slightly lemony. Sort of. It was actually pretty gross. If you had thawed frozen shrimp, then boiled the spaghetti and threw some butter and garlic powder, it would have been easily 5 times better than what I order. Plus , it was a lunch quantity? If I'm paying over $10 for a piece of meal, I expect it to taste better than the Italian equivalent to a dollar menu burger.So basically what I'm saying here is stay the hell away from the shrimp scampi."], ["Amy F.", "I am a total fan! ordered delivery a while back. Great Pizza! Very fresh tasting, the sauce had great flavor, and the slices are huge! The cheese garlic knots are a carb lovers dream... ooohy goooey, cheesy, and chewy! YUM!"], ["Erin A.", "Usually the guys here are super fast. Like top five minutes to bring the food out. It's great. Today. 20 mins. Late going back to work. Not everyone has an hour for lunch. Not cool."], ["Daphne T.", "I have to say this place is quite good.  I really enjoyed my beer (happy hour $1 off draft from 2-6)with the Chef's Special Penne and garlic knots.  It's a pink cream sauce with chicken,  broccoli,  mushrooms Romano cheese, and jalapeños (optional). The jalapeños add a good kick to the pasta, never had spicy in pasta before but it sure is delicious. Garlic knots have a nice crispy outer and soft inside. I think it could use a little more garlic though. Overall, enjoyed the food here."], ["Alex L.", "Our waitress was more concerned with gossiping with her coworkers around the fountain drinks than making sure our drinks were filled.  She had a stale personality that said \"hurry up and eat your food so I can go home.\"  She forgot a lot of stuff (i.e. silverware, sweetener, and our drinks) and was quick to dash between our table and her coworker.  While our waitress' service was sloppy, the food was not.  I enjoyed the pizza and garlic knots.When we left, she saw us leave and wasn't even thanked for business or any wave.  Apparently, attending to her daily gossip was more important than the patrons."], ["Tiffany N.", "I wasn't too impressed with this place but I would be willing to give it another go, mostly because the service was lackluster along with the flavorless pizza. We went here last nigh thanks to them sending me a free pizza and garlic knots coupon. There were two other tables seated when we walked in the smell of the place alone is enticing and had my belly grumbling. I have no idea what our servers name was because she was just there and had the personality of a wet mop. She brought our drinks, forgot the sweetener for the tea (the tea? Absolutely disgusting, pass) and was just meh. There was one other server working and she was talking the ear off someone about how she grew up in NY, all about living there, blah blah blah, it was distracting and annoying. Everything came out really quick which was appreciated but that was the best part about the experience. The house salad is enough to fill up two people so split that if you want a salad. The garlic knot basket is huge and I made the rookie mistake of filling up on those but they weren't garlicy at all so that was a let down. Our pizza came our right after the knots and it seemed small for a medium sized pizza (6 slices total). We got the sausage and pineapple and I love that the sausage was more shredded/sliced than traditional crumbled sausage. The pineapple was canned and too sweet and the pizza as a whole was unmemorable thanks to a bland sauce and tasteless dough. I'm not a complete fool though, I took it to go and it was a little better the day after. Our server was quick to give us the bill and we were on our way and yeaaaah, just a lousy experience as a whole. I couldn't waste my money on this place when there are tons of other pizza places out there that are more reasonably prices and actually have some taste to their food."], ["Liz S.", "Our server Colleen was amazing and the food was great too. We will definitely be back!"], ["James W.", "Pizza was a little better than most chain establishments.  I was looking for a place close by that I could order from regularly.  Ended up a little disappointed.   Pizza took easily over an hour to be delivered and I'm less than a mile away.  When my delivery did show up, the caesar salad I ordered didn't make it on the trip.  The driver did however give me back what was owed for the missed item.  The garlic knots could use some more...how should I say it,  GARLIC!  They weren't bad, but when this is what your establishment is named after I expect them them to be outstanding.  Only hints of garlic and they we're chewy like they had been thawed from a frozen box.   I'm always up for second chances, it just might not be for a while."], ["Kristy K.", "I am a fan of The Garlic Knot.  I have ordered take out a couple times since moving to the area. I am always left satisfied.  I love their garlic knots.  They are the perfect consistency, nice and soft, with just a wee bit of crisp.  I love them.  Their pizza is also solid.  It is my new go-to pizza in the area.  I have also ordered their calzone with pepperoni and basil and it is awesome.  I highly recommend The Garlic Knot if you are looking for a go-to pizza place in the neighborhood."], ["Tif D.", "I'm updating because delivery has improved :) Started ordering the \"Grandma\" pie, it's a Sicilian style and it blows the NY outta the watta! I don't know if they use a different sauce, but it's rich and thick-not too sweet. It really has that homemade feel and flavor and it has been perfectly cooked to doneness as well."]], "Gozo": [], "Sarto's": [], "DiCicco's": [], "Osteria Marco": [["Lynn N.", "Cheese plate was so good! The variety was what a cheese plate should be with an aged hard cheese, tangy blue cheese, and soft cheeses. Bread served with it was a good match. And if you can get the sliced, grilled bread, you will see that it's perfectly toasted and has a good chew to it. Just like a good Italian bread should be. Our table ordered a few pizzas to share. I helped myself to the fig and goat cheese pizza. The mushroom truffle pizza was also the best of the night. Quality pizza with toppings to match. The flavors are so well balanced and I left feeling so satisfied!Service was great! Loved the restaurant atmosphere. Great for large groups and small."], ["David N.", "Taste: 3Atmosphere: 4.5Value: 3Had a taste of three different menu items: the sopressata picante, short rib, artisan pizza, and butterscotch bread pudding dessert. Of the three, two were a pinch too salty. The sopressata picante had a good combination of flavors, and the saltiness added a strong kick, but it was still a bit overwhelming. The short rib was not much better. The meat was incredibly tender (a big plus), and the presentation was great, however again the saltiness brings the taste rating downwards.The dishes almost get it right, but just barely miss the mark.The Artisan pizza needs special attention, however, and it was made rather well. It had a good mix of flavors, and had a tasty sauce to compliment it. One of the best pizzas I have had in Denver.The bread pudding was also quite good. So if you find yourself here, get the pizza and the dessert!Overall, it should also be noted that that food quality/taste in relation to price earns this establishment a low value rating. For the expense I expect a more well-rounded/quality meal.If you want to try something new, I would still recommend this place. However, if you have also never been to the Odyssey then I recommend that over this place."], ["Nick R.", "Great atmosphere but sub par salads, soggy undercooked pizza, and funny tasting water. According to how beautiful the inside of the restaurant is the bathrooms made most porta-poddies (you know the bathrooms on construction sites and festivals) look clean.  Skip it."], ["Steven C.", "Nice atmosphere to spend time with someone special being served by attentive  staff (of not too busy)Delicious salads, pizza"], ["Janet D.", "Osteria Marco was a place I was looking forward to dine. Reading about it's below the street level location only fueled my curiosity. Besides that it's located in the Larimer section of downtown Denver that I'm currently enamored with. The mere mention of freshly made burrata everyday is another reason I can't pass going here any longer.I wasn't disappointed. Even though my order was based 100% on our awesome waiter Rick's(?) recommendation it was on point. The Braised Short rib was amazing! It was so flavorful and tender. I am definitely in love with this dish. It looks small but it's not and it packs it's wallop in the flavor it possesses. Their Butterscotch bread pudding was excellent. Our starter was the Meat and cheese platter. I had to order this. I must try their creamy Burrata. I wasn't disappointed. The Burrata was one of the best! The rest of the meat and cheeses were all top notch and fresh! My prosecco was a drink made to match my mood and our company's bubbly personality. I was very pleased with everything. The location was one of the sought after not the normal street level restaurant. It sits below the street with a flight of stairs that takes you down to the bar on your right and it opens up to the main dining area. The wall of wines just captured that spirit of Italy where you just want to eat, drink and be merry!The outside seating would be great to people watch. It's my next target. If you have trouble parking don't even bother. Valet it! $10 with validation. That's the Larimer style way to have a relaxed and mellow night!"], ["Inayah V.", "Had the serendipitous good fortune to come here after my last figure show (read months of hard dieting and training) and I couldn't have had a better time. My friends introduced me to the Burrata, it's life changing-ly delicious and a must have! The bar crafted a custom cocktail for my friends and the kitchen was very accommodating in delivering a clean (ie diet friendly) entree for my coach who was not able to indulge quite as much as we could.If you are in the area for a special occasion, come downstairs. Osteria Marco beats late night pizza and bar food (to an unrecognizable pulp) any day!"], ["Karen K.", "We met friends here at this Italian restaurant on the well known Larimer Square, a downtown historic Denver block nationally known for their critically acclaimed chefs' owned restaurants. I was told that by a saleswoman from the nearby Overland store at 16th Street mall which was another amazing store to shop at!!!Excited to come to this unique area for the very first time we walked the block to check out the various restaurants, shops and boutiques. Because it was after six in the evening many of the shopping boutiques were already closed but that's okay as my hubby wiped his forehead of imaginary sweat for the umpteenth time!Parking doesn't come easy even though we were here early. But to drive a car rental humongous Suburban we just decided to park at a nearby parking lot to play it safe! The block has metered parking until 8pm plus there was valet parking as well.They do have seating outside but because it was later in the evening the several tables were already occupied. Friends of ours shared their dishes especially the cheese and cured meat!  If you never had burratta this is definitely the place to try it because they make it fresh everyday and it's out of this world! I had ordered the grilled shrimp salad with spinach leaves, red onions, ricotta cheese, baby cherry tomatoes with a sweet corn vinaigrette dressing which was awesome. My husband's rotisserie chicken salad was even yummier than mine of course bc it wasn't my dish! Lol! Friends of ours ordered the shortrib plate which was magical; the meat was so tender and so flavorful! Why didn't I order that? And Adam ordered the lamb meatball with polenta which also was so very tasty! Butterscotch bread pudding with vanilla gelato & dulce de leche was sweet and so delicious too!I highly recommend coming here. The food and cozy atmosphere were excellent. If you have issues with stairs it may be a issue for you bc that's how you get to the major portion of their restaurant which lies in the basement of the building. I didn't check out the bathroom sorry but I know it's available there if needed. I know if we had another chance to visit this area we would definitely try out the outdoor patio seating unless its horrible weather. So there you have it another five star restaurant! Don't you be hesitant to come here bc you will be definitely missing out!!! I'm so happy we did!"], ["Brandy C.", "The bread pudding is amazing!!!!!!  Real bread pudding with no extra topping!  I will come back here for the dessert!Cheese plate is wonderful!  The selection is lovely!  I also recommend house salad.  However, I wasn't impressed by the mushroom pizza!"], ["Aussa L.", "The lamb meatball panini is incredible-- subtle but addicting taste. Service was great, atmosphere was very relaxing. It's the sort of place where you can take your time enjoying the food.There are lots of options depending on your price range. I'm pretty impressed by how delicious a $40 meal (for two) could be."], ["Kelly T.", "Such amazing food!I loved the burrata, the mussels and truffle mushroom pizza. And for that, I'll continue to come back. Glad that from my move from California, I found such an amazing restaurant. Comfort food and amazing taste."], ["Rich M.", "Upon a recently trip to downtown Denver, CO for a conference, I jumped on Yelp for a restaurant recommendation and based on reviews, I ended up at Osteria Marco.  Several of the reviewers said that it was a cozy, comfortable place with good italian/american food....so I walked a few blocks and below is an honest overview of my experience.The restaurant is located on a nice, busy street (Larimer Square) with a lot of restaurants, bars and stores.  It looks a lot like Little Italy in NYC or Philly during the holidays, with rows of lights that are strung over the entire block (see pics from others). One nice thing about the block is most restaurants have outdoor seating, so it's a nice option during this time of year (late Sept/early Oct) to catch a bite, while people- watching.Upon entering the restaurant a few steps off the street, I was greeted by the host who asked if I had a reservation (@6pm).  I didn't, so she said that I could wait 20 minutes for an outside table, 15 minutes for a booth inside or grab a seat at the bar without a wait, so I chose the bar.  I proceeded downstairs to the restaurant/bar area and grabbed a seat at a beautiful, spacious bar (@ 20 seats).  The bar has two TV'S (with sports on each), nice selection of liquors and micro brews (bottled and on tap).  The bartender was friendly (provided me with a glass of ice water upon introducing himself) and gave me a drink and dinner menu.  Remembering that others recommended a few food items, I ordered the Burrata  (appetizer) and Short Rib (main), remembering that their twist on Burrata is \"ricotta\" inside fresh mozzarella, which was intriguing, so I had to try.The Burrata arrived with a few slices of warm, sliced, toasted bread, drizzled with olive oil.  It was delicious and I really enjoyed spreading the fresh mozz/ricotta filling on the bread.  That being said, it was overly salty...I mean REALLY salty.  I thought it was good, but just beware of the saltiness before ordering.  The Short Rib arrived a few minutes after I finished the Burrata and the overall presentation was nice.  The short rib was very tender and had a great corn mixture side.  As tender and delicious as the short rib was, again, it was OVERLY salty.  In fact, as I finished the meal, I started to feel quessey and couldn't stop drinking water throughout the meal (3 glasses).  I have eaten in restaurants all over the world and expect my food to be seasoned properly, but the salt used here on both dishes distracted from the quality of both.  Maybe this is an anomaly, but I owe it to  you to describe my experience, both good and bad.I think the restaurant is a good choice for a quick bite, maybe for pizza, micro brew or other items.  If I went back to Denver, I would try another restaurant, but wouldn't hesitate to give it another try...maybe I would have a better experience.Let me know what you think?"], ["Brainard B.", "I've been coming here for years and it's good every time I come in. I'm from out of town and whenever I visit Denver, I always stop here for a nice dinner. This is a great place for dates or hanging out with friends. It's laid back, the service is great, and it's a clean restaurant. They also have a good selection of wines to choose from. All the dishes I had was wonderful. I started with the Burrata Cheese, then I had a spinach salad that had strawberries in them, then ate Margherita Pizza, and finally finished it with the Rotisserie Chicken.    This restaurant never disappoints me. I'll will always stop here when I visit Denver in the future."], ["Norm J.", "I came here while I was in town for a work meeting and thoroughly enjoyed my dining experience. The service and majority of the food was on point. I would definitely come back here next time I'm in town.What we had:* Calamari = two thumbs down. Never of us liked it. * Prosciutto Pizza = delicious!* Carne Pizza =   consisted of meat, meat and more meat (sausage, meatball and pepperoni)! The ricotta cheese on the pizza just made me enjoy this pizza that much more.* Butterscotch Bread Pudding = was heavenly to my taste buds, but not to my waist line."], ["Lauren W.", "Went here with colleagues. Charming restaurant with outdoor seating on Larimer Square, which is lit by strands of lights at night. Downstairs seating area is large and dark paneled.The menu is primarily cheese, charcuterie, gourmet pizza and panini. No pasta. We had a chef selection of cheeses, all of which were wonderful. I had the goat cheese and fig pizza which was delicious, and the butterscotch bread pudding was also outstanding. The pizzas are big enough for 2 to share, which means you could eat affordable at a very good restaurant."], ["Betsie S.", "My husband and I ate here for dinner on a weekday while visiting Denver for a conference. The dark wooden interior is dimly lit and has a pub-like atmosphere. The service was solid and I liked my standard kale salad. My husband wanted to eat here as it was one of the higher rated Italian restaurants in Denver. Let me start off by saying my husband is very, very particular about his pizza, his favorite being New Haven, CT style.  He grew up in New England where waiting an hour in the winter cold to enjoy Pepe's and Sally's pizza was normal. That being said, he was very unsatisfied with his pizza. He said the crust wasn't crispy or chewy and was a little soggy in the center and the toppings were not flavorful. If you crave good pizza or Italian food in Denver, I highly recommend Panzano's. We ordered room service many times while staying at Hotel Monaco and their pizza was always served hot and crispy, fresh from the oven."], ["Alice G.", "MEH.  Another restaurant where the music is too loud and the food is overambitious. A group of coworkers hit the joint for lunch and were there a very L O N G time.  1.5 hours.I will give the beet and kale salad a high score- that may have been the best thing that happened to me last week.  Bright and fresh, the salad was HUGE and scrumptious!  My co-diners tried the veggie risotto, the scallops, the burrata, the pizzas, the chop salad, the pasta.  Everything was good, but the meal was not memorable and the basement dining was dark, the music too loud, and it just wont't bring me back when Capitol Grill, Bistro Vendome, and Rioja are all a few steps away...."], ["DJ A.", "At $4 a pint for Happy Hour I think's not!  The service was on a switch over, so I felt the service levels could have been much better.   This was a great place when I was younger, but now I don't see much value in this place over the competition."], ["Melissa P.", "Wow, the service! Horrible all around! There were 3 women at the hostess stand, who were all but completely ignoring me and the two parties ahead of me. It would seem that in person customers should trump telephone calls, and only one of them was on the phone, but they all seemed too pre-occupied to even give that nice, \"I'm sorry, I'll be with you in a moment smile\". Fast forward to finally getting seated. She immediately wanted to take our order, but this was our first time dining at Osteria Marco. We asked for a couple minutes with the menu, and more than 10 minutes later, we had to dramatically flag down the server to place our order, because she had no returned or even glanced in our direction. The chef's plate was the best we'd ever had. I spent two weeks in southern Italy in April, and even so, this was the best we've ever had! That's saying something. The recommendation for the lamb meatball panini was good. I'd asked for the potato salad as my side, but was brought the boring arugula. I tried to mention it to the woman who brought our food, but she turned and was immediately gone, even as I speaking to her. I'm not one to make a scene, and I really don't like complaining, so I stuck with the pile of dressed greens. Not good. We had tickets for a show at the DPAC, and it was taking a very long time to get our bill. Again, it almost seemed as if our server/bartender Ashley was purposefully avoiding eye contact with us, even though we were literally across from her post at the bar. After several attempts to catch her eye, my husband had to wave his hands to get her attention to ask for the check. By this point, we're really running short on time, so I hand her my credit card as soon as she brings the bill. She puts it in her back pocket and walks away. About 7-8 minutes later, she still isn't back, so I stand at the bar to hopefully expedite the process and sign my bill. Ashley makes eye contact with me, but then goes to get a customer who just sat at the bar a menu, THEN goes and delivers a drink to another table, and THEN pulls my credit card out of her back pocket to finally run it!! The audacity! I couldn't not leave a tip, but I only left 10%, which is the lowest I've ever tipped, as well as a note that she should tell management that they need more help (because she clearly couldn't handle things...but I'm actually a nice person, and did not write that last part). It was 1PM on a Saturday. They were NOT that busy to justify such terrible service. The food was really good, and I'd really like to come back to try their dinner some time, but if the service is anything like it was with Miss Ashley, I will never, ever return. I hope to come back to update my review with a positive one some time in the future. But for now, I'm off to try other restaurants."], ["Sara L.", "I went with ten people and we all shared our food family style, every single bite was delicious. The mussels were some of the best I've ever had... the broth they came in was just perfect.This may be my new favorite restaurant."], ["Hannah W.", "My friend and I came here for a spontaneous dinner on a Saturday night. The waitress had told us it would be about an hour wait, so we to walk around the area. About 20 minutes later, we got a call that they had a table for us. Hooray!The place has a nice atmosphere, but still keeping it pretty casual. We ordered the Lobster Fonduta to start. My friend got the lamb meatball Panini and I got the House Sausage Pizza. The lobster fonduta was amazing! The dip was very cheesy and had lots of lobster meat in it. I almost wanted to order another one... I got to try a bite of my friend's Panini and it was definitely decent. The portion of the meat was pretty big and the bread was well-toasted. For my house sausage pizza, I loved the cheese on it. The only thing that I picked out on the pizza was the chili peppers and that's because I can't eat very spicy. They give you a chili infused olive oil to use on the pizza, which is quite nice. I ordered the bread pudding dessert because everyone seems to love it and now I know why. The edges of the bread pudding were crispy but the insides were moist and warm. It is topped with a scoop of ice cream and has butterscotch drizzled over. IT WAS SO GOOD! Be sure to save some stomach space for this amazing dessert!"]], "Panzano": [], "Americatus New-World Italian": []}