{"Kabob Station": [], "Axios Estiatorio": [], "Damascus Grill": [], "Mecca Grill": [["Stan Y.", "Mecca Grill makes up for its decor and somewhat slow service with excellent food.  This is a great place if you're looking for a quiet lunch or dinner.  (The two times I've visited the restaurant, it's been completely empty.)  I've tried the chicken shawarma and the chicken kabob platters.  Both are equally good.  You also get a ton of pita bread and hummus before each entree.  (I think they do this to make up for their slow service.  It's all good though as the pita bread and hummus are excellent.)An additional plus: you can listen to the cashier/waiter rant about various things to whoever is in the kitchen.  That woman deserves her own reality tv show."], ["John L.", "This was the go to place for my wife and I  we ordered at least once a week for pick up.  The service was always questionable but the food made up for it.  There has been a change in the last month or so and the food is awful.  This is the first time I have posted a review...I told so many people how great the food was here and am sad to say there has been a dramatic change for the worst."], ["Alison H.", "This place is so delicious and weirdly never busy! The lunch specials are amazing and the hummus is some of the smoothest I've had. Worth a try!"], ["A R.", "I've lived nearby for 1.5 years. Initially it was good, it went way south for a while, but the ownership changed and it's great now. I eat here at least once a week. I swore off of it for about 6 months in the \"bad times\", but those times have passed and it's now better than it's ever been. Give it a shot again if you had a bad experience previously, I think you'll be pleasantly surprised."], ["Jesse F.", "Delicious and really sweet family.  I had the Vegetarian Combo (like a mezze plate), which had amazing baba ghanouj.  Really good arabic coffee, too.  Support this place, they're awesome!"], ["Amanda W.", "We went here with a restaurant.com certificate.  The food was not very good, the meat was really dry and the service was bad.  Will NOT go back here and do NOT recommend to others!"], ["Ben F.", "Never had Lebanese food before, and my friends from out of town had heard of this place and begged me to go with them. I LOVED IT!!! I will always be a customer of this place. The food was great, the service was beyond what I expected. They are so polite AND the owner came out and served my dog a huge lamb shank bone. My pup didnt even want to go on our hike anymore. My friends want to go back before they leave and I think I will be very happy to go back as well."], ["Henry M.", "I had driven past this place several times and decided to pop in for a late lunch while running errands. The place was deserted on a Tuesday afternoon but the server was friendly, and put me anywhere I wanted.  The prices were decent..maybe a dollar or two on the high side, but the food was great.  I had the Kafta Kabob sandwich, which had a kabob a lot larger than I expected.  It is a mixture of lamb and beef, seasoned with onion and spices that brought me right back to the kabobs I used to eat in Baghdad.   The flatbreat it was wrapped in was warm and nicely crisped on the edges, and the tahini sauce was done perfectly."], ["Tina U.", "Very good!!!  You will not be disappointed. Falafels are the best I have ever had. Everything was really good."], ["Leslie S.", "This place is amazing! Service is friendly and nice. Atmosphere is low key and easy going. The food is Amazing! Favorite items to date: Kafta Kabob Entree & Sultani Kabob entree. All of the sandwiches are also great!"], ["Gretchen J.", "Quote from my boyfriend: \"This may have been the worst restaurant I've ever been to\". We live in Wash Park and always eager to support the neighborhood restaurants. We ordered the falafel appetizer, the meat plate (BF) and the gyro plate (me). Falafel was crispy and tasty...so \"pro\".  Thats, unfortunately, where the compliments end. The gyro tasted like my elementary school cafeteria was trying their hand in middle eastern fare and the meat plate tasted like packing peanuts...not good.  I've never seen my boyfriend try and salt something so much.  Service was bad as well; however, I'm usually willing to forgive service when the food makes up for it.  Seems like everyone had gotten the memo seeing as we were the only people in the restaurant.  Where were all the folks that have written good reviews?"], ["Sierra S.", "Best middle eastern I've had in Denver!"], ["Jenna A.", "From positive to love! My boyfriend and I dined in this time with my restaurant.com $25.I left my comfort zone and we ordered the baba ghanooj and one fatoush salad as an appetizer. When you order your dinner entrees you are given hummus or \"homos\" as they spell it and warm pitas. We asked for extras and got more free of charge!Their hummus is where it's at my friends. The baba ghanooj had a sweet taste to it. The fatoush salad was large pieces of green pepper, tomatoes, onion and cucumber with a delicious light dressing. All were amazing.For the main entrees, Lamb Kabab and Chicken Shawarma. I wasn't so impressed with the chicken last time but this time, it was so moist (I hate that word but it was!!) The lamb was tender and flavorful and the long white rice was cooked to perfection. The salad on the side was great in between bites.Four guys sat at a table across from us speaking a language I don't know and were drinking what looked like a cool Mediterranean drink, I had to ask the manager! He said they were drinking mango, strawberry and OJ. Haha...I was really expecting a fascinating drink order!Okay...we're not pigs but we had to get a piece of their baklava. We decided since we just ran Wash Park that we owed it to ourselves...very good, top five for sure.For the normal diner without a coupon, you get A LOT for your money and the dinner entrees come with everything you need with major leftovers...but if I have to recommend something, it would be the baba ghanooj as an appetizer. Enjoy!"], ["Richard P.", "I had a friend recommend the Mecca Grill and we gave this place a try. We were very pleased with the food, service and price. We eat out a lot and have 12 restaurants within walking distance. We live near 1st and Broadway and we will definitely get in the car and go back to this place. BTW, the Mecca Grill has new owners and a new chef. A salad for each of us was brought out quickly. Some hummus and bread shortly thereafter. The hummus was outstanding as well as the Lebanese flat bread. I had the lamb Kabob and it was as good of lamb as I have ever had. My wife had the vegetarian plate and loved it."], ["Adreanna W.", "What a joke. Ordered delivery,  the entire thing was wrong. Entrees are supposed to come with a salad, hummus and 2 pitas. I got instead a few chunks of iceberg lettuce, 2 pieces of tomatoes, no dressing - at all. Not even bottled junk. No hummus, they gave me babaganoush. Didn't ask for it and really don't like it. No pitas. Of course not having hummus I would have no use for them anyway. Ordered grape leaves and they gave me falafels instead. Again, didn't ask for it and really don't like them. When I called to complain they said they were out of grape leaves, so naturally instead of calling me back to let me know that, they assumed I like falafels (seriously, I really don't enjoy them). Guy says 'you like hummus, we give you hummus. Ten minutes'. Sure. I'll hold my breath while I wait. NEVER again."], ["Maha K.", "This Lebanese restaurant, named after a Saudi holy city, is actually run by a Moroccan family. Don't ask me, I'm as confused as you are. Sometimes brown people just don't get other brown people.But I do know 3-stars on Yelp translates to \"mish baatel\" in general Arabic.*They don't have a hookah bar anymore, which is an automatic two-star deduction from my book. The lamb chops, however, were delicious as was the fun service and company of Hans O. and David S. So all mixed together, it was A-OK. I have the perfect formulas in my head to justify these ratings, so perfect they even work in other languages. I'd still recommend Gypsy House for hookah.*Or so help me God if it actually means something else."], ["Hans O.", "This place is very clean and serving staff is very polite and knowledgeble. Food is great, even though they advertise hookah, they don't have it since they don't have the license."], ["Alyson A.", "So I've had to edit my review.  This makes me a little sad to do this, but I feel like I should!We went back to Mecca after not having gone for a LONG time.  It turns out that the prices have gone up as much as 3 dollars on some things.  I went thinking I was going to be getting the same ridiculously good food at ridiculously cheap prices.  I realize prices have to change, but that's quite a steep jump!  The food is still good with good quality ingredients, but I probably won't be going back for a while (hey, I'm in a one-income household right now!).  Our waitress was nice enough...not as awesome as the one we had before, but hey, that's okay.  I still like the atmosphere of the place, it was just pretty disappointing to find out about the price changes that way.  But hey, at least they do delivery now!"], ["Jodi B.", "This place used to be my favorite. I don't know what happened the quality and flavor of the food is absolutely horrible. I am not sure if they are under new management or ownership but I will never go back after my last couple of experiences."], ["Arturo E.", "Salaam 'Alaykum. This is Moroccan family owned restaurant with great Lebanese food that is priced right and made fresh.  Perfect for lunch or a cheap eat almost anytime. The food is homemade tasting and served quickly by a friendly staff. It'a a very simple diner-ish feel and tight wallets looking for great flavors would be satisfied eating here. Don't miss the falafels! Only drawback, no harissa sauce served (I mean, they are Moroccan, right?), but the sriracha on the tables was not a bad runner-up.Mecca Grill is a great little Denver treasure. Make a pilgrimage to Mecca Grill, and you (and Allah) will be glad that you did!"]], "FelFel Mediterranean": [["Melissa H.", "This place is delicious, but the thing that really sets it apart is the service! I can't remember the server's name, but she was incredibly friendly and helpful. It was our first visit to FelFel and we asked a bunch of questions, but she never seemed bothered and was more than happy to recommend dishes to us.The food itself is very good, but I have to admit my favorite was the french fries. I know, I know, french fries at a Mediterranean place? But they were so good! The falafel was also delicious, and my boyfriend really liked his Mediterranean plate.My falafel wrap was also delicious, even though I couldn't finish it. By far the best part of the meal? The complimentary baklava our server brought us! 5 stars for excellent service (this lady should get a raise!)The only thing I regret is not buying more baklava. I was too full to consider it, but boy did I regret it as we drove away. Learn from my mistake: buy (and eat) the baklava first!"], ["Jessica R.", "Amazing service and delicious food!! They treated us like guests in their home not customers. Their pita bread is the best we've had, so light and fluffy. The falafels were crispy on the outside and moist and flavorful inside. A little out of way but worth it!!!! Must try!"], ["Dano D.", "Great authentic Mediterranean food!  Shawarmas  and kebabs and so much more to include whole rotisserie chickens. Very clean and courteous. We stopped here every time we come back from the airport."], ["Jennifer T.", "Perfect meal anytime and the service is top notch I love how attentive and friendly  everyone is.   One late work night, I came in not happy from my day and starving ... not sure what to order, they asked what flavors and food I like and made a suggestion that now all I ever do is walk in and let them decide.  Thank you!"], ["Nick R.", "Clean restaurant and extremely friendly service is the first thing that I liked about the place.  The food is excellent and affordable - this place is a gem!!!!"], ["Marie H.", "I tried FelFel for the first time yesterday and am so glad I found this place!! I have to preface my review by stating that I have Celiac Disease and am extremely sensitive to the slightest amount of gluten, which is why I waited a full day to notice whether or not I would have any sort of reaction, and I luckily did not! I ordered the falafel plate with no rice, and had a Mediterranean salad, a spinach salad, and French fries with it. Everything was delicious!! And this is coming from someone who has spent some time in the Middle East and can tell authentic middle eastern food when she has it. I also had to try the creme brûlée cheesecake for dessert since it was gluten free and flour free, and boy am I glad I did.  The man who helped us at the counter was Hamza and he was incredibly friendly and very knowledgeable about the menu, which is important when I have such serious food restrictions to adhere to. I would definitely recommend this place to everyone and I know that I'll be back."], ["John M.", "Fantastic staff. Very hospitable atmosphere with  great food, as well as great deserts, they typically will offer a piece of Baklava while waiting for a meal to be prepared. With plenty of options between the hummus, salads, soups and entrees, I've never regretted a visit to this place!"], ["Mary K.", "Came here for the first time. Had the lamb kabob and falafels. Delicious food and very friendly staff. The prices are very reasonable. Will be back."], ["Kent M.", "Very nice and pretty food items. Great selection of desserts as well. I took liberties to hand select each item of choice which was granted. Thanks. Wonderful everything here."], ["M. M.", "This place is delicious! Way way way better than Garbanzos. Quality is exceptional. When you walk in you're greeted with chicken roasting in the rotisserie, fresh pita bread and an open-view prep station. The place is clean and always packed! Get there early for lunch. Felfel has amazing rotisserie chicken used in their plates and salads. Home made hummus topped with olive oil and chickpeas. The BEST hummus I've ever tasted! You also have your choice of brown or white rice and salad choices. I always get the Mediterranean salad. Nothing like cool cucumbers and tomatos along side chicken and rice. It's a must try."], ["Nick V.", "Wonderful selection and friendly staff. Many vegan options! Will definitely be coming back whenever I'm in the area."], ["Lindsey P.", "This place is absolutely awesome. I ordered a combo plate and the meat was juicy, delicious and everything was so flavorful. The portions are big, the service is friendly and I will be coming back many more times."], ["Larry S.", "Excellent hummus.  And some of the best falafel you'll ever find.  The place is clean fast and friendly."], ["Vic B.", "Very delicious food and friendly staff.  Glad I finally made the effort to try it out after driving by so many previous times.  Very happy that this is part of my neighborhood and I can add it to my regular stops.Very fresh food.  I'm a vegetarian and their Falafel plate was great.  The spices in the rice were a nice surprise and the hummus was just outstanding.  From the outside I expected it to be like that chain place but was pleasantly wrong.  The owner recommended everything we ordered and we loved it all.Dining room was also very well kept and clean.  Can't ask for more!"], ["Callan O.", "YUM.Seriously, just yum.  Probably the best shawarma I've ever had.  The second you walk in the door, you know you are in good hands.  The aromas of the spices are ridiculously wonderful and the giant skewers of cooking meat will instantly have you drooling. This place is just like Garbanzo's or Saaj but WAY tastier.  You can order plate, sandwiches, or salads which I believe were all $6.99-8.99 for very generous portions.  There were all the normal sides, like hummus, baba ganoush, etc.Tahini, garlic sauce, tzatziki, and hot sauce were 99c extra.  While all the sauce are good, the super rich garlic sauce and wonderfully complex salsa-like hot sauce were the best.They have a nice beverage selection with a regular soda fountain and some bottled options like Izze.Their dessert counter is beautiful with probably 15 different options that I believe are mostly made out of house.  I had the baklava, which is made into cute little rolls like a pirouette instead of the traditional clunky squares. Again, YUM.The owner obviously takes great pride in his store (as he should) and was very outgoing and helpful.  Everyone else working there was super friendly as well.I would write more but honestly I just made myself really hungry so I think I'll just go eat there again instead...."], ["Tim L.", "Writing on phone so I will keep it short. Very friendly staff (family?) explained offerings. I ordered lamb kebab plate. Generous portions, delicious fluffy bread, fresh salad, rice, hummus, pickled onion. Two free falafel since it was my first time.Everything was delicious. I will be returning."], ["Agam A.", "I have been here many times and it's great for on the go Mediterranean food. The staff here is awesome and very friendly. I almost always get the chicken shawarma plate which comes with a couple sides and pita bread. Their spicy hummus is also really good but probably not as spicy as I would like it to be. For the price you pay you definitely get a large portion of food and I would recommend people to check this place out at some point. They usually have yelp deals when you check in so make sure to do that and get some free stuff when you go here. Also their garlic sauce is great and makes the entire meal better."], ["Tiffany N.", "I've been here twice and it went from \"eh-it's ok, to meh, no thanks\". I love love love anything Mediterranean for the flavors and also for the healthy aspect. You walk up and order at the counter, which depending on the time of day, can take awhile because of their huge menu. Everything looks delicious but unfortunately fell flat my last visit here. I came here with a girlfriend who had never been and  I got a red cabbage salad along with a side of chicken shawarma. It was nice out so we sat outside and I think our order got last in translation. The staff was nice but after 20 minutes we were wondering where out food was since we had to get back to work. Our food came out and it wasn't good. The red cabbage salad didn't have a dressing on it and red cabbage is pretty rough when not marinated or dressed up so that sucked. The chicken was good but not good enough to make up for rabbit food (literally). I chomped away because I was hungry but left wondering what I just spent $13 on and needing a reason why I should come back again."], ["Jason W.", "Excellent lunch place. Love the chicken shawarma plate. Owner is very courteous and makes you feel like you're his favorite customer. Highly recommended! Please come and support a great local business!"], ["Carrie D.", "In response to the FelFel management responsePeople who consider going to FelFel, the response of the management confirms how they treat their customers. If you have a valid complaint, such as being over charged, they will attack you instead of actually addressing the issue The response of the management confirms how we were treated by them. They clearly have no regard for customers and their customer service is based on attacking customer complaints,   not addressing them. Yes, attack a customer who you overcharge and then blame them for your staff failing to provide correct information. You basically confirmed that I called, was indeed told that I could choose a variety of salads, it is my fault for not ensuring that there would not be an additional charge, the person  spoke to would not choose to tell a customer, yes you can do that but it would be an additional charge?!?Wow. Customer service fail. SeriouslyYes, attack customers for their negative experiences. Be aware people, if you complain it will be your fault, not theirs!!To the FelFel management, umm, yes I have had bab ghanoush, vastly better than yours during the 16 years Iived in the Middle East. Your Falafel are awful, your shwarma is DRY and your food is inferior at best. Sahara is 10 times superior to your food. Your food is not good. You can attack me and continue to delude yourself, you clearly can not take constructive criticism.  Also, I did call your store IMMEDIATELY and we did go through the receipt item by item on the phone. YOU CONFIRMED THAT YOU OVERCHARGED ME AND PROMISED TO CREDIT MY ACCOUNT. YOU DID NOT!!!!I would never come back,don't worry."]], "Amira Bakery": [], "Jerusalem Restaurant": [["Mike L.", "Jerusalem's is about a 3 - 3 1/2 star restaurant for the more casual dining experience and is priced fairly well for the DU students and the surrounding community.  For the most part, it is their longer hours of operation that causes me to want to give them 3 1/2 stars."], ["Jonathan B.", "If you like middle eastern food and want it at a great price even late, this is the place.  Be sure to check in on yelp for your free baklava! Delicious lamb and the gyros are always great."], ["Jeff S.", "Excellent Falafel, Hummus, and they make their Pita fresh onsite.  I also had chicken and rice, which was cooked nicely and very tasty.  No frills, so if it's ambiance you're looking for, maybe try somewhere else. But the food is really good, inexpensive, and it's a great place to go for a casual dinner or late night."], ["Benjamin C.", "Fantastic food and a very intimate atmosphere. Intimate in that way that some of the seating is only accessible through the kitchen and it has very tight quarters. Not a \"classy\" joint but a classic location none the less. Did I mention it's delicious and a great choice for Veggies and their friends?"], ["Ruth F.", "I had just been to the Damascus Grill a week before and nothing could be that exciting, but this place is closer and open till 4am and the food was good, they just didn't have cheese canoes."], ["Ashlee R.", "The food was great! We got the Super Dish and the Schawarma, both were so good!! Then a free baklava for checking in that was absolutely great!"], ["Anthony S.", "Seriously, LOVE THIS PLACE!! Came here once feeling a little skeptical, now we simply cannot get enough! Eat here AT LEAST once a week. Great great food! Good prices, and very friendly staff! Moving out of state soon, and this place will be one thing I miss most. Open late, and great all hours of the day. The meat combo and super combo give you a great variety for a great price."], ["Candace G.", "It is dangerous that this place is so close to where I go to school, just a few steps away from the library. I could eat here several times a week. I love places that offer an abundance of options for vegans, vegetarians, omnivores, carnivores, and everything in between. Hummus is a must. The vegetarian plate always provides two meals for me, or a perfect meal to share. The place is open until 3am or so, and then opens up just a few hours later. Eat here. The best Mediterranean food in Denver."], ["Cambria S.", "We always get the hummus plate and chicken shawarma entree to share. It's always delicious! The tabbouleh, falafel, hummus & rice is my favorite"], ["Brittany H.", "So you find that you're having a late night craving for falafels.  What on earth should you do?  You should immediately hop in your car and cruise on over to this glorious piece of heaven called Jerusalem.  The only times I've been here has been late night.  And it's always packed.  But they're always quick and friendly, whether dinning in or grabbing take out.The portions are crazy huge!  My last order of falafels, baba ghanouj, and chicken shawarmah, along with the pitas, lasted the BF and me nearly three meals.  Seriously.  You can't go wrong with anything on the menu!Jerusalem can be a bit pricey, but for the amount and the quality of the food, it's all worth it.Forgive me, I'm starting to drool thinking about their delicious food.  Time to grab the car keys!"], ["Rawa A.", "My kids and I love to go there when we want to eat middle Eastern food. It is tasty and the price is reasonable. we usually share two plates, for people who are from Middle East I suggest to you to go and try it they have good food"], ["Betty J.", "Very delicious but very expensive. I wish the plates came with hummus but it's extra. The building is not nice and looks like a shack mostly, but the service is always fast! It's always fun to go here, but I always am surprised when it's almost $20 for one person. Good quality though. And I still go there even though it makes me poor!"], ["Kyla S.", "Quick, big portions, and soooooo tasty!This past weekend, after we had heard from a friend to try this place out, we decided to give it a shot. We will be going back! We sat out on their patio, which is small, but wasn't crowded and I got the Falafel and Hommoss Combo and my boyfriend ordered the Combination, Super Dish. The food came out so fast, and we were more than satisfied with the taste of the food, and the authenticity of everything on the plate. You can tell these people know what they are doing when it comes to Middle Eastern Cuisine.Although I didn't have any dessert, I am still thinking about going back just for a sweet snack. Their dessert showcase looked amazing, and looked to be made in-house.The only thing that could give people trouble is the parking. Small lot, with maybe 10-15 spots, but even if you park a few blocks away, the food is worth it, and a nice walk after your meal will feel good, because you will be full!"], ["Marty D.", "Very cool restaurant, the patio seating is a must. They probably have the best falafel I've enjoyed in Denver, I got the combination platter and of course grabbed some stuffed grape leaves as an appetizer. So delicious! The service is fast and so is the food, this is the place to go if you're looking for a quick meal while you're studying!"], ["Beth R.", "I live in Greeley and Jerusalem is worth driving to Denver. No one else matches their Shwarma or hummus. Everything I have tried has been delicious. My personal favorite is their beef shwarma, hummus and fatouch. It's all healthy, hot and nourishing. PLEASE consider opening a location in Greeley!"], ["Craig C.", "Very good. Tasty pleasant family owned. Generous portions reasonable prices. Quick service. Highly recommend."], ["Eric S.", "I was in the mood for Greek food so I thought to drive up the street and treat myself to a nice gyro. The open faced beef gyro platter came with rice, hummus, pita bread and a side of tabbouleh. It sounds like a nice conglomeration of ingredients on paper but in reality it was a let down.The description of tabbouleh says it is finely chopped but it's not. I think it's pre-made. The hummus isn't the best and neither is the beef. I feel like I overpaid and was not impressed whatsoever.It's popular cause it's by Denver University but I definitely think it's a solid 2/5 star place."], ["Eric H.", "A couple of people recommended this place, so I thought I'd give it a try since I like Middle Eastern food. Nobody greeted us when we walked in, so it appeared that you needed to order before finding yourself a table. Not true; the take out order window is the first thing you see when you walk in though. Seating on the right and also up to the left (after passing thru the gross server station). The place is a kind of a dive, not that I mind that however.  We each ordered the gyros and fries. The gyros were filled with lots of lettuce and not much beef/lamb. Very odd. Lettuce on a gyro??  Tons of it???  Food tasted ok (pitas were really good), but by no means great.  Maybe there are better things on the menu, but I doubt I will get the \"I need to go back to Jerusalem\" thought coming over me any time soon."], ["Candace W.", "Love this little place. Cheap delicious eats. Little patio to boot. Open late. large portions. Great desserts and tea.  Love the combo plate."], ["Ian M.", "I just saw this again and I so need to stop in, some of the best food ever, so great after a night out or on the weekend. Not much too look at but don't judge a book by its cover, get in there and order the meat plate YUMMY!!!"]], "Garbanzo Mediterranean Grill": [], "Shish Kabob Grill": [], "Yaffa's Savory": [], "Damascus Restaurant": [["Anita Y.", "I yelped, and then my hopes were set SOOOOO high.Yes, the Humous was tasty, and the pitas were fresh.The Fatoush was good, but I found myself picking the onions out.For $3.45 the serving was enough for 4 for an appetizer.You can't save Fatoush you know.  The toasted pitas get soggy.\"Tell me what ...... is.\"  \"oh, we're out of that\"  This go round went round at least 3x.Then there was the dessert, I can't even remember the name.Kanafi?  Described to me as shredded phyllo with custard.  She didn't mention the bonus mold spores.  Unfortunately I didn't find the mold until I had eaten 3/4 of the dessert, it was on the bottom.  Blechh!!!\"oh, I think that's pistachios\" she said.\"um, no.  I'm quite certain that's mold\"  \"Pistachios\" she insisted.\"you eat it\"  I wanted to say.I don't argue, but I know what pistachios look like.And I know what mold looks like.(I should've gone with my instincts.  It didn't taste fresh)It was ALMOST a good meal."], ["Seth C.", "Although the hummus and warm pita were great, the chicken shwarma in both the entree and sandwhich smelled bad and had no flavor at all, We were disappointed having had excellent shwarma in Syria and even in other places in Denver. On top of that, The service was not so friendly and the bathrooms smelled like sewer. Hopefully it was just a bad night there."], ["Andrew B.", "One of my favs around Denver. Babaghanoush is so good I'd like to roll around in it. The pita bread is always hot out of the oven, makes me drool. Love love love it.....Vegetarian plate is incredibly good."], ["Idan S.", "First off let me say that I grew up in Israel (neighboring Syria) and I definitely know what good middle eastern food should taste like - this is not it!!! (politics aside)Whenever I hear the word shawarma I start salivating uncontrollably - In a lafa pita it's one of my all time favorite foods! And so, after hearing raving reviews from some co-workers I was very excited to check it out. I went there once for the shawarma sandwich, which was so bad I decided to never go there again!"], ["Michael W.", "I'm cutting to the chase on this one. The hummus was a great starter, right on the money.The Meat Combo (I think that's what it called) which was essentially a mountain of lamb, chicken and beef over rice. Very good and you get a lot of food. Parking is not great, so beware the tow truck.The interior was dark but I actually enjoyed that aspect, especially on a hot summer day. No 5 star bathrooms or anything like that and you might have to wave a few flies away while you eat so be ready. The service is prompt and friendly (extra points for treating me like a regular person even though I was in my Air Force uniform.) I really enjoyed everything and I can't wait to come back and try the hookah place that's next door."], ["Lauren D.", "Food here is awesome! However, service not-so-much. It is clear that there are 2 very friendly people doing the job of at least what should be 4-5 in the dining and cashier area and that they are hauling major ass all around the restaurant - with a huge smile and no attitude none the less! The homos and baba were delicious and my chicken kabob was perfection. Maybe if you go at a slower time than a Friday night, you won't be as grumpy about it, because they are very nice and helpful. But yes food = great! May be more of a take out venue for us for a bit, and yes, we will drive all the way over there for it from NW Denver, because it's that good."], ["Katie L.", "Be advised, they bring your hummus out before your meal, but you don't get anymore with your meal unless you order an additional $5-$6 appetizer. Don't make the same horrifying mistake we did and eat it all beforehand.The bf and I both ordered King combos. I was not really impressed with any of mine and took most of it home. The bf liked his ok and I'll agree the chicken was juicer than some other joints in town. The gyros were not crispy and delicious so that was saddening.The hummus was the best part. Super creamy and scrum.Service was friendly enough and the atmosphere is...interesting.If I were to eat somewhere in this strip of middle eastern eateries it would be at House of Kabob. Sorry Damascus :(."], ["Amy R.", "Totally loved this place, if only for the terrific service and amazing *warm* extremely fresh pita bread.  We split a fattoush salad that was nice and refreshing on a really hot day, baba ganoush that was also good and a mixed plate which included kebabs and several types of meat as well as hummus and salad.  That was too much food as the portions were very generous.  Service was very attentive and we left happy."], ["Hayley G.", "mmm... Damascus.  This is pretty much my favorite Mediterranean food restaurant in the Denver area, only slightly ahead of Ali Baba (sorry, Ali Baba still wins on the baba ghanoush).I recommend the vegetarian plate, and all of the sandwiches.  The hummus, falafel or baba ghanoush sandwiches are all amazing.. and incredibly affordable.  I haven't really tried the meaty stuff yet, but I assume it's equally as delicious.  Best hummus around.  And the baklava is killer."], ["Jed Z.", "I order a king combo, some vegetable kebabs, and strawberry milk, and I'm as happy as they come.  Super delish!  The baba ganoush is unique and wonderful.  I've never had its equal.  If you're lucky, you'll get fresh out of the oven pita.I never come any more, though, because the service is so slow that my kids can't stand it.  Even without kids, assume a time committment.  Hey, if you are looking for quality time with a significant other, what's the hurry..."], ["Michael H.", "This restaurant has a comfortable atmosphere, good service, and decent food. We shared  baba ghanouj and chicken kafta pita wraps with lemonade on our most recent visit. We have eaten here 10 times in the last 10 years. I give it a 3 star rating because I like it but can't quite love it. Worth a stop. Baba Ghanouj is my favorite here."], ["Ayesha S.", "While visiting my sister, she told me that Damascus was in her regular rotation of restaurants.  We grabbed take-out and the place was pretty busy.  I ordered the chicken kabob pita for myself along with a three other sandwiches.  I wish I had read the reviews of this place because for some odd reason, we didn't order any hummus.  My chicken kabob pita was average- sounds like it isn't the best choice on the menu.  Our total was right around 22 dollars for four sandwiches so value was decent.  I'm sure I'll be checkin' out Damascus when I'm back in Denver- and I'll be sure to try the hummus and avoid the average chicken kabob pita."], ["Rachel M.", "Somehow I managed to drag my leftovers out for two days. Man, they give you a lot of food. I love this place. As others have written, their hummus is beyond compare. I want to jump in a big vat of it and wade in the wonders of tahini. Later on a Friday night we wandered in to a pretty packed restaurant and the two ladies there were hustling! Our server ended up being totally charming and cute and kept bringing us warm, soft pillows of pita. Syrian sausage is delicious, but it's hard to pass up their shwarma when you see that rotisserie of deliciousness just quietly rotating in the back.  If you want a super cheap meal, go for their sandwiches which are awesome. I'd love to give this place five stars but their bathroom was so gross I just couldn't bring myself to do it. Lack of ambiance is one thing, but over the top icky bathrooms is quite another."], ["Alden C.", "I love this place! It is so good! I love their fruit drinks where you can have a strawberry juice with coconut and other combos. I usually get the Vegetarian plate and the hummus, the pitas-everything is great!"], ["Hollie W.", "Decent food, prices, atmosphere, service, and tea! Look forward to coming back again. Had the falafel plate which was yummy! Loved the hummus."], ["David S.", "Best hummus in all of DenverIt may not look like much from the outside but, among the myriad Middle Eastern restaurants in Denver, Damascus stands out for the quality of their food. I honestly don't understand why this place isn't more popular. Well... maybe I do. To be completely honest the service is a little slow when dining in, and in the \"your way right away\" culture of today maybe that's too much to bear for some. But if time's a factor then take-out is the way to go. Personally, I think the food here is worth the wait, and besides the staff is friendly.Of course the hummus with fresh-baked pitas are not to be missed. My other tops picks from their menu have to be the Cheese Pies, the Hummus with Beef Shawarma, and, for those who can't decide, the King Combo which has everything from tabouleh to shawarma. I'm also a fan of their \"Arabic Coffee\", which beats the pants off of the sickly-sweet concoctions to be found at trendy coffee chain stores any day."], ["Brett G.", "A plus - they make their own pitas.  The hummus was tasty, flavorful, creamy.  Unfortunately, I didn't get as much as it as I would have liked.I definitely would enjoy some of their entrees - didn't have a chance to get them, but while I was waiting for takeout, the food looked good coming from the kitchen.Interior was a little tired and dark, but I imagine this is the type of place you go for the food, not necessarily the ambiance.  The staff we interacted with for a short time were friendly; and the takeout was ready in a hurry."], ["Stephanie L.", "Service here is friendly and inviting. The place is kind drab- not appealing at all to the eyes, but it's clean and the great hummus more than makes up for all the rest.I've only gotten the chicken schwarma with hummus the few times I've been there. What can I say! The chicken is so good and the hummus is really creamy and tasty. I don't want anything else! But I've seen my friends try other dishes and they are always happy. I also highly recommend their mint tea which is fabulous and their pitas are very doughy and warm. So good!It's a little pricey...so I don't go here very often. I would expect the atmosphere to be a little more classy for the prices that are on the menu. The chicken schwarma plate is $11 or $12, so once you add in your drink and an appetizer of falafel, as well as the tip, you spend close to $20 a person.  I don't mind too much since I usually have plenty of food to take home with me, but like I said, I would expect it to be a little more swanky place for the price.I still think it's a fun treat and recommend it to anyone I know that is looking for good middle eastern fare."], ["Bill W.", "++Best Syrian restaurant ive been to! I got the veggie combo, and everything on it was delish. baba ganoush, hummus, and fresh hot soft pita bread were highlights.-location and space were just a bit too divey that it started to border on feeling dirty."], ["Philip K.", "Really good pita. They make it on-site, and it usually comes out hotter than you'd image it can be. Really good hummus. So creamy, so delicious.Sandwiches are good. It's probably the pita that makes it so good.I like the all-syria all-the-time decor here. Syrian Tourism Board strikes again!"]], "Marrakech Grill": [], "Phoenician Kabob": [["Aja T.", "This is some good Mediterranean food! My favorite was the garlic dip. It's a simple condiment that has a strong garlic flavor, but it's balanced. I don't want to steer anyone away from it by saying its strong because it's not overwhelming.....just oh so tasty!We also had the falafel, a gyro, and the chicken shawarma. All of these were darn good too!  They have several other items I want to try so I'll be back."], ["Terre L.", "Babysitting my 6 week old grand daughter, in the neighborhood and I needed sustenance. Ordered  a take out meal of the sultan combo and sabanekhn that was more than enough for two, with leftovers. Especially liked the  sabanekhn, warm, tender and delicious. I look forward to sitting again and order out from here againthe same."], ["Dave K.", "Everything is amazing, the owners are some of the hardest working, most genuine, and some of the friendliest folks I have met in the restaurant industry. I eat here weekly, at a minimum! Love this place."], ["Alexandra S.", "I'm a Phoenician Kabob fan! I live in Park Hill and it is definitely one of my go to spots in the neighborhood. The servers have always been nice and accomodating. I'm addicted to their pita! Its warm and wonderful. I also really enjoy their kafta, garlic dip, hummus and shwarma options. My BF did try their moussaka- I would not say it is your typical/traditional greek moussaka but still tasted good. Take advantage of their lunch pricing to save some $. Overall, a Phoenician Kabob is a delightful treat every time I go."], ["Jennifer R.", "So I have one check in, but the reality is that I come here at least a few times a month.  I have no idea how I haven't reviewed this place until now. This is one of my very favorite restaurants, period. Everything is homemade in house and incredibly delicious. The servers are always kind and accommodating. I generally go for lunch, because I like the cheaper lunch specials. I always get the chicken kabob. At lunch that means one chicken kabob with onions, bell peppers, and delicious chicken pieces served with basmati rice (seriously, how do they make rice so good???) cucumber/tomato/onion salad and (drum roll) the garlic aioli (technically called thume.) THE GARLIC AIOLI WILL BLOW YOUR MIND AND CHANGE YOUR LIFE...All of those things are incredible and I also recommend getting pita bread because it is warm and awesome. Now I have to go there tomorrow because I'm craving it like crazy."], ["Lindsey P.", "My food was amazing! There wasn't one thing that I didn't love. I had falafel and gyro first and then a chicken kabob that came with rice and hummus and pita which was homemade and cooked in a really nice pita oven! And then for dessert I had coconut macaroons! Loved it all! The owners are so incredibly nice and know what they are doing because everything was outstanding! I definitely recommend this place and I don't see how anyone could not love the food and the very nice people! Best Mediterranean food in all of Denver and possibly the best I've had anywhere!"], ["Liz B.", "Went exploring along Colfax for dinner options when we stumbled across Phoenician Kabob, and we were happy we did. Started with the baba ghanouj, which was smoky and creamy, served with baskets of their fabulous pita bread. Had the kafta kabob plate, a great choice, the meat was flavorful and well seasoned, served with salad and rice. My date had the chicken shawarma sandwich, also another great option. Service was attentive, the waiters were very friendly and personable. Nice atmosphere, made for a great date night. Look forward to going back soon!"], ["Ali M.", "Love the food, the atmosphere and the service. Overall a good value for quality mid eastern food"], ["Erik F.", "My favorite neighborhood restaurant. The best lamb and gyro meat in Denver. The garlic sauce is to die for. Great spot right on Colfax. A must eat for anyone who enjoys good food and a good time."], ["B G.", "Pretty much perfection at the Phoenician Kabob. The owner, Ibrahim is an enthusiastic and thoughtful host who wants to make sure everything is \"just so\" for his guests. I had the combo kabob platter- lamb/chicken/beef and there is no better place outside of Jordan where I've seen better Middle Eastern cuisine. There were 12 people seated at our table and the food was served flawlessly!There is no comparable restaurant in Denver for the fresh pita or the hummus. This establishment is proof positive that a great \"hands on\" owner, staff and a concept done well will beat the newest trendiest loft space farm to table restaurants any day of the week and for a much cheaper price  too!"], ["Priscilla M.", "Great happy hour deals, big portions, friendly service, and meals were delicious!! You will not be disappointed!"], ["Cydney M.", "My aunt and uncle recommended this place for dinner and I would have to say Phoenician Kabob's Mediterranean cuisine is delicious.  We walked in on a Monday night after deciding against Chinese take-out and got a big table by the window for our party of seven.  They had lots of specials listed on the board by the door and Ibrahim, the owner, is pretty tight with my uncle so they brought out a few complimentary appetizers.Food:  5/5 Stars-Stuffed vegetarian grape leaves 5/5 stars -  They were on the thin side, but very good.-Fried Cauliflower 5/5 stars - I have never had this in my life and I loved it.  Ibrahim said they are going to put it on the menu.  Definitely ask for this if it isn't on the menu.-  Eggplant slices in balsamic 2/5 Stars - not really my cup of tea.  I like babaganoush or Ikra that is all mashed up as a dip.-  Chicken breast kabobs with garlic dip 5/5 stars - marinated with the right amount of saffron and the garlic dip rivals Zankou in L.A.  I was in heaven and ate every last morsel of chicken and garlic dip.  -  Basmati Rice -  Normally I don't eat rice because of the carb factor, but they cook it with a touch of cinnamon and it was delicious.  My hubby, who is Iranian, didn't care for it and I don't think my uncle likes it, but I couldn't stop eating it.  It is kind of like cilantro.  You either love it or hate it.-  Freshly baked puffy pita bread - 5/5 stars  It was hot out of the oven and so good.I seriously can't remember what everyone else ordered because I was concentrating on my plate.  They all seemed to be exceptionally happy with their selections.Service:  5/5 StarsOur server was amazing.  I can't remember her name, but she was awesome.Ambiance:  4/5 StarsIt is very nice inside, but I wouldn't say it has a really fancy or hip vibe to it.  That has to do with the location.  If you put this restaurant in a stand alone spot in LoHi or one of the other hip locations in Denver it would be a goldmine.  My wheels are really spinning on this one.  Parking:   4/5 StarsStreet parking for free.  No lot that I saw.I will definitely come back to this restaurant when I am in Denver and I would highly recommend it to anyone looking for a amazing Mediterranean food."], ["Taylor L.", "The food was incredible! We got the Sultan combo (pretty much a plate of meat, rice and hummus) and my friend got the gyro.  The food was super fresh, the server was helpful with recommendations and the chef was very nice as we were leaving! We will definitely be returning!"], ["Megan E.", "On the recommendation of the ever amazing Denver Elite Yelpers, a friend and I came here for dinner on a recent Friday evening.First - I'm surprised this place was fairly empty at a prime time for Friday dinner - someone should go and fix that!Second - belly dancing, a manager who came out to check, fast and friendly waitstaffThird - really amazing food and a ton of it!As my friend is GF, we were excited to discover she could have nearly the entire menu!  We therefore got the sample platter and an order of the Fava beans.  The sampler was huge - enough for both of us, plus leftovers x2!  The fava beans were warm and like hummus but chunky - think salsa with med flavors and food.  Both were good choices for sure.While we were too full for dessert, they did have them available for your viewing pleasure in a glass case on the bar.  They also had specials of the night on a whiteboard.The only slight cons... 1 - the hummus wasn't our favorite.  2 - there is no GF pita bread so that made it a bit harder to eat some of the sauces. So if you are in that part of town, or close by, go check out this place for an enjoyable meal!"], ["Robin B.", "This is hands down the best Middle Eastern restaurant in Denver! I am second generation Lebanese and grew up in a town with a very large Lebanese population and many wonderful options for Lebanese food. Until now I could not recommend a Middle Eastern restaurant in Denver to family and friends. This is not because the places I have tried were bad they just weren't excellent. This place is excellent! The quality of ingredients are above and beyond the other options in town. While visiting with a friend who is also Lebanese the owner was walking around speaking to all of his guests. You could tell that he had built a relationship with many of his patrons. Overall the service was fantastic. It was very obvious that the owner takes a lot of pride in his business and the quality of his food.I am very excited to have found this wonderful restaurant and would highly recommend it to anyone."], ["Alicia J.", "This review will probably read as a love letter, which is appropriate and well-earned.From the minute I walked in, I enjoy the ambiance of the place, and I was greeted quickly and seated by Katy, who wound up being one of the best servers I've had in a good, long while. She answered all of my questions, of which I had many, and was extremely friendly and helpful. I started with hummus, because really, this is a litmus test for me in any restaurant that has it on the menu. The hummus, well... it was probably the best hummus I've ever had, and was accompanied by a big basket of two huge pitas so fresh and hot that I burned myself even trying to eat them right away. I was also impressed by the amount of hummus I got as an appetizer. Too often, I spend $6 and get a plate that looks like someone smeared the thinnest, weakest little spread of hummus on it. This was a generous bowl and I couldn't even finish it.They have a handful of lunch specials and I went with the chicken shawarma. When it came out, it was chock full of chicken cooked with bell peppers and onions and super fragrant! Even the rice that accompanied the meal was particularly well seasoned and tasty. A small salad of onions, tomatoes, and spices came with the meal, as well as a little container of \"garlic dip\".  Now, this dip might even have a more fancy or specific name but I'm going to call it garlic dip. And, if I had my druthers, I would be putting the stuff on everything from breakfast to dessert, it is that amazing. Spicy and powerful and outstanding.I had my leftovers packed up and noticed the desserts. Well, of course, I could not leave without getting some baklava. Then I saw that they had these little homemade cookies , and... Well... I came home with a lot of sweets and a fantastic leftover meal for tonight's dinner.Everything was reasonably priced, especially for lunch. I believe my chicken shawarma lunch was $9, and they also offer beef shawarma, gyro , and several types of kabobs.To say that I'd go back would be an understatement, as I will probably try to find a reason to get over there as soon as possible. Ask for Katy, if you get the chance, because she's awesome. And, you know... Get the garlic dip."], ["Wc D.", "Amazing Mediterranean food. Interesting location with super accommodating staff. They also have belly dancing on the weekend!"], ["Jeanne J.", "This place hits the ball out of the park in all areas :) First it is a cute small place on E Colfax. I remember when we hardly had any great places on this stretch of the Fax but times are changing :) The first time I ate here I just ordered it to go and it was yummy but I  decided to eat in this time and it did make a difference. My friends and I came here for a late birthday dinner for me so we wanted to try a few things. Appetizers - Hummus and Sabankh. The hummus was creamy and very flavorful a little less salty the others I have had. The Sabankh was out of this world . The little pastries filled with spinach and pine nuts were so good. I could have eaten just these and be happy. The Greek salad was very good . All ingredient was chopped up really small which is a great way to serve this salad.  We also order the Sultan Combo & Vegetarian Combo both were very good! You can taste the Quality in the gyros and chicken. The tabbouleh and baba ghanouj was oh so good! The Pita however is one of the reasons this place stands out . Wood burning oven cooks the pita and the Sabanekh to perfection :) Don't drive by this place with out stopping for some yummy food!"], ["Jeff E.", "Recommended by the tire place down the street while I waited.  Very strong flavors made for an awesome wrap.  The fries were those really good thing crispy ones that you seem to only get at Greek and other foreign places.Garlic Past is STRONG and will leave its mark on you for a while.Overall great place if you are looking for something different with LOTS of flavor."], ["Chaz D.", "A hidden gem!   This place is amazing!  Even make their own pita bread. :)Great price point & has a nice environment!"]], "House of Kabob": [], "Shondiz": [["John W.", "The Doner sandwich is very good, although I keep seeing Doner Kebab in the reviews but the only offer sandwiches not kebabs.  The falafel is good, but I have a hard time refusing falafel at any time.   All-in-all, another great food cart for Denver."], ["Iwla L.", "I finally found a middle eastern place I like in Denver! After eating at Shish Kabob and leaving feeling sick, I thought Denver probably just had very little to offer when it came to gyros, shawarma, and falafel. But this place is actually great. I got the shawarma sandwich and it was everything I asked for, with a nice mixture of flavors and textures. The price is also very reasonable at only $6.25 a sandwich."], ["Britt D.", "This place is amazing. These guys work so hard to make delicious food, day after day, week after week, from a tiny cart on the 16th St Mall. They serve the best breakfast burritos in Denver, every morning, each one cooked to order. They serve delicious gyro and shish taouk, shaved from a hot, fresh meat stick, in soft, warm pitas with tomatoes, lettuce and tzaziki. Their lemonade is to die for. Try this place, you won't regret it."], ["Sarah Z.", "This little cart is a gem.  Breakfast burritos are $2.50 which is unheard of downtown, and they are delicious!  They occasionally give free samples which makes you want to come back for lunch.  The main guy working there is super nice and very attentive.  Love this spot!  Get there!"], ["Davuth T.", "Got the steak and cheese breakfast burrito (minus cheese due to personal pref.) a couple times here.  AMAZING.  Don't expect a \"traditional\" Mexican breakfast burrito, as the flavor profile is definitely Med-influenced, but the red sauce still provides a flavorful kick.  I enjoyed the steak much more than the typical ground beef/chorizo offerings in most breakfast burritos.  And it's grilled in front of you, so you don't have to wonder how long the burrito you're holding has been sitting in a cooler.  Add some grilled onions and homemade green chile into the mix, and you, my friend, are holding a culinary treat hugged in foil."], ["J K.", "I love Mediterranean food like a dog loves bacon and the Shwarma sandwich for $4.50 can't be beat for a filling, fresh lunch. I have their menu and a frequent luncher card tacked to my cube for frequent visits. $1.50 for three falafel$1.00 scoop of hummus$2.50 burritosAnd, there was no 40-minute wait when I went! Thai-shmai, it's all about the Shondiz."], ["David B.", "Just had an excellent falafel sandwich here. Falafel balls formed and fried to order. Nice thick flatbread. Usual stuff including a tasty hot sauce. A great deal for $4.75."], ["Tricia H.", "This place is awesome.  I am so happy to have them there and I hope they never go away.  Today I'm eating light, dolmas and falafels.  The dolmas are very fresh, the falafels I suspect are pre-made/frozen, but they are good nevertheless.  I agree the two men manning the shop are excellent in customer service.  I will go back and back again."], ["Dan K.", "Excellent place for a breakfast burrito, I eat here so much they know exactly what I want (steak & cheese, add tziki & cabbage)."], ["Kait E.", "Shondiz, you have finally made my life complete. Ever since leaving Europe I've been craving a good Döner and haven't even come close. I haven't found anything this authentic since being in Istanbul or even Germany! The guys are super friendly too. One day my friend and I got there just after they closed so they actually gave us a coupon for a free sandwich each next time we came. It's amazing how such a little stand can create such a big buzz. They get a lunchtime crowd at least 20 people deep and somehow manage to coordinate everyone's orders flawlessly. I'll definitely be stopping by plenty more times."], ["Aaron T.", "A little cart in the middle of 16th st mall that has a LOT of flavor.  Their shwarmas are really good and the breakfast burritos are a great price and delicious."], ["Mary H.", "Shondiz has phenomenal Mediterranean food, and even better service.  They, hands down, have the best doner kebab I've ever had.  I recommend topping it off with a side of falafel and a rose water lemonade.  The Shondiz food cart is located on the 16th Street Mall at Glenarm.  It's a great value, quick service, and the cart's owners will brighten your day with their kindness and generosity.  They have a punch card for frequent customers such as myself along with other promotions, and they even let me know that you can call in your order ahead of time for pickup so you don't have to spend time out in the cold.  Give them a try and you won't regret it.  As an added bonus, they'll let you sample just about everything on their menu before you order!  Shondiz is a great find and has quickly become a lunchtime staple for me and my friends."], ["Aaron M.", "This place does not have Doner Kebabs.  They are just Gyros with hot sauce on them.  I have eaten many Doner Kebabs and I was really excited to try one in the U.S. but i was let down.  Anyone who thinks this is a Kebab place might need to reevaluate what one is."], ["Josh B.", "These guys are SLOW, but it's worth the wait. $5.50 for a Doner Kabob that's moist and flavorful, not the same old dried out product most places offer? I had the chicken Doner Kabob, and we all know how rare it is to find moist chicken in a Doner Kabob, Gyro, or Shawarma. These guys do it with a smile. I'll be back for sure, to try the Beef/Lamb."], ["Sam H.", "I ordered the Doner meal and it was really good.  The meat was very tasty and had excellent flavoring from the lamb.  I liked the falafels, not soggy and tasted great dipped in hotsauce and tzatziki sauce.  Very reasonable price and the owners were friendly and helpful with the descriptions."], ["Dominic S.", "Their motto is \"Food Fast, Not Fast Food\". This could not be further from the truth. It took over 25 minutes to get a doner kebab plate. The meat was hard and dry. I could have been in and out of the Hard Rock across the street in less time"], ["Nick M.", "I have visited this Mediterranean cart dozens of times over the past few months.  The gentleman working inside the cart, along with the occasional gentleman working outside the cart, are always super friendly and conversational.  Since I get into work early, it's always refreshing to see them all set up and ready to go before I head into the office.  Within minutes, I have my bacon breakfast burrito fresh, piping hot and ready to eat when I settle in at my desk.I love street/cart food, so I am very thankful for these guys being so super close to my office.  For $2.50, I can stuff my face with tons of bacon, egg, cheese and green chili at 8:00am and be set until early afternoon.At any given moment, you might see two or 30 people standing in line to snag something delicious from this guy's cart.  If that isn't an indication of how great this place is, then I don't know what the hell to tell you.I had a short conversation with the \"chef\" about a week ago regarding opening a permanent location.  He said he's working on it, but he doesn't want to raise his prices because so many people have become dependent on his delicious and inexpensive meals.. so he'll just have to wait longer.  This guy is, and always has been, all about his customers and I plan to continue visiting him often."], ["matt h.", "I tried both the falafel ($4.75) and shwarma ($5.75) sandwiches and loved both.  The sandwiches were large and made to order.  The guys working the stand were super friendly, and the frequent diner card where you get the tenth sandwich free is very nice and will ensure I'll be back many times.  They don't set up shop sometimes when its really cold, which is understandable.  My suggestion is to take the sandwich back to the Republic Plaza food court if you don't want to eat in your office.  You can also get some fries and a free water there to complete your meal."]], "Ali Baba Grill": [], "Pete's Greek Town Cafe": [["Jason L.", "Decent diner. I enjoyed a Greek salad with Gyro meat. It was a large portion, with very fresh ingredients."], ["Safford B.", "We gave Pete's Greek Town a try today because we were both craving Greek food. I was under the impression that this place was more of a cafe, but it's really just a diner. The inside is pretty dingy. I wouldn't go so far as to call it dirty, but the decor leaves a lot to be desired.We ordered three small plates to get a good feel for what Pete's offered. The spanakopita was pretty good. It had the right balance of spinach and pastry, and had a nice flavor.We also tried the saganaki, which was ok in and of itself, but the accompanying pitas were a little dry. Same holds true for the tzatziki: the yogurt itself was fine, but the accompanying tomatoes were white, and the cucumbers were bitter.Service was also spotty. Our waitress handed us menus and then immediately asked if we were ready to order. We had hardly been in our seats for 30 seconds.There did seem to be a pretty good crowd here, so Pete's Greek Town may have a following as a diner, but it's a little disappointing as a Greek restaurant."], ["L A.", "Dirty. I really don't like giving only one star, but I have to in this case. The service was friendly. The food wasn't very good. It was like fast-food Greek food. The portions were huge. The food was very greasy. It was just reheated to order. To be fair, our order included spanakopita and moussaka, which aren't normally made-to-order. I was glad, though, that the cooks didn't make our food then and there, because...one cook was PICKING HIS NOSE in the kitchen. Repeatedly. And that right there brings it down to one star."], ["Sophia C.", "I am a greek transplant from California and have been on a quest to find good greek food in Denver. Sadly, this is NOT it. It is so beyond americanized that you would not even recognize the food as greek (due to a serious lack of flavor and care) had it not been for the names. The meat was dry, the vegetables old, and there were very few if any seasonings used. I would not recommend this if you are looking for any semblance of quality, authentic greek food."], ["Christopher C.", "Great  Greek skillet, everything else is the same as all of Pete's places, but the skillet is a must have."], ["Dave T.", "Clean and nice.Great calamari!They have different seating environments, from diner style to nice tables.Many more things on the menu I would like to go back and try."], ["Alex W.", "I get the chicken kabob for lunch quite a bit, thus my duke-dom, *breathes on nails and polishes them on a ripped shirt*. To be honest, this place is kind of weird in a way that fascinates me. It is massively huge but seems to be mostly empty. They run around speaking Greek. I don't care how they pay the bills as long as the delicious food keeps coming."], ["Kat A.", "My (very Greek) friend has been encouraging me to check this spot out for months. And, since a craving for gyros struck fast and hard yesterday at lunchtime, it was my destiny (or, as George McFly opined, it was my density) to visit this spot just up the street from my office.I went with a basic gyro and fries plate. The meat was spectacular and the pita was soft and delicious. The fries were outstanding, too - perfect traditional diner fries. I will say this - there were enough onions on my sandwich to feed a small onion-loving army. Holy hell was I fragrant for the remainder of the day. The service was fantastic and the guy behind the counter was especially friendly. We got right in and out. I'm excited to go back in the evening to try one of their dinner platters."], ["Linda T.", "This place is conveniently close by.They offer the best hummus and gyros!  Friendly staff, quick and efficient service."], ["K. R.", "My wife and I live one block away, so it's real easy to just walk there. The place is decent and the staff is pleasant too. The food is hit or miss, depending on what you order. Obviously, ordering Greek will get you a pleasant meal. Ordering a Philly cheese steak will be disappointing. Otherwise, the place is clean and nice."], ["Cherie C.", "I stopped in to order takeout.  As I sat at the counter in this diner-style restaurant, I noticed the smell of cigarettes.  First I thought maybe it just smelled from years of allowing smoking (and not changing paint?).  But it was too strong for that.  When I used the restroom and passed by the lounge, I saw folks in a smoking lounge of sorts.  Perhaps it's a glitch in their HVAC, but the smell is not contained to the smoking area. That would definitely keep me from returning here to eat in.I ordered two combo plates.  One had moussaka, pastitsio, and spanikopita.  By the time I got home, the spanikopita was no longer hot. But what was upsetting was that it had a rubbery texture, as though it had been reheated in a microwave for me.  It makes sense that spanikopita would not be baked to order, but heating it in a microwave for a to-go order is just silly.  I think that nuking any pastry is an abomination, so I didn't take a second bite.The Ambrosia combo included a Greek salad of sorts, a bit of pita, plus some meat. The chicken and pork was all tossed together in the same container.  The tzatziki and other sauces were very good--we saved the leftovers and used them with other meals later in the week.Everything was fine (save the spinach pie), but not mind-blowing.  The avgolomono soup was a standout, a lemony chicken soup that was comforting on a cold night. But at $40 for two takeout entrees, I doubt I'd return. I do like Greek food, but I couldn't help but think of what $40 in entrees could have gotten me at other area restaurants. And I don't mean quantity; we had Greek leftovers for brunch the next day.  It just fell far short of my expectations and was a bit too expensive for what we got. Plus, I'd already decided that takeout was my only option after experiencing the dining room, so it's definitely out of my takeout budget."], ["Mark T.", "The six-block stretch of East Colfax known informally as Greektown houses, perhaps unsurprisingly, a number of Hellenic restaurants and other amenities to help you get your Greek on. Of these, Pete's Greek Town Cafe is particularly noteworthy. Part of Mr. Contos's large food empire, PGTC takes the best elements of a specialty restaurant and a greasy-spoon diner to come up with quite an interesting eatery. On my last visit, I sampled the Greek Spaghetti. I have always loved this dish, with toothsome (what's the Greek word for \"al dente\" anyway?) noodles tossed with the firm, flavorful cheese called Mizithra, butter, and a little garlic. So simple, but so delicious, and PGTC does it right - by me anyway. I often find it tastes better by itself, without the sliced grilled chicken that can accompany it (for a small fee of course!) But yes, they also have Moussaka, Souvlaki, Pastitsio, Saganaki (OPAAAAA!!!), Dolmathes - is your tongue in a twist yet? - or many other native dishes for you to try. So be adventurous - you can have that burger somewhere else. To drink they have juice, tea, coffee (Greek or otherwise) and a number of other beverages. I always go for the blueberry/yogurt smoothie called the Santorini Shake, with colors evoking the Greek flag. Hey, you're still reading this? Go eat already!!!"], ["cindy b.", "I vote Pete' s Greek Town Cafe as the best place to sneak off early and have breakfast alone before work.  I love to sit at the counter, read the paper, and the food is great for breakfast.  It's also a surreal sort of place to meet a writer friend in those odd hours--sit in the big front room with the fascinating murals that you wish were somewhere in your house, just to look at when you don't want to think about anything.  If you are used to NYC Greek diners you will feel right at home here."], ["James B.", "Solid place that we enjoy. Often late at night.We generally always split a greek salad with the grilled pork on top which is always amazing. Service is always good and desserts are tasty.We generally are in the area after 9pm and they are open and friendly."], ["Jonny D.", "I really like this spot. The ambience is a bit IHOPy but the food is great for a decent price. The Taste of Greece appetizer is enough for a meal for two. It's awe-inspiring. I loved everything on it and there was so very much on it. We got it with souvlaki and I was ecstatic throughout it.The Greek Town Plate had a little of everything delicious for the lady, who could eat only about half of it. I got the beef tips over rice they had on special. I wasn't expecting much--what can you really expect from beef tips?--but they really did deliver some great food. This place is great, but it isn't anything special--it's just a solid, stand-up diner. It's the kind of place where you should be a regular if you live near it, but probably not a spot for special occasions."], ["Kathleen A.", "So, my girlfriends and I are all swankily dressed up and wanted to go out to eat at a reasonable place before seeing Wicked. Well, this place may not strike you as a before-show spot but it's in my hood and its cheap so it fit the bill.Let me say, three ladies dressed to the nines stuck out like a sore thumb here! But that's ok. You don't come here for the ambiance, that is for sure. It's a great place with decent food and no waits!  I decided on the egg-lemon soup and chicken kabob sandwich.  The soup is just what you need for a cold winters night to warm you up!!  I loved the sandwich, with the very flavorful chicken on a warm pita.  May I also suggest the hummus for an appetizer too!! However-I had leftovers, and I decided to leave those leftovers in my car while we were at the show. So when I came back at the end of the night, my car reeked of Greek food. It even reeked this morning still. So be warned...this stuff is potent. And I'm sure my roommates hate me for stinking up the fridge too."], ["Vanya L.", "I initially thought the prices were a bit high but the food is fresh and does not disappoint. I have to go off on a bit of a tangent here- but their house salad, a simple little salad, was AMAZING. It truly was the highlight of my meal. I wish I had ordered ten. It consisted of fresh lettuce, feta, a couple kalamata olives, beet!, cucumber, tomato, garbanzo beans, onion, and some zesty homemade vinaigrette. I liked the simple, delicious dressing so much, I actually hid my plate away on the other side of the table because I didn't want the waitress to take it away. I actually wanted to LICK the plate. I would have, be sure, had I been at home. My daughter, prior to this visit, has not liked salad OR olives, and after eating both of ours, she now loves both. NICE!I had only had lemon soup, Avgolemono, (it's one of their standard soups of the day) once before in Athens, Greece at Easter, and I remember thinking it was amazing.This soup was good. I thought in Greece it was actually tripe, not rice, but, whatever the case, I enjoyed this very lemony soup. I really did. So did my two year old. Not the same as the Plaka at Easter, but delectable either way.Our waitress seemed to be having a bad day but gave us top notch service nonetheless. She was on her game and we lacked for nothing. My friend had the gyros and it was superb. It was served with fresh lightly sautéed onions (just perfect), pita, fresh vegetables, and absolutely to-die-for roasted potatoes. Are you kidding me? Those potatoes were pure potato perfection. It pained my friend to even let me try them. They really were that good. My daughter had the very fairly priced grilled cheese with fresh vegetables ($3.25) - you need to ask for non-french fry options, and was also given crayons and stuff to color. Overall, I was very impressed and delighted with my experience, Just a really good place to eat with fresh, delicious Greek food."], ["Aly M.", "honestly i really liked this place. i just wanted to go out and grab a quick bite to eat with my friend because i didnt feel like cooking dinner and i stumbled upon this restaurant. when we walked in the waitresses smiled as they greeted us and were very quick to seat us. My friend and I were served by a very nice blonde greek girl who was quite good at serving (she knew when to be quick and when to give us a few minutes). the food was awesome. the meat was seasoned just right and everything went extremely well together. even the owner was extremely homey. he made sure that my friend and i had a good experience. he almost reminded me of my grandfather with the way he carried himself in a sense. he was an extremely respectable man. the only complaint i have has to do with one of the line cooks though. right after my friend and i ordered, i found out that my friend had never had greek food so i wanted to have him try a traditional gyro. my waitress had already turned in the ticket(as she should have to get food out in a timely manor and did so faster than a lot of wait staff ive seen) and had to change my tables order. i had a problem with the cook barking at my waitress for my last minute change. he said something like \"figure out your orders before you turn them in.\" i would understand him getting mad at this if he had already called it and it was busy but i came in much later than the last rush. my guess is he might have had two to three small tickets if any at all. i also had just added on a dish which should have made it easy for him. it would have been my waitress who would have had the confusion when writing the check. i wanted to walk up to him and ask him to bring his complaint up to me because i had heard and seen him as he said it to her.over all, though, i will be recommending this place to whoever is looking for a good spot to eat. i liked everything about this spot and i will definitely be here again. this place had good food, a nice cozy feel and great service."], ["Heather O.", "Not an awesome experience. Upon arrival the staff was kind of a mess and kind of acted like they had never served humans before. I made a take-out order with the owner/manager (well, the guy in the button-up). When my order was ready, he and the waitress had a little quarrel about how to hand a receipt to a customer? Awkward for all involved.I ordered the Gyro platter. When I asked the guy if I could have something other than potatoes, he said no. Annoying. The meat seemed reheated, the vegetables were not fresh and over steamed. They didn't give me any pita bread (they saved me from myself, but I really was looking forward to it. So I was disappointed when it was missing form my order). I won't be going back."], ["Andrew B.", "Best Greek food I ever had!!!"]], "Cafe Byblos Mediterranean Grill": [["Josephine H.", "Amazing food! Love the selections, generous portions and very reasonably priced. The owner Sam is awesome, service is great. Definitely one of my favorite Mediterranean restaurants!Got the beef kabob - holy moly, so well seasoned. Sister got the lamb kebabs, perfectly cooked and the veggies were perfect. I only have wonderful things to say about this place!"], ["James M.", "Not great. Food was ok but salty.  Table by the door allowed someone's cigarette smoke in.   No liquor license.  Plus side clean and quiet enough to talk."], ["Lily S.", "Our friends from Jordan insisted on taking us here instead of our long time favorite Alibaba Grill or Jerusalem. Preconceptions must have gotten the best of me, unfortunately. Even though Café Byblos is a much better looking restaurant, and the foods may be more authentic, the taste is not what I'm used to. Take the hummus, it's very smooth, but just too \"lemony\" (didn't want to say \"sour\" to sound like it's gone bad, but...), same thing with the salads. If you happen to be super hungry like I was, bad news for you, all the acidity would make you even more starved, lol. Good thing our friends know how to order family style and we ended up having a lot of food. The grilled meats, I thought, were over-charred, especially the ground skewers, so dry that pieces were falling off the sticks and the only flavor profile I could discern was that of burnt. If that's the authentic flavor, then I'm perfectly happy to go back to the juicier, less acidic, \"Americanized\" way. It says a lot when the first thing in front of me that was finished were the French Fries with ketchup. My miss, I know.Just for comparison's sake, the Turkish coffee is excellent here and is brewed the Turkish way. A floral, strong shot of coffee lightly sweetened and served without cream. I'd come back for just the coffee and perhaps dessert as we didn't get to try any this time."], ["Anthony L.", "So the food portions we're small and honestly I have had better, the concern with devour is immense but the comfort if the  chairs was subpar. If your close it's OK if your hungry also but honestly  I'd pass...."], ["Jennifer M.", "My all time favorite restaurant in Denver. I always come here if I'm ever craving anything delicious."], ["Niki S.", "I think this place might have been having an off night when we went. But who knows because it was totally empty. I will say this - the spanakopita is highly disappointing. I LOVE spanakopita but this was literally the stuff you find in the appetizer section of the frozen aisle. The salad was a big portion and they did not skimp on the feta, thankfully. The meat platter, for $18, was a GREAT deal in portion alone. Unfortunately, everything (lamb/chicken) was a little overcooked, tough and dry. Maybe it's not always like that, who knows. I would give it another chance. I've heard great things so I'm hoping it will be better next time."], ["Jenna N.", "I recently got take out from here with a bunch of friends.  And... WOW.  It is delicious.  I am so happy to have found an authentic mediterranean spot in Denver.  We sampled a bunch of dishes- lamb kabobs, beef shawarma, and lentil soup.  I had the gyros platter.  No complaints here.  Serving size was large and I had leftovers for lunch the next day, although it was so good I couldn't help but eat it as a midnight snack.  The tzatziki sauce is so delicious that I savored it and wanted more!  Next time maybe I'll order an extra side of it.Cafe Byblos is my new favorite spot to eat in Denver.  I'll definitely be back for dining in and take out."], ["Tiffany N.", "Maybe we went on an off day but I was not a fan of this place. First of all, Colorado Public Radio has them as a sponsor for BOGO sandwiches, online and in their pamplet and the girl said they were no longer doing that. The site was recently updated so I felt like she didn't know what she was talking about.Second, it's pretty weak when you're a restaurant and your best item is fries. My fiancé and I each ordered a gyro, one with fries, one with salad. The theme of our meal was wet. The salad was dripping with water, my gyro was cold and the pita broke apart because it was sopping wet. The gyro meat was tasty so I improvised and made a wet salad out of my wrap. It seems like it could be an awesome place but I just did not dig it. Yet another pass from me....."], ["Anna Z.", "For a place that is so delicious and definitely one of the best Mediterranean places in Denver, I am surprised every time when I come and I am one of the only customers there. Their obscure location is slowing down business because if they were situated anywhere else, their business would be rockin'. Nevertheless, my friends and I constantly come back and it's one of our go to restaurants. The restaurant has ample space and is very clean. There are many street parking nearby so it's never been an issue. They also have a lot as well. The waiters are very friendly and try to have conversations with us. I like how there are a variety of tables available from traditional tables to couch areas where you can eat in a relaxing manner.Not only is the food top notch quality mediterranean cuisine, they also give you a heaping portion (one plate lasts me two meals). My favorite is definitely the chicken kabob skewers which comes with a side of basmati rice which is so fragrant, and their special yogurt sauce as well as this delicious spicy sauce. I love pairing the different sauces with my meat and rice. It's an explosion of flavor and such a satisfying meal. Not to mention, they also serve you hummus and warm pita bread in addition to a house salad. It's so much food!! During another visit, i also tried the chicken shawarma which was very saucy and delicious and went so well with the rice. If you can eat more food, try some appetizers! I recommend the calamari or fried potato. Both are great appetizers especially if you have a group of people. I also tried the baklava which wasn't the best I've tried. The reason I am giving this place 4 stars instead of 5 is because it's always so empty and it lacks the exciting ambience of a restaurant. Otherwise the food is awesome and there is nothing to complain about there. This place deserves more customers so check it out!"], ["jomanah b.", "There was only one waiter serving the whole restaurant, which is not enough. She wasn't friendly at all and didnt welcome us at all since we were the only ones there.The food: We ordered the Arayes. There were 4 pieces but two of them were burnt so we ate the other two. When we told the waitress to take it off she asked if we wanted something else and we told her no. She didn't apologize and said that it was not her fault. When we got the bill we found out that she didn't take the Arayes off. So we asked her to either take it off the bill or get us two new ones, only to get two more burnt onesThe rest of the food was just OK."], ["Emily M.", "Went here last night with some friends, and we were not disappointed. One is a regular and got her standard dish of gyros with rice, pita, and hummus. Very flavorful. My other friend got the chicken kabobs and couldn't stop talking about how perfectly the chicken was cooked. Maybe a few too many onions but good otherwise. I got veggie combo. The hummus is like butter (absolutely fabulous hummus!); the baba ghanouj had good texture; the dolmades (stuffed grape leaves) were mushy (I've had better); the filo pie was nothing special; and the tabbouleh was mostly parsley but solid. Overall a great meal though - we all thought so and will all be back. The service was alright as well - water glasses were always full, and the waitress brought out boxes when she saw we were slowing down with lots of food left (huge portions)."], ["Katie B.", "I regularly spend like $40 to have Postmates deliver me this delicious Mediterranean delight -- and it's purely for the hummus.It's so smooth, heavy on the tahini, and enough to keep munching for days. The Greek salad is good too, and I love the brothy lentil soup!"], ["Martine C.", "We just had lunch at this restaurant and it was yummy.  The only sad notes, the tabouli parsley was full of dirt and the pita bread was not homemade super thin and dry.Our waitress was very nice as well."], ["Alex L.", "This was borderline good.  Even Renzio's (a chain restaurant) has more flavor in its tzatziki sauce.  Cafe Byblos was slow last Saturday.   I can see why it gets such high reviews as the atmosphere is welcoming and energetic.  Our waitress was super friendly and always smiled.  The meat in our gyros was flavorful and fresh.  Our drinks were rarely refilled until the only way to get our waitresses attention was to slurp the emptiness of my drink to get her attention.  Even a simple gesture of waving at her had no effect.  As I mentioned, I can see how this place gets great reviews.  However, our experience was a forgettable one."], ["Mike S.", "Amazing hummus, great service.  You get a lot for what you pay--great value!  I have eaten here twice-one time on my birthday-and it's been great each time."], ["Angie D.", "Wait staff was nice and attentive. The place was quiet since there were few diners,  so it was easy to have a conversation, but  I should have taken the lack of customers as a sign of what was to come. I ordered the falafal plate. The salad lacked flavor, falafals were hard and so dry I choked after one bite and had to quickly drink some water to wash it down. I couldn't have washed it down with wine since they have no liquor license. The hummus was ok, but Falafal King from the grocery store is better. An employee must have been smoking near an open back door because the smell of cigarette smoke wafted in several times. Sometimes it's just better to go to a restaurant you know is good than try something new. Wah-wah."], ["Krystal R.", "The food is usually bursting with flavor, however the wait staff on this particular visit was unacceptable, we received our drinks after our food was brought out.The waitress seemed u knowledgable with the menu, and stated my two girls could not share a meal, per company policy. Also unsure when it became okay, to heck your phone instead of listening to the customers order. Perhaps this is why there was so many issues regarding the food."], ["Denise R.", "All hands down this is one of the best flavorful restaurants in Denver the food is so full of so many different flavors it is amazing !!!!!!! the best part about it is everything is pretty healthy here very nice atmosphere"], ["Spencer C.", "I hate to give this place a bad review but when someone in our party finds a piece of metal in the food the least that should happen is a manager or owner should come to the table and apologize. Offering to buy the dish that only one bite was taken is nice but not enough. Shame on the managers and owners !!!"], ["Ashley N.", "The best Mediterranean food I've ever had. Hands down best in Denver. Best Toum and hummus ever. The chicken kabobs are amazing - the chicken is so juicy. The owner, Sam, is wonderful, gracious, and welcoming!"]], "Taziki's Mediterranean Cafe": [], "Vesper Lounge": []}