{"La Calle Taqueria y Carnitas": [], "Chili Verde": [], "La Abeja": [], "Taquería El Trompito": [["Andrea B.", "Taqueria El Trompito is a great neighborhood Mexican restaurant. They're beans are actually really good and their salsa bar always has a really good selection. I recommend their carnitas tacos, they don't skimp and two are usually plenty for me. I highly recommend it."], ["Liz K.", "Seriously ordered the wrong thing-should have gone with the tacos. Ordered the Chile Rellenos. They tasted like they were very old and like they had been fried in oil that had previously been used to fry fish. Soggy and gross."], ["Victor G.", "Great Taqueria that serves all kinds of Mexican food. I had the enchiladas suizas .....The bomb!"], ["Happy C.", "I can't believe I have never heard of this place.  Best Mexican food in the Denver Metro area so far.I was the only haole in the place, which is always a good sign.  Their salsa bar is a little skimpy, with only two salsas--one green, one red, both yummy--cilantro, raw and sauteed onions, and some whole peppers, but there were cups and lids and I helped myself to a bunch of the red salsa.I tried a little of everything:  I started with chips and salsa:  Made fresh on site and quite yummy.  Both salsas were spicy enough to make me blow my nose a few times, and I LOVE spicy food.The Chile Relleno Burrito, smothered:  This is huge and heavenly!  The green chile is so good, with big chunks of pork and just the right amount of heat.  The crunch on the relleno did not overpower the dish, and they topped the burrito with a little fresh cream. Three tacos:  The Barbacoa de Borrego, the Chicken Mole, and the Carnitas.  All were superb!  Two tortillas each with HUGE portions of meat on each one.  The Borrego (lamb) wasn't even remotely gamey, the Mole was the perfect mix of spice and sweet but not drowning in it, and the Carnitas was tender and flavorful.Two cheese enchiladas a la carte:  Unfortunately, they got this part of the order wrong:  I had asked for cheese only, no chicken, and instead I got chicken only, no cheese.  And despite this rather large mistake, they are still DELICIOUS.  Yes, that's how good this place is.I ate my chips and salsa and enjoyed a Mexican Coke while waiting for my food to be prepared.  Just as I sat down, two men walked in with guitars and began playing and singing.  What a treat!  I'm so happy to have found this place.  Please, don't tell anyone about it.  I don't want it to get ruined with fame.  It will be our little secret, ok?"], ["Brittnie A.", "This is best Mexican food I've had in my entire life. They don't use ground beef or cheddar cheese. It's the real deal. I had the Chili Relleno Burrito (probably not the exact name). Yup, deep fried pepper nestled inside a smothered burrito. And washed it down with a tall glass of Harchata. My husband wouldn't stop eating the guacamole by the spoon full, from the free salsa bar... which is also incredible. Tons of seating and great vibe! Check it out!"], ["Karolyna G.", "We come here all the time! It's always clean, fast and all the staff are really nice. You can see the owner doing table visits regularly. Our favorites: smother chile relleno burrito (green chile has pork, so it won't work for vegetarians), chicken flautas (they're big and have a lot of meat) and the asada & pastor tacos. I really like that they have the well stocked salsa bar most of the time and you can walk in to the next door homemade ice cream shop! We usually come here on Sundays after church and they get really busy! Last time my order took longer than usual and the cashier had to jump into the kitchen to help out with the orders. Overall good authentic taqueria style food for sure!"], ["Alison A.", "Tasty!"], ["Chris H.", "I really like this place, and as others have said it is authentic Mexican food. The selection is large and the quality is great. My default order is a burrito and their shredded beef burrito was flavorful and the sauce on it was great. I also always order chips and salsa. Their chips were freshly made...but not my type of chips. They were just ok. The salsa on the salsa bar also was good, but I have had other salsa that more suits my taste."], ["Paul P.", "Authentic Mexican Food! So yummy! Beautifully presented platos.I've only been here once because every time I want to go I forget where it is so I end up at Taco's e Salsa's which is almost as good...WOOT!!!!"], ["Michael P.", "Excellent again! Had carnitas tacos wife enchliladas Suisse. Both were excellent. Have enjoyed this place every time."], ["patricia z.", "This was a treat food was fresh,authentic and yummy!  The young lady at front counter could not do enough to assist us. Don't expect fancy but food great"], ["Charity R.", "Stopped in and had a carnitas torta, It was delicious!!! The lady at the counter taking our order was very nice, didn't rush us and was very helpful. Great food, Great customer service and very clean. We will be back."], ["Suzanne P.", "I always get the carne asada plate and an never disappointed however today my daughter ordered the salchiso con huervo and instead of putting sausage they put a hotdog in it.  I don't even eat that garbage at home.  But my good wad great.  Love the salsa bar. Service is slow like molasses tho"], ["Candy v.", "We order take out often and the food is always consistent. I love their green chili chicharron gorditas. The tacos are very good too (served on a regular size tortilla). The staff is friendly as well."], ["Bruce D.", "I have been here 5 or 6 times, and each time they have had a different red salsa. The salsa bar has a limited selection, but is always different and always excellent. Raw onions, grilled onions, a green tomatillo and avocado salsa, shredded cabbage, chopped cucumber, fantastic pickled jalapeño salad, and a new red salsa each day. It does not matter what food you order, it is good eats, as long as you have something to put that salsa on."], ["Lisa H.", "It's easy to get to from 36; only a few blocks down Pecos. So if you're driving along that corridor, it's worth pulling off and grabbing some grub.I had a tasty lamb shank, (falling off the bone, so the steak knife they provided was totally unnecessary), covered in a spicy reddish-brown sauce with roasted chunks of cactus. Yum! With a side of rice 'n' beans, about $10.50. My companion had a big mess of fried meat, grilled peppers, and other stuff... what do they call this dish... covered in cheese, which he folded into yummy corn tortillas and ate fajita-style. Yum again. I wish I had ten stomachs and a pile of money, 'cause I would have liked to try it all... the al pastor we saw turning on a spit was really appealing; and as others have mentioned, they have a gazillion kinds of tacos, and dishes I've never even heard of. That's saying something! Tacos are $2 each, btw, and there's a salsa buffet stand which includes more yummy cactus bits. Can't have enough of those!"], ["Sara C.", "If you're unfamiliar with AUTHENTIC Mexican food, this place might scare you slightly. Otherwise, you will love the huge menu and you'll be wanting to come back to try other items you saw that you couldn't get this time. My husband always orders one of their Lengua tacos along with one of the many selections, and has also ordered their menudo before. Always hits the spot, and he's Mexican by the way.I am a burrito gal, and they have one of the tastiest burritos that I doubt I'll find anywhere else. It's a Chile Relleno Burrito, and I ask for it smothered in green chile for the extra $1. It's just spicy enough and the burrito is big, I usually finish up to 3/4 of it and take the rest to go, because I WILL be snacking on it later.The traditional salsa bar is nice. Food is ready relatively quickly and they bring it out to your table. Diners in this hole-in-the-wall location are usually hispanic and they have Telanovelas playing on the tv during the day. They have some desserts, but my recommendation is to walk next door (there is an open archway from inside) to get some homemade ice cream."], ["Aide M.", "Very expensive for what it is.  Prices, Service and food quality are not as good as they used to. Not going back."], ["Doug Y.", "Shhhhh. You have to keep this quiet! There is a secret brother/sister hood of taco eaters formed from a society of taco eating yelpers. Their mission? To weed out the bad and savor the good. We had a small group meeting here guided by Matt P's vision of sampling all 21 of the types of tacos that they serve. We achieved to varying degrees of success our tasting mission. The verdict? Mostly good, some excellent! I've been told one of the brotherhood squealed like a pig and his reward? A cursed ROTD! He will be banned from future sortees! Only the tacogente' are allowed this privileged information! (disregard his comment about the pancita de borrego, I speak true when I say there is a mild taste of caca de borrego inside!). nueve."], ["James K.", "One of the best places for authentic Mexican food!  Try it, you'll love it! We had a burrito and 5 tacos, we were soooo stuffed! We ate it all, that's how good it was even though we were full after the burrito and a taco each (just my wife and I). The only bad thing I can say is that the wait was damn near 30 min to get our food!  But the food made up for that. My advise is order it to go, but order it well in advance. Oh, and next door is a ice cream shop so if you do decide to dine in, save some room for dessert!"]], "Taqueria La Familia": [], "Torta Grill": [["Vince B.", "what I love about this place is that there is a concentrated effort to introduce gueros like me to some of the awesome Mexican traditions that are missing from far too many Mexican places. Milanesa, Al Pastor, Horchata, Fruta con Chile are all things that more gringos ought to be exposed to. An why is it when I go to most mexican places all they have is coke, and maybe jarritos? the juice and lemonade here freshly made washes down the thick carnes very well.the ingredients are great too, but special mention to the way they lightly fry the bread to perfection. really makes the sandwich. 6 stars amigos! este gringo salio un poco mas gordo que antes"], ["Tabitha H.", "Since moving to Colorado I have felt like Denver is a Mecca of sub par Mexican restaurants. All of them are cooking the same exact thing. So I was really excited to read all the wonderful reviews of Torta Grill. Hubs and I decided to have a very low key birthday dinner for him Saturday night. Turned out to be a little full still from our afternoon festivities that we skipped Torta and made plans to go Sunday during the Broncos game. Turns out they are closed on Sunday. Bummer. Okay let's get delivery for dinner on Monday after work! It's Monday, yeah we're excited for Torta! We both choose the hector, different sauces so we could split them. I go to place delivery online but I am wary because when I came back to look at the menu I noticed a review suggesting that they say they deliver but they really don't. So I was a little skeptical. I did some digging and realize they don't deliver past 5PM, but their website does allow you to order delivery after 5. So that's a poor customer experience. And it was hard to find the right times. We decided to just pick up the food, which was a painless easy experience. Fast forward, 20 hours later and my husband was sick all night and is still ill. I'm fine and we ate exactly the same thing. And btw the food was totally delicious. It was so good. I think so solid clean up and maybe proper temperature checking might be just what they need! I am always the one to get sick too so if my husband is sick, you know something is wrong. The sickness and confusion about time open and delivery on their website is why I'm giving them 3 stars. I will definitely try again though to see if anything changes."], ["Melissa P.", "I am so torn by my review of Torta Grill. A friend (a GI doc, actually, which will be funny later) recommended it to me. So while hubs and I were waiting for a show at the Ogden, we ran up here to try it out. He had the Carlito, and it was as good as promised. I'm not a vegetarian, but also not a huge meat eater, so I went with the Enrique with chipotle sauce, which had such interesting toppings as catcus and and egg. It was DELICIOUS! Seriously the best meal I'd had all month (and that's even comparing it to some $$$ restaurants). A little greasier than I would have wanted, but a delicious, and interesting blend of flavors. And thanks to the little gift from the Yelp! check-in coupon, we were able to try the Cucumber Lemonade for free. It was refreshing, but sweet, and really good. Why the three stars? Fast forward to me getting home at midnight after the show (dinner was at 8). My stomach started cramping up. I tried a pepto bismol (probably outdated, because I almost never have to take stuff like that). Didn't work. By 1AM, I was puking my guts out. I slept on my bathroom floor until 5AM. It was bad news bears from both ends. Hubs fared better than me, but his stomach was still upset as evidenced by the smells escaping from him. (Have you completely lost your appetite now?). I was the DD and didn't have anything to drink at the concert, so perhaps some beer helped partially disabled the germs in his stomach. But you guys...it was SO good! Just because someone didn't wash their hands after going to the bathroom, I paid for it all night. Even so, I'm going to trust these good reviews, and give them another shot some day. I'll be looking for their sanitation score the next time I come in though. Good hand hygiene is imperative!!"], ["Erica G.", "Really great sandwiches - fresh, tasty ingredients and yummy bread.  The only downside of taking out the sandwiches is that the bread gets a little soggy after a few minutes.  The Cucumber  lemonade is really great too.  Nice and refreshing with a spicy sandwich."], ["Vic C.", "Mexican Sandwiches found here at Torta Grill. There is a small little lot (free parking) right behind this tiny eatery in the back in case you do not find parking (metered) on the street (free after 6 pm). My husband and I came by here last Thursday (9-17) for a late dinner. Around 8:15 pm, we saw a few patrons eating at the little counter and employees cooking up some meat and vegetables on their stove top griddle. After browsing the menu, we decided upon:By the way, I just want to mention that each torta comes spread with mayonnaise, beans, avocado slices, tomato slices and grilled onions. You can also choose between your choice of the following to add to your sandwich: jalapeno pepper, chipotle sauce, avocado serrano sauce and jalapeno jelly. Miguel Torta, $7.75 prior to tax- My husband decided to order this torta which comes with steak, egg and cheese. This torta came already cut in half and was more than enough for one person to eat and feel satisfied. The steak was cooked and seasoned perfectly. The creaminess of the mayo and avocado really went well with everything that is stuffed in this large sandwich, making each bite better than the last. Enrique Torta, $7.75 prior to tax- I opted for a vegetarian torta (I know that isn't traditional, but I am fan of vegetarian food options and believe me, I did not feel like I was missing meat) that comes with egg, cactus, queso panela cheese, crushed red peppers and another type of cheese. This sandwich was really good. Just like the Miguel, this sandwich was also cut in half. I only had half of my sandwich and saved the other half to be consumed 2 days later (which still tasted really good). I liked the red peppers and cactus, as it gave it a really nice added flavor and texture. The avocado, mayo and smashed beans really complemented all of the ingredients. ------------------------(Total= $16.74 including tax, prior to tip)With Yelp Check In, you get a free cucumber lemonade. I thought it was okay, but felt it needed to be sweeter. But my husband liked it and found it to be refreshing. Wait time for our sandwiches was not that long. Seating is quite limited here, probably can fit about 10 people. But just be aware that there is no public restrooms. So if you are looking for something really filling to eat for lunch or dinner, then Torta Grill should fit the bill. Food is pretty affordable and is really good (messy, but good).Would definitely order food from here again if I was ever in Denver again."], ["Jill H.", "First visit - home run. So tasty! Tiny little joint off Colfax, totally worth coming by for a delish Mexican sandwich.  A much better choice than the \"usual\" fast-casual. I had the Pablo mini. I'm too gringo for the chipotle sauce, so next time I'd choose a different one, but if you can take the heat, it's great. My son ordered the Ivan. Both were fantastic and gone in minutes. :-)Staff was friendly and welcoming! Reasonably priced too! Highly recommend!"], ["Derek R.", "along with Camila's food truck, these are the best Tortas in Denver.  the bread is slightly griddled, but mostly soft, and fresh.  The Carlito is so amazing I am reluctant to try different ones.  Service is good.  I've turned friends on to this place as well.  The bread, many times, can make or break the Torta.  Torta Grill has their bread game on lock."], ["Neli R.", "I love this place n their servece more .they are so friendly. I speak spanish too n i love to go there because  they always make funy about this spanish radio show bout 1 or 2 pm . i really dont volive what Erick M said sorry but if. Hes girlfriend speak spanish she shoud make sure wy they were having fun about ...."], ["Sam U-Well T.", "Stopped by while I was in town for work and wow o wow they had some bomb ass tortas! I had the Juan which has steak, pork loin, cheese and I topped it off with some avocado sereno sauce. It came hot off the grill and looked amazing! I waited for it to cool down as much as I could before I demolished that torta! Highly recommend!!"], ["Ashley H.", "I really wanted to like this place more than I did.  A place called torta grill, I expected to have at least a couple traditional tortas on the menu. Unfortunately,  they are all over the top combinations of tortas. I am sure for some people this is a fantastic menu with a twist on a torta, for me it was too much.The staff is friendly and the tiny place has a cool atmosphere. I thought it was a tad pricey for a torta place but they do have more options of things to put on your torta and a cool selection of speciality tortas and combinations. Expect to wait a while. They make everything fresh (so it's pretty good once you get it) but it can take 15 minutes or so.Skip it if you're looking for a basic torta but definitely hit this place up if you are up for being a little more adventurous with your torta and trying something new!"], ["Travis F.", "This restaurant was on point. Tasty torts, good price $9, and filling. I stopped for lunch and the owner recommended the Carlitos torta - grilled carnitas with onions avocado and choice of sauce - I chose Chipotle...just the right amount of heat and sweetness. What made it great was the cucumber lemonade. Very delicious and refreshing - free with check in on Yelp. I'll definitely be back!"], ["Jessie M.", "One bad ass torta! I ordered online, it was ready when I got there. Took a few minutes to get the attention of the workers, but no biggie. As for the torta it was amazing, check it out!"], ["Kristin O.", "Mmmmm their food is SO good! I came on a hot Saturday around 2p and was the only customer in there.They are a two-person show. One mans the cash register, the other cooks. Everything they made was fresh, greasy, and hot! I had a chicken sandwich with pineapple, BBQ sauce, and more. It was great!The only negative to this place is the space itself. It's really small - there are high-top counter seats for 5-6 people and that's it. Because they cook right in front of you it is HOT in there. It's nothing fancy, but their food is great!"], ["Maz M.", "Took my daughter to grab a bite to eat after her softball game at East High School and found this gem on Yelp. It is the definition of \"hole in the wall\" and well worth the visit. We were greeted warmly and helped to understand what a torta actually was. The ingredients are fresh and delicious. The bread is something from out of this world! I guess they have it made for them from a panaderia in town. Well worth the visit, just be prepared to dine in a small hole in the wall."], ["Huiling R.", "I ordered the Mini Pedro and it was delish..! Would come back again next time I'm in town."], ["Dillon G.", "Best tortas in town! The bread is soft and tastes fresh, the meat is well marinated, and the cucumber lemonade is surprisingly delicious. Denver has a real winner here!"], ["Elly D.", "Since my last review apparently got flagged and removed by yelp, here's an abbreviated version:Over the past 9+ months, every single time I have called to order delivery, they have told me they do not deliver. There is only one other review on yelp that I saw for Torta Grill that mentions this.This past weekend I placed an order through Eat 24, thinking that if they had a listing with Eat 24, it must mean they started deliveries again. Nope! Eat 24 called me 45 minutes after I placed the order to tell me that Torta Grill wouldn't respond to their emails or phone calls, and they refunded me my money. I've got a refund on my bank statement to prove it.Torta Grill, your food (in the few amount of times I actually ever received it) was delicious, but if you won't honor your delivery orders, stop telling everyone you offer delivery services."], ["Josh M.", "This place is on point. If you're hungry and in the area, stop by here. If you're hungry and not in the area, stop by here. They open at 11:00 AM and you'll want to stop by as close to when they open as possible. There is limited seating. There's a counter that seats maybe 6-8 people and a few small tables. I was there with a group of six and we covered the entire counter.They aren't a fast food joint so don't expect blazing speed but it is worth the wait. I tried the hector torta and it was pretty legit. Who doesn't like breakfast in a sandwich? Everything was cooked well. The sandwiches innards are plentiful so when you eat it, prepared for it to be a mess. Grab a fork and enjoy."], ["Jeff G.", "Best Torta I've ever had!  I've been to Mexico City and if you think the street food there is great you will fall in love with Torta Grill.  The homemade jalapeño jelly really brings all the sandwiches together and make me want tortas all the time!"], ["Alan W.", "I love a good Mexican torta and being back in Denver I decided to visit Torta Grill based on all the positive reviews.I ordered the Juan Torta which is steak, pork and cheese. They had other sandwiches which had all kinds of stuff in it but I felt like something more simple. I also asked for the pickled jalapenos and chipotle sauce on the side which went extremely well. The sandwich came with lots of fixings such as guac, refried beans, tomatoes, onions and mayo which made for a very satisfying albeit messy sandwich. I wished the bread was toasted more so that it could hold up to all the sauce and condiments.It was a bit of a wait for the torta even though I was the only one there, but it was worth it.I also had the cucumber lemonade which was very tasty and refreshing. The small size was actually pretty big.The place is really small and only had a handful of stools. Luckily it was a late lunch so it wasn't busy so had a seat right at the window which offers an entertaining view of the all characters on Colfax Street which is sketchy but fascinating -- there was a dumpster fire across the street with some kind of commotion by the transients hanging around by the bus stop. They all dispersed when the police and firemen arrived to put it out.I would come back again!"]], "Los Carboncitos": [], "Machete Tequila + Tacos": [["Gabriel D.", "love and the jicama. the land of Machete is real cool. great Margs and quac.summer patioa is a must.the big tip: order one jicama tortilla"], ["Josh d.", "I like this place.Cool taco choices, reasonably priced.  Friendly staff, HUGE tequila selection.Everything seems fresh.  The place seems dirty, but not in a bad way... It just feels like the southwest to me...  The dirtier places, where you probably go through to get to the beach front resorts that all the tourists go to.  But, in a good way - Nostalgic way almost...The men's room has what looks like old spanish comics, which gives it a pretty unique vibe.Add to the fact that the name is, intentional or unintentional, the same as my favorite Danny Trejo character/movie/whatever makes this all the more awesome."], ["Travis V.", "AMAZING selection of tacos. Salsas are flavorful, spicy, but not burn the hair off your toe-knuckles spicy. Would rate the food 6 stars."], ["Brittney H.", "Starting thought- maybe train your servers to not talk about their customers when they are within ear shot.. Place is great for happy hour, but pretty pricey otherwise.. $9 for chips and salsa?? Really? Food is okay.. Definitely needs some spice to it (all the salsas are mild.. Even the jalepeno one). Would come back for happy hour, but that's about it."], ["Lynda M.", "Happy hour was great! Josh, the server, was amazing. He remembered everyones names and there were at least 10 of us. The margarita was so strong that I only had one and I was wasted for a long time... which I didn't exactly like, but you might!Chips were good, and the salsa was, too. The hibiscus quesadilla was to die for. I'm going to be eating those flowers on a regular basis now.The atmosphere was awesome. I felt like I was at the beach. It was hot, good music was playing, and I was drunk."], ["Anthony S.", "I don't even know where to start, I love tacos and cocktails and this place delivers.  I'm honestly shocked there are some bad reviews, the food couldn't possibly be described as bland, if anything its flavor city in here. The menu has some really awesome items that you don't see at most places and their margaritas really are top notch.  Give them a shot and you won't be dissapointed."], ["Roxanne G.", "With so many mixed reviews, we were a bit skeptical but chose to try it anyway. First of all, it's a little hard to find if you're not familiar with the area. The service was good, Our server was nice and attentive! We ordered classic guacamole to start, or plain guacamole. The was nothing special about it. Could of used some more flavor. The chips were very unpredictable. Some were crispy, some stale, and some chewy. To drink, we ordered margaritas. My boyfriend ordered the raspberry margarita that was delightfully sweet. I ordered the cucu margarita that was suggested by the server. Both were good and strong. We taste tested a few tacos. The pescado was a little fishy. The Cochinita had good flavor bit meat was tuff. The only ones we enjoyed were the campechano and the pollo rostizado. I highly recommend sticking to those. We also ordered beans and rice which were very bland. Overall, we enjoyed ourselves. If we were to come back, we would pass on the chips, guacamole and beans and rice."], ["Nancy S.", "Love the platter of tacos. You choose 12 tacos for forty something dollars. Perfect for four people. The tacos are good sized, I was half expecting them to be tiny, but they were hefty. Delicious combinations like lamb tacos or pork and pineapple. Many, many choices of taco fillings. Totally recommend this as a place to go for two couples to enjoy some margaritas and a platter.Noisy, but fun. Friendly management. Will return for sure."], ["Steve S.", "Oh man, did I have high hopes for a delicious taco and thirst inducing margarita at happy hour. Sadly, I was disappointed with nearly every aspect of Machete, almost to the point of doubting the high praise that other Yelpers had to offer.First, you head down into the basement of one of Cherry Creek's many three story office buildings. Initial reaction was good, tin ceilings, Christmas lights everywhere (I assume this will not be around after Christmas), and couches hugging TV's along the walls. So, an OK start.Then the poor to super poor began. The waitress either had a twin, or forgot that she offered us drinks three times, and asked us how we were twice. Very odd. The happy hour menu is TINY, three or four items with \"$$ off\" instead of actual prices on the menu. Misleading, and not good. We order our drinks, and find the house margarita to be barely palatable. My head was spinning from cheap booze even before the first bite of chip.Speaking of chips, they were average pieces of cardboard. And that is the best compliment I can give. The guac was also average. Finally, the good comes out served like high priced cuisine which certainly didn't taste like. Guys, it's Mexican food, just serve it normally and we won't have such high expectations for the taste.My reward for a bad meal, stomach pains and a $40 bill. I will bypass Machete until hell freezes over."], ["Maz M.", "I can see what some people are talking about regarding the service. Our waitress was a little brash and certainly didn't seem happy to be serving us. The tacos were pretty awesome though. They also had some very interesting and fun margaritas. This place was packed for a Monday night and I would imagine the patio is a great spot for dinner in the summer. I can deal with the sub par service. It will just be reflected in my tip in the future. Cheers"], ["Katie W.", "My friend and I went into Machete for a few tacos and a margaritas. The bartenders were friendly and helpful, however as soon as our plates were cleared a man came up to us and asked if \"we really needed these seats\". Apparently the restaurant was too busy to further accomadate us. Come to find out this man was a MANAGER who basically asked us to leave when our margarita glasses were full! Unbelievably rude, don't understand how this manager (I believe his name was Sam) can expect returning cliental when pushing out paying customers during a blizzard."], ["Bruce H.", "Overrated and overpriced.  Margaritas are typical but twice as expensive.  They basically only offer tacos for food and suck at making them but charge a premium for their ineptitude.  It's a great location, with a unique layout and interior so I'm guessing people give it a high rating because they feel cool being here.  If you want good food and drink, don't come here.Their chips even suck."], ["Cody C.", "The food and tequila are bomb here, but our server (Gina) was probably the rudest waitress I've ever experienced. We went in around 3 on a Wednesday and we apparently sat in her section (though you wouldn't have known since she never checked on us after the initial order). I'm not a huge Mexican food fan so I asked Gina if they had a chicken quesadilla and her response we was a snappy \"does it look like it?! Is a quesadilla on the menu?\".... Uhh no but it's three ingredients and most places don't have a problem with fulfilling such a simple request. (Oh and I found out that they do indeed have quesadillas on the children's menu). Apparently my question agitated her so much that she didn't come back until it was time for the check. We even had to go to the bar and ask the bar tender for thing a because when we would wave at o get her attention, she deliberately turned away from us. This place would get a zero star because of her, but their food and booze selection seems to be their saving grace."], ["Yoomi P.", "MMMMMMMMM!!!I absolutely loved the tacos here. The al pastor was my ultimate favorite, but I basically want to try every meat eventually. The handmade tortillas were just the right amount of chewy and the meat was so juicy and flavorful!They bring out 4 different salsas for the chips. The green one was too spicy, but I liked that there were multiple options to dip my chips in hehe. We had a group of 8 people, and it was pretty crowded and busy, but I still had a great experience. The waitress was super accommodating and fast and came by to help us at the right times :)They split the check without us even asking, even for the chips that we shared. It was so convenient and easy and I was so grateful! I absolutely enjoyed my experience here, and could see it being one my FAVORITE spots. I was here yesterday night, but I would go back today.. and tomorrow.. and all weekend hahaha"], ["Christy C.", "This is a cute, authentic Mexican food joint with a dive bar type feel.  There is a nice area with outdoor seating as well as indoor seating.  There is also an area with couches if you are just stopping in to try one of their delicious margaritas.The restaurant is a little loud but I probably only noticed because my friend had a newborn baby with her.  She asked the owner to turn the music down, and they were very accommodating and did so.  The server was very nice and extremely knowledgeable about the menu, describing her favorite drinks and tacos.We started out with chips and guacamole which comes with four salsa/dips.  The guac was good and the green creamy dip was excellent.  It tasted like it had a hint of green chili in it.I ordered two tacos for dinner (based on the waitresses recommendation, which she thanked me for taking her advice!):  the arrachera con chile relleno and the costilla ahumada.  My favorite was the costilla ahumada.  It comes with sautéed green apples which complements the pork meat very well.I would definitely recommend Machete Tequila + Tacos for lunch, dinner, or just  drinks!"], ["Jennifer B.", "Wow. This place has impressed me. For a local, $4 taco joint, they know how to deliver a bang for your buck! This restaurant opened six weeks ago because a son wanted to honor how he and his father used to bond of tequila drinking fun in Mexico when he was younger. I love the story. And it's 100% Colorado owned! Even if the tequila ingredients are from Mexico. The menu was fantastic.  The Arta Tequila event was showcasing their tripled distilled tequila cocktails with the absolutely scrumptious tacos from their venue. Talk about the best of both worlds. The tequila expert and the chef prepared a tasting that was to die for. My favorite was the mouthwatering pairing of the Arta Reposado Cucumber / Grapefruit Mojasa with the Tacos de Tivuron and Tacos de Arrachera Com Chile Relleno. For those that don't speak Spanish, that translates to shark and beef with chile. These are custom made tacos with mixed drinks that are to die for. The drinks are more bitter that I typically like it and I can't help but admit that it's educating my pallet! These are great tacos. Of you're from Houston, they are even BETTER than Torchie's tacos and I know that's hard to believe. So be prepared for greatness and sit at the bar to learn more about the tequila you're drinking :)"], ["Melody F.", "By far the BEST taquieria I've been to in Denver.  I went with a couple of friends during happy hour and got 3 tacos: the rotisserie chicken, the steak and chorizo, and the regular steak taco.  Everything was delicious and the tacos were huge.  I was pretty much full after half of my meal but pushed to finish most of it.  The rotisserie chicken was my least favorite out of the three so I didn't feel so bad about not finishing all of that one.  Cannot wait to take my boyfriend back here very, very soon..."], ["Marlon B.", "The food here was really good, especially the odd hibiscus quesadilla.  What keeps me from returning is the prices.  This place is much too expensive.  $30 for 2 people for lunch is absurd.  I know this city is becoming more and more of a new LA or Bay Area...doesn't mean we have to pay like we are there.  Pretentiousness never works well at a restaurant...especially for real people like us."], ["Alan N.", "This place really sets the mood, we went for a late night dinner and I got the tacos with some sort of squid sauce, it was tangy but good and interesting. They also gave us a wide selection of salsa to try, I really liked that we had options. The waitress was nice and food came out fast. Recommend coming here to try their tacos."], ["Amanda M.", "Funky, fun, and tasty! Outside would've been a great spot but with our group of 6 on a short notice we sat inside. The menu was a bit difficult to read in the funky lights in the back, one of which was beaming in my face. Thankfully someone helps us move it so it was shining on their Tequila (and what-not) lockers instead. Sasha was a sweet and accommodating server, who didn't mind when I sent my Kona margarita back... it didn't really taste like coconut or pineapple all that much, more just sour mix and I opted for a beer instead. We ordered chips and guac, and had no shortage of the 4 yummy salsa option brought to us. Sasha even let us try some of the peanut and caramelized onion guac that we were to afraid to order. Though it wasn't bad, we were glad to have ordered the traditional instead.Onto the most important part-TACOS!!! I had the swordfish, the pulled pork and apple, and chicken and potato. Three was way more filling than I expected, but they were so good I had to stuff myself anyway. The pork/apple combo was a nice twist and my fave, definitely try that one!Nice music selection there too :)"]], "Las Tortas": [["Nick R.", "\"This is definitely five stars\" my wife said after a break in the prolonged silence caused by the deliciousness of her sandwich. \"Heck yea it is.\" I replied. This place is incredible. Some of the best sandwiches in Denver."], ["Tiffany N.", "Oh heavenly torta, where have you been all my life?!I've passed by Las Tortas for about four years and have had it bookmarked for almost that long. I've driven by and thought \"One of these days I'm gonna pop in\" but it never happened until yesterday. My friend and I wanted to grab a quick bite and she is pretty adventurous and trusting of my recommendations so we stopped by for lunch. It was noon and only one table was open so that was a positive sign that we chose right.You walk up to the counter, order then they call out your number. Even though I grew up in South Florida and took four years of spanish, I'm still not too confident of my spanish tongue so I tried to stick with a sandwich name that I could say without sounding like too much of a gringa, Lorena Herrera, you're easy to say so why not?Lorena kicks ass, thats it. The torta was absolutely delicious, packed with meat, cheese, tomato, avocado and onion. I added a little hot sauce and pickled jalapeños and those took it to a whole other level.I ate the whole thing, loved it and kinda wanted seconds. I almost went back for seconds......but the line was six people deep and now I know why, Las Tortas is the bomb! Do yourself a favor and come to Las Tortas....and grab a donut next-door afterwards!"], ["Abe R.", "This place is a hidden gem, wonderful tortas.  We had a steak torta and a chorizo torta. Our first visit was awesome, ordered to go and food was lights out wonderful.   I went back again a few days later and ordered to go - however this time it was not as good.I would caution that consistency is needed, but it's worth trying."], ["Bailey Z.", "After trying Las Tortas, if I had to choose between a panini and a torta, this Mexican sandwich would win every time. It's strange that having lived in San Diego for all these years, I always opted for the burrito over the torta. This might be a game-changer. After much hemming and hawing over the various meat combinations, I settled on the Norteña. This torta, nay, gourmet Mexican sandwich, was filled with steak milanesa (breaded meat), Mexican cheeses, avocado, grilled onions, tomatoes, and refried beans. The refried beans threw me off a bit and was something I probably could have done without, but I did ask for the works. The bread was perfectly grilled without having the sharp, crispy consistency of toasted panini that may at times cut your gums. You also get a grilled jalapeno that replaces your typical pickle. It wasn't too spicy if you forwent eating the seeds. No Mexican meal is complete without the addition of Mexican Coke, straight from the glass bottle, of course. Overall, it was a decently satisfying meal for a great price. Don't forget to check-in with Yelp to receive 10% off your meal."], ["Vy B.", "If you are trying Tortas for the first time, I highly suggest this as the place to introduce you to possibly the best sandwich ever invented. I had no idea what I was getting myself into when I randomly drove to this place after Yelp suggested it to me but boy am I glad I did! Definitely a mom and pop shop where locals clearly like to chill. You know it's gonna be a great experience when you look around and there are Ricky Martin videos playing on every screen in the restaurant. After possibly 10 minutes of being crazy confused looking at the menu, the guy at the counter laughed at me and told me to get the Norteña which is pretty much a steak torta with avocado, cheese, jalapeños, and a possibly eggs, I could not tell but each and every savory bite was delicious...so delicious that I honestly would fly back to Denver just for this Torta. If you are in the Denver area, you should definitely make this a pit stop for a quick/flavorful meal!"], ["Steve S.", "These are the real deal. Warm, fresh off the grill, and really tender meats. I got the \"Suiza\", which was chicken and ham, and my g/f got a beef one. She is from El Paso originally, and said these are as good as or better than the ones she used to get down there. The place was packed, with a steady stream of to-go orders also."], ["Morgan M.", "After reading the reviews for this place I was beyond excited to go but sadly it was a but of a disappointment. Don't get me wrong the total was pretty good but nothing to rave about. I think it really came down to both the meat and the bread being to dry. The flavors were there but they just didn't come out. My friend got the al pastor and said he only got two tiny pieces if pineapple. Since this place is so close I'm going to give it another chance but I won't be as excited about it."], ["Ophelia L.", "My bf and I stopped by here for lunch after the Cherry Creek Arts Festival. There was a Yelp discount going on here, yay! We got these:Norteña - \"steak, milanesa, and Mexican cheese PLUS all of their regular garnishes of refried beans, mayo, tomatoes, grilled onion, avocados, melted jack and chipotle sauce served warm grilled panini style\"Jalisco - \"chicken and steak with cheese, mayonnaise, tomatoes, refried beans, onion & spicy sauce on the delicious bread.\" It was my first time trying tortas so I didn't know what to expect. And I really liked it, especially the hot pressed bread... and the Nortena was just the common favorite among yelpers. The mayonnaise in the Jalisco was too much for my bf though, but fine for me. These were so filling that we both agreed that we should have just shared one torta instead."], ["Rhoda P.", "Excellent! The husband and kids had a steak torta and loved them. I had a chicken salad and wasn't disappointed. The dressing on the salad was great. It was spicy but I like it, so if not used to hot may want to ask for something else. This was the first time we were here but it won't be our last next time we are in Denver we will make sure to stop by again."], ["Jonathan R.", "Authentic flavors. Check Real Mexicans making your food. CheckReal Mexicans eating and drinking there. CheckReasonable pricing, reasonably clean. I went way out of my way to go check this place out, and I am pleased to report its good. Damn good. I had a torta ahogada, \"drowned sandwich\".If it was not the spiciest sandwich that has ever crossed my lips, then ill be dipped in dogsh*t. It was slap yo Mexican Mama hot. Took a full beer and 20 minutes to abate fully. Covered with a generous heap of pickled onions, and slathered all up in a chile de Arbol salsa- The bread had a great soft yet chewy texture, the carnitas were rockin. If you find yourself in Denver and need a torta, this is your place."], ["Ashley C.", "I am currently full and happy. Seriously lived up to what I was hoping for. I def want to come back again soon"], ["Annie G.", "Ah yes, my first time at Las Tortas was confusing to say the least. So wanted to share some wisdom with you all, now that I have been here a few more times. There are only tortas at Las Tortas. Go figure! Everything on the menu is different variations of tortas, Mexican-style sandwiches. This may seem obvious, as in the name. But I was confused and took it upon myself to ask the employee if there were any other items on the menu, in which he replied \"no, only tortas.\" Haha! So to save you the embarrassment, do not ask such silly things.So, a whole menu of tortas! How fantastic! Super juicy meats! But greasy, so if you are going to eat here, plan accordingly. Not a good day to wear skinny jeans or have any productivity after your meal. Food coma begins shortly after eating your first half of the sandwich (they cut them in half). So you either scarf down the second half quickly before falling into a deep slumber or you wrap it up and save it for tomorrow (which is probably the best bet, but too delicious to do)."], ["Jesse B.", "Las Tortas serves up some of the best tortas in Denver. They have multiple combinations and you can order to your liking as well.Parking is limited but usually not too hard to find a spot.Menu is in English and Spanish so you know they cater to a large number of Spanish speaking patrons.For drinks I really like the horchata (cinnamon rice milk) or fresh squeezed carrot orange juice. They do have other Mexican sodas and fountain drinks as well.My favorite torta is the Jalisco, which is chicken and steak with cheese, mayonnaise, tomatoes, refried beans, onion & spicy sauce on the delicious bread. All sandwiches come with a side of jalapeños."], ["Amy B.", "I had the Tejana. Super delicious. Friendly service. Clean spot, lots of seating. Extra parking behind the building."], ["Kyle S.", "Delicious! They use fresh ingredients, you can definitely tell. Never noticed this place, live 2 blocks away. Wish I did! Too bad I'm moving soon. Food was slightly more money than I thought at first, but 8.49 is about what you'll pay at any restaurant that is grab and go type of place. Really though, chipotle would be like 10 bucks. Decent portions, can eat a lot and was enough food for me. My sandwich was ready in 5 mins. Was expecting to have to wait longer than that. Staff seemed pretty friendly"], ["Katie K.", "I was brought here by a coworker. This place is tiny and doesn't look like much, but don't pass it!! I got the adobada Torta with everything on it. I like it was around $8. It was delicious!"], ["Matthew F.", "3.5The atmosphere is good.  It gets a little smoky at times since they have the panini presses outside of the ventilation system.  But the overall restaurant is clean.  Just be prepared to leave smelling like a bakery after your lunch.I gotta say, i had the Notena the first time I went about a month ago and was blown away by the quality and the taste.  Crispy bread on the outside, with a warm, tender and delicious inside.  I was blown away that a sandwich could taste so good.I had it about a week ago and it was just blehhh.  The bread was merely lightly toasted on the panini press, tomato and avocado seemed a bit old, and the meat wasn't as tender as last time.I can't vouch for anything else on the menu, but it all must be good.  This place is constantly packed around lunch."], ["Natalie P.", "OOOOO MMMMyyyyy Goooood these are amazing Tortas!!!!! So after a long wait at the Consulado de Mexico I searched nearby places and this place popped up.  My mom was a little hesitant, but I was like \"Mom they have really good yelp reviews\" So we made our way across the street! When I came in I asked what the MOST POPULAR TORTA was and they guy told me the NORTENA which has Steak, Milanesa, and Mexican Cheese ...so we proceeded to ordering one each ($8.32) and aguas de horchata ($2.50). So I was expecting plain jane tortas, but what I got was santa maria purisima tortas...I mean this ish was good, even my mom (who always cooks Mexican food) was impressed! And their horchata was also delicious, not watery, but just savory.Other Pluses:-Guys working here were supper nice and helpful. -The bathroom was nice and well kept.  -TV screens-Good music-Nice decorJust visit this place...you won't regret it!"], ["Jennifer M.", "I did not actually go inside, but waited on the bench in front with my dog while my husband ordered, so I can't speak to the service. All I know is that it took forever, but that's fine because my torta was magical. I ordered the hawaillana, which came with plenty of pineapple, thick slices of ham, avocado, and some kind of grilled cheese. Pretty sure I inhaled it in about 30 seconds. My husband ordered the Tejana, which had milanesa, pork chop and some other stuff on it. This torta was also delicious. I'm glad Las Tortas is clear on the other side of town from me, because I would be here way too often."], ["Cici T.", "Service freaking slow. They gave my order to the wrong person so I waited for almost an hour for take out. The food isn't bad but not that great. Depending on what you get, the Tortas can be pretty oily."], ["Diane T.", "Wow.  I hate to be the lone dissenter, but the torta I had here the other day was not very good.  It could have been, though.  I ordered the 'Nortena' which, if I remember correctly is milanesa (fried, breaded beef slice), beef of some variety and Mexican cheese.  I ordered it with everything, except mayo.  I don't remember the complete list of what 'everything' is, but it includes beans, onions, tomatoes, avocado. chipotle sauce, mayo, and maybe lettuce (although there was no lettuce on my torta).  This might have been a good sandwich except for the fact that it tasted like old, burnt food and grease.  Methinks the problems stems from their griddle which smelled like it wasn't being scraped down and cleaned often enough.  The meat on my sandwich that had been cooked on that griddle tasted like it smelled in there.  It did not make my day.  In addition, as one other reviewer noted about the smells clinging to him, I left reeking of that smell.  I had to change clothes when I got home.Based on the majority of reviews, I can only assume that I went on an off day, but I'm not sure I want to risk trying it again."], ["Logan T.", "Wow, so good. I have no experience with tortas and they helped me order something really good. Two somethings in fact. Nice, helpful folks behind the counter and 5 star quality food. So good."], ["Joseph L.", "OMG OMG OMG OMG OMG OMGIt's that good. Mexican coke and an ice cold air conditioner make this the best summer lunch spot ever."], ["Ryan P.", "Went in and asked for the their most popular Torta and got some kind of spicy beef with avocado and some other spicy stuff on it, this was sooo good!  Didn't try anything else, but will be back soon."], ["SnowChik B.", "Best Tortas in Denver! They pack it full of meat & delicious ingredients! Staff was courteous, They gave us great suggestions as first timers & they poured us a 2 for 1 crazy tasty margarita. Cute little place with nice decor & super tasty food! I will be back!"], ["Bruce D.", "The servings are huge. When you are hungry for meat, meat, and more meat, this satisfies. It's especially satisfying with a cold Mexican beer. The service was friendly and the atmosphere was fun. They cut these in half so take one half home. It reheats well in the oven."], ["O F.", "Found this place on yelp when we were in the area and we weren't disappointed. They really only have tortas so don't come here looking for burritos and tacos but don't shy away from a new experience. IT WAS AMAZING and we look forward to going there again.Ordered things off the simple menu (carnitas Torta al gusto) and it was decadent and delicious."], ["Riza H. C.", "Las Tortas what happened to you??  So sad to write this review with a 3 stars rating...Prior this visit, I made a phone call to Las Tortas saying that I am bringing a Party of 10.  Sunday November 17th 2013 brought like 9 other friends for our Meetup group.  Thankfully we managed to get some seats before the Lunch crowd came in.  Managed to be there before 12 noon.  The lovely staffs rearranged the chairs and tables for our group.Yes, you order from the Counter.  Yes, this establishment which I refer as a Mom & Pop shop is PORK Central.  So I choose to opt for the A La Carte.  For 3 items you pay $7.99.  From the list of items to be added if I could recall correctly were, Mayonaise, Cheese, Tomatoes, Onions, Avocado, Chipotle and Beans.As for me I opt to have Mayonnaise, Cheese, Tomatoes, Onions and Chipotle.  Don't fancy Avocado and Beans as much, so I ask the staff not to put those on my order of Tortas.So after waiting for like about 5 minutes or so, the staff told me they ran out of Beef Barbacoa.  What at NOON, you already ran out of Beef Barbacoa???  *Sad Face*  Man.... *SIGH*So since I already order and paid for 3 items, I ask for more Asada since the barbacoa was no longer available and Grilled Chicken and Fountain Soda ($2.31).  The Grilled Chicken was a little dry, hence my Tortas order was slightly disappointing.  Sorry Las Tortas, though you used to shine in my books, but this time around, it tends to be slightly gloomy in my sunshine books.  I am a little confused, maybe my order does not comes with Drinks.  Maybe I order comes with Drinks..  Hmmm..All in all it was A-Okay.  I missed the Beef Barbacoa though.  *Another Sad Face*  Some of my friends said the establishment is A-OKAY, some of my friends like what they ordered.  It was a success gathering, though I cannot deny I have to leave early from our group.  I was a little bumped to introduce Las Tortas to my friends, coz my friends who live in Loveland or even the one who live in Golden, went all their way to Las Tortas but Las Tortas expectation did not shine through..  *ANOTHER BIG SIGH*Do take note, when you order at the Counter OR before you leave the establishment, in case you want the list of items or the MENU, you can find it in both English and Spanish languages, that little YELLOW booklet for your references.@249/2013"], ["Rosa D.", "I had a wonderful experience at Las Tortas. Everything on the menu looked delicious, but I ended up going with the Nortena torta. It was a great decision! I also ordered a side of fries-they were huge-big enough for at least 3-4 people. I would highly recommend this place for anyone who is looking for an authentic experience."], ["Alejandra S.", "I am Mexican and the asada  torta I got was absolutely the best I've ever had.   Too bad I'm  only visiting the area,  otherwise I would definitely become a regular."], ["Renee B.", "It was wonderful.. The only thing is if you go during peek lunch hours, be prepared to wait.  IT IS worth the wait. It was fresh, soo good.  The meat was tender, moist. The alvacado was fresh, bread was toasted perfect. I will be back and can't wait, but it will not be during the busy lunch hours."], ["Jennifer B.", "We were looking for a fast lunch this past Sunday since the BF was working like a mad man but we still wanted to spend some time together for lunch.  I gave him the honor of choosing our lunch destination and Las Tortas was his choice, a place that's been on my list for while and is also being mentioned on the talk threads.  I was down, just call me the Sandwich Queen.A friend of mine told me that Mexican Tortas in CO are very hard to find.  We can stop holding our breath because I'm pretty sure I found one.  I've never been to Mexico but looking forward to crossing it off my list one day soon but I imagine the Torta is similar to the one I ate from Las Tortas.Here are all the ingredients in no particular order:Bread - Mexican Bread MayoBeansTomatoOnionFresh AvocadoCheeseChipotle sauceMeat or meats of choiceAll grilled Panini style and served with a side of pickled jalapenosI opted for the one with grilled chicken and pork and the BF ordered the pork and milanesa (breaded steak).  These sandwiches are the size of my head and definitely more than I can eat in one sitting without having a heart attack.  The BF thought I was joking when I was showing him the pictures on Yelp so he wanted to order two - I was right, when will he learn that I'm always right (LOL).  Both sandwiches were out of this word delicious and scrumptious.  The bread is perfect and you must order your sandwich with all the fillings or your not getting the full experience.  I would order some more jalapenos on the side, I like some spice in my life.The place is cute and in an unassuming strip mall.  Counter service here is very friendly and willing to work with you especially if you say it's your first time.  I love that I can watch the experts cooking and assembling my sandwich behind the counter.  Torta making is an art form.  Come on by and get a Torta to share, and wash it down with a Mexican soda and then if you have the energy go for a walk so you don't grow a torta tree in your stomach."], ["Dru D.", "Best Tortas in town- and I've tried many.  I love Mexican and I love Sandwiches- what's that?  You are going to combine the two?  Mind Blown!The place is authentic.  TV's in Spanish, staff mostly speaking in Spanish and many families eating and talking together in Spanish.  Don't worry though, they will take your Gringo order no problem and deliver you the tastiest Sammy.  The bread is the perfect combo of toasty outside, soft inside.  Toppings are unusual for a western deli- think beans, avocado, chipotle, skirt steak, egg etc.  But oh the flavor!  I usually go with the Nortena or La Macha- you will not be disappointed."], ["Matt C.", "Fantastic tortás. They give you jalapeños on the side so you can make them as spicy as you want. It comes with avocado and chipotle sauce, both of which are fantastic. I had a Runa con queso and it was fantastic. Looks like a hole in the wall but the tortás are fantastic."], ["Lauren J.", "This place is so great. Sadly I've not been in in too long.I love that they have horchata and beer.All the tortas I've had have been amazing except one that had hot dog in it which I was hoping would mirror a sonorian dog. It was still good, but not was I was hoping for.The staff has always been super friendly too."], ["Denver G.", "Love the sandwiches here!!!I discovered this place on Yelp. The place is small and located in a corner that is easily missed if you are driving north-west on Leetsdale.So far, I have tried the Mexican grilled cheese and the grilled chicken sandwiches. They are both awesome. I have been here thrice in the last one week. Will be back again many more times :)"], ["Vianca D.", "I tried the Francis, best torta EVER. It's like the tortas I've had in Guadalajara, MX but better!"], ["Lindsey K.", "I have to copy Tyler S., because he said what I was going to say but got to it first. I love Las Tortas! I first came here with Tyler and then again with Dale Z. and had an amazing meal both times. My particular favorite is a wet sandwich called the Ahogada Tradicional. It's large, so be prepared to dig in or ask for a box. I love the tangy sauce they pour over it and the marinated onions on top. YUM! Now, I don't ever buy chips myself, but I have been known to steal them from my fellow dining companions. I have tried three different non-english labeled varieties and all were unbelievably tasty. It was a total mouth fiesta! I can't tell you what they are called, but just start grabbing bags at the register like the end of days is near. Trust me, you will be happy you did---until swimsuit season rolls around."], ["David T.", "It's been far too long since I've had my torta fix here - more than 4 years.  That's really a shame but probably best they're not too close to me or I'd be there more often than I should be.  There is nothing that could be considered \"healthy\" or \"low cal\" about the food here.  I figure 1 per week = 10 lbs. per year.  But, tortas are a staple among the Mexican working class folk and they work hard so a good, filling torta keeps them going all day.  Today was a bit of a splurge but I savored every morsel spread over two meals.My favorite is still La Norteña - steak, milanesa, and Mexican cheese PLUS all of their regular garnishes of refried beans, mayo, tomatoes, grilled onion, avocados, melted jack and chipotle sauce served warm grilled panini style - $7.49 (price hasn't changed like every place else in town).  Get a side of the pickled jalapeños (free) to spice things up although the chipotle sauce packs a decent punch already.  Delish but there are many other house \"specialty\" tortas or build your own.  I recommend letting them build your torta though because they clearly understand which ingredients play well with others.Place is simple, staff is friendly, there's decent parking, easy to find on Leetsdale, why aren't you there?"], ["Skip C.", "Absolutely excellent food! They only seem to sell tortas (Mexican panini sandwiches, quesadillas and a salad. No burritos or tacos. This is a friendly and casual place at the end of an older strip mall. But, definitely worth the trip and older center. At their suggestion I had the Nortena. Fantastic. In the interests of \"sport eating\" I also, ordered the carnitas quesadilla, which comes with avocado and a small plastic ramekin of a really good and unique green sauce. Seriously, I've never tasted anything like it. I highly recommend this place."]], "Adelita's Cocina Y Cantina": [["Alice G.", "I've visited 5 times now, and this place is upgrading to Five stars!  Wow!  Always great, Adelita's has become our family's go to for Mexican!  Way to go!Where to start? First of all, when you walk in the restaurant it looks a bit more like a bar than a restaurant, but trust me, it is a restaurant!Okay and how cool are the menus? I am apparently easily impressed with gimmicks but the menus were printed on a scroll of  canvas. I thought they were cool, and huge!   About five pages of things to eat!We started with the house margaritas, rocks and salt, and Bam! They pack a punch right away. Very good- not too sweet.We tried the very popular sopas. They were tasty, but I was actually more impressed by the salsa and chips basket- the salsa is very flavorful, not too spicy, and the chips were fresh and delicious.For entrées, I tried the enchiladas and my friend tried the fajitas. We both went home with boxes.The enchiladas were gigantic and filled with loads of chicken and cheese...These are not little poor man's enchiladas.  I tried the green sauce and loved it.  They were served with rice, beans and a little bit of sour cream- Yum!The fajitas were amazing and huge, served on three platters of food. Three people could easily split these.There was no room for dessert. I will be back in a heartbeat and will continue to sample the margaritas as well as the menu. There's a lot to choose from here. And the waiters were also quite attentive!"], ["Thaddius B.", "This is just based on the dollar tacos...I have been wanting to come here for a while and stopped in for dollar tacos for lunch.  The place has a great vibe, don't really dig the scroll menus as they are difficult to read but the menu seemed pretty appealing as far as items I wanted to try.   We just got some chips and salsa and some tacos. The salsa really did not have much flavor.  Needed some salt, cilantro, more onion or something, it was fresh and that kept it from failing altogether. They do have a salsa sampler that I will try next time   I ordered 1 chicken, 1 pork, 1 steak and 1 shrimp taco.   They looked great when they came out and looked very appealing.  They were all just a dollar except the shrimp which they charge 4 dollars for.  The shrimp were very low quality frozen tiny shrimp the kind you get in a frozen bag at the grocery and although they had a lot of nice ingredients with them nothing could cover up the fact they are were pretty low quality, I would not get again.  The steak were simple and delicious, the chicken were pretty good too as were the pork.    Other food that was coming out of the kitchen  looked really good and I started to wish I had ordered something off the main menu.   I will definitely give this place another try as I feel the tacos are not totally representative of all their food."], ["DJ S.", "Carne Asada tacos are to die for.  The mole sauce is the best.  Great find on South Broadway."], ["Elizabeth G.", "The Mezcalita Margarita is ideal! A bit strong but packed with a smokey woodsey burnt flavor! Yum!"], ["Katie N.", "My favorite place for taco Tuesday! Haven't eaten here in the evening yet but if you're coming for lunch, be aware that there might be a wait on Tuesdays. The place fills up pretty fast. I'm yet to try anything else on the menu but I'll keep it in mind to come back for dinner sometime."], ["Renee B.", "This place has the best Tacos. They are like street tacos. I could describe them, but you just have to go and try them for yourself. We went there on Halloween and there were employee's dressed in costume. They were all so nice, and friendly. They gave the best suggestions.  I can not wait to go back. Ohhh, and did I mention that they serve breakfast all day !"], ["Sam F.", "Above average fresh mex place, caught a late lunch on a hot Saturday. Servings are ample, ingredients are fresh, service was thorough, drinks were tasty. Posole was tasty, my veggie gal really enjoyed her rellenos. Lots of veggie and GF options in the focused menu. House chips fried fresh, worth the pickup cost."], ["Tarena Z.", "This place is a great \"go to\" place for consistent delicious Mexican food. The Margaritas are delicious....and we tried quite a few. The crowd and vibe was very friendly and local.The food was pretty good....maybe a few issues, but overall good.The chips were a bit stale and the salsa could have had more flavor.There were bones in the fish tacos...yikes!The water was constantly full and we all drink a ton of water. The service was great...no complaints at all."], ["Kayla V.", "I came here for a weekday happy hour/dinner with a few of my friends. Monday is 2-4-1 margaritas, which is what we all needed. We ordered the chips and salsa sampler. The chips were good, the green guac stuff wasn't my favorite but the other salsas were alright. I ordered the carne asada tacos and a side of rice. The tacos were good, they seemed a little peppery but aside from that I was satisfied. The rice was really, really good. I don't know what they put in it, but I really liked it. I think all of my friends enjoyed their meals so we will definitely be coming back."], ["Chris H.", "I discovered this place through Yelp reviews. It is a very short drive from my house and I am thrilled that I discovered it. They have a fun menu. Yes they do charge for their chips and salsa...but in reality every place does. Some just build it into their food cost and some don't. Their chips and salsa were great. I also discovered Not Your Father's Root Beer when I was eating here and it has become my drink of choice."], ["Kimberly I.", "This place is top notch.  They go above and beyond with their humongous roll of a menu.  There are pages of options for you.  There is literally something for everyone!  They even have soyrizo... which I am assuming is vegetarian chorizo? There chips and salsa are so fresh and delightful.  Everything on the menu has a different sauce and you can choose to smother things from a list of 5 different sauces.  To be a real pain, we asked for a sample of each sauce on our first visit... and I can say I loved them all.  Their mole is my favorite.  It is not to heavy and has great flavor.  Their chili rellenos smothered in mole are a great choice.  It is a HUGE chili and it is so lightly battered.  You don't feel like you just ate mostly fried breading with a little bit of chili.  It is ALL chili. Their brunch is also fantastic.  $10 bottomless mimosas, awesome bloody marys, and if you are like me... you may order a chilada eventually and make it from brunch all the way to happy hour.  They also have brunch that is served all day every day, and are packed and giving amazing specials on taco Tuesday.There staff is good and their bartenders are good looking. You can't go wrong here."], ["Chandra M.", "LOVE this place! Luckily, it's also less than a block away.  Awesome sauces, drinks, enchiladas... you can't go wrong!"], ["Jayme M.", "The best house margaritas and tortilla soup !! In Denver and a friendly beautiful staff that will make you feel at home"], ["Nadia C.", "I wish I could give half stars... Anywhoodle. I was wary about this place. I'm very picky about my Mexican food as my familia is from Mexico. We ordered chips, salsa and queso. The salsa was fresh, not spicy but decent flavor. The queso had good flavor but was rubbery. I ordered the huevos rancheros, molè on the side. The molè was actually not bad. The flavor was not as complicated as exceptional molè but still impressive. Some molè can be bitter- this wasn't. Overall, this was not bad. I'll be back."], ["Tara B.", "The service was very pleasant and helpful. The tacos were very tasty. We also had this meat that was marinating in a clay pot that was out of this world. I wish I could remember the name of it. They serve it with corn or flour tortillas and it is meant for 2.  The guacamole is very tasty. The flautas were just okay. Hope to try a margarita next time as they also looked good."], ["Ali L.", "Went out with a girlfriend to celebrate an early birthday and the end of finals. We chose Adelita's simply because my friend has gotten it confused with Cocina on Alameda. We were however very impressed with the environment of the restaurant - very colorful, great ambiance for a mexican place!  We started with the skinny margaritas, which very surprisingly did not taste skinny - they were great! She had the veggie tacos and enjoyed them, while I ordered the enchiladas (you can mix and match the fillings, and choose between 4 sauces!). I don't usually like refried beans... too starchy at most places, but Adelita's were delicious and a great consistency. I'm also not typically a fan of rice, but theirs was fantastic.  The carne asada was a little dry, but the carnitas more than made up for it. Also, I loved that they used real crumbly queso fresco, rather than melted cheddar on top! My biggest complaint was that chips and salsa aren't automatically served at the table. We found out they were $2 each upon seeing the bill. $2 is no big deal, but I'm a believer in chips & salsa coming free at the table."], ["Robin B.", "At first this place hit an item on my \"pet peeve\" list- charging for chips and salsa.  We decided to order guacamole and chips to make it worth paying for chips.  And worth it it was- the guac was tasty with a nice little kick.  The salsa was more like a pico de gallo, very fresh and a good compliment to the guacamole and homemade thick chips.  My husband ordered the chicken mole and declared it one of the better moles he's taste in years.  Not too sweet but thick and very flavorful with a good balance of spices.  I enjoyed a mushroom stuffed relleno and vegetable tamale, both very delicious and the tamale wasn't dry as they sometimes can be.  I tried the green sauce on both which was good, next time I'll mix it up a bit and sample their other sauces.  Our first time here and we'll definitely be back."], ["Allie R.", "So glad my trusty yelp app lead to me Adelita's! It was pretty late \"for Denver\" around 9:30pm and I was craving a margarita and some mexican food. I had called a couple other places that were closed already, then I found Adelita's and they were open til 11pm on a Wednesday. Awesome. We walked in and there was only one other group of people eating, but there were 5-10 people at the bar. The restaurant has a more of a cozy modern mexican vibe to it which I liked a lot. Nice art on the walls and I always love exposed brick. Service was prompt and got my margarita out quickly while I was still looking over the menu trying to decide what I wanted. Boyfriend decided on a chicken burrito, and since it was kinda late I figured we could just split it. The burrito was huge, and our waiter suggested getting it smothered with their \"christmas sauce\" so we could try both the chile verde and chile rojo. The chile verde is not your typical green chile, it is made from tomatillos instead of your traditional hatch chili. It was great. It has a very different tangy flavor to it, its surprising at first but then grows on you. Our waiter (I wish I remembered his name) was great the whole time answering our questions and bringing everything out quickly. We will definitely be back to try more of their food items. They also have daily specials (like $2 tamales on Thursday's) and 2 daily happy hours :)"], ["Michael D.", "Went for happy hour on Monday and ended up eating. I'd recommend going for happy hour and grabbing an appetizer if you're hungry. House margaritas are great value- they put a good amount of booze in them- and are great for value, especially on Mondays (2 for 1)Guac was overpriced for the portion size, but had a nice flavor and mellow spice to itLengua taco was great- tender and excellent flavorAsada taco was a little dry and not too flavorful, but fine Al pastor was disappointing as most of the flavor came from the pineapple garnish and the meat was a little dry Chicken was great- very juicy and shredded instead of grilled. I'll be back, but probably more for the cocktails than the food"], ["Jennifer B.", "Adelita's checks off all the boxes for me on what I look for in a good Mexican place.  It's not often that I venture out for Mexican food, but when I do I want it to be flavorful and to satisfy my craving.    Service has been on point on both occasions.  Friendly staff with the willingness to provide recommendations when I'm being indecisive.  The place is upbeat and would be a great place to come and chill at the bar or sit in one of the large plush booths against the wall.  Chips and salsa is a staple at any Mexican place and is an excellent way to judge how tasty your food is going to be.  The salsa trio is large enough for a table of four but may be a little too big for a table of two.  Three salsas each with a different flavor and texture, the classic red salsa which is the mildest of the three with diced onions and tomato's, the tomatillo salsa with a bit more heat and has more of a blended texture, and then the avocado crema as silky as a chocolate mousse with just a hint of heat and vibrant green in color.  Each one was refreshing on its own, my favorite was following our servers suggestion and mixing the tomatillo and avocado crema for the perfect bite.  The Enchiladas Suizas is a popular choice here and is top notch.  The portions are on the larger size, you receive three Enchiladas with your choice of filling and yes you can mix and match.  Then you choose your sauce, I was a fan of the green Chile Verde however you can also choose the Mole if you desire.  The meats are tender and flavorful, and the Chile Verde adds a good tang to the entire dish.  I've also had the pleasure of having some taco's here and have to say the Camarones was my favorite, the shrimp were lightly grilled and then topped with a chipotle cream, cabbage, and sliced avocado - all my favorite things in one taco.  The Al Pastor and Carne Asada were delicious as well but the Camarones will stand as my favorite for now.Adelita's is where everything comes together in such a way there is only one way to leave - full and happy!"]], "100% de Agave": [["Miranda L.", "Delicious!We wondered into the restaurant at a whim and were not disappointed! We started with chips and salsa and were given an amazing mushroom salsa! I would keep coming back just for that!The Carne Asada was amazing, you get plenty of food for what you're paying. The food came out very quickly. We finished with fried ice cream and couldn't get enough! We will definitely be coming back!"], ["Shane A.", "Very cool decor!  I ordered the original margarita and it was superb. The fajitas are worth their weight in gold."], ["Denise S.", "Real authentic and very good Mexican food.  The dance club in the back is a little weird though..."], ["Crystal N.", "There are many things that make me drool in this place. The sights. The sights. The sounds. The sights. The tastes. I loved the spicy mango and spicy agave cocktails while my friends enjoyed the original margarita(s). All of our food came out hot and delicious after we snacked on flavorful and fresh fire roasted salsa with unique yummy nibbles on warm tortilla chips. I was impressed with the tender steak in my fajitas and the portion will last for three meals. Hot hot hot! Hot staff. Spicy drinks. Delish food. I'll be back! (Watch out!)"], ["Allie R.", "I live and work dangerously close to 100% de agave. So I find myself frequently eating there, it's only Wednesday and I've eaten there twice this week already :) I usually get my orders to go, so I can't comment much on their table service, but I always receive prompt and polite service when I pick up my order. I've tried a few things on the menu so far and my favorites are the steak burrito and the chicken salad. Both entrees are huge so prepare for some leftovers! Prices are maybe slightly more for your typical Mexican restaurant."], ["Max Y.", "Terrible food.  Went here based on reviews, completely disappointed.  I do not recommend at all."], ["Amber W.", "Absolutely everything was extremely bland. I will not be going back."], ["Suzi S.", "The only reason they don't get 5 stars is that I want to visit a second time to make sure the food was really that good!  Went for a work birthday lunch yesterday afternoon.  I had the Tampiquena - carne asada with a mole enchilada.  OMG.  I am generally not a huge mole lover, that enchilada was the best one I have had in many years!  The mole with the mexican cheese was not greasy at all.  Every bite was better than the last one.  The carne asada was also prepared perfectly.  The slaw that came with was EPIC.  It was cabbage and cactus and cilantro and lime and heaven.  The chips and salsa were delicious as well.  The rest of the food at the table looked (and reportedly was) very good.  Next time I go, I am taking my daughter and we are going to order Carne Molcajete Caliente - one of my friends had it and it was better than my food which is fairly unbelievable.  I had churro y chocolate for dessert and they were perfect.  The fried ice cream is covered in oatmeal granola instead of the usual cornflakes.I was a bit hesitant when we walked in and it felt trendy (beautiful decor) and wondered if good REAL Mexican could exist there.  It definitely did.  Service was great.  Tequila list was long.  I can't write anymore now.  It's making me hungry...I'll update at next visit."], ["Denise R.", "This is definitely a cool little spot they had karaoke also they were playing Mexican music people were dancing salsa and so on definitely a place to try out"], ["Sarah G.", "This place sucks. The high reviews are because of the discount they offer, don't trust it. My food was delivered in less than 5 minutes after ordering and was pretty gross. Salsa tastes like pace, service was shitty and the food was a one star."], ["Frederick K.", "Way overpriced. Had the Tierra del Mar which was skirt steak and shrimps. Skirt steak was no better than I could make at home in a frying pan and the shrimp was quite bland. $23 for the whole deal and it would have been too expensive at $15. We also tried the tortilla soup and if you can handle all the salt it was delicious.There's a great back bar and the servers are very kind but the lack of value and quality in the food will prevent me from returning anytime soon."], ["Jordan H.", "Some of the worst Mexican food that I've ever had. They are trying to portray an upscale Mexican restaurant, however the food is absolutely horrible, the service is below average, and the prices are pretty high for what you get. The margaritas that we ordered were very expensive, and lacking in alcohol/flavor. Our food came out and wasn't hot. The chicken was tough and overlooked. The beans were so salty that you couldn't even eat them. Overall the food was horrible. I've never had worse Mexican food in my life. Service was alright, nothing great. I do NOT recommend this place to anyone. Save your money and go somewhere else because 100% Agave is horrible. This place is likely to go out of business soon."], ["Amit K.", "The eggplant rellano dish was amazing! Amazing place for vegetarians!  Very nice ambience as well!"], ["Joshua F.", "I am a huge fan of this place. The food here is always extremely tasty (I love the mushroom salsa and the chicken flautas), the staff is friendly and speedy, and happy hour rocks my socks off. My one problem with them is a doozie, though.Apparently, Agave has some sort of policy that requires them to scour the globe for the hottest guys they can hire. This sounds good in theory, but my server just smiled at me, and I stopped breathing for a moment. If I'd choked on a chip, I could have died!...On the other hand, maybe he would have had to give me mouth-to-mouth. Yeah, it's worth it, so go to 100% de Agave."], ["Oscar S.", "Had a great experience   Food was great. Guacamole is the best and they make it right in front of you. The filet mignon special was outstanding. Our server Vanessa was the best. She went above and beyond to make sure we had our food the way we wanted. Kuddos."], ["Julie H.", "New fan of Guacamole and this place made it a new favorite! Very cool that they make it at your table, and the mushroom pico was a great surprise. Service was fast, pleasant and the food so fresh and fantastic!"], ["Devon D.", "This is a great little gem of a mexican restaurant, located right on Lincoln in the Beauvallon building, and yes, they validate parking!!! The decor is upscale and fun, the service has always been great(on the many times I've visited).  One item of note, the fajitas are MASSIVE, large enough that you can split it with a friend.  I've also tried the chicken salad, which I enjoyed, if you're feeling like some lighter fare.  All in all, a definite contribution to the neighborhood in a sea of 'meh' mexican restaurants.  If south of the border is to your liking, I would recommend you trying out 100% de Agave, it does not disappoint."], ["Nichelle F.", "Food ok...horrible service..the Manger was rude and condescending!! I will not come back! We had reservations and after we had sat at our table for an 1/2 hour they came and asked us to move for a larger party."], ["Jessie L.", "The chips were a bit stale but the salsa was good. They also give you a mushroom salsa which was interesting. I had the steak salad which was fine but pretty wet from the beans. Overall the food was fine but nothing to write home about."], ["Pamela R.", "If you enjoy getting charged for extra drinks, or even drinks that you never had, by mascara wearing bartender/owners then this is the place for you!  Additionally, if you are a \"gringo\",  you will be especially screwed. They make it clear that the white man is not welcome. Cheers!"], ["Jessy R.", "Came here for my friends bday and we loved it! I liked the ambience a lot our waiter was very fun and the food very yummy. We had the special which was a bit pricy for what they offered but it was very delicious. My son ate the \"campechana\". He loved it but it was a bit hot for him. He doesn't eat spicy at all. He really enjoyed the flavor, it was very well prepared. I also tried the jalapeño agave drink and was very pleased. Would totally recommend this place :)"], ["S C.", "Awful experience!I stopped in after happy hour with a few friends. As we walked in, we asked the hostess if there were any hightop tables near the bar available, she said no so we decided to check if there were any spots free at the bar. As we walked into the bar area, every hightop table was available and no one was sitting at the bar. Also, the bartenders are not knowledgeable of what is in their drinks. They were very rude.We will not be going back there. If you are looking for a good Mexican restaurant, try Machete in Cherry Creek."], ["Katie H.", "I'll start off with saying the food is great! Service is a little slow with food and drinks! If you don't speak up you won't get served. If you show up on a night that they are hosting the UFC fight be ready for a $10 per person cover charge that they won't tell you about until they are walking around with wrist bands. The owner or manager didn't want to let us stay after spending over $100 before the fights even started!! We had to negotiate for him to let us stay and he wouldn't refund our friends $20 that he charged after letting us know we could stay. It took about 20 minutes for him to come back and apologize for the miscommunication and let us know we could stay. As a business owner/manager I know you have expenses to cover but is $10 really worth a fight and loosing a customer? To them I guess it is!Come here for the tequila and that's about it!"], ["Scott B.", "Great margaritas, excellent appetizers. The service was fast and attentive we find s little hidden gem in Denver."], ["Joe M.", "I've walked or driven by this place dozens of times, but had the opportunity to have lunch there with my wife and a friend of ours. The food was delicious. Complimentary chips accompanied by a medium heat salsa and a mushroom salsa that was unlike anything I've ever had, and I mean that in a good way. My wife had the grilled chicken burrito, which was full of flavor and beautifully presented. She asked for the (excellent) green chile on the side and got a generous serving. Our friend had the chicken quesadilla which she was willing to offer us a bite of, and it was terrific. I had the grilled steak chimichanga. Lots of meat, a nice balance of rice and beans and more of that green chile.  Service was topnotch. Our waiter was attentive without being overbearing, very willing to talk about the menu, and very friendly and funny. There's an extensive list of tequilas ranging in price from the sublime ($5 a shot) to the ridiculous ($1,500 a bottle). The happy hour menu looked tempting.Add in free parking in the Beauvallon building where this place is located, some very nice decor and the fact that our friend picked up the check, and that was one fine lunch. We'll be back!"], ["Andrew L.", "Forget what you think about Denver not having any excellent, authentic Mexican restaurants, this place is the REAL DEAL!  They have everything I like in a restaurant, great ambiance, outstanding food quality, great service, extensive drink choices and last but certainly not least, very reasonable prices!  Wife and I had the Molcajete, think of spicy fajitas (consisting of super savory carnitas, chicken, chorizo and steak) simmering in a boiling hot volcanic stone bowl with jalepeno, cactus, authentic Mexican cheeses and veggies in a roasted chili sauce - a must try that will have you wanting to come back for more!  Best of all dinner for four including a top shelf tequila on the rocks - less than $50!!"], ["Jessica D.", "So I'm a bit late on offering up a review, but I have to after the continued excellent customer service I have received non-stop for the last year. I work in the neighborhood and some co-workers introduced me to 100% a year ago. I'm particular about Mexican food, there are few places I will go to let alone recommend to others. I was immediately impressed with the food presentation and the fact that the food was delicious, generous in portions and the price was more than reasonable for the quality of food received. I have frequented this restaurant numerous times for lunch, a few times for dinner, and take out and the food has been consistently great. The happy hour was great with 2-for-1 margaritas, but I really enjoy the mojitos. The table side guacamole is a crowd pleaser for sure, and so damn tasty! I like the break-out of the restaurant space; the front is open, comfortable and inviting. Roomy enough for big groups but also allows decent space between tables to have lunch meetings or personal conversations and not be distracted by the patrons at the table next to you.I like the touch of the open kitchen and tequila display. The bar at the back is fun, with a nice view at sunset and allows for small or big groups to hang out. Not to outshine the great the customer service, the staff is attentive, helpful and friendly.  I have held a company party in the restaurant bar area and my guests were truly impressed with the food, presentation and service. The owner and staff were flexible in allowing us to decorate, bring in specialty desserts and even helped some when we set up. My company staff has asked me a few times when would there be another party hosted there and I just the other day I was able to bring a little 100% de Agave to the office via catering. I was in a bind with less than a day to have catering in place for a large group meeting and Ric was kind enough to meet right after I called him, create a menu and have the food delivered less than 24 hours later to my office. It was a quiet meeting, since everyone was so intent on eating.They loved every bit of it from the guacamole and shrimp ceviche to the tacos de papas and empanadas de picadillo. We had so much that additional staff were able to sample the goods and now can't wait to try the restaurant. I can't say what dish I like best, I'm slowly making my way through the menu before I give a final opinion (but the torta de carnitas is amazing!). I look forward to the next visit or catering, this place is definitely at the top of my list of great Denver restaurants."], ["Kimberly S.", "We accidentally found 100% de Agave, and I am sooooooooooo glad we did!!!!This restaurant is conveniently located on the southwest corner of 10th and Lincoln. Try it, you will LOVE it!Interior - The interior is much larger inside than expected. When you enter, there is a separate waiting area, nicely separated from the rest of the dining room, yet still part of the restaurant.  Patrons in the restaurant don't have to feel \"rushed,\" as they won't see the other patrons waiting to be seated. I appreciated this. A separate waiting area is very nice to see in a restaurant.The interior of the restaurant is done in earth tones - browns, tans, blacks, oranges, reds. There is soft amber lighting, hanging from the black ceiling. The black ceiling makes the ceiling \"disappear.\" The floors are wooden.There are ten tables that seat two, approximately six tables that seat four, and 5 booths. There is a large \"community\" type bar table that seats approximately 18 people. This table has nice \"star\" lights above them. I liked them, very cute, subtle too. The lovely music playing in the background, is just loud enough to hear, but not too loud that you can't hear others in your dining party. Thank you for that! I'm getting older, and it's so nice to be able to hear those you are with.  Bar - The Bar area in the back, is quite a surprise! When you are in the restaurant, you are not aware of the bar area in the back, and vice versa. This area has five televisions, and plenty of seating for several large groups. In fact, there were several large groups there, as I took a look around. There are two oval tables, which comfortably seat six people, two large bar \"community\" tables, and other individual tables. Oh, the bar! The bar comfortably seats 18 people - no kidding!Food- Appetizers, Soups, Vegetarian, Pollo, Seafood, Salads, Desserts.The first night we split:a.   Pepes Street Tacos - carne asada, and pollo asado, with cilantro, onion, whole beans, and picante sauce. We enjoyed these, and just the right size too.  We will order these again. b.  Flautas de Pollo - three chicken flautas, mild salsa, queso, avocado, and black bean puree. These were good, but I'd order the tacos over these. I just liked the tacos, what can I say?c.  Soap de Tortilla - WOW!!!!  We only ordered a cup, but WOW, that cup was absolutely De-Lic-ious!  Homemade, and full of large chunks of chicken and veggies.     Simply YUMMY!!!!d.  Flan de Rompope - Good enough to split for two, if you need just a little bit of sweet goodness after your meal. The second night (the very next night, what can I say, I really liked it!):a.  We split the grilled chicken burrito - This was very good, and easily split between the two of us. Good, nicely done. We really enjoyed the green chili that topped the burrito, nice flavors!Drinks - full bar. My husband had the house margarita both nights. He said the margarita was not overly sweet, that you can taste the tequila, it had a nice bit to it. Chips and Salsa - you are brought chips and salsa when you first sit down. The chips are not too salty, which many can be. The salsa has a little bit of a \"kick.\" The other \"salsa\" that they bring out is what I really want to talk about here. It is chopped veggies, and Oh My Gosh! There are onions, cilantro, carrots, and few other things. WOW!!! YUMMY!!!  Please bring me a bowl of this! I don't know what it was about it, but I just absolutely LOVED it!!! L-O-V-E-D  IT!!Restrooms - beautiful, and clean! You MUST check out the restrooms. The old saying, \"if the bathrooms are clean, then the kitchen is too.\" Well, the kitchen must be spotless!!! Happy Hour - runs daily from 3pm - 6pm (double check their website, or give them a call). I told my co-workers about this restaurant, and I think we will be going there the next day or two, for lunch, and most likely, a Happy Hour too!Prices - very well priced, won't \"break the bank.\"Parking - street, or, get this, free parking in the garage! You can't beat that!So, do we like 100% de Agave?   You betcha!We have been there two nights in a row, and like I said, I believe my co-workers and I will be going for lunch in the next day or two as well. I'm Happy!LOVE  IT!!!! Can't wait to try more!!!!See you there!Update- We've been back several more times, 5 times now within 2 weeks, and we LOVE this place! I have also been there for lunch with 4 other co-workers! We will (most likely) have a Happy Hour (from work) here too! LOVE IT!"], ["Conrad S.", "The only reason this place didn't get 4 stars is because the food was just a little bit on the salty side. So if the owner/manager/ executive chef read this just go a little easier on the salt. The drinks are awesome. I got nice and toasty at lunch off some of their margaritas, the silver coin and a coronita. The drinks here are awesome and the tequila on the wall is cool too. Especially since the selection is just vast to say the least. Warning: the drinks are strong."], ["Denise S.", "Margaritas were outstanding!! Had the fajitas and they were also great and plentiful. We sat in the bar area was good and food came quickly."], ["Laura S.", "Sergio is the best server I have ever had! Extremely attentive, friendly and he also had great recommendations! We enjoyed some delicious questo fundido, steak and chicken fajitas and margaritas!!! I highly recommend!!! Ask to Sergio!"], ["Sherry S.", "Fun night good food and great margeritas"], ["Ryan M.", "I have seen this space turn over restaurants about 3-4 times since ive lived in Denver (7 years). I really hope this place makes it! I frequent this place on Tuesdays for Taco night. $2 tacos ($3 for fish/shrimp). The micheladas, though pricey ($9) are SO SO SO So good! They also do tableside guacamole. They make the spice level to your preference. I highly recommend this place!"], ["Mileena M.", "This place is beautiful! We came during the day, so it was pretty empty but the food is AMAZING. I ordered the shrimp ceviche and the flavor was perfectly tangy and didn't need any Tapatio and ketchup. Also, the sopapillas are fricken BOMB. It's a little pricey but totally worth it!"], ["Cori D.", "We love the mushroom salsa they bring out with chips. It I usually order the chicken salad. It is huge and has lots of delicious toppings! Tonight I decided to try the fajitas. They were incredible! Well worth $18"], ["Tracy B.", "Service was incredible, and the food was very high quality and flavorful. Such an affordable meal too! We wandered in here after walking down Broadway looking for a place to eat and were not at all disappointed! I'm still thinking about their quesadillas almost a week later! Those mushroom spices they bring out with the chips and salsa is amazing. Highly recommended to anyone in the area!"], ["Maria G.", "Delicious and great service! We had a combination with a tamale and crispy relleno, the Tampiqueno, a burrito, and a kid sized taco. All wonderfully tasty. La Colorado Margarita was great and dessert too! Will be back."], ["Chris H.", "A lot of people seem to really love the chips and salsa here...but while I really liked the chips, the salsa wasn't my taste. My wife commented on the weakness of the drinks. I had a Long Island Iced Tea and I would have to agree that it was not as strong as what I usually get. The best thing about this place is the free parking and that the atmosphere is nice."], ["Sean K.", "I'm a foodie (omnivore) and LOVED this place.  My wife has a more pedestrian palate and is a vegetarian - she LOVED this place.  My thirteen month-old son LOVED this place.So what's to love?  Great food to start with (nuanced, balanced, creative and nothing \"smothered\")!  The service was flawless, warm and attentive without being underfoot.  One of the owners, Rick, overheard our query about the availability of chocolate milk (which we figured was a long shot) and went in the back and made some that was so tasty that I finished my baby's bottle once he had had his fill.This place tries hard and the attention to detail is obvious.  But the talent in the kitchen is undeniable.What I can't figure out is why this place has been open for two years and we were able to walk in without reservations.  Whatever the reason, this is a new favorite and I would urge you to try it."], ["Kendrick W.", "Very good food. Our server, Sergio, was very attentive and made great recommendations. They bring two complimentary salsas with chips - one is a mushroom salsa... It's delicious - and I hate mushrooms!"]], "Tarasco's New Latino Cuisine": [], "Los Chingones": [["Jasmine C.", "Love, love, love this place!  I've had every taco on the menu!  I highly recommend the beef cheek, octopus, and lamb tacos.  Never pass up the wild card, either!  Last time I went, I had the empanadas--so effing good.  I always start with the salsa flight--each salsa is tasty.  My hands down favorite thing they serve is the michelada.  The best I've had in Denver!  Try it next time you go!"], ["pinche d.", "To speak in NFL terms, Los Chingones failed the piss test and are suspended from my rotations of places we'd recommended or visit. We're not talking long term suspension here since I'm willing to give it another try but not anytime soon. Being from Austin and Mexicano, I've had my share of tacos and always look forward to new places here in Denver. When you visit a place called \"The Bad Asses or Tough SOBs\", you expect something with strong flavors and a hearty meal.PROS: The restaurant was super clean and well laid outGreat Patio with music (Live Music too on some days/nights)Food is earthy spicy (Some people may not like this) CONS:The meat is dry (old?) with various tacos we triedService is friendly but the waiter never came around when we needed him No Kids menu or kid friendly options SUGGESTIONS: Serve up limes with the tacos since the acidity brings out the taste in the meatTres Pig Nachos - Less Chorizo - I'm not sure anyone's gut can take that much greasy meatEducate the runners - We saw our food make the rounds to 3-4 different patio tables before the waiter pointed him in the right directionHad our waiter been around more, we would have ordered / spent more - We looked up 4-5 times hoping out waiter would be around but he was just busy"], ["Brenda L.", "The environment is cool (I think this is what chingone means in Spanish- it's so cool that there is no labeled sign outside the restaurant-just a snake looking symbol....soon all restaurants will have no sign & we'll just be guessing on the restaurant we are reviewing). There's an indoor & outdoor area & the entire place is pretty dimly lit with some modern wall art/graffiti-looking mural & painted concrete blocks as table legs. The taco selection offers a variety of very enticing & fun combos & ingredients but 1/2 of them did not deliver. The wildcard taco was an Indian inspired one with vindaloo marinated meat but this was the blandest taco I tried (of the 4 I tasted). It was extremely lacking in flavor & tasted more like plain yogurt sauce than anything you'd associate with Indian food. The chips for the chips & salsa & in the $12 nachos are extremely salty. The michelada, which I know is a lime-based drink, was overly sour (& I love sour stuff! In fact, I had just come back from drinking sour beers @ Crooked Staves before this meal). The fried shrimp taco with pickled vegetables on top was my favorite taco. It packed some heat & acidity & was full of flavor without being salty. The pork shoulder taco also had great flavor but less pizazz when compared with the shrimp. The octopus was also great (not chewy!) & had some shredded fish (bonito flakes? I'm not sure) that gave the taco a very seafood-ish flavor that I really enjoyed. The waiter didn't know what the agua fresca was for the day but I ordered it anyway. It was refreshing & not too sweet but I still do not know what flavor it was. It was mostly ice & I finished it in 4 large sips thus contributing to my 3 star A-OK review. If you're dining outside, don't be surprised if an occasional bum passes by asking for some change for a burrito."], ["Valery L.", "This area just keeps getting better, and Los Chingones (especially the roof top patio) are right in the heart of it all! We tried the salsa sampler, and they were all amazing. Most notable were the pineapple salsa and the mango habanero (it really is effing HOT though, be careful!). The Queso dip with the veggies was great, the tacos were great ($2 during happy hour), and the fried Anaheim Relleno was good except for the very in-your-face goat cheese taste (make sure you LOVE goat cheese if you try it). The drinks were impeccable and so creative. Luckily there were three of us so we could try a huge variety of them! The T&T (Tang, Tequila, & Orange Soda) was my favorite, but the Urban Legend (it contains Pop Rocks!) was a close second! Will definitely return!"], ["S B.", "We took a friend there and we were not disappointed at all. The crispy chile relleno and taquitos were spot on! Great vibe on the roof top. Not the first time we've been here and won't be the last."], ["Allie R.", "Came on opening day for the Rox. Los C's was hopping but it seems like a normal thing here. Margarita was extremely over priced and all ice :( I didn't try any of the tacos, because honestly none of them sounded remotely appetizing. They are trying to be cutting edge, but I like a normal taco. K? Thanks. Chili relleno was extremely average.Overall if I want tacos I would rather go to a more authentic Mexican restaurant. Definitely did not live up to the hype for me. Will not be returning."], ["Michael C.", "Everything is good and different.I had the chicken taco and beef taco.  They were ok to good.The queso is different and good.Honestly, I would come here if I lived in the neighborhood but is does not warrant an20 minute drive.I think Margs and Machte are both."], ["Sam D.", "25 min wait on a Friday night. The tacos tasted very good and the price was right. Also had good drinks"], ["Angel B.", "Hands downOne of the best brunches I've been to in the area! The French Toast churros are to die for. I sat on the roof top the weather was amazing and the dj was on point!!!"], ["Paul A.", "Yeah, this place is completely awesome. Every Yelper that is like \"this is my favorite neighborhood restaurant\" definitely knows what's up, because this place greatly surpassed my expectations in pretty much every way.The restaurant has a really breezy, open decor, with long common tables and big windows. When you step in here you can tell everyone is having fun and all the waiters seem psyched to be working in such an enjoyable spot.The food, though, is why I am giving this place 5 stars. The tacos I tried here were just really, really superb. The chicken leg taco here was probably the best chicken-based taco I have ever had anywhere. The chicken skin in it and the tongue-in-cheek addition of Sun Chips just really put it over the edge.The octopus taco was probably my second favorite but it was astoundingly delicious and absolutely packed with meat. The pork shoulder taco, which was incredibly flavorful, and the very rich shrimp taco were also very good. The Brussels Sprouts were sour and sweet and spicy and just really delicious. They were deep fried and covered in this addictive orange sauce. Definitely give them a try.Anyway, I just really enjoyed myself here and I hope to come back again someday. Maybe I'll be all old and gray and I will sit down slowly with tears in my eyes and order four servings of the chicken taco."], ["Shea W.", "I couldn't live without Chingones. I've been many times and tried many things. Every morsel has been exceptional.The tacos tip to the expensive side for my taste but I can live with it for how delish they are. You also have to pay for chips and salsa which is my least favorite thing of all time but this place is fantastic.First of all, the atmosphere is *kisses fingertips like an Italiano* perfect. Cute waiters dancing around and bringing you tacos. I'm not joking, they dance and sing. It just looks like working there would be THE most fun.Food: everything is excellent. Crazy tacos, incredible nachos and brunch food to die for. Breakfast Chilequiles are like Breakfast nachos, just so ya'll know. Chicken and waffles taco is also on the menu so good luck choosing.Margs are great too: short (I prefer tequila always tall) but that's ok."], ["Stephanie G.", "So dirty!!  Used napkins and food on the floor.  Gross and disgusting!!  Tacos were cold, tortillas were soggy and drinks were late. Try Uno Mas on Pearl. Mucho better!!"], ["Lauren J.", "My hubs and I took shelter here because we'd never been and it was pouring... We ended up getting brunch. The drinks were delicious! I initially got a mimosa which paled in comparison to my hubs tequila moscow mule type drink, which I subsequently ordered.My husband got the egg bake, which was a healthy option. I was surprised he ordered it, heh. I got the chicken chilaquiles. If I hadn't eaten so many chips before hand, I might have eaten more of them with my brunch, but it was all delicious regardless.Our waiter Andrew was awesome."], ["Daniel B.", "Happy hour for the tacos is a great deal and very worth it ... the octopus tacos, shrimp, fried cheese, bison tartar, lamb, and the list goes on ... they were all very very good!"], ["Rachel S.", "My favorite tacos in all the land! The cotija tacos are hands down something I get every time I come here, and something I can't make at home. Also their nachos are amaze-balls, I'm vegetarian so order without the pig ears, but the queso is soooo good!"], ["Sara L.", "This place is fantastic and the service is unbeatable. The menu had so many good things, it was hard to decide on what to get. Definitely going to come back and explore the menu more. We sat upstairs on the outside covered patio and had a great time. Our server was named Becca and she did an excellent job attending to all of our requests in a timely and effective manner. She even helped us decide on what delicious drinks to try - the beer/margarita combo is a super special treat for a hot afternoon."], ["Emma W.", "This place is hopping! Its the place to be! Great people watching... it was so busy I chose to sit at the bar and what a treat that was...The hustle and bustle of watching all the chefs prepare all the food. I swear I was drooling watching it all happen.  I got to see everything before i ordered!This place has great tacos! And you don't need many to become full. I had three: the special which was buffalo with blue cheese, shredded pork, and beef. There are so many other choices on the menu too. Also try the guac, was good and they give you a decent chop basket and salsa.I also saw them making amazing looking salads, nachos, more tacos and more tacos... suffice it to say, they are awesome quick and I had my food before I could blink... The decor is fun and bathrooms nice... definitely a place to hang out."], ["Brittany S.", "Queso, tacos, ceviche, Brussel sprouts are all excellent choices. Love the salsa sampler too. They have so many fun and different tacos to choose from. The chicken, beef, pork and veggie tacos are all really yummy. Happy hour is great here too. Drink specials for happy hour usually include a special drink del dia. It's a fun environment to sit on the rooftop with friends and enjoy the day. They used to have a DJ on the rooftop on the weekends. I guess they stopped doing that recently, which is too bad. Background music is still good."], ["Jacob E.", "Garbage.  The salsa is bland and lacks any flavor. It classic Mexican American fusion place that adds pineapple and sugar to all there food.  Trust me it's no good."], ["Lee F.", "The place can get pretty busy during the weekend. It is small plate gourmet tacos that are delicious. The chicken and shrimp tacos were really good.I did not think I would get filled up by these tiny tacos, but I did. The Cucumber Mojito was refreshing too.The service was pleasant and attentive. A cool place to checkout while visiting Denver."]], "Socorro's": [], "D'Corazon": [["Jessica C.", "Service was good, but the food is spectacular. Authentic and fresh. I was visiting from out of town and heard this place was good, and I will DEFINITELY come back again."], ["Abby G.", "The food is amaZing especially the steak fajitas. Prices are pretty decent. Good location, Margs are also delicious. Only problem: service. You can sit at the table for about 10+ minutes before someone even walks over to help you. Also making you feel like a burden for asking for something extra."], ["Janine H.", "These guys cook something extremely delicious at that place:) And they do it for really cheap price too. But it does not effect the quality of their products,  salsa is always fresh:)))Try their margaritas!!!!  Just gorgeous...."], ["Rebecca S.", "I love this place! I could eat here everyday... Sometimes I actually do. Really great authentic Mexican food for great prices. Oh and their margaritas- will knock your socks off! (There is a limit of three to four depending on which one you choose). The staff is all so friendly and welcoming. They have been said to be the best Mexican food in LoDo... I can't disagree!"], ["Jinyen Y.", "This is so crazy good. I yelp-ed this place after my coworkers and I decided to head out for lunch rather than stay in the office. It had the best reviews and thank you, fellow Yelp-ers, you did not disappoint! Yes, the line looks intimidating at first, but as long as you are not in a ridiculously large group (8 people), then the wait is only 15 minutes for 4 people during peak period. Entering the restaurant, you immediately know that this is THE place. Every seat was filled, there was loud chatter everywhere and sure it felt noisy, but it reminds me of home where everyone is so excited to see each other. I ordered a Fajita Burrito (tax + tip + meal = $11) and it was so delicious. The awesome thing about it was the spicy kick it had. Similar to the salsa and chips they serve on the table that also had some spice to it, this burrito was also the right amount of spicy. Maybe it was because I haven't had spicy food since I got to Colorado, but tears came to my eyes. My coworker ordered a Carnitas plate and he was also seriously in love with it. (And he has high standards for Mexican food)I am sure I will visit this place more often in spite of the slow service. However, I am not sure what to order next time...everything just sounds delicious... YUM"], ["Symon R.", "The perfect balance of fresh high quality ingredients and  traditional feel good cooking techniques. Outstanding food, great prices and service. I highly recommend this place. Good news: I HEARD THEY ARE GOING TO START DELIVERING"], ["Timothy B.", "They said the Carnitas were the best on town, I haven't had Carnitas anywhere else in Denver but these were very very good!The margaritas said they are \"knockout\" and you are limited to 4 and they did hit the spot.  Outstanding !!"], ["Erin W.", "My friends and family have been coming to the downtown location for years and just can't get enough if it.  I'm always sad it's closed on Sundays.  The Margs are great.  All of them.  The green chili is the best so order so order at least one item with it to dip the rest.  The guacamole is incredible.  Salsa is spicy greatness.  We moved away a few years ago and just went back last week to visit and D'Corazon was our FIRST stop and our last before we left.  If I could have bottled up the green chili to take on the plane, I would have.  Go early to avoid the line.  I always order al a carte there to get exactly the combo I want. And it's inexpensive compared to all other Mexican food, period.  This is traditional Mexican and not Tex Mex.  portions are big so bring a friend and try not to fill up in the chips."], ["Alex R.", "Best carnitas best refried beans and best crispy rellenos! I love almost everything they have here. Best authentic mexican restaurant downtown!I work downtown and I go here often. The service is amazing! The food is great! So affordable! And they are super fast! The owner is amazing! My job was doing a fundraiser last year and he gave us the most generous donation! As a mexican who loves food. I highly recommend this place!"], ["Casey E.", "I love this place. I ate there the first day they opened. Just by chance. I've been going back ever since. The margaritas are a highlight. Cheap and stiff. The perfect place to grab a bite before a Nuggets, Avs, or Rockies game. The west location is great too the few times I ate there. My favorite meals are the carnitas and the huevos chorizo. The salsa is smoky and spicy and delicious and the green chili never disappoints. The service is typically fast and efficient in a casual way."], ["Jon G.", "Let's just say that I don't go to any other Mexican restaurant because I would feel that I'm cheating. This place is awesome. The staff is amazing and most of all Ramona is the best- she makes us want to come in once a week! The chimmy is the go-to dish as I haven't ventured from it in 2 years. The margs are amazing (catch happy hour if you can) and the salsa is SPICY so bring your big girl panties! Everything rocks and it's inexpensive. You are dumb not to!"], ["Shea S.", "\"Hey. Yeah you. Have you ever hoped for a teleportation machine? They've got one over at this Mexican restaurant off Blake Street. Why they chose there as the first place to...Why are you looking at me like I'm crazy? I stepped into the door and BAM...I'm in San Antonio. The decor, the music, the free salsa and chips with a kick, the service...where else would I be? It wasn't Denver.\"At least that's how I felt when I ate at D'Corazon. I haven't had that feeling since moving to Denver, and it felt good. Classic Mexican dishes on the menu, mariachi music playing over the speakers, bold warm colors...I fully expected to exit the restaurant into the warm hot SA air.I was promptly seated and served free chips and salsa that had tons of flavor with great kick and a hint of citrus - by far my favorite in Denver so far. The waitress suggested the carnitas, and I was not disappointed. The pork was very flavorful and was fantastic in this ranchero-style sauce it came with. Wasn't quite as tender as I hoped, but still really good. The guac that came with it was delicious and much appreciated. The rice was standard Spanish-style rice, and the refried beans a bit bland but good nonetheless. It was a ton of food, all tasty, and pretty darn affordable especially since this place is right in the thick of things on Blake.Although it wasn't quite to the level of some of my favorite places in San Antonio, this place definitely gives me that feel. I can't wait to come back and try some other dishes."], ["Mac R.", "so yummy !!! Mole is soooo amazing"], ["Kathryn T.", "The food is definitely good for your average Americanized Mexican food (that is to say, I enjoy it immensely). What really makes this place awesome is their margarita special. It's either all the time or only during certain happy hours, but their regular margarita is $4, good, and STRONG."], ["Laura W.", "The best shredded beef in town! And the pork is amazing.  Avoid lunch time, though, as there is always a wait.  But the wait is worth it!"], ["Tina C.", "This place is a gem, with good strong margarita and spicy salsa.  I also love their burrito and chimichaga, lots of  flavor.  Check out their happy hours for margarita."], ["Emilee M.", "Took forever to get the food, service was  good, food was amazing... but food tasted fresh. Ate it all on 420"], ["Blake H.", "D'Corazon is a decent lunch place but cannot be called the \"best Mexican food in LoDo, period\" as their advertisements state.  First, the chips are overcooked.  I get that crispy chips is the goal but not at the expense of flavor.  Second, the food is, unfortunately, nothing special.  I ordered enchaladas with rice and beans and ended up disappointed with the experience.  There are 20-30 Mexican restaurants in Denver that serve similar food.  Nothing set this place apart.I will say that their refried beans were a pleasant surprise.  Overall, it is a decent option for a Mexican craving if you are in the area."], ["James W.", "Best Mexican in LoDo! Everything on the menu is outstanding.Margaritas are strong and delicious.The salsa should be right up there with the best of Denver.The green chili is perfect and the food it smothers is second to none."], ["Anna A.", "I did my research for good Mexican while I was visiting Denver. Over and over I heard that   D'Corazon has the best carnitas. Up until that point I had never tried carnitas but I figured this would be the place to try. Oh, Wow. I have yet to find carnitas in Salt Lake that measure up! The meat was so tender and the sauce was perfect. The corn tortillas were fresh and delicious. The staff was very friendly and were very attentive to us. I even accidentally dropped some tortillas on the ground and without missing a beat they quickly rushed me out some hot and fresh ones."]], "El Chingon Mexican Bistro": [], "Tacos Tequila Whiskey": [["Andrew T.", "My wife and I go here when we want some tasty food and can't think of anywhere that we want to try. I guess you could say that it's our go-to dinner and drinks spot. Try the Lengua, the pork belly and the quest a la plancha. The only dong I have is that the food comes out too quickly. Sometimes you just want the experience to last a little longer. But, hey, thats a little weird to complain about."], ["Keara F.", "The tacos here are overpriced & kind of mediocre. But honestly, the service is atrocious. Our servers were taking shots behind the bar while on the job, one had her hair touching the food & had dirt in her fingernails, and in general had a bad attitude. One server brought us a cocktail that we didn't order, and when we told her she takes it away and goes \"Oops, I'll drink it.\" and then tried to charge us for it anyway. It was also pretty gross to see her count her tip in front of us.Take your money somewhere else. Not worth it to be treated like you're in a high school cafeteria."], ["David A.", "I love the people here. And it doesn't matter who. The host, the waiter, even the sweet lady that pours me water- they're all genuinely nice and amazingly attentive. Drinks....awesome. Especially the pinche Paloma. If you don't show up in the right mood, a couple of those will fix you right up. The tacos....like nothing I've ever had. You go about your day while these guys sit around stewing and marinating delicious meats. Just long enough that by the time you get here, they can pile it high on a chewy tortilla and top it all with some beautifully crafted veggie or sauce that'll brilliantly compliment whichever meat it arrives with. Current favorites:Pollo Molcajete -   grilled, smoky, tangy Lengua             -    crispy, rich, spicyPollo Agave      -    rich, sweet, crunchyCustomer service that never quits, an atmosphere second to none, and food that blows my mind. Five stars I say!"], ["R. Tony S.", "Highly recommended! Why am I so late to trying this incredible establishment?! The plethora of mini-taco offerings are incredible and the fresh tastes just unfold in your mouth... The space itself is equally as fresh and cool.... Hope this place keeps its coolness and freshness!"], ["Adriana C.", "Wow it only took me like 3 years to finally check this place out Lol I'm really on top of things! Rolled through on Thursday with 4 friends. We enjoyed: the queso served on a skillet with warm (!!!!) tortilla chips, 2 servings of the guac(strong lime flavor which I love), margaritas, and about 10 tacos with fish, carnitas, chicken, mushroom(obviously for my vegetarian friend. Why are we friends again? Jk) and lengua. I thought everything was great with really unique flavors. The restaurant is small but it's cozy and decorated really cute. The staff was friendly and helpful and one of the bartenders hooked us up with some fruity tequila shots. That is truly the way to my heart pumping with ancient Aztec Mexican blood. It's a day later and I'm still thinking about this place because I really want to go back already! I see why people rave about this place. Good food, good vibes, good drinks! PS- Other reviews mention this, but the tacos come chock full of fillings, so it's smart to use the extra tortilla to make a second taco. BAM! Extra tacos, you're welcome planet earth!!!"], ["Brittney C.", "I thought this place was called Pinche's? Why couldn't I find that when I checked in? I guess it doesn't matter cuz the food was the bomb. I had heard about this place for several months and I am so happy I finally was able to try it on Sunday. I ordered the carnitas taco and the asada. The carnitas tacos was soooooooooooooooo good. I loved the flavor of the pickled cabbage and pork in my mouth. It was spot on. I didn't care as much for the asada taco. I've had better asada tacos at different places. I do want to try the shrimp and scallop one when I go back. The table next to us ordered that and it looked delicious. The prices really weren't that bad, especially for the quality of food you get. We ordered the brussell sprouts appetizer and it was delicious too. I do wish the space was bigger. I liked the  more intimate feel of having a smaller place, but since the place is so busy, it would've been nice to not have to wait due to spacing. I have a new love for street tacos and they variety of flavors \"Pinche's\" brings. I can't wait to go back."], ["Rachel J.", "The place is pretty small but there is indoor and outdoor seating. The worse part is they won't seat you until your WHOLE party is there. As in not majority but every single person. I guess there is a happy hour that ends at 6 that has pretty good deals too. I would recommend that you try the queso (they have a few different kinds). My friend is making me mention that the tray they serve the queso on is hot because she touched it and it burnt her finger. Happy now Megan?!?! They have a big list of tacos and you mark how many of each you want. They then bring them all out on a big tray. Overall really good food and fun atmosphere. Paris the bartender makes some wicked good drinks too."], ["Brenda L.", "I didn't expect a 20 minute wait on a Monday night but I soon realized that the crowd was due to Monday's all-day happy hour. For happy hour they have discounted appetizers and small bites as well as cocktails but the tacos are not included in the happy hour pricing. I came for the tacos (they ranged from $3.50-$4.50) & I was able to try 4:1. lengua: Triple-cooked Colorado beef tongue-served crispy, avocado, diced onion & cilantro, roasted tomatillo salsa, guajillo honey mayo2. pescado: Chipotle & beer battered fish, slaw, avocado & pineapple guacamole, pickled red onions, lime3. taco estilo abril:Griddled cotija cheese, roasted chile poblano, creamed chipotle corn, sour cream (reminded me of elotes)4. shrimp & scallop xnic pec: Pan roasted shrimp & scallops, yucatan pico de gallo, avocado crema, limeMy favorite by far was the lengua. The flavor was on point & the tongue was tender & flavorful. I liked the abril as well but thought texturally it wasn't as interesting since everything was pretty much liquidy or soft. The pescado was fun & colorful with bright pink pickled onions that were more sour than I expected. I got a limeade soda cocktail for $3 from the cocktail menu & thought it was delicious! For folks who like to feel their alcohol but not taste it, this is the cocktail for you! I could definitely drink more of these based on flavor but the alcohol does kick in a bit later. The ambience here is fun, dim, relatively modern, hip & loud. There is outdoor seating as well with some outdoor lighting. Inside they have a little wall cubby area where you can take photos (by the bathroom). This place is synonymous with Pinche Tacos (taco truck). All the workers will be wearing Pinche Taco shirts & the walls will have the word pinche on it everywhere so don't get confused!  This is 1 of their 2 locations in Denver. There's limited parking so street parking might be necessary. I was too full to try their churros but it looked delicious (& is the only dessert item they offer). The price is higher than what you're used to paying for a street taco (especially if you're someone like me who's used to buying Mexican street tacos @ the flea market in San Jose for $2) but the creative menu & variety of taco options makes it worth it. I don't get why the most expensive taco on the menu is the vegan gluten free 1. Our waitress wasn't particularly friendly (didn't smile or greet us) but the hostess was super friendly which made up for our bored/disinterested waitress."], ["Jessica H.", "I went to Pinche last Friday for happy hour. We were told the wait was 30 minutes and we almost went next door (didn't want to miss happy hour!), but then the hostess mentioned there was a community table available and that she may have to seat someone else next to us at some point. Perfect.I ordered the Pinche Paloma, which was a nice alcoholic grapefruit refresher. It tasted great and it was only $4 on the happy hour menu. For food, we had the chorizo deviled eggs. They were super good- a bit spicy and pretty innovative. I also had 2 tacos. The lamb taco and beer battered fish tacos. The lamb taco was out of this world (I love lamb and it was super tender and tasty). The beer battered fish tacos were decent, but nothing amazing. I would definitely go back to order the lamb and maybe the beef tongue or something of the like (or maybe just all lamb tacos :) ). Atmosphere-wise, Pinche has a nice patio, along with cool decorations inside the restaurant (Day of the Dead skulls, etc). All in all, I enjoyed the happy hour and food and would return!"], ["Jason C.", "I Love Pinche Tacos!!  Before this mighty establishment became \"Tacos, Tequila & Whiskey\" I followed the food truck around town from one farmers market to the next just to get these Amazing tacos.  Today for my birthday I had the luck of making it in and tasting some classy bourbon and some of my favorites, the planche queso taco and the carnitas are a standard that I can't get enough of.  I always try something different and this time fried chicken with slaw and it was spectacular!  Thank you Pinche Tacos!!"], ["Mark J.", "Came here for lunch after trying the one on 32nd St.The value was definitely not there when not not eating at happy hour prices.The shrimp taco consisted of three tine shrimp and a boatload of pico making it more vegetarian than seafood. The Asada on the other hand had great flavor albeit overpriced considering that it was minuscule."], ["E W.", "Very tasty!!! I ordered the Pollo Agave, Carnitas, Pescado and Asada. The Pollo Agave was off the chain!!! By far my favorite. Then Asada and Carnitas.  The Pescado was...no Bueno.  It just had a funky flavor. Overall this joint is definitely worth it!"], ["Sasha L.", "I came here last Friday with some besties and had an awesome time! When we got here around dinnertime, it was packed, the place is also smaller than I had imagined. There is no waiting area, and it is a little awkward holding a giant silver rod with a zebra card on the top of it (this is what you get when you put your name on the waiting list). I highly recommend they get a pager system instead, when my friends met up with me, their first reaction was, \"what is that giant silver stick you're holding?\"We were seated fairly quickly, although had to wait until my friends showed up. Our server greeted us quickly, we started with the queso, which was amazing! We already had drinks, so she tried to take our drink menu, we were like, \"Noooo!\" I had the Pollo in Crema taco, outstanding, also the lengua, amazing, and the special, so good! My friends loved their food too, although did not love the seafood tacos, they were too spicy and were unexpect. Our server asked if we wanted dessert and we said no, she tried to take the drink menu again, \"Nooo!\" We ordered one more round of drinks and continued to catch up before we headed out for the night.I love the tacos here! Cool atmosphere and friendly staff. Please just get pagers and stop trying to take away our drink menu!"], ["Lauren B.", "Pinche, I just can't give you five stars due to the limited space and huge crowds you draw.  I realize the flip side: you're keeping yourself in business.  But as a patron who raves to anyone who'll listen about your life-changing tacos (keep your mind out of the gutter), I certainly wish I  didn't have to wait an hour and a half to bask in your goodness.Though the space is tight at this location (plan on waiting outside for your table if the bar is full, as there is hardly room for the wait staff to maneuver around tables and bodies waiting for tables), the menu is well crafted and beautifully executed.  Having tried the chorizo cheese dip (thanks to the husband), I can tell you it's greasy and delicious.  Is it worth it?  Meh.  I would rather have another taco.  BUT, the guac/salsas with chips?  Now those are worth it.  A crisp, clean start to your meal.The tacos are spendy.  These aren't cheap street taco options.  Plan on eating between 2 (if you're a REALLY light eater) to 5 (if you want to leave stuffed to the extreme).  My personal faves:  the pork belly, carnitas, and the camaron a la parilla (grilled shrimp).  Polla a la crema is also worth a try if you're a fan of the chicken.  One fine evening, the group I was with decided to branch out and order the churros con chocolate for dessert.  Well worth it, if you still have the room.  They are nice and crispy on the outside, still doughy on the inside, and are a perfect end to the evening.In terms of drinks, you can't go wrong with their margs.  Personally, I go with the Pinche Paloma--their spin on a traditional tequila/grapefruit combo."], ["Jason C.", "I came here for dinner. The place was super busy from their happy hour. It was from 3-6pm (a bit earlier than I'm used to), so I completely missed happy hour. That didn't stop me from trying some fun things, as the hostess was able to find me a single seat amidst some larger parties. My server, Jennah, was super attentive, friendly, and quick.The house margarita was excellent and a great value. I don't like my margaritas too sweet, and they were more than accommodating about lightening up on the simple syrup. The tacos were amazing! I had the shrimp and scallop xinic-pec, hontigo, and the pork belly agridulce. My favorites were the hontigo and the pork belly. The hontigo had a great blend of mushrooms that had a delightful chew to them making every bite an umami explosion. The pork belly was very unique in that it was braised in a sweet and sour sauce. The skin had a nice crisp to it, and the cabbage helped to balance out the sweetness with more acidity. Overall, everything I had was great!  I would definitely recommend stopping by if you get the chance!"], ["JT T.", "Second stop on the gringo taco tour.  I ordered the pork belly taco because it looked awesome and it's pork belly.  Seemed like a no brainer.  It was quite disappointing though.  It wasn't as flavorful as I was hoping.  And it lacked the crispiness on the outside.  Total miss for me.I was told I should've ordered something with the fried cheese.  I did like the patio and I could definitely see some daytime boozing action there."], ["Jason S.", "This place is awesome! It's in a great area of Denver just east of downtown. Street parking was relatively easy to find (even on a Saturday night). Place is small and packed but the wait wasn't long and it was worth it! They have a great drink selection including local craft beers. The tacos are delicious and there are several veggie options! 2-3 tacos will fill you up. The fundido cheese is very FUN indeed. And don't forget to finish the meal with some churros!!! The service was spot-on (my water glass was ALWAYS full). For such a hip and happening place the prices were very reasonable. Anytime I'm back in Denver I'll be sure to visit! This place is a hit!"], ["Leslie T.", "Expect a wait...we were told 20 minutes but it was much quicker. Expect some terrific tacos - order by checking them on a menu and handing it to your waiter. Expect it to be loud - the noise level was almost too much for these middle aged ears. Expect some terrific drinks - I had two lovely pours of anejo tequilas. These are street tacos. Not the crispy taco shells you may be used to. The lengua has become one of my favorite meats for tacos. It is usually soft and tender meats. This was cooked very well and the honey mayo - which kinda scared me when I saw it listed on the taco - was delish! The crispy pork was my 2nd choice. The pickled red onions have become a craving for me lately and these were as good as any I ever had.The service was terrific. We had two or three waiters popping by all the time to check on us. The hostess checked on us a couple times too. The tables are pretty well packed in. So be aware you may be dining with other people that you didn't come in with. Our water glasses were never empty and our food came out quickly.This would soooo be a 5 star place if we could have heard ourselves think. I know, it's picky but it's part of the dining experience to be able to hear the conversation at the table.Dog friendly patio. Big tables at the bar that you can grab a seat at without having to wait for a table."], ["Emily M.", "Absolutely delicious. We went here the 2nd to last day of our trip, and it was so good that we had to come back before we left.  The guacamole is insane - best I've ever had out.  I tried all of the veggie tacos and the mahi mahi fish taco.  The tacos with grilled cotija cheese are crazy good, especially the one with the grilled poblano peppers and cheesy corn sauce.My husband tried most of the tacos with meat, including a special lamb meatball and the pork belly. He said everything was delicious.Great price for the best tacos I've ever had."], ["Jenna N.", "Disclaimer:  You must be willing to endure a long wait in a hot, sweaty, crowded, tight space before dining.But, once they finally call you for a table, you're golden.Tacos Tequila Whiskey (also called Pinche) has crafted an above average menu of very different, yet all very delicious tacos (and more.)  I've never eaten anything other than the tacos here, and don't see any reason why I'd change now- they are mouthwatering good and popping with flavor.My favorites are the Pollo Agave (Agave dipped fried chicken with slaw + chimichurri) and the Pork Belly.  Tacos range from about 3-4 bucks a pop.  I always have about 3 of 'em, which is perfect for an average appetite.  They pair perfectly with a margarita, or two, or three..."], ["Inayah V.", "Do not be discouraged by the wait, this is a sure bet! After three unsuccessful attempts to try Pinche out, my husband and I were finally able to get in! As the sign by the door says, Quien sabe comer, sabe esperar. The wait will definitely test your patience, but your tenacity will be rewarded.Space is at an absolute premium here! When you're able to wade through the throngs of yet to be seated customers, they give you a card with a letter on it (we had K) and a drink menu. There are only a few tables, which had been occupied by large groups, so we took a bar seat when it finally became available. Although this place is small, it makes up for it with plenty of style. I love all the exposed brick, the sliding ladder at the bar, and copper tiled columns. The bar had several creatively named drinks, but really, the food is AMAZING! They have you mark off your selections on a reusable menu (very clever). You have several options for tacos as well as freshly made chips, guacamole, a variety of salsas or if you're really treating yourself, queso fundido. I don't remember which 3 I randomly ordered, but they were all delicious! I was satisfied with that, but my husband said he could have done 2 more.  The chips are hot and perfectly salted. The guacamole comes topped with fresh tomatoes, and is great as well.It's going to be difficult, but if at all possible try to save room for dessert. We shared a half order of warm, melt-in-your-mouth churros complete with mild but creamy dipping chocolate. If I've had better I don't know when!"], ["Katie K.", "I wanted to try a new taco place and found this place. They hand you a menu and a wet erase pen. You write down a number next to each taco for hoe many you want. Based on the reviews from other Yelpers, I ordered the pork belly and the tongue. I also ordered the shrimp and scallop.The pork belly: I have never had pork belly before this taco. It was sweet and moist. The garlic that came with it was cooked perfectly. I did destroy the cute presentation so that I could eat it like a taco. It came with a sauce that you could pour over it. I'm not sure it added any flavor. This one was my favorite. The tongue: I wish I had tasted more tongue. I feel like it was drowned in sauce. It was still good, I just wanted more meat! It was crispy and the sauces were delicious. This one was messy because of all the sauce. The shrimp and scallop: the shrimp and scallop were cooked perfectly. I think it was an avocado sauce on top. It was very good as well. This was was the easiest to eat like a taco but I wanted more pork belly! This one was my second favorite."], ["Mark W.", "Pinche Taqueria (or Tacos Tequila Whiskey) has an awesome Monday night happy hour-- it lasts all night long and includes $4 margaritas and a couple apps.We had a 45 minute wait, but were well entertained with the cheap drink specials and had plenty of room on the stoop outside the restaurant. Parking was a bit tight as they only have 1 very small lot. I was pleased with the number of vegetarian tacos and tried all 3! It was a bit confusing when they came out because the entire table's tacos were all on one plate. The tacos were GREAT though. The hongos was my favorite by far and the Vegan 1949 was quite spicy.We didn't stop with tacos and also ordered the churros, which were AMAZING. I didn't love the sauce that came with them (was it chocolate?).I would go back, especially for the Monday happy hour situation."], ["Steve O.", "I'm not really sure why I haven't reviewed this place. Since my girlfriend and I started coming here almost a year ago (moved in from MA last October), we've been coming here frequently. Sometimes three times a week. We're getting a reputation. We're probably missing out on other amazing places this city has to offer, but we're not quite tired of this place yet.I'm going to try to keep the review short and sweet. Happy Hour is 3-6 everyday and all day Monday and is your best friend. The happy hour nachos are a must, as well as the house margarita and the pinche sodas. All the tacos are great... anything with the griddled cotija cheese is pretty much euphoric. The Hongos is my personal favorite followed by the Cordero. The only taco I think is whack is the Camaron a la Parilla - the shrimp are tiny. If there's a taco special, get after it. It's usually only on the menu for one day/night.Parking lot is tiny. Park on York, Colfax or one of the side streets. If you're coming in with more than two people, you're probably going to have a wait. The bar and high tops are first come/first serve. The bartenders are great and hilarious. They know how to make a drink. The wait staff are great too even when it's super busy. They are like ninjas coming out of nowhere to fill your water glass, but they'll end up spilling a little water on the table. It's not a big deal. Any rating here less than five stars should be considered a crime."], ["Nadine S.", "Tacos are ordered sushi-style by checking your selections from a list. They are served on a single plate as they become ready.  The vegetarian taco and the asada taco were excellent. he pescado taco was a bit odd with the combination of slaw and pickled onions. The fish was very heavily batter-fried and of questionable quality. Fresh chips accompanied a nice selection of salsas. Guacamole was fresh and tasty, but skip the pineapple guacamole. Best churros I've ever had (and I've spent time in Spain and Mexico). This place is fun and delicious. Indoor and outdoor seating."], ["Claire C.", "This is such a hotspot for happy hour! I came here twice for it and the food was great both times. The restaurant is always crowded with a long wait but we quickly snatched up a spot at the bar. Ordered the chips and 3 different kinds of salsa to start and we were served with a full bag of chips. The shrimp slider was just a tad too heavy but not terrible considering the price. The Paloma was so refreshing and just what I needed on a summer night. The Mahi Mahi taco was really good! It was kind of loud there and hard to hear the other person talking unless you're sitting next to each other. I'd come back anytime for their street tacos!"], ["Cathy T.", "The staff was friendly and attentive, despite how busy this place can be. My husband and I ordered carnitas tacos, pollo malcajete tacos and langua tacos. We both loved the pollo malcajete and lengua tacos the best!"], ["Steven B.", "Have you ever been to El Paso Texas?  I have and from there you can throw a stick and hit Mexico.  The entire town is blanketed with Taqueria staffed by our friends from south of the boarder.  Tacos there are Mexican style which means they are cheap and small with just meat and onion and cilantro.  God bless America because we like our tacos filled with STUFF!If you like American style tacos it doesn't get much better than this.  I'm a carnivore so I designed my Meatlovers Delight!* Asada- Citrus marinated skirt steak, avocado, diced onion, cilantro, cotija cheese and lime for $3.75.* Carnitas- Crispy roasted pork, pickled red onions and avocado crema for $3.50.* Barbacoa- Slow roasted shredded beef, salsa salpicon and sour cream for $3.50.For about $10 this vegetarian's nightmare was amazing.  Each taco was a blend of flavors that melded perfectly! They serve their tacos with doubled here which is the only way to go.Speaking of vegetarians, there are plenty of choices for these folks.  Keep in mind that you will be asked to sit in a separate room way in the back.  Just kidding!Nothing goes better with tacos than a great marg and mine was very good.  There are also plenty of other adult libations including of course beer. Throughout our meal our waiter was excellent so customer service was never a problem.I was visiting from Philadelphia and if these folks opened there I'd probably move in!"], ["Vilma S.", "OMG! How in the Hell have I not come here before!! What a great place to get street tacos, antojitos and more at a great price with awesome service and a great ambiance.Came here with my sister after her colonoscopy because she had a craving for street tacos. I was like okay, but definitely changed my mind as soon as I took a bite out of the Chipotle Deviled Eggs! We got there as soon as Happy Hour started (3-6pm). Ordered the guacamole, nachos, sliders and then the guy at the next table said we needed to try the lengua taco and the tostada de la temporada. Flavor explosion in my mouth!! We then tried the queso a la plancha and that was also very yummy.Prices are very inexpensive and they have a free small parking lot on the side. I will definitely be coming back again!!"], ["Melissa C.", "This was the second stop on our gringo taco tour. I was initially excited by the menu options, and opted for the pork belly taco and the carnitas taco. The pork belly LOOKED amazing, but was lacking in flavor (really, how can pork belly be bland?). The carnitas was meh. I did appreciate the nice outside seating, and the service was very good. I would come back to try some of the other offerings, but would pick other taco places first."], ["Paul W.", "I give out very few 5 star reviews, but if I could give 6, I would.  Service was +A, cleanliness was +A, and food was +A. On the flip side, parking sucks, but I won't let that affect my review. We parked across the street and walked 200 yds.  Onto the review. Very cool set-up inside the restaurant - plenty of seating and nicely decorated. The music was either a bit too loud, or I am getting a bit too old.  Plenty of elbow room and the restrooms were clean. The server greeted us promptly, gave us water, took our drink order, and explained how the menu works.  It is a Sushi style ordering system, which was really cool.  You can actually order any number of different combinations and number of tacos. Each taco is smaller than say Taco Bell, about 4 - 5 bites each.  Keep your fork handy, it will be needed for the overflow. I ordered 5 tacos, chips, and 3 different types of dip. All 3 were amazing and flavorful. The tacos were one of the best damn things I have eaten in a long time.  Flavor explosion is the best way to describe the experience. BTW, our visit was on a Wednesday @ 12:30p.  It was busy, but not packed. My soda never dropped below half way, our waitress checked to see if everything was okay several times, and the prices were reasonable. I cannot wait to go back, so impressed!"], ["Beth C.", "I'm High Priestess of Churromancy for the Holy Taco Church (yes, really) and came into Denver for a book event. The Tacopope lives in the Denver vicinity. It was only right that we meet. He reached out to Twitter for recommendations for the best taco joints, and Pinche Taqueria was advised by many.The location is cool--a suave brick building--though the parking lot was itty bitty. We sat outside on the patio. The service was excellent. It was happy hour and we both had and enjoyed their casa margaritas. Their chips and guac appetizer was good--very light, crisp, chips. I selected three tacos: lengua, pork belly, and hongo (mushrooms). They were street taco size corn tortillas, doubled, but they piled HUGE amounts of filling. The lengua was good--nice mix of flavors. The pork belly had a big square of meat that easily split into layers for easier eating. The mushroom taco was good. The mushrooms had a great meaty consistency and I liked that it was smaller than the other two, as I was getting full. These were not the best tacos I have ever had but they were darned good.However, we had to finish things off with the churros. Wow! They deep fry these babies. I bit in and it was like cinnamon and sugar-flavored air. The pastry was like light and lush. They served them with a cute mug filled with Mexican chocolate sauce that included cinnamon."], ["Carmen R.", "Delicious tacos!! My favorites were the carnitas and carne asada. These are not traditional street tacos, but I can appreciate a well made and flavorful taco. These are so tasty!!!We came during happy hour, 3-6, and enjoyed the house margarita. Great tasting with a nice pour of the tequila!Even though I can't handle much heat (spicy), I appreciate that some salsas are actually spicy, but remain flavorful. They mostly sell tacos with some appetizers. The style of ordering reminded me of placing an order for sushi.  If I recall correctly each taco price is about 3.50-4.00. Each had a good portion of meat. The service was great and ambiance was modern, trendy, and clean. The place is small but had no problem being seated at the time we came.Can't wait to come back, especially during happy hour for the margarita!"], ["Cody Y.", "Despite the long lines and the cramped interior, Pinche Taqueria delivers on providing some of the best tacos you'll ever eat.Mexican food for me is very hit or miss - it's either really good or tasteless and terrible. So when my Denver friends recommended this place to me and my girlfriend, I was a bit skeptical. My skepticism was buoyed somewhat due to the long lines and the nearly hour wait - we came at 8:30 pm on a Saturday night, and the place was packed. It's a really small dimly lit restaurant with community seating and a very attractive outside seating arrangement. While waiting, we were able to try some of the margaritas from the bar - they were very strong and tasted mostly of tequila (not a complaint, and on an empty stomach that could get dangerous quickly). We were seated at one of the community tables. We were warmly greeted by a very friendly (to the point of it being too much) waiter who joked with us and was very attentive. You order the tacos by marking how many you want of each one on the menu, which the waiter takes back to the kitchen. It's ingenious and I don't know why more Mexican restaurants don't try this ordering method. We started with the Queso Fundido con Chorizo appetizer, which was melted pepper jack cheese and Chorizo with some homemade chips. Although you don't get a lot of cheese it's still quite good, and the chips are served hot and greasy. Next came the tacos, which range in price from $3.25-4.50, which may seem steep but you get a lot of taco for that price (an order of 2-3 tacos per person is more than enough for most people). Between the four of us we ordered a ton, so I'll highlight my favorites:1. Vegan 1944 (Sautéed spinach, roasted chile poblano, corn, salsa abuela, avocado, pico de gallo):  I'm not a vegan but this was so tasty I may become one. ($4.50)2. Carnitas: (Crispy roasted pork, pickled red onions, avocado crema): Hey remember when I said I'm considering going vegan? I take it all back. ($3.50)3. Pescado (Chipotle & beer battered fish, slaw, avocado & pineapple guacamole, pickled red onions, lime): Big chunk of fish and sweet guacamole. ($3.75)4. Hongos (Grilled shitaki, crimini & oyster mushrooms, griddled cotija cheese, creamed cilantro corn, ancho chili crema): My favorite of the bunch. I'm a huge fan of grilled mushrooms. ($3.75)Pinche Taqueria makes some of the best Mexican food I have ever had. Run, don't walk, to this restaurant...preferable before peak times to avoid the large crowds and long wait."], ["Lauren H.", "My husband and I really like Mexican food, and after searching Yelp, we found this place and decided to head here for lunch.We were at the restaurant around 12:30 on a weekday and we didn't have to wait for a table. The place is small, so I could see it getting crowded quickly on a night or anytime on a weekend.We started with an order of the chips and salsa, it comes with three different salsas (you pick three from a list of around 7) and fresh chips. Our server offered us some recommendations. I don't remember the names of the three we chose, but one was a spicy pico de gallo, one was a green salsa and the other was a smoky red salsa. We both liked the smoky red salsa the best. This was a great way to start the meal.We each ordered two tacos. They give you a menu and a dry erase marker and you make your selections straight on the menu. We ordered two pork belly tacos, one lengua and an asada. My favorite as well as my husband's favorite was the pork belly, it was very moist and flavorful. The asada was good too, especially because of the avocado on top.The tacos range from about $2.50 to $4.50 each, a little on the expensive side for tacos, but these are fancy tacos with fresh ingredients, so I thought the prices were pretty fair.Good experience, next time I'd order three tacos since they aren't too big, and I would definitely return again (especially for that pork belly!)"], ["Alisha K.", "I love this local street taco taqueria! Definitely start with the guac and chips you won't be disappointed- everything is made from scratch and is delicious. I absolutely love their Mahi Mahi, camarones a la parilla and carnitas. The pickled red onion that tops the carnitas makes the taco phenomenal. They also have a kickass house margarita! Don't leave without trying the churros- the spicy chocolate dipping sauce will change your life! The only downsides to the York location is the restaurant is small so expect at least a 30-60 minute wait even during the week and sometimes the music is too loud to hold a conversation, so I wouldn't recommend it for a first date place. The service is always friendly!"], ["C S.", "Gorgeous fun service by the excellent staff, and after the service,  I love their michelada's, serrano margarita and their tacos!  You can't go wrong with anything here.  Both locations are legit!"], ["Tricia D.", "We got there early and waited only about 10 minutes and we were able to eat outside and avoid the noise inside!  The margaritas were terrific (we didn't know it was ladies night at first and enjoyed them all the more!)3 to 5 tacos (small round non-fried) make a great meal.  They have combinations I have not seen anywhere before.  From two types of shrimp, carnita, steak, fried chicken to mushroom (just a few examples).  Try the salsa's as well. We had a radish salsa which I so want the recipe for!!!  The corn chips were served warm and in a brown paper bag - so cute.We didn't leave without having some  fabulous churros for dessert.  They were light and served with a lovely chocolate dip.The service was also very friendly and helpful in getting through the menu (you check off what you want as a group) and making sure we had everything we needed through out the meal.  Even though it is very busy - they did not rush us at all.  I can't wait to go back and try more items from their menu."], ["Sally H.", "I was hearing good things about this place and I was dying DYING to try it.  It turns out, it is located around the corner from my previous work place.  I cannot believe I use to drive pass it for the past two years.  The sign to it is very small and can obviously be missed.  The place is very small as well, but they do offer a few dining seats outside which is nice.My boyfriend and I came here on a Monday night and luckily for us, we caught them during their happy hour.  Happy hour for them is nightly from 3 to 6 pm and all night long on Mondays.  I love happy hour!!  Unfortunately, their happy hour menu is very limited.  Normally, I go crazy on happy hour specials, but there wasn't a lot that I wanted to try; just ended up ordering the chipotle deviled eggs and the victory club nachos.  From the regular menu, we ordered à la carte cordero, mahi mahi, asada, pork belly, and shrimp & scallop tacos.  We also had the churros for dessert.My favorite taco was the cordero taco which was made with braised lamb shank and a corn, cheese & cilantro salsa.  It was an explosion of flavors in my mouth.  It is also one of the more pricey taco, but so worth it.  Second runner up is the shrimp & scallop taco.  The shrimp and scallop were perfectly grilled; it had a nice crisp to it.  The other tacos were okay.  The pork belly taco, in which they are known for,  was a bit too tangy for me and I am not a big fan of eating chunks of fat.  As far as the happy hour specials, the deviled eggs were alright; nothing special.  However, we did enjoy the victory nachos.  The house-made chips for the nachos were prefect, the pico de gallo was fresh, and it had a generous serving of barbacoa meat on top.  The churros looked good, but was actually pretty plain.  Even with the mexican chocolate dipping sauce, the churros wasn't sweet enough for me.Overall, there were more items that was just okay than spectacular.  I definitely think I over hyped myself for this place.  My boyfriend thinks we can get better and cheaper street tacos elsewhere.  However, service was good and it is a nice, upbeat place to hang out with your friends and maybe have some tequila & whiskey."], ["Justin W.", "What sets this hidden place apart is probably the in house made ingredients. Bloody Mary's - check. Margaritas - check. One sip of the Bloody Mary and you'll be ruined forever. No zing zang in this place. This is truly a foodies find. The tacos are small but packed full of punch. Two will probably suit the bill. The place is small and there's almost always a slight wait but your stomach will be rewarded by flavor explosion. Say it with me - FLAVOR EXPLOSION.  You did it pinche - down to the name. Most Americans don't even know what they're saying. But we do pinche. We are the elite, the proud, the strong ...foodies. Thank you for you F'n amazing tacos and margaritas."]], "Las Margs": [], "Tacos Acapulco": [], "La Fuente Restaurant": []}