{"Neighbors": [["Susie M.", "Great neighborhood spot!  This is just the kind of spot that Denver needs more of, great casual neighborhood hang out.  The owners are really nice, and I'm always up for supporting a mom & pop shop.  Great place to unwind with a glass of wine and some cheese.  The wine selection is well thought out, with some interesting selections.  This is a great block in Park Hill with plenty of parking.  I hope the locals get out and support this great addition to the neighborhood."], ["Christy C.", "Great place.  Friendly.  Just what we need"], ["Cassandra C.", "My husband and I came here excited for a great little neighborhood place to visit frequently.  We came looking for a couple glasses of wine and snacks.  We had 2 glasses of wine each, a couple snacks,( olives,  ceviche, and we split a turkey panini.)  The panini was boring, nothing special about it , we actually didn't finish it. and were handed a bill for $100.  Not worth the money, lower the prices or serve better food.  There are a lot of good places to choose from, hopefully Neighbors figures out how to be one of them.  I really want to support the locals."], ["jessy s.", "Recently in Denver for a business trip and found this quaint little place to have dinner with a girlfriend.  It is in a beautiful old neighborhood and is a small place however this allows for attentive service from the chef, to the bar tender, to the wait staff.  Overall a very nice dining experience that was not rushed with a delicious wine list that while not broad has a good variety and quality."], ["G B.", "Great wine, tapas, salads, panini and even dessert bar.  Full bar.  A little pricey but a fabulous place with a great concept. Loved the artisan cheese plate and the salads.  Brought my own GF flatbread (Udis pizza crust)-they do have glutino crackers.  Regular bread and 34 Degree crackers served.  Loved the wine selection.   Yeah!!!!"], ["Susan M.", "I love living in Park Hill and have been waiting for a place like Neighbors to move in.  It has great atmosphere and so fun to have the big window open during nice weather.  Food and wine selection are great.  The wine is slightly pricey for some every day wines.  The panini's could have a little more filling.  Other than that I love Neighbors!"], ["I'm Hungry N.", "Neighbors is fantastic!! The couple that owns it is very nice and are very passionate about their food. The servings of cheese are much bigger than other places and it's delish!!"]], "The 9th Door": [], "Butcher's Bistro": [], "Mercantile Dining & Provision": [["Erin M.", "I'm not sure if I was besotted with Mercantile because it was my birthday when dined there, or if it's because the Mercantile is just that good, but I'm going to go with the latter.The ambiance is reminiscent of something in the Napa Valley with a bit of an upscale country vibe and farm to table flavor. Loved the muted color palate, all of the windows and the carefully selected fixtures.The food is the very best part. I could go on and on and on and still not do it justice. The gnocchi with short rib was magically delicious. As I ate each little delicate pillow, I willed the dish not to come to an end. The short rib also melted in my mouth....I'm practically salivating writing about it.The squash soup is cleverly served with cream an muesli, which adds a unique and flavorful twist to a typically traditional dish. It was so rich and nutty and felt hearty without being overbearing, like a warm hug from a close friend.I can't even remember the name of our dessert because it was so good I thought I had died when I ate it. Really. It was some sort of pot de creme, and my husband, who is usually content to let me have 3/4 of our dessert (one of the many reasons I married him) practically fought me for the last bite. On my birthday, no less.I'd tried to make a reservation for Mercantile in June for our anniversary, but found it impossible to get in. A friend tipped me off that if you show up between 4:30-5, you're likely to be able to walk right in (That proved to be true for us on a Thursday at 4:50)."], ["M V.", "Mercantile is my favorite place to go for a \"business casual\" lunch. The food is roundly and soundly 5 stars. Everything I've tried is 5 stars; every sandwich, every side salad, every fried pickle, every Red Robin juice, every \"oreo\" cookie.Why a 4 star review?For first-timers, the ordering process is not crystal clear. It took me a couple of times before I figured out how to let the cash register person know I wanted a drink other than water in pitchers that you pour yourself. And also to know that you can order anything from the pastry or cheese counter even if you are ordering a sandwich or salad at the other cash register.Also, it can be so crowded that you could order your lunch at the register, and then find out that there are no places left to sit!  In cold weather there are no extra tables outside. I guess you have to make sure you can get a table before you order. Usually I go during weekdays, but I went on a weekend recently for lunch and the music was loud."], ["Eric G.", "While the ordering process seems a bit inefficient, this place is awesome. Short Rib sandwich and Italian were amazing. The Italian was better. House made chips. Couple IPAs. It was a great lunch."], ["Janet D.", "I had high hopes here based on their sister restaurant Fruition. Mercantile delivered on all aspects. Great tasting food. Good looking presentation. Awesome waiter Ben. Stiff cocktail with a great sounding name. \"Girls Who Smoke.\"We shared their beet salad. My entree was the Spanish Octopus à la Plancha. It's crispy anson mills polenta, spicy tomato broth, dried fig and pine nut tapenade. $26. This dish was perfectly executed. The octopus was tender but not too soft. It retained its structure. So that when it arrived on the table it was the best looking octopus! Slightly crunchy outer side and seared tentacle ends. The taste? Clean but very much retained the seafood aspect of it. I love it! The fact that it wasn't stripped of it's taste made this dish a cut above the rest. I needed something equally outstanding to accompany my pretty octopi. Scotch for a cold night. I don't smoke, but the main star in this drink was Monkey Shoulder Scotch. Perfect hint of smoky aroma and oh so silky. A while back I tried this particular scotch and was caught off guard by it's unique blend of three malts. Add to this Mercantile's own addition of de maguey Vidal Mezcal, velenost vistol, martini amaro bass and, apricot brandy and black walnut bitters. End result: Stiff drink that is memorable and can go toe to toe with my equally memorable entree.So in summary, this is a successful first visit and we know we're definitely coming back!"], ["Sara M.", "I had been here a couple of times before, but just for breakfast pastries and some take home \"provisions\" and all were quite tasty. We have yet to try their casual lunches. On this visit we had a full dinner and everything about it was very nice. The staff is well trained, friendly and helpful but not intrusive,  the seating comfortable and not too tightly pressed, though there was some congenial sharing of peeks of served plates and comments with neighboring tables. It was a bit loud for my husband but really not as loud as many places we go. He's \"sensitive.\"We started with the bone marrow plate and some nice wine. The plate included two good size servings and included a nice watercress salad, a sweet onion marmalade, some blue cheese crumbles and bits of spiced poached pear. Nice presentation and flavors in an ample serving. For entrees, my husband had the seared scallops and I had the duck breast. We both enjoyed our choices, and I especially enjoyed the tenderness and quality of the duck, as tender as can be. Each of our plates had one slightly unusual component from the mix of side features, which though tasty, seemed less traditional than we were expecting. My  favorite on my plate was the apple quinoa. Very ample portions with both entrees. For dessert, my husband had the macaroon plate which was actually an assemblage of the macaroon, nuts, mango and some other little touches. I had the chocolate pot de creme which was a stellar presentation of a rich classic and far too large a portion for one person. A nearby table shared it four ways, but I would not be willing to give up that much!We certainly enjoyed it and though not a very convenient location for us, would try it again when in Denver."], ["Cassie P.", "After such a great meal, I discovered that I may have dropped my drivers license on the floor near where I was seated.  I phoned the restaurant the next evening.  They have an answering machine that allows you to leave a message, but there is no option to get a live person on the line.  I left my info and reason for calling.  The message says that they will return calls by 2pm the next day.  While I know that it is my fault for dropping my id on the floor, I was shocked that no one has phoned me back to at least say they don't have it!  I live in CA and cannot return there to see if it is there.  I was hoping to have it sent if it was found.  A phone call to say they didn't have it would have been the best customer service.  Instead, I'm left still wondering?  It has been almost 48 hours with no return call.  My original review of their food was stellar."], ["Kathy D.", "Thanks to yelp, I was able to find this cute place to dine during a work trip to Denver! I would've never known to look in the station for such a great meal! To start, I had the grilled naan that came with yogurt, jam, and pate--delicious! Then I ordered the Spanish octopus which was perfect and not tough or chewy. It was also sitting on a bed of patatas bravas. The flavors were beautiful together. I had a couple glasses of labrusco and call it a perfect meal. I know the menu changes up based on available ingredients and seasonal flavors, so I cannot wait for my next Denver visit because I'll definitely be back for another meal."], ["Frances G.", "When you find a restaurant with a unique and fresh concept compounded with sincere and knowledgeable staff, there's no other rating to give it than 'as good as it gets.' Writing this review after my third dining experience at Mercantile, I feel I am properly equipped to speak to the quality menu and servers. The restaurant's concept, of with I am sure everyone is familiar, is an open style layout with a wrap around bar in the middle serving delicious cocktails and coffee. The kitchen also opens up into the 'market' style eatery allowing for everyone to see to action in the kitchen. Along the walls, the Fruition Farms provisions are for sale. Everything from cured meats to cheeses. Though the aesthetics of the eatery really appeal to me, I'd have to say I love the good even more. The charcuterie (or provision plate) is, without fail, one of the best vid ever had. They load it up with all the essentials, and embellishments, like interesting jellies, jardinière, preserves to make the flanked shine through even more. This most recent visit, I thoroughly enjoyed the cucumber gazpacho (so fresh and crisp - perfect for a summer evening. And topped with puffed grain crumble and a delicious sheep cheese) and the Bucatini pasta. The noodles were perfectly cooked and obviously made in house as they were thick and hearty and robust with flavor as was the sauce. Our server was enthusiastic in educating us on each dish and made it a mission to make sure we ordered the right thing for us. He even listened to our specific likes and dislikes and carefully suggested various dishes for each of us. He even took the time to walk me through the cocktail list to happily craft a 'mocktail' just for me. It was delicious with mint and ginger. I enjoyed just as much as i would have enjoyed an actual cocktail with a little booze in there. I suspect I will be enjoying Mercantile a lot more in the near future."], ["Chad W.", "Mercantile is one of our favorite restaurants in Denver, and we compare most other places to it.  Amazing, innovative food, appropriate portions, and just....good.  I really dislike the word \"yummy\" but can totally see the Food Network folks dropping the \"Y\" word left and right on this place.  It's not a cheap place for dinner (drinks are my downfall) and we have yet to leave there with a sub-$100 tab...but this is one of the few places where I feel comfortable saying \"yeah, it's worth it.\"  I met the owner and head chef a few times at various events in the city as well as at Food & Wine, and these guys take their craft seriously.  Everything is made in-house, from curing meats to pastas.  Their bartenders are top-notch as well; order off the menu or tell them what you like, and be ready.  I never order pasta out a restaurant...but here, you should.  I'm not going to tell you what to get, because their menu changes with the seasons, so basically...try everything and leave happy.  We usually sit at the bar so we can chat with the bartender(s) about what they like the most at the moment; this strategy hasn't failed yet.  Seriously, get there now."], ["Lauren D.", "Whoa, is this place good!  We stopped in on a Sunday for a late lunch and the whole experience was top notch.  Not only is the space beautiful, but the service was fantastic (I dug our cashier's personality!) and the food was worth every penny.  Before grabbing ourselves a table on the outdoor patio, I had a chance to see all the plates of food the kitchen was pumping out and it all looked so beautiful. The two of us shared the short rib sandwich, truffle chips and quinoa salad and were blown away by the flavors and execution of it all.  The polenta croutons, lentil granola and goat cheese made the salad, but that short rib sandwich was definitely the star of the show.  Not only do you get a beyond decently-sized sandwich, but they do not skimp on the meat, which was braised to perfection.  This is the perfect lunch destination, if you ask me!"], ["Cassel M.", "We have been to Mercantile a few times now and it has been consistently awesome. I don't do dairy but the hubs does and he raves about the pasta's. They always accommodate my eating issues and make me something that not only looks amazing but tastes delicious as well. Last time, the lady at the next table asked me what I ordered, had to tell her it is not on the menu."], ["Tony S.", "Our best dining out experience in Denver. Yes, as good as it gets and worth it. Every single staff member was totally engaged, knowledgeable, and enthusiastic when we asked for advice. They had excellent recommendations for food, cheese and cocktails.  You need to go here!  Some foodie highlights:* Cool Hand (Brown Butter Bourbon) - OMG! Yes, I'll have another :-)* Market Provisions Meat & Cheese Plate - amazing array of flavors and textures * Toasted Farro Carbonara - unique dish and perfectly executed* Pan Roasted Diver Scallops - beautifully plated and very tasty* Eden Farms Bone-in Pork Chop - nicely done!* milk chocolate Pot de Crème - we fought for the last bite! (and I usually don't even like milk chocolate!)Dang, getting hungry while writing this.  Wished we lived closer."], ["Russell G.", "I'm quite happy with this place. It is located in Union Station, down the hall from Snooze and looks like there are long tables in the back that can host a private party. The décor is very nice and there is also lots of outdoor seating for the warm days.While I do recommend the food and coffee here, this review will focus on my cheese tasting experience here. They have a fairly impressive selection of various cheeses that can be purchased by the ounce and the staff knows the different cheeses very well. That helps a lot for a novice like me. I trusted my entire experience to the server and asked him for an ounce of 4 different cheeses. The selections were fantastic, unique from one another and the price was extremely reasonable.The only thing I did not like about this place is how difficult it is to get a live person on the phone. They want you to do everything through their web site, which is the current trend, but I wanted to confirm that they were indeed open on Columbus Day. When I called, I got a recording telling me to leave a message and phone calls get returned after 2pm. Hence, I was a bit nervous as I agreed to meet some friends there at 1:30pm.Anyways, great place, highly recommended."], ["Eileen H.", "Was in Denver for business and happen to randomly find this place and completely fell in love with this place. We had no reservations but only had to wait about 30/45 mins which wasn't too bad since they call you when your table is ready. We were randomly asked to sit at their Chefs table and I HIGHLY recommend this to any who goes here. The service was great and watching the kitchen do their thing was a lot of fun. And don't get me started on the food! I can honestly say I had the best Octopus in my life! We also got the mussels and the duck. Everything was just amazing and I would go back here in a heart beat."], ["Justin B.", "Breakfast was delicious! Best croissant in Denver, hands down. Had the salmon rillette which was very well presented. The coffee was another bright spot (literally). Lovely modern decor - lots of fun watching kitchen staff prepping for dinner in the open kitchen."], ["Dan S.", "Outstanding, in every sense of the word.  One of the best meals to be had in Denver.I typically hesitate to write a review, particularly a full, sell-out glowing one, after one visit.  This place was so good (and I am influenced by my love of Fruition, too), I couldn't resist.To be honest, we were expecting a bit of a let down - we really enjoy Fruition and thought this might not be as good.  It is certainly more casual, but the same attention, quality and inspiration is brought to the food.  For example, we had a beautiful dish with spaghetti squash, zucchini and ricotta elevated with gorgeous spiced sunflower seeds.Pick yourself up, take yourself down there, and put yourself in the assured, capable hands of Chef Seidel and company.  Try something you haven't even contemplated, let alone tried - Cucumber Sorrel Gazpacho, or Sweet Corn custard.  They also sell some foodstuffs (pickled things, cheeses, meats, etc) and it looks like a nice spot for a great lunch.Worst thing about this place (doesn't hurt that it's funny) is they have these thick, quality, real silver (I think) spoons and with the bowls they use it can be hard to get all the deliciousness out!Best thing is the deliciousness to be gotten out.I was, literally, surprised at the how low the bill was after a wonderful meal.  It is hard to put a price on great food, but it is easy to see this is a tremendous value for what you get."], ["Peter C.", "I didn't have a chance to eat here but I did get pastries for the days in a row.  Kate helped me out ands showed me the wonderful little cheese case and house cured meats (they have lardo!).  The pastries were amazing.   The croissant was buttery, flakey, and toothsome.   They had these little cardamom \"oreo\" type cookies and sweet potato bars that were so tasty and seasonal! I also had delightfully orange pain au raisin, and canelé!Go here for something.  I can't imagine anything not being great here!"], ["Valery L.", "This place was on my \"bucket list\" of eating places for a while! Everything we tried was great. The Green Strawberry & Rhubarb Salad was beautiful and unique, but a bit small for $13. The Acquerello Mushroom Risotto with truffle brined egg yolk was so creamy, cheesy and rich but beware, the egg really is completely raw. The Broccoli à la Plancha had the perfect sweet/spice mix and I was truly awed at how amazing this simple veggie could taste! The wine list was immense and had some great selections... But the most memorable drink was the Rumspringa...This thing was like Christmas morning in a cup and very stiff. The hot chocolate pot de creme for dessert was the highlight of this meal. It's so cute in its little mason jar and tastes divine... I could go back for just this!Please, just a few more vegetarian options & a little less time talking about the menu items (our server explained (read them to is) each one for about a minute and said each was his favorite, but never anything vegetarian)..."], ["Natalie D.", "I don't know what took me so long to drop in at Mercantile but I'm SO glad I did. As soon as I walked past the area where the food was coming out of the kitchen, I set my eyes in the Falafel dish with crispy kale, Harissa yogurt sauce and spicy tomato jam. I knew that that's what I was ordering. The presentation was phenomenal and couldn't resist. The dish didn't disappoint! I was glad that our server let me know ahead of time that the falafel would have a creamy texture. Otherwise I would have expected the traditional ball of fried goodness with a gritty center. My friend ordered the Natural Boulder Crispy Fried Chicken. It was as amazing as my dish. Complex yet simple at the same time. Oh wait! Did I forget to mention the other star of the show? The butternut Squash Soup. Definitely not your ordinary presentation or flavors. The service was impeccable which only enhances the dining experience. This will definitely be on my top 10 go to restaurants around town. Enjoy!"], ["Darika S.", "Absolutely fantastic!  One of the best meals in Denver.  Everything was remarkable!  I started with the gazpacho, a cucumber with melon and grains, the flavors blended so well together and I loved the cucumber and melon balls to give it that different texture.  The summer squash was really good, so many different ways the squash can be made into art on the plate.  There was thinly sliced zucchini, fried squash blossoms, spaghetti squash inside of zucchini, an all-in-all great dish.  The risotto was made with parmesan and an egg was cooked slightly on top.  This dish was so rich, but so also so devine.  The risotto was cooked perfectly and the flavors were outstanding!  The pasta in the dish with meatballs was so fresh, you could tell that the pasta was made that day.  The restaurant is packed and I understand why.  This place is definitely worth the wait for a reservation placed weeks in advance.  I'm not sure if people are turned away at the door or not, but every table was taken.  The service was fantastic.  Valet is available for $10 (garage) and the location is so fun on a Saturday night."]], "Cuba Cuba Cafe & Bar": [], "Tapas D'Jerez": [["Sharod D.", "Coming from a Spanish background, I have been begging the food gods for a quality tapas restaurant and I think Tapas de Jeres is the answer to my prayers! The only problem, is that it's all the way out in Greenwood Village but  still, well worth the extra trip. The restaurant walls are bursting with the native red and yellow  Spanish colors, along with cool authentic nick nacks that blasts you straight into the heart of Spain. I dined at this establishment for a fundraiser, meaning  I didn't get to experiment with the menu as much as I would have liked, as each coarse was  planned out ahead of time. Regardless, each coarse was still, as the Spaniards would say, \"DELICIOSO!\"We washed down all our food with some sangria and wine that was smooth and refreshing with every sip! The meal started with some fresh baguette, us Spaniards love our carbs ;) and a delicious Spanish style potato salad that was soooo on point, took me back to my aunts freshly cooked meals back in Spain! Without a doubt, the highlight of the meal was the Paella, a Spanish rice with veggies, meat, and fresh seafood. This dish has a to be done in the right way, specifically a unique pan (see picture) that needs to be big enough to fit all off the tasty ingredients and allow the proper temperature to reach those ingredients from start to finish, also not forgetting the key ingredient, saffron! The final product exceeded my every expectation and was a complete slam dunk! The rice, mussels, calamari, pork and chicken pieces all came together perfectly and I can confidently say this was by far, the best paella I have had in Denver! The service was good and every request was met promptly and efficiently but I thought the servers needed to be more approachable, as they seemed rushed every time they came to our table. It was a jam packed house so I'll give them the benefit of the doubt. I can only give 4 stars because I wasn't able to try out the menu options  I wanted to but I will definitely be going back and if the rest of the food is as good as the entrees I was able to try, without a doubt this restaurant will have my five star endorsement!"], ["Anthony F.", "We came here with a large group of 11 plus 2 babies, and even with it being a Saturday evening, we had no problem getting a reservation. It also turned out to be a fairly quiet evening, so that was helpful! Half my family is from Spain, so I've definitely got some expectations when it comes to Spanish food. As I perused through the menu, I started getting really excited as I saw some favorites from my time abroad. There was Pan con Tumaca, Tortilla Española, Chorizo al Vino, and of course, sangria. So how did these all break down? Let's discuss...Pan con tumaca: literally tomato bread. While in Barcelona, I had my first taste of this, and fell in love with it. It's so simple: mashed tomatoes with olive oil, spread on a thick piece of lightly toasted bread. Unfortunately, this isn't what I got here. They used extremely thin sliced bread, that was TINY. You get four per order, but even that's not enough. Think the thinnest Italian bread you can find, sliced thinner, and some tomatoes topped on it. Definitely a disappointment. Tortilla Española: This was a little different than the version I'm used too which consists of just egg, potato, and onion. That said, it was pretty good! The difference is that they add various veggies to their Spanish omelet. I was pleasantly surprised by this one!Chorizo al Vino: I would call this the star tapas from our order. The red wine sauce was spot on, and turned into a great bread dipping dish, and the chorizo was perfectly cooked, tender, with just the right amount of spice. The sangria was a big let down. There was hardly any fruit in it, and it was WAY watered down. I advise against it! I didn't try the paella, because I'm not into seafood. If you want just a chicken and pork paella, you have to allow an additional 45 minutes for them to cook it!"], ["Andrew N.", "Had dinner here this evening with a colleague.  Place was more or less empty when we started at 6 PM, and by the time we left at 8:30 it had a few customers.Service 3.5 - attentive wait staff with suggestions on choices and wines.  Food - 3 - We ate \"family style\" sticking to an assortment of Tapas - had the Jamon Iberico (sliced a little thick and somehow lacking in flavor), the Tortilla Espanola (fabulous!), the Cazuela de Champiñones y Gambas (great flavor, shrimp slightly over done), and Callos a la Madrileña (Madrid Style tripe cooked in a meat broth with Pimiento de Piquillo, paprika, garlic, chorizo and Morcilla). We stuck with the house Massimo ed wine - which turned out to be free with four tapas - go figureGood food, uncrowded and good service - rates a three any day of the week.A note on my rating schemaRating system 1) I wouldn't feed a dog I hated here2) I'll give it a miss3) Good food - I'll definitely go again4) Really good - I'll recommend to business colleagues and connoisseurs of this cuisine5) Completely worth a trip - I'd book airplane and hotels to go there again."], ["Cinthia B.", "Love to come here! Food is always great and the owner comes by the tables and makes sure you are enjoying your visit. Love everything I have had on the menu!"], ["Max C.", "It has been quite a while since we've been here and got a little reminder in the mail informing us that they now serve brunch.  We thought, hey, that's awesome... We love brunch!  Made some reservations and headed on over.  The reservations, as it turned out, were a bit of an overkill.  There were a total of 6 people in the restaurant (not including staff) the entire time we were there.  No worries, we thought, smaller lines at the buffet! Free mimosa to start, so far so good.  The brunch menu includes what looks like pretty much the same appetizers as the dinner in addition to omelets and other \"breakfasty\" things.  The buffet had some cold cuts, asiago cheese, salad stuff, paella, egg torta, shrimp, potatoes, bacon and American breakfast sausage.  There were also a couple of sweets, yogurts, bran and a oddly pale chocolate fountain with fruits.  We ordered some stuff from the kitchen and headed to the buffet.  The good things were the torta, the cuts and cheese, the bacon and the paella.  The shrimp were cooked to the consistency of solid rubber, it would be difficult for me to recall a time I've eaten worse... Then come our orders from the kitchen.  The chorizo al vino, pretty good, goes nicely with that torta.  The marinated pork, oof, WAY too garlicky (still taste it!).  The \"papas bravas\", mkay, not the same papas bravas we've had before... Instead it's a plate of potato chips with gloopy sauce all over them (see picture).  Naturally, the chips remain crisp for about two seconds and then it's just a big gloopy, soggy mess.  The Eggs \"Benedict\" comes with broken \"hollandaise\" that tastes like somebody blended scrambled eggs in lemon juice.  The \"poached\" eggs have runny egg white, plopped onto some dried out ham and some stale ass English muffin that's been sitting around in the fridge for a couple of weeks (see pic).  BRAVO! That is quite a masterpiece... We do inform our waiter that, unfortunately, THAT is not Eggs Benedict.  She rushes away to bring over the chef (who's watching some Futbol on the tele).  The chef is very apologetic, gives us a spin about heating lamps and how the idiot waitress left it there too long and bows away back to the game.  Desert Time!  Unfortunately, except for potentially the cinnamon rice pudding, which is just as great as it sounds, I'm pretty sure everything else was made by Kirkland... That's not too bad!  Costco is good too! Unfortunately, everything except for the Macaroons, was bought there at the same time as that stale ass English Muffin.  Ohh well... But hey! We got a \"free\" Mimosa! I'd be very surprised if you are reading this a year later an this place is still open."], ["Michael I.", "My wife and I decided to try Tapas D'Jerez for dinner this evening, and we had a lovely time! I'm pretty sure the gentlemen who seated us and took care of us throughout the evening was the owner or manager or something like that; he seemed very knowledgeable.The main reason we decided to try this restaurant (aside from the fact that it's really close to home and we like tapas) is that their menu online had a whole bunch of things labeled as gluten free (my wife has food allergies, including gluten). We showed up around 7:00 PM on a Saturday night and got a table right away.Obviously, we started with a pitcher of sangria, which was wonderful. For food, we started with a ham plate, a cheese plate and a potato omelette. We had some miscommunication about the ham; we were trying to order their super-fancy high-end ham, but we ended up getting the regular ham. Still tasty, but we were surprised at the generous portion (and later checked the bill and saw that we were charged for the normal ham). We definitely want to go back another time and try the fancy stuff!The cheese plate was yummy; mostly some awesome manchego with some samples of other cheeses on the side. The portion was ridiculously huge for the two of us; we have leftover cheese in our fridge now (not a bad thing!).The potato omelette (called a tortilla, but there was no flour or corn tortilla involved) was amazing. The sauce on the side was some kind of herbed mayo or something, but it was completely unnecessary. Omelet by itself = wonderful.We added on a garlic shrimp dish at the end, which was disappointing. Just not very tasty. I guess that's why I'm giving four stars instead of five.The service was lovely, the food was yummy (and bigger portions that we expected), and the sangria made it all go together beautifully. We will be going here again soon!"], ["Jen L.", "I was here with a biggish (7) group on a Monday night. The restaurant was a little difficult for us to find since it's in a strip mall and we didn't see the signs at first. The place was empty but our service was still only OK. The decor makes the restaurant cozy and you can almost forget you're dining steps away from an acre of asphalt parking lot. We were presented with an amuse bouche after sitting down...which was unfortunately full of ground beef (well unfortunate for me) and with the low lighting, I didn't realize until I took a bite. It definitely helped our experience that one of our party was a native Spanish speaker and she ordered for all of us. We had a carafe of the red sangria and the white agua d'jerez. They were both tasty but I think I preferred the red. My favorite dishes were the salad with shrimp and avocado and pinxto with the crab.The company was great but I felt like the restaurant was OK."], ["Heidi L.", "This restaurant serves the best tapas closest to what I had in Barcelona.  I love this restaurant..another great little secret here in the Denver area.  The ambience is very traditional Spanish.  On weekends, there is sometimes musical entertainment.  The staff is so courteous.  Try the patatas bravas, the pisto manchego, and estafado de setas!  Also, they cater to vegetarians and even have vegan dishes!!!  This restaurant is another one of our go-tos!"], ["Mary C.", "This was a terrible experience. They gave us menus, but after we ordered off the menu we were told that the kitchen was not serving and the only option was the nearly $20 brunch buffet where the paella looked dry and old. I then watched as they served others at the bar from the menu. Another friend ordered an espresso only to be told that they don't have it - despite a full size machine behind the bar. We confirmed in the morning that we'd be there with a group and that they would have the Madrid Derby on, but the TVs were discolored and distorted. Just not worth ever going back. I am Spanish and typically love all Spanish restaurants but this was a huge disappointment."], ["Erik F.", "Bread plate- delicious with veggie dipIberico ham and manchego - perfectionPintxos - tasty but smallPulpo - a little rubbery and lacking something in flavorCroquet as- alright, a little dryTortillas Espanola- amazing!We got delicious complimentary mimosas but water was never refilled.All in all a good experience, fairly pricey, but I might prefer ninth door in denver."], ["Sarah H.", "I've come to the conclusion that I'm a fan of the concept of Tapas but that I don't actually like the flavors offered in most Spanish cuisine.  The previous reviews of this place are pretty spot on:  it's located in an unassuming strip mall, the decor impresses and make you forget this fact. The food is good (even if it's not to my liking I can tell when something is cooked right) but overpriced - this would take it down from five stars to four.  The service is what took this down to a three star review.  My water sat empty for more than ten minutes on several occasions while I was eating and while the servers were friendly, that was only when you could get their attention.  I no kidding sat at my table with my check and my to go boxes for 30 minutes waiting for my server to stop studiously ignoring me while she cleaned the bar area and come take my payment.  I've never come so close to leaving a restaurant without paying.I ordered a lobster cream soup (delicious), lamb chops (also very good, though the chips that came with them were far too greasy), and a meat and cheese plate that, while good, was hardly worth the $18 price tag.  Actually, since they were out of the Iberico Ham that night, they substituted it for Serrano Ham and knocked a few bucks off.  I did not at all like the appetizer they brought out for me - I don't know what it was called, but it basically amounted to chicken soup on a plate with bread.Overall, I think if you're looking for authentic Spanish cuisine you will find it here, but be prepared to pay for it and be prepared for slow service."], ["Gary L.", "I have been here twice in the last two weeks and have been astonished by the taste of the the Spanish cuisine! I lived in Spain for a couple years and really missed the tapas and the many flavors they brought to the table. Tapas D' Jerez is as close as I have been to finding a authentic Spanish food."], ["Vilma S.", "Came with my sister since she had a Living Social Deal and I was really wanting to try the tapas because of Andrea's reviews.We were seated quickly and our server brought us two small tapas of beef with vegetables and a basket of bread--very tasty!! I ordered white wine and my sister had sangria. We ordered a tapa of croquetas (small, lightly breaded and fried fritters, with a creamy inside which included an assortment of ham, shrimp and spinach). Very tasty!!We also ordered the Mejillones a la Marinera (mussels with \"Marinera\" wine sauce & herbs). This was very delicious and couldn't stop dipping my bread in the great sauce.I definitely want to try their Happy Hour:- Drinks Everyday (at the bar only), from 3-6 pm & 9pm to close.Bar choice Tapas are served free as part of your Happy Hour beverage purchase!* $3.00 sangria and signature drinks ( Agua de Jerez, Melocotonada & Tinto de Verano)A* Wine Prices $3.00 GLASS, $11.00 BOTTLE (Depending on Stock)        REDS: TERRAI TEMPRANILLO, or TERRAI GARNACHA        WHITES: TERRAI, SYRACH or TERRAI, MACABEO* Domestic draft beers $2.50* Import draft $ 3.50Sundays through Thursdays (buy 1 tapa at regular price & receive the 2nd tapa (of same or less value at half price (Iberico Ham excluded).Loved the Spanish decor and there is plenty of parking!"], ["Jesse L.", "I read reviews about this place--it did not disappoint! The flavors in the food were incredible! The server was very nice too. We will DEFINITELY be back! My favorite dish was the lamb stew. I also recommend the 5280 tapas sampler to get an idea of what they offer."], ["Kelly G.", "I was really disappointed with this visit.  I hadn't been there in about 4 months and was looking forward to the Fried Calamari.  We ordered the ración portion of Fried Calamari since I like it so much.  The calamari came out as strips (fake calamari like the kind that The Elephant Bar uses).    I really like the tentacles and there were none.  Some of the pieces were tough and chewy.  We did not finish the plate.We also ordered the Croquetas ración and Beef Empanada.  They were good.  We will be back since we enjoy the live entertainment on the weekends, but we will not order the Fried Calamari again."], ["Andrea K.", "Love me some Tapas D' Jerez! We have been 3 times over the past few weeks so we're definitely fans. This is really more of a 4 star review but honestly I can't understand some of the mediocre reviews for this place so I am giving them the credit they deserve.We've only sampled their tapas here. We do it true Spanish style and stagger all of our requests in order to enjoy the evening. Our favorites are the Chorizo al Vino (so good Hubs and I sometimes request our own bowls), the croquetas are amazingly creamy and delicious, the Papas Bravas are outstanding. OUTSTANDING. I don't eat a lot of potatoes but the paprika sauce is out of this world. It impressed me so much I tried to replicate it at home! The smokiness is seductive. The mussels are also in this same type of smoky paprika sauce and it makes you want to lick the bowl- throw etiquette out the window! We've also tried the clams and shrimp in garlic sauce which is good.On one night we did the Tapas Sampler which is a pretty decent deal but we didn't love everything we had. The potatoes in aioli are pretty bland and the chicken in paprika was a tad dry. The calamari has a very light breading that is pretty good and tastes fresh. The goat cheese and pepper spread a top the toasted baguette slices is very tasty.To top it all off, it's all reasonably priced. The portions are generous, most bottles of wine are around $30, their beers are $3.50 (that's not happy hour pricing, either!), their house wine is $5- perfect for the area. The servers are all spanish and sometimes it's difficult to communicate but I think that lends to its authenticity. I'm thrilled to have something so tasty down south and we'll keep returning again and again."], ["AL P.", "Nice place very authentic, beautiful mural of Spanish lady. Food was very good, service was average, perhaps it was the waitress I had while seated at the bar. A little uppity for my taste. The food was worth it though and its nice to see a little more variety than steaks and burgers in Denver.  Would give it 4 stars except for service."], ["Sara C.", "This place has traditional Spanish tapas style food.  The happy hour has amazing prices, at least for my Angry Orchard pint @$2.50 before tax and tip... Came here for a Hispanic Chamber of Commerce networking event and tried the mashed potato salad with tuna on crackers.... yum!  I used to make a lot of the tortillas espanola but I have always had it warm.  This place served it cold and I didn't like that as much.  It's an egg quiche like food with potato in the middle.  Cold potato and egg just doesn't attract me as much as serving it hot.  We also had some potato and meat dish that was really delicious but I don't know what it is called.  I will definitely be back for some authentic Spanish food."], ["Andy G.", "Fantastic, authentic Spanish tapas and entrees. The second best Sangria I have ever had on this planet including many restaurants in Spain. Their wine list has many interesting Spanish wines. Located in Highlands Ranch / Suburbia so they close at 10:00 pm but that is probably the latest an establishment is open for a five mile radius. My sister in law who lived in Madrid for 10 years loves this place. We will be back many more times."], ["Paul G.", "Went there today for lunch.  The door was locked.  I drove way out of my way to go there.  Nothing on their website about being closed.  Nothing posted on the door.  They should have been open according to their posted hours.  Wonder if they are still in business..."]], "Tapas De Espana": [], "Los Cabos II": [["Ben C.", "Friendly, courteous service. Delicious food. Our orders came out fast and cooked perfectly. We'll be back for the Sunday buffet."], ["Larissa V.", "This is the best Peruvian food I've had in the States.  They even have my favorite, Aji de Gallina.  They also have a full bar with Pisco.  It was pretty quiet the night I went, but we had great service.  I will be back."], ["Jihee Y.", "Was excited to try something new. The dishes we ordered had so many great flavors going on but were a little muted. The server couldn't tell us anything about the dishes we asked about and couldn't recommend anything to us. A little disappointing but the food wasn't that bad.I wouldn't really go there again, it wasn't really memorable. Sad because we had such high expectations."], ["Savanna F.", "Good for when you are downtown.  I would go back.  The atmosphere lacks warmth, I kinda felt like anyone could hear my conversation. Service was good."], ["Rosio W.", "This place has good food and good service. Most of the Peruvian dishes are pretty authentic and taste very good. They have a lunch buffet where you can try different dishes for a reasonable price. My disclaimer about my food review: I am from Peru and love Peruvian food and went specifically looking for authentic Peruvian food. We have tried many different dishes and can say the food is authentic and yummy. I highly recommend the Ceviche, Aji de Gallina, and Bistec a Lo Pobre. The Chicha drink is pretty good also. I was disappointed with the Papa a La Huancaina and Suspiro. Papa a La Huancaina is an appetizer and although it tasted good, I was expecting a more authentic flavor and was not happy with it. The Suspiro is a dessert and I had it twice at this place: First time it was good but today the cream that sits on top was hard and stale. I think it had been sitting too long and when I brought it up to the waitress, she took it and spoke to the person who made it and came back and told me \"that is how they are.\" She offered to exchange it or I could leave it. I will not order either of those here again.   Although they don't have a couple of dishes that you expect a Peruvian restaurant to have, they still have a nice variety. The combination of flavors are great.The service was fine. Nothing spectacular but not bad. We did get enough attention and refills each time we were there. The decor is nice. I do think some of the decorations are cheesy but overall cute. It is a small place and can get full quickly at peak times. It is a good place to go for lunch or dinner to try new flavors."], ["Sophan C.", "Food was OK. Drinks were not my thing. The place was dark and the ambiance wasn't too great."], ["Cathy G.", "HORRIBLE SERVICE AND HORRIBLE FOOD!  I grew up in California and my mom grew up in Peru.  This food is NOT peruvian food!  The rice was hard the food was tasteless.  We went  with a groupon and they didn't want to honor it even though we were ordering over $100 of food.  Don't go!"], ["Dan S.", "I ordered a seafood plate with shrimp, scallops and octopus over rice in a yellow curry sauce.  They did not skimp on the seafood.  The total was $15.  My friend had a beef and rice dish for $13.  I also had a mango mousse dessert that was also tasty.  I thought that the waitress was very friendly.  I'm not sure what the other Yelpers were expecting."], ["T S.", "My wife is Peruvian and I have been to Lima 8 or 10 times.  We drove up from the Springs based on the rating but could not have been more disappointed .  It was like they had a gringo chef trying to follow Peruvian recipes (he FAILED!).  They kept trying to push the buffet (no such thing in Peru). Which had little variety, barely any food, look like it had been sitting there all day and was $15!  I chose the ceviche, the Peruvian national dish, my wife chose the teradito (also another classic) and since there was no kids menu we had to split an adult dish fr our 2 and 4 yr old.  The price was $15 - 20/ dish and $9 for a pisco sour (ridiculous!)Ceviche usually comes with Peruvian corn (nope) and was small by both Peruvian and American standards.  It was not cooked properly, the onions were raw whereas normally they are soaked in brine to mellow them out, the fish (cheap tilapia) was not allowed to cook long enough in the lime juice, and the shell fish were frozen precooked.My wife from Lima asked for the teradito with aji amarillo (yellow pepper) she said it was scorching hot even for here akin to battery acid.  It must have been drowned in ill prepared habanero peppers.Service was horrible three times I had to ask for water for our daughters.  I could go on but there's no point.  Please don't mistake this restaurant as representative of the awesome culinary cuisine Peru has to offer."], ["Jeremy T.", "$10. All-you-can-eat. Peruvian food. 'Nuff said.Bottomline: The curry was so freaking good! I came back for a combination of that, the pork fried rice, and this other chicken dish on multiple rounds, eventually stopping after the 4th or 5th."], ["Alex D.", "Did not dine-in but met a few of the servers and they seemed courteous and helpful. The layout of the restaurant is open and seems like it would be a nice place to dine. I ordered 4 entrees for carryout: arroz con mariscos, pollo a la brasa, vege tallarin saltado, and lomo saltado. None were exceptional, none were bad, just ordinary."], ["Nicole W.", "I've seen this place on Champa for a while now.  I had yet to enjoy any Peruvian since moving from so cal, so I was excited to find a place here in Denver! The décor is very cute and homey. Definitely not comfortable enough to make you want to stay for a long time, but great decoration.  The service was fabulous! Our waiter noticed that our table was wobbly and retrieved a shim to level it out! How great it that, we didn't even have to find a sugar packet or a napkin!! And our water glasses were kept full!I indulged in an inka cola - man do I love that stuff! I mean really, liquid bubble gum, how can you go wrong? We were there for lunch and the buffet had a number of really great choices! There was no saltado on the buffet so I'll need to return for dinner or lunch and try it. I'm really thrilled to have such a tasty location to enjoy some Peruvian!"], ["Laurie S.", "Pretty great food & experience. A friend ordered an appetizer that I think was ceviche, and it was pretty amazing. Dinner was tasty and the service was great. I am so glad I was able to experience this place, I hope to go back soon."], ["Ty N.", "Simple great food!  Wait staff is great to chat with too."], ["Chelsea G.", "I adore this restaurant! And the people too! The lunch buffet is great and you get your money's worth. The wait staff is so friendly :) when our two year old made a HUGE mess, they would not let me help clean it up. That's great service. The food is true Peru and even picky eaters like my toddler can get their Tummies full! Go here!!!"], ["Kendall B.", "This was my first visit! Great food and music. Huge portions and I hear the buffet is awesome!"], ["Ethan C.", "Went for a second time for the buffet! Yea...must go back. All of it was great and the salad items were awesome. Had never had the buffet (lunch), but it was all good. Big fan! Staff was super friendly the second time. The waitress was super friendly and talked to us about where she was from."], ["Jenny S.", "I've been driving by Los Cabos II for about three years without really noticing it and I really wish that I had paid better attention.  At first I thought it was another seedy Mexican joint but upon further inspection with a friend, we realized it was Peruvian and we had to try it.The restaurant, so unpretentious, has a kitcheny feel to it with it's simple colorful tables and fading pictures of Peru looking out from the walls.  The brightly colored paint adds some flare and the waiters, with their authentic Peruvian accents, are friendly and quick to recommend anything from their native country.  Based on other Yelp reviews, we tried the Lomo Saltado and the shrimp ceviche and were completely blown away.  The ceviche is made with a Peruvian pepper that grows on top of the Andes that they fly in and my god, it makes the entire appetizer.  The Lomo Saltado is so basic yet so incredible you have to wonder how a meal made with meat, onions, bell peppers and french fries can taste like nothing you have ever had before.I had a pisco sour and was also tempted to try the pisco mojito.  Both knocked my socks off they were so strong, but the pisco sour was my favorite.  I will be back with friends that love trying international cuisines, I cannot wait to show off this little gem.Why four stars?  If they tidied up  the actual restaurant to be just a little more inviting I would want to stay for hours.  But for now it is a place that you get your food, eat and go- no lingering longer than necessary."], ["matt h.", "The lunch buffet lacks anything that really stands out.  The buffet consists of a bunch of filler dishes and then some pretty good beef, chicken, and pork options; but anything resembling loma saltado was missing and was missed.  I think your $10 is better spent somewhere else unless you are really in the mood for peruvian."], ["Kenny N.", "Nothing like being greeted by a good size stuffed llama. This was my introduction to this Peruvian restaurant inspired by my expiring Groupon list. Dinner consisted of the Papa Rellena (available only on weekends), the Lomo Saltado, and finally lucuma ice cream for dessert. Something could be said for service timing as both the papa rellena and loma saltado came out together. The papa rellena was nice and piquant having that sensation of lime tartness. It was stuffed with meat, olives and hard boiled egg. It went well with the accompanying fried onions.The lomo saltado was a bit too chewy. I should be leery of anything outside of hamburgers that comes with french fries. If they ask you if you want the green sauce, say yes. It's slightly peppery and is a good addition to the dishes.The lucuma was an odd flavor of sweet, but enjoyable. The only other thing: the place is drafty and is not too warm on a cold day."]], "Rioja": [["Annie C.", "Walked in here with my mother and sister on a Saturday evening. We were seated fairly quickly, but unfortunately the server came off a bit standoffish. I don't know about you all, but I'm big on first impressions and service is a big part of the experience. She stopped by once to give us our menus and that was the end of her. Ha! I kid, but she actually did disappear. A different person began serving us after thirty minutes of waiting around. But, who knows, she might've been having a bad day.On the food:The Avocado Citrus Salad was actually quite palatable with lots of flavor, and everything blended very well together -- I enjoyed it! I ordered the Vegetarian Four Squares. The veggies themselves weren't anything special, but there were many exotic flavors (i.e. sautéed onions with a butternut squash sauce, seasoned radicchio with aged cheese). For dessert, we ordered the Hand Made Ice Creams and Sorbets for dinner, which was yummy!Overall, I enjoyed the food and company I was with, so it didn't make my experience here a terrible one. However, I do feel as though there was too much hype and not enough pizzazz to win my heart over this time. Perhaps, I'll give it a second go in the future, but no gold star for you this time, Rioja."], ["Mike T.", "Rioja was such a pleasant surprise.  I'd been sent to work way down in Englewood for a couple of weeks and I just couldn't stand eating dinner at another chain restaurant, so I made the trek all the way up to the city in search of a decent meal.I was by myself so it was easy to snag a spot at the bar where they still serve the full menu, and the bartender was very sociable and friendly.  I had an amazing meal that was duck served two ways - one was a perfectly cooked duck breast and the other was a fennel duck sausage served with oranges. It was like quack cocaine. GET IT?!The bread basket appetizer was also worth writing home about, and they have a great wine list so if you want to order a rioja at Rioja and be super meta about it, go for it.Great spot, highly recommended!Food: 5/5Value: 4/5Service: 5/5Atmosphere: 4/5"], ["Gus C.", "I typed \"best restaurant in Denver\" into Google and got Rioja.  I flew into Denver at 5pm and had a 6pm reservation.  Made it just in time and I was not disappointed.  I was seated at the Chef's table (because I was solo) and got to talk to one of the chefs throughout the dinner. It's fun to see them plate and talk about the food. Decided to do the 5 course tasting menu.  Mostly because it had the 3 things I will usually order on any menu --- Beet salad, pork belly and roasted duck.  Course #1 -- Mocha Roasted Beets.  Beet salad with dried cherries, pecans and soft cheese.  DeliciousCourse #2 -- Fresh Bacon.  OMG!!!!!!!  I could of had another bowl of this.  A melt-in-your-mouth piece of pork belly in it's own broth with a curried garbanzo bean puree.  Best plate hands down.  The flavors were incredible.  Course #3 -- Liberty Farms Duck Breast.  Tasty duck with cherries, mushrooms and a risotto.  Perfectly cooked duck.  Course #4 -- Artisanal Cheese Plate.   4 cheeses.  1 with Strawberry Rhubarb jam, 1 with fennel salad, 1 with olives and 1 with mushroom mustard.  I liked the strawberry rhubarb and mustard the best.Course #5 -- Chocolate Mouse 3 ways.  Hazelnut chocolate, Dark chocolate and milk chocolate mouses in a chocolate soup with hazelnuts.  If you love chocolate you'll be in heaven.  Location -- It's in Larimer Square, a very cute area of Denver with twinkly lights across the rooftops.  Very romantic restaurant and then you walk around romantic Larimer Square at night."], ["Jennifer M.", "Two stars mainly for bad service. Came here the first time and everything was perfect, I'd give it the full five stars. Then I came here a second time and they were late to seat us for our reservation, took thirty minutes to take our order and I had to ask for bread after not receiving it in the first thirty minutes of being seated. In addition, the bread was just stale, cold and hard. Cold bread and cold butter just isn't a good combination. We ordered a bottle of red wine and it tasted a bit more sour than I'd hope but my hopes for this place were already shot  it wasn't worth complaining about.I ordered the salmon the salmon dish, which was supposed to have truffle in it but I could not taste a bit of truffle. It was delicious but I was truly disappointed that I could not taste it. The only reason I ordered it was because of the truffle. My husband really enjoyed the lamb and probably thought it was the best meal he's had in Denver since we've moved here. I'm sure we'll be back whenever he's craving really good lamb.It also took a while for us to get the check which was annoying because we were ready to go after our meal."], ["Crystal N.", "We had an incredible date day here one night. Instead of sitting at a table we sat at the chefs bar. Watching them hand make our meal right in front of us! You literally order from the chef and get to talk with them as well. Good was amazing but I have it 4 stars because it's very pricey. Come on a date night or special occasion you can't just buy one little side salad and call it a night."], ["Lisa V.", "Landed here for brunch on Sunday pre Broncos game. Starving. The Pupusas was delicious. Every singular bite of shrimp was taken in anticipation from the last bite if that makes sense. I wasn't sure how the cream cheese would blend with shrimp and it was incredible although it was rich. The Eggs in Purgatory had us giggling until it arrived and was time to taste. It wasn't my entree and I was weary to try as I'm not a fan of goat cheese - not even a little. After much coaxing I finally tried a taste and I've got to say it was terrific too. So many flavors working together nicely. Service was better than good. We were brought a plate of the Rioja donughts complimentary that melted in our mouths with a succulent orange blossom ganache. Very, very yummy! Great atmosphere, super friendly staff going out of their way for us and excellent food.Will for sure come again on visits back to my hometown, Denver."], ["Jordan T.", "Best restaurant in Denver. We have previously been to Rioja for brunch/lunch and were underwhelmed. I don't recommend it. However, upon our return for dinner on Monday, we were extremely impressed. The food was incredible. The lamb, gnocchi, and salmon were such unique combinations of flavors. The cheeses were fantastic, and the dessert was impressive and creative. Everything mixed such incredible flavors in new and inventive ways. The descriptions provided to us on delivery really helped us as well. I am also partial to Spanish wines, which was the perfect touch on the night.I will end with a criticism. The service was subpar for the quality of the food. I felt pressured to buy some high end wine without an adequate description, and several items on the menu went unidentified. That being said, we will unquestionably be back."], ["Cathy M.", "What a excellent dinner experience. Very classy dinner spot. Most clientele we're professionals. A very extensive wine list and some great cocktail selection. I was impressed the moment I stepped foot. Yelpers thanks for giving this such high marks which made me want to come her for dinner.The waiter was very attentive and pleasant. He advised us that most dishes can be ordered as a half order. We wanted to practically order everything on the menu. He didn't put through out dinner order untilWe had our appetizer and pasta, just to make sure we didn't order too much. We had the pork belly and the hamachi appetizer. Our waiter only place half and Order for the belly, which was a good call. The pork belly was cooked to perfection. It melts in your mouth. It is served in curry broth. Loved it. The hibachi with strawberry and citrus sorbet was refreshing! We had their signature tortellini and gnocchi with black truffle. Both with handmade pastas. Again, out of this world! Both were half orders again.We proceeded with out main dish. I had the grilled octopus and my friend had the four veggie plate. I didn't taste her dish very much, but my octopus was nice and soft. Not chewy at all. At the end we were too stuff to eat dessert.Almost forgot, get the professore de flor! Yummy drink."], ["Rachel W.", "Wonderful place for a great dinner with a changing selection. Great variety, and unique selection. Love this place! Great job with service as well. Very accommodating."], ["Julia R.", "This is a wonderful restaurant. Everything about our experience here was perfect. The meal started with an assortment of various breads. The lavender sourdough was my favorite. I probably could have eaten the bread as my dinner and went home happy.I had the artichoke tortelloni it was amazing. Our server recommended this dish, as it is the signature dish of the chef. The pasta was homemade and tasted fantastic. The server asked whether I was a vegetarian and was easily able to make it vegetarian by using a different broth. I tried some of the vegetarian four squares, and each of the dishes was delicious and included various fresh, seasonal ingredients. We ended the meal with the biegnets, which had a goat cheese and fig filling. They were phenomenal and they did not even charge us for them since we were celebrating a birthday. The service was wonderful. Staff was polite, attentive, and made the experience even better. Could not recommend this place more. Perfect place to go for a special occasion."], ["Kristine K.", "The bread course was my favorite. Definitely 5 stars! In fact, I woke up this morning, dreaming about the lavender butter with pink sea salt. The rest was...Eh, very so-so, if not a little disappointing.I started with the Spring Salad that was artfully crafted although somewhat difficult to eat due to its construction, and in the end, I found it too frustrating to finish. My entree (Scallops with uni risotto) was below average. The scallops were unevenly cooked - some with overly browned edges, while others looked rather anemic. I was not Gordon Ramsay a'la \"Hell's Kitchen\" pissed, but what a disappointing lack of consistency! I found it unusual that the scallops were served split after cooking and served in an odd number (5), so what happened to the other half of one scallop? The risotto was too firm for my taste, but the real problem for me was that the dish had clearly languished on the pass, solidifying into a rather unappetizing block. *sigh*The service was equally under-par. After receiving our bottles of wine, we sat approximately 15 minutes before our server returned to take our order; during this time, we received no bread, no one checking in, nothing no nada. Overall, that was our service: Sporadic. I will likely return, hoping for a better outcome, but this was indeed a disappointing first visit."], ["Shaun N.", "5 stars isn't enough for Rioja. If there was a way to give more than 5 stars, this place definitely deserves it! The fresh bacon was unbelievably amazing. Perhaps my favorite thing during my dining experience at Rioja, the fresh bacon was so flavorful and just melted in my mouth! The pizza appetizer we had was succulent and just delicious. We had the artichoke tortellini for our entree and it didn't disappoint. All the raves and highlights about the fresh bacon and the artichoke tortellini are on point. Nothing can match its flavor and complexity when it comes to a dish at Rioja! If you are in Denver this is a place to check out! I know I'll be back very soon!"], ["Sharmeela S.", "I really love this place.  The food was amazing.  Unique flavors.  Beautiful presentation.  From start to finish my meal was excellent.  The goat cheese biscuits were delicious.  The avocado citrus salad was perfection with goat cheese, orange, and mushrooms.  The artichoke tortellini was incredible, I ordered the half portion but wished I got the full.  The truffle broth was so good I had to stop myself from drinking it.  The scallops and short ribs were very good but could have had a little less accompaniments or seasoning/sauce to let their natural flavors come through a tad more.  The price point here is very reasonable given the delivery and the simple of fact of being a celebrity chef's original restaurant.  I would definitely recommend this place.  The Lodo district is very cute also and there are lots of bars and restaurants in walking distance."], ["Christina L.", "While searching for restaurants in Denver, Rioja was my first choice! I could tell they put a lot of effort into each and every one of their dishes just by scheming at the menu online. The feel of this restaurant is very romantic- dim lights and close tables. Almost immediately, I was impressed with this place. First off, they come to the table with a marvelous selection of bread and, trust me, this is not any ordinary stone hard bread. All the bread offered sounds heavenly! After devouring our bread, they brought a complimentary cracker with crab- YUM! I could probably eat 10+ of those little things. For our entrees, I ordered the Hawaiian red sweet crab and my guest ordered the Alaskan halibut. The risotto in my dish made it absolutely perfect and I promise I will never forget it. My guest also loved her dish and said the halibut tasted very fresh! We were so impressed with our food that we just could not pass up dessert. Although it was hard deciding, we settled on the brandy snap cannoli. The orange scented carnaroli rice pudding was an excellent touch to this treat. At the end of the night, we were beyond pleased with this place! It's an absolute must try in Denver!"], ["Megan S.", "I have to say that we were very disappointed in our meal at Rioja. It was a Thursday night and we had a reservation. We were seated within a few minutes of arriving, but service was extremely slow. We waited over 40 minutes for our entrees to arrive after our appetizer course. My husbands chicken was almost inedible due to the amount of salt. My food was generally tasty and prepared well but we were unimpressed. The server did offer us free dessert due to our wait but were exhausted from traveling and decided just to leave."], ["Holly A.", "Damn this place is sexy. If you bring a date here and you are not naked by the time you get back to your car you are doing something wrong.  Very wrong.I'm sure everyone has already said it, the food/drink/atmosphere is drop dead beautiful and fucking out of this world delicious - the service is undeniably impeccable.  Here's where I have my only issue:  DON'T RUSH ME .... if my business partner is wining and dining me at ~$300 a sitting, NO I will not leave in 1.5 hours on the dot as suggested.  I will sit there and savor every damn bit of it, for every second.  I will drool profusely.  And I will lather myself in Rioja until we will all ride away on unicorns.Thank you."], ["Anna T.", "While restaurant hopping through downtown Denver, my brother and I decided on Rioja. I was sold after seeing the ceviche on the menu. The mahi-mahi ceviche was perfectly prepared with a cucumber sauce that was so fresh on the palate. The Rioja Picnic platter was equally as delicious with the most delicious fried goat cheese balls I've ever had. It was a fun dish to work your way through with fun tasties from prosciutto to a garlicky fennel salad to a house made orange marmalade. So yummy! The desserts were absolutely on point. Don't miss the black and white cheesecake. Black sesame ice cream?! I didn't know what I was getting into but it was truly special. The service was perfect. Cocktails were delicious and fresh and their wine list has something for everyone. I definitely recommend Rioja for a quick snack and a half glass of Tempranillo or a multi-course dining experience!! Two thumbs up!"], ["Maisha R.", "Located in the hip Larimer Square, Rioja is acknowledged as one of Denver's best restaurants. So, I was really excited when I learned that our group was having lunch here.We started with a few appetizers:Rioja \"picnic\" - artisan nests, warm pine nut encrusted goat cheese, gorgonzola, olives, fennel salad, orange confit, and almonds. This was a nice starter with quality meats and cheeses. There was a little something that appealed to everyone.Fresh bacon - pork belly, cardamom, curried garbanzo bean purée. This was just as good as it sounds. It was a thick slab of pork belly and the garbanzo bean purée really helped to cut the saltiness of the dish and provide some balance.I'd heard that the pastas were good and a few reviewers raved about the artichoke tortellini. I debated between that and one of the sandwiches, which all sounded delicious. But, I thought \"when will I have artichoke tortellini again?\" so, I went with  the half portion. The dish was very well seasoned and the homemade pasta was cooked absolutely perfectly. Although the dish was rather tiny, the amount of filling was on point.I enjoyed the pasta with a couple of pieces of their signature bread - the olive loaf and the goat cheese lavender biscuit.The service was excellent, the restaurant was clean and there were two seating areas. In the back room, you can watch the sous chefs and bakers prep the food and be certain, you'll be drooling when you hear what they're making!"], ["Mary K.", "We had the lamb burgers and they were simply delicious. The arugula salad was also very nice. The house made doughnuts were ok but not fantastic. We went to the restaurant around 12 PM and the menu that we had was a lunch/brunch menu. There weren't too many options as far as entrées but overall a good experience."], ["Brian S.", "We had a member in our party that was celebrating a birthday and she wanted to come here.  So we did.Why this is a 5 star place:Food.  Excellent.  House salad properly done and a reasonable size.  Clam flatbread was excellent.  Everyone raved about their main course (gnocchi, octopus, vegetarian 4 square, short rib, and 'pizza' appetizer special).  Although I found my short rib just a touch salty - not salty as in too much salt, but maybe the flavor of the spices?  Something like that.  Desert was very good - they had a coffee/donut plate and the donuts were simply unfair.  Unfair in how good they were and probably how many calories they had. :)  Loved the sangria.  Did not have any wine but the pours were OK, not 'great.'  This is a pricey place, but not outrageous.Service.  Why it is a 5 star AND a 4 star place.  Service itself was mostly well paced and very attentive.Ambience.  Denver chic if there is such a thing.Special touch:  Birthday girl's desert was on the house and she received a signed card from the staff.  Way cool IMO.Why 4 stars:Server.  Don't get me wrong, our meal was very well paced EXCEPT for a noticeable time lag between ordering desert and receiving actual desert.  Maybe I'm high maintenance, but at a \"5-star\" place like Rioja, the server shouldn't have to refer to her notes about specials and desert over and over again and admit \"I can't read my own handwriting.\"  Also, kind of weird when you placed your order and the response is \"thank you.\"  A true 5-star wait person presents the specials, deserts, and answers questions from memory with confidence.  Maybe our server was a bit new, but clearly room for improvement.Only other nit is bread person should've came around a 2nd time prior to the entrees being served.  Bread is excellent but real small portions.Bottom line - Place is full at 8pm on an average Tue night (no major events in downtown) and it is full for a reason.  Pick up the game with the servers and this is truly a 5-star restaurant that lives up to its hype."]], "BESO Tapas & Wine Bar": [["Alex M.", "Pretty good experience. Tapas are good but the tab adds up quickly. Service was good. Wine and beer list seriously lacking so hope to see them improve on this soon. Overall promising non-chain eatery in HLR."], ["J H.", "Love this place!! Went there on a Wed for happy hour. $4 tapas and wine/sangria. I was getting over a cold and they made me the best hot toddy. We ordered 4 different tapas. The empanadas, grilled artichokes, fried avocado and albondigas. I can't even pick a favorite, each were amazing! For dessert we had the s'mores which are truffles covered with marshmallow, caramel and graham cracker crumbs...yummy! The place was super cute. There is an intimate bar area surrounded by tables and a back room for private parties. The restaurant is a perfect size. The tables are comfortably spaced. Great place for drinks with the girls, date night or large parties."], ["C W.", "Came here on January 16th on the spare of the moment...what a great find!!  We spent the evening trying various delicacies, drinking wonderful wines, and loved everything we had. Had the fried avocado (could have had several!) drunken shrimp (delicious!) croquetas, empanadas, and a couple of other things whose names I can't remember, but which were great as well (guess I should have written this review sooner). We finished off our meal with the pomegranate panna cotta, and it was the perfect ending to a perfect meal. The service was friendly and overall just excellent. The atmosphere was laid back, welcoming, and yet sophisticated enough for an evening with friends or an intimate dinner with that special person. Definitely plan on making this a regular hang-out spot. Went home completely relaxed, serene, and ready to face a very busy weekend. Good job Beso. See you soon."], ["Tara L.", "I had dinner there last night. It was below average for the price and the meal size.  I felt the food was over priced. I had the salmon strips (I can't recall the name of the dish) and it had grill marks on it, which made it taste burnt. I thought that was unusual. The portion size was very small. You need to order at least two dishes to make one small meal. The service was good, but there were only a few tables. I won't be visiting again because there are better choices for the price."], ["GFmtngirl D.", "Had a leisurely lunch at Beso yesterday afternoon. I am gluten free (celiac, not by choice) and at least 70% of the items on the standard menu are gluten free.  These are easy to find as they are marked with an asterisk.  Three out of five items on the specials menu were also gluten free.  Three of the four desserts were GF too.  The wine list is varied with wines from chile, argentina, as well as your typical west coast wines. We ordered a bicycletta that was delish.  The food was also great.  The prawns, anchovies, and filet were all very tasty and presented beautifully.  Julio and Beth did a great job with a chic remodel of the former Italian dungeon.  The interior is warm, open and inviting.  They also have private rooms available for events.  Will go again soon!"], ["Clint F.", "I wish to submit an apology to beso I intended to review another tapas place near me and accidentally submitted for beso."], ["Demetri P.", "This is an awesome little tapas restaurant!! The owner is fantastic! So much fun to go in and sit at the bar, chat and enjoy some great authentic tapas. The owner goes out of his way to get fresh unique ingredients and everything we have ordered has been awesome. This is place is definitely a spot we frequently visit."], ["Kerri-Lynn A.", "Just tried Beso for the first time with some girlfriends for my bday. We ordered a bunch of tapas, sangria, a few desserts and everything was fantastic! Since it was a Monday night it was very quiet and I am sure the owner was the one serving us...he was so friendly and generous...gave us complimentary items in celebration of my bday.  (very nice gesture!) We were all really impressed by this little \"gem\" in Highlands Ranch...gotta spread the word! Will definitely be back!"], ["Paul R.", "This is a great new place in the ranch.  Food is wonderful with lots of choices,  Good wine and the list is expanding.  Great attention by the owners and the wait staff.  I will be back again and again."], ["Linda H.", "This place has great service and great food! The tapas and wine were delicious and our server (Julio the owner) was there to please! I hope people will support this local restaurant; it is so worth it!  We were treated to the Sangria and it was delicious. Very refreshing and a nice 'dessert'."], ["Julie H.", "They're working on their service but the food is great and the value high.  Worth a try."], ["Tracie S.", "We went here for Mother's Day and it was FANTASTIC!  I would encourage you to give this place a try.  Everything we had was wonderful and we will be back."], ["Melissa B.", "Delicious!  Beso offers a wide variety of Tapas including daily specials.  They are just getting their doors opened and already this is one of my favorite new spots.  The Sangria comes from a special family recipe and is out of this world.  I can't wait to sit on the patio and enjoy a glass this summer.  The stuffed red peppers were my favorite as well as the empanada that was stuffed with seasoned beef and pine nuts.  The desert menu has a variety of different deserts, my favorite was the Malibu soaked berries!"], ["Krystal C.", "My husband and I dined here on a Friday night at 5:00pm. I was a little skeptical because I really loved the Italian restaurant that used to be there. Well, I was blown away by the change in decorations and ambiance, and the friendliness of staff, and the tasty food! They even gave us a booth when it was supposed to be able to seat probably 6 people. We really appreciated that because we have 2 young babies right now that are keeping us up all night long, so when we go out to eat we really want it to be a comfortable experience. I liked the menu a lot, especially the beef empanadas and the tomato flatbread. The owners came and visited our table twice and we never had to wait on more drinks or food. Our server (Jeff, I believe) was the perfect combination of alert and ready while also being relaxed. I will definitely be going there again. Even for a Friday night it wasn't too loud at all, which is good for my husband and I because when we go out to eat we really need to be able to re-group and talk to one another. It was a great experience and I will definitely recommend my friends to try it out!"]], "Dagabi Cucina": [["Susan K.", "Always go when we visit Family in Boulder. We live in Las Vegas, and have eaten in some of the best restaurants. I had fresh pasta with clams, and ate every bite. The pasta was the freshest I have ever eaten, flavors were superb. Can't wait to visit again."], ["Ali M.", "when tourists, students, and other people not in-the-know are suffering out a 2 hour wait at Pasta Jays or The Med, you could go here. Dagabi is a hidden gem in North Boulder. They have wonderful, fresh, Italian food, tapas, happy hour, pizza, and a bar. The food is truly amazing (I ha portobella mushroom soup and butternut squash ravioli with brown sage butter) an the prices, while not cheap, are reasonable.   Also, they have pizza that is comporable in price to any other pizza joint, if you're on a budget.Cost is about the same as pasta jay's but the quality is better."], ["Peter C.", "Ok so I gave it another chance.  Alas, I got the paella monday night special.  Portion was small.  You could tell that it was not cooked in the traditional manner or with the proper rice; It had more the texture of overcooked risotto than paella.  It's a shame because the ingredients appeared to be pretty good but the execution was sub-par; mushy rice and pasta is not cool!  I'm pretty pissed about it so I'm gonna open my own restaurant and serve homemade pasta simply and well cooked, boulder needs it!"], ["Guy K.", "So, we went to DaGabi last night as it came pretty highly recommended. Here was out experience.-Walk in to an empty hostess stand. Stand there for a little while.-Get seated outside, the hostess was polite, but on our way to a table a waiter cut me off at the door, which I endedup holding open for him. Not a thank you was heard.-In the 5-10 minutes we waited, we were given water from a bus boy, who said he would get a waiter to take a drink order. -3 waiters walked past our table, one twice, and the long haired male waiter with green glasses, that I held the door open for, actually looked at our table then hurried back into the building as he didn't seem to want to be bothered.-I did get a big handful of my favorite chocolate mints on my way out the door.I would have preferred to send this to the owner but there is not a contact us link on their site.Their loss, we eat out a lot, are great tippers, and regulars at a few places. And Radda was great later that evening as usual.Guy"], ["Jessica` D.", "Great happy hour prices. I think the tapas are better than the Med. Stay away from the flourless cake unless you need such a thing.  All other dessets to die for."], ["Jane G.", "Disappointed--I was expecting at least a four star experience here, but a combination of less than perfect food and a disdainful, slow waiter put the damper on the meal.For starters, I love grilled polenta, but the appetizer we got was just firm and not crunchy at all, which is how I like it. However, it was tasty.We also shared a white pizza with shrimp and I couldn't eat it. My husband liked it fine, but there was something in the topping that really made it inedible for me--a sweetness that shouldn't have been there.The kids had pastas which were all right, but nothing super special."], ["Chloe K.", "I miss this restaurant...I used to live a block away and I would eat there all the time!  Hands down the best martini's in Boulder!  They're huge, delicious and creative!  My favorite dish is the penne pollo..my mouth is watering just thinking about it now.  I may just have to make a trip up there for this dinner alone...Oh yeah, the bread is dynamite!"], ["rusty r.", "Ok, so I agree with Phill B, this is one of Boulder's best kept secrets! It's in  North Boulder, in the same plaza as Lucky's and China Gourmet, and the liquor store. Ha, it's basically a super plaza.Dagabi has the most amazing pancetta wrapped grilled jumbo shrimp. They are seriously amazing. And they are part of the happy hour menu. Go for these, and you can't go wrong. The bartenders and servers are also extremely friendly, and pretty cute as well. Staff is knowledgeable, and the ambience is fantastic. You would never guess this place existed; it really is as nice as anything on Pearl Street... but it's tucked away in Nobo. Oh, and they have a fantastic patio.The back room bar is my new favorite spot!"], ["SUSAN T.", "This was excellent. I would give more stars if I could. One could be in Spain... from the proprietor walking you to your table to the chef/gm being your most knowledgeable guide to the food. Just back from Basque CountrySan Sebastian and Bilbao, we wanted a taste of Spain... and, we got it.The empanada and  the paella (with the right amount of saffron) was perfect. The amuse boche of the gazpacho had the notes of cucumber to tomato that was sublime. Fabulous."], ["Anna B.", "I love me some Dagabi! This is my favorite place in Boulder for tapas, even though I live nowhere near the restaurant. The house wine for happy hour is always good, the do a paella special every week (I want to say Mondays and it is around $12) , the gnocchi is awesome, the service is good, the happy hour list and prices are amazing. Let's just say for 2-3 people at happy hour, wine and more food than we can eat the bill is usually in the 25-45 range. De-licious!"], ["Chris N.", "First time I went here it was terrific. Authentic and stylish. Boy has it lost it's way! It used to serve rustic Italian food, now it serves a mixture of Spanish and Italian and does both in a mediocre way. If ever there was a restaurant that needed a visit from Ramsey's Kitchen Nightmares it is Dagabi.  It just doesn't have an identity any more.The menu is way too big. Clearly there is some talent in the kitchen but they can't pull this off. The tomatoes in the salad were so unripe they were like apples. No caring chef would send that out. The rest of the food was passable but just not quite right. Not enough seasoning in one, too much oil on another. We left to have dessert at a restaurant that seemed to give a damn, so I can't comment upon that.I see that a lot of the recent reviews are about happy hour. I think that is part of the problem as when we went the patio was full with some pretty drunk people with smokers hanging around on the other side of the railing puffing back towards the tables - somewhat missing the point. I get that Happy Hour can get people to try a restaurant, but to do so at the expense of full paying customers seems crazy. The service was inept and rude, with the staff seeming to be squabbling with one another. Our waiter was quite simply an idiot. When my wife didn't hear him offer pepper on her salad (?) he aggressively yelled \"Hey Lady\". This has become a standing joke to get her attention so at least something good came from the meal!Can we have the old Dagabi back please? This town has too many good places for such mediocrity."], ["Sherry C.", "Love this restaurant. Kind of hidden and low key, not flashy. We went there in March and I am excited to go back with another couple this evening. I will have to get the Mushroom appetizer again wtih a glass of wine."], ["Kiki R.", "It used to just be ok, but since my mom's friend took over some of the ownership I love going there! They have Paella on mondays! (Which is a Spanish dish!) They also have Tapas on tuesdays! What  I also like is that they are starting to give a gluten free option for their pizza, pasta, and deserts! Overall an awesome place, nice aura, and wonderful people especially the manager! This is a great place for anybody who wants a taste of Spanish food, but they also have Italian food still! On the question about reservations, you don't always need one, but it's good to make one incase they are really busy."], ["Robin S.", "This place is a solid Italian restaurant. I lived right around the corner from it growing up and it was always a treat. Off the bat, the bread with balsamic dressing is delicious could go there just for that. Everything I've had has been good as well. I like that the dishes aren't the heavy, chunky, and rich dishes that most seem to be. I'm sure you could find those on the menu, but everything I've had is a little more subtle yet flavorful."], ["Mike S.", "This is my second review.  The first in May 2010 was mixed.  The owner responded apologetically that they had been slammed with 3x the forecast number of customers that night and offered to comp a meal.  I never took advantage of the comp, but returned last night for a meal that my entire party of 4 raved about.  My Sapphire martini was as good as they come with a generous pour.  The food and experience were top notch.  Before tip the tab was about $28/person with alcohol.  That is a relative bargain in the People's Republic."], ["Karen S.", "Great find...paella was better than in Madrid ... Chef Antonio was very attentive...our new favorite in Boulder!"], ["Scottie H.", "My family and I have been eating here almost since is opened, and I've never had a bad meal. Recently, I've only eaten here during the holidays, as we try to escape the holiday food and all the effort that goes with it. Dagabi serves lovely soups and salads, nice thin crust pizzas and excellent pasta dishes. I've never had any of the larger (meat) plates, but everyone else has loved them - filling, but not overly rich. Recently I had the squash and sweet-potato soup - I'm sorry I didn't ask for the recipe it was so light, unexpected and perfectly spiced. My husband and I split the walnut / cooked apple / cheese salad and they were kind enough to split it to two plates - the service has always been thoughtful and quick. Such a light meal left room for desert and they have great desserts. A lovely, relaxed place. Our neighborhood choice. I hope they continue to thrive."], ["ray e.", "brought the sweetie here for her birthday dinner. and though it was oddly situated in a strip mall like area, the interior made you forget where you were and had nice ambiance (warm carved wood, brick walls, ambient lighting). we started with some crab croquettes (delicious!) and bruschetta with trout (tasty!). then had paella (disappointingly served on a plate and not on a paella pan like we're used to, and didn't seem like it had simmered long enough for the rice to absorb all the flavors) and a salmon \"empanada\" which was deceiving since it was wrapped in phyllo pastry (tasty but the pastry was not flaky and the accompanying green beans seemed oddly paired), then topped it off with a flourless chocolate tart on an almond crust and drizzled with marsala cream sauce (yummers!). To wash that all down, we each had a strong and tasty mixed drink (hers was a martini, mine was a sidecar) that I ended up finishing for both of us since her liver's healthier than mine (heh heh). overall, quite a nice experience!"]], "Solitaire": [], "Acorn": [["Charles K.", "Huge space inside, relaxing ambiance and kind service! The Butterscotch Pudding with coffee Mousse was truly awesome. I like the staff. They were very particular to detail. All the information I needed was comprehensively addressed."], ["Robyn B.", "It's called acorn because the portions are probably for squirrels, and it's family style.... Does jimmy johns deliver here?"], ["Robin B.", "Came for dinner for our anniversary and they started the dinner off right with a champagne toast.  Casual unpretentious atmosphere ( it is after all in an old warehouse). Great vibe and knowledgable waitstaff.  Most of the menu is small plates made to share, which gives the option for sampling several creations.  We shared four plates, which was plenty of food.  Our favorite was the shrimp and grits, perfect balance of spice and flavor.  My husband especially loved the hamachi and I really liked the gnocchi with mushrooms.  The menu changes often depending on what's in season, so we'll be back!"], ["Robert L.", "In a group of 4 we ordered 9 plates which is was the \"hungry\" end of the scale according to our server.  It ended up being perhaps a little too much food, but all of it was amazing.  The high points for me were the meatballs and the apple-something salad.  I think everyone would have chosen a different favorite.It is quality that you pay for, at about $50 per person, if you are having drinks.  On value it gets average marks as I've had meals just as good for less, but the variety and consistently high quality was really impressive.A strong five stars from me!"], ["Ryan R.", "This place is superb! It's following the new trendy warehouse style and looks cool. The flavors were amazing, excellent service, and the mixed drinks were delectable. I had the Immortal Marigold drink and it came with a cool sphere ice cube."], ["Asuka N.", "For our first night out in Denver, my wife wanted to eat at Acorn, where she'd been last year and absolutely loved the food. The Source (where the restaurant is located) is a bit outside of downtown, but I really enjoy the space - dirt parking lot that leads into a huge converted warehouse / factory that has a very cool ambiance. It's probably the restaurant with the highest ceilings I've ever eaten in, and outside of the tables and the kitchen, it really does feel like you could still be in a factory (except for the graffiti, perhaps, which is a nice gritty touch to the scene). With it being a beautiful night temperature-wise, all the windows and doors were open, letting a nice, refreshing breeze flow through the restaurant. Our waitress was great, bringing out food out at a relaxed pace and letting us soak in the atmosphere (and our drinks).Speaking of the drinks - you can select from a great assortment of cocktails (The Ambassador was delicious - I drank it so quickly, I wondered if I got a virgin version instead), as well as a few mocktails for those who prefer to keep it light. The beer offerings are also extensive, although I was disappointed (as I was at most Denver spots) at how few local options were on the menu relative to other choices.As for the food - there are a couple entree-sized options at the bottom of the menu, but everything else is pretty much for sharing family-style. We started out with the razor clam ceviche - lots of bright, summery flavors with a hint of Mexican inspiration from the jalapenos, but I was actually slightly disappointed in this dish. The razor clams didn't really stick out flavor-wise, and it felt like I was eating the garnishes more than a clam. Perhaps it's one of those items that is served better grilled (as it would traditionally be done in Spanish cuisine), but we weren't huge fans. Next up, though, were the shrimp and grits, which was fabulously done. I'm not a big eater of this when it's on the brunch menu, but I really liked the Tobasco-infused sauce - it made it a very lively dish while maintaining the same gritty (ha, ha) texture that grits have. Our third course was the wood-grilled salmon - I forget what kind of wood, but the salmon was arguably one of the best I've had. There were strongly-infused flavors and aromas grilled thoroughly into the filet, and it was served under a light blanket of baby greens and over some lima beans. I'd have to say it's probably better than the salmon I had on my recent trip to Seattle (heresy!).We finished off our main courses with two meat dishes: the oak-grilled bone marrow and the oak-smoked wagyu short ribs. While bone marrow is usually one of the most decadent dishes on the menu, I came away disappointed with it in the same manner that I was with the razor clam - the star of the plate (the marrow) was very covered up in the flavors of the garnishes, and I think the oak flavoring inadvertently masked the taste of the marrow. It was still interesting, nonetheless, but it's not the best marrow I've had. The short ribs, meanwhile, were decadently divine - juicy bites that fell apart in your mouth with each bite, with a mix of firm (beets) and creamy (cheese) making each bite a great combination of the succulent and the earthy. You only get three (relatively) small slices, but this is something I would likely order just for myself next time. We finished up with two desserts - the honey lavender panna cotta, which had a light, floral taste to it but had a nice sprinkling of granola / oatmeal on top to give each bite a crunch; and the spring (summer?) strawberries, which I really liked not just because of the deliciousness of the strawberries but for the olive oil-soaked almond cake it was served with, which provided a nice contrast to the sweetness on the rest of the dish.While Acorn wasn't perfect on every count, this is definitely a 5-star experience, and I'll round up what would be my true rating (4.5) as well. Great ambiance, great drinks, a creative menu that delivers on almost all counts - and it's reasonably affordable too (especially to this New Yorker)! Whenever I make it back out here, it's highly likely that Acorn will be on my list of spots to dine at again."], ["Art K.", "What everyone is saying about how great everything tastes is absolutely correct (except the gnocchi's, they were kind of bland). What people are not telling you is how much you have to pay for this great taste!I am not a foodie and don't claim to know what half the things listed were. But... when I spend $95 for two people and have to go to Wendy's because I'm still hungry, it is not the place for me."], ["Meghann P.", "It was a special occasion and we were celebrating! I opted to try something new and different! We were not disappointed! And as you can see by other reviews, this holds true. Service in impeccable! They are attentive, informative, fun, and friendly!!We did a Bryan's Manhatten and an across the Atlantic as cocktails! The across the Atlantic was the definite winner for cocktail! Then started with the Kale and Apple salad, a beautifully savory and crisp chopped salad! The crunch and flavor all amazing! Then we had the tomato braised meatballs and carrot ravioli! It's true what they say, adventure out a bit! The ravioli sounded different, but the flavors were unreal! The meatballs were also a great staple and just all around warm and delicious!! We opted to go with a large plate- the chicken since we wanted to get in some good protein and it was equally divine and large! The flavor on the chicken was awesome and the broccoli rab mashed potatoes had a unique sweetness cutting thru the yummy butteryness (yep, butteryness)! Again just amazing!! We were definitely stuffed! But since it was a special occasion, we opted for the spring strawberry dessert and 2 lattes! This latte is legit and strong! Yum! The strawberrys with lemon olive oil pound cake, and mars spine ice cream was again outstanding! I had no doubt based on other reviews, but so thrilled to be able to try Acorn! I love having unique gems to share with friends and family, and this is on the list for sure!!!Ps. We were so excited with each dish, we forgot to take a lot of photos, but many of them are posted on here already!!"], ["Valery L.", "This place was amazing! The small plate type menu is one of my favorite ways to try lots of different foods. We had the following dishes (2 of us) : - Bruschetta (which was my favorite of the night!!!)- Farmers market salad (which was awesome as well, and I usually hate beets)- Carrot & ricotta ravioli (yummy, but hard to follow those amazing apps)- Squid ink tagliatelle (I was a bit full once this came, but it was really nothing special) - Butterscotch pudding dessert (this was TO DIE for... Make sure you save room! ) While the drinks were too intense in my opinion (very girly palate), the food was great, the service was on point, and the atmosphere was perfect."], ["Nick C.", "With so many great reviews and accolades and having enjoyed Oak at 14th , maybe my expectations were a bit high. We came here on Xmas eve and grabbed a happy hour drink at the bar before our reservation. The happy hour drinks were suitable and at a margin of their regular prices. We also had a pair of cocktails with our meal as we couldn't resist their concoctions on their drink list.  Perusing the menu, we were enticed by most of the menu and we knew what to expect with the small shared plates concept. We had an array of dishes including the pork belly, the octopus, a mushroom soup(?), mussels, and the delicata squash. Each dish tasted good but nothing besides the octopus really was out of the ordinary. Plating was well executed, ingredient pairing was unique and original, and everything was enjoyable, but I all honesty, it wasn't worth the price tag. I can appreciate the concept of shared plates allowing for the dinner to get a true sense of the restaurant. I also personally enjoy getting to try an array of plates and flavors, however, the plate sizing and quantity served does not constitute the averaged $15 charge/plate. I'm not averse to spending a hefty amount for a good meal, but I just didn't feel as though the food or experience warranted the substantial price tag in relation to some other Denver restaurants. If I can forewarn, I would suggest not going in a ravished state of hunger unless you plan on consuming and paying for the entire menu."], ["Tiffany H.", "Acorn came highly recommended by a handful of people and the venue did not disappoint. I showed up before the dinner menu was available, so I meandered around The Source until I could order a meal. While not traditional, simple and buttery marrow, the Oak Smoked Bone Marrow was a delightful personal twist on the dish. And the Yellowtail Crudo was the perfect balance; lightening up the overall experience. The cocktail selection is stellar and the staff couldn't be more pleasant. I recommend bellying up to the bar to get the scoop on what's best, as the menu changes slightly with the seasonality of ingredients."], ["Cynthia H.", "Amazing food and service.  Best meal I've had in Denver.  Everything was creative, delicious, and appropriately sized.  Cocktails were yummy too.Make a reservation!"], ["Jason G.", "I think four stars is generous actually.  And I am surprised the reviews are so strong. For the service alone I would give Acorn 5 Stars!!! Seriously excellent service is always a plus and can make all the difference. Here's my thing. The food was just ok... There's so many exceptional restaurants in Denver with creative dishes, and amazing flavors. Sadly for me, this was just a Meh food experience. Truthfully the dishes were bland and needed salt. The risotto may have been one of the worst I've had in a while anywhere...The place is hip, trendy, and has the buzz factor for sure. But if you're looking for some decadent foodie heaven you will have to keep looking! I will try again eventually in hopes of something greater and tastier."], ["Heather W.", "Amazing from start to finish - we were blown away. We went spur of the moment after a wine tasting at IMT. We had a variety of drinks and small plates...the hits were definitely the shrimp and grits, fried pickles, sunchoke and goat cheese ravioli, citrus salad and crispy egg.....so so good. Service was great, too - Nathan was really helpful with suggestions and very attentive. We can't wait to go back and try dessert as well...it looked amazing but we were so full! A MUST TRY....best since Plimoth. Yum!"], ["Blake H.", "My wife and I were in RINO on a day off and were able to secure a reservation at Acorn for lunch. I visited the Source a few months earlier for coffee and a quick bite and loved the idea of a market in a converted industrial warehouse. Acorn, of course, is constantly listed in the top 50 restaurants in Denver, so we felt lucky getting a reservation for lunch. We split the chicken biscuit and the grilled cheese. Finished the meal in style by downing a fresh donut. I am unqualified to discuss specifically the flavors that we ate, but needless to say, we will be back again and again. The food was that good. This is a *true* neighborhood gem."], ["Wade K.", "This place is solid.  But each time we have gone there (twice) they have done something pretty frustrating.  One time I specifically asked for the white of my egg to have no runny-ness.  When I took a bite, I almost gagged b/c it was almost completely raw.  I don't remember the other thing that happened b/c it was awhile ago and I wanted to give them a second shot.  That said, I just think that this place is overrated.  My wife loves it so we will definitely go again, and I hope to update this review with 4 stars."], ["Jason P.", "In a phrase: over priced.  For the price, it's too loud, poorly lit, poor bathrooms, small portions, poor service  (let's be clear--pleasant people does not mean good service, they could have been more descriptive and knowledgeable), poor seating, poor complexity of flavors ( thing were tasty but nothing really popped), even the butterscotch pudding lacked an intense home made flavor.Bottom line: total bill with tip $242, 4 people, food and 1 bottle of wine.  Save your self $150 and go to Stubbens, or one of the great Taqueria on Federal, or West 29th in Wheatridge......  Folks I'll pay $242 over and over but not for that--you're close but your not there yet."], ["Gaye Lynn M.", "The hype is real. Amazing restaurant. Worthy of every nod.Knowledgeable and friendly staff. Patrons of all walks. Today (Valentine's Day, Saturday) we arrived for our 11:30am reservation and the restaurant was full but a table was waiting for us. I loved the menu options... Familiar but different. We started with the CDT SUNSET (campari, pimm's, pêche de vigne, sparkling wine, mint, orange, lime) which was a perfect daytime cocktail.  We ordered the GRILLED BEEF & QUINOA SALAD and the ROCKY MOUNTAIN TROUT with Gnocchi. Both had an appetizing presentation and both were full of ingredients that one wouldn't expect to work... But they exceeded our expectations.  We finished with the WARM CHOCOLATE CAKE... Basically a Hot Chocolate Lava Cake wrapped in Filo (like a present) and garnished with homemade ice cream.  Definitely not a spot for a picky eater. Expand your horizons and check it out!"], ["Eliza C.", "Fantastic dinner consisting of Kale and Apple Salad,  Mushroom broth,  perfectly fresh made Gnocchi, and King Crab Spaghetti."], ["David L.", "I loved the food here. Great recipes and a greta patio outside to enjoy the nice weather. Nice place."]], "Gozo": [["Chucky B.", "One of my favorite restaurants! Great atmosphere, service and food. Highly recommend trying. You probably need to make a reservation though, it's always crowded."], ["Shannon F.", "Came for a working lunch with a girlfriend. Loved the brussels salad! Could have done without the baby kale salad - it was bland and had some kind of weird, chewy out on it. The orecchiette was also delicious - hints of lemon zest and you could smell the browned butter cooking from the kitchen before its arrival!"], ["Chris V.", "Love this place. Great food. Incredible service, and creative and tasty mixology. We didn't have a reservation so we took our chances. At first there was nothing but within 5 minutes Prince 'the magic maker' was able to work something and get us a table for a group of 5."], ["Alyssa B.", "Can't say enough good things about the potato pizza. The flavored born absolutely perfectly. Really like the atmosphere white the open kitchen as well."], ["Jo C.", "Great food! Great service! Try it! Nice addition to Denver!Fun place to bring your friends! Met the owner.. He really cares and makes you feel welcome! Wood fire pizza's... Very good! Nice wine selections"], ["Brianna B.", "Gozo is a great place to grab a glass of wine and some small plates, or have a romantic cozy dinner. The space feels airy and spacious while maintaining a sense of intimacy. And I loved the decor, both modern and minimal. The wine on tap was very light and clean on the palette, but if you want something particular they have a wide range of wine selections and a few craft cocktails. We sampled some small plates and pizzas between 7 of us girls. My only pain with the menu was how encrypted it felt. Too many terms that felt a little out of reference for the average diner. And I'm pretty familiar with decoding fancy menus! We had to ask for translations on everything.But the food was worth it. We had the warm citrus olives, grilled baby octopus, the fried raviolis, and the shaved brussels sprout salad. All of it was amazing. The food felt light, thoughtful, and well proportioned for tasting. I want piles of that brussels sprout salad. We also had the mushroom pizza and the potato pizza. Both were cheesy, flavorful, and had a great texture and chew. I really enjoyed the smokiness of the mushroom pizza."], ["Morgan F.", "I was in Denver visiting some friends and we decided to go out for the evening. I mentioned that I was getting pretty hungry and some others in our group said the same. They recommended Gozo, and since I love eating tapas in a \"family dinner\" style I was immediately on board.There was a small wait when we showed up so we all went to the bar to order drinks. The bartender was very pretentious so I was glad I wasn't there alone (hence, the four stars instead of five). Usually when I go out to eat alone I sit at the bar but I don't think the experience would have been as good if I had to deal with her the whole time. One of the guys in our group ordered a drink that ended up tasting like an ash tray (several people in the group tasted it and thought the same thing). When it was taken back to the bar, the lady gave so much attitude, talking about how great of a drink it was and how it was an acquired taste. When we mentioned the situation to our waitress once we were at our table, she agreed with us that it was an awful drink. She even guessed exactly which drink it was that we were talking about. The food is amazing. Tapas style, so the dishes are smaller and definitely good for sharing. There were 5 of us splitting dishes. We ended up ordering just the right amount of food. I'll try to remember everything: beet and cheese salad, brussels sprout salad, clams, a dish with an artichoke and some sort of delicious cheese concoction, the meatballs, the pork shoulder dish, and a fennel pizza. It was all amazing. Some things to point out: the artichoke seemed undercooked and we really couldn't get much flesh off the leaves. Whatever the cheese ball concoction was that came with it was amazing, though. The pork shoulder dish with squash risotto was very good, although one in our party felt that the pork tasted as though it'd been frozen for a while. The polenta that came under the meatballs was really good. I didn't think the brussels sprout salad was that amazing, but then, I was expecting something really different. It was a hit with others in our group. Our waitress was very perky and attentive and we didn't have any issues with our service. We even got our table a lot sooner than we expected. It is a little on the pricier side here, but our entire meal, including a second round of drinks, ended up costing $28 per person (we split it evenly 5 ways). That was cheaper than I was expecting and I feel like the price was reasonable given the quality of the food."], ["Liz W.", "I really wanted to like this place, it's in our neighborhood and the interior is really nice. We came for dinner with a small group of friends and all left feeling unimpressed with our food and the service. We had a reservation which they called to confirm several times. We showed up exactly on time for our reservation and then had to wait for over half an hour for our table. Once we were seated we ordered appetizers for the table and I have to say they were delicious! Absolutely the best part of the meal. Once we ordered dinner, we had to wait for a really long time for our food to come out of the kitchen and then one person at our table had to wait an additional ten minutes for their food to come. The food was underwhelming when it did arrive, especially because the appetizers were so good. After we had finished dinner our server brought the check while clearing our plates and didn't mention or offer dessert, it was clearly time for us to vacate the table which was frustrating given the delay in seating us. My quick summary is that I think this place would be great for happy hour or appetizers and drinks but is not worth the money to come for a nice dinner, there are other restaurants in the area with better food and better service at the same price point."], ["Liz F.", "Before this visit I had been here only once for a glass of wine. Didn't feel the need to come back here again until I read the reviews. When I did decide to come here I didn't make a reservation on a Sunday afternoon which luckily worked out. No wait! We arrived only 15 minutes prior to the start of a happy hour. Double lucky! We told the waitress that we would wait for the happy hour. While we waited she brought over complimentary champagne. Cool! We had mussels and a couple apps I can't remember the name. For an entree we had the chorizo pizza. AMAZING! I absolutely love this place and I cannot wait to have another pizza again. Great food, beers, customer service!"], ["Alice G.", "Solid four stars! Stumbled in here accidentally when Karma next-door was not open. My friend and I tried two pizzas and I had the beet salad with Gorgonzola cream.Portions are large, and the food is quite rich/heavy. Order less than you think. We enjoyed every bite, however. I had the fennel sausage pizza with kale and the beet salad and my friend tried a different pizza and they were both delicious.Also the white sangrias were very refreshing and not too potent -perfect for lunch.Ambience: the place is beautiful hardwood floors, crisp, modern, and clean with beautiful tabletops and garage doors that open and left the fresh air in. Very nice.This post was so great, I think I will be planning to come back here very very soon.Way to class up South Broadway!"], ["B. Y.", "The Sophia (at 50) cocktail was amazing - so addictively delicious, sweet and refreshing. We split the roasted cauliflower and grilled artichoke appetizers - all delicious, but I really liked the sauce on the margherita pizza.  The crust wasn't notable, but the taste was! The spaghetti with rabbit ragu was good but not that special; however, the daily risotto with beets, preserved lemon and hazelnut was amazing!!"], ["Meg K.", "First time here....arrived before the crowds. Nice menu without being too convoluted. The meal was tasty but not the  OMG moment when you take your first bite....could have a bit more seasoning. Service was not great....our wait staff must have taken a break between taking our drink order and getting it.... Appetizer came out after the entree... Yes, it's loud but they all seem to be headed that way these days. House red wine not worth even a happy hour price. All in all a good meal. I still miss DeLux....."], ["Gavin L.", "New place on Broadway! I met the head chef, Nick, and he told me the story of moving to denver from Napa to open this spot. Good move. Seating for 88, big bar scene with open atmosphere. Staff is super friendly hooking us up with wine tasting as well as free dessert. If you don't ask, you never get. Try the Brussels as well as octopus. Beet salad was only ok, but wine options made up for it. Perfect for a late night food/wine option off Broadway. Cheers!"], ["Mary M.", "I wanted to give them more five stars....but in thinking about my meal I couldn't. My main concern was the overuse of lemon. We went on 9.11.14. I started with the brussel sprout salad, mainly because of all the rave reviews. Yes, it is super yummy, however, the lemon was a bit overpowering. I'm going to put a disclaimer here that I might be more sensitive to that taste that others. I had the pasta special which was homemade pasta filled with spinach and ricotta. The pasta was a bit tough and the filling just didn't have much flavor-except I could taste the lemon in the sauce. My husband had the salmon which he said was \"o.k.\" The wine by the glass is really reasonably priced-which I appreciate.I have to say the service was outstanding. From the host to the gentleman who came up to the table as we were leaving to ask how the meal was. Rachel was our server and she was just lovely.We will go back-because the service was so good!"], ["Kelly O.", "I have never written a negative review before but after seeing so much glowing press on Gozo, and having had a literally horrible experience there (yes, literally horror-inducing), I felt compelled to post.1. We went for a friend's birthday, and it was a rare chance for us all to catch up. Except I found myself stuck in a 5-minute conversation with the waitress about my perfume. Didn't want to be rude, and she was nice, but sorry, I'm here to talk to my friends.2. Plus, following the distracting side conversation, she brought me the wrong pasta dish.3. Server kept telling us what kind of wine to get while we were trying to discuss it among ourselves. (\"Get white!\" to the whole table) It went beyond suggestion, it was bizarre. 4. Server forgot she had already taken my friend's order first, and came back around to her. No sweat. When she re-ordered the mushroom pizza, server said, \"oh, don't get that, your friend ordered that. Get something else and go halfsies!\" She made some suggestions that my polite friend felt a little pressured into. She didn't like the meal she ended up with.5. My carbonara I don't think was actually carbonara, and it was so-so at best. A few friends liked their pizzas but overall, flavors weren't exciting, pasta was a smidge overcooked, forgettable all around.6.***Now this is the really, really bad part that doesn't apply to everyone but is important to address***One of our party has had a life-threatening peanut allergy for 30 years. After a lengthy conversation with the server to confirm what her order was cooked in, everything was all set and seemingly understood (plus why worry about peanut oil at an Italian restaurant? I could be wrong, but...). As we were eating, her throat got scratchy and she started to panic when she realized that she must have eaten peanut oil. Sure enough, the waitress VERY CASUALLY confirmed, she was eating potatoes fried in peanut oil. Her response? \"Well, I told the chef...\"We had to rush to Walgreens and stab her with an Epi Pen. She ended up being OK because of the meds. The manager acted bizarre when she came over to our half-empty table (the rest stayed to pay the full bill) with a big oblivious grin on her face, and said/did nothing."], ["Jeff B.", "Our first experience at Gozo was outstanding.  This \"neighborhood\" restaurant will become a regular stop for my wife and myself.  The menu is healthy Mediterranean style food, eclectic, but not pretentious.  The food was light, and delicious.  Specifically, The shaved brussel salad and the kale salad were both excellent. We also ordered the roasted beets perhaps with some reluctance.  It was rich and very appetizing, with the flavor of Gorgonzola. A subsequent visit included an order of two types of thin crust pizza, and both were delightful.  All of the entrees were unique and interesting enough to compel us to return and taste each menu item. The wine selection exceeded my expectations, but we soon learned that the general manager's previous restaurant venue was the California Napa Valley.  He understands wine, and his suggestion for our meal was the perfect accent to our spread.  The space was well designed and comfortable.  The urban design of the restaurant accommodated several people in a very relaxed manner. If you're looking for delicious, yet healthy food, this is a place you should consider for your next dining experience. We loved the entire evening."], ["Mats W.", "What an awful place & here's why:First, NO signage to tell you where you are or what it is. People, this is NOT Manhattan or any other fine city. This is Denver. Stop trying to be pretentious & trendy. Put up the name of your damn restaurant.Second, We ordered a bottle of wine ( 300%markup). But our first choice, a Pinot noir was \"out.\" Really? They only carry one & only have 7 wines by the glass....6oz. pours mean just that and not an ounce more!Ordered a Margharita Pizza for an app. Bland. Ordered the calamari with extra marinara sauce. It was all breading & onions! 3 pieces of calamari for $14.... Hell no. They also forgot the extra sauce. Next we ordered the Spanish Boquerones( anchovies) those never came because our inept waiter forgot. 45 min. later I mentioned them along with the extra sauce I never got with my rigatoni. My friends had the pork shoulder ..... More like pork shoulder salt lick! Kale here, kale there, enough with the kale !The music was painfully loud, the place was filled with 20 & 30 yr. old hipsters. Trendy does not make it tasty, people! The service was very spotty & forgetful. 3 people $200. So NOT worth it."], ["Melanie Z.", "Great ambiance, friendly staff, delicious fresh food! I had the calamari, it was done the right way and the marinara was fantastic. I'll be back"], ["Chris M.", "The pizza here was amazing. Although we found a piece of plastic (probably from a bag) in our appetizer and no one seemed to care. Happy hour prices are good. The greens were also very fresh."], ["Brianna H.", "Prepare for a long review!  I had read some featured articles and reviews about Gozo. So I have been wanting to check this place out.  I made reservations (8:30pm on a Friday for 4) because a best friend of mine and her then boyfriend, now fiance,  were visiting Denver. The night before their arrival he proposed :) So this dinner became something even more special.Ambiance and decor: Kind of loud but the garage doors were open to Broadway.  This sort of thing does not bother me.  We really loved that the entire restaurant was shades of white.  The lights were dim, but because of white walls it wasn't dark and heavy.  I gazed from wall to wall for quite some time. I really loved the not in your face exposed light bulbs as well.  To begin: arrived right on time, table was ready to go.  Seated by a very kind hostess. Upon being seated, I blurted out \"My best friend just got engaged!\"  She said congratulations etc.. and then said \"This calls for some bubbly!\"  Hostess took the time to bring us complimentary champagne to toast.  Awesome way to start the meal.  Our waitress (wish I remembered her name) was really chill.  Explained that all items are designed to share. She knew the food menu and drink menu very well.  We had lots of questions, she was prepared and patient.  Each plate came out individually, allowing us time to really taste each one individually.  It allowed for conversation about each dish so let's call that group bonding.  Perfect succession too, within a couple minutes of finishing one, the next came to our table.Here is the run down of our meals, we could probably just say \"loved it\" for each one:The roasted cauliflower over lentils - Very flavorful. Clean tasting, not overly seasoned, the natural flavors of the ingredients stood out . Digged the roasted cauliflower. Wish that there could have been more.  Though there was enough for four people to have a couple scoops. Beets over Gorgonzola with hazelnuts - Beets are something new to me.  Actually I think this is first time I have ever had beets. Everyone else had and they encouraged me to try them. They are great! I love the soft of firm texture.  I am not a gorgonzola person but I can see how the two would blend well together.  Light sprinkling of hazelnuts, added a nice texture.Pork meatballs served over polenta - FANTASTIC! Only three per order though. Once again not over seasoned.  The polenta was great, textured but not gritty. Smooth, warm and delectable. Calamari - I always have to try calamari.  It is one of my favorite appetizers.  Light crispy breading with a flavorful not salty seasoning.  Some of the better calamari I've had in Denver.  Sliced onions with the same  breading included.  I enjoyed those too. Somewhat like gourmet onion rings... ?Tomato, mozzarella and basil pizza - One Yelper said \"go for the fucking pizza\"  I will agree with this. Not gooey, but rather a little roasted. Clean tasting. I could taste every ingredient. I liked the simple sauce. It was a thinner sauce.  Wonderful slices  of mozzarella.  Wonderful slightly crispy crust with bubbles. Couldn't have asked for a better simple pizza.  Every pizza comes with a little dish of portioned parmesan, red pepper and roasted oregano. Someone here took a picture of their oregano and called it rotten. It is not rotten. When it is whole leaf, you can see its coloring much better. Some leaves are quite a bit darker than others. This is not abnormal. Especially when it has been exposed to heat and/or dehydrated.Chorizo, scallion, balsamic onion pizza  - Let's start off by noting that my boyfriend and my friend's fiance ordered the spaghetti and rabbit ragu.  Server came back to our table to let us know that they were out of rabbit for night.  I think this says something to having fresh ingredients.  So she informs us that we can anything on the menu on the house. Cool! Great service! You would think more restaurants would offer service like this, but they don't.  The boys could have picked another pasta dish but they chose this pizza.  My friend and I were full at this point, so we didn't eat the chorizo pizza.  The dudes ate it all.  I did try a piece of chorizo, pretty standard but what makes a difference is that it wasn't so greasy - as it can often be.  Drinks aside from beer ...Foxhole chardonnay - good stuff, smooth and dry but not tartWhite Sangria - a different kind of sangria!  With mint leaves, apples, grapes, a cantaloupe piece maybe? Whatever I loved it! Not overly sweet, very different. Not sure if this could be for everybody, but I do highly recommend it.  I will order it on my next visit. You should probably order it too. Broadway named something or another cocktail - Boyfriend enjoyedOverall, I can't think of a better experience to celebrate my friend's engagement.  Everything came together very well! Thank you Gozo for making a memorable night for all of us."]], "Cebiche Highlands": [["Avery W.", "My friend and I found this place on Groupon and decided to give it a try. I'm typically a little skeptical of places that have Groupons, but this place was too cute to pass up! We'd passed by it a lot and loved the quaint little patio and cozy vibe.We went in on a week night and were a little surprised at how few people were there - maybe it was just because it was a week night in somewhat of a family-oriented neighborhood? The decorations were vibrant and awesome and really made me feel like I was in a different country (not that I've visited Peru).My roommate ordered the Tacu Tacu Con Lomo Saltado (lentils, white rice, beef) and I ordered the Camaron Cuzco (shrimp in white wine sauce, white rice, salsa). My food was tasty and I loved the presentation. The shrimp was really flavorful and well-cooked and the red sauce on the rice was SO yummy!  I will say it was a little saltier than I prefer, but that's pretty standard for a lot of restaurant food. My friend's food was also good - even saved well for the next day's lunch.The servers were very attentive although the food did take a while to come out. Cebiche Highlands is a fun place to try if you're looking for a casual dinner with a Latin flare and different vibe that your typical brewery or burger bar. Check it out!"], ["Mark M.", "We were a table of 4. Food was mostly decent but service was unacceptable and it ruined the meal. TOOK 90 MINUTES to receive food after we ordered...  Needless to say, we won't go back.An apology from the waiter didn't  help. If it had been my restaurant I would have been so embarrassed I would have told my customer there is no need to pay!!!"], ["Balogna B.", "I am honestly SO disappointed a day later, I am writing this review. So let me begin with saying I have never been to Cebiche Highlands, but I ordered delivery last night. In hindsight it was a mistake because I am convinced the \"Highlands\" location is the only explanation for their OVER PRICED food. I ordered the anticuchos with chicken, described as: three skewers with choice of meat and fried potatoes, on the menu. To me that sounds like a lot more food than I ended up with. It was more like one skewer worth of meat and three slices of potato. The flavor was nice but on the edge of being over cooked. Not impressed. I also got a side of plantains, which were good but nothing special. At the end of the day DON'T ORDER DELIVERY, its just not worth it. Perhaps I will make a trip up there to experience the atmosphere but probably not."], ["Lana S.", "Meh meh - a meh for each star. While I love Peruvian food by no means I claim to be an expert. Back on the east coast there was a Peruvian cafe I used to frequently visit. I loved the intimate atmosphere, friendly owners and excellent food. My experience at Cebiche Highlands was quite subpar.I will start with the good. The hostess/ waitress was super nice and always smiled. She refilled our drinks fast and checked on us more that our server did. The home made dressing on Ensalada De Plata was really nice. Hm... I guess the good stuff ends here. The not-so-good observations:The atmosphere and the decor were quite off-putting. I couldn't make out which style they were going for. Some parts of the restaurant looked like an old diner from the 70s with outdated tile on the walls. Other sections looked Peruvian with cute little llamas and traditional Peruvian statues and decorations. I absolutely love ceviche, so of course I ordered Ceviche Classico (with flounder and octopus) . The octopus was quite chewy and there was barely any of it at all. I found the amount of lime juice to be extremely high. I know sour taste tolerance varies from person to person. Personally, I can eat a lemon and not cringe even once. I certainly had quite a War Head face going on while trying to finish the dish. My boyfriend had Bisteck a Lo Pobre - dry, tough, and no flavor. Once again, red onions made up 20% of the dish. The restaurant is not cheap at all, especially if you take into consideration the small portions and mediocre food.  During our visit there seemed to be a decent amount of regulars (I noticed that a lot of visitors knew the staff personally), but for a Friday night in Highlands the place was not packed at all."], ["Luciana F.", "My family is from Peru so I have very high expectations for Peruvian food. I came here with a friend on a 70 degree Denver summer night and we got to comfortably sit outside on the small patio. (only 3 tables avaible for outdoor seating)My friend and I decided to share the yuca a la huancaina, ceviche de pescado and the classic lomo saltado. Surprisingly the Ceviche de pescado was the star of this meal. The fish was fresh and flavored correctly and loyally.  I would pass on anything with huancaina here. First, the waiter described it as a \"cream cheese\" sauce, which it's not, it is a queso fresco based sauce. Then proceeded to argue with me about how it's to be made. Then, when we received it, the color was not only off (white instead of pale yellow) but so was the consistency, although it didn't taste like cream cheese it definitely did not taste like Peruvian huancaina to my disappointment. The lomo saltado was also flavored well and the rice was cooked the way my grandmother makes it but I would have preferred a higher quality of meat, it was a bit too chewy.   Service was slow as well. The restaurant was pretty empty yet we were there for an about an hour and half, which I didn't totally mind, my friend and I were not in a rush but something to keep in mind for future visits."], ["Mark T.", "Nudged by a recent visit, it pleases me greatly to inform you, yes, YOU, about the many sumptuously succulent offerings you can expect to find at that popular Peruvian pleasure palace, Cebiche in the Highlands.Why not get to the heart - beef heart, that is - of the matter by starting with an Anticucho or two? These well-seasoned grilled meat skewers (also available with chicken or beef steak for the more squeamish) will help kick off your meal in a most palatable manner. Another really nice starter is the Papa a la Huancaina, taking fluffly nubbins of potato and drenching them with a sauce consisting (in part) of creamy queso fresco (a bit akin to feta cheese), zingy yellow peppers, and, yes, a few crushed saltines to give the whole thing just that extra bit of body. But then, why on Earth would you visit a place called \"Cebiche\" without tasting the eatery's namesake dishes of spicy citrus-\"cooked\" fish or shellfish? (For a little history lesson, try the soy/sesame sensation \"Nikkei\", a nod to Peru's sizable Japanese population!)Oops, it's time for your main course - hope you didn't pig out too much already! What will it be this evening? Tacu Tacu is a mixture of rice and canary beans fried together with cubed beef steak (and, if you like, supplemented with plantains and a fried egg) -  mmm, ¡que rico! Alternatively, you can avail yourself of a sauté of shrimp with white wine, cilantro, and garlic, inspired by the flavors of the southern Peruvian city of Cusco. Another idea for you is veggie-and-egg-packed Chaufa - if I told you that the name comes from the Chinese expression \"chao fan\" meaning \"fried rice\", would that tell you what the main ingredient is? I thought it might. If you prefer long slurpy noodles to rice, try the Tallarin Saltado (again, available with beef or chicken). Yes, Peruvian cuisine is host to a bounty of flavors - visit Cebiche and sample 'em all!"], ["Paula H.", "Just because I adore when a restaurant owner/employee takes the time to tell their story, their history, the ingredients and their origin, and when they start talking, you can see the passion.  I gave this experience a 4. Stefano is into food, and more than that.  He is about the experience.  Yeah, the outside patio lacks charm.  (There is the extra star) But the nikkei ceviche and pescado sopa were delicious and service delightful."], ["Borzou O.", "The food was okay, but it was very over priced  for what it was. Two shrimp platters we ordered only had 10 shrimp between them and we paid about $30 for it. The staff was nice and friendly. The building had no A/C and the window was open, allowing flies inside."], ["Jess V.", "Awesome food and sweet server. I think the only complaint is that he most likely forgot to put our order in(long wait) and then asked us mid-meal if we wanted a pancake lol!!!If you want to confuse me, serve me an appetizer, then while I'm waiting for my food ask me if want a pancake??Anyway, it was good for laughs and we will be back!"], ["Christopher B.", "My one hesitation about coming here was the overall 3.5 star rating. I didn't get a chance to go through the reviews until now. I think some are unwarranted, some are from people who don't understand this cuisine, and some from random bad experiences.Let's just say I am super happy I came here. I'm spoiled from amazing Peruvian food in LA, which was reinforced by my experience in Peru. One of my favorite dishes in Peru was ceviche, which was made super spicy (and I loved spicy). Normally these dishes in the US just lack that kick.During my dining experience here, I ordered the Cebiche Mixto, which was fresh, exploding with flavors, and had a great kick to it. It was one of the best ones I've had and definitely the best in Denver. My friend ordered and shared the Choros A La Chalaca. I didn't see this on other reviews but THE BEST mussels I've ever had! This is absolutely a Top 5 dish for me in all of Denver to this point. It was prepared very similar to ceviche, served in 6 giant spoons (think Pho spoons) and was spicier than my ceviche. The flavor was absolutely out of this world.The waiter was good and on top of things. Everyone had an overall friendly demeanor. I just felt like the atmosphere was lacking just a bit so I couldn't give this place 5 stars but certainly for the food we had it was a 5 star experience. I'll be curious to come back to try some items off the regular menu to see how they compare to my other experiences."], ["Kathy L.", "Cebiche Highlands was a random place I found in Denver and the environment caught my eye because it was like those restaurants in the romantic movies on the corner of the street. Before dining at the place, I decided to look at the reviews on yelp. Overall, the reviews showed a four and half star rating which demonstrates how well presented the restaurant is and  the food quality. Looking over the customer's review, their opinion showed some trust because they described the pros and cons of the restaurant.  I thought Cebiche Highlands had an environment that felt like you were at home. It had simple decorative painting, there was no music and the only sound you heard was the conversation next to you or the food being made. The place wasn't fancy, it felt like everything was crammed because the bathroom was literally right next to where you ate. The lighting and the windows made a difference because it opened up the room to show it had space and it gave more of a happy aroma because of how bright the place looked and it wasn't so dim and gloomy. There wasn't anything unique about it expect the atmosphere was different. From past experience of a fast pace restaurant where all the servers were busy, the servers here were all calm and they attended to your every need with great manners. They never were over attentive which I liked. They made it comfortable by showing me the menu and explaining what was in the food since it was my first time there. Everyone there were dressed casually, they seemed like people who were looking for a restaurant to eat at and this was the first thing they saw and just decided to eat here. I saw that most of them were there to try out the alcoholic drinks and the seafood because they were Peruvian cuisine. The best quality of the restaurant was the waiter because I didn't need him to come refill my cup and he didn't ask too  many questions while I was eating. He waited until I was done to come back and ask if I wanted anything else. I ordered the Tallarin Saltado which was a peruvian style linguine with stirred fried chicken, sauteed with red onions, tomatoes, and cilantro (It cost $16). I don't think the portion merited the cost because it salty, it was like eating a tablespoon of salt. They didn't add enough chicken and noodles to balance all the flavors coming from the strong taste of the red onions and the salt. I would compare it to Olive Garden since they consist of pasta and linguine and variety of seafood and other meat entrees. Once the food settled in, I felt disappointed. The food that was served to me because I  expected so much from it. It was something I expected to be fresh and flavorful and different but it wasn't; it was dry, salty, and they added too much of the red onions which also gave it a sour taste.. But overall the place was great because they gave you a warm welcoming for coming and the servers were nice and mannerful of what you wanted."], ["Jessica N.", "Unfortunate experience at Cebiche. We had a Groupon so we got to try quite a few things. I really enjoyed my wine and think their Latin American offerings in that department are great (I took a picture to save for future shopping). However, this was the only thing I was happy with. We ordered the fish cebiche and the texture really threw us off. Chewy instead of flaky. The citrus flavor was there, but it wasn't enough to support the dish. Our other two entrees were alright, but I ran into a rather hard chunk of cartilage in my beef and my boyfriend found a small bone in his chicken. Our appetites were quickly lost and our leftovers remain sitting in the fridge uneaten. The atmosphere is mixed. There are groups of friends enjoying wine and food, single diners watching sports, and loud families with kids bumping into your chairs (this may have been an experience unique to my visit). Not great for conversing on date night."], ["Jessica T.", "Expectations exceeded!After reading varying reviews, I wasn't sure what to expect coming here. But what I found was delectable food, in a great location with a server who could not have been more awesome.Came here with a friend (and a WeeklyPlus deal!) on Thursday night at 6pm. Walked in, it was just us and one other table. Server was very welcoming. I asked him to tell us a little about the Pisco Sours, and he told us it was difficult to explain and he'd bring us a taste. The tasters were adorable and perfect for selling us on ordering them full-sized! I also tried the Cebiche Punch, which the menu describes as having cinnamon; I assumed it was the same ground cinnamon in the Pisco Sour, but unfortunately it was liquid cinnamon which was overpowering and made it taste too much like a red hot candy...couldn't even finish the drink, though I think it would be a great drink without the liquid cinnamon.We started with the Cebiche de Camarones appetizer- the shrimps were large, tender and sweet. The accompanying onions, potatoes, hominy and the kick of spicy pepper was phenomenal! Most unique and flavor packed ceviche I've ever had. The citrus sauce was so good we stopped short of drinking it with a straw; when we told the waiter that, he told us that pretty soon it would actually be a cocktail offering!We shared 2 entrees: Arroz con Mariscos and Lomo Saltado. The special was the Arroz con Mariscos, and it was amazing! Tender octopus, lots of baby scallops (perfectly cooked), more shrimp and mussels in rice.  The flavors were complex and delicious; and we loved every bite! The Lomo Saltado was very good as well. Decadent sauce over tender beef, with yummy fries and rice to soak up all the juices.Finished off the meal with Picarones (sweet potato/potato \"doughtnuts\"), and those were good. Not too dense or sweet, with a yummy rum sauce. My only complaint was I didn't realize they have anise seeds in them, and I'm really not a fan of anise (black licorice flavor) so I couldn't eat more than half of one.Service was spectacular, personal and fun when we sat down.  Shortly after we were served our appetizer, a group of 15 came in, then another 2, then a table for 4, and so on...and the poor waiter was all by himself serving, bartending and bussing tables. He handled it with grace and appropriate contact assuring us he hadn't forgotten about us. Thankfully, we weren't in a hurry and were enjoying our conversation so while it was quite slow, we weren't too concerned. Most importantly the food came out hot, and we enjoyed it immensely.All in all, I WILL be back! So many other great sounding things to try on the menu!"], ["Kristine N.", "The atmosphere is weird. As soon as we walked in, it was pretty awkward. It's a small restaurant, no music so everyone was listening to our conversation, the decor is dated, and the furniture is uncomfortable. The bathroom is also very very awkwardly placed and needs an update.We ordered the calamari to start. It was soggy and chewy. No crisp at all. The tarter sauce was pretty simple. Then deep fried mashed potato was delicious. It was just a huge ball of mashed potatoes, meats, onions, and egg. Then we shared the paella dish which came with three mussels, two shrimp, and some squid. It was gooey and a bit on the sour side. Wasn't horrible but wasn't the best.Came because I found this place on restaurant.com. Probably wouldn't come back.Service is nice but awkward."], ["Tiffany C.", "They serve the worst quality fish available in the US. It's called Swai. Look it up. They must have to buy that because they can't afford better quality. For a seafood and meat dominating restaurant, you would think they would serve something of higher quality. The only thing worth going there for are the Pisco Sours but given the quality of other items, I wonder where the eggs come from. Staff is very nice. Place is pretty clean. However, both times we have been, there was only one other table occupied.Specifics: Ceviche tastes like it has been frozen. Calamari appetizer is bready and soggy. Aji de Gallina is bland at best. Rice is dry. Tallarin Saltado is basically soy sauce soaked noodles."], ["Michelle K.", "My husband, son and I went in for a spontaneous dinner while in the neighborhood. We had seen Cebiche while in passing before and thought it would be fun to check out. The waitstaff were nice and even a little playful with our son, who wanted nothing more than to pet the llama rug in the hallway. My husband ordered the classic flounder and octopus ceviche, which we both felt was tasty. I might have preferred a little more citrus flavor, but it was still well done. My bowl of shrimp chowder was very tasty. I wish it had come with a side of toasted bread to sop up the delicious soup. All in all, I would come back and be excited to sample more of their dishes."], ["Sue G.", "A simple, unassuming place that serves some of the best Peruvian cuisine in Denver.  I've had the Tacu Tacu a la Pobre on twooccasions, and it is extraordinary how the chef can bring out the subtle flavors of rice mixed with lentils in such a complementary way.  Their ceviches are good but fairly standard.  Their lomo saltado is bomb.  They serve good desserts too, but I wish they had alfajores!"], ["Ryan F.", "Best Peruvian food in Denver.  Lomo Saltado and the Ceviche de Pescado are must haves.  Love this place, always a good time."], ["Michelle N.", "Food is really good. The sea food seemed fresh and the octopus was so yummy. The service was terrible though. We ordered drinks and appetizers and it took 25 minutes then another hour just to order and get our entrees. The staff seems annoyed and bother by the customers. I would recommend the food but not the service."], ["Randy C.", "I had wanted to try something different. So I'm thinking Peruvian may sound good. Bad bad mistake coming here!The only star I will give them is the cool server they have. Other than that the food here is garbage for what you pay for.At first I had assume the place have a lot of potential by looking at the menu selections. They have tons of ceviche selections and a good variety of dinner choices, and the server was very nice and helpful. The atmosphere was lacking. They try hard to create a homey feel and it was not at all. I felt like the owners their decor, tables and chairs at goodwill. The chairs is really cheap and old. They will need to be replace it soon or someone will get hurt once it breaks.For the appetizer I figure we should try a Peruvian Ceviche style dish. So we had ordered the Cebiche mixto, a seafood mix with baby octopus, fish, shrimp, and scallop cook in lime juice. It's sounds pretty darn good right? Wrong! The seafood was not fresh, it was horrible. The squid was super tough, no scallops, shrimp was gummy, the fish was too fishy, and the sauce was extremely citrusy. The seafood is just not fresh and it tasted like they left it in the fridge soaking in lime for weeks. I was really disappointed.At this point I was really disappointed with the appetizer,  but I still have faith in their main meal. My gf had ordered the Lomo Saltado with beef. It sucked. The soggy fries mixed with the very salty beef onions did not worked well. If the fries was a little fresher it would had worked. The rice was garbage. We could not eat the rice because it was so dry. I had ordered the Bisteck A La Podre. Garbage! If they served this at Waffle House, the cook will get fired. The steak was very thin, overly cooked, and very salty. They might as well make beef jerky out it. The eggs was greasy, the rice was super dry, and the plantain was actually alright. I felt like I got ripped off with this place. The food was overly salty, citrusy, low grade quality or old meats, the rice I would not feed my dogs with, and it was too expensive. I have been to many restaurants, and so far this is the worst place I had so far in Denver.Tip to the owners fire the chief!"], ["Alia Z.", "Delicious super spicy ceviche, and husband liked mussels for the first time. Get the mussel appetizer, the mussels will be fresh, spicy, and huge and come with salsa type sauce on top which is unforgettable."], ["Stop Stalking Me S.", "Summary: One of the best peruvian places in Denver (amazing taste! as true and real as it gets!), but at the sacrifice of high prices/small portions, slow service during high traffic (be prepared to wait) and not so convenient parking.Long version: The food is amazing. The taste like I said in my summary is quite something. This not Los Cabos poor half ass taste, this is as true as it gets. Remember that peruvian food needs fresh ingredients that are hard to find in the US like any international cuisine and this place manages to do it. My concern and dislike is the size of the portions. I left hungry after a reasonable tab, the pisco sours are american style (soft) but tasty. The cebiche amazing, the papa rellena was also tasty, the pescado a lo macho a work of art, but... I left hungry because the serving size was too gourmet for my taste. Just so you know I'm 6' tall, 185 lbs and not a KFC/Burger King fan ranting about being hungry. I will drop by again i the near future, see if I feel the same way. I will update this in case portion sizes change somewhat or the prices adjusted to the amount of food you are getting."], ["Melody C.", "My husband and I went there for a date and fell in love with their food. Tiny restaurant, which is where we love to go dine, with great taste of Peruvian food! Server was very nice and full of knowledge explaining how everything is made, and he even told us that the owner shipped most of the ingredients from Peru so that we can have authentic taste here in Denver."], ["Rosio W.", "A solid 4 stars. This really has turned into our go-to for Peruvian food int he last year. Since my last review, they have updated their menu but the food is still great. They still make anticuchos apps and they are my fave. Make sure you get the corazon, otherwise, why bother, right? But, if you are anti-corazon (I don't understand this but...), they do make anticuchos of beef or chicken. Since my last review, they have added picarones on a regular basis. Picarones are a fried dough dessert with a syrup/honey dip, very yum! The dip here is a bit thick but still good. Everything else is great here, the food is always consistenly good. Service is still a bit slow but always friendly and helpful. Decor hasn't changed much either but it works. Again, this is our go-to for Peruvian and we will keep returning as long as the food stays good."], ["Brian M.", "When the woman inside tells you they will open in 4 minutes, then you end up waiting more than 20 past the listed scheduled opening, THEN you see her take off and NO ONE is in the front setting up. You are off to a BAD start, and not worth me sticking around to review your place."], ["Leslie H.", "Wow, loved the tacu tacu...and I've had it twice now. Paella is quite delicious and of course the ceviche is great....I had the yellowfin option. Restaurant is quiet and clean. Was seated right away and service was prompt. Prices are $13-$18 per entree."], ["Laura A.", "AMAZING Ceviche! For sure the best I've ever had! Everything on the menu is sensational! The waiters are all super nice and helpful! Love this place and the people who work here! Check it out if you like your food delicious!"], ["David R.", "Good service. Mediocre, at best,  food. And shockingly expensive considering the portions and atmosphere."], ["Dave T.", "Peruvian may be my favorite Latin food, or pretty high on the list.  Within the last three months I have been to three different Peruvian restaurants and liked them all.  With sushi restaurants you can sometimes compare apples to apple between them by comparing their spicy tuna.  With Peruvian, if they have it, I compare the Arroz Chaufa.  This is the Peruvian verson of chinese fried rice.  I know you say...why is he trying chinese food in a Peruvian place?  Much of my family is from South America and the equation is settlers (British, Dutch, Spanish, etc) + indigenous + workers (Chinese, African, Indian, etc) + resources = unique.  You can add more or subtract some, but the result is alway a local unique dish.Arroz Chaufa is delicious and Cebiche does it well!  I tasted my friend's dish although I forgot the name, it tasted amazing.   The atmosphere is great, there was even a private party outside allowing us to eavesdrop on their awesome latin music.  David the server has a long and knowledgeable history with the place.DT"], ["Dale Z.", "Similar to other folks, we came here with a Groupon.  It was mid-week between 6pm and 7pm, and the place was not busy at all.  The service was very good, and our waiter made helpful suggestions.  I had a taster of the Pisco Sour.  I wasn't really in a drinking mood, but the flavor was excellent.For our selections, we ordered three of my \"go to\" Peruvian dishes and one other.  We started with the Papa A La Huancaina (cold sliced potatoes topped with a rich cream sauce).  I love this take on a Peruvian tater salad.  This one was creamy, and good, but did not have the spiciness I usually expect.  We also had the Lomo Saltado (strips of beef or chicken marinated in vinegar, soy sauce, Peruvian spices, sautéed with red onions and tomatoes, cilantro served over white rice and French fries).  I usually prefer beef, but we opted for the chicken, and it was quite good.  This dish always reminds me of a Latin/Asian fusion, with a little something for everyone.  The Bisteck a Lo Pobre (fried steak with sautéed red onions and tomatoes, topped with fried egg and sweet plantain) was probably my least favorite dish, but it was still pretty good.  Finally, you cannot really go to a place named \"Cebiche\" without at least trying the ceviche.  We opted for the Cebiche de Camarones (Shrimp cooked in lime juice & Peruvian spices, topped with marinated onions).  This was the best ceviche I have had for quite some time.  The shrimp were large, tender, and fresh.  The sauce was tangy, spicy, and perfectly salty.  It was excellent.Prices overall seemed a bit high to me (based on the serving sizes).  However, since we were using a Groupon, most of the meal cost about half of what it normally would.  I would definitely come back again."], ["Pablo R.", "First off, this place is in a great location and the service was awesome!   I had a Pisco sour which was yummy and my friend had a blood orange margarita that was also very good. For appetizers we had ceviche and seared tuna that was mouth watering. I am giving this place four stars and not five because I was not fond of the taste within my main entree. I had the Cameron Cuzco and maybe It just didn't jive with my taste buds but our server said it was one of the best. But, I did taste my friends Peruvian paella and it was delicious!  I would definitely go back for drinks and appetizers and to try another main dish."], ["Becky R.", "Came here with a friend to use a daily deal... on the last day (never a good idea)... and the place was pretty packed!  I went inside and got a table for 2 and we were seated immediately - great start!  Unfortunately, that's where the quick service ended.For two of us, we got 4 drinks, 1 appetizer, and 2 entrees - and we were there (no joke) for nearly 3 hours.  Thank goodness we had plenty to talk about and that we liked each other, because that's how slow the service was!  I swear there was only 1 waiter working the entire restaurant!The appetizer was yuca fries, which were pretty yummy - dense and heavy, but nice tasting.  I got some sort of fish which was really good, and my friend got the loma saltado - which had a hair in it (not her's).  I don't know what it is with me and my dining companions getting hairs in our food, but it seems to happen fairly often (and I know for a fact that short black hair did not come from either of us, who have long blond hair).The food (aside from the hair) was good, but I likely will not return due to the painfully slow service."], ["Alysha T.", "My parents took us here for my husband's birthday. The food was great, but if you are looking for a quick meal, this isn't the place for you; it took us 2.5 hours without desert. We had Pisco sours - which are quite good- an appetizer and got four dishes for the four of us which we all shared. All of them were great. My favorite was the risotto paella. If you walk-in and aren't acknowledged right away, hang- on a second.  There is only one waiter and he will seat you, just be patient ( you aren't being snubbed)."], ["aaron n.", "My girlfriend and I went here last night on a groupon. To start the service was very bad, some of the worse I've seen in a long time. The Rockies game was on TV and every employee was far more concerned with the game than actually servicing the customers. It took almost 2 hours from start to finish for our meal.The Yuca Frita for an appetizer was OK. I had Bistec a lo Pobre for an entree which was good. The sweet potato fritter dessert we got was very bland, it was in desperate need of more honey or sugar. Overall the food was average and the service was very poor. I would try another Peruvian place next and would not likely come back."], ["lynn l.", "I saw the 3.5 star rating for this place but we were hungry and it was a Saturday night. we had the calamari which was good but small portion, crispy batter and not tough. ceviche good not great. we had the fried steak with egg on top. I am a sucker for a fried egg over anything. good spices but meat was tough. Service was very attentive, efficient and courteous.  it is in a charming old house but it's quite loud because of the tin ceiling. there are many options in this area but it was good in a pinch."], ["Kenny N.", "Yesterday evening was a disappointing experience at Cebiche. We ordered four dishes, the cebiche pescado, yuca frita, Peruvian linguini, and the chicken with walnut sauce. The first notable thing was the interminably long wait for our items. It was a slow kitchen day and we weren't the only affected guests.Once the cebiche and yuca frita arrived, we tucked in. The cebiche was remarkably chewy, which led me to later research cebiche. That was enlightening and made me think that the fish was over marinated, thus leading to this texture. The yuca frita was an inconsistent mix of yuca to batter ratio. Again, my last experiences were so much better.The entrees were a step up, but my date and I met some meat issues in both dishes. And the walnut sauce wasn't as smooth and creamy as before. It had a separated look to it. I've certainly had better times here and I hope this night was an aberration."], ["Carolyn M.", "The food at Cebiche was excellent. Excellent! I don't see the cebiche I ordered on the restaurant's website, but it was made of yellowfin tuna, and it was to-die-for. The Pescado a la Macho was excellent also - a delicious fish surrounded by seafood in a shellfish-y sauce. YUM. The place was empty on a Thursday evening, but the space is warm and inviting. Service was good, and our waiter made some excellent recommendations. The pisco sours were top notch!"], ["Todd A.", "Well I'd love to have a better review than this, but we showed up yesterday after taking the bus from Westminster down to this restaurant because we wanted to try something different. We had a day planned through Denver and this was our first stop. Well by 3:15 there was not a soul to be found in the restaurant, no lights on, and the open sign was still unlit. The problem I have here, is if you don't even have your chairs set up, still stacked, no lights, then how far can the food prep possibly be....sorry but if you can't even look like you give a hoot that you open on time for your customers, then clearly you don't really care. Might want to look like you're actually opening when you state you are actually going to open. What a waste of time for us, highly disappointed. (never even got to try this food I hear is suppose to be good)."], ["Maria B.", "It was great not having Mexican food....again.   However, I was not quite impressed with the ceviche of all things.  Fail.  I think the fish needed to cook longer in the citric juices and maybe cut them a little smaller.   Highlights - the maduros and pisco sour."], ["Shrea S.", "It's nothing fancy, but I thought their food was awesome! I got fried rice and this potato appetizer with this awesome cream. Definitely would recommend and there wasn't any wait when we went!"], ["Melissa H.", "Cute spot for dinner - the menu contains a variety of dishes that range from seafood, meat entrees, and pasta.  It's a cozy spot and on a weekend night if it's crowded it can be very warm - so leave the heavy coat at home.We came on a busy Saturday night and service was very slow.  It looked as though they could use another server during peak dinner times.Our entrees were tasty but seemed on the salty side.  I had the milanesa which was a lightly breaded chicken breast and would've been cooked just right if it wasn't for the overpowering salt.Prices for entrees are in the $15-$20 range."], ["Amanda G.", "This place was good but not great. I'm not exactly a peruvian food expert but if you're craving some lomo saltado drive down to East Colfax and go to Pisco Sours. It's just better. BUT, if you don't feel like leaving the west side this place is good. We had a groupon, and apparently so did everyone else because this place was packed and had only two waiters and one rather surely and aloof hostess (which is impressive if you think about it. It's kind of hard to be both those things at once. Way to go, hipster hostess). Our server was great, he just had way too many tables. We got the oyster appetizer, shrimp ceviche, and lomo saltado. The ceviche turned out to just be lime shrimp, which were good but nothing special. I did however really like the fancy corn nuts that they give you to snack on. Those get 5 stars. Moral of the story: his place is pretty good, especially if you have a groupon. But if you want better than pretty good you might want to drive to the other side of town."], ["Matthew M.", "Delicious! It's the closest thing I've tasted to eating in Peru. I only wish they had Peruvian beer consistently, but the food's so good it doesn't really matter."], ["Danielle G.", "This place is delicious and the staff is friendly. Glad to find some great peruvian food in Denver! Had the Lomo Saltado. Will be back!"], ["Daniela B.", "A total disappointment. Food is bad, service is terrible and place is dirty.As an Ecuadorean that grew up with great ceviche , I was looking forward to having some South American favorites. We ordered the fish ceviche but after 2 bites, I knew I could not eat that dish. The fish was hard and pungent, not what you expect when using high quality fish combined with lime juice, cilantro and hot sauce. My husband ate the rest of my dish but just not to leave it to waste and because he was starving.For main dishes we ordered aji de gallina which was just dreadful and beef with fried egg which was ok, but underwhelming and it is hard to get it wrong...cheap piece of meat pounded until flat, then grilled on lots of oil with a fried egg on top.My husband also ordered a side of fries, but they arrived after we finished our mealService was bad. We waited 15 minutes at the entrance before a waiter noticed us and told us to sit anywhere. After another 20 minutes waiting, we asked for menus, otherwise we would've sat there even longer. The fries arrived after the meal as mentioned, and we had to keep our silverware between dishes...from fish to beef  without any option. After the bill arrived, we waited another 20 minutes before I called a waiter to take our card so we could pay and get out of there.The place has no atmosphere and the women's bathroom was quite dirty.Our bill came to $50 for 2 entrees, 1 appetizer, 1 order of fries, and 3 bottles of Coors Light. We had $15 off through a $15 for $30 Groupon, but it was still too much money for awful food and service. Never again"], ["JC C.", "Well our meals were fantastic! Went in with a Groupon deal.  We tried a lot of food.  For an appetizer we had the shrimp cebiche which was so good I wanted to drink the sauce.  It was presented on a plate with other relish items - kind of like a salad.   Expensive at $15 bucks though. For my entree I ordered carne Loma (?) I think it was called.  It was at the top of the menu.  It was a beef stir fry with vegetables and rice.  Excellent tangy sauce.  Delicious. Husband had a white fish dish and it looked plain, but he said it was 'really good.' My husband is hard to please and usually says 'it was ok,' so 'really good' is really saying something.  We also ordered a side of fried plantains which I freaking love and although they are hard to screw up, it just added extra yum factor to our meal.  For dessert we ordered rice pudding which was delicate, warm and not too sweet.  The only criticism I have is the interior of the restaurant.  Clean, but the decor needs help. It looks like a basement man cave and has some really garish lighting.  Uncomfortable straight-backed chairs. Husband had to switch his out during our visit.  I'm giving it 5 stars for the food and the perfect service.  Yes, we will be going back!"], ["Adam J.", "I've been here twice, and both times had basically exactly the same thing, so I may not be what you'd call an expert on the entire menu.  But here's what I can tell you:  the pisco sours are good and strong.  One in and you can feel the buzz, and two will get you right to where you want to be.  Don't be weirded out by the egg white foam - it's basically a less citrusy margarita.  The sangria is also some of the better sangria we've had.The second time we went in, we were greeted with a free bowl of corn kernels, and man, were they simple and good.  Lightly salted, but mostly just the natural flavor of the corn shone through.  Very tasty.Both times we had yucca frita to start, which is basically a starchier french fry with a good cheese mustard sauce.  It doesn't look like a lot, but it's dense and filling.Tanya loves the lomo saltado, which is a plate of steak, french fries, onions, and peppers.  It sounds really simple, but the seasoning is very flavorful.  In fact, three of us had a steak based dish the second time we went, and everyone raved about it.  I honestly can't remember the names of the other steak dishes, but one was a green spaghetti thing that was pretty decent, and the other was basically steak and eggs, which I didn't get to try, but Pete ate the whole thing in about five minutes, so it must have been good.What I get is the arroz con mariscos, which is a big plate of rice with lots of seafood:  tail-on shrimp, mussels in the shell, rings of squid, and cute little octopuses.  It comes with this fantastic hot sauce in a side cup.  \"Be careful,\" the waiter said the first time.  I ended up dumping that whole cup on there and it was great.  It IS hot, so if you're not into spicy food, watch it.  But if you like spice, drown that sucka.  It is a great meal, this arroz con mariscos.  I doubt I'll ever order anything else.This place is slow, though.  Don't go expecting to get in and out in an hour.  It's a family owned business with (I think) one chef making food for everyone, so it can take a while.  But service is spot on, the food is awesome, and the prices are totally reasonable.  Do yourself a favor and try it out, even if you know nothing about Peruvian food.  We didn't, and we are definitely converts now."], ["Jared A.", "We randomly found this place walking down the street and have been back several times! Great service, super delicious food (everything we have tried has been amazing!), fun patio to sit at on warm afternoons!"], ["Taymar P.", "So delicious! My son ordered the pescado a lo macho and it was amazing! Various seafood in a pepper sauce. I had the pescado ceviche, which was delicious. My husband had a beef dish that was good, but the fish dishes were our favorites. Ask the server about your dish before you order. The English translations aren't always spot on. But he explained them before we ordered and the resulting dishes were better than described! Only 4 stars because the lighting is too harsh and the kitchen is loud with no music and some loud grinding noise. If they work on the ambiance this will definitely be a 5 star dinner destination."], ["Arianna G.", "So I have been here twice and the first time was awkward and reflected some of the other reviews (long time to get sat for no reason etc) but this time, wow.The server was working alone as both bartender host and waiter and he rocked it. I overheard him describing his favorite dishes to other tables and I wanted all of them. He even dealt with old white ladies trying to speak Spanish with aplomb. I had the Peruvian sashimi (can't remember the name) and it had just the right heat and flavor. The corn on the side and potato is just like the Peruvian restaurants in FL and it tasted so authentic. I also had a blood orange marg and they are pretty big so get ready for that. Moral of the story: Service is looking up! Give it a shot, the food is more than worth it!"], ["Rachel C.", "Pisco sour is delicious! Took boyfriend here to celebrate graduation and everything we got was delicious, actually. I got arroz con mariscos and he got seco de carne. The seco de carne was melt in your mouth good and the arroz con mariscos was piled high and I still wanted to gobble it all up. YUM."], ["Mo C.", "Absolutely delightful!I gotta say, those who went in to Cebiche and it was \"dead\" on a Thursday night obviously didn't go in the day before the Groupon expired, ha ha. The place was packed! And, the one server in the entire place, Stefano (Side note, is there any hotter name than Stefano? I think not.) had it completely under control. Incredible. To those who have made comments about service on prior visits, they have obviously solved the problem. When the place got truly crazy, some folks appeared from the back to cover seating, turning tables & drink orders. Nay-sayers, give this place another shot. Drink It: The Malbec. I have a weird fascination with Carmenere, so I always order it when available by the glass. It was good, but the Malbec was fabulous! It was earthy with fruit highlights. (Yes, I understand I just said it tastes like dirty fruit, but you wine-ohs know what I'm talkin' about.) And, this place pours real glasses of wine, not those glorified shot glasses on a stem at some other places. These were solid 5oz+ glasses of wine, in a nice big glass so you could really get some nose. I heard sounds of delight around the room with regard to the Pisco Sour & Sangria, as well. Eat It: The Muscles Appetizer. It was heavenly. Six huge, cooked muscles on the half-shell topped with a fab lime juice based salsa. It could have been a main course. Awesome.Eat It: The Garlic Shrimp. The description is a bit deceptive. It says \"creamy sauce\". Nope, it's a fantastic garlic-butter sauce that is so good that if they served it by the glass I would drink it! Incredible.The menu is surprisingly well priced. The priciest item on the menu was under $15. Glasses of wine were $7-9. I absolutely cannot wait until the weather gets warmer and I can bring some friends and enjoy the patio. LOVE this place."], ["Alicia K.", "Overall a 3.5 star place. After reading some of the reviews I'm a bit bummed that we weren't served the traditional cancha. I was actually telling my friend at dinner that in Peru you get them at the table and they are like giant corn nuts. I just assumed they didn't have them. It was a lovely night and we sat out on the patio and ordered two cusquenas and I was transported back to peru. All I needed was some festive music and those hosts outside the restaurant guaranteeing passer-bys free pisco sours to dine at their restaurant. Our waiter David was very friendly and eager to make suggestions. He rattled off the specials of the night and we decided on the chicharron de pescado, a lightly battered catfish with the giant corn kernels and limey red onions. We also got the papa rellena, a deep fried mashed potato with meat and egg in it. And of course we had to order the lomo saltado. Like me, I think it's most people's favorite go-to Peruvian dish. Strips of meat with potato (french fries), tomato, onion, and even complete with my pyramid shaped rice (like they serve it at the fancier restaurants in Peru). Too bad the meat was a bit overcooked and chewy. But David did bring us two sauces to try, both really spicy! A combination of last nights dinner and the book, 'Turn Right at Machu Picchu' makes me more then ever want to be back in the land of the Incas."], ["David G.", "Been here twice on pretty sweet Groupon deals ($25.00 for dinner for two).  The first time it was not busy to the point of being creepy (we were the only ones in the place).  The second time it was more crowded, but it didn't seem like there was ever a wait...for a table.Our second visit was a Friday night when most of the tables were full.  I don't know if that was the cause of the slow service, but something was definitely not working the way it should have.  The server took forever to get to our table just to take our order.  Once the order was in, it took much longer than it should have for our food to reach the table.  We were actually approaching three hours by the time the check came, and most of the time was waiting for the order be taken and waiting for the appetizer and entree to come out.On the bright side, the server was friendly and the food was good.  This is the only Peruvian place I've ever eaten, so I can't speak to authenticity.  But it was well seasoned, well portioned and overall a decent meal.  Before the Groupon discount our bill was over $80, which included one appetizer, two entrees, a side, a dessert and a few drinks.  The meal really wasn't worth that price, but with the Groupon was a good value.  I'd stay away on weekends and hold for the groupon.  But if you've got a deal and no place else to eat on a Tuesday, it's not a bad place to check out."], ["Nick S.", "David is great and Jorge is always warm and welcoming! Great food, great service, great vibe!"], ["Meyling W.", "I was born in Lima, Peru, and tonight after a twelve hour shift at work, I had a serious craving for food from the land of my people. It was my first experience at Cebiche. It was 8pm on a Friday night and I decided to grab some to go food from here. Patio was busy, probably five tables inside. I was greeted promptly by a friendly staff member. I said I was getting to go food and I was invited to sit at a table and look over a menu. As someone with 14years plus in the service industry, it didn't take me long to realize that they were extremely short staffed. The two servers/bartenders/bussers/hosts were running around like mad. I could hear other patrons at tables complain about how long food was taking. It took one of the servers 20 minutes to come back and take my to go order. As I waited for my food, I heard the two employees say that they had two call ins that night and apologizing to their tables.   I saw five customers get up from their tables and go up to the bar to order drinks/food from the bartender, who were also the servers. My food took and hour and ten minutes to come out. The staff did apologize after 45 minutes about the wait, after I asked how much longer my order was going to be. They comped my Inca Kola, which I appreciated. I knew the staff was doing the best they could, but my blame lands with the owners. I'm sure they knew about the call ins, yet they allowed their staff and business to sink tonight. I could see how harried and how much the staff was trying to   make their customers happy, but with only two employees, it was hard to keep things running. On the upside, the staff was very friendly and my Cebiche and Anticuchos were delicious. I will give this cute little place another try in the near future, since I know that tonight was probably a fluke, and I have read so many wonderful reviews."], ["N H.", "I wanted to give them more stars but we weren't really impressed :( went there day after valentines day. Everything we got was per the waiters recommendation. Got ceviche to start which was very good; probably the best thing we tried. I got the seafood risotto. It was so oily. Like the oil was pooling on top off the risotto. Not sure if that is normal but I didn't like eating it and the taste just tasted well like oil. All the seafood in it was good but the taste and feel in my mouth from the oily sauce was not. My husband got the steak with a little pyramid of rice (nice presentation ) and French fries. That was better than mine but we thought it lacked flavor. I always feel like you shouldn't have to add salt and pepper to your food when you go out but I was wishing S&p were on the table here!"], ["Lauren M.", "I went here with a friend of mine and we like to hang out in restaurants and enjoy the experience.  The first thing I noticed upon entering was the decor.  The floors are a trip hazard and it was not decorated in a manner that reflects their pricing.  My friend went to the restroom and found herself trapped in there.  The doorknob was practically falling off!  We ordered their signature dish and I was disappointed to find it over marinated and very chewy.  The next thing I notice was the wait staff getting drunk behind the \"bar.\"  I watched each of them consume over 4 glasses of wine.  This is highly unprofessional.  It was a quiet night and yet I felt we were being rushed out by our server. I wouldn't recommend this place."], ["Bill W.", "The food here is on par with that strip mall chinese restaurant in your home town in the 90s where everyone thought they were serving cat.Server was very nice, but i had this suspicion that she didnt truly believe what she was saying when talking about the food."], ["Erin S.", "My cousin had a Groupon for this place and he asked me if I would like to go with him before it expired.  Since I have never had Peruvian food, I said sure and we ventured over here last night and I am a little mixed on how I feel about this place. It's a small little place right on the corner of 32nd & Wyandot. Not to much to say about the decor it was all painted red. I was running behind (shocker) but it appeared that my cousin was seated right away.  The food was actually pretty good.  I had the Lomo Saltado, (steak, sauteed red onions and tomatoes and their fries and it had a side of rice). My cousin had one of the fish dinners (I can't remember what) and it was good too, and I am not a huge fish person. We had the flan for desert and that was really good and creamy.Here is the downfall to this place.  The service.  They were extremely slow and it appeared that they only had one, yes one waiter working. The waiter was really nice but it seemed (to me at least) that he may have been a little overwhelmed.  A couple of times while we were waiting for our dinner, a couple of other patrons when to the bar with their credit card and asked for their check and paid right there on the spot. I would like to come back, but the slow service makes me hesitant to do so."]], "Solera": [], "La Jaya Bakery": [], "Brazen Neighborhood Eatery": [["Ashley M.", "I'm so glad we stumbled upon this place instead of going into downtown. The place is a super cozy and cute small space, I love the open kitchen and watching this skilled kitchen team work. We worked our way through the steak tartare, mushroom \"toast\", octopus, mussels and the steelhead fancy toast special. Let me start by saying we ordered the tartare twice it was so delicious. There was nothing on that menu that was even close to average, all above. The entire staff was great too, super friendly and knowledgable. Buy them a beer, they definitely earn it."], ["Ian B.", "For the price it could have been better.Great: meatballs, short rib pasta, duckAverage: both flat breads, sausage pasta"], ["Elyse A.", "We plowed our way through this restaurant...bite by bite, sauce by sauce, nom by nom. It was graphic. It was intense. No dish was left behind.Ok, that's a lie. A few dishes were left behind, because there were only four of us and I was so full I wanted to die by the end, so yeah. Slight exaggeration.My husband and I were in Denver visiting our best couple friends for a long weekend before Halloween and they suggested Brazen for a nice, long, indulgent catch-up dinner. It was the perfect recommendation. The food was delicious. The staff was knowledgeable, friendly and funny. The overall vibe was just hip enough without feeling pretentious or stuffy. Here are the dishes the four of us all shared in order of favorite to least favorite:1. Black Mission Fig & Honey Ricotta Toast 2. Charred Tomato and Zucchini Toast3. Cauliflower au poivre4.Tomato Braised Meatballs5. Prince Edward Island Mussels6. Brussels Sprouts7. Braised Short Rib Ragu Oh and we had the S'mores plate for dessert. Housemade graham crackers and marshmallows! Yummmmm...Thanks to Brazen and their staff for a lovely evening spent laughing and slurping and toasting our friends' engagement. I would absolutely go back here again next time we are in Denver!"], ["Melissa S.", "Had a delicious 4-course beer pairing brunch with River North Brewery!!1- Blood Orange crème brûlée with caramelized croissant paired with White Ale Beer-mosa 2- Benedict with banana hollandaise paired with Whiskey Barrel J.Marie3- Avarice sabayon with poached pear and granola paired with Avarice4- Dark chocolate truffle paired with Quad XO Everything was delicious. Great service. Cool ambiance. Surely return on a regular day :)"], ["Angela B.", "Caveat: this is a brunch review, embarrassed to admit I still haven't been in for dinner. But brunch. SO GOOD. First, we had one of those amazing October days that's crisp but still lovely, and they had the patio open. Super appreciated as most other places in town were patio-free this time of year. Second, the service was beyond awesome. Just the right amount of friendly, attentive, and genuine. Third, everything we ordered was divine. There's a lot of great mex-style brunches in Denver, and this was very, very good. The bottomless mimosas were lovely (and they let us substitute orange juice for grapefruit). Will be back for dinner, definitely."], ["Andy V.", "Came here for a late night dinner and it was deeeeelicious.  We had Charred Zuchhini/Tomato Toast and Pork Belly.  Pork Belly was nice and fatty, but that toast was awesome.  At first, I thought pasta was on the toast, but then I realized it was Zucchini.  The presentation was certainly unique and the taste was great."], ["Diana W.", "Omfg!!!! Can't take the deliciousness! My selfish heart doesn't want to write a fantastic review but I must be honest to my fellow yelpers.Came for Saturday brunch, table for 5 and no wait! Plenty of seating inside and outside and extremely quick and friendly service.  They don't take reservations so I hope this no waiting trend continues! Did I mention plenty of parking? Their coffee was warm and tasty.For my dish I got the shredded pork sandwich. The meat was so tender and the bbq sauce was just the perfect amount of sweet and spice.  Their brunch menu had French toast options, benedicts, and etc!Can not wait to come back to try their dinner here!"], ["Erin T.", "The various little appetizers here we got were tasty and I enjoyed sitting out on the patio at night with the cute little tables, fire pit, and string of lights. The prices are a little bit high for the small portions."], ["Angela C.", "To start off with, the service was great! We went in with a group of 7 and everyone was wonderful at keeping their descriptions detailed yet brief. We were warned ahead of time that the menu consisted of smaller portions that were meant for sharing, which was fine with us. We ordered a number of things, including all 3 pasta dishes that were offered, mussels, and the brussel sprouts. They were small in size(by the time everyone had a taste there was not much left), but certainly made up for it with taste! Everything was delicious, from my tagliatelle with the perfect amount of spice to the brussel sprouts which were cooked excellently and complimented nicely with some nice pieces of bacon. They've got me on this one! Can't wait to try more in the future~"], ["Vivian L.", "So we stopped here for a late dinner to try their night menu. We got a bottle of wine, oysters, lamb empanadas, and the ramen.WineAmazing service by one of the someliers. OystersSo fresh and so clean!Lamb Empanadasholy sh!t. these are the best empandas I've had. The dough was perfectly flaky and the lamb was perfectly cooked and piping hot on the inside.Rameneverything was cooked well. they were serving smoked pork belly with roasted cauliflower and snap peas--nontraditional but I don't care about tradition as long as it's tasty (even if I'm Asian -_-). The broth was what fell short for me--it was this weird chipotle/bbq flavor that was probably a result of their smoked pork belly. It was weird drinking bbq flavored soup...and when mentioned to the waiter...he swore that the broth had no intentional bbq flavor. Noodles were a tad overcooked in my opinion, not quite al dente.I can forgive the ramen shortcoming as the other amazing dishes more than compensated, not to mention the superior service we received all night. The ambiance is amazing and I'm looking forward to the next time we hang out in Denver to come here again."], ["Brittany S.", "Just brunched here for the first time and had another experience that didn't disappoint. The chiliquiles with the house made tortilla chips and green chili were to die for. The homemade Bloody Mary mix is soooo good. The brisket hash was great too. We also started with the house made daily bread which was a strawberry and lemon scone and it was amazing. Their pastry chef Maggie (magpie) makes great pastries. Yum!"], ["Christopher B.", "This is a place I wish I could love. This is really a restaurant where you go for a glass of wine, maybe grab a quick bite to eat if you're hungry or need a snack, and either hang out with friends or move on. This is not a place you'd come for great food. It's unfortunate but true. All the food we ordered was alright but nothing was earth shattering. The crazy part is that we came for happy hour and still spend a bundle and I can't say I was remotely full when I left. The meatballs were lacking and disappointing. The oysters just weren't good. The bugolgi was actually pretty good and the one dish I'd come back for. I thought the buttermilk (?) pie was really good as were the s'mores the last time I was there. To someone's point, I don't think this is the best of locations but I could see why people are excited it is where it is. The service is really good, I like the atmosphere but unless I were coming for a drink first I doubt I would come here for food again."], ["Sebastian G.", "Great spot for late dinner - we got there at 11pm after a concert!We had Brussels sprouts, deviled eggs and ramen.Sprouts were ok, I rather them to be more tender.Eggs were awesome.Ramen was Ok tooThere are two reasons why I still give them 4 stars and not 3.- it is amazing that you can get food this late, coming from Buenos Aires that is something I miss.- we only tried their late night menu, we will be back!"], ["Danielle F.", "This place was out of control GOOD.  I don't think it is far-fetched to say that this was my favorite meal on a recent trip to Denver to visit a friend for her birthday.  This joint ended up being the \"birthday dinner\" spot and it was the perfect location for a special occasion.  There's a nice patio in the back of the building, however the weather was a bit chilly for it on our visit.  I could see it being a fabulous outdoor space when the weather is a bit warmer.  The interior is not enormous, so I could see how this place could garner quite a wait on a Friday or Saturday evening.  There was a super funny quote written on a blackboard (see my photo).  The service was impeccable.  Our server did a great job in providing an overview of how the menu is organized and what we should expect to order in terms of the number of shareable plates.  There's a sold drink list with several cocktail, beer, and wine choices.  The cocktail names will often times garner a chuckle, including my choice \"Hide Your Kids, Hide Your Wife\".  It was a cucumber-gin dream of a drink.  In terms of the food, the highlight for me was clearly the roasted cauliflower plate, which was a wonderful mix of cauliflower, dried apricots, pistachios, and lemon.  I need to try and recreate this at home!  Additionally, I enjoyed the pear fig mostarda.  Finally, the roasted stripe bass dish was another solid choice.  Pretty much everything we ordered was fantastic, but there were a few notable standouts.  We were all in agreement that the cauliflower dish was a favorite of all at the table."], ["Jessica C.", "Celebrated my husband's birthday here. It was busy outside (this was during the summer), so the inside tables afforded us an intimate dinner. We started with some super tasty cocktails, and the service was attentive but not intrusive. I truly enjoyed the southern twist on the Boulder Chicken, but I wasn't crazy about the vermicelli. It was the exact ambiance we were looking for, and I can't wait to go back to try more dishes."], ["A Marie J.", "Came here for brunch.  I had looked at the menu on-line and was disappointed that it is way different than the one offered.   I had to start with my brunch staple, a Bloody Mary.  I loved it, you could tell that the mix was house made and it was garnished with a pickle and a bit of sausage.  We then ordered a blueberry scone with lemon curd.  Absolutely amazing.  I ordered the Brazen Burger and it was tasty.  It came with a very small arugula salad so I ordered a side of potatoes.  A small handful of potatoes for $5!  I think not.  I tasted my friends Ramen and found it to be just ok.  My other friend sent her Benedict back after tasting it.  This place is quite possibly better at dinner but I am not willing to try.The bartender had informed me that they tip share so this must explain the disjointed service.  We had the host taking our drink orders, then a server coming by and asking us the same thing and also the bartender.  I just feel that having one server makes for a more efficient service."], ["Heather T.", "The hubs and I came here for a Valentine's Day brunch. Parking was a challenge as there are no designated spots for Brazen like there are for other businesses. The hubs was a tad frustrated. We ate at the bar which is always fun to be up close to the action. Service was very friendly and attentive. I started with a homemade orange/Rosemary cream soda. Why I'm not sure as I'm not usually a fan of soda but the flavors lured me in and were good. I ordered the shrimp and grits with two over easy eggs as an add on. The rich yolk mixed in with the amazing polenta was a perfect way to start the day. Really well prepared shrimp also. The hubs ordered the special which was chilquiles. It was incredible (the owners personal recipe) green chili with tortillas, eggs, cheese and pico. The flavors were beautiful but the tortillas were too hard to cut with a knife but too soft to crisp apart. If that's even a description. Basically it made the tortillas hard to eat as they weren't bite sized. However, I go back to the flavor and the fact that I leaned over and scraped the pan out with a spoon that had been the hubs brunch. It was a nice start to our day with solid food and service."], ["Sean E.", "Fantastic food, good beer selection (not my palate, but creative choices that pair well), great ambiance, good service.This is by far the best late night choice in the Highlands if you're after more than strong drinks or (good, but still) bar food.Our selection:1. Oysters (split of east and west coast)-fresh shaved horse radish, vinegar/garlic/lemon dressing (they had a much better way of describing it...)2. Strawberry Salad-cornbread croutons, butter lettuce, hazelnuts ... Clearly the strawberry made the impression, but not too sweet3. MeataBalls-Polenta base, perfectly cooked4. Ramen-roasted cauliflower, pork belly, kale, poached egg. I'm no ramen expert but I do love food and this is damn good food.This is a great place for a late night meal that meets high culinary expectations. Did I mention the outdoor fire pit? Or that they brought blankets when it got chilly?This is our spot for a great meal when everyone else has shuttered their kitchens."], ["Jeff G.", "Food 3.5/5 Mushrooms and grits were the highlight. Chicken was the biggest dish I've ever had. Pear salad above average. French toast really good. Wine average. Service 4.25/5. Incredibly attentive. Ambiance 4/5. Eclectic neighborhood feel with great music and communal feel. Reasonably priced. Will be back"], ["Nick L.", "Okay, so it's 11:45 PM at night and you're hungry and could use a drink or two.  The options are pretty slim within the Tennyson area.  You can probably get one or the other but not at the same place.  Well not anymore!  Not only does Brazen stay open late they have great food and service.The times I have been in there, they have bent over backwards to make it a 5 star experience.  The servers and bartenders are on point with recommendations and great service.I have not had anything there that I have not liked.  The ramen, the deviled eggs, the brussels sprouts were all great.  I know the menus change depending on the time of day .... Brunch, Dinner and Later Night ... but I don't think you can go wrong with anything on there.I like that they are open late and I love the food!"], ["Masha S.", "A hidden gem. We have been to Brazen 3 times now and have never been disappointed. Service is great, bartenders are exceptional (including creating a drink I described to perfection), and the food is outstanding. We sit at the counter to watch the chefs create - best entertainment. The zucchini toast is craveable and the meatballs on polenta is filling and delicious. The menu changes according to what is available locally and everything we've tried has been tasty! There is an outdoor fire pit that we've never sat by (love the chefs counter...) and lots of parking in the small shopping area nearby."], ["Sarah H.", "I have wanted to try this restaurant for many weeks because of how fantastic all the reviews have been.  We were looking for a place for happy hour and some good food so we were delighted to see that Brazen was not only open but had a nice happy hour menu. When I walked in the staff was very welcoming, funny and friendly.   We quickly decided on some appetizers and drinks.  We started with the spicy devil eggs that where the best I have EVER had!! You have to like spicy foods but such a stellar choice!  Next were the meatballs which were delicious as well.  There were three meatballs that came in a skillet which is perfect for 2 people.  Next was the Brussel sprouts, which is a must order wherever I go!  Again this was one of the best I have had!  If you go here and don't get the Brussel sprouts you are missing out!!After all this we decided to share the dinner special, which was a steak over sweet potatoes and baby broccoli.  It was very tasty...however they did add some kind of Asian twist that was different and not necessary.  It kind of cooled the heat of the meat, that I didn't like. The atmosphere is confusing however.  They have done a very nice job of decorating BUT they played a really loud random mix of music.  It was all over the map and didn't match the vibe they were trying to portray.  Also our server was not very educated on the drink specials and menu.  There were only people at the bar so it was not busy and just was not that impressed.  By the end things got better and were asked very detailed questions of our meal by, I believe the manager or owner.  Nice guy!  I truly enjoyed our meal here and will go back, but suggest the happy hour so you can try more items at a better value."], ["David M.", "With 3 dozen Yelp reviews already logged in, Brazen Neighborhood Eatery currently rates in at a full 5 stars. Several of those reviews are from Yelp friends of mine whose opinions I respect. So that leads me to the semi-interesting question; which is . . . who's their dealer? And where can I get me some o' those edibles it seems they must have had as a pre-appetizer course?Brazen is a good 4 star restaurant run by really nice folks. Taking its cue from the current trend in restaurant design, the ambience is minimalist: The surfaces all hard, and frankly a bit uncomfortable (they do have pillows on their benches for your back (but that still leaves you sitting on a wooden bench)). The menu mainly focuses around small plates with a limited selection of larger plates meant for sharing as a full dinner. We chose 4 small plates but weren't blown away by any of them. Enjoyed the duck confit the most.Bottom line for Brazen is it's worth hitting up, especially as a new west-side tapas-style restaurant, but I'm bettin' ya a meal there that by Easter it'll be correctly rated as a 4 star spot. And ya know what? There's nothing wrong with having that kind of rating on Yelp.Sign me,David \"The Realist\" M"], ["Chad W.", "Great \"upscale casual\" food, good prices, good cocktails & beer, open late, all rolled up into an unpretentious, unassuming atmosphere.  Well worth checking out! For some reason it's damned challenging to find a place serving food after 10PM in this part of the city, so Brazen is a godsend in that regard.  Brazen's dinner menu ends at 10:30pm, when they transition to their \"late night\" menu, which is basically just a cheaper, condensed version of their dinner menu with a few notable additions.  We ordered off of both the dinner menu & late night, and loved everything we had.  The ramen (late night menu) was pretty stand-out, as they make their own noodles, and the veg / additions change regularly.  It was competitive with Uncle, and I love Uncle's take on ramen.  They also have a late night burger that looked pretty bad-ass, but we didn't try it.  Drinks here are reasonable, and they know how to make a good cocktail.  On the late night menu, the also have $5 wine and $2 beers, so that makes it all the more appealing.  We tried a Parques y Flores for a cocktail, and highly recommend it.  Don't let the location by a dentist's office fool you...this is a great addition to the neighborhood."], ["Bethany F.", "Awesome environment, great drinks and takes about 5 items from the menu to get full. But definitely well worth it. Signage is a bit hard to see. Bartenders are great. Must try. You won't be disappointed."], ["Chelsea L.", "Nice staff and amazing burger. Went there at 12 AM for some late night food after landing in Denver. Also had the brussel sprouts as an appetizer that are amazing. The ambiance was nice and the venue was small. Sat at the bar and was able to watch the chef cook our food."], ["Alex V.", "My wife and I were only in Denver for a few days to see at Red Rocks, found this little place on yelp, my GOODNESS was it the best meal we had the entire time in Denver.  It's a hidden gem.  Make it a point to try it, the small plates give it a tapas feel, but it allows you to try so much more then just one single meal.  It left us wanting more.  If we're ever in Denver again, we will make it a point to stop here and try whatever they have."], ["Stacey F.", "It was with great anticipation I look forward to going to Brazen this morning for brunch. The menu is very nice, the service was good, but the food was average. They serve unusual items for breakfast such as mushroom toast which is what I ordered or the duck confit skillet which is what my friend ordered but the food was rather bland.  We started the meal with the donuts for the table, which I did not eat so I can't comment on those. They looked delicious. I did have an oyster or two which were very fresh and delicious.The coffee is served in a French press, but unfortunately the coffee was Lukewarm.  The waiter did replace all three pots on the table, but by then I was finished with my meal. My husband ordered the Ramen, which was probably the best seasoned dish  of the two we ordered. The noodles tasted fresh and there were a lot of goodies to eat in the bowl.  Apparently it is the cooks family recipe. It was not a traditional Ramen, it had interesting items such as Cauliflower,  duck egg and fresh mushrooms.  The broth was a spicy miso broth, but not too spicy.  I'd say it was a mild spicy.  I ordered the Mushroom Toast which had a nice variety of different mushrooms and a perfectly poached egg.  Although the plate looked beautiful when it arrived at the table, the dish was a bit bland. The only flavor afforded this dish was the sherry gastrique.  Without it, there would have been no flavor at all.   The mushroom toast was served with the Arugula salad which my husband devoured.   He said it was the best arugula salad he had ever eaten.  The staff is nice and the atmosphere is relaxed and casual.  I would like to try Brazen again, perhaps for dinner.   Would I recommend it for brunch?  If I were in the neighborhood, yes.  But I probably would not go out of my way to eat there."], ["Sean Z.", "Some friends of ours picked Brazen for a birthday dinner, and after reviewing the menu online we thought the place might be a bit eclectic for our tastes...Indeed it still might not be the place I would think of on my own as I don't own red pants, tight flannel shirts or wear a beard, but I will definitely go back!We sat out doors in beautiful weather that had been arranged by the restaurant, right next to the old Elitch Gardens carousel house. The patio was clean, nicely lit and very comfortable. The server came off a bit smarmy yet friendly. Strangely reassuring as you could sense his confidence in the unusual menu. He made it a point that we should be comfortable sending a drink back if we don't like it. We did send one back and the only question was what else would you like? No smarmy grimace or snear. Just cheerfully carried it away and came back with wine.For the food... with things like roasted cauliflower and blueberry and snow pea toast we didn't expect we would care for anything too much... I also generally do not like tapas, but we put our best foot forward and coordinated an order with everyone at the table assuming we would hit a drive through before the end of the night for a \"real meal\"Pretty sure our table ordered about everything on the menu... Thank goodness for the tapas!!! It was all freaking excellent!!!On my own I would have never been smart enough to think about peas and blueberries on piece of toast, and the amazing flavor combination that it had imparted. The pimento cheese deviled eggs did not sound like my cup of tea either, but the hint of heat in whatever kind of creamy cheese that was is great! I could eat a dozen of those! The meat balls were meatballs, and although the were the least amazing thing on the table they were still tasty and as good as any I have had! The cauliflower; this veggie is typically something of a bad dream for me. Turns out if you roast it and fix it like they do at Brazen it has the potential to be a better veggie than bacon wrapped asparagus! This is seriously one of those places that changes how you think about and what you see in certain foods. The smores platter is mandatory for dessert, goes way beyond just smores to say the least. Some might say it is a cop out, but I loved that they had Reese's peanut butter cups on the platter. Some things are hard to beat, Reese's is one of them. They go great on smores and looks pretty cool when your eating a peanut better cup with a fork...The coffee was just coffee, but that's exactly how I like it.Worth the drive from anywhere!Cheers!"], ["Steven B.", "thank you chef Carrie and staff at brazen. lovely meal in such a quaint location. great choices on your new menu. nothing but good things to say about your place. all my best....Steve"], ["Ryan H.", "Brazen is my favorite restaurant in Denver - no contest.  Perfect combination of prompt, attentive and fun/friendly service paired with beautiful food.  I could eat their blueberry toast everyday - it's a meal in itself.  Their menu adapts with the season and their cocktails and draft lineup are balanced and well thought.  Go and enjoy."], ["Derek K.", "I had the worst service in Denver here ordered breakfast there bread muffins were freezer burnt.  It took me 45 minutest to get my drinks which we received our food before our bloody Mary's. And had to return"], ["Ashley H.", "Fantastic food, cocktails and excellent service! If you love oysters, this is the place to go!  I would suggest the west coast oysters and the \"La Punta Nada Mas\" cocktail."], ["Mike M.", "Went here early on a Friday. The staff was attentive, happy to give suggestions, knowledgeable and friendly. The food was great as well, small and expensive, but great. The cocktails were top notch and the ambiance is very pleasant. My only complaint is that the plates came out very fast, and the staff seemed like they wanted to keep things moving at a brisk pace to keep customers coming through the door quickly to compensate for the smaller capacity.If we could more slowly enjoy our food and drinks, this would be 5 stars in a heartbeat, but it was a fast paced meal.Best plates: roasted cauliflower or the steelhead lox. The s'mores for dessert were wonderful!"], ["Randall E.", "So far this place has exceeded my expectations with each meal.  I am leaving incredibly content and satisfied having eaten the braised meatballs with polenta and Spanish vegetable gratin.  The chefs and wait staff were very friendly and I learned that everything they serve is made in house....even the noodles for their amazing ramen soup.  Could not be more happy to have discovered this joint.  I will definitely be coming back regularly!  Thanks you guys, keep it up!"], ["Michael M.", "This tapas style restaurant is supreme. Highly suggest you go with at least 4 peeps so you get to try a wide range of really great offerings.  We started with Deviled Eggs made with goat cheese and Harissa..fantastic.  From there we had the crudo, candied carrots, cauliflower , and slow smoked brisket.   All were super  as was the whole roasted fish we shared.   The 2011 Bandol French red wine was perfect with the food.  For dessert we had the s'mores... A play on a pu-pu plater.  All in all a great experience ( if a bit noisy)."], ["Dayna A.", "I planned a night for my hubby & I and another couple to dine here last night. Because the plates are so small, each person is advised to order TWO entrees. So FOUR per couple plus drinks. The tab for the table came to $130 and we were all still so hungry. The dishes were the size of small appetizers. And we weren't impressed with the taste either. We won't be going back. Broke and hungry. Fail."], ["Denise D.", "I think most people are excited when a new place opens in their neighborhood, and this was no exception. Great spot, industrial feel, and delicious sounding menu. When the restaurant first opened, we had dinner, which was very good. This morning, we decided to pop in for brunch and choose some interesting items from the menu, the McPlancha and the Brazen Benedict. Both were quite good, especially the bene. Sadly, despite the eggs being cooked perfectly, the dish was cold. We expressed such to our server, which wasn't met with much aplomb or concern. We also asked for warm syrup, which we never received. Our cups of coffee ran empty, and were never refilled, the same with our bottomless mimosa, it bottomed out after the first one, only to be refilled after we asked the bartender for assistance. Some easily fixable circumstances, if our server had been interested, and attentive. Not sure if we'll return, unfortunately."], ["Lisa S.", "Love my neighborhood spot, have been here over a dozen times.  Daniel is so attentive, fun and remembers I like extra cold wine.  Chris is always welcoming and lovely.  Most of the staff apart from one female server are always so lively and are having as much fun as we are.  The food is inventive and plentiful.  It's very satisfying to watch them make the homemade pasta in the open kitchen, as well as their other well-executed dishes.  Fancy toast and salad is perfect for a light meal and then they have their pasta or meatball/polenta dish when you need something a bit rich.  Great spot for brunch, happy hour or dinner!"], ["Gwen P.", "Now, I've only been here once (last night) but as it stands, this was one of the best dining experiences I've had in Denver! The food was delicious--that part I've found in other Denver eateries--but the service! The service was fabulous! Every person we interacted with was just exceptional. They were genuinely friendly without being unprofessional,  and attentive/helpful without being overbearing. From the general manager to the hostess to the server to the bartender, everyone I spoke with made me want to be a regular! They really went above and beyond to keep us posted on when our table would be ready and then took care of us when we moved to the bar in order to free up our table for people waiting to eat. As for the food, the red beets in the beets and burrata were overly salty, but everything else was delicious. I would highly recommend the mushroom fancy toast and the butternut squash tortellini. And, of course, the s'mores dessert! So much fun! The worst part about our experience at Brazen was that we couldn't order everything on the menu! Make sure to check out their cocktails--the bartender is a genius!TIP: They told us over the phone that they don't take reservations, but do 20-30 min call-aheads. We called at 6 on a Saturday for 6:30. When we got there we only had to wait about 15 mins. We could have sat sooner if we chose the bar, but we chose to wait for a table. For future visits, I'd be happy to eat at the bar. There's plenty of space and the bar staff is wonderful!"]], "El Chalate": [["Riza H. C.", "East Colfax Taco Tour UYE!  Sunday October 30th 2011.2nd STOP: El Chalate Bigger establishment.  UNFORTUNATELY, they dont offer much of Taco.  I had no choice but to order something, and it was the Beef Tacos (3 pieces) ($3.80) from the A LA CARTE Section from the Menu since I DONT EAT ANY FORM OF PORK.  At first I ask the server if I can only have one Beef Taco, she told me, yes I can.  It went down the hill MAJOR MAJOR disappointment.  The tacos I received was FRIED TACOs and the server told me I cant order just one, and have to have all 3....  Dont fancy it that much.They offer chips and salsa to all the tables.  Like the \"bottled\" sauces they offer.  SPICY HOT, I like.  Oh well... but the other Yelpers like or love what they order such items like Tamales, Yucca what nots.In addition to this, I order the Empanada De Platano ($1.25) to go.  Dont fancy this dish either."], ["Ana D.", "I'm a repeated customer for life. My family and I go all the time.  Best Salvadorian Food in Colorado. You want authentic, delicious, fresh and affordable. I love the little store inside as well. I can buy authentic Salvadorean items."], ["Smidgie W.", "Great place for pupusas in Denver! Granted, this is the only place I've tried, but it definitely satisfies both in taste and value. Even in Los Angeles, it was hard to find a pupusa place that had good curtido and salsa to go along with them. They are all good here. I come here to satisfy my cravings for chicharron, yucca and platanos as well.On the down side, the torrejas are not good at all."], ["Cheryl L.", "2nd stop on the tour.While there were not a lot of Tacos to find on the menu it gave me the chance to try some new and wonderful treats.Fried Yucca - These are very similar to french fries - crisp on the outside and soft and creamy on the outside.  YUM.Chiccarones - nice little nibbles, very meaty and favorful - a little gem on the plate, probably my favorite thing we ordered.Chicken Tamale - these were okay - not my favorite.  I like mine with pork and more spicy red sauce and these didn't have either so it was a little bit of a let down.Pupusas - these were nice.  First time trying these and found them to be lovely and really like the curtido that was served with them.Al Pastor Taco - very nice and it was a little on the crunchy side."], ["MJ L.", "Pupusas you say?  El Chalate, you say?  Yes, please!  Truth be told, I had no idea what a pupusa was... all I knew was that it sounded funny thus, I must try it at least once.  I have nothing to compare the pupusas from El Chalate to to determine how good or bad they are, but my mouth says they are awesome and I will continue to listen to it.  The cabbage salad (no idea what it's really called in el salvadorian) that comes with the pupusas are crisp, delicious and perfectly complements the hot, ooey gooey cheesy pupusas.  Other must try items include crunch beef tacos and plantains with el salvadorian sour cream.  Oh, try the maranon drink also, it's refreshing and delicious.  Complementary chips and salsa are nice - the salsa seems to be homemade and fresh.  As for the restant itself... Ok, so El Chalate is a hole in the wall, but I have special love for hole in the wall restaurants that crank out great food.  Yes, it is located on East Colfax between a medical marijuana place and a pawn shop or something, but I always feel safe going in and out of the restaurant.  About 1/3 of the place is actually a grocery store - something to keep your eyes entertained.  The restaurant itself is seriously no frills casual, there is a big projection tv that plays UFC in spanish on fight nights. The service is no frills, prompt, efficient and nice.  I love the lady who waits on us most of the time, she's sweet and patiently answers our ignorant questoins.  The only thing missing from this place is alcohol... cold beer and pupusas sound like match made in heaven."], ["Sara L.", "My cheese pupusas and vegetarian combo were delicious and cheap! The guacamole was creamy and fresh. The lady that served us was sincerely helpful and translated things on the menu for me. The atmosphere made me feel like I was happily traveling abroad. Sooo... Hellllllloooooooooooooooooooo new favorite place to eat.Our lady also gave me a tip that on weekends they make a couple special desserts... Central American versions of banana bread and CHEESECAKE (in quesadilla form)!"], ["Todd K.", "Well, definitely not in the greatest of neighborhoods as exemplified by the aggressive homeless guy that I gave a buck to before entering the restaurant...  I found street parking next to the restaurant easy enough.  There was only one other person eating in the restaurant.  Later, a couple other groups stopped by to pick up take-out orders as I dined.  The restaurant was clean, bright and cheerful.  The kid who served as my waiter was friendly and provided useful recommendations on what to order.  I ordered two papusas - one chicharron and one queso con loroco.  They were both very good but I preferred the pork.  At $1.35 each the pupusas are definitely an awesome deal plus it came with chips and salsa.  Though I wasn't very hungry, I also ordered the yuca frita (Chalateca style with chimbolitas) for $3.75.  What I didn't realize until after the fried yuca arrived is that chimbolitas was some kind of little dried fish.  Fortunately, I was able to push the fish aside and still enjoy the yuca.  Next time I visit here I would order the yuca frita with chicharron.yelp.com/biz_photos/UsPJ…yelp.com/biz_photos/UsPJ…For $7 including tax this was a really good and inexpensive dinner.  Even including the $2 tip and the buck that I gave away, the visit to El Chalate was only $10 and well worth it."], ["Cherie C.", "Stop #1 on the pupusa tour did not disappoint.  I ordered a pupusa de queso y loroco, which is one of my favorite foods in the universe. The pupusa was good, with the mild taste of loroco permeating the gooey cheese. The curtido was fine but not my favorite.  The cabbage was coarsely chopped; I prefer mine cut more finely/thinly.  There were large jalapenos in the curtido, something I have only encountered once before.  I don't know what is truly authentic to El Salvador (though the curtido made for me by Salvadoreans didn't have much heat), but it's not what I've come to expect and was not really to my taste in this instance.I also ordered my second-favorite thing to get at a Salvadorean place: yuca frita con chicharron.  This dish seems to vary greatly from place to place.  Here, they use a lot of thick red sauce on the yuca, small bits of meaty chicharron and a heaping side of curtido.  It was, again, quite different from my experience but I really enjoyed it.Best of all, the food was dirt cheap.  Two pupusas are enough for me for a hearty meal.  Here they were just $1.35 each.  With a deal like that, how can you go wrong?"], ["Dale Z.", "Stop #2 on the October 2011 East Colfax Taco Tour UYE! This is a true Mexican/Salvadoran restaurant, and not a typical taco place.  In fact, the tacos here were pretty basic.  However, the other food on the menu was quite good.  The table salsa and chips are above complaint.  The horchata is just okay, I believe it is made to order rather than fountain style.  The fried yucca with pork was outstanding.  The yucca was densely flavorful, and well cooked.  The pork was the kind of chiccaron I enjoy . . . heavy on the meat, light on the fat, and very crunchy.  The tomato dipping sauce had subtle, yet enticing flavors.  The pupusa was a hockey puck of salty goodness, but maybe a little too filling.  The curtido (a Salvadorean condiment resembling coleslaw customarily paired with pupusas) was a huge side.  The basic and humble nature of cabbage, carrots, salt, sugar, vinegar and oregano went well together.  The chicken tamale was (I think) the weakest offering.  It was bland, a little soggy, and mostly masa with a little chicken and (oddly) potato thrown in.  What is AMAZING is you can get all three of these items on the #16 platter for $5 or so. We also had an al pastor taco on the side.  It had more crunchy bits than I like for this type of taco, but the flavor was solid."], ["Cynthia N.", "No better place to taste the comforts of my home country  in Denver!  Try the platanos fritos with a corn tamale and eggs for a typical breakfast."], ["Audra B.", "El Chalate...let me sing your praises. How else are you gonna get dinner for 3 for less than 20 bucks, including chips and salsa, an appetizer, sodas, and a main course, as well as a full tip? I am not sure you can do this many other places, and certainly not with all the charm and pizzazz that this place offers, in the middle of one of the sketchier parts of East Colfax. Go for the pupusas...stay to chuckle under your breath at the nearby businesses. Gold n Grillz, my friends. Nuf' said.I love most things Meso-American. But especially pupusas. This is the real deal. If you know much about the \"con loroco\" ingredients, you're going to seriously wonder how a restaurant in Denver gets a decent supply of them. I suppose specialty food companies deliver everything now, but it still seems too good to be true. El Chalate's pupusas are fantastic, and in comparison with the local competition, \"Tacos Y Pupusas\", they do everything 90% better. First, you can sit, and get table service. That's an obvious bonus. Second, the menu has a far wider selection of items, even some gringo food, and the prices are way better; compare pupusas at $1.35 at El Chalate, with seriously fabulous and attentive table service, to not sitting and crowding yourself into a tiny booth for $2 pupusas that aren't nearly as good, at Tacos Y Pupusas. The choice should be clear. So I've been to this restaurant twice since June; the first time was a harrowing experience that had nothing at all to do with the amazing service they offer at the restaurant, and everything to do with my kid attempting to run into rush hour traffic on Colfax. After that, both my husband and I shuddered every time we drove by it, because the near-death pass memory was so truly traumatic. They were more than kind to us during that whole ordeal, and we got out of there having had a satisfying dinner for under 10 bucks, served in under 30 minutes. All trauma aside, this was a great trip to great little restaurant.The second time, after having recovered from the first traumatic traffic incident, was magical. We ordered the nachos to truly test the meddle of the place, and they seriously did not disappoint; heaped with beef, beans, cheese and guacamole, they hit the spot for under 5 bucks. This was the first time ever that I have ordered nachos and gotten more toppings than chips. BONUS! Our pupusas, as usual, were hot and savory, filling and delicious, and whatever that San Salvadorean cabbage stuff is, it's for the win. In the end, we got chips and salsa, a big plate of nachos, 5 pupusas, and 3 Jarritos sodas for 16 dollars and some cents. Can you beat that, considering both price and quality? If you can, tell me how, because I want to - I really do."], ["John C.", "I wasn't even sure what a pupusa was, I only knew it was a $1.35 and I had a buck fifty. Delicious corn tortilla stuffed with beans, cheese, chicharron, or a combination. These things are ridiculously filling. After one as a midday snack I was totally satisfied.I returned a little time later to find $1 tamals, I got the pollo. It was super moist being prepared in a banana leaf that kept it from drying out. When you dine in they give you a basket of chips and salsa. Come here for one cheap, delicious, and belly busting meal. You will not be disappointed.As this place is about a 5 minute walk from my house, I will return often till my path takes me from East Coldfacts back to the incomparable Pacific Northwest."], ["Jeremy T.", "My coworkers and I went to El Chalate for lunch today.  Service was pretty lousy, but they were slammed.  Our food took over 30 minutes to get to the table after it taking about 20 minutes for the waitress to collect our order.However, they still get four stars.The food was delicious.  I can't imagine how much I would've enjoyed it had I not been in a party of six.  Or had it come hot from the oven.The combination pupusas (a tasty stuffed El Salvadorian corn cake) and tamales were fantastic.  South-of-the-border Coke and Jarritos served in a cold bottle washed things down.I recommend going, but be patient.  And maybe go with a smaller group.And try not to take the head-turn, record-scratch look you get when you walk in personally.  Maybe it was my purple shirt?"], ["Lisette M.", "I went here last night after reading about it all damn day at work and salivating on the keyboard.I went for the pupusas, and got one of each, but the highlight of my meal was the fried yucca.  Not the one with little dried fish.  The yucca itself was like a slightly sweet giant french fry.  The sauce it was swimming in was perfect.  Some of the pork chunks were slightly hard and dry.  I've never had this dish before, so I don't know if that's how they were supposed to be or not.  Either way, it was incredibly tasty and satisfying.My pupusas were good.  I didn't get around to the cheese con locoro one until it was getting cold, which (hopefully) did not do it justice.  I took the rest of it home to reheat and finish today.The refried beans were the biggest disappointment.  They tasted burned.  They also tasted BBQ-ed, which is different but okay, and were pretty salty.We weren't charged for any of our drinks, but they run from $1-$1.50.  I was warned about the horchata but got it anyway.  It was too sweet and thin and brown to be ideal, but I chugged it anyway.Service was minimal but polite.  She split our orders on the bill so we didn't have to hunt to find what each of us ordered.  Take your check up to the register when you're ready to pay.I got out of there for around $9 plus tip, and I had a LOT of food.  I took it home and still have enough for two more meals.  I'm definitely a fan.I may be working just down the street from it soon.  I could be in trouble."], ["Andrew O.", "If there's one thing I miss about eating in Los Angeles (okay so there's a lot of things), it's pupusas.  Pupuserias were all over in L.A, but here in Denver, you have to do some real hunting.  If you have no idea what a pupusa is, it's a Salvadoran treat that is basically a really thick corn tortilla made with cheese, beans, pork, or other ingredients.  It's topped with shredded cabbage and carrots and a thin salsa.  Oh, and it's delicious.  After some research my wife found out about El Chalate, and we made the trek out to east Colfax to give it a try.  What kind of neighborhood is it in?  The business next door apparently specialized in gold teeth and car stereos.  That's not a joke (you'll see if you visit).  There was also a store called \"Compton Mart\", for any L.A. transplants missing the hometown goodness of Compton.But you aren't visiting for the neighborhood ambience, you're coming out here for the rare pupusa treat, and El Chalate delivers.  The cheese pupusa was an ooey-gooey thick pancake filled with cheese, probably the cheesiest pupusa I've ever had.  I ordered two but was full after one so I packed the other one up for later.They also had some of my favorite sides, like fried plantains and yucca.  If you're never had either of these, fried plantains are essentially less-sweet bananas, fried up until the outside is caramelized.  Fried yucca strips are like a starchier version of potato fries.  I prefer them with a garlic sauce but they're fine on their own.Everyone seemed to really enjoy their lunch, from plain bean pupusas to the pork-tastic chicharrones version.  And the best part?  Lunch for four with a few sodas was $22.  I'll be back, and who knows, maybe I'll get a gold grill while I'm in the neighborhood."], ["steve c.", "I don't know if people in Denver don't yelp, or if they just don't know good food. At any rate-this restaurant is one that's found rarely. Delicious food, humble accommodations, and a price that makes you think \"ya know, I'd pay 30% more for that-easy!\"I ordered  2 papusas (yep, they're less than a buck and two quarters) and a combo plate (tamale, chicharron burrito, rice, beans) and my total, with tax, came out to barely over $10. Now, after gorging myself, I still have a gargantuan meal of goodness for tomorrow.Ummm, this place is my new favorite in Denver-it mixes top notch food quality with the feeling you've just walked into someone's kitchen at home with value-it truly does not get better than this!"], ["Erika Y.", "First time at a Salvadorian restaurant. It was recommended by my boss, and a bunch of coworkers and I went after work. We got papusas, and they were good! Seating was a bit cramped (it would have been impossible for someone to sit in the seat directly behind me facing the next table), but it was okay because it was only about 4:30 when we got there. Had to look up the words on the menu on my phone. One of my coworkers also got tamale, which he enjoyed. On the food alone, I'd probably give this place a solid 4 stars. But it gets the 5th from the price. Really, really can't beat that value. I'm sure we'll return at some point."], ["Daphne M.", "Tried this place out based on 4 stars. Big mistake. The place was filthy, serves no alcohol and it took ten minutes just to get our waters. They did cover everything with fresh onions and cilantro, but that didn't make up for the bland food."], ["Salvadorian S.", "Best Salvadorian food in Colorado!!! 5 Stars for having authentic Salvadorian food!!! The pupusas, yucca con chicharon, sopa de pollo (chicken soup) amazing & delicious!!!I know they are authentic because I am Salavdorian and let me tell you I have had a lot of Salvadorian food in my life. When I go an eat here or I order to take out the food is always delicious, fresh & very affordable. When I have their food I feel like I am back in my aunts or mom's kitchen where even the curtido is made from scratch. Yummy food.... I can not get enough of their pupusas, neither can my husband or my co-workers  who are non Salvadorian or non-hispanics. Thank you El Chalate for bringing  the taste of El Salvador to my house!!!I am a customer for life!!"], ["Kyle H.", "Quite a find on East Colfax.  Generous portions of good Mexican and El Salvadorean food for low prices.  I speak basically no Spanish and had no problem at all, though I had to have a few things on the menu translated.  One star off for not having something available because nobody orders it.  If you can't serve it, then leave it off the menu.  I bet they make good chile rellenos too... oh well.  I went with the vegetarian combo and a queso papusa, both quite good.  The meal also came with a basket of chips and salsa.  Quite good and all for less than $7.  Will definitely be back to try the fried platanos with a glass of horchata.Quite a find in a rather dead and sometimes shady area of Colfax among a number of auto body shops and such."]]}