{"Ginza Sushi & Grill": [["Anne C.", "I moved out of the delivery area of my fave sushi joint and was looking for a replacement. Enter Yelp and the Eat24 app--makes my life so easy!!The reviews helped me choose my rolls, and they were all really fresh and tasty.A couple of standouts:-Mexican roll, for when you're feeling cream cheesy but not in a philly roll :)- Yummy Yummy roll-certainly lives up to the name.Our order was prompt, service was nice, I'd get it again for sure!"], ["Walken N.", "The food here was fresh and the service was great! Happy hour sushi and sake specials are wonderful. The \"hibachi\" was not prepared table side, which was a change of pace, but it was delicious and the portions were huge."], ["Chris S.", "Great alternative to the venerable sushi den empire.  Good fish, great service, owners are amazing."], ["Hannah I.", "I can't believe I haven't done a review for Ginza. What's there to say? The sushi is great. When I want good sushi nearby, this is where I go."], ["Patricia D.", "I'm at Ginza Sushi right now and I received horrible service from the server named LiLi. She was helping me to order and then walked away right in the middle of taking my order to serve someone else. I like the food here but the Asian only staff can be very rude and racist if you aren't white or Asian. Also she didn't come back to finish taking my order or even acknowledge me. I had to find someone else to help me. Not very cool"], ["Helene K.", "Before Ryan K. and I visited Ginza, I was not sure if the quality of the sushi would be too great considering its neighbors/competitors who also served sushi/Asian food were just mediocre.Luckily, we were pleasantly surprised: GInza Sushi & Grill has some of the freshest sashimi in Denver. Our favorite is the smoked salmon, but we also love the yellowtail and white tuna. The sashimi is at just the right degree of coolness: not too frozen yet not close to room temperature (yikes!). Ginza also has some tasty special rolls, including the 007 roll. However, we tend to stick to the more traditional rolls.The menu also includes hibachi entrees and other Asian dishes, but we primarily come here for the sushi.Service is a tad slow, no matter whether they're busy or not. Have a little patience and enjoy the leisurely place!"], ["Andrew L.", "The service was good and the space is nice, but if you want to actually enjoy your food I would avoid this sushi spot.  Everything is very mushy and not fresh tasting, and the rolls barely have any rice on the inside or outside.  If you like sushi from king soopers try this spot out you will love it, but if you actually want decent sushi I would avoid it.  Might as well go to sushi den and spend a dollar more for quality not gonna lie...."], ["Craig D.", "Had a great meal here.  It's a cool stylish place.  Great sushi and the service was great.  They seated us quickly and had prompt service throughout our meal.  I'll definitely be back."], ["Brittany K.", "Found my new favorite place, best hibachi in Denver. The servers were very friendly but under staffed would still come back weekly."], ["Meg A.", "Easily the best sushi in Denver! You cannot go wrong with any of the rolls. The best ones are the Ocean Roll, the Angel Roll, the Green Roll, the Pheonix Roll and the Mexican Roll."], ["Charmaine K.", "Went there Friday night since we're craving for sushi and it's one of the better rated sushi restaurant around the area. First thing you need to know: pull on the door hard when you try to get in. No joke. We got in and was immediately greeted by a friendly waiter.  He seated us and validated our parking ticket (don't forget!) promptly. The restaurant's decor is nice, with the Kanji of Ginza in a big silver display hanging on the wall.  Seating was nice and spacious, with some booths available for a little more privacy.  Sushi bar also available for people who wants a show with their sushi.The rolls selection was good and there's also a variety of kitchen items available.  I didn't order anything from the kitchen but the table next to us ordered their noodles and it almost big enough to share. The rolls we got were good. I liked their rish/rice ratio and the rice were not too dry (pet peeve for sushi).  The prices were reasonable too; you can find decent rolls for about $12, with simpler rolls (like yellowtail) for about $4.50. Services were nice, but they were not very attentive. However, if we were able to flag a waiter/waitress down, we do get whatever we need (tea refill, water, etc.) fairly quickly."], ["Joshua K.", "Ordered delivery from here.. Asked for the sushi combo, and asked if I could choose the 10 pcs in the combo. The waiter said it was a chef select and then moved on..Received my delivery, they gave me a sashimi combo. I called to explain the mistake and they placed me on hold to talk to a manager who put me on hold to talk to the waiter again, who said they would give me the difference back if I could return the food to them? I spent more time on the phone dealing with the scenario to reach that point then it took to order and received the food. I ultimately hung up as they were not willing to work to resolve their mistake.One star isn't enough for what seems to be a fairly poorly managed sushi place.."], ["Emilee D.", "I'm so glad a full-service Japanese restaurant has finally opened up in the DU area!  Now I can have Japanese food within walking distance.  The food actually being good is another bonus!I've had the shrimp shumai, fried gyoza, the Phoenix roll, and the Mexican roll for appetizers.  All are delicious and highly recommended.  For my entree, as with any hibachi place, I only order the hibachi steak and shrimp.  The servings are very generous.  Expect to take food home.The service here is very nice.  The atmosphere is okay, but they play the weirdest music selections for a Japanese restaurant.  You'll hear a mix of top 40 R&B/hiphop and modern rock.  The restaurant itself is clean and pretty spacious.  Really good price for what you get.If you're driving, find parking on the side streets.  I don't recommend the public pay parking as the rates are high, plus it's a pain to exit due to being in a high traffic area."], ["Hope A.", "Best sushi delivery in Denver. The menu has a ton of options and the fish always tastes really fresh."], ["Lisa P.", "So good! Tried yesterday and was very clean and staff was friendly- best part is the sushi was fresh and my two rolls were delicious!"], ["Danielle P.", "This is a great sushi spot in land-locked Denver. They have cool decor, great service, and some innovative rolls. They accommodated my many food allergies with ease and took them very seriously. It was much appreciated considering my brother and I had just driven for 12 hours and just wanted some great sushi! There is a parking garage right next door which was very convenient. Worth a stop!"], ["Sasha L.", "I have been wanting to try this place since I saw them start to build it! It felt like it took forever!My neighbor and I wandered over here on a Sunday afternoon. He isn't typically a huge sushi fan but he ended up loving it! The entrance looks so warm and inviting, and the ambiance inside is also very impressive and beautiful.We were able to be seated right away, the place was fairly crowded but very large on the inside.Service here was very good.We got the calamari to start, which was an impressive portion and very good! I wish I could remember the rolls we picked out, one had spicy tuna, I honestly don't remember what we ended up getting but they were outstanding. Standard sushi prices here.They also had other Asian food for those of you crazies out there who don't like sushi.Jason's Thai you might have just met your match!HIGHLY RECOMMEND!"], ["Nicole D.", "Great lunch specials, cool vibe and super friendly service. Looking forward to checking it out again."], ["Yasmaine F.", "The atmosphere was very welcoming. I placed my order to go. I got the chicken teriyaki bento box. It came with white rice, 3 pieces of California rolls and garnish. The chicken wasn't the typical teriyaki flavor that I'm used to. I watched as the chefs prepared beautiful dishes for others. I was pleased with my box and I plan on going back to try their sushi."], ["Alex B.", "Those who \"know\" sushi will tell you that it's not the fish that makes great sushi, but the rice. And the rice that was used for the sushi I ordered here was horrible. It was bone-dry and tasteless. Not sure if it was undercooked, or just sat there for a while. California roll was actually crunchy.Prawn heads, which are typically deep fried and brought with Ama Ebi, were drenched in thick, dark, overly sweet sauce, completely destroying all original flavor. It was like drinking molasses. One of the most disgusting things I've ever eaten in my life."], ["Brick H.", "A casual date night during the week took us to Ginza (as did a coupon that came in the mail) just down the street near DU. The atmosphere is relaxing and open, the staff is attentive and friendly, and the food is amazing. We went for a little bit of sushi & a little bit of chicken fried rice. The Philadelphia roll was ON POINT. So was the tempura. Although neither of us were fans of the salmon/mango roll, I quote: \"this is the best fried rice in Denver!\" - my girlfriend."], ["Charles P.", "By far this is some of the best sushi I have ever had. I will be coming here any time I need my sushi fix."], ["Jess F.", "When you walk in the atmosphere is modern Asian cuisine. The service staff is prompt and respectful. The food was fabulous I got the hibachi soup and the Phoenix roll and whenever I  back in town and in the mood for sushi I will definitely come back."], ["Yahara M.", "good sushi and good customer service!"], ["Hunter R.", "Great happy hour! Newer sushi spot near DU has a great atmosphere and a fantastic menu of popular and unique rolls. I seem to eat here once or twice a month."], ["Theresa S.", "I love this place. It is clean and sleek inside. Everything I have tried on the menu is delicious. Their sushi, hibachi specials... You also must try their tempura fried ice cream mmmm. I live near by and come here often."], ["Paige M.", "I enjoyed but did not love the food. The roll I got was pretty but not extremely flavorful. Service however was fantastic I would go back!"], ["Brandon W.", "The pork dumplings and sushi and sashimi lunch were amazing. Kids loved the chicken teriyaki bento. Friendly, nice new little go to."], ["Sabrina O.", "Went here once. The place was almost empty but we still stood there for 10 minutes.  We never got seated, instead the hostess took phone calls, orders and plates. She asked us how many we said 3 and then we stood there and watched her ignore us for 10 minutes. Poor service. Didn't even get to try the food, no longer interested."], ["K K.", "This place is the absolute best! We order from here at least twice a week. The delivery is always fast and super friendly. The fish is fresh and tastes like heaven in every roll and dish I've had so far. Their tuna poke is out of this world! Thank you for your consistently great food and service."], ["Jessica Y.", "Sushi bar is pretty fancy, although I didn't try the sushi. Hibachi chicken rice is good. Highly recommended!"], ["Mallory D.", "Nothing has flavor other than the sushi.  Very disappointed. Will not be re ordering."], ["Kathy J.", "Amazing service!   Very fresh sushi!  We had the Yukio Roll And yellow tail tuna.    Also had the miso soup, salad and side of fried rice.   I love a cup of sake with my sushi which was also amazing.    Very conveniently located and reasonably priced!"], ["Annie G.", "Terrible service rude waitress. Food was not great quality. Went on a Thursday night and it was pretty empty"], ["Aaron T.", "Ginza is the newest sushi restaurant to his the scene in University area of Denver. Its ownership and staff is Chinese which results in just pretty basic standard run-of-the-mill sushi. They advertise as a Hibachi restaurant but they don't have any hibachi tables. Alcohol prices are absurdly high. They don't have a happy-hour or even drink specials. Their cold sake is way overpriced. This restaurant is okay if you want standard asian food and lackluster sushi."], ["Amy C.", "Excellent sushi. Great atmosphere. Friendly staff. We usually go to Jett but this was a nice change up. Will definitely come back!"], ["Jessica F.", "Love the hibachi. Fast delivery too!"], ["Daniel D.", "One of the best restaurants in the DU area. The sushi isn't amazing but it is good and the prices are very reasonable. Probably the best you can expect from a small Denver sushi place. Good but keep your expectations down. The lunch prices are the best."], ["Denise G.", "I kept driving past this place and seeing the opening soon sign.  One day, the sign said Grand Opening. I love sushi and I am in for a new sushi place anytime.  We headed over to the restaurant and found that the parking situation wasn't too great. Street parking was pretty much the only thing available other than paid parking in a garage that is attached to an apartment complex.  Once we walked up to the restaurant, we saw a sign that said they validate parking in the garage. Oh well, we had street parked. We were greeted by multiple people at the front door and seated in a booth.  Let the ordering begin.  I wanted to try just about everything, and we did.  Rolls, gyoza, sashimi, crab wontons, tempura, hibachi soup, and cocktails.  This place is like heaven. Their food is amazing.  I would put it up with Hapa sushi on my list of favorite sushi restaurants. The service is great and everyone there is willing to suggest anything that you are looking for. We have been several times since their opening.  If you like high end sushi, head to this place located in the DU area."], ["J P.", "Not so good - not so bad.   Moderate fare at typical sushi prices.   I will admit I was expecting a little more from this brand new build out so maybe my expectations were set too high.   Hopefully they will step it up after they get some time under their belts.   We tried five different rolls and an appetizer.  All decent but nothing felt or tasted super fresh like you get at the great sushi places.   Look forward to seeing what some others have to say."], ["Elliot N.", "I love this new sushi place. It's only been here a week and a half and it's already the new hot spot to go. The fish tastes so fresh and the staff is always willing to help you on your sushi dinner. So satisfied and can't wait to come back! 5 stars"], ["Joe H.", "Bomb. Simplistic and decently priced. I'm not a huge fan of their spicy tuna, but their superwhite tuna is unreal as are most of their nigiri/sushi pieces. Great Tuesday night dinner place."], ["Steve C.", "Sushi was very good, very fresh ingredients, nice size rolls for very reasonable prices.  Great atmosphere and staff. Would definitely recommend it to anyone"], ["Tim V.", "Good new place. The lunch specials are great. Not the best sushi ever, but pretty tasty. Friendly staff."], ["Skyler W.", "Very good. We travel very often and good sushi in your travels can be hard to find but this place hit the spot."], ["John C.", "Very surprised at how good it was.  Lucky to get parking right on university.  No kids menu.  Disappointed but still found options for him.  Great atmosphere and staff was attentive."], ["Krystal C.", "My husband and I live in Parker and were driving home from Thornton and decided to stop off and have some dinner rather than sitting in traffic. We were very lucky to have stumbled upon Ginza on our drive that evening.We were pleasantly surprised with the ambiance inside. The decor was beautiful and it was nice to see that the owners went the extra mile with each decoration. Even the faucets in the restroom were beautiful. The statues on the ceiling for very visually interesting, and actually complimented the atmosphere well. The huge televisions were a little tacky in my opinion but I understand they are most likely catering to a college-aged clientele. What seemed like was going to be a quick bite to eat fast food style quickly morphed into an impromptu date night. We were delighted to see such an extensive sushi list. I ordered a cosmo and my husband ordered a beer as we realized this was going to be a much better experience than we originally expected and his beer was much bigger than anticipated, which was a fun surprise! The sushi presentation was gorgeous and the taste was great! The orchid on the side was a luxurious touch.We passed on the dessert just because I am training for a half marathon but the list looked great! Beck was very charming! Overall, we were very impressed with the restaurant!"], ["Andrew M.", "Saw this place open the other week and have been looking forward to going.  Definitely did not disappoint.  Sashimi was very high quality.  Rolls were inventive and delicious.  Service was top notch.  We really enjoyed ourselves and will be returning in the future."], ["Matthew B.", "Dinner menu only for no apparent reason. We arrived around noon to a completely empty restaurant, ordered drinks, and 10 minutes later went to order and were informed everything we wanted was unavailable because it's \"Dinner Only\" today. However, we COULD order al-a-carte for about twice the price. We asked for the manager, but apparently he only works nights, go figure. We left and they went from nearly empty to completely empty again. Had they had a decent lunch menu and the food was good, we easily could have come back 20 times."], ["Ariana S.", "Great lunch specials, fun environment, excellent food and service. It's one of our weekly favorites!"], ["Nita R.", "I ordered delivery from here tonight, and it was SO very good! I got the Seafood dynamite and the Phoenix Roll. Both were delicious, although I thought the seafood dynamite was a pretty small portion. The phoenix roll is a warm sushi roll (deep fried), and I loved that! I like the flavors of sushi but prefer warm food, so this was perfect for me. The food arrived in less than 30 minutes, and while somewhat pricey I will definitely order from here again."], ["Bridget O.", "We've been looking for a good asian restaurant in Denver and had been having a pretty tough time until we found Ginza. I think they food here is quite good for Denver standards. My sushi was pretty tasty and my boyfriend always gets the Hibachi Steak dinner or the fried rice. The hibachi dinner is a lot of food but it is quite pricey for take-out. I got the cucumber avocado salad and it was super tasty! We've never eaten at the restaurant so I can't comment on the service but delivery has always been pretty fast for us. Phone service has always been very friendly though."], ["Bethany W.", "Ordered three rolls for delivery. It was $40. It took over an hour and a half to get to us. I think the rolls had been made quite some time before. They were warm and mushy. I honestly hope I don't get sick from raw fish sitting out for so long. I was very surprised they didn't give us any discount."]], "Blue Sushi Sake Grill": [["Perri D.", "Great place, love the relaxing atmosphere and friendly staff,bar is superb for happy hour with appetizers and the food and drink is always good (gyoza)Excellent location along 16th as well very convenient"], ["Shannon H.", "A group of friends and I came here for Happy Hour on a Sunday. We ordered several rolls, sashimi and miso soup along with some cocktails and hot sake. While I found the rolls and sashimi to be Good, there wasn't anything special about them. We ordered:-The Yellowtail Serrano Sashimi- yellowtail, cilantro, serrano, ponzu- I liked it but found the fish to be overpowered by the pool of ponzu, which really just tasted like soy. -The Eden Roll- A vegetarian roll with tempura sweet potato wrapped in brown rice. It was also good, but not special. I like brown rice (a lot) but it pretty much fell of the roll into the soy/wasabi. -The Snow White Roll- Our favorite! This roll had a really unique taste that I couldn't in-point, we could have ordered two of these!-Miso soup- Was good (again), not wonderful. I tried the \"Perfect Bloody Mary\" - it's a martini, I was unaware of that upon ordering. I didn't really like it.-The ambiance is pretty cool- There is cool pop-art everywhere, pretty modern.-Service- Seemed to be hot and cold, our waitress was't friendly and wasn't around enough to realize that we didn't have any wasabi or ginger. I was unimpressed, but that was just one individual, not sure if that is indicative of the entire restaurant. I wouldn't avoid it, but would't seek this place out specifically. None of us were unhappy, but it didn't seem like anything special."], ["Ute L.", "This place is pretty strictly a sushi bar, with none of the usual Japanese appetizers like grilled eggplant or agedashi tofu. They do have quite a few vegan sushi rolls, which is cool, as well as a Gluten-Free menu. Lots of serrano chili and spicy maki rolls. A bit more variety would be great. As I am writing this, I can't even recall the rolls we had, which must mean they weren't that memorable. One thing we did re-order was the cherry bomb, spicy tuna served nigiri style on top of crunchy rice. Get it without the spice crust unless you like your mouth on fire. I personally don't like anything overpowering delicate, buttery fish filet. Another thing I will say is that they make the best brown sushi rice here. Perfectly soft, fluffy and sticky. The BF hates brown rice maki rolls because the rice is usually grainy and won't hold together, but was thoroughly impressed by the texture of their brown rice. Do order the chocolate spring roll dessert, which was a great combo of warm Nutella inside a crispy batter, served with raspberry chocolate chip ice cream. Yum."], ["Joel L.", "I went for a quick snack and was disappointed.  The restaurant was nearly empty on a Sunday afternoon.  I sat at the bar and took a while to flag a server.  Took a while to get my drink.  The server didn't write down my order and got it wrong.  She correctly ordered edamame but they never arrived.  I was waiting for food for about 40 minutes.  After eating, the server was missing so I had to walk to the hostess for the check.  The Hot Popper Raw Maki was fine.This restaurant seems to have a lot of potential; I might have gone on the wrong day."], ["Kelly G.", "This location is our favorite Happy Hour place before Rockies games on Sundays.  They have Happy Hour on Sundays from noon-8pm, Monday - Saturday 3-630pm, Fri and Sat 1030pm-Midnight. The iced water with a slice of cucumber is always refreshing. With a Yelp Check-in,  you get a free order of Edamame.   I ordered the Spicy Edamame. The Mango Crab Rangoon had 4 pieces of melt in your mouth goodness.  That was my first time trying them and will have to be a must order item.My husband always orders the Cherry Bomb nigiri.  He says they are good as candy and always regrets ordering more.They Crunchy Blue with the sauce on the side was a bit of a disappointment this time, but we usually order it.The Lump Crab Cakes were dry and had a lot of filler.  I would not order them again.The Hot Poppers had soy paper rather than seaweed.  We've ordered them before and my husband liked them.We will be back!  Go Rockies!"], ["Adriana C.", "I was SO excited to finally get to check this place out. It's one of those restaurants people always mention and rave about. OK, OK, OK, I know I am going against the general consensus on this place but I don't think I can give more than 3 stars, at least for now. I came here for an early dinner yesterday with one of my best friends from college. The interior is so nice, very sleek and modern looking. I checked in on Yelp and -score!- free spicy edamame. Reason #486431 I love Yelp!They were on happy hour when we visited, which goes from noon until 8 PM on Sundays. Not to sound like a broken record and repeat what other Yelpers have explained, but their happy hour is definitely the best thing they have going for them. After ordering the Sake Sangria (amazing), we dove right in and took advantage of their $5 rolls. I ordered two rolls: The Hawaiian Roll and the Crunchy LA. Out of the two, I would recommend the Crunchy LA. The Hawaiian did not stand out much, and I didn't even end up finishing it. The Crunchy LA was definitely the better out of the two, but still kind of forgettable. Booooo! I was pretty bummed after waiting so long to try this place. I cursed the Yelp gods and downed my sake sangria.  Service was decent, a little slow at times but nothing out of the ordinary. I would still come back to this place if someone suggested it and perhaps try other things on the menu. It would be a cute place for a date, afterwards you could walk to Union Station for some ice cream! TIP: The edamame discount is at the very bottom of your receipt. Don't be a clown like us and accuse the waitress of forgetting to take it off your bill. Hashtag My Bad."], ["Gigi D.", "If you're a bachelorette.... This is your joint. When I went the other night, there were 3 different bachelorette party dinners going on.... The \"WOOING\" was intense. Not sure why they all picked this place, I get it that girls tend to love sushi, but Blue Sushi was not 100% amazing. Sure the fish was fresh and the Chilean Seabass kicked my taste buds into another dimension of delicious, but it was all just so over priced for the quantity that I couldn't enjoy myself to the fullest.... And speaking of FULL... I didn't get to that point after eating here. That being said, my company made up for it so, at least I have those memories! Oh and I certainly won't forget the WOO girls!"], ["VA W.", "I made a reservation yelp for a party of 8 for a friend leaving Colorado. It was effortless and simple. We arrived 45 minutes prior to their Happy Hour which is by the way amazing. I ordered their house margarita which was $3.5 a drink. The food menu was fresh and delicious. I ordered the Ceviche, Vegetable Tempura and Philadelphia Roll with eel sauce. Yum! Everything was on time, fresh and delicious.  Our service was on point and everyone left happy. Do check them out!"], ["Ariana D.", "Wow! Such a cool joint. Great food and our waiter was very knowledgable. They have very unique rolls which is awesome for a change! The thriller roll was delicious; along with their specialty \"Black Tuna\". I will be returning !!! :)"], ["Amy O.", "I will preface this review by saying I've only been to Blue on Sundays during happy hour. The atmosphere is nice. Love the big, cushy, round booths. The sushi is decent, but the happy hour menu seems to be heavy on the tempura/fried stuff as opposed to fresher stuff. There aren't as many raw selections as I'd like on happy hour. But if you like the more elaborate rolls, you may enjoy it more than I did. The big issue is even when it is completely dead in the middle of a Sunday afternoon, the service is exceptionally slow. On top of that, a handful of waitresses have been quite rude and make me feel like I am such a bother for wanting more wine when my glass has been empty for 30 minutes. Maybe it is better on non-happy hour days. If I have the option, I will always choose Hapa down the street."], ["Emily Y.", "Blue Sushi is one of my favorite sushi places I've ever gone to. Great margaritas and their happy hour deals are awesome too. Customer service has been good every time I've gone. The atmosphere is awesome as well! This location is definitely a lot more touristy than the Centennial one. I definitely recommend checking it out. :)"], ["Kelsey Y.", "VEGAN SUSHI !This place is awesome. Great location downtown; casual atmosphere with good service. On top of their great menu, they have VEGAN SUSHI !"], ["Kat M.", "Great sushi. Good quality, great Sunday happy hour specials. The specialty salmon and tuna nigiri & ceviche were so fresh and flavorful, I would definitely go back for it."], ["David M.", "\"Well hi! I love your shirt. Did you know Venus in is retrograde! How cool is that? Hey, it's Friday. How 'bout I start you off with a drink?\"\"Sorry,\" I said. \"I've got to go back to work.\"\"Why that's the best reason to have a drink, \" she adorably replied.Ya just gotta love Cayla, my new favorite LoDo server. About as perky, friendly and sweet as could be.Cayla: \"You could get one of the lunch specials . . . but me, I love the Tower of Tuna. That's what I'd get if I were you, and it's even cheaper but just as large as the specials.\" \"OK. I'll have the Tower of Tuna . . . and you know what, Cayla . . . you've made my day. I was going to meet a friend here for lunch but he can't come by, so thank you for being so sweet.\" And dang it if the Tower of Tuna wasn't just deelishus. Ummmm. Think I just found me a new sushi place downtown."], ["Jacquelyn M.", "I searched on Yelp for a sushi place nearby. I came across this place that seemed to have a large menu. I have no idea what I was in store for until we got there.We sat down and a gentlemen brought us water with a thinly sliced cucumber. As I drank my delightful water, I looked over the menu. The waiter mentioned that the V next to the items meant vegan. What? I love you, Denver!I looked over the vegan rolls, and I decided on the Eden Roll. It was sweet potato, edamame hummus, asparagus, and sun-dried tomato. It was an interesting mix of flavors, but I really liked it a lot. We also got a free appetizer with our check-in. We had a choice of edamame or spicy edamame. Let's live on the edge a little, and go for the spice. ..It was very spicy and totally awesome.Overall, the experience and food was great. Everyone else at the table had sushi with fish and was very happy. The waiter was a little slow and forgot our edamame until we reminded him. I moved them down to four stars instead of five just because of that."], ["Ashley H.", "Wow!!!  This sushi spot is ah-mazing!!!Thank you to Adam for utilizing his mad, creative skills to create one-of-a-kind sushi-purist creations!  Also, Liz was outstanding! My on-a-whim sushi run, while in Denver on business, did not disappoint!  Cheers!"], ["Diane O.", "This place was great. Went for a friends birthday party and we had around 28 people. 24 of us were able to sit at 2 long tables right in front. Service was pretty slow but it was only 1 guy serving all 24 of us so not everything came out right away. Also, there were not many people making the sushi so that took over an hour from they ordered and everyone was starving by the time it got there. I'd suggest not going here if you have a very large group. Probably better for a more intimate date. Not being a sushi fan, I had the dumplings which were good, but could have been hotter (I suspect they were just done before the server was able to get to them), and for dinner had the Sea Bass on rice with asparagus. The fish was cooked very nicely and everything tasted great. I'd order it again for sure! Drinks were good too. Tried the Cucumber martini and the Coconut Mojito which was very good! Overall had a great time with friends and the food was good, but the overall experience took about 3+ hours for all 24 of us so I'd suggest a smaller group!"], ["Twyla H.", "Two stars only because I have very limited diet due to food allergies. I could not experience this place to the fullest. I left the place feeling full but my food was lacking flavor since I have corn, dairy, and gluten allergy. However, my friends did enjoy their dinner. I thought the service was great and my server was so helpful with my food allergies! If you have corn, dairy and gluten allergies, be prepared for a limited meal."], ["Claudine M.", "When I crave sushi, I keep going back here no matter what. Best happy hour ever and I tell everyone to try this place because it's so amazingly good! Went here with the bf and we got our regular fix of blue balls, crunchy roll, combo of vegetable and shrimp tempura, and his fave drink Hatori Hanzo (cucumber infused vodka) Great place, great atmosphere, great service! And the martial arts movies that play nonstop are a plus too haha"], ["Brad F.", "Fantastic quality sushi, really attentive service. The ambiance wasn't quite what I expected based on the pictures. It was much more \"busy\" feeling and while the bar was really cool-looking, we were seated in the very highly lighted dining room and it wasn't exactly the romantic/modern vibe I was expecting based on the pictures.Anyway, would recommend to anyone, but don't be fooled by the pictures."], ["John P.", "The food was terrific. Our waitress was very nice. The hostess was not, condescending and short(dark, curly haired girl). We hadn't been in before but will be back. Almost left because of the hostess."], ["Sean R.", "Excellent sushi! Some of the best that I've tried out here. The menu is different. The sushi is fresh. The rolls are creative and absolutely delicious! The Primo Fire roll is amazing! The waiter recommended the black tuna and it turned out to be awesome! Great food and great service. What else can you ask for? I highly recommend this spot if you're in the area and love good sushi."], ["Carolyn C.", "Went there last night for my don's 14 birthday.  With a decent sized party. I felt upon entering that the hostess was a little big for her britches and immediately wanted to lecture me on our party size and the seating RULES...eventhough I explained to her that three of us where early snd would like to just sit in the bar and wait. So no lecture needed, I was aware of the 75% rule and it was not a problem. The lady bartender was great and our waitress warmed up and eventually did a nice job!The rolls were average to just above average, upward lean. The price was a pleasent surprise for 10. I would recommend it but personally probably try another place if in that area again."], ["Gab S.", "The boyfriend and I are out-of-towners (visiting Denver for a week) and we just stumbled across this place while we were exploring.  We were not disappointed.The spicy edamame was great and we loved the Cherry Bomb and Itchy Salmon from the happy hour menu.  The only critique we had was that the saki sangria was really messy to pour. We had a good portion of it on out table at the end of our meal! If we find ourselves in Denver again, we will surely come back."], ["John L.", "This place has a very nice look, and by the bar, this is a good place for sake or other drinks, but not if you fancy really good sushi.Pros: A nice relaxing atmosphere for dinner or drinks; The tea cup and pot were very authentic, and the bartender was friendly and very knowledgeable about the menu; answered all my questions.  I also like the old samurai flicks playing above the bar.Cons: After my miso soup arrived, it took over 30 minutes to get my sushi, and it was not a busy night (two tables in the whole restaurant). The nigiri cuts were very slim, and the specialty roll was the size of a $6 cut roll at most restaurants.  Finally, they served a fork with my chopsticks ('nuff said). If you're looking for quality sushi in Denver, I would try Sushi Den, or one of the Hapa locations."], ["Mona K.", "Ended up here at the perfect time for happy hour. Waitress was great and asked us towards the end of our meal if we wanted to order more before happy hour ended. Ordered the yellowtail scallion roll, spicy salmon, and a tuna roll. Great portions for the price and very cute atmosphere."], ["Natalia K.", "I've been coming here regularly since this place opened, so it's time to update my review:THIS IS STILL MY FAVORITE SUSHI PLACE IN DENVERAND STILL MY FAVORITE HAPPY HOUR PLACE DOWNTOWN\"But what about [this well-known sushi place] or [that great sushi chef],\" you might say. As far as I'm concerned, every other sushi place puts me to sleep in comparison to Blue Sushi. Blue has way more creative/delicious options, a much more fun atmosphere, and the best freakin happy hour downtown (and not just compared to other sushi places).So down to the details:HAPPY HOUR:Mon-Sat: 3-6:30pmFri/Sat: 10:30pm-midnightSunday: 12pm-8pmIncludes $3 margaritas, $3 sake bombs, $4.50 rolls, appetizers starting at $3, and a bunch of other stuff. I recommend:+ House lime margaritas - because $3!+ Blue balls (tempura-fried spicy crab balls) - $4+ Ceviche (white fish and shrimp, avocado, and all the other amazing goodness) - $6+ Mussels (in a yellow curry unlike anywhere else) - $7.50Most people would stop reading here and be sold.MUST-TRYS:+ Itchy Seabass. I usually never order seabass, but this was one of the best, most decadent things I've ever tasted. Trust me when I say you HAVE to try it.+ Black Tuna sashimi. I have never had anything like it, and I bet you haven't either.+ Hattori Hanzo saketini. Probably the most refreshing, delicious cocktail ever.ATMOSPHERE:This place did an amazing job of creating a modern, trendy Japanese-American feel. The \"sake bombers' lounge\" really does have a lounge-like feel to it (think cool lighting, modern decor, and ceiling art with an old-school pinup model on it). Basically, a great place for a fun lunch, happy hour, or dinner date. It would fit right in anywhere in New York or Los Angeles.DRINKS:Great selection of sake, with some delicious affordable options. Like I said, I highly recommend the Hattori Hanzo saketini. Or the $3 happy hour margaritas are always a winner.FOOD:Don't be fooled by how trendy and fun this place looks. It has some of the best, most authentic sushi around, with fresh fish flown in every day. (And great tenderloin, too.) I don't think there's a single thing on their menu that isn't delicious, but here are my favorites:+ Itchy Seabass (the most amazing baked seabass on spicy crab)+ Black Tuna sashimi (tender walu marinated in a secret black sauce)+ Ahi tuna tacos (sweet and spicy, tender, heavy on the tuna, delicious)+ Ceviche-style white fish sashimi platter (different from any sashimi platter you'll have, probably because of the delicious lime juice)+ Ceviche (amazing white fish and shrimp ceviche, with delicious wonton crisps)+ River rock beef tenderloin (pieces of tender beef on hot rocks in a jalapeno ponzu)LUNCH SPECIALS:two maki (rolls) - $12one maki & nigiri - $13one maki & sashimi - $15Also, I have to say, they did an amazing job with their website and social media. It's not something you see with too many restaurants, especially sushi ones."], ["Jeremy E.", "I dined at Blue Sushi Sake on Saturday for an early dinner with two friends.  Cayla was our server -- she had a great sense of humor and was very helpful during the meal.  Thankfully (from other reviews) there were no bachelorette parties going on or I would have walked out the door.  Yikes.The restaurant has good ambiance, the sushi rolls were delicious.  I will definitely return."], ["Vilma S.", "Another great dining experience at Blue Sushi Sake Grill! Were greeted and seated right away by a table next to the window and it felt good with the heater on. Nathan was our server and was very friendly, gave great recommendations and efficient.We used the Yelp App to get a free spicy edamame to begin our dining adventure. Then had the freakingly delicious Steamed Sapporo Mussels, Crab Rangoons, a variety of sushi and Sapporo beer for $2-along with some great hot sake. Everything was well presented, well prepared and just awesomely yummy!! :-)Jonathan, the Manager, came by our table and he is just so nice. The place was so vibrant and you could tell everyone was enjoying their meals!Parked at the 1900 16th Street Garage for $3--yes, just $3! Only two blocks away and then walked to Lannie's Clocktower Cabaret for a show.Just a great evening all around!! :-)"], ["Tiffany N.", "Fabulous spot for happy hour but I wouldn't come here and pay regular price. The first time we went was on a Saturday afternoon for happy hour (they have an afternoon happy hour and a later evening one) and wasn't too impressed. Remarkable prices but lackluster service. So we came back one more time and it was a lot better! Happy hour is served everywhere and after some edamame (free when you check in on Yelp!) and two rolls ($4.50 a pop) we were good to go for awhile. We sat on the patio which is nice but also sketch since it is on 16th Street Mall. At least you some entertainment while noshing on discounted food. I will definitely come back for some more happy hour loving!"], ["Jordan T.", "The lunch specials are great! Two maki and a soup or salad for $12! The maki selection for this is also broad. The quality of fish and rice here is outstanding. The shishito peppers are a great started, too.Great place for business lunches, or lunch w/ friends. Come out for dinner (even late night) and have a few sake bombs!"], ["Kristine N.", "Free spicy edamame with a yelp check in.We ordered three rolls and they were all just ok. The crunchy blue needed more crunch to live up to the name. The crunchy red had zero crunch. Per the waitresses suggestion, we ordered the thriller which sounded amazing but lacked in delivery. Everything was flavorful and fresh but nothing memorable.Beautiful restaurant with super nice servers. Great location."], ["Lauren B.", "Overall the sushi is good, it's a good location and the happy hour is cheap. BUT, please don't eat here if you need their gluten free menu to actually be gluten free. I've come before and ordered my usual. But after eating a few pieces of sushi, I noticed there were large breadcrumbs sprinkled throughout my sushi rolls. I sent it all back, the manager had a talk with the staff, and the remade rolls, you guessed it, still visibly had some breadcrumbs throughout. To his credit, when pressed the manager covered our meal so we could just leave, but at the end of the day, they can't actually provide gluten free meals, and 2 days later I am still sick. If you have celiac or are sensitive to gluten, save yourself the pain and don't take your chances here."], ["Daniela B.", "Ok place for a drink but the food is not worth it. We had 3 dishes to share, the ahi tuna tacos, scallops and one of the specialty sushi rolls with spicy tuna and spicy salmonThe tacos were very salty, but other than that tasted ok. They were deep fried corn tortilla with squares of ahi tuna seared and avocadoThe scallops were awful. Chewy and cooked inside baking shells with cheese or flour sauce that covered all their taste. We had one shell each and we couldn't even be bothered with the 3rd oneThen the sushi roll...from their specialty menu was supposed to have spicy salmon and spicy tuna and cucumber and red pepper ....they were wide rolls of rice with cucumber and red pepper and non existence fish.  A pea size mix of spicy mayo and fish pieces was all we could find in each piece. So for $12 it was a nice serving of rice and soy sauce"], ["Matt H.", "Came here after wanting sushi and seeing this place on a flier. Let me begin with we got a free order of edamame for using Yelp, we chose spicy style, and it was fantastic. Then, it was also happy hour and, this place has the happy hour to beat, hands down.I got the Crunchy Red roll and the Ceviche. I'm not usually a fan of Ceviche, but this sounded amazing and tasted 10 times better. I don't know if I could come to this restaurant again and not get it, not to mention that since it was happy hour it was 6 DOLLARS. Not only a great dish, but an even better price.My friends also got the Cabo roll, the Seattle roll, the Vegetable Tempura, the Unagi roll, Shishito Peppers, Zuke Maguro and the Blue Balls. All AWESOME. The staff was amazing, never wrote anything down but got every order correct, and got it out to us fast enough that we almost couldn't order more fast enough.If you're anywhere near LoDo, you need to come to this restaurant. Especially if you love sushi."], ["Sydney S.", "just had to walk out because 3 tables were given their drinks before we even had any server come to help us. we were starving and thirsty and it was really frustrating to see everyone helped before us. nobody even noticed we left!"], ["Scott K.", "Great food, good service. A little loud on a Saturday night, but that's to be expected. Next time I'll get an outdoor table. The scallops were killer and so was the lobster roll."], ["Yana A.", "I didn't like the service or sushi here. It took a while to get one roll of sushi, and then a check. It should not take long to receive a check, especially where it's not busy."], ["Teema C.", "This place was amazing! Hubby and I sat down at the sushi bar, and the waiter brought over two glasses of water - one with ice and one without. One of the wait staff overheard my husband and I talking about what we wanted to drink and heard that my husband preferred water without ice - so it was brought how we like it without us asking - that really impressed us! We told our waiter that it was out first time at Blue Sushi and he took time to explain the menu and his favorite items - I really love when waiters do that! Then, the food - we ordered mainly from the sushi menu although we did take advantage of the free spicy edamame from the Yelp check-in too! We had the cherry bomb nigiri, rainbow roll, and the blue volcano - all of it was super fresh and super delicious! To top it off, we had the most amazing dessert - chocolate spring rolls - I would go back just for that! The restaurant itself is really cool and has a great ambiance too. Loved this place and will surely be back!"], ["Kenneth B.", "Four and a half....The food was inevitably dearly felt and created with an independant intuism. The quality is as good as it gets... The prices are decent to valuable and the experience is beautiful with great views and designs under the roof. A place for a date for sure and a memory either way... Yes for sure"]], "Miyabi Jr. Express": [["Alex W.", "Basically, it's Teppanyaki to go.  Think Benihana or any other place with a Teppan table.  However, they've added other items like sushi rolls, fried dumplings, egg rolls, etc.I got the steak bowl to go, which is steak (of course), rice and the 3 sauces you normally get.  The portions are definitely large enough for a quick lunch.  My only gripe is that it didn't come with any type of vegetable.  The bowls range $8-$13 and you'll have to drop a couple extra bucks for a salad, if you want some greenery.  The meal started turning into a grind after a while of powering through protein and starch with no veggies. =(Extra points go to them for including Japanese green tea on the menu!"], ["Patrick K.", "This place is great. Awesome fresh food without a long wait. The hibachi combo is the way to go, along with all the sauces. I go here once a week for lunch now. Also the staff is very friendly and on the ball."], ["Steve K.", "Love Miyabi Jr. You get the quality of a fancy hibachi steak house for half the price. Great friendly staff. I've been in with my wife at least a dozen times (had two of their \"frequent eater\" cards filled for free meals) and brought some friends who are now regulars as well. I really love the \"swai\" fish which hasn't been mentioned in other reviews. It is a nice flaky white fish grilled to perfection.The only thing I would like to find is the nutritional (calorie) information in each of their meals. I am counting calories and where many restaurants post their nutritional information on a website, I can't find anything for my new favorite restaurant.Or maybe the food is so good, I really don't want to find out!"], ["L B.", "Dare I say a BETTER version of Benihana and without the wait and tiny portions. The hibachi was great and so was the teriyaki. The young cashier was pleasant and food came out quickly. Will be back!"], ["Lorna C.", "The best restaurant I have eaten in since coming to Denver. I will be returning and special thanks to Junya Mgr who made sure everything was cooked to perfection"], ["Statuesqur J.", "So good!  Fast and delicious hibachi.  Had the steak hibachi entree.  So happy it was quick and affordable.  I was so pleased and will definitely return."], ["Julie S.", "Very very very very very very yummy in my tummy. Cheap and derrishush."], ["Zak B.", "Back when I lived out east these type of restaurants were prevalent and for good reason. I tried numerous places looking for something similar in Denver and they never could hold up. Finally a South Carolina chain migrated out west. This place is fantastic! The staff is insanely friendly and eager to please. The chicken, steak, and shrimp hibachi entrees are all lovely and paired with white sauce you truly can't go wrong. They also deliver to our office on the north edge of the tech center. Delivery is free and relatively fast. We eat here a ton now! Strongly recommend it!"], ["Gil A.", "What a pleasant surprise! It's a bit hidden away at the east-facing side of Tiffany Square strip mall on Hampden off I-25, but it's worth checking out. Miyabi Jr. is a chain started in the South as a fast-casual spinoff of a traditional Japanese steakhouse (Benihana style teppan-yaki grills, ironically just across the street from oe of the last remaining local Benihanas) but with a smart efficient spin: The teppan-yaki grill is in the kitchen behind the counter, and one chef manages the cooking for the room. The food is the same mix of steak, shrimp, chicken, seafood (and yakisoba that I'll have to try next visit)  served with the same large plate that includes grilled onions and zucchini, and a generous mound of fried rice. The food is tasty and the service is terrific for the small staff. Owner Junya Nakajima is a hard-working young man with a vision. Customer service is a big priority, and the quality of food is top notch. I recommend this place highly -- Junya says many of the items on the menu can be cooked up gluten-free.  Watch for other locations in the future. This location is worth the drive for us."], ["Laura C.", "We tried to go here three different times.  The first time, they had no sushi available.  The second time, they advertised delivery but would not deliver when we called.  Finally, I went to pick it up the third time, and we were not impressed with the food.  I had chicken in my bowl, and it seemed like lots of fat and low quality meat.  Sushi was not any better than what you would get at the grocery store.  I'll stick with Tokyo Joe's."], ["Cathy B.", "Awesome quick casual. I love the hibachi chicken with veggies only! The fish is great too. Friendly service"], ["Brandon D.", "Just what this neighborhood needed in an already saturated market full of fast Mediterranean and Mexican food (not that I don't like the cuisine, it's just nice to have some variety). Don't confuse this place with the Americanized Tokyo Joes, granted Miyabi is not a pure and accurate representation of Japanese cuisine, it does stay true to the subtle and light flavors. The restaruant itself is nicely decorated with the exception of the flower pot in the door way and the sauce bar. The staff are friendly, the meat quality is what you'd expect from a \"hibachi\" grill and my overall experience has been positive. The sauces are good especially the mayo one. Go here, you won't regret it. Light on the sodium, healthy variety of veggies, relatively fast, I'm coming back."], ["Mike H.", "Went back here for the hibachi steak and shrimp and it was delicious.  Great addition to the neighborhood."], ["Marcus T.", "It's ok for the price and a welcome addition to the neighborhood but the food isn't the best. My hibachi chicken was really dry and didn't taste fresh. It could have just been the day."], ["Mark H.", "It took me three trips to finally master this place. The first time I ordered the steak bowl hold the mushrooms and was surprised to find it contained only rice and steak. Both were good but it was very plain. The second time I discovered the sauces which are great. They help make the place special. I have now ordered the steak bowl with an add of vegetables and I put on both white sauce and ginger sauce. Yum! I can hardly wait to come back."], ["Seiki T.", "It is excellent!! Food, service and price are all great. This is a kind of reataurant where I can visit every week. It is truly recommended."], ["Peter L.", "Affordable, delicious and quick!!! Better than Benihana flavor,  without the Benihana price. We will definitely be back!"], ["Rachel S.", "Sumbled upon Miyabi's tonight in the middle of a rush and was pleasantly surprised. The staff was friendly, apologized numerous times for the wait, even stopped by to pick up our plates & make sure everything was great. Between my husband and I, we ordered a tofu dinner, chicken & steak dinner, and a few different rolls. All were fresh and simple. We will definitely return."], ["Monique M.", "Awesome!  I tried the steak hibachi, pot stickers, and the onion soup. It was all sooo good! All the sauces were fantastic. I also tried the fried cheese cake and it was ridiculously yummy.  LOVE this place!"], ["Daniel H.", "Saw this had just opened, gave it a try. I'm very glad I did! The staff was extremely friendly, and the food was very tasty.  I ended up with the steak and shrimp combo, while my friend had the fish dinner. The steak was quite tasty, but the shrimp and fish were the real stars of the show. Great seasoning and very well cooked, complimented wonderfully by the better-than-average rice and veggies.  I'll definitely be going back!"], ["John F.", "I've been here twice and had attentive service and good food each time.  As other folks have mentioned the portions are of good size (I like to eat and split a chicken bowl with my wife).  The owners were attentive and soliciting feedback which I thought was nice.  The atmosphere was clean and fresh and the patio seating made for a nice experience as well.  There is a wide variety of things on the menu and I look forward to trying more!"], ["Dawn M.", "Fast, friendly service, and excellent food.  We had the hibachi steak and the teriyaki chicken.  The steak was flavorful and very tender, and the teriyaki did not overpower the chicken.  We will definitely be back!"], ["Sarah H.", "Awesome food. Just like a sit down Japanese steakhouse. Steak n chicken combo so good even to go. Worth a try and another."], ["Emily W.", "Really excellent teriyaki bowls. Pretty fast service. Only negative is the $30 minimum for delivery, but they were nice enough to wave that for my first delivery order since the minimum isn't advertised."], ["Tom N.", "Quick and tasty hibachi dishes are this place's forte. From the time it takes to order and get to you is about 5 minutes on average. The food is best hot off the grill and eaten right there, but it's still pretty good heated up if you have to take it to go. I usually go for the steak and shrimp or the steak and teriyaki chicken combo. They have these three dipping sauces, a ginger based sauce, a mustard one, and this odd mayo based one. The first two remind me of the ones you can get at a restaurant style hibachi grill, the last one really isn't my favorite... It kind of reminds me of the \"special sauce\" you can get on some fast food burgers; that odd combination of mayo and maybe ketchup or something... The sushi is kinda subpar, so I'd probably avoid that. I've had the fried cheesecake which was a bad idea. It likes a block of cream cheese that was deepfried. The Calpico drinks on display by the register, I absolutely love and highly recommend. I believe there's a discount for L.E., Fire, and EMS workers which is pretty awesome. I could eat here a few times a week to fix that craving for hibachi style Japanese food. The decor isn't anything fancy. It doesn't really have any personality, which is both good and bad I guess. The general staff is pretty friendly, if a little timid. I'd bet this is their first time working in the hospitality industry. The managers and chef are great though. I definitely recommend this place if you need a quick fix for hibachi food, but don't want to sit around and wait for a table to fill up."], ["Ronald P.", "My wife and I enjoyed dinner here tonight after seeing a movie at the Elvis Tiffany theatre. This place is in the same shopping center.   The food was very good, as was the service.   We both ordered the filet mignon&shrimp hibachi combo.  She had shrimp tempura sushi rolls, and I had a couple of spring rolls.   I had diet coke.   The total, before tax and tip, was $38.  The place is clean and bright.  The person taking the orders was friendly,  and the whole staff appeared professional.   The hibachi grill is right behind the counter, and the veggies and shrimp cooking there looked delicious when we were ordering.  The spring rolls, and then the tempura shrimp rolls, came out promptly and were quite good.  Very soon after that, our main course arrived.  The beef was tender and delicious, and the mushrooms with it were a great accompaniment.   It came with a big mound of rice, and with delicious veggies --zucchini and onions.   The waiter checked in on us to be sure all was good.  With the good service, great food, and nice looking restaurant, this place is excellent."], ["Pat P.", "I enjoyed my dinner from Miyabi Jr. I had the shrimp bowl: it was tasty, fresh, and reasonably priced. Nice addition to the neighborhood."], ["Chris V.", "The quality of the ingredients stand out as the most impressive part of this fast hibachi restaurant. The menu is extensive but easy to navigate.  Tasty and made to order.  With the loss of Ramen in our neighborhood, a hole was left that I thought couldn't be filled. While express habachi is obviously a different menu than Ramen - we are making Miyabi a regular part of our healthy / fast food rotation!"]], "Sushi Den": [["Leigh B.", "Holy crap.We have had sushi all over the world and this by far kills them all.Thank you to every yelper who said about other places that they weren't Sushi Den. Definitely do the chef's special and let them guide you. We tried a ton of stuff we would not have tried otherwise and boy howdy, was it all good! I don't know how I will ever eat sushi at home again."], ["David A.", "There's a reason this place is rated as high as it is, the food, service, and ambience all live up to its reputation. As an out of towner I rely on Yelp to find the good spots, and Sushi Den is one of those that lives up to the hype. Let's start with the service. The waiter was great and was constantly attentive to our emptying glasses and had great suggestions for any and everything on the menu. The food!! The food was nothing short of phenomenal. Starting with a cup of miso soup which wasn't your typical salty soup. It was real miso broth with mushroom and vegetables and fresh tofu. Also, the lobster tempura was perfectly cooked and flaky and the dipping sauce was a perfect match. We also had a few pieces of toro which was the best toro I've had hands down. This place selects their sourced fish from the best locations and flies it in daily. We finished up with he Kobe beef, not the fake American kind, true Kobe and the red dragon roll. All well balanced and perfectly prepared. I can't wait to go back and try this place! Go to Sushi Den!"], ["Pez E.", "My husband and I stop in every time we're in Denver and often take impromptu road trips just to eat at Sushi Den, since we can't get sushi of this quality in NM. The fish is flown in daily from Japan, which really makes this spot the best!I love the miso ramen- perfectly cooked noodles, exquisite flavoring, and beautifully presented. My husband loves the decadent lobster roll, we both enjoy the poki roll, and usually go for one of the specials. The service is always impeccable with many staff employing the lovely \"two hand pass\". There's always a wait and they don't take reservations for parties smaller than 5."], ["Inayah V.", "I'm going to start with the bad here, and that is the liberal use of syrup without warning. I read nothing on the menu that would indicate the appetizer would come swimming in a puddle of sickeningly sweet noxious glaze with the consistency of motor oil. Perhaps the fact the spicy tuna appetizer is described as a favorite was supposed to clue me in. Could it be that this highly acclaimed restaurant that imports fish almost daily is pandering to the uneducated palates of an American clientele? If that's the case, do us all a favor and throw that filth down the drain! I've heard Anthony Bourdain talk about the pain on the face of a sushi chef watching a customer apply soy sauce to his carefully and skillfully crafted food. How then can a place like this adulterate their quality cuisine in good conscience?Now on to the good. The food and cocktails really are excellent. The south Pearl location is fantastic, and the decor is warm and very complimentary. I especially recommend the Blood Orange Horizon and the Negitoro (fatty tuna) roll. Do yourself a favor and tell your server no eel sauce as soon as you sit down."], ["Chisholm T.", "Two words: CRISPY TUNA!!! This is a house favorite at Sushi Den and honestly, one of the best things I ever ate! It was basically spicy tuna on top of crispy sushi rice, with a glazed sauce (possibly teriyaki?), sliced avocado, jalapenos, and roe. Sooo amazing!!!My friend and I started with that, and a couple glasses of white wine. We were feeling adventurous so we asked our server, El to take the steering wheel for us and asked her to pick our dishes without telling us what we'd be eating until it arrived at the table! I mean, why not?! She knows more about the menu than we did and knows what's good there, so we gave her our budget, I told her I didn't like salmon, my friend told her she didn't like spicy food, and El went above and beyond to give us the most delicious dinner!I wish I could remember the name of the dishes she brought out for us, but I think most of them were from the specials menu. She gave us some of the BEST tuna nigiri I've ever had! They were all different cuts of tuna that ranged from light to dark and all I can say is WOW. She also brought us a vegetarian roll which was insanely flavorful. There was also a tuna sushi roll that we had which was on the specials menu. It literally melted in my mouth. And then she brought us each a hand roll which was so fun! Felt like we were eating little sushi burritos. She brought me a spicy tuna hand roll and a a kobe beef hand roll for my friend and that was such a fun and delicious treat! We ended with the banana cream pie dessert which balanced our entire dinner.Such a memorable and fun experience! Thank you El for taking such great care of us! Can't wait to come back!"], ["Celia G.", "It's a very nice and fancy sushi restaurant.  I am usually more into smaller and authentic Japanese joints.  However, this place has really impressed me with high end restaurant service and quality food.  The signature maki rolls are very tasty and flavorful.  And the prices are not too bad.  For sashimi and nigiri pieces, they are very expensive and double of the price of where you can find in a quality smaller sushi place. It's a great place for celebrating special occasion.  The decor is beautiful and trendy, and the service is definitely very attentive."], ["Thea T.", "The best sushi I've ever had-and I'm not a sushi person. My friend from LA dragged me here after work, telling me that she's \"had dreams\" about the volcano roll-I now see why. The volcano roll comes piled with seafood drenched in mouthwatering sauce and is filling without being too heavy. We had the spicy tuna first as well as a few other a-la-carte sushi rolls. I thought those were pretty good but didn't compare to the volcano roll. Come to think of it, the only thing I remember about dinner was the volcano roll...There was a wait for the table, but sitting at the bar was just as nice. Gluten free options are available as is valet service. Food came fast enough to give my friend and I time to catch up while having enough of an evening to finish working. Thank goodness we had a company stipend, because, as other reviewers have noted, the check was pretty hefty."], ["Samuel Antonio S.", "This was a very happy experience overall! We all know that the Den has its reputation. I would say confidently that it lived up to the hype. We went for happy hour last night and treated ourselves real nice. Check out the pic of the 3 rolls we got. We also enjoyed various nigiri sushi and a pair of hand rolls, started with a fresh seaweed salad and drinks. The fish is top notch. We tried the copper river salmon nigiri, from Alaska, which I had tried a month or so back at their little brother restaurant, Izakaya Den. It was well worth the $5 a piece. So buttery, melty and delicate. I highly recommend this. The rolls were rolled and presented perfectly with unique combinations of flavors. My only complaint: we walked out of there with a $130 bill with tip. Ouch. Totally worth it if you are ready to splurge!"], ["Betsie S.", "Solid sushi with great service and a lively and fun atmosphere. I really enjoyed my dinner with my family here, but in order to get 5 stars an experience has to be spotless. All my family enjoyed their entrees. We started with an excellent, piping hot miso soup and complementary hot green tea.  My mom could not have enough of her teriyaki chicken with potatoes. My veggie-loving sister had the veggie sushi dinner and all the rolls were good, especially the smokey, grilled eggplant sushi. My dad and I shared the firecracker roll, kobe beef roll and asparagus roll. All the rolls were good, but definitely not amazing except the kobe beef roll which gets 5 stars. The least successful dish, although highly reviewed, was the seaweed salad. This dish really fell short for me-- the flavor and texture was one note and the chewy purple and green, slightly translucent seaweed bits reminded me of the stuff that washes up on beach shores. There wasn't enough cucumber to add crunch to this one-note dish. The words that come to mind when I think of this dish are chewy and Spongebob Squarepants.The highlight of our dinner was the fruity mochi ice cream. I would go again and just skip the seaweed salad. I enjoyed everything I ate here and really loved the kobe beef roll. I usually don't go into detail about dishes I don't like, but the seaweed salad was really unpleasant for me. The service and atmosphere were spot on and great for a date or a night out with friends.Also, they don't take reservations for parties small than 5 people and do not have happy hour on Sundays."], ["Blair C.", "Honestly I was quite upset with my visit to this fine establishment! I hosted my birthday dinner here with my friends and we had quite a large party. I was very happy they were accommodating with my guest list changing though. The reason for choosing this restaurant were the recommendations from my friends and of course reading the many raving yelp reviews. It took about 15 minutes or so to get seated from our reservation time. Another downside, they do not take reservations from 6-9 pm on Friday and Saturday. I do not understand why they wouldn't because this is a very busy restaurant. Apparently, its always on average over an hour wait. Once seated, we were only provided with ONE waiter for a party of almost 20 people. It took our waiter almost 45 minutes to get our order of drinks and sushi. The main reason why I didn't dock any more points for this restaurant was because of their sushi. My fiancée and I shared the Kobe beef roll and big roll. I loved both rolls but be forewarned if you don't like hot spice, they add a dash of wasabi into all of their rolls, so there is a bit of a kick. I liked the sauce (siracha/mayonnaise/shoyu/seasame seeds) that came alongside of the big roll. The big roll came with no rice but it also came with a little side salad. Because it was my birthday, they gave me a scoop of green tea ice cream on the house. Lastly, when we were ready for our checks, it took longer than it should normally take. We asked for separate checks and provided our waiter with the sushi sheets as who ordered what. However, this still confused him. We were the last ones out of the restaurant after 30 minutes of closing because it took our waiter FOREVER to close us out. If I do come back not saying that I will, it will not be with a big party as they are not efficient in taking care of a bigger party."], ["Adrian J.", "Sushi Den has to be one of the best sushi restaurants in Denver. Walked in on a Sunday night and the restaurant was packed. Fortunately we were able to get a seat at the sushi bar.What followed was a flurry of sushi rolls and nigiri. All great quality. Clearly the fish is very fresh. We stuck mostly to the sushi den speciality rolls and enjoyed spicy tuna, volcano and sea food rolls.If you stick to sushi rolls it's not expensive (by sushi standards). For two people we ate well for 75 dollars in total (included a Japanese beer each). The average sushi roll (8 pieces) is priced at about 15 dollars.Overall very happy with experience."], ["Jerad L.", "Best sushi in Denver! Worth the wait.  I love this place, and keep coming back.  This is a great place to take a date. Regardless of whether or not you like fish, you will like Sushi Den.  Sushi Den is within a genre of its own, where almost all the dishes are unique and fantastic. I asked my server, Beau, for recommendations & he did not disappoint. Make sure to get here early before \"prime dinner hours,\" or else you're going to have to wait awhile before you get seated. if that's the case, grab a nice Sapporo at the bar."], ["Lina H.", "I was super excited to try out Sushi Den after reading all the glowing reviews on Yelp but it just didn't quite live up to the hype. ___________________Let's start with the Bad:Blackberry yuzu mojito:  WAY too much mint and it tasted like watered down blackberry syrupWakame Salad: I couldn't really tell if I was eating giant pieces of seaweed or if there were pieces of kale mixed in. Also my first time having it with fruit - it was interesting but left me wanting the traditional wakame salad_________________Now to the Good:Volcano roll: SO DELICIOUS. I wish we had just ordered 5 orders of this one thing. I can't even really comprehend all of the stuff piled on top but it was amazing and I want more of it. Whatever that sauce was needs to just be on everything.Pineapple Upside Down Cake: It was moist without being soggy. Pineapple-y without being too citrusy or sweet. It was everything I love in a dessert. ________________The Mehs:Kobe beef roll: gasp - I know, it's blasphemous to hate on something so beloved here but at the end of the day, its beef wrapped in rice so it just tastes like...beef and rice. Could be in a roll, could be in a bowl...nothing special to write home about (although I'm writing it in a yelp review so maybe that's ironic?)________________Takeaways: Since I got the volcano roll first and finished with the pineapple upside cake, the meal was bookended by great items. Everything in between was decent but just not mindblowingly awesome to distinguish it against any other sushi place out there. I would still come back but it would solely be for that volcano roll."], ["Sarah S.", "Sushi Den has been around for so long. It is intimate, it is a perfect business setting, it is a great place for friends to dine. The hohati (so) scallops are amazing, along with all of the rest of the menu."], ["Joe B.", "I've eaten at a lot of sushi joints in my life and Sushi Den has to be atop any list. From the miso soup, tempura lobster to the cuts of sushi it truly gets no better. The places fills up quick for happy hour so don't be surprised if you have to wait for a table. I come back here every few months just so I can taste the greatness. Today, my mom got the miso ramen and it was delicious. Along with our other orders of sushi, nigiri, and lobster it was a killer meal.It wasn't cheap but like I told my mom I rather pay more for good sushi then pay later for bad sushi."], ["Anna N.", "This is my favorite sushi spot in the country! When I lived in San Francisco, I made a point to visit sushi den whenever in Colorado. The fish is fresh, flown in from Japan daily, and impeccably presented. My must-try recommendations- jalapeño sashimi, tuna firecracker roll and the Kobe beef roll. Whatever your pleasure as far as sushi, you will love- we always mix that part up depending on the fresh fish on the menu. Normally, I am too full for desert but during our last visit, I tried the banana cream pie which was phenomenal. Don't miss it!!The ambiance is great and although the place can be a bit sceney, it does not impact the service which is always outstanding. #ilovesushiden"], ["Ted S.", "My girlfriend and I were craving sushi and we're definitely in need of a date night. We decided to head to sushi den since we've heard so many good reviews but hadn't enjoyed it ourselves. Until now. The atmosphere is noticeably intimate the moment you walk through the doors. The restaurant itself is very big. There is a TON of seating. For dinner we had to wait 20 minutes but there is bar seating (if you can find a seat) available to rest your legs. Once your table is ready the fun begins. We started with some green tea and beef carpaccio. Our server was very good at having nice small talk to maximize our dining experience. The main course, tuna firecracker roll, beef Wagyu roll, and the black miso cod, was delicious. Hands down the black miso cod is a must. I was so flavorful and every bite leaves you wanting another. For desert we ordered the pineapple upside down cake. For myself not being the biggest dessert guy I was able to eat this consistently and almost (almost) keep up with my girlfriend, lol. Definitely come whether you're in a group or just a date. It's a great place to be!"], ["Kristen M.", "Great food, servers, and atmosphere.  I love coming to this restaurant and always have a great experience."], ["Claudine M.", "I've been dying to go to this place and it was such a delight to finally have a date here! The restaurant has low lighting besides the sushi counters where you can see the masters at work. It could've seemed intimate, but the place was busy so the chatter of the people made it a bit more lively. For a weekday, this place still gets packed so I suggest you make reservations or go their earlier. We just had to wait 20mins which isn't that bad. There's a bar and a side bar inside that you can drink while waiting for your seat. When we were finally seated, our server Jeff was very nice and gave us some suggestions and answered some of our questions. Really good in refilling our water and tea, and asked us every now and then if we liked our meal. For the food we got the beef carpaccio, miso black cod, tuna firecracker roll and the Kobe beef roll. Everything was delicious! My boyfriend was a bit skeptical eating raw beef but he actually liked it. The sushi rolls were great, but we enjoyed the black cod the most. It was cooked perfectly and the miso sauce was a perfect combo to it. We even had enough space for a dessert, which is my favorite part of the meal! We got the pineapple upside down cake with lychee ice cream. I loved the ice cream ice cream! Yummmm! I can't wait to back here and try everything else!"], ["Tanner P.", "-On a Sunday night, the wait was just under an hour long. -The ambiance is beautiful. Great lighting, cool / modern / hip feel to the place. -The service was excellent and the servers were present and attentive without being in our faces. They folded our cloth napkins when any of us left to use the restroomThe food was in the \"just ok\" category. EVERYONE I know raves about this place but I honestly did not understand the raving reviews because the sushi was average. In fact, the app I had, which was served hot in a dish with calamari, shrimp, etc. tasted like mayonnaise right out of a jar. Overall, I felt it was a lot of hype and the food quality, while carrying a traditionally reliable appearance was pretty \"meh\" and not very impressive. It just wasn't impressive. There is better, more quality sushi in Denver.... Sorry guys.... I said it."], ["Olivier L.", "I had very good Nigiris at Sushi den but I can only remember the lobster tempura. They served me a full lobster tail tempura style. It was very tasty, sweet and tender. I recall only paying $15 for it. Atmosphere is great too, the restaurant was filled with a cool crowd on a Wednesday night."], ["Joshua S.", "Service was amazing, given how busy it was, and near the end of the lunch shift. The fish itself was probably the best fish I have eaten in Colorado. The fact that they buy their fish every morning is inducing in itself.The new style and ginger sashimi are plates with immense flavors: mixed oils and mushroom mixes that bring out the deep impressions of the fish. Texture. Just endlessly soft texture of the fish. Heavenly."], ["Leigh P.", "Amazing service. Amazing sushi. Amazing appetizers. Amazing restaurant. Appetizers included:EdamameMiso codJalapeño hamachiEntree includedLobster tempura roll (which was our least favorite)New Salmon roll (which was so good)Sashimi (hamachi, salmon and yellowtail)Dessert was banana cream pieThis place came highly recommended and as a resident of southern California I was skeptical of \"great\" sushi in Colorado. I can attest that this is GREAT sushi. Its fresh and light and cut to the perfect thickness. The wasabi was probably the best I'd ever had. I will definitely dine here again. I also took a coworker who'd never had sushi and always been afraid of it with me and he couldn't stop talking about what a great experience it was. He thoroughly enjoyed it. As did I!"], ["Veronica S.", "Our friends told us about this hot spot and they were right! It's located in a cute quaint neighborhood. It is easy to miss if this place wasn't busy, sign is way too small and hard to read. Wait time was a lite long, but worth it. Space inside is decent but can get crammed for sure. It is extremely loud, so if you're looking for a quite setting, this isn't it. I came during dinner time, so traffic flow was heavy. I honestly can't Rene bet all of what I ordered but the red dragon roll was insanely delicious!! That's the one roll that was perfect! Waitress was awesome, Elle was her name I believe. Service was perfect!! Have to try this place if you haven't!!"], ["Dan D.", "This place is amazing. We were here a decade ago, and when we finally got back to the Denver area - we had to go again. We were not disappointed.We almost didn't go here, because the prices are quite high, and given our expectations of the meal, we knew we'd spend a lot (well over $100 for two)Every item was superb - well prepared, tasty, and nicely presented. Our server, Robin, was attentive, and made recommendations based on what we said we enjoyed. We've been to Japan for sushi and sashimi, and Sushi Den compares well to some of Japan's nicer sushi restaurants.Things to watch out for to insure a good experience - trying to park here is almost impossible - even the line to get valet parking clogs up the narrow street. So be aware that you should park a bit away and walk, or just be patient. We came early when the restaurant opened to avoid this issue.If you come on any popular night or time, be prepared for quite a crowd, and the service won't be as good. Again, we came as they opened and that helped a lot, and even then it filled up almost immediately.Realize the food here is fresh, and esoteric for many. We love that, and it makes us spend a lot of money! Being frugal, we prepped ourselves for a big bill, and just enjoyed the food.Important note if you follow my advice and come early: Sushi Den opens promptly at 4:45pm on weekdays, NOT 4:30 as currently indicated by Yelp. (It was COLD! At least they let us stand in the entrance area, which is why the photo of their awards as we waited...)"], ["Erin A.", "Nathan's service made my first trip a fantastic experience! Unfortunately our second trip wasn't quite as successful- wish all servers here were as attentive and knowledgable as our first.Overall great food, reasonable prices for what you're getting, and great service.Thanks again, Nathan!"], ["Natalia S.", "Had a great time at Sushi Den! Came in an hour before closing and the bartender still catered to us like we had the whole night ahead of us! Didn't make us feel rushed. AMAZING sushi and INCREDIBLE drinks. Cant wait to go back for girls night :)"], ["Alexandra A.", "This is my new sushi spot!! The sushi is delicious and fresh.  The den is unique and creatively design. The waiters were attentive and polite which makes the experience an A+. Highly recommend!"], ["Sally C.", "Totally overrated! Not worth wait or price.Reservation was for 8 and we were seated at 8:30. No space at bar and no where else to wait.Wouldn't recommend."], ["Chelsea F.", "Best sushi in Denver!!!! You've gotta try the New Style Salmon Roll and the fresh Fatty Toro Nigiri!! Delicious!"], ["Cyndi J.", "I can't believe that we have been here a year without going to Sushi Den!   This is a lovely restaurant in a nice neighborhood. We walked in without a reservation, on a Wednesday evening (on a weekend, a reservation would be recommended).  Our server was very kind to us.  We started with egg rolls and miso soup.  The egg rolls were crisp and flavorful with a perfectly spicy mustard.  The miso soup was a warm hug on a rainy evening, with fresh mushrooms, tofu, and seaweed.  We also had two rolls - one with eel the other with salmon.  Both were presented attractively and were fresh.  They were also not over-sauced like some rolls tend to be.  For dinner, I had the Wagyu beef - tender and bathed in a light mushroom demi glace, and fluffy mashed potatoes.  My husband had the lobster ramen.  The broth was a lovely juxtaposition of complex sea flavors.  The ambiance here is lovely.  There is a nice cocktail menu,  And the food is divine.  Well worth a trip.  They do have valet parking.  The neighborhood is a bit deprived of parking!"], ["Kiyono A.", "This is my favorite restaurant in Denver, hands down.My friend and I had the good fortune to sit at the sushi bar as walk-ins (weekday nights are the time to go), and our sushi chef was warm and welcoming, giving us plenty of time to decide which of the amazing fish choices to go with, yet managing to be attentive any time we had questions or were ready to order. Every bite was everything I had hoped for and missed about sushi. The rice was delicately seasoned, sticky, and light. The fish was fresh and flavorful - each variety distinct in taste and texture, cut perfectly by our chef. The unfiltered sake was sweet and refreshing, a welcome palate cleanser between bites. Perfection.At the end of our meal, I had a chance to talk to our chef about where my family was from in Japan, which led to the discovery that not only was my chef from the same city as my grandmother's family, but he was also one of the Kizaki brothers. I was blown away by how humble and appreciative he was, despite his family's overwhelming success. I will absolutely be back, and encourage any sushi lover to stop in. Worth every penny."], ["John H.", "I AM A FAN. Sushi Den has really been the sushi spot for me when in Denver. Start with quality sushi and amazing sushi chefs.  They were attentive, professional, engaging and warm- this is what makes me always come back. When in Denver make sure to stop by."], ["Linda F.", "So many great choices.  Great atmosphere.  Everything is very fresh.  Wait staff very attentive and friendly."], ["Hoang N.", "The sushi here is probably the best in Denver.   However, it is not always consistent.   The wait is too long.  I wish they have reservations.   It is about 2.5-3 times more expensive than most other sushi places (depends on places of course) but it does not taste 2.5-3 times better.  I would go here for special occasion but not when I am craving for sushi."], ["Meredith X.", "Came here after wine tasting at the Infinite Monkey Theorem Winery so drunk munchies in full swing. On that health(ier) kick and craved sushi, bf used to live around the neighborhood and raved about this place. Off to Sushi Den. We rolled in at 6:00 on a Saturday, passed the time at the bar with some sake and Sapporo, seated not long after. Spicy edamame, toro nigiri, spider, and rainbow to split. Spicy edamame perfect app to whet the appetite. Unfortunately, the sushi was lackluster. The toro not firm enough and the slice disproportionately larger than the rice. I'm probably the only person to complain about generosity but I prefer my food/sushi to be in perfect ratio. Perhaps we ordered incorrectly with the spider and rainbow rolls, sauces overwhelmed any of the fresh fish delicacy, the two rolls interchangeable with any other local sushi spot's. Probably should have went with a sashimi platter, fish unadorned and undressed by any gimmicky additions. I wasn't a fan of the ambiance either. Huge place but packed to the brim, no room for any intimacy, raucous. Disappointing for a place lauded to have the best sushi."], ["Ali L.", "Came to Sushi Den for a double date night last week, and like pretty much everyone in Denver, I'd heard that this was the place to go for the best sushi experience in town.  All of those stellar reviews did not lie!We started off with seaweed salad, vegetable tempura, and Nigiri Toro.  The seaweed salad was actually a SALAD, with the sesame seaweed sitting atop a bed of fresh greens and vegetables. Very delectable!  The vegetable tempura was delicious as well.  An assortment of veggies battered in a very light tempura and deep fried.. this tempura did not taste anything like most sushi places however, it was very light as opposed to the heavy and greasy tempura served at many other restaurants.  The Nigiri Toro was the biggest hit of the first course, however.  The tuna was so deliciously tender and buttery.. yum!For the main course, we ordered several rolls, including the spicy tuna, house roll (eel & avocado), and red dragon roll.  Each and every one was perfectly crafted, and the plating was beautiful!For \"dessert\" we ordered some nigiri again, but this time had the albacore tuna, yellowtail, and salmon.  The albacore tuna and yellowtail were my personal favorites... the yellowtail could even double as a dessert, it was so rich!I had an absolutely fantastic experience at sushi den!  The atmosphere was perfect for date night... very intimate although the restaurant is quite large.  The service was also top-notch!  I will most definitely be back!!"], ["Ricky T.", "You should make reservations, this place is busy but the sushi was outstanding. This place has complimentary valet parking (just working for tips) which is very nice because it's very hard to find a place around this neighborhood."], ["Terrence L.", "Came back this past Saturday for dinner and have to say it was the best experience my wife and I shared this last time. Beau our waiter took care of us as if we were royalty. Food and service was fantastic."], ["C S.", "Low quality fish!  My beloved Sushi Den has fallen victim to the low quality fish push that's been happening in Denver in the past few years.   I considered this to be the best Sushi in Colorado.  Now I'd honestly rather go to the Yatai food cart on 17th and California.   Something strange is going on with the management, I think they need to get booted.  Read other reviews about bad service and my guy that served me and my friend just started and was clueless.SAD day in the Denver Japanese food scene.  I've been coming here since 2007!  Hapa Sushi (Cherry Creek) went from good to bad and now so has Sushi Den!  The issue is the LOW quality fish!  The manager lied about the fish being from Japan, there fish comes from various countries.  CANNOT believe this place is no longer a contender for good quality fish or sushi for that matter.  Coming here for just miso soup or rice isn't worth the wait or the prices.  The best thing I had was the miso soup and the rice.  The quality of the fish was mediocre at best.  No longer coming back.  The quality of fish is good for sushi rolls, DEFINITELY not as sashimi!  But like I told the manager, the clientele that comes here has no idea about the quality of this fish so the Japanese food purists would be absent from this establishment.  Try the food cart Yatai or Sushi Sasa.If you like low quality fish, or likely don't know the difference, and like nice aesthetics, ambiance, etc.... than this is your place w/o a doubt!"]], "Sushi Sasa": [], "Hapa Sushi Grill & Sake Bar": [], "SOKO Sushi & Sake Bar": [["Dave F.", "Undiscovered, great sushi in Denver. Best eel in town; next time I'm there I'll get four eel rolls and not regret it. Quiet atmosphere, but good for fun groups also. Never ran out of water; the waitstaff was very quick with that. Maybe they are a bit slow to check to see if you are ready with your order, but overall good service."], ["JoJo C.", "First time here, wanted something other than a standard chain restaurant lunch. Great deal for $10! Miso soup, salad and two rolls definitely more than filling! I'll be back!"], ["Alice G.", "Sushi, yes! Affordable, quality sushi AT LUNCH!  Listen up downtowners fed up with the 16th St. Mall Lunch scene!  I have found a great place!  Soko Suhi is unassuming, tucked in a cluster of restaurants at the corner of 16th and Champa- It can be confusing so just follow the signs and you will go down Champa a quarter block, past the very popular Floyd's barber shop, an you have arrived!What Soko lacks in ambiance, it makes up in simplicity and quality. The lunch menu is not too complicated, and there are several SUSHI SETS to choose from.  I had the Sushi Set- about 8 SUCCULENT California Rolls, and 6 ngiri style sushi-  Check out the photo- YUM!  I could not BELIEVE this great deal!  For $12, 8 rolls plus Ahi, Salmon, Yellow Fin, Crab, Ebi, and ?I forgot.  But all of them were tender and melt-in-your mouth good.My lunch friend had the Sashimi Set and was delivered about 9 pieces of very generous delicious cuts.  Both sets came with miso soup and salad. This is one of the best sushi deals in town, and a great lunch spot- no nonsense- you can easily do this in an hour.    Very proud of my find!!  See you there!"], ["Danielle B.", "I ordered thru the EAT24 app and it was a breeze.  They had a hard time understanding that I was asking the food to be delivered at the hotel I was in but it all worked out.  I ordered the edamame, Salmon sushi, Miso soup, and the Lucky Roll.  All was fine.  They didn't give me enough soy sauce though."], ["Annie C.", "I came in on a Thursday evening around 7:45pm with three others and we were seated right away.The waitress first came around with a miso soup (comes with bibimbap) and a house salad (comes with chicken katsu).When the chicken katsu came out, it was cold, so we asked to have it reheated and the owner just remade the dish for us. (Super nice!) My sister thought it was very yummy! The bibimbap came out, which looked good. It had fresh greens and, what looked like, bulgogi.The wait for the food was on the longer side, as business started picking up, but the service was good. Our server smiled, so it seemed like she was enjoying her job.Bottom Line: if you eat Asian food a lot, go with the kitchen food. If you don't eat Asian a lot, get whatever you'd like! Everything is yum-diddly-dum."], ["Eliot A.", "First course abori salmon.  Really wonderful, fresh.  I did not like the toro as it was frozen and they tried to punt by cutting it up in smaller pieces.  That was lame but they were really generous on hospitality and little tastes of things.  I'd go back.  By in large great place.  Only downside is the bathroom. You have to go to basement for that."], ["Ken S.", "Great portions and fresh fish.  The place is laid out a bit odd and needs a solid design and full makeover.   Rolls were great and fast service.  I'd go back on my next visit to Denver."], ["Susan M.", "Delicious and quiet, warm, attentive staff, and I loved the sushi. I also got the pancake starter with crab and veggies- rich and filling. I love the music- mellow vocals and even Pacelbel."], ["Morgan C.", "small place kind out of the way in downtown, nice people good service, decent sushi given the fact your no where near the ocean. I ordered \"iced\" green tea and It had a bag floating in it, maybe that's the way they make it in Denver."], ["Kristina V.", "Went here for lunch today. Very slow service. Took over 30 mins to get food served. The regular rolls were good but nothing special. The specialty rolls are pricey but the flavor combinations were delicious. The fish was fresh so that's a plus."], ["Jennifer J.", "I think I must have walked by this place at least 5 times without noticing it, since the entrance is within the lobby of another building.Lucky for me I found it in a Yelp search and stopped in for takeout, which ended up being some of the freshest sushi and sashimi I've had.  The staff was super friendly and the takeout was quickly and carefully put together to keep everything nicely in place.The sashimi was by far my favorite, with generous and delicious cuts of fish, making what I had thought of as a slightly high price very reasonable."], ["Jesse D.", "As others have said, SOKO is great for lunch if you work downtown or just find yourself on 16th Street around lunch time! The sushi combo lunch was fresh, delicious, and packed nicely for takeout. I ordered online and walked over about 20 minutes later. I was promptly greeted at the door and received my food. What more could you ask for? I'll definitely come back, and look forward to having dinner there sometime as well!"], ["IY L.", "I was in town for a convention and didn't really want to go out for a sit-down dinner, so I called up and ordered over the phone. Excellent Shrimp Tempura Entree with miso soup and rice. Took it back to the room to enjoy a nice quiet dinner. The food was still hot when I got back to my room (an 8 minute walk). The shrimp tempura was crispy and delicious. It wasn't soggy like it could have been being a take out order. Soup was also piping hot. It was thoroughly enjoyable."], ["Jason L.", "5 stars all the way. Fresh and tasty and quality service to boot. You are going to have to try the soft shell crab roll, it's amazing."], ["Dayna D.", "Great little sushi place near 16th street! They have a few awesome lunch specials. I'm talking two rolls, soup and salad for $12. I love the spicy tuna roll. You can usually get in and out pretty fast for a weekday lunch. I've been to their happy hour a couple times, and it was decent. I've heard they switched to a different happy hour menu though, and I can't speak to the new options. But for lunch, I'd definitely recommend!"], ["Theresa T.", "Came here for lunch (11/7/15). Great sushi place! Price was reasonable. Place was quiet & cozy. The staff was warming the moment you arrive."], ["Dining D.", "Very good food! Friendly service. The tuna tartar with jalapeños and guacamole wast great. The salmon ceviche was so-so. Good uni and toro. Has unusual fish available like sanma and hamachi toro. I'd come back."], ["Shawn D.", "Nice clean restaurant, good quality sushi at a fair price. They didn't put much effort into presentation but it tasted just as good as \"pretty sushi\" for much less."], ["Ken L.", "Long day here in Denver for a conference, decided to grab some sushi and head back to my hotel room.  Ordered chirashi bowl, pretty much the most impressive one I've ever had...and I've had it a lot.  Beautiful presentation, a ton of different fish and new things I've not had on one before.  Fantastic!  Nice folks, will be back!"], ["Yee L.", "I decided to give them a try based on the online reviews. And I'm so glad I did! I had their pork ramen (I don't recall the actual name of the dish). I sat at the sushi bar and the sushi chef explained to me how their pork was cooked. It is boiled for three days straight and then marinated in sweet soy sauce...you can taste how tender and tasty it was. I definitely recommend the pork ramen!"]], "Izu Sushi": [["Matt L.", "Great food, great service, great atmosphere! Food was beautifully presented as well. I would definitely recommend Izu to anyone looking for great sushi that's also inexpensive."], ["Nick P.", "Izu is a fantastic spot. From the moment you step of Colfax the place just screams execution. It's tastefully decorated, but in that all too familiar sushi bar look. It has the same polished black countertops, and slightly uncomfortable chairs as every other sushi place. The booths up front are a nice comfortable change at least.The service is fantastic. It can take a second before a hostess will demurely offer you a table, but from then on things go really well. The wait staff is friendly, the sushi chefs are the right amount of chatty, and overall it's a pleasant place to be.They have cocktails, wine, and the usual rice beers. None of the offerings are particularly special or interesting.The sushi, however, is where this place shines. The rolls are creative and well executed. The fusion roll is one of the best rolls I've had in Denver. Perfectly spicy, with a pleasant texture, and a nice creamy citrusy sauce on top. It's just an excellent roll.Everything else we've tried in our 4 visits has all ranged from pretty good to great. The nigiri is fresh and the sashimi is perfectly cut. This place wants to do well, and it deserves to be rewarded for it.This is a great addition to Colfax.. better than Okinawa down the street (which I also actually really like)."], ["Toan D.", "Ate here for lunch today and I was very happy. Price was reasonable, food was good, atmosphere and service was great. Chirashi sushi was good fish was fresh slices were a littlw smaller but presentation was nice. Our hamachi kama took a little long but we got free dessert because of that and we didnt even complain about it taking long. Very good service. Restaurant is beautiful awesome atmosphere."], ["Niki B.", "Great sushi! Fresh, delicious and so artistic! They're service is awesome and presentation is exciting and the restaurant itself is so cool.. Very modern and just beautiful."], ["Janessa R.", "Hella mediocre. None of the fish tasted terribly fresh or delicious. Everything was pretty bland."], ["Lina M.", "Very impressed first time eating sushi here coming from Cali and being Japanese I was very skeptical about Colorado sushi"], ["Carolyn L.", "This place is AMAZING!! Such a wonderful addition to the neighborhood.  Ate there twice last week after discovering it.  The service is super friendly and accommodating, the decor is absolutely beautiful (cannot believe all of the work they had to put in the remodel from the old Famous Pizza space) and the fish is delicious and fresh.  They have some unusual rolls that are absolutely delicious.  They have good specials too--like buy one beer, get one free and a 20% off coupon on their Facebook page.  I will be back over and over again."], ["Sarita F.", "The service was good and the sushi above average. I wasn't blown away, but I will likely return!"], ["Sara W.", "The atmosphere is great, very clean and lots of cool lighting. My husband had the duck and we shared a variety of sushi and a house salad. Everything was very good and tasted and looked fresh. Our server was attentive and wait for our orders was average."], ["Dana A.", "A great option for sushi in cap hill on colfax.  Great presentations, staff was really friendly and helpful."], ["jamie w.", "Thanks yelp. We were staying in a hotel nearby and the great reviews sent us here and SO DELICIOUS. And beautifully presented. Sit on the side of the bar to watch the chefs prepare."], ["Andy B.", "Had to stop in for a quick bite. They haven't even had their Grand Opening yet. So far so good! Nice remodel, decent menu and average prices. Staff was nice, rolls, crab and eel were all good. Looking forward to trying more soon!"], ["Ky W.", "Came here for dinner. Food, service, and atmosphere were all outstanding. An absolute must try for any Denver sushi lovers! Will be back soon!"], ["Tony G.", "This place was very delicious with great staff to make my dinner amazing. I'm very pleased to come across this wonderful place."], ["Brandon K.", "I was very happy to see they opened up a sushi restaurant where the old famous pizza joint has sat vacant forever.  The service was great and the food was absolutely delicious.  Welcome to the neighborhood Izu!!"], ["Steve J.", "One word.  Delicious.  Presentation was spot on.  Highly recommended.  Very happy I stopped in and had dinner here."], ["Tiffany R.", "I love that there is finally a new sushi restaurant in my neighborhood! The restaurant was clean and the service was great. We enjoyed our free appetizer and were blown away by the quality of food. Highly recommended :)"], ["William A. H.", "I stopped by Izu Sushi at the urging of a friend on the evening of their grand opening.  I was a little uncertain about eating sushi on Colfax Avenue, but WHAT A SURPRISE!  The restaurant is absolutely stunning on the inside.  Somebody spent a small fortune on this remodel, and it shows beautifully.  I was given a table immediately.  The wait staff was knowledgeable, friendly, good looking, and the service was impeccable.  The selection and variety of items on the menu was plentiful.  The preparation time was minimal, and I was eating before I even had time to fully take in the whole place.  The sushi was probably the best I have ever eaten.  The presentation, taste, texture, everything about the meal was as it should be and far beyond what I had expected.  There was no rush and the atmosphere remained calm and relaxing throughout the entire meal.  Upon leaving, I was thanked and made to feel my business was TRULY appreciated.  There were no complaints from this satisfied customer.  I will definitely be back again and bringing friends to enjoy Izu Sushi."]], "Sushi Bay 17": [["Katie R.", "This is my favorite sushi spot in Denver. Slight bias because I can walk to it but compared with the new sushi place on colfax, it is so much better. I am a Floridian and like to think I know good seafood and this place has it. I'm all about the tuna and salmon. We even tried their Sunday all you can eat. 100% amazing! The tall dirty blonde guy server there is hands down the best! A couple times I have gone, the other servers left much to be desired but the food always makes up for it. Try their mushroom appetizer."], ["Brittney C.", "I have waited until after several visits to review Sushi Bay 17. And to be honest, I want to give them a 5 but they are at a 4.5 at best.I am SUPER picky about my sushi. I love fresh fish and great rolls and combos. I also love All-you-can-eat. My friend recommended this place to me a year ago because I told him I missed our all-you-can-eat spot from our home in Las Vegas. Sushi Bay only has all you can eat on Sundays but my friend and I plan to go at least once a month.The sushi always comes out fast. And for $29 all-you-can-eat, you really get a lot of food. I love that I can order the green mussels as part of my appetizer. Their mussels are delicious. I also love their sweet shrimp sushi. I usually order that separate from their all-you-can-eat menu because it comes with a friend shrimp head. I'm telling you, that shrimp head is worth it. It is so good. Every time we go on Sunday, the restaurant is steady but not super busy. We always get seated promptly and greeted quickly. I will say the servers are very handsome and sweet. Sometimes, they are a little slow, but they do a great job. The sushi chefs are great. The way they present the sushi is beautiful. See the pictures. This place really is a hidden gem.I didn't realize they delivered until I read some of the other reviews, but I will have to take them up on that in the future. Can't wait to go back."], ["Adriana C.", "I think I just found my new favorite sushi joint! Maybe not as flashy as some of the bigger names in Denver (cough Hapa cough) but I came here recently and had a great experience.We each started with a bottle (flask? carafe? What are those things called) Purple Haze Sake which was really good- I don't even like sake much but this one I could have even gone for seconds. As the most expensive drink on their HH menu, it was only $6.50 for a large which is awesome because I didn't even finish it until I was done with my food. For food I got to try half of my dining partner's mushroom roll appetizer, the Vegas roll, white tuna nigiri and red snapper nigiri. Those last two are seasonal, so if they have it when you are there, GET THEM! So good and they don't skimp on fish, I even turned each piece into two bites. This may be a sushi connoisseurs faux pas, but ask me if I care? The answer is a polite \"nah.\"It goes without saying with a 5 star rating, the service was perfect, tons of parking, and in the cool area of City Park West! I will most definitely be back!"], ["Gladys C.", "A ~20 minutes delivery after 9pm on a Saturday night!?!?!? Whattttttt!!!!!!! Please excuse my excessive use exclaimation mark. My mind is officially blown.I was looking for a late night dinner that's light and healthy but also delivered around my area and found this sweet spot. I ordered the new style sashimi and the Naruto roll around 9:10pm. The lady told me it'd be ~40mins wait. Reasonable wait time on a weekend night I thought, and I wasn't terribly hungry so didn't quite mind it.9:35 rolled around and I heard my doorbell rang, and I thought, \"WAIT...NO. EFFING. WAY! My food is here?\" I went to the door, and there it was, a friendly delivery guy holding my brown bag dinner waiting for me to sign the receipt. To be fair, I live within 2 miles of Sushi Bay and none of my food needed to be cook by heat, but seriously, 25 mins from ordering on the phone to stuffing my face with yummy sushi??? This place most definitely gets a HELLLLL YES! from me:)Did I also mention how thick and fresh their sashimi slices are? My dinner looked appetizing and well presented even in a take out box. It was exactly the light, healthy dinner I was looking for and It was filling for sure! This place will be on my take out list from now on!"], ["Rovi D.", "We found this gem by chance. I was craving Thai but when we walked into the restaurant we had chosen it felt greasy so we walked out. We had seen Sushi Bay on our drive so we decided to go there instead. Though the food was good (not spectacular), the customer service was stellar. From the moment we walked in, we were warmly welcomed. Our waiter was attentive without hovering and he had a several tables. Even though I said the food was just good - I think that's a huge compliment considering I've had fresh sushi in a lot of places that are not landlocked like Denver. They have great Happy Hour prices during the week and I hear they have an \"All you can eat\" brunch during the weekend. We're planning on going soon"], ["Trina G.", "Yay! A decent priced Sushi restaurant in the neighborhood, that has parking! (No offense, Okanawa) My mother and I had a great experience at Sushi Bay 17. We were in for happy hour on a Sunday and the happy hour prices were amazing! Great and fresh tasting rolls and nigiri.  The out of the box thing to try here is their fried brussel sprouts sprouts with bacon! The maple glaze on these were perfection! I can't remember the wine happy hour special but it was a good deal. They only issue I have with this place has nothing to do with the restaurant itself.  Update your website with a happy hour menu. I promise you will get more people in the door when they see your prices!"], ["Paul M.", "All you can eat done right, full menu no limitations except your own stomach. Don't eat beforehand and don't forget to have 1 of everything for appetizers! It helps to have a big group of course. Rules for finishing were normal and should be expected for all you can eat. $35 is not bad for it! It comes out fast and your second round comes out with just enough time in between stuffing yourself and feeling like you want to leave. My ONLY complaint... We ordered enough to get a boat with the fancy glowing flower and all the other neat decorations, but we just got them plain on two plates. I like when the presentation makes you appreciate the extra effort the chefs put in. Still delicious and not worth taking any stars off! See photos!"], ["The Man R.", "Best sushi I had in denver  coming from NYC .. Questionable look from the outside but don't be fooled .. Christian provided excellent informative service .. The green machine roll is outstanding .."], ["Kerry F.", "I usually love this restaurant...it's my favorite sushi spot in Denver!!! But this past week-end I was left superiorly disappointed. I had guests in town for the Thanksgiving week-end and we talked all day Saturday about grabbing the late night sushi happy hour. We even skipped dinner in anticipation! However, when I called to inquire about the happy hour at 8:30pm Saturday, I was informed that there was no happy hour because they were closed early due to lack of customers. Sushi Bay 17 closes at 11pm on Saturdays. As I mentioned, we had skipped dinner for the late night happy hour and when I asked the person on the phone to clarify why there would be no late night happy hour, he told \"We're closed.\" At 8:30pm. On a Saturday. My guests, and myself, were beyond disappointed. Not sure if I'll ever go back due to such poor customer service."], ["Samuel Antonio S.", "I have only had delivery from these guys three times now and it has been great everytime. Very consistent in fish quality and presentation. Fast delivery! My favorite roll is the black dragon, which I posted a picture of too. Fair prices"], ["Emily T.", "We had just moved to the area and were looking to find our \"go-to\" sushi place. This place was decently close to us and had good reviews. Quality of the sushi was pretty good, but for what we ended up paying, it was definitely not worth that money. Sushi was good, but I'm positive we can find better for cheaper."], ["Alexis C.", "Went last night just in time for happy hour. The house wines are $4.50!!! They have a very large happy hour menu as well, and everything was delicious and fast! We got the pork goyza, a side green saad with traditional Japanese dressing and a seaweed salad, which was so refreshing. We got 6 pieces of sashimi and 3 roles to share. They also let me buy some of the orange Japanese dressing to go.  The total was less than $60 and we were stuffed!!  Our waiter was also very attentive! Definitely going back!"], ["Rebecca a.", "Went there again for lunch over Labor Day weekend and unfortunately I caved when I saw $1 oysters.... They, again, gave me food poisoning. When will I learn my lesson?The sushi was amazing tho. I just need to stay away from those dang oysters!!"], ["Courtney C.", "The rolls were amazing, don't get me wrong.  Wine list was understandably weak, but no big deal (to me).But the sashimi was a nightmare. I'm not a huge sashimi fan and really only like the salmon kind.  But I like to give things a try, expand my horizons.  I know what I don't like, but why not try something you've never had before?  Well, One of them was so gross I gagged like 3 times.  I was so turned off I lost most of my appetite and mostly nibbled on the California roll after that. My fiancé forgot to ask if the California roll (or whatever that one that is a california roll but with salmon and avocado on top) was real or imitation crab, and you guessed it- he's allergic to shellfish.  That was our mistake, though, can't hold it against them.So, between my finance's night in the bathroom and my extended journey to swallow the sashimi from hell I've been told we won't be going back.  I'd be willing to give it a second chance and just stick to the rolls, but my fiancé is a bit picky on going back to places with bad wine lists and especially after an allergic reaction (But come on, it's not like it was food poisoning, this was entirely user error!).  I'd be totally willing to order from here one night when he's working late or something.  Have I had better? Yes, and even in Colorado.  But have I had worse?  Absolutely."], ["Ellie H.", "I LOVE THIS PLACE!!!!!!!!!Super fresh, awesome service, and delicious food. Last time my roommate and I went in, it was around 3pm and we were the only ones in there...the guys got real fancy with it and made a super cool butterfly out of a carrot. It was really neat lol:)"], ["Sarah M.", "Portions were generous, fish delicious, but service was only so-so. Our server abandoned us to chat up a friend at the bar. It is important to note he was facing us the entire time, I tried to smile and make eye contact multiple times to no avail. He only had a couple tables at this time as the restaurant was practically empty and there was another server as well. He was mechanical in his sale, and not very personable. Not the worst service I've ever had, but far from the best.What was exciting was when the sushi platter came. The sushi/sashimi was gorgeously displayed and had pretty little lights amongst the shredded radish. They also had a fuchsia orchid nicely placed on the plate. I know it's a silly detail, but I just love when a place takes pride in presentation and makes it fun. The wasabi was deliciously spicy! Often I've been running into plain no flavor wasabi, but not here. We'll be back for sure, but not on a regular basis."], ["Jason G.", "There's something to be said about cheap, bargain friendly, and affordable-- but... When it comes to sushi, it's all about quality! Sadly this spot doesn't deliver for my tastes in sushi. Maybe there's no such thing as bad pizza, but there's just no excuse for bad sushi!After hearing positive praise for this sushi spot, I joined a group of friends who frequent Sushi Bay often and I was underwhelmed and completely sad that I didn't just go home and eat leftovers instead! They offer a terrific happy hour and all you can eat special that's cheap!!! But when you combine cheap + sushi, the outcome is poor quality. I will say that the presentation is excellent pairing their subpar food with beautiful orchids and a tasteful plating. Upon first sight I was delighted and eager to enjoy my sushi and rolls. Then the sadness hit like a Mack Truck when I bit into a flavorless and limp salmon skin handroll. Then my eel and cucumber handroll delivered the same tasteless and rubber-like experience. The sushi I tried was salmon, yellowtail, and albacore. Nothing I would ever want to experience again. Just blah, flavorless, and chewy. Thank goodness I only spent a small amount on this meal I can't wait to forget! Even the ginger tasted like a chemical science experiment gone wrong. One of the group who raved about this place, which persuaded me to join-- literally spit some of her food into her napkin and told the very friendly server that something was terribly wrong with her tuna order!!!Needless to say, I didn't even finish eating my food, nor will I ever step foot into this sad sushi spot again. I think maybe if you are drunk, on a tight budget, or just don't know what good sushi should taste like then Sushi Bay would  be satisfactory. For all of my fellow sushi enthusiasts here in the Denver area-- just do yourselves a favor and stay away. There are much better options available."], ["Jason A.", "Went for a late dinner and ordered the all you can eat.  Only a couple other tables were occupied, but understandable for the time on Sunday night.Food was solid, but service was blah (nothing really of note, which is the problem).   A bit overpriced in my opinion."], ["Jen W.", "I have been here twice and it is just OK for me. The first time was last summer and the sushi was not the freshest tasting but not horrible. The only reason I went back was to meet a group of friends in the area and this was the place they chose.  It is an easy meeting spot with free, off street parking on a Sunday.  They have a lunch combo for $9.50 that includes two rolls, a very large miso soup and a side salad. The place is clean and the service was efficient and all business. A good amount of space for large groups and they have a karaoke room as well."], ["Sean K.", "Stopped in for lunch on a Friday afternoon with a coworker. Maybe 10 customers, which should have been a clue. Food was okay but I probably would not come back."]], "Aoba Sushi": [], "Sushi Bay": [["Carla H.", "My husband doesn't like sushi, so I yelped some local sushi spots that had \"non-sushi\" choices, and sushi bay came up with a lot of great reviews.  I am so happy we tried it.  The service is prompt and nice.  The food was excellent.  The dragon roll rocked my world.  They also have yummy mochi.  My husband liked his chicken teriyaki, so everyone was happy.  Great place! :)"], ["S B.", "I loved the food and the service! But the dishes needed much better washing, especially the tea pots and accessories and utensils. For this reason, everytime I consider returning, I always see that scum in my mind and keep driving."], ["Kali G.", "A great place for all-you-can eat sushi in Denver. Food is well presented, and consistently tasty."], ["Kelly T.", "I'll say this: these guys handled a table of 8 people on separate checks with relative ease, so kudos to them.The ordering runs the same way it does in most sushi places. Mark the rolls and sushi you want and they'll bring it out for you. However, some of the items I wanted weren't on the paper menu, so they said, just write it down and we'll bring it out. Which worked out swimmingly. I got two different rolls and two different nigiri sushi. The rolls were great! I really enjoyed them and I would have them again, but the nigiri I couldn't eat. I tried one piece from both types (salmon and tuna, I think) but could barely get them down. They were extremely dry and didn't taste fresh at all. When I realized that the pieces of sushi were so vastly different in taste to the rolls, I took a look inside the rolls and, sure enough, they were a fish paste instead of slices of fish.Now, don't get me wrong, I have NO problem with that. I will eat the shit out of those types of rolls at sushi happy hour at Go Fish, but I was paying $10-$12 for those rolls and $4-$5 for the nigiri and I've had much better sushi for that price. I think their sushi is WAY overpriced for what they deliver.At the end of the night my tab came out to $50 with tip and I feel like, while I was full, I didn't really get my money's worth when it came to quality. They would be getting two stars, but their service really was great and they handled our table very well."], ["Mark T.", "The Brussel sprouts are to die for, the best I ever had. The Golden seafood and Dynamite are so tasty!  The service was quick, professional, the host, was very helpful and greeted us with a smile. The restaurant was very clean and well kept. I tried to find something to complain about, but could not find any fault....even when the bill arrived!  I plan on coming on a Sunday for the all you can eat! I highly recommend!"], ["Marland T.", "Great food!  Went for all you can eat to try a lot out at once. Girlfriend I and arrived around 5pm. It was not even a bit packed. The waitress assisted us and ask if we were doing all you can eat. She was quick and friendly. We ordered some sushi and an appetizer. Near 545 we got the sushi and then about 15 minutes later we finally got appetizer.  The meal was good and some of it was better than many sushi places we went to. The waiter, not waitress asked if everything was ok and to let him know if we needed anything. After eating out first meal, he constantly made eye contact, but assisted all other customers. We eventually had to flag him down for another order. Once we put our order in, we had to another 45 minutes without him coming by once. We heard others complain about his service when he forgot their orders as well. Finally we spotted part of our food sitting on the bar, made contact with him many times and he never grabbed our food or asked us.   We finally flagged him down and he said that it would only be a few more minutes and we pointed to our food and said we were sure it was ours. It turned out to be ours just missing the salmon. After we finished the meal we began saying to each other that the service sucked. I'm pretty sure he heard us, because two minutes later, the 3rd time in 2 hours he ever spoke to us, he asked, \" soooo do you guys want the check?\"  More in shocked, we told him we were still waiting on our salmon. Never heard from him again. The waitress ended up asking if we were ok about 15 minutes later. Told her we were waiting on salmon. She said it should be done and checked. Sure enough, she came back out with the salmon. The food-awesomeService- the waiter was horrible. The hostess and waitress ended up doing more than himHeard its a great place and usually quick, but the waiter in glasses and tattoo on arm was worst experience I've ever had in a restaurant"], ["Herman G.", "Ordered delivery from this place twice in the last week. Great sushi. Tried the Kobe Beef sushi roll today. Loved it. Also liked the spicy rolls."], ["Shea S.", "Came here to celebrate a friend's birthday, which the restaurant did a great job doing. They were cool with us all having separate checks, said checks were correct, they kept the birthday boy's cake ready which was delivered by his girlfriend earlier, and provided the most awesome cake decoration ever. This thing was shaped like a tulip and when the middle was lit, it went up in a glorious flame that caused the flower to open up and rotate with each petal having a candle that was lit. I probably had a childish look of amazement when they set this thing off. So cool.On to the sushi. I ordered the spicy crispy sushi combo, which comes with spicy tuna, yellowtail, and salmon rolls - a total of 24 pieces of sushi - plus a side of miso soup and simple salad with an Asian dressing. This was an incredible amount of food for only $15! The miso soup was the highlight to me, as it was packed with flavor. However, either the sushi or the soy sauce was insanely salty. I rarely, if ever, have food that is too salty for my handling, but I was grasping for water. Which was my other issue - I had to wave my glass to get more water, and I was quite parched by that point.All in all a good experience, with friendly and accommodating service that was a bit spotty at times. Although my sushi wasn't the greatest I've had, it was alright. Some of the fancier rolls others ordered looked really good. If I lived in the area I'd probably come by frequently, but wouldn't go out of my way to come here...unless I had a cake to put that crazy candle thingy on. Seriously, blew my mind."], ["Nick L.", "This area of Tennyson needed a sushi place, Sushi bay fills the void.  I've been here a few times and have always walked away just feeling okay about the experience.  The sushi itself is about average but the service is above average.I am a huge fan of their happy hour and lunch specials.  Two rolls, soup and salad for $10 is a pretty awesome deal for sushi lunch.  The HH menu is stacked too.  Lots of roll and drink specials worth venturing over to Tennyson for some sushi."], ["Luke H.", "An intimate neighborhood restaurant. This sushi place is a fine addition to Tennyson. If Sushi Bay was in any other large city in America, then it would be 5 star sushi. The problem is that Denver is tied for the best sushi in the U.S. with NYC and SF, so with place as good as Sushi Den and Izakaya Den, it is hard for a sushi spot to shine. We've gotten the stuffed jalapenos every time, and their yellowtail seems to always be fresh. I recommend the the seared tuna and the Spicy Girl Roll. There isn't normally a wait, so drop in and enjoy a good date night."], ["Brea B.", "I love this local spot.  The sushi has always been excellent and the service great.  They just recently hired a new sushi chef who is amazing, creative and very friendly.  I definitely recommend this little spot.  It's hard to find good, local sushi spots in Denver that actually taste okay but this place is great!"], ["Al Z.", "It may not be the best sushi you've ever had, but it's pretty darn good and the portions are generous. It's not flashy or trendy- and that's the way we like it.  Comfortable size, a little divey and with a great staff.A few of our favorites that aren't that odd were missing from the menu, but things that are more unusual were here, tasty and fresh.  Favorites? Everything we ordered from sushi, sashimi, traditional and special rolls all were tasty.  Did into on the sashimi portions were generous?There are two sushi places that are only a few blocks apart. A newer, louder, trendier, pricier one and this one. We've been to both and Sushi Bay is a new favorite."], ["Julie Ann W.", "All-you-can-eat Sundays is awesome!  Especially after a long day of hiking or skiing. Great deal, too."], ["Allison E.", "I'm a little spoiled when it comes to sushi ... but I was 'wowed' my first time in with the Chirashi for $18. Nice variety and all very delicious, fresh, and beautifully presented. They do a standard happy hour and late night also - beers, $5 wine and $1-3 pieces. There are discounted rolls and apps too.They're also in on the AYCE sushi trend going around. $26 on Sundays. The AYCE menu selection is surprisingly broad - as another reviewer recommended bring a few people so you can try different rolls. You have to eat what you order! I was a little disappointed that AYCE is nigiri only (no sashimi) but I understand given the cost associated with folks coming in and doing all sashimi. Overall great little spot with good service and an unpretentious environment!!"], ["Jeremy R.", "I've ate a lot of sushi in my time and this place is one of the better ones. Service is quick enough. The happy hour is alright, pretty regular deals but the fact that it isn't crowded, there's never a wait and the food is great makes it ideal in my mind."], ["Alex V.", "Don't know what to eat? Order it all on Sundays. The day of the sabbath is designated all you can eat day at Sushi Bay for $26.99. It would be ideal to come here with at least 4 people to ensure that you get a good variety of rolls. I had my hesitations because my experiences with \"All you can eat\" sushi places has always been horrendous. Thankfully, contrary to my belief this place had great quality sushi and great tasting rolls. Keep in mind that once you have ordered, you have to eat what was brought to you, otherwise you cant order any more. Also, if you get the all you can eat option, the happy hour drink prices do not apply to you. Not sure why this is, but really, who cares? The sushi is great."], ["Gina B.", "Any perfectly respectable East Coaster knows better than to eat sushi in a land-locked state and certainly not in Denver right? Well, some times you just gotta live! And they put it on dry ice right?Sushi Bay did not let me down. The sushi was fresh, reasonably priced and great portions for their lunch service. I ordered the sushi sampler with california roll, soup and salad. It was way more food than I could eat and had to take the cali roll home with me (also yummy the next day). ;)The restaurant is simple, clean and cute. Service right on point. I'd definitely go back!"], ["Gene T.", "My favorite sushi place in Denver. Pricey, but worth it. Good service, very fresh and consistent quality sushi. The yellow tail melts in your mouth..."], ["Monica E.", "Probably my favorite sushi place in Denver, besides Domo on Osage.Everyone always raves about Sushi Den but this place is so much better. I also prefer this place over the other Highlands sushi joint, Sushi Hai, which just seems to just really attract a bunch of yuppies. The food is always very fresh and going there for lunch is a great deal.I liked this place so much, I kept eating here even when I was pregnant~ that's how fresh and clean this place was!I'm also lucky because it's so close to home and I can just walk here."], ["Dave B.", "Happy Hour is a killer.Excellent service from multiple friendly waiters.The food is superb. And, the Happy Hours prices are almost beyond belief.Perfect raw fish for $1.Highly recommended."]], "Osaka Sushi": [["Ashleigh S.", "This place is a hoot!We go Friday nights - the environment is always so fun and upbeat. We were even given free sake bombs that Friday! You can tell the owner really takes pride in his restaurant. He's often there smiling and laughing it up, from table to table. A really great, personable guy.The sushi is better than average, but not exactly sushi den! & Besides the chef's picks, I've never batted an eye at the prices! I would definitely recommend, especially on a Friday!"], ["Chrissay S.", "Great sushi. Decent prices for lunch as well ! Not the cheapest sushi - but definitely worth what you pay. The have a crazy nuclear roll- if you eat the whole roll you get a free sake - really intense ! Literally spicy tuna and half wasabi with habanero hot sauce on top- whew ! Owner is always here!"], ["Kristy K.", "Osaka is finding itself in my weekly rotation of go-to restaurants.  Solid sushi located right off Colorado Blvd.  My friend and I come here at least once a week for lunch and typically get a heart attack roll each.  We then will share some random roll so we can try everything. Gotta say though, the heart attack roll has my heart.  It has a nice bite to it with the spicy crab and the flavors are delectable. The fish is always fresh.  I have never had a bad experience.  I highly recommend Osaka Sushi if you are in the area and looking for some delicious sushi."], ["Kim N.", "This place is great! The people that work here are fun and not aggressive.  The variations of sushi are good. We had...Ichiban rollOsaka tatakiTokyo taco ( oh boy I could eat the seaweed chips all day long)Denver roll(refreshing)Scallop sushiCold saki sampler Delish!"], ["Sandra M.", "Went here because of their playboy roll. They also have Dragon roll, all are very fresh. They made it really good in my opinion.They also got a good place, love the decorations on the wall. Very comfy.Will come here again."], ["Scott S.", "Not the best sushi in town by any means, but it was overall enjoyable.  If anything the place needs a facelift."], ["Michael M.", "Best sushi place hands down!! Me and my girlfriend love our sushi and believe me, we have been to many different sushi places. They have a huge variety of rolls and we feel right at home when we come in. Great service, great food. (bronco roll and mega lotto roll sooo gooood)"], ["Karly K.", "One of my favorite sushi places in Denver! They have creative rolls, which I love, and the fish is clearly fresh. The atmosphere is what makes it unique though. The servers are very friendly and I have a great sushi night story thanks to Osaka.My boyfriend and I came in to Osaka a few months back.  He had never been before, but I had visited a few times. We're immediately seated and notice a large party in the middle of the dining room.  As we debate what they're there for, the owner (or who I'm assuming was the owner) comes out and makes the longest line of sake bombs I have ever seen. It was all the way down the sushi bar, twice. The whole time he is singing and laughing, and the whole restaurant is into it. They proceed to pass out the sake bombs to EVERYONE in the restaurant, not just the party in the middle, who were celebrating multiple birthdays. Everyone cheered as we toasted the birthday people and drank our free sake bombs. The owner continued singing and dancing around the restaurant, and it was a blast.  My boyfriend fell in love with Osaka that night, and we try to come in regularly.  Haven't had another experience like this yet, but we're always hopeful!Rating: 5/5 starsGood for: groups, date night, foodies"], ["Faete G.", "Disappointing. $12+ for a tiny rainbow roll that made me nauseous. They get points for having nice staff and being well decorated but for the money I would rather go elsewhere. Denver has lots of good sushi places. I won't return."], ["Rod S.", "We were pleasantly surprised. The food was amazing, and the rolls had flavors that were so different than anything we've had before. The service was very friendly and efficient. The prices were a little high, but worth it when you taste the quality. The atmosphere is a little dated, and could use a refresh, but the food more than makes up for it. We live an hour away, but will definitely be sure to get back here again."], ["Katy B.", "This is my favorite sushi restaurant in all of Denver. The sushi and service is always fantastic, plus the owner is very nice. I always recommend Osaka to my fellow sushi lovers!"], ["Jeffrey K.", "I wish I could give this place 5 stars, because as far as my enjoyment of it goes, it deserves it. But I'm a realist and 5 star reviews are only saved for the best of the best. So this place gets a 4, a high-five, a you-should-go-there and a this-place-is-awesome.I love Osaka. First time there the owner was celebrating something and called us into a sake-bomb train. Needless to say, we didn't need to be asked twice. How fun is that?Service can be hit or miss, though I go here so often I notice that the poor servers tend to not last long. So overall it's generally pretty good.The sushi is good. It's not the BEST in the world but it's definitely one of the best sushi spots in Denver. I've reached out to other yelpers who've left negative reviews about Osaka to ask where they prefer to eat, because honestly I've had a hard time finding better sushi than Osaka for the price, and no one's been able to provide anything worthwhile. I honestly think they might've just had a bad single experience and wrote this place off. Big mistake.Osaka isn't the cheapest option in Denver. As a matter of fact, it might be a bit over-priced. But all sushi is in Colorado, and for the quality they provide and the atmosphere it's in (super laid back, wear whatever you want, ultra friendly owner) I always enjoy myself eating at Osaka.Hint - sit at the bar. You'll get faster service and a free small pickled snack :)Osaka is my go-to sushi joint and I recommend to everyone it become theirs."], ["John L.", "This place is probably one of the hidden gems in the city in terms of sushi. If you're somebody who loves hole in the walls and sushi, you absolutely have to try this place! We love the rolls but my favorite dish is the Super Bowl! It's a bowl of rice, fresh salmon and tuna, some vegetables and a spicy red sauce. The pieces of salmon and tuna are amazingly thick and fresh! The owner Jay and his wife are so nice and definitely create a family like environment. Their daughter Esther is pretty cool too!"], ["Mike P.", "Great spot for sushi!Found this place on a business trip and it is fantastic.  Lots of good choices and everything I've tried has been good."], ["Scott M.", "Ok, I'm a sushi snob.  I'm also a sake snob... so I figured that I would probably lean towards the 2-star folks who know their sushi and not the 4-star folks who seem Ok with everything being fried and covered with mayo.  But that's not what this was.  They had tons of unusual items, and even my beloved shiso and quail egg for the masago.  And here's the best part: they have my favorite sake at about $5 less per bottle than the next guy.  Good selection, some unusual roll combinations (that were really tasty!), and above average sushi.  It's not the \"best in Denver,\" but it's pretty damn good."], ["wheatberry s.", "Welcoming owner and service was great. I ordered the Super Bowl which was loaded with fresh sashimi, fish eggs, greens/lettuce - all nicely presented. The server was very attendant and thorough. The fish was fresh and portion sizes ample. I think prices were as expected. Noticed some reviewers commenting the price was high but if you want quality fish I would not want to pay \"bargain\" prices."], ["David G.", "What a find. Thanks YELP! Sam. Cozy. Some of the best sushi I've ever had. Friendly service from the hostess ands the sushi guy behind the bar. I will be back."], ["Joe D.", "In addition to the happy hour BOGO domestic beer and hot sake, this is a really great sushi place, especially if you're near Glendale and don't want to stray too far.The prices for their regular sushi rolls are pretty nice, in the $4-6 range.  Their prices for their specialty rolls are a bit more expensive than average, $10-14.  That being said, their specialty rolls are great.  Prices on nagiri are pretty standard.  If you eat a combo of basic and specialty rolls, you'll probably spend about the same amount as you would anywhere else.  And their house salads are HUGE - it's a 9\" or 10\" plate - so plan for that if you're getting soup, salad, and sushi.I unfortunately haven't had any of their other menu items, but I'm sure they're great.A word of warning, if they have their sushi challenge while you're there, DON'T DO IT!  I eat a ton of hot things.  Most things that people think are inedible, I think taste a little spicy.  Their challenge is to eat a (forget what the name is) roll.  It's spicy fish of some sort - it really doesn't matter, because you will taste no fish - with a couple types of hot chili sauces.  And it's not a dab, it is several tablespoons-full.  What do you get?  A small, cheap bottle of sake if you finish it.  What did I leave with?  A shirt with pit stains, chest-sweat stains, and we'll just say \"a lower GI tract\" that wasn't happy with me and burned for 12 hours.PS - the service is great always.  They even cheered me on a bit when I was all sweaty and gross from the aforementioned roll."], ["Melissa W.", "Wow! We moved here from South Florida a year ago (I grew up in Alaska, where there is a large Japanese population and grew to love sushi) and have struggled to find a great sushi place. We trusted fellow Yelper's and they did not lead us astray!  Our server was knowledgeable and incredibly friendly. She recommended some FANTASTIC sushi (black snapper, anyone?) and we decided to eat those as an appetizer before ordering another Deluxe Combo.  We will definitely be back and have found our sushi home in Denver!!!"], ["Amber L.", "My husband and I went here on the night of our wedding. We had a morning ceremony so dinner wasn't part of our plans. We decided after  long joyous day to go somewhere nearby and light. From their menu you can tell that crab is their favorite ingredient for rolls. Overall we had a good experience, nothing blew us away, but it all tasted good and the service was friendly."]], "Okinawa Japanese Cuisine": [["Becky B.", "My husband and I went here for dinner last night.  He's not a big sushi fan, but he loved the sushi we got here!  We ordered the Lovers role (avocado/spicy tuna inside wrapped in tuna on the outside), a kobe beef role with fried asparagus (for him), some salmon, tamago (sweet egg sushi), masago sushi, spicy tuna hand rolls and Japanese fried rice as a starter.  The food was delicious, and I have never seen a larger, more delicious spicy tuna hand roll with yummy crunchies on top.I will definitely go back!  Also, the prices are reasonable and the people who were there are so nice!"], ["Brenda L.", "Sushi here tasted amazing & the wasabi was plentiful & was really strong. Sometimes I need a ton of wasabi to get the spicy kick but this was extra strength wasabi! I got sweet shrimp + three speciality rolls that were $13.50 each.  The sweet shrimp came on a little bed of rice & they fried & served the shrimp head for us. The 3 rolls I got were:6. Spiderman RollSoft shell crab tempura, spicy tuna, cucumber, avocado, mango wrapped with soy bean paper19. Snow White RollSpicy tuna, salmon, yellowtail, avocado and crunchy wrapped with soy bean paper, rice cracker and served with plum sauce11. Titanic RollShrimp tempura, papaya, spicy tuna, avocado inside, spicy crab meat & crunch on top with soy bean paper. served with special sauce.I liked that each roll tasted unique & were all presented differently. I dislike when I'll order a ton of rolls and they all look & taste the same. Presentation was great, flavors tasted fresh & sauces weren't too overpowering. Service was eh because our server only came to our table for taking our order and giving us the bill. She stood around for a while talking to other workers so our table waited for a long time for her to notice us when we were ready to pay."], ["Jessica C.", "Okinawa has an extensive menu of creative and standard sushi varieties. I was absolutely wowed by the presentation and absolutely loved the Kobe Beef and Spiderman rolls. The special seafood broth was incredibly tasty, and a perfect starter to my dinner. The spicy rolls weren't actually spicy, but that's easily remedied with some sriracha. I will definitely go back."], ["Nichole B.", "Our whole table probably ordered one of everything and literally everything was amazing! I personally ordered the beef teriyaki lunch box, because sushi is not my fave, and I will definitely be back to enjoy it again.  I also tried a few pieces of the cucumber roll and it was also very tasty. Anywho, I highly recommend this place!"], ["Andrew S.", "I was here in late Sept on business. I chose it cause I was craving sushi on work's dime.This place was very good. My coworkers were suspicious of sushi in a land-locked state, but they loved it. It was good quality and well-presented. The side salad was huge. One coworker split the dinner for 2 with me and it was such a ridiculous amount that even the waitress asked if only 2 of us were splitting it cause she felt it was meant for 3. It came with nigiri, sushi roll, and lots of sashimi. I was actually full after that. Normally, I am not completely full at sushi places (probably cause I dont order enough since im cheap with my own money). The presentation was nice. They had a flashing LED under the ice. We were fascinated by the LED cube lol."], ["Sarah Y.", "I was super impressed by the ambiance of this restaurant. The space is nice and cozy and during the happy hour 3-6 it wasn't too busy. The food was presented so beautifully even our gyoza was treated like a main dish. The bathrooms were well kept and I adored the sinks. They felt very zen. My sushi was great and overall this has become my favorite place to get sushi in Denver."], ["Courtney D.", "The restaurant is quite pretty and the sushi is legit. I really hope this place is successful, they deserve it."], ["Brittany S.", "Okinawa has some of the friendliest staff.Lots of variety in the sushi rolls. My favorite roll is the sandwich roll. It's not even a roll, it looks like a sandwich and is loaded with tuna, yellowtail, salmon and special sauce.They usually have a couple special fish of the day depending on what's in season. This sushi place isn't doing anything new or unique, but it's consistency of fresh sushi and friendly staff make it a 4 star place."], ["Susan S.", "This place surprised me in the best way possible! All I can say is that I ordered multiple rolls and every one was outstanding. I have high sushi expectations (grew up by the beach in San Diego) and was skeptical as the outside of the restaurant is fairly unassuming. Long story short, service was great, wine selection decent and food fresh and made perfectly! Can't wait to go back!"], ["Angela G.", "Great place to stop for lunch.  Went to the cat cafe (right next door) and then was hungry and this place looked nice. I thought the lunch boxes were a great deal.  Only $8.  Place is really nice and clean inside.  Our waitress was really nice.  Only thing was a group of people came in after us and their order was taken first.  Which was odd since it really wasn't that busy at lunch.  Otherwise this was really a great sushi restaurant."], ["LaTonia W.", "I'm in love with this place! Very fresh sushi along with very attentive staff to match. The miso is the best I've tasted and I've sampled my fair share of the stuff. Waitress kept our cups full and the presentation of everything including food, restaurant and bathroom was to my liking. Actually, I loved all the décor!We will certainly be back!"], ["Noah L.", "Great place. Really great sushi, fantastic presentation, nice ambiance. Prices were right as well. Out of 5 rolls and some sashimi there was only one I didn't care for as it was just a little bland compared to the flavor explosions of the other rolls.Parking was a bit crowded as the area seems to have several popular restaurants.I will definitely be back again."], ["Justin A.", "This past Friday night, a group of 16 of us made reservations and had dinner at Okinawa Japanese Cuisine to celebrate my friend's birthday. For all of us, it was our first time here. And our visit had its pros and cons. The sushi was delicious and very affordable, and the menu offered a vast variety of options to choose from. Also, although the restaurant is small, they accommodated our large group very well on a busy weekend evening - which pleasantly surprised me. However, accommodating a large group posed its issues for the staff during this time. It took a long time to get our first drinks and each additional round after that was the same. And if you order a bottle beer, please ask to pour it into a glass yourself unless you want to see a great deal of foam from the staff's pour. I wouldn't be opposed to dining at Okinawa again but won't be bringing a large group if I do. I'd recommend going here for an inexpensive date night or with just another friend or two."], ["Madeline M.", "They have gluten free!!! Which is a score for me. Service was great here, very quick. Nice atmosphere. They are quite knowledgable about what is and isn't gluten free on their menu, and they have gluten free soy sauce. I ordered the Boston roll, which was shrimp and cucumber. And I ordered the AAC roll which is vegan and made of avocado, asparagus and cucumber. It was so yummy!!If you go during happy hour then they are all around $5 per roll!"], ["Jeremy K.", "My lady and I were wanting to try something new so we gave this a try. The interior and exterior are both nice and we were greeted promptly when we walked in. Once we gave a first glance at the menu we noticed the prices were great for sushi. I noticed on their drink menu they had a few craft beers, which you don't always find in a sushi place. We complied 5 or so different sushi/rolls and placed our order. Our order came pretty fast and all of the sushi was at least a 3.5 out of 5 with some being better than that even! We got some traditional spicy tuna rolls and philly roll and then a few specialty sushi/rolls (forgot names and which ones) but they were all good. I would go back here for sure. Good sushi at a good price!"], ["Ali L.", "I typically don't like eating sushi during the cold winter months, but I was craving sushi when the boyfriend took me here for my birthday dinner. The service was excellent all evening, but when our server mentioned that drinks were buy-one-get-one, my heart swelled like the ending scenes in How the Grinch Stole Christmas. We started with the seaweed salad, which was excellent as expected, and the tuna sashimi which had a very mild flavor. For dinner we ordered the Lobster Tempura Roll, Playboy Roll, and Titanic Roll. All three were excellent, but it was the Titanic that really blew me away. Some of the ingredients (papaya, avocado, crab meat) plus the soy bean paper left the consistency a little mushy, but if you don't mind that (I don't) absolutely order it!  Yum!"], ["Prima B.", "Great sushi place in Denver. Service was friendly and fast. I will definitely stop by here whenever I'm in the Denver area."], ["Lauren M.", "Ya'll. This sushi is to die for. My two friends and I got a variety of rolls--rainbow roll, spider roll, magic roll, and a couple others--and every single piece was delicious. The martini's were good and the service was great. So glad we found this place!!"], ["Eric Y.", "Always a solid offering. We are longtime fans of the Colfax location and we're happy to try the Tennyson location and are pleased to report its every bit as good as its sister store.Friendly staff, nice specials and quality fish and reasonable prices.Okinawa remains a favorite."], ["Matthew M.", "I've been to a lot of sushi places around Denver, and this one is my favorite!!! A must go and go again and again.The sushi was not only amazing the presentation was fantastic too. I also enjoyed the variety of selection (I'm a fan of sushi and eel that have spice and/or texture in each bite).Finally, the atmosphere was just charming and the staff was awesome. A perfect place to take a date or to just get awesome sushi."], ["Trip G.", "This place surprised us. We were looking for a sushi place for our last night in Denver. But it wasn't as flashy as some of the other sushi places we looked at. But let me tell you it's delicious! I would recommend this to anyone in Denver looking for a cute little street with a great sushi place on it!"], ["Trinity N.", "Today was my first time here and the sushi was great! Nice setting and staff was friendly. Just a little disappointed that there were 2 dishes that weren't available for us to try (kobe beef tataki and sea urchin with quail egg). :(But all in all, food was good!  Guess we'll have to go again some other time. --SamAnTha"], ["Dave B.", "The lunch boxes are a wonderful, tasty, beautifully presented bargain. I had the crispy fried pork with tempura. You get: miso soup, salad, pork, rice, tempura veggies all for $8.Beer was 2 for 1. So, $2 a beer for Odells.The service was excellent.The location cannot be beat. Just 2 blocks from my house. YMMV.Free Wi-Fi."], ["John B.", "We had a fun and enjoyable b- day dinner.  The special oyster app was beautiful. The rolls were creative and the service was very attentive."], ["Lottie S.", "Loved the food. I will for sure be going back and enjoying this place. It's a great location and some where everyone can enjoy sushi weather it's the first or 1 millionth time.  eat on and enjoy!"], ["Rebecca G.", "Excellent stop for a quality sushi lunch. Tasty lunch specials and excellent service."], ["Riza H. C.", "Sunday December 1st 2013.  My birthday.I have been craving SUSHI, and since it will be just a mini-birthday celebration to this establishment by the named of Okinawa Japanese Cuisine, located along Tennyson St, we went.Yes, parking along this street can be tricky to some.  I did not know that this Okinawa was also on the same street to one of the establishment I have been many moons ago.Arrived at Okinawa about 13:10hrs ish.We were seated promptly, given the Menu by the ONLY server that afternoon.  When we arrived at this establishment, there were like 2 other patrons dining in.  We seated ourselves on the left wing of the establishment and nearest to the \"red partition wall\".From the Happy Hour Menu, appetizer prices are from $4-$9.  Vegetable Rolls are between $3-$4.  Regular or Hand Roll are $4-$5.  Vegetarian Sushi are $1 each, Special Rolls are between $9 & $11 while the Sushi/Nigiri that comes with 1 piece only are from $1.50 & $2.  It would be nice to have description and ingredients of each rolls on the Happy Hour Paper Menu, but they do not reflect that.  This can be daunting for a Sushi Newbie.  Maybe you can ask your server for the details.We were given water as part of our beverages.  The server is nice but she tends to be a little too chatty for our liking.  Hence, I am torn about this establishment.  I have been to the \"Brother-Sister\" aka Sibling establishment the one located along Colfax many moons ago, and I like them..  But for this establishment, I need to gather my thoughts of some sort.That afternoon, we ordered these following items :*  Calamari ($5.00)*  Hotategai - Scallop ($2.00)*  Spicy Lobster ($2.00)*  Flying Fish Roe - Tobiko ($1.75)*  Asparagus ($1.00)*  Tamago ($1.00)*  Ebi ($1.50)*  Surf Clam ($1.50)*  Squid - (Ika) ($1.50)*  Fesh Water Eel - (Unagi) ($1.75)*  Octopus - (Tako) ($1.50)*  Spicy Scallop ($2.00)*  Rice ($2.00)Take note, the Nigiri aka Sushi order during Happy Hour comes 1 piece per order.Thankfully they have HAPPY HOUR EVERY DAY.  Weekdays 11am till 6pm while during Weekends it is 12 noon till 6pm.  SCORE!!!  Highlights of the Lunch :The Calamari, comes out piping hot, fried properly and I like it.  What NOT to Like Calamari which is fried with Tempura batter, and it comes out Crispy and comes with the Spicy Mayonnaise Sauce aka Sriracha sauce with KewPie aka Japanese Mayonnaise as the dipping sauce.The Tamago Nigiri actually is the biggest Tamago I have seen, and it looks like an \"upside down boat\", \"steamed egg\" - meaning the rice was tucked in this Huge Tamago.The rest of the Nigiri was A-Ok.  Its a good deal if you can attend Happy Hour during the weekends.  I am NOT into the rolls so, I cannot comment on those.  Even our server recommend us Sushi or Sashimi options, but I am NOT in those either.  So if you are in ROLLS or Sashimi, Happy Hour might be your best bet to dine in this establishment.  The Tiny Disappointment :Since there is only 1 server, and she tends to get chatty with other patrons, from where I was seating, I can see when the Sushi Chef had finished preparing my plate of food, or sushi.. it was left at the counter for abit.  For this, I don't fancy that much.  If I could I would have gone to the Sushi Counter and grab my plate so I can have my food ASAP.  Just don't mess with a hungry patron like me.  *BIG SIGH*This establishment Have Potential.  Will return with a BIG Group and see how things may differ.  Left the establishment at 14:10hrs.@261/2013"], ["Cat L.", "Yum,.   I ordered the asparagus roll and  California roll and he ordered Spider roll and negihama roll.  Everything was great and the service good too.  We'll be back."], ["Luke H.", "This place keeps climbing the list of Denver's best sushi restaurants. Their spicy crunchy tuna is perfect, and the rolls are very large for the price. My personal favorites are the Ichiban and Sandwich rolls. Good happy hour too. Service could be a little more attentive. And I'm not loving the jalapeño Hamachi with an italian dressing on it; they would do better just to copy Izakya Den. But overall it is an excellent above average sushi experience."], ["Danielle D.", "Went here for Valentines lunch. It just happened to be happy hour! Yay for dollar off sushi and buy one get one free drinks! We ordered 3 different sushis and calamari. The sushi was very fresh and made well so that it stays together when you pick it up (sadly this is not always the case other places).The only thing that wasn't all that good was the calamari. It was too greasy and didn't have a nice crunch to it for having been fried. Overall, the service was wonderful. Very friendly and they even gave me a rose when the check came out; The perfect ending to our valentines lunch!"], ["Ginger H.", "Best sushi we have had in Denver.  Service was attentive and friendly.  The fish was fresh and delicious.  The presentation was pretty and appetizing.  We felt lucky were able to walk in and get a table on a Saturday night, even though the dining room was full.  Nice ambience in the restaurant, tasteful and not over the top.  Best of all, prices were really reasonable for good sushi!  We will be back soon!"], ["Lendy L.", "Happy hour from 2:30pm-6pm.  Okinawa is a nice modern clean restaurant with super nice and friendly staff.  The Tennyson location is comparable to the Colfax location and as always the food is fresh and delicious. I've had good sushi rolls at Okinawa before but my party was not too impressed with the Godzilla roll or Okinawa roll. We could have done without the rolls and instead should have ordered more delicious sashimi.  From the happy hour menu the lobster role is amazing in addition to the salmon and white tuna sashimi.  Each sashimi piece was consistently cut and served perfectly, portioned just right and super delicious.  It's always good to know a neighborhood favorite is now so close by. I'll be frequenting Okinawa more often from now on. Parking can be a pain but oh so worth it."], ["Ran T.", "This is a new establishment in the highland neighborhood. The decor is modern, staff is helpful and courteous, food is delicious (although I wish the portion is a little bigger). We took the waitress' recommendation and order the aji mackerel sashimi. The presentation is gorgeous, the fish is finely and skillfully cut. We especially liked the dipping sauce which is made of soy sauce, ginger, wasabi and something else. We also ordered some special rolls, i.e. spider rolls, They were delicious also. Here are some tips for you if you want to try this place:1. Go to their happy hours where you can buy one drink get one free. Many rolls, appetizers are 1-2 dollars off. The B1G1F applies to bottled sake as well and they allow you to take the bottle home.2. If you like sake, get the unfiltered one. Trust me, it tastes wayyyy better."], ["Niall O.", "Much better than some of the supposedly \"better\" sushi restaurants in Denver.  Good quality fish and great presentation, and a nice spot on Tennyson for drinks before or after.  I'm not really a sushi snob so I'm sure other reviews talk about the quality of individual pieces, but I don't think you can go wrong swinging by Okinawa for dinner.  We had a party of 9 and the staff were most accommodating and did an excellent job dealing with the obvious issues of a group that size."], ["Kyle M.", "The sushi is some of the best in town but I gave it three stars because of the crowd it draws.This place was full of douches.  Loud flannel shirt and  ball cap type dudes and their wives who's brainless conversations are about their yoga instructors who don't get them.  Drawing this type of customers makes it impossible for me to ever come back. Do yourself a favor and walk half a block down to Sushi Bay, a much better sushi experience."], ["Sally N.", "I just stopped for a quick lunch. The rolls here have decent amount of fish inside and out. The sashimi cuts were nice and thick. I also liked the ginger cuts as well. And they take time for a good presentation. All in all, no disappointments."], ["Julia P.", "Wow - what great quality and quantity of fish! My husband is 1/2 Japanese and is quite a sushi lover. Our \"home\" sushi restaurant in SoCal is like this: relatively small, chefs and staff appear to all be Japanese, excellent fresh fish combined in a classic and tasty way with subtle sauces. So we stop by here on our way to DIA headed home after skiing and manage to catch a fantastic happy hour (nigiri under $2/ BoGo booze / select specialty rolls $10-11). Especially notable was the HUGE maki salmon skin roll (7  hearty pieces!!)  as was the excellent fatty salmon generously applied to their Golden Roll. If this is your hood were now officially jealous ;) Happy hour is 7 days/week 2:30 to 6. Snaps snaps snaps to Okinawa Sushi!"], ["Eric C.", "Try the black dragon roll! Everything here is pretty good. Surprisingly fresh for denver (since I'm from seattle) where are they getting their seafood??Happy hour is pretty cheap"], ["Laurie L.", "Really good sushi, beautifully served and reasonably priced!  $9 lunch special is two rolls from a menu sub-selection (many \"exotics\" included) plus salad or miso soup.  Stylish interior, prompt cheerful service.  A winner!"], ["Makhpiya B.", "My wife called the street the restaurant is on, \"cute, hip, and fun\". It was also open late night which was a plus. Iced tea was flavorful. Sushi was amazing, we had the dynamite, lobster and Alaskan rolls and all were delicious. The ginger was also very delicious without being too spicy."], ["Alexandra S.", "I am SO excited I found this place! The sushi is superb. I think I've found my new favorite go to sushi spot in the highlands. The fish is fresh and the service is spot on. They have a wonderful happy hour menu- AND it's everyday of the week! The spicy girl and sashimi rolls were some of my favorites. Can't wait to come back!"], ["Ti B.", "This is one of the best sushi restaurants in Denver in my opinion. The happy hour here is so awesome - we ate and drank our hearts content!"], ["Kate N.", "My boyfriend took me to Okinawa for Valentine's Day and I loved it! Their fish was fresh and their menu had great options. I was also pleasantly surprised by the drink menu.The service was very friendly but a bit slow (the restaurant was not terribly busy while we were there... maybe 5 other tables). I would not recommend going there if you are in a rush."], ["Cyndi J.", "We'd planned to go to the pizza and beer place across the street, but didn't think an hour and a half wait would do much for our attitudes (after a long day of air travel and missing luggage).  We stepped into Okinawa, and I instantly felt my stress departing my uptight body.  The service here no doubt turned a craptacular day into a great one.  My husband had sushi, but I was cold and needed to warm up.  The miso soup did the trick.  I also had gyoza, which was handmade, perfectly crisped on the bottom, steamed on the top.  I had the teriyaki steak.  The meat was tender and cooked to a medium.  My husband loved his sushi.  It was beautifully presented.  We lingered over our two-for-one drinks, mainly because I wasn't ready to leave the considerate graces of our hosts and hostesses.  We will come back to this new neighborhood gem."], ["Jessica F.", "The food was fine the service was horrible.  There weren't that many people in the restaurant as we were there around 3:00 pm.  It took forever to get our drinks and for them to take our order.  With Sushi Bay up the street we will just go there instead as the service is much better."], ["D-in-Denver '.", "Our sushi order was well presented by Nina who was knowledgeable and friendly.  Totally recommend: the Spicy Lobster!!  Definitely a unique roll that is worth a try for foodies and sushi goers.  Prompt service from the time entering the door to check out. Always has offered great specials during dining."], ["Charlotte P.", "I've tried sushi several different times. I've tried many times to like it. Almost every effort to enjoy this culinary anomaly that so many other people drool over has failed miserably. I've eaten super-expensive sushi and sushi made by \"the best\". Here's the thing about sushi: I hate the taste of the seaweed wrap. I hate the taste of nearly every fish used to make most traditional sushi rolls. Compound that upon the fact that I'm now a vegetarian and now my options when it comes to sushi are very limited.But my husband got a referral from his barber who works at Proper Barbershop right next door to Okinawa Japanese Cuisine in The HIghlands district and asked me to take a chance on it. And I'm certainly glad that I did. For my full experience with Okinawa Japanese Cuisine as a former sushi hater, check out this full review: examiner.com/review/atte…Suffice it say that if you too previously suffered from the same distaste for sushi, you'll find your taste become dramatically changed thanks to Okinawa Japanese Cuisine.We will definitely be back!"], ["Natalya P.", "The reviews for this sushi place are very misleading. This is probably the worst sushi restaurant I have ever been to. The miso soup is very salty not authentic.... It's from a package without a doubt. The seared Kobe beef was a 1 out of 10. The spicy girl roll was very bland and didn't taste good at all. The super white tuna sashimi was not fresh, the middle was still frozen. The scallops were also not fresh. I wouldn't eat here again, or recommend it to anyone. They gave a gift certificate for the next visit in which we promptly left back with the check."], ["Lauren B.", "Had a lovely date here. Warm, satisfying house sake and decent rolls and sushi. The restaurant gets pretty noisy, but it has a din neighborhood atmosphere. A good relaxed sushi spot. p.s. try the Kobe roll!"], ["Mia L.", "Great food and service ! We had tempura shrimp , spider roll and the rainbow roll.  All was very tasty. Nice atmosphere inside as well."], ["Dallas G.", "I went into this place last night on a date only knowing what I had seen online. We were greeted at the door sat at a nice spot by the window. The vibe in this place is just... Classy is the only word that comes to mind. Very nice sushi bar one of the better ones I've seen. The sushi was phenomenal as well. I forgot my ID so I couldn't get lit off their saki but trust me, I'll be back because this place is amazing. Sushi was off the hook! On par with some of the best places I've ever tried, we both loved it. Sadly, I didn't take pictures, I was on a date you know."], ["Kate M.", "Pretty darn good sushi.  We had a variety of rolls and all were well prepared and fresh.  Plenty of fun, interesting options to choose from as well as great takes on the simple classics.  We can't wait to go back and try other menu items.  This place has charming decor and friendly staff.  We were pretty impressed."], ["Joel K.", "Very excellent sushi... despite being in colorado. The place is right on Tennyson, but don't worry. The cool kids don't vibe you too hard here."], ["Spartacus K.", "Loved the sandwich roll with added cream cheese..  WowVery nice for a little place.  Nice atmosphere and good sushi.  Saki was great too"], ["Nick S.", "Pretty good stuff and great happy hour prices! I'll be back for sure!"], ["Tameca C.", "Tonight was my first. I was really wowed by the presentation of the food, the kindness of the staff, the ambiance and the taste of the food, as well! I will be back! Thank you!"], ["Steve K.", "Wow,wow,wow~ Exceptionally fresh and delicious! Can't wait to go back!"], ["Jason T.", "Holy happy hour.  First time in history that I've not taken my second free giant beer.  Its like 4 regular beers for $8.  Great Sake on special too.  I eat raw only for the most part and they've never let me down.  Everything tastes super fresh with great presentation and reasonable pricing before/after happy hour.  The place can be slightly loud when it gets packed but not too bad unless you have a ADHD kid siting/jumping next to you."], ["Will W.", "The chef, Jackie, just moved to Denver recently from NYC where he was a chef at a restaurant that has a 3-week waiting list and is $400 per person just to walk in the door.  And you can definitely tell he and his team are culinary WIZARDS!!5 Great Things About Okinawa Sushi:1) The food is amazing2) The service is great and SUPER friendly3) They are OPEN LATE!4) They have awesome drinks (purple haze saki, fuji apple DESERT saki)5) They have an awesome lunch special for $8! Highly recommended.  This is one of the best sushi restaurants in all of Denver and without a doubt it is the best in the Highlands."], ["Nathan H.", "Against my better judgment (since I want this place all to myself), I'm going to review the best sushi I've had in years. I've eaten more expensive sushi in NYC and SF, but those experiences don't stand up to Okinawa in terms of value. The rolls are creative, beautifully presented and -- balanced. Many sushi places go way over the top with special rolls that are dominated by single flavors. These had themes, but were not cliche and certainly not one dimensional.Can't wait to come back. Great food, attentive, friendly service, reasonable prices. A gem."]], "Go Fish": [["Max G.", "Go Fish is one of my go to places for sushi when I'm in the Broadway area. Their menu isn't too large but the sushi they have is fantastic. I always get an appetizer they have called a symphony. It's one of my favorites. I recently went for my moms birthday and the service was incredible. It's true that the menu is a bit pricey but the sushi is quality. You can always swing by for happy hour and enjoy the food at a lower cost. Obviously, a lot of people don't mind the price considering I've had to wait to be seated. Something else to mention is the bar next door.  They have expanded their area to include a large side room which is stocked."], ["James H.", "Let's be honest: you know the food is good. Damn good. There are a million reviews already talking about the quality of the sushi. As a west coast kid, this spot does not disappoint. If you thought sushi couldn't get any fresher than the coasts, you need to chill on Broadway and Ellsworth more. Here is what I want to really talk about: THE MUSIC. For a sushi spot in the middle of the afternoon, the selection puts most of Denver's \"urban\" clubs (and most clubs here in general) to shame. I probably (definitely) looked like an idiot singing and bobbing my head with a Vegas roll in my mouth, but who cares. Five stars would embarrass myself again."], ["Cris F.", "This place is good. But it can get kinda pricey so the only time we go is during happy hour. It is centrally located on Broadway which is nice. I also like that they have a variety of vegetarian sushi. They have this one roll that is called the Zombie roll which is AWESOME!!!The service here is always nice and they have a patio but during the later hours of the day like 3ish the sun is in the west so the patio gets no light from the sun there fore no heat. Just FYI.. But the patio does get an awesome view for all of the awesome people watching from it that can be had here. As long as none of them palms my sushi were good. So definitely give it a go especially if it is happy hour."], ["Alex P.", "Unexpected Beauty.Way-to-freakin-go! I would love to meet the chef or the decedent of Michelangelo who designed these jaw dropping creations behind the scenes.  This guy deserves a raise, or at least a pat on the back but for his sake I think he would want the raise, because my hands tend to get sweaty.  The speed at which these amazing sushi platters come out are nothing short of amazing.  Michelangelo's decedent must have a sweat shop of children helping him assemble these plates.  If I told you to go build a dragon, 3 hours from now you would still be scratching your head.  Many times we are too quick to judge greatness just by a single experience at a restaurant.  These guys have it down.  Again, way-to-freakin-go."], ["Bombina V.", "I don't get what the hype is all about. I came here after a few people highly recommended this place and with the help of Yelp. The service was average, but the food wasn't that great. I guess I was expecting to get blown away which didn't happen. Nothing out of the ordinary. There are much better sushi joints around with fresh fish and unique rolls."], ["Demitri R.", "Why Did I not venture in earlier? I went in during Happy Hour. Started off with the Cucumber Salad. Wasnt what i was expecting but was delicious. For Rolls I ordered the Vegas Roll and a Rainbow Roll and and a Mango Roll. The Presentation alone means they could charge way more than they do. The prices are beyond reasonable. And the staff is friendly. From the Sushi chefs behind the bar to the servers. Salad and 3 rolls i definitely left satisfied."], ["Christopher R.", "Went here for Happy Hour.  Prices were slightly reduced about $1.50 - $3.50 off a large selection from the regular menu.  The service was excellent.  Brian was very attentive, friendly, and completely familiar with the extensive menu.  The grilled squid salad was amazing - nice portion of whole large grilled squid over mixed greens with a light, I believe, citrus soy dressing.   I was inspired to immediately order two more items: The tempura shrimp and Snow Mountain Roll (tempura shrimp and cucumber roll topped with a minced lobster/crayfish salad.  Both were delicious and beautifully presented.  The tempura shrimp had a fine, crispy panko breading, maybe slightly oily, but delicious, while lobster crayfish topping on the mountain roll was equally tasty.*** You have to ask for the fresh wasabi \"sasa\"(?) - unlike anything I have had before, made from fresh diced wasabi stems, fragrant and spicy.  I had to ask for some to take home just so others could try.  I look forward to returning here soon."], ["Jay Z.", "Great susi and even offer brown rice. Good selection, fresh and great presentation. They also deliver pretty fast for a sushi place!"], ["Alice G.", "Pretty decent sushi, pretty decent service, great Happy Hour, great location makes GO FISH a GO TO in this happenin' little block on South Broadway.First and foremost, check in on YELP to get a free pineapple infused saki, which was AMAZING!  Our whole table liked theirs. This was a great choice for a group and the staff was so helpful as our group grew larger than expected. Service was fast, food was delicious and creative.  Our faves were the gyoza, the sweet potato rolls, and the bacon/avocado roll. Good Choice for Mayan Movie night!!!"], ["Jennifer T.", "We had a great time here. Service was prompt and courteous (and fun) and the portions were generous... I've been twice and I always leave feeling entirely too full. The sashimi was nice and fresh, and while I hate rolls, these were tasty. You know, if you like rolls. :) The lunch menu also has tasty non-fish options for fussy eaters, which my team really enjoyed!"], ["Steph G.", "Underwhelmed. The experience started off well, with a quick greeting and being seated right away. We took some time to put in an order and make decisions on what rolls we wanted, but after that it all went downhill. We ordered 3 small rolls, and 2 of the specialty ones. I noticed that a larger group had been seated after us and they were served their food before we got ours! Grr. That upsets me. We ended up waiting an HOUR for our food. Meanwhile, the weird waiter kept coming by and asking us if we're still doing ok with just our water, but neglected to mention when the heck our food was coming out. Had to stop him and ask him directly as he kept swooping by us back and forth. And finally, the food came. The sushi itself, as I said, was underwhelming. Definitely not the best. The rolls were good size, but the rice was actually a bit hard. They weren't really well made, because the sushi kept falling apart as I was trying to eat. On top of that, the menu was full of rolls with either jalapeño or spicy sauce, very few without these options. Now, don't get me wrong, I love my spice but neither of those were wanted in my whole sushi order. They need to be a little more creative. The long wait for food, the menu's selection, and the overall badly made sushi are not enough to bring me back here."], ["Justin W.", "This is a pretty solid 4 star sushi place. I come here for lunch ever so often and sometimes I'm the only one here - which is odd because you can get a steal of a deal on a bento box for just $8. The staff is always super friendly and the guys working the sushi bar will even say goodbye when you get up to leave. They also have a decent happy hour with cheaper rolls and some discounted drinks. Thank you for filling my belly to it's brim GF!"], ["Claire B.", "Go Fish has one of my favorite happy hours as far food is concerned. During regular hours the menu is kinda pricey, but during daytime happy hour the prices become much more affordable. I have only been here for lunch in the early afternoon when there is no crowd, but I'll come back at night sometime.My favorite rolls are the Las Vegas roll, Lobster roll, Snow Mountain roll, and Chili roll."], ["Inayah V.", "This restaurant is literally in the center of Denver on Broadway, that said parking is quite difficult. They have a few spaces in a lot shared with other businesses in the building, and metered parking in front. If you can't find anything there, it's going to be a walk. Once inside, the space is bright, and there is plenty of seating. There are classic rolls as well as some very inventive custom ones, like the One Night Stand (which is excellent) and Sex on the Beach. Personally, I hate eel sauce so many sushi places drizzle all over their rolls, and specifically asked that it be left off. Our server made a note of this, so I was surprised the chef put it on anyway as my order was placed on the counter. Our waiter caught it, and had them make another Dragon Roll, saying don't worry, that one is mine."], ["Christina M.", "Everyone that works here is so nice! The restaurant was empty when my friend and I came in for lunch, but started filing up more as we were there. It was also happy hour! Chilli roll-SO GOOD and awesome presentation. ikura-fresh and delicious"], ["Shannon M.", "I ordered on here through eat 24 so took forever to get my food. The sushi is great the prices are reasonable compared to other sushi places.The calimari is also very good but the time I got it it was cold. That is the main reason I didn't give 5 stars would of been better if the calimari had been warm No other complaints"], ["Nicole M.", "Always great rolls and great service. This is one of my favorite places to order sushi. I usually get the spicy tuna and the shrimp tempura. I also recommend getting the edamame as a starter. They have a few dedicated parking spots in the back of the restaurant too."], ["Diane Kholos W.", "What can I say, but amazing. Went to go fish with my sushi meetup group. It's a great way to try new places. Even with a big group, the service was great.  Then we get the food.  Omg. The presentation was beautiful.  Food was fresh.  It was displayed better than I have ever seen.  I will be going back."], ["Helene K.", "Since moving to Denver, I have been to Go Fish on several occasions and have enjoyed each visit. In 2012, I went to the AAJA Christmas party at Go Fish and we had most of the back room lounge area to ourselves. Swanky feeling in the lounge with plenty of seats and standing room as well.More recently, I went to Go Fish for Saturday lunch with Ryan K. It was one of the nicer weekends of this season, so a few tables were sitting outside enjoying the weather. We sat inside near the lounge and ordered a few sushi rolls.The nigiri was fresh-tasting and well-cut; the Philly and unagi rolls were also tasty. We each had a bowl of miso soup before we started with our rolls and the soup was very filling.Service was quick albeit the server seemed distracted by other customers coming in and out of the outside patio. The one thing that bothered me though: the bus pans near the bathroom. Dirty plates were stacked up in these bus pans and, well, I was concerned about sanitary issues. Not sure if this is a regular thing for them, but it bothered me having to stare at the pile of dirty dishes in plain sight. Let's hope that Go Fish doesn't usually leave their dirty dishes out like that, because it'd be sad to see them get a health code violation for this."], ["Alex S.", "I came in for lunch, and ordered the beef teriyaki lunch box. The beef was definitely, 100% frozen (not fresh - it was heated thoroughly). It was gross and tasted weird and was dry and tough.Usually, I eat just about anything, but this was one of those rare times that I didn't eat all the food on my plate. In fact, I ate less than half of it.I got some sushi too and it didn't seem good or fresh at all."], ["Kimberly B.", "A Ok for me,We came here for some happy hour before hitting the Under Ground Music Festival.First impression, Staff was very friendly and welcoming and Happy hour prices were very good.We ordered two orders of Gyoza, 3 Rolls, Tuna, yellow tail and Cucumber avocado rolls.We pretty much inhaled our Gyoza, they were so good and the sauce was perfect!The rolls, to be honest they were just ok for me nothing special, but the Cucumber avocado rolls were pretty tasty.We were still hungry after the rolls ( Rolls are small) so we ordered another Gyoza, these things are so good I would have been happy with just ordering a couple dishes of them.I would come here again for Happy Hour, you really can't pass up their prices!"], ["Becca R.", "Good, fairly quick delivery. I was nursing an all day hangover recently and wanted something simple and relatively healthy without having to move from my couch. I was perusing GrubHub and decided to check this place out. I ordered miso soup, a house salad, and teriyaki vegetables. I know what you're thinking-- why wouldn't I order sushi from a restaurant called Go Fish? Excellent question. I probably should have, but my body wasn't ready to branch too far beyond saltines and Gatorade. The miso soup was very good, the house salad was waaaay too soggy but the dressing had a nice flavor to it regardless. The teriyaki vegetables were okay, slightly overcooked and not particularly memorable. I noticed a lot of interesting, creative vegetable sushi on the menu which is a rarity at most places, so I will definitely return here when I am feeling more adventurous and less hungover!"], ["Tiffany H.", "Went here this past Friday night. I love their late night hours. The sushi was delicious! I got a dynamite roll. Some of the other rolls ordered: philly roll, spicy tuna, shrimp tempura, rainbow roll and yellowtail mango jalapeño. Everyone loves the rolls. They even have a late night happy hour! The teriyaki chicken was ok, not my favorite. But I haven't found good teriyaki chicken in Denver yet. Highly recommend this place. Service was also great."], ["JT D.", "I've been coming here for a long time and let me just say I LOVE Go Fish! Everything down to the service, food and ambiance is great. Their selection is vast including tons of rolls as well as sashimi and nigiri options. My favorites are white tuna and salmon and theirs is on point! Will be coming here for years to come because of the amazing food and even better service. Always an amazing experience when I eat here."], ["Dave M.", "This is our fourth time here. This place is always on point. Waitress was more informative and helpful this time around. The special rolls are one of a kind. Solid happy hour. Try the crab salad"], ["H T.", "Some restaurants treat you as if you are lucky to be dining at their establishment, instead of the other way around. Go Fish is not one of those places. We came in for a quick lunch, and somehow through a slight miscommunication (my fault), ended up with only one order of yakisoba instead of two. The waiter was extremely apologetic, and we got our second plate quickly afterward. No harm, no foul. After our delicious meal, he then surprised us with a free fried cheesecake to make amends for the error. Totally unnecessary, but also fantastic. Overall, a great experience both food- and service-wise during our brief stay in Denver."], ["Jenny C.", "The Hot Orgasm was so delish! I mean, shouldn't it be? The Cucumber Salad and crab Salad was amazing! Our server knew we love anything spicy so they brought us spicy edamame which was drenched in chili oil and sautéed in ginger so that is definitely something to ask for! Loved this place! We will definitely come back next time we're in Denver."], ["Alyssa B.", "Sooooo good! We randomly found this sushi bar and were presently surprised. They are reasonably priced and it was the best sushi I've had in a long time!"], ["allan a.", "Always awsome service, fresh sushi and free saki or desert after you pay!  Happy hour sushi prices are great too"], ["K C.", "With 333 reviews of 4 star ave. rating, I really had high hopes for this sushi joint. But after last night, I can not be more disappointed. Paper thin toro nigiris and ameebi with missing tail was just to show that go fish is more about their eatable flowers and a little garnish for every piece of sushi, which took the chef 40 min to \"decorate\" 20 piece nigiri and two Maki.Service was .... hmm.... inexperienced.He had only our table to serve out of 4 tables that were there last night, but he could not keep his focus on serving and keep walking around doing nothing.He was keep saying \"my pleasure\" like it was only two words he knew without any sincerity.At the end of meal, fried cheese cake with the worst whipped cream and cheap chocolate syrup was provide to us free of charge but free any explanation on why.Please, please, there are better sushi places than this one, don't encourage this one by patronizing this one."], ["Piggy P.", "If there's a zero rating, they would get a zero for food and service. We are a group of 8 having our last meal at Denver before returning home and saw that they got 4 stars rating with over 300 reviews, must be decent but that was not the case. We chose to sit outside because we didn't want to wait for 30 min for a table, but by the time they set up the tables it was 20 min already which consisted only of prepacked silverwares and piled high plates with wobbly tables.Impossible to flag waiter down and apparently spilting the bill by two is too tough of a math equation to do.Food: we ordered a sashimi sushi boat for 4 while the rest of our group ordered rolls. First of all, everyone's plate came out at different time so we all had to eat separately which is socially awkward. Our boat came out 40 min later...all with varieties of 2 to 3 pieces each and some even one. If you have a boat that serves 4,  how do you expect us to spilt 3 pieces of salmon o 2 pieces of tuna nigiri etc? We ended up cutting them in half and I don't think that's the right way to eat sushi. We rather you give us less varieties of 4 slices each than more. What's more annoying is they don't let you substitute rolls of equal values if you have an intolerance to an ingredient in the roll. Quality wise...rice were too soft that we can't pick it up with our chopsticks. Rolls were made choppy, didn't see any of the fancy presentation like those pix on yelp and they still took 40 min. Fish was below average. One our friend didn't receive a roll and they double checked the sushi order list and were indeed wrong. We asked them to take it off the bill since we don't want to wait any longer. Well, I guess the waiter had no idea how to remove an item from the bill. Instead of removing it, he simply put in a discount for the price of the roll on the bill \"after-tax\". So we ended up paying an extra $0.80 for tax bcs he didn't know how to properly use his system just like he couldn't do spilt bill math. Overall, they were very inflexible, inconsiderate, and untrained. Absolutely fail in the ethic of sushi and business. Gotta be better sushi joint in Denver. This is not one of them."], ["Will M.", "The sushi was great but honestly I've never had worse service in my life. David was our waiter and he mumbled the entire time, spilled soup on the table, and forgot multiple items. We were waiting 20 min for my friend's roll to arrive. He did not apologize or even acknowledge that it was a problem. David's general attitude was standoffish and rude. I almost felt bad for him. There are a lot of great sushi places in Denver; IF I eat here again, I will particularly ask that he does not serve us."], ["Annie G.", "I have to say: love the sushi, love the sake bombs and love the people! Go Fish offers a great variety of sushi and also Japanese cuisine in general. Try the yakisoba noodles, it's delicious!I've been to Go Fish many times but most recently, I visited Go Fish on a Friday evening for happy hour around 5:30pm (HH ends at 6pm). Enjoyed some sushi rolls and sake bombs with a friend. We were having a great time and called four more friends to come. They joined us for MORE sushi and sake bombs. The staff was so friendly and attentive. By 8pm, the restaurant was packed! Every seat was taken both in the restaurant and the lounge. Too bad it was freezing outside otherwise I'm sure even more people would have been there. Despite how much was going on, the staff checked up on us regularly. They separated our bill correctly and there were no problems at all. We were given fried cheesecake on the house, which was awesome.After dinner, we had planned to leave to go to a bar down the street but it was now 10pm and that meant late night happy hour had begun. So we stayed! We moved ourselves into the lounge area and continued the festivities. Again, the staff and bartender were wonderful! This is a great place for dates, birthday parties and even for a single person to enjoy sushi at the bar!"], ["Joel C.", "Tasty as usual!! Catapillar roll, rainbow roll, tuna, miso soup, sake! See you next week!"], ["Doug B.", "First time eating at Go FIsh as I wanted to try out more sushi places in Denver. My mom and I went during their happy hour and really enjoyed our meal! Their pineapple infused sake is the bomb.com too! I do wish that they had more options available for their happy hour specials but I do understand. I wasn't the biggest fan of the tempura cheesecake but it was free so I was not complaining. I will definitely be coming back!"], ["Alexandra D.", "I want to give it more than 3 stars, because I have been here many times and just love their Symphony Sushi App, as well as their cucumber wrapped rolls. The food is quite delish. It is the staff that is just disappointing. I am always greeted right away, but their servers seem to lack multitasking skills....I was there last week. I was one of three tables in the whole restaurant. And I had to flag down our server (that was sitting 3 tables away, eating a bowl of soup). I had to flag him down to ask: to place my order, ask for a water refill, ask for the drink menu. I am not saying you should check-in on me every 5 minutes, but if you could check-in on my at least every 25 minutes, that would be nice....And I have worked in the food industry, and you DO NOT take your lunch break when you are serving tables. I just find their staff to lack the respect in the service they are to provide."], ["Shelly G.", "I love the spicy tuna roll. Never had a bad meal here. Good happy hour. Delivery is good, too!"], ["Brian M.", "Service at this restaurant was terrible.  Recently attended with a group of 10 (5 couples), and there was no guidance from the wait staff on portions.  Our group made multiple orders of rolls which we were led to believe were small (8-10 pieces), when instead they ended up being large 20+ pieces each.  At no point did our server advise on portions, or that we may have over-ordered.  She just kept bringing out platters of food, when we were clearly finished.  We actually had to say \"stop bringing us food, no more. We are done.\"In total, we ended up with over ~100 pieces of \"leftover\" sushi, which isn't even something anyone would eat the next day.  Our group overpaid by a mile, and we'll not be returning."], ["Quincy S.", "We had a great experience at GoFish! The service and sushi was great. The only thing we weren't crazy about was the miso soup; it was a little blan. Definitely going back!"], ["Mauve P.", "Oh Denver, I worry... Four stars? No bueno, Denver, no bueno. After 3 times, I'm giving up. Sushi here is just bad."]], "Hasu Asian Bistro & Sushi": [], "Okinawa": [], "Sushi Harbor": [["Alex L.", "Good service and awesome sushi!  I had a bento box + sushi roll and that definitely hit the spot.  I remember it started raining that day but people still kept trickling in.  I could make out a lot of the ingredients were Chinese like the salad dressing.  However, they do a great job of sushi and that's what matters.  I have been getting into the habit of ordering stuff I cannot make at home.  The salad and miso soup were part of the bento box.  Both of these appetizers are a good gauge of what's to come.  Sushi was fantastic in every way!  This place was tucked in a neighborhood.  If you're not looking for this place specifically, you will definitely miss it.  However, spend some time here and grab a quick bite.  You will surely enjoy yourself!"], ["Linda T.", "I came here yesterday with my roommates for dinner during happy hour. They have a pretty good happy hour menu with different rolls and appetizers. I ended up getting the mango salmon roll, California roll and crunchy spicy salmon roll. They definitely filled me up for 14 ish dollars. I was not too big of a fan of the mango salmon roll, there was too much mango for my liking. I also tried a piece of the Angel roll. That was pretty good. Overall, it was pretty good. The restaurant was clean. The restaurant seems to be placed in a strange location but it's close to Trader Joes! I wouldn't mind coming back one day for happy hour again :)"], ["Christian E.", "This place is within walking distance of my apt, so I was very happy when we tried it for the first time, and it was delicious. Definitely a good neighborhood sushi joint. The place was a little slow, but service was friendly and fast, crab salad came in a martini glass, and the sushi rolls we tried were really yummy. We will probably be returning."], ["Robin H.", "I ordered delivery through Grub Hub so I can't comment on the actual location.  I had the crab and avocado salad, a salmon roll. and an unagi avocado roll.  The order came with soy sauce, peanut sauce and a spicy mayo sauce.I really liked the salad - healthy portion of avocado (which I love) and an assortment of greens - no iceburg - Yay!  The peanut sauce that I poured over the salad really had a nice taste to it.  The salmon roll had nice size chunks of salmon and was fresh to boot. The only nit pick was the unagi/avocado roll was a little skimpy on the unagi.  The prices were reasonable, and I love the fact that I can order through Grub Hub and 45 minutes later there is a knock on my door!"], ["Mark C.", "Came here for lunch and had the Sushi and Sashimi lunch special. Great portions and fresh fish - it's a great deal. I was expecting the standard fish, but the chef threw on a sea bass sushi with fresh wasabi that was a real treat. I'll definitely return."], ["Diana W.", "The service needs finessing and so do most of the flavors of the rolls. Maybe it's the rice or the sauces the rolls are covered in? Either wAy, they have happy hour every night, all night and the servers are always friendly. I get my sushi here while my husband can drool over the big screen TVs playing sports.  They also have their own private parking lot!It's not the best sushi...yet but I know it'll just be a matter of time!"], ["Stephanie S.", "Food was okay overall. I liked the specialty rolls we got, but the crunchy hamachi roll was foul. When we asked the server to take it back, he argued with us that it was made today and couldn't be bad. He asked if we wanted to order something different. We did. When he came back, he told us the owner refused to take the hamachi off the bill. We were pissed, but the server produced on of those fliers they spam your mailbox with that gives you 20% off, so it worked out. When we got our bill, both the hamachi and the new roll were on there. This owner is completely short-sighted - he got our $8 for that roll, but I'll be damned if I set foot in there again. Customers beware!"], ["Paul M.", "My girlfriend just moved to Hilltop right behind the Trader Joe's and we saw the sign for Sushi Harbor every day while coming and going. Finally decided to try it out and I'm glad we did. We went on a Thursday night and the ambiance was great. Conversations could be held in normal volume and there was an awesome minimal tech house soundtrack playing the whole time we were there. There was also the happy hour 2 for 1 beers which was a great value. 2 tall Asahi's for 7 bucks?! We got a variety of rolls and they were all delicious. The only one that was too much was the Fire Cracker roll, it was ridiculous and stuffed with cream cheese and deep fried haha. The Sweetheart roll was the best of the bunch, with mango inside and a thin slice of lemon on top. Sweet and slightly citrus-y. Highly recommended. I would go here for a good mid range price tier of sushi and if you don't want to empty your wallet at say, Sushi Den."], ["Belinda F.", "Stopped by on a Monday around 6. There were 3 other tables. For some reason we couldn't get the attention of the waitress to place our order. So we flagged another waiter. Received our food very quickly.  Ran out of water and wanted to order more sushi, had to flag the poor guy again.  Again our sushi came quickly and was fresh.  The miso was good.  The seaweed salad said it came on top of mixed greens, mine did not.  Lots of seaweed, i couldn't finish it. Price is typical for downtown. We weren't able to try the all you can eat, they didn't offer it to us.  They keep it very cold, bring a sweater."], ["Samuel G.", "Down the street we are treated like family at Sushi Harbor. The sushi is high quality with a that doesn't break the bank. I highly recommend experimenting here. The staff will help you with all needs quickly and the platter will always taste amazing. Thanks again for the hospitality!"], ["Frances G.", "I really enjoyed my experience here at Sushi Harbor and I'll tell you why. In this tucked away sushi spot off Colorado the service is almost over accommodating and helpful with the extensive menu. With a very adventurous dining companion, I even ventured into the unfamiliar part of the menu and was pleasantly surprised with all the various options they offer besides your regular spicy tuna rolls. Our server's enthusiasm to help me explore the menu made my lunch so much more exciting and now I can confidently say I have had tuna cheek and will continue to order it at this delicious restaurant. But for the more standard sushi fare, like spicy tuna and yellowtail sashimi - this place is the jam, too! The mochi ice cream come in four flavors: Green Tea, Black Bean, Strawberry, and Mango, and are all beyond delicious with the perfect texture."], ["Graham K.", "The calamari is basically a fried thick rubber band. The sushi was okay until I got to the Spider Roll.. it tasted like the EXACT smell of wet, dirty, dog. I don't ever spit out food. Even if I'm not a fan of it. But it made me gag. A grown ass man spitting out food. Never again. Peace out girl scout."], ["Rina H.", "Best overall sushi place I have been to in a long while. They did everything right and has great music playing while doing it. They weren't skimpy on the sushi. Pieces were large and filled lightly with rice and heavily with fish. California rolls used the whole chunk of imitation crab meat as opposed to mixing it with mayo as a filler. The rice was cooked perfectly. Salad was nice and fresh and crisp with a great dressing and the dressing amount was perfect in relation to the amount of lettuce in the bowl. Service was friendly and the presentation was stunningly beautiful. Great place no complaints here!"], ["Riza H. C.", "Frances and I head down to Sushi Harbor since this establishment is the closest that we need to be on Friday April 4th 2014.  Time was about 13:50hrs ish.  We opt to be seated at one of the Booths.  Our server gave us 2 Nigiri/Sushi/Sashimi Paper Menus, and one TO-GO Menu which is in Paper Form that looks \"used\", which I found it a little puzzled with it.  Hmmm.... Each Sushi/Sashimi items begins from $3.95 to Market Price, depending on what you order.  The Basic Rolls are from $4.50 to $9.00.  While the Special Rolls are from $12.95 to $13.50.  Majority of the Special Rolls has Avocado in it.  *SIGH*  The Bento Lunch Box are from $8.50 to $8.95.These are the items we ordered :*  Yellowtail Kama ($10.00) - Sushi Bar Appetizers*  Yellowtail Nigiri ($5.00)*  Smoked Salmon ($5.00)*  White Tuna ($5.00)*  Osaka Roll ($13.50)While I opt for these items for my Lunch :*  Wasabi Tobiko ($5.00)*  Spicy Scallop ($5.50)*  Spicy Lobster ($7.00)*  Sweet Raw Shrimp - Amaebi ($8.00)*  Unagi Nigiri ($5.00)We were given Complimentary Salad, primarily it was Lettuce with somekind of dressing in which seems familiar, but I am NOT So sure about it.  Hmm, my bad, next time, definitely I'll ask the Server.  Initially I opt to have Uni (Sea Urchin), but our Server said that they Were OUT of Uni.  A bummer that they RAN OUT of Uni, that afternoon.  *Sad Face*The service is prompt.  But somehow, during service, at first, 2 items in our Nigiri/Sushi order got mixed up, aka it was DIFFERENT from what we initially ordered thru the Paper Menu, and our server rectified the problem by giving us the correct order aka Correct Nigiri/Sushi.I cannot recall what actually Frances had, coz all the Nigiri/Sushi all look the same except the Smoked Salmon at her plate.  As for mine, at first they gave me the Normal Tobiko, in which from my Paper Menu, I opt to have Wasabi Tobiko.Yes, the Yellowtail Kama, came out hot aka they either \"fried\" or flash-fried the Yellowtail Kama.  Its OK, though this fish can get a little fishy for some.My order of Unagi, was overly sweet due to the Sweet Dark Sauce, aka the glaze, that they brush the Unagi aka Unagi Sauce.  Hence THIS Indeed affected the taste of the Unagi Nigiri itself.As for the Sweet Raw Shrimp, this is yet another establishment, that embedded the FRIED SHRIMP HEADS with Sushi Rice and drizzled it with the Sweet Dark Sauce.  Why Oh Why??  Err, the next time around, I would ask them, if I can have my FRIED SHRIMP HEADS, just FRIED, WITHOUT The Sauce.Frances also ordered the Hot Green Tea ($1.75), while I just opt for water.  Our server periodically come to our table, and re-fill our beverages.  At the end of our Late Lunch, we each ordered the Mochi Ice Cream.  Each Mochi order was $4.50.  It comes with your options of 2 Different Flavors.  Frances had the Green Tea and Strawberry, while I opt to have the Mango and Strawberry Mochi Ice Cream.All in all Decent Sushi.  To Go Back, its a \"MAYBE\", if I am in the neighborhood and perhaps from there my review might differ.  The Server that afternoon his name is Tom.  From the conversation we had, he comes from Indonesia.  I wish and hope Sushi Harbor well in their business venture and future undertakings.  Left this establishment at about 15:30hrs ish.There is a parking lot, next to Sushi Harbor and plenty along the streets.  Sushi Harbor4136 E. 8th AveDenver, CO 80220Tel : (303)-333-6888@69/2014"], ["Krystal M.", "Second time I've tried delivery from here, both times I was not given part of my order, what I did receive was very warm sushi. The delivery driver will not deliver to my door and requires me to walk around to the back alley despite there being ample loading zone parking directly in front of my apartment."], ["Brad P.", "I love that this place is in the neighborhood. The silly, neon decor is pretty fun, the prices are very reasonable, but mostly the sushi here is very high quality, is very reasonably priced and often the chefs will prepare a fun, elaborate plating involving blinking lights, fans, tiered platforms and flowers. I don't have a photo, and it doesn't always happen, but it's a fun, silly thing that adds nothing really, but it's a great little gesture that demonstrates that they're really interested in providing a unique experience. So, why do I have to order with a cap-less bic pen? It just seems unhygienic and lazy to not have pencils. I'm not even sure that a pencil is more hygienic, but I certainly consider all the random types that I'm sharing a cheap plastic pen with. Not a big deal but it's an oddly jarring and missing detail. Mostly, excellent fish that's well presented and reasonably priced. Great place."], ["Layla W.", "spent 70 bucks on sushi....well worth it! Fresh & smooth as butta!"], ["Melissa K.", "My first visit was soon after they first opened the restaurant. I had an amazing experience then with super fresh fish and delicious sushi rice. Service was attentive and friendly. Beautiful interior and comfy booths. Second visit was slightly different. The sushi rice tasted more like regular steamed Jasmine rice with some vinegar. Some of the fish was not as fresh. Service was consistent."], ["Jensen F.", "Sushi was pretty delicious and their sparkly tables are great! The Kobe beef roll was to die for. Our waiter was super friendly and attentive."], ["Todd H.", "I went here a few weeks ago. The service was good but I was COMPLETELY underwhelmed with their sushi. The one saving grace was the tempura potato sushi. Never had that and it was tasty. I would not recommend."]], "Taki Sushi": [["Ian K.", "Okay so to start I have to point out how terrific all of the staff is here. Number Four (our server) is always smiling, very polite, and offers terrific recommendations whether you are a sushi noob or a seasoned sushi pro. The sushi comes out quick too!     The sushi is nothing short of amazing. One characteristic of their rolls I love is the ratio of fish/filling to rice. They certainly don't skimp you on the tasty fish. I recommend the happy roll to everyone, the pearl roll and ninja roll if you want a bit of crunch, and the octopus is always great too. The eel avocado combo is one of my favorites.     The atmosphere is nice and intimate as it is in a pretty small space. Pretty casual as well. It's very good for a date because of this but lookout during peak hours as it fills pretty quick. Surprisingly I've never had to wait to be seated though. I also find all the rolls to be priced very well as hardly any special rolls are over $15 and most are right around $13. Complete hidden gem In a cool neighborhood that everyone must try out. Oh and if you're feeling spicy try the wasabi tobiko. Clears out your sinuses."], ["Brittany S.", "Don't let the outside of this place fool you. It may be tiny, but it packs a lot of action. The locals in the neighbor know how good this place is because it always is hustling and bustling with people. I don't think the service or the fish can get any better than this little joint. They have some of the freshes fish in town. The ceviche with the huge chunks of a variety of different fish and mango is AMAZING. It seems like they always have some interesting new rolls on the special board that are good. The jalapeno yellowtail sashimi dish is really good and fresh too."], ["Brittany B.", "This is such a gem. Fast friendly service, deliciously fresh well cut fish, and rice that isn't taking over on the \"plain\" sushi.  I'm a huge fan of letting the fish shine in its own.  Y'all can have the spicy mayo & whatnot, but a true sign of a good sushi chef is one that can take such a simple delicate slice & let it shine by adding just enough seasoning to the rice.  And the thickness of the slices here have always been spot on.  Not thin, not monster, just right.Watching the chefs work is a lot of fun too.  They move like a well oiled machine.  Very focused.  And the prices are great as well."], ["Summer W.", "This is such a bummer.  It seriously aches me to write this bad review, because I really thought I had found my \"spot.\"  When I first found Taki Sushi, I regularly went in for sushi rolls.  It wasn't until I tried the sashimi ceviche that I really fell in love though.  At one point I was going in every day to get it.  It was all ruined oh so quickly though, when I placed an order for delivery that was over $75.  It took about an hour to come, but I totally understand that to be reasonable (even though the restaurant is only 5 blocks from my house).  However, the sashimi ceviche that I had fallen in love with was a bad excuse for the original recipe.  It was missing many of the ingredients that made it so delicious.  This made me sad, but what made it worse was the rest of the experience:  we ordered about $50 worth of sushi, and they hadn't even sent a scrap of ginger or wasabi.  The sushi also came warm, and made my friend sick.  She actually had to stop eating her meal and switch over to pepto bismol.  Pretty bad....This was all bad.  But when I called to tell the restaurant about my experience...everything just went straight down the gutter.  I told the employee on the phone about how bad the experience was.  The only thing she said was that they could bring us some ginger and wasabi.....in ANOTHER hour....  That just wouldn't even have served a purpose.  We were starving already, and ate what we could of the warm, dry sushi before having to quit because we were nauseous.  The lady on the phone was so so so very rude and uncaring.  She simply said \"there is nothing I can do for you.\"Such a sad experience!  I am totally disappointed.  I'll have to give up my beloved sashimi ceviche though because I was treated like dirt and may have actually eaten dirt instead of what I ordered.  :("], ["Tim T.", "Best Sushi in Denver and it's in my \"hood\"! We have gone about 6 times since moving to Denver this year. Staff is great, sushi is super fresh, rice is awesome! Chef is very creative with flavors and every bite is great! Great beers too.This is a true gem in the neighborhood."], ["Adam C.", "This is the third of my four experiences of having sushi and I actually liked it. I'm awesome."], ["Brandy W.", "So good! Love the seaweed salad, spicy tuna avocado, Pearl roll, and black pepper sashimi!"], ["Jenna W.", "Delicious sushi for reasonable prices. If you order over $25 you get either a free california roll or edamame appetizer. I've never been let down by Taki."], ["Maxwell U.", "Good local spot, only gone there three times to dine in.  Only once did we have a bad experience and i think it was just the tuna wasnt the best.  Usually its always very fresh and for the price for reasonable.  Delivery is always fast as well. I eat here about once a month"], ["Amber B.", "They are great! Fast. Sex on the beach is my favorite.  Waiter called number 4 is awesome.  The 4 stars is because there's no parking."], ["Laura S.", "I ordered delivery from Taki Sushi and really enjoyed the food. Delivery was fast and friendly as well. The miso soup was warm and delicious and both of my rolls were very well prepared and tasty!"], ["Stephen k.", "I've been getting To Go food from there for the last seven years and have dined in a couple of times. They have consistently offered up a quality product at a reasonable price. They don't offer the most polished service or the absolute best sushi in Denver, however they are a great value with what they do offer. I constantly find myself telling folks new to Denver that they need to go here for their sushi fix."], ["Taylor O.", "A friend of mine and I just got in from out of town and we wanted sushi so we looked on yelp and other similar sites. Taki sushi was our choice. The place is a little hole in the wall with a small sushi bar and 10-15 tables. We were greeted with a warm welcome and seated right away. My friend wanted to try the purple haze sake, it was too sweet for my liking. We started with edamame which was par. Then we shared 3 rolls and some sashimi. We really liked the Tokyo roll and the King Crab Roll. The happy roll was okay but my least favorite out of the 3. The sashimi was good, we had yellowtail and the peppered tuna. All and all our experience was pretty good. I'd go again."], ["Daniel S.", "Had dinner here last night. Pretty good sushi, staff was friendly. The specials were delicious and we ended up with more than we could eat for $25 each. The place looks like a shithole from the outside but is actually nice on the inside. Will return!"], ["Noah P.", "Tonight I revisited Taki for the first time in over a year. Before I visit a sushi bar I always call and make sure they have fresh Uni, which was the reason I ended up at Taki's tonight. The service was fantastic, and being that it was happy hour my beer was only 2 bucks! If you're like me, I usually just go straight shashimi (no mayo, sugary sauces, or anything to take away from the fish itself). So most of my order was my favorites + a salmon skin roll for a crunchy filler to my meal.The salmon was perfect. Fell more on the fatty side rather then lean, so it had a nice buttery feel when you bit into it. The mackerel was a small portion, but it had a perfect marinade to it. Not too vinegary. The Uni was spectacular, as it should be. I wasn't surprised when both chefs told me that was their favorite fish as well. However, slightly a smaller portion then I've had at Okinawa, but that's totally fine. The only criticism on the meal was the black pepper tuna. It was the only think that wasn't fresh. The tuna tasted aged, and was masked by the apparent old bay seasoning on the outside. As a tuna lover, I would've love to enjoyed the toro, but not for 14$ an order. Yes, I know it is usually 70$ a lb. There were many other options other then the black pepper tuna I wish I had gone with, and I do love a good lightly seared tuna. AThe rice seemed slightly undercooked and seasoned for sushi rice as well. Also, this place used their smoked salmon for salmon skin rolls... Not too big of a fan of that. As a sushi chef myself, that was the most surprising. The grain size of the rice seemed slightly larger than other restaurants, and it might have seemed undercooked being I was the first costumer there. Overall I will definitely go back to Taki's. Between then and Okinawa on Colfax, it's very enjoyable to sit down at the bar for a solo sushi session and talk to the chefs. I'll do my occasional sasa and sushi den, but as someone who eats sushi almost every day of the week, who could afford it. You will get quality and costumer care at Taki's, so please give them a try! Hope this helps."], ["Dan P.", "Best Sushi I've had in Denver! Very reasonably priced for the quality of food. The Rock and Tokyo specialty rolls are personal favorites, but all of the sushi items on their menu are great.Personally I'd recommend getting takeout rather than dining in because you get a free California Roll on orders of $25 or more. The service isn't bad at all, you'll just get more for your money doing takeout."], ["Daniel L.", "After trying Sushi Sasa and Sushi Den, my taste for the freshest nigiri took me to the next Japanese hot spots in Denver. My good friend and I arrived at this quiet neighborhood only to find this restaurant fully packed. We were fortunate to sit at the edge of the sushi bar with little elbowroom to spare. The high noise level, blue walls, brown floors, and small tables that were vertically arranged to face the sushi bar sums up their compact interior and a very festive crowd. The Agedashi Tofu ($4.50) was lightly fried and served with warm tentsuyu sauce on the side. The exterior of the tofu didn't encompass the sticky starchy quality and the inside should have been silkier. The Beef Short Ribs ($7) were stiff and didn't have much flavor without the teriyaki sauce. I had high hopes for these dishes but the taste and quality didn't shine through.I wanted to order Omakase but strangely the server didn't know what it was. My choice of nigiri included Super White Tuna ($2.50/piece), Yellowtail ($2.50), Salmon ($2.50), Salmon Eggs ($2.5), Spicy Lobster ($7), Spicy Scallop ($2.50), Sea Urchin ($4), and Spicy Blue Crab ($7). I thought the Spicy Lobster and Spicy Blue Crab had too much mayo, but the rest were fresh albeit the lack of sweet surge at the end. Service was sporadic but the unexpected plate of pineapples at the end gave the meal a nice closure. From the standpoint of food and atmosphere, interested diners should expect a more casual experience than the likes of Sasa and Den. Aoba sushi will be my next sushi destination in Denver. Despite its rating, I didn't find the high degree of finesse or home-style sensibility necessary to recommend this restaurant to the public. 2.5 stars, I won't be coming back."], ["Gretchen V.", "Relaxed but for sophisticated tastes. Excellent fresh nigiri and rolled sushi. We do not eat raw fish and were very happy with the choices on the menu. Fried banana with ice cream for desert was delicious."], ["Ty C.", "Rock solid sushi. Great selection of sake. highly recommend the sex on the beach roll."], ["Azar S.", "Found this place on yelp and figured we go for it. It's a small place, parking is on the side streets which can be tough. The sushi was toward the top of my list compared to all other places. The Denver Broncos special roll was very good and I recommend to try it. Small place, good for couples, small groups so enjoy the food and have fun finding a parking spot."]], "Izakaya Den": [], "Kobe An": [["Becky B.", "I was in the Cherry Creek area on a week day recently and needed lunch but did not want to pay too much money for it. I happened to walk past Kobe An with a sign for a $10 lunch special that included veggie tempura, miso soup, white or friend rice, california roll pieces, and some sushi.  That sounded like a deal so I went in!I am allergic to shellfish and I noticed that one of the sushi pieces came with shrimp (the others were tuna and salmon).  I asked the water if I could exchange it for something else (assuming that they did not do substitutions or would charge me extras).  They happily obliged for another piece of fish at NO CHARGE!The food and service were delicious.  I will come back again soon!"], ["Andi M.", "Love Kobe An! The seating set up is better than the Lakewood location! So glad they moved into Denver. Not to be missed!"], ["Robert G.", "Really long wait for the sushi.  Sushi was not good.   I would have rather gone to Taco Bell.   Save your money.  What a disappointment."], ["Jacey D.", "This place is a true gem! I loved how quaint the atmosphere was and how friendly the staff was. The menu was great. . I loved the vegetable tempura and pickled japanese vegetables.  We also had a nato handroll to start which was great. . The sushi was great too. . We met the owner and she was amazing. I loved our experience here and I will be back for sure. If you like authentic japanese and an intimate setting I would highly recommend Kobe An."], ["R K.", "Great sushi spot for a group of people! Fun atmosphere. Food was pretty good too! We'll go back!"], ["Jenette M.", "A group of 5 of us went out for a birthday dinner.  I chose this restaurant based on the reviews I read. They didn't disappoint. The restaurant was slow, but it was a Tuesday and they are new to the area. The inside of the restaurant is decorated nicely and looks clean. We had some miso soup, calamari tempura, and dynamite shrimp (amazing) to start. We got a variety of 6 rolls and they were accommodating to any substitutions/ customizations our group requested. I assume who was the manager came over and talked with the table and brought us plum liquor of some sort that they make in house.   Everything we ordered tasted fresh and was presented nicely.  It was a great first experience at this restaurant and the next time I'm craving sushi, I'll be back!"], ["Masha B.", "Nice! A great option for when you want really nice, flavorful fresh sushi!As much as I love Sushi Den, it is nice to have a more low-key alternative option with comparable quality. Atmopshere is very clean and pleasant.This will be a favorite, for sure! Can't wait to dig into more sushi soon!"], ["Mike G.", "Ordered the udon soup no chicken - got the fried Udon with chicken - not impressed with service overall - sushi was not great - the other food might have been good but  hard to taste past the service - oh and not a single comped item after such a mistake - full bill - have a nice night"], ["Michael M.", "Food was fresh and sushi was excellent. Service was prompt and courteous and the owner checked to make sure we were having a pleasant experience. The tea rooms definitely add to the atmosphere."], ["Rebecca G.", "Sad they moved from Lakewood but worth the drive anyway. Great service and fantastic sushi. Highly recommend."], ["Opus G.", "Really good sushi at a good price.  Big, beautiful place.  Great service.  Lots of small rooms available if desired."], ["Kristy L.", "This the best sushi I've had in a long time! The restaurant is nice and quiet and wait staff very friendly!! Loved the Tatami room!"], ["K M.", "This is a beautiful restaurant with first rate Japanese food.  The Tatami rooms are secluded and fun; overall the restaurant was clean and very comfortable.  The Shabu Shabu is HUGE, tons of fresh veg and deliciously thin cut Rib Eye.  The tempura calamari or vegetables are both a must have, light and crispy, not greasy at all; the perfect batter clung to its host food and didn't fall off after one bite.  The Sashimi is first rate and extremely fresh and the miso soup was buttery, rich and delicious!  Pork Katsu is always good, but here it's enormous and so crispy.  The Early Dinner plates are a great value if you are there before 6.  Service was great!"], ["Max F.", "Service and food are amazing! Prices are extremely fair! My favorite is the pork tonkatsu"], ["Vin E.", "This past Saturday night I had a spectacular sushi dinner here at their sushi bar.  Their fish is of the freshest quality and this new restaurant in Cherry Creek is spectacular.  Their nigiri is spectacular and the rolls are expertly crafted.  Great service, great food, a great time.  I would recommend this restaurant to anyone."]]}