{"Oriental Supermarket & Restaurant": [["Yim L.", "Standard Asian market with a restaurant on one side. I stopped by on a Sunday hoping for dim sum. No cigar. On the bright side, there was boba milk tea!"], ["Annie B.", "I was so happy to find this place, having just moved to Mississippi from D.C.The store has a fairly extensive selection of Asian veggies (e.g. yagaimo, burdock, greens, daikon, etc.). I haven't purchased any of their produce yet because the main purpose of my trip was stocking up on sauces and condiments. I was particularly excited to buy all of the sauces here because they are certainly cheaper than anything you might attempt at a regular grocery store (although not as cheap as my trusty Asian market in D.C.). I bought:-miso-mirin-soba noodles (they had a very extensive noodle selection)-rice wine (for cooking)-toasted sesame pil-pickled ginger-oyster sauce-hoisin sauce-chili basil sauce (for pad thai and drunken noodles)-black bean chili sauce-nori (they had an extensive selection)-kimchi-toasted black sesame seeds-frozen vegetable gyoza-frozen scallion pancakesAfter making all of my purchases, I got lunch and was very pleasantly surprised. I ordered Mapo Tofu and stir fried green beans (I requested no meat on both). They were both delicious and I was thrilled to get authentic tasting Chinese food in MS!"], ["Ieisha E.", "My husband brought me on a mini field trip (as he called it) to this place 2 years ago. I was very shocked at how different it looked inside due to the fact that I had visited numerous times during my childhood when it was chuck e cheeses. First impression when I walked through the door was EW it stinks so bad in here. I looked over and people were sitting and having meals while inhaling the funk, so the food must be really good. But aside from that, this place was beyond interesting. It was like a whole new world inside. It was amazing to see all of those foreign fruits and vegetables that they have as well as everything else. As you can tell I had never set foot in any type of Asian market before. I saw live crabs and fish everywhere. The only purchase that I made was bags of Asian candy. It was delish. I would like to visit again and try new different things."], ["Newly P.", "I was very excited about trying out this grocery store plus restaurant, but I came back with mixed feelings.-First, I don't think the restaurant area stinks, like some reviewers pointed out. -Second, they do offer chopsticks to non-Asians. You just gotta ask for it. If you don't want to ask, you can go pick it up at the entrance of the restaurant. There are plenty of chopsticks stocked there in plain sight.-I ordered the \"crizy\" spicy chicken, which BTW has been spelled correctly in the new versions of the menu, and I thought it was too dry to be eaten with rice. I really wish I had known this before I ordered it. The chicken had been chopped up into tiny peanut sized pieces and I could mostly taste the cornflower on the deep fried chicken bits. It was pretty much like trying to eat fried chicken with rice. Tooo dry! I added some soy sauce, but it didn't help things too much.-The cashew chicken was OK. Though they were really stingy with the cashew. A few more veggies in that chicken dish would have made me happier. And spring onions don't count as veggies in my book!-Overall, we left feeling we had ordered the wrong items. Maybe we should have looked at the pics on the wall and chosen something from there. I did see a couple diners walk with their server to the \"picture wall\" and choose dishes from there, so it's not a completely crazy idea!On an earlier occasion I had bought some items from the grocery area. I found the shelves neatly stacked, the aisles were labeled and numbered, which is a rarity, and all or most items had price tags on them. This last point is also a rarity with several ethnic grocery stores. They are pretty much a one stop shop for all items Asian. About the restaurant though, I maintain my mixed feelings."], ["Duan C.", "First and foremost, you just dont know how amped I am for being the first one to review this place!!! I tried checkin' in via mobile yelp and couldn't because their info wasn't in the system, so I am uploading the info myself and proclaiming myself the Duke of Oriental Supermarket! Lol!!Anyway, its a grocery store/restaurant specializing in ethnic authentic chinese cuisine and by far, its authentic simply by the seasoning and items you see on the menu - seaweed, pork intestine, tripe, lobster, conch, roast duck, salted duck, seafood hot & sour soup, its and expansive list, but guess what my goal is to give dang near everything a try as long as their open for business!The prices are so/so, their not expensive like PF Chang, but their potions are not great on to-go orders, but the people I've seen eat there were loaded down with grub.The ladies that ring you up are pretty nice and real sweet. I've tried the shredded curry chicken, taiwanese rice noodles, beef broccoli, seafood hot & sour soup and their regular egg rolls.Been their two times in the last couple of weeks and I will probably be back in a few days to try something else. I've seen a very diverse crowd in their shopping for groceries too.As always, hope you give it a try and let me know how you like it."], ["Sam L.", "Authentic Chinese food. Got roast duck, hot pot, and sautéed vegetables. Quick service. Very clean."], ["Chris M.", "Stopped in on our way home from the coast. I love the more authentic Asian places and was excited to find this place on Yelp. Unfortunately it didn't deliver. As some other reviews have stated it smelled bad due to the grocery and restaurant being combined. It wasn't a big deal and not that unusual with similar places due to the live crab, lobster tanks. As for the food, what we had wasn't very good. I will skip this place and stay with Keifers,etc. when passing through Jackson. If you like this place and make it Memphis, make sure and go to New Asia in Germantown."], ["Luana C.", "First of all, I was really shocked by the name of the market. Aside from this fact, the market is really small. It doesn't seem very clean, and I question how long some products have been stored there (make sure to check expiration dates). I was also shocked by how much they charged! However, I understand that this is because it is the only market carrying Asian food in town. I only go here if I absolutely need a specific ingredient that only they carry. If you happen to come here, be sure to check out Mr. Chen's (the restaurant attached to the market), it is really good!"], ["Jason B.", "I had a very good kung pao chicken here and enjoyed poking around the market and the staff in the restaurant was very courteous."], ["Tom R.", "If I were making a list of things that Jackson has too much of, Chinese Buffets and Tex-Mex Cheese Palaces would top the list. Luckily, there are places that swim against the current and put out great food at a reasonable price without the need for the \"All you can fit in your belly while wearing sweat pants\" sign out front.Topping this list is Mr. Chen's Oriental Supermarket and Restaurant. Then menu is extensive and authentic. You can stick with basics like spring rolls and lo mein, or you can take a walk on the Zimmer side and try out exotic fare such as Basil Pig's Feet or Crispy Intestine. We usually opt for a little of both.This review is not a recounting of one or two recent meals, but a ringing endorsement from a chef and a food writer who counts this eatery as one of the best in the city. How can I put this more plainly...Put down the shovel, step away from the buffet line and go directly to Mr. Chen's. When you walk in the door, glance to your left and pick one of the specials from the dry erase board and get it alongside whatever your favorite oriental dish may happen to be. You will swear off the gut-busters forever.Bon Appetit! - Tom"], ["PG A.", "Came for the best soup dumplings in Jackson, and they are awesome."], ["Baron M.", "It is great to have a local option for a non buffet, Chinese restaurant! The smell, when you walk in, can be a little over powering (coming from the fish market part of the supermarket, I do believe), but it goes away pretty fast. The food is great and the staff is nice. The lunch menu is filling and well priced, but the regular menu is where you can find some real gems. The \"crizy\" chicken is something else and the garlic bacon meat (not at all what it sounds like) is delish."], ["S H.", "Grocery definitely smells really bad and everything is overpriced...with that smell, I would not touch the restaurant with a ten ft clown pole. Yuk"], ["Tom J.", "Best Chinese I have ever had."], ["Rosemary Z.", "Had the Mongolian beef & it was perfect. Juicy. Tender. Savory. Oniony. Amazing."], ["Dacre K.", "Not a place you'd expect to find in Jackson, maybe San Francisco, Vancouver, or NYC because it so real, Chinatown style. You might forget you're in MS"], ["Greg T.", "Mr Chen's Crizy (menu spelling) Spicy chicken is not kidding with the 2 pepper hot and spicy warning.  It's great.  It's also very hot!"], ["Christina M.", "I was back in Mississippi for a quick visit to Mom and she took me to the restaurant for dinner. Why wasn't this open when I lived in Jackson 3 years ago? My mouth cried tears of joy, I swear. Mom is Taiwanese and was excited to let me try the Taiwanese specialties on offer at Mr. Chen's. We had the fried radish cakes, 3 Cups Chicken (I believe it's \"Taiwanese stewed chicken\" on the menu) and the pork and squid stir-fry with chili black bean paste. All of it was phenomenal, although Mom thought the pork and squid dish was too spicy for her taste. I had to pinch myself a couple of times to make sure I was really in Mississippi. If I still lived in Jackson, I'd be here every week and they'd know me by name. My only gripe is that I asked for kong shin cai (water spinach) in the restaurant and they wouldn't make it for us. It wasn't on the menu, but I saw some on the produce side of the market...sad because I really wanted to eat it that night. The supermarket part is pretty darn impressive too. When I was a kid there was one Asian market in Jackson, a small, dimly lit store in a sketchy location on Terry Road. When I lived in Jackson, I would go to an Asian market in Ridgeland which was better. But this market is definitely a cut above. There are bright lights! Prices are marked! There's produce! What's not to like?May this supermarket and restaurant live long and prosper, and I'll be back around the next time I visit."], ["Andrew L.", "After eating the Chinese food here I was disappointed in how blah it was. But their attempt at authentic Chinese food is the closest around."], ["Mary D.", "This restaurant was fantastic -- especially for Jackson.  Tried the jellyfish for a lark - delicious actually.  Great seafood hotpot.  The regular standards like orange chicken were good, too, but the best dishes were those not found at Chinese chains.  This was a great find and we'll definitely be back when we visit.  We had a good time in the supermarket, too."], ["Shane D.", "This is about as close to honest to God Chinese food as you can get in the south. The food was really tasty. However, some of the smells coming from the attached oriental market could put you off. All in all, I had a blast here. The food was great and I also had a wonderful time exploring the market."], ["Lacey O.", "At first this may seem like your typical Chinese restaurant sans buffet. Then you notice they actually have a supermarket. It's not just in the name. My husband and I have bought a few things from the market, but just recently ate there for the first time with another couple of friends. We weren't quite sure what to order because we wanted something different. Our waitress recommended 4 things: the shrimp and pineapple, kung pow combo, black bean combo, and the Chen's crispy chicken. It was all so good. We each had little left over to take home. I also didn't leave feeling gross like I do sometimes when I eat Chinese food. I will definitely be going back. Oh and the crab ragoons were de-lish!"], ["Lacy W.", "I love this place because it serves legit Chinese food. I always see REAL Oriental people ordering food from, Mr. Chen's.  Try the steam buns as an appetizer."], ["Pamela G.", "Never again will I eat a buffet chinese dinner again.  Ever.   Tried quite a few dishes from the menu: American Chinese meals like beef/broccoli, General Tsao's, and Sweet/Sour chicken.  All way better than anything you would get on any buffet in Jackson.  Curry chicken was yummy.  Anything with black bean sauce was wonderful - the chicken, the pork, and especially the fried fish fillet!  Chicken and pineapple was awesome.  But my fave, my absolute FAVORITE....  Mr Chen's Crizy (menu mispell??) Spicy Chicken.  I order it at least once a week for take out and always get an extra order for lunch the next day.  It IS \"crizy\" spicy, using dried red chiles and fresh green chiles for spice, stir fried with small bread cubes, chicken, green onions, peanuts and I think 5 spice (I always get a whiff of cinnamon but there are several other complex spices mixed in).  OMG soooo good,.  Please go.  Check out the grocery store which has wonderful and always changing selections for fresh fruit/veggies/herbs. Live fish in tanks (so when you walk in and smell fishy smells - there are fish/eels swimming in tanks in the grocery). Love, LOVE Mr Chen's!!!"], ["Shannon N.", "Finally, an authentic Chinese restaurant in the Jackson metro area!!  However...The service is fair, there is no organized system of which servers are assigned to which tables, we always had a server on hand.  However, there would be confusion between each of them when we have asked for an item or another.  We have asked for chopsticks with our meals, and were not given any because we have been insisted upon that we did not know how to use them properly.  Okaaaaaaay....The food is quite bland for the Chinese tongue.  Our roast duck was not as crispy as it should have been, also, the pan-fried rice noodles, and other ordered dishes were also lacking in flavour. The atmosphere is a typical Chinese restaurant from the 80s, none of the nuance flair that you would find the trendier Chinese restaurants you would find in  the larger cities, like Vancouver, or San Francisco.  It is quite clean, with no oil/msg odour in the air.  Much better than most Asian restaurants I have been to.I would not initiate going there for a meal again myself, but I will go if invited by other friends."]], "China Express": [["Quincy V.", "Great service, good food and fantastic prices.Looking for a quick, inexpensive meal? China Express is your place. I ordered takeout and the lady at the counter was very friendly. The rice wasn't packaged until I picked up the order, hot and fresh, right from the steamer. Not to mention it was a generous serving of rice.I concur with other reviews that the portion sizes are quite big. The $8.25 General Tso's Tofu was well worth the price. A ton of tofu with a very flavorful sauce. Maybe there could have been some more broccoli, but no real complaints otherwise.If you haven't been here before, I recommend checking out China Express. If you're vegetarian, the General Tso's Tofu is a great choice for a big meal at a low price."], ["Amjad A.", "Just want to say that the workers who work here are not at all friendly they're so rude. Specially the lady and there's only one lady work over there. She don't serve the quantity which you pay for and its not worth it. Even does not care about people's privacy. We were eating and they turned on something on tv with loud volume and that also in Chinese which annoyed me a lot. She was rushing us to eat and did not have respect for us at all. Even I asked her for a chopstick and then she said go over there and pick it up by ur self !!? My honest opinion of view I don't recommend this restaurant for anyone"], ["Count D.", "I eat here probably once every 1-2 weeks -- it's so good I just can't stay away.When you sum huge portions + right price + big flavors, you get one heck of a delicious combination. China Express Kitchen consistently delivers.I've had just about every chicken dish. My current favorite is the chicken fried noodle: it's $5.99 for a whopping portion of yummy goodness!"], ["Duan C.", "Major shout out to Craig T for putting me on to this place. Also, my supervisor stays in Clinton and recommended as well. This is not your typical Americanized Chinese restaurant - this is true Mandarin cuisine!I tried the Ma-po tofu, cumin chicken, and the stir fried shredded pork. All were delicious. The quality was superb and you can tell the difference between the Americanized cuisine and the authentic cuisine. The only knock, if you are getting to go and they are super busy!? Be prepared to wait. I left work at 5pm - made it there by 5:30pm, placed my order - gentlemen told me - sorry, but its going to be about 45 minutes - I said, \"Yes indeed!\" - But I took that as a pleasant warning on how good the grub is, if they are that busy.So I went around the corner to Applebees and had a couple of beverages while my food was being cooked. good to see an another authentic Asian restaurant in the metro area. Shows you how far Mississippi has come and that we are growing."], ["Eve B.", "Insanely amazing and authentic Chinese food. I will come here each time that I visit the area. The owners are very friendly."], ["Garon T.", "This is without a doubt, the best Chinese restaurant In the city. High quality, authentic food, and great quantities for the price."], ["Stephanie M.", "Not your typical Chinese fair. We got a huge serving of Chicken curry with carrots, onions & potatoes along with rice. And chicken with garlic sauce (a bit of heat in this) with veggies & red pepper flakes.The curry was better than Rucchi Indian restaurant. It was a lovely coconut milk-cream base and was balanced and OHH so good. The chicken was dark meat chicken with some connective tissue which was not to my taste but the potato was so fabulous and the sauce to die for that I will get just the veggies and no meat and dump my rice in it and eat the sauce up!The second dish was supposed to be shared but the garlic sauce was a bit spicier than expected. It was a nice white meat chicken with some bell peppers, mushrooms, carrots & spicy red pepper flakes. You get a free thing of water with your order.As these other guys explained there was a steady crowd of Asian students enjoying the TV in the corner. We were pleased to see some other colors of people in there too so others know how awesome this place is. We surely wish the place was more crowded as this location seems to have been lots of things in the past and we wish them much luck!It took 30 min or so to get our food but it was worth the wait. Calling in before you arrive would be great but it was lovely!"], ["Craig T.", "In a city rife with poor to mediocre Chinese food establishments, there is one restaurant that has risen above the rest.  That restaurant is China Express Kitchen in Clinton, MS.When I opened the plate glass door of this shopping mall strip joint to the sounds of the telltale tinkle of the 'new customer' bell, I took it as a good omen that the small and spartan dining room was filed with Asian students speaking in exotic languages while watching Chinese television programming on the small TV mounted in the back corner.  The smells and odors of the food they were eating wafted through the room and immediately whet my appetite.I have been twice now for takeout, and the food has been prepared fresh and presented to me piping hot.  The sesame chicken sauce was better than anywhere else I have tried.  The flame's pork was a delicious concoction of pork, peppers, and onions.  The fried rice was better than anywhere except possibly a couple of the hibachi places (lots of scrambled egg in the rice).  And the sticky rice was the perfect combination of taste and texture - great for those who possess an aptitude for eating with chopsticks.  The egg rolls are also very tasty and very peppery.  My only disappointment has been that they have not had dumplings either time I have visited.  Maybe if I keep asking for them they will have them.They don't have a huge menu like some Chinese food establishments.  Instead, they seem to focus on doing a nice variety of dishes really well.  I look forward to eating my way through their menu in the near future.This is an easy place to overlook as it is hidden in a small shopping strip tucked behind a Zaxby's.  If you know where the Shipley's donuts place is, then China Express Kitchen is in the same strip mall.  If you are looking for some decent Chinese food, check this place out.  I think you will like it."]], "Ichiban Buffet": [["Carrie R.", "Ichiban is by FAR the BEST OF the BEST! From the moment you walk in the door the service is excellent! Smiles greet you everywhere you turn. The sushi offerings here are amazing and sure to please any palate. They use Fresh ingredients in all dishes and the buffet is Pristine. Never a mess. Our server was amazing as usual and here you can never expect a \"cup to be half full\" If you want an amazing experience at the best Sushi Buffet in town make sure you stop in here and PS the bread budding is delish!"], ["Stephen F.", "The word on the street in Jackson is that this is the best Asian buffet in the state. It might be, it might not be, but I can tell you I left there with my stomach feeling very artsy.An very modern restaurant, great lighting, lots of bright colors and plenty serving displays. If you're a sushi fan you might possibly make out like a bandit as you make your third trip down the line. If you're a traditionalist then you won't be disappointed. Each dish offers their own taste, the coconut shrimp is filled with the distinctive taste of coconut. The chicken skewers have this juicy taste of seasoned chicken.Do yourself a favor and arrive by 11:30 AM, because come noontime, this place will be packed."], ["Jessica L.", "The ambience is great!  The restaurant is clean and the decor is right on track.   Let me start with it's a great variety of food.   Being it was a weekend they had many seafood offerings fried & stuffed shrimp, oysters, and of course crab legs along with the other Chinese buffet options.   The food was well prepared and fresh.  The real shining star for me was the sushi.   I generally don't eat the sushi off the buffet but it was so beautiful I had to try it!  It was simply awesome!  The service left a little to be desired keeping this review from 5 stars."], ["Craig B.", "Always a good choice for lunch or dinner. Plenty of sushi choices and lots of American style Chinese food."], ["Jonna B.", "The first time I went, there was a two hour wait. Ridiculous, huh? There is always a line down the side of the restaurant, no matter what time of day it is. If they're open, there's a line. So I didn't stay the first time I went. I went back a few weeks later, and this time there was no wait. The selection of sushi is great, and they have everything ranging from simple philly rolls to dynamite and crunchy rolls. If you like sushi, you'll like their selection. As far as food goes, there is variety of both Chinese and American food, so it is kid friendly. I know I didn't like Chinese when I was little, so it's a major benefit for the little ones. As far as quality of the food, I would say it's on par with most Chinese buffets. It is the closest buffet to my home, and the only one that I know of that is reasonably priced for the amount of food they have."], ["Bill M.", "Lunch there was a real treat beginning with the first steps through the front doors. Everything was shiny clean and the buffet was obviously well kept. Items were steamy hot and very tasty. Sushi bar was excellent. The staff was friendly and very attentive.   I can't wait to go back. Not your typical Chinese buffet."], ["Bryan V.", "By far the best Asian buffet in Mississippi hands down. You can't compare it to any other buffet. Everything they serve is fresh and so many varieties of sushi to choose from. It's a bit pricey but well worth it."], ["Farokh N.", "One best Chinese restaurants in MS. Consistently good food. Best value for your money."], ["Popa D.", "This is hands down the best Chinese buffet around. I always bring out-of-town guests to this place and they are always impressed. The sushi is great, and all of the buffet items are fresh and hot and super tasty."], ["Kerry D.", "It is never disappointing and the flavors are consistent.  The servers are not always the most attentive."], ["Gerald L.", "Great service and food. The best Chinese around. I would have no problem recommending it to anyone that likes Chinese and a good buffet. I have eaten here several times and the food is always great."], ["Noi G.", "This is by far the best Asian buffet I've gone to. Food tastes great and fresh, there was also a sushi bar which I liked a lot. My favorite was the coconut shrimp, from what I got. There's a lot more but I can't try everything, although I would love to! Sadly, my husband and I are just passing through and visiting family... I would go again if I wasn't"], ["Doug B.", "The important attributes of a buffet - is the food fresh (check), is it the right temperature (so-so), is it clean (check), does the staff clear dirty dishes and refill drinks quickly (check).  Good start.I arrived shortly after they opened for dinner at 5.  Everything was fully stocked.The sushi is very american style, I wouldn't take one of my Japanese colleagues there.  Still, it sets this place above the typical Chinese buffet.  Plenty of variety, but most items are very common.I tried many items and was happy with most.  I enjoyed finishing it off with an almond cookie (with a real almond) and some Blue Bell ice cream."], ["Anthony R.", "Food and service were wonderful. A great variety of food to make everyone happy. A great place to eat I will definitely be back. I recommend Ichiban to anyone looking for a great meal."], ["Mary M.", "My husband and I eat here nearly weekly.  It is a great place to get sushi for cheap.  It's a good quality and the staff is friendly.  I also enjoy the coconut shrimp which really don't taste like coconut but they're amazing!  Go here!"], ["Richard L.", "I've been to Jackson twice, and both times I've eaten here. It's hard to beat the price and the variety. I've eaten at a lot of buffets and this place goes a bit extra with the savory, maybe it's regional thing but it really takes away from the food. Overall it's a relaxing place to eat, pretty much whatever you want."], ["Lee P.", "Best Chinese buffet in Jackson.  Great selection of sushi and crab legs are good at night."], ["Jerica D.", "There are quite a few Chinese buffets in Jackson area, but this one is the best! There is a lot to offer at this location. I am always seated quickly and as soon as you place your drink order you are free to get up and make your plate! For those who have kids that may not want to eat Chinese, they also provide American food---pizza, wings, fries, etc. There is a sushi bar----for those that don't mind cold sushi and there is also an ice cream bar. The buffet is never low on any items, as they make sure to keep the food stocked and fresh, and it is always very clean. At night time its a little pricey for the south, but that is because you can eat unlimited crab legs. I always go by here when I visit home, and I would recommend this to any stopping in through!"], ["Jonathan T.", "This place is deceptively good.Don't get me wrong--there are more than enough mediocre, greasy, unhealthy pan-Asian buffet \"classics\" to make a new-comer hesitate.BUT, the other 30-40% of their selection is actually reasonably healthy AND pretty tasty, as I've come to realize the last few visits.Their sautéed shrimp, pan-seared chicken, stir-fry green beans, and brown rice were all good. I also went for the miso soup and California roll, and I finished my meal quite satisfied. It was all served at good temperatures, and everything (that I ate anyway) tasted pretty fresh, honestly.$13 for a lunch buffet and drink might be a bit more than I'd hoped for, but this is Mississippi after all, so I'm not surprised they need to hike the price to make up their costs.I won't be back right away, but I will drop by again from time to time."], ["Sarah A.", "My friends and I recently ate here and it was really good! There were many options and the price was nice."], ["John K.", "If u can find a better buffet lmk. This place is amazing and very cheap for the price. I went here for lunch and dinner. Very good and love the staff very nice and welcome. Sushi is fresh and soup is awesome. Never a empty spot. Great great food and will come back soon!! Hope this helps!"], ["Nikki H.", "I thought it was really shady how Ichiban charged $18 for the entire day of Father's Day. The restaurant was already crowded so they would have made money without jacking the price up. I, for one, will never eat here again. There are too many places to choose to eat in this area for me to spend my money at an establishment that believes that this is ok."], ["Bob M.", "The food was good. Very crowded, which was a good sign. The problem I had was with the obvious lack of parenting skills from some customers. There were two families that would have their kids camp out around the crab legs, and when a new batch was brought out, these kids (adults remained at their table), would take nearly all of them. This went on the entire time I was there."], ["Angela P.", "My favorite buffet in Jackson. We go at least once a month, and every time my mom comes into town. It is her favorite. The variety of Chinese food, sushi, & American extras is awesome.  There is definitely something for everyone.  My favorite is the coconut shrimp, but their hot and sour soup and black pepper chicken is also really good.  My only criticism is that nothing in their buffet is truly spicy -- it is most definitely an Americanized Chinese restuarant.  Even the General Tso's chicken is more sweet than spicy -- that being said, it isn't bad it just isn't my favorite.    My husband goes straight to the sushi bar.  My nephew loves that they have blue bell scoop ice cream for dessert along with the fruit and dessert bar.  The atmosphere is pleasant.  I love the big umbrella above the buffet bars and the lighting."], ["Chye M.", "Wide variety of fresh sushi on the buffet, they make it infront of you. Good food and a variety of foods for kids that don't like Asian food. A large selection of deserts, my kids loved it! My husband likes sushi, I like sesame chicken, general tso's chicken and won ton soup. All of this was great! They also have a variety of blue bell ice cream. If you're looking for a place where everyone can find something they like when you have kids.. This is the place for you!"], ["Shadoe F.", "Best buffet I've had in a very long time! So many great dishes to even try to describe!Sushi area was clean and freshly prepared. Buffet bars were being constantly worked and cleaned. Waiter was fast and courteous. I ordered the sweet tea and it tasted fresh unlike most places that use old tea. The inside is really pretty they have a huge umbrella that is over the main area. Bathrooms were clean!!!!!!!!! Will be coming back :)"], ["Mike J.", "Great food, awesome service. This is probably the nicest Chinese buffet i have ever been too. Everything is clean, the service is expedited so your water is always filled and your table is emptied of dirty plates. Additional information, come eat on sunday, there will be hot ladies just got off of church in hot dresses ( a beneficial addition  )."], ["Rose K.", "Honest to goodness. Best Chinese buffet I have ever been to so far in my life. And I have been to many buffets throughout the US. I took my dad here a few months ago (and he is critical of almost everything) and he loved it. He especially loved the crab legs which are sliced in half. Check it out."], ["Kim M.", "This place is great. They have a huge selection of good, fresh sushi.  The sushi chefs are right there making more all the time. It's not like some buffets where it can be sitting for a while and get a bit iffy. The rest of the buffet is good too. They have a decent selection of Chinese (Americanized) and some more American dishes. The deserts selection is standard Chinese buffet. It's a little pricey for a buffet, but when you think about the usual price of sushi it's a bargain."], ["Sandy S.", "Was visiting family (we are from Los Angeles), and they took us for their favorite restaurant. Not bad at all. Reasonably priced and the kids were very happy. Some people were just pigs about certain items (crab legs), so we had to wait a bit. Sushi tasted fresh and was made constantly. Great place to go if you like serving yourself."], ["karen p.", "I come from  California where we have a wide variety of food especially sushi/sashimi so when I heard about MS having an all you can eat sushi/sashimi buffet you can't help but think its going to suck. I came here with a couple of friends to check this place out. This place was in a nicer area in Flowood with blocks and blocks of shops. Basically, if you wanted to get shopping done, this is the place to be. So the location was convenient.. although it was a ways from school. The place i remember was cheap (compared to prices in CA) i think for dinner it was only $18.. of course for MS prices this is pretty steep (OMG their $5 KFC buffet, but i digress). They had a variety of chinese and japanese food.. along with the MS staple; crawfish and catfish and oysters fried battered or raw. But I didn't come here for all that, i came here for the sashimi and sushi and I was amazed. The salmon was extra fatty and delicious. Although you have to kind of pester the sushi chefs into cutting up pieces for you. I had to let the chef know 3 times that I was waiting on salmon and he must've cut up maybe 4 slices. I had to keep going back and asking for more which was a big ass pain but other than that, the quality of the fish was superb. There was great marbling in the fish with lots of fish oil drizzling down the sushi. They also had raw oysters which I absolutely love. But yeah yadda yadda the food is good... but The best part of this buffet hands down is the ice cream. BLUE BELL BIRTHDAY CAKE ICE CREAM!!!!!!!! OMG where the hell have you been all my life?! Ever since I ate that I been searching far and wide at every Krogers I could to find it but I was never able to see it again... now that im back in CA, i'll never be able to eat you again.. how i long for you... *sniff sniff*I've been here quite a few times and i absolutely love it. It's a little part of CA that I'm able to experience.. and the ice cream! holy bananas on a stick that is ah-may-jing! Definitely a good place to eat, but even more worth it for the ice cream. i miss you my blue bell birthday cake. sniff snifffff**"], ["Psonya H.", "For the first couple times, it's impressive.  After that, it's kinda just the place you go for variety.  This is really a mixture of Chinese and American food, but on a \"super\" buffet.  I don't care for sushi, and they no longer have crab legs on the buffet on weekdays, only Friday - Sunday at dinner.  If you don't do crab legs or sushi, it's a little pricey.  However, on week days you can order a \"side\" of crab legs for an additional price. Some dishes are fried chicken wings, fried catfish, mushrooms, beef & broccoli, fried rice, lo mein, General tsaos chicken, wontons, egg drop soup, hot and sour soup, dim sum, dumplings, pizza, barbeque ribs, french fries, bacon wrapped shrimp, mac & cheese, loaded potatoes, shrimp.  That list isn't exhaustive, though, at all.The service is always good and friendly, and the servers are very attentive.  An okay selection of desserts, but no pies or cakes in the traditional sense -- although you can dip blue bell ice cream.  And they have some pretty good, bubbly, fountain drinks.All in all, you probably won't be disappointed.  You're bound to find at least one thing to get excited about."], ["Billy D.", "The food was good. It's the best buffet I've had. I took our whole family. My wife and I loved it. Our 2, 6 and 8 year old boys loved it as well. And there are lots of choices for desert. Just the 8 flavors of Blue Bell ice cream makes it worth the money."], ["Jason B.", "Great place for a lunch buffet everything i enjoyed except the hot and sour the day i went.  liked the miso though.  overall great."], ["Rachel F.", "Okay, so first off, sushi is expensive. In pretty much any city, 5-15 bucks PER ROLL is normal. Say you want 2 rolls and some sashimi and miso soup. Easily a 30 dollar meal. Easily. So, when I hear sushi on a buffet, I'm tempted against my better judgment. It is often okay, sometimes bad, and occasionally, I mean occasionally, really good. This is one of those places. I have been here a good 20-30 times. I LOVE it. Every time I visit Jackson, my friends know that we are going here for lunch one day. $11 for all the fresh sushi, sashimi, seaweed salad, miso soup you could possibly eat. There is one roll that has peanut butter that I don't like. But hey, it's a buffet, so I can try them all and see what is my fave and then eat until full without adding the bill in my head, justifying an expensive lunch by taking away drinks at the bar that weekend. Oh yeah, they have good Chinese too, but what can I say I rarely touch it - there is sushi on the other end! Their salmon sashimi is probably my fave, and it has been fresh every time I've gone. They even have an ice cream station. And ice cream happens to be one of my favorite desserts. But I hardly ever get it here. Yup, I am that typical gluttonous buffet goer at this place. I stuff myself to an inch of combustion and then smile the rest of the day. I miss you Ichiban.This place is going to be part of my heaven. I might miss it more than anything else in Jackson. Just kidding, it is 2nd after my friends. Aww."], ["Matthew L.", "What?  A sushi buffet in Flowood, MS?  Perhaps these restaurateurs have overestimated our dear small town Mississippians.  Or they've merely figured out how to charge slightly more for Chinese food by putting sushi on the buffet knowing well that most of the locals will predictably load up on fried rice and yeast rolls!Let the diabetics crowd around the pizza and chicken fingers and head for the sushi buffet--nicely set up off to the side where you'll avoid the stampedes.  The selection is modest but good with lots of rolls to choose from, a few nigiri selections, and a tasty seaweed and crab salad.  Quality is good--especially for the price.  You can get your money's worth at lunch ($11, includes tax) with just one trip to the sushi buffet.  The hot buffet has pretty standard fare--sweet and sour chicken, lo mein, dumplings, egg rolls, chicken-on-a-stick.  Good selection of fruits and salads.  Staff is typically efficient and hard working.  Pleasant surprise on my visit to Jackson!"], ["Rob B.", "It's a good Asian buffet, with a good variety.  I have to chuckle, though, when I think about the wait staff.  Each one I spoke with had very thick Asian accents, but verrrry American names on their name tags--like Judy, Luke, and Fred.Drink service was a little slow, but, they were busy.  Also, if you order anything but water you get to keep the big Ichiban plastic cup your drink comes in.  :-)"], ["Traci H.", "It's an average buffet. Not too pricey. Good for kids. Will probably visit again."], ["R P.", "The food is good, but it is a buffet, therefore it attracts a lot of riff-raff. They have increased prices to the point where they are about to price themselves right out of business. I would suggest eating at Mr. Chen's instead. There is no buffet, the food and service are great, and the prices are very reasonable there."], ["Casey S.", "Mediocre and overpriced."], ["Kevin B.", "Sushi was great as well as the buffet."], ["PNotHere E.", "I came here for dinner 1 evening.  I was driving on Lakeland and spotted the \"all you can eat\" sushi bar sit down.  I decided to stop.  The place is a combination sushi boat bar (there is a conveyor belt that circles around 2-3 sushi chef with plates of Sushi) and a Teppanyaki seated area where the chef comes out to you and cooks your meal in front of you.  Different sushi, sashimi and salads were there for the choosing.  If you did not see something you liked you could request from the sushi chefs a specific roll.  As I have eaten sushi at several places previously I could tell you that these were great and above par.  I've eaten some dumpy sushi before but this place made it right then in front of you -- fresh and good.  I'm not sure about the Teppanyaki area however there were plenty of people seated.  This place was busy no matter what you chose.  I'd come back.  Not sure if they will have the same special when you go however I did survey their normal Sushi Menu and the price is about right for what you would pay for good sushi.  Enjoy."], ["Christopher P.", "I can eat my weight in sushi. No, really. I can and I have. Give me a soft drink or cold Sapporo, and I'm just one burp away from making room for another twelve pieces. That being said, Ichiban Buffet has outstanding sushi that always leaves me with that \"I'm so stuffed...why do I do this to myself?\" feeling. At around $20 per person for the dinner price, Ichiban is also an incredible value. My wife is NOT a raw fish kind of gal, however. The reason for the lack of four or five stars is that $20 per person for basic Chinese-American fare is a little steep (especially for those people who don't actually crave wasabi. Which I do.) The other-than-sushi buffet is incredibly extensive, though, and you're bound to find something you like. The atmosphere is a bit hipster, which is a nice change from other Asian restaurants playing loud Asian music that , surprisingly, nobody knows the words to. The price is somewhat cheaper for lunch, and the buffet options are the same, as far as I can tell. Did I mention the great sushi?"], ["Lisa P.", "Good food, esp the bento box at lunch. Pretty standard prices for sushi in my opinion."], ["Kristin B.", "This is a great Chinese super buffet located in Dogwood Festival on Lakeland Drive.They are pretty pricey, but you can easily get what you paid for due to the large selection available. They have a large sushi selection where the chefs put out fresh sushi of various types all day long.  The bar across from the sushi has dim sum and dumplings, as well as six types of soup. There's a salad/desert bar, as well as two or three bars that contain your typical Chinese buffet foods. Finally, there is always a section of seafood available on the buffet. I try to go during weekday lunch to get the cheapest price. ;)"], ["B P.", "We enjoy eating here, although some foods are \"Americanized\". For those who venture eating the real Asian foods, their sushi, dim sum, and hot and sour soup may fulfill that desire.You are not going to find real dim sum (that's frozen vs hand made) anywhere in this state. Anyway, they offer a good variety of foods from Asian to macaroni and pizza. Fish can be tasty too. Also Ichiban is good for families with little ones. Prices run from around $11 for lunch to $24 for dinner. We think the best times to go are for lunch weekdays and either time on weekends.  Busiest times, but that's when the food is the freshest!  Gave 3 stars for 2 reasons: pricey, if you don't eat up crab legs and sushi for dinner.  Also because we went once at 2:00 (one hour before closing for end of lunch) and they had put up half the sushi!"], ["The Yelp-inator W.", "The Best I know of in MS!  No one comes close...cost a little more...but well worth it IMHO."], ["Brooke P.", "Best china buffet ever!!"], ["Herman S.", "There are two Ichiban's (within 2 blocks of each other). One is the Sushi Bar & Teppanyaki Grill where they cook at your table. The other is the Ichiban Super Buffet. It's by far the largest Chinese Buffet in the area, and a huge selection of Sushi rolls & crab legs for folks that eat buffet sushi & crab legs. But other than that, they have a huge selection of mediocre American and typical chinese food..Sweet & Sour Chicken, Pizza, roast, donuts, chicken on a stick, fried rice, crab legs, etc.. I've been many times hoping to find enough small bites of soup and ice cream to warrant the $18 price. It's just not worth it. It is a whole lot of sub-standard mediocre/filler unless you like to really load up on buffet sushi & crab legs."], ["Richard C.", "Ichiban's sushi is among the best I've had-- even compared to normal sit-down restaurants.  You will not find a better sushi buffet in a large metropolitan area.  I make it a habit of going there once a week and get withdrawal symptoms when I don't go for a while."]], "Number One Chinese Restaurant": [["Duan C.", "Okay, must be honest. Even though it is a Chinese restaurant - they do submarine sandwich's! Yes people a Chinese restaurant doing sub sandwich's! I strictly go for the steak and cheese subs! Here is the knock on them, they are always running out of bread! But they make a mean sandwich, when they have the bread. The actual Chinese food, is so/so - so I can't break down any kind of excitement when it comes to that, but if you call and they say they have bread for the steak subs - you have to try it!"]], "Hunan Wok Carry Out": [["Tonya T.", "I was headed into work not feeling well. So I hit Yelp foe \"Best egg drop soup\" And Hunan Wok came up so I decided to try it.  SO GLAD I DID! I picked up my soup and vegi rice. EXCELLENT!!  Will be returning!"], ["Aaron Ray A.", "This is my Friday night Chinese place.  If you get the dinner, it is enough food for two meals.  Always, Hot, Fresh and Delicious.  Call your order in before you leave and it will be waiting on you when you arrive.  This safe is very friendly."], ["Harvey S.", "Best place for takeout in the Jackson area also probably one of the cheapest places and you get a lot of bang for your buck."], ["Pete F.", "Cheap, filling Chinese food. It's nothing special, but the portions are easily enough to split, making this place a super economical dinner for two. We easily eat for under 15. Check out the dumplings - they're awesome steamed!"], ["Jake S.", "Best Chinese food in the Jackson area. The wontons are the best I've ever had. The rice and sesame seed chicken is the best!"], ["Corey J.", "Awesome friendly staff and the food is perfect.  I am a New Yorker and I know real food this is it."], ["Neftali P.", "The menu selection is simple dinners come with all the essentials such as: rice, egg roll, and wing/wonton. The food is always warm and chicken is great for everyday take out or lunch. They are quick and they are always working hard to keep their customers. Family owned and operated wish they would expand and have a drive-thru."], ["Chad S.", "Best Chinese Take Out in Ridgeland. The Spicy or Honey wings are awesome. Service is fast. Made to order take out."], ["Gary A.", "This is the best Chinese takeout in Ridgeland. The others don't compare!"]], "Best Wok Chinese Restaurant": [["Angela P.", "The best takeout Chinese in and around Jackson.  Call in/take out only--no dining area. The general Tso's chicken is awesome, as is everything else I've tried.  Great egg rolls, spring rolls, & crab rangoons.  Try the shrimp toast.  Location is the only reason I didn't give it 4 stars.  The prices are great especially on lunch combos. They take cash only and it is worth the hassle.  I refuse to go there after dark though--wish it were in a better part of town."], ["Nick W.", "Good food for the price. I think what this restaurant has going for it is value. The food isn't great, but it's good. We ordered Chinese donuts, General Tso's, and Walnut Shrimp. The donuts were excellent, the Gen. Tso's was a little bland tasting and had little spice, and the Walnut shrimp had a good flavor, but the texture of the breading around the shrimp was not pleasant. The location itself is a little run down, but matches the area. The service was nothing special. We had no issues, but a man came in with his food he had just picked up and stated that it tasted burnt, and the woman at the register said \"It's not burnt.\" Then ignored him until he left. No effort to appease him or offer to re-make his order.Also, they do accept some credit cards now."], ["Dawn M.", "It's not bad at all, but there's some better right around the corner on State. Literally. For pretty much the same price."], ["Davis F.", "Hard to find very good Chinese food in Jackson. Food here also fit that bill. It was not bad but not something I'd go out of my way for. That said, the portion size was quite large and the price was right."], ["Amy L.", "This is really a great take out restaurant.  The food is good and inexpensive.   They accept cash only."]], "Hong Kong Tea House": [["Cody C.", "Best dim sum in the city. They are brand new and working out kinks but the service was super friendly and food was spectacular. We had BBQ pork steam bun, pot stickers, steamed scallops, peanut and pork dumplings, and shrimp and chive dumplings. Topped everything off with the baked pineapple egg custard bun. Could've eaten my weight in dim sum. It was so good. Come hungry. Leave happy. Super affordable and authentic for sure. Pro tip: apparently they do the full presentation of dim sum on Saturdays and Sunday's. Next trip will be one if those days."], ["Dave C.", "Ok, my first time here and I was alone so didn't get to try much. That having been said, what I did have (beef chow fun and egg drop soup) were the most \"Americanized\" things on the menu and both were wonderful!This isn't really a place that you should come to alone- they have many great looking menu items, and from what I could tell, most were designed to be shared family style. This was especially true of the soups- four or five different styles for groups and an additional two that came in single serving portions. But the really interesting thing on the menu was all of the dim sum! I didn't get to try any this trip but will be back!"], ["Lola F.", "New Chinese dim sum restaurant.  Good food but service is slow.  Hopefully, management will work out the kinks to provide better service."]], "Ichiban Buffet Pearl": [["Susan L.", "This place was great! We got there right when the opened for dinner. It was packed, but the food was fresh and there was plenty of variety. Service was perfect, bathrooms spotless, and the buffet was clean. Loved it. Will definitely go back next time we are in the area."], ["Jordan N.", "In date night, my husband and I always stop by Ichiban. You always get the best service and the place is very clean. They have a wide variety of food and the freshest sushi!"], ["Frank L.", "Fresh food on the buffet at 840pm.  People were nice and friendly. The owner came by and talked with us.  Very kind of food Chinese food was on the buffett...sushi, sashimi, southern, shrimp, deserts, soups, dim sum...it was fabulous, cuz I are way too much. Get the fresh lemonade."], ["Valerie P.", "So impressed with this place! My family just went here because it was close to our hotel, but we were so pleasantly surprised. The building looks brand new and is very trendy looking and clean. The food is great and the staff is so friendly. Definitely would come back if I was in the area again."], ["Twinkle W.", "The place is awesome! It's the best buffet in Mississippi. The have all you can eat sushi, steak, i liked everything. A great place to spend time with your family and friends.The restaurant is clean and the service was good. The food was fresh and hot.  I recommend this place to everyone!"], ["Jimmy C.", "Very limited choices surrounding, and the concept itself is sleek and appealing.  The quality if the sushi rolls is of course lacking but still a solid eat.  The rest of the buffet is what you would expect as they try and offer a local cuisine mixed with culture from over seas.  The beer is perfect as you would expect!  Not a fan of the buffet but this gives you an option for the area to step outside the norm.  Solid and smart concept."], ["Jim B.", "Had lunch here last week and all was fresh and very tasty. Might even be better than the flowood location."], ["Shari C.", "My first time to this new location. Cool decor, food was good, service was ehhhhhhhhhhhh, and the bathrooms are terribly inconvenient.  You have to walk behind a waitress station to get to the hall way. It was very difficult and dangerous for me on my crutches. They need to take out one of the booths and move the waitress station. If they don't fix this, I won't eat at this location.  Not what you would consider handicap accessible."], ["Lee P.", "It's the cleanest and highest quality buffet I have ever been to.  The Tuna and salmon were as good as you would get at a sit down sushi restaurant, and the crab legs are excellent. I highly recommend trying it especially if you are hungry."], ["A K.", "Great food, great service. A must place to eat if you like sushi and oriental buffet. Well worth the price!"]], "China Kitchen": [["Duan C.", "Working in downtown Jackson, there is a Japanese restaurant who has pretty steep lunch specials, so if your looking for some cheap Americanized Chinese grub and your stuck in downtown Jackson - this place is the closest option.You can take the Jackson State corridor to Ellis Avenue and make it to this place in 10-12 minutes.Typical Americanized Chinese fare, beef broccoli, fried rice, fried chicken wings, lo mein, chow mei fun, etc etc.Decent place to get some $5 eats."], ["Patricia B.", "The best thing about this location is that they accept JSU Supercard. The food is average and best the selection of food in south Jackson is slim I settle. I ordered Hot & Spicy Shrimp and received 4 Shrimp and a hell of a lot of sauce."]], "Five Happiness Chinese Restaurant": [["Duan C.", "When it comes to chinese this is probably one restaurant that is in the top 10. For a southern city, Jackson actually has a lot of chinese restaurants, so each place has their specialty. I like Five Happiness' Mongolian Beef and House Fried Rice. I usually get to go and they are not stingy with the portions.Fair price, they been around forever and have a strong following, considering what part of Jackson they are in. They are holding strong and I hope they continue to thrive in South Jackson and continue to receive support from the community. Nice people, clean place."], ["Connie M.", "Everything I have had and ive had it all...is 5 star...If you had a bad experience then its probably because you ordered it that way instead of the way its served."], ["Margaret S.", "Good Chinese food. It's an old place, not in a super-fashionable area of town; but the food is reliably good. They have good egg drop soup (not great hot and sour though), sweet and sour shrimp (and chicken), and fried rice. There is a lunch buffet, but dinner is sit-down and order. It's always packed, and there's always a line of people getting to-go orders. They have a security guard in the parking lot, usually, so I always feel fine when I go. It's good, old style Americanized Chinese food."], ["Kristin B.", "This Chinese buffet has been around for years and years. It is always busy at lunch time so be warned!"]], "Chans Garden": [["Lauren C.", "The egg rolls and crabmeat and cream cheese wontons are awesome. Favorite dishes are sesame chicken and coconut shrimp. Always fresh and super hot. Everything is made to order so it make take a few minutes, but it's worth it."]], "Rice Delight Carry-Out": [["Duan C.", "Wow! I'm the first one again!!!!!??? Well, where do I begin!? I used to work at a mom and pop warehouse in this area, back in my college days and my boss would go to this place for lunch, because it was cheap - and he would treat me here every once in a while. But when I moved to Northeast Jackson, I just lost touch with the place. However, my buddy stays this way and one night he asked me to take him there because, he claimed, the Hunan Beef was to die for! I always got the chicken tereyaki when I worked out this way . So we went and I ordered the Hunan Beef, my buddy recommended I get it without the brown rice (he said the rice just gets in the way)! I am now officially a junkie for their hunan beef! People I cannot lie, it is in Northwest Jackson, the woman that takes your order is slow, dry and border line rude. The place is a whole in a wall, but when you taste the Hunan Beef, I swear up and down, you forget about all of that! That is really the only thing I order from Rice Delight is the hunan beef, because none of the other asian restaurants in Jackson make it the way they do. Their beef broccoli is not bad, their lo mein is decent, but why even sample the other stuff, when you already know what is the truth. Like I said, they are slow and the location is not the best place - but if you want to see what I am talking about - try the hunan beef from Rice Delight!"], ["Larry E.", "The spicy shrimp fried rice with broccoli was very very good. Not to mention the wings! Great food!"], ["Chad L.", "Well I decided to take Duans advice and try this place out.  I will admit that if I did not work less than 2 miles away I would have never gone.  It is hard to find as there is no sign on the building, only neon lights in the windows which are hard to see during the day.  It is next to the Food Depot and directly behind Sonic.  On to the food!  I chose the D9 off the menu since I, knew I wanted to try the hunen beef.  The lady recommended it since it came with more.  So after waiting about 8 min or so they brought out my food fresh.  I went to pick up the bag and I think it weighed about 10 lbs!  I posted the before and after pics so you can see for yourselves.  The food was very tasty and way to much for one person to eat.  I will be back!"], ["Dawn O.", "Not glamorous location, but food is pretty good. Hubby said it used to have glory days. Not many places cook like they do now a days. I don't eat Chinese often. Give it a try for yourself."], ["Paul H.", "The food was good. They only take cash so leave your debit and credit card behind.  If you know what you want it is better to call ahead.  I will eat there again."]], "Dragon Palace": [["Amy S.", "I had pretty much given up on finding good Chinese food in the Jackson area until I found this place!  This is a prime of example of \"looks can be deceiving.\"  I repeatedly didn't try this restaurant because the outside appearance was not aesthetically pleasing to me.  When I walked in, I was equally unimpressed with the interior of the restaurant.  Then I tried the food and boy oh boy am I glad I decided to finally give it a shot!The buffet is not one of the largest I have encountered; it's actually one of the smallest.  But the items they offer are really, really good!  The sesame chicken is some of the best I have ever had!  Everything I tried was super, super yummy!  It was a good value to at $6.50 for the lunch buffet.Service was wonderful.  My beverage stayed constantly filled and empty plates were removed promptly.  Our server was really sweet and she was all smiles.The interior could definitely use a face-lift.  The booths were torn here and there.  The carpet was worn in places.  But, I was easily able to overlook all of these imperfections because of the tasty goodness of the food!"], ["Kathy T.", "Horrible! All of the food was overcooked and COLD. The dishes were bland and tasteless. The only thing worth eating was the soup.  I definitely  will  not return."], ["Jerry E.", "This place has outstanding food and excellent carry out."], ["Duan C.", "I work out this way and China Buffet was way too busy and I been by this place a few times and just never gave'em a try. I had a taste for some Hot & Sour soup on my lunch break and boy did this little place deliver! The broth was so rich and supple! I mean, I hate to exaggerate, but this is probably the best hot & sour soup I have had out of ALL the Chinese restaurants in the Jackson metro area. I didn't try anything else, but if the rest of the food on the menu is as good as the hot & sour soup, then they are pretty tough! Clean place, the ladies were really nice. They offer lunch and dinner buffet."]], "China Cafe": [["Greg M.", "When we walked in we received a warm greeting with a big smile.  Connie gave great recommendations .  Our food came out hot and quick.  Wonderful place."], ["Big E E.", "Went to this place not knowing what to expect.  To my surprise, place was very clean and good selection of food.   They even deliver!!!"], ["Rachel L.", "I've been here 3 times. The first time they forgot to give me my rice, I had to drive all the way back to get it. Second time they forgot to give me an egg roll with my lunch special. 3rd time I got beef noodle soup. It didn't look like it was pictured, it was bland, overpriced and very unauthentic. They brought it out in a plastic to-go container and gave me a spoon to eat with  my soup?! It was obvious I was dining in! I've tried shrimp and beef in black bean sauce, mangolian beef, cheese won tons and general tsaos chicken. Food is okay, but they charge you restaurant prices when it's just a to go fast food spot."], ["T L.", "My first impression when I went inside for lunch was a little disappointing,  but I've order delivery on Friday and again on Sunday.  I was more than pleased with the portions,  price,  and quality of the food.  Great alternative to pizza!"], ["Adam S.", "Food is always great! For just a couple dollars you can get white meat. Delivery is not bad timing as only takes about 30-40 minutes to get food. I would recommend this place to any one looking for delicious Chinese!"], ["Eric N.", "It's about time we got something other than pizza that delivers!!!  I've placed several delivery orders online and called in a few all for delivery.  Delivery can be slow at times so plan ahead (one time it took 90min). The food has been excellent every time always arriving hot.  Mongolian beef is my favorite.  Also there Thai curries are delicious."], ["Grayson S.", "First time customer and I already have plans of coming back here. Very inviting and the employees were very nice! The food was the best Chinese I have ever had and I left full without having to pay an arm and a leg. I would definitely recommend this restaurant to anybody looking for great Chinese food without leaving your wallet crying."], ["Karen M.", "My order was just as requested. The food was delicious and the timely service was great. Great resturant."], ["Wilson J.", "This is a nice little Chinese restaurant where you can dine in with some friends to enjoy the food and company. Unlike some Chinese places that caters to the take out this little establishment is very clean and the service for dine in is quick. They have tables and booth for dining in. The lighting is very nice. I had the beef udon noodle soup for dinner. This is the first time I had udon in Jackson and the quality of the noodles were in fact very good. The beef was lean and the soup was hot and flavorful. I enjoyed my experience and would definitely come back to try the Basil Tasty. Wish this place would have boba :)"], ["Rose K.", "I absolutely loved the beef and broccoli and sesame chicken. Most Chinese places serve beef like rubber, but it was not the case here. The meat was tender, the broccoli crisp and the sauce savory. The sesame chicken was also tender with little fat. The egg roll was spiced well and tasted pretty good. The only item that lacked was the cream cheese wonton. The cream cheese was a little too sour. Other than that, the food was delectable. I will definitely be back."], ["Joe H.", "Very good food! Friendly and fast service. Simple cafe decor, nothing fancy, but the appetizers, soups, fried rice and main dishes are all good. Nice lunch specials too!"], ["Brian K.", "I have ate at this place 6 times. The food has been good each of the 6 times. In fact the food and service consistency was great the first 4 times. I called in my order 3 of those 4 times and everything was perfect. But the last 2 times when I called my order in it was wrong when I got there to pick it up. I had to wait 15 minutes on both of those visits and she was unapologetic. I noticed that the first few times a older gentleman answered the phone, now a younger female answers it. I will probably stop doing call in orders lol. Hopefully the food stays good and consistent."], ["Jason B.", "I really liked this place.  Had the kung pao Chicken.  The lady was very nice and the food was great.  Went out of their way to deliver to me and really appreciate their service."]], "Wok Togo": [["Minna Z.", "This place is amazing!!! You can not miss this restaurant with their bright flashy lights lining their windows. With such a grand entrance, we just knew the food had to be majestic. We ordered the large General Tso's Chicken and large Szechuan Shrimp. The portions were definitely generous for its price. We managed to get 2 meals out of it and licked the plates clean each time! I will say, their fried rice was a bit questionable and abnormally yellow. Definitely not the best I've had but their food makes up for it. I just drenched the rice in the General Tsos sauce and all was good in the world again. This is a great place for cheap, good quality take out. They have super late hours also if you are craving a 4th meal in the wee hours of the night."], ["Amy S.", "Let me start by saying if this restaurant were in my city, Jacksonville, FL, I'd only give it 3 stars.  But since it's in Jackson, MS and I have had extreme difficulty in finding even decent Chinese food, I give it 4 stars.  Of all the places I have tried, this is the best I have found of the \"takee outee\" variety.  I also added on that extra star b/c the entire city practically shuts down every night at 10pm and this place is open until 11pm Sunday-Thursday and open until Midnight on Friday and Saturday.  HUGE bonus for me since I'm a night owl and often eat dinner after 10pm.  Always the same order:Honey Chicken:  Has a very nice flavour.  The only problem is sometimes the pieces can be rather small, hard, and difficult to chew.Beef Lo Mein:  Good.  Nothing spectacular or out of this world, but they do it well.Fried Rice:  It's fried rice.  I learned a long time ago it truly is possible to mess up fried rice.  They do it right here.Won Ton Soup:  Very good.  I really like the flavour.  Some places make it and it has a greasy aftertaste.  Not the case here.Egg Rolls:  I don't eat them (cabbage and I have a troubled relationship), but hubby gives the 2 thumbs up.I've made the hike all the way from Pearl many nights past 10pm to pick food up from here and when I arrive back in Pearl with it, it's still piping hot.  I usually hop on the interstate at the Airport Road exit and call in my order while I'm driving.  It's always ready as soon as I arrive.  The employees are nice and friendly.The prices are EXTREMELY reasonable.  I wish I could get Chinese food this cheap in FL!!Thank you, Wok Togo, for staying open late to feed us people good food who actually don't go to bed at 10pm."], ["Duan C.", "Wok to Go - pretty much standard fare asian/chinese in an urban neighborhood with a very american/urban menu. But they are the same guys that ran Best Wok, so the food is pretty good, because usually Best Wok wins Chinese restaurant of the year award, every year from the Jackson Free Press. But I like the Mongolian Beef, the Singapore Chow Mei Fun and my fiance loves their Buffalo Wings (The lemon pepper). Their Buffalo Wings are breaded, so its whether you like breaded or the original, if you want to be choicy. Albeit they are breaded they usually have a decent sauce and they have 16 different sauces for the chicken wings. They are open late on Fridays and Saturdays, so that is a definite plus to me, because with this being Jackson, most of your mom and pop locations close by 10:30pm even on Friday and Saturday. About a mile and a half from Interstate 55 and a few minutes from downtown Jackson, right off Meadowbrook in the Fondren area, so its a diverse crowd that comes through. Strictly take out, but they do have a couple of tables if you are headed to the bars or clubs downtown and want to coat you stomach with some cheap grub. Give'em a try and see for yourself, really can't go wrong with this place."]], "Fortune Restaurant & Asian Market": [["Dwight K.", "The most delicious pork belly I've ever had. Flavored with a traditional Chinese five spice. My taste buds are in overload.  This is a dish I could have never imagined. I will have to come back.I don't eat rice, so I asked if they would add broccoli to the dish so I could have some green vegetables. The server would only offer this with the approval of the chef. They wanted to ensure that the dish would be delicious and that the broccoli would not interfere with the flavor of the dish. No problems here, they made sure that this was a wonderful culinary experience."], ["Tiffany N.", "If I did this four months ago it'd be five stars hands down. Warning: LONG but thorough review below!Why three stars? Recently the prices have gone up. Not just a few cents...literally a dollar and up, effective in like March or April. I found this to be a bit random and unappealing to my wallet lol. I think, why would I pay 11 dollars for a meal when I can get the same meal three miles away at Mr. Chen's for 9? The prices are not competitive at all. The food is still good, but some of the dishes like the Kung Pao aren't worth the price. I do absolutely love the General Tso's chicken, curry chicken, the spring rolls, and their hot and sour soup. Very delicious! I'm interested to try more dishes but, once again, those prices thoooo. Also, the service. It all depends on who helps you. There's a nice guy that's there sometimes and then there's other people who are kind of rude. The last time I went to pick up a to-go order, I wasn't greeted by the girl checking me out, she seemed like she didn't want to be bothered, I didn't get a thank you (even though I said thank you) or a you're welcome. Nothing. I just spent $11 on some chicken and rice dude. I'm not a person who feels entitled. I say thank you whenever I go and eat somewhere regardless, but the rudeness did take me back a bit. Not cool. A little kindness and customer service goes a long way. Big turn off. One more thing, I bought some refrigerated jackfruit in a container from here. I was super excited about it since Ive never tried it before and heard great things. I get home and taste it and omg it was crazy crunchy and it smelled like ass. Lol. It doesn't look like it's bad. I'm honestly researching if it's still edible because I hate wasting money. Maybe it can be smoothied? Hmmm lol is it worth it? We'll see! Oh, more bad service from the market cashier. Said nothing the whole time. Except the price; does that count? LolI'm honestly not trying to rag on this place. I'm just saying that, compared to the first few months of it opening (which is still quite recent) everything was much better in terms of prices and service. I will probably be back for the soup and maybe the curry, but everything else is just not worth it to me for the price. Maybe if other aspects were good, I'd overlook the prices like I do other restaurants but nah I'm going to move on. I don't want to discourage you from trying this place out. There are a lot of great things about it. If you can afford to, try it out! Also, I think they have a lunch menu that could accommodate more budgets. I'm not sure TBH. The store inside has many yummy and affordable items from Asia. They have interesting things to buy and fresh seafood. They also have a small selection of produce including big mangoes--YUM. But, if you're getting fruit out of the refrigerator, ask if it's ok to open the container and check it out. If it smells like ass, you must pass. But, yeah, that's why I have it three stars. Maybe you'll give them five."], ["Thuy T.", "I really enjoyed their new menu, lots of authentic Chinese dishes. Service was fast and efficient. Will come back again."], ["Ray S.", "The food was greasy and without flavor. We got the steam buns, pot stickers, and the Mongolian chicken. We were not impressed, and will not be returning."], ["Bill L.", "Great food, you truly get your money's worth here. Grocery side has unique/authentic Chinese food. Fresh fish, lobster, squid, claims, shrimp and more."], ["Augustus A.", "Me and my date had a good experience trying new dishes at Fortune. I went out on a lib and tried the Beef Yat Gaw Mein while my date had the Lobster in Ginger sauce.  Both dishes looked fresh and delicious. The Yat was served in a large bowl filled with bok Choy, sliced beef, bean sprouts, rice noodles and cilantro, all swimming in a delicious broth. The lobster dish was impressive because it was made with real lobster.  Great place to try new dishes without breaking the bank."], ["Christina K.", "The food was delicious. The Mongolian beef was actually spicy, as was the double spicy chicken. You get a good amount of food for an inexpensive price. The pork dumplings were amazing as well. Overall I would come here again."], ["Kevin S.", "Fortune is the new go to Chinese spot in town. The food is excellent with a broad menu, quick service, and an affordable bill. Plus, pickled vegetables came out as an appetizer and fresh watermelon for dessert!"], ["Thomas G.", "There are boxes to check when finding the perfect Chinese food. Good food? Check. Good service (including good English)? Check. Good prices? Check. (Double check!$$$) Clean? Check. This is my wife and my new go to Chinese joint. Will be a regular here."]], "Ding How Asian Bistro": [["Sean T.", "Great food, friendly staff, reasonably priced. At first glance it looks like a small hole in the wall, but opens up to a clean and pleasant venue. The menu is large enough to accommodate the even the most pickiest of eaters, even offering chicken nuggets and burgers for kids. I ordered the Bistro Orange Chicken and regrettably only ordered one plate...needless to say, it was great!"], ["Crystal S.", "Small place, very friendly, and great for take out. We had the fried calamari, hot and sour soup, which I could have just had that because it was Delicious. I also got the seafood feast with lobster meat, scallops, shrimp, and squid with vegetables in chefs special sauce. It was good, sauce was a little watery for me but the flavor was good. Can't wait to go back and try something else. There were so many things to choose from on the menu.  My little boy had the chicken teryriaki and it was so much food for 6.95 he couldn't finish, which is unusual! Overall great experience"], ["Gar M.", "Good food but expensive for what you get.  The menu is much more expensive than the ones posted online.  They seek to go upscale but are nothing special."], ["Andy C.", "Surprised there aren't more reviews. Food is great. I got the hot pepper chicken. Friendly staff"], ["alysia f.", "Really great food. Was passing through in business and yelped a close Asian restaurant. Read a few reviews and chose this over the local PF Changs; I'm so glad I did. Being a Sunday night, it was pretty quiet but service was top notch. Very attentive manager and server who checked in often. Enjoyed everything I had and the dinner entree came with a salad and soup for a great price. May have to come back here before I leave to buy a bottle of the house ginger dragon sauce."], ["B B.", "This is the best Chinese food in Jackson, It is clean fresh and delicious.Don't let the old Ding How that was on I-55 scare you off.   Trust me, it is not the same place.Staff are polite and attentive,  Food is outstanding and happy hour too."], ["Sarah L.", "This place has excellent food! Everything is authentic with obvious fresh ingredients. hot and sour soup is so full of flavor. Even the steamed rice is flavorful. Service is exceptional! I am so glad we stopped in to give this place a try. I am actually a little surprised there aren't many reviews. Give this place a try and you won't regret it!"], ["Newly P.", "Very friendly owner. Got takeout: Kung pao chicken and satay and it was perfect. The Kung pao came with soup and rice and was very filling."], ["Duan C.", "I can't believe I'm the first one doing the review on this place and Herm S. is the one that put me on to it!? lol!!! Go figure!Overall, it is the same family that owned the Ding How Buffet on I-55, but after that, they relocated to Old Canton, in a smaller place. Actually it is the old Good Time Deli or Sammy's location.We got take out, we ordered Chicken Singapore Mei Fun, Vegetarian Noodle Soup, and Beef Broccoli.The Singapore Mei Fun and Beef Broccoli were excellent. Portions could have been better, I was really disappointed with the portions. The only downer was my Vegetarian Noodle Soup. I keep looking for someone that can give me a soup like Saigon on Lakeland! No one in the metro area, does a better noodle soup. I gave Ding How a try, but Saigon still holds the crown for asian soups in Jackson, Mississippi.Very clean location, staff was nice, food was good, besides the noodle soup. Other than that, we will return to give them more business in the future."], ["David G.", "Excellent Chinese food!  Visiting here from Philadelphia, and this place I would visit often if it was located where I live.  No MSG, authentic flavors, very polite and caring staff.  Can't miss."], ["Michelle C.", "My husband and I love Ding How! Food is always on point. Dinner entrees come with choice of soup (egg drop is out of this world good) and salad with a homemade ginger dressing. And the entrees are huge! I usually have enough for lunch the next day. Service is always awesome. Very polite servers. We like the gyoza as an app or the cheese wontons. Always a good choice for dinner or lunch. Even my mom was satisfied (she's hard to please sometimes ;) )"], ["Alexis B.", "This is the BEST Chinese food in the Jackson metro!  No buffet just fresh, delicious made to order dishes.  Generous portions, egg drop soup -very traditional flavor and small salad - just iceberg and thousand island type dressing, too.  The service is great - they are very nice here. The place is clean and comfortable. I was surprised to be the only table there at lunch but I'm here to spread the word.  They do great take-out and so convenient to just hop in and pick up my phone order.  My husband likes the beer selection and he tends to be picky about that.  Mongolian Beef was superb (makes PF's taste like frozen food) and the Kung Pao is great, too.  Not too hot but just the right spice.  The fried rice and steamed rice are both cooked perfectly - we splurged and did the fried wonton app - soo creamy and good but made it hard to finish lunch...will be back and will bring friends!"], ["Tom R.", "What's in a name? Well...quite a lot. I avoided this place from the start simply because of the name. I had more than one bad experience with the old Ding How on I-55 and figured this was just another incarnation of a Chinese buffet slop-house. I was wrong. It's the same family, but a totally different ethos.This is good food. This is real food. This is food made by people who care about ingredients, tradition and quality. I've dined her for lunch, dinner and Sunday dim sum and I've never been even close to dissatisfied. Actually, I've been pleased with each and every experience. The fried whole fish is a real treat and is made in a very difficult way that takes more explanation than I have room for here, but take my word...it's fantastic.The Saturday and Sunday dim sum menu is expansive and well thought out. Outside of NYC, I've never had chicken feet and duck feet that were better. So put away any preconceived notions you might have arising from the unfortunate name choice and give Ding How a try. Once you've had real Asian food, you'll start wincing when you pass one of those buffet joints.Bon Appetit! - Tom"], ["Chad S.", "NO BUFFET !! REAL FOOD HERE !!Great daily lunch special....try the Bourbon Chicken :)"], ["Dee K.", "It's not a classy place.... It's not a preppy place. It's down home easy get in easy get out, no frills attached Good Food. Cheap with good quantities nice Chinese Thai place. I go there at least 3-4 times a month. If you are hungry and don't want to impress any one but just eat and sip a wine or a beer.... Then friends this is the place to go."], ["Shaurita H.", "Very relaxing atmosphere. It has a full bar as well. The servers were attentive and helpful. The food was fresh, well-cooked, and seasoned to perfection. The prices varied. The presentation of the food was modern. Overall, I'd give it a B+. I wasn't too thrilled with the balloons hanging from the ceiling."], ["Herman S.", "hey Duan C, I appreciate the shout out. The lunches are smaller portions, but pretty cheap, so it's a good way to try the menu out (order 2 of 'em at a time). On Sat & Sundays native asians come in for the dim sum brunch/lunch (which is always a good sign of authenticity). If you like Dim Sum they are getting pretty nice crowds on the weekends. They roll the carts table to table, show you the dishes and you take it if you want. They have large 7-8 person round tables with lazy suzans to go family style on your dishes, which is like your own family buffet really. Everybody gets a little of each dish they want.  All the food is very fresh and healthy tasting. No MSG, low oil, not even any Soy Sauce on the table. If you ask for Soy Sauce they'll bring you the low sodium kind. They are aiming for healthier, fresher Chinese.The Bourbon chicken is not bad for dark meat. The Kung Po & Hot Pepper Chicken is decent too. Good tempura. One of the best things I've had is the Lemon Chicken and I don't use the lemon sauce that comes on the side but ask for one of their 58 sauces. They offer an \"8 fruit sauce\" which is a yogurt-ry sauce made from 8 fruits. Your choice of soups are \"Spicy\" or \"Not-Spicy\". Rather than just chinese they have a few dishes from Thailand, Japan, Malaysia, Korea & Singapore. It's not a true \"Asian Fusion\" place like Pan Asia tries to be, but they have fresh options worth exploring."], ["Big C.", "The dim sum is exciting, especially the chance to eat chicken feet, which I don't think you can do anywhere else in Jackson. They only serve the dim sum on weekends, though. My wife says that she thought the woman managing the cart was pushy. I was good with it, though. Be careful, because like ordering sushi, you can very quickly pile up a sizeable tab ordering dim sum plates."], ["cheryl w.", "Have seen this place in passing but just got around to stopping in - and glad we did.  What a surprise....the exterior does not even hint as to the nice, minimalist, white tablecloth dining atmosphere.  But that wasn't the only surprise - the food was really good.   We had an appetizer - crab  wontons - and they were delicate, tasty and just delicious.  Our entrees came with soup (we choose egg drop) and salad.  The egg drop soup was probably the best we've had with a nice broth base - not the typical starchy, sticky liquid often served elsewhere.  The salad was simple with a very tasty dressing that we both enjoyed.  We shared a combination fried rice (beef,chicken & shrimp) with our entrees, but I could have made a meal off of just it.  However, if I had, I would have missed out on the wonderful lemon chicken.  My husband had the hibachi steak and was very pleased as well - which is no small feat.  Needless to say, we walked out with to go boxes, but were happy at the prospect of revisiting the tasty meal.  Service was attentive and friendly as well.  This find was just in time -- my husband and I had almost given up on good Chinese food in the area.  We will be back....soon!"]], "China Belle": [["Kristin B.", "This is one of your average Chinese buffet type places, and not too bad I suppose but not my favorite.They DO offer Korean style BBQ though, which sets them apart from the run of the mill super buffets Jackson is full of."], ["Big F.", "YuckNothing on this buffet is edible. Worst food in the city of Jackson. Just awful."], ["Connie M.", "Dinner buffet was not fresh. They had no rice, lo mien noodles . No ice in refill drinks. A bologna sandwich would have been worth the 29.00 dinner cost."], ["Augustus A.", "I was just went in for lunch and was at the buffet when I saw a roach crawling on the bar. I felt Like I was going to lose my lunch and I did not have it yet.  So not going back!"], ["Carl J.", "i like there..  the food is fresh,i like the sushi and bbq..  that is my favorite."], ["Duan C.", "I am with Kristen B - the Korean BBQ is what definately sets China Belle apart from the many, many chinese restaurants in Jackson! God there is a lot of them."], ["Llecram P.", "This is your average Chinese buffet. The food is really good and the sushi is a bit dry and flavorless. The pineapple steak tray which has a pineapple on it is not good because the pineapple tastes like it's flavorless and steak is well done. When I mean well done, it is overcooked. I am not even sure why it's called \"well done.\" The big downside is that it is expensive about $15 per a person. Also the waiter who led us to our table was dressed not very professionally. He was wearing a t-shirt and shorts."], ["Jennifer C.", "Not that great, but I have yet to find a great chines restaurant in jackson. so if you want chinese come here bc you won't find that much better anywhere else around here."], ["Tracey W.", "I have eaten here several times and will again . My daughters love eating here. Buffet with large selection . Food is fresh !  Good price for quality buffet !"]], "Kamloon Chinese Restaurant": [["Leslie A.", "Every time I visit the place this food is yummy!If you're looking for a place to grab a quick bite on your lunch break, this it the spot. The sweet and sour chicken with fried rice and two egg rolls is alway the way to go if your looking for something filling!"], ["Tiffany N.", "Meh. The have bad customer service. I was on the phone ordering and while asking her how long it would be, she cut me off and said five minutes. I kinda brushed it off because it was around lunchtime and figured hey they're busy, no prob. I get there and the service is even worse. Service is big for me. There was only one other person in there waiting, but the girlbehind the counter rushed me. She had THE worst sourpuss attitude. Kept rolling her eyes and obviously hated her job. I don't know what her problem was. The only way I can explain the service of this restaurant is that they *know* the customers love the food, they *know* customers will come back, they *know* they be busy around lunch, so service doesn't matter. They're not doing me a favor by taking my six dollars lol. I'd rather pay more for respect and decency. I haven't even talked about the food yet lolI got general tso's chicken after reading another review. I saw the buffet when I came  and that looked good as well. My food was ok. It reminded me of good mall chinese food. It wasn't the best at all. I've had much better at Hunan Wok, Mr. Chens, and Fortune (and better service too. Ok I'm done). The price is cheaper than all of the above, but you get what you pay for. I may or may not go back to try the sweet and sour chicken. I don't know. But this place is not even on my top ten. Go to Hunan Wok or Mr. Chens. Just my opinion."], ["Ann C.", "Service is meh. The restaurant is kind of dirty.  Food didn't taste fresh. general Tso chicken tasted frozen.  Pork fried rice was over cooked and not the freshest.  lo mein was okay. Overall it was expensive and not so good."], ["Coral E.", "Just thought I'd say that Kamloon is still my favorite pick-up chinese place in the Ridgeland area.  I have recently branched out and tried some others, but that was a mistake!"], ["J O.", "Fast, cheap Chinese food to go. Same menu as Best Wok.Better than what you would get at a Chinese buffet and usually ready in 5-10 minutes. We always have left overs from the combination dinner plates."]], "Mr Chen's Authentic Chinese Cooking": [["Kristin B.", "I can't believe I've been eating at Mr. Chen's for years, and never left a review!I and several friends have been shopping and eating in Mr Chen's grocery store/ restaurant since they very first opened. Since then, it's only improved as inventory has grown and the restaurant has been renovated. First off: I LOVE the lazy susan tables that encourage family style dining for groups. This lets everyone try each dish without being unsanitary, and each diner still has their own plate to eat from.Service: Always great, even during busy hours. I've always been seated promptly (even our large groups at the lazy susan tables) and had our orders taken in a timely manner. Dishes come out hot and drinks get plentiful refills.As to the food - I've tried MANY of their dishes and haven't had a bad pick yet. The seafood is often fresh from their tanks in the back - whole stone fish steamed in aromatic herbs has been hands down one of the best specials I've tried.The sauteed sweetpea leaves are a vegetable side that our table always gets.As to their regular dishes, I'd recommend several. The Crazy Chicken, a house special, is small fried chicken and tofu pieces with a little pepper kick. The Mapo Tofu dish is always well seasoned and warm. And their hot pot plates are all good. I personally love the pork and basil hot pot but continue to try them all.Even their regular items that you'll find at any Chinese takeout in town - sweet and sour chicken, fried rice, crab rangoon, etc - are on point.Sometimes jellyfish, conch, and other delicacies are available. Our waitresses have been skeptical in the past that we'd like them, but we try them all happily. Also - if you like a dish mild or spicy, let them know and the cooks will work with your request.Five stars, will continue to come again and again."], ["Laurie T.", "I can't believe people wrote and said this is \"the best\" Chinese restaurant. I think you are mistaking \"best\" for \"ONLY.\" It was my first Friday here in Jackson after a long time away from home, and I decided to treat myself out to lunch. I wanted Asian food because I missed home (basically, I missed rice). I looked up on Yelp! that Mr. Chen's was good and decide to make the trip up from Downtown.I have been to the grocery store before, but this was my first time noticing that there is a restaurant right next door. The people spoke some sort of Chinese (I believe Taiwanese) so I was getting super excited to be in the same room as people who look like me. They handed me a menu and for lunch it was cheap- an entree with a side and egg roll, so I ordered Sesame Chicken. Yum! I even ordered myself a milk tea while I was at it because I was going to savor all of the Asian as I can possibly get before I leave. The milk tea was the first to arrive and it was... bland. There was an odd powdery texture that I wasn't a fan of and I've had bubble tea from places made of power before so I forgave them for that. But my milk tea was warm and there was no ice in there, and the flavor was awful. Alright- well, not everyone can make milk tea. Then comes the food. The fried rice was alright. The rice was cooked well and at that point I had missed fried rice so much I didn't mind. However, I took a bite of a pea and I was yet again heartbroken. It was probably frozen and it seems as if they left the pea out to thaw and added it into the mixture last minute. The veggies were hard yet falling apart at the same. That wasn't cool. I took a bite out of the egg roll and it was the first and last bite I took of that thing. It was probably another frozen thing, who knows? I don't actually have an excuse for it- the veggies were sour and it tasted like dish soap.The chicken was the only saving part of my meal, but even that wasn't so great. The sauce was basically sweet and sour sauce with sesame on top. There was a good amount of chicken, so I was thankful for that, but there was even a larger amount of sauce on it. Basically with every other bite of chicken I was taking in either the rice (without veggies) or drinking the awful milk tea to balance it out.I brought my milk tea back to the office with me but it sat on my desk for the rest of the day until I threw it out. Thankfully that weekend my roommate and I went to Panda Express in Flowood and my love of Chinese food has been restored. (Edit: This is a joke! Will never hate Chinese food, just the way Mississippi makes it)TL;DR: Go to Panda Express if you want Chinese food (and milk tea)."], ["Jeff B.", "Such a love fest of 4 and 5 star reviews, but I'm going to buck the trend. My family shared general tsos chicken and vegetable lo mein. We found the general tsis flavoring to be less intense, lead flavorful, more vinegary than we were used to. The lo mein was also just meh.Our favorite for take out Chinese in the area in Kam Loon in Ridgeland."], ["Jonna B.", "Located inside a supermarket, Mr. Chen's isn't exactly the place you'd look for great Chinese food. The smell of fish tends to drift in the restaurant from the supermarket, but that's really the only con. The food is fresh and amazing, and their bubble tea is excellent. We've never had to wait (though the restaurant is always full) and service is fast."], ["Jeana S.", "Mr. Chen's is probably the most authentic Chinese food you'll find in Mississippi! I've been here numerous times and tried a variety of items on the menu, and they were all delicious. I especially love their Bubble Tea! No one in the area even comes close to comparing with ether tea. They're menu is also MASSIVE, so everyone can find something they like. The restaurant also has a grocery store attached with lots of great meat, produce, candy, and other items. I have to force myself to avoid the sweets aisle every time I visit! The Green Tea Swiss Rolls are fantastic.The only downside is that the smell of the seafood from the grocery side can drift into the restaurant which makes eating a little awkward. This is fairly rare though, so I highly recommend you to try this!"], ["Cheska W.", "I absolutely have to review Mr. Chen's. If you are looking for junkie chinese food, this may not be your spot as they have little junkie selections. This is more of a fancy/authentic chinese place without the expensive price. You MUST try the Wonton soup if you like a light broth with tasty veggies and dumplings. A very unique and healthy take on wonton soup. Black Bean ANYTHING. The beef is my favorite but shrimp/chicken is good as well. I think this is their best sauce. Tons of fish, duck, and \"funky parts of the animal\" offerings. You've got to try it!Also, this is in the asian supermarket. Take a swing through it when your done! They literally have everything you need to make asian cuisine."], ["Minna Z.", "Definitely one of the best Chinese restaurants in the area. My boyfriend and I order take out from here on a weekly basis. We always get the General Tsos Chicken. It is the BEST General Tsos that I have ever had. It's got jusssst the right amount of kick to it without being too overwhelming. Their dinner portion is huge. One order usually feeds both of us, and sometimes, we even have enough for lunch the next day. Also, if you have never tried bubble tea before, I HIGHLY recommend trying their milk bubble tea. Its basically like an iced coffee, but with tea and a unique twist to it. It is delicious and you will not regret it."], ["Cody M.", "Definitely one of the best, if not the best, Chinese restaurants in the Jackson area (and all of MS for that matter). Contrary to a lot of Chinese food in the south, the chicken and food in general is in no way sketchy, and is in fact absolutely delicious. The chicken is very well cooked whether it's with General Tso's, sesame, sweet and sour, or kung pao sauce. It's very well priced, and is an awesome take-out option. Included in the store is the best Chinese grocery in the state that I know of, with everything from fresh produce to all the rice and noodles you can imagine. This is a top spot in Jackson, for sure."], ["Matt H.", "This has a solid shot at being the best Chinese restaurant in the Jackson area. Based on the clientele and some of the other dishes I saw on tables, I expect that this is more \"authentic\" Chinese food than most others.For starters, this is not a buffet. You order from the menu which is quite lengthy. I think anyone should be able to find something to suit their tastes. I've had the Crazy Spicy Chicken, which is good, but not particularly spicy. I've also had the Orange Chicken which is very tasty. My daughter had the Rosemary Chicken, which was an impressive and very good dish served in a small cast iron kettle.The one down side would be the um...aromas that are often present from the seafood section of the \"Oriental Market\" that is in the same building. (By the way, I thought that Asians were offended by the term Oriental. Perhaps that is something created by uptight white people?) At any rate, I have been there once when something had obviously gone bad in the seafood section of the market, not the restaurant. I could barely enter the building and chose not to stay on that trip!If that is not the case when you go (and it has been on only one occasion for me) take the time to stroll through the market. You may find something you have to try!"], ["Chris K.", "By far one of the best Chinese restaurants around. The grocery is super cool too. Authentic and amazing! My kids love the Mango slushes!!  They do not have a bad thing on the menu, it is all good. My favorites are the basil chicken, kung pao chicken,  cilantro pork bellies and fried dumplings. My kids always get the sesame chicken and share it; they always have left overs - portions are generous!They also have a location in Little Rock, that is just as good!If you are in jackson or any town with a Mr. Chen's it is a MUST GO!!"], ["Lloyd F.", "Quite pleased w/ my first visit. Arrived and ordered from Lunch Special menu. Prices are reasonable as are portions. Dining room is large and well ventilated. There is also Asian grocery attached in back of store. Staff are attentive and pleasant. I plan on returning."], ["Annie B.", "I was not expecting to be able to get such tasty Chinese food when I moved to Jackson, but I have been very pleasantly surprised by Mr. Chen's. I have eaten here probably five times in the past 11 months, which is a lot of times to go to one restaurant for me!I always get the mapo tofu and the stir fried green beans, which are awesome and Szechuan style. Since I'm a vegetarian, I just ask them to leave out the meat on both entrees. Both are super tasty and comparable to Szechuan style Chinese food I used to get in Washington DC before moving to Jackson.Highly recommended for tasty vegetarian food!"], ["Sam L.", "What happened to their food? It used to be well seasoned, taste fresh, flavorful, and decent portions. Now, the dishes are smaller and too salty. The Sweet Shrimp dish had half the amount of shrimp, the batter was soggy, and the pineapple dry. The eggplant and pork pot dish was overlooked and had too much soy sauce and not enough sugar to cut through salt."], ["Michael D.", "Awesome! Reminds me of authentic Los Angeles asian cuisine. I highly recommend General Tso Chicken it's amazing! Definitely a gem and must see!"], ["Kyrtin K.", "Mr Chen's is probably the single best Chinese restaurant within 100 miles of Jackson, if not more. The food is exceptional, and the price point isn't a dollar higher than any of the barely-edible alternatives, and in fact is slightly cheaper than several local Chinese Buffets. The portions are also quite acceptable, even by my high standards. I am full by the end of a meal, and my wife comes away with enough leftovers to cover a second meal for herself. This is one of only a half dozen restaurants I'd pick to take someone visiting Jackson to eat out at."], ["Grace B.", "Mr. Chen's may be a little sketchy from the outside, but the food is unbeatable. I enjoyed the lunch Moo goo gui pan and it was incredible. Can't wait to eat there again and again."], ["Ian W.", "This is by far the best and most authentic Chinese food in the Jackson area. They are located in an Oriental Market, so they have access to a lot food and drinks that just don't appear at other restaurants. Their Taro milk tea is delicious, well worth checking out if you want something other than the normal fair. When visiting, please don't go with the normal 'Americanized' dishes, try out something that is authentic and not something you can find at a Chinese buffet."], ["Calvin M.", "This is the most authentic Chinese food on Jackson MS. The spicy beef noodle soup is almost as good as those in Los Angeles. They also have dishes that are Americanized. This is the place to be for Chinese food. And some grocery shopping after the meal."], ["Alex Z.", "This place is inside an Asian food market to the left as you walk in.  The food is super reasonably priced and has been really good every time I've been there.  The strip-center is sketchy as can be, but the food is always great. Looks can be deceiving and this place is brick and mortar proof of it."], ["Clyde S.", "The food was great I had the general toes chicken it crisp not hard and it had one of the best sauces for general toes chicken I've had in a long time for lunch the price was great I'm going to come eat there soon can't wait to go back I'm getting hungry just writing this"], ["Kayla R.", "Ok. So, yes, once we found a used condom in the parking lot. Yes, it doesn't look like much from the outside. But, guys, this food is great. Once you walk in, on your right you find an Asian market, and on the left is a cozy dining area. They just remodeled and it looks really nice. It's served family style. And the prices are very reasonable. You could easily share one dish between two people. But where's the fun in that? I love going in groups and ordering a bunch of different entrees and sharing. Plus, there's tons of variety. And the food is tasty. Seaweed salad is generous in taste and portion. I you like sweet, the pineapple shrimp is good. Mongolian beef is good, as well. If you like spicy, they got it! And it's marked. Bottom line: best Chinese food in Jackson!"], ["Scott B.", "Driving through from Houston and read the yelp reviews.  This is a dimond in the rough. dont let the parking lot or first step into the store scare you away.  the food is amazing, the servers are very nice.  i'd stop here again without hesitation."], ["Courtney C.", "Favorite place in Jackson so far. Been there twice and looking forward to going back. Spicy fried squid is amazing. The stew-like meals can serve two. The attached supermarket is big and has everything you can imagine. It reminded me of Chinatown in London. They do take out too."], ["Brandon T.", "Great quality of food and taste! I love that they have roast duck constantly! The restaurant is connected to the grocery store and this is the best asian grocery store I've been to in Mississippi!"], ["Heather F.", "This is my favorite Chinese restaurant in Jackson. One of my friends dubbed it 'Flavor Town' and we try to go as often as we can. Since I moved to ATL that hasn't happened often, but I visit every time I return, both the grocery and the restaurant. It is definitely the best Chinese place in Jackson , hands down. It is not your typical Chinese place. There are no buffets, but each portion is family sized, even their soups. They also have filling lunch specials for a good price. This is a quaint place inside a grocery store. So, don't expect table clothes and a 'fine dining' experience. However, the food is amazing and the place is clean. My favorites are Kung Pao Shrimp, Wonton Soup, and Sweet Pea Leaves. The best thing and what makes it unique is the vast Asian grocery store that the restaurant is in. We eat here all the time when we need to pick up something from the Asian Grocery. They have great prices in the grocery store too. Some things we pick up there regularly are Baby Bok Choy, tofu , gyoza, wonton wrappers, etc."], ["Anna W.", "Truly legit Chinese food. They're attached to a market. The snow pea tips were great. Would not have ever expected this place in Mississippi... Great remodel to the restaurant area."], ["Craig T.", "Mr. Chen's is among the two best Chinese food places that I have found in Jackson (the other being China Express Kitchen in nearby suburb Clinton).  The level of cuisine is much better than the average strip mall Chinese buffet.When you walk in the front door, you have stepped into a very large Chinese grocery store with all of its inherent smells of fresh fish and mind-boggling assortment of specialty Asian products at rock-bottom prices.  Need Soba noodles for a recipe?  Get them here for a third of what you will pay at Kroger.  My kids love walking around the store and just looking at stuff.Directly to the left as you enter, you will find the dining room.  Nothing fancy or special here.  The menu has a lot of dished on it that include lots of things you don't find at other Chinese restaurants.  You'll could eat here every day for months and not repeat yourself.  (I don't really recommend that, though.)  I haven't had a bad dish here yet.The lunch special is especially great.  For about $7, you get an entree, a couple of dumplings, and a large scoop of fried rice.  Great deal!As a tip, the dinner entrees are enough for at least three people, maybe four, if you get an extra order of rice.  A family of four can easily dine on an appetizer of dumplings, an entree, and some extra rice, and all for about $20."], ["Katherine B.", "This was the smelliest most disgusting place and I don't see how anyone can eat here."], ["Jon M.", "Passing through Jackson and popped on Yelp to find a nearby restaurant with good ratings.  The staff was amazing and on the ball!  Our toddler age daughter tripped and fell in the parking lot and our server was so kind to try and make her smile and feel better.  The food was great and plentiful just like so many of the reviews have said.  Our waitress made sure we were well taken care of and other staff members popped by often to make sure we were taken care of as well.  Looking around at what others were eating made me wish we were a bit more adventuresome with our food selections because it all looked great!  We had the pan-fried dumplings, sweet and sour chicken, and sesame chicken.  Our kids loved the dumplings which were some of the best I have ever had.  My wife and I could have shared one of the entrees but it was nice to try a few different items.  Serving sizes are HUGE.  We also had a mango smoothie and a peach flower smoothie and both were excellent.  The store makes for a fun after dinner stroll."], ["Zachary B.", "I. Love. Mr. Chen's. It is by far the best authentic Chinese restaurant and grocery store in Jackson. Sure, it's the only one, but that doesn't diminish its quality. The food is excellent, made fresh, and handled by friendly staff. We moved away from Mississippi and miss this place so much."], ["Steve S.", "Some of the best wonton soup I've had. Very authentic food."], ["Count D.", "The reviews of this place told me if I want Chinese food, gotta go to Mr. Chen's. Glad I did, the meal was overall tasty and satisfying.Thankfully the pictures on Yelp were a good guide to what it looks like from the outside. Went in, sat down, started looking at a menu quickly. Staff was friendly, nice, well-dressed and well-mannered. Got my drink order and left me to myself.I desired something with good vegetabls (carrots, sugar peas or snap peas, broccoli, baby corn, etc) and chicken, but when I saw Crazy Spicy chicken and the photo from Yelp, had to go for it. Although tasty, a little underwhelming. The pictures on here definitely are representative, but I would not call it \"crazy spicy\". It was basically small popcorn chicken-like pieces coated with lots of black pepper and tossed with various peppers. No other vegetables! I was tempted to just order a side of vegetables but in the end figured I'd save it for a return trip.Also got a tapioca milk tea on the side. Been a minute since I had a bubble tea :)Overall good place for a Chinese food fix. Kind of far from me so I'm not sure how willing I will be for repeat visits, but worth it nonetheless."], ["Jay L.", "Best chinese in the area.  Not your typical buffet, but a plate lunch that is satisfying and very good.  I highly recommend the Mongolian Beef.  Cooked perfectly and spiced perfectly.The crab wonton appetizer is good, but you get plenty of them to eat!I highly recommend Mr. Chen's.  Fresh, good, delicious food.  That's all you need to know."], ["Stephanie B.", "DELICIOUS! Easily the best Chinese food I've ever had. I LOVE this food and the grocery store is fantastic. Very friendly people."], ["Patrick R.", "Best Chinese food in Jackson.  Saw the reviews on here and thought I would try it.   The food was awesome!  You may not think that when you drive up, but looks can be deceiving."], ["lars h.", "We did not have high expectations. We were on our way home to Florida, and felt like Chinese, and luck and behold for yelp. We were just outside Jackson, and found Mr Chen's.It was were good with very reasonable prices. Service was impeccable, and it was a great experience. We would be back in a heartbeat, if we are around. Loved it."], ["Mayra G.", "This is one of the best Chinese restaurants!! Great food and the employees are very nice."], ["Kennan O.", "I think I'm going to be the only review that doesn't rave about this place. I've lived in a number of cities and know how hard it is to find good food. My mouth salivated at the thought of Mr. Chen's food. I was so disappointed. As I write this review I feel myself getting sick from the pineapple shrimp and shrimp fried rice I ordered. The egg rolls weren't bad. They were a dollar apiece and I saw why. They were small.  I'm not going back."], ["Luana C.", "Mr. Chen's is the best Chinese restaurant in MS! Whenever my friends bring Mr. Chen's to dinner parties, everyone always enjoys the food! I particularly like their fish with black bean sauce and Taiwanese stir fried rice noodle. My Chinese and Taiwanese friends all agree this is the most authentic Chinese cooking you'll find around the area!"], ["Jason B.", "Excellent Chinese food in the area.  My kung pao chicken was great fast service."], ["R P.", "Best Chinese for miles around! There is no buffet that attracts the riff-raff. Meals are cooked to order so it will take a little while to prepare, but the food is hot and very good. The service is top-notch as well. In my opinion, there is no need to go anywhere else for Chinese!"], ["Mike K.", "The Crazy Spicy Chicken was very tasty. A dry rub type meal with peppers and other veggies. Will definitely go back again now that i have found a good Chinese restaurant in Jackson."], ["Orlean S.", "A very nice experience. Decent chinese is hard to come by in Jackson. Service was exceptional. Wanton soup was good (enough for 2). Egg rolls were tasty. Triple Delight was nice, but low on sauce and vegetable variety.Fairly large Chinese market is inside with life seafood. The market is larger than the restaurant."], ["Meosha R.", "ok..Yes, Chens have good food. The service is really biased. If you look a certain way then you get excellent service, if not the service sucks. I am an african american lady and each time I go the service for my colleagues and I is horrible:("]]}